[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDcvdGhlLWJpdGNvaW4td2hpdGUtcGFwZXItaGFzLWJlZW4taGlkZGVuLW9uLW1hY3Mtc2luY2UtMjAxOC1oZXJlcy1ob3ctdG8tZmluZC1pdC_SAXpodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA0LzA3L3RoZS1iaXRjb2luLXdoaXRlLXBhcGVyLWhhcy1iZWVuLWhpZGRlbi1vbi1tYWNzLXNpbmNlLTIwMTgtaGVyZXMtaG93LXRvLWZpbmQtaXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "The Bitcoin white paper has been hidden on Macs since 2018. Here’s how to find it - Fortune",
        "content": "On every Mac operating system post 2018, a nine-page PDF is hidden inside a nest of folders. That PDF is none other than the Bitcoin white paper, the famed theoretical outline of the cryptocurrency authored by Satoshi Nakamoto, Bitcoin’s anonymous inventor.\n\nOn Wednesday, Andy Baio, former CTO of Kickstarter, was the first to publicly announce that he had found the squirreled-away PDF after he tried to connect a combination printer-scanner to his MacBook.\n\n“I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them,” he wrote on his more than two decades old blog. He thinks the white paper’s inclusion was the work of a single engineer, rather than an Easter egg ordained from on high.\n\nWhile Baio has been a techie for decades, it’s relatively simple to find the same document on your very own Mac. Here’s how:\n\nUsing Terminal\n\nEvery iteration of the Mac operating system has what’s called Terminal, or a way to explore a computer’s file system through text commands. To access Terminal on your Mac, simply go to the Applications folder, then open the Utilities folder, and click on it.\n\nBaio wrote a simple command for Mac users to reveal the hidden Bitcoin white paper. Copy and paste the following code into Terminal once it’s open:\n\nopen /System/Library/Image Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nUsing Finder\n\nThe more time-intensive approach—but one with a technologically lower bar—is to navigate through Finder, a Mac’s file management system.\n\nOpen a Finder window, navigate to the System folder, and prepare yourself for a deluge of clicks.\n\nFrom Systems, go to Library, Image Capture, and then Devices. Once in Devices, right click on VirtualScanner and choose Show Package Contents. That should open up another folder titled Contents, through which you should navigate to Resources, which will reveal a number of files.\n\nClick on simpledoc.pdf, and voilà! You should finally have arrived at your destination: the nine-page outline that detailed the theoretical specifications of Bitcoin, a piece of digital dust that, in aggregate, is worth well over $500 billion as of Friday afternoon."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy93aG8taXMtc2F0b3NoaS1uYWthbW90by1iaXRjb2luLWludmVudG9yLWNyeXB0by1zdGV2ZS1qb2JzLWFwcGxlLTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Who Is Satoshi Nakamoto? the Bitcoin Legend Is As Mysterious As Ever. - Markets Insider",
        "content": "Satoshi Nakamoto is said to be the inventor of bitcoin and wrote the token's original white paper in 2008.\n\nCrypto fans this week celebrated Nakamoto's 48th birthday amid new theories as to their true identity.\n\nHere's what to know about the mysterious icon behind the world's largest cryptocurrency.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nSatoshi Nakamoto is the name of the individual or group credited with inventing bitcoin, the world's largest cryptocurrency. Their legend is shrouded in mystery.\n\nThe inventor's identity has never been confirmed, though April 5 marked their 48th birthday, according to information on a profile with The P2P Foundation.\n\nThis week, conspiracy theories connected the figure to the late Steve Jobs, the visionary Apple cofounder, following the revelation that Apple has shipped out Mac computers since 2018 with a copy of the original bitcoin white paper.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto's Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018,\" technologist Andy Baio wrote in an April 5 blog post.\n\nAdvertisement\n\nNakamoto's paper, \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" was published in October 2008. The abstract reads:\n\n\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.\"\n\nSince then, bitcoin has become the largest cryptocurrency, with a market cap of about $540 billion, according to CoinMarketCap data on Friday.\n\nWhat we know about Satoshi Nakamoto\n\nSomeone is behind the name, given that they invented bitcoin's complex source code, authored a white paper, and interacted with users on web forums.\n\nAdvertisement\n\nNakamoto's profile on The P2P Foundation lists their location as Japan. In their posts, however, Nakamoto has used British English spellings and expressions, leading some to assume they are in fact not Japanese, as the inventor claimed. Additionally, some have pointed to the time stamps on Nakamoto's comments as reason to believe they were not located in Japan.\n\nIn 2011, a comment from that account stated that they had \"moved onto other things.\"\n\nThe name is also associated with a number of crypto wallets, presumably owned by Nakamoto. Some estimate that those wallets hold more than 1.1 million bitcoin tokens. When bitcoin peaked in November 2021 at $68,000, those holdings would have been worth about $73 billion, placing Nakamoto among the 15 riches people in the world at the time.\n\nSome have speculated that the chances Nakamoto is one person are low, given the complexity of bitcoin's source code.\n\nAdvertisement\n\n\"Either there's a team of people who worked on this or this guy is a genius,\" Dan Kaminsky, a leading internet-security researcher, told The New Yorker in 2011.\n\nIn his white paper, Nakamoto cited the work of Stuart Haber, a computer scientist credited with helping invent blockchain technology. Haber has echoed Kaminsky's sentiment that the programmer behind bitcoin would have had a \"keen intelligence.\"\n\nOther names that have been connected to Nakamoto\n\nIn 2013, Nick Szabo, a computer scientist who published research in 1998 on \"bit gold,\" a precursor to bitcoin, drew attention for potentially being Nakamoto. He has denied it, and financial writer Dominic Frisby has said no proof exists connecting the two figures.\n\n\"The most convincing evidence pointed to a reclusive American man of Hungarian descent named Nick Szabo,\" journalist Nathaniel Popper wrote in The New York Times in 2015.\n\nAdvertisement\n\nA Newsweek article in 2014 said that Dorian Prentice Satoshi Nakamoto, a Japanese American man living in California, was the elusive inventor of bitcoin. According to the article, he was trained as a physicist and worked on classified defense projects, but he, too, denied the claims.\n\nAfter the article published, Nakamoto's online account revived itself after a five-year hiatus, stating: \"I am not Dorian Nakamoto.\"\n\nThen, in December 2015, Wired posited that Australian researcher Craig Steven Wright \"either invented bitcoin or is a brilliant hoaxer who very badly wants us to believe he did.\"\n\nThe same day, Gizmodo published a story that said Wright, as well as computer scientist Dave Kleiman, together were involved in the invention of bitcoin.\n\nAdvertisement\n\nThen, in May 2016, Wright announced in a blog post that he did create bitcoin, though he was met with prominent crypto figures who said it was false.\n\nThe list of other potential candidates, apart from Apple's Jobs, includes the government, various other computer scientists, and even Elon Musk, who denied he was Nakamoto in a 2017 tweet.\n\nOn Friday, bitcoin hovered around $27,937. It has surged 68% in 2023."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzA4L3doYXRzLWEtYmV0dGVyLWJ1eS1iaXRjb2luLW9yLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "What's a Better Buy: Bitcoin or Ethereum? - The Motley Fool",
        "content": "The debate between Bitcoin (BTC 0.53%) and Ethereum (ETH -0.42%) as a better investment has been a hot topic in the cryptocurrency community for years. Both are popular and established cryptocurrencies, but there are key differences between them that make Bitcoin a better investment. The reason for this belief can be boiled down to three simple reasons.\n\n1. The market cap difference\n\nMarket capitalization, or \"market cap,\" refers to the total value of a company or asset. In the case of cryptocurrencies, it is calculated by multiplying the total number of coins in circulation by the current market price of each coin. As of April 1, 2023, Bitcoin has a market cap of over $545 billion, while Ethereum's market cap is just under $220 billion.\n\nEssentially what this means is that Bitcoin is currently a more established asset than Ethereum and makes up a disproportionate amount of value in the entire crypto asset class. As of today, Bitcoin accounts for more than 45% of all the value in crypto.\n\nIts higher market cap indicates that it has more adoption and more trust among investors. Additionally, it suggests that Bitcoin is less volatile than Ethereum, as it would take a larger amount of money to move its price significantly.\n\n2. Increasing scarcity\n\nOne of the most significant differences between Bitcoin and Ethereum is their supply. Bitcoin has a hard cap of 21 million coins, which means that there will never be more than 21 million bitcoins in circulation. Currently, there are around 19.3 million circulating, with the remaining 1.7 million yet to be mined. Even better, though, these remaining 1.7 million bitcoins will be released at a diminishing rate for the next 117 years until the last bitcoin is mined.\n\nCurrently, Bitcoin's inflation rate is a minimal 1.7%. However, due to the gradual decrease in the rate of new coins being created, it is estimated that by 2056, this number will fall below 0.1%. By the year 2100, Bitcoin's inflation rate will be somewhere around 0.000001%. No matter the asset, an inflation rate this low helps to ensure that prices are not only maintained but grow as demand competes for a more limited supply.\n\nEthereum, on the other hand, has no hard cap. While it does have a mechanism known as burning to remove ether from circulation, there is, technically, no overall limit on the number of ether which could enter the market. Unlike Bitcoin, this means that Ethereum is subject to unknown levels of inflation, which can decrease the value of each individual coin over time.\n\n3. Decentralization and security\n\nFurthermore, Bitcoin has a stronger track record when it comes to security and decentralization. Bitcoin's blockchain is the most secure and decentralized of any cryptocurrency, with thousands of nodes and miners around the world helping to verify transactions and maintain the network. This makes it less susceptible to hacking or manipulation than Ethereum, which has had several high-profile security incidents in the past. Additionally, Bitcoin's decentralized nature means that it is not subject to the same level of centralization or regulation as Ethereum, which has been criticized for being too closely tied to its founders and developers.\n\nIn addition, Bitcoin has a more established and secure network than Ethereum. Bitcoin's network has been operating securely for well over a decade, and its underlying proof-of-work technology has proven to be reliable and resistant to attacks. Ethereum, on the other hand, has had some security issues in the past, including a major hack in 2016 that resulted in the loss of millions of dollars worth of ether. While Ethereum's security has improved over time, it still lags behind Bitcoin in terms of reliability and security.\n\nKeep it simple\n\nWhile Ethereum might be deserving of a spot in your portfolio, Bitcoin provides investors with a safer and more dependable option. Likely the greatest advantage Bitcoin has over Ethereum is its simplicity. Bitcoin's value proposition is clear and easy to understand: it is a highly decentralized and secure digital store of value that provides holders with reliability.\n\nEthereum, on the other hand, has a more complex value proposition that is tied to its smart contract functionality and decentralized applications. While this complexity can be appealing to some investors, it also makes Ethereum more difficult to understand and evaluate as an investment, as many of these use cases are in their beginning stages.\n\nFor investors looking to keep it simple and wanting to invest in cryptocurrency, look no further than the original digital asset, Bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzA4L2RydWdzLWVycmF0aWMtZGlzbWlzc2Fscy1hbmQtZmV1ZGluZy1mb3VuZGVycy1iZWhpbmQtYml0Y29pbi1tYXJrZXRwbGFjZS1wYXhmdWxzLXVucmF2ZWxpbmcv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMDgvZHJ1Z3MtZXJyYXRpYy1kaXNtaXNzYWxzLWFuZC1mZXVkaW5nLWZvdW5kZXJzLWJlaGluZC1iaXRjb2luLW1hcmtldHBsYWNlLXBheGZ1bHMtdW5yYXZlbGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Drugs, Erratic Dismissals and Feuding Founders: Behind Bitcoin Marketplace Paxful’s Unraveling - CoinDesk",
        "content": "What now seems to be more relevant than ever is that the defendants in the case included Ray Youssef and Artur Schaback, the co-founders of Paxful, a website that allowed users to buy and sell bitcoin (BTC) on a peer-to-peer basis, similar to eBay (EBAY) or Craigslist. The company, founded in 2015, had grown to employ more than 200 people in four offices around the world, with $5 billion traded on Paxful by more than 12 million users over the course of its existence, according to court filings."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnJvdXRlLWZpZnR5LmNvbS9lbWVyZ2luZy10ZWNoLzIwMjMvMDQvdGV4YXMtbWF5LWRpYWwtYmFjay1iaXRjb2luLW1pbmluZy1pbmNlbnRpdmVzLzM4NDk1OC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Texas may dial back bitcoin mining incentives - Route Fifty",
        "content": "Cookie Preferences Cookie List\n\nCookie List\n\nA cookie is a small piece of data (text file) that a website – when visited by a user – asks your browser to store on your device in order to remember information about you, such as your language preference or login information. Those cookies are set by us and called first-party cookies. We also use third-party cookies – which are cookies from a domain different than the domain of the website you are visiting – for our advertising and marketing efforts. More specifically, we use cookies and other tracking technologies for the following purposes:\n\nStrictly Necessary Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the proper functioning of our website (such as prompting our cookie banner and remembering your privacy choices) and/or to monitor site performance. These cookies are not used in a way that constitutes a “sale” of your data under the CCPA. You can set your browser to block or alert you about these cookies, but some parts of the site will not work as intended if you do so. You can usually find these settings in the Options or Preferences menu of your browser. Visit www.allaboutcookies.org to learn more.\n\nFunctional Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the proper functioning of our website (such as prompting our cookie banner and remembering your privacy choices) and/or to monitor site performance. These cookies are not used in a way that constitutes a “sale” of your data under the CCPA. You can set your browser to block or alert you about these cookies, but some parts of the site will not work as intended if you do so. You can usually find these settings in the Options or Preferences menu of your browser. Visit www.allaboutcookies.org to learn more.\n\nPerformance Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the proper functioning of our website (such as prompting our cookie banner and remembering your privacy choices) and/or to monitor site performance. These cookies are not used in a way that constitutes a “sale” of your data under the CCPA. You can set your browser to block or alert you about these cookies, but some parts of the site will not work as intended if you do so. You can usually find these settings in the Options or Preferences menu of your browser. Visit www.allaboutcookies.org to learn more.\n\nSale of Personal Data\n\nWe also use cookies to personalize your experience on our websites, including by determining the most relevant content and advertisements to show you, and to monitor site traffic and performance, so that we may improve our websites and your experience. You may opt out of our use of such cookies (and the associated “sale” of your Personal Information) by using this toggle switch. You will still see some advertising, regardless of your selection. Because we do not track you across different devices, browsers and GEMG properties, your selection will take effect only on this browser, this device and this website.\n\nSocial Media Cookies\n\nWe also use cookies to personalize your experience on our websites, including by determining the most relevant content and advertisements to show you, and to monitor site traffic and performance, so that we may improve our websites and your experience. You may opt out of our use of such cookies (and the associated “sale” of your Personal Information) by using this toggle switch. You will still see some advertising, regardless of your selection. Because we do not track you across different devices, browsers and GEMG properties, your selection will take effect only on this browser, this device and this website.\n\nTargeting Cookies\n\nWe also use cookies to personalize your experience on our websites, including by determining the most relevant content and advertisements to show you, and to monitor site traffic and performance, so that we may improve our websites and your experience. You may opt out of our use of such cookies (and the associated “sale” of your Personal Information) by using this toggle switch. You will still see some advertising, regardless of your selection. Because we do not track you across different devices, browsers and GEMG properties, your selection will take effect only on this browser, this device and this website."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zMGstYnRjLXByaWNlLXN0YXlzLXZhbGlkLWFzLWJvcmluZy1iaXRjb2luLWhlYWRzLWludG8tdXMtam9icy1kYXRh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "$30K BTC price target stays valid as 'boring' Bitcoin heads into US jobs data - Cointelegraph",
        "content": "Bitcoin (BTC) stuck to a narrow trading range into April 7 as crypto analysts awaited the week’s main United States macroeconomic data.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n$30,000 or $25,000 for Bitcoin?\n\nData from Cointelegraph Markets Pro and TradingView confirmed another day ranging around $28,000 for BTC/USD.\n\nThe pair had shunned volatility over most of the week but now faced nonfarm payroll (NFP) numbers as a final potential catalyst for risk assets.\n\n“Expectations are that we’ll be seeing 3.6%, similar to last month. Based on the financial numbers of this week, I’d rather expect 3.7-3.8%,” Michaël van de Poppe, founder and CEO of trading firm Eight, summarized his expectations.\n\n“Result; $DXY down, $BTC unchanged and indices down/up depending on how far the outlier will be.”\n\nA further tweet argued that $30,000 remained on the table should bulls protect current support levels.\n\n“Bitcoin remains in a boring state of mind. Consolidating for weeks, while old altcoins are breaking out,” he continued.\n\n“I’m still looking at support here, through which $27,600 needs to sustain. If that’s lost, $25,000-25,400 seems likely. Holding here through NFP -> $30,000 next.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/ Twitter\n\nRelated: $1.12B in Bitcoin options expire this week, and bulls appear to be at a disadvantage\n\nFellow trader Crypto Tony agreed that the current trading range might nonetheless prove sticky.\n\n“I bet we will be staring at this range for awhile. If we do range for awhile and Alts start to run, it only confirms the capital flow is in motion,” he forecast on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nPopular trader Anbessa showed similar downside targets to Van de Poppe, eyeing $27,940 as an important intraday level to defend.\n\nBollinger Bands portend BTC price volatility\n\nExamining volatility, meanwhile, popular analyst HornHairs commented that Bollinger Bands were offering a telltale sign that calm conditions were about to break.\n\nRelated: Bitcoin ‘faces headwinds’ as US money supply drops most since 1950s\n\n“Bitcoin volatility contraction as tight as its been all year. The games shall begin shortly. Dust off your weapons of choice for the volatility ahead,” he advised.\n\nAn accompanying chart confirmed the Bollinger Bands “squeezing” around spot price, reflecting the current tight range, with the implication that a challenge of the upper or lower band should soon begin.\n\nBTC/USD 1-day candle chart (Bitstamp) with Bollinger Bands. Source: TradingView\n\nAs Cointelegraph reported, 2023 has been a year of contrasting volatility phenomena, with BTC/USD gaining 40% in January but ending February almost exactly at its starting position.\n\nMarch upside totaled 23%, while in April, Bitcoin is currently down 2.3%, according to statistics from Coinglass.\n\nBTC/USD monthly returns chart (screenshot). Source: Coinglass\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZW1vc2Nvd3RpbWVzLmNvbS8yMDIzLzA0LzA3L3J1c3NpYS1iZWNvbWVzLXdvcmxkcy1zZWNvbmQtbGFyZ2VzdC1jcnlwdG8tbWluZXItYTgwNzQ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Russia Becomes World’s Second-Largest Crypto Miner - The Moscow Times",
        "content": "Russia has become the world’s second-largest cryptocurrency mining country this year, the Kommersant business daily reported Friday, citing Bitriver, Russia’s largest bitcoin mining provider.\n\nWhile the United States remains by far the world's largest crypto miner, boasting 3-4 gigawatts of mining capacity, Russia’s generating capacity reached 1 gigawatt in January-March 2023.\n\nIn taking second place for the first time, Russia took a spot previously occupied by Kazakhstan, which introduced restrictions on crypto mining activities in 2022 and now ranks ninth, Kommersant cited Bitriver as saying.\n\nChina, which banned crypto mining in 2021, did not make Bitriver’s top 10 at all.\n\nBitcoin use is limited in Russia due to restrictive laws on cryptocurrencies including President Vladimir Putin’s 2020 law on digital financial assets, which legalized cryptocurrencies but banned using them to pay for goods and services.\n\nStill, cryptocurrencies have been linked to Russia’s sanctions evasion strategies, with the United States blacklisting a bitcoin and an ether address in February that it said may have been involved in Russian defense equipment sales abroad.\n\nThe European Union imposed a total ban on carrying out cryptocurrency transactions with Russian citizens and anyone resident in the country as part of its eighth round of sanctions introduced last year."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1kcm9wcy11czI4MDAwLWRvZ2Vjb2luLWJpZ2dlc3QtbG9zZXIv0gFOaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvbWFya2V0cy1iaXRjb2luLWRyb3BzLXVzMjgwMDAtZG9nZWNvaW4tYmlnZ2VzdC1sb3Nlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin trades under US$28,000, Dogecoin biggest loser - Forkast News",
        "content": "Bitcoin rose as Ether fell with most of the top 10 non-stablecoin cryptocurrencies by market capitalization during Asian trading hours on Friday. XRP gainned the most, while Dogecoin was the biggest loser. Asian equity markets strengthened following Wall Street’s overnight rally as investors await the release of the U.S. Employment Situation report on Friday.\n\nSee related article: The TradFi vs. DeFi rivalry is hitting a new peak — and that’s bad for everyone\n\nFast facts\n\nBitcoin rose 0.11% to US$27,933 in the 24 hours to 4:30 p.m. in Hong Kong. The world’s first cryptocurrency rose 0.62% during the week.\n\nEther lost 0.99% during the day, to trade at US$1,857, but maintained its weekly 3.64% increase. Ethereum’s Shapella upgrade, or the Shanghai hard fork, is slated for next Wednesday, which will allow the withdrawal of staked ETH for the first time.\n\nXRP token was the day’s biggest winner, as it rose 2.38% to change hands at US$0.51.\n\nDogecoin saw the biggest drop among the top 10 cryptos, as it fell 9.01% to US$0.083 on the day, but maintained a 11.70% weekly rise. Social media platform Twitter reinstated its blue bird logo after briefly changing it to a Shiba Inu dog, the memecoin’s mascot.\n\nThe global cryptocurrency market capitalization decreased by 0.44% to US$1.18 trillion in the 24 hours to 4:30 p.m. in Hong Kong, while total crypto market trading volume decreased by 11.56% to US$36.18 billion.\n\nThe Forkast 500 NFT index fell 0.24% to 3,990.91 points during the day and slid 0.55% during the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\nAsian equities were up in line with Wall Street’s rally, despite mounting worries about the health of the U.S. economy, after several reports, like jobless claims, indicated tighter financial conditions.\n\nJapan’s Nikkei 225 rose 0.17%, the Shanghai Composite rose 0.45% to close at a one-month high and the Shenzhen Component gained 0.85% during the day. Hong Kong was closed on Friday and will be off next Monday for the Easter holidays.\n\nInvestors await the release of the U.S. Jobs Report later on the day, which includes the monthly change in non-farm payrolls. Strong growth in non-farm payroll data may indicate heating inflation, which investors will analyze to gauge the Federal Reserve’s next monetary decision.\n\nEuropean stock markets will also be closed over the four-day Easter weekend after closing the trading week in the green on Thursday.\n\nGold slid 0.61% to US$2,008 per ounce, after gaining 2% during the week.\n\nSee related article: Local prosecutors say Terra-Luna’s Do Kwon has no identifiable assets in South Korea"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYXBwbGUtYml0Y29pbi1tYW5pZmVzdG8tc3RldmUtam9icy1zYXRvc2hpLW5ha2Ftb3RvLXdoaXRlLXBhcGVyLWNyeXB0b2N1cnJlbmN5LTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Apple's Bitcoin Manifesto Fuels Theories Steve Jobs Was Satoshi Nakamoto - Markets Insider",
        "content": "Technologist Andy Baio wrote this week that he discovered a PDF of the original bitcoin white paper on his Mac.\n\nThe revelation fueled theories connecting Steve Jobs to the mysterious author of the paper, Satoshi Nakamoto.\n\nBaio said Apple appears to have hid the bitcoin document in \"every copy of macOS since Mojave in 2018.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nIn an April 5 blog post, technologist Andy Baio said he accidentally stumbled upon a copy of Satoshi Nakamoto's bitcoin white paper on his Mac computer, with the revelation fueling wild theories across the internet that the mysterious creator of the world's biggest cryptocurrency was Apple co-founder Steve Jobs.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto's Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018,\" Baio wrote.\n\nHis post prompted Twitter users to share screenshots of the same manifesto stored on their Macs. Insider also tested out Baio's instructions and found the white paper on the latest version of macOS.\n\nThe white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" was published in 2008. In it, the author lays out the framework for the underlying mechanisms that power bitcoin and enable transactions without a third party intermediary like a bank or financial institution.\n\nAdvertisement\n\nBaio's revelation fueled fresh speculation that Nakamoto, the mysterious bitcoin inventor who has never been identified, may have been Steve Jobs, the late co-founder of Apple and tech visionary.\n\n\"Was Steve Jobs actually Satoshi Nakamoto the creator of #bitcoin?\" tweeted Lark Davis, a bitcoin investor and blogger with 1.1 million followers. \"Plus Satoshi disappear in December 2010, and then Jobs passed in October 2011. The timelines fit...\"\n\nWhile Nakamoto vanished from the internet around the same time Jobs died, the white paper appeared on Mac computers seven years after the tech icon's death, making it impossible for him to be the one who inserted the document into the OS.\n\nOther users chimed in across Twitter, with some agreeing while others remained skeptical.\n\nAdvertisement\n\nWhile unusual, the presence of the bitcoin white paper on Mac computers isn't evidence of anything.\n\nAs for Jobs himself, while he is credited as the creative force behind many of Apple's most iconic products, he wasn't an expert programmer, according to co-founder, Steve Wozniak.\n\nOthers have also noted that for Jobs to develop the iPhone around the same time as the world's most popular digital asset is more reason to be skeptical.\n\nThe real identity of Nakamoto has never been revealed, and some believe Nakamoto was actually a group of people given the complexity of bitcoin's code. The inventor stated they started writing the code for bitcoin in 2007, and the network launched in 2009.\n\nAdvertisement\n\nThe mysterious figure \"disappeared\" from online appearances on December 12, 2010.\n\nSome estimate that crypto wallets associated with the pseudonym hold more than 1.1 million bitcoin tokens. When the token peaked in November 2021 at about $68,000, those holdings would have been worth roughly $73 billion, putting Nakamoto among the top-15 richest people in the world at the time.\n\nMeanwhile, other Twitter users floated the idea that the white paper was simply a bitcoin enthusiast working at Apple who slipped the document in as an easter egg.\n\nTo locate the white paper, users can open the macOS terminal and enter the following command:\n\nAdvertisement\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nOn Friday, bitcoin hovered around $27,896. The token has rallied roughly 68% in 2023."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzA3L2JpdGNvaW4tbWluZXItc3BoZXJlLTNkLXN1ZXMtcGFydG5lci1ncnlwaG9uLWRpZ2l0YWwv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMDcvYml0Y29pbi1taW5lci1zcGhlcmUtM2Qtc3Vlcy1wYXJ0bmVyLWdyeXBob24tZGlnaXRhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Sphere 3D Sues Partner Gryphon Digital - CoinDesk",
        "content": "“We are aware of the complaint and look forward to defending it vigorously. While we cannot comment on pending litigation, we are confident that our impending response to the complaint - and the documents and other evidence that will come to light in the aftermath - will speak for themselves,\" Gryphon said in statement."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaWxsLXByb3RlY3RpbmctYml0Y29pbi1taW5pbmctcmlnaHRzLXBhc3Nlcy1pbi1hcmthbnNhcy1zZW5hdGUtYW5kLWhvdXNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Bill protecting Bitcoin mining rights passes in Arkansas Senate and House - Cointelegraph",
        "content": "A bill seeking to regulate Bitcoin (BTC) mining activity in Arkansas has passed in the state’s House of Representatives and Senate. The bill will now move to the governor’s office for approval.\n\nAccording to the bill, the Arkansas Data Centers Act of 2023 intends to regulate the Bitcoin mining industry in the American state, creating guidelines for miners and protecting them from discriminatory regulations and taxes.\n\nArkansas’ state legislators quickly passed the bill after it was proposed on March 30 by Senator Joshua Bryant. The document recognizes “that data centers create jobs, pay taxes, and provide general economic value to local communities.“\n\nArkansas Data Centers Act of 2023. Source: Arkansas State Legislature\n\nAs per the approved bill, a digital asset miner is required “to pay applicable taxes and government fees in acceptable forms of currency and operate in a manner that causes no stress on an electric public utility’s generation capabilities or transmission network.“\n\nUnder the legislation, crypto miners will also have the same rights as data centers. The bill outlines that Arkansas’ government should not “impose a different requirement for a digital asset mining business than is applicable to any requirement for a data center.“\n\nRelated: Crypto mining in 2023 — Is it still worth it? Watch Market Talks\n\nArkansas’ move follows a similar initiative in the state of Montana. In late March, the Montana Senate passed a bill to protect crypto miners operating within the state. The bill intends to protect miners against taxes on digital assets used for payments, and to eliminate energy rates discriminating against home crypto miners and digital assets businesses.\n\nThe state of Texas went in a different direction. Its Senate Committee on Business and Commerce passed legislation on April 4 that would essentially remove incentives for miners operating under the state’s crypto-friendly regulatory environment, Cointelegraph reported.\n\nAn even more decisive move came from New York in November 2022 when Governor Kathy Hochul signed the proof-of-work mining moratorium into law, banning crypto-mining activities in the state for two years. On a federal level, crypto miners in the United States could eventually be subject to a 30% tax on electricity costs under a budget proposal introduced on March 9 by President Joe Biden aimed to “reduce mining activity.”\n\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3R1Y2stdXMyODAwMC1hbWlkLXNpZ25zLXNsb3dpbmctZWNvbm9taWVzL9IBTGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3R1Y2stdXMyODAwMC1hbWlkLXNpZ25zLXNsb3dpbmctZWNvbm9taWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin stuck at US$28,000 amid signs of slowing economies - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, fell 0.96% from March 31 to April 7 to trade at US$27,916 at 9:15 p.m. on Friday in Hong Kong. Ether rose 2.54% in the same period to US$1,854.\n\nThis week, worries about bank failures were replaced by concerns about a recession in the U.S. Nonfarm payrolls rose by 236,000 in March, the lowest monthly gain since December 2020 and less than the 239,000 expected by economists polled by Reuters. Pay growth also slowed.\n\nThe stuttering in job growth and pay was linked to weak consumer demand and the rising cost of borrowing. Add to that a forecast by the International Monetary Fund that said global GDP is expected to grow by around 3% over the next five years, the slowest pace in 20 years.\n\nAnother bearish indicator for the U.S. economy released Wednesday was the services purchasing managers’ index (PMI) for March that came in at 51.2%, according to the Institute for Supply Management, also well below expectation of 54.5%. The index is a measure of market conditions, with a lower reading suggesting a contracting economy.\n\nKadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, said Bitcoin is still suffering from bear market blues and price trends are mixed.\n\n“Normally, we see risk on conditions as something that drives up the Bitcoin price. But, over the last month with the banking crisis, we’ve actually seen risk off be positive for Bitcoin. Right now, the price action is telling us the market is undecided,” Stadelmann said in a statement shared with Forkast.\n\nStablecoin reserves on exchanges continued to drop this week, hitting a two-year low of US$18.06 billion, according to data from analytics platform CryptoQuant, hinting that crypto market liquidity is drying up after the shutdown of three major crypto-focused banks in the U.S.\n\nTether’s USDT added more than US$1 billion to its stablecoins-leading market capitalization this week, raising it toUS$80.27 billion. Its market cap is up 11.92% over the past month, while rival USDC’s dropped 25.03% to US$32.41 billion, as BUSD lost 15.91% to US$7.09 billion, according to DefiLlama.\n\nThe global crypto market capitalization stood at US$1.18 trillion on Friday at 9:15 p.m. in Hong Kong, the same value it had a week ago, according to CoinMarketCap data. Bitcoin’s US$539 billion market cap accounted for 45.9% of the market, while Ether’s US$223 billion accounted for 19%.\n\nSee related article: Ethereum’s Shapella upgrade is imminent – and investors are excited\n\nBiggest gainers: INJ & ENJ\n\nINJ, the native governance token of Injective, a layer-1 smart contract blockchain for financial apps, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. INJ rose 23.17% during the past week to trade at US$5.77. The token started gaining momentum in early March since launching the ongoing Injective Global Hackathon.\n\nEnjin Coin, the utility token of Enjin, a blockchain platform building non-fungible token solutions, was the week’s second-biggest gainer in the top 100. ENJ rose 19.68% to change hands at US$0.47. The token started its rally on Tuesday, ahead of the release of the upcoming Enjin Platform, which the company teased on social media.\n\nNext week: Will Bitcoin claim US$30,000?\n\nStadelmann said that Bitcoin could break through US$30,000 briefly in the coming week but cautioned that a recession might be looming.\n\nWhen this sinks in, some panic selling will start in Bitcoin, but like during the Covid-19 panic, Bitcoin will rebound rather quickly, he said. “The bank runs we have seen in recent months build the case for Bitcoin. They are why Bitcoin was built.”\n\nMarat Minkin, the co-founder of decentralized finance payment app TONBanking, said that regulatory developments and economic data will continue to dictate the crypto market trend next week.\n\nThe U.S. is scheduled to release key inflation numbers next week. According to Minkin, Bitcoin is a safe haven asset to hedge against inflation and recession.\n\n(Updates to add economic indicators in first section.)\n\nSee related article: Bitcoin trades under US$28,000, Dogecoin biggest loser"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oaXN0b3JpY2FsLWJpdGNvaW4tcHJpY2UtZnJhY3RhbC1oaW50cy1hdC1yYWxseS10b3dhcmQtNTBr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Historical Bitcoin price fractal hints at rally toward $50K - Cointelegraph",
        "content": "Bitcoin (BTC) could rally toward $50,000 in 2023, according to a historical price fractal highlighted by popular market analyst Mags.\n\nBitcoin price trend in 2015 vs. 2023\n\nThe chart fractal highlights the similarities between Bitcoin’s ongoing price trends and those recorded after the completion of the 2013–2015 bear market.\n\nThat includes Bitcoin’s consolidation inside the $200–$300 range between January 2015 and August 2015, which appears identical to its consolidation between the $18,500–$25,000 range after the supposed completion of its 2021–2022 bear market.\n\nBTC/USD price performance comparison between 2015 and 2023. Source: TradingView/Mags\n\nBTC’s price broke above the $16,000–$25,000 range in March 2023, prompting Mags to highlight its resemblance to the breakout above the $200–$300 range in October 2015.\n\nSince this resulted in a rally toward $700 in June 2016, the analyst sees the scenario potentially repeating in 2023, with BTC’s price doubling to $50,000.\n\n“Being bearish here [when Bitcoin’s price is around $28,000] is like being bearish at $350,” Mags added.\n\nLiquidity crunch may spoil Bitcoin price rally\n\nThe bullish argument for Bitcoin comes amid anticipations that the United States Federal Reserve would slow the pace of its interest rate hikes.\n\nDue to lower rate expectations, the yield on the benchmark U.S. 10-year Treasury note has declined. That, in turn, has boosted investors’ appetite for zero-yielding assets, such as Bitcoin and gold.\n\nU.S. 10-year weekly chart versus BTC/USD and XAU/USD. Source: TradingView\n\nIn addition, lower yields have also sapped U.S. dollar demand, with the dollar losing 1.33% in 2023 versus a basket of top foreign currencies. Since Bitcoin’s value is largely denominated in the dollar, it means higher prices for BTC/USD.\n\nRelated: Latest Bitcoin price data suggests double top above $200K in 2025\n\nHowever, Bloomberg analyst Mike McGlone has cautioned about a potential bull trap in the Bitcoin market due to a mounting liquidity crunch.\n\nHe said:\n\n“It may be illogical to expect the stock market, crude oil, copper, and the Bloomberg Galaxy Crypto Index (BGCI) sustain the recent bounces with year-over-year measures of money supply and commercial bank deposits falling around 2%.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtZXhwZWN0LWJpZy1tb3ZlLW5leHQtYXMtYnRjLXByaWNlLWZsYXRsaW5lcy1hdC0yOGvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin traders expect 'big move' next as BTC price flatlines at $28K - Cointelegraph",
        "content": "Bitcoin (BTC) reduced its narrow trading range even further into April 8 as risk assets waited for fresh catalysts.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nHopes for BTC price “impulse” to follow sideways action\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hovering near $28,000 on Bitstamp.\n\nThe pair continued sideways behavior into the weekend after the Wall Street trading week offered few surprises.\n\nDespite calls for $25,000 and $30,000 to enter as near-term targets, increasing order book liquidity on either side of the spot price appeared to offer the market increasingly little room for maneuvering.\n\nThis liquidity remained in force on the day, with monitoring resource Material Indicators capturing the phenomenon on the Binance order book.\n\n“If you think ANY price target for BTC, ETH, DOGE or any other altcoin is imminent, you are mistaken,” it wrote, adopting a cautionary tone in accompanying comments.\n\n“The ONLY guarantee in crypto is that these are among the riskiest of risk assets and NOTHING IS GUARANTEED.”\n\nA specific warning focused on the BTC price bet recently made by former Coinbase executive Balaji Srinivasan, who at the time called for a sky-high $1 million per Bitcoin within the next three months.\n\nMaterial Indicators added that liquidity reflects sentiment, having previously emphasized that such liquidity moves are apt to “dampen” price volatility.\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\n“Very calm weekend coming up on Bitcoin,” Michaël van de Poppe, founder and CEO of trading firm Eight, meanwhile continued.\n\n“Price action remained flat and the longer we stay in this range, the heavier the impulse will be. Based on the fact that we're coming from $15K, I'd assume we'll be seeing strong continuation. For now, support at $27,600 is sustaining.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/ Twitter\n\nRelated: Zhu Su’s exchange did $13.64 in volume akshually, Huobi in crisis: Asia Express\n\nPopular trader and analyst Daan Crypto Trades shared the idea that a breakout for Bitcoin was all but guaranteed.\n\n“Market is boring, volatility is low. These kind of periods usually precede a large move,” he summarized on the day.\n\nAs Cointelegraph reported, in terms of the Bollinger Bands volatility indicator, BTC/USD is currently experiencing some of its least volatile intraday conditions of 2023 — a classic precedent for a breakout.\n\nBTC/USD 1-day candle chart (Bitstamp) with Bollinger Bands. Source: TradingView\n\nFidelity: Stock market “will declare itself”\n\nTaking a look at the wider macro environment, Jurrien Timmer, director of global macro at asset manager Fidelity Investments, drew similar conclusions about United States equities.\n\nRelated: Bitcoin ‘faces headwinds’ as US money supply drops most since 1950s\n\nWhile 2023 has seen a renaissance, he noted in Twitter analysis on April 7 that the S&P 500 has moved within a sideways range for nine months.\n\n“Where does the market go from here? As you can see, we’ve been treading choppy waters for a while now,” he summarized.\n\nLike Bitcoin, the S&P 500 should be due a breakout sooner or later, with the direction nonetheless unclear and highly dependent on the Federal Reserve.\n\n“We are only three months into 2023, but already nine months into this big trading range (since the June low),” he concluded.\n\n“That’s a long time, and sooner or later the market will declare itself in one direction or another.“\n\nS&P 500 annotated chart. Source: Jurrien Timmer/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRlcml2YXRpdmVzLWZhdm9yLWZ1cnRoZXItYnRjLXByaWNlLXJhbGx5LXRvd2FyZC0zMGvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin derivatives favor further BTC price rally toward $30K - Cointelegraph",
        "content": "Despite regulatory pressure and worsening macroeconomic conditions, Bitcoin (BTC) demonstrated bullishness, holding near $28,000 for the past week. Furthermore, professional traders have maintained leveraged long positions on margin and in futures markets, indicating strength.\n\nOn the regulatory front, on April 4, the Texas Senate Committee on Business and Commerce agreed to move forward and remove incentives for miners operating within the state’s regulatory environment. If passed, Senate Bill 1751 would cap compensation for load reductions on Texas’ power grid during emergencies.\n\nRisk of recession grows against rate hikes\n\nThe risk of a recession in the United States grew after applications for unemployment benefits in the week ending March 25 were revised to 246,000, up 48,000 from the initial report.\n\nFurthermore, Kristalina Georgieva, managing director of the International Monetary Fund (IMF), stated on April 6 that the economies of the U.S. and Europe should continue to struggle as higher interest rates weigh on demand.\n\nRegarding the banking crisis, Georgieva advised central banks to keep raising interest rates, adding, “Concerns remain about vulnerabilities that may be hidden, not just at banks but also non-banks — now is not the time for complacency.“\n\nOn the other hand, on April 6, St. Louis Federal Reserve president James Bullard downplayed concerns about the impact of financial stress on the economy. Bullard stated that the Fed’s reaction to the banking sector’s weakness was “swift and appropriate,” and that “monetary policy can continue to put downward pressure on inflation.“\n\nLet’s look at derivatives’ metrics to better understand how professional traders are positioned in the current market conditions.\n\nBTC price derivatives reflect traders’ neutral sentiment\n\nMargin markets provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.\n\nFor example, one can increase exposure by borrowing stablecoins and buying Bitcoin. On the other hand, borrowers of Bitcoin can only take short bets against BTC/USD.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe chart above shows that OKX traders’ margin lending ratio has remained near 28x in favor of BTC longs over the last week. If those whales and market makers had perceived increased risks of a price correction, they would have borrowed Bitcoin for shorting, causing the indicator to fall below 20x.\n\nThe top traders’ long-to-short net ratio excludes externalities that might have solely impacted the margin markets. Analysts can better understand whether professional traders are leaning bullish or bearish by aggregating the positions on the spot, perpetual and quarterly futures contracts.\n\nBecause there are some methodological differences between different exchanges, viewers should focus on changes rather than absolute figures.\n\nExchange’s top traders’ long-to-short ratio. Source: Coinglass\n\nBetween April 1 and April 7, the top traders’ long-to-short ratio at Binance slightly declined from 1.17 to 1.09. Meanwhile, at the Huobi exchange, the top traders’ long-to-short ratio has stood near 1.0 since March 18. More precisely, the ratio slid from 1.00 on April 1 to 0.95 on April 7, thus relatively balanced between longs and shorts.\n\nLastly, OKX whales presented a very different pattern as the indicator declined from 1.25 on April 3 to a 0.69 low on April 5, heavily favoring net shorts. Those traders reverted the trend, aggressively buying Bitcoin using leverage for the past two days as the long-to-short ratio returned to 0.97.\n\nAbsence of Bitcoin shorts is a bullish indicator\n\nIn essence, both the Bitcoin margin and futures markets are currently neutral, which should be interpreted positively given that the Bitcoin price rose 41.5% between March 10 and March 20, holding the $28,000 level.\n\nGiven the enormous regulatory uncertainty caused by the SEC’s Wells notice against Coinbase on March 22, the absence of shorts using margin and futures markets currently favors further price appreciation.\n\nUnless the economic crisis unfolds faster than expected, inflation will remain a top concern for investors, and Bitcoin inflows should be enough to keep $28,000 as a resistance level.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxlYWRzLWNyeXB0by1tYXJrZXQtcmVjb3ZlcnktYXMtcmVndWxhdG9ycy10dXJuLXVwLWhlYXQtcmVwb3J00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin leads crypto market recovery as regulators turn up heat: Report - Cointelegraph",
        "content": "March has been a turbulent month for the crypto industry. Bitcoin (BTC) recorded its highest weekly close in 10 months and raised hopes among many that the bear market is over. One of the key drivers of this expectation was a series of banking collapses in the United States. This made investors hope for falling interest rates later this year, despite Federal Reserve Chair Jerome Powell’s insistence that lower rates were not part of the base scenario for 2023.\n\nHowever, optimism about the macro environment risks being offset by the regulatory crackdown on the industry in the United States. This mixed environment is markedly different from the typical bull and bear market action that the crypto industry is used to and affects its various areas in different ways.\n\nFor those serious about understanding the crypto space’s various sectors, Cointelegraph Research publishes a monthly Investors Insights Report that dives into venture capital, derivatives, decentralized finance (DeFi), regulation and much more. Compiled by leading experts on these various topics, the monthly reports are an invaluable tool to quickly get a sense of the current state of the blockchain industry.\n\nDownload and purchase this month’s report on the Cointelegraph Research Terminal.\n\nVCs put off by looming stagflation\n\nInvestment activity in the blockchain industry experienced a significant decline in March, according to the latest information from the Cointelegraph Research Venture Capital database, as only 59 individual deals took place, down from 96 in February. This represents a 38.5% decrease in investment activity. The total aggregate capital inflows for March were $504 million, a drop of over 42.7% from February’s figure of $880 million.\n\nVCs require stable and favorable macroeconomic conditions that can support the growth of high-risk ventures. The risk of a long-term stagflationary environment makes it difficult to achieve this, which is why VC investment sentiment has recently tended toward being bearish. Until there is a shift in macroeconomic indicators that turn investors from risk-off to risk-on, there may continue to be a stagnant or decreasing investment sentiment in the blockchain industry.\n\nHowever, there were still some notable investment rounds in March, including $50 million for Ethereum layer-2 solution Scroll, $40 million for surveillance-free internet builder DAO tomi, and a $40-million seed round for CCP Games. Overall, the report rates the investment sentiment for the blockchain industry as 3 out of 5, indicating that VC investment is still being hampered by macro factors. However, VC activity is likely to be a lagging indicator in any future recovery.\n\nMining stocks ahead of the pack\n\nCrypto stocks saw a mixed performance in March. While mining operations boosted their share price due to higher revenues, other types of crypto ventures struggled. This included the likes of Coinbase, Canaan and Block. The latter’s price continued to be impacted by the short-selling attack by Hindenburg Research.\n\nOn the mining front, the highest gains were recorded by Riot Platforms at 60%, Cipher Mining at 53%, and Terwulf, which now runs a nuclear-powered mining facility providing it with cheap electricity, at 47%. These top performers compare favorably to the MoM return on BTC at 23.0% and a 20.4% uptick in mining revenues. However, on aggregate, crypto stocks still significantly underperformed Bitcoin.\n\nThe crypto industry is likely to operate in a more profitable environment with a more benign outlook for interest rates and reduced debt obligations for mining firms in the coming months.\n\nYet the macroeconomic outlook remains shaky, with markets likely to continue a risk-off approach. With new information arriving with Q1 2023 results, investors will be paying close attention to financial reports for any indication of strength or weakness in the crypto industry.\n\nThe Cointelegraph Research team\n\nCointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to bringing the most accurate, insightful content available on the market.\n\nDemelza Hays, Ph.D., is the director of research at Cointelegraph. Hays has compiled a team of subject matter experts from finance, economics and technology to bring the premier source for industry reports and insightful analysis to the market. The team utilizes APIs from various sources to provide accurate, useful information and analyses.\n\nWith decades of combined experience in traditional finance, business, engineering, technology and research, the Cointelegraph Research team is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report.\n\nThe opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zaGFuZ2hhaS1oYXJkLWZvcmstZXRoLXByaWNlLXNldC1mb3ItbW9yZS1nYWlucy12ZXJzdXMtYml0Y29pbi1pbi1hcHJpbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shanghai hard fork: ETH price set for more gains versus Bitcoin in April - Cointelegraph",
        "content": "Ether (ETH) dropped by over 7.5% in its Bitcoin (BTC) pair in 2023. But ETH/BTC may wipe its year-to-date losses entirely in April, as Ethereum’s long-awaited Shanghai hard fork is just days away.\n\nThe upgrade is set for April 12, enabling Ethereum stakers to withdraw around 1.1 billion ETH in rewards — worth over $2 billion as of April 8.\n\nETH price undergoes key technical bounce\n\nMany experts see the hard fork as bullish for Ether in the long term. For instance, the Shanghai buzz has helped Ether outperform Bitcoin in April.\n\nAs a result, the ETH/BTC pair has risen by about 4.75% month-to-date to reach 0.066 BTC as of April 8, a nearly 8% rebound since March 20.\n\nThe bounce was largely expected, particularly as ETH/BTC dropped to its historical ascending trendline support. Now, the upside move raises the prospects of an extended bullish retracement toward its descending trendline resistance, marked as a “sell zone” in the chart below.\n\nETH/BTC three-day price chart. Source: TradingView\n\nThe fractal-based outlook puts Ether on target for 0.075 BTC by June, up 10% versus current price levels. Meanwhile, the pair’s upside target for April appears to be its 50-3D exponential moving average (50-3D EMA; the red wave) near 0.069 BTC.\n\nConversely, a decisive close below the 200-3D EMA (the blue wave) near 0.066 BTC, coinciding support/resistance level near 0.067 BTC, risks delaying or — in the worst case scenario — invalidating the bullish retracement setup.\n\nThis bearish argument echoes independent market analyst CrediBULL Crypto who expects strong selling pressure near the 0.067 BTC resistance level that would lead to a 50% drop in 2023.\n\nETH/BTC weekly price chart. Source: TradingView/CrediBULL Crypto\n\nEthereum vs. U.S. dollar outlook\n\nThe ETH/USD pair has rallied by more than 50% in 2023, primarily due to similar uptrends elsewhere in the crypto market.\n\nA weakening dollar, lower U.S. Treasury yields and expectations of a Federal Reserve pivot on interest rate hikes have helped cryptocurrencies rise across the board in Q1. These catalysts will likely remain in the spotlight until May’s Federal Open Market Committee meeting.\n\nShanghai bringing the first greenshoots of #AltcoinSeason ?$ETH is perking up to an 8 month high as we approach one week until the Shanghai fork update @ 10:27:35 PM UTC on the 12th (Epoch #620,9536)\n\n\n\nThe rally has mostly been a Fed/USD rates story, causing BTC to lead the way.… pic.twitter.com/dI0bpywR16 — Rich Rosenblum (@Rich_GSR) April 4, 2023\n\nAs a result, Ether could sustain its yearly gains in April, consolidating inside the $1,800–2,000 range until the Fed decision.\n\nRelated: 3 key Ethereum price metrics cast doubt on the strength of ETH’s recent rally\n\nMoreover, a decisive breakout at current levels could result in extended gains with a second-quarter ETH price target of over $3,000.\n\nETH/USD three-day price chart. Source: TradingView\n\nOn the other hand, the bears will attempt to pull the price down for a close below $1,800, with the triangle’s lower trendline near $1,600 as its downside target.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90YXR0b29pbmctYml0Y29pbi1hZHZvY2F0ZXMtd2Vhci1jcnlwdG9jdXJyZW5jeS1vbi10aGVpci1zbGVldmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Tattooing Bitcoin: Advocates wear cryptocurrency on their sleeve - Cointelegraph",
        "content": "Got Bitcoin ink? Many Bitcoin believers do. But what are the risks? What about privacy? And what happens if — one fateful day — Bitcoin crashes and burns to zero?\n\nCointelegraph spoke with Bitcoin (BTC) advocates to understand why they have permanently etched a Bitcoin logo, motif, equation or slogan onto their skin. They’ve shown permanent solidarity with the decentralized movement, expressing their support for the Bitcoin protocol and the values it represents.\n\nTaihuttu's Bitcoin B tatto. Source Taihuttu.\n\nDidi Taihuttu, father of the “Bitcoin family,” explained that he inked himself the moment he went “all in on Bitcoin as I thought it was a very important step in my life.” A familiar face among the crypto community, Taihuttu sold all of his family’s possessions and slept in a campsite while the price of Bitcoin was in the four-figure territory with the “B” etched on his arm.\n\nHe now travels the world evangelizing Bitcoin, with his forearm on full view:\n\n“Bitcoin changed my way of thinking about the world and decentralizing it.”\n\nAnita Posch, another globetrotting Bitcoin evangelist, has a lightning bolt tattooed on her forearm. In the Human B Bitcoin documentary film, she said she wouldn’t explain that the lightning bolt symbol (a nod to the Lightning Network) on her wrist is Bitcoin-related but added “Bitcoin is my life” in follow-up comments.\n\nTatumTurnUp and Erik Dale have the Bitcoin supply formula on their skin. Source: Tatum\n\nTatumTurnUP (not his real name), the host of the Bitcoin show “Between Two Asics,” explained that he got his tattoo of the BTC supply formula because “It’s what proves scarcity.”\n\n“Monetary scarcity is something we’ve been deprived of until Bitcoin, and the fact I can write down what proves there will only ever be a certain amount of Bitcoin is a pretty big deal.”\n\nThe tattoo on his bicep is a common (but unfortunately not strictly accurate) formula for the supply of Bitcoin. He shared a warning with readers: “The bottom of the Sigma might be the most painful thing I ever experienced. Just a forewarning.”\n\nBut what about OpSec?\n\nHowever, isn’t it risky to advertise one’s love of a digital currency on one’s skin? OpSec, or operational security, is a military term the internet has hijacked. Among the crypto community, it refers to the public sharing of identity or defining features. And a Bitcoin tattoo could put a literal target on one’s back.\n\nErik Dale, whose tattoos are pictured in the above tweet, founded Norway’s “Northern Lightning” conference series. Dale told Cointelegraph he was aware of the implications. His tattoos are “Equations, no logos or tribal markers, for OpSec reasons.”\n\n“Insiders should realize what they are, but not casual observers.”\n\nRikki, of content creators and investigators Bitcoin Explorers, joked, “We are not particularly concerned about bad opsec.” He added another Bitcoin tattoo to his collection during a giveaway in Guatemala.\n\nBad OpSec can lead to doxing or the public reveal of people’s personal data. That’s why some Bitcoin advocates mask their online identities, using anonymous profiles on social media. Not so for Rikki and his partner Laura; they have their Bitcoin support on full view.\n\nRikki and Laura’s tattoos. “Stack Sats” means save Bitcoin. Source: Rikki.\n\nPiero Coen, the co-founder of Guatemala-based Osmo Wallet, told Cointelegraph that Bitcoin is a “counterculture movement, and getting a tattoo related to it is a way to show our commitment to this movement.”\n\n“It’s like a badge of honor, showing that we are part of this group of ‘pirates’ who are challenging the traditional financial system and are convinced we’re going to change the world. “\n\nBesides, for Rikki and Laura, much of their lives already permanently exists on camera. Rikki explained:\n\n“We are Bitcoin content creators, and so we chose to give up our privacy years ago. Besides, there aren’t just the slightly paranoid, scheming, pessimistic, terra plat-prone Bitcoiners — there are also us, the good-looking, nice, fun, cool and sex-loving Bitcoiners!”\n\nMe: Should I be more low profile?\n\n\n\nStill me: FREE BITCOIN TATTOO!!!!!!!! LET’S MAKE TWO AND MAKE A VLOG ABOUT IT!!!!! pic.twitter.com/HdwnAwRx4Z — Laura Bitcoin explorers (@Lorinaura) January 30, 2023\n\nLaura put it even more succinctly in a recent tweet:\n\nFor Tatum, another content creator and a recognizable face in the Bitcoin space, “Value is teaching people about Bitcoin and networking through it, so there’s a constant battle with opsec.”\n\n“At the bottom of it, I am comfortable with my own security and what I do and do not share, but ‘WHY I love Bitcoin’ is always going to be shared.”\n\nTatum walks around Bitcoin conferences wearing a bulletproof vest in a jocular nod to operational security in the Bitcoin space.\n\nTatum interviewing guests in a security vest at Pacific Bitcoin 2022. Source: Tatum\n\nBut what if Bitcoin goes to zero?\n\nUnlike tweets, open letters or company creation, Bitcoin tattoos are tricky to delete. They require commitment.\n\nSo what happens if the currency goes to zero, like many other failed projects from Terra to Celsius? Tatum explained, well, “sucks for me!”\n\n“After I got it, I jokingly said, ‘Now I really hope it doesn’t go to zero or I’ll look like an idiot.’ But in reality, my tattoo is kind of why it never will go to zero. If one person finds value in Bitcoin, there’s only ever going to be so many. So they will have value.”\n\nBillionaire Mike Novogratz’s tattoo of the failed Terra (LUNA) token is an eternal reminder of the headiness and hedonism accompanying crypto bull runs. The tattoo remains on Novogratz’s arm, while LUNA is worth next to nothing, and its creator, Do Kwon, might be facing jail time. Fortunately, Novogratz says he learned from the experience saying investing “requires humility.“\n\nDale explained he’s prepared to live with the tattoos on his wrists even if Bitcoin does fail. He’s committed until the very end: “If I’m wrong about this, I want to carry that reminder every day. And if not, I can’t imagine a prouder badge to wear for the rest of my days.”\n\nRelated: Novogratz says LUNA tattoo is a constant reminder investing ‘requires humility’\n\nFor Taihuttu, it’s important to zoom out and focus on the bigger picture. Bitcoin is a long-term play:\n\n“I believe that people who have tattoos from dollar signs or other fiat have a bigger chance of going to 0.”\n\nHe’s right; famous rappers and celebrities, including singer Kesha and actor Lena Dunham, have been inked with dollar sign tattoos. It’s unlikely that they were asked if the dollar would go to zero prior to sitting in the tattoo artist’s chair.\n\nKesha’s dollar sign tattoo. Source: popstartats.com\n\nOn a sober note, Taihuttu explained that regardless of the Bitcoin movement underway, the large tattoo on his forearm represents “an amazing 10 years of my and my family’s life since 2013, the year that I started mining Bitcoin.” And that’s more than enough reason to get Bitcoin ink."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXJlc3RzLWF0LTI4ay1hcy11cy1qb2JzLWRhdGEtYm9vc3RzLW5ldy1mZWQtcmF0ZS1oaWtlLWJldHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin rests at $28K as US jobs data boosts new Fed rate hike bets - Cointelegraph",
        "content": "Bitcoin (BTC) showed little interest in moving higher at the April 7 Wall Street open as fresh United States macro data boosted bets on further interest rate hikes.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalyst: Fed will keep hiking “until something breaks”\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it drifted around $27,900 on Bitstamp.\n\nU.S. nonfarm payrolls figures, the main macro data focus of the week, came in slightly below expectations, indicating unemployment rising more slowly than predicted.\n\nThis in turn raised market expectations that the Federal Reserve would persist in raising interest rates to combat inflation — at the expense of crypto and risk asset performance.\n\nThe odds of another 25-basis-point rate hike in May topped 70% on the day, according to CME Group’s FedWatch Tool, having previously circled 50%.\n\n“Another strong jobs report. Likely fuels speculation of a 25bps hike in May,” analytics resource Tedtalksmacro reacted on Twitter.\n\nFed target rate probabilities chart. Source: CME Group\n\nCaleb Franzen, senior market analyst at Cubic Analytics, concluded that this and other recent employment data showed that there were not “any major holes in the labor market data (yet).”\n\n“They’re going to keep going until something breaks,” he continued about Fed policy in part of a follow-up analysis on Twitter.\n\n“So far, the banks are chilling & intervention has worked. Depositors aren’t worried. The labor market is still too resilient and inflation is too high, though it’s decelerating. Disinflation is fully underway, but the Fed is bound by their own handcuffs.”\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nJust ahead of the report, monitoring resource Material Indicators uploaded order book data from Binance, which showed strengthening liquidity nearer the spot price.\n\nThis, as Cointelegraph reported the day prior, was apt to further “dampen” volatility.\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nDollar bounces with stocks\n\nElsewhere, U.S. equities traded up on the day, with the S&P 500 and Nasdaq Composite Index gaining 0.4% and 0.8%, respectively, at the open.\n\nRelated: Bitcoin ‘faces headwinds’ as US money supply drops most since 1950s\n\nThe U.S. dollar managed an uncharacteristic copycat bounce, meanwhile, heading back above the 102 mark to hit its highest levels in several days.\n\n“$USD strength still showing up fresh higher-high after the NFP report,” analyst James Stanley wrote in part of a Twitter response.\n\n“$DXY reacting with strength to data that isn’t necessarily all that strong.”\n\nU.S. dollar index (DXY) 1-hour candle chart. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kby1rd29uLWNvbnZlcnRlZC1zdG9sZW4tZnVuZHMtZnJvbS1sdW5hLXRvLWJpdGNvaW4tcy1rb3JlYW4tcHJvc2VjdXRvcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Do Kwon converted illicit funds from LUNA to Bitcoin: S.Korean prosecutors - Cointelegraph",
        "content": "South Korean prosecutors have identified 414.5 billion won ($314.2 million) in illicit assets associated with Terraform Labs co-founder Do Kwon and his associates. Out of the identified illegal assets, prosecutors have linked about 91.4 billion won ($69 million) of the specified amount directly to Kwon.\n\nAlthough Kwon amassed millions, none of the assets tied to him are recoverable or under the jurisdiction of the South Korean authorities. This is mainly because the now-arrested former CEO reportedly converted most of the illicit funds into Bitcoin (BTC) using overseas crypto exchanges instead of investing in physical assets, per a report published by local media outlet KBS.\n\nEarly investigation into the Terra collapse by the United States Securities and Exchange Commission revealed that Kwon siphoned nearly $100 million worth of Bitcoin from Terra post-collapse. In another report based on an SEC interview with former Terraform Labs, published in South Korean media, Kwon was accused of siphoning $80 million a month before the collapse of the Terra ecosystem.\n\nThe South Korean authorities have requested Binance to halt any withdrawal request associated with Kwon. Binance confirmed to Cointelegraph that they are cooperating with the prosecutors and offering any assistance they need.\n\n“We provided Korean LE authorities with the requested assistance. Since we cannot comment on ongoing LE investigations, for any further comment please reach out to the prosecutors.“\n\nSouth Korean prosecutors are actively tracing properties associated with Terraform Labs executives to recover some illicit funds from the Terra debacle. On April 3, prosecutors seized homes and other assets to stop former Terra employees from selling things that might be tied to legal cases.\n\nIn addition to the residences in Seoul owned by former CEO Shin Hyun-seong and others, the prosecutors also filed foreclosure actions against their foreign-registered vehicles, lands in Hwaseong and Gapyeong in Gyeonggi-do, and Taean in South Chungcheong Province.\n\nRelated: Do Kwon faces fraud charges from US prosecutors hours after arrest\n\nTerra was a booming crypto ecosystem until its $40 billion collapse in May 2022.\n\nWhat was initially thought to be a market-triggered event turned out to be a clear case of fraud, with former CEO Kwon at the epicenter. According to on-chain data, In the 3 weeks leading up to the depeg of the TerraUSD (UST) stablecoin, one entity dumped over $450 million of UST on the open market. Four days after the last sale, UST started collapsing. The entity behind the massive dump was none other than Terraform Labs.\n\nTFL has been perpetrating the narrative that UST was \"attacked\". This is a false flag. In reality, TFL themselves weakened the Curve pool by irresponsibly dumping a massive amount of UST in a short timeframe. This reduced liquidity and severely weakened the peg. — FatMan (@FatManTerra) December 6, 2022\n\nDespite an arrest warrant from South Korean authorities and an Interpol red notice against his name, Kwon continued to evade arrest for nearly a year before getting caught on March 23 in Montenegro."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjU3MTgvY3JhaWctd3JpZ2h0LWFwcGxlLWNvcHlyaWdodC1iaXRjb2luLXdoaXRlLXBhcGVy0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTcxOC9jcmFpZy13cmlnaHQtYXBwbGUtY29weXJpZ2h0LWJpdGNvaW4td2hpdGUtcGFwZXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Craig Wright Hints Apple May Be Violating Copyright by Storing Bitcoin White Paper - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nControversial computer scientist and self-proclaimed “creator of Bitcoin” Craig Wright today hinted that Apple was violating copyright laws.\n\nWhen asked on Twitter Friday if Apple might be “in breach of copyright” for storing the Bitcoin white paper on its computers, the Australian computer scientist responded by saying: “Yes.”\n\nThis week news dropped that the largest cryptocurrency’s explanatory paper was stored on Apple machines—unbeknownst to many Mac users.\n\nAD\n\nAD\n\nYes — Dr Craig S Wright (@Dr_CSWright) April 6, 2023\n\nJust by punching in a simple command into the Terminal, one can find a copy of Bitcoin’s foundational text on MacOS operating systems (Apple has a history of hiding files on its products for users to find.)\n\nAustralian programmer and lawyer Wright has long claimed that he is Bitcoin’s pseudonymous creator, Satoshi Nakamoto. He has repeatedly said that Bitcoin spin-offs derived from the cryptocurrency are in breach of his intellectual property rights because he came up with the original blockchain.\n\nAnd today, he appeared to be making the point that Apple was sharing his alleged seminal work without asking for permission first.\n\nBut Wright has also long been criticized for making such a claim and not having the proof to back it up: To do so, he’d have to show that he has the private keys to Satoshi’s Bitcoin address.\n\nAD\n\nAD\n\nWright’s lawyers told Decrypt in 2020 that he didn’t have them.\n\nDecrypt today asked Wright whether he would try and sue Apple for breach of copyright but did not immediately receive a response.\n\nIn February, Wright lost a claim in a UK court to protect the Bitcoin blockchain by copyright. He also hinted in December that he was no longer interested in convincing people that he created the world’s biggest digital asset.\n\nWright is also supports Bitcoin SV: a Bitcoin spin-off that emerged in November 2018 when Bitcoin Cash—another fork and currently the 30th biggest cryptocurrency—split in two.\n\nBitcoin SV proponents (Wright is perhaps the loudest cheerleader) call Bitcoin SV “the original Bitcoin” but it been delisted from a number of major exchanges.\n\nWright is no stranger to the courts: Reuters reports that he is currently in the process of suing 15 Bitcoin developers to retrieve around 111,000 BTC after he lost the encrypted keys to access them when his home computer network was allegedly hacked."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvYnRjLXdoaXRlLXBhcGVyLWhpZGRlbi1tYWNvcy1iaW5hbmNlLWxvc2VzLWF1cy1saWNlbnNlLWRvZ2UtbmV3cy1ob2RsZXJzLWRpZ2VzdC1hcHJpbC0yLTgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "BTC white paper hidden on macOS, Binance loses AUS license and DOGE news: Hodler's Digest, April 2-8 - Cointelegraph",
        "content": "Top Stories This Week\n\nBitcoin white paper is apparently hiding in Apple’s modern macOS\n\nSatoshi Nakamoto’s original white paper laying out the thesis for the Bitcoin network is seemingly hiding within every modern version of the operating system for Apple’s Mac computers. An April 5 blog post from technologist Andy Baio revealed that a PDF of the Bitcoin white paper has “apparently shipped with every copy of macOS since Mojave in 2018.” Baio told Cointelegraph he was trying to fix his printer and scan a document when Nakamoto’s white paper first appeared. He created a prompt in Terminal that enables others to easily access the white paper.\n\nBinance Australia Derivatives license canceled by securities regulator\n\nThe Australian Securities and Investments Commission has canceled the license of Binance Australia Derivatives after a targeted review of its operations in the country. The company’s clients will not be able to increase derivatives positions or open new positions with the platform from April 14, and existing derivatives positions must be closed before April 21. The Australian securities regulator also revealed that it has been conducting a targeted review of Binance’s financial services business in Australia, including its classification of retail and wholesale clients. Spot trading on Binance is still available for Australian residents.\n\nFTX philanthropic donations have created a complex dilemma for recipients\n\nFTX philanthropic arm had pledged $1 billion in donations toward research academics across prestigious universities. Its team, however, resigned after FTX filed for bankruptcy on November 11, 2022. Now, many scholars and researchers who were early recipients of the grant are now stuck in limbo over payment of further grants for their programs, while many studying on the FTX grant were forced to drop out of their courses due to the fear of repayment. FTX Future Fund’s grants were focused on research projects for the safe development of artificial intelligence, reducing catastrophic bio-risk, improving institutions, economic growth, great power relations and effective altruism, among many others.\n\nElon Musk changes Twitter icon to Doge after seeking lawsuit dismissal\n\nTwitter’s traditional bird mascot was replaced on April 3 with an image of a Shiba Inu, the icon of the popular meme token Dogecoin. The update came two days after the social media platform’s CEO Elon Musk asked a United States judge to dismiss a $258 billion lawsuit filed by investors alleging the operation of a pyramid scheme to promote Dogecoin. Musk’s lawyers, however, argue that “funny pictures” and “tweeting words of support” do not amount to a fraud claim. As for this week, the marketing move positively impacted the altcoin’s price, with the DOGE token surging by over 22% one hour after the icon was changed.\n\nUS Bitcoin reaches tentative settlement to reopen Niagara Falls mining facility\n\nCrypto miner US Bitcoin Corp has come to a tentative agreement with the City of Niagara Falls that will allow it to reopen its local mining operation, according to media reports. A state supreme court judge ordered its plant closed in early March. The settlement still requires the approval of the city council. Under the potential agreement, the company will have to pay $150,000 in fees to the city and $180,000 to reimburse legal costs and new application fees, alongside a $1 million fine. US Bitcoin Corp must also implement measures to reduce noise at the plant, including building a noise-dampening wall and submitting to third-party monitoring.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $27,928, Ether (ETH) at $1,857 and XRP at $0.51. The total market cap is at $1.18 trillion, according to CoinMarketCap.\n\n\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Injective (INJ) at 21.19%, Enjin Coin (ENJ) at 17.75% and Basic Attention Token (BAT) at 9.19%.\n\n\n\nThe top three altcoin losers of the week are Mask Network (MASK) -15.39%, Stacks (STX) at -14.84% and Arbitrum (ARB) -13.88%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“Creators deserve to be rewarded for their original work being used by AI engines which are raiding the style and tone of not only journalists but […] musicians, authors, poets, historians, painters, filmmakers and photographers.”\n\nMichael Miller, executive chairman of News Corp Australia\n\n“The objective of a CBDC within the framework of the payment system in Peru is to give the unbanked population access to digital payments.”\n\nCentral Reserve Bank of Peru\n\n“How can we supervise firms that have no physical borders? We need to put more thought into how it [international coordination] can be effective in regulating the crypto world.”\n\nElizabeth McCaul, supervisory board member of the European Central Bank\n\n“As investors adapt to volatility, they are diversifying their portfolios and adding more innovative products. Even with a tumultuous year in crypto, interest hasn’t cooled entirely.”\n\nBrown Brothers Harriman\n\n“The possibilities that Web3 can offer are vast and only limited by our own imaginations.”\n\nHaider Rafique, global chief marketing officer at OKX\n\n\n\n“AI technology and its effects on privacy is a priority for my Office. […] We need to keep up with – and stay ahead of – fast-moving technological advances.”\n\nPhilippe Dufresne, privacy commissioner of Canada\n\nPrediction of the Week\n\nBitcoin rests at $28K as US jobs data boosts new Fed rate hike bets\n\nBitcoin’s price is still ranging around $28,000 at the end of the week as the BTC/USD pair shunned volatility over the previous days. The highly anticipated U.S. nonfarm payroll figures came in slightly below expectations on April 7, indicating unemployment rising more slowly than predicted.\n\nThe data also raised market expectations that the Federal Reserve would persist in raising interest rates to combat inflation — at the expense of crypto and risk asset performance.\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, summarized his expectations. “Bitcoin remains in a boring state of mind. Consolidating for weeks, while old altcoins are breaking out,” he noted. “I’m still looking at support here, through which $27,600 needs to sustain. If that’s lost, $25,000-25,400 seems likely. Holding here through NFP -> $30,000 next.”\n\nFUD of the Week\n\nUS state regulators announce $10M settlement with Robinhood ‘for failing investors’\n\nThe California Department of Financial Protection and Innovation announced a settlement with crypto and stock trading platform Robinhood involving an up to $10.2 million payment in penalties “for operational and technical failures that harmed main street investors.” The platform suffered a series of system outages in March 2020 causing users to miss out on trades while many of its services were unavailable. The platform’s outages led some affected users to file a class-action lawsuit against Robinhood. The U.S. Financial Industry Regulatory Authority also penalized the firm for roughly $70 million for causing “widespread and significant harm” to thousands of users.\n\nSentiment recovers $870K after negotiations with hacker\n\nLending protocol Sentiment managed to recover over $870,000 in stolen funds by offering the hacker a bounty worth $95,000. The protocol was exploited on April 4, with losses closer to $1 million. In a transaction on the Arbitrum blockchain, Sentiment sent a message to the hacker offering $95,000 if the funds were returned by April 6, and urging the hacker to “do the right thing.” Community members criticized crypto companies for not taking bug bounties seriously and praised the hacker’s efforts for “taking it by force.”\n\nOpenAI faces Canadian privacy probe alleging personal info harvesting\n\nOpenAI, the creator of the artificial intelligence chatbot ChatGPT, is under investigation by Canada’s privacy commissioner for allegedly collecting and using personal information without consent. Canada’s investigation comes as Germany, France, Ireland and Spain eye possible action against AI following a temporary block on ChatGPT in Italy. In the United States, the Center for Artificial Intelligence and Digital Policy (CAIDP) filed a March 30 complaint with the Federal Trade Commission in an attempt to halt the release of powerful AI systems to consumers.\n\nBest Cointelegraph Features\n\nCrypto security audits and bug bounties are broken: Here’s how to fix them\n\nChristos A. Makridis argues the most popular Web3 auditing companies aren’t always the ones telling projects things they don’t want to hear.\n\nBitcoin in Senegal: Why is this African country using BTC?\n\nOut of the ashes of scams, meddling foreign interests and traffic jams is a country evolving into a thriving circular Bitcoin economy..\n\nNFT Creator, The Sarah Show: Analog childhood meets dizzying digital future\n\nThe Sarah Show takes people out of the present moment and creates a different experience of time through highly distinctive art."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZmluYm9sZC5jb20vc2VsZi1wcm9jbGFpbWVkLXNhdG9zaGktYWNjdXNlcy1hcHBsZS1vZi12aW9sYXRpbmctY29weXJpZ2h0LWJ5LXB1dHRpbmctYml0Y29pbi13aGl0ZS1wYXBlci1vbi1tYWNib29rcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Self-proclaimed Satoshi accuses Apple of violating copyright by putting Bitcoin white paper on MacBooks - Finbold - Finance in Bold",
        "content": "As soon as it was discovered that the Bitcoin white paper was integrated into Apple’s macOS operating systems, self-proclaimed Satoshi Nakamoto Dr. Craig Wright accused the tech giant of breaching copyright laws.\n\nIndeed, on April 6, Wright turned to Twitter to respond to a message which stated that Apple might be infringing upon copyright. The tweet also asked for the computer scientist’s view on the matter after it came to light earlier this week that the Bitcoin white paper is buried deep inside new MacBooks; White said, “Yes.”\n\nYes — Dr Craig S Wright (@Dr_CSWright) April 6, 2023\n\nSome on social media have openly encouraged Wright to sue Apple, even though doing so would almost certainly fail or be counterproductive given the company’s financial and legal resources.\n\nBitcoin White Paper on MacBook. Source: Andy Baio\n\nBitcoin White Paper hid inside MacBooks\n\nNotably, Finbold reported on April 6 the first discovery was made by tech writer Andy Baio, who discovered that a copy of the white paper had been covertly hidden in Apple’s macOS since the Mojave version in 2018.\n\nThe self-proclaimed Satoshi is well-known for his contentious approach to asserting intellectual property rights over Bitcoin and its underlying technology.\n\nPatent trolling refers to submitting many patent applications all at once, in this case, covering Bitcoin and blockchain technologies. Wright hopes to have legal authority over the further creation and use of the technology in this manner.\n\nIn doing so, an individual or company can take legal action against other businesses to protect their intellectual property. Because of this, they may ask for expensive licensing and royalty payments and fight costly legal disputes."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm1hY29ic2VydmVyLmNvbS90aXBzL2hvdy10by9maW5kLWhpZGRlbi1iaXRjb2luLXdoaXRlcGFwZXItbWFjb3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "How to Find the Hidden Bitcoin Whitepaper in macOS - The Mac Observer",
        "content": "There are often Easter eggs found within Apple’s various operating systems. In the latest find, sleuths discovered a PDF copy of Satoshi Nakamoto’s Bitcoin whitepaper hidden within macOS for years. In fact, it’s shipped with every copy of the Mac operating system since macOS Mojave in 2018. Let’s walk through how you can find this hidden gem.\n\nWhich Versions of macOS Have the Bitcoin Whitepaper?\n\nAccording to Andy Baio, Nakamoto’s technical paper on the first cryptocurrency has been included in every version of macOS since 10.14 Mojave. You won’t find it, though, in macOS 10.13 High Sierra or earlier.\n\nI’ve confirmed for myself that it’s present on macOS Ventura 13.3. Someone at Apple squirreled it away inside an Image Capture device called “Virtual Scanner II.”\n\nIt’s rather perplexing, because that device doesn’t seem to appear for everyone in the Image Capture utility. For those who do have it, though, the Bitcoin whitepaper serves as a sample document for the device. Some suggest Virtual Scanner II might be used to power the “Import from iPhone” feature, but I’ve been unable to confirm that.\n\nFinding the Hidden PDF On Your Mac\n\nThat being said, here are two ways you can locate the hidden PDF. You can do this either from Terminal or Finder, with Terminal being (surprisingly) the easiest method.\n\nOpening the Bitcoin Whitepaper Using Terminal\n\nThe quickest and easiest way to view this whitepaper is going to be from the command line. Here’s what you need to do.\n\nOpen Applications > Utilities > Terminal. From Terminal, enter the following command all on a single line:\n\nopen /System/Library/Image Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nThe Bitcoin PDF should open immediately in Preview.\n\nNavigating to the Easter Egg With Finder\n\nIf Terminal’s not inside your comfort zone, fear not. There is another way to open up Satoshi’s Bitcoin treatise.\n\nTime needed: 1 minute To open the Bitcoin whitepaper using Finder, just follow these steps. Click the Finder icon in the Dock. Click on Macintosh HD. Open System > Library > Image Capture > Devices. Right-click on VirtualScanner.app, then click Show Package Contents. Now open Contents > Resources. Double-click the simpledoc.pdf file.\n\nHere Today, Gone Tomorrow?\n\nIf you want to snag that PDF copy, you may want to follow one of the guides above sooner rather than later. According to our sources, someone at Apple filed the document’s presence as an issue/bug nearly a year ago.\n\nWhile the person who reported the “bug” hasn’t taken any action or commented on it since then, other sources say the file will “likely be removed in future versions.”\n\nPersonally, I think Apple should leave it, as it’s completely harmless. It’s definitely not the problem posed by an earlier Image Capture bug that could fill your entire storage device with empty data."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vdGVjaC5oaW5kdXN0YW50aW1lcy5jb20vdGVjaC9uZXdzL2JpdGNvaW4tcHJpY2Utd2lsbC1nby10by10aGUtbW9vbi13aGVuLXRoaXMtaGFwcGVucy03MTY0OTMwNDc5MTI1MS5odG1s0gF1aHR0cHM6Ly90ZWNoLmhpbmR1c3RhbnRpbWVzLmNvbS9hbXAvdGVjaC9uZXdzL2JpdGNvaW4tcHJpY2Utd2lsbC1nby10by10aGUtbW9vbi13aGVuLXRoaXMtaGFwcGVucy03MTY0OTMwNDc5MTI1MS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price will go to the ‘Moon’ when this happens? - HT Tech",
        "content": "Billionaire crypto investor Michael Novogratz says that once the Federal Reserve takes a pause, Bitcoin could start to take off again.\n\nNovogratz, who leads Galaxy Digital Holdings, predicted the central bank under the helm of Jerome Powell will remain “very hawkish for a while” due to high inflation, and will likely raise interest rates by 50 basis points soon. But as the economy slows down and the Fed steps back, “Bitcoin goes to the moon,” he said, repeating a popular crypto catchphrase.\n\nNovogratz was speaking at the “Bitcoin 2022” conference in Miami, which kicked off on Wednesday with the unveiling of a bull statue that commemorates the city's partiality toward cryptocurrencies and the digital-assets industry. The event has attracted more than 25,000 attendees.\n\nNovogratz also reiterated a call that Bitcoin will eventually reach a price of $500,000 and eventually $1 million. The largest digital currency fell about 3.3% to $44,366 as of 10:34 a.m. Eastern time.\n\n“I go to bed and I pray that the stewards of the U.S. economy don't screw it up,” he said, adding that he has Russian friends who have gone “bankrupt” recently. “And so I really do pray that the dollar is going to be strong and it doesn't go to infinity because Bitcoin going to infinity means the rest of the Western world has really fallen apart,” he said, though Bitcoin can reach his price targets “with stability in the West.”\n\nBitcoin has recently traded in a narrow range -- it hasn't been able to meaningfully break out above $48,000 and is down so far this year. Proponents have been debating which of its narratives -- including whether it's an inflation hedge or not -- is most prevalent at the moment and which story could likely end up sticking for the long run.\n\nNovogratz said that though Bitcoin has largely traded in tandem with the tech-heavy Nasdaq 100, it could be in the process of disabusing itself from that relationship. Bitcoin's purpose, he says, won't be for purchasing everyday items, like shoes. But, “it's that I'm going to take some of my wealth and preserve and store it there.” The coin, he added, is becoming a part of institutional portfolios."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LWhpdHMtYWxsLXRpbWUtaGlnaC1mb3ItdGhlLTR0aC10aW1lLWluLTIwMjMtaGVyZXMtd2h5L9IBeWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LWhpdHMtYWxsLXRpbWUtaGlnaC1mb3ItdGhlLTR0aC10aW1lLWluLTIwMjMtaGVyZXMtd2h5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Mining Difficulty Hits All-Time High For The 4th Time In 2023: Here’s Why - NewsBTC",
        "content": "Bitcoin mining difficulty continues to break records despite the struggles of BTC to surpass the $30,000 resistance mark. The leading coin has attracted the interest of miners in recent months due to the price recovery experienced since the turn of the year.\n\nBitcoin Mining Difficulty Hits New Record\n\nBitcoin mining difficulty moved to an all-time high on April 6, 2023, following the most recent mining difficulty adjustment on its blockchain network. The mining difficulty rose for the fourth consecutive time and reached 47.8 trillion, an increase of 2.3%.\n\nThe Bitcoin mining difficulty automatically adjusts every 2,016 blocks – approximately two weeks – to maintain the 10-minute block creation time. There has been a steady increase in mining difficulty in recent weeks, with the last downward trend recorded on February 11.\n\nOne of the consequences is reflected in the hash price, which is the rate of profit miners make for the hashrate they provide to the Bitcoin network. In theory, a higher mining difficulty leads to a lower hash price. This is because more miners are contributing computing power than normal, leading to more competition for the rewards that the Bitcoin network provides miners that produce new blocks on the network.\n\nRelated Reading: Buckle Up! Bitcoin Bollinger Bands Signal An Impending Rollercoaster Ride\n\nFurthermore, the Bitcoin hashrate or processing power can indicate the degree of mining difficulty. At the time of the mining difficulty adjustment that preceded the latest one, BTC’s hash rate was at a record high leading to increased mining difficulty.\n\nHowever, this has changed recently, with the hashrate falling by an average of 20 EH/s this week. It should be noted that Bitcoin’s hashrate varies as measured by different sources. For example, BTC.com places the metric at 338 EH/s, and mempool places this at a slightly higher metric of 347/ EH/s\n\nBullish Market A Major Reason For Increased Mining Difficulty\n\nBitcoin has appreciated by more than 50% since the start of 2023, leading to calls for a bullish market. Unsurprisingly this positive trend has led to many miners reconnecting their equipment after a difficult 2022.\n\nRelated Reading: Uniswap Who? Trader Joe’s AMM Takes DeFi By Storm\n\nThe collapse of Terra Luna and subsequent fallout from FTX led to significant bearish pressure on the market, with several coins taking steep price declines. Bitcoin was one of the coins to dip, leading to a difficult year for miners, with many having to sell their equipment or shut down operations to stay afloat.\n\nHowever, the bull run of 2023 has raised expectations from miners that the market could be on its way to previous levels. Nonetheless, the crypto mining sector has not been without its difficulties, with friendly places like Texas in the United States planning to tighten regulations on electricity that could affect the booming sector soon.\n\nFeatured image from unsplash, charts from mempool and Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm1hY3dvcmxkLmNvbS9hcnRpY2xlLzE3ODA0NDUvaG93LXRvLWZpbmQtdGhlLWJpdGNvaW4td2hpdGVwYXBlci1oaWRkZW4taW4tbWFjb3Mtd2hpbGUteW91LXN0aWxsLWNhbi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "How to find the Bitcoin whitepaper hidden in macOS (while you still can) - Macworld",
        "content": "Ever notice that macOS takes up a whole lot of storage space? There’s a lot of code in macOS, and apparently, some of it is not what you’d expect, as Andy Baio found out earlier this week. On Baio’s blog, Waxy.com, he wrote about his discovery of Satoshi Nakamoto’s Bitcoin whitepaper that is stashed within macOS.\n\nThe paper, titled “Bitcoin: A Peer-to-Peer Electronic Cash System,” explains the Bitcoin electronic cash system and was originally published in 2008. The paper has apparently shipped with every copy of macOS since Mojave in 2018. Why? No one really knows. Baio theorizes that it was used as a test document.\n\nBaio notes that “a little bird” told him that the paper could be removed in a future version of macOS. So if you want to see it, here’s how.\n\nSee the hidden Bitcoin whitepaper via the Terminal\n\nOpen the Terminal app (it’s in Applications > Utilities) and enter the following:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nSee the hidden Bitcoin whitepaper via the Finder\n\nDon’t want to use the Terminal? Do the following:\n\nIn the Finder, open the Go menu and select Go to Folder. In the Go to Folder that appears enter the following: /System/Library/Image Capture/Devices Press the Return key. The Finder window should appear with a VirtualScanner app icon. Control-click (or right click) VirtualScanner and select Show Package Contents. The Finder window should show a Contents folder. Open it. Open the Resources folder. Open (or use Quick Look) the file named simpledoc.pdf.\n\nThe gif below shows how to navigate to the whitepaper the long way, by opening the nested folders.\n\nFoundry\n\nLong-held secret\n\nWhile Baio and others have recently discovered this, Joshua Dickens tweeted about it in 2020. Dickens also points out that there’s an image that resembles a Thomas Hawk photo in the same folder as the Bitcoin whitepaper.\n\nHere's a mystery: why do I have an Image Capture device called Virtual Scanner II on my Mac? It shows a preview of a painted sign that for some reason closely resembles a photo by @thomashawk on 'clustershot'? But not exactly — the scanned version looks more weathered. pic.twitter.com/jPb5kx3NyS — Josh D (@schwa23) November 28, 2020\n\nThe VirtualScanner stuff is just one of the hidden mysteries of macOS. Now if only we can figure out the mysteries of macOS Ventura 13.3…"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmRhaWx5ZnguY29tL25ld3Mvd2lsbC1zeXN0ZW1pYy1yaXNrcy1tYWtlLW9yLWJyZWFrLWJpdGNvaW4taW4tcTItMjAyMzA0MDguaHRtbNIBXmh0dHBzOi8vd3d3LmRhaWx5ZnguY29tL25ld3Mvd2lsbC1zeXN0ZW1pYy1yaXNrcy1tYWtlLW9yLWJyZWFrLWJpdGNvaW4taW4tcTItMjAyMzA0MDguaHRtbC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Will Systemic Risks Make or Break Bitcoin in Q2? - DailyFX",
        "content": "Bitcoin Q2 Fundamental Outlook\n\nBitcoin prices enjoyed a 60% rally in the first quarter, allowing the largest cryptocurrency to recover a fair portion of last year’s losses. As fears of financial instability continue to drive risk sentiment, Bitcoin prices have surged and could continue to be driven by the same systemic risks in the second quarter.\n\nIn Q2 of 2023, the main factors to watch are:\n\nRecession fears (rising risks of a recession could be a major headwind for speculative assets if the banking sector regains confidence).\n\n(rising risks of a recession could be a major headwind for speculative assets if the banking sector regains confidence). Inflation and monetary policy (ECB and the Federal Reserve have reiterated their intention to raise rates in inflation remains elevated).\n\n(ECB and the Federal Reserve have reiterated their intention to raise rates in inflation remains elevated). Financial regulations imposed on digital currency and a potential Lawsuit between the SEC (Securities Exchange Commission) and Coinbase (one of the largest crypto exchanges). Depending on the developments and the outcome, this could be another risk factor to monitor closely.\n\nWill Systemic Risks Make or Break Bitcoin?\n\nAfter a strong start to 2023, prices rallied nearly 40%, before settling at a key level of technical resistance around the September 2022 high of $22,781. As Fed expectations continued to drive sentiment, a robust labor market and persistently high levels of inflation opened the door for the Federal Reserve to consider raising rates more aggressively.\n\nStocks, commodities, and cryptocurrencies, to a certain extent, do not earn interest, so a high-interest rate environment does not bode well for these non-yielding assets. After a series of aggressive rate hikes throughout 2022, markets had expected the pace of monetary policy tightening to ease. However, as the Fed and the ECB remained fixated on fulfilling the objectives of the dual mandate (to achieve full employment and price stability), inflation remained well above the 2% target. This caused both major central banks to consider hiking rates more aggressively to tame price pressures.\n\nSource: Refinitiv\n\nWill Contagion from the Banking Crisis Continue to Support Digital Assets?\n\nHowever, following the collapse of SVB (Silicon Valley Bank), Signature Bank, and the ongoing problems at First Republic Bank, pressure mounted on the Fed to consider pausing its rate cycle.\n\nAlthough the financial sector remains vulnerable to contagion that could result in an increase in the number of bank failures, the probability of additional rate hikes has been reduced. Instead, many expect the Fed to announce rate cuts by the end of the year.\n\nSource: Refinitiv\n\nAs a result, the combination of the eroding credibility of the banking sector, a weaker US Dollar, and a potential Fed pivot has boosted the appeal of digital assets. As Bitcoin and its major counterparts continue to monitor the geopolitical backdrop, fundamentals will likely remain as the primary catalyst for price action. With prices currently trading at their highest level since June last year, both technical and fundamentals could assist in driving the prominent trend."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDQvYml0Y29pbi1taW5lci1yZXZlbnVlLWluLW1hcmNoLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Earn Over $755 Million in March 2023 Alone as Hashrate Hits All-Time Highs - bitcoinke.io",
        "content": "Bitcoin’s mining difficulty, the amount of effort and time needed to find a proper hash for each blockchain block, continues to increase as of April 7 2023.\n\nThe latest #Bitcoin block difficulty adjustment pushes the difficulty metric to 47.89 trillion – another record high. As a result, it's harder than ever to mine a Bitcoin block. pic.twitter.com/rAVb9SdUgI — BitKE (@BitcoinKE) April 8, 2023\n\nThe mining difficulty of Bitcoin is adjusted automatically approximately every two weeks in response to changes in the hashrate of the network. This adjustment is necessary to maintain a block processing time of approximately 10 minutes and prevent the network from either slowing down or speeding up over time.\n\nThe latest rise in Bitcoin mining difficulty marks the fourth consecutive increase, with the previous three increases being 9.95%, 1.16%, and 7.56% as highlighted on btc.com. These increases indicate that the network has been responding to the gradual growth of the hashrate.\n\nThe most recent adjustment to the block difficulty has pushed the difficulty metric to a new all-time high of 47.89 trillion, making it more challenging than ever to mine a block and obtain a bitcoin. The next difficulty adjustment is expected to occur in about 12 days.\n\nThe average computation power, or hashrate, of the entire Bitcoin network has also reached an all-time high of 342.16 EH/s. Meanwhile, the average block verification and production time, known as block times, remains below ten minutes.\n\nAt the same time, while bitcoin’s network difficulty and hash rate increased, making the network more expensive to mine, so has miner revenue increased. Miners receive bitcoins, the native currency of the blockchain, as a reward for validating blocks and processing transactions. The revenue earned by miners takes into account both inflation rewards, known as block subsidies, and transaction fees.\n\nWhile most miner revenue comes from the block subsidy – 6.25 BTC per block right now – which is a constant in BTC terms, transaction fees are also a way for miners to generate revenue.\n\nIn March 2023, bitcoin miners earned almost $732 million from block subsidies, which is their primary source of revenue. When transaction fees are added to this figure, their total earnings amounted to $755 million. Despite this increase, their profitability still falls significantly below the all-time highs.\n\nThe rise in revenue for bitcoin miners is closely linked to the value of the cryptocurrency they are mining. Since the beginning of the year, the price of bitcoin has surged by 69%, and in the past month alone, it has risen by nearly 26%. This increase in value has more than offset the higher costs associated with mining resulting in higher profitability for miners.\n\n_____________________________________\n\nFollow us on Twitter for the latest posts and updates\n\nJoin and interact with our Telegram community\n\n_____________________________________\n\n_____________________________________"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9wYXJpcy1lbWVyZ2VzLWFzLXRoZS1uZXh0LWNyeXB0by1odWItYml0Y29pbi1ldGhlcmV1bS1hbmQtc2lnbnVwdG9rZW4tY29tLWFyZS10aHJlZS1hbHRjb2lucy10by13YXRjaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Paris Emerges as the Next Crypto Hub: Bitcoin, Ethereum, and Signuptoken.com are Three Altcoins to Watch - Analytics Insight",
        "content": "Paris is positioning itself as the next major hub for the cryptocurrency industry, despite the closure of several crypto-friendly banks and the failure of FTX. The French government is showing support for the crypto industry and blockchain technology, with President Emmanuel Macron seeing cryptocurrency as a way to attract businesses to the region. This has significant implications for major crypto coins like Bitcoin and Ethereum, as well as newer tokens such as Signuptoken.com.\n\nSignuptoken.com: A Revolutionary Crypto Project\n\nSignuptoken.com is a new crypto project with a unique concept. Its goal is to create generational wealth by registering a single email that will help subscribers retire early. The project aims to accumulate one million email subscribers before launching its token on Uniswap. Currently, Signuptoken.com has already accumulated 3,000 email subscribers, bringing it one step closer to its target.\n\nSubscribers will receive regular email updates on the project’s progress. Once the one-million email subscription goal is reached, the team will send out a single email announcing the launch of the ERC-20 token. The project is attempting something that has not been achieved on a global scale before.\n\nTo ensure the validity of the project’s one million email subscription goal, the team will send out a verification email to confirm that all users added are genuine. The team has not revealed their identities and will not be providing tokenomics about the crypto coin.\n\nBitcoin: A Strong Investment Choice\n\nBitcoin is currently the largest cryptocurrency on the market, and more and more establishments are starting to accept it as a payment method. In Paris, Burger King has introduced power bank rental machines called Instpower, which accept crypto payments such as BTC. These machines are connected to Binance Pay and Alchemy Pay.\n\nThis move by Burger King in Paris is part of a larger trend of companies embracing cryptocurrency payments, highlighting the growing acceptance and legitimacy of digital currencies. With the rise of crypto and the growing demand for alternative payment methods, more businesses will likely start accepting cryptocurrency payments in the near future.\n\nEthereum Holders Await Price Rally\n\nMany Ethereum holders are eagerly anticipating a price rally, as suggested by crypto analyst Justin Bennett. Bennett speculates that Ethereum may face a rally that could liquidate traders facing bearish action on ETH’s platform. The rally at the end of March could hint at the crypto market’s short-term performance.\n\nWhile the crypto market is typically affected by stock market trends, there is often a lag between the two asset classes. If the crypto market takes cues from equities, a resistance level at $1,840 for Ethereum is possible. Therefore, a short squeeze could occur, triggering rallies, as there is a considerable amount of short liquidations over the $2,000 price level.\n\nEmbracing the Future of Finance with Crypto Coins\n\nAs Paris embraces cryptocurrency and recognizes its benefits and potential as an alternative to traditional forms of currency, it may inspire other countries to follow suit. While crypto investments do carry risks due to economic conditions and market volatility, accepting crypto as part of the future of finance can help everyone adapt to the changing landscape of the digital economy.\n\nSignuptoken.com could become the next major crypto coin to launch on an exchange. Learn more about this unique crypto project and sign up to reap the early benefits when the coin launches.\n\nVisit Signuptoken.com today:\n\nWebsite: https://www.signuptoken.com\n\nTwitter: https://twitter.com/_SignUpToken_\n\nTelegram: https://t.me/SignUpToken\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tY2FzaW5vLWdhbWluZy10cmVuZHMtaW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Casino Gaming Trends in 2023 - Analytics Insight",
        "content": "The year 2022 was a successful one for crypto casinos. Mobile gaming had a sharp rise, general improvements, and the introduction of new cryptocurrencies as payment options.\n\nThe hold and win slots have taken the gaming industry by storm. Additionally, once 2023 begins, you can only anticipate seeing more innovation given the popularity and profitability of cryptocurrency casinos.\n\nThe cryptocurrency gaming sector, albeit young, has already altered the way we view casinos. Today, you may use cryptocurrencies to place bets and improve your investment portfolio while still protecting your privacy and personal information. However, the cryptocurrency gaming industry is always changing, so in 2023 you may expect some fascinating developments to emerge.\n\nSome of the major trends to expect in the bitcoin casino gaming industry in 2023 include:\n\nChanges in crypto payment\n\nEvery casino’s payment method will undergo significant modifications in 2023. Some bitcoin casinos have started bypassing exchanges. On their website, they provide you the option to buy cryptocurrencies directly from them.\n\nThis greatly simplifies the procedure of making deposits at casinos. Additionally, it increases the accessibility of crypto casinos for a much bigger player base.\n\nYou may make a purchase using the program and your debit/credit card or Google Pay. Your casino account receives your money right away. In 2023, we can anticipate finding this function at any crypto casino.\n\nThe advent of original games with provable fairness\n\nProvably fair games are the obsession of cryptocurrency gamers. You may utilize blockchain technology to check the fairness of these games. Bitcoin casinos have gone the extra mile to provide players with more of a good thing by developing their own due to their popularity with players.\n\nAuthentic crash games, Plinko, dice games, and more are available. And throughout 2023, you can anticipate not just seeing this tendency persist but also growing.\n\nMany renowned bitcoin casinos have employed a group of game developers to produce brand-new, original games. There are no other casinos that offer these games. There are many other provably fair games available, including online slots, roulette, poker, and more.\n\nCreation of mobile-compatible casino games\n\nToday’s mobile-first revolution has been fueled by the release of new features, the widespread use of smartphones, and the increased accessibility of high-speed internet.\n\nIn most international markets, 80% of all gamblers in the gaming sector utilize mobile devices. According to recent estimates, internet devices now provide 70% of the income for the online betting sector.\n\nThis trend will undoubtedly impact the business over the coming several years by encouraging the development of casino games and activities that can be played on mobile and wearable devices.\n\nImproved online safety capabilities\n\nYou already experience higher levels of online safety when you play at cryptocurrency casinos rather than conventional betting sites. You can protect your financial and personal data by making deposits and withdrawals using your cryptocurrency wallet.\n\nHowever, there are undoubtedly some frauds in the field of online betting. To shield people from the consequences of malware and phishing attempts, the industry is swiftly adjusting. Even more crucially, the most trustworthy Bitcoin betting sites make use of top-notch software infrastructure and get the required certifications to increase consumer confidence.\n\nVR and AR gaming\n\nTechnologies like virtual reality and augmented reality have significantly contributed to the growth of the digital entertainment sector as a whole. And the cryptocurrency gaming market is by no means an exception.\n\nThese technological advancements enable you to have a lot more immersive gaming experience. You can imitate the special feelings you would have while playing at your preferred physical casino.\n\nAt the moment, the price of VR and AR headsets as well as their size continue to be a major barrier to their widespread acceptance. But as these technologies advance, more and more gamers opt to participate in VR gambling sessions in 2023 and beyond.\n\nCreation of robust bitcoin casino communities\n\nWith its players, crypto casinos are setting the groundwork for a better feeling of community. This was accomplished in the past through ongoing advertising offers and internet forums.\n\nBut it seems like casinos are trying to promote a feeling of family among their patrons. As a consequence, we are beginning to notice more public community conversations where you may interact with others, pose questions, win prizes by providing the answers to trivia questions, and give one another advice.\n\nThis kind of interaction has previously been seen in multiplayer games, such as the group conversations found in real-money casino games. However, we are now observing it more clearly at bitcoin casinos. If you’re new to casinos and looking for assistance or advice on how to enhance your games, this can be extremely beneficial.\n\nA more immersive casino experience\n\nThe crypto online casino industry has lagged behind other segments of the digital entertainment market in terms of gameplay and visuals. However, it’s unlikely that this tendency will continue for very long.\n\nToday’s bitcoin casinos use a variety of elements to make the gameplay more interesting. The casinos also want to improve the visual attractiveness of their gaming tables and slot machines. Utilizing specialized programming languages and graphic design methods are a couple of these.\n\nNot all cryptocurrency casinos are made equal or have the same features. However, advancements in visuals and user experience across the board can help you make an informed decision and personalize your gaming experience.\n\nAn emphasis on online privacy\n\nThe amount of secrecy offered by crypto casinos is one of the key factors that encourage gamblers to utilize them. You may protect your online privacy and participate in anonymous games without having to provide any money or personal information.\n\nThe industry is anticipated to continue developing in this manner during the next years to enhance consumer safety and privacy. New features that will soon be introduced include registration-free gaming and increased degrees of adherence to national privacy laws like GDPR.\n\nLive player option\n\nBuilding a thriving gaming community goes hand in hand with this latest iteration of bitcoin casino promos. Numerous bitcoin casinos are now scanning your data and analyzing your playing behavior using AI software.\n\nThis enables the promotions department of the casino to create a more accurate player profile for each user. The information will also allow the casino to build customized casino offers for you based on the games you prefer playing.\n\nA bitcoin casino may discover, for instance, that you play Aviator frequently and at around the same time each month. If the casino notices that tendency, it may send you an email or a direct message and give you free spins for your favorite game.\n\nAdditionally, casinos have the option to do this in real-time to improve benefits for VIP players. To provide you with more personalized VIP perks, they connect you with the VIP manager. The relationship between you and the casino will be strengthened thanks to these methods and technologies. They genuinely provide you with a singular experience that you can’t get anyplace else.\n\nEsports gambling\n\nOver the past ten years, there have been significant changes in the esports betting industry. Some of the finest gambling platforms have recently integrated eSports gaming into their libraries as a result of recent developments in the bitcoin casino market.\n\nEven though players haven’t been drawn to eSports at bitcoin casinos, the top casinos are always working to include additional eSports elements into their platforms. Therefore, it is projected that eSports gambling would become popular at online casinos in 2023.\n\nOther potential gambling trends for 2023\n\nSome of the crypto gambling trends that you may or may not experience in 2023 include:\n\nGamification\n\nIf you play video games or know someone who does, you’ve seen some popular patterns emerge. Now, you may buy skins, specialized skills and weapons, and other items straight from within the game. This is an additional area where bitcoin casinos may start to see how they may improve the gaming experience.\n\nCasinos may start to offer avatar creation and customization tools so that users may create unique avatars for their user accounts. We can undoubtedly anticipate that this strategy, which has been quite effective in mobile gaming, will soon spread into iGaming.\n\nCasinos are also introducing Wheels of Fortune loyalty programs as another kind of gamification. You may spin the wheel and win quick cryptocurrency rewards at several casinos’ daily free spins events.\n\nTop crypto casinos are also quite popular with level-up systems, where you get fresh incentives for each level you advance to. Increased cashback payouts, free spins on well-known games, fast cash awards, and other incentives can be prizes.\n\nTokens\n\nNumerous cryptocurrency casinos have started awarding players with custom tokens. Casino tokens may be exchanged for items like free spins, cash, and other things. Similar to how cryptocurrency prices vary, the value of these assets will be as well.\n\nWhether gamers will desire or utilize them is the key question in this. It all down to how it is done. These assets should be special and accomplish something that eventually improves the overall user experience since you don’t want to give away pointless rewards. Although many casinos have started token and NFT marketplaces, they are still relatively comparable to most VIP loyalty programs.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L211bWJhaS9leC1lbXBsb3llZS1vZi1zaGFyZS10cmFkaW5nLWNvbXBhbnktZHVwZWQtb2YtcnMtNC1sYWtoLWluLW1vbmV5LWRvdWJsaW5nLWJpdGNvaW4tY29uL2FydGljbGVzaG93Lzk5MzI4NDE2LmNtc9IBogFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L211bWJhaS9leC1lbXBsb3llZS1vZi1zaGFyZS10cmFkaW5nLWNvbXBhbnktZHVwZWQtb2YtcnMtNC1sYWtoLWluLW1vbmV5LWRvdWJsaW5nLWJpdGNvaW4tY29uL2FtcF9hcnRpY2xlc2hvdy85OTMyODQxNi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Apr 2023 07:00:00 GMT",
        "title": "Ex-employee of share trading company duped of Rs 4 lakh in money-doubling Bitcoin con - The Times of India",
        "content": "MUMBAI: Promising to double money in Bitcoin investments within 45 minutes, unidentified cyber fraudsters duped a 27-year-old woman of Rs 3.88 lakh. The victim, who earlier worked with a share trading firm, lodged an FIR with the LT Marg police on April 5.The complainant had recently quit her job and was at home. She came across an advertisement on Telegram about the Bitcoin money doubling investment scheme.She had seen such messages earlier too, but this time, she opened a link given in the message link and found a mobile number in it. The woman called on the number and the call receiver said he was from a Bitcoin company and explained the investment scheme to the woman, convincing her to invest in it saying her investment will be doubled in 45 minutes. The fraudster collected the complainant's bank account details where he said they would be sending her profit.\"The complainant initially invested Rs 7,000. She was told that it will be doubled within 45 minutes. However, even after two to three hours when the profit was not deposited to her account, she contacted the person and asked him about it. The accused told her that she had gained double profit and asked her to pay income tax fees, GST, legal fees etc,\" said an officer. The accused told her that by the time she sends the legal fees and other charges, they would have further invested her profit to double it. The accused communicated via WhatsApp messages and calls.Police said between March 14 and March 20, the woman sent Rs 3.88 lakh in eight Indian bank accounts provided by the cyber fraudster through more than a dozen transactions. \"The woman kept asking for her money but the accused would tell her to send more money as fees saying her investment in Bitcoin was increasing. However, after March 20, the accused stopped taking her calls,\" said police. This is when she realised she was duped. A team led by senior PI Jyoti Desai and comprising API Prakash Patil and head constable Santosh Paware is probing the case."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vd2lsbC1lYXN0ZXItdHJpZ2dlci1hLWJpdGNvaW4tcHJpY2Utc3VyZ2UtYWZ0ZXItd2Vla3Mtb2Ytc3RhYmlsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Will Easter trigger a Bitcoin price surge after weeks of stability? - Finbold - Finance in Bold",
        "content": "After several weeks of stability, the price of Bitcoin (BTC) might expect a significant trend to the upside upon observing the historical chart patterns that the flagship decentralized finance (DeFi) asset has demonstrated during Easter weekends every few years.\n\nAs it happens, Bitcoin has been stable for weeks, recording strong support at $25,000, and if it manages to hold this level, a break above $35,000 is possible, but a retest and bounce would “also be ideal,” according to the Twitter post shared by the cryptocurrency and finance analyst CryptoYoddha on April 7.\n\nBitcoin price action analysis. Source: CryptoYoddha\n\nOn top of that, according to CryptoYoddha’s chart analysis, Bitcoin could also briefly reach the $48,000 level in May or June before correcting to $25,000 in late 2023 and again soaring beyond the previous critical level and toward $90,000 in April 2024.\n\nEaster bull?\n\nIt should also be noted that the maiden crypto has followed a pattern of recovery from a heavy bear market every three or four years and that Easter has typically been a starting point for a bullish run in the following weeks, as observed by another pseudonymous crypto market analyst, Stockmoney Lizards, on April 7.\n\nBitcoin historical patterns. Source: Stockmoney Lizards\n\nIndeed, such behavior took place in the weeks following Easter in 2012, when Bitcoin soared 225.33%, in 2016, when it improved by 94.83%, and in 2019, when the crypto industry representative gained 167.88% to its price, with the analyst expecting Bitcoin to move toward $40,000 in late May.\n\nBitcoin price analysis\n\nAs things stand, Bitcoin is currently changing hands at $27,945. Its price represents an increase of 0.03% on the day but also a minor decrease of 0.34% across the past week and a growth of 25.78% on its monthly chart, according to the latest data retrieved on April 7.\n\nBitcoin 30-day price chart. Source: Finbold\n\nMeanwhile, Bitcoin has been demonstrating strength against traditional assets since the year’s turn, recording a return on investment (ROI) that was 170.32% higher during the first quarter of 2023, compared to the average of five major stock indexes, as Finbold reported on April 6.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWFuZC10aGUtcHJvYmxlbS1jaGlsZC1pcy1qYWtlLXBhdWwtaW52ZXN0ZWQtaW4tYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Crypto and the Problem Child: Is Jake Paul invested in Bitcoin? - Finbold - Finance in Bold",
        "content": "After Jake Paul became one of the celebrities charged by the United States Securities and Exchange Commission (SEC) for illegally promoting cryptocurrencies, many have started to wonder how much crypto the American social media personality and professional boxer actually held.\n\nAlthough the specific numbers are unclear, Jake Paul is a known Bitcoin (BTC) enthusiast, claiming the flagship decentralized finance (DeFi) asset was the “best investment” of his life as he sat down for a chat with BitBoy Crypto in April 2021.\n\nAs he said back then:\n\n“I invested in Bitcoin when it was $100 when I was 16 years old, and it was the craziest, best investment of my life. (…) Ever since that moment, I’ve sort of been involved in crypto and still investing to this day, buying Bitcoin, buying Ethereum (ETH).”\n\nBitcoin bet backfires?\n\nHowever, one year later, during an episode of his ‘Impaulsive’ podcast with co-hosts George Janko and Mike Majlak, his older brother Logan revealed Jake had endured major financial losses as he had allegedly invested most of his wealth into the crypto market, which had subsequently crashed.\n\nIndeed, as Janko touted Jake’s boxing career, stating that it was “going pretty well,” and Majlak stressed that “he made like $40 million last year,” Logan quickly jumped in to say that “it doesn’t matter; he put it all in crypto. (…) He’s poor.”\n\nInterestingly, the YouTuber-turned-boxer had blamed US President Joe Biden for the “plummeting crypto prices” at the time, despite some commenters pointing out to him that Jake was the “one of the main dudes pumping and dumping” crypto.\n\nBiden accomplishments\n\n\n\n1. Highest gas prices\n\n2. Worst inflation\n\n3. Plummeting crypto prices\n\n4. Highest rent prices ever\n\n5. Created new incomprehensible language\n\n\n\nIf you’re reading this and voted for Biden and you still don’t regret it then you are the American problem. — Jake Paul (@jakepaul) June 12, 2022\n\nFraud accusations\n\nIt seems that one commenter, in particular, was referring to Paul’s support for the SafeMoon (SAFEMOON), now revamped as SafeMoon V2 (SFM) token, that faced security concerns and several scandals in 2022, including fraud lawsuits against the network’s executives and celebrity influencers who endorsed it and then allegedly sold their holdings.\n\nMeanwhile, Jake Paul has been charged for illegally promoting Tron (TRX) and/or BitTorrent (BTT) without disclosing that he was compensated for it, alongside Lindsay Lohan, DeAndre Cortez Way (Soulja Boy), Austin Mahone, Michele Mason (Kendra Lust), Miles Parks McCollum (Lil Yachty), Shaffer Smith (Ne-Yo), and Aliaune Thiam (Akon).\n\nNotably, crypto entrepreneur Justin Sun and three of his companies, Tron Foundation Limited, BitTorrent Foundation Ltd., and Rainberry Inc., also stand accused of the unregistered offer and sale of TRX and BTT as investments through multiple unregistered “bounty programs,” as Finbold reported on May 22."
    }
]