[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vbGliZXJ0eXN0cmVldGVjb25vbWljcy5uZXd5b3JrZmVkLm9yZy8yMDIzLzAyL2lzLXRoZXJlLWEtYml0Y29pbi1tYWNyby1kaXNjb25uZWN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Is There a Bitcoin–Macro Disconnect? - Liberty Street Economics - Liberty Street Economics -",
        "content": "Gianluca Benigno and Carlo Rosa\n\nCryptocurrencies’ market capitalization has grown rapidly in recent years. This blog post analyzes the role of macro factors as possible drivers of cryptocurrency prices. We take a high-frequency perspective, and we focus on Bitcoin since its market capitalization dwarfs that of all other cryptocurrencies combined. The key finding is that, unlike other asset classes, Bitcoin has not responded significantly to U.S. macro and monetary policy news. This disconnect is puzzling, as unexpected changes in discount rates should, in principle, affect the price of Bitcoin.\n\nBackground\n\nPrior to its recent decline, the market value of cryptocurrencies reached a staggering $2.5 trillion, with Bitcoin crossing the $1 trillion mark. In addition, Bitcoin represents the lion’s share—between 50 percent (nowadays) and 90 percent (in 2016)—of the overall capitalization of the digital currency market.\n\nMarket Capitalization of Bitcoin and Other Cryptocurrencies\n\nSource: Authors’ calculations.\n\nNotes: The chart plots the market capitalizations of Bitcoin and twenty-two other cryptocurrencies (Aave, BinanceCoin, Cardano, ChainLink, Cosmos, CyrptocomCoin, Dogecoin, EOS, Ethereum, Iota, Litecoin, Monero, NEM, Polkadot, Solana, Stellar, Tether, Tron, Uniswap, USDCoin, WrappedBitcoin, and XRP). Market capitalization is calculated by multiplying the total number of coins in circulation by their price.\n\nGiven their growing relevance, it is natural to study the drivers of cryptocurrency prices. This blog post focuses on macroeconomic news and monetary policy surprises. We interpret cryptocurrencies as assets whose current price should depend on the expected discounted value of future values. This characterization implies that, from a macroeconomic point of view, developments that influence current and future interest rates, whether directly (news about monetary policy) or indirectly (news about macroeconomic conditions), should affect the value of cryptocurrencies.\n\nWe use a novel and comprehensive intraday data set to identify the effects of this news. By relying on high-frequency data in a short enough window around a macro announcement, the data release is (most likely) the only information systematically hitting the market. Hence, by looking at the response of asset prices in that time window around various announcements, this blog post conducts the empirical finance version of a natural experiment.\n\nAs an example, the chart below shows the response of several U.S. asset prices around two types of news releases: news about the real economy, such as the Bureau of Labor Statistics’ Employment Situation report (left panel), and news about monetary policy, specifically the FOMC meeting (right panel). The June 2016 labor market report contained a lower-than-expected nonfarm payrolls figure, as compared to the Bloomberg consensus. Consequently, the dollar immediately depreciated against the euro by about 1 percent, stock prices declined by about 0.5 percent, and gold prices increased by 2 percent. Bitcoin, on the other hand, moved sideways. At the June 2021 Fed meeting, the FOMC signaled that interest rates needed to rise sooner and faster than market participants had anticipated. Again, the dollar, gold, and stock prices immediately responded to the release, but Bitcoin did not respond in a systematic manner.\n\nResponse of U.S. Asset Prices to Macroeconomic and Monetary Policy News\n\nSource: Authors’ calculations.\n\nNotes: Responses are normalized at zero at the time of the news release. The horizontal axis displays the hours before/after the release. EUR/USD refers to the euro/dollar exchange rate, defined as the amount of U.S. dollars needed to buy one euro.\n\nAnalysis and Results\n\nWe systematically analyze the response of the EUR/USD exchange rate, gold, the S&P 500, and Bitcoin to ten sets of macro announcements that have been singled out as important in the academic literature. In studying the responses of selected asset prices to macroeconomic and monetary policy news, we focus on the 2000-2022 period for all assets except Bitcoin, for which we chose a restricted (more meaningful) sample starting from 2017. (For more details on the analysis, see our related Staff Report on the topic.) We collect different pieces of macro news, covering the real economy and inflation, as well as monetary policy surprises. For monetary policy news, we consider three distinct dimensions. The first indicator, Target, captures unanticipated changes in the current federal funds rate target. The second indicator, Path, captures unanticipated changes in the future path of policy. The third indicator, LSAP, captures unanticipated announcements of future large‐scale asset purchases.\n\nOur priors are based on a simple asset pricing model for Bitcoin. We model Bitcoin as an asset with no intrinsic value whose current value depends on the discounted value of its future price (for our beloved wonks, a “stochastic bubble”). We also accommodate the possibility of the asset having no value with a probability that depends positively on current and future interest rates. Since monetary policy news affects both current and future interest rates, it should be associated with Bitcoin valuation, while macroeconomic news has an indirect impact through the monetary policy reaction function.\n\nBy relying on the regressions’ estimates, we can test to what extent the response of an asset price to a given macroeconomic announcement is systematic. The table below reports the relationship between assets (columns) and selected macroeconomic and monetary news (rows). The shading indicates whether the response is systematic, with darker colors corresponding to more statistically significant effects. The symbol inside each cell indicates the sign of the correlation between asset returns and news. We find that the EUR/USD exchange rate, gold, and the S&P 500 significantly react to most macro and monetary news. In stark contrast, the response of Bitcoin is muted, and never significant at the 1 percent level even when we focus on just monetary policy news.\n\nComparing Asset Price Responses to News Events\n\nConclusions\n\nSo… is macroeconomic news driving Bitcoin? In this post, we conduct a systematic analysis of the impact of macroeconomic and monetary policy news on Bitcoin’s price. In contrast to exchange rates and stocks, Bitcoin is largely unresponsive to macro news. More puzzling is the result that Bitcoin does not also react to monetary policy surprises. At face value, our study casts some doubts on the role of discount rates in pricing Bitcoin. Given the short sample used in the analysis, the jury is still out on this one, and more evidence is needed to put the case to rest.\n\nHow to cite this post:\n\nGianluca Benigno and Carlo Rosa, “Is There a Bitcoin–Macro Disconnect?,” Federal Reserve Bank of New York Liberty Street Economics, February 8, 2023, https://libertystreeteconomics.newyorkfed.org/2023/02/is-there-a-bitcoin-macro-disconnect/.\n\nDisclaimer\n\nThe views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s)."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA4L2NyeXB0by1sb25nLXNob3J0LWJpdGNvaW5zLWdvbGRlbi1jcm9zcy1leHBsYWluZWQv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDgvY3J5cHRvLWxvbmctc2hvcnQtYml0Y29pbnMtZ29sZGVuLWNyb3NzLWV4cGxhaW5lZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin's 'Golden Cross' Explained - CoinDesk",
        "content": "Inflation expectations (as derived from Treasurys including inflation-linked TIPS) are coming down from their 2021-2022 peak, but are still above the average levels seen following the 2008 financial crisis. This is great news, but it should be taken with a grain of salt as the Fed itself holds a sizable portion of the TIPS market (estimated at 25% in 2022, according to Jim Bianco), which may distort the signal sent by this indicator. Add in the unexpectedly strong jobs report last Friday, mixed in with lingering concerns over the effectiveness of the Phillips Curve, and you’ve got conditions of substantial uncertainty that could force the Fed to wait and see before cutting rates to minimize the chance of a policy error."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmZvb2wuY29tL3RoZS1hc2NlbnQvY3J5cHRvY3VycmVuY3kvYXJ0aWNsZXMvaGVyZXMtd2h5LW1hcmstY3ViYW4tdGhpbmtzLWJpdGNvaW4taXMtYS1iZXR0ZXItaW52ZXN0bWVudC10aGFuLWdvbGQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Here's Why Mark Cuban Thinks Bitcoin Is a Better Investment Than Gold - The Motley Fool",
        "content": "Mark Cuban is a billionaire and was featured on Shark Tank. As a result, many people trust the financial advice he gives. He's also a fan of cryptocurrencies and has indicated he's a big investor in Bitcoin.\n\nHe recently explained why he thinks Bitcoin is a better investment alternative than gold. Here's why Cuban thinks you should buy Bitcoin as a safe haven investment.\n\nThe simple reason Cuban prefers Bitcoin to gold\n\nRecently, Cuban appeared on the Club Random podcast run by comedian Bill Maher. After Maher commented that he puts money in gold as a safe haven investment, Cuban indicated he believes this is not a wise choice and that Bitcoin would be a better alternative.\n\n\"Gold is a store of value, and so is Bitcoin,\" Cuban said. But Cuban believes that gold, unlike Bitcoin, isn't a very safe investment to make as a hedge against economic uncertainty because someone could \"kill you and take your gold bar,\" in the event of a major economic catastrophe.\n\nBecause of the risk of having your physical gold stolen, Cuban has described investing in the metal as \"useless.\" Bitcoin is also a store of value, but unlike the precious metal, Bitcoin is \"protected by a digital ledger.\" Since Bitcoin is a digital asset, no one could just take it from you if things went wrong. For that reason, Cuban thinks it's a safer bet.\n\nOur top crypto play isn't a token - Here’s why We’ve found one company that’s positioned itself perfectly as a long-term picks-and-shovels solution for the broader crypto market — Bitcoin, Dogecoin, and all the others. In fact, you've probably used this company's technology in the past few days, even if you've never had an account or even heard of the company before. That's how prevalent it's become. Sign up today for Stock Advisor and get access to our exclusive report where you can get the full scoop on this company and its upside as a long-term investment. Learn more and get started today with a special new member discount. Get started\n\nShould you invest in Bitcoin (or gold)?\n\nMany cryptocurrency enthusiasts hope Bitcoin will one day become a digital version of gold, as there are commonalities between them, including the scarcity of both the physical metal and the number of Bitcoins that will be available over time. Cuban appears to suggest that Bitcoin could serve a similar purpose to gold as a store of value, but be an even better bet.\n\nBut there are important differences between them as well. Gold is tracked on a worldwide tracking system and has long been considered a safe-haven investment. It has a more-established track record. Bitcoin, on the other hand, is a newer alternative investment that has been embraced by many institutional investors and is the most well-established and respected of the cryptocurrencies.\n\nREAD MORE: Best Cryptocurrency Apps\n\nIt's essential to understand the attributes of both investment options if you are deciding between them. And it is very possible that neither investment would be the right choice for you for a few key reasons.\n\nFirst and foremost, you should always make sure you invest only in things you fully understand. And both precious metals investing and cryptocurrency investing can be pretty complicated as well as fairly risky. So if you don't know the details of investing in them, you should steer clear of both investments in favor of simpler alternatives available in your brokerage account, such as index funds that track the performance of the market as a whole.\n\nWhile index funds tracking the market may experience a temporary decline during economic trouble, you shouldn't be investing for the short-term anyway. And, the reality is, these assets present far less risk of losses over time than either Bitcoin or gold, so they may be a better bet for the majority of people than either of these two alternatives."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vbW9uZXkuY29tL2JpdGNvaW4tZG93bi1zdXBlci1ib3dsLWNyeXB0by1hZHMv0gE-aHR0cHM6Ly9tb25leS5jb20vYml0Y29pbi1kb3duLXN1cGVyLWJvd2wtY3J5cHRvLWFkcy8_YW1wPXRydWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Here's How Much Bitcoin Is Down Since Crypto Firms Went All in on Super Bowl Ads Last Year - Money",
        "content": "A year ago, the crypto industry was in a much better place. Bitcoin was trading above $42,000, and crypto exchanges made a splash during the Super Bowl with ads that earned the event the “crypto bowl” moniker.\n\nBut if Coinbase's memorable floating QR code ad got you to buy some cryptocurrency or Coinbase stock after the game, your investment has likely lost significant value.\n\nA broad crypto crash began around April 2022, and even after some rebounding to the start off this year, bitcoin and ether are still down massively since last year's Super Bowl when the Rams claimed the title over the Bengals.\n\nThat’s part of the reason why you won’t see any national ads from crypto companies during this year’s matchup between the Chiefs and Eagles, a Fox executive told Sports Business Journal, noting that several crypto ad deals for the game fell through after the collapse of FTX in November.\n\nThat included a 60-second spot FTX had booked, which would’ve made Sam Bankman-Fried’s now-bankrupt company a repeat advertiser after they featured Larry David in a 2022 ad.\n\nCrypto’s fall since last year's Super Bowl ads\n\nBitcoin and ether prices are both down by nearly 50% from their levels a year ago going into the Super Bowl.\n\nThe price of bitcoin is about $23,000, down 48% in the past year. The recent trend has been positive, however. Bitcoin is up 38% so far this year. (Bear in mind that bitcoin was down more than 75% in November 2022 from its all-time high one year prior, when the price reached $68,790.)\n\nThe price of ether, the native token of the Ethereum blockchain network, is about $1,650, down 47% from a year ago. The coin has also had a strong start to 2023 and is up 35%.\n\nCoinbase, the largest crypto exchange in the U.S., will not advertise during the 2023 Super Bowl, which is not really surprising given that the company has laid off thousands of employees since the summer. Coinbase stock has surged so far in 2023, just about doubling year to date, but its share price is still 65% lower than a year ago.\n\nBottom line\n\nThe \"crypto bowl\" of 2022 was followed by a horrible stretch for major tokens and exchanges. Crypto has been rallying recently, but the lack of ads during this game on Sunday will be a reminder of how much the industry has fallen.\n\nMore from Money:\n\n6 Best Crypto Exchanges of February 2023\n\n8 Best Crypto Wallets of February 2023\n\nBitcoin Is Up Nearly 30% This Year — Here’s What to Know About the Enormous Rally"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vYml0Y29pbi1taW5pbmctbWVyZ2VyLWh1dC04LXVzLWJpdGNvaW4tNzEwNjYwN9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Hut 8 and U.S. Bitcoin Announce Mining Merger - Investopedia",
        "content": "Hut 8 (HUT) and U.S. Bitcoin are the latest crypto miners rushing to take advantage of the January Bitcoin rally.\n\nTwo firms announced their merger Wednesday, the latest deal in a wave of consolidation and balance sheet shuffling from battered miners still struggling with losses from last year. The new company would combine the two firms' resources and create a new crypto-mining giant named Hut 8 Corp.\n\nKey Takeaways Canada's Hut 8 and U.S. Bitcoin will merge their BTC mining businesses.\n\nThe new company will look to strengthen its balance sheet and compete in the mining space.\n\nThe Bitcoin mining industry has been rushing to sell BTC and restructure debt.\n\nAlso referred to as \"New Hut,\" the transaction will create a company that is listed on both the Toronto Stock Exchange and the Nasdaq. The companies said that the combined firm will have a market capitalization of $990 million and will be owned by shareholders of both firms.\n\n\"New Hut will have access to approximately 825 MW of gross energy across all six sites with self-mining, hosting, and managed infrastructure operations,\" the companies said in a press release.\n\n\n\nThe deal is expected to establish New Hut as a large-scale, publicly traded Bitcoin miner that can strengthen its balance sheet and gain access to capital-raising opportunities.\n\n“This transaction has given us the opportunity to leverage the significant, unencumbered Bitcoin stack we have HODLed to date,” said Jaime Leverton, CEO of Hut 8. “During the interim period, we plan to cover our operating costs through a combination of selling the Bitcoin we mine, selling from our stack, and/or exploring various debt options.\"\n\nHut 8 stock fell 8.6% in Tuesday trading after the merger announcement.\n\nCrypto Miners Rush to Restructure Debt\n\nWhile some miners have been able to buy new mining rigs and sites at firesale prices during bitcoin's downturn, others have been forced to file for bankruptcy or restructure.\n\nAustin's Core Scientific (CORZ) filed for bankruptcy in late December. Greenridge Generation Holdings (GREE) announced debt restructuring with its creditors in late January and on Wednesday Pennsylvania's Stronghold Digital (SDIG) did the same.\n\nHut 8 is just the latest in a wave of recent miners that have rushed to take advantage of the January Bitcoin rally. Las Vegas, Nevada-based, Marathon Digital Holdings (MARA) announced last week it would sell 1,500 BTC in a move the company said would help to fund operating costs.\n\n“Marathon may continue to sell a portion of its Bitcoin holdings in future periods to support monthly operations, manage its treasury, or for general corporate purposes,” the company said in a statement.\n\n\n\nThe Bottom Line\n\nThe Bitcoin mining industry has been on the ropes since the decline in crypto assets started last year. The recent rally has allowed some much-needed balance sheet restructuring.\n\nHowever, there is a risk that the rush to sell holdings of the world's largest cryptocurrency could impact its price. Texas-based miners have already faced another headwind in late January with a recent winter storm in the state forcing miners in the area to scale back their production."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzIvNy8yMzU4ODI0My9iaXRjb2luLWNyeXB0by1taW5lcnMtZW5lcmd5LWVtaXNzaW9ucy1kYXRhLWVwYS1kb2UtZGVtb2NyYXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Biden administration acknowledges it can force Bitcoin mines to disclose pollution - The Verge",
        "content": "Federal agencies have the authority to force crypto mining companies to divulge how much energy they use and greenhouse gas emissions they create, according to letters between the agencies and Democratic lawmakers shared exclusively with The Verge.\n\nBitcoin miners have flocked to the US over the past couple years, triggering concerns about electricity usage and greenhouse gas emissions. Despite the proliferation of crypto mines across the US, there hasn’t been solid data on what impact they each have on the power grid and national climate goals.\n\nThat could soon change as Democratic lawmakers pressure federal agencies to speed up plans to require crypto mining companies to report their emissions and energy consumption. That kind of transparency is an early, crucial step toward reining in pollution from crypto mines.\n\n“We urge you to use those authorities to implement a mandatory disclosure regime as rapidly as possible”\n\nThe Department of Energy (DOE) and the Environmental Protection Agency (EPA) have described “clear authority to require emissions and energy-use disclosures by cryptominers” according to a letter several Democratic Congress members sent to the agencies yesterday. It asks each agency to provide timelines for when they plan to start executing those powers and collecting information.\n\n“We urge you to use those authorities to implement a mandatory disclosure regime as rapidly as possible,” says the letter, which was signed by Senators Elizabeth Warren (D-MA), Sheldon Whitehouse (D-RI), Ed Markey (D-MA), Jeff Merkley (D-OR), Dick Durbin (D-IL), and Representatives Jared Huffman (D-CA), Katie Porter (D-CA), and Rashida Tlaib (D-MI).\n\nThis is the latest move in a saga that started last year, when Democratic lawmakers asked the biggest crypto mining companies in the US to share numbers on their energy consumption and pollution. Seven companies together have the capacity to use over 1 gigawatt of electricity, almost enough energy as every residence in Houston might use combined, according to the Congress members.\n\nWhile several companies provided some data, none of them gave full responses to Democrats’ questions. That spurred the Congress members to ask the DOE and EPA in July to require that crypto companies publicly share information to get a more comprehensive picture of the impact they have on the grid and the environment.\n\nSeven companies together have the capacity to use over 1 gigawatt of electricity, almost enough energy as every residence in Houston might use combined, according to the Congress members\n\nWarren’s office shared the DOE and EPA’s responses to that July inquiry with The Verge. In November, the Secretary of Energy Jennifer Granholm wrote a letter to Warren saying that the US Energy Information Administration (EIA) has the authority to require crypto operations to report their energy use as “operating facilities... engaged in... major energy consumption.” Such a mandate would “require development of a new survey to collect this information,” the letter says. The EIA could also require utilities to share information about how much electricity they sell to crypto companies.\n\nThe EPA, meanwhile, told lawmakers that the Clean Air Act gives it the ability to collect pollution data from facilities pumping out at least 25,000 tons of planet-heating carbon dioxide a year. Democrats’ probe into the nation’s largest crypto mines has already revealed that at least two companies run crypto mines in the US that fall into that category. Both of those companies already report those emissions under the Clean Air Act requirements.\n\nBut the letter Warren and her colleagues sent yesterday asks the EPA to clarify whether it has already listed every crypto operation that meets the 25,000-ton threshold — and, if not, when it plans to do so. The letter asks for answers by no later than March 6th. The Verge reached out to the EPA and DOE, but did not receive comments by time of publication.\n\nWhile there aren’t concrete numbers yet on just how dirty or energy-hungry crypto mines are in the US, initial estimates are striking. The crypto industry’s operations in the US likely use roughly as much electricity as all of the nation’s home computers combined, according to a September report from the White House. That report recommended that the EPA and DOE work together to develop performance standards that would push crypto companies to transition to clean energy while using less energy overall. If that doesn’t work, the report suggests that the Biden “Administration should explore executive actions, and Congress might consider legislation.”\n\nIf that happens, the policies would primarily target Bitcoin — still the most popular and most polluting cryptocurrency. Other cryptocurrencies, including Ethereum, have already ditched the energy-intensive code that the Bitcoin network refuses to give up."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMDcvYml0Y29pbi10cmFkZXMtYXJvdW5kLTIzMDAwLWFmdGVyLWZlZC1jaGFpci1wb3dlbGwtd2FybnMtdGhhdC1yYXRlcy1jb3VsZC1yaXNlLWZ1cnRoZXIuaHRtbNIBf2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAyLzA3L2JpdGNvaW4tdHJhZGVzLWFyb3VuZC0yMzAwMC1hZnRlci1mZWQtY2hhaXItcG93ZWxsLXdhcm5zLXRoYXQtcmF0ZXMtY291bGQtcmlzZS1mdXJ0aGVyLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin rises above $23,000 after Fed Chair Powell says inflation is coming down - CNBC",
        "content": "More than $1.3 trillion was wiped off the cryptocurrency market in 2022 as the fallout from the FTX collapse weighed on investor confidence.\n\nBitcoin rose above $23,000 after Federal Reserve Chair Jerome Powell addressed an economics forum in Washington, D.C., saying that inflation is coming down.\n\nBitcoin added 1% to $23,236.80, according to Coin Metrics. Ether rose 1.3% to $1,667.63. Bitcoin struggled to hold the $23,000 level on Monday after dipping below that mark over the weekend.\n\nPowell said in a question-and-answer session at the Economic Club of Washington, D.C. that although the process of getting inflation down has started, it \"has a long way to go\" and that these are \"the very early stages.\"\n\n\"We expect 2023 to be a year of significant declines in inflation. It's actually our job to make sure that that's the case,\" he said. \"My guess is it will take certainly into not just this year, but next year to get down close to 2%.\"\n\nCrypto prices briefly turned lower alongside the stock market, after Powell said future economic reports may force the central bank to keep hiking rates aggressively.\n\nTreasury yields declined during the speech – the 10-year note yield fell 1 basis point and the 2-year lost 5 basis points. The U.S. dollar index also dipped. Yields and the dollar index tend to move inversely to crypto.\n\nAfter climbing about 40% to start the year, bitcoin has hit a speed bump in the past week as investors who have doubted the staying power of the rally prepared for further macro-driven volatility in crypto prices this year."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi6AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2h1dC04LWFuZC11cy1iaXRjb2luLWFubm91bmNlLW1lcmdlci1vZi1lcXVhbHMtdG8tY3JlYXRlLWEtcHJlZW1pbmVudC1kaWdpdGFsLWFzc2V0LW1pbmluZy1ob3N0aW5nLW1hbmFnZWQtaW5mcmFzdHJ1Y3R1cmUtb3BlcmF0aW9ucy1hbmQtaGlnaC1wZXJmb3JtYW5jZS1jb21wdXRpbmctb3JnYW5pemF0aW9uLTMwMTc0MDQ4OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Hut 8 and US Bitcoin announce merger of equals to create a preeminent digital asset mining, hosting, managed ... - PR Newswire",
        "content": "Transaction is expected to dramatically enhance trajectory of the digital asset mining business:\n\n5.6 EH/s installed self-mining capacity at five sites across North America\n\nCombined Company's diversification strategy to expand significantly, establishing\n\nnew, fiat revenue generating lines of business:\n\n220 MW of hosting infrastructure at King Mountain, Texas\n\nManaged infrastructure operations powered by 680 MW at Kearney, Nebraska,\n\nGranbury, Texas, and King Mountain Texas sites\n\nGross energy across self-mining, hosting, and managed infrastructure operations\n\nsites totaling approximately 825 MW\n\nTransaction expected to accelerate achievement of ESG objectives by adding\n\nrenewable energy and zero carbon emission energy from wind, hydro, and\n\nnuclear sources\n\nBill Tai to maintain role as Board Chair, Jaime Leverton to continue as CEO, Asher\n\nGenoot to continue as President, Michael Ho to become Chief Strategy Officer,\n\nShenif Visram to continue as CFO\n\nCombined Company to be named \"Hut 8 Corp.\" and domiciled in the United\n\nStates\n\nThis news release constitutes a \"designated news release\" for purposes of the\n\nCompany's prospectus supplement dated August 17, 2022 to its short form base\n\nshelf prospectus dated August 5, 2022. All dollar amounts in this release are in\n\nUSD unless otherwise noted.\n\nTORONTO and MIAMI, Feb. 7, 2023 /PRNewswire/ -- Hut 8 Mining Corp. (Nasdaq: HUT) (TSX: HUT) (\"Hut 8\" or the \"Company\"), a large, innovation-focused digital asset mining pioneer and high performance computing infrastructure provider, and U.S. Data Mining Group, Inc. dba US Bitcoin Corp (\"USBTC\"), builder and strategic operator of four Bitcoin mining centres across the United States, announced today that each of their Boards of Directors have unanimously approved a definitive business combination agreement (the \"Business Combination Agreement\") under which the companies will combine in an all-stock merger of equals (the \"Transaction\"). The combined company will be named \"Hut 8 Corp.\" (\"New Hut\" or the \"Combined Company\") and will be a U.S.-domiciled entity. The Transaction is expected to establish New Hut as a large scale, publicly traded Bitcoin miner focused on economical mining, highly diversified revenue streams, and industry-leading best practices in ESG.\n\nHut 8 Mining Corp Logo\n\n\"Our established track record of creating shareholder value through organic growth and strategic acquisitions while maintaining a balance sheet-first approach has positioned us perfectly to advance our growth trajectory through this business combination,\" said Jaime Leverton, CEO, Hut 8. \"Bringing together Hut 8's operational track record and diversified revenue streams with US Bitcoin's scalable mining sites, sizeable hosting business, and industry-leading managed infrastructure operations not only accelerates our diversified strategy and positions us for near-term growth, but also establishes us as a strong, U.S.-based player that is ready and able to seize additional opportunities as they arise.\"\n\nNew Hut will have access to approximately 825 MW of gross energy across all six sites with self-mining, hosting, and managed infrastructure operations.\n\nIt will have 5.6 EH/s of installed self-mining capacity and 244 MW of total energy available at five sites with current self-mining operations: Medicine Hat, AB ; Drumheller, AB ; Niagara Falls, NY ; Granbury, TX ; and King Mountain, TX. The 1.7 EH/s installed self-mining production at the King Mountain, TX site is owned by the King Mountain Joint Venture in which USBTC has a 50% membership interest alongside a leading energy partner (the \"King Mountain JV\"). USBTC continues to address a legal dispute with the City of Niagara Falls, NY over operations at the site in the same city. While operations continue uninterrupted, the team has a contingency plan in place that it will pursue should a resolution not be met.\n\n; ; ; ; and King Mountain, TX. The 1.7 EH/s installed self-mining production at the King Mountain, TX site is owned by the King Mountain Joint Venture in which USBTC has a 50% membership interest alongside a leading energy partner (the \"King Mountain JV\"). USBTC continues to address a legal dispute with the over operations at the site in the same city. While operations continue uninterrupted, the team has a contingency plan in place that it will pursue should a resolution not be met. New Hut will manage 220 MW of hosting infrastructure at its King Mountain, TX site, powered by a mix of sources including wind and nuclear, supporting multiple clients, including some of the industry's largest miners. Hosting is owned by the King Mountain JV.\n\nThe Combined Company will manage 680 MW of infrastructure operations powered by energy from a mix of sources including renewable and zero-emission in Kearney , NB and Granbury and King Mountain, TX. This unique, leading-edge service offering gives Bitcoin mine site owners the opportunity to have USBTC's professionals manage all day-to-day operations, hosting, site management, and maintenance using purpose-built site management software.\n\n\"We've been searching for the right partner to join us on our ambitious growth journey for some time and are confident that Hut 8 is the perfect fit,\" said Michael Ho, co-founder and CEO of USBTC. \"We were initially attracted to Hut 8's strong track record, admirable fiscal management through all market cycles, and like-minded approach to generating diversified lines of revenue. Through this process, we've determined that the strategic impact this Transaction will drive is significant: we see a clear path to leveraging our collective vision to drive innovative technology advancements and become a second-to-none operator.\"\n\n\"The combination of Hut 8 and USBTC is an important step, but it's truly just the beginning,\" said Asher Genoot, co-founder and President of USBTC. \"We believe that New Hut will challenge industry paradigms and set the standard for operating rigor and team culture. We are laser-focused on identifying opportunities to capture untapped value across the mining ecosystem. Together, we will become an exceptional self-mining operator, hosting provider, strategic operator of managed infrastructure, purveyor of high performance computing infrastructure, and industry-leading ASIC repair and sales hub, underpinned by world-class operating technology and IP to drive growth.\"\n\nThe Transaction will create a leading Bitcoin mining company operating in North America with strong financial and operating metrics. Under the Business Combination Agreement, New Hut will be led by a combined Board of Directors and management team of Bitcoin miners, energy experts, and business leaders, bringing together the proven cultures, strengths, and capabilities of both companies.\n\n\"This Transaction has given us the opportunity to leverage the significant, unencumbered Bitcoin stack we have HODLed to date,\" said Jaime. \"During the interim period, we plan to cover our operating costs through a combination of selling the Bitcoin we mine, selling from our stack and/or exploring various debt options, as agreed under the terms of the Business Combination Agreement. Upon a successful close of the Transaction, we will take the opportunity to carefully review and determine our go-forward treasury strategy.\"\n\nDetails of the Transaction and strategic rationale\n\nPursuant to the Business Combination Agreement, shareholders of Hut 8 will receive, for each Hut 8 share, 0.2 of a share of New Hut common stock (the \"Hut Consideration\"), which will effectively result in a consolidation of the Hut 8 shares on a 5 to 1 basis. Stockholders of USBTC will receive, for each share of USBTC capital stock, 0.6716 of a share of New Hut common stock (the \"USBTC Consideration\" and together with the Hut Consideration, the \"Consideration\"). Based on the 5-day VWAP for the Hut 8 shares on the Nasdaq as of the last trading day prior to the date of this announcement, the aggregate Consideration implies a combined market capitalization of approximately U$990 million.\n\nUpon consummation of the Transaction (\"Closing\"), existing Hut 8 shareholders and USBTC stockholders will each collectively own, on a fully-diluted in the money basis, approximately 50% each of the stock of the Combined Company. Following completion of the Transaction, Hut 8 and USBTC will each become wholly-owned subsidiaries of New Hut.\n\nKey strategic, financial, and operational advantages of the combined business include1:\n\n_________________________ 1 Hut 8's North Bay facility is not accounted for in the calculations provided as legal proceedings are underway with the site's third party energy provider. In addition, USBTC's former facility in Pecos, Texas is not accounted for in the above calculations as it has been transferred to one of USBTC's former lenders as part of a debt extinguishment transaction.\n\nStrengthens financial position and flexibility. The combined balance sheet creates greater financial stability through market cycles and allows New Hut to grow and invest in new opportunities. Through increased scale and U.S. headquarters, the Combined Company anticipates being included in new indices and enjoying improved access to capital.\n\nThe combined balance sheet creates greater financial stability through market cycles and allows New Hut to grow and invest in new opportunities. Through increased scale and U.S. headquarters, the Combined Company anticipates being included in new indices and enjoying improved access to capital. Catapults New Hut's diversification strategy forward. New Hut is expected to generate monthly recurring fiat hosting revenues from long-term clients, Bitcoin mining sites looking to maximize the potential of their facilities through managed infrastructure operations, from equipment sales to customers, and from the MicroBT-certified repair centre business serving customers across North America and Northern Europe .\n\nNew Hut is expected to generate monthly recurring fiat hosting revenues from long-term clients, Bitcoin mining sites looking to maximize the potential of their facilities through managed infrastructure operations, from equipment sales to customers, and from the MicroBT-certified repair centre business serving customers across and . Maintains commitment to advancing the high performance computing traditional data centre business. New Hut remains committed to supporting and growing the HPC business, which continues to be a cornerstone of the Combined Company's diversified strategy, generating monthly recurring revenue from approximately 370 North American customers.\n\nNew Hut remains committed to supporting and growing the HPC business, which continues to be a cornerstone of the Combined Company's diversified strategy, generating monthly recurring revenue from approximately 370 North American customers. Creates a strengthened, proven, and trusted senior leadership team and Board of Directors with a track record of value creation. The combined executive team will lead New Hut's approximately 210 team members to deliver on the existing and proven strategy of growing long-term sustainable operations.\n\nThe combined executive team will lead New Hut's approximately 210 team members to deliver on the existing and proven strategy of growing long-term sustainable operations. Grows pipeline of opportunities. The Transaction combines a pipeline of growth opportunities at existing, greenfield, and brownfield sites.\n\nThe Transaction combines a pipeline of growth opportunities at existing, greenfield, and brownfield sites. Enhances position in one of the world's high-potential Bitcoin mining regions. The merger solidifies New Hut as a Bitcoin mining entity with operating capacity at high-quality sites in Alberta, Canada , and Texas , Nebraska , and New York in the United States .\n\nThe merger solidifies New Hut as a Bitcoin mining entity with operating capacity at high-quality sites in , and , , and in . Advances commitment to driving improvements across all ESG metrics. While the team is committed to shared ESG goals, the Transaction improves New Hut's overall energy mix to include wind, hydro, and nuclear sources.\n\nWhile the team is committed to shared ESG goals, the Transaction improves New Hut's overall energy mix to include wind, hydro, and nuclear sources. Improves energy expertise and hedging capabilities. The USBTC team brings significant leadership in energy origination, development, demand response, hedging, grid stabilization, and analytics to New Hut, significantly enhancing the Combined Company's ability to better plan around stable and predictable energy usage and mitigate fluctuating prices across markets.\n\nTransaction Summary and Timing\n\nUnder the terms of the Business Combination Agreement, the Transaction will be effected by way of a court-approved plan of arrangement (the \"Arrangement\") involving Hut 8 under the Business Corporations Act (British Columbia) and a statutory merger (the \"Merger\") involving USBTC under the laws of the State of Nevada. The Arrangement will require the approval of at least 66 2/3% of the votes cast by the shareholders of Hut 8 voting at a special meeting of Hut 8's shareholders (the \"Meeting\"). The Merger is also subject to the approval of USBTC stockholders.\n\nCompletion of the Transaction is subject to regulatory and court approvals and other customary closing conditions. Regulatory approvals expected to be required include receipt of approval under the Competition Act (Canada) and under the United States Hart-Scott-Rodino Antitrust Improvements Act. In addition, the Arrangement will require the approval of the Supreme Court of British Columbia, New Hut's common stock will require approval for listing on the Toronto Stock Exchange and The Nasdaq Capital Market. The Business Combination Agreement includes non-solicitation provisions for both Hut 8 and USBTC, with Hut 8 maintaining a fiduciary out to accept a superior proposal, subject to USBTC's right to match and other customary exceptions. Hut 8 is required to pay USBTC a termination fee of US $10.0 million in certain circumstances.\n\nOfficers and Directors of Hut 8 have entered into support and voting agreements with USBTC, agreeing to vote their Hut 8 shares in favour of the Arrangement. Officers, Directors, and certain stockholders of USBTC have entered into a stockholder support agreement with Hut 8, agreeing to vote their USBTC stock in favour of the Merger.\n\nIt is anticipated that the Meeting and the receipt of the written consent of USBTC stockholders will occur in the second quarter of 2023. Closing is expected to occur thereafter, subject to satisfaction of the closing conditions under the Business Combination Agreement.\n\nPursuant to the Business Combination Agreement, Hut 8 has also agreed to provide USBTC with secured bridge financing during the interim period, with the expected amount of such financing ranging from US$6.0 - $6.5 million, subject to the completion of definitive loan documentation.\n\nFollowing completion of the Transaction, the shares of New Hut will trade on the Toronto Stock Exchange and the Nasdaq Stock Market, subject to approval or acceptance of each exchange in respect of the Transaction.\n\nBoard of Directors' approval\n\nEach of Hut 8's and USBTC's respective Board of Directors have unanimously approved the Business Combination Agreement and the Transaction. Stifel GMP provided a fairness opinion to the Board of Directors of Hut 8 stating that, as of the date of such opinion, and based upon the scope of review and subject to the assumptions, limitations and qualifications stated in such opinion, the USBTC exchange ratio provided for in the Business Combination Agreement is fair, from a financial point of view, to Hut 8. The Board of Directors of Hut 8 also received a second, independent fairness opinion from the Duff & Phelps Opinions Practice of Kroll, LLC stating that, as of the date of such opinion and based upon the scope of review and subject to the assumptions, limitations and qualifications stated in such opinion, the USBTC exchange ratio provided for in the Business Combination Agreement is fair, from a financial point of view, to Hut 8.\n\nGovernance\n\nFollowing the closing of the Transaction, the Combined Company will be domiciled in the United States and will be led by a proven leadership team that builds on the strengths and capabilities of both companies. The senior executive team and Board of Directors of Hut 8 will be enhanced by the addition of new members of USBTC who have significant knowledge and experience to support the combined operations. The Board of Directors of New Hut will consist of 10 directors, comprised of 5 directors from Hut 8 and 5 directors from USBTC.\n\nThe key senior management team and directors will include:\n\nChair of the Board – Bill Tai\n\nChief Executive Officer – Jaime Leverton\n\nPresident – Asher Genoot\n\nChief Strategy Officer – Michael Ho\n\nChief Financial Officer – Shenif Visram\n\nAdvisors and counsel\n\nHut 8 has engaged Stifel GMP as its exclusive financial advisor and Bennett Jones LLP and Skadden, Arps, Slate, Meagher & Flom LLP as its legal advisors in connection with the Transaction. USBTC has engaged Needham & Company as its exclusive financial advisor and Stikeman Elliott LLP, Greenberg Traurig, P.A., and Brown Rudnick LLP as its legal advisors on the Transaction.\n\nFor further information on the terms and conditions of the Transaction, please refer to the Business Combination Agreement in its entirety and the management proxy circular to be mailed to Hut 8 shareholders for the Meeting in due course, which will be available on SEDAR at www.sedar.com and on EDGAR at www.sec.gov. Additional details about the Transaction can be found in a joint investor presentation, which will be available on www.hut8.io/investors and www.usbitcoin.com. Shareholders are encouraged to read the management proxy circular and other relevant materials when they become available.\n\nAnalyst call\n\nThe conference call will begin at 8:30 a.m. ET on February 7, 2023.\n\nTo join the conference call without operator assistance, you may register and enter your phone number at https://app.webinar.net/JB0rqRaVWYj to receive an instant, automated call back that will place you in the conference\n\nThose joining via operator should dial in 5-10 minutes early to: 1-888-664-6392 (toll-free, North America ) and use access code: 28360816#\n\nAbout Hut 8\n\nHut 8 is a large innovation-focused digital asset miner, led by a team of business-building technologists, bullish on Bitcoin, blockchain, Web 3.0, and bridging the nascent and traditional high performance computing worlds. With two digital asset mining sites located in Southern Alberta and a third site in North Bay, Ontario, all located in Canada, Hut 8 has high capacity rate and large inventory of unencumbered, self-mined Bitcoin. With 36,000 square feet of geo-diverse data centre space and cloud capacity connected to electrical grids powered by significant renewables and emission-free resources, Hut 8 is revolutionizing conventional assets to create the first hybrid data centre model that serves both the traditional high performance compute (Web 2.0) and nascent digital asset computing sectors, blockchain gaming, and Web 3.0. Hut 8 was the first Canadian digital asset miner to list on the Nasdaq Global Select Market. Through innovation, imagination, and passion, Hut 8 is helping to define the digital asset revolution to create value and positive impacts for its shareholders and generations to come.\n\nAbout US Bitcoin Corp\n\nFounded by a team of visionary entrepreneurs and experienced executives, USBTC is an efficient, eco-friendly, and large scale North American mining company. Through cutting-edge technology and a relentless commitment to operational excellence, USBTC seeks to set the standard for what is possible in its industry.\n\nWith campuses in New York, Nebraska, and Texas, USBTC aims to monetize electrons at scale, operating hundreds of megawatts of Bitcoin mining infrastructure both independently and on behalf of clients. USBTC prides itself on deploying next-generation software and hardware innovations to deliver results across its self-mining, hosting, and site management verticals.\n\nCautionary note regarding Forward–Looking Information\n\nThis press release includes \"forward-looking information\" and \"forward-looking statements\" within the meaning of Canadian securities laws and United States securities laws, respectively (collectively, \"forward looking information\"). All information, other than statements of historical facts, included in this press release that address activities, events or developments that Hut 8 expects or anticipates will or may occur in the future, including such things as future business strategy, competitive strengths, goals, expansion and growth of Hut 8's businesses, operations, plans and other such matters is forward-looking information. Forward looking information is often identified by the words \"may\", \"would\", \"could\", \"should\", \"will\", \"intend\", \"plan\", \"anticipate\", \"allow\", \"believe\", \"estimate\", \"expect\", \"predict\", \"can\", \"might\", \"potential\", \"predict\", \"is designed to\", \"likely\" or similar expressions. In addition, any statements in this press release that refer to expectations, projections or other characterizations of future events or circumstances contain forward-looking information and include, among others, statements with respect to: (i) the expected outcomes of the Transaction, including New Hut's assets and financial position; (ii) the ability of Hut 8 and USBTC to complete the Transaction on the terms described herein, or at all, including, receipt of required regulatory approvals, shareholder approvals, court approvals, stock exchange approvals and satisfaction of other closing customary conditions; (iii) the expected synergies related to the Transaction in respect of strategy, operations and other matters; (iv) projections related to expansion; (v) expectations related to the Combined Company's hashrate and self-mining capacity; (vi) acceleration of ESG efforts and commitments; and (vii) the ability of the Combined Company to execute on future opportunities, among others.\n\nStatements containing forward-looking information are not historical facts, but instead represent management's expectations, estimates and projections regarding future events based on certain material factors and assumptions at the time the statement was made. While considered reasonable by Hut 8 and USBTC as of the date of this press release, such statements are subject to known and unknown risks, uncertainties, assumptions and other factors that may cause the actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information, including but not limited to: the ability to obtain requisite shareholder approvals and the satisfaction of other conditions to the consummation of the Transaction on the proposed terms or at all; the ability to obtain necessary stock exchange, regulatory, governmental or other approvals in the time assumed or at all; the anticipated timeline for the completion of the Transaction; the ability to realize the anticipated benefits of the Transaction or implementing the business plan for the Combined Company, including as a result of a delay in completing the Transaction or difficulty in integrating the businesses of the companies involved (including the retention of key employees); the ability to realize synergies and cost savings at the times, and to the extent, anticipated; the potential impact on mining activities; the potential impact of the announcement or consummation of the Transaction on relationships, including with regulatory bodies, employees, suppliers, customers, competitors and other key stakeholders; the outcome of any litigation proceedings in respect of USBTC's legal dispute with the City of Niagara Falls, New York; security and cybersecurity threats and hacks; malicious actors or botnet obtaining control of processing power on the Bitcoin network; further development and acceptance of the Bitcoin network; changes to Bitcoin mining difficulty; loss or destruction of private keys; increases in fees for recording transactions in the Blockchain; internet and power disruptions; geopolitical events; uncertainty in the development of cryptographic and algorithmic protocols; uncertainty about the acceptance or widespread use of digital assets; failure to anticipate technology innovations; the COVID-19 pandemic; climate change; currency risk; lending risk and recovery of potential losses; litigation risk; business integration risk; changes in market demand; changes in network and infrastructure; system interruption; changes in leasing arrangements; failure to achieve intended benefits of power purchase agreements; potential for interrupted delivery, or suspension of the delivery, of energy to the Combined Company's mining sites. For a complete list of the factors that could affect the Company, please see the \"Risk Factors\" section of the Company's Annual Information Form dated March 17, 2022 and Hut 8's other continuous disclosure documents which are available on the Company's profile on the System for Electronic Document Analysis and Retrieval at www.sedar.com and on the EDGAR section of the U.S. Securities and Exchange Commission's (\"SEC\") website at www.sec.gov.\n\nThese risks are not intended to represent a complete list of the factors that could affect Hut 8, USBTC, or New Hut; however, these factors should be considered carefully. There can be no assurance that such estimates and assumptions will prove to be correct. Should one or more of these risks or uncertainties materialize, or should assumptions underlying the forward-looking statements prove incorrect, actual results may vary materially from those described in this press release as intended, planned, anticipated, believed, sought, proposed, estimated, forecasted, expected, projected or targeted and such forward-looking statements included in this press release should not be unduly relied upon. The impact of any one assumption, risk, uncertainty, or other factor on a particular forward-looking statement cannot be determined with certainty because they are interdependent and New Hut's future decisions and actions will depend on management's assessment of all information at the relevant time. The forward-looking statements contained in this press release are made as of the date of this press release, and each of Hut 8 and USBTC expressly disclaims any obligation to update or alter statements containing any forward-looking information, or the factors or assumptions underlying them, whether as a result of new information, future events or otherwise, except as required by law. Except where otherwise indicated herein, the information provided herein is based on matters as they exist as of the date of preparation and not as of any future date, and will not be updated or otherwise revised to reflect information that subsequently becomes available, or circumstances existing or changes occurring after the date of preparation.\n\nAdditional information about the Transaction and where to find it\n\nIn connection with the Transaction, that, if completed, would result in New Hut becoming a new public company, New Hut is expected to file a registration statement on Form S-4 (the \"Form S-4\") with the U.S. Securities Exchange Commission (the \"SEC\"). USBTC and Hut 8 urge investors, shareholders, and other interested persons to read, when available, the Form S-4, including any amendments thereto, the Hut meeting circular, as well as other documents to be filed with the SEC and documents to be filed with Canadian securities regulatory authorities in connection with the Transaction, as these materials will contain important information about USBTC, Hut, New Hut and the Transaction. New Hut also has, and will, file other documents regarding the Transaction with the SEC. This press release is not a substitute for the Form S-4 or any other documents that may be sent to Hut's shareholders or USBTC's stockholders in connection with the Transaction. Investors and security holders will be able to obtain free copies of the Form S-4 and all other relevant documents filed or that will be filed with the SEC by New Hut through the website maintained by the SEC at www.sec.gov or by contacting the investor relations department of Hut 8 at [email protected] and of USBTC at [email protected].\n\nNo Offer or Solicitation\n\nThis press release is not intended to and shall not constitute an offer to sell or the solicitation of an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended (the \"Securities Act\") or in a transaction exempt from the registration requirements of the Securities Act.\n\nHut 8 investor contact: Sue Ennis, [email protected]; Hut 8 media contact: Erin Dermer, [email protected]; USBTC contact: Matt Prusak, [email protected]\n\nPhoto - https://mma.prnewswire.com/media/1997349/Hut_8_Mining_Corp_Hut_8_and_US_Bitcoin_announce_merger_of_equals.jpg"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA2L21pY3Jvc3RyYXRlZ3ktbXNyLWNvbnNpZGVycy1iaXRjb2luLWZ1dHVyZXMtc2F5bG9yLXNheXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "MicroStrategy (MSTR) Considers Bitcoin Futures, Founder Michael Saylor Says - Bloomberg",
        "content": "MicroStrategy Inc. co-founder and Executive Chairman Michael Saylor said the enterprise-software company, better known as the largest publicly traded holder of Bitcoin, may at some point consider dabbling in futures contracts on CME Group’s marketplace to generate yield.\n\nIn the past, MicroStrategy had considered but decided against lending out its Bitcoin through other companies, some of which went bankrupt last year, Saylor said in a Bloomberg TV interview on Monday. Crypto lenders Celsius Network and BlockFi filed for protection against creditors in 2022, as did broker Voyager Digital; lender Genesis Global Holdco LLC filed for bankruptcy in January."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1zdG9ja3Mtb3V0cGVyZm9ybWVkLWJ0Yy0wMTA0MTUyNDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Looking for Exposure to Bitcoin? These 2 Small Bitcoin Mining Stocks Are a 'Must-Own,' According to One Analyst - Yahoo Finance",
        "content": "The end goal of investing is profit, and few investments have shown the long-term profit of bitcoin. Yes, the true story in cryptocurrency is its extreme volatility, but the underlying fact is simple: investors who bought into bitcoin five years ago, and held on, have tripled their money. Even this past January, BTC surged 40%.\n\nBut buying bitcoin isn’t the only way to cash in on it, there are also the bitcoin mining stocks. These are firms, generally small, that own large-scale server rigs capable of computing the blockchain links – and creating new bitcoins. In fact, according to H.C. Wainwright analyst Mike Colonnese, \"the median return for publicly traded BTC miners was 124% in January, more than 3x the performance of BTC.\"\n\nElaborating further on the opportunity, Colonnese writes: “We expect improved mining economics, driven by higher BTC prices and moderating energy costs (partially offset by rising network difficulty) to drive upward estimate revisions for the group throughout 2023 and see continued multiple expansion for mining stocks. As such, it is plausible the miners could continue outperforming BTC, in our view...”\n\nOf course, Colonnese doesn’t deny the risks inherent in this path – he notes that bitcoin mining stocks will be sensitive to negative macro-data – but he makes a compelling case that the positives justify the risks.\n\nKeeping that in mind, we’ve opened up the TipRanks database and pulled the details on two small bitcoin mining stocks that Colonnese sees as potential winners in 2023. For investors interested in betting on the blockchain, these should present some interesting paths forward.\n\nCipher Mining Inc. (CIFR)\n\nThe first company we’ll look at is Cipher Mining, a US-based bitcoin miner that is still in the early stages of its ramp-up. The company has three active mining sites, and is working both to expand its existing exahash capacity and to develop new mining sites. The company is currently generating bitcoin at a rate of approximately 1.4 EH/s.\n\nStory continues\n\nCipher’s chief mining facility, Odessa, operates on up to 207 megawatts of power, and its mining operations came online this past November. Odessa is supplemented by two additional sites, Alborz, a 40 megawatt, wind-powered mining facility, and Bear and Chief, a site which was completed in October of last year and can operate at up to 20 megawatts.\n\nAll three of these sites are boosting their bitcoin production capabilities. Per Cipher’s 3Q22 report, the last released, the company generated 196 bitcoin in that quarter. The fourth quarter report won’t be out until March, but we do have the December and January monthly production updates available.\n\nIn December, Cipher mined 225 bitcoin, and in January, the company mined another 343. In each of those months, the company’s bitcoin generation exceeded all of 3Q22 by a wide margin, and its generation rate is accelerating. As of the end of January, Cipher listed 424 bitcoin held as assets, 41,000 mining rigs deployed in its data centers, and a 4.3 exahash-per-second operating rate.\n\nCasting his eye on this bitcoin miner, H.C. Wainwright's Colonnese writes: “We are upgrading shares of CIFR to Buy from Neutral on strong execution, best-in-class mining economics, and improved sentiment for BTC… Cipher now has the sixth-largest hashing capacity of all publicly traded BTC miners in North America, and we estimate the company is capable of producing ~14.5 BTC per day. This equates to over $330,000 in daily mining revenues when applying current BTC prices of $23,000, a substantial increase over the ~$50,000 in daily revenues the company generated in October 2022. We applaud management’s ability to rapidly scale the company’s mining operations over the span of just a few months…”\n\nAlong with his new Buy rating on the stock, Colonnese includes a price target of $3, suggesting a 12-month upside potential of 76%. (To watch Colonnese’s track record, click here)\n\nThis is the only analyst review on file for Cipher, which is currently trading for $1.70. (See CIFR stock forecast)\n\nHive Blockchain Technologies (HIVE)\n\nNext up is Hive Blockchain, a Vancouver, Canada-based company with bitcoin mining operations in its home country as well as in Sweden and Iceland. Hive Blockchain boasts that it operates its mining facilities, which take up to 50 megawatts of power, on 100% renewable energy sources.\n\nThose mining operations are extensive. As of the end of January this year, Hive Blockchain was operating at an exahash rate of 2.68 EH/s. The company has been deploying new mining server rigs in large numbers over recent months, significantly boosting its capacity.\n\nIndeed, the December and January monthly updates show that Hive’s capacity has been growing. The company mined 213.8 bitcoin in December, and another 260 in January. Month-over-month, the company’s mining operations generated a 22% increase in bitcoin.\n\nHive has committed to a policy of ‘hold on for dear life,’ or HODL; that is, keeping a large reserve of bitcoin to hold for the long-term. Under its HODL policy, Hive had holdings totaling 2,430 bitcoin at the end of January, worth over $56 million in US currency at current prices.\n\nH.C. Wainwright's Colonnese is impressed with Hive's execution, writing: “Hive consistently ranks in the top 3 publicly traded BTC miners when it comes to efficiency as measured by BTC mined relative to the company’s active hash rate, which we attribute to above average uptime from both stable electricity sources and optimized proprietary software. In 2022, Hive produced 20% more BTC per EH of capacity than its peers, a significant competitive advantage, in our view, and a demonstration of Hive’s operational prowess.\"\n\n\"While the stock has rallied [150%] YTD, alongside the rebound in BTC prices, we see additional share price appreciation driven by hash rate expansion and efficiency gains, as well as improved sentiment for BTC throughout 2023,” the analyst summed up.\n\nIn-line with this stance, Colonnese rates the stock as a Buy, with a $5 price target to indicate its potential for ~39% share appreciation this year.\n\nThis small-cap bitcoin miner has slipped under the radar a bit, and only has 2 recent analyst reviews. They both agree, however, that it’s a stock to buy, making the Moderate Buy analyst consensus unanimous. The shares are selling for $3.60 and their $6 average target indicates room for ~67% upside over the next 12 months. (See Hive stock forecast)\n\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a tool that unites all of TipRanks’ equity insights.\n\nDisclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tbWluZXJzLWN1dC1jb3N0cy1yZWJvdW5k0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Cutting Costs and Joining Forces, Bitcoin Miners Hoping for Rebound - Blockworks",
        "content": "After a rocky 2022, bitcoin miners could be in for a lucrative year, at least if past market cycle patterns repeat.\n\nThe largest cryptocurrency posted a 64% loss last year, coupled with skyrocketing electricity costs around the world and a dramatic drop in mining profitability made 2022 a bust for most of the crypto mining industry. But a rebounding market and upcoming halving cycle could be the catalysts the industry needs for a turnaround.\n\nThe next bitcoin halving, expected in the second quarter of 2024, should create a positive imbalance between bitcoin’s supply and demand, Christopher Bendiksen, bitcoin research lead at CoinShares, said in a report Monday.\n\n“Historically, there has been a recurring tendency for the halvings to be closely followed by bull markets, leading to the now famed four-year bull/bear cycles in bitcoin price,” Bendiksen said.\n\nWhen market conditions are strong, miners restrict new supply by holding more bitcoin on their own treasuries, meaning the supply of newly mined bitcoin hitting the market is much smaller than the actual production amount, Bendiksen said. But when there are challenges in the market, miners are forced to liquidate their holdings.\n\n“Because good times in mining tend to happen during bitcoin bull markets, and bad times tend to happen during bear markets, miner hoarding behavior happens right when demand is already overpowering supply, and vice versa,” Bendiksen said. “This adds further fuel to the volatility fire, both to the upside and the downside.”\n\nSome bitcoin mining companies have already reported a stronger start to the year. Riot Platforms increased its production 62% year-over-year last month, the company said in an unaudited report Monday. Riot reported selling 700 of its 740 mined bitcoin in January 2023, resulting in net proceeds of around $13.7 million, the company said.\n\nStronghold Digital Mining, which has been publicly traded since October 2021, has paused all debt payments until July 2024, giving the firm runway for the next 18 months, the company said Tuesday. Holding off on debt payments means Stronghold can take advantage of the current distressed mining market, a spokesperson said.\n\nAfter losing nearly 98% since its Nasdaq debut, Stronghold has rallied more than 30% so far this year. Analysts surveyed by CNN Business give Stronghold a buy rating with a median price target of $2 per share, a roughly 257% increase from its current price of around $0.56.\n\nIn yet another consolidation move spurred by the distressed market, mining companies Hut 8 and US Bitcoin Corp announced merger plans Tuesday. The two companies will be wholly-owned subsidiaries of the new Hut 8 Corp. Hut 8’s shares will be consolidated five-to-one, per the press release.\n\n“Once miners are better able to cover ongoing cash needs through mining revenue, the exacerbating effect from treasury liquidations on downside volatility is reduced, removing an ankle weight from the bitcoin price itself,” Bendiksen said. “This in turn has the potential to act as a virtuous cycle.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8wOC9jcmFpZy13cmlnaHQtbG9zZXMtYml0Y29pbi1jb3B5cmlnaHQtY2xhaW0taW4tdWstY291cnQv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAyLzA4L2NyYWlnLXdyaWdodC1sb3Nlcy1iaXRjb2luLWNvcHlyaWdodC1jbGFpbS1pbi11ay1jb3VydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Craig Wright Loses Bitcoin Copyright Claim in UK Court - CoinDesk",
        "content": "In a case heard in Oslo last year, multiple witnesses offered forensic evidence that documents supplied by Wright purporting to back up his claim to be Nakomoto contain discrepancies, such as fonts that weren’t available at the time."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAyLzA4L2ludmVzdGVkLWluLWJpdGNvaW4taW4tMjAxNy15b3VkLW5vdy1oYXZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "If You Invested $1,000 in Bitcoin in 2017, Here's How Much You'd Have Now - The Motley Fool",
        "content": "At the start of 2017, Bitcoin (BTC 1.53%) had been through some dark days as an asset. The cryptocurrency's value peaked over $1,000 in late 2013 but dropped to between $200 and $400 for most of the next four years.\n\nBut it recovered and hit $998.62 at the start of 2017, meaning that an investor who bought $1,000 worth would have bought slightly more than an entire Bitcoin. Today, that initial $1,000 investment would be worth $22,800. The big question for investors now is whether Bitcoin can make those same returns again over the next six years.\n\nBitcoin's return to prominence\n\nFirst, let's recall how exactly Bitcoin got to where it is today. The original crypto has certainly benefited as more money has flowed into cryptocurrency and digital assets. The initial coin offering (ICO) craze of 2017 - during which hundreds of new tokens were sold to the public, even if the utility of some tokens was questionable - brought more awareness to Bitcoin. But while many of the coins launched during that period suffered from severe price dips afterward, Bitcoin made it out largely unscathed.\n\nThe pandemic brought investors more money through stimulus funds and low interest rates, driving many to chase higher-risk assets like Bitcoin. That all led to a huge Bitcoin price spike in 2021. But the coin dropped steeply in 2022 as interest rates rose and investors sold off high-risk assets.\n\nIn June 2022, pandemic-era inflation peaked. Meanwhile, by the end of June 2022, Bitcoin had fallen to just over $20,000 -- down more than 70% from the all-time high of $67,617.02 it hit in November 2021. As a result, the argument that Bitcoin might be used as an inflationary hedge fell apart.\n\nUS Inflation Rate data by YCharts\n\nThe competition is stronger than ever\n\nThe inflation issue isn't Bitcoin's only problem, though. Competition in the cryptocurrency sphere is looking increasingly fierce. More and more tokens, exchanges, and technologies are improving upon the original Bitcoin idea and striving to make even more efficient forms of digital money. Ethereum (ETH -0.88%), for instance, was the first major blockchain to introduce smart contracts, which has made crypto intelligent in a way that Bitcoin hasn't yet done at scale.\n\nSolana (SOL 9.74%) took that to the next level, introducing a blockchain that can complete thousands of transactions per second for a fraction of a second each. If, like me, you think that new innovations and businesses will be built on top of the blockchain, then speed, cost, and capability are key elements of the technology.\n\nThe harsh reality is that Bitcoin is falling behind in these areas. If you're looking for a simple store of value in crypto, then there's an argument that Bitcoin might still be your best option for the time being. But I don't believe that Bitcoin's future is as bright as its past.\n\nWhat's the future of Bitcoin?\n\nI doubt the next six years will be as good as the past six years for Bitcoin. Competition is steeper than ever, and more innovation is happening on other blockchains. Plus, that Bitcoin hasn't been able to keep up as an inflationary hedge has really been a blow to the digital asset. When high prices rile the traditional market, Bitcoin's trading pattern seems to follow growth stocks and other risky assets instead of acting as a true hedge against inflation.\n\nSecurity and performance are an issue, too. A very small number of miners control half of the mining capacity for Bitcoin, and, when the price fell recently, they came under financial stress. Even publicly traded Bitcoin miners have seen their stocks and financial strength weaken dramatically. Since Bitcoin is still a proof-of-work blockchain, it requires miners to validate transactions. A large number of miners are needed to keep the blockchain secure and to prevent Bitcoin from being controlled by a single, small group. As Bitcoin falls in price and it becomes less profitable to mine Bitcoin, that security will be under a growing amount of pressure.\n\nThe next few years may not be anywhere near as good for Bitcoin as competing blockchains improve and Bitcoin's provenance declines. Since the start of 2017, Bitcoin has been a huge winner. But that past performance doesn't look like it will be continuing to the same extent. Even if cryptocurrency is the future of finance or data storage, I doubt it will be Bitcoin that holds the biggest market share. Rather, I'd bet that title will go to the token's current competitors, such as Solana or Ethereum, that are continuing to innovate and drive the future."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA3L2JpdGNvaW4tbWluZXJzLWh1dC04LXVzLWJpdGNvaW4tY29ycC1hbm5vdW5jZS1tZXJnZXIv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDcvYml0Y29pbi1taW5lcnMtaHV0LTgtdXMtYml0Y29pbi1jb3JwLWFubm91bmNlLW1lcmdlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Shares of Bitcoin Miner Hut 8 Slump on Merger With US Bitcoin Corp. - CoinDesk",
        "content": "The two firms will become wholly owned subsidiaries of the newly formed Hut 8 Corp. Shareholders of the two will each own about 50% of the merged company, they said in a Tuesday press release. The deal will have existing shares of Toronto-based Hut 8 consolidated five-to-one in the new company, which will have access to about 825 megawatts (MW) of energy capacity."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA3L3RoZS1vcmRpbmFscy1wcm90b2NvbC1oYXMtY2F1c2VkLWEtcmVzdXJnZW5jZS1pbi1iaXRjb2luLWRldmVsb3BtZW50L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA3L3RoZS1vcmRpbmFscy1wcm90b2NvbC1oYXMtY2F1c2VkLWEtcmVzdXJnZW5jZS1pbi1iaXRjb2luLWRldmVsb3BtZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "The Ordinals Protocol Has Caused a Resurgence in Bitcoin Development - CoinDesk",
        "content": "One reasonable criticism of bitcoin’s security model is the lack of miner revenue attributable to fees, the note said. Currently, most of the security budget paid to miners to secure the network comes from the block subsidy. The blockchain needs to figure out a way to “create a sustainable demand for block space or hope that non-economic miners commit to securing the network,” the note added."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA3L2JpdGNvaW4tbWluZXItc3Ryb25naG9sZC1kaWdpdGFsLXJlc3RydWN0dXJlcy1yZW1haW5pbmctNTVtLW9mLWRlYnQv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDcvYml0Y29pbi1taW5lci1zdHJvbmdob2xkLWRpZ2l0YWwtcmVzdHJ1Y3R1cmVzLXJlbWFpbmluZy01NW0tb2YtZGVidC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Stronghold Digital Restructures Remaining $55M of Debt - CoinDesk",
        "content": "The new credit agreement also reduces Stronghold's minimum liquidity covenants until the end of 2024 and allows the miner to pay for its interest in kind for up to six months, as long as its average daily cash balance for the respective month is less than $5 million."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8wOC9iaXRjb2luLWZpeGVzLXRoZS1hc3ltbWV0cnktb2YtaW5mb3JtYXRpb24tcHJvYmxlbS1pbi1tYXJrZXRzLWNvaW5kZXNrL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDIvMDgvYml0Y29pbi1maXhlcy10aGUtYXN5bW1ldHJ5LW9mLWluZm9ybWF0aW9uLXByb2JsZW0taW4tbWFya2V0cy1jb2luZGVzay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, Markets and the Symmetry of Information - CoinDesk",
        "content": "I don’t really see this catching on since the concept of “lemons” never made it over into the digital age anyway. In an age that generates and collects more information than we know what to do with, ironically markets today are hindered by information asymmetry as much as ever as much as ever. For the first time, we now have a technology that reliably embeds simple asset information in the asset itself. The subset of assets for which this simplicity is sufficient is small for now – but its impact is already being felt in market services being built today. And its evolution could end up shaping the structure and expectations of the market services of tomorrow."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLWZpbGVzLWZvci1iYW5rcnVwdGN5LXdpdGgtbGlhYmlsaXRpZXMtb2YtMTAwbS01MDBtL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLWZpbGVzLWZvci1iYW5rcnVwdGN5LXdpdGgtbGlhYmlsaXRpZXMtb2YtMTAwbS01MDBtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Operator Coin Cloud Files for Bankruptcy With Liabilities of $100M-$500M - CoinDesk",
        "content": "The Las Vegas-based firm has assets of between $50 million and $100 million and as many as 10,000 creditors, according to a filing in the U.S. Bankruptcy Court for the District of Nevada dated Feb. 7."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzA3L2JpdGNvaW4tZmF2b3JlZC1vdmVyLWV0aGVyLWJ5LWNtZS10cmFkZXJzLXNvLWZhci10aGlzLXllYXItYXJjYW5lLXJlc2VhcmNoLXJlcG9ydC1zaG93cy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8wNy9iaXRjb2luLWZhdm9yZWQtb3Zlci1ldGhlci1ieS1jbWUtdHJhZGVycy1zby1mYXItdGhpcy15ZWFyLWFyY2FuZS1yZXNlYXJjaC1yZXBvcnQtc2hvd3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Favored Over Ether by CME Traders So Far This Year, Arcane Research Report Shows - CoinDesk",
        "content": "Joe DiPasquale, CEO of crypto fund manager BitBull Capital, told CoinDesk that institutional investors’ preference for BTC represented “the safest choice in a bear market.” He noted that Ethereum’s upcoming protocol updates might be raising concerns about an increased “risk of things going wrong,” and added that the Shanghai hard fork, which will allow validators who help operate the network to withdraw 16 million staked ETH, “is expected to add selling pressure.”"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8wNy9rYXpha2hzdGFucy1wcmVzaWRlbnQtc2lnbnMtbGVnaXNsYXRpb24tdG8tbGltaXQtZW5lcmd5LXVzYWdlLW9mLWNyeXB0by1taW5pbmcv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAyLzA3L2themFraHN0YW5zLXByZXNpZGVudC1zaWducy1sZWdpc2xhdGlvbi10by1saW1pdC1lbmVyZ3ktdXNhZ2Utb2YtY3J5cHRvLW1pbmluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Kazakhstan's President Signs Legislation to Limit Energy Usage of Crypto Mining - CoinDesk",
        "content": "The government will also be approving a list of mining pools that firms can use, and will oblige miners to sell their mined crypto to crypto exchanges registered with the country's special economic zone, the Astana International Finance Center. Miners will have to sell half of their crypto to such exchanges by 2024, and 75% by 2025."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNlZXMtZ29sZGVuLWNyb3NzLXdoaWNoLWxhc3QtaGl0LTItbW9udGhzLWJlZm9yZS1hbGwtdGltZS1oaWdo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin sees golden cross which last hit 2 months before all-time high - Cointelegraph",
        "content": "Bitcoin (BTC) lingered near $23,000 on Feb. 7 as a key chart phenomenon hit for the first time in 18 months.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBattle of the Bitcoin crosses begins\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD tracking sideways overnight, having shunned volatility at the week’s first Wall Street open.\n\nWhile failing to flip $23,000 to support, the pair nonetheless saw a potentially significant event on Feb. 6 in the form of a “golden cross” on the daily chart.\n\nThis refers to the rising 50-period moving average crossing over the 200-period moving average. The last time that this occurred on daily timeframes was in September 2021 — two months before Bitcoin’s latest all-time high.\n\nBTC/USD 1-day candle chart (Bitstamp) with 50, 200MA. Source: TradingView\n\nSome crypto analysts have keenly watched the cross, with Venturefounder, a contributor to on-chain data platform CryptoQuant, arguing that $25,000 could reappear as a result.\n\n“Bitcoin goldencross just happened!” he summarized in a Twitter reaction.\n\n“This potential correction could see BTC retest $20k (200DMA and key support), then in the bullish case, test $25k next. Make $25k support and it's nail in the coffin for the bears.”\n\nBTC/USD annotated chart. Source: Venturefounder/ Twitter\n\nThe picture remained complicated on the day thanks to an upcoming “countercross” on weekly timeframes, where the 50-period moving average remained on course to drop below the 200-period one — a phenomenon known as a “death cross” for its conversely detrimental impact on BTC price action.\n\nBTC/USD 1-week candle chart (Bitstamp) with 50, 200MA. Source: TradingView\n\nFor on-chain monitoring resource Material Indicators, it remained uncertain whether the golden cross alone could propel BTC/USD higher.\n\n“Whether it’s enough to get a legit test of the $25k range remains to be seen,” it wrote in part of a commentary on the Binance order book.\n\nAn accompanying chart showed major resistance in the form of ask liquidity stacked at $23,500 — the first major hurdle for bulls to overcome in the event of a move higher.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nPowell speech “only key factor” of macro week\n\nAnother factor on the radar for Feb. 7 came from comments from the United States Federal Reserve.\n\nRelated: Is BTC price about to retest $20K? 5 things to know in Bitcoin this week\n\nAhead of next week’s macroeconomic data prints, multiple Fed officials were set to speak, with Chair Jerome Powell’s words expected to be the most significant regarding market-moving potential.\n\n“Nothing special this week, the only key factor to watch is Powell tomorrow afternoon. Perhaps one more sweep for correction and then the party should continue rallying upwards,“ part of a Twitter analysis by Cointelegraph contributor Michaël van de Poppe stated on Feb. 6.\n\nVan de Poppe added that “buy the dip” might be an appropriate option on altcoins in the meantime, as Material Indicators noted was already the case with Bitcoin whales.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvY3J5cHRvY3VycmVuY3ktaGFja2Vycy1zdG9sZS0zLTgtYmlsbGlvbi1ub3J0aC1rb3JlYS1jaGFpbmFseXNpcy1yZXBvcnQv0gFpaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL25ld3MvY3J5cHRvY3VycmVuY3ktaGFja2Vycy1zdG9sZS0zLTgtYmlsbGlvbi1ub3J0aC1rb3JlYS1jaGFpbmFseXNpcy1yZXBvcnQv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "A record $3.8 billion in crypto stolen in 2022 - CBS News",
        "content": "Hackers stole a record $3.8 billion worth of cryptocurrency globally last year, led by thieves tied to North Korea, according to a blockchain analytics firm that tracks cybercrime.\n\nResearchers at Chainalysis called 2022 \"the biggest year ever for crypto hacking\" in a report published last week. Thefts rose from $3.3 billion stolen in 2021, the firm reported. Separately, a confidential United Nations report found that North Korea stole more cryptocurrency assets last year than in any other year, Reuters reported on Monday.\n\nDuring the coronavirus pandemic, U.S. investors poured millions into bitcoin, ether, dogecoin and other popular tokens in hopes of generating a fortune. But some investors instead suffered losses due to hackers, with their digital wallets plundered on platforms with poor cybersecurity.\n\nNorth Korean cybercriminals \"shattered their own yearly record for most cryptocurrency stolen\" and tallied $1.7 billion in thefts in 2022, the Chainalysis report said.\n\nGiven that North Korea's total exports in 2020 totaled $142 million, \"it isn't a stretch to say that cryptocurrency hacking is a sizable chunk of the nation's economy,\" the researchers added.\n\nAs more investors lost money in crypto, U.S. lawmakers have reignited their calls to regulate the crypto industry. Scrutiny of the sector grew even more intense in November when FTX Trading, the third largest crypto platform, suddenly collapsed and declared bankruptcy.\n\nThe number of crypto hacks \"ebbed and flowed\" in 2022 with big spikes in March and October, Chainalysis said. October was \"the biggest single month ever for cryptocurrency hacking\" with 32 attacks totaling $775.7 million lost, according to the report.\n\nHackers have focused their activities on decentralized finance, or DeFi, platforms, which were tied to 82% of stolen funds last year, Chainalysis said. Criminals typically strike when crypto investors are using a so-called \"cross-chain bridge\" to transfer funds from one blockchain to another.\n\nThe biggest hack from October took place when someone looted $586 million in crypto from a cross-chain bridge owned by Binance. The company acknowleged the hack and said its security officers \"were able to minimize the loss.\"\n\nBad actors can exploit DeFi platforms because some crypto companies haven't prioritized security, said David Schwed, the chief operating officer at blockchain security firm Halborn.\n\n\"A big protocol should have 10 to 15 people on the security team, each with a specific area of expertise,\" Schwed said in Chainalysis' report. \"The DeFi community generally isn't demanding better security — they want to go to protocols with high yields. But those incentives lead to trouble down the road.\""
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDgvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtZXRoZXItcHVsbHMtZXZlbi13aXRoLWJpdGNvaW4taW4teWVhci10by1kYXRlLXBlcmZvcm1hbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin BTC Price, Ether ETH Price Surge Casting Dark Days of 2022 to the Past - CoinDesk",
        "content": "And investors may also want to watch the net position change for ETH. An increased amount of ether leaving centralized exchanges would signal that holders of the asset are less inclined to sell at the moment. As of Feb. 2, investors were sending more ETH to exchanges than removing it, but that has since changed."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMDgvYml0Y29pbi1uZnRzLWV4cGxvZGUtaW4tcG9wdWxhcml0eS1hcy1iaXRtZXgtcmVzZWFyY2gtc2hvd3MtMTMwMDAtb3JkaW5hbHMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8wOC9iaXRjb2luLW5mdHMtZXhwbG9kZS1pbi1wb3B1bGFyaXR5LWFzLWJpdG1leC1yZXNlYXJjaC1zaG93cy0xMzAwMC1vcmRpbmFscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs Explode in Popularity as BitMEX Research Shows 13,000 Ordinals - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzA4L2hlcmVzLXdoeS1hcnRpZmljaWFsLWludGVsbGlnZW5jZS1mb2N1c2VkLWNyeXB0b2N1cnJlbmNpZXMtYXJlLXZhc3RseS1vdXRwZXJmb3JtaW5nLWJpdGNvaW4v0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDgvaGVyZXMtd2h5LWFydGlmaWNpYWwtaW50ZWxsaWdlbmNlLWZvY3VzZWQtY3J5cHRvY3VycmVuY2llcy1hcmUtdmFzdGx5LW91dHBlcmZvcm1pbmctYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Here’s Why Artificial Intelligence Focused Cryptocurrencies Are Vastly Outperforming Bitcoin - CoinDesk",
        "content": "“Say an AI tool gets to 250 million users. Then what will its infra look like? How will people use it? How will the data be trained? Where does the token fit in? Can you even have a way to reward people for their data if you used it to train your models?” he said."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMDgvYml0Y29pbnMtbmV3Zm91bmQtbmZ0LWh5cGUtYXR0cmFjdHMtaW50ZXJlc3Qtb2YtYnN2LWRldmVsb3Blci10d2V0Y2gv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8wOC9iaXRjb2lucy1uZXdmb3VuZC1uZnQtaHlwZS1hdHRyYWN0cy1pbnRlcmVzdC1vZi1ic3YtZGV2ZWxvcGVyLXR3ZXRjaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin’s Newfound NFT Hype Attracts Interest of BSV Developer Twetch - CoinDesk",
        "content": "“I'm best friends with the Riot Blockchain guys and they're doing really well because they're so big, but anybody lesser is having a hard time right now,” said Petty. (Riot Blockchain is one of the largest public Bitcoin mining companies in the world.) So when they see the fees go up, what I predict is there'll be more miners that start to become pro-Ordinals, because they're [currently] not making a lot of money.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA4L2NyeXB0by1tYXJrZXQtcmFsbHktaXMtYS1nb29kLXNpZ24tZm9yLTIwMjMtYml0Y29pbi1taW5lcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market Rally Is A Good Sign For 2023 Bitcoin Miners - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nCryptocurrencies, Bitcoin in particular, are having a strong start to 2023. That’s resulted in a couple of interesting consequences for some of the most important players in the market: Bitcoin miners.\n\n\n\nThis year has also seen a lot of significant weather events affecting the US, including recent winter storms in Texas that have left hundreds of thousands of people without power. Energy is one of the most important costs that Bitcoin miners must absorb -- they just can’t run all those machines in their data centers without electricity.\n\n\n\nRecently, we discussed the challenging conditions that Bitcoin miners in the US and around the world have been facing. On this episode we discuss how some miners have been able to adapt and take advantage of current market conditions to try to put themselves on slightly more stable financial footing. Bloomberg reporter David Pan follows Bitcoin mining and joins this episode."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oYXBweS1iaXRjb2luLWFubml2ZXJzYXJ5LXRlc2xhLWVsb24tbXVzay1maXJtLXN0aWxsLWhvZGxzLTktN2stYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Happy Bitcoin anniversary, Tesla — Elon Musk firm still hodls 9.7K BTC - Cointelegraph",
        "content": "Bitcoin (BTC) held by Tesla is still worth 33% less than its 2021 purchase price, the latest data shows.\n\nTwo years to the day that Elon Musk’s firm added BTC to its balance sheet, most gains continue to evade the auto manufacturer.\n\nTesla and Bitcoin: From $1.5 billion to $225 million\n\nBitcoin and Tesla have proven an explosive combination since Musk announced that it would buy $1.5 billion in BTC.\n\nThe move in February 2021 came as BTC/USD was on its way to its first all-time high of the year, which it reached in April, topping out at $58,000.\n\nTesla’s purchase price was around $34,700 at the time, according to data from the tracking website Bitcoin Treasuries.\n\nAfter selling 10% of its holdings in March of that year, Tesla became a heavyweight hodler until a surprise move announced in July 2022 saw it divest 75% of its remaining coins.\n\nThat was done at a loss, as at the time, BTC/USD traded near $23,000. The sale occurred during Q2 2022 at around $29,000 per coin.\n\nTaking the hit appeared more appealing to Musk, who claimed that the rationale behind the sale was not a direct commentary on Bitcoin as an investment.\n\nSince then, Tesla has hodled 9,720 BTC, with subsequent price action still denying the company any investment gains. According to Bitcoin Treasuries, Tesla is still 33% down on its remaining stash as of February 2023, worth $225 million.\n\nTesla BTC holdings vs. USD value vs. BTC/USD vs. TSLA chart (screenshot). Source: Bitcoin Treasuries\n\nTSLA and BTC rise in tandem\n\nPreviously, Cointelegraph reported on the relationship between the Bitcoin spot price and Tesla stock, both seeing a broad resurgence at the start of 2023.\n\nRelated: Bitcoin gained 300% in year before last halving — Is 2023 different?\n\nAs of the Bitcoin purchase anniversary, TSLA is up 66% year-to-date, outpacing Bitcoin’s gains of just under 40%, data from Cointelegraph Markets Pro and TradingView confirms.\n\nBTC/USD vs. TSLA line chart. Source: TradingView\n\nThe rebound has failed to capture the imagination of mainstream media, however, which this month opted to highlight Tesla’s 2022 BTC net losses, which in U.S. dollar terms amounted to $140 million.\n\nMeanwhile, Musk has become arguably better known within the context of other cryptocurrencies, notably Dogecoin (DOGE), which he has given considerable publicity on social media and elsewhere since 2021.\n\nRecently, he revealed that payments would be coming to Twitter, which he purchased last year, and that these could, at some point include cryptocurrency.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDcvYml0Y29pbi1vbi1jaGFpbi1tZXRyaWNzLWxvb2stYnVsbGlzaC_SAVZodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzA3L2JpdGNvaW4tb24tY2hhaW4tbWV0cmljcy1sb29rLWJ1bGxpc2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin On-Chain Metrics Look Bullish, Bitfinex Report Highlights - CoinDesk",
        "content": "Reserve Risk is a cyclical oscillator that models the ratio between the current price and the conviction of long-term investors, according to the Bitfinex report. The indicator trades at low levels when there is heavy investor accumulation and HODLing is the preferred market strategy."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLXN0dW1ibGUtYXQtMjMtNGstYXMtZmVkLXMtZGlzaW5mbGF0aW9uLXNwYXJrcy1idGMtcHJpY2UtcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bulls stumble at $23.4K as Fed's 'disinflation' sparks BTC price rally - Cointelegraph",
        "content": "Bitcoin (BTC) rebounded to key resistance on Feb. 8 as crypto markets got a boost from a familiar source.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nPowell: “Disinflationary process” is here\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching the important $23,400 zone on Bitstamp overnight.\n\nThe pair reacted positively to the latest comments from the United States Federal Reserve, which also sent equities higher during the Feb. 7 Wall Street trading session.\n\nFed Chair Jerome Powell again mentioned “disinflation” during his appearance, reinforcing market hopes that interest rate hikes could cool more quickly in line with inflation. These stemmed from the latest meeting of the Federal Open Market Committee (FOMC) on Feb. 1, where the Fed raised rates by 0.25%.\n\n“The message that we were sending at the FOMC meeting last Wednesday was really that the disinflationary process — the process of getting inflation down — has begun, and it’s begun in the goods sector, which is about a quarter of our economy,” he said at The Economic Club of Washington, D.C.\n\nPowell nonetheless cautioned that there was “a long way to go” and that the U.S. was in “the very early stages of disinflation.”\n\nDespite this, risk assets rallied into the Wall Street close, with the S&P 500 and Nasdaq Composite Index finishing up 1.3% and 1.9%, respectively.\n\nBitcoin also erased previous weakness, having dropped below $22,700 earlier in the week, but bulls proved unable to tackle ask liquidity at $23,400 and beyond.\n\nThat liquidity remained in place on the day, as visible in data covering the Binance order book supplied by on-chain monitoring resource Material Indicators.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\n“Markets rallied into the close yesterday, with Bitcoin’s last H4 candle showing weakness at resistance & printing a shooting star,” popular trader Mark Cullen summarized about the latest events.\n\n“I personally am still waiting for the lows to get swept. BUT if the BTC can close a H$ above 23.4k I will look for a push higher.”\n\nCrucial area held for #Bitcoin, so we should be seeking for continuation.\n\n\n\nGameplan is simple;\n\n- Crack $23.3K and we'll see new highs, correction is over.\n\n\n\n- Lose $22.6K and I'll be seeking $21.5-21.7K for longs on #Bitcoin. pic.twitter.com/xJp6iSbeQb — Michaël van de Poppe (@CryptoMichNL) February 8, 2023\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, was also encouraged by Bitcoin’s reaction. A flip of $23,300 to a more solid support, he told Twitter followers on the day, would mean that the latest BTC price correction “is over.”\n\nBTC/USD traded at around $23,200 at the time of writing, with traders still counting down to volatility returning.\n\nGolden cross vs. death cross to resolve in a “few days”\n\nLooking ahead, the rest of the week held little by way of important macroeconomic cues for crypto markets.\n\nRelated: Bitcoin takes ‘lion’s share’ as institutional inflows hit 7-month high\n\nAs Cointelegraph reported, eyes were already on next week’s inflation data, coming in the form of the Consumer Price Index (CPI) print for January.\n\nAt the same time, chart analysts hoped for a positive outcome from Bitcoin’s latest “golden cross” on the daily chart — its first since September 2021. At the same time, however, BTC/USD weekly timeframes continued to print a “death cross,” a phenomenon which often preceded further downside in the past.\n\n“Many say Death Cross/Golden Cross Lagging Indicator. It is Lagging for those who only think Golden Cross means Bullish, and Death Cross means Bearish. I use this indicator to understand Momentum,” fellow trader Jibon wrote in part of a dedicated Twitter thread on the topic on Feb. 7.\n\nJibon compared the current setup to previous instances in 2015 and 2019 and added that it would take a “few days” for the impact of the crosses to become more obvious.\n\nBTC/USD comparative charts. Source: Trader_J/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvaXMtcmF5LWRhbGlvLXJpZ2h0LWFib3V0LWJpdGNvaW4v0gFUaHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9pcy1yYXktZGFsaW8tcmlnaHQtYWJvdXQtYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Is Ray Dalio Right About Bitcoin? - Finance Magnates",
        "content": "A well known investor and hedge fund manager, Ray Dalio caused a stir last week with his comments on cryptocurrencies. In an interview with CNBC, he had some positive things to say, noting that crypto and Bitcoin’s accomplishments have been \"quite amazing\", but ultimately struck a skeptical tone when he reasoned that Bitcoin \"has no relation to anything... it moves and has no relation. It’s a tiny thing that gets a disproportionate attention.\"\n\nThe billionaire Bridgewater Associates founder went on to say: \"It’s not going to be an effective money. It’s not an effective store hold of wealth. It’s not an effective medium of exchange.\"\n\nIt should be stressed that Dalio is not arguing in favor of the status quo. In fact, he has gained attention both in and outside the world of finance for his views on the cyclical nature of history and empire, and his belief that the globe is currently going through the kind of radical power shifts that happen every couple of centuries or so.\n\nAs such, he asks broad questions, and hints at possible outcomes: \"We are in a world in which money as we know it is in jeopardy, right? We are printing too much and it’s not just the United States, all the reserve currencies... And so in that world, the question is, what is money and how’s that going to operate? So when we look at something like China’s renminbi, and then you take the digital renminbi, I think you’re going to see that become more and more a thing... I think the question over the next number of years is really what is money, not just as a medium of exchange, but a store hold of wealth.\"\n\nKeep Reading Nigeria Presses Binance amid Economic Turmoil and Detains Executives\n\nDalio also suggested that: \"What would be best is an inflation linked coin. In other words, something where basically you would say okay, this is going to give me buying power because every individual wants, what do they want? They want to secure their buying power, if you want to save.\"\n\nNot surprisingly, these comments prompted significant pushback from Bitcoin’s proponents, since the leading cryptocurrency is heralded by its advocates as addressing precisely the issues that Dalio points to. That is, in a shifting, unstable world, where people are questioning the reliability of money itself, where preserving wealth and buying power are genuine problems, and in which digital transactions are rapidly becoming the norm, Bitcoin is presented as an all-purpose solution.\n\nWhat’s more, Bitcoin has a first-mover advantage, operates internationally and outside of institutional influence, and introduces a radical new framework for money and transactional capability: that of decentralization and separation from the state.\n\nThe possibility of transitioning into new kinds of money and value storage has become a reality, as evidenced by governments around the world assessing the viability of CBDCs. However, it shouldn’t be overlooked that in democratic nations, there are voters opposed to such schemes, and there are coherent arguments stating that if we are to explore new ways of transacting, then we should take the generational decision to steer away from CBDCs and instead make use of digital currencies that operate independently from central banks.\n\nDebate and development are likely to intensify around these issues in the coming years, but the reality is that while bureaucrats maneuver slowly, cryptocurrency is a dynamic area not waiting for anyone’s rubber stamp.\n\nWatch the recent FMLS22 session on Forex and crypto trends for 2023.\n\nDigital Markets\n\nA striking part of Dalio’s comments was his opinion that Bitcoin has ‘no relation to anything’. It’s an understandable point of view at first glance, but it seems to overlook the new varieties of trade and activity that cryptocurrencies are enabling and the thinking around their nature.\n\nIf we look broadly at Bitcoin and the many other blockchains that have followed in its wake, then it's true that they often appear separated from the physical world, but this aspect of crypto development-its detachment-can have beneficial effects.\n\nTaking in DeFi, NFTs, and the token-fuelled, ever-expanding ecosystems that are emerging around blockchains such as Ethereum, Cardano and Cosmos, we find fully functioning alternative markets and financial mechanisms, operating smoothly without having sought anyone’s permission first, but doing so entirely in the digital realm.\n\nWhat’s more, they are highly accessible to both users and developers, in the sense that while they require some technical proficiency, they are not gated or (for now, at least) restrictively regulated. This means mistakes will be made and will be allowed to occur, but it also means there is a tremendous opportunity for experimentation.\n\nBeing disconnected from physical markets isn’t a disadvantage here, rather, it allows for rapid development, and there is a sense that what’s being built is in position and ready to connect, as the wider world’s ongoing digital transition continues.\n\nFurthermore, we should remember that while these networks are digital, their blockchain-based tokens are traded in exchange for plain old fiat currency, and any profits or losses taken are as real as the paper in a wallet.\n\nTrading Culture\n\nAnother point sometimes overlooked when assessing crypto is that it allows for a new kind of trade, not in physical goods or commodities, but rather, in cultural assets, or even in culture itself.\n\nThis kind of observation can start to sound a little abstract, but it simply requires a recognition that much of what is being created and exchanged on social media and in other ways over the web, and which drives web traffic globally, is culture. That means billions of people are networked together to exchange and amplify ways of thinking, trends and social swings.\n\nThrough certain aspects of crypto, whether that’s meme coins, NFTs related to art and design, or tokens tying together all kinds of communities, these parts of the web, and of our cultural life, become tradable, and new online markets emerge.\n\nBitcoin Lays a Foundation\n\nDalio believes that Bitcoin receives \"disproportionate attention\", so it’s worth asking why that might be, and what proportion of attention would be appropriate. For young retail traders entering markets for the first time, owning Bitcoin is no longer an exotic proposition, and crypto does not come across as an asset class that might simply cease to exist.\n\nIn fact, through being decentralized and digital-only, crypto is open for business 24 hours a day, every day of the year, to anyone, anywhere, and it’s in a state of constant flux, all of which can make it a uniquely attractive proposition, particularly to those who are not invested in the conventions of traditional finance. And, within this nascent realm, it’s Bitcoin that is the foundational currency, and which acts as a grounding layer from which everything else has developed.\n\nIf we accept that crypto, its culture and its products are now here to stay and that they are likely to attract more developers, traders and users with every generation that comes of age, then it’s plausible that Bitcoin will come to be seen as having received disproportionately less attention than it actually should have."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA3L2JpdGNvaW4tbWluZXJzLWh1dC04LWh1dC11cy1iaXRjb2luLXRvLWNvbWJpbmUtaW4tYWxsLXN0b2NrLW1lcmdlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miners Hut 8, US Bitcoin to Combine in Stock Merger (1)_ - Bloomberg",
        "content": "Bitcoin miners Hut 8 Mining Corp. and US Bitcoin Corp. are merging in an all-stock deal after a prolonged slump in cryptocurrency prices heaped pressure on the industry.\n\nThe combined company will have a market capitalization of about $990 million, according to a statement Bloomberg Terminal on Tuesday. It will have “access to” roughly 825 megawatts of “gross energy” across six sites. US Data Mining Group Inc. is the legal name of US Bitcoin Corp. Shares of Hut 8 fell as much as 11% after the announcement."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDcvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtZGVjbGluZS1pbi1iaXRjb2luLXRyYW5zZmVycy11bmRlcmxpbmVzLWludmVzdG9yLW9wdGltaXNtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin BTC Price, Ether ETH Price Surge Casting Dark Days of 2022 to the Past - CoinDesk",
        "content": "Bitcoin’s has risen about 38% year to date and 44% over the last 90 days. As a result, many traders could take profits. The absence of a sharp increase in BTC deposits to exchanges should be an encouraging sign for bullish investors."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtbWV0cmljLXdoaWNoLWN1ZWQtYmlnZ2VzdC1iaXRjb2luLWJ1bGwtcnVucy1icmFrZXMtb3V0LWF0LTIza9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "BTC price metric that cued biggest Bitcoin bull runs breaks out at $23K - Cointelegraph",
        "content": "A little-known Bitcoin (BTC) price metric has just given a new bull run signal — and it has never been wrong.\n\nAs noted on Feb. 8 by Caleb Franzen, senior market analyst at Cubic Analytics, the Williams %R oscillator has left its bottom zone for the first time since May 2022.\n\nAnalyst: Oscillator crossover is a “great sign”\n\nBitcoin gaining 40% in January and continuing to hold higher levels has produced breakout signals across various on-chain indicators.\n\nSome analysts are cautious, opting to wait and see if the improved conditions last, but for Franzen, the data coming from the Williams %R oscillator is of particular interest.\n\nWilliams %R is a momentum oscillator that measures how near BTC/USD is to its recent highs or lows. Momentum oscillators are utilized to measure the strength of a price trend, and Bitcoin’s January performance has made it a prime test case.\n\n“Bitcoin’s 12-month Williams%R oscillator left the ‘oversold’ threshold as of January’s monthly close!” Franzen wrote in part of a dedicated Twitter thread.\n\n“Historically, leaving the lower-bound has signaled two things: 1. The cycle lows are in. 2. The bear market is over.”\n\nHe added that the phenomenon was a “great sign” while acknowledging that a bull run was not guaranteed.\n\nAn accompanying chart nonetheless showed the tight relationship between such Williams %R threshold crosses and subsequent long-term BTC price behavior.\n\nThe last, for example, came in April 2019, with BTC/USD then beginning its journey out of its bear market lows to ultimately hit all-time highs in November 2021.\n\nA “caveat,” meanwhile, comes in the form of varying timeframes for Williams %R. Franzen noted that only the 12-month iteration of the metric had flipped bullish, with the 18-month version remaining “oversold.”\n\n“If/when this crosses > oversold, it will add to the bull case,” he added.\n\nBTC/USD with Williams %R oscillator annotated chart. Source: Caleb Franzen/Twitter\n\nSigns of Bitcoin rebirth come thick and fast\n\nFranzen is far from alone in keeping the faith when it comes to current BTC price action.\n\nRelated: Happy Bitcoin anniversary, Tesla — Elon Musk firm still hodls 9.7K BTC\n\nOver the weekend, popular trader Credible Crypto described the status quo as “identical” to Bitcoin’s late-2020 breakout that saw it cross its prior all-time high from 2017.\n\nEncouraging signs have also come from macroeconomic sources, notably the United States Federal Reserve, as well as internal phenomena such as the long-awaited “golden cross” event on the daily chart.\n\nJanuary, meanwhile, saw a renewed influx of institutional cash into Bitcoin, which took the majority of resources as investors shied away from many altcoin products. Weekly inflows for the last week of the month were the highest in seven months.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA4L2FmZmlybS1zaHV0cy1kb3duLWNyeXB0by1idXNpbmVzcy_SAVNodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9hZmZpcm0tc2h1dHMtZG93bi1jcnlwdG8tYnVzaW5lc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Payments Company Affirm Is Shutting Down Its Crypto Business - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL2d1aWRlcy9vcmRpbmFscy1hcmUtYml0Y29pbi1uZnRzLWFuLW92ZXJ2aWV3LW9uLWluc2NyaXB0aW9ucy_SAV5odHRwczovL3d3dy5uZnRjdWx0dXJlLmNvbS9ndWlkZXMvb3JkaW5hbHMtYXJlLWJpdGNvaW4tbmZ0cy1hbi1vdmVydmlldy1vbi1pbnNjcmlwdGlvbnMvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Ordinals are Bitcoin NFTs an Overview on Inscriptions - NFT Culture",
        "content": "In February 2022, a proposal was sent to the Bitcoin dev mailing list to bring NFTs to the Bitcoin network. The idea is to assign each Satoshi (a unit of Bitcoin) an ordinal number, which would then be linked to extra information such as text, images, videos, and games. This would create digital artifacts, or NFTs, that can be stored on the Bitcoin blockchain.\n\n💡Key Takeaways on Ordinals and Inscriptions for BTC NFTs💡\n\nWhat is an Inscription? An Inscription is a type of digital asset stored on the Bitcoin blockchain that allows the creation and transfer of unique digital artifacts.\n\nIt is different from traditional tokens as it is stored in the OP_RETURN field of a Bitcoin transaction, which can store a small amount of data.\n\nInscriptions allow the creation of unique, non-fungible digital artifacts that can be used for various purposes such as art, collectibles, and more. How does this compare to NFTs on Ethereum? Inscriptions are different from NFTs on Ethereum in that they are stored fully on-chain, making them immutable and fully decentralized.\n\nNFTs on Ethereum, on the other hand, use token standards such as ERC721 or ERC1155 to create collections of tokens, each with a unique tokenID.\n\nAnother difference is that creating or transferring an NFT on Ethereum can result in high transaction costs, while the transaction fee for sending Inscriptions is relatively low due to transaction fee optimizations with Taproot on Bitcoin.\n\nA potential disadvantage of Inscriptions is that all content stored on the blockchain is permanent, including any illicit or unsavoury content. Where can I find Inscriptions? You can find all the ordinals by going here\n\nWhat if I want to make Ordinals and Inscriptions?\n\nRight now the easiest way we have found is a tool called Gamma. You can see the guide to create Gamma BTC NFTs here. Please do your own research and assume your own risk. This is a tedious but not complicated process. Good Luck.\n\nOrigin of Ordinals and Bitcoin NFTs\n\nThe proposal has received mixed reactions from the crypto community, with some considering it an exciting new use case for Bitcoin, while others believe that Bitcoin should remain as a system for digital cash and not be evolved into something else. There are also concerns about the potential increase in transaction fees and resource demands on nodes.\n\nThe process of creating an NFT starts with creating a Bitcoin transaction that stores the extra information, called an “Inscription,” in one of the output addresses. This data could be text, images, SCG, or HTML, and its size is only limited by the block size limit. Unlike traditional Bitcoin transactions that use an OP_RETURN to add extra data, the Ordinal approach stores the metadata within the transaction itself, making use of the 2021 segwit update that allows up to 3MB of witness data to be stored outside of the 1MB block limit.\n\nTo transfer an NFT, it is assigned an ordinal number based on the first-in-first-out algorithm and then transferred in a Bitcoin transaction. Not all Ordinals have Inscriptions assigned to them, so not every transaction may involve an NFT.\n\nThe proposal to bring NFTs to the Bitcoin network has sparked a debate in the crypto community, with some embracing the idea of digital artifacts on the Bitcoin blockchain and others concerned about the potential consequences. The technical process of creating and transferring NFTs involves creating a Bitcoin transaction with extra data, or an Inscription, and assigning an ordinal number to each Satoshi involved in the transaction.\n\nThats great so what are Inscriptions?\n\nIn the context of Bitcoin Ordinals, an Inscription is the metadata that is attached to a bitcoin (satoshi) in the form of extra data stored within a Bitcoin transaction. This extra data could be anything from text, images, sound files, HTML, or other digital assets, and the size of the Inscription is capped by the block size limit. The idea behind Inscriptions is to create non-fungible properties for bitcoin, allowing each satoshi to have its own unique digital artifact.\n\nThe Inscription data is stored within the raw transaction data and is created by creating a Bitcoin transaction that stores the extra data (the Inscription) in one of the output addresses. The Inscription is created through a two-phase process, with the first phase committing the taproot output to a script containing the Inscription content. This content is serialized within the transaction in a form known as an “envelope”. The second phase involves creating another transaction to reveal the Inscription information, where the output created by the commit transaction is spent, revealing the Inscription content on the blockchain.\n\nThe Ordinal number assigned to each satoshi is used to identify and link the Inscription to a specific bitcoin, allowing the digital artifact to be transferred along with the bitcoin in a transaction. Not all Ordinals have Inscriptions assigned to them, and it is up to the users to create and attach Inscriptions to their bitcoins as they see fit.\n\nTLDR: Inscriptions are a new concept in the world of Bitcoin that allow users to attach metadata and other digital assets to their bitcoins, creating unique digital artifacts. This opens up new opportunities for Bitcoin to be used in ways that go beyond its original purpose as a digital currency, and has the potential to bring new and exciting use cases to the world of cryptocurrency.\n\nHere is an example inscription and data\n\nSo how does this compare to ethereum NFTs?\n\nIn comparison to NFTs on Ethereum, the creation and use of Inscriptions on Bitcoin is a distinct approach. On Ethereum, NFTs are created using token standards such as ERC721 and ERC1155 and are given a unique token ID to identify them, in addition to the account for the collection’s smart contract. The complexity of NFTs can lead to high transaction costs to mint or transfer them on Ethereum. However, with the transaction fee optimization of Taproot on Bitcoin, the cost of sending Inscriptions is significantly lower.\n\nAnother difference between the two is that all Inscriptions are stored directly on the blockchain, making them immutable and fully decentralized. This differs from NFTs on Ethereum where there have been concerns about the removal of metadata if the centralized storage solution goes offline or if the project manipulates the metadata. Despite the benefits of immutability, this also means that any illegal or undesirable content in Inscriptions will remain on the chain forever. There have already been instances of obscene Inscriptions and it is only a matter of time before illegal imagery is added. Websites that help visualize Ordinal data can block these images, but they will still exist on the blockchain. It’s worth noting that this issue is not unique to Inscriptions and has been a problem with arbitrary data storage on blockchains since their inception.\n\nWell what about Stacks the BTC Layer 2 Solution?\n\nStacks Layer 2 NFTs and Inscriptions both relate to the creation and use of digital assets in a blockchain context. However, they have differences in terms of their underlying technology, the way they are created, and their features.\n\nStacks Layer 2 NFTs are built on the Stacks blockchain, which is a Layer 2 scaling solution for the Bitcoin blockchain. This allows for NFTs to be created and stored more efficiently and cost-effectively than on the Bitcoin blockchain. Stacks Layer 2 NFTs can be used for a wide range of applications, including digital collectibles, gaming items, and digital art.\n\nInscriptions, on the other hand, are digital assets that are stored directly on the Bitcoin blockchain. They use Bitcoin’s scripting language to encode information about the digital artifact, and each Inscription is given a unique token to reference it. Unlike NFTs on smart contract blockchains like Ethereum, Inscriptions are fully on-chain and therefore immutable and decentralized. However, this also means that their data cannot be edited or deleted, and any unsavory or illegal content that is stored as an Inscription will be on the blockchain forever.\n\nTLDR: Inscriptions are like curio cards\n\nWhere can I find a technical walkthrough?\n\nTara Annison has a great medium article that goes into more detail here"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9iaXRjb2luLW1pbmVyLWRpZ2lob3N0LWNvbXBsZXRlcy1jb250cm92ZXJzaWFsLXBvd2VyLXBsYW50LWFjcXVpc2l0aW9uLWRvdWJsaW5nLWVuZXJneS1jYXBhY2l0eS_SAZEBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDgvYml0Y29pbi1taW5lci1kaWdpaG9zdC1jb21wbGV0ZXMtY29udHJvdmVyc2lhbC1wb3dlci1wbGFudC1hY3F1aXNpdGlvbi1kb3VibGluZy1lbmVyZ3ktY2FwYWNpdHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Digihost Completes Controversial Power Plant Acquisition, Doubling Energy Capacity - CoinDesk",
        "content": "Digihost \"believes that year round, the plant will continue to provide electrical power to the grid on demand in order to meet customers needs during extreme weather conditions and will also continue to run the plant as a peaker plant,\" according to the January statement. Peaker plants are turned on when demand for energy is high and are usually fossil fuel-powered."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMi8wOC9iaXRjb2luLWhvbGRpbmctYWJvdmUtMjAwMDAtb2ZmZXJzLW1pbmVycy1ob3BlLWFzLW1hcmdpbnMtYmVjb21lLWhlYWx0aGllci_SAXFodHRwczovL3RlY2hjcnVuY2guY29tLzIwMjMvMDIvMDgvYml0Y29pbi1ob2xkaW5nLWFib3ZlLTIwMDAwLW9mZmVycy1taW5lcnMtaG9wZS1hcy1tYXJnaW5zLWJlY29tZS1oZWFsdGhpZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin holding above $20,000 offers miners hope as margins become healthier - TechCrunch",
        "content": "Bitcoin holding above $20,000 offers miners hope as margins become healthier The cryptocurrency is still down from a year ago, but experts see it as a market recovery\n\nLast year was tough for cryptocurrency markets as many prices plummeted. But bitcoin has had a strong rally so far this year, and some mining experts see this as an opportunity for the space to stage a comeback.\n\nWhen bitcoin prices dropped to $16,000 in late 2022, profits were getting squeezed, Andy Long, CEO of bitcoin mining-focused White Rock Management, told TechCrunch. However, things may be looking up: Bitcoin’s price has increased about 39% to around $23,000 year to date, according to CoinMarketCap data.\n\nThat means margins are expanding, said Christian Lopez, director of fintech investment banking and head of blockchain and digital assets at Cohen & Company Capital Markets.\n\nThe cryptocurrency is still down from around $44,100 on the year-ago date, but industry members see a silver lining. “If you said to someone this time last year, ‘How would you feel about $23,000 for bitcoin?’ They would be horrified,” Long said. “We have fairly short memories, so in a year’s time. we will look down the barrel, and we’ll be at or over an all-time high hopefully, and over $100,000 by the end of 2024.”\n\nGiven the bitcoin price increase, miners are breathing a collective sigh of relief, Christopher Bendiksen, Bitcoin research lead at CoinShares, told TechCrunch. “The price recovery has relieved the worst pressure from many miners, and margins are looking much healthier.”\n\nLast year was tough for bitcoin miners; talks of bankruptcy lingered around many players in the industry thanks to significant downturns from high energy prices and revenues dropping, which in turn tightened margins and increased profit losses. In December, bitcoin miner Argo Blockchain avoided bankruptcy after Galaxy Digital agreed to acquire its facility for $65 million, TechCrunch previously reported.\n\nCore Scientific, one of the largest publicly traded crypto mining firms in the U.S., filed for Chapter 11 protection in December. That came just months after Compute North, a bitcoin mining data firm, filed for Chapter 11 in September; it had raised $385 million in strategic funding just seven months prior.\n\nWhile there are signs of recovery, bitcoin miners often have a different cost basis, so not all are in the clear yet, Bendiksen said. “There is also quite a bit of debt coming due these days, so liquidity squeezes might still hit those with limited cash and large upcoming payments.”\n\nThe average bitcoin miners are using Bitmain’s S19 or S19 Pro bitcoin miners, Lopez said. The breakeven point with that equipment is anywhere from $16,000 to $18,000 at bitcoin prices, he added. “So at today’s prices, they’re profitable. Obviously not as profitable as when bitcoin is up to $50,000, but still profitable.”\n\nThere are also elements like energy prices that play into bitcoin miners’ situations. But the mild winter across the U.S. has helped keep charges low, Long noted.\n\nThe two biggest factors contributing to bitcoin miners’ recovery are energy prices and the price of bitcoin related to hash price, which is a combination of bitcoin price and its mining difficulty, Lopez said. “So if energy prices are up and bitcoin’s price is low, you’re squeezing margins.”\n\nBut now, the industry is seeing the opposite happening: “The price of bitcoin is coming up, and energy prices are actually going down, so you’re seeing an increase in margin,” Lopez said. “That’s about 80% to 90% of your economic value because the price of energy and electricity is such a big driver.”\n\nThe hash price is near an all-time low, while hashrates, which are the amount of numerical guesses mining machines generate in a second, are near all-time highs, according to data from Blockchain.com compiled by Woobull Charts.\n\nAs long as these bitcoin prices and energy levels are maintained, miners will stick around, Lopez said.\n\nIn general, bitcoin miners are becoming more sophisticated with their energy usage, Lopez added. “Before it was cowboys who didn’t care about the price of energy because it was irrelevant, but now there’s been stress in the past year and a half, and they realized they have to manage their energy and deploy strategies in regards to that.”\n\n“I’m sure there will still be volatility,” Long said. “It’s the only thing you can rely on, but I think there’s a lot of support behind the new baseline price level. If it goes down again, it won’t concern me, because the long term trend will be up.”\n\n“There’s some technical analysis that says the darkest periods for bitcoin are 12-18 months after the last halving, then you’ll see a rally leading up to the next bitcoin halving, which is sometime in April or May of 2024,” Lopez said.\n\nBitcoin halvings are events that happen almost every four years when the blockchain rewards for miners get cut, effectively reducing the supply of new bitcoins by 50%. Over time, the outcome of each halving will decline as the block rewards approach zero when the total 21 million bitcoins are mined (but that won’t be for a very long time, thanks to this mechanism).\n\nTypically during halving cycles, there’s a curve that happens around six months after halvings of all-time high peaks and then drawbacks, Long said. “There’s no guarantees, but I think the sheer economics and demand will be bullish in the long term.”\n\nAfter a cascade of unexpected events in 2022, “a lot of the fear is out,” Lopez said. “The last shoe to drop I think was [the] FTX [bankruptcy] and the follow-up from DCG and Genesis. I don’t think there’s anything else hidden, but there might be. If there’s more fraud or bad bets, you’ll see more volatility. As long as we have nothing else to uncover, it’ll probably trade sideways for a while, and you’ll see a run up into the next halving.”\n\nAll in all, “recovery is well underway,” Long said. “The bear market we just went through was long, but it’s time for the momentum to change. This doesn’t mean we won’t still have volatility, but I think we’ll continue to see a small march up.”"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRha2VzLWxpb24tcy1zaGFyZS1hcy1pbnN0aXR1dGlvbmFsLWluZmxvd3MtaGl0LTctbW9udGgtaGlnaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin takes 'lion's share' as institutional inflows hit 7-month high - Cointelegraph",
        "content": "Bitcoin (BTC) rebounding 40% in January sparked the largest inflows of institutional cash since June 2022, data shows.\n\nIn its “Digital Asset Fund Flows Weekly” report on Jan. 30, digital asset investment and trading group CoinShares confirmed $117 million heading into crypto in the last week of the month.\n\nInstitutions “not sold” on post-Merge Ethereum\n\nBitcoin is still on the radar as an institutional investment opportunity.\n\nAs demonstrated by CoinShares’ latest data, it took just weeks of BTC price action recouping prior losses to spark a significant turnaround in investment habits — and not just in the United States.\n\n“Last week’s US bears seem to have changed their mind with US$117m inflows, including US$26m from the United States,” CoinShares wrote in a Twitter thread accompanying the report.\n\n“This is 3x the amount from last week. Total AuM had risen to US$28bn, up 43% from their November 2022 lows.”\n\nGermany was the surprise leader, responsible for 40% of the week’s tally, followed by Canada.\n\nDespite altcoins rallying in line with Bitcoin, however, institutions appear mainly interested in BTC when it comes to cash.\n\nIn the words of CoinShares, “the focus was almost entirely on Bitcoin,” a fact not lost on market participants eyeing a potential shift in preferences away from the Ethereum-centric decentralized finance arena.\n\n“This is evidence that institutional money isn't sold on the Ethereum thesis,” popular Twitter account Pillage Capital argued.\n\nThe numbers likewise belied testing times for certain altcoins, with CoinShares singling out Bitcoin Cash (BCH), Stellar (XLM) and Uniswap (UNI). Solana (SOL), Cardano (ADA) and Polygon (MATIC) nonetheless saw net inflows.\n\n“Multi-asset investment products saw outflows for the 9th consecutive week totaling US$6.4m, suggesting investors are preferring select investments,” it commented.\n\nWeekly Crypto Asset Flows chart. Source: CoinShares/ Twitter\n\nGBTC sinks towards new record discount\n\nMeanwhile, after staging a marked comeback of its own, the largest Bitcoin institutional investment vehicle seems to be running out of steam once more.\n\nRelated: Bitcoin sees golden cross which last hit 2 months before all-time high\n\nThe Grayscale Bitcoin Trust (GBTC) traded at a 43% discount to the Bitcoin spot price on Feb. 7, having recovered to 36.2% in mid-January.\n\nAs Cointelegraph continues to report, Grayscale currently finds itself caught up in difficulties impacting parent company Digital Currency Group following the disintegration of FTX in November 2022.\n\nHowever, GBTC was already struggling, with Grayscale attempting to force U.S. regulators to allow it to convert to the country’s first Bitcoin spot price exchange-traded fund.\n\nGBTC premium vs. asset holdings vs. BTC/USD chart. Source: Coinglass\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL2ludmVzdG1lbnQvYml0Y29pbi1wcmljZS1vdmVyLTEtbWlsbGlvbi1pbi03LXllYXJzLWNlby1jYXRoaWUtd29vZC1iZWxpZXZlcy01OTI1MDAuaHRtbNIBfGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL2FtcC93b3J0aC9pbnZlc3RtZW50L2JpdGNvaW4tcHJpY2Utb3Zlci0xLW1pbGxpb24taW4tNy15ZWFycy1jZW8tY2F0aGllLXdvb2QtYmVsaWV2ZXMtNTkyNTAwLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "A 6,000% Spike? Meet This US-Based CEO Who Believes Bitcoin Price Will Hit Nearly $1.5 Million By 2030 - Indiatimes.com",
        "content": "At a time when collapsed crypto exchange FTX's customers still don’t know if they’re going to get their money back or not and the crypto market is trying to recover from the horror year that 2022 was, one of cryptocurrency’s biggest optimists still says Bitcoin is primed for a massive comeback.\n\nUS-based ARK Investment Management and its CEO, Cathie Wood, have continued to buy crypto and shares of crypto companies even during the sector’s historic downturn over the past year. They are also betting on Bitcoin rising to new heights soon enough. All investors need is a little patience and faith.\n\nBitcoin To Hit Nearly $1.5 Million By 2030\n\narkinvest\n\nCathie Wood's company has forecasted Bitcoin to bounce back from its current lows to eventually be worth $1.48 million by 2030, a bullish scenario that would see Bitcoin’s value rising by more than 6,300% in just seven years, as per a Fortune report.\n\n\n\nEven as per the company's “bear case” scenario, Bitcoin’s value is expected to rise to a record $258,500 by 2030, and in the “base case” scenario, Bitcoin will grow to be worth $682,800.\n\nAlso Read: US Man Pays 10,000 Bitcoins For Pizza\n\n$500,000 By The Year 2026\n\nshutterstock\n\nBitcoin is currently trading at around $23,000, a far cry from its all-time high of nearly $70,000 achieved in November 2021. Those were good times for crypto bulls, when up to a quarter of holders were convinced that Bitcoin could exceed $100,000 in fewer than five years. Cathie Wood was exceptionally upbeat about Bitcoin’s chances, even predicting in 2021 that it could hit $500,000 by 2026 if institutional investors and investment banks began piling in.\n\n\n\nThat was also peak crypto, as it turns out. As inflation rose last year and enthusiasm for speculative assets including cryptocurrencies dwindled, the Crypto Winter began and coins tumbled in value.\n\nIn the 12 months after its November 2021 peak, the crypto sector lost over $2 trillion in value, with Bitcoin in particular down around 60% since then. And the entire crypto industry was rocked in November when FTX, one of the world’s largest crypto exchanges, collapsed and lost billions of dollars in customer funds.\n\nAlso Read: 5 Crypto Firms That Filed For Bankruptcy Besides FTX\n\nCathie Wood's Belief in Bitcoin\n\nindiatimes\n\nBut through it all, CEO Cathie Wood and her firm, ARK, have held onto their big Bitcoin bet. Even during the FTX implosion later last year, ARK research director Frank Downing said the firm’s conviction in Bitcoin’s underlying blockchain technology had \"only increased\" in the wake of the crash. In December, Wood tweeted that the Bitcoin blockchain \"didn’t skip a beat\" during the FTX debacle, which she took to signify the coin’s transparency and resilience during downtimes.\n\n\n\nOver the next 7 years, Cathie Wood's ARK expects bitcoin to become a “multitrillion-dollar market” because of its strong fundamentals, according to the new report, as the firm expects the crypto asset to outperform “every major asset class over longer time horizons.” The sector’s recent difficulties may even help restore trust in Bitcoin in the long term as exchange companies become more transparent with their finances to avoid a similar fate that befell FTX, ARK argued.\n\nEven institutional investors, including BlackRock and Fidelity, have not wavered on their commitment to Bitcoin despite the market downturn, the report also found, reinforcing the coin’s fundamentals.\n\n\n\nAlso Read: Why Goldman Sachs Is On The Hunt To Invest Millions In Crypto\n\nFor the latest and interesting financial news, keep reading Indiatimes Worth. Click here."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy53Z3J6LmNvbS9hcnRpY2xlL21vbmV5L2J1c2luZXNzL2JpdGNvaW4tbWluaW5nLWNvbXBhbnktY2xvc2luZy1pbi1vbi1wdXJjaGFzZS1vZi1ub3J0aC10b25hd2FuZGEtcG93ZXItcGxhbnQvNzEtNjQ5YTk3ZjUtMzhlNy00ODY4LTg5ZmQtY2MwYzMzYzBmYjEx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin mining company closes in on purchase of North Tonawanda power plant - WGRZ.com",
        "content": "The 60-megawatt plant will power Digihost's mining operation, which has already been installed on an adjacent property.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nNORTH TONAWANDA, N.Y. — A cryptocurrency mining company is nearly ready to purchase a North Tonawanda power plant, despite a legal challenge from environmental groups.\n\nDigihost Technology Inc. of Toronto expects to close on the Fortistar natural gas plant on Erie Avenue by the end of the month, the company announced.\n\nThe purchase has been approved by the Federal Energy Regulatory Commission and the New York Public Service Commission. The Clean Air Coalition of Western New York and Sierra Club have filed a lawsuit challenging the PSC's decision."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2FiZWU3ZTJlLTFkMTgtNGE2OC1hYWM1LTY2NTg2OWRiMjUwZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "DCG sells shares in Grayscale crypto trusts in push to raise funds - Financial Times",
        "content": "Print this page\n\nCrypto conglomerate Digital Currency Group has begun to sell shares in several of its most prized cryptocurrency funds at a steep discount, as it seeks to raise capital to pay back creditors of its bankrupt lending arm.\n\nSoftBank-backed DCG has started to offload its holdings in several investment vehicles run by its subsidiary Grayscale, according to US securities filings seen by the Financial Times.\n\nThe move to sell down the assets underscores the financial difficulties at DCG as it tries to raise funds to support collapsed lending units under crypto broker Genesis, while seeking to preserve its most cash-generative business.\n\nConnecticut-based DCG, founded in 2015 by former banker Barry Silbert, is one of the largest and oldest investors in crypto coins and businesses. It is backed by investors including SoftBank, Singapore’s sovereign wealth fund GIC and Alphabet’s venture arm CapitalG.\n\nGrayscale, DCG’s asset management business, is an important asset: it earns hundreds of millions of dollars per year in lucrative fees for managing large pools of bitcoin, ether and other cryptocurrencies in funds that investors can buy shares in from their brokerage accounts.\n\nDCG is selling stakes in one of Grayscale’s largest trusts even though the shares over the past two years have fallen to substantial discounts to the underlying value of cryptocurrency they hold.\n\nIt is seeking to raise money after the lending units of Genesis, its crypto broker, collapsed into bankruptcy in January, becoming the latest large crypto company to fail after the downfall of Sam Bankman-Fried’s FTX exchange rocked the digital asset industry.\n\nThe US group has been attempting to repay more than $3bn to its creditors and has been embroiled in a public dispute with the Winklevoss twins’s Gemini exchange over the debts. To raise further funds, the group last month hired Lazard bankers to help sell its trade news site CoinDesk. It is also seeking to offload some of its $500mn venture portfolio, the Financial Times previously reported.\n\nOn Monday, after months of negotiations, DCG reached an agreement with Genesis’ main creditors, including Gemini. “This plan is a critical step forward towards a substantial recovery of assets,” said Cameron Winklevoss.\n\nDCG’s recent share sales have focused on Grayscale’s ethereum fund, where the group has moved to sell about a quarter of its stock to raise as much as $22mn in several trades since January 24, according to the filings. The company is selling at about $8 per share, despite each share’s claim to $16 of ether.\n\n“This is simply part of our ongoing portfolio rebalancing,” DCG said.\n\nGrayscale earns a 2.5 per cent management fee on the 3mn of ether in the trust, equating to $209mn in the year to end September. DCG last sold shares in the Ethereum Trust in 2021, when the vehicle traded nearly at par with its net asset value, according to the filings provided by The Washington Service. Today the shares trade at half the value of the ethereum coin they represent.\n\nIts flagship bitcoin trust holds about 3 per cent of all bitcoin, worth $14.7bn, from which Grayscale earns a 2 per cent fee. It earned $303mn from fees on the bitcoin trust in the first nine months of 2022, according to securities filings.\n\nDCG has also moved to sell down smaller blocks of shares in Grayscale’s Litecoin Trust, Bitcoin Cash Trust, Ethereum Classic Trust and Digital Large Cap Fund, according to the filings.\n\nThe group does not allow investors to redeem their shares for the coins held in the trusts, which would help close the significant net asset value gaps. Grayscale is suing the US Securities and Exchange Commission over blocking the creation of a spot bitcoin ETF, arguing that this would benefit investors and allow redemptions.\n\n“DCG faces a trade-off: they could allow redemptions and enable liquidity at par value, including for their own holdings, but they’re better off not doing it because they make so much money from the management fees,” said Ram Ahluwalia, chief executive of Lumida Wealth. “Closing the discount would mean giving up this cash cow.”\n\nBefore cryptocurrency was easily tradable through reputable exchanges, the shares in Grayscale’s trusts traded at a large premium to the value of the coins they held, incentivising holders of bitcoin and ethereum to hand over their coins for shares in the Grayscale vehicles."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb2luZGVzay1pbmRpY2VzLzIwMjMvMDIvMDcvaG93LXRoZS10b3AtMS1jb3ZlcnMtY3J5cHRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "A Look at DLCS and How the Top 1% Covers Crypto - CoinDesk",
        "content": "Since its launch on April 4, 2022, the DLCS has lost 57.2% (data ending Jan. 20, 2022 ). This performance reflects the difficult environment of the time due to the combination of macroeconomic factors such as inflation and rising rates and the impacts of crypto-specific events such as Terra/Luna, Voyager, 3AC and FTX. Since the FTX’s collapse, DLCS has recovered 35.4%, and it is up 29.3% year-to-date in 2023 (data ending Jan. 20). Optimism on decelerating inflation and smaller rate hikes coupled with digital asset decentralization, interoperability and infrastructure is driving the rebound. The market will likely continue to capitulate in the short term and grow in the long term. DLCS will measure it all in real-time along the way."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8xMS0wMDAtbmZ0cy1taW50ZWQtYml0Y29pbi0wMTI0NTAzNzcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "With 11,000 NFTs Minted to Bitcoin, Are Bitcoin Maxis Coming Around? - Yahoo Finance",
        "content": "When Ordinals launched in January, it caused an uproar in the Bitcoin community as enthusiasts, advocates, and developers argued the merits of putting JPEG on the blockchain. While the heated debate continues, the number of Bitcoin inscriptions using Ordinals has already surpassed 11,000 on Tuesday, according to a Dune report.\n\nOrdinals are the latest project aiming to bring NFTs into the Bitcoin ecosystem. The first project, Counterparty, first introduced non-fungible tokens to Bitcoin with the Rare Pepes collection in 2014, with Stacks following in 2017. However, the Ordinals project is different because the assets, including JPEGs and even video games, are inscribed directly on satoshis on the Bitcoin blockchain without needing a sidechain or additional token.\n\nThe Ordinals project has consumed the Bitcoin community and sparked new debates and questions about the ultimate purpose of the Bitcoin network. For some, Ordinals opened Pandora's box of threats to the Bitcoin network, including malware attacks and skyrocketing transaction fees.\n\nThe Ordinals block explorer should be browsed with caution, IMO. It has auto executing, unvetted pieces of JS code executing in your browser that possibly could be malware. Seems like a minefield you should probably avoid. — Pledditor (@Pledditor) February 7, 2023\n\nOther responses are not as apocalyptic.\n\nOrdinals Launches NFTs on Bitcoin, Unsurprisingly Sparking Controversy\n\nLong-time Bitcoiner Dan Held tweeted his support of Ordinals, saying the project is “good for Bitcoin.” Held shared a screenshot from an email by the late Hal Finney, where he wrote about “crypto trading cards.” Held said Finney would like Bitcoin NFTs. Finney, who passed away in 2014, is one of many believed to have been the pseudonymous creator of Bitcoin, Satoshi Nakamoto.\n\nHal Finney would like Bitcoin NFTs. pic.twitter.com/z4cO468pcA — Dan Held (@danheld) February 6, 2023\n\nUnlike Ethereum and Solana, Ordinals calls its NFTs “digital artifacts,” with others in the Bitcoin space calling the digital asset simply “inscriptions.” Ordinal inscriptions are possible thanks to a feature introduced by the Bitcoin Taproot upgrade in November 2021 that allows storing arbitrary data to a satoshi’s witness.\n\nStory continues\n\nBullish on ordinals increasing the #Bitcoin fee market (even if temporarily). Miners could use a little revenue these days. — Dennis Porter (@Dennis_Porter_) January 30, 2023\n\nInterest in Ordinals has steadily increased since developer Casey Rodarmor launched the project on January 21, 2023, with some looking to push the limits of what can be inscribed on a satoshi.\n\nOrdinal inscriptions of random JPEGs is boring Ordinal inscriptions of JPEGs containing text of banned books, the Bible, leaked documents from governments, etc is ALOT more interesting — Eric Podwojski 🟠 (@epodrulz) February 7, 2023\n\n“The Ordinals project is a milestone for bitcoin, demonstrating how innovation on the bitcoin network can give rise to a breadth of new applications beyond its use as sound money,” Lolli co-founder and CEO Alex Adelman told Decrypt in an email, calling Ordinals a homecoming moment for Bitcoin.\n\nSports Fans Twice as Likely to Buy Bitcoin, Ethereum, NFTs\n\nAdelman says that while Bitcoin still lags far behind Ethereum in the volume of investment and talent committed to innovating and developing new applications, Bitcoin NFTs will attract a new wave of interest and capital and create new opportunities for developers to build novel solutions to facilitate scalability and efficiency.\n\nIf Ordinals can kill Bitcoin, it was never alive in the first place — Spenny (@CryptoLanroc) February 7, 2023\n\nWhile the thrill of minting NFTs on the Bitcoin blockchain has drawn new attention from adherents to the OG blockchain, Ordinal inscriptions lack the features many associates with NFTs, like smart contracts, which the Bitcoin blockchain does not natively support.\n\nSatoshibles developer Brian Laughlan believes the limitations of Ordinals will bring more attention to projects like Stacks.\n\n“The reason I am bullish on Stacks even more now is because people will eventually start to feel the limitations of ordinals—high main chain fees, no smart contracts, etc,” Laughlan told Decrypt on Discord. “They will look to L2 solutions, and Stacks is ready to fill that gap.”\n\nLaughlan says backlash from Bitcoin maximalists has made it hard for Stacks to “get its voice heard,” adding that Ordinals is the best thing Stacks could have asked for.\n\n“Now more people are looking at Bitcoin than ever,” he said. “You got ETH Maxis running Bitcoin nodes and Bitcoin Maxis loving jpegs all of a sudden! The world has gone mad.”\n\nAs the debate surrounding Ordinals continues, inscriptions on the Bitcoin blockchain are clearly here to stay—whether Bitcoin maxis like it or not."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL2NyeXB0by1lZHVjYXRpb24vb3JkaW5hbHMtYS1jb21tb24tZ3JvdW5kLWZvci1ldGhlcmV1bS1hbmQtYml0Y29pbi1tYXhpbWFsaXN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Ordinals: A common ground for Ethereum and Bitcoin maximalists? - Kraken Blog",
        "content": "Representing real-world assets on the Bitcoin blockchain is nothing new.\n\nOver a decade ago, projects like the Colored Coin protocol and Counterparty exchange proved Bitcoin could track items, not just units of currency, in a decentralized way.\n\nHowever, consensus issues prevented either project from gaining widespread adoption in the market. Ethereum quickly took over as the go-to platform for minting and deploying unique digital artifacts. This preference led to the rise of non-fungible tokens, or NFTs as they’re more commonly known today.\n\nBut, things appear to have come full circle as one Bitcoin developer looks to reinvent tokenized assets on the Bitcoin blockchain. Even the Ethereum community seems to be encouraging this new venture. The move suggests a potential unity between what many see as two of the cryptocurrency industry’s longest-standing rivals.\n\nWhat are Bitcoin Ordinals?\n\nBitcoin Ordinals use an open-source protocol that assigns unique identities to individual satoshis (sats). Named after Bitcoin’s creator(s), Satoshi Nakamoto, satoshis are the smallest units of bitcoin. Using the Ord software, the protocol adds data to these sats and allows software users to track them based on a system called ordinal numbers.\n\nAt a high level, this involves assigning a numerical value to each satoshi based on several factors. These factors include the time when that satoshi entered into circulation through mining as well as the specific block height where the satoshi appears.\n\nUsers can use software called Ord to track each satoshi. The system also inscribes them with content to create bitcoin-native digital artifacts.\n\nUsers can trade and transfer these uniquely-identified satoshis just like any normal bitcoin unit. But unlike Colored Coins or most Ethereum NFTs, the digital item itself is stored entirely on-chain — not elsewhere on the internet.\n\nThis functionality wouldn’t be possible on Bitcoin without implementing SegWit and Taproot — two soft fork upgrades that helped to increase Bitcoin’s block capacity.\n\nWho created Bitcoin Ordinals?\n\nBitcoin developer Casey Rodarmor launched the Ordinal protocol on January 21, 2023. Rodarmor set out to create a system for numbering satoshis that would give each a unique serial number. This unique identifier would then allow users to track each satoshi across the blockchain. He wanted to be able to accomplish this in a way that was entirely Bitcoin native, without using sidechains or separate tokens.\n\nRodarmor earned a degree in Computer Science from University of California, Berkeley. Most recently he worked as a software engineer for Agora, an open-source app that improves upon the Bitcoin Lightning Network.\n\nRodarmor’s idea isn’t the first time a numbering system has been proposed to assign unique identifiers to individual satoshis. In fact, a BitcoinTalk user by the name of jl2012 published an almost identical proposal for Ordinals in October 2012. At the time, another Bitcoin developer discredited the post as an “old idea.”\n\nRodarmor has since acknowledged jl2012’s work in the last section of a mailing list post announcing Ordinals.\n\nHow do Ordinals work?\n\nThe Ordinal protocol consists of two main parts:\n\nOrdinal theory : The method of numbering satoshis for tracking, transfer, and value assigning purposes.\n\nInscription: The process of using the Ord software to associate content with a satoshi based on the number the software assigns. The Ord software associates content with real satoshis, but does so according to a numbering scheme unique to the Ord software.\n\nOrdinal theory\n\nOrdinals offer a method for assigning a unique identifier value to each of the 2.1 quadrillion satoshis that will ever be created.\n\nThe numerical value assigned to each satoshi acts as a serial number. The system creates this serial number based on how that satoshi relates to different periodic events that happen on the Bitcoin blockchain, including:\n\nBlocks : Batches of transactions that are committed to the Bitcoin blockchain roughly every 10 minutes. Blocks are the most common event Ordinals use to derive their numerical value.\n\nDifficulty adjustment periods : After every 2,016 blocks (approximately every two weeks), the Bitcoin protocol adjusts its mining difficulty target based on the amount of computational power being used to maintain the network. We call this the hashrate.\n\nHalvings epochs : After every 210,000 blocks (approximately every four years), the system halves the amount of new bitcoin entering circulation. There have been three halvings since the launch of Bitcoin.\n\nCycles: After every six halvings, a difficulty adjustment and halving take place simultaneously, resulting in an event known as a conjunction. Because halvings only take place every four years, conjunctions only take place every 24 years. Conjunctions are the least common event that Ordinals track, and the time frame between conjunctions is called a cycle.\n\nOrdinals use these events to create a process for tracking the comparative rarity of satoshis. The Ordinal Theory Handbook breaks down how satoshis relate to each of these events using the following rarity levels:\n\nRarity level Condition Amount (in total BTC supply) Common Any sat that is not the first sat of its block 2,099,999,990,756,525 Uncommon The first sat of each block 6,929,999 Rare The first sat of each difficulty adjustment period 3,437 Epic The first sat of each halving epoch 32 Legendary The first sat of each cycle 5 Mythic The very first sat of the genesis block 1\n\nBy assigning a unique identifier to each satoshi, Ordinals open a way of making inherently fungible satoshis into non-fungible objects. This identifier makes them completely unique, just like NFTs.\n\nOrdinal inscription\n\nWe refer to the committing of a piece of content to a satoshi as “inscription.” This process is accomplished using Ord, and you can see inscriptions with the ordinals explorer.\n\nThe system identifies the content by its MIME type (whether it’s a JPEG, an MP3 file, HTML code, etc) and a byte string (the content itself). Inscriptions don’t necessarily have to represent a non-fungible token. Users can also create Bitcoin-based security tokens and other assets.\n\nOrdinal inscriptions are entirely on-chain and stored within the script of a taproot transaction. This process is different from many of the most prevalent NFT collections on the Ethereum blockchain. Usually, the Ethereum blockchain stores NFT media content off-chain, while keeping only a record of the NFT on the blockchain.\n\nOnly a select few NFT collections, the most prominent of which are CryptoPunks, store both the media and the NFT directly on-chain.\n\nThrough this inscription process, the blockchain stores content alongside a specific satoshi. The process turns the satoshi into a unique digital artifact that users can track, transfer, hold, buy, and sell.\n\nHow Bitcoin Ordinals (may) impact Ethereum NFTs\n\nThe Ordinals protocol has resurrected the vast potential of tokenizing assets on Bitcoin’s highly secure, decentralized blockchain. Not only that, it also serves as a means of permanently storing digital content directly on-chain — something rarely seen in the NFT space.\n\nThis innovation has already spurred the interest of existing Ethereum-based NFT creators, including Tom W, a co-founder of Cool Cats. On the official Ordinals Discord server, they commented, “Hey all, Im Tom, one of the co-founders of Cool Cats NFT. Here to experiment with some cool shit. https://twitter.com/coolcats.”\n\nWith renewed capabilities for launching existing popular collections on the Bitcoin blockchain, Ordinals may help to combat the long-standing problem of lost NFTs. These prevent external file storage issues and could open up potential new revenue streams for NFT creators.\n\nInterestingly, Ordinals are actually gaining traction. For example, Bitcoin Rocks from the Ethereum-based original collection have already sold for 0.2 BTC, while a blue check-verified Twitter user with the handle “businessman.eth” posted, “WOW!!! 0.42 BTC sale for an @OrdinalPunks #Bitcoin Ordinals are starting to gain steam.”\n\nWhile the true impact of Ordinals is still emerging, one thing is clear: maximalists from both Bitcoin and Ethereum camps are excited about the new opportunities these digital artifacts present.\n\nFollow blog.kraken.com and our Twitter account @KrakenFX for all the latest developments shaping the crypto industry.\n\nWant to see an Ordinal for yourself?\n\nClick here to see one of the latest Ordinals to be inscribed, brought to you by Kraken.\n\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, or hold any digital asset or to engage in any specific trading strategy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA3L2JpdGNvaW4tbWluZXItc3Ryb25naG9sZC1yZXN0cnVjdHVyZXMtZGVidC10by1pbXByb3ZlLWxpcXVpZGl0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Stronghold Restructures to Push Debt Payments With Lenders - Bloomberg",
        "content": "Bitcoin miner Stronghold Digital Mining, Inc. said it has reached an agreement with lender WhiteHawk Finance to push back debt payments.\n\nThe Kennerdell, Pennsylvania-based company is the latest crypto miner that’s been able to negotiate new terms with lenders to delay debt repayment amid a sustained rally in Bitcoin prices. Public crypto-mining companies such as Greenidge Generation Holdings Inc. and TeraWulf, Inc. were able to improve their loan terms in recent weeks."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kYW11cy10by1sdXJlLWluLWNyeXB0by10d2l0dGVyLXdpdGgtYml0Y29pbi1yZXZlbnVlLXBheW91dC1vcHRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Damus to lure in Crypto Twitter with Bitcoin revenue payout option - Cointelegraph",
        "content": "Decentralized social network Damus teased an upcoming feature in its app that would allow users to earn satoshis — the smallest fraction of Bitcoin (BTC) — based on post engagement on the platform.\n\nIn a tweet, the Damus team highlighted that there will be a feature that allows users to earn satoshis in the next version that’s “coming soon.” The team did not provide any details after the announcement.\n\nComing soon in the next version... earn sats directly on posts! This post earned 118k sats which is about $40. Pretty neat! pic.twitter.com/dAbWWD4i93 — Damus⚡️ (@damusapp) February 5, 2023\n\nDamus describes itself as a social network controlled by users and does not rely on centralized companies. The application is built on Nostr, or “Notes and Other Stuff Transmitted by Relays,” a decentralized network that enables end-to-end private messaging. There are no servers within its network. Instead, the protocol uses decentralized relays to distribute messages.\n\nVarious community members expressed their excitement about the new Damus feature, with some even going as far as describing Nostr as “the future of monetization.”\n\nFormer Twitter CEO Jack Dorsey has also been expressing support for Nostr by providing funds to the developers of the project. On Dec. 16, Dorsey said that he donated 14 BTC, which is around $250,000 at the time, to support the development of the decentralized social network.\n\nCointelegraph reached out to a Damus developer for comments but did not get a response yet.\n\nRelated: Twitter closes offices, staff resign while users eye decentralized options\n\nOn Feb. 1, Damus went live on the Apple App Store and became available for download for iPhone users. Following this, Jack Dorsey also shared the news through his Twitter account and described the update as a new “milestone” for open-source protocols.\n\nThe former Twitter CEO also pushed for the creation of a decentralized Twitter alternative back on Dec. 14. This followed the release of an internal investigation led by Elon Musk that highlighted censorship-related issues on Twitter. Dorsey highlighted potential solutions to the issues like resilience from corporate or government control, leaving the right to remove content to the authors and implementing algorithmic moderation."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLTE2MzkzNzAwMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Operator Coin Cloud Files for Bankruptcy With Liabilities of $100M-$500M - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nCoin Cloud, which operates more than 4,000 bitcoin ATMs across the U.S. and Brazil, has filed for bankruptcy protection with estimated liabilities of between $100 million and $500 million.\n\nThe Las Vegas-based firm has assets of between $50 million and $100 million and as many as 10,000 creditors, according to a filing in the U.S. Bankruptcy Court for the District of Nevada dated Feb. 7.\n\nThe company's largest creditor is Genesis Global Trading, which has an unsecured loan of just over $100 million. Genesis is a subsidiary of Digital Currency Group, which is also the parent company of CoinDesk. Genesis also discussed injecting equity into the ATM operator, Bloomberg reported in November.\n\nCoin Cloud hired legendary filmmaker Spike Lee to direct a commercial for it in 2021.\n\nRead more: Bankrupt Lender Genesis and Parent DCG Reach Initial Agreement With Main Creditors: Source\n\n\n\n\n\n\n\n"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL2JpZy1zaG9ydC1zdGV2ZS1laXNtYW4tc3RvY2tzLWZlZC1ob3VzZS1wcmljZXMtYml0Y29pbi1yZWNlc3Npb24tMjAyMy0y0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "'Big Short' Steve Eisman on Stocks, Fed, Housing, Bitcoin, Recession - Markets Insider",
        "content": "The rally in tech stocks this year could prove short-lived, Steve Eisman warned.\n\nThe \"Big Short\" investor sees growth stocks underperforming if the Fed doesn't cut interest rates.\n\nEisman said higher unemployment could hit the housing market, and dismissed bitcoin as pointless.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe surge in technology stocks this year might not last long, Steve Eisman warned in a recent episode of Bloomberg's \"Odd Lots\" podcast. He also cautioned a spike in unemployment could spark a flurry of home sales, ruled out another financial crisis, and panned bitcoin and other cryptocurrencies as pointless.\n\nEisman, a managing director of Neuberger Berman, is best known for predicting and profiting from the collapse of the mid-2000s housing bubble. He was portrayed by Steve Carell in the movie adaptation of \"The Big Short.\"\n\nHere are Eisman's 10 best quotes from the interview, lightly edited for length and clarity:\n\n1. \"Maybe this is the last hurrah right now for growth stocks. It will all depend pretty much on the Fed.\" (Eisman predicts the Federal Reserve will keep interest rates elevated, pulling down the valuations of tech stocks.)\n\n2. \"Housing hasn't collapsed in the United States, but it's kind of locked and housing prices have gone down. So A), it's hard to sell and B), you're selling for less. Now, as long as people are employed, they're not going to sell their home down 40%. They'll just live in their home.\" (He explained that a sharp rise in mortgage rates has depressed demand for new houses and made homeowners balk at picking up sticks.)\n\nAdvertisement\n\n3. \"The consumer is still in pretty good shape. As long as everybody's got a job, people will pay off their debts. If unemployment goes up, you'll see an increase in delinquencies and losses, but it's not going to be a calamity. It's just going to be what I'd call a normalization.\"\n\n4. \"Something bad could happen, we could have a recession. But my feeling is we'll have an old-fashioned, run-of-the-mill recession. We're not going to have some enormous meltdown crisis where the system is completely at risk, which is what happened in 2008.\"\n\n5. \"I can't say that there won't be breakage anywhere. There always could be breakage. What I would say definitively is that there will not be breakage in the US financial system, especially in the banks.\" (Eisman explained that regulators have sharply reduced banks' leverage and reined in their risktaking since the financial crisis.)\n\n6. \"When you're levered 40-to-one, to destroy the bank, you need a pebble. But when the bank is levered 10-to-one, you need a meteor. Now we could have worse credit in the United States, and the banks would earn less. But other than a couple of banks, not one bank in the United States will lose money.\"\n\nAdvertisement\n\n7. \"Oh my God. It's ridiculously hard. The whole world is telling you that you're an idiot, and then sometimes you think you're an idiot.\" (Eisman was underscoring the difficulty of holding a negative view on the mid-2000s housing market before it ultimately crashed.)\n\n8. \"I call this the Amazon disease. When Amazon came public, there was a lot of skepticism that this wouldn't work, and Amazon has basically conquered the world. So people are always looking for the next Amazon.\" (Eisman was discussing the immense hype around some growth stocks, and how some analysts and investors focus too much on the size of companies' total addressable market, and too little on whether their business models work.)\n\n9. \"It's very hard to short fiat currency because they all trade relative to one another. If you short the dollar, your problem is that in a basketball team where everybody is 5 feet 4 inches, the dollar is 5 feet 11 inches.\"\n\n10. \"Bitcoin is up a lot this year along with everything else speculative. You can't have a currency that moves 25% every six months. That's not a currency. That's a speculation. (Eisman said he doesn't understand what problem bitcoin solves, or why people other than speculators own it.)"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xMjA5MDUvZG9ybWFudC1iaXRjb2luLWFkZHJlc3MtbW92ZXMtNDAwLWJ0Yy1hZnRlci0xMS15ZWFyc9IBVGh0dHBzOi8vZGVjcnlwdC5jby8xMjA5MDUvZG9ybWFudC1iaXRjb2luLWFkZHJlc3MtbW92ZXMtNDAwLWJ0Yy1hZnRlci0xMS15ZWFycz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Satoshi-Era Bitcoin Address Moves $9.6 Million in BTC After 11 Years - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn ancient BTC address that has not transacted in over a decade came back to life on Wednesday—and the profits are something to behold.\n\nSince October 1 2012, address 1MMXRA held 412.12 BTC accumulated across four transactions, altogether worth just $8 at the time. No coins went in or out of that wallet until February 8, when all but a sliver was emptied from the wallet at $23,000 apiece.\n\nBy today’s prices, the moved coins represent $9.6 million in value–a 120,000,000% profit.\n\nAD\n\nAD\n\nWhile sizable Bitcoin trades occur daily, it's not often that coins that old see the light of day again. As on-chain analytics provider Glassnode notes, dormant coins become “increasingly unlikely to be spent” after a 155-day holding period, and are thus considered a less liquid portion of the supply.\n\nWhen old coins are being spent more frequently, it “may suggest a change in conviction to hold the asset”—often sparked by periods of market volatility. However, Glassnode’s newsletter from last month showed that the number of coins being held long-term is growing at a rate of 100,000 per month, despite short-term holders taking the opportunity to profit from the asset’s recent rally.\n\nIn March 2022, an even older wallet holding 489 Bitcoins dumped holdings dating back to October 2010, when Bitcoin’s price was just $0.19. That was many months before Bitcoin’s pseudonymous creator Satoshi Nakamoto had left the project. Satoshi is suspected of holding as much as 5% of Bitcoin’s entire supply due to mining in the network’s early days, but many don’t believe those coins will ever move again.\n\nBitcoin developer @LukeDashJr says that nobody technically knows whether Satoshi has ever touched those coins, or if he still interacts with them today. However, if he had to guess, the lack of any obvious movements likely means the creator is already dead.\n\n“If he isn't dead, why would he allow frauds to masquerade as him unchallenged (it would be trivial for him to prove them liars with a PGP or Bitcoin signature)?” he said to Decrypt via Twitter. “Would he really hoard his stash while development lacks funding?”\n\nAD\n\nAD\n\n“If not dead, at least he must have lost his keys,” he concluded."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vaHVuZ3J5aG9yc2VuZXdzLmNvbS9uZXdzLzIwMjMvZmViLzA4L2xhd3N1aXRzLWRvZy1jb21wYW55LWJpdGNvaW4tc2VydmVycy1jb2x1bWJpYS1mYWxsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Lawsuits dog company with Bitcoin servers in Columbia Falls - Hungry Horse News",
        "content": "A cryptocurrency company with a bitcoin mining center in Columbia Falls is facing multiple class-action lawsuits alleging that it defrauded millions of dollars from thousands of investors in a “massive Ponzi scheme.”\n\nClass-action lawsuits alleging racketeering and securities fraud violations have been filed in Delaware and Pennsylvania in federal courts against Philadelphia-based VBit Technologies. Plaintiffs in both cases are seeking to recover their investments, which often totaled tens or hundreds of thousands of dollars.\n\nThe company claimed to sell bitcoin mining computers and offer setup and maintenance services at various data centers, including in Columbia Falls. The Montana facility is the only such building that could be linked to the company through property records. The lawsuits allege VBit lied about the extent of their products and services. Instead of using customer money for computers and electricity costs as advertised, investors accuse the company of simply shuffling investor funds around to create the appearance of legitimate cryptocurrency returns.\n\nInvestors accuse founder and former CEO Don Vo of being a conman who posed as a high-tech guru.\n\nInvestor Stephen Ranieri of Las Vegas paid VBit $50,000 for its “Black Diamond” package and then $3,000 each month to maintain computers that company records filed with court documents claim were his wholly-owned property. In all, Ranieri estimated his investment at more than $80,000. The named plaintiffs, Michael Eichler and Morgan Huntley, each invested tens of thousands of dollars, with Huntley’s suit claiming he put more than $200,000 into the scheme in purported hardware and hosting fees.\n\nRanieri doesn’t expect to see the money again, though he is working with lawyers to recoup his investment.\n\n“It’d be nice,” Ranieri said in a phone interview. “But I’m not counting on it.”\n\nRanieri said he got suspicious when the company issued a press release claiming a merger with Advanced Mining, a supposed Chinese company. The existence of the purported buyer and new CEO Lillian Zhou could not be verified. Plaintiffs allege Advanced Mining is a “complete sham.”\n\nInvestors claim the merger was a misdirection concocted to dodge accountability and provide Vo with an exit strategy.\n\nLater communications from the company confirmed that VBit was simply doing business as Advanced Mining.\n\nAfter the announcement, Vo updated his LinkedIn profile to say “retired, for now,” and stopped responding to investor inquiries.\n\nRanieri got even more concerned when the company blocked customer withdrawals, a move he now says points to an “obvious pyramid scheme.”\n\nRanieri believes last year’s bitcoin crash toppled the pyramid.\n\n“I think this was always their plan, to be honest,” Ranieri said. “If the price didn’t come down, they could have sustained it for a while longer.”\n\nREAL ESTATE RECORDS show that VBit closed the deal on the Columbia Falls location in March 2021. Although neighbors say a vehicle has been seen visiting the data center regularly, it is unclear if the server farm is still in operation.\n\nThe company did not respond to requests about the Montana property, and their office phone number has been disconnected.\n\nCryptocurrency mining centers are notorious for using a tremendous amount of power, but Flathead Electric Cooperative declined to share electricity usage that could reveal continued operations, citing privacy concerns.\n\nThe previous owners described the facility as having a 3.8 megawatt capacity, meaning that it could consume as much electricity as would normally power 3,800 homes in the Flathead Valley.\n\nJin Gao, named as a defendant in the lawsuits as VBit’s vice chairman, could not confirm if the data center is still running. When asked via email, Gao denied currently working for the company.\n\nA February 2021 video obtained by the Inter Lake shows Gao with VBit founder Vo unpacking computers at the Montana facility. The video was circulated to investors, with VBit showing off its new property as evidence of a thriving crypto enterprise.\n\nThe video also shows Teakettle Mining founder Jeff Russell, who sold the Columbia Falls facility to VBit, setting up computers for Vo and Gao.\n\n“Say hi, Jeff,” says Gao, holding the camera.\n\n“Hi, Jeff!” Russell jokes as he types on a laptop.\n\nRussell opened the facility in 2018, the first such crypto mine in the Flathead. While operating the mine, Russell also worked as head of IT at Logan Health Whitefish, then known as North Valley Hospital.\n\nRussell said via email that he offered his tech skills to VBit following the sale, but they declined his services.\n\nA tweet from Russell’s Teakettle Mining Twitter account welcomes VBit to the facility in December 2020. Real estate records show Russell listed the property for sale in August of that year.\n\nRussell confirmed by email that VBit leased the building for three months prior to finalizing the sale.\n\nAn October 2021 video shared with the Inter Lake shows Vo making a speech at a Flathead Valley restaurant, and records show that the company organized a trip for affiliates to Columbia Falls to tour their new property.\n\nThe company claimed to organize a tour of their purported Canada facility, but then canceled the trip, citing “Covid restrictions.”\n\nMarketing materials also claimed mines in Kazakhstan and Colorado, but the company never provided any evidence to support the claims.\n\nVBIT EMPLOYED multi-level marketing techniques to drive sales, and aimed their services at immigrants and older, less tech-savvy customers. Vo claimed in interviews with industry outlets that he was trying to make crypto investment more accessible for marginalized communities.\n\n“It doesn’t matter where you’re from or how old you are,” Vo said in a YouTube video. “I have built a system so easy to use that anyone can use it to build their wealth. So, are you ready to transform your life?”\n\nA blog post on Advanced Mining’s website attempts to placate customers, saying that “Bitcoin mining is not a Ponzi scheme,” but then goes on to warn customers against shady crypto companies.\n\n“Absurd promises are likely to be scams seeking to prey on the naivety of some bitcoin enthusiasts,” the post reads. VBit sales videos promised bonuses for “affiliates” who referred other customers to the company, including in cash, designer clothes and watches, and luxury vacations.\n\nA YouTube video uploaded by VBit customer and affiliate Skip McCoy shows Vo and Gao presenting two matching BMW convertibles — each valued at $55,000 — to McCoy and Erlinda Truitt. Both had achieved sales goals of at least $3 million and risen to the level of “National Leader.”\n\nThe company goes on to defend their multi-level marketing model: “Network marketing or affiliate program is a tried and tested marketing strategy. Unfortunately, some entities have used it to nefarious ends.”\n\nIN JULY 2020, VBit entered into a consent order with the Washington State Department of Financial Institutions (DFI) banning them from selling unregistered securities in the state and ordering them to refund all Washington-based customers.\n\nAccording to Adam Yeaton, the DFI attorney who drafted the order, the company stopped selling in Washington but continued doing business elsewhere. Their investigation did not look into the underlying mining contracts themselves, because the regulator felt that the contracts as advertised constituted securities.\n\nIn a June 2022 email, VBit, representing itself as Advanced Mining, said that they were no longer able to operate in the United States because the U.S. Securities and Exchange Commission also deemed their products to be unregistered securities.\n\nMontana Securities and Insurance Commissioner Troy Downing said after reviewing the Washington consent order that he felt that VBit’s services would indeed constitute a securities contract. Downing said a review of their database found that VBit had not registered those contracts with the state.\n\nDowning would not confirm if there was any open investigation into the company, but urged Montana-based investors to contact the commission if they had concerns.\n\nRanieri set up a chat group for frustrated investors on the encrypted messaging service Telegram after the official VBit channel was shut down because of the slew of complaints and refund requests.\n\nIn the group, investors say they’ve filed complaints against the company with multiple law enforcement agencies, including the SECs in New Jersey, Pennsylvania and Delaware, as well as the Federal Trade Commission, the Commodities Futures Trading Commission and the FBI.\n\nA group member who wished to only be identified as “J” blasted Vo in the channel.\n\n“Still in utter disbelief over the exploitation of all the people involved, even his partners, employees and affiliates,” J wrote. “Some people value the bag over their integrity.”"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdWstZ292ZXJubWVudC1wdXJzdWVzLWRpZ2l0YWwtcG91bmQtd2hpbGUtYmFuay1jZW9zLXJlc3RyaWN0LWJpdGNvaW4tYWNjZXNz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "UK Government Pursues Digital Pound While Bank CEOs Restrict Bitcoin Access - Nasdaq",
        "content": "The UK continues to show its desire for a digital pound, just as its companies try to limit access to Bitcoin.\n\nThe Bank of England and the UK Treasury have released a consultation paper outlining their case for a retail central bank digital currency (CBDC) or “digital pound.” The paper has been reviewed by the Bank-Treasury CBDC Taskforce, which was established in April 2021.\n\n\n\nAlthough the bank is still considering whether to introduce the digital pound, it believes that the preparatory work is justified. If introduced, the digital pound would be a form of sterling that would be used by households and businesses for their daily payments. The Bank of England and the UK Treasury will engage with stakeholders across the country to seek their views on the proposed model, according to the announcement.\n\nSimultaneously, a roadmap unveiled by Governor Andrew Bailey and Chancellor Jeremy Hunt detailed their aim to prevent a run on banks.\n\n\n\nAccording to a Telegraph report, the two officials have said that consumers will be prevented from hoarding the new digital pounds issued by the Bank of England. To prevent large and rapid outflows from traditional banks, Britons will be limited to transferring a few thousand digital pounds into their accounts. The frictionless nature of digital money is seemingly seen as a potential risk to the stability of the traditional banking system. The previously mentioned consultation paper indicated that this limit could potentially be £10,000.\n\nJust as these developments are taking place, bank CEOs in the UK are blocking customers’ access to cryptocurrencies due to concerns over fraud and volatility, according to reports. Executives appeared before the Treasury Select Committee to discuss the issue.\n\n\n\nAlison Rose, CEO of NatWest Group, told the committee that the bank had taken a “pretty hard line” on cryptocurrency due to the stability and volatility of the platforms and the risk of fraud. Social media and technology platforms were cited as the primary source of fraud, but the executives also expressed their support for the new regulations proposed by the UK Treasury.\n\nAll of these events indicate the capacity for the government of the United Kingdom, with the help of major companies, to lock their citizens into financial obedience with strict regulation regarding the usage of each private citizens’ money. The UK continues to make further strides towards the confinement and restriction of the bitcoin and cryptocurrency industry, while pursuing a CBDC system that would realize the worst projections of that technology.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vd3d3LnlvdWhvZGxlci5jb20vYmxvZy9ncmVlbi1iaXRjb2luLW1pbmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Green Bitcoin Mining: Can Crypto Go Green? - YouHodler.com",
        "content": "The cryptocurrency industry has long been criticized for its huge energy consumption. While cryptocurrency has many uses, it also causes a large carbon footprint. This leaves many to believe if this technology is truly sustainable amidst theories of a global climate crisis. As a result, developers are helping cryptocurrencies like Ethereum and Bitcoin “go green” without compromising any benefits.\n\nWe’ve analyzed a few examples of this to tackle the question if green bitcoin mining and green crypto, in general, are possible.\n\nWhy the need for green bitcoin mining?\n\nBitcoin still uses the PoW system. In a way, PoW is beneficial to bitcoin - it creates rarity and increases the value of a block. Unfortunately, bitcoin is the biggest offender when it comes to energy consumption. In 2021, bitcoin was using enough energy to power the state of Georgia (130 TWh).\n\nMining cryptocurrency causes a huge amount of pollution. It’s drawing criticism from governments around the world who are already looking to impose new regulations in 2023.\n\nFor example:\n\nChina’s 2021 crypto ban wiped out $400 billion of bitcoin and,\n\nthe European Union also considering a ban due to its energy crisis, this is a major concern.\n\nPlus, the huge carbon footprint goes against many UN countries’ climate goals.\n\nMiners also struggle to keep the lights on with the huge energy requirements - especially when competing against large-scale mining g operations. Bitcoin-mining farms can afford to buy power even when demand is low.\n\nThese big operations create fierce competition. For example, the largest mining operation in Texas, Riot Blockchain, taps directly into the local grid for power. It has a ten-year contract with the town’s electricity facility.\n\nMost miners cannot reach that level unless they use renewable energy.\n\nSustainable crypto mining is one answer to long-term crypto viability.\n\nSustainable crypto mining keeps all benefits of the PoW system without wasteful energy consumption. Hence, going green will satisfy both bitcoin users and governments around the world. To do this, bitcoin miners are looking into renewable energy sources like:\n\nSolar,\n\nHydro,\n\nWindo,\n\nTidal\n\nGeothermal and,\n\nBiomass.\n\nMany of these options are in their early stages but at least give hope for the future. Meanwhile, some blockchains took a more proactive approach to their energy usage by changing their consensus mechanism altogether.\n\nHow Ethereum’s Merge introduced sustainable crypto mining\n\nEthereum’s “Merge” was a considerable upgrade, one that changed the entire crypto landscape. The upgrade changed Ethereum’s consensus mechanism - which is a system that validates the authenticity of new crypto. It also ensures the validity of all the crypto transactions on the blockchain.\n\n‍\n\nBefore the merge, Eth used the Nakamoto consensus mechanism, a PoW (proof-of-work) system. PoW uses miners to unearth new blocks of crypto by solving a mathematical problem. By solving it, miners unlock a 64- number called a hash. With the hash, they could add new blocks to the blockchain.\n\nSuggested reading: Proof-of-stake vs. Proof-of-work\n\nHowever, solving the hash required a huge set-up of hardware and software. With their many computers running all the time, miners had to use incredible amounts of electricity. In 2022, miners were consuming about 70 TWh per year. For reference, the average household uses about 10,000 kWh per year.\n\nIn 2022, Ethereum changed to Gasper, a PoS (proof-of-stake) model, instead. It switches out the power of computational mining power for a stake of ETH. In PoS, people who hold stakes are validators. Staking their ETH activates the generation of new blocks of crypto. The blockchain’s algorithm chooses validators at random to generate new ETH. Validators can enter the PoS system at a lower cost since they don’t need specialized equipment.\n\nThe new consensus mechanism cut Ethereum’s energy consumption by 99%. Almost all ETH users stayed for the change, and the price of ETH increased by 3%. Overall, Ethereum’s introduction to sustainable crypto mining was a huge success. It created a new wave of excitement for the concept of green mining on other cryptocurrencies.\n\nIs Bitcoin mining eco-friendly with nuclear energy?\n\nWith Bitcoin stuck with its PoW mechanism, the only solution to green Bitcoin mining is some form of alternative energy. Surprisingly, nuclear power is at the forefront of the discussion.\n\nBitcoin’s first nuclear-powered mine is starting operations this year in the US. It will have almost no carbon output. Smaller mines are taking notice, and they’re trying to make the switch.\n\nThere are several benefits to using nuclear energy to mine Bitcoin. Such as:\n\nNuclear power has the highest energy capacity of all power sources.\n\nIt is three times more reliable than wind or solar plants.\n\nIt’s twice as good as natural gas or coal.\n\nNuclear fission is 8,000 times more efficient than fossil fuels.\n\nThere are some misconceptions about nuclear power (e.g. dangerous). In reality, nuclear power releases less radiation than any other energy source. Of course, there’s always a danger of accidents. Still, studies show that the worst possible nuclear plant accident is less destructive than an industrial accident.\n\nFinally, nuclear power costs are competitive with other sources. All these points make nuclear energy compatible with bitcoin mining. It works as a long-term solution, and miners are already using it.\n\nWhich direction in the “Green bitcoin mining” movement the world chooses to go remains to be seen. What we can say is there are plenty of sustainable options to explore and energy usage is certainly not a reason to be bearish on bitcoin or any cryptocurrency for that matter.\n\nGreen Bitcoin Mining on YouHodler\n\nFor those looking for an environmentally friendly and affordable alternative to Bitcoin mining, YouHodler has a feature for you. Cloud Miner is a reward system offered by YouHodler where clients can earn real bitcoins by completing simple tasks that “mine” blocks.\n\nThe computational power in Cloud Miner is called “Sparks.” You need more sparks to mine more bitcoin on YouHodler. To get more sparks, simply complete tasks and level up through the eight available levels.\n\nDisclaimer: YouHodler does not use the device's CPU resources to operate Cloud Miner\n\nWatch the video below to learn more about Cloud Miner.\n\n‍"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2NyeXB0b2N1cnJlbmN5LW5ld3MvYml0Y29pbi1hbmQtYWx0Y29pbnMtcmVwb3J0LWZlYnJ1YXJ5LXdlZWstMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin and Altcoins Report - February Week 1 - Altcoin Buzz",
        "content": "It is incredible to see both the crypto and TradFi markets in green through the initial weeks of February. This scenario is after FED Chair Jerome Powell said the U.S. would increase the rates by 25 bps.\n\nThe disinflation could propel Bitcoin to $24,000, but let’s see what’s going on in the cryptocurrency market this week.\n\nBitcoin Is in Green, and Retailers Are Back!\n\nBitcoin had its most satisfactory month since October 2021 and its best January gains since 2013.\n\nOnly ten occasions of monthly Bitcoin bull rallies of 39% or more have occurred since 2014. Typically, these rallies continued to perform well over the following year.\n\nBut How Are Short-Term Holders Faring?\n\nWhen STH SOPR falls below 1.00, as shown by the green box, most short-term holders are selling their bitcoins at a loss. And as most short-term investors are in a state of intense panic and are quick to sell at a loss, this is a period of accumulation.\n\nThe green box has historically signaled price bottoms for Bitcoin. Spikes over 1.00 indicate that UTXOs spent on the network accounting for their lifespan of between 1 hour and 155 days are being spent profitably during the price upsurge.\n\nRetailers are again active in the market, reaping profits from the recent increase in Bitcoin’s price. And the likelihood of a near-term price peak starts to rise as soon as retail begins to feel euphoria.\n\nHigh on Hopium?\n\nSmall BTC address growth was severely constrained in 2022 and plunged to new lows after the FTX debacle, but a sizable upsurge in January implies trading confidence is back.\n\nA market FOMO (fear of missing out) was sparked, particularly among small BTC investors, as the price of Bitcoin surged beyond $20,000 in the second week of January.\n\nAfter January 13, there was significant growth in BTC addresses holding 0.1 BTC or less. Data from Santiment shows that 620,000 new BTC addresses have appeared following the January 13 BTC price surge, totaling 39.8 million.\n\nSmall Bitcoin addresses have increased recently at their most remarkable rate since November 2022, when BTC fell to its cycle low of about $16,000.\n\nThe uptick of Bitcoin addresses holding modest sums suggests rising investor optimism in 2023.\n\nNow that, in addition to Bitcoin, several altcoins have also hit multi-month highs, and the whole cryptocurrency market has risen by over 30%, sentiment in the market is becoming increasingly bullish.\n\nThe first week of February saw Bitcoin maintain its upward trend, hitting a five-month high of over $24,000. The price is still hovering near $22,800 at the time of writing, as the $24,000 barrier proved too much to maintain.\n\nSome market analysts predict that February may not be as positive as January.\n\nThey have cautioned that the recovery in cryptocurrency and equities this year may turn negative this month due to uncertainty about how upcoming macroeconomic data from the United States may affect market sentiment. We could attribute the impending downward trend to the extent of the Federal Reserve’s interest rate hikes.\n\nNew Paradigm Around the Corner?\n\nIn the first few weeks of 2023, Bitcoin has risen by approximately 43%, reflecting its tremendous momentum.\n\nThe spot price has risen above both moving averages in January, which hints that things are going well. Additionally, BTC is generating a golden cross setup as the 50-day moving average surpasses the 200-day moving average.\n\nBesides, BTC rose above the realized price (grey) indicator. The realized price is significant since it shows the average cost of all Bitcoin trades.\n\nAt the same time, the realized price shows that regular Bitcoin investors are turning a profit on their purchases.\n\nFrom June through December 2022, the market has dragged the spot price below the realized price. The spot was oversold for six months if we neglected local rises over the realized price.\n\nIn conclusion, Bitcoin is presently poised to enter a new paradigm as it crosses many vital markers. The technical golden cross will support the spot price of Bitcoin, and the realized price has transformed into a support area. Moreover, Bitcoin trades above the multi-year confluence zone (white) and advances further into the pre-halving accumulation cycle (turquoise).\n\nStablecoins and Fund Flow Ratio\n\nStablecoins are the market’s liquidity. But how does their change affect the market?\n\nWhen the number of stablecoins skyrocketed after Covid-19 in 2020, it sparked a bull market in crypto. However, in February 2022, when the stablecoin supply started to decline, a bear market emerged.\n\nAlthough Bitcoin prices have soared dramatically due to the recent short-term surge in stablecoin circulation, a dead cross might happen again. The crypto space will most likely experience a bear market again if the number of stablecoins in circulation remains static.\n\nWhat About the Fund Flow Ratio?\n\nCurrently, the “Fund Flow Ratio (MA24)” has almost achieved the bull market top of 2021, suggesting that investors are actively using the exchange for trading or accumulating.\n\nOn the other hand, the “tokens transferred” metric is at an all-time low and shows a low level of BTC movement. It is because only a small number of forces are active in the low liquidity market. Institutional investors who favor over-the-counter trading are significantly less interested in the market.\n\nWhat Are Whales Doing Now?\n\nFollowing the recent rise in the price of Bitcoin over the last two weeks, exchange Bitcoin whale activity has almost fallen to a year-low. However, it has increased over the previous two weeks, adding to the selling pressure on the markets. Additionally, on-chain data revealed some of the highest CDD statistics for 2023 before the FOMC meeting.\n\nThe 3-6 month age cohort’s cost base is around 20.4K. This level will function as a support when there is a selling scenario. On the plus side, the cost base for the next cohort (six to twelve months) is around $32,000.\n\nThe Total Transaction Count of BTC has increased significantly recently, almost matching the bull market of 2021. But given that active addresses rarely changed, it is clear that a tiny number of whales had a significant effect on the cryptocurrency market.\n\nThe fact that the most recent increase was the longest and biggest during this down market is notable. However, whales often behave unexpectedly, so it may be some time before we learn their plans. We still need to exercise caution at this stage since an economic slump is still possible.\n\nShort Squeezes\n\nThe new year has begun with a remarkable reversal of the downward trend during January after a protracted, grueling, and unpleasant 2022. Such rallies are often fueled, as is the case with the current surge, to some extent by short squeezes in the derivatives markets.\n\nOver $495 million in short futures contracts had already been settled in three waves, noticeably with decreasing magnitude as the rally ended.\n\nAs can be seen, the first short squeeze in mid-January caught many traders off guard and resulted in a record-low long liquidation domination of 15% (i.e., shorts accounted for 85% of liquidations). It demonstrates how many traders were offside and is even more significant than the longs liquidated during the FTX collapse (75% long domination).\n\nThe cash and carry basis has returned to positive territory across both perpetual swap and calendar futures, returning 7.3% and 3.3% annually, respectively. It follows a significant amount of backwardation in all futures markets in November and December, and it signals a recovery of an optimistic sentiment, potentially mixed with some speculations.\n\nFriday Anomaly Back?\n\nAmid this year’s boom, Bitcoin has returned to one of its old routines: posting significant weekend movements. This phenomenon has grown to be a fascinating aspect of the cryptocurrency market.\n\nContrary to most other assets, which typically trade Monday through Friday on regulated exchanges, BTC and the rest of the cryptocurrencies are tradable continuously every day of the week. And it has been seen in cryptocurrency markets before, with Bitcoin flying up — or plunging low — when other assets are at rest.\n\nUntil recently, Fridays were a drag on performance as the Friday anomaly peaked around when Bitcoin reached its all-time high about a year ago. The Friday oddity is returning after Bitcoin’s recent surge.\n\nThe phenomenon is related to a mix of fund inflows and money migrating onto retail exchanges before the weekend shutdown of the fiat banking system. Both explanations point that the Friday phenomenon positively correlates with the Bitcoin price.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYnVpbHRpbi5jb20vYmxvY2tjaGFpbi9jcmVhdGUteW91ci1vd24tYmxvY2tjaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Create Your Own Blockchain From Scratch - Built In",
        "content": "What is blockchain? Is it hard to build one? Where do you start? Which programming language should I use?\n\nI get these questions quite often when meeting people who are interested in blockchain technology. You may also be one of those people, but don’t worry, I was, too.\n\n4 Steps to Creating a Blockchain Create a block. Add the data (header and body) to the block. Hash the block. Chain the blocks together.\n\nThere are plenty of blockchain resources online, but it can be overwhelming and frustrating to understand as a beginner to this booming technology. However, this article is a little different than those other resources.\n\nI’ll approach the subject in baby steps with you, and guide you through the basic concepts of blockchain and how to program one using Golang (Go).\n\nFor speed, endurance, and security, most blockchain core engines are built in C/C++ (Bitcoin, EOS, etc.…), Go (Hyperledger Fabric, Ethereum), Java (Ethereum), Rust, Haskell (Cardano) and/or Ruby (Ethereum), then provide bindings to other easy-to-use programming languages.\n\nAlso, some blockchain engines combine many programming languages for robustness and ease-of-use for developers. Ethereum is the best example of this.\n\nWhat Prerequisites Do I Need to Create a Blockchain?\n\nA network.\n\nCryptography.\n\nA data structure and algorithms.\n\nDecentralized systems.\n\nJavascript, Go or Python knowledge.\n\nYou only need to understand the basic concepts to program your first blockchain prototype, so let’s begin with some theories.\n\nMore on Blockchain: Sushiswap vs. Uniswap: What Are the Differences?\n\nWhat Is a Blockchain?\n\nYou can’t program something you don’t understand, right? Let’s break it down. Blockchain is not Bitcoin. Blockchain is not a digital currency, Blockchain is a set of different technologies that had already existed before its creation.\n\nSo, is this a blockchain?\n\nNo, but bear with me.\n\nLet’s simplify things with an example and some figures.\n\nLet’s take a MySQL database that stores some information in different tables.\n\nAn illustration of a MySQL database. | Image: Sinai Nday\n\nWith the above database, there are some limitations. It allows you to do some tasks, including:\n\nCreate, retrieve, update and delete (CRUD) operations. Storing the same information twice.\n\nBut its limitations are many, including:\n\nWe can drop the entire database either mistakenly or intentionally. We can’t share sensitive information with others. It’s centralized, which means there’s a single point of failure and a security issue. There’s no way to trust everything that is stored in it. Ill-intentioned people can comprise the database. The database needs a manager. The users don’t have power over their own data\n\nWe need something different that’s transparent, reliable and independent from people. Something that’s automatic, immutable, decentralized and indestructible. That’s where blockchain kicks in.\n\nA blockchain is a secure, trusted decentralized database and network all in one.\n\nHow Does Blockchain Work?\n\nIn other words, a blockchain is a chain of blocks. These blocks are like tables in the database, but they can’t be deleted or updated. The blocks contain information such as transactions, nonce, target bit, difficulty, timestamp, previous block hash, current block hash, Markle tree and block ID, etc, and the blocks are cryptographically verified and chained up to form an immutable chain called a blockchain or a ledger.\n\nAn illustration of a blockchain. | Image: Sinai Nday\n\nThe same chain is then distributed to all the nodes (computers or miners) across the network via a P2P network.\n\nIllustration of a blockchain P2P network. | Image: Sinai Nday\n\nSo, instead of a centralized database, all the transactions (data) that are shared across the nodes are contained in blocks, which are chained together to create the ledger. This ledger represents all the data in the blockchain. All the data in the ledger is secured by cryptographic hashing and digital signature and validated by a consensus algorithm. Nodes on the network participate to ensure that all copies of the data distributed across the network are the same.\n\n5 Key Concepts in the Blockchain Ecosystem Cryptographic hash and digital signature. Immutable ledger. P2P network. Consensus algorithm ( PoW, PoS, PBFT, ETc…). Block validation ( Mining, Forging, etc…).\n\nI will explain these concepts more in detail as we go.\n\nWhat Are the Benefits of Using Blockchain?\n\nThere are a number of benefits to using blockchain, including:\n\nRemoving intermediary organizations. An immutable ledger Transparency Security Reliability\n\nWhen Should You Use Blockchain?\n\nBlockchain is not a silver bullet, so, it’s best to use it when:\n\nThe data stored cannot be modified (proof of existence ). The data cannot be denied by its owner (non-repudiation). You want decentralization. You want one source of truth. You want high security. You don’t care about speed. For example, Bitcoin takes 10 minutes on average to validate a block of transactions. But some blockchains are faster because they use different consensus algorithms other than PoW. We will talk about this later.\n\nBlockchain Use Cases\n\nBlockchain goes beyond cryptocurrency and bitcoin. It can be used in different sectors, including:\n\nReal estate : Land ownership.\n\nHealthcare : Securely record the patient’s data.\n\nFinance : Reduce the taxes and intermediaries, anti-money laundering and cross border payment.\n\nSupply chain : Track items from the vendors to the customers, including verifying authenticity and original content creation.\n\nCybersecurity : DDOS attacks.\n\nGiving the power back to the user: Own your data and share it securely with whom you want (DID).\n\nCryptocurrency .\n\nVoting mechanism .\n\nBlockchain Platforms and Applications to Know\n\nBitcoin\n\nEthereum\n\nHyperledger Fabric\n\nEOS\n\nChainlink\n\nCardano\n\nDogecoin (meme coin)\n\nMore on Blockchain: 22 Crypto Apps to Know\n\nBlockchain Types\n\nThere are three types of blockchain:\n\nPrivate: Use only internally, and when we know the users (eg. Hyperledger Fabric).\n\nPublic: Everyone can see what is going on (Bitcoin, Ethereum).\n\nHybrid: In case you want to combine the first two.\n\nCreate Your Own Blockchain\n\nThere are two ways to build a blockchain\n\nThe easiest way is to use a pre-built blockchain open-source like Ethereum (create distributed applications, altcoins , decentralized finance (DeFi) and non-fungible tokens (NFTs) , etc.), Fabric (configure a private blockchain), EOS or Cardano, etc. so that you don’t have to deal with the core engine, which is difficult to implement. If that doesn’t fit your requirements, then you can build one from scratch or fork, modify and/or improve an existing blockchain open-source code. For example, Litecoin and Bitcoin cash were forked from Bitcoin. This last method is tougher, more time-consuming and requires a lot of work and a strong team.\n\nIn this article, we will build a blockchain prototype from scratch so that you can thoroughly understand the blockchain’s state machine.\n\nMore on Blockchain: What Is Layer 1 in Blockchain?\n\nHow to Create a Blockchain From Scratch in Go\n\nWe’re going to create the first baby blockchain in Go. You can also learn how to create it in Python, and JavaScript. These prototypes can help you understand the concepts we described earlier. We’ll complete this in four steps:\n\nCreate a block. Add the data (header and body) to the block. Hash the block. Chain the blocks together.\n\nA block contains information mentioned earlier, but to simplify things We are going to remove some. Let’s delve into the specifics.\n\nIf you aren’t familiar with Go, try to familiarize yourself with the basics, including functions, methods, data types, structures, flow controls and iterations, etc.\n\nAn error occurred. Unable to execute JavaScript. Try watching this video on www.youtube.com , or enable JavaScript if it is disabled in your browser.\n\nA tutorial on how to build a blockchain in Golang. | Video: Tensor Programming\n\n1. Create a Block\n\nWe’ll start with creating a folder with two files in it, main.go and block.go\n\nFolder structure\n\ngo // the folder main.go // file 1 block.go // file 2\n\nMain.go\n\n// use the main package package main //import the fmt package import ( \"fmt\" ) func main(){ fmt.Println(\"I am building my first blockchain\") // print this CreateBlock(\"The hearder will be shown here\", \"the body will be shown here\") // call the function that will create the block and pass some parameters in it. }\n\nIf you run this program it will show an error because the CreateBlock function is not defined yet, so go ahead and create it in block.go .\n\npackage main import ( \"fmt\" // this will help us to print on the screen ) func CreateBlock(Header, Body string){ fmt.Println(Header ,\"\n\n\", Body) // Show me the block content }\n\n2. Add Data to Your Blocks.\n\nThe beauty of Go is that you don’t have to import or export functions, just declare them with capital letters, and Go will find them for you. Now, open a terminal and move to your created folder, and run go build , then run .\\go on Windows, or ./go on Linux and Macbook.\n\nScreenshot of the Go program that calls a function and passes a string of data. | Screenshot: Sinai Nday\n\nWe just created a simple Go program that calls a function and passes some string data. Let’s add two more files, blockchain.go and structures.go . Now we have four files: main.go , block.go , structures.go , and blockchain.go\n\n3. Hash Your Block\n\nI will add to each line of code some comments in order for you to understand what I am doing.\n\nStructures.go\n\npackage main //Import the main package // Create the Block data structure // A block contains this info: type Block struct { Timestamp int64 // the time when the block was created PreviousBlockHash []byte // the hash of the previous block MyBlockHash []byte // the hash of the current block AllData []byte // the data or transactions (body info) } // Prepare the Blockchain data structure : type Blockchain struct { Blocks []*Block // remember a blockchain is a series of blocks }\n\nBlock.go\n\npackage main import ( // We will need these libraries: \"bytes\" // need to convert data into byte in order to be sent on the network, computer understands better the byte(8bits)language \"crypto/sha256\" //crypto library to hash the data \"strconv\" // for conversion \"time\" // the time for our timestamp ) // Now let's create a method for generating a hash of the block // We will just concatenate all the data and hash it to obtain the block hash func (block *Block) SetHash() { timestamp := []byte(strconv.FormatInt(block.Timestamp, 10)) // get the time and convert it into a unique series of digits headers := bytes.Join([][]byte{timestamp, block.PreviousBlockHash, block.AllData}, []byte{}) // concatenate all the block data hash := sha256.Sum256(headers) // hash the whole thing block.MyBlockHash = hash[:] // now set the hash of the block } // Create a function for new block generation and return that block func NewBlock(data string, prevBlockHash []byte) *Block { block := &Block{time.Now().Unix(), prevBlockHash, []byte{}, []byte(data)} // the block is received block.SetHash() // the block is hashed return block // the block is returned with all the information in it } /* let's now create the genesis block function that will return the first block. The genesis block is the first block on the chain */ func NewGenesisBlock() *Block { return NewBlock(\"Genesis Block\", []byte{}) // the genesis block is made with some data in it }\n\nBlockchain.go\n\npackage main // create the method that adds a new block to a blockchain func (blockchain *Blockchain) AddBlock(data string) { PreviousBlock := blockchain.Blocks[len(blockchain.Blocks)-1] // the previous block is needed, so let's get it newBlock := NewBlock(data, PreviousBlock.MyBlockHash) // create a new block containing the data and the hash of the previous block blockchain.Blocks = append(blockchain.Blocks, newBlock) // add that block to the chain to create a chain of blocks } /* Create the function that returns the whole blockchain and add the genesis to it first. the genesis block is the first ever mined block, so let's create a function that will return it since it does not exist yet */ func NewBlockchain() *Blockchain { // the function is created return &Blockchain{[]*Block{NewGenesisBlock()}} // the genesis block is added first to the chain }\n\nMain.go\n\n//Time to put everything together and test package main import ( \"fmt\" // just for printing something on the screen ) func main() { newblockchain := NewBlockchain() // Initialize the blockchain // create 2 blocks and add 2 transactions newblockchain.AddBlock(\"first transaction\") // first block containing one tx newblockchain.AddBlock(\"Second transaction\") // second block containing one tx // Now print all the blocks and their contents for _, block := range newblockchain.Blocks { // iterate on each block fmt.Printf(\"Hash of the block %x\n\n\", block.MyBlockHash) // print the hash of the block fmt.Printf(\"Hash of the previous Block: %x\n\n\", block.PreviousBlockHash) // print the hash of the previous block fmt.Printf(\"All the transactions: %s\n\n\", block.AllData) // print the transactions } // our blockchain will be printed }\n\nLet’s run it now, go build then .\\go .\n\nResult. | Screenshot: Sinai Nday\n\nVoila. Easy, right?\n\n4. Chain Your Blocks Together\n\nOops, our blocks in the blockchain don’t have any IDs and timestamps. So, let’s add that information by modifying the main.go file, add these two lines in the for loop :\n\nfmt.Printf(\"Block ID : %d\n\n\", i) fmt.Printf(\"Timestamp : %d\n\n\", block.Timestamp+int64(i))\n\n//Time to put everything together and test package main import ( \"fmt\" // just for printing something on the screen ) func main() { newblockchain := NewBlockchain() // Initialize the blockchain // create 2 blocks and add 2 transactions newblockchain.AddBlock(\"first transaction\") // first block containing one tx newblockchain.AddBlock(\"Second transaction\") // second block containing one tx // Now print all the blocks and their contents for i, block := range newblockchain.Blocks { // iterate on each block fmt.Printf(\"Block ID : %d\n\n\", i) // print the block ID fmt.Printf(\"Timestamp : %d\n\n\", block.Timestamp+int64(i)) // print the timestamp of the block, to make them different, we just add a value i fmt.Printf(\"Hash of the block : %x\n\n\", block.MyBlockHash) // print the hash of the block fmt.Printf(\"Hash of the previous Block : %x\n\n\", block.PreviousBlockHash) // print the hash of the previous block fmt.Printf(\"All the transactions : %s\n\n\", block.AllData) // print the transactions } // our blockchain will be printed }\n\nLet’s save the code and run it again, go build then ./go .\n\nFinal result of your blockchain. | Image: Sinai Nday\n\nAs you can see, the blockchain is well structured. Except for the genesis block, each block contains its hash and the hash of the previous block, which makes it immutable. If the data in the block is altered, the hash will automatically change and the block will be discarded. The genesis block doesn’t have any previous hash because it’s the first one. There is no previous block.\n\nAnd that’s it. Congratulations, you’ve just created your first baby blockchain in Go.\n\nWe will gradually fulfill the blockchain requirements. Blockchain is a masterpiece that needs to be engineered the way it’s supposed to be.\n\nIn blockchain, there are also two common roles. A blockchain engineer and a blockchain developer. A blockchain engineer is a professional who thoroughly understands the principles of blockchain, security, and software engineering for designing, developing, maintaining, testing and evaluating the blockchain core engines and software. A blockchain developer is a professional who builds software on top of the blockchain called decentralized applications.\n\nMost blockchain developers use open blockchain platforms and frameworks like Ethereum, hyperledger fabric, EOS, etc. Now that you have the basics, it’s up to you to decide which one you want to be."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZm9jdXNvbmJ1c2luZXNzLmV1L2VuL25ld3MvYml0Y29pbi1zLXNoYXJwZS1yYXRpby1kcm9wcy10by0wLTg2LW1vdmVzLWJlbG93LXMtcC01MDAtcy81MjAz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 15:51:27 GMT",
        "title": "Bitcoin’s Sharpe Ratio Drops To -0.86, Moves Below S&P 500’S | News - FOCUS ON Business",
        "content": "According to Edith Reads, an investment lead at the site, the current ratio doesn’t give any helpful information about BTC’s returns. “The Sharpe Ratio is a measure of risk-adjusted returns, and the higher it is, the better the asset’s risk-adjusted performance. A negative ratio could either mean the risk-free rate of return is higher than the asset’s, or we can expect a negative return on the asset. Either way, there’s not much information to go by.”\n\nMs. Reads further added that although the S&P 500’s ratio had declined, it is currently higher than BTC’s at -0.67. In January 2021, S&P 500’s Sharpe was 2, considered very good.\n\nWhat Does The Sharpe Ratio Mean?\n\nThe Sharpe Ratio was invented in 1966 by William Sharpe and has become a popular tool among finance professionals. The ratio simplifies the risk vs. reward relationship and shows whether an asset is making profits through leverage.\n\nA higher Sharpe shows better performance on a risk-adjusted basis. Zero indicates the asset is risk-free, while a negative value doesn’t convey any useful meaning about the assets’ rewards relative to risk.\n\nThe decline in BTC’s Sharpe can be attributed to the highly volatile markets over the past few months. Crypto winter has hit hard, with companies and projects failing daily. The markets have become highly volatile, which could explain the negative Sharpe Ratio.\n\nWe could expect a correction, as the markets seem to be recovering over the past few weeks. BTC’s price has been rallying, and the asset is currently trading at $22.9k, which is $1000 up from November’s $21K. We can, therefore, anticipate a higher Sharpe as analysts speculate whether the rally is the beginning of the much-awaited crypto bull run.\n\nSharpe Ratio Doesn’t Apply To Bitcoin\n\nIn 2020, former options trader and risk analyst Nassim Taleb commented that the ratio doesn’t work for BTC. The tweet responded to a publication by Plan B, highlighting that Bitcoin was the only asset whose Sharpe was higher than 1.\n\nAlthough he didn’t explain further, there’s some truth to what he said. For starters, the ratio works on the assumption that returns are normally distributed, which isn’t the case. Certain crucial events lie outside the normal distribution and even more so for BTC. Mass adoption, exchange hacking, FOMO, and bitcoin regulations are some of the most probable events leading to off-the-chart movements.\n\nThe Sharpe Ratio doesn’t account for any of these events, making it almost impossible to give meaning to the ratio.\n\nEdith Reads"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V2b2x1dGlvbi1vZi1iaXRjb2lucy12YWx1ZS1vdmVyLXRpbWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Evolution of Bitcoin's Value Over Time - Analytics Insight",
        "content": "In the crypto industry, the evolution of Bitcoin is fascinating evidencing it to be one of the best currencies to invest in\n\nBitcoin is regarded as a forerunner of the cryptocurrency space since it is the most traded currency amongst other currencies. The coin found in the year 2009, remains to be one of the most popular cryptocurrencies even now. With this popularity, the coin has become an alternative to fiat currencies like U.S. Dollars which are regulated by central banks. There have been various collapses and rallies in the evolution of Bitcoin. Let us learn how Bitcoin’s value over time is fluctuating.\n\nBitcoin Price from US$0- US$200\n\nThe value of Bitcoin price initially worth $0 in 2009, started its upsurge in 2010 to US$0.9. From then a Bitcoin rally started, reaching US$29.60 in 2011. In the midst of this, there was a global economic crisis, which had an impact on the price of crypto bitcoin. Due to this, Bitcoin had a rough 2012. However, after emerging from the global financial crisis, Bitcoin started trading at US$13.28 and quickly rose to US$68.50. In 2013, Bitcoin valued at US$123 witnessed a bullish trend as its value started climbing gradually from hundreds to thousands.\n\nBitcoin Price from US$1000 US$20,000\n\nOn December 2013, the Bitcoin price after being spiked to US$1,2375 declined to US$687.02 in just three days span. The value of Bitcoin underwent considerable oscillations in 2014 and starting in the year 2015 it settled at US$315.21. After this Bitcoin made a resurgence in value at US$19,345.49 in December 2015, forcing investors to grab this coin to enhance their crypto portfolios. In 2016, the value of Bitcoin was that considerate as it made a huge fall and reached the value of US$900. However, the coin swung from US$1000 to US$2000. The value of Bitcoin in 2018 and 2019 also was not that considerate. However, in 2020 a pandemic year that slowed down each sector also affected the crypto sector for this reason the coin value remained low. Gradually by the end of the year 2020, Bitcoin traded at US$19,157.\n\nBitcoin Price from US$20,000 to US$70,000\n\nThe coin within a few days in 2021 surpassed the 2020 record and settled at US$40,000. From a value of US$20,000 to reaching US$40,000 was a huge success of Bitcoin. While affected by various factors the coin again experienced a downfall of 50% in the middle of 2021 reaching US29,796. Again, at the end of the year 2021, Bitcoin reached the top at US$68,789 more than ever before, just after fifteen days the coin ended with a downfall settling for US$46,164.\n\nLater on, the prices started fluctuating throughout the year 2022, and miserably it ended at US$20,000. Today on February 8th, 2023 the value of Bitcoin is trading at US$22,988 indicating a promising future ahead.\n\nFactors affecting the Value of Bitcoin\n\nBitcoin value fluctuations that have been perceived over time are mostly affected due to the crypto market trend. When a particular cryptocurrency coin is broadly discussed in the media, its demand increases dramatically. The increasing demand for the coin inevitably leads to an increase in the coin’s price when there is a shortage of coins. Along with this, the crypto coins get affected by external factors like rising interest on value gains in crypto.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yZWdhaW5zLTIzMDAwLXBvbHlnb24tc29sYW5hLXBvbGthZG90LWdhaW4tdXAtdG8tNS0zNjk0MzgtMjAyMy0wMi0wONIBjQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tcmVnYWlucy0yMzAwMC1wb2x5Z29uLXNvbGFuYS1wb2xrYWRvdC1nYWluLXVwLXRvLTUtMzY5NDM4LTIwMjMtMDItMDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin regains, $23,000; Polygon, Solana & Polkadot gain up to 5% - Business Today",
        "content": "Crypto market was trading sharply higher on Wednesday, after a mediocre start for the week. Dovish comments from Jerome Powell, the chairman of US Federal Reserve, boosted the morale of investors. Powell suggested that the Fed was winning its fight to tame inflation.\n\nBitcoin regained $23,000-mark for the early Asian hours after a rising about 3 per cent. However, its largest peer, Ethereum, was also firm marching towards $1,700-level, jumping over 3 per cent. The Graph, Sandbox and Chiliz rose 30-45 per cent for the day.\n\nBitcoin is above $23,200 due to Jerome Powell's comments on declining inflation and positive investor sentiment from a deal between Digital Currency Group and Genesis. The deal includes selling Genesis' bankrupt entities and refinancing loans, said Edul Patel, Co-founder and CEO at Mudrex.\n\n\"Bitcoin's immediate support lies at the $23,000 level, while the resistance lies at the $23,400 level. Meanwhile, Ethereum has remained stable above $1,600 and is showing signs of growth. If this continues, ETH may reach $1,700 soon,\" he said.\n\nAll the top crypto tokens were trading with strong gains on Wednesday. Polkadot jumped more than 5 per cent, whereas Polygon, Avalanche, Solana and Tron were trading 4 per cent up each. Litecoin and Cardano jumped 3 per cent each in the early trade.\n\nThe global cryptocurrency market cap was trading higher at $1.09 trillion mark, rising more than 2 per cent in the last 24 hours. However, the total trading volumes rose about 24 per cent close to $61.69 billion.\n\nCrypto updates\n\nCoinDCX, a crypto platform, has appointed Sridhar Govardhan as the Chief Information Security Officer to further strengthen its cyber security capabilities. Sridhar brings with him over two decades of rich experience and was most recently the VP and Head of Information Security at Flipkart.\n\nThere will be 'zero representation' of crypto companies in the advertising lineup for this year's Super Bowl championship game on Sunday, according to broadcaster Fox Sports.\n\nAn Ethereum test network (testnet) successfully simulated withdrawals of staked ether for the first time, bringing the second-biggest blockchain yet another step closer to its historic transition to a fully featured proof-of-stake network.\n\nUK citizens could be limited to holding 10,000 British pounds each in a new digital pound, as the Bank of England seeks to avoid a new central bank digital currency undermining the banking system.\n\nTech View By Giottus Crypto Platform\n\nBinance Coin (BNB) is currently trading around the $330-340 range, up by about 35 per cent year-to-date. Like all major crypto assets, BNB began this year with a promising uptrend, going up by almost 30% in a matter of 10 days. Since then, it's trading right around the golden pocket of its November fall, supported by an ascending support line.\n\nShould this resistance be reclaimed, it would suggest a bullish momentum for BNB. BNB would then be poised to test the next resistance at $360. BNB’s 50 and 200-day moving averages - at $281 and $285, respectively - indicate that it might be overbought. We could see them being tested in the coming days.\n\nMajor levels\n\nResistance: $360, $398\n\nSupport: $288, $262, $250\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: Stocks in news: Adani Green, Bharti Airtel, Hero MotoCorp, Ambuja Cements and more\n\nAlso read: Paytm share price: Macquarie double upgrades stock, ups target to Rs 800 from Rs 450 earlier"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vbXVnZ2xlaGVhZC5jb20vaHV0LTgtbWluaW5nLW1lcmdlcy13aXRoLXUtcy1iYXNlZC1kYXRhLWFuZC1iaXRjb2luLW1pbmluZy1ncm91cC_SAV5odHRwczovL211Z2dsZWhlYWQuY29tL2h1dC04LW1pbmluZy1tZXJnZXMtd2l0aC11LXMtYmFzZWQtZGF0YS1hbmQtYml0Y29pbi1taW5pbmctZ3JvdXAvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Hut 8 Mining proposes merger with U.S.-based data and Bitcoin mining group - Mugglehead",
        "content": "Hut 8 Mining (NASDAQ: HUT) (TSX: HUT) inked an all-stock merger deal with a Miami-based data mining analytics company to create crypto mining giant.\n\nThe merger is with Miami, Florida based data mining analytics company US Bitcoin Corp (USBTC). The company said Tuesday it will now be called Hut 8 Corp and will act as a large-scale publicly traded Bitcoin miner focused on economical mining, with diversified revenue streams, including high performance computing and colocation services. The new company will have access to 825 megawatts of gross energy across all six sites. It will also include self-hosting, hosting and managed infrastructure operations.\n\n\n\n“Our established track record of creating shareholder value through organic growth and strategic acquisitions while maintaining a balance sheet-first approach has positioned us perfectly to advance our growth trajectory through this business combination,” said Hut 8 CEO, Jaime Leverton.\n\nMore specifically, the combined company will have 5.6 exahash per second (EH/s) of installed self-mining capacity and 244 megawatts of total energy available over five sites. These are Medicine Hat, Alberta; Drumheller, Alberta; Niagara Falls, New York; and Granbury and King Mountain, Texas.\n\nThe King Mountain site is a joint venture wherein USBTC owns 50 per cent.\n\nAt present USBT is embroiled in a legal dispute with the City of Niagara Falls, New York, over site operations. The team has a contingency plan in place should a resolution not be met. At present there’s no disruption to operations.\n\nThe King Mountain site leverages a mix of sources, including wind and nuclear, in support of multiple clients. This includes some of the industry’s biggest miners. The King Mountain JV owns the hosting function.\n\nRead more: Filecoin Foundation and Lockheed Martin partner on an interplanetary file system\n\nRead more: Akerna merges with Gryphon Digital Mining and implements Bitcoin mining\n\nKing Mountain joint venture uses renewable energy sources\n\n“Bringing together Hut 8’s operational track record and diversified revenue streams with US Bitcoin’s scalable mining sites, sizeable hosting business, and industry-leading managed infrastructure operations not only accelerates our diversified strategy and positions us for near-term growth, but also establishes us as a strong, U.S.-based player that is ready and able to seize additional opportunities as they arise,” said Leverton.\n\nFurther, the combined company inherits 680 megawatts of infrastructure operations powered by energy from a mix of renewable and zero-emissions sources in Kearney, New Brunswick, and Granbury and King Mountain, Texas.\n\nSome of the operational advantages of the merger include a stronger financial position and more flexibility for growth and investment.\n\n“Together, we will become an exceptional self-mining operator, hosting provider, strategic operator of managed infrastructure, purveyor of high performance computing infrastructure, and industry-leading ASIC repair and sales hub, underpinned by world-class operating technology and IP to drive growth,” said Asher Genoot, co-founder and president of USBTC.\n\nThe merger pushes the company’s diversification strategy, allowing for monthly recurring fiat hosting revenues from long-term clients. This means reaching out to Bitcoin mining sites looking to maximize their mining capabilities through managed infrastructure operations.\n\n🔔🔔🔔News: Hut 8 and US Bitcoin Corp have announced a merger of equals, expecting to establish a new Hut 8 as a large-scale publicly traded North American Bitcoin miner with diversified fiat revenue streams. 📰Read more: https://t.co/TL0ZHpkKqu 📰 — Hut 8 (@Hut8Mining) February 7, 2023\n\nThe USBTC team also adds leadership in energy origination, development, demand response, hedging, grid stabilization and analytics.\n\nThese are important for the ability to plan around stable and predictable energy usage.\n\n.\n\nFollow Mugglehead on Twitter\n\nLike Mugglehead on Facebook\n\nFollow Joseph Morton on Twitter\n\njoseph@mugglehead.com"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbmdlZWsuY29tL2NvaW5zdG9yZS1leGNoYW5nZS1ub3ctbGlzdHMtYml0Y29pbi1zdi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Coinstore exchange now lists Bitcoin SV - CoinGeek",
        "content": "Bitcoin SV has officially been listed on Coinstore.com, a leading digital currency exchange. This provides another way for users, entrepreneurs, and others to buy, sell, and trade BSV.\n\nAlong with the listing on Huobi Japan in 2022, the move proves that more exchanges are noticing the growing BSV ecosystem, which now consists of millions of daily transactions and an ever-growing portfolio of applications.\n\nAbout Coinstore.com\n\nCoinstore.com was founded in 2020 by professionals from some of the leading digital currency exchanges.\n\nThe exchange has over 180 employees worldwide, over 1.8 million registered customers in 175 countries, and a normalized 24-hour volume of more than $120 million, according to popular digital currency tracker CoinGecko.com.\n\nBSV is one of a limited number of digital currencies listed by CoinStore. Unlike many other exchanges, this one is selective, listing around 50 currencies in all. BSV is live as of Monday, February 6, 2023.\n\nThe BSV ecosystem continues to grow\n\nWhile there have been several headline-grabbing delistings of BSV in recent times, including by Robinhood (NASDAQ: HOOD) and Bitfinex, the ecosystem continues to grow. Forward-thinking exchanges recognize the demand for the original Bitcoin and are listing it as a result.\n\nWhile the ‘crypto media’ would like to paint the picture that BSV is dead and continues to be squeezed out of the digital currency ecosystem, nothing could be further from the truth. As the new listing indicates, for every exchange that delists, another sees the potential and picks up the baton, and the ecosystem as a whole is thriving. With millions of daily on-chain transactions and a plethora of micropayment-powered applications like Haste Arcade and my2cents, the demand for the BSV token will only grow in the coming years.\n\nCoinstore.com has clearly recognized this and has capitalized on the opportunity. Expect other future-oriented exchanges to follow suit in the coming months and years.\n\nWatch: Blockchain Venture Investments: Driving Utility for a Better World\n\nwidth=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY2hhdG5ld3N0b2RheS5jYS8yMDIzLzAyLzA3L2NyeXB0by1jb21wYW55LWh1dC04LW1pbmluZy1zaWducy1kZWFsLXRvLW1lcmdlLXdpdGgtdXMtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Crypto company Hut 8 Mining signs deal to merge with US Bitcoin - CHAT News Today",
        "content": "Hut 8 facility in Medicine Hat (CHAT News File Photo) Deal requires shareholder and regulatory approval Crypto company Hut 8 Mining signs deal to merge with US Bitcoin Feb 7, 2023 | 8:22 AM\n\nTORONTO – Canadian cryptocurrency company Hut 8 Mining Corp. says it has signed a deal to merge with U.S. Data Mining Group Inc., the company behind US Bitcoin Corp.\n\nUnder the agreement, the combined company will be named Hut 8 Corp. and will be an U.S.-domiciled company.\n\nThe deal will see shareholders of Hut 8 receive 0.2 of a share in the combined company for each Hut 8 share they own, while shareholders of USBTC will receive 0.6716 of a share in the new company for each USBTC share they hold.\n\nOwnership in the new company will be about evenly split between the existing Hut 8 and USBTC shareholders."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJubmJsb29tYmVyZy5jYS9odXQtOC1taW5pbmctcy1tZXJnZXItd2l0aC11cy1iaXRjb2luLWJyaW5ncy1yZXZlbnVlLWRpdmVyc2lmaWNhdGlvbi1jZW8tMS4xODgxMTQ20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Hut 8 Mining's CEO on merger with US Bitcoin - BNN Bloomberg",
        "content": "Our merger with U.S. Bitcoin would have happened whether Bitcoin and FTX collapsed or not: Hut 8 CEO\n\nThe newly announced merger of US Bitcoin and Hut 8 Mining Corp will provide diversified revenue and help the combined business scale, according to the chief executive of the Toronto-based crypto mining company.\n\nThe all-stock merger was announced Tuesday in a news release and Hut 8 Mining‘s Jaime Leverton will continue to act as the chief executive officer. The combined company will be named Hut 8 Corp. and will be domiciled in the U.S.\n\nThe move toward consolidation comes amid volatility in crypto markets.\n\n“We think bringing these two entities together is just going to provide an incredible amount of scale [and] diversified revenue programs, which is very on strategy for both of us independently,” Leverton said in an interview with BNN Bloomberg Tuesday.\n\nThe merger will allow the company to be more competitive and cost-effective, she said.\n\nThe combined entity will have a market capitalization of roughly US$990 million, the release said.\n\nAccording to Leverton, the merger will also provide opportunities for diversification, both in terms of geography and revenue streams.\n\n“One of the advantages here is [that the merger is] giving us that geographic diversification. There's uncertainty in regulatory environments on both sides of the border,” she said.\n\n“I think it's in the best interest of our business to have diversified revenue streams [and] diversified geographies.”\n\nFollowing the collapse of FTX Group in November 2022, Leverton said interest in the crypto space is beginning to return.\n\n“I think we're seeing a lot of interest come back into this space [crypto], we've seen significant appreciation across the space so far in 2023,” she said.\n\nReturning interest in the crypto industry is a sign that fears stemming from the collapse of FTX are “starting to subside a little bit,” according to Leverton.\n\nLeverton said she believes there is an appreciation for crypto miners, similar to Hut 8, that take a “balance sheet first” approach with diversified revenue streams."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzUtYmVzdC1jYXNpbm8tZ2FtZXMtY3J5cHRvLWdhbWVzLWZvci1iaXRjb2luLWdhbWJsaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "5 Best Casino Games & Crypto Games For Bitcoin Gambling - Analytics Insight",
        "content": "Struggling to find an online casino offering the best casino games to play?\n\nWith so many different games available, each with its strategy, it’s difficult to know which ones are the most fun and the best options to win real money.\n\nCheck out our list of five of the best casino games for 2023. We include easy-to-follow guides for beginners to help you get started. Join a promising online casino today!\n\nTop 5 Online Casino Games\n\nIgnition Casino – Best Online Casino Games Overall, Editor’s Pick\n\nmBit Casino – Reputable Casino Site For Slot Machines & Promotions\n\nBitstarz – Top Online Casino Real Money Games For Blackjack\n\nWild Casino – Play Online Gambling Tournaments With Welcome Bonus\n\nBetOnline – Leading Casino Platform For Sports Betting & Video Poker\n\n#1. Ignition Casino – Best Online Casino Games Site Overall, Editor’s Pick\n\nIgnition Casino is a game-oriented online casino brand that was launched in 2016. The casino caters to every type of player and is one of the most popular online casinos in the world.\n\nWith a wide choice of games and slots, great promotions and bonuses, and simple-to-use software designed for ease of use, the brand offers a huge range of unmatchable features.\n\nIgnition Casino has been in the online gambling industry for over five years. Since then, it has provided over 300 free slot games, more than 24 live blackjack tables, and a range of other games.\n\nThe casino offers twelve roulette games, baccarat, and Super 6, besides blackjack. The minimum wager for a Blackjack game is $5; the maximum wager depends on the number of decks in play. With a maximum bet of $2,500 per hand at Ignition Casino’s tables and a variety of video poker games, you will always have fun playing casino games here.\n\nHighlights\n\n300+ Games: The casino offers an extensive range of casino games exceeding 300 in its gaming library. If you’re a slots fan, Ignition Casino has plenty of action. With more than 200 slots, including many popular progressives, this online casino is well known for its slots. If you like to mix things up, there are plenty of other games to enjoy. You can choose from 25 table games, 22 specialty games, 17 video poker games, and five live dealer variants. Plus, with multiple providers and massive jackpots, the variety is pretty incredible!\n\nHighly Transparent: Ignition Casino offers a transparent privacy policy, making it one of the safest places to play online casino games. You can learn about the information on its website, such as how it limits withdrawals and what information it collects around you. For example, Ignition Casino doesn’t restrict your maximum withdrawal amount, which means your funds are never out of your control.\n\nFairness Test: The fairness of online casinos is a question that pops up from time to time. Fairness testing is not just about cheating; it also refers to how efficient the selections in the slot game machines are. The casino developers use a random number generator to ensure fairness.\n\nBitcoin Welcome Bonus: Ignition Casino offers a Bitcoin Welcome Bonus to new customers. If you deposit $2,000 or more in BTC, you’ll earn an extra $4,000 in bonus cash, plus a 100% poker match on your first bitcoin deposit. This offer is valid for all first-time depositors who fund their accounts using Bitcoin payments.\n\nPros\n\n10,000+ daily players\n\nFree games available\n\nUp to $4,000 welcome bonus\n\nCons\n\nSub-par mobile app experience\n\nDoes not offer anonymous accounts\n\nGet Started At Ignition Casino Today\n\n#2. mBit Casino – Reputable Casino Site For Slot Machines & Promotions\n\nmBit Casino is an online casino brand that has been around since 2014. This popular casino offers over 2,000 games and promises you’ll have unlimited fun.\n\nDon’t miss the new member promos, exclusive promotions, and easy-as-pie registration process that mBit Casino has in store for you. Plus, they offer up to a 110% first deposit bonus on top of a wide range of casino games, bonuses, and promotions. Only at mBit Casino can you find up to one BTC in bonus. The bonus may include 300 free spins or even 1,000 free ones after your initial deposit!\n\nmBit Casino offers more than just an incredible selection of slots to play. They also have a vast collection of table games, video poker, and specialty games that you can enjoy in their downloadable software and instant play versions.\n\nMoreover, mBit Casino was the first betting platform to offer Keno in the category of real money games. It makes for an interesting way of adding luck to your play, though if you opt in, there is no guarantee that you will walk away with more than you began!\n\nBesides, this Bitcoin casino offers an amazing welcome offer where you can receive up to 2.5 BTC and free spins when depositing over the first four deposits! You can use this welcome package to try out all the best games at mBit Casino.\n\nHighlights\n\nHD Live Stream: mBit Casino offers over 50 live dealer games in HD quality. These include blackjack, poker, baccarat, roulette, Dream Catcher, and other variations. The live-streaming service features a dealer who acts on the table in front of you. You can even chat with other players or dealers from your computer or mobile device.\n\nLoyalty Program: mBit Casino is one of the best on the net. In addition to its excellent games and bonuses, this casino brand offers many rewards for loyal players. The loyalty program provides you with 2 – 15% cash back that you can use to play more and get more bonuses. Additionally, mBit is ready to give you 200 free spins and a 30% deposit bonus if you invite your friends to participate in this VIP program.\n\nAmazing Deals: mBit Casino offers some of the most competitive deals in the online casino industry. These include deposit bonuses, free spins, daily rewards, and up to a 110% match bonus. This brand also has a special “Bitty Quiz” that awards players up to 5,000 free spins if they answer ten questions correctly.\n\n7 Cryptocurrency Options: mBit Casino allows customers to make deposits and withdrawals in seven different cryptocurrencies, including Tether, Ethereum, Bitcoin, Litecoin, Ripple, Bitcoin Cash, and Dogecoin.\n\nPros\n\n2000+ casino games\n\nInstant payouts\n\nDaily and weekly promotions\n\n24/7 live dealer\n\nCons\n\n35 times high wagering requirements for the bonus\n\nDoes not accept flat currencies\n\nClick Here To Find The Best mBit Casino Bonuses\n\n#3. Bitstarz – Top Online Casino Real Money Games For Blackjack\n\nBitStarz casino is an award-winning, licensed, and regulated company in Curacao. This leading online casino has been in operation since 2014. It is one of the most trusted gaming brands in the industry due to its innovative product offerings and second-to-none customer service.\n\nIn terms of payout times, BitStarz takes the cake. BitStarz allows users to process payments within minutes, thanks to its cutting-edge auto-processing system.\n\nOn average, players expect to receive their funds within ten minutes of requesting a bank transfer. This brand is also known for offering fast and friendly customer service through its live chat feature, with representatives from around the globe. And the best part? Customer feedback shows that support agents never fail to respond promptly.\n\nBitStarz is a leading online casino games platform that provides players with a first-class gaming experience. The site offers a collection of the industry’s most popular and entertaining games. These include card games, Bitcoin games, and classic slots, which you can play for real money or for free. Many of these games are developed by reputable developers like Pragmatic Play, Belatra games, and Platipus.\n\nHighlights\n\nStellar Reputation: BitStarz casino is one of the top brands in the gambling industry and has won several accolades over the years. The brand, established online in 2014, offers its players a wide range of games, rewards, and promotions. For its stellar performance, Bitstarz has won awards like EGR 2018 Awards Shortlisted, Best Support 2020, and Best Casino 2021.\n\nExclusive Bonuses: When you sign up with BitStarz, you’ll be happy to know that your account offers several awesome perks. One of the perks is offering an exclusive 100% bonus on your first deposit. Players are also entitled to 25 no-deposit free spins as soon as they register.\n\nAccepts Crypto: BitStarz is a crypto-focused casino brand that offers a variety of payment options to choose from. They accept many cryptocurrencies and fiat currencies for deposits and withdrawals. BitStraz accepts Bitcoin Cash, Ethereum, Litecoin, and Dogecoin as payment methods. On the other hand, you can use fiat currencies such as Brazilian Real, US Dollars, Canadian Dollars, Japanese Yen, Euros, and others for deposits. Once a player makes the first deposit with their preferred payment method, they’re free to play the games at their leisure, thanks to their user-friendly interface.\n\nUser-Friendly: While most cryptocurrency casinos come with exceptionally well-designed websites, some are nothing more than a bunch of words. BitStarz is not one of those sites. This popular online casino comes with an easy-to-use interface and eye-catching colors. The site is very easy to navigate through and has no noticeable lags. Everything about the website makes it one of a kind.\n\nPros\n\n3500+ games\n\nFree slot games\n\nAccepts cryptocurrency\n\n100% welcome bonus\n\nCons\n\nLack loyalty program\n\nUnavailable in some restricted countries\n\nClick Here To Visit The BitStarz casino Website\n\n#4. Wild Casino – Play Online Gambling Tournaments With Attractive Welcome Bonus\n\nWild Casino presents a great gambling experience, with over 16 live dealer games and many ways to win. In addition to its fantastic live dealer casino section, this brand offers a wide variety of online slot games for players.\n\nPlayers have the chance to wager on a great number of paylines, which can offer them bigger wins if they get lucky. Furthermore, this casino has a few promotions that take place every week for new players and veteran gamblers alike.\n\nThe casino offers an attractive welcome bonus to all new players, who can claim a special $9,000 cryptocurrency welcome bonus upon registering at the casino for the first time.\n\nWild Casino is the top destination for online gambling. It provides a safe, secure, and fun-filled world of online entertainment. Since the online casino offers a variety of loyalty rewards, promotions, and tournaments daily. These extras boost players’ morale and make their experience top-of-the-line.\n\nHighlights\n\nQuick and Convenient: Wild Casino’s live casino stream is accessible on your tablet, smartphone, or computer. You can easily connect to a dealer and pick the right table stakes with just one click. Wild Casino offers an unparalleled betting experience with fully integrated chat features that help make it much more enjoyable to play in real time.\n\n16 Live Casino Games: This brand offers more than 16 live dealer casino games that instantly transport you into a real-world casino. The brand’s live dealer games are more focused on blackjack variants. These include single-deck blackjack, multi-hand blackjack, and American blackjack.\n\nAttractive Interface: The design of the brand’s website is kept simple and easy to navigate, which makes it perfect for beginners looking for a quick bet. You’ll find all the information you need on their games in an organized way, making it easy to locate your favorite bet.\n\nCasino Gaming Therapy: It’s great to enjoy a gaming experience, but Wild Casino doesn’t want anyone to have a gambling addiction. Therefore, Wild Casino’s “Responsible Gaming” section features tips on recognizing when you or others might be struggling with gambling-related issues. Also, they provide 24/7 support, free practical advice, and information regarding any questions you may have about gaming addiction.\n\nPros\n\nHD video feed\n\n400+ games\n\nCryptocurrency deposits and withdrawals\n\nSupports Responsible Gaming\n\nCons\n\nNot best for low-limit players\n\nClick Here To Claim The Best Wild Casino Bonus\n\n#5. BetOnline – Leading Casino Platform For Sports Betting & Video Poker\n\nBetOnline is proud to offer the best online casino experience. Their games and sportsbook service offers players a wide range of online casino games, making it easy to find your favorite slots and enjoy great winnings.\n\nThe brand has hundreds of free slots and video poker games, each with high-quality graphics. You can play them from any device on their mobile app or a desktop version without installing or upgrading.\n\nBetOnline is a great choice for sports bettors. Live betting is available on numerous sporting events and sportsbooks. Prop bets are also readily available so that you have a variety of wagering options from which to choose. Wagering options extend beyond sports betting and include horse racing, racebooks, online poker rooms, and other casino games.\n\nHighlights\n\n25+ Years of Expertise: BetOnline has been delivering the most exhilarating online casino gaming experiences for more than 25 years. This brand prides itself on providing the best sports, casino, and poker odds across all major leagues. In addition, they offer some of the best promotions in the business.\n\n48-Hour Fast Payouts: One of the best aspects of BetOnline is its lightning-quick payout times. Withdrawals are processed within 48 hours, and it’s nice knowing that the casino won’t hold up your money while you’re waiting to cash out.\n\n20% Monthly Reload Bonus: The 20% monthly reload offer at BetOnline provides a once-a-month chance to top up your balance. This deal greatly benefits players because it requires just a $25 minimum deposit and offers up to $500 in total bonuses or 20% of your deposit.\n\nReferral Bonus: Use BetOnline’s “Refer a friend” program to earn extra cash. You must invite your friends to register on BetOnline’s platform to participate in this program. This brand will pay you 200% up to $200 and an additional $50 sports free play bonus for each referral. There are no restrictions on how many people you can refer.\n\nPros\n\neSports betting\n\nBest sportsbook services\n\n100% referral bonus\n\nAccepts cryptocurrency\n\nCons\n\nCharge a 5% credit card fee\n\nNo loyalty program\n\nClick Here To Visit The BetOnline Website\n\nHow We Made This List For The Best Online Casino Games Site?\n\nWe are professional team analysts and gamers who take benchmarking seriously. Our team started the process by measuring the best in a given category and then compiled our list of recommendations.\n\nThen, we identified the criteria important to a gambling game and tested them with our experts and gamers.\n\nThe process of making this list was quite extensive. We researched everything from game rankings to in-game prize pools and made sure we covered everything.\n\nThis list of the best casino games is based on our personal experience playing at casinos and quotes from reviewers and other players.\n\nWe read through thousands of player experiences, trying to identify those games that have stood out and provided great entertainment or excitement. Our team considered a basic data set on each game, including its rules, payouts, and frequency of hitting jackpots.\n\nAs a result, we had only five casinos that offered high-quality live dealers, poker, slot machines, and many other popular casino games.\n\nWhat We Looked For\n\nWe’re not only interested in online casinos for their gaming options but also for their ease of use and reliability. We analyzed various factors that contributed to the overall quality of each site we reviewed.\n\nCasino Reputation: We compiled a list of the most reputable and trustworthy online casinos to help you find a gambling site that our experienced team has vetted. For this, we considered factors like player satisfaction, payout rate, and the reliability of each site’s customer support before awarding them one of our top casino reputations.\n\nWebsite Interface: We have carefully researched and selected casinos with user-friendly interfaces where all the games and bonus offers are clearly, and visually presented. This greatly affects how enjoyable your online casino experience will be.\n\nOnline Slots Games: We scoured the web looking for the best online casino sites and have compiled a list of the sites that offer hundreds of online slot games and other table games, poker, blackjack, and roulette.\n\nBonuses and Promotions: To ensure that these casinos are the best, we picked ones that value loyalty. They reward players with bonuses and promotions every week.\n\nSafe Banking: Spending money is a risk one can mitigate with knowledge and research. Since gambling is about spending money, gamers want to ensure they get their cash back promptly. All the online casino gaming platforms we chose offered swift withdrawal times of less than ten minutes. We also checked on each site for those games with the best odds of winning.\n\nWhat Should You Consider Before Choosing an Online Casino?\n\nBefore you choose a platform for playing casino games, you must know what you want to play, how much time and money you can spend, and the platform that offers the game you prefer. Here are some other tips:\n\nGaming Library\n\nBefore choosing a casino, you should check its gaming library. If a casino has a limited selection of games, it’s probably not the best place to play. It’s important to find a site that offers a wide range of games to find something you enjoy playing.\n\nCasino Reputation\n\nWhen choosing online casino games, you should consider the company’s reputation and its licensing and regulation. Reputation is important because it can tell you what kind of experience you’re likely to have if you use the casino. A company with a long history of customer service issues or legal problems might not be worth your time or money.\n\nDemo and Free Games\n\nCheck the casino’s demo and free games. You want to make sure that they offer games that are fun, engaging, and easy to play before signing up. It’s also important to see if there are any limitations on using these demos or free games before committing any money.\n\nFAQ’s: Casino Games\n\nWhich casino games are most popular?\n\nBitStarz casino offers the best games. For example, many free slot machines have different themes, such as zombies and pirates. But there are also roulette tables where you can play games with other players from around the world. If you want something more exciting than classic slots, try playing video poker or blackjack at this casino!\n\nAre free casino games safe to play?\n\nYes. While it’s true that free casino games aren’t nearly as flashy as their real-money counterparts, they’re just as fun and rewarding when you win. You can play them at home on your computer (or even on your phone or tablet) without worrying about losing any real money!\n\nYou only have to be careful of getting caught up in the excitement and spending too much time playing, which can lead to overspending.\n\nConclusion: USA Online Casino Games That Pay Real Money\n\nGambling is an activity that you can master. You just need to know how and where to start. This review has selected the best online casinos that are offering their services to customers all over the world. We are confident that these platforms can meet all your gambling needs, whether a simple game of slots or a high-roller game of poker.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm91dGxvb2tpbmRpYS5jb20vYnVzaW5lc3Mtc3BvdGxpZ2h0L2JpdGNvaW4tbG9vcGhvbGUtcmV2aWV3LTIwMjMtc2NhbS1hcHAtb3ItbGVnaXQtd2Vic2l0ZS1uZXdzLTI2MDA4N9IBfGh0dHBzOi8vd3d3Lm91dGxvb2tpbmRpYS5jb20vYW1wL3N0b3J5L2J1c2luZXNzLXNwb3RsaWdodC9iaXRjb2luLWxvb3Bob2xlLXJldmlldy0yMDIzLXNjYW0tYXBwLW9yLWxlZ2l0LXdlYnNpdGUtbmV3cy0yNjAwODc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Loophole Review 2023 / Scam App Or Legit Website - Outlook India",
        "content": "Although trading can be profitable, it also has a lot of risk, so you have to take a lot of time before investing in any exchange that most of you might not have. An automatic trading platform called Bitcoin Loophole came into existence to solve this problem for us. It increases the chances of Our trading success up to 60% by setting a short trading period that we can trade on. Not only does it minimise our time spent on trading, but it also allows us to maximise our profits."
    }
]