[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5lcmR3YWxsZXQuY29tL2FydGljbGUvaW52ZXN0aW5nL3dpbGwtYml0Y29pbi1nby1iYWNrLXVw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Will Bitcoin Go Back Up? - NerdWallet",
        "content": "Bitcoin — and the larger crypto market — fell in the final months of 2022 following the crash of crypto exchanges FTX and FTX.US. On Nov. 11, 2022, both exchanges filed for Chapter 11 bankruptcy. And because FTX had invested in so many crypto-related companies and cryptocurrencies, its collapse was felt across the entire industry.\n\nWhile Bitcoin has a history of bouncing back after crashes, recoveries have proven to take months or even years. And although Bitcoin officially recovered all of its post-FTX crash losses by mid-January 2023, it remains a highly volatile asset, and the fallout from the FTX crash is ongoing. Crypto exchange BlockFi, which had received a line of credit from FTX.US and was set to be acquired by it, filed for bankruptcy on Nov. 28. And Gemini is still working to recover assets that were held in its Gemini Earn program, which have been frozen since Nov. 2022.\n\n🤓 Nerdy Tip If you're worried about keeping your crypto with an exchange, consider moving your digital assets to a separate crypto wallet. Most exchanges allow you to transfer assets to these wallets, which can be online (on a separate platform) or offline (on a thumb drive with added security features).\n\nIn general, what factors could cause Bitcoin to go up?\n\nLooking ahead, there are a handful of factors that could cause demand for crypto to rise:\n\nA crash turns out to be more limited in scope than initially thought. Because so many crypto-related companies are financially entangled through investments and acquisitions, one exchange crash can trigger other companies and currencies to fall like dominoes. If, however, it appears the dust has settled on the FTX collapse, and investors once again pile into the speculative asset, prices could rise. Inversely, if new details emerge regarding the FTX collapse, or if another popular exchange runs into similar issues, that could limit price growth.\n\nLower interest rates. The price of riskier investments tends to rise with lower rates. Currently, the federal funds rate is higher than it's been for more than 10 years and rising as the Federal Reserve tries to beat back inflation. However, when Silicon Valley Bank suddenly collapsed on March 10, 2023, it called into question whether the Fed will continue to raise rates as aggressively as it had been — or at all.\n\nReduced threats of inflation and economic recession. If the Federal Reserve is successful in reducing inflation through raising interest rates, investors might have more appetite for investing in risky assets such as Bitcoin.\n\nBig investors getting into crypto investing (such as pension funds). Large purchases can nudge prices up.\n\nAdvertisement Charles Schwab Interactive Brokers IBKR Lite Webull NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 4.9 /5 NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 5.0 /5 NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 5.0 /5 Fees $0 per online equity trade Fees $0 per trade Fees $0 per trade Account minimum $0 Account minimum $0 Account minimum $0 Promotion None no promotion available at this time Promotion None no promotion available at this time Promotion Get up to 75 free fractional shares (valued up to $3,000) when you open and fund an account with Webull. Learn More Learn More Learn More\n\nThe SVB collapse\n\nIn the days following the collapse of Silicon Valley Bank, or SVB, Bitcoin's price surged from around $20,000 to more than $24,000. Why? Because to many Bitcoin enthusiasts, this was exactly the kind of problem Bitcoin was invented to solve. Had SVB depositors put their funds in Bitcoin, the argument went, they would have retained full control of their money. This price surge suggests that when issues within traditional finance arise, there's a cohort of bulls who believe Bitcoin is the solution. And when investors are piling in, the price could potentially go up.\n\nAdvertisement Coinbase Robinhood Crypto Webull Pay NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 4.8 /5 NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 3.9 /5 NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 3.5 /5 Fees 0% - 3.99% varies by type of transaction; other fees may apply Fees $0 per trade Fees 1% spread Account minimum $0 Account minimum $0 Account minimum $0 Promotion Get $200 in crypto when you sign up. Terms Apply. Promotion None no promotion available at this time Promotion None no promotion available at this time Learn More Learn More Read review\n\nBitcoin price predictions: All over the map\n\nBitcoin is the oldest and most valuable cryptocurrency and is often used as a proxy for the price of cryptocurrencies. As a result, there's a lot of speculation about where the price will head next.\n\nYou can find a wide range of predictions on crypto blogs, Twitter accounts and YouTube pages. But you won't see many professional analysts setting price targets like they do for stocks. It's just too hard: J.P. Morgan's research from 2021 showed that Bitcoin is roughly five times more volatile than equities or gold and has \"little to no correlation with other major financial assets.\"\n\nThose who believe in cryptocurrency's long-term potential might say the question is not if prices will rise again but when. And \"when\" can mean many different things. For example, Bitcoin could come back as furious as it did in 2021, or it could be a multi-year recovery, such as after a drop in 2013.\n\nIt's also possible that prices could continue to go down rather than back up. The latest crypto winter passed the one-year mark, and a drumbeat of bad news throughout 2022, including the sudden fall of exchanges FTX and FTX.US, dampened hopes of an upswing. Even after a strong start to 2023, uncertainty following the turmoil of late-2022 could send prices downward again.\n\nTrack your finances all in one place Get started by signing up and linking an account. Sign Up\n\nHow to respond to a crypto downturn\n\n\"In some ways, the volatility in crypto can accrue to the benefit of savvy investors,\" says Greg King, founder and CEO of Osprey Funds, a crypto investment firm. \"It offers investors great opportunities to buy dips, tax-loss harvest and dollar-cost average.\"\n\nThe strategies King referred to are available to anyone. Buying the dip means viewing price slides as opportunities, if you believe the price will rise again eventually. Tax-loss harvesting is a way to lower your tax bill by selling off investments for a loss, and dollar-cost averaging means buying regular amounts of an investment at regular intervals.\n\nThese strategies for investing in crypto in a down market rely on forming a plan, executing it and sticking with it over time."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMTMvYml0Y29pbi1idGMtY3J5cHRvLXByaWNlcy1zdXJnZS1hcy1zdmItZGVwb3NpdG9ycy1wcm90ZWN0ZWQuaHRtbNIBZGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAzLzEzL2JpdGNvaW4tYnRjLWNyeXB0by1wcmljZXMtc3VyZ2UtYXMtc3ZiLWRlcG9zaXRvcnMtcHJvdGVjdGVkLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin jumps as much as 10% with crypto market topping $1 trillion as U.S. creates backstop for SVB depositors - CNBC",
        "content": "In this article SBNY\n\nBTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nJakub Porzycki | Nurphoto | Getty Images\n\nCryptocurrencies rallied on Monday as the U.S. government moved to protect depositors of the collapsed Silicon Valley Bank and HSBC bought the lender's U.K. arm. Bitcoin was last higher by 5% at $22,374.68, according to Coin Metrics data. Ether rose 2% to $1,585.58. The overall cryptocurrency market gained more than $70 billion in the 24 hours to 2 a.m. ET, jumping back above $1 trillion on Monday.\n\nIt has been a rollercoaster ride for crypto markets after the collapse last week of Silvergate Capital, a major lender to the crytpo industry. Silvergate said Wednesday it is winding down operations and liquidating its bank. Then came the collapse of Silicon Valley Bank on Friday in what was the biggest banking failure since the 2008 financial crisis. Both Silvergate and SVB put their money into U.S. Treasurys which have lost value as the U.S. Federal Reserve has raised interested rates. These banks have been forced to sell these bonds at a loss to shore up their capital position. That was followed on Sunday by the closure of Signature Bank , a major lender in the crypto industry, by U.S. regulators to stem any contagion to the broader banking sector.\n\nwatch now"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8xMy9iaXRjb2luLXdhcy1idWlsdC13YXMtZm9yLXRoaXMtbW9tZW50L9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8xMy9iaXRjb2luLXdhcy1idWlsdC13YXMtZm9yLXRoaXMtbW9tZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Was Built for This Moment - CoinDesk",
        "content": "Circle tried to restore trust by announcing it will use its corporate resources to cover any shortfall, which caused the stablecoin market to rebound by Sunday evening. As a result, USDC and DAI (which has significant USDC reserves) have returned to their dollar peg, and it is expected that USDC will now trade at par after compensating for SVB depositors. But is that enough?"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTEzL2JpdGNvaW4tYnRjLWluY3JlYXNlcy1tb3JlLXRoYW4tNS1hZnRlci11cy1zdXBwb3J0cy1iYW5raW5nLXNlY3RvctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Increases More Than 5% After US Supports Banking Sector - Bloomberg",
        "content": "Bitcoin surged 13%, the biggest one-day increase since the wild price swings seen during November’s market turmoil, and shares of crypto companies rallied following moves by US authorities to stem the spread of concern about the health of the nation’s financial system.\n\nThe rally helped to extend the largest cryptocurrency’s recovery from its worst week in about four months, where an equity selloff, jitters in the banking sector and an escalating US regulatory crackdown on crypto combined to hurt investor sentiment. The stablecoin USDC traded at par again with the dollar after depegging last week. Adding to the optimism was Binance’s announcement that it would covert the remaining stablecoin funds from a $1 billion industry stability fund to Bitcoin, Ether and its BNB token."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kZXRlcm1pbmVzLXByaWNlLWJpdGNvaW4tMTAzNDU0MzQzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "What Determines the Price of Bitcoin? - Yahoo Finance",
        "content": "The Bitcoin blockchain went live on January 3rd, 2009. At its inception, the Bitcoin network started releasing its own eponymous currency or money. Every ten minutes, the network released 50 BTC to a tiny community of cryptography enthusiasts. Although starting from humble beginnings, its creator Satoshi Nakamoto had an ambitious goal for Bitcoin to be a “peer-to-peer version of electronic cash” for the world.\n\nAt first, Bitcoin didn’t have a set monetary value because there wasn’t a marketplace for BTC. Without goods and services being offered for Bitcoin, it was difficult—if not impossible—to determine its price in a fiat currency such as the U.S. dollar (USD).\n\nMarket Forces Determine Prices\n\nThe cost of goods, fiat exchange rates (USD to EUR for example), and the spot price of commodities (such as corn and oil) are determined by the laws of supply and demand. When in-demand supplies are created in surplus, prices typically go down when demand remains constant. Likewise, a supply shortage tends to make prices appreciate (assuming demand remains constant). This dynamic also holds true for BTC and other cryptocurrencies.\n\nBitcoin Price Markets: Then and Now\n\nOn May 22, 2010, 10,000 BTC were exchanged for two pizzas in what is widely considered the first BTC purchase (at the time, one BTC was worth $0.004). Subsequently, others started accepting goods and services in exchange for Bitcoin which created a market big enough for robust price discovery — which is simply the free market method for determining an asset’s price. Since then, people have purchased everything from luxury goods to real estate using BTC.\n\nBitcoin Pizza Day 2020: How two Papa John's pies became famous\n\nSince 2010, the price has risen dramatically as demand has typically outpaced supply. From July 2020 onwards, the Bitcoin price has remained above $10,000 and reached an all-time high price of $69,990.90 in November 2021. Eschewing BTC-to-pizza markets, price discovery is now determined primarily on centralized crypto exchanges (CEXs) where BTC is traded for fiat (USD, EUR, KRW) and a variety of other cryptocurrencies such as ether (ETH) and litecoin (LTC).\n\nStory continues\n\nWhy Is BTC in Demand?\n\nPut simply, many who purchase and use BTC view it as a fiat currency and payment system alternative. With its limited supply and decentralized nature, some purchase it as an inflation hedge, store of value, or as an investment. Others who have lost confidence in their banking system or national currency prefer an asset that is difficult to confiscate and doesn’t need a trusted third party to make transactions.\n\nBitcoin Price Predictions Vary Widely\n\nFrom being called a “global reserve currency” to “absolutely worthless,” Bitcoin price forecasts vary from zero to over $1 million. Ultimately, the opinions of Bitcoin proponents and detractors won’t determine the price. Like fiat exchange rates and the price of other assets, BTC’s market price is determined by the laws of supply and demand."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMy8xMy9iaXRjb2luLXJhbGxpZXMtMTgtcGVyY2VudC1pbi13YWtlLW9mLXN2Yi1jcmlzaXMv0gFXaHR0cHM6Ly90ZWNoY3J1bmNoLmNvbS8yMDIzLzAzLzEzL2JpdGNvaW4tcmFsbGllcy0xOC1wZXJjZW50LWluLXdha2Utb2Ytc3ZiLWNyaXNpcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin rallies over 18% in 24-hour span in wake of SVB crisis - TechCrunch",
        "content": "The value of major cryptocurrencies rose Monday in the wake of U.S. government plans to protect Silicon Valley Bank and Signature Bank depositors.\n\nThe Federal Reserve issued a pair of statements on Sunday with one clear message: Silicon Valley Bank’s depositors, both insured and uninsured, will receive help in a manner that will “fully protect” their deposits.\n\nThe risk of a banking contagion was lower at the start of the week than last Friday, but not zero.\n\nFollowing a rally in the price of bitcoin and other crypto assets, the overall crypto market surpassed $1 trillion in value on Monday, up about 14% day over day.\n\nIn the past 24 hours, bitcoin rose 18.4% to over $24,000, while ether rose 15% to about $1,700, CoinMarketCap data showed. The two cryptocurrencies, which are the largest by market capitalization, are trading in parallel with one another.\n\nUSDC, the second largest stablecoin, also recovered about 4% in the past 24 hours following the news that deposits would be protected, CoinMarketCap data showed.\n\nThe alleged stablecoin depegged from its $1 peg for three days, going as low as 88 cents, after uncertainty circulated around the $40 billion USDC empire and the company shared that $3.3 billion, or about 8.2%, of its total supply of reserves were held in SVB.\n\nCircle announced the reserve risk was “removed” since the funds became available on Monday morning.\n\n“Trust, safety and 1:1 redeemability of all USDC in circulation is of paramount importance to Circle, even in the face of bank contagion affecting crypto markets,” Jeremy Allaire, co-founder and CEO of Circle, said in a statement. “We are heartened to see the U.S. government and financial regulators take crucial steps to mitigate risks extending from the banking system.”\n\nUSDC’s market capitalization is about $40.5 billion, with $10.9 billion in daily traded volume, down 1% in the past 24 hours, according to CoinMarketCap data. At the time of publication, USDC was millicents away from its $1 peg at $0.993, up 3.9% in the past 24 hours.\n\nThe crypto market, alongside other major industries, had a volatile week after Silvergate Capital, one of the largest banks to provide services to crypto companies, shared it was winding down operations and liquidating its banking division.\n\nShortly after, Silicon Valley Bank collapsed on Friday, and Signature Bank, a major crypto lender, was shut down by regulators on Sunday.\n\nThis market turmoil has seemingly propped up the crypto market, however, as traders responded positively to the news and the overall market cap rose on Monday."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTMvYml0Y29pbi1zdXJnZXMtMTgtYXMtMzAwbS1pbi1kZXJpdmF0aXZlcy1wb3NpdGlvbnMtbGlxdWlkYXRlZC_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEzL2JpdGNvaW4tc3VyZ2VzLTE4LWFzLTMwMG0taW4tZGVyaXZhdGl2ZXMtcG9zaXRpb25zLWxpcXVpZGF0ZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Surges 18% to Above $24K - CoinDesk",
        "content": "“This is where the market believes now that the rails between crypto and TradFi have disappeared, hence we see traders buying what is left of the market and willing to pay a premium,” said Laurent Kssis, crypto trading adviser at CEC Capital."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzAzLzEzL2NyeXB0b2N1cnJlbmNpZXMtcmFsbHktZGVzcGl0ZS1zaHV0ZG93bi1vZi1jcnlwdG8tZnJpZW5kbHktc2lnbmF0dXJlLWJhbmstYml0Y29pbi1qdW1wcy0xMHBlcmNlbnQuaHRtbNIBigFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMy8xMy9jcnlwdG9jdXJyZW5jaWVzLXJhbGx5LWRlc3BpdGUtc2h1dGRvd24tb2YtY3J5cHRvLWZyaWVuZGx5LXNpZ25hdHVyZS1iYW5rLWJpdGNvaW4tanVtcHMtMTBwZXJjZW50Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrencies rally despite shutdown of crypto friendly Signature Bank, bitcoin breaks through $24,000 - CNBC",
        "content": "The jump in risk assets came after U.S. regulators announced plans Sunday night to backstop all the depositors in failed Silicon Valley Bank and make additional funding available for other banks.\n\nBitcoin rose more than 15% to $24,382.98, according to Coin Metrics, and is now about 19% above its Friday levels. Since the January rally in risk assets began to fizzle out, chart analysts have been looking for a meaningful break above $25,000 .\n\nCryptocurrencies surged on Monday, even after regulators Sunday announced the closure of Signature Bank, the last major crypto bank in the U.S.\n\nInvestors were also betting Monday that the Fed will be less aggressive in raising interest rates now that authorities have stepped in to limit the fallout from SVB and Signature.\n\nCrypto initially moved higher amid a broader rally in risk assets. The Dow Jones Industrial Average and S&P 500 eventually turned lower and ended the day in the red, the tech-heavy Nasdaq Composite finished on an up note, however.\n\n\"A slower hiking pace and a lower terminal rate, plus the likely injection of liquidity to prop up banks struggling to meet withdrawals (through the Bank Term Funding Program) imply greater market liquidity, even if this could be partially offset by higher volatility,\" said Noelle Acheson, economist and writer of the \"Crypto is Macro Now\" newsletter.\n\n\"Bitcoin is one of the most sensitive assets to market liquidity, since its 'risk' profile is unencumbered by earnings or ratings concerns,\" she said.\n\nThe last major crypto bank\n\nThe Treasury, Federal Reserve, and FDIC disclosed in Sunday's joint statement that Signature Bank was closed the same day, in a bid to prevent the spreading banking crisis.\n\n\"Both banks had little diversification,\" Sylvia Jablonski, CEO and chief investment officer of Defiance ETFs, said of Signature and Silicon Valley Bank . \"With high risk often comes high reward, however, if the balance sheet behind the system crashes – while you have a Fed removing liquidity from the system and hiking rates – crypto startups and venture capitalists may have a long road to recovery.\"\n\n\"It is a complex matter in the near term,\" she added. \"News of the Fed creating a backstop helped to bolster equities and crypto overnight, however, as panic sets in we will have to see how today's market holds up.\"\n\nCrypto prices rose Monday in the face of that closure, despite it adding to fears by crypto investors and entrepreneurs that regulators are crushing the industry by pressuring banks to cut off their businesses.\n\nSignature Bank was another famously crypto-friendly institution and the next biggest one next to Silvergate , which announced its impending liquidation last week. Wall Street analysts Friday had maintained buy ratings on Signature Bank, even as the bad news around Silvergate and SVB unfolded.\n\nThe end of the Silvergate-Signature duo leaves crypto with few \"on-ramps\" that allow fiat money to flow into crypto assets. They helped solve this problem by creating easy banking services and payment platforms for crypto companies; namely, the Silvergate Exchange Network and Signature's Signet platform."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTMvc2lsaWNvbi12YWxsZXktYmFuay1jcmlzaXMtYS1jeXBydXMtbW9tZW50LWZvci1iaXRjb2luLWNyeXB0by1vYnNlcnZlcnMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8xMy9zaWxpY29uLXZhbGxleS1iYW5rLWNyaXNpcy1hLWN5cHJ1cy1tb21lbnQtZm9yLWJpdGNvaW4tY3J5cHRvLW9ic2VydmVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Silicon Valley Bank Crisis a 'Cyprus Moment' for Bitcoin: Crypto Observers - CoinDesk",
        "content": "\"Silicon Valley Bank, the 18th largest bank in the nation, collapsed yesterday – with it, we learn how last year’s record sell-off in U.S. Treasurys has created billions of dollars worth of unrealized losses within the banking sector and gain yet another example that in a system of fractional reserve banking, there are no depositors, only lenders,\" researcher Nik Bhatia and market analyst Joe Consorti said in the latest edition of The Bitcoin Layer newsletter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDMvMTMvYml0Y29pbi1yYWxsaWVzLTI0MDAwLXJlZ3VsYXRvcnMtc2h1dC1kb3duLXNpZ25hdHVyZS1iYW5rLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin rallies to $24,000 even as regulators shut down Signature Bank - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin rallies to $24,000 even as regulators shut down Signature Bank: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, William Quigley, the co-founder of Tether and WAX Blockchain, discusses the fallout in the crypto industry from the closure of Signature Bank and Silicon Valley Bank."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMirQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEzL2JpdGNvaW4tc3Bpa2UtdG8tMjQ1ay1zdGVtbWVkLWZyb20tcmVndWxhdG9ycy1iYW5rLWludGVydmVudGlvbnMtYmluYW5jZS1zdGFibGVjb2luLWNvbnZlcnNpb24taW52ZXN0b3ItaG9wZXMtZm9yLWZlZC1kb3Zpc2huZXNzL9IBsQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEzL2JpdGNvaW4tc3Bpa2UtdG8tMjQ1ay1zdGVtbWVkLWZyb20tcmVndWxhdG9ycy1iYW5rLWludGVydmVudGlvbnMtYmluYW5jZS1zdGFibGVjb2luLWNvbnZlcnNpb24taW52ZXN0b3ItaG9wZXMtZm9yLWZlZC1kb3Zpc2huZXNzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Surges as Bank Client Rescue Eases Contagion Fears, Fuels Hopes for Fed Dovishness; Binance's $1B Conversion Helps, Too - CoinDesk",
        "content": "Meanwhile, markets may have been encouraged by what some analysts believe will be a more dovish tone from the Federal Reserve, which has been stung by criticism in recent months that it was raising interest rates too aggressively. On Sunday, Goldman Sachs analysts forecast no rate hike at the Federal Open Market Committee's March 22 meeting after the recent banking stresses, according to a report."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzEzL2JpdGNvaW4tbWluZXItc3RvY2tzLXN1cmdlLWFtaWRzdC1iYW5raW5nLW1lbHRkb3duL9IBZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzEzL2JpdGNvaW4tbWluZXItc3RvY2tzLXN1cmdlLWFtaWRzdC1iYW5raW5nLW1lbHRkb3duL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Stocks Surge Amid Banking Meltdown - CoinDesk",
        "content": "The extent of the mining sector's exposure to crypto-friendly Signature Bank is unclear. Marathon Digital Holdings (MARA) on Monday said it still had access to $142 million in deposits the now-shuttered lender. CleanSpark (CLSK), Bitfarms (BITF) and Argo Blockchain (ARBK) said on Monday they have no exposure to either Signature or the other collapsed banks, Silvergate and SVB."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTMvYml0Y29pbi1ldGhlci1yZXRyYWNlLXdlZWtlbmQtbG9zc2VzLWFzLWJlYXJzLXNlZS0xODNtLWluLXNob3J0LWxpcXVpZGF0aW9ucy_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEzL2JpdGNvaW4tZXRoZXItcmV0cmFjZS13ZWVrZW5kLWxvc3Nlcy1hcy1iZWFycy1zZWUtMTgzbS1pbi1zaG9ydC1saXF1aWRhdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether Retrace Weekend Losses as Bears See $183M in Short Liquidations - CoinDesk",
        "content": "Bitcoin inched just over $22,500 in Asian morning hours on Monday while ether regained the $1,600 level, as per CoinGecko. The move came as USD coin (USDC) issuer Circle said Sunday it would cover all shortfall in reserves, while U.S. regulators said SVB depositors will have access to all funds on Monday morning after the U.S. open."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tcHJpY2UtY291bGQtc2NyYXAtNDAtMDAwLWJlZm9yZS1hLWJpZ2dlci1kaXAta2V5LWxldmVscy10by13YXRjaC0yMDIzMTIwMzA4NDDSAYgBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvYml0Y29pbi1wcmljZS1jb3VsZC1zY3JhcC00MC0wMDAtYmVmb3JlLWEtYmlnZ2VyLWRpcC1rZXktbGV2ZWxzLXRvLXdhdGNoLTIwMjMxMjAzMDg0MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin price could scrap $40,000 before a bigger dip, key levels to watch - FXStreet",
        "content": "Share:\n\nBitcoin price remains bullish, up almost 60% since mid-September, confirming the “Q4 is the best month for BTC” narrative.\n\nBTC could extend to tag the $40,000 psychological level before a bigger dip to give late and sidelined investors buy opportunity.\n\nWith strong downward support, GIOM shows there is one major area of interest between $42,556 to $67,413 threatening upside potential.\n\nInvalidation of the bullish thesis will occur the king of crypto breaks and closes below the $37,500 resistance level.\n\nBitcoin (BTC) price is trading with a bullish bias, riding on three themes. First, the fourth quarter has historically proven to be a good month for BTC. Secondly, there is strong anticipation for the approval of spot BTC exchange-traded funds (ETFs), with experts marking the calendar for between January 5 and 10. Third, the Bitcoin halving event slated for April 2024 remains something to look forward to.\n\nAlso Read: Bitcoin price rally to $45,000 likely ahead of fourth BTC halving event\n\nBitcoin price could scrape $40,000\n\nBitcoin (BTC) price is eyeing the $40,000 psychological level and could scrape it before a correction. Several bullish drivers, including the Relative Strength Index (RSI), bolster this outlook. For the RSI, this momentum indicator shows momentum is rising, with its position at 68 showing there is still more room to the north before the king of cryptocurrency can be considered overbought.\n\nFurther, the Awesome Oscillator (AO) is in the positive territory, with green histogram bars, suggesting the bulls are leading the market. Increased buying pressure, therefore, could see Bitcoin price extend from the current price of $39,462 (as of 8:00 AM GMT), and clear the $39,778 range high before scrapping the $40,000 psychological level.\n\nBTC/USDT 1-day chart\n\nOn-chain metrics to support Bitcoin bullish outlook\n\nOn-chain aggregator IntoTheBlock’s Global In/Out of the Money (GIOM) metric shows there is no supply barrier that will prevent the largest crypto by market cap from achieving its upside potential. Based on this on-chain metric, there is only one major area of interest between $38,670 and $39,701 that is filled by a high number of investors that had previously purchased BTC around this price level. Here, roughly 860,540 addresses are holding nearly 324,370 BTC tokens.\n\nThe next crucial resistance extends from $42,556 to $67,413 where 5.64 million addresses or investors had previously purchased 2.11 million BTC tokens at an average price of $52,282.\n\nThe representation also shows that at current prices, 85.60% of BTC holders are sitting on unrealized profit (in the money) while only 12.74% are sitting on unrealized losses (out of the money). Meanwhile, a negligible 1.66% of token holders are breaking even (at the money).\n\nGIOM BTC\n\nAlso, the exchange inflows metric shows a declining trend, meaning the overall intention among token holders to sell BTC is reducing even as more continue to sit on unrealized profits. It points to a commitment to riding the uptrend, effectively giving Bitcoin price an abundance of buying pressure over seller momentum.\n\nBTC exchange inflows\n\nOn the flip side, if profit-taking begins, with traders cashing in for quick gains, Bitcoin price could move south, with key levels to watch, including $37,500, $35,000, $32,500, $31,529, and in the dire case, the $30,000 psychological level. Such a move would constitute a 25% drop from current levels."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXN1cmdlcy1wYXN0LTI0LTAwMC1vbi1jbWUtbGF1bmNoLW9mLWJ0Yy1ldmVudC1jb250cmFjdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin surges past $24,000 on CME launch of BTC event contracts - Cointelegraph",
        "content": "On March 13, American derivatives marketplace CME announced the launch of Bitcoin (BTC) futures event contracts. The exchange, which is fully regulated and has cleared administrative review, will henceforth facilitate cash-settled, daily expiring contracts tied to Bitcoin futures with a \"lower-cost way for investors to trade their views on the up or down price moves of Bitcoin.\" Tim McCourt, global head of equity and FX products at CME Group, commented:\n\n\"Our new event contracts on Bitcoin futures provide a limited-risk, highly transparent way for a wide range of investors to access the Bitcoin market via a fully regulated exchange. These cash-settled, daily expiring contracts will further complement our existing suite which have traded more than 550,000 contracts to-date.\"\n\nOn March 10, Cointelegraph reported that asset manager VanEck's spot Bitcoin trust application was denied by the U.S. Securities and Exchange Commission (SEC). The commissioners noted that the SEC had denied every application for a spot Bitcoin trust that has been filed, amounting to almost 20 over the last six years.\n\nDays prior, digital currency management firm Grayscale published a transcript related to its ongoing lawsuit with the SEC over the denial of its Grayscale Bitcoin Trust (GBTC) to be converted into an exchange-traded fund. According to the transcript, Judge Neomi Rao commented:\n\n\"Because it seems to me that these things, one is just essentially a derivative of the other. They move together 99.9% of the time. So, where’s the gap in the Commission’s view?\"\n\nCurrently, GBTC is trading at a discount of 38.19% to net asset value, up from a historic low of 50%. The firm's litigation with the SEC is ongoing."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vbmV3cy55YWhvby5jb20vYml0Y29pbi1wcmljZS1ib3VuY2VzLWJhY2stc2lsaWNvbi0xMTQwMjkzNjMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin price bounces back as Silicon Valley Bank rescued - Yahoo News",
        "content": "Bitcoin saw a strong price recovery on Monday, 13 March, 2023, after several days of sliding prices (Getty Images/ iStock)\n\nBitcoin has seen a sudden price rebound at the start of the week, rising nearly 10 per cent in the space of a few hours after fears about a potential banking crisis subsided.\n\nThe world’s leading cryptocurrency briefly dipped below $20,000 on Friday – its lowest level since the start of the year – following the collapse of crypto-friendly Silvergate Bank and fears about Silicon Valley Bank appeared to spook investors.\n\nBitcoin rallied after the US government said it would protect customers’ funds, while banking giant HSBC agreed to buy the UK operations of SVB.\n\nThe broader crypto market was also boosted by the news, with Ethereum (ETH), Cardano (ADA) and Solana (SOL) also experiencing similar gains to BTC on Monday.\n\nThe bounce back pushed the overall crypto market cap back above the $1 trillion mark, though the winding down of Silvergate continues to be a concern for the crypto industry.\n\nBitcoin’s strong start to 2023 suffered a major setback after Silvergate Bank became the latest casualty of the so-called crypto winter, which has seen the overall market shrink by around $2 trillion.\n\nThe California-based bank blamed recent industry and regulatory developments for its downfall, saying in a statement last week that “an orderly wind down of Bank operations and a voluntary liquidation of the Bank is the best path forward”.\n\nThese industry developments include the collapse of the FTX exchange, while regulatory moves included growing oversight from the US Federal Reserve that could push banking institutions further away from cryptocurrency.\n\n“Silvergate’s collapse has left nearly as big a hole in the US cryptocurrency industry as FTX’s did,” Leo Jakobson from leading crypto price tracker CoinMarketCap wrote in a blog post.\n\n“Without Silvergate, a number of crypto exchanges – Crypto.com among them – are struggling to figure out how to allow customers to move dollars into their trading accounts and off-ramp them into their bank accounts.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZsYXNoLXNwaWtlcy10by01MGstb24tYmluYW5jZS1hZnRlci11c2QtY29pbi1wZWctc25hcHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin price flash spikes to $50K on Binance after USD Coin peg snaps - Cointelegraph",
        "content": "The panic caused due to USD Coin’s (USDC) depeg from the U.S. dollar manifested itself in a wrong order, costing traders $50,000 per Bitcoin (BTC), albeit for several minutes.\n\nBitcoin price sees $50K in “fat finger” error\n\nThe BTC/USDC pair on Binance flash spiked to $50,000 on March 12 around 7:00 pm UTC. The reason for the impulse spike is unknown and was likely due to a “fat finger” trade of a large order.\n\nBTC/USDC hourly price chart on Binance. Source: TradingView\n\nThe potential reason for the flash spike is likely due to thin order books for the newly launched BTC/USDC pair on Binance. The exchange listed the pair only a few hours before the impulse price surge.\n\nAccording to a trader on Crypto Twitter, it is likely that a Bitcoin market order ate through the limit sell-orders on the pair up to $50,000.\n\nThe pair’s trading price returned toward the market spot price of around $22,000 in minutes following the spike, suggesting it was an isolated incident. Fortunately, the futures market remained unaffected by the spot BTC/USDC pair; otherwise, it could have triggered massive short-side liquidations.\n\nBut this isn’t the first time cryptocurrency exchanges have seen flash crashes and spikes. Multiple exchanges in the past had similar issues, inciting anger and refund requests from affected customers.\n\nRelated: Deribit to pay users $1.3M after Bitcoin price ‘flash crash’ to $7.7K\n\nIn August 2017, a flash crash on GDAX, now called Coinbase Pro, saw Ether (ETH) prices plummet to as low as $0.1 due to a customer error. Ether was trading at around $300 elsewhere at the time.\n\nUSDC stablecoin peg recovers\n\nUSDC’s value dropped to lows of $0.87 on March 11 after Circle, the issuer of USDC, revealed that it had $3.3 billion exposure to the defunct Silicon Valley Bank (SVB).\n\nUSDC trading pairs have been unstable on other exchanges since the SVB revelations. On March 11, the BTC/USDC pair on Kraken spiked to over $26,000 due to fears about the collapse of USDC.\n\nAt the time, USDC was trading at a 10% discount, which would have priced Bitcoin at around $22,200. However, the spike toward $26,000 indicates that panic causes serious volatility.\n\nThe fears amplified over the weekend due to uncertainty around the fate of SVB depositors. In response, the United States Treasury, Federal Reserve, and Federal Deposit Insurance Corporation decided to bail out the customers of SVB and Signature Bank but not the shareholders and other stakeholders, restoring market confidence for now.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmFsLW1vbml0b3IuY29tL29yaWdpbmFscy8yMDIzLzAzL21ham9yLWJpdGNvaW4tZnJhdWQtY2FzZS1yYXR0bGVzLWVneXB00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Major bitcoin fraud case rattles Egypt - Al-Monitor",
        "content": "March 12, 2023\n\nCAIRO — Egyptian authorities have succeeded this month in partially unraveling one of the largest cases of online fraud in the country to date by arresting the members of a network that established a fake digital currency platform and deceived thousands of people into readily handing over their life’s savings.\n\nThe network was made up of 29 people, including 13 foreign nationals, according to the Egyptian Interior Ministry."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zb2xvLWJpdGNvaW4tbWluZXItZGVmaWVzLW9kZHMtdG8tbWluZS12YWxpZC1idGMtYmxvY2stZ2V0cy0xNTBrLWJsb2NrLXJld2FyZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Solo Bitcoin miner defies odds to mine valid BTC block, gets $150K block reward - Cointelegraph",
        "content": "A solo Bitcoin miner has managed to mine the 780,112th block in the Bitcoin blockchain, receiving a 6.25 Bitcoin (BTC) block reward in return. The estimated value of the payout is over $150,000.\n\nThe solo miner was also lucky to have produced a valid hash after just two days of mining, as the event itself is rare, and it can take months for a solo miner to produce a valid hash.\n\nThe rare event occurred on March 10 and was the 270th solo mined block in Bitcoin’s 13-year-long history. The event is rare because a solo miner of this size usually solves a block, on average, about once every 10 months.\n\nCongratulations to miner39nDQ9BexEBXpRdkHY1z95CaMDEwh6muPW who solved the 270th solo block at https://t.co/UWgBvLkDqc with 6.7PH but doesn't appear to have been mining for very long https://t.co/WGVBC3QajX — Dr. Con Kolivas (@ckpooldev) March 10, 2023\n\nThe miner created a solo mining pool using the Solo CK Pool mining service, for which they produced a valid block hash and were rewarded with 6.25 BTC, with a fee reward of roughly 0.63 BTC.\n\nCon Kolivas, the Solo CK mining pool admin, noted that the miner behind the rare event might have temporarily rented hashing power to produce the output hash.\n\nSolo Bitcoin miner’s output hash. Source: BTC explorer\n\nBitcoin mining requires miners to input computational power to solve and add the next Bitcoin block to the network. However, with the growing popularity of BTC mining and the constant rise in the network hash rate and powerful mining machines, it’s near impossible for a solo miner to solve the whole block on their own.\n\nRelated: How to mine Bitcoin: A beginners guide to mine BTC\n\nThus, a valid block hash is often produced using the computational power of multiple mining rigs, all trying to mine the next block. The block reward is distributed according to the input hash rate of each miner in the mining pool.\n\nThe Solo CK mining pool has been behind several solo-mined Bitcoin blocks in the past as well. Two of these solo-mined blocks came in January 2022, only two weeks apart, with the first occurring on Jan. 11, 2022, at a block height of 718,124, followed by another on Jan. 24, at a block height of 720,175."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL2JpdGNvaW4tc3VyZ2Utc3Zi0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Surges As Spooked Investors Seek Shelter in Crypto, of All Places - Futurism",
        "content": "What the hell is going on?\n\nAll The Way Up\n\nBitcoin is way, way up in spite — or, perhaps, because — of the tumult in the rest of the financial world.\n\nAs Decrypt notes, the cryptocurrency rose nearly 20 percent in value over the last 24 hours alone, with the price currently hovering around $24,000, the highest it's been in over a week.\n\nThe crypto market on the whole shot up $70 million over roughly the same time span, CNBC reports, bringing the market back to over the $1 trillion threshold.\n\nThe surge comes on the heels of regulators shutting down Silicon Valley Bank and crypto lender Signature Bank, as well as the fall of Silvergate Capital, which also lent to the crypto sector.\n\nTo be clear, it's not just a coincidence; these two seemingly opposite trajectories are likely related.\n\nThe SVB withdrawal frenzy and subsequent closure initially lead to a crypto freakout after blockchain companies disclosed their significant holdings in the bank en masse.\n\nBut given the latest news, Bitcoin is emerging as a key player as investors are desperately trying to find new footholds.\n\nSmart Move\n\nAs the dust from the SVB debacle settles, it now appears that crypto has not only found equilibrium but is experiencing a rise in price thanks to regulators setting up an emergency insurance fund to repay Signature and SVB's clients, as CNBC reports, a move that has clearly reassured panicked investors.\n\n\"Given the Fed announcement over the weekend of a backstop for banks and specifically Silicon Valley Bank, markets have turned euphoric knowing that depositors’ money is safe and a major potential bank run has been averted,\" Vijay Ayyar, an executive at the crypto exchange Luno, told CNBC.\n\nThis sort-of-bailout, while unpopular with Wall Street, was intended by regulators to stem the tide of a roiling financial crisis.\n\nFor all intents and purposes, it seems like it's working — at least in the crypto sector.\n\nMore on banking: Bank of America Obsessed With AI, Says It's the \"New Electricity\""
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjE5MjE3L2JpdGNvaW4taHVydGxlcy1iYWNrLWFib3ZlLTIzMDAwLWFzLWNyeXB0by1wcmljZXMtYnVveWVkLWFtaWQtdXMtYmFua2luZy13b2Vz0gF1aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjE5MjE3L2JpdGNvaW4taHVydGxlcy1iYWNrLWFib3ZlLTIzMDAwLWFzLWNyeXB0by1wcmljZXMtYnVveWVkLWFtaWQtdXMtYmFua2luZy13b2Vz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin hurtles back above $23,000 as crypto prices buoyed amid US banking woes - The Block",
        "content": "Cryptocurrency prices have soared over the past day as U.S. President Joe Biden sought to reassure Americans that the country's banking system was safe in the wake of the collapses of Silicon Valley Bank and Signature Bank.\n\nBitcoin jumped 13% by 10:15 a.m. EST to trade above $23,150, according to TradingView data. Ether was up about 12% to over $1,600.\n\n\"With huge respect for the stress and pain the past few days have inflicted on entrepreneurs, employees, treasurers, bankers, and anyone sensing panic in the air, I'll say this bluntly and almost with regret: All this is good for bitcoin,\" wrote Noelle Acheson, former head of market insights at Genesis.\n\nAcheson, reflecting on the macro outlook, said it's now more likely the pace of interest rate increases slows, with an injection of liquidity to prop up banks. She added that bitcoin's value as a decentralized, seizure-resistant store of value has increased significantly as it contrasts with the fragility of traditional banking.\n\nThe Federal Reserve is expected to increase rates again March 22, with an 87% probability of a 25 basis point increase, according to the CME's FedWatch tool that uses the 30-Day Fed Funds futures pricing data.\n\nRELATED INDICES See crypto indices\n\n\"The Fed always follows the fixed income market. The bond market now is demanding that the Fed ease, dramatically,\" Ark Invest founder and CEO Cathie Wood wrote on Twitter. \"Regulators have focused investors on the threat that crypto poses to users, but this weekend turned that theory upside down.\"\n\nAltcoins were also buoyed alongside bitcoin and ether. Binance's BNB added 12%, Cardano's ADA increased 13%, and Polygon's MATIC gained 6%.\n\nCircle's USDC stablecoin jumped over 5% to come back within range of its U.S. dollar peg. The stablecoin de-pegged over the weekend after the firm revealed $3.3 billion of its reserves were held at Silicon Valley Bank. CEO Jeremy Allaire said funds are \"safe and secure,\" and liquidity operations would resume when U.S. banks open today. Coinbase reinstated USDC conversions today.\n\nCoinbase shares gained 4.7% to trade above $55, by 10:15 a.m. EST, according to TradingView data. MicroStrategy added over 9% as it climbed back above $200. Jack Dorsey's Block traded down about 3.8% to above $68."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEzL2JpbmFuY2Utd2lsbC1jb252ZXJ0LTFiLXdvcnRoLW9mLWJ1c2Qtc3RhYmxlY29pbi10by1iaXRjb2luLWV0aGVyLWJuYi1hbmQtb3RoZXItdG9rZW5zL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEzL2JpbmFuY2Utd2lsbC1jb252ZXJ0LTFiLXdvcnRoLW9mLWJ1c2Qtc3RhYmxlY29pbi10by1iaXRjb2luLWV0aGVyLWJuYi1hbmQtb3RoZXItdG9rZW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Binance Will Convert $1B Worth of BUSD Stablecoin to Bitcoin, Ether, BNB and Other Tokens - CoinDesk",
        "content": "Early last week regulators shut down Silvergate Bank, followed by the collapse of Silicon Valley Bank on Friday night – causing markets to go haywire over the weekend as investors rushed to protect their capital."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEzL2ZpcnN0LW1vdmVyLWFzaWEtc2lsaWNvbi12YWxsZXktYmFuay1mYWlsdXJlLWhpZ2hsaWdodHMtc21hbGwtYmFua3MtdnVsbmVyYWJpbGl0eS1iaXRjb2luLXNvYXJzLXBhc3QtMjI1ay_SAZoBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8xMy9maXJzdC1tb3Zlci1hc2lhLXNpbGljb24tdmFsbGV5LWJhbmstZmFpbHVyZS1oaWdobGlnaHRzLXNtYWxsLWJhbmtzLXZ1bG5lcmFiaWxpdHktYml0Y29pbi1zb2Fycy1wYXN0LTIyNWsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "First Mover Asia: Silicon Valley Bank Failure Highlights Small Banks’ Vulnerability; Bitcoin Soars Past $22.5K - CoinDesk",
        "content": "Ether also regained ground to change hands at $1,614, up 9.6% from Saturday, same time. Other major cryptocurrencies that were hard-stricken last week as the impact on the crypto industry from SVB's collapse became apparent also rebounded over the weekend, with their main surge coming on Sunday. APT, the token of layer 1 protocol Aptos, and ADA, the native crypto of Ethereum rival Cardano, were up more than 13% and 11%, respectively. The CoinDesk Market Index, a measure of overall market performance, was down almost 10%."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZ2Fpbi1yZWd1bGF0b3JzLXRha2UtY2hhcmdlL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZ2Fpbi1yZWd1bGF0b3JzLXRha2UtY2hhcmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether gain after U.S. regulators take charge - Forkast News",
        "content": "Bitcoin and Ether gained in Monday afternoon trade in Asia, along with all other top 10 non-stablecoin cryptocurrencies by market capitalization, after U.S. regulators took charge of Silicon Valley Bank and Signature Bank, both with exposure to crypto industry, protecting deposits and confirming that no losses will be borne by the taxpayer.\n\nSee related article: Beware the perils of one-size-fits-all approach to crypto investing\n\nFast facts"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mZWQtc3RhcnRzLXN0ZWFsdGgtcWUtNS10aGluZ3MtdG8ta25vdy1pbi1iaXRjb2luLXRoaXMtd2Vla9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Fed starts 'stealth QE' — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) begins a new week with a bullish surge above $22,000 as the United States Federal Reserve injects liquidity into the U.S. economy.\n\nIn a move which can rival any classic Bitcoin comeback, BTC/USD is up a full 15% off the two-month lows seen on March 10.\n\nThe volatility — and temporary relief for bulls — is due to events in the U.S. after the failure of one bank and the forced shutting of another.\n\nSilicon Valley Bank (SVB) and Signature Bank are the latest victims in a brutal year for financial institutions under the Fed’s rising interest rates — will the trend continue?\n\nDespite Signature being crypto-focused and a major on-ramp from fiat, crypto markets have so far seen no reason to abandon optimism at the prospect of the Fed providing fresh money.\n\nNot everyone believes this constitutes a “pivot” on interest rate hikes or overall policy.\n\nAs the dust continues to settle and news floods in from the ongoing events, Cointelegraph breaks down the main factors moving BTC’s price in the short term.\n\nFed bails out Silicon Valley Bank depositors\n\nThe story of the moment is, of course, the fallout from Silicon Valley Bank (SVB) failing on March 10.\n\nSwallowing hundreds of billions of dollars in deposits, SVB was forced to take a massive $1.8 billion loss thanks to parking consumer funds in mortgage-backed securities, the price of which also suffered during the Fed’s rate hikes.\n\nA snowball effect soon began as depositors became wary that something might be wrong regarding liquidity. Everyone attempted to withdraw from SVB at once, and the funds were unavailable, necessitating the sale of assets at a loss and an emergency funding round which ultimately failed.\n\nThe result has come from the Fed stepping in to backstop depositors’ money. On March 12, it announced the “Bank Term Funding Program” (BTFP).\n\n“Depositors will have access to all of their money starting Monday, March 13,” an accompanying joint statement from the Department of the Treasury, Fed Board and Federal Deposit Insurance Corporation (FDIC) confirmed.\n\n“No losses associated with the resolution of Silicon Valley Bank will be borne by the taxpayer.”\n\n@federalreserve @USTreasury @FDICgov issue statement on actions to protect the U.S. economy by strengthening public confidence in our banking system, ensuring depositors' savings remain safe: https://t.co/YISeTdFPrO — Federal Reserve (@federalreserve) March 12, 2023\n\nAs market commentators were quick to point out, the decision effectively marks a return to Fed liquidity injections — quantitative easing (QE) — whereas before, liquidity was being withdrawn from the U.S. economy.\n\nRisk assets rallied instantly on the news, as increasing liquidity ultimately increases investor appetite for risk.\n\nCrypto was no exception, despite U.S. authorities announcing the sudden closure of Signature Bank in a move that some argue was a direct attempt to stop crypto markets from capitalizing on the SVB aftermath.\n\n“We are also announcing a similar systemic risk exception for Signature Bank, New York, New York, which was closed today by its state chartering authority. All depositors of this institution will be made whole. As with the resolution of Silicon Valley Bank, no losses will be borne by the taxpayer,” the joint statement read.\n\nReacting to the creation of the BTFP, popular commentator Tedtalksmacro described it as a form of “stealth QE.”\n\n“Unofficial quantitative easing begins on Monday. This is so bullish,” part of subsequent Twitter posts added.\n\n“TL;DR the Fed’s balance sheet will expand and that will increase USD liquidity.”\n\nAs Cointelegraph reported, crypto as a whole is highly sensitive to central bank liquidity trends — not just those in the United States.\n\nAmong those underlining this is Arthur Hayes, former CEO of derivatives exchange BitMEX, who, in a blog post earlier in the year, described how changing liquidity conditions would likely impact Bitcoin and altcoin performance.\n\nNow, he was conspicuously bullish.\n\n“Get ready for a face ripping rally in risk assets. MONEY PRINTER GO BRRR!!!” he told Twitter followers about the BTFP in one of several posts on March 12.\n\nSpeculation gathers over Fed interest rate “pivot”\n\nWith liquidity returning to the market, it was not just crypto wondering about the fate of the Fed’s quantitative tightening (QT) policy in place for the past 18 months.\n\nSpeculation was rampant on the day that this month’s decision on interest rate adjustments may yield either a reduction or see the Fed leave the current rate unchanged.\n\nPreviously, markets had been swinging between a 0.25% and a 0.5% increase to the benchmark rate at the March 22 meeting of the Federal Open Market Committee (FOMC).\n\n“In light of the stress in the banking system, we no longer expect the FOMC to deliver a rate hike at its next meeting on March 22,” Goldman Sachs economist Jan Hatzius wrote in a note on March 12, quoted by CNBC and others.\n\nDavid Ingles, the chief markets editor at Bloomberg TV, interpreted the comments as Goldman considering the Consumer Price Index (CPI) a “non event.”\n\nCointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, looked closer to home, noting that the coming week would produce another price catalyst in the form of February’s CPI inflation data.\n\n“'QE' and 'Bailout' for the banks, which means temporary relief + potential good CPI and no more rate hikes (or 25bps) is fuel,” he wrote as part of Twitter comments on March 13.\n\n“Markets now waiting for CPI to give the green light,” popular trading and analytics account Daan Crypto Trades continued.\n\n“If CPI comes in hot we’ll see some chaos as we’d basically have an increasing CPI + Easing Fed. If CPI comes in below estimates I don’t see a reason for the market to hold back.”\n\nMore cautious was Alasdair Macleod, who, in light of the BTFP decision, warned against assuming that the Fed had abandoned QT for good.\n\n“Initial market reaction to banking crisis is based on perceived Fed pivot. But this could be a mistake,” he tweeted.\n\n“Irrespective of Fed monetary policy, contracting bank credit forces up the price of loans, if you can get one. Monitor money markets!”\n\nAccording to CME Group’s FedWatch Tool, overall expectations still favored a further hike rather than a stagnating benchmark rate on March 22. However, 0.5% was off the table.\n\nFed target rate probabilities chart. Source: CME Group\n\nBTC price jumps to $22.7K in blistering comeback\n\nWith that, Bitcoin was clearly bullish during the Asia trading session on March 13.\n\nAhead of the Wall Street open, BTC/USD traded at around $22,100 at the time of writing, having hit local highs of $22,775 on Bitstamp, according to data from Cointelegraph Markets Pro and TradingView.\n\nThe bulk of the recovery from its March 10 lows of under $20,000 came following the Fed liquidity announcement, but this entirely erased any trace of the SVB implosion.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n“Bitcoin recovered from the biggest US bank collapse since 2008... in just 3 days,” popular commentator Bitcoin Archive summarized.\n\nAmong traders, targets remained varied as volatility moved BTC/USD up and down before the opening.\n\nVan de Poppe argued that $21,300 must hold to facilitate a long trade, potentially reaching $23,700.\n\n“22.7K liquidity looks ripe for the taking,” fellow trader Crypto Chase continued.\n\n“For any local longs, stops below 21K should be safe IMO. Back below there wouldn’t make much sense to me if this is going to keep ripping.”\n\nFull-time trader Jackis noted that last week’s low had exactly matched the 0.618 Fibonacci retracement level from the 2023 highs above $25,000.\n\n“No surprise we are pumping off of major monthly support,” Credible Crypto added about current price behavior on 4-hour timeframes.\n\nBitcoin’s weekly close thus came in far higher than expected at more than $22,000. For trader and analyst Rekt Capital, this “likely” put pay to the bearish double top pattern previously playing out on weekly timeframes.\n\n“Weekly Close above $21770 likely invalidates the Double Top,” part of a tweet on March 12 read.\n\nFurther analysis nonetheless gave April as the nearest point that Bitcoin could begin to effect a longer-term trend change.\n\n“Great BTC reaction from ~$20000, the Range Low of this Macro Range,” Rekt Capital wrote.\n\n“As long as ~$20000 holds, $BTC has a chance at challenging the Macro Downtrend in the coming weeks once again At the earliest this April.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nUSDC looks to regain $1 peg\n\nIn what could make investors breathe a sigh of relief this week, an early crypto casualty of the SVB implosion was back in the running on March 13.\n\nUSD Coin (USDC) — the second-largest stablecoin by market cap — had practically regained its U.S. dollar peg at the time of writing.\n\nAfter dipping 20%, USDC traded at $0.99 on Bitstamp, as assurances from issuer Circle helped calm existing panic.\n\nUSDC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nIn a Twitter thread on March 12, CEO Jeremy Allaire confirmed that BNY Mellon and an unnamed new banking partner would take over from where Signature and SVB abruptly left off.\n\n“Trust, safety and 1:1 redeemability of all USDC in circulation is of paramount importance to Circle, even in the face of bank contagion affecting crypto markets,” he added in a press release, praising the actions of the Fed and U.S. lawmakers.\n\nThe largest U.S. exchange, Coinbase, confirmed that USDC conversions would begin on March 13.\n\n“Despite the turbulence we have seen in the traditional banking sector recently, Coinbase continues to operate as usual. At Coinbase all client funds continue to be safe and accessible including USDC conversions which will resume on Monday,” it tweeted.\n\nOther major stablecoins, which had come unstuck in step with USDC, also attempted to regain dollar pegs, with Dai (DAI) at $0.989 and USDD at $0.986.\n\nGiven the changes in stable coins and banks, #Binance will convert the remaining of the $1 billion Industry Recovery Initiative funds from BUSD to native crypto, including #BTC, #BNB and ETH. Some fund movements will occur on-chain. Transparency. — CZ Binance (@cz_binance) March 13, 2023\n\nChangpeng Zhao, CEO of the largest global exchange, Binance, additionally announced the conversion of some of its branded stablecoin, Binance USD (BUSD), to Bitcoin, Ether (ETH) and its in-house BNB (BNB), as part of its existing “Industry Recovery Fund.”\n\n“With nearly $1B untapped, this means the market will have extreme buying pressure soon,” part of a reaction from on-chain data researcher, The Data Nerd read.\n\nSentiment rebounds as “short squeeze” risk rises\n\nIn a reflection of the extent to which crypto market sentiment remains extremely sensitive to macro events, the Crypto Fear & Greed Index returned to “fear” for the first time in two months on March 10.\n\nRelated: Watch these 5 cryptocurrencies for a potential price rebound next week\n\nThe latest events saw a dramatic turnaround, with the Index’s score going from 33/100 to 49/100 — classed as “neutral” — in a single day.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nOn derivatives exchanges, however, bearishness remains. Over the weekend, funding rates hit the lowest since the aftermath of the FTX implosion in November 2022, data from on-chain analytics firm Glassnode shows.\n\n“Longs are being paid to be long,” Tedtalksmacro summarized.\n\nBitcoin futures funding rates chart. Source: Glassnode\n\nOverly negative funding rates have the ability to spark a “short squeeze” — an event where shorts are liquidated en masse in a cascade-like domino effect as the market majority expects the price to continue falling.\n\nCrypto liquidations chart. Source: Coinglass\n\nCross-crypto short liquidations already totaled more than $150 million on March 12 alone, according to data from Coinglass, with the March 13 tally at $39 million.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMTIvc2lnbmF0dXJlLXN2Yi1zaWx2ZXJnYXRlLWZhaWx1cmVzLWVmZmVjdHMtb24tY3J5cHRvLXNlY3Rvci5odG1s0gFjaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDMvMTIvc2lnbmF0dXJlLXN2Yi1zaWx2ZXJnYXRlLWZhaWx1cmVzLWVmZmVjdHMtb24tY3J5cHRvLXNlY3Rvci5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "What the failures of Signature, SVB and Silvergate mean for the crypto sector - CNBC",
        "content": "In this article BTC.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nTwo of the banks that were friendliest to the crypto sector and the biggest bank for tech startups all failed in less than a week. While cryptocurrency prices rallied Sunday night after the federal government stepped in to provide a backstop for depositors in two of the banks, the events sparked instability in the stablecoin market. Silvergate Capital, a central lender to the crypto industry, said on Wednesday that it would be winding down operations and liquidating its bank. Silicon Valley Bank, a major lender to startups, collapsed on Friday after depositors withdrew more than $42 billion following the bank's Wednesday statement that it needed to raise $2.25 billion to shore up its balance sheet. Signature, which also had a strong crypto focus but was much larger than Silvergate, was seized on Sunday evening by banking regulators. Signature and Silvergate were the two main banks for crypto companies, and nearly half of all U.S. venture-backed startups kept cash with Silicon Valley Bank, including crypto-friendly venture capital funds and some digital asset firms. The federal government stepped in on Sunday to guarantee all deposits for SVB and Signature depositors, adding confidence and sparking a small rally in the crypto markets. Both bitcoin and ether are nearly 10% higher in the last 24 hours. According to Nic Carter of Castle Island Ventures, the government's willingness to backstop both banks signifies that it's back in the mode of providing liquidity, rather than tightening, and loose monetary policy has historically proven to be a boon for cryptocurrencies and other speculative asset classes. But the instability once again showed the vulnerability of stablecoins, a subset of the crypto ecosystem investors can typically rely on to maintain a set price. Stablecoins are supposed to be pegged to the value of a real-world asset, such as a fiat currency like the U.S. dollar or a commodity like gold. But unusual financial conditions can cause them to drop below their pegged value.\n\nA lot of crypto's problems in the last year originated in the stablecoin sector, beginning with TerraUSD's collapse last May. Meanwhile, regulators have been homing in on stablecoins in the last few weeks. Binance's dollar-pegged stablecoin, BUSD, saw massive outflows after New York regulators and the Securities and Exchange Commission applied pressure on its issuer, Paxos. Over the weekend, confidence in this sector again took a hit as USDC – the second-most liquid U.S. dollar-pegged stablecoin – lost its peg, dropping below 87 cents at one point on Saturday after its issuer, Circle, admitted to having $3.3 billion banked with SVB. Within the digital assets ecosystem, Circle has long been regarded as one of the adults in the room, boasting close connections and backing from the world of traditional finance. It raised $850 million from investors like BlackRock and Fidelity and had long said it planned to go public. DAI, another popular dollar-pegged virtual currency that is partially backed by USDC, traded as low as 90 cents on Saturday. Both Coinbase and Binance temporarily paused USDC-to-dollar conversions. On Saturday, some traders began swapping their USDC and DAI for tether, the world's biggest stablecoin with a market value of more than $72 billion. Tether's issuing company did not have any exposure to SVB and it's currently trading above its $1 peg as traders flock to safer pastures, even though tether's business practices have been called into question, as have the state of its reserves. The stablecoin market began to rebound as of Sunday evening after Circle released a blog post saying that it would \"cover any shortfall using corporate resources.\" Both USDC and DAI have since shifted back toward their dollar peg. Now that it is clear that SVB depositors will be made whole, Carter tells CNBC that he expects USDC to trade at par.\n\n'The two most bitcoin-friendly banks'\n\nIn the long run, the shutdown of the crypto banking trifecta could present problems for bitcoin , the world's largest cryptocurrency, with a market value of $422 billion. The Silvergate Exchange Network (SEN) and Signature's Signet were real-time payment platforms that crypto customers considered core offerings. Both allowed commercial clients to make payments 24 hours a day, seven days a week, through their respective instant settlement services. \"Bitcoin liquidity and crypto liquidity overall will be somewhat impaired because Signet and SEN were key for firms to get fiat in on the weekend,\" said Carter, who added that he is hopeful that customer banks will step in to fill the void left by SEN and Signet. \"These were the two most bitcoin-friendly banks, supporting the lion's share of fiat settlement for bitcoin trades between trading counterparties in the U.S.,\" wrote Mike Brock in a post on Nostr. Brock is the CEO of TBD at Block, a unit which focuses on cryptocurrency and decentralized finance. Although Carter thinks the Fed stepping in to guarantee depositors of SVB will prevent a larger bank run on Monday, he says it is still dispiriting to see the three largest crypto-friendly banks taken offline in a matter of days. \"There are very few options now for crypto firms and the industry will be strapped for liquidity until new banks step in,\" said Carter. Mike Bucella, a longtime investor and executive in the crypto space, says that many in the industry are pivoting to Mercury and Axos, two other banks that cater to startups. Meanwhile, Circle has already publicly said that it is shifting is assets to BNY Mellon now that Signature bank is closing. \"Near-term, crypto banking in North America is a tough place,\" said Bucella. \"However there is a long tail of challenger banks that may take up that slack.\""
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1iYW5rLWJsb29kYmF0aC1iaXRjb2luLWhpdHMtMjMtN2stYXMtYnRjLXByaWNlLWFuYWx5c3QtY2FsbC1zdmItZGlwLWJlYXItdHJhcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "US bank bloodbath: Bitcoin hits $23.7K as BTC price analyst calls SVB dip 'bear trap' - Cointelegraph",
        "content": "Bitcoin (BTC) hit its highest since the start of the month on March 13 as U.S. bank stocks saw the largest mass halt in history.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nBTC price sees “phenomenal” rebound\n\nData from Cointelegraph Markets Pro and TradingView tracked a thoroughly bullish hourly candle for BTC/USD, which reached $23,725 on Bitstamp.\n\nThe move was eagerly anticipated by market participants, many of whom had warned of extreme volatility at the Wall Street open.\n\n45min into US open, and banks getting halted left, right and centre. By 4pm eastern the Fed Funds might be back at 0%. $XAU $XAG $BTC $ETH is the only way! — Arthur Hayes (@CryptoHayes) March 13, 2023\n\nThis came true, with Bitcoin and altcoins benefiting from intense uncertainty surrounding bank stocks, in particular, as trading got underway.\n\nThe fallout from the failure of two more U.S. banks over the weekend was keenly felt, not just at home but in Europe, where banks also saw heavy losses.\n\n“Massive move of Bitcoin. Now facing next resistance zone (I couldn’t get $21.6K),” Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, reacted.\n\n“Trend is back up, buying the dip on S/R flips seems the game. Resistance around $23.3-23.6K, if it stalls and consolidates -> altcoins should continue.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/Twitter\n\nTrader and analyst Rekt Capital, who previously argued that the monthly candle needed to close to confirm a longer-term trend break, called Bitcoin’s dip below $20,000 the week prior a “bear trap.”\n\n“The way BTC has recovered within such a short space of time just shows that the drop to ~$20000 was a Bear Trap,” he wrote in one of many tweets as BTC/USD hit $23,500.\n\nRekt Capital called the uptick “phenomenal” in further analysis, with 18% added versus the local lows from March 10.\n\nPhenomenal #BTC rebound from the Pi Cycle MA and Monthly Range Low support area$BTC has rallied +18% and is now attempting a breakout from the Range\n\n\n\nIt's been a crazy week in Crypto#Crypto #Bitcoin https://t.co/2bWKwPUlF2 pic.twitter.com/rrG0bsNita — Rekt Capital (@rektcapital) March 13, 2023\n\n“If $22.4k holds as the new floor, that’s all and a bit more that price needs to gain momentum to the Main Resistance in the $24.1k-$25k range and truly break through,” trader Gaah continued.\n\n“We could have more price explosions, watch out in that region.”\n\nGaah shared a liquidity chart from Caue Oliveira, head of research and on-chain analysis at Brazilian crypto insights firm BlockTrends:\n\nBTC/USD annotated chart. Source: Caue Oliveira/Twitter\n\nBank stocks halted as contagion spreads to Europe\n\nOutside crypto, the picture was slowly improving for U.S. stocks — with the exception of some banks.\n\nRelated: Fed starts ‘stealth QE’ — 5 things to know in Bitcoin this week\n\nSome of the worst performers of the day included First Republic Bank, which lost 76% to see trading halted soon after the opening bell.\n\nOverall, as entrepreneur Brian Roemmele noted, more U.S. bank stocks were halted than ever before in history.\n\nFirst Republic slumps more than 60% in US premarket trading as measures taken by US authorities to calm investor concerns failed to provide relief to the regional lender’s shares. (BBG) pic.twitter.com/Jf49izSvcu — Holger Zschaepitz (@Schuldensuehner) March 13, 2023\n\nIn addition to rethinking the likelihood of U.S. Federal Reserve interest rate hikes continuing on March 22, markets meanwhile were also reducing expectations that the European Central Bank would hike by 0.5% this week.\n\nAmong European losses on the day was the already-embattled Credit Suisse, which was down over 7% to new all-time lows at the time of writing.\n\nCredit Suisse 1-day candle chart. Source: TradingView\n\n“The problem for Credit Suisse (and others like it) is that it cannot cover deposit flight by borrowing in money markets. It can only go to the Swiss National Bank, in effect for a second bail out. Will the SNB play ball?” Alasdair Macleod, head of research for Goldmoney, queried.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDMvYml0Y29pbi1vcmRpbmFscy1leHBsYWluZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "[EXPLAINER] What Are Bitcoin Ordinals (NFTs on the Bitcoin Blockchain) and How Do They Work? - bitcoinke.io",
        "content": "Yuga Labs, a popular NFTs creator, has been in the headlines after announcing that they made over $16 million (735.7 bitcoin) from the auction of 300 bitcoin NFTs in the TwelveFold collection.\n\nTwelveFold, whose auction is now complete, is described as a limited edition, experimental collection of 300 generative art pieces inscribed onto Satoshis on the Bitcoin blockchain.\n\n“These pieces represent a complete art project and will not have other utility or interact with or be related to any previous, ongoing, or future Ethereum-based Yuga projects.” – TwelveFold.\n\nOrdinal inscriptions, sometimes referred to as just inscriptions, or just ordinals, are NFTs you can mint directly onto the Bitcoin blockchain and that live on the network. An inscription is created when a file, such as an art image, is written into (inscribed into) units of Bitcoin, called Satoshis.\n\nSatoshis are the smallest individually identifiable units of Bitcoin (100 million Satoshis equals one Bitcoin). Inscriptions, also called digital artifacts, are native to the Bitcoin blockchain and are made possible through the Ordinal Theory Protocol.\n\nOrdinals\n\nThe concept of Bitcoin Ordinals was first proposed in a whitepaper by a team of researchers led by Tadge Dryja in 2019. The idea is to create a new type of transaction that allows users to encode arbitrary data into the Bitcoin blockchain, including metadata related to NFTs. This metadata can include information such as ownership provenance and other attributes that are important for NFTs.\n\nHowever, inscribing bitcoin only became possible thanks to the Taproot upgrade which launched on the Bitcoin network on November 2021 while the Bitcoin Ordinals protocol was only launched in January 2023 by Casey Rodarmor.\n\nBitcoin Ordinals are a way of encoding arbitrary data into Bitcoin transactions, making it possible to store metadata related to NFTs on the Bitcoin blockchain. This metadata includes information such as ownership, provenance, and other attributes that are important for NFTs.\n\nThe Taproot upgrade makes Ordinals possible by:\n\nReducing the costs of data storage on the Bitcoin blockchain by 75%\n\nAddressing the scability problem by reducing the amount of data needed to process each transaction\n\nThe introduction of the ‘MAST’ transaction enables the creation of more complex and flexible smart contracts\n\nImproving the privacy of the network by allow users to hide the details of their transactions from the public\n\nIn order to inscribe an Ordinal however, users are required to run a full Bitcoin node.\n\nOrdinal inscriptions are seen as an improvement to Ethereum NFTs since all metadata is stored off-chain on Ethereum often on the Interplanetary File System (IPFS) – a decentralized file storage, sort of like a blockchain hard drive.\n\nOrdinals essentially enable you to inscribe ‘complete’ data on-chain, hence the term digital artifacts, according to Rodarmor.\n\nThe emergence of Bitcoin Ordinals has caused a significant surge in the usage, fees, and storage space of the Bitcoin Network, as depicted in the chart above. It also represents a major breakthrough for the Bitcoin application tier and can shift the narrative from being solely a ‘store of value’ to more practical use cases.\n\nIf you are interested in buying, selling or trading ordinals, follow these steps:\n\nGo to ordinalswallet.com\n\nClick on ‘Create Wallet’\n\nTake a backup of the recovery phrase for your wallet\n\nSet up a password for wallet access\n\nUse the address of the Ordinals Wallet to send some Sats to the wallet\n\nGo to ‘Collections’ at the top of the page\n\nChoose the ordinals collection and the inscription that you would like to buy\n\nBuy the ordinal (using the Sats in your wallet)\n\nAnother notable project in addition to TwelveFold is the Ordinal Punks, which pays homage to CryptoPunks with a set of 100 Bitcoin NFTs inscriptions on the Bitcoin chain.\n\n_____________________________________\n\nFollow us on Twitter for latest posts and updates\n\nJoin and interact with our Telegram community\n\n_____________________________________\n\n_____________________________________"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTMtbWFyY2gtMjAyMy9hcnRpY2xlc2hvdy85ODYwMjI2My5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTEzLW1hcmNoLTIwMjMvYW1wX2FydGljbGVzaG93Lzk4NjAyMjYzLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin above $22k; crypto market cap crosses $1 trillion - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading higher in Monday's trade following a report of the US government's plans to safeguard all depositors at Silicon Valley Bank,Meanwhile, the global cryptocurrency market cap was trading higher around $1.02 trillion, rising 7.63% in the last 24 hours.Bitcoin (BTC) rose 9.24% to $22,462 whereas Ethereum (ETH) was above the $1,600 level. BTC volume stood at approximately $34.89 billion, rising 39.84% in the last 24 hours.\"The crypto market cap is back above the $1 trillion mark and BTC has surged by over 8% in the last 24 hours and is trading above the $22,300 mark. The positive mood of the market is mainly due to the federal regulators hinting towards recovering Silicon Valley Bank’s customer deposits. The news has uplifted the investor sentiment with a promise of more liquidity in the market,\" Shivam Thakral, CEO of BuyUcoin, said.Other top crypto tokens were also trading higher. Tron jumped by over 15%. Cardano, Litecoin, Shiba Inu, Solana and Dogecoin were also trading with gains.The total volume in DeFi is currently 6.95 billion, 9.10% of the total crypto market 24-hour volume. The volume of all stablecoins is now $77.73 billion, which is 101.82% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $433.23 billion. Bitcoin’s dominance is currently 42.24%, an increase of 0.46% over the day, according to CoinMarketCap.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 50.08, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates a Neutral outlook at 48.72 and the Average Directional Index (14) at 20.77 indicates Buy.\"\"However, the MACD Level (12, 26), at −427.15, indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 61.16 and -36.51 respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 12.19 hours, IST on March 13, 2023)Bitcoin $22,464 9.24%Ethereum $1,608 8.93%Tether $1 -0.67%BNB $303.25 8.19%XRP $0.3688 0.68%Dogecoin $0.0708 6.23%Cardano $0.3407 10.93%Polygon $1.14 7.49%Polkadot $5.93 7.47%Tron $0.06839 15.05%Litecoin $78.10 11.70%Shiba Inu $0.00001088 5.39%Solana $19.75 9.40%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTIvdXNkYy12b2xhdGlsaXR5LWxpZnRzLWJpdGNvaW5zLWNvaW5iYXNlLXByZW1pdW0tdG8tMy15ZWFyLWhpZ2gv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8xMi91c2RjLXZvbGF0aWxpdHktbGlmdHMtYml0Y29pbnMtY29pbmJhc2UtcHJlbWl1bS10by0zLXllYXItaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "USDC Volatility Lifts Bitcoin's Coinbase Premium to 3-Year High - CoinDesk",
        "content": "USDC fell as low as 90 cents late Friday, deviating from its 1:1 dollar peg after its issuer, Circle Internet Financial, confirmed holding $3.3 billion in cash at the crisis-stricken Silicon Valley Bank. The news triggered a rotation of money out of USDC and into other assets, with Circle processing more than $1 billion in net redemptions. At press time, USDC had bounced to around 95 cents."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8xMjMyNjYvdmVyeS1sdWNreS1zb2xvLW1pbmVyLXNvbHZlcy1iaXRjb2luLWJsb2NrLWZvci0xNDhrLXJld2FyZNIBWmh0dHBzOi8vZGVjcnlwdC5jby8xMjMyNjYvdmVyeS1sdWNreS1zb2xvLW1pbmVyLXNvbHZlcy1iaXRjb2luLWJsb2NrLWZvci0xNDhrLXJld2FyZD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "'Very Lucky' Solo Miner Solves Bitcoin Block for $148K Reward - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA solo Bitcoin miner was rewarded for adding block 780,112 to Bitcoin’s blockchain, beating the odds as countless others raced toward the same goal.\n\nThe miner used the Solo CK Pool mining service to establish a solo mining pool, where they produced a valid hash for the block and received a reward of 6.25 BTC and a fee reward of around 0.63 BTC—worth about $148,000—according to BTC.com’s Bitcoin explorer.\n\nA Twitter user pointed out how lucky the solo miner was to produce the valid hash, saying it would typically take a miner much longer to create a valid transaction given the limited computing power they used.\n\nAD\n\nAD\n\n“A miner of this size will solve a block on average about once every 10 months,” Twitter user @ckpooldev stated. “They've only been mining solo for the last 2 days so has been very lucky.”\n\nCongratulations to miner39nDQ9BexEBXpRdkHY1z95CaMDEwh6muPW who solved the 270th solo block at https://t.co/UWgBvLkDqc with 6.7PH but doesn't appear to have been mining for very long https://t.co/WGVBC3QajX — Dr. Con Kolivas (@ckpooldev) March 10, 2023\n\nThe miner worked with an average hashing power of 6.7 PH/s (petahashes per second), according to @ckpooldev. Around the time that the block was added, Bitcoin’s total hash rate was around 308,262 PH/s, meaning the solo miner’s 6.7 PH/s hash rate represented roughly 0.002% of the blockchain’s entire computational power.\n\nAn account on the Bitcoin forum bitcointalk.org stepped forward to claim responsibility for producing the valid hash, saying he rented extra power for less than a day using a service called nicehash.\n\n“Indeed, it is a great luck to catch a block with such a hashrate,” the user titled Pineconeeee stated on the forum. “In less than a day, luck smiled on me.”\n\nAD\n\nAD\n\nThe solo miner, who said they are from Russia, explained that they typically use a computing power of around 270 TH/s (terahashes per second) but rented 5 PH/s (petahashes per second) worth of power last Thursday, according to his post.\n\nThe block mined by the solo miner contained 3,220 transactions that consisted of around 16,940 worth of Bitcoin volume.\n\nIn order to add a block to a proof-of-work network like Bitcoin, miners continuously run calculations to discover a valid hash for the block, using a process akin to computational brute force.\n\nThese days, a majority of new blocks that are added to Bitcoin’s blockchain are mined via mining pools, where miners pool together their computing power to increase their chances of creating a valid hash.\n\nTechnically, it’s possible for a Bitcoin miner to get lucky every now and then and produce a valid hash on their own, despite the competition of other computers racing to calculate a valid hash for the next block on Bitcoin’s network.\n\nAccording to BTC.com, the largest mining pool in the world is currently Foundry USA, a mining pool that comprises around 34% of the total hashrate on Bitcoin's network over the past day. The mining pool’s hashrate is around 107 EH/s (exahashes per second)—around 15,970 times more powerful than the solo miner."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjMyOTUvYmluYW5jZS1zd2Fwcy1idXNkLXN0YWJsZWNvaW4tYml0Y29pbi1ldGhlcmV1bS1ibmLSAVJodHRwczovL2RlY3J5cHQuY28vMTIzMjk1L2JpbmFuY2Utc3dhcHMtYnVzZC1zdGFibGVjb2luLWJpdGNvaW4tZXRoZXJldW0tYm5iP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Binance Swaps BUSD Stablecoin From 'Recovery Fund' to Bitcoin, Ethereum, BNB - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBinance, the world’s largest crypto exchange by trading volume, responded to the latest drama around the USDC stablecoin by converting the remainder of its $1 billion Industry Recovery Initiative funds into Bitcoin (BTC), Ethereum (ETH), and other digital currencies.\n\n“Given the changes in stablecoins and banks, Binance will convert the remaining of the 1 billion Industry Recovery Initiative funds from BUSD to native crypto, including BTC, BNB, and ETH,” Binance CEO Chanpeng Zhao wrote in a tweet early Monday.\n\nBinance launched its crypto industry “Recovery Fund” in November 2022 following the collapse of the FTX exchange. The initiative was aimed “ to help projects who are otherwise strong but in a liquidity crisis.”\n\nAD\n\nAD\n\nGiven the changes in stable coins and banks, #Binance will convert the remaining of the $1 billion Industry Recovery Initiative funds from BUSD to native crypto, including #BTC, #BNB and ETH. Some fund movements will occur on-chain. Transparency. — CZ 🔶 Binance (@cz_binance) March 13, 2023\n\nThe move also comes in the wake of Paxos, BUSD's owner and issuer, being hit by a lawsuit from the United States Securities and Exchange Commission (SEC), with the agency claiming last month that the firm violated investor protection laws. Paxos announced it would halt BUSD minting and \"end its relationship with Binance,\" for the stablecoin.\n\nIt is not immediately clear how much money from Binance's fund has been converted or is earmarked to be converted into the mentioned coins.\n\nThe ETH address shared by CZ shows some substantial transfers over the past few hours, with the original wallet almost emptied at the time of this writing. Transactions are continuing to be executed at the time of writing.\n\nIt's worth noting that last September Binance began auto-converting USDC deposits into its native BUSD—effectively delisting the rival stablecoin.\n\nAD\n\nAD\n\nDecrypt reached out to Binance for additional comments but was yet to hear back by press time.\n\nUSDC regains USD peg\n\nFurthermore, Binance's decision comes hot on the heels of the USDC stablecoin depegging from its intended $1 price.\n\nThe depegging event was triggered by the ongoing crisis surrounding the collapse of the Silicon Valley Bank (SBV), where the firm holds about $3.3 billion.\n\nSilicon Valley Bank was among the 20 largest banks in the U.S. when it failed Friday after a bank run by customers. California state regulators placed the bank under the control of the FDIC, which in turn created a new entity—the Deposit Insurance National Bank of Santa Clara—through which the remaining assets will be managed.\n\nUSDC plummeted to an all-time low of $0.87 on Friday night.\n\nThe collapse of SBV, preceded by the meltdown of the Silvergate Bank, also sent shockwaves through the stock market, while the crypto industry saw a depressing drop as well, with Bitcoin crashing below $20,000 for the first time since mid-January.\n\nIn a separate move, the Federal Reserve moved to shut down the Signature Bank on Monday morning, another crypto-friendly bank with total assets of around $117 billion as of the end of last year.\n\nThe scare, at least for now, appears to be short-lived though: according to a joint statement from the Fed, U.S. Treasury, and FDIC on Sunday, all depositors of now-shuttered Silicon Valley Bank and Signature Bank will be able to get their funds out on Monday.\n\nAD\n\nAD\n\n\"Circle is now out of the woods, which is a huge positive for the crypto world,” Bradley Duke, co-CEO at ETC Group, said in a statement shared with Decrypt.\n\nCircle has meanwhile stated that it will “cover any shortfall” caused as a result of the $3.3 billion in its funds held by the collapsed SBV.\n\nThe Boston-based company also reiterated that USDC is 100% collateralized with cash and U.S. Treasuries.\n\nAccording to the firm, “USDC is currently collateralized 77% ($32.4B) with U.S. Treasury Bills (with a three month or less maturation period), and 23% ($9.7B) with cash held at a variety of institutions, of which SVB is only one.”\n\nThe latest news helped the broader crypto market flip green again, with Bitcoin trading around $22,280 by press time, up 9.1% over the day.\n\nUSDC is changing hands at $0.989, according to CoinGecko."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vaW50ZXJlc3RpbmdlbmdpbmVlcmluZy5jb20vaG93LXRvL3doYXQtaXMtZ3B1LWNyeXB0by1taW5pbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "GPU mining 101: a short guide on crypto-mining using graphics cards - Interesting Engineering",
        "content": "With cryptocurrency ever growing in popularity, many are thinking of ways to make money using cryptocurrency for themselves.\n\nBuying and selling coins on a crypto exchange is one way, but there is another method you could consider; actually “mining” the coins.\n\nBut what is it, and how can you get in on the act?\n\nIf you’re looking into crypto-mining or are entirely ignorant of the process, this short guide should be an excellent stepping stone to getting up to speed on the subject. Here, we’ll try to tell you what you need to know about GPU mining, including its pros and cons.\n\nLet’s get stuck in.\n\nWhat is GPU mining, and how does it work?\n\nGPU mining uses specialized computer hardware called Graphics Processing Units (GPUs) to verify transactions on a blockchain network and earn cryptocurrency rewards by having the GPUs do complicated calculations and solve mathematical algorithms."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8td2Vlay1hdC1hLWdsYW5jZS1iaXRjb2luLWV0aGVyZXVtLWJ1ZmZldGVkLWJ5LW1hcmtldC12b2xhdGlsaXR5L2FydGljbGVzaG93Lzk4NTc3MDQ3LmNtc9IBlgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8td2Vlay1hdC1hLWdsYW5jZS1iaXRjb2luLWV0aGVyZXVtLWJ1ZmZldGVkLWJ5LW1hcmtldC12b2xhdGlsaXR5L2FtcF9hcnRpY2xlc2hvdy85ODU3NzA0Ny5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Crypto Week at a Glance: Bitcoin, Ethereum buffeted by market volatility - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nDuring this week, the global cryptocurrency market experienced a decline as most digital assets saw a decrease in value due to various factors. Bitcoin , which began trading at the US$22,000 level on Monday, dropped to its lowest point since January 2021, reaching US$19,000. Similarly, Ethereum , the second-largest cryptocurrency, also experienced a drop, falling to the US$1,300 level. As a result, both of these cryptocurrencies experienced significant losses in their weekly gains.However, following the release of the US jobs data on Friday, Bitcoin and other cryptocurrencies experienced a rebound, as the US added 311,000 jobs in February, surpassing predictions. Over the past 24 hours, both Bitcoin and Ethereum gained 3%.Investors and traders reacted to the recent statement by US Fed Chair Jerome Powell regarding potential interest rate hikes, resulting in sell-offs and increased concerns over aggressive interest rate policies. However, the decline in the crypto market may also be attributed to uncertainties surrounding Silvergate Bank broadly this week.In November, the bank faced significant withdrawals of $8.1 billion from investors following the FTX incident, leading to a chain reaction of negative consequences, including the sale of debt at a loss of $718 million. The bank's latest financial report showed staggering losses of $1 billion for Q4 and $949 million for the entire year of 2022, in contrast to the $76 million profit recorded in 2021. The bank's announcement of liquidation this week has also significantly impacted the crypto market.On the other hand, during early trading, the stock of Signature Bank (SBNY) experienced a decline of up to 30% due to the impact of Silvergate Bank's collapse on the wider banking industry. Nevertheless, SBNY is recovering from this sudden drop in a volatile market, and now its decline has been reduced to 22%.In an interesting turn of events, according to reports, Amazon is set to launch its own NFT marketplace next month. The marketplace will reportedly be accessible as a tab on Amazon's main website, under the name \"Amazon Digital Marketplace\".Meanwhile, the highly anticipated Shanghai hard fork update for the Ethereum blockchain has been delayed by approximately two weeks. Originally slated for a late March launch, it is now expected to be implemented in early April.The Ethereum network has recently introduced a new feature called account abstraction, which will assist users in recovering their cryptocurrencies in the event that they lose their wallet's private keys. This is just one of several upgrades to the ETH network.Regarding the price action, here is an overview of the best and worst-performing cryptocurrencies among the top 100 by market capitalization during the previous week:Top 5 crypto gainers during the week:1. Kava is up by 18%2. Bone ShibaSwap is up by 8%3. PAX Gold is up by 2%4. UNUS SED LEO is up by 1%5. KuCoin Token is up by 0.53%Top 5 crypto losers this week:1. Dash is down by 28%2. SingularityNET is down by 27%3. Stacks is down by 26%4. Frax Share is down by 25%5. Mina is down by 25%(The author, Edul Patel, is CEO and Co-founder of Mudrex , a global crypto investing platform)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWNhc2gtb3V0cGVyZm9ybWVkLWxpdGVjb2luLWFuZC1ldGhlcmV1bS1jbGFzc2ljLWluLXRoaXMtY2F0ZWdvcnkv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW4tY2FzaC1vdXRwZXJmb3JtZWQtbGl0ZWNvaW4tYW5kLWV0aGVyZXVtLWNsYXNzaWMtaW4tdGhpcy1jYXRlZ29yeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Cash outperformed Litecoin and Ethereum Classic in this category - AMBCrypto News",
        "content": "Bitcoin Cash ranks higher in decentralization than Litecoin and Ethereum Classic.\n\nBCH whales have been reaccumulating during the recent crash.\n\nBitcoin Cash [BCH] has been overshadowed by its more popular counterparts for the major part. Nevertheless, it has managed to retain a sizable following, and it is perhaps the most underrated cryptocurrency as far as decentralization is concerned.\n\nIs your portfolio green? Check out the Bitcoin Cash Profit Calculator\n\nBitcoin Cash happens to be doing quite well on the decentralization front. A higher hash rate is often considered a good measure of decentralization for PoW networks, and it also translates to higher network security.\n\nBCH’s hash rate has been above the 1 EH/s level for the last three months. Its hash rate at press time was as high as 1.78 EH/S.\n\nFor context, 1 EH/S is a million times more than 1 TH/S. Litecoin’s latest hash rate figure came in at 716.06 TH/S while ETC’s hash rate was 107.13 TH/s at press time.\n\nThis means that Bitcoin Cash outperformed Litecoin and Ethereum Classic in terms of hash rate. Despite these findings, Bitcoin Cash’s hash rate is lower than Bitcoin’s 355.37 EH/S hash rate, hence BTC is still king in that regard.\n\nEven so, Bitcoin Cash does have a higher block size than BTC, and this facilitates a higher TPS. This is why, for some, BCH is a more preferable option as a peer-to-peer payment than Bitcoin.\n\nBitcoin Cash price action\n\nBCH is still heavily undervalued compared to BTC yet both have a similar circulation and maximum supply.\n\nBitcoin Cash traded at $114.16 at press time, which represented a 25% discount from February highs. Nevertheless, it still showed a bit of an upside from its current weekly low of $105.05.\n\nBCH’s price action reflects movements in the overall crypto market. But is Bitcoin Cash more likely to achieve a sizable bounce back? So far the recent pivot was underpinned by significant whale accumulation.\n\nHow much are 1,10,100 BCHs worth today?\n\nWhales in the highest address category holding over 1 million BCH have been adding to their balances. The same applies to addresses within the 1,000 to 100,000 BCH category. These addresses increased their holdings since 9 March, hence buying the dip.\n\nDespite the accumulation, addresses within the 100,000 to 1 million BCH category have been contributing to some selling pressure.\n\nThis may explain the limited upside. Bitcoin Cash’s dormant circulation metric indicates that a significant amount of the cryptocurrency exchanged hands during the recent selloff.\n\nOn the other hand, the transaction volume indicated a surge in activity on 9 March. This observation confirmed the influx of buying activity observed when the price bottomed out."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi1ldGhlci1yZWNvdmVyeS1jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1jcnlwdG8tbWFya2V0LWNhcC0zODU1ODc10gF-aHR0cHM6Ly93d3cuZ2FkZ2V0czM2MC5jb20vY3J5cHRvY3VycmVuY3kvbmV3cy9iaXRjb2luLWV0aGVyLXJlY292ZXJ5LWNyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWNyeXB0by1tYXJrZXQtY2FwLTM4NTU4NzUvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether Show Signs of Recovery, Crypto Reclaims Trillion-Dollar Market Cap - Gadgets 360",
        "content": "Bitcoin on Monday, March 13, seemed to be back on the profit-trail after it managed to reel in profits of nine percent to its recently dipped value. The value of Bitcoin climbed to the mark of $22,245 (roughly Rs. 18.2 lakh) over the weekend, after it had dipped to $19,978 (roughly Rs. 16.3 lakh) on March 10 in the backdrop of the Silvergate Bank shutdown last week. The oldest, most expensive cryptocurrency has shown signs of recovery on national as well as international exchanges.\n\nThe market movement of Bitcoin often sets the course for Ether, the second-most expensive cryptocurrency after BTC. On Monday, ETH rose by 8.24 percent to trade at $1,589 (roughly Rs. 1.30 lakh), as per the crypto price tracker by Gadgets 360. In the last two days, ETH has managed to bag $175 (roughly Rs. 14,330) pricewise.\n\n“Most cryptocurrencies rose in the past 24 hours following a report on the U.S. government planning to protect all Silicon Valley Bank (SVB) depositors. The bank collapsed last week after a $42 billion bank run. The decline of this bank could be attributed to Silvergate's shutdown. The news of Federal Regulators saying all depositors in SVB will have access to all funds has relieved investors and traders to a great extent,” Edul Patel, the CEO-Co-Founder of Mudrex told Gadgets 360, explaining the reason behind the market's resurgence.\n\nMost altcoins rallied with gains following Bitcoin and Ether.\n\nThese include Binance Coin, Cardano, Polygon, Solana, and Polkadot, Tron, and Litecoin.\n\nDogecoin and Shiba Inu — both the memecoins minted profits as well.\n\nThe valuation of the global crypto market rose by a significant 7.84 percent over the weekend. The market cap, that stood at $930 billion (roughly Rs. 76,39,468 crore) as of Friday last week, presently stands at $1.03 trillion (roughly Rs. 84,07,967 crore).\n\nStablecoins on Monday, did however, show distorted movements. While USD Coin and Ripple recorded profits, Binance USD and Tether settled with losses.\n\nCircuits of Value, Dogefi, and Bitcoin Hedge joined Husky, Nano Dogecoin, and Doge Killer on the loss-side of the crypto charts.\n\n“The upcoming interest rate hikes by the Fed is expected to be modest after the US labour data for February revealed a slow wage growth. This weakened the value of the US dollar and led to the temporary increase in crypto prices,” Rajagopal Menon, Vice President of India's WazirX crypto exchange told Gadgets 360. “The rising popularity of Bitcoin Ordinals, which are digital assets inscribed on Satoshis, over the last few weeks may have also contributed to the price increase of BTC.”\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nThe Xiaomi 13 Pro has a hefty price tag compared to the company's 2022 flagship model. How does it fare against other high-end phones launched in 2023? We discuss this on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuaW4vZmluYW5jZS9iYW5rcy9uZXdzL292ZXItNzAtYm4td2lwZWQtb2ZmLWdsb2JhbC1jcnlwdG8tbWFya2V0LWJpdGNvaW4tZHJvcHMtYmVsb3ctMjAwMDAvYXJ0aWNsZXNob3cvOTg2MDU4NzYuY21z0gGSAWh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5pbi9maW5hbmNlL2JhbmtzL25ld3Mvb3Zlci03MC1ibi13aXBlZC1vZmYtZ2xvYmFsLWNyeXB0by1tYXJrZXQtYml0Y29pbi1kcm9wcy1iZWxvdy0yMDAwMC9hbXBfYXJ0aWNsZXNob3cvOTg2MDU4NzYuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Over $70 bn wiped off global crypto market, Bitcoin drops below $20,000 - Business Insider India",
        "content": "Over $70 bn wiped off global crypto market, Bitcoin drops below $20,000"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vdGVjaC5oaW5kdXN0YW50aW1lcy5jb20vdGVjaC9uZXdzL3R1Z29md2FyLWJldHdlZW4tbmV3Ymllcy1jcnlwdG8tMS1rZWVwcy1iaXRjb2luLXByaWNlLXJhbmdlYm91bmQtNzE2NDcxOTE4ODkzOTAuaHRtbNIBggFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL2FtcC90ZWNoL25ld3MvdHVnb2Z3YXItYmV0d2Vlbi1uZXdiaWVzLWNyeXB0by0xLWtlZXBzLWJpdGNvaW4tcHJpY2UtcmFuZ2Vib3VuZC03MTY0NzE5MTg4OTM5MC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Tug-of-war between newbies, crypto 1% keeps Bitcoin price range-bound - HT Tech",
        "content": "Like the little Coinbase QR code that bounced around within the outlines of your TV during the Super Bowl, Bitcoin price has been stuck in a stubborn trading range for months. Some market-watcher have a theory as to what might be going on.\n\nConsider this explanation: long-term investors are wading in whenever prices fall, according to Brett Munster at Blockforce Capital. “This group of market participants have been repeatedly willing to step in and accumulate coins at these lower prices, thus setting a floor for Bitcoin over the past couple months,” he wrote.\n\nOn the other hand, short-term holders are underwater as long as Bitcoin stays below $47,000, and most are currently holding their coins at a loss. “Every time we start to approach that mark, there appears to be increased sell pressure likely caused by those investors excited to simply get their initial investment back,” Munster, who analyzed Glassnode data, said.\n\nThe result? Bitcoin's been clinging to a range between $32,000 and $47,000, which is proving tricky to break out of.\n\nMatt Maley, chief market strategist at Miller Tabak + Co., has noticed the trend too. “The long-term players are keeping a bid under the market,” he said. “However, a lot of people who bought Bitcoin last year are underwater. They seem to be using every bounce as an opportunity to take some chips off the table with so much uncertainty surrounding its ability to become a hedge against inflation.”\n\nCryptocurrencies, like many other risk assets, have lost their luster in recent weeks as global central banks start to lift interest rates and Russia's war on Ukraine stirs all manner of anxiety. Bitcoin, the largest digital asset by market value, has lost 15% since the start of the year and is down roughly 40% since its November record high.\n\nChris Gaffney, president of world markets at TIAA Bank, says there's one cohort of crypto investors who bought the coin a long time ago, they've seen tremendous gains and they don't trade or sell it.\n\n“Those that bought it cheap and are sitting on big gains are just going to sit on it,” he said by phone. “But then the traders, if they bought cheap and it's run up, they sell and they keep it within that range.”\n\nCrypto prices have for the most part mirrored moves of the U.S. stock market, where consternation over the war in Ukraine, diminishing growth prospects and skyrocketing commodities prices are blunting sentiment. Investors have pruned many of their riskier bets, including in digital-asset markets, though a long-awaited crypto executive order from the Biden administration was celebrated on Wednesday with a big rally.\n\nBut despite the better-than-expected news around the executive order, “crypto spot performance overall remains somewhat directionless,” wrote David Duong, head of institutional research at Coinbase Global Inc. He cites the Ether-Bitcoin crossrate, which has continued to trend lower and “which we often use as a risk barometer for crypto assets more broadly,” he said. “What it seems to be telling us is that risk appetite away from the perceived ‘safe havens' of the asset class is still somewhat low.”\n\nMeanwhile, Kraken is seeing buying interest from both retail and institutional investors, according to Juthica Chou, head of OTC options trading at the crypto exchange. Some more-active institutional investors might be making opportunistic moves. “These moves, when you're up 8%, down 8% present a lot of opportunity,” she said on Bloomberg's “QuickTake Stock” broadcast. “On the other side are some of the institutions that are accumulating over time and are looking at some of these entry points.”\n\nThere's been a lack of catalysts to drive further investments into the space, Chou added. While some investors are coming in now, there's still a lot of global uncertainty so some participants will hold their money in cash until there's a positive catalyst."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC93aHkteW91LXNob3VsZC1idXktYml0Y29pbi1hbmQtZXRoZXJldW0taW4tdGhlLWJlYXItbWFya2V0LWFuZC1hbHNvLWxvb2stYXQtbG93LXJpc2staW52ZXN0bWVudHMtbGlrZS1zaWdudXB0b2tlbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Why You Should Buy Bitcoin And Ethereum In The Bear Market, And Also Look At Low-Risk Investments Like ... - Analytics Insight",
        "content": "Welcome to the world of cryptocurrencies, where getting into the market is like strapping yourself on a rollercoaster ride. But fear not, my fellow crypto enthusiasts! In this article, we will discuss why buying Bitcoin (BTC), and Ethereum (ETH) during the bear market can actually be a good thing. Plus, we’ll introduce you to a new crypto project called SignupToken that might just make you a millionaire.\n\nThe Bear Market: A Chance to Buy Low\n\nRemember that old saying, “buy low, sell high”? Well, that applies to crypto too. When the market is in a bearish state, prices are low, making it the perfect opportunity to invest in Bitcoin and Ethereum. Sure, it might be tempting to wait until the market turns bullish again, but by then, prices will be higher, and you’ll have missed out on potential gains.\n\nHODL: A Crypto Mantra\n\nHODL (hold on for dear life) is a term coined by a crypto enthusiast who misspelt “hold” in a forum post. But the term has taken on a life of its own and has become a crypto mantra. The idea is to buy Bitcoin or Ethereum and hold it for the long term, despite market fluctuations. This strategy has worked well for many crypto investors, and it could work for you too.\n\nSignupToken: The New Crypto Project That Could Make You a Millionaire\n\nSignupToken is a brand new cryptocurrency that is trying something new in the space. When it reaches 1 million signups, they will launch the token directly into cryptocurrency exchanges, and you will be the first to hear about it. They are looking to create 1 million millionaires, and you could be one of them!\n\nThe concept is simple – sign up for free with your email address, and you’ll receive information on the launch date. There’s nothing to lose, and being one of the first to invest when it launches could provide big profits. Plus, the token launch will happen directly on crypto exchanges, eliminating any worries about scams or frauds.\n\nLow Risk, High Reward\n\nThe beauty of SignupToken is that it offers a low barrier to entry for first-time crypto investors. Signing up takes only a minute, and there’s no cost to become involved. It could be a game-changer for those who have been hesitant to dip their toes into the crypto waters. And let’s face it, who doesn’t love a good low-risk, high-reward opportunity?\n\nOne thing to keep in mind is that the success of SignupToken could lead to significant media attention, increasing the token’s value if it does launch. It’s a project worth keeping an eye on, especially if you’re looking for a low-risk investment that could pay off big.\n\nTo Conclude\n\nThe crypto market can be daunting, but by taking advantage of the bear market and holding onto your investments for the long term, you could see significant gains. And if you’re feeling adventurous, give SignupToken a shot. It’s free to sign up, and who knows – you might just become one of the 1 million millionaires they’re aiming to create!\n\nFollow the Link For More Information on Sign Up Token!\n\nWebsite: www.signuptoken.com\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4td2lucy1oZWFydHMtYXMtYml0Y29pbi1hbmQtZXRoZXJldW0ta2VlcC1icmVha2luZy1tb3JlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Big Eyes Coin Wins Hearts as Bitcoin and Ethereum Keep Breaking More - Analytics Insight",
        "content": "The week hasn’t been one of roses and sunshine for investors betting on Bitcoin and Ethereum, but for Big Eyes Coin lovers, the honeymoon phase has only just begun.\n\nOn a whole, the market has not been doing well all week, with more reds than greens in what people are describing as a delayed reaction to the series of news affecting the crypto scene of late. Bitcoin has fallen back to $22k after much anticipation that it would hit $25k by the end of this quarter, and Ethereum hasn’t fared much better with its current price of $1.5k.\n\nBIG, on the other hand, is unaffected as it continues to enjoy a successful presale journey and expand on its popularity and appeal.\n\nBig Eyes Sets A New Pre-sale Record\n\nBig Eyes has a large and unified following, contributing to the presale sales of $31.24 million. The coin has achieved the most amazing presale in the last two years, making history in the process. Due to the success of its presale, the team is offering intriguing rewards.\n\nIn addition to the exciting loot boxes that have been released, the meme coin has just introduced a vault pin that allows users to get up to 5,000% extra BIG tokens when they buy a loot box. When making a purchase, one is required to enter the pin, which is 819.\n\nThe Excali-Paw Chest, which costs $100,000, was just revealed one week ago as a new loot box that may enable one to win up to $1 million worth of Prizes.\n\nThe other boxes are the Saver tin, which costs $100, the Cute Box goes for $1,000, the Kitty Vault – $5,000; and the Saiyan box for $10,000.\n\nThe loot boxes are safe compared to any dangerous endeavour because everyone is guaranteed to receive at least a portion of what they put in. Less is not an option; only equal to or greater is.\n\nHas Bitcoin Hit A Wall?\n\nThroughout the previous 24 hours, the price of Bitcoin has remained stable at just above $22,000. Despite this, the largest digital asset is still up by roughly one-third in 2023 thanks to its early-year gain, but Bitcoin has already dropped below its recent peak of $25,000.\n\nThe $23,000 to $24,000 area, which had reigned for all of February, was also decisively thrown in the rear-view by a severe selloff this week, wiping out optimistic traders who were relying on Bitcoin’s recovery into a new bull market after a terrible 2022.\n\nWhile investors try to stay optimistic, many are wondering if BTC hasn’t hit a wall in its ascent and is unable to push through.\n\nEthereum price goes down\n\nSince June 2022, the value of Ether (ETH), the native token of Ethereum, has increased by 78%. Yet, this does not ensure additional gains, especially given that dropping trade volumes indicate a strong likelihood of a significant correction.\n\nThe trading volume tracks activities around the buying and selling of the coin. This is usually an indication of how well the coin is doing or not doing. In the last 24 hours, ETH fell by 0.42%, and this has been the consistent pattern all week.\n\nIt is currently selling for $1,556.43 USD with a 24-hour trading volume of $6,769,307,144 USD as of the time of this writing.\n\nIt still remains number 2 on the crypto chart with a live market cap of $190,465,827,618 USD.\n\nClick below for more on Big Eyes Coin:\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNpdHlhbS5jb20vaGF2ZS11cy1nb3Zlcm5tZW50LXJlZ3VsYXRvcnMtYW5kLWZlZGVyYWwtcmVzZXJ2ZS1qdXN0LXJlaWduaXRlZC1iaXRjb2luLWJ1bGwtbWFya2V0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Have US government, regulators and Federal Reserve just reignited Bitcoin bull market? - CityAM - City A.M.",
        "content": "Have US government, regulators and Federal Reserve just reignited Bitcoin bull market?\n\nThis was never meant to happen. Financial regulators, the US Treasury Secretary, and the US central bank appear to have kick started the next Bitcoin bull market.\n\nOn Sunday night, regulators announced a joint statement from the Treasury Secretary, Janet Yellen, the Federal Reserve chair, Jerome Powell, and the Federal Deposit Insurance Corporation (FDIC) chair, Martin Gruenberg that emergency measures were to be rolled out to stem potential contagion from the collapse of Silicon Valley Bank, the 16th largest US bank.\n\nThe measures include ensuring that depositors with the failed bank would have access to all their money on Monday morning. Banks will also now be permitted to borrow essentially unlimited amounts from the Fed for the next year, in order to stop financial institutions from having to sell those investments that have been losing value because of the Fed’s aggressive interest rate hike agenda.\n\nThese are truly extraordinary actions taken by the authorities as they try to contain the fallout of the largest bank failure since the 2008 financial crash.\n\nBut in what is a masterclass in the law of unintended consequences, these extraordinary actions to help shore-up the traditional banking sector have also been the trigger for a crypto price recovery.\n\nThe crypto market on Friday crashed under $1 trillion, down almost $200 billion since the beginning of March, amid concerns about what the collapse of Silvergate means for the sector and wider macroeconomic issues putting on the pressure. Bitcoin fell below the $20,000 level, shedding almost 10% over the 24-hour period. Meanwhile, Ethereum dropped 9%, and the rest of the top ten echoed the trend.\n\nHowever, just three days after the start of a major bank crisis, crypto prices have rebounded and are almost back where they were at the beginning of last week.\n\nThere are two reasons why the SVB measures seem to have helped to boost crypto prices.\n\nFirst, the SVB rescue package from the Fed is essentially a new form of quantitative easing (QE), the bond-buying programme used by governments around the world to stabilise the financial system after the 2008 crash and later the pandemic.\n\nQE increases the money supply, which reduces the purchasing power of traditional currencies and pushes investors to look for alternative investments such as Bitcoin, which has a limited supply, and becomes more attractive as a store of value and a hedge against inflation.\n\nAnd second, it is now doubtful that the Fed, the world’s de facto central bank, will continue with its plan for aggressive interest rate hikes. The next hike was widely expected on March 22 following robust jobs data in January and February.\n\nWe expect the stress in the banking sector, and the wider impact on confidence, now will give the central bank cause for pause on its rate hike program – which is bullish for Bitcoin.\n\nLower interest rates make borrowing cheaper, which can lead to increased spending and investment, which could lead to increased demand for the world’s largest crypto as investors seek alternative assets with potential for higher returns.\n\nIn addition, as interest rates begin to come down, investors may be less likely to hold onto traditional safe-haven assets like bonds, and instead may look for higher-return investments like stocks or cryptocurrencies.\n\nFor many people, Bitcoin now seems more unstoppable and resilient than ever.\n\nThe banking sector crisis and the emergency measures being implemented by the US government to quell fears of contagion only appear to have fuelled investors’ optimism in crypto as the future of money."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZmluYm9sZC5jb20vcm9iZXJ0LWtpeW9zYWtpLXVyZ2VzLWJ1eWluZy1iaXRjb2luLWFzLW1vcmUtZmFrZS1tb25leS10by1pbnZhZGUtc2ljay1lY29ub215L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Robert Kiyosaki urges buying Bitcoin as 'more fake money to invade sick economy' - Finbold - Finance in Bold",
        "content": "After three major banks headquartered in the United States – Signature Bank, Silicon Valley Bank (SBV), and Silvergate Bank – all collapsed within a short period, Robert Kiyosaki warned about government bailouts and recommended buying more Bitcoin (BTC).\n\nSpecifically, Kiyosaki, who is the author of the best-selling personal finance book ‘Rich Dad Poor Dad,’ made projections that “more fake money” would “invade sick economy” as the bailouts begin in response to the major crisis in the finance industry, according to his Twitter post published on March 13.\n\nBAIL OUTS begin. More fake money to invade sick economy. Still recommend same response. Buy more G, S, BC. Take care. Crash landing ahead. — Robert Kiyosaki (@theRealKiyosaki) March 13, 2023\n\nAs a reminder, the author had previously heavily criticized fiat currencies, such as the United States dollar, calling it fake money that would contribute to the “end of the American Empire,” and has now again urged everyone to purchase more Bitcoin, gold, and silver as the alternative, as he reiterated his earlier warnings of an upcoming “crash landing.”\n\nMeanwhile, Treasury Secretary Janet Yellen has ruled out the possibility of a federal government bailout for SVB’s investors, citing the lessons learned and reforms introduced after the previous financial crisis, but she also said that regulators were “concerned” about depositors and were working to meet their needs.\n\nBleak predictions\n\nIn late January, Kiyosaki warned about a “rough landing” for the world, led by the soaring “bad news, bankruptcy, unemployment, homelessness,” and retirement crisis, while simultaneously touting the “good news” in the form of “bargains everywhere, gold, silver, Bitcoin priceless.”\n\nIn mid-February, he made gloomy predictions of a “giant crash coming” and warned of a likely “depression,” as the Federal Reserve was “forced to print billions in fake money,” again praising gold, silver, and Bitcoin as the alternatives, predicting the maiden cryptocurrency could reach the price of $500,000 by 2025.\n\nHe also warned about the starvation and the resulting social unrest that could follow this major financial crash, as well as expressing concern that the rising inflation would “wipe out 50% of the U.S. population,” as Finbold reported back in April 2022.\n\nFeatured image via Ben Shapiro’s YouTube."
    }
]