[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMjgvYml0Y29pbi10cmFkZXJzLXJlbWFpbi1mZWFyZnVsLW9mLXRhaWwtcmlzay1hbWlkLXJlbmV3ZWQtcHJpY2UtbHVsbC1vYnNlcnZlcnMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8yOC9iaXRjb2luLXRyYWRlcnMtcmVtYWluLWZlYXJmdWwtb2YtdGFpbC1yaXNrLWFtaWQtcmVuZXdlZC1wcmljZS1sdWxsLW9ic2VydmVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Traders Remain Fearful of 'Tail Risk' Amid Renewed Price Lull: Observers - CoinDesk",
        "content": "Ardern said the tail risk will likely remain higher in the lead-up to Friday's U.S. nonfarm payrolls report. Per Wall Street Journal, the data is likely to show the U.S. economy added 200,000 jobs last month following June's 209,000 additions, resulting in the jobless rate holding steady at 3.6%."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA4LTI3L2JpdGNvaW4tcy1lbmVyZ3ktdXNhZ2Utb2ZmZXJzLWEtbGVzc29uLWZvci1haS1zLWZ1dHVyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin's Energy Usage Offers a Lesson for AI's Future - Bloomberg",
        "content": "Surging interest in artificial intelligence systems will add further strain to global electricity grids with the potential to rival the massive energy consumption of Bitcoin. Thankfully, the premier cryptocurrency has shown us a way to mitigate the impact.\n\nA doubling of data-center revenue at Nvidia Corp. last quarter shows that demand for generative applications like ChatGPT hasn’t yet hit its peak. The US chipmaker is the key provider of shovels in this AI goldrush, but those processors are neither cheap nor lean. Its latest flagship, the GH200 Grace Hopper Superchip, which is the size of a postcard, draws up to 1,000 watts — equivalent to a portable heater."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oYXNoZGV4LWpvaW5zLXJhY2UtZm9yLXNwb3QtYml0Y29pbi1ldGYtd2l0aC11bmlxdWUtc3RyYXRlZ3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 26 Aug 2023 07:00:00 GMT",
        "title": "Hashdex joins race for spot Bitcoin ETF with unique strategy - Cointelegraph",
        "content": "Crypto asset management company Hashdex has joined the competition for a spot Bitcoin (BTC) exchange-traded fund (ETF) in the United States. The firm has submitted an application to the U.S. Securities and Exchange Commission (SEC) for a Bitcoin futures ETF that will hold spot Bitcoin.\n\nETFs are investment funds that trade on a stock market, with their value derived from an underlying basket of assets such as stocks, bonds, commodities and other financial instruments. Similarly, Bitcoin ETFs track BTC’s value and trade on traditional stock exchanges rather than crypto exchanges.\n\nHashdex’s approach differs from recent filings as it won’t depend on the Coinbase surveillance sharing agreement, opting to acquire spot Bitcoin from physical exchanges within the CME market. According to a 19b-4 filing by NYSE Arca with the U.S. SEC, Hashdex intends to include spot Bitcoin in its Bitcoin futures ETF and modify the name, changing its ticker to Hashdex Bitcoin ETF.\n\nBreaking: NYSE files a modification to another ETF, to be now called the Hashdex Bitcoin ETF\n\n\n\nTheir application is unique in that it will not use Coinbase, they will use prices and acquire spot BTC via CME.\n\n\n\nIt will hold a mixture of spot & futures positions\n\nHard to reject imo pic.twitter.com/K1ABKKZX5o — Alistair Milne (@alistairmilne) August 25, 2023\n\nSome experts have responded to Hashdex’s unique Bitcoin ETF filing. James Seyffart, an analyst at Bloomberg, observed that the strategy involves exclusively conducting exchange for related positions transactions. This entails swapping futures contracts for an equivalent spot exposure instead of direct cash purchases from exchanges.\n\nSeyffart anticipates a higher likelihood of SEC approval, considering the pressure on Gary Gensler stemming from the Grayscale lawsuit, Ethereum futures submission, and BlackRock’s incorporation of the Coinbase surveillance sharing agreement.\n\nRelated: Former Binance​.US CEO joins Hashdex board\n\nOther specialists, including Nate Geraci, president of The ETF Store, investor Alistair Milne and finance attorney Scott Johnsson, have responded to Hashdex’s distinctive Bitcoin ETF submission. They believe it could alleviate certain worries of the SEC regarding Bitcoin market manipulation and liquidity.\n\nThe SEC and its Chair, Gary Gensler, have not commented on the spot Bitcoin ETF applications, the influx of Ethereum ETFs and the potential approval of a spot Bitcoin ETF within this year.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vb2lscHJpY2UuY29tL0VuZXJneS9FbmVyZ3ktR2VuZXJhbC9CaXRjb2luLU1pbmVycy1Mb29rLVRvLUNvYWwtQXNoLUFzLVBvd2VyLURlbWFuZC1TdXJnZXMuaHRtbNIBamh0dHBzOi8vb2lscHJpY2UuY29tL0VuZXJneS9FbmVyZ3ktR2VuZXJhbC9CaXRjb2luLU1pbmVycy1Mb29rLVRvLUNvYWwtQXNoLUFzLVBvd2VyLURlbWFuZC1TdXJnZXMuYW1wLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Look To Coal Ash As Power Demand Surges - OilPrice.com",
        "content": "The Bitcoin market has had a wild ride over the past year. Prices have plummeted, sharply recovered, and then plummeted again over the last ten months, and the future is uncertain for cryptocurrencies overall in the context of an ambivalent regulatory and policy landscape. Amidst all the chaos, one thing about Bitcoin has been steady since the beginning: its ever-expanding energy use and resulting carbon footprint.\n\nThe cryptocurrency world has been in crisis recovery mode since the downfall of FTX, one of the largest cryptocurrency exchanges in the world, toward the end of last year. Since then, regulatory bodies around the world have escalated a crackdown on digital currency firms, while other sectors worried about “crypto contagion” leading to a widespread economic fallout. Despite the extreme crypto-anxiety and price volatility of the last year, however, Bitcoin has managed an impressive rebound, recently staying steady at about $26,000 – for now. But just when things have been looking up, crypto markets took an unexpected dive this week, and experts suggest that there may be another crash coming in September.\n\nDespite the volatility, Bitcoin’s energy use is at an all time high – and so are its carbon emissions. According to the Bitcoin Electricity Consumption Index, created and maintained by the University of Cambridge, Bitcoin’s estimated network power demand is currently clocking in at around 16 gigawatts, or about 138 TWh per year – approximately the equivalent of the entire country of Pakistan, home to 231.4 million people.\n\nThe issue is the way that Bitcoins are mined. As more and more miners try to produce Bitcoins through solving complex proof-of-work problems, the problems get increasingly difficult to solve, thereby requiring more and more computing power to produce the same amount of Bitcoin. This is done to prevent the depression of the currency's value – in order to maintain a steady currency, each Bitcoin is designed to take about ten minutes to mine, no matter how much computing power is thrown at it. For this reason, it now takes about 9 years’ worth of household electricity to mine a single Bitcoin, whereas in 2009, it required just a few seconds’ worth.\n\nThis isn’t just an issue for the environment, it's also an issue for Bitcoin miners, who have to secure more and more energy to keep their Bitcoin mining operations afloat. For this reason, lots of Bitcoin miners are trying to get more creative with sourcing cheap energy or energy industry byproducts, employing innovative approaches such as setting up in poor countries with heavily subsidized energy prices or using energy that would otherwise be wasted, such as coal ash – and natural gas vented during drilling on oilfields.\n\nCoal ash, in particular, has been touted by some as a potentially elegant solution to some of Bitcoin’s problems. It makes use of a byproduct that poses an environmental and health problem to the communities where it has been dumped and stored, and in doing so, recovers that land for other more productive uses. One of the biggest proponents of this approach is Stronghold, a publicly traded bitcoin mining firm operating in Pennsylvania, where coal ash is a readily available commodity thanks to widespread coal usage for steel production, among other uses, not to mention an ongoing environmental woe. Stronghold is “vertically integrated” as a Bitcoin company, with ownership of its own energy sources as well as its mining rigs. Those energy sources are two coal ash sites with a combined capacity of 165 MW.\n\nWhile Stronghold presents the plan as a win-win for bitcoin and for the environment, however, critics argue that it’s not actually such a clean solution. While coal ash does need to be cleaned up and processed, environmentalists argue that burning coal ash is not a good option, as it creates considerable greenhouse gas emissions. Put simply, it just moves the coal ash pollution from the ground to the air.\n\nAnd the issue is not just the irresponsible use of waste coal, it's the increasing demand for energy generated from fossil fuels in general. In a number of locations, we’ve already seen Bitcoin operations extending the life and spiking the emissions of coal and gas plants that were already on track to be shut down. A recent report from US NGO Global Energy Monitor found that all coal plants worldwide need to be shuttered by 2040 or face ‘climate chaos’. The threat that the coal-powered Bitcoin trend poses to decarbonization pathways is considerable and is increasingly garnering attention. New York recently imposed a 2-year moratorium on new permits for fossil fuel plants seeking to mine cryptocurrencies. While New York has acted swiftly to protect its climate goals, it is an outlier.\n\nBy Haley Zaremba for Oilprice.com\n\nADVERTISEMENT\n\nMore Top Reads From Oilprice.com:"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMjcvYml0Y29pbnMtbW9zdC1mYWl0aGZ1bC1hcmUtc3RheWluZy1wdXQtZGVzcGl0ZS10aGUtY3J5cHRvLW1hcmtldHMtcmVjZW50LXdlYWtuZXNzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin's most faithful are staying put despite the crypto market's recent weakness - CNBC",
        "content": "Even after a big correction, which followed weeks of almost complete inactivity, and a new focus on real rates, bitcoin's most patient investors are still holding onto their coins. The cryptocurrency closed at $25,972.52 on Friday and lost 0.25% for the week – its eight negative week in the past nine, according to Coin Metrics. It had posted an 11% decline for the previous week. Coin Metrics measures a week in crypto, which trades 24 hours a day, from the 4:00 p.m. ET stock market close one Friday to the next. Bitcoin had been almost completely inactive for several weeks leading up to its violent sell-off on Aug. 17 and many investors expected any of several tailwinds the market has been monitoring to eventually push its price higher. Instead, inflation updates and the possibility of more rate hikes have brought more uncertainty into crypto. \"There is uncertainty ahead, and the Fed will act if inflation data warrants it,\" Oppenheimer's Owen Lau said following Federal Reserve Chair Jerome Powell's speech in Jackson Hole, Wyoming , Friday. \"The part that could upset the crypto market is if interest rates stay higher for longer, which disappoints the expectation that the rate could be lowered in the first half of 2024. Until the Fed sees a sustained progress, not just the inflation reaches 2%, it appears that the Fed will continue to be restrictive.\" Nevertheless, the market has appeared relatively calm. The August dive was the biggest one-day sell-off since the height of the FTX fallout in November. However, an Indicia Labs analysis of social media chatter about crypto shows sentiment only dipped into neutral territory from positive seven full days after the price drop. That decline pales in comparison to the drop that took place in November, when sentiment dropped from positive to neutral in the days leading up to the crash, and slid into \"very negative\" territory four days later. \"There hasn't really been a big change in fundamentals,\" said Gustavo Schwenkler, associate professor at the Leavey School of Business at Santa Clara University and cofounder of Indicia Labs. \"Right now what's really happening is people are just waiting it out. We don't know what's going to happen with the SEC or if there will be new policies potentially. It's been unclear where crypto is going to go in the U.S.\" from a regulatory perspective. On top of the regulatory overhang, JPMorgan said Thursday the bitcoin correction could be \"partly attributed to the broader correction in risk assets such as equities and in particular tech, which in turn appear to have been induced by frothy positioning in tech, higher U.S. real yields and growth concerns about China ,\" but that it \" sees limited downside for crypto markets over the near term.\" Trading data also shows long-term investors haven't been easily shaken by the recent weakness. Investors that have held on to their bitcoin for a year or longer, now make up nearly 70% of bitcoin holders, according to Glassnode. The newest group of long-term holders — specifically, those who have held their bitcoin for one to two years — have fallen (36%) since the beginning of the year, but the number of people who bought between two and three years ago has grown (85.8%). \"The number and percentage of bitcoins that have been held for greater than a year is hovering near all-time highs. This tells us that despite the price volatility and recent downdraft in prices, long-term holders are unwavering. This fact, combined with next April's reward halving, may be the springboard for higher prices in the future,\" Greg Cipolaro, global head of research at NYDIG, the crypto subsidiary of Stone Ridge Asset Management, told CNBC. He added that while it's unclear what exactly accounts for traders' resilience, maturing crypto investors are becoming more \"aware of the cycles associated with bitcoin's halving and are expecting it to repeat, leading to price appreciation.\" —CNBC's Michael Bloom and Nick Wells contributed reporting."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL3doYXQtZG9lcy1hLWJpdGNvaW4tbG9vay1saWtlLWFsbC15b3UtbmVlZC10by1rbm93L9IBUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL3doYXQtZG9lcy1hLWJpdGNvaW4tbG9vay1saWtlLWFsbC15b3UtbmVlZC10by1rbm93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "What Does a Bitcoin Look Like? All You Need to Know - AMBCrypto Blog",
        "content": "Bitcoin (BTC), a term that has become synonymous with the buzzword “cryptocurrency,” has garnered significant attention since its inception in 2008.\n\nIts popularity has prompted many to question: What does a Bitcoin look like Does it have a physical form? How can you conduct transactions?\n\nThis article delves into the digital world of Bitcoin and provides comprehensive insights into its workings.\n\nWhat does Bitcoin look like?\n\nBitcoin, a digital currency, doesn’t have a physical form like traditional coins or notes. Instead, it exists solely in a digital format. It is represented by a string of alphanumeric characters, typically starting with the number “1” or “0”.\n\nThese characters serve as a unique identifier for each Bitcoin wallet. Bitcoin transactions involve transferring ownership of these digital tokens from one wallet to another, recorded on the blockchain.\n\nWhile Bitcoin itself doesn’t have a physical appearance, its symbol – ₿ – is commonly used to represent it. The symbol is similar to the letter “B” with two vertical lines through it.\n\nBitcoin uses this symbol in graphics, logos, and designs associated with Bitcoin.\n\nIn essence, Bitcoin’s “look” is the arrangement of characters and numbers in its wallet addresses and its symbolic representation, which have become recognizable in the digital financial world.\n\nThe absence of a physical presence is a defining characteristic of cryptocurrencies, highlighting their digital nature and decentralized functionality.\n\nUnderstanding Bitcoin: A virtual asset\n\nThe first thing to comprehend about Bitcoin is that it is not a physical entity but a completely digital asset. It functions as an electronic cash system developed by an anonymous individual or group of people known as Satoshi Nakamoto.\n\nThe primary intention behind Bitcoin’s creation was to establish a monetary system that operated independently of any government, authority, or middleman, such as banks.\n\nBitcoin is essentially an open-source software that allows users to perform transactions using digitally signed codes.\n\nThese codes represent the conditional statements of Bitcoin. Therefore, the first and foremost answer to the question, “What does Bitcoin look like?” is that it appears as numerous lines of code.\n\nBlockchain: The Visual Ledger of Transactions\n\nAt the heart of Bitcoin lies the blockchain, a decentralized and distributed ledger that logs all transactions across a network of computers.\n\nEvery block within the blockchain comprises a roster of transactions, and when connected, they create a visible chain.\n\nExamining the blockchain visually unveils the transparency and immutability that define Bitcoin transactions.\n\nThe Mysterious Origins of Bitcoin\n\nBitcoin was launched in 2009 by an individual or group operating under the pseudonym Satoshi Nakamoto. The true identity of Nakamoto remains a mystery, adding to the enigma surrounding Bitcoin.\n\nDespite this mystery, the open-source nature of Bitcoin’s software means that anyone can view, use, or contribute to the code.\n\nBitcoin transactions: The underlying mechanism\n\nWhile Bitcoin transactions may seem straightforward at first glance, they involve a complex process. When a user initiates a payment, the network and the Bitcoin wallet undergo a series of steps to ensure the accurate amount reaches the recipient’s wallet.\n\nA typical Bitcoin transaction comprises three main elements:\n\nA transaction input: The Bitcoin address from which helps to send the BTC.\n\nA transaction output: The Bitcoin address to which helps to send the BTC.\n\nThe amount: The quantity of Bitcoins involved in the transaction.\n\nThe transaction input and output are essentially Bitcoin addresses, and these addresses are lines of alphanumeric codes. Each address is unique and tied to a specific Bitcoin wallet.\n\nThe genesis of Bitcoin mining: The first block\n\nBlockchain technology is the foundation of Bitcoin. Using this technology, a decentralized, open ledger can create Bitcoin transactions. A network of nodes computers running the Bitcoin software—maintains this ledger.\n\nThe Genesis Block also referred to as Block 0, is the first Bitcoin block ever mined and is the base of the Bitcoin trading system.\n\nIt was developed in 2009 by Satoshi Nakamoto and established the standard for trading Bitcoin. Models of subsequent blocks in the Bitcoin blockchain after the Genesis Block.\n\nBitcoin wallet: Your digital vault\n\nIn the Bitcoin universe, a digital wallet plays a crucial role. It is essentially a software where you store Bitcoins. The wallet facilitates the sending and receiving of Bitcoins and grants the user ownership of the Bitcoin balance.\n\nA Bitcoin wallet can exist in various forms – desktop wallets installed on a computer, mobile wallets on smartphones, web wallets accessible via a browser, and hardware wallets that store Bitcoins on a physical device.\n\nEvery Bitcoin wallet has a unique string of 26-35 alphanumeric characters known as the wallet address. This address can transfer Bitcoins to another address on the network.\n\nBitcoin’s environmental impact: A growing concern\n\nOne of the criticisms that Bitcoin often faces pertains to its environmental impact. The Bitcoin mining process can consume a significant amount of energy.\n\nSome estimates equate the amount of CO2 generated by the Bitcoin network to that of a large Western city or an entire developing country.\n\nSafety and security of Bitcoins\n\nBitcoin transactions rely on the SHA-256 algorithm, designed by the US National Security Agency. The cryptographic nature of Bitcoin makes it virtually impossible to crack.\n\nHowever, Bitcoin operates without any central authority, which means there is no recourse in case of an error with a transaction or loss of password.\n\nFrequently Asked Questions (FAQs)\n\nQ: Is Bitcoin real money?\n\nA: Even though Bitcoin doesn’t exist in physical form, it can effectively operate as real money and is recognized as legal tender in certain countries, like El Salvador.\n\nHowever, in many parts of the world, you can’t simply stroll into any store or café and use your Bitcoin wallet for transactions.\n\nNevertheless, the acceptance of Bitcoin is expanding, and it’s increasingly common to find merchants and service providers embracing Bitcoin payments.\n\nQ: How can you tell a fake Bitcoin?\n\nA: The possibility exists that someone might create a malicious fork of the Bitcoin blockchain, attempting to present it as a genuine article to unsuspecting users.\n\nIf you harbor suspicions about the authenticity of your Bitcoin wallet, consider creating a new one and conducting a test transaction. If the transaction goes through and is visible on a Bitcoin block explorer, you’re dealing with authentic Bitcoin.\n\nEncountering fake Bitcoin is highly improbable. In reality, most cryptocurrency scams employ different tactics to pilfer funds from unsuspecting users.\n\nCommonly, scammers persuade users to deposit their Bitcoin into an “investment platform,” promising significant returns. Once the Bitcoin is deposited, the scammers vanish, leaving the victim with stolen funds.\n\nBe wary of promises of guaranteed returns in exchange for sending Bitcoin – such propositions are almost certainly scams.\n\nQ: What does the code for Bitcoin look like?\n\nA: Bitcoin implementations can be coded in various programming languages. Satoshi Nakamoto’s initial Bitcoin implementation was crafted in C++, and this programming language is also employed by Bitcoin Core, recognized as the primary implementation of Bitcoin.\n\nSumming up\n\nDespite its complexities and criticisms, Bitcoin continues to thrive and revolutionize the financial landscape. It has paved the way for other cryptocurrencies and has even garnered the attention of prominent businesses and financial institutions. With its growing acceptance, Bitcoin can redefine the concept of currency in the digital age.\n\nIn conclusion, BTC is a revolutionary digital currency that challenges traditional notions of transactions and economies.\n\nHowever, it doesn’t have a physical form but exists as lines of code in a decentralized network. Furthermore, while it can be complex to understand, it represents a gigantic step towards a future where financial systems are more transparent, efficient, and inclusive."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL3doYXQtaXMtdm9sYXRpbGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 26 Aug 2023 23:12:06 GMT",
        "title": "What is volatility? | Learn about crypto and DeFi | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "What is volatility?\n\nIn financial terms, volatility refers to the rate at which the price of an asset increases or decreases for a set of returns. In simpler terms, it is the measure of the speed and extent of price changes in any market, be it for a particular set of shares, the entire stock market, or cryptocurrencies.\n\nUse the multichain Bitcoin.com Wallet app, trusted by millions to safely and easily buy, sell, trade, and manage bitcoin and the most popular cryptocurrencies."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8xNTM4NzgvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tcmVjb3Zlci1wZXBlY29pbi1wZXBlLXNxdWVlemVk0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzE1Mzg3OC90aGlzLXdlZWstaW4tY29pbnMtYml0Y29pbi1ldGhlcmV1bS1yZWNvdmVyLXBlcGVjb2luLXBlcGUtc3F1ZWV6ZWQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 26 Aug 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Recover While Pepe Gets Squeezed - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nThis week markets appeared grateful for the dearth of news—\"no news is good news,\" as the saying goes. Most leading cryptocurrencies recovered their losses over the week after last Thursday's flash crash sank virtually all leading cryptocurrencies by double-digit percentages.\n\nBitcoin (BTC) currently holds the fort at $26,015, about 0.4% cheaper than it was this time last week. A lot of Bitcoin mining machinery came online this week, as evinced by the fact that the network on Wednesday hit a new all-time high for mining difficulty alongside a corresponding spike in hash rate, or computational power.\n\nAD\n\nAD\n\nEthereum (ETH), the second biggest cryptocurrency by market capitalization, matched Bitcoin’s pace. At its current price of $1,647, it is down 1.6% from last week.\n\nBroadly speaking, most top thirty cryptocurrencies retained their value. The only notable depreciation over the last seven days fell upon holders of Uniswap (UNI) and Avalanche (AVAX). AVAX fell 7.2% to $10.02, while UNI crashed 7.9% to $4.58.\n\nMeme coin PEPE is still in freefall. On Monday it posted intraweek losses of over 20% as it slid from 71st to 84th place. It now enters the weekend at $0.000000865154—the 98th biggest cryptocurrency by market cap—or about 23.3% lower than it was a week ago.\n\nAdding to its generally poor performance, the PepeCoin team’s multi-sig Ethereum address transferred 16.045 trillion PEPE—worth $16.85 million at the time—to four exchanges: Binance, OKX, KuCoin, and Bybit, on Thursday.\n\nThe lack of communication from the team about these transfers contributed to some heated panic selling.\n\nCapital cities were silent about crypto this week. There were only a few stories of any note.\n\nAD\n\nAD\n\nIn the news...\n\nThe Kenyan government on Monday established a committee to inquire into OpenAI CEO Sam Altman’s crypto project Worldcoin—a controversial project which offers people around the world free crypto if they visit their nearest “Orb” and supply it with biometric data (a snapshot of their eyeballs). Kenya’s move came three weeks after the country suspended Worldcoin’s activities within its borders.\n\nOn Wednesday, the U.S. Department of Justice arrested Tornado Cash founder Roman Storm and charged him with crimes related to money laundering. Co-founder Roman Semenov, who was also named in the indictment, remains at large in Dubai.\n\nLast year, the Department of the Treasury’s Office of Foreign Assets Control (OFAC) banned Americans from using privacy mixer Tornado Cash, claiming that criminals had used it to launder money—specifically naming the North Korean state-sponsored hacker organization Lazarus Group.\n\nEarlier this week, the legislative body of the Central African Republic (CAR) granted approval for the tokenization of land and natural resources to help the government position the country as an up-and-coming business destination in Africa.\n\nThe project launched last year with resource tokenization in mind; it is meant to facilitate investment in CAR through Sango Coin, a state-issued token—though not a Central Bank Digital Currency—backed by Bitcoin on a sidechain network. However, initial responses to Sango Coin’s launch were lukewarm."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXN0YWJpbGl0eS1jcmVhdGVzLWx1Y3JhdGl2ZS1zZXR1cHMtaW4tdG9uLXhtci1tbnQtYW5kLXFudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price stability creates lucrative setups in TON, XMR, MNT and QNT - Cointelegraph",
        "content": "Bitcoin (BTC) has gone silent over the weekend. CryptoQuant CEO Ki Young Ju said, in a recent post on X (formerly Twitter), that Bitcoin’s velocity has declined to a three-year low. He said this could either be considered positive, as whales were holding on to their positions, or negative because the transfer to new investors was not happening.\n\nThe range-bound action continues to perplex investors with regard to the next possible trending move. In that respect, there was positive commentary from JPMorgan analysts who said that Bitcoin’s downtrend could be ending. They believe that the declining open interest in Bitcoin futures contracts on the Chicago Mercantile Exchange suggests that the long liquidation is over.\n\nCrypto market data daily view. Source: Coin360\n\nAs Bitcoin decides its next move, select altcoins are showing signs of strength. These altcoins could turn negative if Bitcoin’s range resolves to the downside, but if Bitcoin turns up or stays in a range, then they may offer a short-term trading opportunity.\n\nLet’s study the charts of the top-five cryptocurrencies that may move up in the near term and identify the levels that need to be crossed for the bulls to take charge.\n\nBitcoin price analysis\n\nBitcoin formed an inside-day candlestick pattern on Aug. 26, indicating indecision between the bulls and the bears about the next directional move.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe downsloping 20-day exponential moving average ($27,222) and the relative strength index (RSI) in the oversold zone indicate that bears are in command. However, the bulls are unlikely to give up without a fight. They will try to defend the $24,800 level with all their might.\n\nThe BTC/USDT pair may start a stronger recovery if buyers thrust the price above the 20-day EMA. That could open the doors for a possible rally to the 50-day simple moving average ($28,888).\n\nIf bears want to strengthen their position, they will have to pull the price below $24,800. If they do that, the pair could start a downtrend to $20,000.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe 20-day EMA is flattening out, and the RSI is near the midpoint on the four-hour chart. This suggests a balance between supply and demand. If the price crumbles below $25,700, the pair could fall to $25,166 and then to $24,800.\n\nOn the contrary, if the pair sustains above the moving averages, it will signal that the bulls have absorbed the selling. There is a minor resistance at $26,314, but if this crossed, the pair could climb to $26,610 and, later, to $26,833.\n\nToncoin price analysis\n\nToncoin (TON) is forming an inverse head and shoulders pattern, which will complete on a break and close above $1.53.\n\nTON/USDT daily chart. Source: TradingView\n\nThe gradually upsloping 20-day EMA ($1.38) and the RSI in the positive zone indicate that the path of least resistance is to the upside. If buyers drive the price above $1.53, the TON/USDT pair could start a new uptrend toward the pattern target of $1.91.\n\nThe bears are likely to have other plans. They will try to guard the $1.53 level and tug the price below the moving averages. If they manage to do that, the pair could decline to $1.25 and, eventually, to $1.15.\n\nTON/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the $1.53 level may prove to be a stiff barrier for the buyers to cross. If the price turns down from this level but rebounds off the 20-day EMA, it will suggest that the bulls are buying on minor dips. That could improve the odds of a break above $1.53. The pair may then rally to $1.70.\n\nInstead, if the price turns down and breaks below the 20-day EMA, it will signal that traders are booking profits near $1.53. The pair may then drop to the 50-day SMA and, subsequently, to $1.33.\n\nMonero price analysis\n\nMonero’s (XMR) sharp rebound off the uptrend line for the second time in the past few days shows that the bulls are fiercely defending the level.\n\nXMR/USDT daily chart. Source: TradingView\n\nThe XMR/USDT pair could reach the 20-day EMA ($148), which is likely to act as a formidable hurdle. If bulls do not give up much ground from this level, the prospects of a rally above the 20-day EMA increase. The pair may then climb to the 50-day SMA ($157), which could attract selling by the bears.\n\nIf the price turns down sharply from the 20-day EMA, it will suggest that bears continue to sell on rallies. The pair could then retest the uptrend line. The repeated retest of a support level tends to weaken it. If this level gives in, the pair may collapse to $125 and then to $115.\n\nXMR/USDT 4-hour chart. Source: TradingView\n\nThe bulls pushed the price above the moving averages on the four-hour chart, indicating that the bears may be losing their grip. There is a strong resistance at $150, but if this level is scaled, the pair may reach $160. The rising 20-day EMA and the RSI in the positive territory indicate a minor advantage to buyers.\n\nThe first sign of weakness will be a break and close below the moving averages. That could pull the price to the uptrend line. A break below this support could send the pair tumbling to $125.\n\nRelated: FTX suspends user accounts amid Kroll cyber breach concerns\n\nMantle price analysis\n\nMantle (MNT) has been in a strong downtrend since topping out at $0.60 on July 20. The sharp downtrend sent the RSI into oversold territory, indicating that a relief rally was possible.\n\nMNT/USDT daily chart. Source: TradingView\n\nThe outside-day candlestick pattern on Aug. 25 suggests that the buyers are attempting to seize control. The MNT/USDT pair could first rise to the 20-day EMA ($0.45), which is an important level to watch out for. If buyers overcome this obstacle, the pair could rise to the 38.2% Fibonacci retracement level of $0.48.\n\nContrarily, if the price turns down from the 20-day EMA, it will suggest that the bears continue to sell on every minor rally. That could result in a retest of the support at $0.41. If this level cracks, the pair may slide to $0.35.\n\nMNT/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls have pushed the price above the moving averages but are struggling to start a runaway rally. This suggests that the bears have not given up, and they may pose a challenge at higher levels.\n\nIf the price breaks below the moving averages, it will signal advantage to bears. That will increase the possibility of a break below $0.41.\n\nAlternatively, if the price sustains above the 20-day EMA, it will indicate that the bulls are buying the minor dips. The pair may then attempt a rally to $0.47 and, subsequently, to $0.52.\n\nQuant price analysis\n\nQuant (QNT) rebounded off the strong support at $95 on Aug. 17 and rose above the moving averages on Aug. 26. This shows a strong demand at higher levels.\n\nQNT/USDT daily chart. Source: TradingView\n\nThe bulls will try to sustain the momentum and push the price to the downtrend line. This level is likely to witness a tough battle between the bulls and the bears. If the price turns down from this level but rebounds off the 20-day EMA ($101), it will signal a change in sentiment from selling on rallies to buying on dips.\n\nThat could increase the likelihood of a rally above the downtrend line. If that happens, the QNT/USDT pair could start a rally to $120. This positive view could invalidate in the near term if the price turns down and plummets below the moving averages. The pair may then slide to the support at $95.\n\nQNT/USDT 4-hour chart. Source: TradingView\n\nThe moving averages on the four-hour chart have turned up and the RSI is in the positive territory, indicating that bulls are on a comeback. The pair could rally to the downtrend line, where the bears may again mount a stiff resistance.\n\nOn the downside, the moving averages are expected to act as strong supports. A break and close below the 50-day SMA will indicate that the recovery may be over. The pair may then slump to $98.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vZGVjcnlwdC5jby8xNTM4NjQvYmVhci1tYXJrZXQtbXVjaC13b3JzZS10aGFuLWV4cGVjdGVkLWFuYWx5c3RzLXBpdGNoLW5ldy1iaXRjb2luLWVjb25vbXktZnJhbWV3b3Jr0gFxaHR0cHM6Ly9kZWNyeXB0LmNvLzE1Mzg2NC9iZWFyLW1hcmtldC1tdWNoLXdvcnNlLXRoYW4tZXhwZWN0ZWQtYW5hbHlzdHMtcGl0Y2gtbmV3LWJpdGNvaW4tZWNvbm9teS1mcmFtZXdvcms_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 26 Aug 2023 07:00:00 GMT",
        "title": "Bear Market 'Much Worse Than Expected’: Analysts Pitch New Bitcoin Economy Framework - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAmid a protracted bear market, a new conceptual framework for understanding the Bitcoin economy was launched Thursday.\n\nDavid Puell, research associate for ARK Invest, and James Check, lead analyst for Glassnode, co-authored a whitepaper dubbed “Cointime Economics: A New Framework For Bitcoin On-chain Analysis.”\n\n“It provides a toolkit to properly understand the economic realities of Bitcoin,” Check told Decrypt, detailing that it “adds a new lens to assess the market.”\n\nAD\n\nAD\n\nThe whitepaper provides insight into the differences between the current unspent transaction (UTXO) a new \"cointime \" model for understanding what the authors call the “real economic weight of a Bitcoin.\"\n\n\n\nCointime economics approaches Bitcoin from a time-based perspective, proposing that the importance of Bitcoin is based on the last time a coin moved. The model introduces a new concept called a \"coinblock,\" which essentially multiplies the number of Bitcoin and the number of blocks produced while the Bitcoin remains unmoved.\n\nFor example, 10 coins held during the time necessary to produce 10 blocks represents 100 coinblocks.\n\n“Heavy coinblock destruction suggests that long-term holders are selling,\" the report explains. Bitcoin’s “smart money,” in other words, and they “typically hold larger bitcoin balances and trade from lower cost bases, generating higher profits.\"\n\nAccording to the document, two new metrics can also be used to analyze Bitcoin’s economic state.\n\nAD\n\nAD\n\n\"Liveliness\" refers to how active or alive the network is, or how often coins have been “destroyed” or moved. \"Vaultedness\" measures coins that are stored, alluding to how “inactive” the protocol is.\n\n“We believe the Cointime framework provides a highly consistent, mathematical framework measuring the economic importance of each bitcoin through time,” the report read.\n\nFor Check, unlike the traditional UTXO (Unspent Transaction Output) analysis—which he says is “very granular and requires bespoke data engineering”—Cointime offers a “macro view.”\n\nHe explained to Decrypt that “it is simple to calculate and easy to replicate without proprietary data science.”\n\nJames Check, co-author and Glassnode’s lead analyst, told Decrypt that under this framing, “the bear market is much worse than expected.”\n\nIn the Cointime’s model, “since lost coins were largely in the early years, they hold tremendous unrealized profits (over $35 billion),” said Check. “However, when we use 'cost basis' models like realized price, the losses held by active investors are masked by the profits held by lost coins.”\n\n“Under this framework, the true cost basis of the market is actually at around $32,000, which we are still underneath,” Check added.\n\nPuell and Check highlight several value propositions of cointime economics, including reassessing Bitcoin’s inflation rate and the network’s valuation. Check suggested that cointime economics has two possible areas of use.\n\nAD\n\nAD\n\n“On-chain analysts who are deep in the field and will use it to inspire new ideas,” he said, and “institutional investors looking for simpler models with higher signal.”\n\nThe co-authors concluded that “at the core, we have a simple mathematics toolkit to achieve vastly superior economic and valuation models which account for both the supply and demand side of the market.”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXRoZXItY3RvLXBhb2xvLWFyZG9pbm8tYml0Y29pbi1taW5pbmctbG9jYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Tether CTO stays silent on Bitcoin mining locations - Cointelegraph",
        "content": "Paolo Ardoino, the chief technology officer of stablecoin issuer Tether, recently found himself addressing rumors about images of large industrial containers online, leading him to reject questions about where Tether is mining Bitcoin (BTC).\n\nIn an Aug. 26 X (formerly Twitter) post, Ardoino shed light on the curiosity sparked by the photo he shared on Aug. 24. The image displayed a container with a photoshopped Tether Energy logo, leaving many people pondering over what it’s all about.\n\nOne of #Tether energy production and #Bitcoin mining sites coming along well. pic.twitter.com/6Z8o6A5OaE — Paolo Ardoino (@paoloardoino) August 24, 2023\n\nHe clarified that the photo shows a control room at one of Tether’s Bitcoin mining sites that it is currently completing and will soon begin operations at.\n\nHowever, Ardoino firmly stated he would not disclose the location, responding to numerous users who have inquired about it.\n\nWhile he did mention that the site is somewhere in the continent of South America, he added no further details due to security reasons.\n\n“Where? In LATAM. We tend to not share exact locations to avoid personnel harassment, a valid concern given the amount of detractors obsessed with Tether,” he declared, admitting that it has led to many Tether skeptics questioning its legitimacy:\n\n“You can almost hear some of them screaming: ‘NOOOOOOOO if you don’t tell us the address, zip code, surname of the cow that is eating the grass nearby, then it’s not real!!!!!‘”\n\nHe addressed doubters who were curious about the photoshopped logo appearing on the containers, explaining that it was a deliberate media decision.\n\n“We thought that the photo would have been shared on newspapers so the team wanted to brand it,” Ardoino noted. However, he believes having logos displayed at the mining sites would not be a wise approach from a security standpoint:\n\n“Moreover, putting gigantic Tether logos would not be great from physical privacy of the site point of view.”\n\nHe anticipates operations to commence sometime in September.\n\n“The site is progressing well, everyone in the team is super excited and working around the clock to start operations in the next few weeks,” he declared.\n\nRelated: Mining 1 BTC in Lebanon is 783x cheaper than Italy: CoinGecko report\n\nThis comes after news that Tether is developing mining software aimed at providing more transparency within the Bitcoin mining industry.\n\nIn an interview with Cointelegraph on Aug. 17, Ardoino explained that Tether is working on a mining software called Moria that provides more comprehensive data analytics on energy production at Bitcoin mining sites.\n\nArdoino highlighted the need for better analytics and performance review in Bitcoin mining. He believes Moria will assist with evaluating the site’s performance and surrounding environment:\n\n“If energy used by the mining site is wind or solar, there are optimization parameters, like predicted speed of wind for a specific day or a specific hour of the day, that could be used to overclock some of the miners and boost the production.”\n\nMagazine: Bitcoin miner gets life in prison, China offers bounties for crypto firms: Asia Express"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi10by1oaXQtNTAwMDAtYnktdGhlLWVuZC1vZi0yMDIzLWlmLXRoaXMtcGF0dGVybi1pcy1yZXBlYXRlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin to hit $50,000 by the end of 2023 if this pattern is repeated - Finbold - Finance in Bold",
        "content": "As Bitcoin’s (BTC) price continues to grapple with uncertainty regarding its next movement, the market remains uncertain whether the asset will experience an upward or downward momentum. Amidst this uncertainty, historical price patterns suggest the potential for the asset to rally by over 90% from its current value by the end of the year.\n\nIn this line, an analysis posted on TradingView by TradingShot on August 25 suggested that Bitcoin could reach a value of $50,000 by the conclusion of 2023. The analysis centers around the moving average convergence divergence (MACD) bullish cross that took place in the one-month timeframe around two months ago. This cross sheds light on historical parallels that might indicate a significant rally in the future.\n\nBitcoin price analysis chart. Source: TradingView\n\nAccording to the analyst, the pattern mirrors a historical context dating back to 2014, identifying three prior instances when the one-month MACD formed a bullish cross. On these occasions, the price action was notable for hitting the 0.786 Fibonacci retracement level shortly before or after the Bullish Cross, except for the strange June 2019 period during the Libra hype.\n\nFurthermore, the analyst highlighted the symmetrical support level derived from the last lower high of the bear cycle. This support level has demonstrated resilience by consistently closing all 1-month candles above it, barring the irregular disruption due to the pandemic-inspired flash crash in March 2020.\n\n“This is the position that the recent price decline has brought us to, testing that Symmetrical Support, which has held twice already in June and May 2023. The situation is more like the December 2015 1M MACD Bullish Cross, which took 6 months until it reached the 0.786 Fibonacci level. This time range is completed in 4 months, which means that by December 2023, BTC can reach the 0.786 Fib, which is at $50000,” he said.\n\nBitcoin price remains in consolidation\n\nHowever, in the present instance, this time frame appears to be condensed, potentially culminating in four months. This suggests that Bitcoin could possibly reach the 0.786 Fibonacci retracement level at $50,000 by December 2023.\n\nIndeed, if this pattern repeats, it will relieve the crypto community, especially considering that Bitcoin has predominantly traded below the $30,000 mark in recent times. It’s worth noting that market observers believe Bitcoin is poised to reach another high, with catalysts such as the upcoming halving event and the potential approval of a spot Bitcoin Exchange-Traded Fund (ETF).\n\nAt the same time, as Bitcoin trades in a consolidated phase, there seems to be increasing demand for the maiden cryptocurrency. As reported by Finbold, over the past 12 months, there has been an uptick in demand for the keyword ‘buy Bitcoin’ on Google Trends.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was trading at $26,067, having undergone a 0.21% rise in the last 24 hours. Over the past week, Bitcoin’s performance has been characterized by consolidation, with a minor decrease of nearly 0.3%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nFrom a technical analysis standpoint, the primary sentiment surrounding Bitcoin remains bearish. An overview of the one-day indicators suggests a ‘sell’ stance at 14, while the moving averages advocate a ‘strong sell’ position at 13. Meanwhile, the oscillators stand neutral at 7.\n\nBitcoin technical analysis. Source: TradingView\n\nOverall, the ability of Bitcoin to regain the $50,000 mark will depend on other elements, such as macroeconomic factors, including inflation and interest rates.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]