[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vbW9uZXktYW5kLWJhbmtpbmcvY3J5cHRvY3VycmVuY3kvZnJlZS1waXp6YXMtY3J5cHRvLXBsYXRmb3Jtcy1icmluZy1pbi1iaXRjb2luLXBpenphLWRheS13aXRoLW9mZmVycy1hbmQtZ29vZGllcy9hcnRpY2xlNjY4ODA4NDMuZWNl0gGuAWh0dHBzOi8vd3d3LnRoZWhpbmR1YnVzaW5lc3NsaW5lLmNvbS9tb25leS1hbmQtYmFua2luZy9jcnlwdG9jdXJyZW5jeS9mcmVlLXBpenphcy1jcnlwdG8tcGxhdGZvcm1zLWJyaW5nLWluLWJpdGNvaW4tcGl6emEtZGF5LXdpdGgtb2ZmZXJzLWFuZC1nb29kaWVzL2FydGljbGU2Njg4MDg0My5lY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Free Pizzas! Crypto platforms bring in Bitcoin Pizza Day with offers and goodies - BusinessLine",
        "content": "Cryptocurrency platforms are bringing in Bitcoin Pizza Day by distributing free pizzas, gift vouchers, and other goodies. Indian players Coinswitch, Mudrex, and Zebpay are running campaigns to promote and celebrate the day when Bitcoin was used for the first time to buy a real-world commodity.\n\nBitcoin Pizza Day is celebrated widely by the crypto community worldwide on May 22 every year. The symbolism of the event is to mark how open-source internet money, which wasn’t of significant worth then, went on to be the highest-valued crypto token in the world and saw wide adoption.\n\nCryptocurrency exchange CoinSwitch is giving away pizzas to crypto users who share their experiences of entering the world of cryptocurrencies. CEO Ashish Singhal wrote in a tweet, “Share your first experience of investing in crypto, and I’ll gift a pizza for the most unique story. Let’s celebrate together with pizza.” He also noted that his introduction to crypto was in 2014, when he started dabbling with Bitcoin nodes and codes.\n\nAlso read Bitcoin on course for longest streak of monthly gains since 2021\n\nSimilarly, exchange Zebpay has a Bitcoin Pizza Day offer on the platform. Crypto users who trade on the platform today can win gift vouchers worth ₹1,000. “Trade from ₹1,000 to ₹1 lakh or more and stand a chance to win prizes including cash vouchers, air tickets, and much more,” the platform said on Twitter.\n\nMudrex, a crypto investing platform, is also running a Bitcoin Pizza Day campaign and has distributed pizzas to approximately 300 start-ups and companies in and around Bengaluru. It has also partnered with Via Milano in Bangalore, granting new signees the opportunity to indulge in complimentary pizzas provided by Via Milano.\n\nIts CEO and co-founder, Edul Patel, said, “Bitcoin Pizza Day symbolizes the incredible journey of cryptocurrencies, from a humble transaction to a global phenomenon. It reminds us of the immense growth potential and transformative power of digital assets in shaping the future of finance.”\n\nGlobal crypto player Binance is tying up with members of the community to make their own pizza, complete with their own ‘BTC’ toppings logo. Participants would be winning the crypto equivalent of a year’s supply of pizza.\n\nWhat is Bitcoin Pizza Day\n\nThe day is celebrated to mark the first time Bitcoin was used for a real-life transaction. On May 22, 2010, two pizzas were bought for 10,000 bitcoins, at a time when Bitcoin was known and understood by very few people.\n\nLaszlo Hanyecz, a programmer in Florida who was a part of the initial phases of Bitcoin, decided he had to put his mined tokens to use. He then put out a message on the Bitcoin Talk Forum saying, “I’ll pay 10,000 bitcoins for a couple of pizzas, like maybe two large ones, so I have some leftover for the next day.”\n\nA few days later, on May 22, a man on the forum named Jeremy Sturdivant took up the offer and got Hanyecz and two pizzas delivered from Papa John’s. A single Bitcoin today is worth $26,830.5 and was even worth $69,044 at its all-time high in 2021.\n\nAlso read: WazirX partners with Taxnodes to simplify tax computation for VDAs"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmtpcGxpbmdlci5jb20vaW52ZXN0aW5nL2lzLWludmVzdGluZy1pbi1iaXRjb2luLWFuZC1vdGhlci1jcnlwdG9jdXJyZW5jaWVzLXJlYWxseS1qdXN0LWdhbWJsaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Is Investing in Bitcoin and Other Cryptocurrencies Really Just Gambling? - Kiplinger's Personal Finance",
        "content": "If you buy cryptocurrency , are you just taking a punt on it performing well, or is it a genuine investment like buying shares and commodities?\n\nMany people have asked that question as Bitcoin, Ethereum and other cryptocurrencies have boomed in popularity over the past few years, which has brought riches to some but financial catastrophe to others.\n\nI’ve previously written about my experience of buying and selling Bitcoin as being more akin to gambling than investing.\n\nSubscribe to Kiplinger’s Personal Finance Be a smarter, better informed investor. Save up to 74% Sign up for Kiplinger’s Free E-Newsletters Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. Sign up\n\nIs Bitcoin and other cryptocurrencies just gambling?\n\nA prominent group of politicians in the UK have now called for buying crypto to be treated as gambling when considering regulation of the sector.\n\nIn their view, crypto is such a high risk sector that it is more akin to gambling than investing, while they say the currencies themselves have no underlying value and their price is purely based on what the market is prepared to pay for them.\n\nThe Treasury Committee, a group of UK MPs who hold the financial services sector to account, said in a report last week that crypto has “no intrinsic value and serves no useful social purpose and these characteristics more closely resemble gambling than a financial service.”\n\nOur friends at MoneyWeek in the UK also reported the committee saying: “The events of 2022 have highlighted the risks posed to consumers by the crypto asset industry, large parts of which remain a wild west.”\n\nA look at the fortunes of Bitcoin shows wild swings over the years, which have created millionaires but have also led some to lose everything.\n\nOver the past five years, the price of a Bitcoin has swung from about $3,500 to $65,000, and as I write this, it currently sits at about $27,000.\n\nA closer look at the charts shows in a short time, prices have plunged dramatically at times. For example, in May 2021 the price plunged from close to $60,000 to just under $35,000 in just three weeks. Of course, prices have risen at a similar speed too.\n\nWhat’s more, as UK MPs have said, there is little substance to crypto other than the price others are prepared to pay for it.\n\nWhen you buy shares in a company, you could argue that ultimately the same principle applies, but you at least have a myriad of factors that influence demand for that stock that are based on tangible components such as its recent performance, quality of its management team and its strategic aims.\n\nWhen you buy a commodity such as gold or art, you often physically hold that item and it may bring you or a future buyer pleasure such as in the quality of the art.\n\nMany people do not understand crypto\n\nThen there is the fact that crypto is such a mystery to so many people, which leans into my point that it is difficult to conduct the due diligence you need to do when investing. What’s more, it’s much harder to find a financial adviser who specializes in crypto as it is with standard investments.\n\nI got a lot of stick from crypto experts when I wrote my article on my experiences with Bitcoin , with some saying I didn’t understand what I had bought and that it is indeed a long-term investment and not a gamble.\n\nThey’re correct that I didn’t understand all the ins and outs of exactly what goes into a Bitcoin like I would a standard investment or other areas of personal finance as I have not researched it to the level I have analyzed other personal finance topics. Don’t get me wrong, I know what crypto is and how it works, but as you peel back more of the details, l I will come unstuck versus someone who works for a crypto firm.\n\nYet the fact I have some gaps in my knowledge, with the experience I have in personal finance, makes me question if anyone who doesn’t devote a huge amount of time to the subject will fully understand crypto to the level required to pump lots of money into it, as it is complex.\n\nSo should you buy Bitcoin or other cryptocurrencies?\n\nIn simple terms, if you know the crypto markets inside out and consider yourself an expert, then, of course, you are in a good position to decide for yourselves when and what to buy and sell.\n\nIf you don’t know the markets inside out, there is nothing wrong with investing… ahem, gambling… with crypto as long as you know the risks and can afford to lose whatever you put in.\n\nI’m not suggesting people shy away from crypto, more that I hope my words can help them understand what exactly they are getting themselves into. Hopefully it is a venture that makes them a lot of money, but none of us have a crystal ball to know if that will be the case."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvYml0Y29pbnMtdHJhZGluZy1yYW5nZS1uYXJyb3dzLXRvLXRpZ2h0ZXN0LWluLW1vbnRocy_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIyL2JpdGNvaW5zLXRyYWRpbmctcmFuZ2UtbmFycm93cy10by10aWdodGVzdC1pbi1tb250aHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin's Trading Range Narrows to Tightest in Months - CoinDesk",
        "content": "Narrow trading ranges indicate that neither bullish nor bearish perspectives dominate the price action. That typically happens when markets face competing influences and narratives. While lingering U.S. banking sector issues favor the upside in perceived haven assets like bitcoin, the unresolved deadlock in debt ceiling negotiations and the recovery in the dollar index suggest otherwise."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMjMvYml0Y29pbi1yaXNlcy1hZnRlci1ob25nLWtvbmctZ3JlZW5saWdodHMtc29tZS1yZXRhaWwtY3J5cHRvLXRyYWRpbmcuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA1LzIzL2JpdGNvaW4tcmlzZXMtYWZ0ZXItaG9uZy1rb25nLWdyZWVubGlnaHRzLXNvbWUtcmV0YWlsLWNyeXB0by10cmFkaW5nLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin climbs back above $27,000 after Hong Kong greenlights some retail crypto trading - CNBC",
        "content": "Cryptocurrency prices moved higher on Tuesday after Hong Kong's securities regulator announced it will allow retail trading of certain crypto assets starting June 1.\n\nBitcoin rose 1.7% to $27,293.64, according to Coin Metrics. The largest cryptocurrency has been trading in a small range throughout May, struggling to break above $30,000 but staying above $25,000. Ether advanced nearly 2% to $1,851.91.\n\nLate Monday night, Hong Kong's Securities and Futures Commission said it would allow retail investors to trade certain crypto assets beginning next month on registered trading platforms. The move was widely expected, with the announcement marking the end of a request for public comment it put out in February on its proposed regulatory requirements around retail trading in crypto.\n\nThe new guidelines are part of a broader effort of Hong Kong's to become a global crypto hub. That ambition is in sharp contrast with China, which banned crypto trading in 2021, as well as the U.S. where the regulatory stance toward crypto has turned hostile since the collapse of FTX.\n\n\"This news doesn't mean that a flood of retail buying power will enter the market at the beginning of June. … We could see some volume uptick in June, however,\" said Noelle Acheson, economist and author of the \"Crypto is Macro Now\" newsletter.\n\nHong Kong's Securities and Futures Commission has already licensed two digital asset platforms, OSL and Hash Blockchain, and it's likely some are already actively trading offshore, Acheson said."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1jcnlwdG8tYnVsbC1tYXJrZXQtb3V0bG9vay1taWNyb3N0cmF0ZWd5LW1pY2hhZWwtc2F5bG9yLWV0aGVyZXVtLTIwMjMtNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Has Bottomed and the Crypto Is on a New Bull Run: Saylor - Markets Insider",
        "content": "MicroStrategy's Michael Saylor says bitcoin's price has bottomed.\n\nCrypto regulation will soon weed out bitcoin's competitors, according to Saylor.\n\nThis, along with Bitcoin's halving and the Ordinals protocol, are bullish as well.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nMicroStrategy's Michael Saylor says bitcoin's current rally is in fact the start of a new bull run.\n\nThe software company's cofounder chalks up the new bull market to bitcoin's halving, more adoption of the crypto asset, and a regulatory crackdown on the industry that should benefit bitcoin.\n\nInvestor and developer interest will begin shifting from other blockchains, Saylor says, and into Bitcoin's network as regulation begins to weed out competitors like Ethereum. Earlier this year, US Securities and Exchange Commission chairman Gary Gensler said that \"everything other than bitcoin\" falls under securities laws.\n\n\"I think the crypto tokens and crypto securities are going to be regulated, perhaps out of existence,\" he told CNBC on Friday, adding that the token is the one commodity that the SEC is not going to regulate. \"Bitcoin is the most secure network. It's the most secure asset. Everything else has got a black cloud hanging over it.\"\n\nAdvertisement\n\nHe added: \"You're going to see a consistent flow of capital flowing from the rest of the crypto ecosystem [into] bitcoin.\"\n\nThe Financial Accounting Standards Board's also recently proposed guidance on crypto accounting and reporting, Saylor says, which is a significant milestone as well. It provides companies that hold crypto on their balance sheets, like MicroStrategy, further clarity and transparency for their shareholders, which could lead to further mainstream adoption.\n\n\"The FASB initiative to adopt fair value accounting is a very auspicious development,\" he said.\n\nThis, along with Bitcoin's halving and a migration of Ordinals inscriptions activity on its network, are bullish as well.\n\nAdvertisement\n\nOrdinals is a protocol that expands the blockchain's use case and recently helped drive a new record for daily Bitcoin transactions as well. Bitcoin's halving, a technical event that occurs roughly every four years, is tentatively slated for April 2024. This could pump the price of the crypto by enhancing bitcoin's scarcity because the halving can reduce the number of new bitcoins released.\n\nAlthough the space is going through \"growing pains,\" Saylor says there are still plenty of bullish factors for bitcoin.\n\n\"Nearly all of the bad leverage has been squeezed out. Everyone in the business of shorting bitcoin, rehypothecating bitcoin, loaning bitcoin — they've all [gone] bankrupt. The remaining exchanges where you can short it are under a massive amount of regulatory pressure,\" Saylor told the outlet.\n\nHe added: \"I think bitcoin's found the bottom. I think the leverage is out of it. I think we're on a bull run.\""
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9iaW5hbmNlLXRvLWNlbGVicmF0ZS0xMy15ZWFycy1vZi1iaXRjb2luLXBpenphLWRheS13aXRoLWdsb2JhbC1ldmVudHMtMzgyMzM2LTIwMjMtMDUtMjLSAYsBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2JpbmFuY2UtdG8tY2VsZWJyYXRlLTEzLXllYXJzLW9mLWJpdGNvaW4tcGl6emEtZGF5LXdpdGgtZ2xvYmFsLWV2ZW50cy0zODIzMzYtMjAyMy0wNS0yMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Binance to celebrate 13 years of 'Bitcoin Pizza Day' with global events - Business Today",
        "content": "World’s largest cryptocurrency exchange Binance is celebrating the thirteenth anniversary of Bitcoin Pizza Day on social media and Binance app on Monday.\n\n\"Bitcoin Pizza Day is a testament to the power of community and the growing acceptance of BTC as part of our daily lives,\" said Yi He, Binance co-founder and chief marketing officer.\n\nBinance has tied up with members of the crypto community to make their own pizza with their own BTC toppings logo. Participants who would share their Binance-themed pizzas using #BinancePizza or complete tasks to collect all the pizza flavours on the Binance app have a chance to win the crypto equivalent of a year’s supply of pizza.\n\nOnline celebrations will continue as Binance hosts a virtual live meet-up with the attendance of CZ, CEO of Binance, on May 22 at 12:00 PM UTC, featuring discussions on the meaning of Bitcoin Pizza Day with prominent Binance Feed creators.\n\n\"At Binance, we believe in the importance of mass adoption, and we are committed to creating more and more use cases for crypto in everyday situations. As more people recognize the value and potential of blockchain and crypto, our community grows stronger, and we continue to build our industry,\" Yi He added.\n\nIn 2010, Florida resident Laszlo Hanyecz spent 10,000 Bitcoins at a local restaurant called Papa John’s to buy himself two pizzas. Back then, Bitcoin used to trade at $40. Since cryptocurrency wasn’t a big thing in 2010, Hanyecz reached out to an online community ‘Bitcointalk’ and openly traded his Bitcoins for two pizzas.\n\nConsidering Bitcoin's value today, which is over $46k currently, these two pizzas can be regarded as the costliest pizzas of all time.\n\nAs this trade marked the very first commercial transaction in cryptocurrency history, crypto fans named May 22 as the Bitcoin Pizza Day.\n\nBitcoin Pizza Day stands as a pivotal milestone for the crypto industry, signifying its remarkable exponential growth and paving the path for widespread adoption of digital currencies over the past 13 years.\n\nMany global celebrations of Bitcoin Pizza Day are happening in different countries like Bahrain, Vietnam, Cambodia, Mexico, Uruguay, Argentina, Pakistan and New Zealand including the birthplace of pizza in Naples, Italy.\n\nAlso Read : Crypto Price Today: Bitcoin nears $29,000; Ethereum tops $1,900; Litecoin & BNB shed up to 3%\n\nAlso Read : Crypto Price Today: Bitcoin below $27,000; Solana, Tron, Dogecoin, Polygon and Avalanche fall 3% each"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yMy91cy1pcy1sb3NpbmctdGhlLWJpdGNvaW4tbW92ZW1lbnQtY2F0aGllLXdvb2Qv0gFdaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA1LzIzL3VzLWlzLWxvc2luZy10aGUtYml0Y29pbi1tb3ZlbWVudC1jYXRoaWUtd29vZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "U.S. Is 'Losing' the Bitcoin Movement: Cathie Wood - CoinDesk",
        "content": "Cathie Wood also referenced last year's dramatic collapse of crypto exchange FTX, saying it \"proved the concept\" of bitcoin, as did this year's banking crisis in which Silicon Valley Bank, Silvergate and Signature all went to the wall. Wood believes these crises underlined the dangers of centralization in financial systems, something to which bitcoin runs counter."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvdXMtZGVidC1kZWFsLW1heS13ZWlnaC1vdmVyLWJpdGNvaW4tb2JzZXJ2ZXJzL9IBXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvdXMtZGVidC1kZWFsLW1heS13ZWlnaC1vdmVyLWJpdGNvaW4tb2JzZXJ2ZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "U.S. Debt Deal Could Weigh On Bitcoin Price, Some Say - CoinDesk",
        "content": "\"What it implies is a lack of USD funding in the immediate short term post the successful ceiling negotiation, if any. Corporate bonds markets, as well as private credit, will find it hard to roll over existing maturities and this will lead to a real crash in either commercial real estate assets funding or plain junk bond issuers. This might be the real deal crash which the U.S. rate markets have been elusively looking for,\" Gautam said in a LinkedIn post."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjMvYml0Y29pbi1ob2RsaW5nLWhhcy1uZXZlci1iZWVuLW1vcmUtcG9wdWxhci_SAVxodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2JpdGNvaW4taG9kbGluZy1oYXMtbmV2ZXItYmVlbi1tb3JlLXBvcHVsYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin HODLing Has Never Been More Popular - CoinDesk",
        "content": "“The trend is bullish insofar it means that higher prices are ahead in this cycle and any reticence to sell from current HODLers could result in a mini-supply squeeze,” said Farrell."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yMy90aGUtYml0Y29pbi1taW5pbmctZGViYXRlLWlzLWlnbm9yaW5nLXRoZS1wZW9wbGUtbW9zdC1hZmZlY3RlZC_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDUvMjMvdGhlLWJpdGNvaW4tbWluaW5nLWRlYmF0ZS1pcy1pZ25vcmluZy10aGUtcGVvcGxlLW1vc3QtYWZmZWN0ZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "The Bitcoin Mining Debate Is Ignoring the People Most Affected - CoinDesk",
        "content": "It’s important to note that Greenidge occupies a unique role, and it’s difficult to directly compare these different facilities and how they affect the communities around them. Riot taps into an existing (sometimes shaky) energy grid, while Greenidge generates its own electricity. Other mining facilities, such as those in upstate Washington, might rely on a limited amount of power or use power paid for by the community as a collective, meaning the costs from an increase in usage get passed along to everyone regardless of how much power each individual may use. A county in Tennessee is suing a local mine in part due to the noise it generates, a complaint that some locals in Dresden say doesn’t apply to them."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1ob2xkcy1zdGVhZHktbmVhci0yN2stYXMtaW52ZXN0b3JzLXdlaWdoLWRlYnQtY2VpbGluZy1kZXZlbG9wbWVudHMv0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjMvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLWhvbGRzLXN0ZWFkeS1uZWFyLTI3ay1hcy1pbnZlc3RvcnMtd2VpZ2gtZGVidC1jZWlsaW5nLWRldmVsb3BtZW50cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Steady Near $27K as Investors Weigh Debt Ceiling Developments - CoinDesk",
        "content": "“One of the very big problems that crypto suffers with is liquidity being massively fragmented, and events such as this only exacerbate the problem,” Ismail said. “So what we're seeing right now is there is not much activity because liquidity is even more fragmented, and markets are very inefficient. As a result, you will see I think we are seeing certain narratives coming back."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2JpdGNvaW4tanVtcHMtdG8ta2V5LXByaWNlLXJlc2lzdGFuY2UtYXMtaG9uZy1rb25nLW9wZW5zLWNyeXB0by10cmFkaW5nLWZvci1yZXRhaWwtaW52ZXN0b3JzL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2JpdGNvaW4tanVtcHMtdG8ta2V5LXByaWNlLXJlc2lzdGFuY2UtYXMtaG9uZy1rb25nLW9wZW5zLWNyeXB0by10cmFkaW5nLWZvci1yZXRhaWwtaW52ZXN0b3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin Jumps to Key Price Resistance as Hong Kong Opens Crypto Trading for Retail Investors - CoinDesk",
        "content": "Bitcoin's short-term outlook also depends on the ongoing U.S. debt ceiling drama and the dollar index's trajectory. Treasury Secretary Janet Yellen has warned that the government would run out of money in early June if a debt deal is not reached, opening doors for what many say would be a catastrophic default. Some analysts said a successful resolution of the debt ceiling drama might see the Treasury suck out liquidity from the market and put downward pressure on bitcoin."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWFuYWx5c3RzLXByZWRpY3RpbmctYml0Y29pbi1oaXQtMjMxMjMyMDY0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "3 Analysts Predicting Bitcoin Will Hit $100,000 by 2024 - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has been the subject of intense speculation and volatility in recent times. In the midst of these dynamics, bullish Bitcoin price predictions prevail. In fact, some of them reach the $1 million mark. One of the reasons for that is the much-anticipated halving event. Other key catalysts include the recent collapse of U.S. banks, inflation, and amplified demand for alternative financial systems. That being said, market analysts have become far more optimistic on the future of Bitcoin, including:\n\nBitcoin Price Predictions 2024 : Dan Tapiero\n\nBitcoin coin with bull and stock chart. Bullish market of BTC-USD. Cryptos to buy.\n\nSource: Maxx-Studio / Shutterstock.com\n\nThree market analysts have emerged with bold predictions, anticipating Bitcoin could hit $100,000 by 2024. For example, crypto analyst Dan Tapiero says BTC could pass $100,000 during the latter half of 2024 or 2025. Tapiero shared his forecast during an interview with Scott Melker. In fact, according to Tapiero, Bitcoin may trade sideways for the duration of 2023. Shortly after, he expects to see $100,000 around the halving event. Among other contributing factors named by Tapiero was the adoption of blockchain technologies by states and companies.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBitcoin Price Predictions : Standard Chartered Bank\n\nVarious cryptocurrency coins. Cryptos. Cryptocurrencies representing 3AC Crypto., ARBK Stock. cheap cryptos to buy on the rebound\n\nSource: Wit Olszewski / Shutterstock\n\nGeoff Kendrick, the head of crypto research at Standard Chartered Bank, also believes Bitcoin could test $100,000 next year. This optimistic outlook is based on several factors, including the turmoil in the banking sector, the upcoming Bitcoin halving event, and the expected conclusion of the Federal Reserve’s rate hikes. Kendrick also highlights the nearing end of the Federal Reserve’s tightening cycle as a favorable factor for Bitcoin’s future performance. The correlation between Bitcoin and the Nasdaq suggests that if there is a broader improvement in risk-on assets, Bitcoin is expected to trade more favorably.\n\nStory continues\n\nThe upcoming Bitcoin halving event in 2024 is considered a powerful catalyst that could contribute to future price increases. Additionally, regulatory changes aimed at facilitating investor access to the market, such as the introduction of digital asset ETFs and stablecoin regulations, could boost Bitcoin even more.\n\nPrediction 2024 : PlanB\n\nCrypto coins on a phone screen showing stats for various cryptocurrencies.. best cryptos\n\nSource: Chinnapong / Shutterstock\n\nAccording to the pseudonymous analyst PlanB, known for his Stock-to-Flow (S2F) BTC price prediction model, Bitcoin will pass $100,000. PlanB also believes this will happen shortly after the next halving event. The model evaluation of Bitcoin’s price is based on parameters such as scarcity and the relationship between BTC’s existing supply and its production rate. PlanB states that the coin reached a cyclical low of $15,000 in Nov. during the FTX collapse. He suggests that in case Bitcoin reaches $32,000 shortly, the next possible price target of $100,000 can be reached soon after the 2024 halving event.\n\nJulia Magas is a writer who covers the latest trends in finance and technology. Her work is published in a number of financial media outlets such as Nasdaq, Cointelegraph, Investing, SeekingAlpha, FXEmpire, and Beincrypto. She primarily covers cryptocurrency and blockchain technology with a focus on market performance, innovations and trends.\n\nMore From InvestorPlace\n\nThe post 3 Analysts Predicting Bitcoin Will Hit $100,000 by 2024 appeared first on InvestorPlace."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjMvY29pbmRlc2staW5kaWNlcy10cmVuZC1pbmRpY2F0b3ItaGludHMtYXQtY29udGludWVkLWRvd250dXJuLWZvci1iaXRjb2luLWV0aGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "CoinDesk Indices Trend Indicator Hints at Continued Downturn for Bitcoin, Ether - CoinDesk",
        "content": "Historically, May has been a relatively solid month for bitcoin and ether, with average daily returns of 0.195%, or approximately 1.4% weekly. However, given the amount of time left in May, there may not be enough runway left for bitcoin to finish on a positive note."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTIzL2JpdGNvaW4tYnRjLXNoZWRzLXZvbGF0aWxpdHktdHJhaXQtd2l0aC10aGlyZC13ZWVrLWFyb3VuZC0yNy0wMDDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Nears $27,000 Value As US Debt Ceiling Talks Continue - Bloomberg",
        "content": "For an asset that’s known to be highly volatile, Bitcoin has been shedding that characteristic of late.\n\nThe largest digital asset is lingering around $27,000 for the third consecutive Tuesday in what’s been “lackluster price action,” according to K33’s Bendik Schei and Vetle Lunde . And “the remarkably unremarkable state of the market is now aggressively reflected in most metrics,” with seven-day average trading volumes touching two-and-a-half-year lows, and 30-day volatility at its lowest since January, they wrote in a note."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMjIvY2VsZWJyYXRpbmctYml0Y29pbi1waXp6YS1kYXktdGhlLXRpbWUtYS1iaXRjb2luLXVzZXItYm91Z2h0LTItcGl6emFzLWZvci0xMDAwMC1idGMv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8yMi9jZWxlYnJhdGluZy1iaXRjb2luLXBpenphLWRheS10aGUtdGltZS1hLWJpdGNvaW4tdXNlci1ib3VnaHQtMi1waXp6YXMtZm9yLTEwMDAwLWJ0Yy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Celebrating Bitcoin Pizza Day: the Time a Bitcoin User Bought 2 Pizzas for 10,000 BTC - CoinDesk",
        "content": "Bitcoin could have failed spectacularly. So could have that hot technology company – like many other failed companies. Without Bitcoin Pizza Day, perhaps no one would have stepped up to use what Bitcoin's creator Satoshi Nakamoto called peer-to-peer digital cash as a medium of exchange and bitcoin would still be floating around as valueless, magic internet money for nerds (in concept alone)."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vd29ybGQtbmV3cy9iaXRjb2luLXBpenphLWRheS1iaXRjb2lucy10YXN0aWVzdC1taWxlc3RvbmUtaG93LXBpenphLW9yZGVyLW1hcmtlZC1hLXR1cm5pbmctcG9pbnQtZm9yLWNyeXB0b2N1cnJlbmN5LTEwMTY4NDc0ODczODkxMy5odG1s0gGqAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS93b3JsZC1uZXdzL2JpdGNvaW4tcGl6emEtZGF5LWJpdGNvaW5zLXRhc3RpZXN0LW1pbGVzdG9uZS1ob3ctcGl6emEtb3JkZXItbWFya2VkLWEtdHVybmluZy1wb2ludC1mb3ItY3J5cHRvY3VycmVuY3ktMTAxNjg0NzQ4NzM4OTEzLWFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: Celebrating the historic transaction that changed crypto - Hindustan Times",
        "content": "May 22 is a day that holds a special place in the hearts of cryptocurrency enthusiasts around the world. It's a day of celebration, known as Bitcoin Pizza Day, marking a pivotal moment in the history of Bitcoin. On this day in 2010, Laszlo Hanyecz, a programmer and early Bitcoin miner, made a transaction that would go down in history as the first documented use of Bitcoin to purchase physical goods. May 22: Bitcoin Pizza Day! In 2010, Laszlo Hanyecz made history by using Bitcoin to buy pizza—a milestone for cryptocurrency enthusiasts worldwide. (Twitter)\n\nHanyecz, a resident of Florida, took to the Bitcointalk.org forum on May 18, 2010, with an unusual request. He announced his desire to buy two large pizzas using Bitcoin and offered a whopping 10,000 BTC to anyone who would fulfill his pizza order. At the time, the value of Bitcoin was less than half a cent per coin, making the offer seemingly extravagant.\n\nHindustan Times - your fastest source for breaking news! Read now.\n\nDays went by, and it seemed that Hanyecz's quest for Bitcoin-powered pizzas would go unfulfilled. However, on May 22, a fellow forum user named Jeremy Sturdivant, who went by the username \"jercos,\" stepped up to the challenge. Sturdivant agreed to order and deliver the pizzas to Hanyecz in exchange for 10,000 BTC. The pizzas were from Papa John's, and while they were not enjoyed directly from the restaurant, their significance would far surpass a simple meal.\n\nLittle did Hanyecz know that the 10,000 BTC he spent on those pizzas would skyrocket in value over the following years. If he had held onto them until Bitcoin's all-time high price of $68,990, he could have potentially amassed a mind-boggling fortune of around $690 million. Just imagine the number of pizzas he could have bought with that!\n\nReflecting on the historic transaction, Hanyecz shared in a 2019 interview with CBS that he believed it made Bitcoin \"real for some people.\" It was a tangible use case for digital currency and showcased its potential as a medium of exchange. For Hanyecz himself, it was a significant moment that solidified his belief in Bitcoin's revolutionary power.\n\nAlso Read | Republican candidate Vivek Ramaswamy becomes the second 2024 presidential candidate to accept Bitcoin donations\n\nSince that fateful day, the global crypto community has come together annually on May 22 to commemorate Bitcoin Pizza Day. It serves as a reminder of the humble beginnings of Bitcoin and the incredible journey it has undertaken. It's a time to celebrate the progress made in the world of cryptocurrencies and to reflect on how far we've come.\n\nSo, on this Bitcoin Pizza Day, let's raise our slices and toast to Laszlo Hanyecz, the pioneer who took a leap of faith with his digital currency and forever changed the course of history. And perhaps, let's also reflect on the value of patience and the importance of holding onto our Bitcoin... or pizzas, for that matter."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2Nhbi1xdWFudHVtLWNvbXB1dGVycy1taW5lLWJpdGNvaW4tZmFzdGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Can quantum computers mine Bitcoin faster? - Cointelegraph",
        "content": "Quantum computing, explained Quantum computing is an emerging technology that leverages the principles of quantum mechanics to process information. Quantum mechanics is the foundation for quantum computing, allowing for the special qualities of superposition and entanglement that could make quantum computers more powerful than conventional computers. Quantum computers use quantum bits, or qubits, which can exist in numerous states simultaneously, as opposed to classical computers, which use bits to represent information as either a 0 or a 1. As a result, they can carry out some computations far more quickly than traditional computers. Quantum computing may have a significant influence on cryptography. Today’s encryption techniques frequently rely on the difficulties of factoring huge numbers or resolving other challenging mathematical puzzles for conventional computers. However, the speed at which quantum computers could solve these puzzles might make current encryption techniques attackable. Another area where quantum computing could have an impact is in Bitcoin mining. Bitcoin mining involves complex arithmetic problems that must be solved to validate transactions and add them to the blockchain. However, mining Bitcoin (BTC) demands a lot of processing power, which is why specialist equipment and software are needed. Quantum computers might be able to handle these issues considerably more quickly than traditional computers, which might make mining BTC more efficient. Nonetheless, it is crucial to remember that quantum computers are not always superior to classical computers in all situations. For instance, certain operations that require sifting through a lot of data, like looking for a particular record in a database, are still better suited for classical computers. Additionally, the impact of quantum computing on cryptography and Bitcoin mining remains to be seen, with researchers still exploring the potential of this emerging technology.\n\nHow efficient are quantum computers in Bitcoin mining? Complex mathematical problems must be solved throughout the Bitcoin mining process, which can be accomplished significantly more quickly using quantum computers than with classical ones. Yet, it is currently unclear how quantum computing may affect Bitcoin mining. While quantum computers may increase mining productivity, they may also increase the risk of quantum hacking on the Bitcoin network. This is because many public key cryptography-based encryption techniques used to protect Bitcoin are susceptible to attack by quantum computers. Quantum hacking is a cyberattack that uses quantum computing to break through cryptographic systems. Public key cryptography is a mathematical algorithm allowing two parties to communicate securely without exchanging a secret key beforehand. The approach is based on the complexity of some mathematical tasks, such as computing discrete logarithms or factoring huge integers, which are thought to be challenging for traditional computers to tackle well. Researchers are investigating using quantum cryptography and quantum-resistant algorithms to address this issue. These techniques could help safeguard the Bitcoin network in the future since they are more resistant to attacks from quantum computers. Furthermore, there are currently no quantum computers that can mine Bitcoin more effectively than conventional computers. But, as quantum technology develops further, it is conceivable that quantum Bitcoin mining may become a reality in the future. Related: Cryptocurrency vs. quantum computing: A deep dive into the future of cryptocurrencies\n\nCan a quantum computer hack Bitcoin? By exploiting its higher processing capacity to defeat the encryption that safeguards private keys and transactions on the Bitcoin network, a quantum computer could theoretically hack Bitcoin. However, the current state of quantum technology is not yet advanced enough to pose a significant threat to Bitcoin’s security. Quantum computers might make public-key cryptography less secure because of their capacity to answer some mathematical problems far more quickly than classical computers. For example, Shor’s algorithm — a quantum algorithm — can factor large integers exponentially faster than classical algorithms. Factoring large integers is the basis of many public key encryption schemes, including the one used in Bitcoin. The public-key cryptography employed in Bitcoin and other cryptocurrencies might hypothetically be cracked if a quantum computer had the processing capability to carry out Shor’s algorithm. An attacker with a quantum computer could potentially steal BTC by computing the private key corresponding to a public key used to receive Bitcoin. The big prime numbers used to generate the public-private key combination could be factored in to achieve this. However, it is crucial to remember that quantum computing is still in its infancy and lacks the power to carry out Shor’s algorithm at the scale necessary to decrypt Bitcoin. Although small-scale quantum computers have been shown to factor in small numbers, there is still a long way to go before a large-scale quantum computer that breaks Bitcoin’s encryption can be built. In addition, the Bitcoin network is constantly developing to counter possible security risks, such as the risk presented by quantum computers. For instance, a hash-based signature system like the Lamport signature method might make Bitcoin more resilient against quantum attacks. Researchers are also investigating the use of post-quantum cryptography, which was created to be resistant to quantum computers. The Lamport signature method is considered one of the post-quantum cryptographic methods that can be used to secure digital signatures from potential threats from quantum computers. This technique generates several pairs of public and private keys to verify digital signatures using a one-time hash function. The communication is protected against efforts at quantum hacking since each pair is used to sign a distinct section of the message. Due to the one-time nature of the hash function, even if an attacker gets hold of one of the private keys, they cannot use it to forge other signatures or find the other private keys."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9mLWFtZXJpY2EtdG8taGFsdC1vcGVyYXRpbmctdW5saWNlbnNlZC1jcnlwdG8ta2lvc2tzLWluLWNvbm5lY3RpY3V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin of America to stop operating unlicensed crypto ATMs in Connecticut - Cointelegraph",
        "content": "Cryptocurrency and Bitcoin (BTC) ATM provider Bitcoin of America consented with the Connecticut Department of Banking to halt its operations due to a lack of licensing.\n\nIn a statement released on May 22, the Department of Banking highlighted that Bitcoin of America failed to obtain a proper license to operate Bitcoin ATM kiosks in the state. However, the consent order was enforced after four Connecticut consumers lost tens of thousands of dollars in a scam involving the kiosks in question. The state revealed:\n\n“As a result of the consent order, Bitcoin of America made restitution to these consumers totaling $86,000. Following a criminal indictment, Bitcoin of America is winding down operations here in Connecticut.”\n\nBanking commissioner Jorge Perez issued a warning against the use of unlicensed crypto kiosks. He stated that investors are often urged and tricked into depositing cash into the kiosks and transferring an equal amount of cryptocurrencies to the scammers.\n\nBitcoin of America — which allows the transfer of consumers’ funds to third parties — is required to be licensed as a money transmitter. Legislation is making its way through the state legislature to put more regulations and consumer protections in place and demand the licensing of digital currency kiosks as money transmitters in Connecticut.\n\nIn addition, the Connecticut State Police, Department of Banking, Office of the Attorney General and the Connecticut Department of Consumer Protection issued a scam alert against the use of unlicensed crypto and Bitcoin ATMs.\n\nIn March, 52 Bitcoin of America ATMs and kiosks suspected of being used in scams were confiscated in Ohio.\n\nRelated: Australia installs more Bitcoin ATMs than whole of Asia\n\nGeopolitical instability across the globe, compounded by a crackdown on unlicensed operations, has had a negative effect on the overall Bitcoin ATM network. In March alone, 3,627 crypto ATMs went offline, recording the largest-ever monthly decline of crypto ATMs.\n\nNet change of cryptocurrency machines installed and removed monthly. Source: Coin ATM Radar\n\nAs shown above, net crypto ATM installations declined for four months between September 2022 and March 2023.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNvbnNvbGlkYXRpb24tYXQtMjctMDAwLXNwYXJrcy1zcGVjdWxhdGlvbi1vZi1pbW1pbmVudC1idGMtYnJlYWtvdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin price consolidation at $27,000 sparks speculation of imminent BTC breakout - Cointelegraph",
        "content": "Bitcoin’s price has stabilized near $27,000 since May 13, displaying reduced volatility in the period. This movement is eerily similar to early April, when Bitcoin’s (BTC) 12-hour chart ranged between $27,800 and $28,700 for 11 days. Traders are now questioning whether a bullish breakout is the next possible outcome for the Bitcoin price.\n\nBitcoin/USD price index, 12-hour. Source: TradingView\n\nAccording to technical analysis, the sideways movement illustrates an ongoing conflict, meaning traders are unsure about the direction of Bitcoin’s next price trend. This is a consequence of balanced demand between buyers and sellers, which typically precedes periods of extreme price volatility and is triggered by big events.\n\nIn other words, Bitcoin traders are waiting for a potential market trigger that could decisively push the BTC price in either direction. For instance, on May 25, the United States Bureau of Economic Analysis will announce the annualized gross domestic product (GDP) for the first quarter. This data will be followed by U.S. durable goods orders on May 26, which measures the cost of orders received by manufacturers.\n\nA separate debate concerns the U.S. debt ceiling fight, with talks remaining deadlocked last week. Bipartisan negotiations are underway to lift the debt limit to avoid a U.S. government default ahead of June 1, but no agreement is in sight. In short, Republicans are demanding several cuts in government spending as contingencies.\n\nAnalyzing whether the Bitcoin derivatives market structure resembles the early April period is the first step to understanding the odds of breaking above $29,000 if the macroeconomic environment allows.\n\nBitcoin futures markets display reduced demand from bulls\n\nBitcoin quarterly futures are popular among whales and arbitrage desks, but these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, BTC futures contracts in healthy markets should trade at a 5% to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nBitcoin 2-month futures annualized premium. Source: Laevitas\n\nThere’s little similarity between the early April bullish breakout and the current status of the Bitcoin futures premium. Even though the 4% level seen on April 10 was below the neutral 5% threshold, it represented an increase from two weeks prior.\n\nIn contrast, the indicator presently stands at 2%, in line with the previous two weeks, so traders are currently less optimistic in comparison to early April.\n\nBitcoin options pricing is perfectly balanced between bulls and bears\n\nTraders should also analyze options markets to understand whether the recent correction has caused investors to become more optimistic. The 25% delta skew is a telling sign of when arbitrage desks and market makers overcharge for upside or downside protection.\n\nIn essence, if traders anticipate a Bitcoin price drop, the skew metric will rise above 7%, and phases of excitement tend to have a negative 7% skew.\n\nBitcoin 30-day options 25% delta skew. Source: Laevitas\n\nAs displayed above, according to the BTC options 25% delta skew, traders flirted with excessive optimism on March 30 but reverted to a neutral stance by April 10. That is the perfect positioning for a surprise rally, as traders were gradually losing faith, according to options pricing.\n\nOn the other hand, the most recent range trading period initiated on May 13 displayed balanced pricing between the call and put options, perfectly reflecting how unsure traders are due to uncertain macroeconomic conditions.\n\nThe derivatives market differs from early April\n\nBitcoin options and futures markets indicate little to no resemblance to early April, when the BTC price ended its 11-day low-volatility period. That time around, Bitcoin rallied 8% from $28,300 to $30,800 in less than 24 hours.\n\nThat doesn’t necessarily mean a similar outcome is impossible if Bitcoin’s present 10-day sideways movement near $27,000 ends up breaking to the upside. Still, a bullish breakout is less likely, considering BTC options traders are pricing similar risks for upside and downside movements.\n\nMoreover, the overall sentiment according to Bitcoin futures is neutral to bearish, which is unchanged when compared to the past couple of weeks.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tdG9wLTEwLWNyeXB0b3MtZmFsbC1leGNlcHQtdHJvbi_SAUFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLXRvcC0xMC1jcnlwdG9zLWZhbGwtZXhjZXB0LXRyb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin, top 10 cryptos fall except Tron - Forkast News",
        "content": "Bitcoin, Ether and most other top 10 non-stablecoin cryptocurrencies by market capitalization dropped on Monday afternoon in Asia, with Solana leading losses. U.S. stock futures rose slightly. Asian equity markets gained after U.S. President Joe Biden’s comments that he expects U.S.-China relations to improve. China’s central bank kept its benchmark lending rates unchanged on Monday.\n\nSee related article: Weekly Market Wrap: Bitcoin trades below US$27,000 amid U.S. debt ceiling negotiations\n\nBitcoin, Ether extend losses\n\nBitcoin lost 0.8% to US$26,851 in 24 hours to 4 p.m. in Hong Kong, according to CoinMarketCap data. The world’s biggest cryptocurrency has lost 2.03% in the last seven days.\n\nCrypto exchange OKX has listed Ordi (ORDI), a BRC-20 token that utilizes ordinals and inscriptions to create and manage digital assets on the Bitcoin blockchain, it said in an emailed statement. The announcement came after OKX Wallet enabled viewing and transfer of Bitcoin ordinals, after it started supporting BRC-20 trading with the launch of its Ordinals Marketplace.\n\nThere are currently over 8.4 million Ordinals inscriptions on the Bitcoin network, according to data from Dune.\n\nEther, the world’s second largest cryptocurrency, dropped 0.35% to US$1,811, bringing its weekly losses to 0.98%.\n\nSolana was the biggest loser of the day, declining 2.86% to US$19.71 in the last 24 hours. It is also the biggest loser of the week, dropping 7.92% in the last seven days.\n\nTron was the only token in the top 10 non-stablecoin cryptos to gain on Monday afternoon trade. It climbed 5.65% to US$0.07656, and has risen 9.37% in the last seven days.\n\nCrypto traders have been concerned over cryptocurrency exchange Gemini’s chief executive Cameron Winklevoss threatening on Jan. 20 to sue Digital Currency Group (DCG) for repayment of a US$900 million loan, after DCG firm Genesis filed for Chapter 11 bankruptcy. Its aggregated liabilities were worth about US$1 billion to US$10 billion to more than 100,000 creditors.\n\nThe U.S. Securities and Exchange Commission (SEC) in January charged cryptocurrency lender Genesis Global Capital and crypto exchange Gemini Trust with selling unregistered securities to retail investors through a lending program.\n\nThe total crypto market volume gained 30.38% to US$22.57 billion, while the global crypto market capitalization dropped 0.78% to US$1.12 trillion.\n\nEthereum’s 24-hour NFTs sales drop\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index fell 0.37% to 3,385.99 points in the 24 hours to 4:30 p.m. in Hong Kong but rose 1.20% during the week.\n\nEthereum’s 24-hour NFT sales decreased 21.42% to US$13.4 million, as sales for the Bored Ape Yacht Club, the largest Ethereum-based NFT collection, fell 44.81% to US$479,997. Mutant Ape Yacht Club sales rose 25.21% to US$1.07 million while 24-hour sales for Azuki rose 99.18% to US$757,066.\n\nNFT sales on Bitcoin also fell 14.98% to US$3.2 million, as interest in Space Pepes cooled, increasing 1.63% to US$40,321 in the past 24 hours, according to CryptoSlam data.\n\nAsian equities rise, U.S. futures muted on debt ceiling concerns\n\nStock market prices. Image: Envato Elements\n\nAsian equity markets gained on Monday after U.S. President Joe Biden commented that he expects a thaw or an improvement in U.S.-China relations “very shortly.”\n\nChina’s central bank kept its benchmark lending rates unchanged on Monday, in line with market expectations, after economic data over the past month showed that the world’s second biggest economy is yet to fully recover after three years of pandemic-induced disruptions.\n\nAnnual inflation in Hong Kong stood at 2.1% in April, close to market forecasts of 2% and higher than a rise of 1.7% in March.\n\nThe Shanghai Composite gained 0.39%, the Shenzhen Component Index rose 0.32% and Hong Kong’s Hang Seng Index climbed 1.17%. Japan’s Nikkei 225 strengthened 0.9% to a 33-year high after U.S. President Biden indicated positive sentiment over negotiations to avoid a default on the debt ceiling.\n\nMajor U.S. stock futures rose as of 4:30 p.m. in Hong Kong. The S&P 500 futures index inched up 0.012%, the tech-heavy Nasdaq-100 futures rose 0.027% and the Dow Jones Industrial Average futures gained 0.021%.\n\nInvestors are awaiting updates on the ongoing U.S. debt ceiling negotiations, scheduled to continue on Monday. This is less than two weeks to the June 1 deadline that Treasury Secretary Janet Yellen has warned repeatedly the government could default, if an agreement to raise the ceiling was not reached.\n\nFailure to raise the debt ceiling will result in a default that is likely to cause chaos in global financial markets and a spike in interest rates.\n\n“While a resolution of the [U.S.] debt ceiling crisis may provide a temporary relief rally, it doesn’t guarantee sustained market growth or shield against other market risks,” Nigel Green, chief executive of financial advisory firm deVere Group, said in an emailed statement on Friday.\n\n“While stock markets are enjoying this wave of buoyancy, core major bond markets continue to be marked by inverted yield curves, which suggest a recession is looming,” Green added.\n\nThe yield on the U.S. 10-year Treasury note fell by five basis points to 3.64% on Monday, reflecting the uncertainty regarding the debt ceiling crisis.\n\nThe U.S. Federal Reserve will release minutes of its May meeting on Wednesday, while U.S. personal consumption expenditure data is scheduled for release on Friday.\n\nInvestor sentiment in Europe also reflected caution, with the benchmark STOXX 600 rising 0.2% while Germany’s DAX 40 slipped 0.093% to 16,250 points from its all-time high of 16,332 points on Friday.\n\nConstruction output in the Euro area declined by 1.5% in March, compared to the same period last year, according to Eurostat. This marked the sharpest contraction in construction output since August 2021, adding to cautious market sentiment.\n\nSee related article: S.Korean lawmakers propose public officials disclose crypto holdings"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL2NyeXB0by1lZHVjYXRpb24vYml0Y29pbi1waXp6YS1kYXktYS1jZWxlYnJhdGlvbi1vZi1kZWNlbnRyYWxpemF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day — A celebration of decentralization - Kraken Blog",
        "content": "Pizza parties rarely need an explanation. But pizza parties on Bitcoin Pizza Day deserve one.\n\nThirteen years ago today, Laszlo Hanyecz created a thread in the bitcointalk.org forum titled Pizza for bitcoins? After some explanation and much discussion, Hanyecz found someone willing to buy him two pizzas (valued at ~$41) in exchange for his 10,000 bitcoin.\n\nAt bitcoin’s price today, those pizzas are worth ~$270,000,000.\n\nMany look back on Bitcoin Pizza Day as a cautionary tale that demonstrates why people HODL crypto for the long term. Yet, many others look to the future on this day while considering the unrealized potential of Bitcoin and the power of decentralization.\n\nUltimately, Bitcoin Pizza Day has become a celebration of Bitcoin’s viability as a complete “peer-to-peer electronic cash system” — just as Satoshi envisioned in the Bitcoin white paper.\n\nMoney (including cash) is generally defined as:\n\nA medium of exchange A unit of account A store of value\n\nOn this day more than a decade ago, the world saw that Bitcoin could be used as a medium of exchange. After all, Hanyecz was able to use Bitcoin while transacting with another individual — without any intermediary’s participation.\n\nYet, as time has gone on, Bitcoin Pizza Day has also become a reminder of the progress Bitcoin has made in the other two functions of money as well.\n\nAs individuals continue to exchange Bitcoin for goods and services — just as Hanyecz did years ago — Bitcoin’s viability as a global unit of account and independent store of value has also emerged. Days like today are a reminder that first proving its effectiveness as a medium of exchange is what has ultimately allowed Bitcoin to prove its legitimacy as a globally recognized unit of account and self-sovereign store of value as well.\n\nBitcoin Pizza Day is a celebration of cryptocurrency and blockchain technology’s effectiveness in decentralizing information. It is also a celebration of Bitcoin’s reliability as a sound form of money.\n\nFor many others, Bitcoin Pizza Day is a celebration of the crypto values Kraken embodies and the mission we deliver on each day. It is a celebration of the freedom that Bitcoin brings back to individuals’ ability to connect and transact.\n\nCelebrate Bitcoin Pizza Day with Kraken Kraken makes it easy to share the gift of financial freedom on Bitcoin Pizza Day. Invite your friends to Kraken and you’ll each get $10 in BTC through our referral program.* You can also use Kraken to send Bitcoin around the world in seconds using our Lightning Network integration. Lightning Network is a highly secure and cost-effective way to send Bitcoin to anyone — with almost no fees. Have a Happy Bitcoin Pizza Day and count on Kraken while sharing the gift of Bitcoin today! Get started with Kraken *Geographic restrictions apply"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNsaW1icy1wYXN0LTI3LTRrLTIxNTIyMjMzNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin Climbs Past $27.4K but Remains in Holding Pattern as Investors Continue U.S. Debt Limit Vigil - Yahoo Finance",
        "content": "Stocks dropped but bitcoin (BTC) continued its stodgy ways in Tuesday trading.\n\nThe largest cryptocurrency by market capitalization was recently trading near $27,200, up 1.1% over the past 24 hours. Bitcoin topped $27,400 shortly before European equity markets opened. For nearly two weeks, BTC has stood range-bound between $26,500 and $27,500 as investors fret over ongoing crypto regulatory issues that have sapped liquidity from markets and macroeconomic uncertainties, including the recent U.S. debt ceiling stalemate.\n\n“After the market tumult of 2022, sideways movement has felt a lot better than downward movement,” Tim Frost, CEO of digital wealth platform Yield App, quipped in an email to CoinDesk, although he added that “it does feel like crypto markets are stagnating. Right now, we simply have existing liquidity moving around in different directions, with really only the crypto true believers and active traders still participating.”\n\nFrost noted that the crypto market’s current capitalization of about $1.3 trillion has remained at a near standstill from a year ago. “There doesn’t yet seem to be a catalyst on the horizon that could move things in either direction,” Frost wrote. “The global macro picture remains uncertain, although more positive, with inflation falling in the US and potentially in the UK and EU in the coming months. Right now, though there’s not much shaking.”\n\nThe latest reading on U.S. inflation, based on the Consumer Price Index, came in below 5% for the first time since early 2021, although it remains well above the Federal Reserve's goal of 2%.\n\nEther (ETH) also remained in its two-week range, changing hands at $1,850, up roughly 1.6% over 24 hours. Most other major cryptos were in positive territory, albeit not by much, with APT and SOL, the native tokens of the Solana and Aptos smart contracts platforms, recently rising 3.8% and 2.1%, respectively. The CoinDesk Market Index, a measure of crypto markets performance, recently rose 1.1%.\n\nStory continues\n\nStocks fell amid debt limit anxieties, with the technology-focused Nasdaq Composite closing down 1.2% a day after reaching a 2023 high, and the S&P 500, which has a hefty tech component, and Dow Jones Industrial Average (DJIA) declining 1.1% and 0.6%, respectively.\n\nYields on 2- and 10-year Treasurys both reached near their highest levels since March before ticking downward slightly.\n\nCrypto markets received a modest boon on Monday when a leaked document seen by CoinDesk showed a willingness by the European Commission willing to moderate an earlier tough stance on crypto and make it easier for commercial lenders to hold stablecoins and tokenized assets.\n\nMeanwhile, in an email to CoinDesk, Strahinja Savic, head of data & analytics at Canada-based FRNT Financial, wrote that the correlation between the S&P 500 and bitcoin has been dropping since April to -0.23.\n\n“This break in correlation between bitcoin and traditional assets has been a prevailing theme that seems to be continuing in 2023,” Savic wrote. “As some macro catalysts come to a head, like the debt ceiling debate or Fed rate policy, it will be interesting to watch how much bitcoin has decoupled from the broader market.”\n\nSavic also noted that the percentage of bitcoin’s total supply “has remained unmoved for over a year, reaching a new record of 62.13%. “Bitcoin ‘hodlers’ remain committed to the asset at the moment,” he wrote.\n\nUPDATE (May 23, 2023, 22:33 UTC): Adds recent CoinDesk Market Index."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXBpenphLWRheS0yMDIzLWNvbW11bml0eS1yZWFjdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day 2023: Community celebrates anniversary of first known BTC transaction - Cointelegraph",
        "content": "Members of the crypto community celebrated the anniversary of Bitcoin Pizza Day; the first notable exchange of Bitcoin (BTC) into physical goods.\n\nOn May 22, 2010, Laszlo Hanyecz made the first documented purchase of a good with BTC. The exchange involved 10,000 BTC — worth $41 at the time — and two pizzas from a local restaurant in Florida. The milestone turned into an annual celebration for the crypto space as community members reminisced on how far the industry has come since the transaction.\n\nSimilar to previous years, crypto fans celebrated the day by eating pizza, with Bitcoiners in Indonesia sharing a photo of themselves eating pizza in Bali.\n\n#Bitcoin pizza day with bunch of bitcoiners in Bali pic.twitter.com/WbeHx02Xlq — Dea Rezkitha (@dearezkitha) May 21, 2023\n\nMeanwhile, crypto exchanges also joined in on the pizza-eating fun. Crypto exchange Binance served pizza in Naples, Italy, while trading platform OKX shared a photo of its employee’s lunch as it geared up for the day.\n\nWhile many others were busy eating pizza, some took the time to appreciate Jeremy Sturdivant, the person on the other end of the now-famous transaction. One Bitcoiner described Sturdivant as the “true hero” of the story.\n\nRedditors are curious about where the BTC went. Source: Reddit\n\nOn Reddit, community members shared their curiosity about the fate of the 10,000 BTC spent on the pizza. Some speculated that Sturdivant sold the coins after the price increased by five or 10 times, while others thought he might have lost the keys.\n\nAt the time of writing, 10,000 BTC is worth around $268 million.\n\nRelated: Bitcoin FOMO is gone, portfolio managers are taking BTC seriously\n\nWhile the Bitcoin pizza transaction is widely recognized as the first physical goods exchange using BTC, some speculate that there may be a sale that preceded it. On May 14, Crypto Twitter was set ablaze as people considered the possibility of an image being sold in exchange for 500 BTC months before the pizza purchase. Bitcoin creator Satoshi Nakamoto was also involved in the sale.\n\nMagazine: Best and worst countries for crypto taxes — Plus crypto tax tips"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXBpenphLWRhedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "When pizza became the unsung hero of Bitcoin's history: A cheesy celebration - Cointelegraph",
        "content": "There are key events in the fascinating world of cryptocurrencies that have shaped the trajectory of adoption. One such occasion is commemorated annually as Bitcoin Pizza Day: a commemoration of a seemingly unremarkable transaction that had a profound effect on the development of Bitcoin (BTC).\n\nSo, on Bitcoin Pizza Day, let’s indulge in a cheesy celebration. Let’s remember the unsung hero that brought Bitcoin into the real world; a simple slice of pizza that captured the imagination of a community and played a part in the remarkable journey of Bitcoin.\n\nA historic event took place on May 22, 2010\n\nA remarkable event unfolded in the early days of Bitcoin when the idea of digital currencies was still in its infancy. A fervent Bitcoin supporter, Laszlo Hanyecz, requested a pizza on an internet forum and offered a mind-blowing 10,000 BTC as payment. It was a light-hearted request meant to demonstrate Bitcoin’s potential as a medium of exchange.\n\nRelated: Why do we need cryptocurrencies?\n\nWhat happened next would become legendary: Hanyecz received two pizzas at his doorstep after pizza restaurant chain Papa John’s accepted his offer. A pizza slice emerged at that precise time as the unsung Bitcoin hero. Little did he know that this simple request would become an iconic moment, forever commemorated as Bitcoin Pizza Day. This transaction and straightforward exchange highlighted a significant turning point in the evolution of digital currency.\n\nBitcoin did not have much value at the time. It was an experiment and idea supported by a small group of tech enthusiasts. However, when Bitcoin became more well-known and valuable in the wider world, the significance of the pizza transaction became clearer.\n\nA reminder: The success of cryptocurrencies is built on the collective efforts\n\nAs a whimsical celebration, Bitcoin Pizza Day honors Bitcoin’s development from its humble beginnings to the global phenomenon it is today. It serves as a reminder that even seemingly insignificant, unimportant transactions can have far-reaching effects and leave a permanent imprint on history.\n\nBeyond its symbolic meaning, Bitcoin Pizza Day embodies the communal spirit of the cryptocurrency community. This celebration highlights the innovative and socially conscious nature of the Bitcoin industry. It emphasizes the relationships and shared experiences created around a cheesy treat that unintentionally played a significant role in the emergence of Bitcoin and other cryptocurrencies.\n\nRelated: Bitcoin FOMO is gone, portfolio managers are taking BTC seriously\n\nEvents like Bitcoin Pizza Day bring people together who are passionate about decentralized technologies, innovation and digital currencies. It serves as a reminder that a lively community’s efforts and shared values are the foundation for the success of cryptocurrencies.\n\nSo, as you bite into your favorite slice of pizza, take a moment to appreciate the disruptive power of cryptocurrencies and the role they continue to play in empowering individuals, enabling them to take control of their finances and transact seamlessly across borders, bypassing the limitations and intermediaries of traditional banking systems."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXZvbGF0aWxpdHktZHJvcHMtYW1pZC1kZWNsaW5lLWluLWxpcXVpZGl0eS1idXQtYS1wb3NzaWJsZS1jYXRhbHlzdC1pcy1hcHByb2FjaGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin volatility drops amid decline in liquidity, but a possible catalyst is approaching - Cointelegraph",
        "content": "Bitcoin (BTC) price has consolidated within a tight range as hodlers remain hardened and new liquidity is not arriving.\n\nWhile Bitcoin is typically a highly volatile asset, weekly consolidation around a slight 3.4% price range has many analysts feeling that BTC price is stuck. Others are anticipating an uptick in volatility. While the lack of Bitcoin price action is partially due to long-term hodlers' conviction and the trickle of new liquidity entering the market, BTC has still outperformed many assets in 2023.\n\nAccording to a new Glassnode report, on-chain data provides key indicators on Bitcoin’s price.\n\nUnrealized profits up, volume down\n\nBitcoin price liquidity remains cyclically low in realized terms. This may be because many investors are breaking even near the current Bitcoin price.\n\nBitcoin’s price is mirroring historically oversold levels with 9% of unrealized profit remaining in the market.\n\nBitcoin unrealized profit ratio. Source: Glassnode\n\nDespite the rise in transactions due to text-based ordinals, Bitcoin volume remains muted. The lack of liquidity magnifies Bitcoin investors' accumulation strategy even with unrealized profits, showing a solidification of sentiment among long investors. Bitcoin on-chain transfer volumes remain below $4 billion, much lower than the all-time high of over $13 billion.\n\nBitcoin transfer volume. Source: Glassnode\n\nAs a result of the minimal unrealized profits and low liquidity, there is minimal incentive for hodlers to sell.\n\nRelated: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?\n\nSeasoned Bitcoin hodlers increase their wealth\n\nThe May 2021 Bitcoin drop that saw prices fall from $56,000 to $29,000 led to many traders accumulating BTC. With these buyers currently underwater from a profit-perspective, their wealth continues to expand compared to other groups.\n\nThe May 2021 accumulation group’s wealth is up 25% compared to other groups. When looking at Bitcoin hodlers from six months to two years, both are currently at a loss.\n\nBitcoin hodler cohorts. Source: Glassnode\n\nHodlers from the 2021 cycle have been through pain and multiple Bitcoin cycles at this point. The conviction is allowing them to increase their wealth ratio with weaker hands exiting.\n\nBitcoin is up, banks are down\n\nAnalysts continue to fret about the impact of a U.S. debt default and the impact this would have on BTC price.\n\nWhile Bitcoin price typically mirrors the macro markets, BTC has performed better than equities since the U.S. regional bank run.\n\nBitcoin performance against equities. Source: Delphi Digital\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2luLW1pbmluZy1jb250cm92ZXJzeS1hbmQtdGhlLWNhc2Utb2YtZ3JlZW5pZGdlLWdlbmVyYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin Mining Controversy and the Case of Greenidge Generation - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wZXBwZXJvbmktYml0Y29pbi1waXp6YS1kYXktd29ydGgtdG9kYXktYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "The pepperoni on the first pizza bought with Bitcoin is worth $6.5M today - Cointelegraph",
        "content": "It’s been 13 years since programmer Laszlo Hanyecz made the first commercial transaction with Bitcoin (BTC) on May 22, 2010, buying two supreme pizzas from Papa John’s for a whopping 10,000 BTC, or $266 million at current prices.\n\nThat day is known and celebrated as Bitcoin Pizza Day.\n\nTo commemorate the occasion, Cointelegraph sought to find out the answer to one more burning question. How much did it cost to construct these two famous pizzas?\n\nThe supreme pizzas purchased by Hanyecz in 2010. Source: Internet Archive\n\nTo answer this, it is assumed that Hanyecz ordered Papa John’s “The Works” pizza, which is the pizza chain’s version of a supreme pizza.\n\nConsidering the amount required and the price of ingredients at the time, here’s what it would have cost to put together just one of the Bitcoin Pizzas, not including labor, overhead and the pizza base.\n\nPepperoni: 244 BTC = $6.5 million\n\n244 BTC = $6.5 million Bacon: 146 BTC = $3.8 million\n\n146 BTC = $3.8 million Italian sausage: 97 BTC = $2.5 million\n\n97 BTC = $2.5 million Onions: 24 BTC = $640,000\n\n24 BTC = $640,000 Green peppers: 36 BTC = $960,000\n\n36 BTC = $960,000 Mushrooms: 63 BTC = $1.6 million\n\n63 BTC = $1.6 million Black olives: 121 BTC = $3.2 million\n\n121 BTC = $3.2 million Cheese: 730 BTC = $19.4 million\n\nTotal cost of ingredients: 1,461 BTC, or $39 million. Talk about an expensive feast.\n\nHistory of Bitcoin Pizza Day\n\n“Bitcoin Pizza Day” marks the world’s first transaction for real-world goods using Bitcoin and celebrates the massive rise in the value of the cryptocurrency since then, which was worth only $0.0041 in May 2010 and is now worth over $26,500 at current prices.\n\nIn the end, Hanyecz’s pizza order was delivered four days after he posted his request on May 18, 2010, on the Bitcointalk forum.\n\nRelated: Primordial NFT? Someone tried to sell a JPG for BTC months before Bitcoin Pizza Day\n\n“I'll pay 10,000 bitcoins for a couple of pizzas,” he wrote, saying those who take up the request “can make the pizza yourself and bring it to my house or order it for me from a delivery place.”\n\n13 years ago tomorrow the first #Bitcoin purchase was made. Two pizzas were bought for 10k BTC, which at that time was equivalent to $40.\n\n\n\nBitcoin pizza day ahead. celebrate with a slice! pic.twitter.com/owdaA2AtBj — Pentoshi euroPeng (@Pentosh1) May 21, 2023\n\nJeremy Sturdivant, a 19-year-old university student at the time, delivered the now-famous pizzas for the Bitcoin haul on May 22, 2010. He told Cointelegraph in 2018 that he sold them to afford a holiday and had “never seen Bitcoin as an investment.”\n\nHanyecz said he didn’t regret it, and his early work on Bitcoin led him to code a program that made it possible to mine the cryptocurrency on computer graphic processing units.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN1cHBseS1jcnlwdG8tZXhjaGFuZ2VzLWZhbGxzLTA4MjY1NDcwOC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin supply on crypto exchanges falls to multi-year low - Yahoo Finance UK",
        "content": "Cryptocurrency exchanges now hold approximately 1.89 million bitcoin, a drop from 2.22 million in May 2022. Photo: Getty (Namthip Muanthongthae via Getty Images)\n\nThe supply of bitcoin across all cryptocurrency exchanges has fallen to its lowest level since December 2017.\n\nBitcoin (BTC-USD) fell 1.3% to $26,779 on Monday while ether (ETH-USD) was down 0.8% to $1,806.\n\nOver the past month, bitcoin's price has primarily consolidated, reducing its value by just 2%, according to Coingecko.\n\nThere has been a 14.87% decline in the amount of Bitcoin held on all exchanges over the past year, according to data from Coinglass.\n\nRead more: Crypto live prices\n\nCryptocurrency exchanges now hold approximately 1.89 million bitcoin, a drop from 2.22 million in May 2022.\n\nEthereum reserves have fallen to the same level seen in 2015, when the cryptocurrency debuted.\n\nADVERTISEMENT\n\nInventors are moving cryptocurrencies off exchanges and into personal crypto wallets, indicating a growing trend towards self-custody among traders.\n\nThe move also creates less liquid supply on exchanges, indicating that a short term price rise could occur if demand for bitcoin or ether should increase.\n\nIt comes as US president Joe Biden has said he will not agree to a debt deal that protects \"tax cheats and crypto traders\".\n\nAt a meeting of the G7 heads of state in Hiroshima, Japan, on 21 May, he called on Republican lawmakers to work towards a compromise in the ongoing debt ceiling talks.\n\nRead more: Bitcoin shows bullish signals after Janet Yellen warns US could be 'out of cash by early June'\n\n“I’m not going to agree to a deal that protects wealthy tax cheats and crypto traders while putting food assistance at risk for nearly a hundred — excuse me — nearly 1 million Americans,\" Biden said.\n\n\"Protections for crypto traders\" is believed to refer to tax-loss harvesting.\n\nThe White House and Republican leaders are currently engaged in talks about potentially preventing this mechanism from applying to cryptocurrency transactions, according to the Washington Post.\n\nWatch: Japan vies to be 'number one again through web3 innovation' | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS90aGlzLXllYXJzLWJpdGNvaW4tcGl6emEtZGF5LWNvdWxkLW1ha2Utb3ItYnJlYWstYnRjLWhlcmVzLWhvdy_SAVlodHRwczovL2FtYmNyeXB0by5jb20vdGhpcy15ZWFycy1iaXRjb2luLXBpenphLWRheS1jb3VsZC1tYWtlLW9yLWJyZWFrLWJ0Yy1oZXJlcy1ob3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "This year’s Bitcoin Pizza Day could make or break BTC- Here’s how - AMBCrypto News",
        "content": "Bitcoin’s price on the remembrance inched closer to 2022’s value.\n\nThe coin might face rejection or break out due to the tight trading range.\n\nEvery 22 May marks Bitcoin [BTC] pizza day. And this year, the king coin price floated around $26,850, according to data from CoinMarketCap. The event is an annual celebration to mark the first commercial use of the digital asset in a transaction.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nAlthough this year is the thirteenth commemoration, the incident happened in 2010, when Laszlo Hanyecz, a programmer, exchanged 10,000 Bitcoins for two pizzas. During this period, the coin’s worth was less than a penny.\n\nInterestingly, the BTC price on the same day in 2022 was closer to the price this time, especially as it occurred at a time when the broader market was suffering the consequences of the Terra Luna [LUNA] and Terra [UST] crash. So, what could happen to BTC’s value this time?\n\nMake or mar season\n\nAccording to Michaël van de Poppe, BTC’s classy choppy pattern could either help it race beyond $27,200 or face a rejection around the same area.\n\nClassic choppy pattern on #Bitcoin. Rejects at $27,200 and consolidates, as CME gap is also around $26,900.#Bitcoin needs to break and flip $27,200 if we want to see any sustained momentum. Beneath us, at around $26,000-26,500 -> 200-Week MA. pic.twitter.com/4rvuHLyjxe — Michaël van de Poppe (@CryptoMichNL) May 21, 2023\n\nA choppy pattern occurs when bulls (buyers) and bears (sellers) are roughly even when it comes to control. Here, the asset value is often linked with volatile periods and rectangular patterns. This makes it extremely difficult to trade.\n\nBefore his recent opinion, the technical analysis specialist had also referred to BTC’s historical performance. Like the aforementioned point, he considered the 200-day Moving Average (MA), noting that it could be a “make or break” week for BTC. Poppe said,\n\n“If you go back in history, the 200-MA retest is a great period to accumulate. In the past 6 months, Bitcoin has been swimming beneath for a long period, making it the most undervalued since existence. Next week is make-or-break. Fast breakout upwards -> end of correction.”\n\nOf the rise and increased adoption\n\nHowever, there have been some positive happenings in BTC since the last Pizza Day. According to Santiment, the total number of holders one year ago was 42.08 million.\n\nAt press time, the same metric was 47.6 million. The increase in the number of holders means that BTC adoption has improved despite the series of capitulations within the period.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nWhen it comes to the transaction count, it was also a similar case. As expected, this transaction count has been unsteady. The metric was 479,000 — almost double the number it was the previous year. The hike implied that many addresses were now optimistic about trading the underlying coin.\n\nIn conclusion, Bitcoin Pizza Day does not only represent a time to look at the above event, but it also reflects a season to explore the coin growth over the years."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmludGVjaG1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9tcHMtY2FsbC1mb3ItYml0Y29pbi10by1iZS1yZWd1bGF0ZWQtYXMtZ2FtYmxpbmctaW4tdGhlLXVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "MPs call for Bitcoin to be regulated as gambling in the UK - FinTech Magazine",
        "content": "MPs in the United Kingdom are looking to establish more regulations around cryptocurrency trading. The Treasury Committee has released a report, stating crypto should be regulated as gambling, recommending that the UK Government regulate unbacked cryptoasset activities.\n\nThis subject remains relevant against the current backdrop of financial inclusion, where Crypto regulations could impact its accessibility. Currently, the only regulations for cryptocurrency are set around anti-money laundering (AML) and anti-terrorism funding. However, some MPs across the Government are calling for greater rules to be put in place, such as financial services trading regulations being assigned to crypto, or even gambling regulations.\n\nHarriett Baldwin MP: “Effective regulation is clearly needed”\n\nCommenting on the report, Harriett Baldwin MP, Chair of the Treasury Committee, says: “The events of 2022 have highlighted the risks posed to consumers by the cryptoasset industry, large parts of which remain a wild west. Effective regulation is clearly needed to protect consumers from harm, as well as to support productive innovation in the UK’s financial services industry.”\n\nThe report itself states that cryptocurrencies like Bitcoin, for instance, have ‘no intrinsic value’ and ‘serve no useful social purpose’, whilst being used by criminals in scams, fraud and money laundering.\n\nConcerns were also raised for regulating consumer crypto trading as a financial service, which MPs say will create a so-called ‘halo effect’ - ultimately leading consumers to believe that it is a safe and protected activity when MPs do not think it is.\n\nCurrently, around 10% of UK adults hold or have helo cryptoassets, according to HM Revenue & Customs.\n\nCryptoUK speaks out against gambling comparison\n\nJonathan Millet, a Business Consultant at NewsBTC, shared his insight on the proposed regulations, saying; “because tangible currencies or assets do not back cryptocurrencies, the market has the potential to be volatile and, along with substantial financial gains, they too come with the risk of substantial financial losses.\n\n“MPs and UK lawmakers fear if the same regulations as financial services are applied, a false sense of security around the level of risk involved is created.”\n\nMillet also says that CryptoUK, the self-regulatory crypto trading association, has spoken out in strong disagreement about the comparison between gambling and crypto trading.\n\n“The association has taken Umbridge to the claims of the Treasury Select Committee, saying they are harmful, false and unfounded.”\n\nAccording to Millet, professional investment managers see Bitcoin, as well as other crypto assets, as a new alternative investment strategy and not as a form of gambling. His belief is that crypto trading has plenty to offer the financial trading and services sector.\n\n“Many of these benefits are not openly discussed and include quicker settlement times, automation of contracts through AI, cost reductions through relevant intermediary services and enhanced liquidity.\"\n\n“Better collaboration is needed [with] the UK government”\n\nMillet continued: “Consumer risks, of course, exist, and these should be mitigated through education awareness and a more robust framework giving clarity on the regulatory landscape in which they operate.”\n\nThis would involve dedicated sources of information surrounding the risks involved in consumer crypto trading, which Millet believes should be widespread and on openly available platforms.\n\n“Better collaboration is needed between CryptoUK, and the UK Government to increase education and elevate consumer awareness through campaigning and advertising,” he says.\n\n“We believe creating bespoke regulatory frameworks, tailored to suit constant industry changes and developments will ensure the FCA is positioned to give the best duty of care to all individuals.”\n\nLikewise, Nick Jones, Co-Founder and CEO of Zumo has spoken out against the Treasury Committee’s report, stating: “What an appalling backward step this would be.”\n\nJones continues: “The UK should be looking to encourage alternative financial solutions, not discouraging them by likening them to gambling. A truly resilient future financial system shouldn’t be resistant to new ideas and structures, rather it should be supportive of them. And it should dare to integrate new ideas where they provide genuine value – not panic and revert to the perceived safety of failing methods.”\n\n"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZW4taW4vbmV3cy1hbmQtdHJlbmRzL2JpdGNvaW4tcGl6emEtZGF5LWNlbGVicmF0aW5nLXRoZS1jb3N0bGllc3QtcGl6emEtaW4tdGhlLzQ1MjYwNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: How Cryptocurrency Has Moved Further Than Just buying Pizza - Entrepreneur",
        "content": "The 10,000 BTC would now be valued at around USD 270 million today, valued at USD 26,833.55. In November 2021, BTC reached an all-time high of USD 68,789, which would have made Hanyecz worth around $690 million had he not ordered the infamous pizzas\n\nOpinions expressed by Entrepreneur contributors are their own.\n\nYou're reading Entrepreneur India, an international franchise of Entrepreneur Media.\n\nThe curious case of a Floridian programmer named Laszlo Hanyecz and his purchase of two pizzas worth 10,000 Bitcoin in 2010 precisely tells you about the true volatile nature of cryptocurrencies such as Bitcoin.\n\nOn May 18, 2010, Hanyecz took to the Bitcointalk.org forum to announce his decision to pay 10,000 BTC to anyone willing to place an order of two pizzas, preferably two large pies for him. No one took his offer until May 22, when 19-year-old Jeremy Sturdivant accepted his offer.\n\nThe two large-size Papa John's pizzas were delivered to Hanyecz's place in Florida and cost USD 41 then. Hanyecz took to the forum to share the image of the pizzas along with his family.\n\nVia Twitter\n\nThe 10,000 BTC would now be valued at around USD 270 million today, valued at USD 26,833.55. In November 2021, BTC reached an all-time high of USD 68,789, which would have made Hanyecz worth around $690 million had he not ordered the infamous pizzas.\n\nWhile talking to CBS in 2019, Hanyecz looked back and shared, \"The transaction made [Bitcoin] real for some people. It certainly did for me.\" And today is marked as Bitcoin Pizza Day to celebrate the potential of the then-nascent cryptocurrency.\n\nThe leap of faith\n\nCurrently, there as over 22,000 cryptocurrencies in existence across the world, with BTC being the most valued fiat currency. While there are 235 crypto exchanges existing globally, with Binance being the biggest player.\n\nThe acceptance and adoption of cryptocurrency in 2023 could certainly not have been predicted back in 2010. Banks, corporates, startups, and governments are all embracing the technology and working towards harnessing its full capabilities.\n\nNow, cryptocurrency is the backbone of several emerging industries and ventures. Luxury fashion house Ralph Lauren in April 2023 opened its Miami concept store and partnered with Bitpay to become the first-ever store to accept cryptocurrency. \"Miami is the first of our stores to accept cryptocurrency,\" the brand shared on LinkedIn.\n\nBack in August 2022, Gucci announced it was accepting ApeCoin for purchases at select stores in the United States, \"Now accepting @ApeCoin payments via @BitPay, select Gucci boutiques in the USA expand the range of cryptocurrencies available for in-store purchases, yet another step in the House's exploration of Web3.\"\n\nSome of the big names who are accepting BTC include Microsoft, Burger King, KFC, and Starbucks. Delhi's Ardor 2.1 became the first Indian restaurant to accept cryptocurrency. It was also offering a 20 per cent discount for customers paying via crypto.\n\nIn September 2021, El Salvador became the first country to accept Bitcoin as a legal tender.\n\nThe significance\n\nRajagopal Menon, vice-president, WazirX, shared, \"Bitcoin Pizza Day symbolises the remarkable evolution of the Bitcoin and crypto space over the past decade. From the humble purchase of two pizzas for 10,000 bitcoin to its current total capitalisation of over half a trillion, Bitcoin has come a long way. This transaction heralded the current widespread adoption and showcases the transformative power of cryptos and their emergence as a legitimate asset class in the global financial landscape.\"\n\n\"It is important to note that the real significance lies in the recognition of this transaction as the first real-world use case for Bitcoin, demonstrating its potential as a decentralized digital currency. Bitcoin Pizza Day serves as a reminder of the rapid growth and adoption of cryptocurrencies, highlighting the journey from a seemingly trivial transaction to a global phenomenon. It symbolizes the early believers and pioneers who played a key role in establishing Bitcoin as a viable alternative to traditional financial systems,\" notes Sathvik Vishwanath, Co-Founder & CEO, Unocoin.\n\n\"Bitcoin Pizza Day is a testament to the power of community and the growing acceptance of BTC as part of our daily lives,\" said Yi He, co-founder and chief marketing officer, Binance."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNpdHlpbmRleC5jb20vZW4tdWsvbmV3cy1hbmQtYW5hbHlzaXMvYml0Y29pbi1ldGhlcmV1bS1hbmFseXNpcy1hd2FpdGluZy1hLWJyZWFrLWluLWJ0Y3VzZC1hbmQtZXRodXNkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum analysis: Awaiting a break in BTC/USD and ETH/USD - City Index UK",
        "content": "Bitcoin and Ethereum takeaways\n\nBitcoin and Ethereum have not shown a strong correlation with the Nasdaq 100 or gold this month.\n\nBitcoin continues to consolidate around $27K, but remains within a longer-term bullish trend for now.\n\nEthereum is showing signs of a bullish breakout today, potentially opening a door for a move up to $2,000 next.\n\nBitcoin and Ethereum fundamental analysis\n\nEver since cryptoassets like Bitcoin and Ethereum have been widely investable, investors have debated where the asset class should sit in a portfolio.\n\nAre they most similar to “store of value” commodity like gold?\n\nOr are they more akin to volatile risk assets such as the Nasdaq 100?\n\nThe cynics would even argue that they’re merely a bubble that will inevitably disappear, though that argument becomes less and less compelling every day as Bitcoin approaches the 15th anniversary of its “Genesis Block” on January 3rd 2009.\n\nEven over nearly a decade and a half, the answer remains elusive. Take the price action over the course of this month as an example: Gold has struggled amidst strength in the US dollar, whereas the Nasdaq 100 has surged after a strong earnings season…while Bitcoin and Ethereum remain essentially unchanged:\n\nSource: Tradingview, StoneX\n\nTo put some numbers on this, Bitcoin’s 30-day correlation with the Nasdaq 100 has fallen to -0.61, its lowest level since late 2022 (and June 2021 before that), and the equivalent correlation coefficient with gold sits at 0.30, near a two-month low.\n\nLooking ahead, simmering financial issues like the US debt ceiling debate and global banking sector stresses could boost cryptoassets if they boil over in the days and weeks to come, but for now, interest and volatility in the cryptosphere remains subdued.\n\nBitcoin technical analysis – BTC/USD daily chart\n\nLooking at Bitcoin’s chart, traders are waiting for a definitive break away from the $27K level that has magnetically pulled prices back consistently for the past two weeks. The cryptocurrency is still holding above its rising 100- and 200-day EMAs, suggesting the longer-term trend remains in favor of the bulls for now, so as long as support in the lower-$26K range holds, swing traders may maintain a bullish bias.\n\nSource: Tradingview, StoneX. Please note this market may not be available in your region.\n\nA break below that support zone would confirm a modified head-and-shoulders pattern and point to a deeper retracement toward the 200-day EMA near $25K at a minimum.\n\nEthereum technical analysis – ETH/USD daily chart\n\nEthereum’s chart looks similar to its bigger brother, though today’s price action hints at a potential breakout from the recent consolidation range. For ETH/USD, a daily close near current levels would open the door for a continuation toward the monthly highs near $2000, followed by the 1-year highs up around $2100 next. Only a reversal back below the 100-day EMA near 1775 would erase the near-term bullish bias.\n\nSource: Tradingview, StoneX. Please note this market may not be available in your region.\n\n-- Written by Matt Weller, Global Head of Research\n\nFollow Matt on Twitter: @MWellerFX"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLXBpenphLWRheS1ob3ctb25lLXRyYW5zYWN0aW9uLWluLTIwMTAtbGVkLXRvLWdsb2JhbC1jcnlwdG8tYWRvcHRpb24vYXJ0aWNsZXNob3cvMTAwNDIwMjQwLmNtc9IBnAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLXBpenphLWRheS1ob3ctb25lLXRyYW5zYWN0aW9uLWluLTIwMTAtbGVkLXRvLWdsb2JhbC1jcnlwdG8tYWRvcHRpb24vYW1wX2FydGljbGVzaG93LzEwMDQyMDI0MC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: How one transaction in 2010 led to global crypto adoption? - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5hdGlvbmFsb2JzZXJ2ZXIuY29tL3BvZGNhc3QvbWF4ZWQtb3V0L2JpdGNvaW4tb3ItYnVzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin or Bust | Canada's National Observer: Climate News - Canada's National Observer",
        "content": "In an era where all debate seems to be increasingly polarized, one man tries to have a reasonable conversation. Sometimes it works.\n\nMaxed Out is hosted by Canada’s National Observer’s lead columnist Max Fawcett. If you read his columns or follow him on Twitter, you’ll know Max has a take-no-prisoner approach when it comes to errors, lies and disinformation. But like so many people, Max is frustrated by the relentless partisanship and refusal to discuss things in good faith. In other words, he is maxed out. You probably are, too.\n\nIn this podcast, Max invites a new guest each week to debate — even contradict — him. This isn’t about picking fights. It’s about escaping our silos and re-learning the art of disagreeing, without being disagreeable. Maybe we’ll all find some new common ground we didn’t know was there.\n\nThis bimonthly podcast is part of Podcast Tuesdays at Canada’s National Observer."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL25ld3MvdXMtd29tYW4tZmluZHMtaGlkZGVuLTUwMDAwMC1kb2xsYXItYml0Y29pbi1kdXJpbmctZGl2b3JjZS02MDMzNzIuaHRtbNIBcGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL2FtcC93b3J0aC9uZXdzL3VzLXdvbWFuLWZpbmRzLWhpZGRlbi01MDAwMDAtZG9sbGFyLWJpdGNvaW4tZHVyaW5nLWRpdm9yY2UtNjAzMzcyLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "US Woman Discovers Husband's $500,000 Hidden Bitcoin Investment During Divorce Proceedings - Indiatimes.com",
        "content": "Just a few months into her divorce proceedings, a US woman thought it was suspicious that her spouse, who earned $3 million annually, didn’t have many assets.\n\nAfter spending half a year on discovery and enlisting the help of a forensic accountant, the housewife eventually tracked down 12 bitcoins — then worth half a million dollars ($500,000) — in a previously undisclosed crypto wallet of her husband's.\n\n\n\nUS Women Finds Out About Husband's Hidden Bitcoins\n\ngoldmanlaw303\n\nSarita (name changed to maintain anonymity), who was married for a decade, said she felt blindsided by her husband’s cryptocurrency investment, as per CNBC.\n\n\n\n“I know of bitcoin and things like that. I just didn’t know much about it,” she said. “It was never even a thought in my mind, because it’s not like we were discussing it or making investments together. ... It was definitely a shock.”\n\nThe world of financial infidelity has become increasingly sophisticated, as investors “hop” coins across blockchains and sink their cash into metaverse properties. An NBC News poll found that 1 in 5 Americans have invested in, traded or used cryptocurrency, with men between the ages of 18 and 49 accounting for the highest share of all demographic groups.\n\nMost divorce attorneys from Florida, New York, Texas and California, blockchain forensic investigators, financial advisors, as well as spouses who were either hunting down virtual coins or the crypto holders themselves, agree that the law can’t keep up with all the new ways that people earn and safeguard digital assets that largely exist outside the reach of centralized intermediaries such as banks.\n\nAlso Read: US Man Pays 10,000 Bitcoins For Pizza\n\nAnother Divorcing Couple Fought Over Crypto\n\nshutterstock\n\nLast year, news came out regarding a wealthy San Francisco couple fighting not just for children, profits from the sale of the husband’s software company and their $3.6 million home, but also for cryptocurrency.\n\n\n\nErica and Francis deSouza's most fierce court battle concerned a bitter dispute over millions of dollars in missing Bitcoin. The husband had bought a little over 1,000 Bitcoins before he separated from his wife in 2013 and then lost nearly half the funds when a prominent cryptocurrency exchange collapsed, as per a New York Times report. After three years of litigation, a San Francisco appeals court ruled in 2020 that Mr. deSouza had failed to properly disclose some elements of his cryptocurrency investments, which had exploded in value. The court ordered him to give Ms. deSouza more than $6 million of his remaining Bitcoin.\n\nIn recent years, divorces, especially in the US, are turning ugly due to crypto's involvement. But it is the difficulty in tracking and valuing cryptocurrency that is creating new headaches in the legal world.\n\nAlso Read: 'Bam Bam Bitcoin Beach' In Portugal\n\nFor the latest and more interesting financial news, keep reading Indiatimes Worth. Click here."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2JpdGNvaW4tYW5kLWNyeXB0by1ndWlkZS9hLWJlZ2lubmVycy1ndWlkZS10by10aGUtZ3JhcGgtcHJvdG9jb2wtcGFydC0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "A Beginner's Guide to The Graph Protocol - Part 2 - Bitcoin & Crypto Guide - - Altcoin Buzz",
        "content": "The Graph makes it easy to access blockchain data without the involvement of third parties. It queries and organizes data from different blockchains. So developers can use this data to build APIs.\n\nWe recently published an introductory article to the Graph Protocol. This article takes a dive into the platform’s ecosystem and how to stake GRT.\n\nHave you seen The Graph’s brand new homepage yet? 👀 It's now easier than ever to visualize how The Graph works & discover how to get involved 💫 See it for yourself ⬇️ 🌐 https://t.co/3YVpq4Z343 pic.twitter.com/5ZNBf95eVE — The Graph (@graphprotocol) May 22, 2023\n\nIntroduction to the Graph’s Ecosystem\n\nThe Graph’s ecosystem is comprised of four roles: developers, indexers, delegators, and curators. So, indexers stake $GRT, the native Graph token, and are rewarded for accurately indexing subgraphs through query and index rewards. Then, delegators stake $GRT to indexers in exchange for a share of the indexer’s query fees. Curators indicate that a subgraph is of exceptional quality and should be indexed by the network.\n\nLet’s look deeper at these protocol roles:\n\nDelegators: This group of participants stakes their GRT tokens with the indexers and gets a part of the indexer query fees. Delegators are subject to a 0.5% tax on each delegation. Indexers: They provide indexing and querying services as node operators. In return, indexers receive rewards and earn query fees. However, they have to stake 100,000 GRT tokens. This token will be slashed if the indexers carry out practices deemed harmful to the network. Curators: This group helps identify the subgraphs the Graph Explorer needs to index and receives 10% of the query fees. Data consumers, community members, and subgraph developers who want to signal their subgraphs can serve as curators. However, they have to pay a deposit tax of 1% to curate. They’ll also receive lower fees if they curate subgraphs of low quality. In addition, they’ll pay a tax of about 0.5–1% if a subgraph fails. Developers: Developers fall on the demand side of the ecosystem. They create subgraphs and publish them to the Graph Network. Furthermore, developers query live subgraphs with GraphQL to power their applications.\n\n🎉 Congrats to @graphprotocol on reaching 1000 subgraphs! 🚀🌐\n\nA major milestone that highlights the growth and potential of the decentralized ecosystem. With diverse data and interactions, the future of decentralized applications looks promising.Keep pushing the boundaries! 🌍💻 pic.twitter.com/ltHwgVZe0c — 📊Andy S.👨‍🚀| TheGraphGermany🛡️ (@German_TheGraph) May 22, 2023\n\nHow to Stake GRT\n\nThere are different ways to earn GRT: Staking, lending, and yield farming. So, let’s talk about staking. You can stake GRT on a centralized exchange like Binance. Here are the steps:\n\nLog in to your Binance account if you have one, or create one if you don’t.\n\nGo to the “Finance” option and the “ Binance Earn ” option.\n\n” option. Move to the “ Locked Staking ” option and click on the “ View more ” button.\n\n” option and click on the “ ” button. Select GRT from the list displayed. Then, fix the duration and then click on “ Stake Now. “\n\n“ Confirm details like duration and available amount.\n\nInput the amount you want to stake and click on “Confirm purchase.“\n\nWe’re excited to announce our support for @graphprotocol $GRT staking! Earn up to 8% in yearly rewards, issued weekly with instant stake & unstake. Learn more here 👉 https://t.co/G4WkktJk1g * Rewards subject to change. Staking is not available to clients in US & CA. pic.twitter.com/eM6uRI0Bkt — Kraken Exchange (@krakenfx) November 22, 2022\n\nWhat is the Graph Explorer?\n\nThe Graph Explorer is where you can view every subgraph that has been deployed to the Graph Network. The explorer allows you to see the subgraph’s details, including its metadata and participant statistics. The curators can then select a subgraph and deposit GRT tokens in it so that it is signaled to the indexers. The Graph Explorer has tabs for:\n\nSubgraphs.\n\nIndexing.\n\nDelegating.\n\nCurating.\n\nFurthermore, the explorer allows all network users to view their user profiles. The Graph Explorer also displays the past and active results of each activity and details of the rewards earned.\n\nConclusion\n\nThe Graph has unique potential as a querying service. However, you’ll need to do your own research before investing. As of this article, GRT trades at $0.1215.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL25ld3MvZHViYWktdG8tYnVpbGQtd29ybGRzLWZpcnN0LWJpdGNvaW4tdG93ZXItNjAzNDQ1Lmh0bWzSAV9odHRwczovL3d3dy5pbmRpYXRpbWVzLmNvbS9hbXAvd29ydGgvbmV3cy9kdWJhaS10by1idWlsZC13b3JsZHMtZmlyc3QtYml0Y29pbi10b3dlci02MDM0NDUuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "World's First Ever Bitcoin Tower Set To Be Built In Dubai Soon - Indiatimes.com",
        "content": "The United Arab Emirates will soon be the home of the world's first ever bitcoin tower, which will be a hotel in the shape of a bitcoin. The 40-story tower will be built in Dubai, and the plan is set to be unveiled on May 24th.\n\nThe World's First Bitcoin Tower In Dubai\n\nA developer in Dubai recently unveiled plans to construct the world’s first bitcoin (BTC) tower. With the unveiling scheduled for May 24th, the project aims to demonstrate the significance of digital assets and cryptocurrencies, coinciding with the upcoming COP28 meeting in Dubai.\n\n\n\nfinbold\n\nSalvatore Liggiero, the developer behind this venture, said the hotel will be the first of its kind, as per the Binance report. Designed in the style of bitcoin, the hotel developer plans to use cutting-edge technologies and sustainable materials, and it has a commitment to zero CO2 usage.\n\n\"It Gives You Back What You Paid\"\n\nIn a unique blend of traditional hospitality and cryptocurrency, the Bitcoin Tower isn’t just a luxurious accommodation; it’s a symbol of the digital age, illustrating cryptocurrencies’ increasing importance and influence in our everyday lives. The hotel chain’s innovative approach transforms the hotel experience by offering guests exclusive NFTs (non-fungible tokens) as rewards. These tokens prove authenticity and ownership in the digital realm, granting holders exclusive privileges.\n\nThis model introduces a new facet to the hospitality industry: the rental price isn’t just a payment; it’s an investment. It is treated as staking cryptocurrency, producing an annual percentage yield (APY) that guests can claim.\n\nIn the words of developer Salvatore Leggiero, it’s “the first hotel that gives you back the money you paid, plus interest,” as per various media reports.\n\nNot only does this project aim to educate the general public about cryptocurrencies, but it also encourages participation. Leggiero invites artists, architects, creatives, and crypto enthusiasts to submit their works.\n\nshutterstock\n\nAlso Read: Here Are The Beautiful Glimpses Of World's First Bitcoin City\n\nThese creations will form an exclusive NFT collection dedicated to the Bitcoin Tower’s design or its internal spaces, manifesting an asset of tremendous tangible value in the digital space.\n\nA Homage To The World's First Cryptocurrency\n\nThe architectural work hopes to serve as homage to the first cryptocurrency and to encapsulate the principles laid down by its enigmatic creator, Satoshi Nakamoto.\n\n\n\nThe bitcoin tower’s developer also wants to demonstrate Dubai’s goal to bridge the gap between digital and physical assets. To foster a collaborative environment, Leggiero encourages individuals from diverse backgrounds to participate in this endeavour, recognising the immense value that their collective expertise can bring to the project.\n\nAlso Read: Death Of One Of The World's Richest Arabs Leaves Behind Messy Inheritance In Dubai\n\nFor the latest and more interesting financial news, keep reading Indiatimes Worth. Click here.\n\n"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdGVjaGNhYmFsLmNvbS8yMDIzLzA1LzIyL2JpdGNvaW4tcGl6emEtZGF5LTEwLWNvbW11bml0aWVzLWtlZXBpbmctdGhlLWJpdGNvaW5zLXNwaXJpdC1hbGl2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "What is Bitcoin Pizza Day? - TechCabal",
        "content": "Today, May 22nd is Bitcoin Pizza Day. All over the world, enthusiasts and supporters of cryptocurrency Bitcoin are organising events, meetups, and sharing stories and memes to commemorate the first documented real-world transaction using Bitcoin.\n\nOn May 22, 2010, Laszlo Hanyecz, a programmer from Florida, made history by successfully completing a transaction in which he purchased two Papa John’s pizzas for 10,000 BTC.\n\nHe reportedly posted a message on the Bitcointalk forum, a popular online Bitcoin community, offering 10,000 bitcoins in exchange for someone ordering him two pizzas. Eventually, another forum user named “Jercos” took him up on the offer and ordered the pizzas from Papa John’s in exchange for the bitcoins. The transaction was completed, and Laszlo received his pizzas, making it the first documented real-world purchase using Bitcoin.\n\nHanyecz’s message on Bitcointalk\n\nAt the time, Bitcoin was in its early stages, and its value was negligible. In fact, Laszlo described it as “having little value” in his original forum post. However, in hindsight, it is considered one of the most expensive pizza purchases ever made, given the tremendous increase in Bitcoin’s value over the years. Laszlo’s transaction was significant because it demonstrated the use of Bitcoin as a medium of exchange for tangible goods and services.\n\nBitcoin Pizza Day has since become a symbolic event in the global cryptocurrency community. It serves as a reminder of Bitcoin’s humble beginnings, the evolution of cryptocurrencies and their increasing acceptance in the wider financial world.\n\nHere is a list of ten crypto communities in Africa who are keeping the Bitcoin spirit alive:\n\nCrypto Bootcamp Community has 10,000+ community members across the continent, in cities like Capetown, Kampala, Dubai, Accra, Nairobi, Abuja, and Lagos. It provides education on cryptocurrencies, blockchain technology, Web3 with engaging courses and online content.\n\nThe community asserts that its objective is to help people get familiar with blockchain and navigate the industry without any hassle. It also provides marketing, brand promotion and project onboarding services to emerging blockchain and crypto projects. It was founded by Obinna Iwuno in 2020.\n\nWomen in DeFi is a thriving community of DeFi and Blockchain enthusiasts focused on empowering young women in Africa. It provides free education about Blockchain and Crypto to equip women with essential skills and knowledge to take advantage of job opportunities in the field of blockchain technology.\n\nBitcoin Ekasi is a community in South Africa dedicated to establishing a Bitcoin-based economy. It operates as an extension of The Surfer Kids Non-Profit, a non-profit organization focused on empowering children through surfing education. By paying their surfing coaches in Bitcoin and facilitating crypto payments for local vendors, Bitcoin Ekasi introduces cryptocurrency transactions into the town’s economic framework.\n\nAfrican Bitcoiners is a community dedicated to assisting African individuals in their journey with Bitcoin. They aim to educate and onboard new users, ensuring their safe navigation through various stages, from learning about Bitcoin to earning and securely storing their accumulated sats (bitcoin units). The community strongly believes that Bitcoin is a revolutionary form of currency that promotes fairness and equality, presenting an opportunity to address global wealth inequality and create a more balanced financial landscape.\n\nDigiOats is a community that is supporting Africans to learn, adopt, trade, and securely store digital assets like cryptocurrencies. Their primary objective is to bridge the information gap between Africa and the Western world through comprehensive Digital Financial Literacy initiatives. By promoting education and awareness, DigiOats aims to facilitate the widespread adoption of decentralised innovations, including Bitcoin, throughout Africa.\n\nLed by Anita Posch, Bitcoin for Fairness is a non-profit initiative raising knowledge and understanding of Bitcoin for people in emerging countries and for the disadvantaged. They connect and boost the profile of local stakeholders, and identify and work with educators on the ground to expand Bitcoin adoption locally and Bitcoin awareness globally.\n\nWeb3Ladies is a Web3 community in Africa empowering a generation of female industry leaders who will build, nurture, and develop a sustainable Web3 space. Their aim is to foster a community of excellent, passionate, and groundbreaking ladies in the African Web3 space, who can work together, not only to challenge the status quo but also to create impactful open-sourced solutions in the Web3 space.\n\nThis is one of the largest Bitcoin communities in Africa, consisting of Africans from different parts of the continent who believe in the Bitcoin revolution and are building a movement to bolster its adoption. The Africa Bitcoin Organisation is led by human rights activist Farida Nabourema.\n\nBitcoin Dada is a community for the African woman to learn about Bitcoin, while being part of a women-focused community that wants her to succeed. The community was founded to try to resolve three issues in the ecosystem: reduce the knowledge barriers for everyday women to enter the Bitcoin world; make Bitcoin relatable to the masses; lastly, to narrow the gender gap in the space through education, community, and social network platforms.\n\nSince its launch, Bitcoin Dada has successfully trained two cohorts of students, held Bitcoin-only meet-ups in Nairobi, Kenya, helped some students start accepting Bitcoin as a payment option in their businesses, and recommended students to Bitcoin companies for employment.\n\nThis crypto community was initiated in 2022 to give its members access to information and tools necessary to profit from crypto and NFT projects. The discord-based community has since grown to 4,000 members.\n\nShare this article"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2dvbGQtYml0Y29pbi1ldGhlcmV1bS13aGljaC1vbmUtaXMtdG8td2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Gold / Bitcoin / Ethereum – Which One is to Win? - Analytics Insight",
        "content": "In the past, major precious metals have been viewed by investors as safe-haven assets during the development of financial crises. However, the rise of digital financial technology has given rise to a new type of digital gold: Bitcoin. This was highlighted by a recent analytical review by Bitcoinist experts who compared the dynamics of gold, Bitcoin and Ethereum.\n\nWhile gold prices are up 9 percent this year, bitcoin is up more than 70 percent, according to the analysis. Despite the U.S. banking crisis, Bitcoin has continued to gain momentum, rising 30% in the past week alone, from $19,000 to $28,500.\n\nEthereum, on the other hand, has lagged behind, with prices up just 13% over the past seven days.\n\nExperts from Bitcoinist point out that more and more investors are considering investing in the cryptocurrency space these days.\n\nBitcoin’s rise as digital gold is due to its scarcity, decentralization, and security. These factors, along with a growing number of institutional investors, have contributed to the incredible growth in the value of cryptocurrencies.\n\nWhile cryptocurrencies and their mining are certainly risky, the potential rewards are enormous. With the right knowledge and resources, it is possible to generate substantial profits and benefit from the growth of the cryptocurrency market.\n\nIf you want to try Bitcoin mining – it would be wise to focus on accumulating affordable mining hashrate before the price starts to rise. You can now choose your bitcoin mining contract in Idmining.\n\nIt will be interesting to see how the dynamics of gold, bitcoin and other cryptocurrencies evolve over time as the world continues to embrace digital financial technologies. Invest in Bitcoin while it is still cheap to get into Bitcoin mining and avoid future regrets for missed opportunities.\n\nWhat are the main advantages of investing in cloud mining contracts:\n\nWhen investing in BTC, you need to understand fundamental analysis to know when is the best time to buy or sell cryptocurrency. Cloud mining all but eliminates this need for investors. When buying a cloud contract, the revenue becomes passive: the company takes over the maintenance, repair and tuning of the mining machine, while the client simply withdraws the profit; Miners can hedge risk by selling BTC during growth and buying new contracts when the price drops (and becomes cheaper), or simply store the cryptocurrency in a secure wallet until growth resumes; Also, under the current blockchain hash rate conditions, when you buy a mining contract, it turns out that the BTC price will be lower than the price you buy on a crypto exchange. If you invest $2,000, you can only buy 0.13 BTC for this amount. But you can mine twice that amount – 0.3 BTC for the same amount of money.\n\nTherefore, investing in cloud mining is more flexible, profitable and secure, especially in the long-term.\n\nA legitimate cloud mining business was established in the UK in 2016 under the name IDMining. Like any legitimate hash provider, IDMining has commercial properties with a sizable tech park of specialized Bitcoin mining equipment.Brazil & Windhoek & Kazakhstan all have data center locations. Nowadays, IDMining pays out cryptocurrencies to more than 4,90K users from around the world.\n\nFeatures:\n\nSign up to get $5 immediately.\n\nAutomated daily payouts.\n\nNo overhead or electricity fees.\n\nAn affiliate program with 3% lifetime rewards.\n\nDifferent Crypto contracts to choose from.\n\nDDos and SSL protect the system.\n\n24-hour online support.\n\nNew Crypto Mining Plans\n\nContract Price Contract Terms Fixed Return $100 1 Day $100+$2 $300 3 Days $300+$20.7 $800 7 Days $800+$140 $1300 15 Days $1300+$546 $8200 40 Days $8200+$10496 $15800 60 Days $15800+$29388\n\nFor more IDMining details, please visit https://idmining.com/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    }
]