[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vbW9uZXktYW5kLWJhbmtpbmcvY3J5cHRvY3VycmVuY3kvZnJlZS1waXp6YXMtY3J5cHRvLXBsYXRmb3Jtcy1icmluZy1pbi1iaXRjb2luLXBpenphLWRheS13aXRoLW9mZmVycy1hbmQtZ29vZGllcy9hcnRpY2xlNjY4ODA4NDMuZWNl0gGuAWh0dHBzOi8vd3d3LnRoZWhpbmR1YnVzaW5lc3NsaW5lLmNvbS9tb25leS1hbmQtYmFua2luZy9jcnlwdG9jdXJyZW5jeS9mcmVlLXBpenphcy1jcnlwdG8tcGxhdGZvcm1zLWJyaW5nLWluLWJpdGNvaW4tcGl6emEtZGF5LXdpdGgtb2ZmZXJzLWFuZC1nb29kaWVzL2FydGljbGU2Njg4MDg0My5lY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Free Pizzas! Crypto platforms bring in Bitcoin Pizza Day with offers and goodies - BusinessLine",
        "content": "Cryptocurrency platforms are bringing in Bitcoin Pizza Day by distributing free pizzas, gift vouchers, and other goodies. Indian players Coinswitch, Mudrex, and Zebpay are running campaigns to promote and celebrate the day when Bitcoin was used for the first time to buy a real-world commodity.\n\nBitcoin Pizza Day is celebrated widely by the crypto community worldwide on May 22 every year. The symbolism of the event is to mark how open-source internet money, which wasn’t of significant worth then, went on to be the highest-valued crypto token in the world and saw wide adoption.\n\nCryptocurrency exchange CoinSwitch is giving away pizzas to crypto users who share their experiences of entering the world of cryptocurrencies. CEO Ashish Singhal wrote in a tweet, “Share your first experience of investing in crypto, and I’ll gift a pizza for the most unique story. Let’s celebrate together with pizza.” He also noted that his introduction to crypto was in 2014, when he started dabbling with Bitcoin nodes and codes.\n\nAlso read Bitcoin on course for longest streak of monthly gains since 2021\n\nSimilarly, exchange Zebpay has a Bitcoin Pizza Day offer on the platform. Crypto users who trade on the platform today can win gift vouchers worth ₹1,000. “Trade from ₹1,000 to ₹1 lakh or more and stand a chance to win prizes including cash vouchers, air tickets, and much more,” the platform said on Twitter.\n\nMudrex, a crypto investing platform, is also running a Bitcoin Pizza Day campaign and has distributed pizzas to approximately 300 start-ups and companies in and around Bengaluru. It has also partnered with Via Milano in Bangalore, granting new signees the opportunity to indulge in complimentary pizzas provided by Via Milano.\n\nIts CEO and co-founder, Edul Patel, said, “Bitcoin Pizza Day symbolizes the incredible journey of cryptocurrencies, from a humble transaction to a global phenomenon. It reminds us of the immense growth potential and transformative power of digital assets in shaping the future of finance.”\n\nGlobal crypto player Binance is tying up with members of the community to make their own pizza, complete with their own ‘BTC’ toppings logo. Participants would be winning the crypto equivalent of a year’s supply of pizza.\n\nWhat is Bitcoin Pizza Day\n\nThe day is celebrated to mark the first time Bitcoin was used for a real-life transaction. On May 22, 2010, two pizzas were bought for 10,000 bitcoins, at a time when Bitcoin was known and understood by very few people.\n\nLaszlo Hanyecz, a programmer in Florida who was a part of the initial phases of Bitcoin, decided he had to put his mined tokens to use. He then put out a message on the Bitcoin Talk Forum saying, “I’ll pay 10,000 bitcoins for a couple of pizzas, like maybe two large ones, so I have some leftover for the next day.”\n\nA few days later, on May 22, a man on the forum named Jeremy Sturdivant took up the offer and got Hanyecz and two pizzas delivered from Papa John’s. A single Bitcoin today is worth $26,830.5 and was even worth $69,044 at its all-time high in 2021.\n\nAlso read: WazirX partners with Taxnodes to simplify tax computation for VDAs"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL2RpZmZlcmVuY2UtYmV0d2Vlbi1iaXRjb2luLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 04:08:25 GMT",
        "title": "What is the difference between Bitcoin and Ethereum? | Learn about crypto and DeFi | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "What is the difference between Bitcoin and Ethereum?\n\nBitcoin (BTC) and Ether (ETH) are two of the most popular cryptocurrencies in the world. They are both based on blockchain technology, but they have some key differences. In this article we explore those differences, which are summarized in a handy chart at the end.\n\nUse the multichain Bitcoin.com Wallet app trusted by millions to safely and easily send, receive, buy, sell, trade, and manage BTC, ETH, and the most popular cryptocurrencies."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTIyL3JhcmUtc2hpZnQtaW4tY3J5cHRvLXZvbGF0aWxpdHktb2ZmZXJzLWV0aGVyLWV0aC1hLWJvb3N0LXZlcnN1cy1iaXRjb2luLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "A Rare Shift in Crypto Volatility Offers Ether a Boost Relative to Bitcoin - Bloomberg",
        "content": "Volatility gauges suggest traders expect smaller near-term swings in Ether compared with Bitcoin , a reversal of the usual pattern for the two largest digital assets in the cryptocurrency sector.\n\nThe T3 Ether Volatility Index , a measure of implied 30-day swings in the token, trails a similar gauge for Bitcoin by around the most since at least 2021. Typically the Ether index tops the one for Bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvYml0Y29pbnMtdHJhZGluZy1yYW5nZS1uYXJyb3dzLXRvLXRpZ2h0ZXN0LWluLW1vbnRocy_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIyL2JpdGNvaW5zLXRyYWRpbmctcmFuZ2UtbmFycm93cy10by10aWdodGVzdC1pbi1tb250aHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin's Trading Range Narrows to Tightest in Months - CoinDesk",
        "content": "Narrow trading ranges indicate that neither bullish nor bearish perspectives dominate the price action. That typically happens when markets face competing influences and narratives. While lingering U.S. banking sector issues favor the upside in perceived haven assets like bitcoin, the unresolved deadlock in debt ceiling negotiations and the recovery in the dollar index suggest otherwise."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8xMi10cnVzdGVkLWJpdGNvaW4taW52ZXN0bWVudC1zaXRlcy0xMTM4Mjk2NTIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "12 Trusted Bitcoin Investment Sites - Yahoo Finance",
        "content": "In this article, we will examine the 12 Trusted Bitcoin investment sites. If you want to skip the detailed analysis, visit 5 Trusted Bitcoin investment sites.\n\nIn today's technologically advanced world, people have come beyond physical assets and currencies in dealing with transactions. That's where cryptocurrency comes in, giving users a convenient way to buy and sell products and services through e-money. However, it's important to be vigilant and conduct due diligence before selecting a cryptocurrency investment platform or site in terms of its reputation, authenticity, current status, and credibility. This article will give useful insight to Bitcoin investors about 12 Trusted Bitcoin investment sites.\n\nMarket Outlook\n\nCryptocurrencies remained popular in 2021, especially Bitcoin (BTC). Goldman Sachs started dealing with transactions in cryptocurrencies. In April 2021, Coinbase Global Inc. (NASDAQ:COIN) was among the first crypto exchange platform to go public at a valuation of approx. $100 billion. Alphabet Inc. (NASDAQ:GOOG) shook hands with Coinbase in October 2022 to create feasibility for its cloud computing clients to deal transactions in e-money. Moreover, Microsoft Corporation (NASDAQ:MSFT) also began accepting BTC as payments from users since 2014.\n\nThe most well-known cryptocurrency, Bitcoin, had a successful year, according to CNBC. Since 2021, the worth of the e-currency has risen by about 70%, driving the total market worth of crypto above $2 trillion. However, 2022 happened to be unfavorable for most cryptocurrency holders. Throughout 2022, Bitcoin lost 65% of its market share. A series of bad events, comprising the collapse of FTX (one of the biggest cryptocurrency exchanges), the crash of Terra Luna, and the predicted unfavorable macroeconomic situations, took crypto devotees by surprise.\n\nThe Big Crash\n\nWhen the Federal Reserve began to boost interest rates to combat excessive inflation, the price of cryptocurrencies fell much like almost everything else in the financial sector. That surprised many of Bitcoin's most ardent supporters, many of whom thought the digital money would act like gold does: as a hedge against inflation. In contrast to their predictions, the price of Bitcoin was dropping at the time of rapid inflation.\n\nStory continues\n\nThe main cause of the crypto market's slump was the failure of FTX. In addition to causing a significant market sell-off, FTX's bankruptcy and dispute with Binance have decreased liquidity in the cryptocurrency market. Individual investors, particularly those who purchased digital assets close to the highs, have suffered. However, structural issues in the sector have been highlighted, according to Lee Reiners (an expert in cryptocurrency law and policy):\n\n“It really exposed a number of crypto firms who were, you know, overextended, had poor risk management, or otherwise were engaging in fraudulent activity.”\n\nIs the Forecast Optimistic or Pessimistic?\n\nFor the majority of cryptocurrencies, 2023 has begun on a clean and favorable note. Some investors have turned to Bitcoin and other popular cryptocurrencies for safety as inflation has slowed down, the recession is becoming more imminent, and the U.S. financial crisis is still raging.\n\nAccording to Analytics Insight, some market analysts believe Bitcoin will reach a price of $100,000 by the end of 2023. Others claim that Bitcoin won't rise over $70,000.\n\nBitcoin traded in a constrained price range from $26,000 to $28,600 from halfway through March to mid-April. On April 10, Bitcoin saw a breakout to the upside, reaching a high of $31,005 on the back of favorable inflation statistics that suggested the Fed may decide to hold off on interest rate rises in favor of rate cuts sooner than previously anticipated. Bitcoin has increased by 80% this year compared to last. Although Bitcoin is still approximately 50% below its all-time high, which was over $69,000 in November 2021, the path to recovery is still lengthy.\n\nThe fact that Bitcoin will experience a halving event in 2024 is another factor supporting analysts' positive outlook on the cryptocurrency. Every four years, there is a Bitcoin halving event in which the currency's miner payouts are cut in half. Given that halving serves to reduce supply, this occurrence is widely seen as being favorable for Bitcoin's price. In the past, halving has been viewed as a highly positive indicator for boosting Bitcoin's price.\n\n12 Trusted Bitcoin investment sites\n\nMethodology\n\nFor our list of 12 Trusted Bitcoin investment sites, the main factor on which we based our list is the 'score’ from 0.0 to 10.0 extracted from Coinmarketcap as of the writing of this article. The score reflects average liquidity and investors' confidence, among other factors, on the crypto exchange platforms. We have also mentioned the platforms' trading volume (keeping in mind that trading volume fluctuates at any given time).\n\nSo, without further delay, let's head toward 12 Trusted Bitcoin investment sites.\n\n12. Huobi\n\nScore: 6.5\n\nTrading Volume: $298,644,218\n\nHuobi is one of the most trusted platforms for bitcoin trade, but the platform alos has its own coin. The native cryptocurrency of Huobi Global exchange is called Huobi Token (HT). Huobi users received Huobi Token in 2018 as part of a unique giveaway program that gave tokens out for free to platform users.\n\n11. Gemini\n\nScore: 6.6\n\nTrading Volume: $8,048,955\n\nAlthough Gemini supports fewer cryptocurrencies (including BTC), it places a strong emphasis on the security and compliance of the funds that its consumers invest with it. Despite having fewer assets, this platform is still a great choice for both new and seasoned traders due to its strong security emphasis and selection of tools and products.\n\nGemini has become the first SOC 2-certified cryptocurrency exchange in the market, demonstrating its dedication to security. The SOC 2 evaluation gauges a company's or product's levels of compliance and safety and is conducted by outside auditors.\n\n10. Gate.io\n\nScore: 6.6\n\nTrading Volume: $322,173,059\n\nAn investor can trade BTC on Gate.io for a maximum trading cost of 0.2%. Customers can decrease this charge in a number of ways, including by using the utility token of Gate.io. While not the cheapest on the market, this cost is also not the most expensive either.\n\n9. LBank\n\nScore: 6.6\n\nTrading Volume: $573,256,808\n\nLBank offers a web-based trading platform that is unique in many ways. The site also includes a number of sophisticated tools and features, including the technical analysis indicators RSI, KDJ, MACD, and CCI. The exchange platform also includes a volume window below the order windows and a market depth window below the chart. All of the attributes are displayed in an intuitive way.\n\n8. Bitfinex\n\nScore: 7.0\n\nTrading Volume: $28,683,171\n\nBitfinex, which was established in 2012, has comparatively cheap trading costs, with the majority of trade deals costing just 0.20% or less. Their trading interface is easy to use, and seasoned traders will value the capabilities and possibilities it provides. To test one’s approach before investing real capital, an individual may start with a free paper trading account that provides them access to the Bitfinex platform and handles their money with convenience (this is akin to a stock market game).\n\n7. Bybit\n\nScore: 7.0\n\nTrading Volume: $217,986,015\n\nInvestors on Bybit can leverage their funds 100 times for Bitcoin and 50 times for other currencies. Additionally, users can also avail the option of purchasing temporary loss insurance. Both the site and the mobile app have attractive features for its loyal investors. Bybit provides traders with the Market Maker Incentive Program, which gives a maker fee reimbursement of up to 0.015%.\n\n6. Bitstamp\n\nScore: 7.1\n\nTrading Volume: $32,635,496\n\nDue to the presence of a small selection of currencies, Bitstamp is perhaps better suited for freshies and casual traders. Bitstamp Tradeview, Bitstamp.net, and Bitstamp Mobile are the three platforms that traders may utilize to trade. On all platforms, trading fees are the same. For users with less than $10,000 in trading activity over the last 30 days, the maximum trading cost on Bitstamp is merely 0.50%. Investors who trade larger sums each month would see a significant reduction in fees, which is on par with, or cheaper than what other well-known crypto exchanges charge.\n\nClick to continue reading and see 5 Trusted Bitcoin Investment Sites.\n\nSuggested Articles:\n\nDisclosure: None. 12 Trusted Bitcoin Investment Sites is originally published on Insider Monkey."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm1hcmtldHBsYWNlLm9yZy9zaG93cy9tYXJrZXRwbGFjZS10ZWNoL3RoZS1jcnlwdG8td2ludGVyLWRpZG50LWtlZXAtYml0Y29pbmVycy1hd2F5LWZyb20taXRzLWFubnVhbC1jb25mZXJlbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin convention draws smaller number of faithful - Marketplace",
        "content": "Bitcoin believers gathered in Miami for what organizers say is the world’s biggest annual bitcoin convention, though it was quite a bit smaller than last year. It drew less than half of the 35,000 attendees who went in 2022.\n\nOf course, a lot has happened in the crypto world since then. A little disaster called FTX, a crypto-friendly bank failure or two. Not to mention the price of bitcoin has taken a dive, from around $40,000 during last year’s event to about $26,000 this time around.\n\nMarketplace’s Meghan McCarty Carino spoke with senior reporter Matt Levin, who was there to take the pulse. The following is an edited transcript of their conversation.\n\nMatt Levin: It is mostly like any other convention, which was somewhat surprising to me. It’s a lot of crypto companies debuting products, demoing products, there’s an exhibit hall. There’s a lot of noncrypto companies here: real estate companies, HR software companies, recruiting companies that are just trying to get bitcoin clientele. But there are some kind of bitcoin-specific eccentricities, I would say, that you probably wouldn’t see at other conferences.\n\nMeghan McCarty Carino: Like what?\n\nLevin: Some of the odder things I’ve seen: there’s a mechanical bull in the middle of the exhibit hall that you can ride, literally riding the bitcoin bull. You can buy a children’s board game that’s supposed to introduce your kids to the concept of bitcoin. You can buy s— coin wipes — I’m using “s” to replace an expletive there. Bitcoiners aren’t big fans of other cryptocurrencies like dogecoin, etherium. So you can buy s— coin butt wipes — someone was trying to sell that to me.\n\nBitcoin’s mechanical bull. (Courtesy Matt Levin) The s— coin toilet flushing down other cryptocurrencies. (Courtesy Matt Levin)\n\nMcCarty Carino: Does it seem like people’s faith has been shaken at all in crypto, given the turmoil over the last year or so — the so-called crypto winter?\n\nLevin: So there’s a bit of sample bias here, obviously. If you’re still coming to Bitcoin 2023, you’re probably still a believer in bitcoin. So the short answer is no, their faith is not shaken. They’re in it for the long haul. And you hear a lot of them talk about, “well, hey, look, inflation is a significant problem in the U.S. now.” You know, the U.S. is in danger of defaulting on its debt. These are all kind of credos of bitcoin maximalism. So they kind of feel like they have a little bit of a tailwind right now.\n\nMcCarty Carino: So you’ve been at the convention a couple days now. What’s kind of caught your eye?\n\nLevin: So one thing I didn’t expect that probably should have: The global presence here is actually pretty impressive. I met a lot of people from Latin America, people from Hong Kong, people from Eastern Europe. And then, the other thing, honestly, is being a reporter with public radio. I didn’t know how popular I would be at this particular convention. But people, for the most part, have generally been just as willing to talk as any other convention.\n\nMore insight from Meghan McCarty Carino\n\nMatt Levin mentioned he was surprised by the big international presence at the conference. Given the decentralized and anonymized nature of cryptocurrency, it’s a little hard to get exact breakdowns for where people are using it most. One index by Chainalysis found grassroots crypto adoption by individuals (not big institutions) was highest in Vietnam, the Philippines, Ukraine and India, followed by the United States.\n\nIn the U.S., Marketplace’s Kimberly Adams has done some reporting on the disproportionate share of Black Americans investing in crypto, which was framed, at least during better times in the crypto market, as a way to build generational wealth in a country where racial disparities in wealth have barely budged since the 1960s — and which has a history of discriminatory practices in traditional banking."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdG9kYXkudGFtdS5lZHUvMjAyMy8wNS8yMi90ZXhhcy1hbS10ZWFtLXN0dWR5aW5nLWVmZmVjdHMtb2YtY3J5cHRvLW1pbmluZy1vbi10aGUtdGV4YXMtcG93ZXItZ3JpZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Texas A&M Team Studying Effects Of Crypto Mining On The Texas Power Grid - Texas A&M University Today",
        "content": "Cryptocurrency transactions may be costing more than just transaction fees. The electricity used for these transactions is more than what some countries, like Argentina and Australia, use in an entire year.\n\nPublished estimates of the total global electricity usage for cryptocurrency assets such as Bitcoin are between 120 and 240 billion kilowatt-hours per year, according to the White House Office of Science and Technology. The United States leads these numbers.\n\nFinance and business experts have debated the ramifications of cryptocurrency and mining, but little focus has been placed on the impact of these activities on the power grid and energy consumption until now.\n\nDr. Le Xie, professor in the Department of Electrical and Computer Engineering at Texas A&M University and associate director of the Texas A&M Energy Institute, is at the center of this effort to understand how cryptocurrency mining impacts the power grid and how to use this information for further research, education and policymaking.\n\nEven as technology improves, allowing users to do more while using less energy, cryptocurrency mining is computationally intensive, and the measure of power on the blockchain network, or hash rate, is still rising.\n\nDuring the summer heatwave of 2022 in Texas, Xie and his collaborators found an 18% reduction in worldwide cryptocurrency mining. The decrease was linked to the stress on the Texas power grid, which led the Electric Reliability Council of Texas to issue a request for energy consumers to conserve energy.\n\n“There seems to be a very strong negative correlation between the mining demand and the systemwide total net demand,” Xie said. “When the grid is stressed, crypto miners are shutting down, which demonstrates a potential for demand flexibility.”\n\nFor example, when the grid is under stress due to a heat wave, homeowners consume more air conditioning and, in turn, more power. Compared to these types of firm demand, the cryptocurrency mining demand shows good potential for providing flexibilities during times when peak energy usage in other areas is vital.\n\nTheir findings are published in the March issue of the Institute of Electrical and Electronics Engineers Transactions on Energy Markets, Policy and Regulation and the June issue of Advances in Applied Energy.\n\nIn these papers, Xie and his students provide data to allow a first step into studying these mining facilities’ carbon footprint and the impact on grid reliability and wholesale electricity prices. Ultimately, location matters, and many factors play a part in this complex discussion.\n\n“Increasing firm demand will invariably result in a decrease in grid reliability,” Xie said. “However, with crypto mining modeled as a flexible load that can be turned off during the stressed moments, it can be a positive contributor to the grid reliability.”\n\nXie is the lead for the Blockchain and Energy Research Consortium at Texas A&M, which is a collaboration between a team of Texas A&M researchers and industry partners. Their mission is to provide an unbiased multidisciplinary resource to communicate recent developments in the intersection of blockchain and energy.\n\nAlthough cryptocurrency is still in its infancy, one thing is certain — increasing energy usage will be critical as this emerging industry for transactions continues to advance. With that in mind, Xie is continuing his research to find a solution that helps take advantage of blockchain-enabled technologies while ensuring a sustainable grid operation."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1jcnlwdG8tYnVsbC1tYXJrZXQtb3V0bG9vay1taWNyb3N0cmF0ZWd5LW1pY2hhZWwtc2F5bG9yLWV0aGVyZXVtLTIwMjMtNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Has Bottomed and the Crypto Is on a New Bull Run: Saylor - Markets Insider",
        "content": "MicroStrategy's Michael Saylor says bitcoin's price has bottomed.\n\nCrypto regulation will soon weed out bitcoin's competitors, according to Saylor.\n\nThis, along with Bitcoin's halving and the Ordinals protocol, are bullish as well.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nMicroStrategy's Michael Saylor says bitcoin's current rally is in fact the start of a new bull run.\n\nThe software company's cofounder chalks up the new bull market to bitcoin's halving, more adoption of the crypto asset, and a regulatory crackdown on the industry that should benefit bitcoin.\n\nInvestor and developer interest will begin shifting from other blockchains, Saylor says, and into Bitcoin's network as regulation begins to weed out competitors like Ethereum. Earlier this year, US Securities and Exchange Commission chairman Gary Gensler said that \"everything other than bitcoin\" falls under securities laws.\n\n\"I think the crypto tokens and crypto securities are going to be regulated, perhaps out of existence,\" he told CNBC on Friday, adding that the token is the one commodity that the SEC is not going to regulate. \"Bitcoin is the most secure network. It's the most secure asset. Everything else has got a black cloud hanging over it.\"\n\nAdvertisement\n\nHe added: \"You're going to see a consistent flow of capital flowing from the rest of the crypto ecosystem [into] bitcoin.\"\n\nThe Financial Accounting Standards Board's also recently proposed guidance on crypto accounting and reporting, Saylor says, which is a significant milestone as well. It provides companies that hold crypto on their balance sheets, like MicroStrategy, further clarity and transparency for their shareholders, which could lead to further mainstream adoption.\n\n\"The FASB initiative to adopt fair value accounting is a very auspicious development,\" he said.\n\nThis, along with Bitcoin's halving and a migration of Ordinals inscriptions activity on its network, are bullish as well.\n\nAdvertisement\n\nOrdinals is a protocol that expands the blockchain's use case and recently helped drive a new record for daily Bitcoin transactions as well. Bitcoin's halving, a technical event that occurs roughly every four years, is tentatively slated for April 2024. This could pump the price of the crypto by enhancing bitcoin's scarcity because the halving can reduce the number of new bitcoins released.\n\nAlthough the space is going through \"growing pains,\" Saylor says there are still plenty of bullish factors for bitcoin.\n\n\"Nearly all of the bad leverage has been squeezed out. Everyone in the business of shorting bitcoin, rehypothecating bitcoin, loaning bitcoin — they've all [gone] bankrupt. The remaining exchanges where you can short it are under a massive amount of regulatory pressure,\" Saylor told the outlet.\n\nHe added: \"I think bitcoin's found the bottom. I think the leverage is out of it. I think we're on a bull run.\""
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9iaW5hbmNlLXRvLWNlbGVicmF0ZS0xMy15ZWFycy1vZi1iaXRjb2luLXBpenphLWRheS13aXRoLWdsb2JhbC1ldmVudHMtMzgyMzM2LTIwMjMtMDUtMjLSAYsBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2JpbmFuY2UtdG8tY2VsZWJyYXRlLTEzLXllYXJzLW9mLWJpdGNvaW4tcGl6emEtZGF5LXdpdGgtZ2xvYmFsLWV2ZW50cy0zODIzMzYtMjAyMy0wNS0yMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Binance to celebrate 13 years of 'Bitcoin Pizza Day' with global events - Business Today",
        "content": "World’s largest cryptocurrency exchange Binance is celebrating the thirteenth anniversary of Bitcoin Pizza Day on social media and Binance app on Monday.\n\n\"Bitcoin Pizza Day is a testament to the power of community and the growing acceptance of BTC as part of our daily lives,\" said Yi He, Binance co-founder and chief marketing officer.\n\nBinance has tied up with members of the crypto community to make their own pizza with their own BTC toppings logo. Participants who would share their Binance-themed pizzas using #BinancePizza or complete tasks to collect all the pizza flavours on the Binance app have a chance to win the crypto equivalent of a year’s supply of pizza.\n\nOnline celebrations will continue as Binance hosts a virtual live meet-up with the attendance of CZ, CEO of Binance, on May 22 at 12:00 PM UTC, featuring discussions on the meaning of Bitcoin Pizza Day with prominent Binance Feed creators.\n\n\"At Binance, we believe in the importance of mass adoption, and we are committed to creating more and more use cases for crypto in everyday situations. As more people recognize the value and potential of blockchain and crypto, our community grows stronger, and we continue to build our industry,\" Yi He added.\n\nIn 2010, Florida resident Laszlo Hanyecz spent 10,000 Bitcoins at a local restaurant called Papa John’s to buy himself two pizzas. Back then, Bitcoin used to trade at $40. Since cryptocurrency wasn’t a big thing in 2010, Hanyecz reached out to an online community ‘Bitcointalk’ and openly traded his Bitcoins for two pizzas.\n\nConsidering Bitcoin's value today, which is over $46k currently, these two pizzas can be regarded as the costliest pizzas of all time.\n\nAs this trade marked the very first commercial transaction in cryptocurrency history, crypto fans named May 22 as the Bitcoin Pizza Day.\n\nBitcoin Pizza Day stands as a pivotal milestone for the crypto industry, signifying its remarkable exponential growth and paving the path for widespread adoption of digital currencies over the past 13 years.\n\nMany global celebrations of Bitcoin Pizza Day are happening in different countries like Bahrain, Vietnam, Cambodia, Mexico, Uruguay, Argentina, Pakistan and New Zealand including the birthplace of pizza in Naples, Italy.\n\nAlso Read : Crypto Price Today: Bitcoin nears $29,000; Ethereum tops $1,900; Litecoin & BNB shed up to 3%\n\nAlso Read : Crypto Price Today: Bitcoin below $27,000; Solana, Tron, Dogecoin, Polygon and Avalanche fall 3% each"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvdXMtZGVidC1kZWFsLW1heS13ZWlnaC1vdmVyLWJpdGNvaW4tb2JzZXJ2ZXJzL9IBXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvdXMtZGVidC1kZWFsLW1heS13ZWlnaC1vdmVyLWJpdGNvaW4tb2JzZXJ2ZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "U.S. Debt Deal Could Weigh On Bitcoin Price, Some Say - CoinDesk",
        "content": "\"What it implies is a lack of USD funding in the immediate short term post the successful ceiling negotiation, if any. Corporate bonds markets, as well as private credit, will find it hard to roll over existing maturities and this will lead to a real crash in either commercial real estate assets funding or plain junk bond issuers. This might be the real deal crash which the U.S. rate markets have been elusively looking for,\" Gautam said in a LinkedIn post."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWFuYWx5c3RzLXByZWRpY3RpbmctYml0Y29pbi1oaXQtMjMxMjMyMDY0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "3 Analysts Predicting Bitcoin Will Hit $100,000 by 2024 - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has been the subject of intense speculation and volatility in recent times. In the midst of these dynamics, bullish Bitcoin price predictions prevail. In fact, some of them reach the $1 million mark. One of the reasons for that is the much-anticipated halving event. Other key catalysts include the recent collapse of U.S. banks, inflation, and amplified demand for alternative financial systems. That being said, market analysts have become far more optimistic on the future of Bitcoin, including:\n\nBitcoin Price Predictions 2024 : Dan Tapiero\n\nBitcoin coin with bull and stock chart. Bullish market of BTC-USD. Cryptos to buy.\n\nSource: Maxx-Studio / Shutterstock.com\n\nThree market analysts have emerged with bold predictions, anticipating Bitcoin could hit $100,000 by 2024. For example, crypto analyst Dan Tapiero says BTC could pass $100,000 during the latter half of 2024 or 2025. Tapiero shared his forecast during an interview with Scott Melker. In fact, according to Tapiero, Bitcoin may trade sideways for the duration of 2023. Shortly after, he expects to see $100,000 around the halving event. Among other contributing factors named by Tapiero was the adoption of blockchain technologies by states and companies.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBitcoin Price Predictions : Standard Chartered Bank\n\nVarious cryptocurrency coins. Cryptos. Cryptocurrencies representing 3AC Crypto., ARBK Stock. cheap cryptos to buy on the rebound\n\nSource: Wit Olszewski / Shutterstock\n\nGeoff Kendrick, the head of crypto research at Standard Chartered Bank, also believes Bitcoin could test $100,000 next year. This optimistic outlook is based on several factors, including the turmoil in the banking sector, the upcoming Bitcoin halving event, and the expected conclusion of the Federal Reserve’s rate hikes. Kendrick also highlights the nearing end of the Federal Reserve’s tightening cycle as a favorable factor for Bitcoin’s future performance. The correlation between Bitcoin and the Nasdaq suggests that if there is a broader improvement in risk-on assets, Bitcoin is expected to trade more favorably.\n\nStory continues\n\nThe upcoming Bitcoin halving event in 2024 is considered a powerful catalyst that could contribute to future price increases. Additionally, regulatory changes aimed at facilitating investor access to the market, such as the introduction of digital asset ETFs and stablecoin regulations, could boost Bitcoin even more.\n\nPrediction 2024 : PlanB\n\nCrypto coins on a phone screen showing stats for various cryptocurrencies.. best cryptos\n\nSource: Chinnapong / Shutterstock\n\nAccording to the pseudonymous analyst PlanB, known for his Stock-to-Flow (S2F) BTC price prediction model, Bitcoin will pass $100,000. PlanB also believes this will happen shortly after the next halving event. The model evaluation of Bitcoin’s price is based on parameters such as scarcity and the relationship between BTC’s existing supply and its production rate. PlanB states that the coin reached a cyclical low of $15,000 in Nov. during the FTX collapse. He suggests that in case Bitcoin reaches $32,000 shortly, the next possible price target of $100,000 can be reached soon after the 2024 halving event.\n\nJulia Magas is a writer who covers the latest trends in finance and technology. Her work is published in a number of financial media outlets such as Nasdaq, Cointelegraph, Investing, SeekingAlpha, FXEmpire, and Beincrypto. She primarily covers cryptocurrency and blockchain technology with a focus on market performance, innovations and trends.\n\nMore From InvestorPlace\n\nThe post 3 Analysts Predicting Bitcoin Will Hit $100,000 by 2024 appeared first on InvestorPlace."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvYml0Y29pbi1zcHVycy01dGgtY29uc2VjdXRpdmUtd2Vlay1vZi1vdXRmbG93cy1hdC1jcnlwdG8taW52ZXN0bWVudC1mdW5kcy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIyL2JpdGNvaW4tc3B1cnMtNXRoLWNvbnNlY3V0aXZlLXdlZWstb2Ytb3V0Zmxvd3MtYXQtY3J5cHRvLWludmVzdG1lbnQtZnVuZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Spurs 5th Consecutive Week of Outflows at Crypto Investment Funds: CoinShares - CoinDesk",
        "content": "“It is unclear why there is such coordinated negative sentiment for both long and short investment products,” CoinShares said, noting that even products that short BTC saw an outflow of $1.3 million last week."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMjIvY2VsZWJyYXRpbmctYml0Y29pbi1waXp6YS1kYXktdGhlLXRpbWUtYS1iaXRjb2luLXVzZXItYm91Z2h0LTItcGl6emFzLWZvci0xMDAwMC1idGMv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8yMi9jZWxlYnJhdGluZy1iaXRjb2luLXBpenphLWRheS10aGUtdGltZS1hLWJpdGNvaW4tdXNlci1ib3VnaHQtMi1waXp6YXMtZm9yLTEwMDAwLWJ0Yy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Celebrating Bitcoin Pizza Day: the Time a Bitcoin User Bought 2 Pizzas for 10,000 BTC - CoinDesk",
        "content": "Bitcoin could have failed spectacularly. So could have that hot technology company – like many other failed companies. Without Bitcoin Pizza Day, perhaps no one would have stepped up to use what Bitcoin's creator Satoshi Nakamoto called peer-to-peer digital cash as a medium of exchange and bitcoin would still be floating around as valueless, magic internet money for nerds (in concept alone)."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vd29ybGQtbmV3cy9iaXRjb2luLXBpenphLWRheS1iaXRjb2lucy10YXN0aWVzdC1taWxlc3RvbmUtaG93LXBpenphLW9yZGVyLW1hcmtlZC1hLXR1cm5pbmctcG9pbnQtZm9yLWNyeXB0b2N1cnJlbmN5LTEwMTY4NDc0ODczODkxMy5odG1s0gGqAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS93b3JsZC1uZXdzL2JpdGNvaW4tcGl6emEtZGF5LWJpdGNvaW5zLXRhc3RpZXN0LW1pbGVzdG9uZS1ob3ctcGl6emEtb3JkZXItbWFya2VkLWEtdHVybmluZy1wb2ludC1mb3ItY3J5cHRvY3VycmVuY3ktMTAxNjg0NzQ4NzM4OTEzLWFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: Celebrating the historic transaction that changed crypto - Hindustan Times",
        "content": "May 22 is a day that holds a special place in the hearts of cryptocurrency enthusiasts around the world. It's a day of celebration, known as Bitcoin Pizza Day, marking a pivotal moment in the history of Bitcoin. On this day in 2010, Laszlo Hanyecz, a programmer and early Bitcoin miner, made a transaction that would go down in history as the first documented use of Bitcoin to purchase physical goods. May 22: Bitcoin Pizza Day! In 2010, Laszlo Hanyecz made history by using Bitcoin to buy pizza—a milestone for cryptocurrency enthusiasts worldwide. (Twitter)\n\nHanyecz, a resident of Florida, took to the Bitcointalk.org forum on May 18, 2010, with an unusual request. He announced his desire to buy two large pizzas using Bitcoin and offered a whopping 10,000 BTC to anyone who would fulfill his pizza order. At the time, the value of Bitcoin was less than half a cent per coin, making the offer seemingly extravagant.\n\nHindustan Times - your fastest source for breaking news! Read now.\n\nDays went by, and it seemed that Hanyecz's quest for Bitcoin-powered pizzas would go unfulfilled. However, on May 22, a fellow forum user named Jeremy Sturdivant, who went by the username \"jercos,\" stepped up to the challenge. Sturdivant agreed to order and deliver the pizzas to Hanyecz in exchange for 10,000 BTC. The pizzas were from Papa John's, and while they were not enjoyed directly from the restaurant, their significance would far surpass a simple meal.\n\nLittle did Hanyecz know that the 10,000 BTC he spent on those pizzas would skyrocket in value over the following years. If he had held onto them until Bitcoin's all-time high price of $68,990, he could have potentially amassed a mind-boggling fortune of around $690 million. Just imagine the number of pizzas he could have bought with that!\n\nReflecting on the historic transaction, Hanyecz shared in a 2019 interview with CBS that he believed it made Bitcoin \"real for some people.\" It was a tangible use case for digital currency and showcased its potential as a medium of exchange. For Hanyecz himself, it was a significant moment that solidified his belief in Bitcoin's revolutionary power.\n\nAlso Read | Republican candidate Vivek Ramaswamy becomes the second 2024 presidential candidate to accept Bitcoin donations\n\nSince that fateful day, the global crypto community has come together annually on May 22 to commemorate Bitcoin Pizza Day. It serves as a reminder of the humble beginnings of Bitcoin and the incredible journey it has undertaken. It's a time to celebrate the progress made in the world of cryptocurrencies and to reflect on how far we've come.\n\nSo, on this Bitcoin Pizza Day, let's raise our slices and toast to Laszlo Hanyecz, the pioneer who took a leap of faith with his digital currency and forever changed the course of history. And perhaps, let's also reflect on the value of patience and the importance of holding onto our Bitcoin... or pizzas, for that matter."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNS8yMS9tZW1lY29pbnMtbmZ0cy1lcnVwdC1vbi1iaXRjb2luLWJsb2NrY2hhaW4tc2Vpc21pYy1zaGlmdC1mb3ItbWluZXJzL9IBZ2h0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNS8yMS9tZW1lY29pbnMtbmZ0cy1lcnVwdC1vbi1iaXRjb2luLWJsb2NrY2hhaW4tc2Vpc21pYy1zaGlmdC1mb3ItbWluZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Memecoins and NFTs erupt on Bitcoin blockchain, leading to ‘seismic shift’ for miners - Fortune",
        "content": "An eruption of memecoins and nonfungible tokens on the Bitcoin blockchain has reshaped the revenue profile of miners and stirred questions about how lasting the upheaval will prove to be.\n\nNew software known as Ordinals paved the way for the NFTs and meme tokens to come to the network this year. Galaxy Digital Holdings Ltd. says the Bitcoin NFT ecosystem could be worth $4.5 billion by 2025, while about 25,000 memecoins have been tallied on the blockchain since they first emerged in March.\n\nThe NFT and meme-token craze spurred record transactions and an ensuing fee windfall for miners, who run the computers underpinning Bitcoin. At one point in May, transaction fees made up over 40% of revenues, whereas miner income is usually dominated by the new Bitcoin they get for securing the blockchain.\n\n“The Ordinals protocol has stimulated a seismic shift in the Bitcoin mining landscape,” said Jihan Wu, chairman of Singapore-based Bitdeer Technologies Group, one of the top crypto miners by computer power.\n\nOrdinals and a crypto rebound have eased the pressure on mining margins caused by last year’s digital-asset rout and high energy costs. But Bitcoin purists argue the Ordinals phenomenon clogs the network and interferes with the largest cryptocurrency’s store-of-value and payments functions.\n\nThe mean fee per transaction on the Bitcoin blockchain began April at $2.80, reached $30 on May 8 and moderated to $6 on May 18, CryptoQuant data show. Total fee income attributable to Ordinals stands at about $37.4 million, according to data compiled by Dune Analytics AS.\n\nDeveloper Casey Rodarmor created Ordinals, a software protocol that lets users inscribe digital content like videos, images and text on satoshis, the smallest unit of Bitcoin. There are 100 million satoshis in one Bitcoin.\n\nRodarmor’s innovation then allowed a pseudonymous blockchain analyst called Domo to develop the Bitcoin Request for Comment — or BRC-20 — standard, which led to the explosion of memecoins.\n\nThe durability of the sudden ardor for NFTs, or digital collectibles, and speculative tokens on the Bitcoin blockchain remains an open question. The market value of the memecoins was heading toward $1 billion earlier in May but has since declined to about $582 million, figures from BRC-20.io show.\n\nThe BRC-20 tokens have no utility, said Carlos Gonzalez Campo, a research analyst at crypto exchange-traded product provider 21Shares AG.\n\nThe fundamental takeaway may be that Ordinals has created a pathway to uses of the Bitcoin network that didn’t exist before.\n\n“While the memecoin frenzy on Bitcoin will likely subside eventually, valuable use cases will emerge from the chaos, such as utilizing Bitcoin as a data availability layer and storing crucial documents that require permanent preservation,” said Sami Kassab, a research analyst at Messari.\n\nShares Rally\n\nA sustained boost to transaction income could help sustain the Bitcoin network longer term by keeping miners engaged. Transactions will be the sole revenue source by about 2140, when Bitcoin is due to hit its cap of 21 million tokens and new coins will no longer be issued in return for securing the blockchain.\n\nFor now, Ordinals is helping to fuel renewed investor enthusiasm for Bitcoin miners. The 20-member MVIS Global Digital Assets Mining Index is up 110% so far in 2023, outstripping Bitcoin’s 74% advance.\n\nThe application of ordinals is “completely rewriting how people think about mining profitability,” said Colin Harper, head of content and research at crypto-mining services provider Luxor Technologies."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjIvZmlyc3QtbW92ZXItYXNpYS1jb21pbmctc29vbi1hLXJldGVzdC1vZi1iaXRjb2luLWF0LTMway_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIyL2ZpcnN0LW1vdmVyLWFzaWEtY29taW5nLXNvb24tYS1yZXRlc3Qtb2YtYml0Y29pbi1hdC0zMGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "First Mover Asia: Will Bitcoin Soon Begin a Retest of 30K? - CoinDesk",
        "content": "Ripple is starting a central bank digital currency (CBDC) platform which allows central banks, governments, and financial institutions to issue their own digital currency. Ripple Vice President of Central Bank Engagements and CBDCs James Wallis joined \"First Mover\" to discuss. Plus, Sky Mavis, which is behind NFT project Axie Infinity, is launching its Axie Infinity: Origins card game on the Apple App Store in key markets where the game is most popular. Sky Mavis co-founder Jeffrey 'Jihoz' Zirlin shared his insights. Bitwise Asset Management President Teddy Fusaro and Southern Methodist University Dedman School of Law assistant professor Carla Reyes also joined the conversation."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNvbnNvbGlkYXRpb24tYXQtMjctMDAwLXNwYXJrcy1zcGVjdWxhdGlvbi1vZi1pbW1pbmVudC1idGMtYnJlYWtvdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin price consolidation at $27,000 sparks speculation of imminent BTC breakout - Cointelegraph",
        "content": "Bitcoin’s price has stabilized near $27,000 since May 13, displaying reduced volatility in the period. This movement is eerily similar to early April, when Bitcoin’s (BTC) 12-hour chart ranged between $27,800 and $28,700 for 11 days. Traders are now questioning whether a bullish breakout is the next possible outcome for the Bitcoin price.\n\nBitcoin/USD price index, 12-hour. Source: TradingView\n\nAccording to technical analysis, the sideways movement illustrates an ongoing conflict, meaning traders are unsure about the direction of Bitcoin’s next price trend. This is a consequence of balanced demand between buyers and sellers, which typically precedes periods of extreme price volatility and is triggered by big events.\n\nIn other words, Bitcoin traders are waiting for a potential market trigger that could decisively push the BTC price in either direction. For instance, on May 25, the United States Bureau of Economic Analysis will announce the annualized gross domestic product (GDP) for the first quarter. This data will be followed by U.S. durable goods orders on May 26, which measures the cost of orders received by manufacturers.\n\nA separate debate concerns the U.S. debt ceiling fight, with talks remaining deadlocked last week. Bipartisan negotiations are underway to lift the debt limit to avoid a U.S. government default ahead of June 1, but no agreement is in sight. In short, Republicans are demanding several cuts in government spending as contingencies.\n\nAnalyzing whether the Bitcoin derivatives market structure resembles the early April period is the first step to understanding the odds of breaking above $29,000 if the macroeconomic environment allows.\n\nBitcoin futures markets display reduced demand from bulls\n\nBitcoin quarterly futures are popular among whales and arbitrage desks, but these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, BTC futures contracts in healthy markets should trade at a 5% to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nBitcoin 2-month futures annualized premium. Source: Laevitas\n\nThere’s little similarity between the early April bullish breakout and the current status of the Bitcoin futures premium. Even though the 4% level seen on April 10 was below the neutral 5% threshold, it represented an increase from two weeks prior.\n\nIn contrast, the indicator presently stands at 2%, in line with the previous two weeks, so traders are currently less optimistic in comparison to early April.\n\nBitcoin options pricing is perfectly balanced between bulls and bears\n\nTraders should also analyze options markets to understand whether the recent correction has caused investors to become more optimistic. The 25% delta skew is a telling sign of when arbitrage desks and market makers overcharge for upside or downside protection.\n\nIn essence, if traders anticipate a Bitcoin price drop, the skew metric will rise above 7%, and phases of excitement tend to have a negative 7% skew.\n\nBitcoin 30-day options 25% delta skew. Source: Laevitas\n\nAs displayed above, according to the BTC options 25% delta skew, traders flirted with excessive optimism on March 30 but reverted to a neutral stance by April 10. That is the perfect positioning for a surprise rally, as traders were gradually losing faith, according to options pricing.\n\nOn the other hand, the most recent range trading period initiated on May 13 displayed balanced pricing between the call and put options, perfectly reflecting how unsure traders are due to uncertain macroeconomic conditions.\n\nThe derivatives market differs from early April\n\nBitcoin options and futures markets indicate little to no resemblance to early April, when the BTC price ended its 11-day low-volatility period. That time around, Bitcoin rallied 8% from $28,300 to $30,800 in less than 24 hours.\n\nThat doesn’t necessarily mean a similar outcome is impossible if Bitcoin’s present 10-day sideways movement near $27,000 ends up breaking to the upside. Still, a bullish breakout is less likely, considering BTC options traders are pricing similar risks for upside and downside movements.\n\nMoreover, the overall sentiment according to Bitcoin futures is neutral to bearish, which is unchanged when compared to the past couple of weeks.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tdG9wLTEwLWNyeXB0b3MtZmFsbC1leGNlcHQtdHJvbi_SAUFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLXRvcC0xMC1jcnlwdG9zLWZhbGwtZXhjZXB0LXRyb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin, top 10 cryptos fall except Tron - Forkast News",
        "content": "Bitcoin, Ether and most other top 10 non-stablecoin cryptocurrencies by market capitalization dropped on Monday afternoon in Asia, with Solana leading losses. U.S. stock futures rose slightly. Asian equity markets gained after U.S. President Joe Biden’s comments that he expects U.S.-China relations to improve. China’s central bank kept its benchmark lending rates unchanged on Monday.\n\nSee related article: Weekly Market Wrap: Bitcoin trades below US$27,000 amid U.S. debt ceiling negotiations\n\nBitcoin, Ether extend losses\n\nBitcoin lost 0.8% to US$26,851 in 24 hours to 4 p.m. in Hong Kong, according to CoinMarketCap data. The world’s biggest cryptocurrency has lost 2.03% in the last seven days.\n\nCrypto exchange OKX has listed Ordi (ORDI), a BRC-20 token that utilizes ordinals and inscriptions to create and manage digital assets on the Bitcoin blockchain, it said in an emailed statement. The announcement came after OKX Wallet enabled viewing and transfer of Bitcoin ordinals, after it started supporting BRC-20 trading with the launch of its Ordinals Marketplace.\n\nThere are currently over 8.4 million Ordinals inscriptions on the Bitcoin network, according to data from Dune.\n\nEther, the world’s second largest cryptocurrency, dropped 0.35% to US$1,811, bringing its weekly losses to 0.98%.\n\nSolana was the biggest loser of the day, declining 2.86% to US$19.71 in the last 24 hours. It is also the biggest loser of the week, dropping 7.92% in the last seven days.\n\nTron was the only token in the top 10 non-stablecoin cryptos to gain on Monday afternoon trade. It climbed 5.65% to US$0.07656, and has risen 9.37% in the last seven days.\n\nCrypto traders have been concerned over cryptocurrency exchange Gemini’s chief executive Cameron Winklevoss threatening on Jan. 20 to sue Digital Currency Group (DCG) for repayment of a US$900 million loan, after DCG firm Genesis filed for Chapter 11 bankruptcy. Its aggregated liabilities were worth about US$1 billion to US$10 billion to more than 100,000 creditors.\n\nThe U.S. Securities and Exchange Commission (SEC) in January charged cryptocurrency lender Genesis Global Capital and crypto exchange Gemini Trust with selling unregistered securities to retail investors through a lending program.\n\nThe total crypto market volume gained 30.38% to US$22.57 billion, while the global crypto market capitalization dropped 0.78% to US$1.12 trillion.\n\nEthereum’s 24-hour NFTs sales drop\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index fell 0.37% to 3,385.99 points in the 24 hours to 4:30 p.m. in Hong Kong but rose 1.20% during the week.\n\nEthereum’s 24-hour NFT sales decreased 21.42% to US$13.4 million, as sales for the Bored Ape Yacht Club, the largest Ethereum-based NFT collection, fell 44.81% to US$479,997. Mutant Ape Yacht Club sales rose 25.21% to US$1.07 million while 24-hour sales for Azuki rose 99.18% to US$757,066.\n\nNFT sales on Bitcoin also fell 14.98% to US$3.2 million, as interest in Space Pepes cooled, increasing 1.63% to US$40,321 in the past 24 hours, according to CryptoSlam data.\n\nAsian equities rise, U.S. futures muted on debt ceiling concerns\n\nStock market prices. Image: Envato Elements\n\nAsian equity markets gained on Monday after U.S. President Joe Biden commented that he expects a thaw or an improvement in U.S.-China relations “very shortly.”\n\nChina’s central bank kept its benchmark lending rates unchanged on Monday, in line with market expectations, after economic data over the past month showed that the world’s second biggest economy is yet to fully recover after three years of pandemic-induced disruptions.\n\nAnnual inflation in Hong Kong stood at 2.1% in April, close to market forecasts of 2% and higher than a rise of 1.7% in March.\n\nThe Shanghai Composite gained 0.39%, the Shenzhen Component Index rose 0.32% and Hong Kong’s Hang Seng Index climbed 1.17%. Japan’s Nikkei 225 strengthened 0.9% to a 33-year high after U.S. President Biden indicated positive sentiment over negotiations to avoid a default on the debt ceiling.\n\nMajor U.S. stock futures rose as of 4:30 p.m. in Hong Kong. The S&P 500 futures index inched up 0.012%, the tech-heavy Nasdaq-100 futures rose 0.027% and the Dow Jones Industrial Average futures gained 0.021%.\n\nInvestors are awaiting updates on the ongoing U.S. debt ceiling negotiations, scheduled to continue on Monday. This is less than two weeks to the June 1 deadline that Treasury Secretary Janet Yellen has warned repeatedly the government could default, if an agreement to raise the ceiling was not reached.\n\nFailure to raise the debt ceiling will result in a default that is likely to cause chaos in global financial markets and a spike in interest rates.\n\n“While a resolution of the [U.S.] debt ceiling crisis may provide a temporary relief rally, it doesn’t guarantee sustained market growth or shield against other market risks,” Nigel Green, chief executive of financial advisory firm deVere Group, said in an emailed statement on Friday.\n\n“While stock markets are enjoying this wave of buoyancy, core major bond markets continue to be marked by inverted yield curves, which suggest a recession is looming,” Green added.\n\nThe yield on the U.S. 10-year Treasury note fell by five basis points to 3.64% on Monday, reflecting the uncertainty regarding the debt ceiling crisis.\n\nThe U.S. Federal Reserve will release minutes of its May meeting on Wednesday, while U.S. personal consumption expenditure data is scheduled for release on Friday.\n\nInvestor sentiment in Europe also reflected caution, with the benchmark STOXX 600 rising 0.2% while Germany’s DAX 40 slipped 0.093% to 16,250 points from its all-time high of 16,332 points on Friday.\n\nConstruction output in the Euro area declined by 1.5% in March, compared to the same period last year, according to Eurostat. This marked the sharpest contraction in construction output since August 2021, adding to cautious market sentiment.\n\nSee related article: S.Korean lawmakers propose public officials disclose crypto holdings"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm5kdHYuY29tL3dvcmxkLW5ld3MvbmV3LXlvcmstd29tYW4tZGlzY292ZXJzLWh1c2JhbmQtaGlkLTUwMC0wMDAtaW4tYml0Y29pbi1kdXJpbmctZGl2b3JjZS1wcm9jZWVkaW5ncy00MDUzNjE50gGAAWh0dHBzOi8vd3d3Lm5kdHYuY29tL3dvcmxkLW5ld3MvbmV3LXlvcmstd29tYW4tZGlzY292ZXJzLWh1c2JhbmQtaGlkLTUwMC0wMDAtaW4tYml0Y29pbi1kdXJpbmctZGl2b3JjZS1wcm9jZWVkaW5ncy00MDUzNjE5L2FtcC8x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "New York Woman Discovers Husband Hid $500,000 In Bitcoin During Divorce Proceedings - NDTV",
        "content": "The revelation came a few months into her divorce proceedings\n\nWith financial infidelity on the rise, many people are now hiding their wealth in crypto wallets, away from the prying eyes of their spouses. In one such recent case, a woman in New York discovered that her husband had stored 12 bitcoins worth $500,000 in a previously undisclosed crypto wallet, CNBC reported. The revelation came a few months into her divorce proceedings.\n\nThe woman identified as Sarita, became suspicious because her husband, who earned some $3 million a year, wasn't disclosing many assets in the divorce case. She then enlisted the help of a forensic accountant who tracked down his cryptocurrency investment using analysis of blockchain transactions to trace hidden assets.\n\n''I know of Bitcoin and things like that. I just didn't know much about it. It was never even a thought in my mind, because it's not like we were discussing it or making investments together. ... It was definitely a shock,'' Sarita said.\n\nDivorce attorneys told the outlet it is becoming common for people to hide crypto from their partners. Lamenting the growing trend, they noted that the law is struggling to keep up with digital assets that largely exist outside the reach of centralised intermediaries such as banks.\n\nAttorneys in Florida, Texas, New York, and California told CNBC that crypto now plays a role in roughly 20% to 50% of divorces they handle since it has become a more popular investment in recent years.\n\n''The thing with cryptocurrency is it's not regulated by any kind of centralized bank, so usually you can't subpoena somebody and get documents and information related to somebody's cryptocurrency holdings,'' divorce attorney Kelly Burris told CNBC. She added it is easy to hide cryptocurrency assets if one spouse is tech-savvy and the other is not.\n\nAccording to an NBC News poll, 1 in 5 Americans have invested in, traded, or used cryptocurrency, with men between the ages of 18 and 49 accounting for the highest share of all demographic groups."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL2NyeXB0by1lZHVjYXRpb24vYml0Y29pbi1waXp6YS1kYXktYS1jZWxlYnJhdGlvbi1vZi1kZWNlbnRyYWxpemF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day — A celebration of decentralization - Kraken Blog",
        "content": "Pizza parties rarely need an explanation. But pizza parties on Bitcoin Pizza Day deserve one.\n\nThirteen years ago today, Laszlo Hanyecz created a thread in the bitcointalk.org forum titled Pizza for bitcoins? After some explanation and much discussion, Hanyecz found someone willing to buy him two pizzas (valued at ~$41) in exchange for his 10,000 bitcoin.\n\nAt bitcoin’s price today, those pizzas are worth ~$270,000,000.\n\nMany look back on Bitcoin Pizza Day as a cautionary tale that demonstrates why people HODL crypto for the long term. Yet, many others look to the future on this day while considering the unrealized potential of Bitcoin and the power of decentralization.\n\nUltimately, Bitcoin Pizza Day has become a celebration of Bitcoin’s viability as a complete “peer-to-peer electronic cash system” — just as Satoshi envisioned in the Bitcoin white paper.\n\nMoney (including cash) is generally defined as:\n\nA medium of exchange A unit of account A store of value\n\nOn this day more than a decade ago, the world saw that Bitcoin could be used as a medium of exchange. After all, Hanyecz was able to use Bitcoin while transacting with another individual — without any intermediary’s participation.\n\nYet, as time has gone on, Bitcoin Pizza Day has also become a reminder of the progress Bitcoin has made in the other two functions of money as well.\n\nAs individuals continue to exchange Bitcoin for goods and services — just as Hanyecz did years ago — Bitcoin’s viability as a global unit of account and independent store of value has also emerged. Days like today are a reminder that first proving its effectiveness as a medium of exchange is what has ultimately allowed Bitcoin to prove its legitimacy as a globally recognized unit of account and self-sovereign store of value as well.\n\nBitcoin Pizza Day is a celebration of cryptocurrency and blockchain technology’s effectiveness in decentralizing information. It is also a celebration of Bitcoin’s reliability as a sound form of money.\n\nFor many others, Bitcoin Pizza Day is a celebration of the crypto values Kraken embodies and the mission we deliver on each day. It is a celebration of the freedom that Bitcoin brings back to individuals’ ability to connect and transact.\n\nCelebrate Bitcoin Pizza Day with Kraken Kraken makes it easy to share the gift of financial freedom on Bitcoin Pizza Day. Invite your friends to Kraken and you’ll each get $10 in BTC through our referral program.* You can also use Kraken to send Bitcoin around the world in seconds using our Lightning Network integration. Lightning Network is a highly secure and cost-effective way to send Bitcoin to anyone — with almost no fees. Have a Happy Bitcoin Pizza Day and count on Kraken while sharing the gift of Bitcoin today! Get started with Kraken *Geographic restrictions apply"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pYW1pLWNvbmZlcmVuY2UtZHJvcC1hdHRlbmRhbmNlLWNyeXB0by0wOTQyMDg2NDQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin conference attendance plummets by 50% as crypto gloom persists - Yahoo Finance UK",
        "content": "Robert F Kennedy Jr. speaks during Bitcoin Conference 2023 in Miami, 19 May 2023. Photo: Jason Koerner/Getty for Bitcoin Magazine (Jason Koerner via Getty Images)\n\n\"Crypto winter\" has been blamed for a 50% drop in attendance at the Bitcoin 2023 conference in Miami.\n\nThe conference ended on Sunday, with speakers including US presidential candidate Robert F Kennedy and bestselling author of The Big Short, Michael Lewis.\n\nThe annual event is the biggest conference in the bitcoin (BTC-USD) and crypto calendar, however, only around 15,000 people showed up this year, less than half of the 35,000 people attending in 2022.\n\nRead more: Crypto live prices\n\nLast year's conference featured a celebrity studded roster of speakers, including tennis star Serena Williams, psychologist Jordan Peterson and co-founder of PayPal (PYPL) Peter Thiel.\n\nAttendance at #Bitcoin Miami is down over 50% from last year’s event\n\n\n\nCrypto winter is still in effect 🥶 pic.twitter.com/hhQdgWoA5d — Blockchain Demons (@Blkchain_Demons) May 18, 2023\n\nMany are blaming the collapse in crypto prices — the crypto winter — for this year's lacklustre turn out. Bitcoin's value amid last year's event was around $45,000, during this year's event the digital asset hovered around the $26,000 mark.\n\nADVERTISEMENT\n\nCrypto conferences can play an important role in the digital-asset industry, given the prevalence of remote work in the sector, as they offer networking and personal interaction opportunities.\n\nHowever, due to the drop in cryptocurrency prices, many firms have cut their travel and marketing expenses.\n\nAt this year's event at the Miami Beach Convention Centre Kennedy described how he would protect the rights of \"Bitcoiners\" if elected president.\n\n“As president, I will make sure that your right to hold and use bitcoin is inviolable,\" he said.\n\n\"I am an ardent defender and lifelong defender of civil liberties and bitcoin is both an exercise and a guarantee of those freedoms.\"\n\nStory continues\n\nRead more: Bitcoin supply on crypto exchanges falls to lowest level since 2017\n\nHe referred to the use of bitcoin to circumvent financial restrictions during the Canadian trucker protest last year.\n\nHe said: “None of these lawful and peaceful protestors had violated any law. But suddenly, they found that they could not access their money, their bank accounts to pay their mortgages or feed their families.\n\n“When I witnessed this devastating use of government repression, I realised for the first time how free money is as important as free expression.”\n\nThere were 180 discussions at this year's conference, with topics such as the impact of Wall Street on FTX, debate around Bitcoin Ordinals, and the potential of bitcoin-powered nuclear energy.\n\nWatch: Japan vies to be 'number one again through web3 innovation' | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMjEvY3J5cHRvLW1pbmVyLW1hcmF0aG9uLXBsZWRnZXMtNTAway1pbi1tYXRjaGluZy1mdW5kcy10by1icmluay1mb3ItYml0Y29pbi1kZXZlbG9wbWVudC_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8yMS9jcnlwdG8tbWluZXItbWFyYXRob24tcGxlZGdlcy01MDBrLWluLW1hdGNoaW5nLWZ1bmRzLXRvLWJyaW5rLWZvci1iaXRjb2luLWRldmVsb3BtZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Crypto Miner Marathon Pledges $500K in Matching Funds to Brink for Bitcoin Development - CoinDesk",
        "content": "“As a miner, the most important thing is global adoption of Bitcoin,” Thiel said. “Our primary priorities are making sure that Bitcoin Core development and maintenance is properly funded. We're going to work with a lot of the industry partners that we have, to get them to also contribute.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLXBpenphLWRheS10cmFjaW5nLXRoZS1qb3VybmV5LW9mLWNyeXB0by1wYXltZW50cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Savoring Bitcoin Pizza Day: Tracing the Journey of Crypto Payments from a Slice to Global Adoption - DailyCoin",
        "content": "Savoring Bitcoin Pizza Day, we embark on a journey exploring the evolution of crypto payments, from a modest beginning to worldwide acceptance, driven by enthusiasm and a pioneering spirit. This momentous occasion, when Laszlo Hanyecz bought two pizzas for 10,000 BTC in 2010, signifies the first real-world transaction utilizing Bitcoin.\n\nUnderstanding the context of Bitcoin Pizza Day sheds light on the rapid evolution of Bitcoin as a speculative, experimental means of value transfer to the monumental financial ecosystem powered by blockchain that exists today.\n\nAt a fundamental level, Hanyecz’s pizza transaction was the first instance in which Bitcoin – envisioned by Nakamoto as a decentralized means of peer-to-peer value transfer – was actually used as such.\n\nFrom Baboon Bones to Decentralized Ledgers – Hanyecz as a Pioneer of Monetary Evolution\n\nDefining the first time in human history at which money was used to exchange value, with coinage or similar as a proxy for value, can be somewhat difficult. Take a look at the Wikipedia page for the history of money – historians prefer to split the genesis of money between “money of account,” referring to the first time in which value was accounted via debits and credits on rudimentary ledgers, and “money of exchange,” referring to the medium of exchange.\n\nThe first recorded instance of “money of account” can be traced back to prehistory, over 30,000 years ago, with archeological discoveries including baboon thigh bones used for accounting almost 20,000 years ago. All further innovations regarding money of account in history generally rely upon advancements in the manner in which money is accounted for, while still relying on trusted third parties or authority in order to verify the movement of value.\n\nThe Bitcoin whitepaper and genesis block can therefore be considered the first major innovation in the management or recording of “money of account” in over 30 millenia, as the first implementation of money of account that functions in a decentralized manner.\n\nHanyecz’s Pizza transaction represents the fulfillment of a basic and very relatable human need – the need for pizza. While 10,000 BTC represents a staggering fiat value today, the evolutionary and philosophical depth to the transaction represents something more valuable: the first instance in which one human exchanged value with another, for food, using money of account logged, tracked, and transferred through a wholly decentralized means – without the need for a “trusted third party.”\n\nIt’s easy to understand Hanyecz’s passion and excitement for his multi-million dollar pizza deal. At the time, Hanyecz understood Bitcoin as a means of monetary exchange that, aside from the implications of using a wholly decentralized currency to pay for goods and services, allowed him to pull “money” from the ether through Bitcoin mining and translate it into something that could be eaten – a bridge from the digital to the real.\n\nHanyecz, as a Bitcoin miner, realized he had found a way to “outsmart” the incumbent financial system and benefit from it, which gave a feeling of triumph. The can be seen as resourcefulness and a desire for self-sufficiency, a trait common in most leaders. The miner’s enthusiasm on how a hobby for using his skills and technology to achieve a personal goal highlights their determination to stay curious, passionate and adapt to all kinds of changes that life has to offer is a gift.\n\nFrom this humble origin, cryptocurrency payments have come a long way, transforming the financial landscape and paving the way for a decentralized, borderless economy. As we honor this milestone, let us reflect on the progress made and envision a future where digital currencies continue to revolutionize commerce and empower individuals globally.\n\nBitcoin’s Journey from a Slice to Global Adoption\n\nSince the historic Bitcoin Pizza Day, the use of cryptocurrencies for payments has grown exponentially. Today, thousands of merchants worldwide accept Bitcoin and other digital currencies as a form of payment, and the number continues to grow. Major companies like Microsoft, Overstock, and Expedia have embraced cryptocurrencies, while payment processors like BitPay and Coinbase Commerce have made it easier for businesses to accept digital currencies.\n\nThe growth of cryptocurrencies has also led to the development of new digital assets, such as Ethereum, Litecoin, and Ripple, each with its unique features and use cases. The rise of decentralized finance (DeFi) and non-fungible tokens (NFTs) further highlights the versatility and potential of blockchain technology.\n\nMoreover, the increasing interest from institutional investors and the entry of traditional financial institutions into the crypto space have contributed to the mainstream adoption of digital currencies. Governments and central banks worldwide are also exploring the potential of central bank digital currencies (CBDCs), which could further revolutionize the global financial landscape.\n\nThe Evolution of Cryptocurrency Payments\n\nSince Bitcoin’s inception in 2009, the cryptocurrency payment landscape has undergone significant transformations. The decentralized nature of cryptocurrencies, which eliminates intermediaries like banks, has made them increasingly popular for secure and tamper-proof transactions. The development of blockchain technology has further fueled the growth of cryptocurrencies, as it provides a transparent and immutable record of transactions.\n\nA study conducted by Geva, Benjamin (2019) titled “Cryptocurrencies and the Evolution of Banking, Money, and Payments” concluded that the rise of crypto payments represents an evolution in banking that enhances payment intermediation. This development could potentially lead to the demise of banks as payment intermediaries. Geva’s conclusion remains unchanged even if centralized digital currencies were to supersede cryptocurrencies.\n\nThe study highlights the potential for cryptocurrencies and blockchain technology to disrupt traditional banking systems and reshape the financial landscape. As more individuals and businesses adopt cryptocurrencies for transactions, the role of banks as intermediaries may diminish, paving the way for a more decentralized, transparent, and efficient financial ecosystem.\n\nGlobal Adoption of Crypto Payments\n\nThe global adoption of crypto payments has been steadily increasing over the past few years, with more businesses and individuals recognizing the potential benefits of using cryptocurrencies for transactions. There are several factors contributing to this growth:\n\nWidespread Business Crypto Payment Adoption\n\nMany businesses, both large and small, have started accepting cryptocurrencies as a form of payment. This includes online retailers, service providers, and even brick-and-mortar stores. The growing number of businesses accepting cryptocurrencies has made it more convenient for consumers to use digital currencies for everyday transactions.\n\nThe number of merchants accepting cryptocurrencies as a form of payment has grown significantly over the past few years. Companies like BitPay, CoinGate have made it easier for businesses to accept cryptocurrencies, with over 15,000 merchants using BitPay alone. Major companies such as Microsoft, AT&T, and Overstock.com have also started accepting cryptocurrencies as payment.\n\nMainstream Celebrities and Companies Join the Crypto Revolution\n\nThe involvement of major companies like Tesla, Square, and MicroStrategy in the cryptocurrency space has helped legitimize digital currencies and increase public awareness. Additionally, endorsements from celebrities like Elon Musk, Snoop Dogg, and Paris Hilton have further boosted the popularity of cryptocurrencies.\n\nGovernment and Public Sector Adoption\n\nGovernments around the world have been taking notice of cryptocurrencies and implementing regulations and policies to govern their use. While some countries have imposed strict regulations or outright bans, others have adopted more supportive stances, creating a conducive environment for the growth of crypto payments.\n\nThe Future of Cryptocurrency Payments\n\nThe future of cryptocurrency payments is uncertain but holds great potential. Several factors will determine the trajectory of crypto payments in the coming years:\n\nMainstream Adoption and Crypto Ubiquity\n\nFor cryptocurrencies to become a widely accepted form of payment, they must overcome challenges related to scalability, transaction speed, and user-friendliness. As more people become familiar with digital currencies and their benefits, the likelihood of mainstream adoption increases.\n\nOne of the biggest obstacles that hinders mainstream adoption of cryptocurrency is trust and education – while crypto enthusiasts and web3 natives are quick to adopt the latest developments in blockchain tech, how many of us can say that our own family members are familiar with or use crypto as a daily payment method?\n\nThis is one of the biggest issues KuCoin is tackling – over the next few months, KuCoin is working on helping both the crypto community at large, and their extended family, friends, and network, learn about the unlimited potential of crypto through some exciting educational resources.\n\nChallenges and Barriers to Everyday Use\n\nCryptocurrencies face several challenges that could hinder their widespread adoption, including unpredictable hurdles, security concerns, and market volatility. Overcoming these challenges will be crucial for the continued growth of crypto payments.\n\nInnovation and Technology\n\nThe role of innovation and technology in shaping the future of crypto payments cannot be overstated. As blockchain technology continues to evolve, new solutions to existing challenges may emerge, making cryptocurrencies more accessible and practical for everyday use.\n\nThe story of Bitcoin Pizza Day serves as a reminder of the humble beginnings of cryptocurrency payments and the incredible progress that has been made since then. As we continue to explore the potential of blockchain and digital currencies, the spirit of innovation and openness to new possibilities will be essential in shaping the future of crypto payments.\n\nFrom the first Bitcoin pizza purchase to the widespread adoption of cryptocurrencies as a payment method, the journey of crypto payments has been nothing short of remarkable. As the market continues to grow and mature, it is likely that we will see even greater adoption of cryptocurrencies for everyday transactions, further solidifying their place in the global financial ecosystem.\n\nHappy Bitcoin Pizza Day!\n\nAbout Johnny Lyu\n\nJohnny Lyu is the CEO of KuCoin, the top 5 cryptocurrency exchange launched in 2017. Prior to joining KuCoin, he had accumulated abundant experience in tech, internet, and e-commerce industries."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGFpbHljb2luLmNvbS9lbC1zYWx2YWRvci1iaXRjb2luLW5hdGlvbi1vci1mYWlsZWQtZXhwZXJpbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "El Salvador: Bitcoin Nation or Failed Experiment? - DailyCoin",
        "content": "El Salvador’s decision to adopt Bitcoin (BTC) as a legal tender was polarizing. Cryptocurrency enthusiasts celebrated the shift as a critical step toward mass adoption, while economists trashed the idea and mourned for the Salvadoran people.\n\nSince becoming the first country in the world to officially adopt Bitcoin, the Salvadoran Government is more committed than ever to its blockchain-based future. Regardless of volatility in the crypto market, president Nayib Bukele’s resolve remains unswayed.\n\nEven after the collapse of FTX, when digital currency looked to be finished forever (again), the Bukele government doubled down and announced they’d buy one bitcoin daily. Despite the government’s confidence, the Salvadoran public’s usage and adoption of Bitcoin remains low.\n\nWith the construction of Bitcoin City lagging and the price of Bitcoin still far from all-time highs, is time running out for Nayib Bukele’s vision?\n\nLegal Tender Pioneers\n\nAfter proposing the bill on June 5th at the Bitcoin Conference in Miami, El Salvador officially adopted Bitcoin as a legal tender on September 7, 2021. At the time, BTC was trading at around $50,000, and market sentiment had never been higher.\n\nLong before the Bitcoin Law came into effect, pockets of El Salvadoran society had been using the digital asset as a currency of exchange. The local economy of El Zonte, a coastal fishing village, had been transacting in BTC for years.\n\nEven during his tenure as the Mayor of San Salvador, the nation’s capital, Nayib Bukele, had expressed an interest in the national adoption of Bitcoin.\n\nWhile many businesses accepted Bitcoin before the announcement, its status as legal tender means that operators must accept BTC as payment.\n\nWhy Did President Nayib Bukele Adopt Bitcoin?\n\nIn many respects, the Central American nation is a perfect example of why Bitcoin was created in the first place. According to Nayib Bukele, 70% of the El Salvadoran people don’t have a bank account and live and work in an informal economy.\n\nHowever, mobile internet usage in the country is widespread, with over 9.94 million active mobile connections in early 2023. This figure represents around 156% of the total population and indicates that a mobile-first financial service, like a Bitcoin wallet, would be far more accessible than traditional central banks.\n\nAround 25% of El Salvador’s gross domestic product (GDP) comes from remittance payments. This means that a significant portion of wealth within the country comes in from overseas payments. Remittance fees are typically high, sometimes costing around 30-50% of the value of the transfer.\n\nLike many Central American nations, El Salvador uses the US Dollar as its national currency. In 2001, the El Salvadoran government began de-circulating their previous currency, the Salvadoran colón, replacing it with USD as the more stable and secure national currency.\n\nTwenty years later, the Salvadoran government wanted to move away from its reliance on the US dollar and its loss of value due to inflation.\n\nWhat Are the Risks of Using Bitcoin as a Legal Tender?\n\nUsing Bitcoin as a legal tender has raised many concerns among the Salvadoran public. There are concerns that the cryptocurrency network will be used for scams and money laundering. The Salvadoran government argues Bitcoin has the opposite effect; blockchain’s transparency means that tracking funds is easier than ever.\n\nThe International Monetary Fund (IMF) has implored El Salvador to reverse its decision about using Bitcoin as a legal tender. They argue that the cryptocurrency is too volatile and poses a risk to the nation’s financial stability and consumer protection.\n\nIf the price of Bitcoin drops significantly, there is a substantial risk that the El Salvadoran government will default on its loans and be unable to repay its lenders.\n\nBitcoin City\n\nWith the vision of turning El Salvador into a cryptocurrency utopia, Nayib Bukele has promised to build Bitcoin City on the side of a volcano. The proposed city is expected to be built on the Gulf of Fonseca on the nation’s southern coast.\n\nGeothermic energy harnessed from the Conchagua volcano will be used to operate Bitcoin mining operations. Additionally, Bukele envisions a digital asset tax haven with no income or capital gains tax. This is expected to attract wealth and investment to El Salvador.\n\nTo fund the construction of Bitcoin City, the Salvadoran government will begin the issuance of Bitcoin Bonds. The first ten-year issue is known as the ‘Volcano Bond’ and is estimated to be worth around $1B. Half of the funds raised are invested in Bitcoin, with the rest being put towards the development of Bitcoin City.\n\nHas El Salvador’s Bitcoin Bet Paid Off?\n\nFrom an investment standpoint, El Salvador’s BTC holdings are still at a loss. According to Bloomberg, El Salvador holds approximately 2,546 BTC acquired at a cost basis of around $108 million. For these holdings to break even, the price of one bitcoin must be $42,419.\n\nFrom a social perspective, it’s hard to gauge the success of Bukele’s move. As an incentive during the initial rollout, the Salvadoran government gifted every citizen $30 in BTC. Everyone who downloaded the Chivo wallet, El Salvador’s national wallet, was eligible. However, according to Reuters, usage rates indicate that just 20% of users have continued using the app since claiming the sign-up bonus.\n\nA recent study by the University of Central America found that 77% of respondents believed Bukele’s Bitcoin experiment failed. Perceived security seems a significant roadblock, with many citizens not understanding and trusting Bitcoin.\n\nDespite negative sentiment from the population, Nayib Bukele remains committed to the future. The latest news out of the country suggests that the Salvadoran government has paid off over $800 million in debts.\n\nBukele was happy to call out the hundreds of mainstream media articles suggesting he would default on the loan.\n\nUltimately, it’s still too early to say whether the adoption of Bitcoin has been a successful endeavor for the nation. The verdict will likely be directly correlated to Bitcoin price as opposed to its effectiveness as a network.\n\nBitcoin Legal Tender: Who’s Next?\n\nWhile El Salvador is leading the charge regarding Bitcoin adoption, it’s not the only nation with its eyes on the digital horizon. Other Latin American countries like Paraguay and Panama have shown an interest in Bitcoin and have progressive laws around mining and taxation.\n\nWhen Paraguay proposed a bill to make Bitcoin a legal tender in June 2021, things looked positive for Paraguayan crypto enthusiasts. The South American country has a reputation as a top destination for Bitcoin mining.\n\nConversely, Panama has passed a bill that aims to make the nation more crypto-friendly. While Bitcoin is not yet legal tender, profits from cryptocurrency-related endeavors are not subject to capital gains tax.\n\nOn the Flipside\n\nThe Bitcoin blockchain is far from perfect. Even with upgrades like the Lightning Network, it’s still comparatively slow and expensive. Recent gas spikes from Ordinal NFTs and BRC-20 tokens have congested the network and driven transaction fees to all-time highs, proving that Bitcoin still has some scalability issues.\n\nWhy This Matters\n\nWhile Bitcoin being recognized as a legal tender is undoubtedly a step toward mass adoption, El Salvador’s experiment will have huge ramifications on how the digital asset is perceived. If Bitcoin’s price drops and El Salvador becomes insolvent, it is doubtful that another country would want to adopt BTC.\n\nFAQs"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3VzZXdpZmUtZmluZHMtaHVzYmFuZC1zLWJpdGNvaW4tc3Rhc2gtYW1pZC1kaXZvcmNlLXByb2NlZWRpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Wife finds husband's Bitcoin stash amid divorce proceedings - Cointelegraph",
        "content": "The divorce proceedings of a New York couple took a turn after a forensic accountant helped track down the husband’s 12 Bitcoin (BTC) stash, which he intended to hide from his wife.\n\nThe couple in question were married for 10 years, but the man’s wife suspected that her husband did not reveal all his assets, which would get split between the two following their divorce. The woman — addressed pseudonymously as Sarita — revealed to CNBC that her husband was earning $3 million annually, which was not reflective of his declared assets.\n\nSarita appointed a forensic accountant, who eventually found that her husband failed to declare 12 BTC — worth roughly $500,000 — stored in an undisclosed crypto wallet. Having no clue about the Bitcoin investment, she stated:\n\n“It was never even a thought in my mind because it’s not like we were discussing it or making investments together. It was definitely a shock.”\n\nAs a result, the woman’s husband will have to part ways with some of his BTC holdings. Tracking crypto investments is easier than its fiat counterparts, considering that blockchain technology preserves all transactions and does not allow external factors to modify or delete entries.\n\nCheck out Cointelegraph’s article on blockchain to learn more about the underlying technology that makes Bitcoin possible.\n\nRelated: Australian ‘Big 4’ bank begins trial for cryptocurrency payment blocks\n\nContrastingly, one of the latest crypto innovations, the metaverse, has become a popular place for couples worldwide to tie the knot.\n\nSince 2021, countless couples have gotten married in metaverse-based virtual venues, allowing family members and friends to witness the joyous occasions.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pYW1pLTIwMjQtY2FuZGlkYXRlcy1yb2JlcnQtMDQxMjQ3OTc3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Bitcoin Miami: 2024 Candidates Robert F. Kennedy Jr and Gabbard Defend Bitcoin and Decentralization - Yahoo Finance",
        "content": "Bitcoin Miami: 2024 Candidates Robert F. Kennedy Jr and Gabbard Defend Bitcoin and Decentralization\n\nUS Democratic presidential candidates Robert F. Kennedy Jr and Tulsi Gabbard came out in a vigorous defense of Bitcoin and its ideals of decentralization and privacy. Speaking on the second day of Bitcoin 2023 in Miami, the pair delivered a strong rebuke of the United States’ current lack of clear crypto guidance for investors and entrepreneurs and stifling incoming regulations.\n\nKennedy is currently trailing President Joe Biden with 19% of votes vs 62% in the race for the Democratic Party’s nomination in next year’s election according to early polls. He had a particularly warm reception to his keynote speech on the first day.\n\nThe US has displayed a particular affinity for the Kennedy clan over the years, and its latest political candidate’s stellar environmental law and civil rights track record, and strong views on individual freedom, environmental protection, and the right to refuse vaccinations, also resonate strongly with a big contingent of the Bitcoin community,\n\nIn his first public appearance as a presidential candidate, Kennedy laid out a supportive vision for Bitcoin ownership and mining in the States, and warned against the dangers of governments utilizing technology to control their citizens. The civil rights activist and lawyer also announced that he would accept Bitcoin donations for his campaign, thereby becoming the first presidential candidate to greenlight the reception of crypto for a run to the Oval Office.\n\nKennedy noted that he first realized the importance of Bitcoin’s ability to circumvent government intervention after he witnessed Canada’s handling of the trucker protests last year. In his eyes, the protests were peaceful without violating any laws, yet protesters couldn’t access their money and bank accounts in order to support their families.\n\nKennedy’s 5 Pro-crypto Promises\n\nIn what he deemed as a “devastating use of government repression,” Kennedy said he saw for the first time how free money was equal in importance to free speech, and made a few key promises to the crypto space, saying he would:\n\nStory continues\n\n1. Defend the right to self-custody Bitcoin and other digital assets in the US\n\n2. Uphold the right to run a node at home\n\n3. Defend use-agnostic and industry-neutral regulation of energy\n\n4. Make sure that the US remains the global hub of Bitcoin and other cryptocurrencies and reverse the government’s growing hostility toward the industry\n\n5. Review whether individuals like Ross Ulbricht were prosecuted “for actual crimes, or as a means to crackdown on crypto.” In the case of the latter, he would consider swiftly pardoning them.\n\nOn Bitcoin Mining and AI\n\nKennedy also took a shot at incumbent president Biden and his 30% energy tax on Bitcoin mining:\n\n“President Biden's 30% tax on energy for Bitcoin miners requires an invasive surveillance apparatus to monitor what is happening in individual computers. It sets a terrible precedent in which everything that you do requires electricity and must now be monitored by the government. That's why I also support people's rights to refuse smart meters in their homes.”\n\nWhile he stated that he doesn’t own any Bitcoin, Kennedy underscored its importance in a world of new threats to democracy such as increasing governmental interference:\n\n“...we are now living in this age of turnkey totalitarianism with this emerging technology, which can empower totalitarian regimes. And our job is to try to build and fortify democratic institutions at the same rate as totalitarian instruments are being expanded in their power.”\n\nKennedy also touched on the malicious use of artificial intelligence:\n\n“For things like AI which really are going to threaten democracy at its base, we need to not be chipping away at our democratic institutions. We need to fortify the ones that exist and build new ones and the biggest most important one on the horizon is Bitcoin because it can't be manipulated.”\n\nGabbard Takes Aim at Democrats and CBDCs\n\nTulsi Gabbard, a former Democratic Congresswoman from Hawaii, came out eloquently against the direction of her party as well as the implementation of central bank digital currencies (CBDCs).\n\nShe said she related to Kennedy’s speech earlier, as she knew a little bit of something about this:\n\n“They make an example of those of us who dare to speak the truth and call out what is common sense and obvious to the rest of us about their hidden insanity and hypocrisy. Hoping that by making an example of us, they will then cause the rest of us to self-censor ourselves to fall in line and to comply.”\n\nThe ex-congresswoman aired her dissatisfaction with the current state of the Democratic Party and its leadership, arguing that the party has become elitist and intolerant of dissent, seeking power at any cost.\n\nShe criticized the mainstream media, big tech, and the national security state for working together to silence those who challenge the party's narrative.\n\nGabbard also highlighted the weaponization of federal agencies and law enforcement against political opponents, as revealed in the Durham report. She also expresses concerns about the Biden administration's push for a CBDC, seeing it as a threat to privacy and economic autonomy.\n\nThe presidential hopeful warned that the current “power holders prioritize control over people's lives and suppress freedom of speech” and emphasized the importance of active citizenship and defending freedoms to counteract this oppression. Gabbard concluded her keynote by urging people to protect democracy and preserve the vision of the country's founders.\n\nBitcoin 2023 Pulls in Pro-Crypto Politicians\n\nBitcoin Miami 2023 played host to a string of prominent pro-crypto political speakers such as Republican presidential candidate Vivek Ramaswamy, a venture capitalist and “anti-woke” activist, Wyoming senator Cynthia Lummis, Governor Ridwan Kamil from West Java, Indonesia; North Carolina congressman Patrick McHenry, who last month memorably grilled SEC chair Gary Gensler in Congress; Congressman Byron Donalds, representing Florida; and David McIntosh, a former Congressman and White House Senior Staff member.\n\nOrganizers BTC Media previously said that the flagship global Bitcoin conference aims to provide a platform for the discussion of diverse perspectives and ideas. By engaging politicians open to Bitcoin and deepening their understanding of the cryptocurrency, the conference seeks to foster support for the industry in Washington and beyond."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXBpenphLWRheS0yMDIzLWNvbW11bml0eS1yZWFjdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day 2023: Community celebrates anniversary of first known BTC transaction - Cointelegraph",
        "content": "Members of the crypto community celebrated the anniversary of Bitcoin Pizza Day; the first notable exchange of Bitcoin (BTC) into physical goods.\n\nOn May 22, 2010, Laszlo Hanyecz made the first documented purchase of a good with BTC. The exchange involved 10,000 BTC — worth $41 at the time — and two pizzas from a local restaurant in Florida. The milestone turned into an annual celebration for the crypto space as community members reminisced on how far the industry has come since the transaction.\n\nSimilar to previous years, crypto fans celebrated the day by eating pizza, with Bitcoiners in Indonesia sharing a photo of themselves eating pizza in Bali.\n\n#Bitcoin pizza day with bunch of bitcoiners in Bali pic.twitter.com/WbeHx02Xlq — Dea Rezkitha (@dearezkitha) May 21, 2023\n\nMeanwhile, crypto exchanges also joined in on the pizza-eating fun. Crypto exchange Binance served pizza in Naples, Italy, while trading platform OKX shared a photo of its employee’s lunch as it geared up for the day.\n\nWhile many others were busy eating pizza, some took the time to appreciate Jeremy Sturdivant, the person on the other end of the now-famous transaction. One Bitcoiner described Sturdivant as the “true hero” of the story.\n\nRedditors are curious about where the BTC went. Source: Reddit\n\nOn Reddit, community members shared their curiosity about the fate of the 10,000 BTC spent on the pizza. Some speculated that Sturdivant sold the coins after the price increased by five or 10 times, while others thought he might have lost the keys.\n\nAt the time of writing, 10,000 BTC is worth around $268 million.\n\nRelated: Bitcoin FOMO is gone, portfolio managers are taking BTC seriously\n\nWhile the Bitcoin pizza transaction is widely recognized as the first physical goods exchange using BTC, some speculate that there may be a sale that preceded it. On May 14, Crypto Twitter was set ablaze as people considered the possibility of an image being sold in exchange for 500 BTC months before the pizza purchase. Bitcoin creator Satoshi Nakamoto was also involved in the sale.\n\nMagazine: Best and worst countries for crypto taxes — Plus crypto tax tips"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXBpenphLWRhedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "When pizza became the unsung hero of Bitcoin's history: A cheesy celebration - Cointelegraph",
        "content": "There are key events in the fascinating world of cryptocurrencies that have shaped the trajectory of adoption. One such occasion is commemorated annually as Bitcoin Pizza Day: a commemoration of a seemingly unremarkable transaction that had a profound effect on the development of Bitcoin (BTC).\n\nSo, on Bitcoin Pizza Day, let’s indulge in a cheesy celebration. Let’s remember the unsung hero that brought Bitcoin into the real world; a simple slice of pizza that captured the imagination of a community and played a part in the remarkable journey of Bitcoin.\n\nA historic event took place on May 22, 2010\n\nA remarkable event unfolded in the early days of Bitcoin when the idea of digital currencies was still in its infancy. A fervent Bitcoin supporter, Laszlo Hanyecz, requested a pizza on an internet forum and offered a mind-blowing 10,000 BTC as payment. It was a light-hearted request meant to demonstrate Bitcoin’s potential as a medium of exchange.\n\nRelated: Why do we need cryptocurrencies?\n\nWhat happened next would become legendary: Hanyecz received two pizzas at his doorstep after pizza restaurant chain Papa John’s accepted his offer. A pizza slice emerged at that precise time as the unsung Bitcoin hero. Little did he know that this simple request would become an iconic moment, forever commemorated as Bitcoin Pizza Day. This transaction and straightforward exchange highlighted a significant turning point in the evolution of digital currency.\n\nBitcoin did not have much value at the time. It was an experiment and idea supported by a small group of tech enthusiasts. However, when Bitcoin became more well-known and valuable in the wider world, the significance of the pizza transaction became clearer.\n\nA reminder: The success of cryptocurrencies is built on the collective efforts\n\nAs a whimsical celebration, Bitcoin Pizza Day honors Bitcoin’s development from its humble beginnings to the global phenomenon it is today. It serves as a reminder that even seemingly insignificant, unimportant transactions can have far-reaching effects and leave a permanent imprint on history.\n\nBeyond its symbolic meaning, Bitcoin Pizza Day embodies the communal spirit of the cryptocurrency community. This celebration highlights the innovative and socially conscious nature of the Bitcoin industry. It emphasizes the relationships and shared experiences created around a cheesy treat that unintentionally played a significant role in the emergence of Bitcoin and other cryptocurrencies.\n\nRelated: Bitcoin FOMO is gone, portfolio managers are taking BTC seriously\n\nEvents like Bitcoin Pizza Day bring people together who are passionate about decentralized technologies, innovation and digital currencies. It serves as a reminder that a lively community’s efforts and shared values are the foundation for the success of cryptocurrencies.\n\nSo, as you bite into your favorite slice of pizza, take a moment to appreciate the disruptive power of cryptocurrencies and the role they continue to play in empowering individuals, enabling them to take control of their finances and transact seamlessly across borders, bypassing the limitations and intermediaries of traditional banking systems."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXZvbGF0aWxpdHktZHJvcHMtYW1pZC1kZWNsaW5lLWluLWxpcXVpZGl0eS1idXQtYS1wb3NzaWJsZS1jYXRhbHlzdC1pcy1hcHByb2FjaGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin volatility drops amid decline in liquidity, but a possible catalyst is approaching - Cointelegraph",
        "content": "Bitcoin (BTC) price has consolidated within a tight range as hodlers remain hardened and new liquidity is not arriving.\n\nWhile Bitcoin is typically a highly volatile asset, weekly consolidation around a slight 3.4% price range has many analysts feeling that BTC price is stuck. Others are anticipating an uptick in volatility. While the lack of Bitcoin price action is partially due to long-term hodlers' conviction and the trickle of new liquidity entering the market, BTC has still outperformed many assets in 2023.\n\nAccording to a new Glassnode report, on-chain data provides key indicators on Bitcoin’s price.\n\nUnrealized profits up, volume down\n\nBitcoin price liquidity remains cyclically low in realized terms. This may be because many investors are breaking even near the current Bitcoin price.\n\nBitcoin’s price is mirroring historically oversold levels with 9% of unrealized profit remaining in the market.\n\nBitcoin unrealized profit ratio. Source: Glassnode\n\nDespite the rise in transactions due to text-based ordinals, Bitcoin volume remains muted. The lack of liquidity magnifies Bitcoin investors' accumulation strategy even with unrealized profits, showing a solidification of sentiment among long investors. Bitcoin on-chain transfer volumes remain below $4 billion, much lower than the all-time high of over $13 billion.\n\nBitcoin transfer volume. Source: Glassnode\n\nAs a result of the minimal unrealized profits and low liquidity, there is minimal incentive for hodlers to sell.\n\nRelated: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?\n\nSeasoned Bitcoin hodlers increase their wealth\n\nThe May 2021 Bitcoin drop that saw prices fall from $56,000 to $29,000 led to many traders accumulating BTC. With these buyers currently underwater from a profit-perspective, their wealth continues to expand compared to other groups.\n\nThe May 2021 accumulation group’s wealth is up 25% compared to other groups. When looking at Bitcoin hodlers from six months to two years, both are currently at a loss.\n\nBitcoin hodler cohorts. Source: Glassnode\n\nHodlers from the 2021 cycle have been through pain and multiple Bitcoin cycles at this point. The conviction is allowing them to increase their wealth ratio with weaker hands exiting.\n\nBitcoin is up, banks are down\n\nAnalysts continue to fret about the impact of a U.S. debt default and the impact this would have on BTC price.\n\nWhile Bitcoin price typically mirrors the macro markets, BTC has performed better than equities since the U.S. regional bank run.\n\nBitcoin performance against equities. Source: Delphi Digital\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLTIwMjMtZGUtZmktZXhlY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Bitcoin set to 'tick, tick, tick' by the end of 2023 — DeFi exec - Cointelegraph",
        "content": "Bitcoin (BTC) is poised to claim the cryptocurrency throne by the end of 2023, as its superiority “is going to be clear” in every aspect, according to Fedi’s CEO.\n\nDuring the Bitcoin 2023 event in Miami, Cointelegraph reporter Joe Hall interviewed Obi Nwosu, the CEO and co-founder of Fedi, which is a Bitcoin community custody protocol offering an alternative solution for those who lack access to or don’t trust centralized exchanges.\n\nCatching up with homies is the best part of conferences. @obi @FelixWeis taking the picture!\n\n\n\nKnown these dudes for over almost a decade now! And what a decade it's been! pic.twitter.com/1UcfX6KdIg — Marshall Long (@OGBTC) May 19, 2023\n\nNwosu emphasized during the interview that it is becoming “increasingly hard to deny” that Bitcoin has the “fastest, cheapest, easiest, most decentralized and secure” ecosystem.\n\nHe anticipates this will become even more apparent by the end of the year. He noted:\n\n“It is going to be clear by the end of this year that it’s going to be tick, tick, tick for Bitcoin.”\n\nNwosu said whether the goal is to develop functionality, establish a decentralized social media network or empower local communities, it is becoming “increasingly obvious” that Bitcoin is the most efficient and secure solution.\n\nHowever, he believes there is space for other cryptocurrencies besides Bitcoin. He envisions a “multicoin future,” comparing it to the evolution of music.\n\n“I mean, there are still record players and vinyl, right; there’s still some people who like tapes and laser disks.”\n\nFurthermore, he emphasized a “big misunderstanding” regarding Bitcoin’s “slow innovation.”\n\nThere is a misconception that there is a functional or scaling limitation with Bitcoin, but the “reality is” developments are happening “incredibly fast,” Nwosu said, adding that there is a focus on creating solutions “that are correct the first time.”\n\nNwosu highlighted that prioritizing perfection may cause delays but is preferable to the need for changes to be made “again and again.”\n\nRelated: Bitcoin FOMO is gone, portfolio managers are taking BTC seriously — 3iQ CEO\n\nIn Nwosu’s view, cryptocurrency is “an idea,” as it “is a combination of the philosophical aspects and the technological aspects kind of combined together.”\n\nHe explained that due to the intangible nature of cryptocurrency, it cannot be combated with physical forces such as “guns or missiles.” Instead, it is vulnerable to attacks through “misinformation and sometimes inappropriate or extreme regulation.”\n\nCountries lacking belief in freedom of speech, or just freedom overall, are actively looking at this stringent regulation toward cryptocurrency, according to Nwosu.\n\nHe believes the key to fighting against this is to “correct” misinformation and create systems that “empower the good guys.”\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGVzZS1mb3VyLWFsdGNvaW5zLWNvdWxkLWJlLXJlYWR5LWZvci1hbi11cC1tb3ZlLWlmLWJpdGNvaW4tcmFsbGllcy1hYm92ZS0yNy01MDDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "These 4 altcoins could be ready for an up-move if Bitcoin rallies above $27,500 - Cointelegraph",
        "content": "Inexperienced traders usually chase prices higher during the end of the bull phase as they fear missing out on the rally. However, institutional investors tend to wait for the froth to settle before entering. Bitcoin’s (BTC) bear market in 2022 ended the hype that was seen in 2021.\n\nFred Pye, CEO of 3iQ, Canada’s first Bitcoin fund issuer, said in an interview with Cointelegraph that as “the FOMO in Bitcoin is gone” institutional investors and portfolio managers have started to take a look at it as “a serious venue.”\n\nCrypto market data daily view. Source: Coin360\n\nWhile analysts are bullish for the long term, the short-term picture looks uncertain as the price is stuck inside a range for the past several days. Analysts expect a trending move to start either next week or the week after.\n\nIf Bitcoin breaks out to the upside, what are the altcoins that may follow it higher? Let’s analyze the charts of the top five cryptocurrencies that may rally in the short term.\n\nBitcoin price analysis\n\nBitcoin has been trading near the support line of the symmetrical triangle but the bulls have failed to push the price above it. This indicates that the bears are active at higher levels.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe downsloping 20-day exponential moving average ($27,481) and the relative strength index below 42 indicate that bears are at an advantage.\n\nIf the sellers sink the price below the immediate support at $26,361, the BTC/USDT pair may tumble to the crucial support zone between $25,800 and $25,250. Buyers are expected to protect this zone with all their might because if they fail, the pair could nosedive to $20,000.\n\nConversely, if bulls kick the price above the 20-day EMA, it may attract further buying. The pair could then rise toward the resistance line of the triangle. If this barrier is overcome, the pair may start its journey to $32,400.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows the formation of a symmetrical triangle pattern, indicating uncertainty among the bulls and the bears. The flattening moving averages also point to a balance between supply and demand.\n\nIf the price collapses below the triangle, the short-term trend will turn negative and the pair could drop to $25,800. The pattern target of the triangle is $24,773.\n\nThis bearish view will be negated if the price surges above the triangle. The pair could then climb to $28,400 and thereafter to the pattern target of $29,165.\n\nXRP price analysis\n\nXRP (XRP) is trying to start a recovery. Buyers have been sustaining the price above the 20-day EMA ($0.45) since May 16 but they haven’t been able to overcome the obstacle at the 50-day SMA ($0.47).\n\nXRP/USDT daily chart. Source: TradingView\n\nThe 20-day EMA has started to turn up and the RSI is just above the midpoint, indicating that bulls have a slight advantage. That increases the likelihood of a rally above the 50-day SMA. The XRP/USDT pair could then start a rally to $0.54 and eventually to $0.58. This zone is likely to witness aggressive selling by the bears.\n\nThe first support to watch on the downside is the 20-day EMA. Sellers will have to yank the price below this level to gain the upper hand. The pair may then descend to $0.43 and later to the crucial support at $0.40.\n\nXRP/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the recovery reversed direction from the downtrend line. This shows that the bears are fiercely guarding the downtrend line. Sellers are trying to maintain the price below the 20-EMA and stretch the pullback to the 50-SMA.\n\nInstead, if the price turns up from the current level and climbs above the downtrend line, it will suggest the start of a short-term up-move. There is a minor resistance at $0.48 but it is likely to be crossed. The pair may then rally to $0.54.\n\nLitecoin price analysis\n\nLitecoin (LTC) has been trading in a tight range between the 50-day SMA ($89) and the overhead resistance of $96 for the past few days. This shows indecision between the bulls and the bears.\n\nLTC/USDT daily chart. Source: TradingView\n\nThe 20-day EMA ($88) has turned up and the RSI is in the positive territory, indicating that the bulls have the edge. This enhances the prospects of a rally above the resistance at $96. If that happens, the LTC/USDT pair could rally to $106. This level may again attract strong selling by the bears.\n\nThis positive view will invalidate in the near term if the price turns down and plummets below the moving averages. Such a move will suggest that the pair may remain stuck between $79 and $96 for some more time.\n\nLTC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls are trying to defend the 20-EMA. This indicates a change in sentiment from selling on rallies to buying on dips. If the price bounces off the current level, the bulls will again try to clear the overhead hurdle at $96.\n\nHowever, the bears are not going to give up without a fight. They are trying to sink the price below the 20-EMA. If they are successful, the pair may crumble to the 50-SMA. A collapse of this support may open the doors for a fall to $86 and then $82.\n\nRelated: Bitcoin, Ethereum bears are back in control — Two derivative metrics suggest\n\nRender Token price analysis\n\nRender Token (RNDR) is in an uptrend. Buyers kicked the price above the overhead resistance of $2.60 on May 21 but the long wick on the candlestick shows selling at higher levels.\n\nRNDR/USDT daily chart. Source: TradingView\n\nThe upsloping moving averages and the RSI just below the overbought area indicate that bulls are in command. Buyers will make another attempt to propel the price above the psychological barrier at $3. If they manage to do that, the RNDR/USDT pair may rally to $3.35.\n\nThe first support to watch on the downside is the 20-day EMA ($2.10). If this level gives way, it will suggest that the break above $2.60 may have been a bull trap. The pair could then plunge to the 50-day SMA ($1.87).\n\nRNDR/USDT 4-hour chart. Source: TradingView\n\nThe bulls are struggling to sustain the price above the overhead resistance at $2.60, pointing toward the possibility of a bull trap. Sellers will try to strengthen their position by pulling the price below the immediate support at the 20-EMA. If they do that, the pair may decline to the 50-SMA.\n\nHowever, the rising moving averages and the RSI in the overbought zone suggest that lower levels are likely to be purchased. If buyers push and maintain the price above $2.60, the pair could soar to $3.\n\nConflux price analysis\n\nConflux (CFX) is trading inside a descending channel pattern. The bulls purchased the dip to the support line on May 12, indicating solid demand at lower levels.\n\nCFX/USDT daily chart. Source: TradingView\n\nThe 20-day EMA ($0.29) has flattened out and the RSI is near the midpoint, suggesting that the selling pressure has reduced.\n\nBuyers tried to clear the overhead hurdle at the 50-day SMA ($0.32) on May 16 but the bears held their ground. A minor positive in favor of the bulls is that they have not allowed the price to dip back below the 20-day EMA. This signals buying on dips.\n\nThe bulls are likely to make one more attempt to propel the price above the 50-day SMA. If they succeed, the CFX/USDT pair may reach the downtrend line, which is again likely to act as a formidable resistance.\n\nCFX/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the price is correcting the sharp rally from $0.22 to $0.33. Buyers are trying to defend the 38.2% Fibonacci retracement level of $0.29, which is a positive sign.\n\nIf buyers sustain the price above the resistance line, it will suggest that bulls are back in the driver’s seat. The pair may first rise to $0.33 and thereafter to $0.37. Alternatively, a break and close below $0.29 could start a deeper correction toward $0.28 and then 0.27.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZGVjcnlwdC5jby8xNDA4NDcvcm9iZXJ0LWYta2VubmVkeS1qci1iaXRjb2luLWNiZGMtZW5lcmd5LXRheNIBS2h0dHBzOi8vZGVjcnlwdC5jby8xNDA4NDcvcm9iZXJ0LWYta2VubmVkeS1qci1iaXRjb2luLWNiZGMtZW5lcmd5LXRheD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Presidential Candidate Kennedy Vows to Defend Bitcoin Against ‘Invasive Surveillance’ - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSpeaking to a packed audience on the final day of the 2023 Bitcoin Conference in Miami, Fla., Democratic presidential hopeful Robert F. Kennedy Jr. decisively built Bitcoin into his campaign platform, saying the cryptocurrency must be defended against what he called \"invasive surveillance.\"\n\n\"We live in a time now that technology has dangerously expanded the capacity for governments and corporations to control our lives,\" Kennedy said. \"Distant, impersonal multinationals and authoritarian technologies have usurped realms of human activity that were once private or held by the community.\"\n\nKennedy added that these technologies monitor movements, communications, and transactions, pointing to the trucker protest in Ottawa, Canada, in 2022 as an example.\n\nHe said Bitcoin won him over when he witnessed the Canadian administration using surveillance and data tracking systems to block truckers who were protesting COVID mandates from accessing their bank accounts in a bid to end the demonstration.\n\n\"When I witnessed this cataclysm, this devastating use of government repression, I realized for the first time how free money is as important to freedom as free expression,\" Kennedy said.\n\nDuring his keynote address, Kennedy took aim at President Joe Biden's proposed 30% tax on energy use for Bitcoin miners saying it would require an invasive surveillance apparatus to monitor miner energy usage.\n\nInitially introduced in the White House’s 2024 budget, the Biden Administration called for a 30% crypto mining tax, saying that crypto mining consumed almost as much energy, 50,000 gigawatts of electricity, as televisions and home computers in 2022.\n\nThe energy consumed by mining cryptocurrency has long been a cudgel used against proof-of-work blockchains. Proof-of-work blockchains like Bitcoin consume significant energy due to the computational power required to solve the complex mathematical problems involved in mining.\n\nAD\n\nAD\n\n\"It sets a terrible precedent in which everything that you do that requires electricity must now be monitored by the government,\" Kennedy said, adding that he would support people’s right to refuse smart meters in their homes.\n\nKennedy had already stepped into the digital currency arena after opposing a U.S. central bank digital currency, or CBDC, and saying the U.S. government was waging a \"war on crypto.\"\n\n\"As President,\" Kennedy told the audience. \"I will make sure that your right to hold and use Bitcoin is inviolable, [and] I will defend the right of self-custody.\"\n\nNot only would Kennedy protect the right to hold Bitcoin, he assured the crowd, he also pledged to uphold the right to run a private node—saying that Know Your Customer (KYC) requirements should be applied at the level of banks and exchanges, not at the level of nodes.\n\n\"I don't think the government has the right to demand access to your Bitcoin key or indeed any of your passwords,\" Kennedy said. \"To say otherwise is to cede essential territory to the surveillance state.\"\n\n\"The whole point of Bitcoin is that it's decentralized,\" Kennedy said. \"Anyone can run a node, and it's important not only for Bitcoin but for democracy to be decentralized.\""
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLWJlYXJzLXRha2VuLWNvbnRyb2wtdHdvLWRlcml2YXRpdmUtbWV0cmljc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum bears are back in control, 2 derivatives metrics suggest - Cointelegraph",
        "content": "A bearish market structure has been pressuring cryptocurrencies’ prices for the past six weeks, driving the total market capitalization to its lowest level in two months at $1.13 trillion. According to two derivatives metrics, crypto bulls will have a hard time to break the downtrend, even though analyzing a shorter timeframe provides a neutral view, with Bitcoin (BTC), Ether (ETH) and BNB, on average, gaining 0.3% between May 12 and May 19.\n\nTotal crypto market cap in USD, 12-hour. Source: TradingView\n\nNotice that the descending wedge formation initiated in mid-April could last until July, indicating that an eventual break to the upside would require an extra effort from the bulls.\n\nFurthermore, there’s the impending U.S. debt ceiling standoff, as the U.S. Treasury is quickly running out of cash.\n\nEven if the majority of investors believe that the Biden administration will be able to strike a deal before the effective default of its debt, no one can exclude the possibility of a government shutdown and subsequent default.\n\nGold or stablecoins as a safe haven?\n\nNot even gold, which used to be considered the world’s safest asset class, has been immune to the recent correction, as the precious metal traded down from $2,050 on May 4 to the present $1,980 level.\n\nRelated: Bitcoin, gold and the debt ceiling — Does something have to give?\n\nCircle, the company behind the USDC stablecoin, has ditched $8.7 billion in Treasurys maturing in longer than 30 days for short-term bonds and collateralized loans at banking giants such as Goldman Sachs and Royal Bank of Canada.\n\nAccording to Markets Insider, a Circle representative stated that:\n\n“The inclusion of these highly liquid assets also provides additional protection for the USDC reserve in the unlikely event of a U.S. debt default.”\n\nThe stablecoin DAI, managed by the decentralized organization MakerDAO, approved in March an increase to its portfolio holdings of the U.S. Treasurys to $1.25 billion to “take advantage of the current yield environment and generate further revenue.”\n\nDerivatives markets show no signs of bearishness\n\nPerpetual contracts, also known as inverse swaps, have an embedded rate that is usually charged every eight hours.\n\nA positive funding rate indicates that longs (buyers) demand more leverage. Still, the opposite situation occurs when shorts (sellers) require additional leverage, causing the funding rate to turn negative.\n\nPerpetual futures accumulated 7-day funding rate on May 19. Source: Coinglass\n\nThe seven-day funding rate for BTC and ETH was neutral, indicating balanced demand from leveraged longs (buyers) and shorts (sellers) using perpetual futures contracts. Curiously, even Litecoin (LTC) displayed no excessive long demand after a 14.5% weekly rally.\n\nTo exclude externalities that might have solely impacted futures markets, traders can gauge the market’s sentiment by measuring whether more activity is going through call (buy) options or put (sell) options.\n\nBTC options volume put-to-call ratio. Source: Laevitas\n\nThe expiration of options can add volatility to Bitcoin’s price, which resulted in an $80-million advantage for bears in the latest May 19 expiry.\n\nA 0.70 put-to-call ratio indicates that put option open interest lags the more bullish calls and is, therefore, bullish. In contrast, a 1.40 indicator favors put options, which can be deemed bearish.\n\nThe put-to-call ratio for Bitcoin options volume has been below 1.0 for the past couple of weeks, indicating a higher preference for neutral-to-bullish call options. More importantly, even as Bitcoin briefly corrected down to $26,800 on May 12, there was no significant surge in demand for the protective put options.\n\nGlass half full, or investors prepping for the worst?\n\nThe options market shows whales and market makers unwilling to take protective puts even after Bitcoin crashed 8.3% between May 10 and May 12.\n\nHowever, given the balanced demand on futures markets, traders seem hesitant to place additional bets until there’s more clarity on the U.S. debt standoff.\n\nLess than two weeks remain until June 1, when the U.S. Treasury Department has warned that the federal government could be unable to pay its debts.\n\nRelated: U.S. debt ceiling crisis: bullish or bearish for Bitcoin?\n\nIt is unclear whether the total market capitalization will be able to break from the descending wedge formation. From an optimistic perspective, professional traders are not using derivatives to bet on a catastrophic scenario.\n\nOn the other hand, there seems to be no rationale for the bulls to jump the gun and place bets on a speedy crypto market recovery, given the uncertainty in the macroeconomic environment. So, ultimately, bears are in a comfortable place according to derivatives metrics.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oZXJlcy1ob3ctdG8tdXNlLWRlZmktb24tYml0Y29pbi13aXRob3V0LXBvbGx1dGluZy10aGUtYmxvY2tjaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Here's how to use DeFi on Bitcoin without 'polluting' the blockchain - Cointelegraph",
        "content": "Bitcoin (BTC) is known for its immutability and the hard-coded rules that make the system secure but slow to modernize. However, that doesn’t mean the Bitcoin blockchain — the underlying network that empowers the original cryptocurrency — is closed to innovation and development. Even though the initial efforts to introduce decentralized finance (DeFi) to Bitcoin such as cross-chain bridges and wrapped tokens resulted in a massive wave of hacks and exploits in the DeFi space, developers continue to look for new and more reliable ways to tap into the unmatched liquidity of the BTC pool.\n\nLaunched in November 2021, the Bitcoin Taproot upgrade was an important step in adding extra functionality to the base layer of Bitcoin. Among other benefits, including cheaper and more efficient transactions, the Taproot upgrade also introduced rudimentary smart contracts — the backbone of DeFi — to Bitcoin for the first time.\n\nThe Taproot upgrade adds rudimentary smart contracts to the Bitcoin network. Source: Chaindebrief\n\nBitcoin DeFi: The first attempt\n\nSmart contracts are automated agreements between multiple parties that are stored on a blockchain. They enable a wide range of DeFi functionality. The introduction of smart contracts to the Bitcoin base layer hinted at the possibility of common DeFi trends such as nonfungible tokens (NFTs) appearing on the Bitcoin network, and developers rushed to work on it.\n\nShortly thereafter, Bitcoiners came up with their version of NFTs with the Ordinals protocol, sparking a hot debate about adding more usability to the Bitcoin base layer versus “congesting” it with nonessential content. Ordinals, also known as Bitcoin NFTs, allow users to inscribe digital content on the Bitcoin blockchain. Launched in January 2023, ordinals quickly became a popular way to interact with the base layer, surpassing over 3 million inscriptions.\n\nThe total number of ordinals exceeded 3 million on May 1. Source: Dune\n\n​​Following the launch of ordinals, BRC-20 tokens emerged as an experimental token standard based on the Bitcoin Request for Comment (BRC) protocol. These tokens represented fungible assets on a 1:1 basis. However, the influx of memecoins such as Pepecoin (PEPE) on the BRC-20 standard led to a congestion problem, resulting in a backlog of 500,000 transactions awaiting settlement. This surge in demand caused transaction fees to skyrocket to $30 per transaction, significantly impacting the efficiency of the entire Bitcoin network.\n\nBitcoin DeFi: The second attempt\n\nTo make NFTs more efficient on Bitcoin, a new protocol called Bitcoin Stamps, or “Secure Tradeable Art Maintained Securely,” was launched shortly after the ordinals. And unlike the ordinals, Bitcoin stamps allow the minting or embedding of image data into the Bitcoin network by storing image data across multiple unspent transaction outputs to increase decentralization and immutability.\n\nAlthough the second attempt to add NFT usability to the Bitcoin network is widely considered an improvement over ordinals, Bitcoin stamps are far from providing ideal results. The protocol requires a canvas size of 24 by 24 pixels, which limits the possibilities to pixel-art NFTs.\n\nMeanwhile, the issue of “polluting” the Bitcoin blockchain by storing data directly on the base layer remains unsolved. Moreover, a controversial topic still hovers over the Bitcoin community: Do we need NFTs on the main Bitcoin chain?\n\nAdditionally, just as BRC-20 spawned from ordinals, stamps formed their own tokenization standard called SRC-20. However, while SRC-20 tokens have greater immutability, they take up even more block space than BRC-20 tokens, and if their popularity would grow, it would further congest the Bitcoin network.\n\nBitcoin DeFi using Layer 2\n\nAn alternative approach aims to solve all the shortcomings of layer-1 (i.e. Bitcoin), DeFi by moving NFT and tokens to layer 2 thus decongesting Bitcoin, lowering fees, and adding additional use cases. Like the Lightning Network solved many aspects of Bitcoin payments as a layer-2 solution, NFTs and tokens can also be moved to the second layer to keep the Bitcoin base layer clean and efficient. This reduces the need for all transactions to use Bitcoin for settlement.\n\nMintlayer, a layer-2 solution that builds the tools to enable DeFi on Bitcoin, aims to open Bitcoin to NFTs along with smart contracts, atomic swaps, and decentralized applications (DApps). Using a layer-2 network directly on Bitcoin enables lower minting and transfer costs while adding smart contract features and reducing congestion on the base layer.\n\nInstead of trying to get DeFi onto the Bitcoin network through unreliable gateways such as cross-chain bridges and wrapped tokens, Mintlayer enables direct swaps of native Bitcoin for other tokenized assets minted directly on Mintlayer, eliminating all intermediaries between Bitcoin and DeFi.\n\nTo tokenize assets with tailored protocols designed for specific use cases, Mintlayer has introduced three tokenization standards. The MLS-01 is created for securities, stablecoins, and stock tokens to function on Bitcoin, while the MLS-02 is designed for confidential transactions. The third one, MLS-03, is built for NFTs only. Since it’s developed specifically with NFTs in mind, there’s no need to write a smart contract — unlike ordinals and Stamps. MLS-03 also unlocks the limits introduced by layer-1 attempts by leveraging the freedom of layer-2.\n\n\"It’s exciting to see innovation on the Bitcoin blockchain,” said Enrico Rubboli, CEO of Mintlayer, adding, “But, ultimately, NFTs and tokens need to be on layer 2. There are many constraints for NFTs and tokens in terms of size, smart contract capabilities, and immutability that Mintlayer won’t be subject to.”\n\nDeFi on Bitcoin allows the sustainable and efficient use of decentralized financial applications on the Bitcoin network. By offloading the complexity of DeFi to layer 2, Bitcoin users can now benefit from improved scalability, reduced transaction costs, and a wider range of financial services while still leveraging the security and robustness of the underlying Bitcoin blockchain.\n\nLearn more about Mintlayer"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1wcmVzaWRlbnRpYWwtY2FuZGlkYXRlLXZpdmVrLXJhbWFzd2FteS10by1hY2NlcHQtYml0Y29pbi1mb3ItY2FtcGFpZ24tZG9uYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "US presidential candidate Vivek Ramaswamy to accept Bitcoin for campaign donations - Cointelegraph",
        "content": "Vivek Ramaswamy becomes the second 2024 presidential candidate in the United States to officially accept Bitcoin (BTC) donations for his campaign.\n\n“Give $1,” said Ramaswamy while announcing that he accepts Bitcoin donations. The revelation came just two days after Robert F. Kennedy Jr. became the first presidential candidate in United States history to accept campaign donations in Bitcoin. Speaking on stage at Bitcoin 2023 in Miami, Florida, Ramaswamy stated, “Let’s make the 2024 election a referendum on fiat currency.”\n\nU.S. presidential candidate Vivek Ramaswamy announcing his campaign would accept Bitcoin donations. Source: Facebook\n\nAs shown above, Ramaswamy flashed a QR code while on stage, which, when scanned, would redirect users to a payment gateway that offers various payment options for donations, including BTC and satoshis — the smallest denomination of Bitcoin.\n\nPayment options for Ramaswamy’s donations showing BTC and sats. Source: support.vivek2024.com\n\nRamaswamy opted for BitPay’s payment service to receive Bitcoin donations. However, BitPay supports other cryptocurrencies, including Bitcoin Cash (BCH), Ether (ETH), ApeCoin (APE), Litecoin (LTC), Dogecoin (DOGE) and Shiba Inu (SHIB), among others.\n\nJust announced we’re officially accepting #Bitcoin donations.\n\nGive $1.\n\nLet’s make the 2024 election a referendum on fiat currency. https://t.co/KrHJdomtCh pic.twitter.com/OkVmoBmTFz — Vivek Ramaswamy (@VivekGRamaswamy) May 20, 2023\n\nEligible U.S. citizens and permanent residents can donate up to $6,600 for the campaign, which is not deductible as charitable contributions for federal income tax purposes. Donors will be awarded a nonfungible token (NFT), with the donation page stating, “After donating, come back to claim your NFT.”\n\nRelated: FTX seeks to claw back political donations by the end of February\n\nIn February, lawmakers in the Kansas House of Representatives introduced a bill proposing a cap of $100 when it comes to crypto political donations.\n\nFor donations under $100, the receiver would need to “immediately convert” the crypto to U.S. dollars, not use the crypto for expenditures, and not hodl the funds.\n\nMagazine: Hyperbitcoinization is underway, RFK seeks Bitcoin donations and other news: Hodler’s Digest, May 14–20"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wZXBwZXJvbmktYml0Y29pbi1waXp6YS1kYXktd29ydGgtdG9kYXktYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "The pepperoni on the first pizza bought with Bitcoin is worth $6.5M today - Cointelegraph",
        "content": "It’s been 13 years since programmer Laszlo Hanyecz made the first commercial transaction with Bitcoin (BTC) on May 22, 2010, buying two supreme pizzas from Papa John’s for a whopping 10,000 BTC, or $266 million at current prices.\n\nThat day is known and celebrated as Bitcoin Pizza Day.\n\nTo commemorate the occasion, Cointelegraph sought to find out the answer to one more burning question. How much did it cost to construct these two famous pizzas?\n\nThe supreme pizzas purchased by Hanyecz in 2010. Source: Internet Archive\n\nTo answer this, it is assumed that Hanyecz ordered Papa John’s “The Works” pizza, which is the pizza chain’s version of a supreme pizza.\n\nConsidering the amount required and the price of ingredients at the time, here’s what it would have cost to put together just one of the Bitcoin Pizzas, not including labor, overhead and the pizza base.\n\nPepperoni: 244 BTC = $6.5 million\n\n244 BTC = $6.5 million Bacon: 146 BTC = $3.8 million\n\n146 BTC = $3.8 million Italian sausage: 97 BTC = $2.5 million\n\n97 BTC = $2.5 million Onions: 24 BTC = $640,000\n\n24 BTC = $640,000 Green peppers: 36 BTC = $960,000\n\n36 BTC = $960,000 Mushrooms: 63 BTC = $1.6 million\n\n63 BTC = $1.6 million Black olives: 121 BTC = $3.2 million\n\n121 BTC = $3.2 million Cheese: 730 BTC = $19.4 million\n\nTotal cost of ingredients: 1,461 BTC, or $39 million. Talk about an expensive feast.\n\nHistory of Bitcoin Pizza Day\n\n“Bitcoin Pizza Day” marks the world’s first transaction for real-world goods using Bitcoin and celebrates the massive rise in the value of the cryptocurrency since then, which was worth only $0.0041 in May 2010 and is now worth over $26,500 at current prices.\n\nIn the end, Hanyecz’s pizza order was delivered four days after he posted his request on May 18, 2010, on the Bitcointalk forum.\n\nRelated: Primordial NFT? Someone tried to sell a JPG for BTC months before Bitcoin Pizza Day\n\n“I'll pay 10,000 bitcoins for a couple of pizzas,” he wrote, saying those who take up the request “can make the pizza yourself and bring it to my house or order it for me from a delivery place.”\n\n13 years ago tomorrow the first #Bitcoin purchase was made. Two pizzas were bought for 10k BTC, which at that time was equivalent to $40.\n\n\n\nBitcoin pizza day ahead. celebrate with a slice! pic.twitter.com/owdaA2AtBj — Pentoshi euroPeng (@Pentosh1) May 21, 2023\n\nJeremy Sturdivant, a 19-year-old university student at the time, delivered the now-famous pizzas for the Bitcoin haul on May 22, 2010. He told Cointelegraph in 2018 that he sold them to afford a holiday and had “never seen Bitcoin as an investment.”\n\nHanyecz said he didn’t regret it, and his early work on Bitcoin led him to code a program that made it possible to mine the cryptocurrency on computer graphic processing units.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2lucy0xM3RoLXBpenphLWRheS1yZWZsZWN0aW5nLW9uLXRoZS10cmFuc2FjdGlvbi10aGF0LWNoYW5nZWQtY3J5cHRvLWhpc3Rvcnkv0gFvaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2JpdGNvaW5zLTEzdGgtcGl6emEtZGF5LXJlZmxlY3Rpbmctb24tdGhlLXRyYW5zYWN0aW9uLXRoYXQtY2hhbmdlZC1jcnlwdG8taGlzdG9yeS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin’s 13th Pizza Day: Reflecting on the Transaction that Changed Crypto History - CryptoPotato",
        "content": "Today- May 22 – is the 13th anniversary of Bitcoin Pizza Day, a historic event that marked the first time BTC was publicly used as a medium of exchange. On 22 May 2010, Laszlo Hanyecz, a programmer and early Bitcoin adopter, forever etched his name in history by purchasing two Papa John’s pizzas for 10,000 BTC.\n\nAs the world celebrates the 13th Bitcoin Pizza Day, let’s reflect on the astronomical growth that Bitcoin has achieved, both in value and as a viable payment method for goods and services, since that fateful day.\n\nBitcoin Pizza Day\n\nAlthough the 10,000 BTC Hanyecz spent to purchase the two pizzas was worth $40 at the time of the transaction, the present value is worth an astonishing $270 million, with the asset’s current price standing at $27,000. This illustrates just how much the value of Bitcoin has grown in the past decade, as well as the profit margin for early adopters who held to date.\n\nMany in the crypto community look back on Bitcoin Pizza Day with nostalgia and disbelief as they try to put themselves in Hanyecz’s shoes and imagine what it must have been like to spend what would eventually become a fortune on a couple of pizzas. Others see it as an important reminder of the potential of cryptocurrencies and the power that early adopters can have in shaping the future.\n\nThe Significance of Bitcoin Pizza Day\n\nIt is worth noting that purchasing those pizzas was not just a random act of food-loving frivolity. Hanyecz’s decision to use BTC to make a purchase was a deliberate attempt to test the usability of the currency in a real-world setting. At the time, Bitcoin was still a relatively unknown and untested currency, and Hanyecz’s experiment was one of the first real-world applications of the technology.\n\nToday, hundreds of mainstream companies, including entertainment giant AMC, coffee maker Starbucks, and retail platform Overstock.com, accept Bitcoin and other crypto assets as payment options.\n\nHanyecz’s Contributions to the Bitcoin Network\n\nBeyond his infamous pizza purchase, Laszlo Hanyecz was a significant contributor to the early development of Bitcoin. He played a crucial role in fixing many vulnerabilities in the network during its early stages, helping to make the protocol more secure and stable.\n\nHanyecz’s pioneering work also extended to software development. He was the first person to release the Bitcoin code for Mac OS, which helped pave the way for the wide adoption of Bitcoin as a digital currency. Additionally, he played a vital role in transforming the Bitcoin mining landscape, laying the groundwork for today’s industry’s growth.\n\nLooking back on this day 13 years ago, it is clear that Hanyecz’s decision to buy those pizzas for 10,000 BTC was a defining moment in the history of cryptocurrencies. It demonstrated the potential and utility of Bitcoin, paving the way for many more use cases and innovations to come."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kb2dlbWl5YWdpLWVtZXJnZXMtZXRoZXJldW0tcHJpY2UtZGFuZ2xlcy0xNjUxNTk2MjcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "DogeMiyagi Emerges as Ethereum Price Dangles, While Bitcoin's Decline Intensifies with a 10% Fall in May 2023 - Yahoo Finance",
        "content": "A leaked document distributed to Democratic House Financial Services Committee members has revealed the “key messages” legislators were advised to keep to, which might result in practically all cryptocurrencies being classified as securities.\n\nAs governments and regulatory agencies impose more robust controls on cryptocurrencies such as Bitcoin and Ethereum, investors and enthusiasts are left worrying about the potential repercussions.\n\nOne fascinating issue arises: if the price of Bitcoin (BTC) and Ethereum (ETH) tumbles, will meme currencies become more popular? Will DogeMiyagi ($MIYAGI) become the meme market leader?\n\nFurthermore, would cryptocurrencies in presale garner greater interest because they are untouched by the current market trend?\n\nThe Great Crypto Cliffhanger: Bitcoin’s Precarious Position and Ethereum’s Fate in the Balance\n\nAs the crypto world holds its breath, Bitcoin’s (BTC) price is perched precariously on a stable support level, making it a compelling opportunity for eager buyers to accumulate. After several failed attempts to break free and soar to new heights, BTC is back at the notorious $27,000 barrier, like a stubborn explorer refusing to surrender to the depths.\n\nOh, the drama! After seven days of relentless selling, Bitcoin’s price has finally taken a break from the madness, settling down for a cosy consolidation around the familiar $27,000 support level. It’s like the calm after a stormy affair, where BTC is catching its breath, unsure of its following path.\n\nWill it sweep Monday’s low at $26,694, teasing us with a swift recovery and reclaiming its support level throne? Or will it succumb to the temptation of becoming a resistance barrier, shattering our bullish dreams and potentially triggering a merciless correction to $25,290 and $23,905 levels? The plot thickens.\n\nMeanwhile, our beloved Ethereum (ETH) has been busy cooking up some technical mischief. Picture this: a bearish divergence sells signal on the daily chart, unfolding its treacherous formation between January 14 and May 13, leaving unsuspecting investors in disbelief.\n\nStory continues\n\nLike a magician revealing their trickery, this wicked move sent ETH on a 17% freefall, leaving it gasping for air at the measly $1,735 mark. But fear not! Hope lies in the mystical realm of critical support floors, and ETH’s saviour awaits at the sacred $1,705 level. If it can summon the strength to bounce back from this abyss, a glimmer of light might shine through, guiding it on a heroic journey towards the superb $2,028 destination.\n\nBut patience, dear investors, patience! Remember, the tale of Ethereum’s fate is yet to be written, and it eagerly awaits Bitcoin’s proclamation of direction. In this mesmerising world of cryptocurrencies, where fortunes rise and fall with the flicker of a digital heartbeat, one thing remains clear: the intricate dance of Bitcoin sets the stage for its companion, Ethereum.\n\nThe Rise of Meme Coins: Exploring the Allure and Potential of DogeMiyagi in the Crypto Market\n\nThe general public is drawn to meme coins because of the possibility of rapid returns and the entertaining and dynamic communities surrounding them. While meme currencies lack the technological complexity and use cases of Bitcoin and Ethereum, their popularity stems from their ease of usage, low cost, and viral growth potential. The current crackdown on mainstream cryptocurrencies may have created a void that meme coins might fill, luring buyers looking for new investment possibilities.\n\nThe presale of meme coins is another important factor in their success.\n\nDuring a market downturn, presale cryptocurrencies provide a unique opportunity for investors. These new currencies are introduced through presales or initial coin offers (ICOs), which allow investors to purchase tokens before they are available on the general market. Because market trends do not yet influence presale coins, they enable investors to enter the market at an early stage.\n\nOverall, coins, let us welcome its highness DogeMiyagi to the meme market podium!\n\nMIYAGI is one of the most recent meme currencies, and it has the potential to become the market leader.\n\nThrough thorough audits, DogeMiyagi proudly emphasises its dedication to identity verification and risk assessment. Its commitment to maintaining a safe environment has won the prestigious Know Your Coin (KYC) accreditation, indicating its commitment to fostering community trust.\n\nDogeMiyagi understands the importance of community involvement and aims to establish an environment that values and benefits all members. DogeMiyagi aspires to stand out in the ever-changing world of cryptocurrencies with its unique features, attention to security and compliance, and commitment to community trust.\n\nDogeMiyagi:\n\nWebsite: https://dogemiyagi.com\n\nTwitter: https://twitter.com/_Dogemiyagi_\n\nTelegram: https://t.me/dogemiyagi"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN1cHBseS1jcnlwdG8tZXhjaGFuZ2VzLWZhbGxzLTA4MjY1NDcwOC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin supply on crypto exchanges falls to multi-year low - Yahoo Finance UK",
        "content": "Cryptocurrency exchanges now hold approximately 1.89 million bitcoin, a drop from 2.22 million in May 2022. Photo: Getty (Namthip Muanthongthae via Getty Images)\n\nThe supply of bitcoin across all cryptocurrency exchanges has fallen to its lowest level since December 2017.\n\nBitcoin (BTC-USD) fell 1.3% to $26,779 on Monday while ether (ETH-USD) was down 0.8% to $1,806.\n\nOver the past month, bitcoin's price has primarily consolidated, reducing its value by just 2%, according to Coingecko.\n\nThere has been a 14.87% decline in the amount of Bitcoin held on all exchanges over the past year, according to data from Coinglass.\n\nRead more: Crypto live prices\n\nCryptocurrency exchanges now hold approximately 1.89 million bitcoin, a drop from 2.22 million in May 2022.\n\nEthereum reserves have fallen to the same level seen in 2015, when the cryptocurrency debuted.\n\nADVERTISEMENT\n\nInventors are moving cryptocurrencies off exchanges and into personal crypto wallets, indicating a growing trend towards self-custody among traders.\n\nThe move also creates less liquid supply on exchanges, indicating that a short term price rise could occur if demand for bitcoin or ether should increase.\n\nIt comes as US president Joe Biden has said he will not agree to a debt deal that protects \"tax cheats and crypto traders\".\n\nAt a meeting of the G7 heads of state in Hiroshima, Japan, on 21 May, he called on Republican lawmakers to work towards a compromise in the ongoing debt ceiling talks.\n\nRead more: Bitcoin shows bullish signals after Janet Yellen warns US could be 'out of cash by early June'\n\n“I’m not going to agree to a deal that protects wealthy tax cheats and crypto traders while putting food assistance at risk for nearly a hundred — excuse me — nearly 1 million Americans,\" Biden said.\n\n\"Protections for crypto traders\" is believed to refer to tax-loss harvesting.\n\nThe White House and Republican leaders are currently engaged in talks about potentially preventing this mechanism from applying to cryptocurrency transactions, according to the Washington Post.\n\nWatch: Japan vies to be 'number one again through web3 innovation' | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtdXMtdHJlYXN1cnktaXMtcnVubmluZy1vdXQtb2YtY2FzaC10cm91YmxlLWFoZWFkLWZvci1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "The US Treasury is running out of cash — Trouble ahead for Bitcoin? - Cointelegraph",
        "content": "Macro Markets, hosted by crypto analyst Marcel Pechman, airs every Friday on the Cointelegraph Markets & Research YouTube channel and explains complex concepts in layperson’s terms, focusing on the cause and effect of traditional financial events on day-to-day crypto activity.\n\nThe latest Macro Markets show discusses the impact of the United States debt crisis as the government quickly runs out of money, a billionaire’s investor alert for an incoming economic bubble burst, and why Walmart’s better-than-expected earnings are a warning sign for investors.\n\nAccording to Pechman, the government has incentives to show desperation and scare the general public into pressuring Congress to approve another increase to the debt ceiling. The risks of a government shutdown and subsequent default exist, which could lead to a wave of bankruptcies and stock market crashes as people rush to liquidate assets for cash.\n\nIn such a “black swan” scenario, Bitcoin (BTC) could face a 40% to 80% drop in a couple of days, according to Pechman. But there’s a catch: why would investors keep huge cash positions after the dust settles? As soon as the government raises the debt and issues more money, it’s instantly diluted.\n\nNext, Pechman discusses billionaire investor Stanley Druckenmiller’s warnings of the “biggest and probably broadest asset bubble.” Stanley believes that what we’re seeing right now in terms of unemployment, delinquency rates and corporate earnings is completely masqueraded by artificially low interest rates.\n\nLastly, Pechman debates Walmart raising its full-year outlook as first-quarter sales top expectations. According to Walmart’s CEO, the consumer discretionary sector is not doing well. The sector’s performance is quite the opposite, with higher incomes moving away from more expensive stores and moving to low-cost retailers.\n\nPechman explains that such news should initially concern Bitcoin and crypto investors since the younger audience is highly relevant to demand. Therefore, as Drukenmiller said, be prepared for unbelievable opportunities ahead.\n\nIf you are looking for exclusive and valuable content provided by leading crypto analysts and experts, make sure to subscribe to the Cointelegraph Markets & Research YouTube channel. Join us at Macro Markets every Friday."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGlydGVlbi15ZWFycy1hZnRlci1maXJzdC1iaXRjb2luLXB1cmNoYXNlLWxheWVyLTItc29sdXRpb25zLXN0cnVnZ2xlLXRvLWdhaW4tdHJhY3Rpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "13 years after first Bitcoin purchase, layer-2 solutions struggle to gain traction - Cointelegraph",
        "content": "Thirteen years after the world’s first Bitcoin (BTC) pizza purchase, the pioneer cryptocurrency network faces a new wave of disruption thanks to the advent of Ordinals, the recently launched protocol that allows adding digital content such as art — i.e. nonfungible tokens — in the Bitcoin blockchain.\n\nSince the launch of Ordinal NFTs on the Bitcoin mainnet in January 2023, the network's traffic has increased significantly, spiking transaction costs and spotlighting issues surrounding Bitcoin.\n\nBitcoin mempool, the “waiting area” for incoming transactions on the network, has over 286,000 pending transactions at the time of writing. While the number is lower than the peak of 400,000 clogged transactions at the beginning of the month, it is still historically high.\n\nIn an interview with Cointelegraph’s Joe Hall during last week’s Bitcoin Builders, Muneeb Ali, the CEO of Trust Machines, explained how Ordinals NFT’s hype could support Bitcoin in attracting more developers and capital to layer-2 solutions.\n\n“Bitcoin is the largest asset. We should have the best devs, the best scientists trying to work on Bitcoin layer-2s,” said Ali. He believes the fee spike provided clear evidence to developers and investors that layer-2 protocols for Bitcoin are in demand.\n\nRelated: Ordinals good or bad for Bitcoin? Supporters and opposers raise voices\n\nThe purpose of layer-2 solutions is to improve the scalability, privacy, and other characteristics of layer-1 blockchains, such as the Bitcoin network. Ali's Trust Machines is a layer-agnostic ecosystem for Bitcoin applications, building on various layers in the Bitcoin network.\n\nTotal number of transactions on the Bitcoin blockchain in the past 12 months. Source: Blockchain.com\n\nThere is a $500 billion market potential untapped on the BTC network, claims Ali, referring to BTC’s current market capitalization of $521 billion. Products, users and the amount of Bitcoin sent on the Lightning Network (LN), the layer-2 payment solution built on top of its blockchain, has skyrocketed in 2023. Despite the figures, the Bitcoin space continues to struggle for developers, and there are no entities “playing the game,” explained Ali.\n\nBitcoin, the CEO says, is “so decent,” a benefit that can still hinder the development of a solid developer ecosystem. “There is no marketing department, there is no foundation, there’s no incentive. That’s why it is grassroots decentralized and most decentralized driven.”\n\nIncreasing Bitcoin fees may attract more developers, but won’t unlock its global potential if layer-2 solutions don’t gain traction as a category for venture capitalists, defends Ali. “If collectively, Bitcoin layer-2s emerge as a very attractive category, and there’s better education around why it is interesting, it is a narrative as well. I think the community can have a very grassroots narrative, and there’s a ton of support for Bitcoin out there.”\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum — Can we fix it?"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYXJhdGhvbi1kaWdpdGFsLWhvbGRpbmdzLWRvbmF0ZXMtNTAway0wMzQ2MTk3NDYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Marathon Digital Holdings Donates $500K to Bitcoin Software - Yahoo Finance",
        "content": "Marathon Digital Holdings Donates $500K to Bitcoin Software\n\nMarathon Digital Holdings Donates $500K to Bitcoin Software\n\nMarathon Digital Holdings, a leading Bitcoin mining company, has announced its commitment to supporting the development and maintenance of the open-source Bitcoin Core client software. During the Bitcoin 2023 conference held in Miami, Florida, Marathon said they will match donations to the non-profit Bitcoin research and development firm Brink, up to $500,000 on a two-for-one basis. Following the conference, Marathon will continue to match additional donations on a one-for-one basis until December 31. These contributions will be used to fund grants and programs that financially support Bitcoin Core developers, ensuring the continuous improvement of the world's dominant blockchain. Marathon CEO Fred Thiel emphasized the importance of compensating these developers, who often rely on grants to sustain their work, and expressed his desire to engage other industry partners in supporting this vital ecosystem.\n\nThe recent market downturn in the crypto industry, known as the \"crypto winter,\" had raised concerns about funding for Bitcoin development. However, Marathon's generous pledge, which may reach $1 million with third-party donations, demonstrates the company's commitment to bolstering the Bitcoin funding landscape. Thiel highlighted the reliance of developers on their personal resources and the necessity of grants, such as those provided by Brink, to ensure their financial stability. Brink, founded in 2020, supports Bitcoin protocol development through its fellowship mentor program and developer grant program. Thiel and Brink's co-founder and executive director, Mike Schmidt, jointly announced this initiative during the conference, garnering significant support."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzIyL2JpdGNvaW4tcGl6emEtZGF5LXR1cm5zLXNvdXItYXMtbWVtZS1jb2luLXNoeXN0ZXJzLXByb2ZpdC1vdmVyLTIwMGstaW4tcnVnLXB1bGxzL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNS8yMi9iaXRjb2luLXBpenphLWRheS10dXJucy1zb3VyLWFzLW1lbWUtY29pbi1zaHlzdGVycy1wcm9maXQtb3Zlci0yMDBrLWluLXJ1Zy1wdWxscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day Turns Sour as Meme Coin Shysters Profit Over $200K in Rug Pulls - CoinDesk",
        "content": "There are multiple ways in which developers can \"pull the rug\" on projects, one of which is by adding a modifiable sell tax to the smart contract. That gives the contract owner the ability to raise the tax so high that it makes the tokens unsellable. An alternative – and more common – approach is for a smart contract owner to hold the vast majority of a token, waiting for the price to rise before selling the token into freshly formed liquidity from unsuspecting investors."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sb25naW5nLWZvci1saXF1aWRpdHktNS10aGluZ3MtdG8ta25vdy1pbi1iaXRjb2luLXRoaXMtd2Vla9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Longing for liquidity — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a new week in a price range that frustrates traders and leaves little to the imagination — what next?\n\nAfter precious little activity over the weekend, the largest cryptocurrency lacks direction, and even macroeconomic triggers have failed to shift the status quo.\n\nAt around 10% below the $30,000 mark, BTC/USD is treading water, and despite calls for a further correction, market participants are dealing with a tiny active trading range.\n\nLiquidity is there to be taken above and below, but so far, only a tease of a liquidity sweep has materialized.\n\nThe coming days have some potential macro surprises in store, but analysts agree it will take a significant shift in the data to crack a stubborn Bitcoin.\n\nElsewhere, on-chain signals are also characteristic of a consolidation period following the rapid gains seen in Q1.\n\nCointelegraph looks at the landscape regarding BTC price action to see what could disrupt the trend — or lack of it — this week.\n\nWhere’s the liquidity?\n\nBitcoin spot price performance is giving traders a headache — not because of volatility, but the lack of it.\n\nIn what feels like an unusual state of events, BTC/USD is acting within a range of only a few hundred dollars, with nothing that has been able to change the mood.\n\nEven last week’s remarks from Jerome Powell, chair of the United States Federal Reserve, were not enough to send Bitcoin definitively higher or lower.\n\nTraders are thus increasingly on the sidelines waiting for cues.\n\n“If we lose $26,600 and close on a 4 hour candle closure i will look to short. Bears took us to support, but can they now take us and close below,” Crypto Tony summarized to Twitter followers on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nThe small range just below $27,000 has been Bitcoin’s home since May 13. Outside, both long and short liquidity lies in wait.\n\nAccording to data from trading suite DecenTrader, a move to $25,800 is all it would take to spark some form of cascade.\n\n“Dips keeping being aggressively longed on Binance, as shown by the Long/Short ratio,” it revealed.\n\n“Typically we see this kind of price action flush out a lot of these traders as prices chops about. The long Liquidity starts at $25,800.”\n\nBitcoin liquidity map. Source: Decentrader/ Twitter\n\nOthers eyed historical patterns, with Stockmoney Lizards drawing comparisons to Bitcoin’s behavior after the 2015 bear market.\n\n“This year is the boring year,” Michaël van de Poppe, founder and CEO of trading firm Eight, continued in part of his own thoughts on Bitcoin in 2023.\n\n“No price acceleration, no fundamental growth, while the preparations for the next bull cycle are made during this year.”\n\nShort-timeframe analysis over the weekend highlighted $27,200 as a level to break through in order for “sustained momentum” to return.\n\nClassic choppy pattern on #Bitcoin.\n\n\n\nRejects at $27,200 and consolidates, as CME gap is also around $26,900.#Bitcoin needs to break and flip $27,200 if we want to see any sustained momentum.\n\n\n\nBeneath us, at around $26,000-26,500 -> 200-Week MA. pic.twitter.com/4rvuHLyjxe — Michaël van de Poppe (@CryptoMichNL) May 21, 2023\n\nAs Cointelegraph reported, some still believe the current price action is a prelude to a deeper correction toward $24,000.\n\nIn terms of volatility, however, Bitcoin is now at its quietest since the start of the year, data from monitoring resource CoinGlass shows.\n\nBitcoin historical volatility chart (screenshot). Source: CoinGlass\n\nPCE data forms week’s macro highlight\n\nMacro triggers are set to increase somewhat this week, as May 26 sees a slew of economic data, including the Personal Consumption Expenditures (PCE) Index.\n\nThis is a key component for the Fed regarding interest rate policy, and its readings can instantly reshape market expectations for rate changes.\n\nThat was the case during Powell’s speech last week, with the odds of a rate hike pause increasing from 60% to 80%.\n\nAs of May 22, those odds remain high at around 86%, according to CME Group’s FedWatch Tool, with the next decision on policy not due for another three weeks.\n\nFed target rate probabilities chart. Source: CME Group\n\nThe disparity between market expectations and the conservative language of the Fed thus remains a key phenomenon, one which Powell himself addressed last week.\n\nThe phenomenon, he said, “appears to reflect simply a different forecast, one in which inflation comes down much more quickly,” adding that there was no such guarantee of this.\n\n“While we do not have a report on PCE inflation for April yet, another inflation measure, the core component of the Consumer Price Index (CPI), showed little further improvement in April,” comments from Fed board member Philip Jefferson at the 2023 International Insurance Forum in Washington, D.C. on May 18 stated in a similarly risk-off tone.\n\nBeyond that, May 24 will see the release of the minutes from this month’s Federal Open Market Committee (FOMC) meeting, at which the most recent rate hike was decided. Markets will scrutinize the exact language employed by Fed members during that event.\n\nA separate debate concerns the U.S. debt ceiling debacle, with talks remaining deadlocked last week.\n\nShort-term BTC holder profits trend toward reset\n\nIt’s consolidation time for the BTC supply, with on-chain data showing a lack of movement compared to recent months.\n\nAccording to the figures from on-chain analytics firm Glassnode, the portion of the supply last active within the previous three to six months is now at three-month lows.\n\nCorresponding to the period from December 2022 to February 2023, this suggests hodlers sitting on their hands as last year’s bear market fizzled to produce the start of Bitcoin’s 70% Q1 gains.\n\nContrasting that is the supply last active one to three months ago, now at three-month highs and covering the portion of price action, which includes the $31,000 local highs from April.\n\nAt the same time, the effects of the subsequent comedown can be seen in hodlers’ unrealized profit, now at its lowest levels in a month.\n\nBitcoin relative unrealized profit chart. Source: Glassnode/ Twitter\n\nThat latter figure could yet preclude a reset in expectations of Bitcoin speculators, classified as short-term holders (STHs) with positions three months old or less. Drifting downward, BTC/USD is slowly approaching their current average cost basis.\n\nEarlier in May, Glassnode noted that such a “reset” in profitability tends to offer significant price support.\n\nResearch into the STH market value to realized value (MVRV) metric, then at 1.15, nonetheless warned a reset might require a dip below $25,000.\n\n“Should a deeper market correction develop, a price of $24.4K level would bring a STH-MVRV back to a break-even value of 1.0, which has shown to be a point of support in up-trending markets,” it stated.\n\nSTH-MVRV measured 1.047 as of May 21, the latest date for which data is currently available.\n\nBitcoin STH-MVRV chart. Source: Glassnode\n\nWhale BTC price influence “lessening”\n\nProbing the May correction, on-chain analytics platform CryptoQuant drew some specific conclusions about the forces driving markets.\n\nIn one of its Quicktake market updates on May 17, researchers flagged profit-taking and whale activity as key phenomena pertaining to recent BTC price action.\n\n“The latest Bitcoin price dip followed Long-Term Holders (LTHs) capitalizing on the year’s highest profit ratio, over 34%. Furthermore, on a broader scale, all market players managed to realize profits exceeding 7% on average,” it commented on market participants as a whole.\n\nOn whales, CryptoQuant referenced the exchange whale ratio metric, which tracks the size ratio of the top ten exchange inflow transactions relative to the total.\n\n“This downturn is also influenced by whales taking the lead in depositing Bitcoin into exchanges, as evidenced by the early May surge in the Exchange Whale Ratio. Without a doubt, Bitcoin transactions by these whales escalated to fairly high levels, with transfers involving more than 40% of the coins,” it continued.\n\nBitcoin exchange whale ratio annotated chart (screenshot). Source: CryptoQuant\n\nIn terms of support, the research nonetheless acknowledged that whales’ overall impact on the market is “lessening” as time goes by.\n\nSTHs, on the other hand, were responsible for protecting the $26,500, which was subsequently held as support over the weekend.\n\n“Investors who have held Bitcoin for 1 to 3 months show a significant support level in their cost basis ($26.5K), indicating that this was a key point during the recent price correction,” it added.\n\nCrypto market fear on the up\n\nAside from on-chain data, social signals suggest that the average crypto market participant is becoming afraid.\n\nRelated: These four altcoins could be ready for an up-move if Bitcoin rallies above $27,500\n\nThe Crypto Fear & Greed Index matched two-month lows at the end of last week, now below the 50 midpoint and markedly unlike its composition at April’s $31,000 local BTC price highs.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nExpectations thus seem skewed toward conditions worsening for markets; and while broadly “neutral,” Fear & Greed is not the only source showing traders’ doom and gloom.\n\n“With Bitcoin revisiting the $26k level, traders are showing increased worries of prices falling back to the $20k to $25k range,” research firm Santiment added on May 19.\n\n“$BTC social dominance has jumped high again, typically a sign of fear. Fear signals increase the probability of a rebound.”\n\nBitcoin social activity data. Source: Santiment/ Twitter\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tb25lcm8tYmV0dGVyLWJpdGNvaW4tYmlnLWV5ZXMtMTY1NDUwNDMwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Is Monero Better than Bitcoin? How Will Big Eyes Coin Change the Equation? - Yahoo Finance",
        "content": "Is Monero better than Bitcoin? It is a question that has been asked since it was discovered that Moner mining can be much easier and more rewarding than Bitcoin.\n\nAnd this week Monero (XMR) has tested the truth of that assumption. As it displayed relatively uncommon stability, does that mean that Monero will surpass Bitcoin?\n\nAnother question that people have been asking for a while is “What is the next big thing in crypto?” and we might be closer to the answers than we know. Big Eyes Coin (BIG) ends its presale on June 3rd and celebrates that by offering tokens at a vastly discounted price for the remainder of the presale.\n\nMonero Rises 0.47%: Is It Better Than Bitcoin?\n\nBig Eyes Coin About To Pounce On The Market\n\nBitcoin’s Price Fluctuates\n\nMonero Rises 0.47%: Is it Better than Bitcoin?\n\nMonero (XMR) became famous for providing private transactions to its users, and for being easier to mine than Bitcoin or Ethereum. By using an algorithm that enables Monero mining on a relatively less-advantaged computer, it has prompted some to ask: is Monero better than Bitcoin?\n\nMonero’s XMR has exhibited relatively low volatility compared to the overall cryptocurrency market. On Monday, it saw a modest increase of 0.47% to reach $153.8. InvestorsObserver assigns Monero a Volatility Rank of 14, indicating its low volatility compared to other cryptocurrencies. This places Monero in the bottom 14% of cryptos in terms of volatility.\n\nThe low volatility ranking suggests that Monero’s price experiences narrower swings and is less susceptible to manipulation. Currently, Monero’s price is trading near resistance levels, with support at around $152.44 and resistance at approximately $153.94. This may indicate potential selling pressures ahead as the coin may be reaching an overextended state.\n\nBig Eyes Coin About To Pounce On The Market\n\nBig Eyes Coin’s community has carried it through 13 stages of presale, and now the end is almost upon us, as the end of the presale has been given a date; June 3rd. The official launch will follow soon after on June 15th, but for the remainder of this final month, the presale price will be cut down to $0.00017 which was the price during stage 3.\n\nStory continues\n\nBy selling its token at a fraction of a cent, Big Eyes Coin has confirmed its dedication to its community and its gratitude for its support. Now, we can look forward to the launch of BIG’s casino and its NFT collection.\n\nThe Casino will allow holders to play P2E games using their $BIG as currency and betting chips. And the NFT collection will act as an owners’ club by providing members with exclusive events, content, and opportunities.\n\nBig Eyes Coin has announced that it will allocate 5% of its token supply to a charity wallet dedicated to donating to charities that are saving the oceans, forests, and animals.\n\nBitcoin’s Price Fluctuates\n\nBitcoin (BTC) recently broke the $27,200 level, sparking speculation about its future price. Hedge fund manager Paul Tudor Jones expressed concerns about Bitcoin’s regulatory challenges and diminished positive outlook due to lower inflation expectations. CoinShares reported four weeks of outflows from crypto investment funds, primarily in Bitcoin-related products, indicating negative sentiment.\n\nThe US dollar gained traction ahead of the US Debt Ceiling Talks and the release of retail sales data. Bitcoin’s technical indicators suggest a potential bullish rebound if it maintains support above $26,800, targeting $27,800 or $27,500.\n\nThe answer to the first question we asked was “Is Monero better than Bitcoin?” may not be so easy to agree upon, and neither is the answer to the second question “What is the next big thing in crypto?” but we can make educated guesses on both of them.\n\nMonero mining does not require much computational power which has helped raise its price significantly. And with the end of Big Eyes Coin’s presale, things in the crypto world might soon change, since we will be finally able to witness its potential in effect.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nInstagram: https://www.instagram.com/BigEyesCoin/\n\nTwitter: https://twitter.com/BigEyesCoin"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS90aGlzLXllYXJzLWJpdGNvaW4tcGl6emEtZGF5LWNvdWxkLW1ha2Utb3ItYnJlYWstYnRjLWhlcmVzLWhvdy_SAVlodHRwczovL2FtYmNyeXB0by5jb20vdGhpcy15ZWFycy1iaXRjb2luLXBpenphLWRheS1jb3VsZC1tYWtlLW9yLWJyZWFrLWJ0Yy1oZXJlcy1ob3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "This year’s Bitcoin Pizza Day could make or break BTC- Here’s how - AMBCrypto News",
        "content": "Bitcoin’s price on the remembrance inched closer to 2022’s value.\n\nThe coin might face rejection or break out due to the tight trading range.\n\nEvery 22 May marks Bitcoin [BTC] pizza day. And this year, the king coin price floated around $26,850, according to data from CoinMarketCap. The event is an annual celebration to mark the first commercial use of the digital asset in a transaction.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nAlthough this year is the thirteenth commemoration, the incident happened in 2010, when Laszlo Hanyecz, a programmer, exchanged 10,000 Bitcoins for two pizzas. During this period, the coin’s worth was less than a penny.\n\nInterestingly, the BTC price on the same day in 2022 was closer to the price this time, especially as it occurred at a time when the broader market was suffering the consequences of the Terra Luna [LUNA] and Terra [UST] crash. So, what could happen to BTC’s value this time?\n\nMake or mar season\n\nAccording to Michaël van de Poppe, BTC’s classy choppy pattern could either help it race beyond $27,200 or face a rejection around the same area.\n\nClassic choppy pattern on #Bitcoin. Rejects at $27,200 and consolidates, as CME gap is also around $26,900.#Bitcoin needs to break and flip $27,200 if we want to see any sustained momentum. Beneath us, at around $26,000-26,500 -> 200-Week MA. pic.twitter.com/4rvuHLyjxe — Michaël van de Poppe (@CryptoMichNL) May 21, 2023\n\nA choppy pattern occurs when bulls (buyers) and bears (sellers) are roughly even when it comes to control. Here, the asset value is often linked with volatile periods and rectangular patterns. This makes it extremely difficult to trade.\n\nBefore his recent opinion, the technical analysis specialist had also referred to BTC’s historical performance. Like the aforementioned point, he considered the 200-day Moving Average (MA), noting that it could be a “make or break” week for BTC. Poppe said,\n\n“If you go back in history, the 200-MA retest is a great period to accumulate. In the past 6 months, Bitcoin has been swimming beneath for a long period, making it the most undervalued since existence. Next week is make-or-break. Fast breakout upwards -> end of correction.”\n\nOf the rise and increased adoption\n\nHowever, there have been some positive happenings in BTC since the last Pizza Day. According to Santiment, the total number of holders one year ago was 42.08 million.\n\nAt press time, the same metric was 47.6 million. The increase in the number of holders means that BTC adoption has improved despite the series of capitulations within the period.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nWhen it comes to the transaction count, it was also a similar case. As expected, this transaction count has been unsteady. The metric was 479,000 — almost double the number it was the previous year. The hike implied that many addresses were now optimistic about trading the underlying coin.\n\nIn conclusion, Bitcoin Pizza Day does not only represent a time to look at the above event, but it also reflects a season to explore the coin growth over the years."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xNDA5NTQvYml0Y29pbi1icmMtMjAtYWN0aXZpdHktdW5ldGhpY2FsLW9yLWlsbGVnYWwtbWljaGFlbC1zYXlsb3LSAVtodHRwczovL2RlY3J5cHQuY28vMTQwOTU0L2JpdGNvaW4tYnJjLTIwLWFjdGl2aXR5LXVuZXRoaWNhbC1vci1pbGxlZ2FsLW1pY2hhZWwtc2F5bG9yP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "MicroStrategy's Michael Saylor: Early Bitcoin BRC-20 Uses May Be ‘Illegal’ - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMichael Saylor, MicroStrategy co-founder and executive chairman, has become one of the few Bitcoin maximalists to publicly embrace Ordinals.\n\nOrdinal inscriptions are similar to NFTs, which primarily exist on rival network Ethereum. Inscriptions allow for arbitrary and non-financial information, such as images, to be included on the Bitcoin blockchain. Short for \"Bitcoin Request for Comment,\" BRC-20 is an experimental framework for building fungible tokens on Bitcoin using the Ordinals protocol.\n\nOver the past couple weeks though, Ordinals and BRC-20 tokens have taken center stage as transaction fees skyrocketed. It has kicked off many discussions within the Bitcoin community over whether the network was being attacked and if these transactions should be censored.\n\nAD\n\nAD\n\nSaylor chatted with Decrypt at the Bitcoin 2023 conference in Miami last week about Ordinals, BRC-20 inscriptions, and whether they might constitute unregistered securities.\n\nSaylor has embraced Ordinals as a positive development on the Bitcoin network, although he said many of the early use cases \"aren't terribly serious\" and veer towards being more speculative.\n\nOne of the top performing Bitcoin Ordinals collections has been Bitcoin Frogs, according to CryptoSlam. It's a spin off of the Pepe the Frog meme coin craze that's taken the NFT community by storm.\n\n\"If BRC-20 tokens are viewed as fungible tokens to issue unregistered securities, there's a lot of objection to that, because it's unethical. It's illegal. And you can't blame [the community] for objecting to that,\" Saylor said.\n\nHowever, if they are issued and regulated in an ethical and legal manner, he said, there’s no issue. It all comes down to the use case and perception.\n\nAD\n\nAD\n\n“What if I was using them to tokenize all of the stocks and ETFs trading on NASDAQ so that individuals can take personal custody of their shares of stock instead of leaving them locked up with a centralized custodian” he said. “If it was presented that way, then Bitcoiners would love it.”\n\nAccording to the MicroStrategy co-founder and executive chairman, however, he sees economically sound use cases, but he can “also imagine unethical, stupid things.”\n\nLike many Bitcoiners, Saylor believes it's best to let the free market function—people should invest in what they believe in and are free to criticize something they think is silly but should not work to censor them.\n\nDespite warnings of possible unregistered security offerings and strong pushback from parts of the community, Saylor is against censoring Ordinal transactions on the Bitcoin network. “Do I think we should modify the protocol to censor certain types of transactions,\" he said. \"My answer is no.”"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmludGVjaG1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9tcHMtY2FsbC1mb3ItYml0Y29pbi10by1iZS1yZWd1bGF0ZWQtYXMtZ2FtYmxpbmctaW4tdGhlLXVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "MPs call for Bitcoin to be regulated as gambling in the UK - FinTech Magazine",
        "content": "MPs in the United Kingdom are looking to establish more regulations around cryptocurrency trading. The Treasury Committee has released a report, stating crypto should be regulated as gambling, recommending that the UK Government regulate unbacked cryptoasset activities.\n\nThis subject remains relevant against the current backdrop of financial inclusion, where Crypto regulations could impact its accessibility. Currently, the only regulations for cryptocurrency are set around anti-money laundering (AML) and anti-terrorism funding. However, some MPs across the Government are calling for greater rules to be put in place, such as financial services trading regulations being assigned to crypto, or even gambling regulations.\n\nHarriett Baldwin MP: “Effective regulation is clearly needed”\n\nCommenting on the report, Harriett Baldwin MP, Chair of the Treasury Committee, says: “The events of 2022 have highlighted the risks posed to consumers by the cryptoasset industry, large parts of which remain a wild west. Effective regulation is clearly needed to protect consumers from harm, as well as to support productive innovation in the UK’s financial services industry.”\n\nThe report itself states that cryptocurrencies like Bitcoin, for instance, have ‘no intrinsic value’ and ‘serve no useful social purpose’, whilst being used by criminals in scams, fraud and money laundering.\n\nConcerns were also raised for regulating consumer crypto trading as a financial service, which MPs say will create a so-called ‘halo effect’ - ultimately leading consumers to believe that it is a safe and protected activity when MPs do not think it is.\n\nCurrently, around 10% of UK adults hold or have helo cryptoassets, according to HM Revenue & Customs.\n\nCryptoUK speaks out against gambling comparison\n\nJonathan Millet, a Business Consultant at NewsBTC, shared his insight on the proposed regulations, saying; “because tangible currencies or assets do not back cryptocurrencies, the market has the potential to be volatile and, along with substantial financial gains, they too come with the risk of substantial financial losses.\n\n“MPs and UK lawmakers fear if the same regulations as financial services are applied, a false sense of security around the level of risk involved is created.”\n\nMillet also says that CryptoUK, the self-regulatory crypto trading association, has spoken out in strong disagreement about the comparison between gambling and crypto trading.\n\n“The association has taken Umbridge to the claims of the Treasury Select Committee, saying they are harmful, false and unfounded.”\n\nAccording to Millet, professional investment managers see Bitcoin, as well as other crypto assets, as a new alternative investment strategy and not as a form of gambling. His belief is that crypto trading has plenty to offer the financial trading and services sector.\n\n“Many of these benefits are not openly discussed and include quicker settlement times, automation of contracts through AI, cost reductions through relevant intermediary services and enhanced liquidity.\"\n\n“Better collaboration is needed [with] the UK government”\n\nMillet continued: “Consumer risks, of course, exist, and these should be mitigated through education awareness and a more robust framework giving clarity on the regulatory landscape in which they operate.”\n\nThis would involve dedicated sources of information surrounding the risks involved in consumer crypto trading, which Millet believes should be widespread and on openly available platforms.\n\n“Better collaboration is needed between CryptoUK, and the UK Government to increase education and elevate consumer awareness through campaigning and advertising,” he says.\n\n“We believe creating bespoke regulatory frameworks, tailored to suit constant industry changes and developments will ensure the FCA is positioned to give the best duty of care to all individuals.”\n\nLikewise, Nick Jones, Co-Founder and CEO of Zumo has spoken out against the Treasury Committee’s report, stating: “What an appalling backward step this would be.”\n\nJones continues: “The UK should be looking to encourage alternative financial solutions, not discouraging them by likening them to gambling. A truly resilient future financial system shouldn’t be resistant to new ideas and structures, rather it should be supportive of them. And it should dare to integrate new ideas where they provide genuine value – not panic and revert to the perceived safety of failing methods.”\n\n"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLXBpenphLWRheS1oZXJlcy1ob3ctbXVjaC1idGMtcGl6emFzLWFyZS13b3J0aC1ub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: Here's How Much BTC Pizzas Are Worth Now - DailyCoin",
        "content": "Crypto Twitter celebrates the 13th anniversary of the famed Bitcoin Pizzas.\n\nThe cost of the first-ever commercial transaction in Bitcoin soared over the years.\n\nBitcoin (BTC) traded below key support of $27,000 since 2 PM GMT Sunday.\n\nAs Bitcoin Pizza Day, the 13th anniversary of the first-ever commercial transaction via Bitcoin (BTC), kicks in, let’s remember how it all started. Laszlo Hanyecz, an American-Hungarian programmer from Florida, attempted to get two large pizzas for 10,000 Bitcoins in 2010.\n\n“I’ll pay 10,000 Bitcoins for a couple of pizzas. Like maybe 2 large ones so I have some leftovers for the next day”, said the unlucky programmer, only to find out later that he paid millions of dollars for the delivery of two XXL pizzas.\n\n13 years ago, Laszlo Hanyecz, a Floridian programmer, bought 2 Papa John's pizzas for 10,000 $BTC. Today, those pizzas would be valued at $267 million.\n\n\n\nHappy #Bitcoin Pizza Day, everyone! 🍕 pic.twitter.com/OlJcFfOAG7 — CoinGecko (@coingecko) May 22, 2023\n\nHow Much Are the Bitcoin Pizzas Worth Now?\n\nDespite the original thread on Bitcointalk.org receiving immediate interest, it was also packed with sarcastic replies. To illustrate, a crowd of members accused Mr. Hanyecz of “trying to get a free meal,” while others advised selling the 10,000 BTC for $41.\n\nThis plaque resides on the Jacksonville, Florida Papa Johns. pic.twitter.com/yGYLlwCAcl — Documenting ₿itcoin 📄 (@DocumentingBTC) May 22, 2021\n\nFinally, on 22nd May 2010, the request was fulfilled. One sharp crypto enthusiast from the United Kingdom ordered the delivery on Papa John’s website and ended up with 10,000 BTC. Having picked up the delivery, Mr. Hanyecz happily shared a pic of one of the most expensive meals ever made.\n\nNine months later, Bitcoin was equivalent to the United States Dollar (USD). A few years further, on Bitcoin Pizza Day’s 5th Anniversary, the two pizzas were already worth $2.4 million. The famed Bitcoin Pizzas from Papa John’s are now worth $267 million.\n\nHappy #Bitcoin Pizza Day, Geckos! 🍕\n\n\n\nHere's a look at how the price of $BTC has changed on May 22 since 2010. pic.twitter.com/JtM0zfpcqk — CoinGecko (@coingecko) May 22, 2023\n\nOn the Flipside\n\nMost people on the website considered this food delivery for 10,000 Bitcoins a bargain.\n\nWhy This Matters\n\nThe famed Bitcoin Pizzas story unearths Bitcoin’s progress as a top hedge against fiat.\n\nExplore DailyCoin’s trending crypto stories:\n\nCrypto Twitter Panics Over False MetaMask Tax Withholding Rumors\n\nCrypto Abbreviations: Blockchain Acronyms You Need to Know"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZW4taW4vbmV3cy1hbmQtdHJlbmRzL2JpdGNvaW4tcGl6emEtZGF5LWNlbGVicmF0aW5nLXRoZS1jb3N0bGllc3QtcGl6emEtaW4tdGhlLzQ1MjYwNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: How Cryptocurrency Has Moved Further Than Just buying Pizza - Entrepreneur",
        "content": "The 10,000 BTC would now be valued at around USD 270 million today, valued at USD 26,833.55. In November 2021, BTC reached an all-time high of USD 68,789, which would have made Hanyecz worth around $690 million had he not ordered the infamous pizzas\n\nOpinions expressed by Entrepreneur contributors are their own.\n\nYou're reading Entrepreneur India, an international franchise of Entrepreneur Media.\n\nThe curious case of a Floridian programmer named Laszlo Hanyecz and his purchase of two pizzas worth 10,000 Bitcoin in 2010 precisely tells you about the true volatile nature of cryptocurrencies such as Bitcoin.\n\nOn May 18, 2010, Hanyecz took to the Bitcointalk.org forum to announce his decision to pay 10,000 BTC to anyone willing to place an order of two pizzas, preferably two large pies for him. No one took his offer until May 22, when 19-year-old Jeremy Sturdivant accepted his offer.\n\nThe two large-size Papa John's pizzas were delivered to Hanyecz's place in Florida and cost USD 41 then. Hanyecz took to the forum to share the image of the pizzas along with his family.\n\nVia Twitter\n\nThe 10,000 BTC would now be valued at around USD 270 million today, valued at USD 26,833.55. In November 2021, BTC reached an all-time high of USD 68,789, which would have made Hanyecz worth around $690 million had he not ordered the infamous pizzas.\n\nWhile talking to CBS in 2019, Hanyecz looked back and shared, \"The transaction made [Bitcoin] real for some people. It certainly did for me.\" And today is marked as Bitcoin Pizza Day to celebrate the potential of the then-nascent cryptocurrency.\n\nThe leap of faith\n\nCurrently, there as over 22,000 cryptocurrencies in existence across the world, with BTC being the most valued fiat currency. While there are 235 crypto exchanges existing globally, with Binance being the biggest player.\n\nThe acceptance and adoption of cryptocurrency in 2023 could certainly not have been predicted back in 2010. Banks, corporates, startups, and governments are all embracing the technology and working towards harnessing its full capabilities.\n\nNow, cryptocurrency is the backbone of several emerging industries and ventures. Luxury fashion house Ralph Lauren in April 2023 opened its Miami concept store and partnered with Bitpay to become the first-ever store to accept cryptocurrency. \"Miami is the first of our stores to accept cryptocurrency,\" the brand shared on LinkedIn.\n\nBack in August 2022, Gucci announced it was accepting ApeCoin for purchases at select stores in the United States, \"Now accepting @ApeCoin payments via @BitPay, select Gucci boutiques in the USA expand the range of cryptocurrencies available for in-store purchases, yet another step in the House's exploration of Web3.\"\n\nSome of the big names who are accepting BTC include Microsoft, Burger King, KFC, and Starbucks. Delhi's Ardor 2.1 became the first Indian restaurant to accept cryptocurrency. It was also offering a 20 per cent discount for customers paying via crypto.\n\nIn September 2021, El Salvador became the first country to accept Bitcoin as a legal tender.\n\nThe significance\n\nRajagopal Menon, vice-president, WazirX, shared, \"Bitcoin Pizza Day symbolises the remarkable evolution of the Bitcoin and crypto space over the past decade. From the humble purchase of two pizzas for 10,000 bitcoin to its current total capitalisation of over half a trillion, Bitcoin has come a long way. This transaction heralded the current widespread adoption and showcases the transformative power of cryptos and their emergence as a legitimate asset class in the global financial landscape.\"\n\n\"It is important to note that the real significance lies in the recognition of this transaction as the first real-world use case for Bitcoin, demonstrating its potential as a decentralized digital currency. Bitcoin Pizza Day serves as a reminder of the rapid growth and adoption of cryptocurrencies, highlighting the journey from a seemingly trivial transaction to a global phenomenon. It symbolizes the early believers and pioneers who played a key role in establishing Bitcoin as a viable alternative to traditional financial systems,\" notes Sathvik Vishwanath, Co-Founder & CEO, Unocoin.\n\n\"Bitcoin Pizza Day is a testament to the power of community and the growing acceptance of BTC as part of our daily lives,\" said Yi He, co-founder and chief marketing officer, Binance."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXRoaXMtaW5kaWNhdG9yLWNvdWxkLWRpc21pc3MtaW52ZXN0b3JzLWN1cnJlbnQtZGlzbWF5L9IBWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXRoaXMtaW5kaWNhdG9yLWNvdWxkLWRpc21pc3MtaW52ZXN0b3JzLWN1cnJlbnQtZGlzbWF5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin: How this metric can save investors - AMBCrypto News",
        "content": "BTC may have approached the beginning of a bullish run.\n\nThe coin circulation rests in an extremely low region.\n\nBitcoin’s [BTC] failure to recover from its recent decline could be something that long-term investors may not necessarily need to worry about, based on signals from the Pi Cycle Top indicator.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nHistorically, the indicator has been instrumental in picking out market cycles. Furthermore, the metric uses the 111-day Moving Average (MA) and a multiple of the 350-day MA with respect to the Bitcoin Price.\n\nOffering chances that lead to the pinnacle\n\nAccording to LookIntoBitcoin, the 111-day MA was still lower than the 350-day MA. This implies that the current market was far from being overheated since Bitcoin peaks only happened when the former surpassed the latter.\n\nTherefore, it may seem advantageous to accumulate some BTC at the current state. Despite the hope that the Pi Cycle Top Indicator offers, the Bitcoin fear and greed index decreased to 48.\n\nThe index considers volatility, momentum, and market sentiment in determining participant reaction to sudden price action.\n\nIn the first quarter, this index pointed to the greed region. But now that it was neutral and closer to the fear area, it means that investors were not presently excited about the price prospect.\n\nAt press time, BTC’s price was $27,069, a mild 3.83% decrease in the last 30 days. In addressing network profitability, the adjusted Spent Output Profit Ratio (aSOPR) left the negative region.\n\nThe aSOPR reflects the shift in market sentiment of shrimps and whales’ lifespan while monitoring profitability. With its value above 1.0, the aSOPR showed that there has been a recovery around the 90-day Exponential Moving Average (EMA).\n\nTherefore, this means that a wide cross-section of BTC holders leaned toward profitability.\n\nCirculation down\n\nAlthough the aSOPR and Pi Cycle Top indicators displayed bullish potential, BTC might require more input from investors than is currently experienced. For instance, the 365-day circulation had dropped to 5.61 million.\n\nRealistic or not, here’s BTC’s market cap in ETH terms\n\nCirculation shows the number of unique coins engaged in transactions within a specific period. As of January, circulation was as high as 6.05 million. Hence, the decline means that investors were shying away from exchanging BTC between addresses.\n\nMeanwhile, the daily active addresses have revived from the severe decrease on 7 May. As of 20 May, the metric has moved to 737,000.\n\nThis meant that there was a considerable level of crowd depositing and receiving BTC based on the market. Thus, increasing the level of interaction with the coin."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLXBpenphLWRheS1ob3ctb25lLXRyYW5zYWN0aW9uLWluLTIwMTAtbGVkLXRvLWdsb2JhbC1jcnlwdG8tYWRvcHRpb24vYXJ0aWNsZXNob3cvMTAwNDIwMjQwLmNtc9IBnAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLXBpenphLWRheS1ob3ctb25lLXRyYW5zYWN0aW9uLWluLTIwMTAtbGVkLXRvLWdsb2JhbC1jcnlwdG8tYWRvcHRpb24vYW1wX2FydGljbGVzaG93LzEwMDQyMDI0MC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: How one transaction in 2010 led to global crypto adoption? - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy9pbmRpYS91cy1lbGVjdGlvbnMtdml2ZWstcmFtYXN3YW15LWFjY2VwdHMtZG9uYXRpb25zLWluLWJpdGNvaW4tc2F5cy1hLXJlZmVyZW5kdW0tb24tZmlhdC1jdXJyZW5jeS0xMTY4NDY4NDc2NTAzMi5odG1s0gGYAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL2luZGlhL3VzLWVsZWN0aW9ucy12aXZlay1yYW1hc3dhbXktYWNjZXB0cy1kb25hdGlvbnMtaW4tYml0Y29pbi1zYXlzLWEtcmVmZXJlbmR1bS1vbi1maWF0LWN1cnJlbmN5L2FtcC0xMTY4NDY4NDc2NTAzMi5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "US Elections: Vivek Ramaswamy accepts donations in Bitcoin, says 'a referendum on fiat currency’ | Mint - Mint",
        "content": "In another move to showcase his support for cryptocurrencies, Republican Presidential candidate Vivek Ramaswamy became the second candidate in US Presidential elections in 2024 to accept donations through Bitcoin. Vivek Ramaswamy made the announcement during the Bitcoin 2023 conference in Miami and also urged his supporters to \"make the 2024 election a referendum on fiat currency.\"\n\nVivek Ramaswamy is the second candidate to allow donations through Bitcoin and before him, Robert F. Kennedy Jr. also made a similar move that reflects the influence of Bitcoin-like cryptocurrencies and the transformation the future of finance is going to witness.\n\nVivek Ramaswamy displayed a QR code during his speech, which links his supporters with a payment gateway with various donation options including Bitcoin and satoshis. The citizens and permanent residents of the US, who are eligible to vote can donate up to $6,600 to Vivek Ramaswamy's campaign and as a token of appreciation can receive a nonfungible token (NFT).\n\nHe clarified that he does not plan to issue any NFT for personal profits or campaign fundraising and is just giving an option to US voters to make their donation in the form of Bitcoin. Vivek Ramaswamy emphasized that he is not threatened by the rise of digital currencies.\n\nFreedom to mine Bitcoin\n\nVivek Ramaswamy stressed the freedom to mine Bitcoin in the US as the country recently surpassed China to become the global hub for mining activities. But, US President Joe Biden proposed a 30% tax on electricity used by cryptocurrency mining operations. Vivek Ramaswamy has opposed this tax calling it wrong, unfair, and an inappropriate exercise of federal power.\n\nAt the Bitcoin Conference 2023, Vivek Ramaswamy plans to unveil his Bitcoin policy which allows Bitcoin and other cryptocurrencies to function as parallel currencies. He believes that this can stabilize the dollar as the unit of measurement and the Federal Reserve mandate to focus on currency stabilization can be restricted.\n\nWith two candidates backing cryptocurrencies', the US Presidential Elections in 2024 will decide a lot of things for Bitcoin-like digital currencies. Currently, the governments of the world are still mulling over how much breathing space they should allow to a parallel currency and the massive dives in the value of Bitcoin-led cryptocurrencies also underlines its volatility.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYm9sZC5jb20vdGhlLXdvcmxkcy1maXJzdC1iaXRjb2luLXRvd2VyLXNldC10by1iZS1idWlsdC1pbi1kdWJhaS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "The world's first 'Bitcoin Tower' set to be built in Dubai - Finbold - Finance in Bold",
        "content": "A Dubai-based developer has recently announced ambitious plans to construct the world’s first-ever Bitcoin (BTC) Tower, an innovative project that aims to showcase the importance of digital assets and cryptocurrencies, set to be unveiled at the upcoming COP28 meeting in Dubai on May 24.\n\nThe new hotel chain set to be shaped in the style of Bitcoin is said to not only embrace cutting-edge technologies such as blockchain and artificial intelligence but also place a strong emphasis on material sustainability and zero CO2 usage, according to a report by EINpresswire on May 21.\n\nThe unique hotel chain takes things a step further by offering non-fungible tokens (NFTs) with special utilities designed to reward its customers. By staking cryptocurrencies, guests will generate an APY that can later be redeemed from their rental payment.\n\nSalvatore Leggiero, the developer behind this visionary undertaking, proudly declares, “It will be the first hotel that gives you back the money you paid, plus interest.” Such an enticing proposition promises an unforgettable experience for guests while also tapping into the potential financial benefits of cryptocurrencies.\n\nLeggiero elaborates on the genesis of the project, stating:\n\n“Every great project originates from an idea, develops in the mind, and takes shape on paper, just like Leonardo da Vinci did when he imagined the machines of the future.”\n\nExperiences never imagined before\n\nSeeking inspiration for the virtual representation of the BITCOIN TOWER, Leggiero approached renowned architect Simone Micheli.\n\n“So, I asked the renowned architect Simone Micheli how the BITCOIN TOWER could be depicted in the virtual universe.”\n\nWith over three decades of experience in completing numerous international projects, Micheli brings a fresh perspective to the table, intending to create virtual environments that unlock previously unimaginable experiences.\n\nA 40-story tower\n\nThe Bitcoin Tower itself is poised to be an awe-inspiring 40-story skyscraper, symbolizing Dubai’s tribute to Bitcoin and encapsulating the principles of its enigmatic creator, Satoshi Nakamoto. Leggiero envisions the tower as a real estate revolution, bridging the gap between digital and physical assets.\n\n‘What I propose is a real estate revolution, creating a bridge between digital and physical real estate. BITCOIN TOWER will be the starting point for all those who want to participate in this revolution’, said the CEO.\n\nInviting artists, architects, creatives, and crypto enthusiasts from all corners of the globe, Leggiero, who also serves as the CEO of Metaverse Investments LLC, urges individuals with diverse backgrounds to participate in this groundbreaking endeavor.\n\n“All those who want to, can submit their works that will form an exclusive collection of NFTs dedicated to the Bitcoin Tower’s design or its internal spaces, in a digital space representing an asset of exceptional tangible value.”\n\nIt will serve as a monumental starting point for those who wish to be a part of this revolution, as expressed by the real estate developer and investor, who operates in Italy, London, and Dubai.\n\nWith its forward-thinking approach, Dubai aims to establish itself as a global hub for cryptocurrency innovation while pushing the boundaries of traditional real estate."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2JpdGNvaW4tcGl6emEtZGF5LWhpc3RvcnktZGV0YWlscy13aGF0LWhhcHBlbmVkLWNyeXB0b2N1cnJlbmN5LWJ1eS1wYXBhLWpvaG5zLWxhc3psby1oYW55ZWN6LTE2MDM5NDLSAZEBaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9iaXRjb2luLXBpenphLWRheS1oaXN0b3J5LWRldGFpbHMtd2hhdC1oYXBwZW5lZC1jcnlwdG9jdXJyZW5jeS1idXktcGFwYS1qb2hucy1sYXN6bG8taGFueWVjei0xNjAzOTQyL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: What Happened On May 22? What Is It's Significance? All You Need To Know - ABP Live",
        "content": "Every year, people across the globe celebrate Bitcoin Pizza Day on May 22. This day is important among crypto enthusiasts as Bitcoin, the world's oldest and most valued crypto, was used for the first time to purchase a real-world product. Cryptocurrency fans call it ‘Bitcoin Pizza Day’ as Floridian programmer Laszlo Hanyecz had paid 10,000 Bitcoins to have two Papa John's pizzas delivered to him on May 22, 2010. Simply put, pizza was the first real-world item to be bought using Bitcoin. In this explainer, let us try to understand its history and significance, and also take a quick look at what industry experts have to say on this.\n\nBitcoin Pizza Day: History\n\nThe first instance of Bitcoin halving took place in 2012 and just after that, on May 18 that year, Hanyecz announced on the Bitcointalk.org forum that he wished to purchase two large pizzas using Bitcoins. He announced offering 10,000 Bitcoins to anyone who was willing to order, collect, and deliver them to him personally.\n\nThe pizzas did get delivered to him, however, the identity of the person who accepted Hanyecz's remained a secret for a long time. Later on, it was found that 19-year-old Jeremy Sturdivant was the one who accepted the order, purchased the pizzas from Papa John's and got them delivered to Hanyecz.\n\nDuring a 2019 interview with CBS, Hanyecz said, “The transaction made [Bitcoin] real for some people. It certainly did for me.\"\n\nTo honour the day, the global crypto community commemorates May 22 each year as 'Bitcoin Pizza Day'.\n\nHow Much Could The Two Pizzas Be Worth Today?\n\nBack on May 22, 2010, the two pizzas were worth 10,000 Bitcoins, or roughly at around $41. Notably, the value of the two pizzas increased to a whopping $2.4 million in 2015, and eventually, the price of each Bitcoin reached around $63,000 per token in 2021. If we consider that, those two Papa John's pizzas are today worth around $630 million.\n\nBitcoin Pizza Day: Reactions From Crypto Community\n\nMudrex CEO and co-founder Edul Patel told ABP Live, “Bitcoin Pizza Day symbolises the incredible journey of cryptocurrencies, from a humble transaction to a global phenomenon. It reminds us of the immense growth potential and transformative power of digital assets in shaping the future of finance.”\n\nAshish Singhal, the CEO and co-founder of CoinSwitch, said, “On this day in 2010, Bitcoin made its inaugural practical use, establishing a model for subsequent applications of crypto. Prior to this incident, the concept of crypto existed purely in theory, lacking any proof of its capacity to facilitate real-world purchases. Nevertheless, Hanyecz’s decision to exchange 10,000 Bitcoins for two pizzas provided concrete evidence of crypto’s potential as a medium of trade.”\n\nWazirX Vice President Rajagopal Menon said, “Bitcoin Pizza Day commemorates the momentous purchase of two pizzas for 10,000 Bitcoin. This single transaction transformed Bitcoin from 'magic Internet money' to something that has value. It is a yearly reminder of the transformative power and unforeseen implications of blockchain technology.”\n\nSathvik Vishwanath, Co-Founder & CEO, Unocoin, said, \"It is important to note that the real significance lies in the recognition of this transaction as the first real-world use case for Bitcoin, demonstrating its potential as a decentralized digital currency. Bitcoin Pizza Day serves as a reminder of the rapid growth and adoption of cryptocurrencies, highlighting the journey from a seemingly trivial transaction to a global phenomenon. It symbolizes the early believers and pioneers who played a key role in establishing Bitcoin as a viable alternative to traditional financial systems.\"\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3RldGhlci11c2R0LWludGVncmF0ZWQtc3RyaWtlLWJpdGNvaW4v0gFLaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vdGV0aGVyLXVzZHQtaW50ZWdyYXRlZC1zdHJpa2UtYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Tether (USDT) Integrated By Bitcoin Lightning Payment Processor Strike - Ethereum World News",
        "content": "Summary:\n\nDigital payments processor Strike will integrate USDT, crypto’s largest stablecoin issued by Tether.\n\nCTO Paolo Ardoino said the collaboration will catapult digital currency adoption by “overcoming liquidity challenges that have previously hindered adoption.”\n\nStrike’s integration was announced shortly after the USDT issuer said it was buying Bitcoin with realized profits.\n\nThe stablecoin company had $1.5 billion in BTC reserves at the end of Q1 2023 and said it will allocate 15% of net realized profits toward strengthening its Bitcoin holdings.\n\nStrike, a digital payment processor built atop the Bitcoin Lightning Network, will integrate crypto’s largest stablecoin by market cap issued by payment provider Tether – USDT.\n\nAccording to the announcement blog post, the collaboration will address liquidity concerns stifling payments markets and motivate broader adoption of digital currencies, particularly stablecoins. CTO Paolo Ardoino added that the integration will ensure greater financial inclusion as Strike recently expanded to 65 additional countries.\n\nThe Strike mobile payments app was only available in a handful of countries like the U.S. and El Salvador.\n\nBy combining the stability and utility of Tether’s digital currency with Strike’s innovative payment solutions, users will experience a new era of secure and efficient transactions. This collaboration signifies a significant leap toward mainstream adoption of cryptocurrencies, as it addresses several key challenges faced by the industry.\n\nTether’s Bitcoin Bag\n\nThe Strike integration comes on the back of the company’s Bitcoin accumulation strategy for its stablecoin reserves. At the end of Q1 2023 in March, Tether’s quarterly attestation revealed that the company held a massive $1.5 billion worth of Bitcoin, along with other assets like Gold and short-term treasury bills.\n\nIn addition, Tether said it would start buying more Bitcoin starting in May. The company will allocate 15% of net realized operating profits toward strengthening its BTC reserve. The extra Bitcoin will serve as an extra cushion to USDT’s reserves that the payments company claims are 100% backed."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9ob3ctY3VycmVudC1iaXRjb2luLXJhbGx5LWNvbXBhcmUtd2l0aC1oaXN0b3JpY2FsL9IBW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9ob3ctY3VycmVudC1iaXRjb2luLXJhbGx5LWNvbXBhcmUtd2l0aC1oaXN0b3JpY2FsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "How Does Current Bitcoin Rally Compare With Historical Ones? - NewsBTC",
        "content": "Here’s how the current Bitcoin rally stacks up against the previous ones in terms of the drawdowns it has experienced so far.\n\nThe Current Bitcoin Rally Has Seen A Peak Drawdown Of -18.6% So Far\n\nIn a recent tweet, the on-chain analytics firm Glassnode compared the latest Bitcoin rally with the ones seen throughout the entire history of the cryptocurrency.\n\nGenerally, rallies are compared using metrics like the percentage price uplifts recorded during them or the amount of time that they lasted (which may be measured in terms of the blocks produced, as is done when looking at cycles in terms of halvings). Here, however, Glassnode has taken a different approach that provides a new perspective on these rallies.\n\nThe comparison basis between the price surges here is the drawdowns that each of them experienced across their spans. Note that these drawdowns aren’t to be confused with the cyclical drawdowns that are used to measure how the price has declined since the bull run top.\n\nThe drawdowns in question are the obstacles that the cryptocurrency encountered while the rallies were still ongoing, and are hence, those that the coin eventually managed to overcome.\n\nHere is a chart that shows the degree of drawdowns that each of the historical bull markets experienced, and also where the current rally stands in comparison to them:\n\nLooks like the value of the metric hasn't been too high for the latest rally so far | Source: Glassnode on Twitter\n\nThe five bull rallies here are as follows: genesis to 2011 (the very first rally), 2011-2013, 2015-2017, 2018-2021 (the last rally), and 2022 cycle+ (the ongoing one).\n\nThe analytics firm here has taken the bottom of each of the bear markets as the start of the next bull rallies. This means that parts of the cycle that some may not consider as part of the proper bull run are also included.\n\nThe main example of this would be the April 2019 rally, which is often considered its own thing but is clubbed with the last Bitcoin bull market in the above chart.\n\nFrom the graph, it’s visible that the deepest drawdown that occurred during the first bull market measured around -49.4%. The next run, the 2011 to 2013 bull, experienced an even larger obstacle of a -71.2% plunge midway through it.\n\nThe next one (2015-2017) then only saw a drawdown of -36%, but the drawdown was again up at -62.6% for the run that followed it (that is, the latest bull market).\n\nSo far in the 2022+ Bitcoin bull market (which would only be considered a bull market at all if the November 2022 low was truly the cyclical bottom), the deepest drawdown observed so far is the March 2023 plunge of -18.6%.\n\nClearly, the drawdown seen in the current rally so far is significantly lesser than what the historical bull markets face. If the pattern of the past runs holds any weight at all, then this would mean that the current bull market should still have more potential to grow.\n\nBTC Price\n\nAt the time of writing, Bitcoin is trading around $26,900, down 2% in the last week.\n\nBTC has been moving sideways recently | Source: BTCUSD on TradingView\n\nFeatured image from iStock.com, charts from TradingView.com, Glassnode.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnNsdXJycC5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS1mYW5zLWRvLXlvdS1rbm93LWFib3V0LWJpdGNvaW4tcGl6emEtZGF5LTE2ODQ3MzQ3NTE4OTnSAWhodHRwczovL3d3dy5zbHVycnAuY29tL2FtcC9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5LWZhbnMtZG8teW91LWtub3ctYWJvdXQtYml0Y29pbi1waXp6YS1kYXktMTY4NDczNDc1MTg5OQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Fans, Do You Know About Bitcoin Pizza Day? - Slurrp",
        "content": "Over the past decade, Bitcoin has captured the imagination of millions around the globe and has become a familiar part of our everyday lives. From its humble beginnings as a revolutionary concept, Bitcoin has soared to incredible heights, transforming the way we think about money, technology, and the future but the say that it made the shift from concept to reality all comes down to one famous food. Pizza."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL25ld3MvdXMtd29tYW4tZmluZHMtaGlkZGVuLTUwMDAwMC1kb2xsYXItYml0Y29pbi1kdXJpbmctZGl2b3JjZS02MDMzNzIuaHRtbNIBcGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL2FtcC93b3J0aC9uZXdzL3VzLXdvbWFuLWZpbmRzLWhpZGRlbi01MDAwMDAtZG9sbGFyLWJpdGNvaW4tZHVyaW5nLWRpdm9yY2UtNjAzMzcyLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "US Woman Discovers Husband's $500,000 Hidden Bitcoin Investment During Divorce Proceedings - Indiatimes.com",
        "content": "Just a few months into her divorce proceedings, a US woman thought it was suspicious that her spouse, who earned $3 million annually, didn’t have many assets.\n\nAfter spending half a year on discovery and enlisting the help of a forensic accountant, the housewife eventually tracked down 12 bitcoins — then worth half a million dollars ($500,000) — in a previously undisclosed crypto wallet of her husband's.\n\n\n\nUS Women Finds Out About Husband's Hidden Bitcoins\n\ngoldmanlaw303\n\nSarita (name changed to maintain anonymity), who was married for a decade, said she felt blindsided by her husband’s cryptocurrency investment, as per CNBC.\n\n\n\n“I know of bitcoin and things like that. I just didn’t know much about it,” she said. “It was never even a thought in my mind, because it’s not like we were discussing it or making investments together. ... It was definitely a shock.”\n\nThe world of financial infidelity has become increasingly sophisticated, as investors “hop” coins across blockchains and sink their cash into metaverse properties. An NBC News poll found that 1 in 5 Americans have invested in, traded or used cryptocurrency, with men between the ages of 18 and 49 accounting for the highest share of all demographic groups.\n\nMost divorce attorneys from Florida, New York, Texas and California, blockchain forensic investigators, financial advisors, as well as spouses who were either hunting down virtual coins or the crypto holders themselves, agree that the law can’t keep up with all the new ways that people earn and safeguard digital assets that largely exist outside the reach of centralized intermediaries such as banks.\n\nAlso Read: US Man Pays 10,000 Bitcoins For Pizza\n\nAnother Divorcing Couple Fought Over Crypto\n\nshutterstock\n\nLast year, news came out regarding a wealthy San Francisco couple fighting not just for children, profits from the sale of the husband’s software company and their $3.6 million home, but also for cryptocurrency.\n\n\n\nErica and Francis deSouza's most fierce court battle concerned a bitter dispute over millions of dollars in missing Bitcoin. The husband had bought a little over 1,000 Bitcoins before he separated from his wife in 2013 and then lost nearly half the funds when a prominent cryptocurrency exchange collapsed, as per a New York Times report. After three years of litigation, a San Francisco appeals court ruled in 2020 that Mr. deSouza had failed to properly disclose some elements of his cryptocurrency investments, which had exploded in value. The court ordered him to give Ms. deSouza more than $6 million of his remaining Bitcoin.\n\nIn recent years, divorces, especially in the US, are turning ugly due to crypto's involvement. But it is the difficulty in tracking and valuing cryptocurrency that is creating new headaches in the legal world.\n\nAlso Read: 'Bam Bam Bitcoin Beach' In Portugal\n\nFor the latest and more interesting financial news, keep reading Indiatimes Worth. Click here."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXNocmltcC1hY2N1bXVsYXRpb24tc3VyZ2Uv0gFLaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9iaXRjb2luL2JpdGNvaW4tc2hyaW1wLWFjY3VtdWxhdGlvbi1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Bitcoin ‘Shrimp’ Catch Soars To All-Time High Of 1.31 Million Coins – Details - NewsBTC",
        "content": "Bitcoin (BTC) shrimp investors, affectionately dubbed the “underdogs” of the cryptocurrency world, are making waves in the market as they steadily accumulate the digital asset at an unprecedented rate.\n\nThese smaller investors, often overlooked in favor of institutional giants, have recently reached a significant milestone, with the total supply of Bitcoin held by them surging to an all-time high of 1.31 million coins.\n\nThis surge not only highlights the growing influence of retail investors in the volatile world of cryptocurrencies but also underscores their determination to ride the Bitcoin wave alongside their more affluent counterparts.\n\nThe Rise Of Bitcoin Shrimp Investors\n\nAccording to data analytics firm Glassnode, these shrimp investors have surged to an all-time high (ATH) of 1.31 million coins. The continuous rise in their holdings highlights their growing influence and raises intriguing questions about the evolving dynamics within the Bitcoin ecosystem.\n\nThe #Bitcoin supply held by Shrimp Entities (<1 BTC) continues to relentlessly rise, expanding to an ATH of 1.31M coins. The cohort is currently experiencing a significant expansion of +26K coins per month, with only 202 (3.9%) trading days recording a larger monthly growth. pic.twitter.com/Fa2QCHxZPO — glassnode (@glassnode) May 18, 2023\n\nThe data further reveals that shrimp investors are adding an average of approximately 26,000 Bitcoins to their cumulative holdings each month. This significant expansion is worth noting, considering that only 3.9% of trading days, equivalent to 202 days, have witnessed a larger monthly growth rate.\n\nThese statistics underline the sustained interest in Bitcoin among retail investors, who remain undeterred by its well-known price volatility.\n\nThe Shrimp Investor Effect On BTC Price Dynamics\n\nBitcoin’s price, as reported by CoinGecko, currently stands at $26,914, reflecting a slight 1.1% decline over the past 24 hours, while the cryptocurrency was up 1.4% over the last seven days.\n\nSource: Coingecko\n\nThe surge in shrimp investors, indicated by their increasing accumulation of Bitcoin, can have multiple impacts on the current price of BTC.\n\nThe sustained interest and continuous buying pressure from shrimp investors can contribute to upward price momentum. As more retail investors enter the market and acquire Bitcoin, the increased demand can drive the price higher.\n\nThis influx of buyers, particularly if they are accumulating the cryptocurrency at an unprecedented rate, as mentioned earlier, can create a bullish sentiment that attracts further investors and potentially leads to price appreciation.\n\nBTCUSD backpedals to the $26K level. Chart: TradingView.com\n\nConversely, the impact of shrimp investors on the price of BTC can be influenced by market dynamics and investor sentiment. While their accumulation may indicate growing interest, the overall sentiment in the market, including the actions of larger institutional investors or regulatory developments, can also influence the price.\n\nIf negative news or a general bearish sentiment prevails, it can offset the impact of shrimp investors and result in a more stagnant or declining price.\n\n-Featured image from DELAYNA EARLEY / THE ISLAND PACKET VIA AP\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2lzLXRoZS1ldGhlcmV1bS1uZXR3b3JrLXRvby1zbG93LWZvci1pdC10by1zdXJwYXNzLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Is the Ethereum Network Too Slow for it to Surpass Bitcoin? - Analytics Insight",
        "content": "In the world of cryptocurrencies, Ethereum and Bitcoin stand out as the two biggest players and rightly so. With Bitcoin establishing itself as the main player for many in the cryptocurrency space, some commentators are giving their full backing to Ethereum to take the Bitcoin crown as Ethereum, with its smart contract capabilities and expansive ecosystem, has gained significant traction. However, concerns have been raised about scalability and transaction speed, raising the question of whether the Ethereum network is too slow to surpass Bitcoin and reach that top spot. With major developments on the horizon for the Ethereum network the signs are positive for the future, but will they make the difference that is needed? In this article we look at some of the facts in the Ethereum vs Bitcoin debate and let you make up your own mind.\n\nIs the Ethereum Network Really Slow?\n\nOne of the biggest pointers against Ethereum’s speed is its ability to handle large amounts of traffic on the network. As Ethereum gained popularity at the same time as all of the crypto space did, its network became increasingly clogged. And without the right infrastructure in place, this led to higher transaction fees and longer confirmation times slowing down processes for users. During peak periods, such as when popular applications are hammered by heavy usage or during token launches or sales, network congestion can significantly impact transaction speed. This can happen with new token sales or when a certain coin or token experiences a surge in price – either up or down. Users can keep an eye on coin prices like the Loopring Price to understand these movements and also keep an eye on gas fees and all the latest news in the crypto space to make an educated decision on how to invest or which network to use.\n\nSome lay the blame for the drag on speed at the feet of Ethereum’s current consensus mechanism, otherwise called the Proof of Work, which requires substantial computational resources, leading to slower block validation times. If we look at Bitcoin in comparison, Bitcoin’s Proof of Work algorithm is optimized for security and has a longer average block time, making it less prone to network congestion during high transaction periods. Gas fees can be high and unpredictable, which is a significant issue for Ethereum users. Network congestion can also slow down the network and increase gas fees.\n\nThe good news however is that Ethereum is actively working on ways to improve scalability. The biggest development is clearly the introduction of Ethereum 2.0 and Layer 2 solutions like the Lightning Network. Additionally, Ethereum switched from Proof of Work to Proof of Stake, which, due to the practicalities of the practice, takes far less energy from technology or man. Warehouses full of servers were retired and as a result, the Ethereum coin is gaining speed.\n\nThese developments are still in progress though and until these solutions are fully implemented, Ethereum’s transaction speed may continue to be dragged down. Ethereum 2.0 is being released in phases and while there are still some questions on the effectiveness of the upgrade, many point to this watershed moment as the reason for Ethereum’s potential to surpass Bitcoin. The Ethereum 2.0 upgrade will change the consensus mechanism for Ethereum from a Proof-of-Work to a Proof-of-Stake consensus mechanism with the goal of reducing the amount of computational resources. Shard chains are one of the biggest changes to the 2.0 upgrade that will hopefully have the biggest impact on the network overall.\n\nEthereum’s Growing Ecosystem Drives Innovation\n\nOne of Ethereum’s main strengths is its fantastic ecosystem of applications and smart contracts. This highly developed ecosystem attracts developers and users, fostering innovation and driving adoption. As Ethereum continues to evolve, the demand for its network may increase, spurring the development of scalability solutions and potentially enhancing transaction speeds. With such an active development initiative, the Ethereum community has a vibrant and active developer base constantly working towards improving the network’s performance in the race to beat Bitcoin. This community of developers are dedicated to optimizing the Ethereum blockchain, creating layer 2 solutions, and exploring innovative scaling techniques. Their ongoing efforts indicate a commitment to overcoming the network’s current limitations and enhancing transaction speed.\n\nFlexible for The Future\n\nAlthough there are issues, the good news is that Ethereum’s design allows for easier upgrades compared to Bitcoin. This flexibility for future development provides the potential to bring on new ways of working and as the network evolves, upgrades can be implemented, which of course have the potential to improve Ethereum’s transaction speed. Align this to the dedication and passion of the development community to improve the Ethereum network and the signs are good for the future. Ethereum 2.0, when it arrives, will usher in a brave new world for crypto and blockchain networks, but will it be enough to let Ethereum take over Bitcoin? That remains to be seen but as the popularity of cryptocurrencies continues to grow it will be important for Ethereum to work on its current issues if it is to stand any chance of success.\n\nIn the world of cryptocurrencies, Ethereum and Bitcoin stand out as the two biggest players and rightly so. With Bitcoin establishing itself as the main player for many in the cryptocurrency space, some commentators are giving their full backing to Ethereum to take the Bitcoin crown as Ethereum, with its smart contract capabilities and expansive ecosystem, has gained significant traction. However, concerns have been raised about scalability and transaction speed, raising the question of whether the Ethereum network is too slow to surpass Bitcoin and reach that top spot. With major developments on the horizon for the Ethereum network the signs are positive for the future, but will they make the difference that is needed? In this article we look at some of the facts in the Ethereum vs Bitcoin debate and let you make up your own mind.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMizQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLW1heS0yMS1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjAzNzA40gHRAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtbWF5LTIxLWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MDM3MDgvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoins Remains Above $27,000 Mark As Pepe Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $27,000 and $18,00 marks, respectively, on early Sunday morning. Other popular altcoins — including the likes of Ripple (XRP), Solana (SOL) — landed in the positive as overall prices saw minor gains across the board. Pepe (PEPE) emerged to be the biggest gainer, seeing a 24-hour jump of over 12.66 percent. SingularityNET (AGIX), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.13 trillion, registering a 24-hour gain of 0.69 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $27,176.34 seeing a 24-hour gain of 1.14 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.48 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,817.11, marking a 24-hour gain of 0.23 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.56 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 0.49 percent as per CoinMarketCap data, currently priced at $0.07376. As per WazirX, Dogecoin price in India stood at Rs 6.4395.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 0.90 percent. At the time of writing, it was trading at $92.18. LTC price in India stood at Rs 7,910.06.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4688, seeing a 24-hour gain of 1.00 percent. As per WazirX, Ripple price stood at Rs 40.4000.\n\nSolana (SOL) price today\n\nSolana price stood at $20.27, marking a 24-hour gain of 0.05 percent. As per WazirX, SOL price in India stood at Rs 1,799.97.\n\nTop crypto gainers today (May 21)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nPepe (PEPE)\n\nPrice: $0.0…01699\n\n24-hour gain: 12.66 percent\n\nKava (KAVA)\n\nPrice: $1.05\n\n24-hour gain: 5.59 percent\n\nRender Token (RNDR)\n\nPrice: $2.38\n\n24-hour gain: 4.53 percent\n\nBitcoin SV (BSV)\n\nPrice: $34.86\n\n24-hour gain: 3.27 percent\n\nCasper (CSPR)\n\nPrice: $0.04963\n\n24-hour gain: 2.56 percent\n\nTop crypto losers today (May 21)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nSingularityNET (AGIX)\n\nPrice: $0.2865\n\n24-hour loss: 7.27 percent\n\nTheta Network (THETA)\n\nPrice: $0.8819\n\n24-hour loss: 2.53 percent\n\nIOTA (MIOTA)\n\nPrice: $0.1773\n\n24-hour loss: 2.28 percent\n\nInternet Computer (ICP)\n\nPrice: $5.19\n\n24-hour loss: 1.05 percent\n\nSynthetix (SNX)\n\nPrice: $2.38\n\n24-hour loss: 1.04 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdGVjaGNhYmFsLmNvbS8yMDIzLzA1LzIyL2JpdGNvaW4tcGl6emEtZGF5LTEwLWNvbW11bml0aWVzLWtlZXBpbmctdGhlLWJpdGNvaW5zLXNwaXJpdC1hbGl2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "What is Bitcoin Pizza Day? - TechCabal",
        "content": "Today, May 22nd is Bitcoin Pizza Day. All over the world, enthusiasts and supporters of cryptocurrency Bitcoin are organising events, meetups, and sharing stories and memes to commemorate the first documented real-world transaction using Bitcoin.\n\nOn May 22, 2010, Laszlo Hanyecz, a programmer from Florida, made history by successfully completing a transaction in which he purchased two Papa John’s pizzas for 10,000 BTC.\n\nHe reportedly posted a message on the Bitcointalk forum, a popular online Bitcoin community, offering 10,000 bitcoins in exchange for someone ordering him two pizzas. Eventually, another forum user named “Jercos” took him up on the offer and ordered the pizzas from Papa John’s in exchange for the bitcoins. The transaction was completed, and Laszlo received his pizzas, making it the first documented real-world purchase using Bitcoin.\n\nHanyecz’s message on Bitcointalk\n\nAt the time, Bitcoin was in its early stages, and its value was negligible. In fact, Laszlo described it as “having little value” in his original forum post. However, in hindsight, it is considered one of the most expensive pizza purchases ever made, given the tremendous increase in Bitcoin’s value over the years. Laszlo’s transaction was significant because it demonstrated the use of Bitcoin as a medium of exchange for tangible goods and services.\n\nBitcoin Pizza Day has since become a symbolic event in the global cryptocurrency community. It serves as a reminder of Bitcoin’s humble beginnings, the evolution of cryptocurrencies and their increasing acceptance in the wider financial world.\n\nHere is a list of ten crypto communities in Africa who are keeping the Bitcoin spirit alive:\n\nCrypto Bootcamp Community has 10,000+ community members across the continent, in cities like Capetown, Kampala, Dubai, Accra, Nairobi, Abuja, and Lagos. It provides education on cryptocurrencies, blockchain technology, Web3 with engaging courses and online content.\n\nThe community asserts that its objective is to help people get familiar with blockchain and navigate the industry without any hassle. It also provides marketing, brand promotion and project onboarding services to emerging blockchain and crypto projects. It was founded by Obinna Iwuno in 2020.\n\nWomen in DeFi is a thriving community of DeFi and Blockchain enthusiasts focused on empowering young women in Africa. It provides free education about Blockchain and Crypto to equip women with essential skills and knowledge to take advantage of job opportunities in the field of blockchain technology.\n\nBitcoin Ekasi is a community in South Africa dedicated to establishing a Bitcoin-based economy. It operates as an extension of The Surfer Kids Non-Profit, a non-profit organization focused on empowering children through surfing education. By paying their surfing coaches in Bitcoin and facilitating crypto payments for local vendors, Bitcoin Ekasi introduces cryptocurrency transactions into the town’s economic framework.\n\nAfrican Bitcoiners is a community dedicated to assisting African individuals in their journey with Bitcoin. They aim to educate and onboard new users, ensuring their safe navigation through various stages, from learning about Bitcoin to earning and securely storing their accumulated sats (bitcoin units). The community strongly believes that Bitcoin is a revolutionary form of currency that promotes fairness and equality, presenting an opportunity to address global wealth inequality and create a more balanced financial landscape.\n\nDigiOats is a community that is supporting Africans to learn, adopt, trade, and securely store digital assets like cryptocurrencies. Their primary objective is to bridge the information gap between Africa and the Western world through comprehensive Digital Financial Literacy initiatives. By promoting education and awareness, DigiOats aims to facilitate the widespread adoption of decentralised innovations, including Bitcoin, throughout Africa.\n\nLed by Anita Posch, Bitcoin for Fairness is a non-profit initiative raising knowledge and understanding of Bitcoin for people in emerging countries and for the disadvantaged. They connect and boost the profile of local stakeholders, and identify and work with educators on the ground to expand Bitcoin adoption locally and Bitcoin awareness globally.\n\nWeb3Ladies is a Web3 community in Africa empowering a generation of female industry leaders who will build, nurture, and develop a sustainable Web3 space. Their aim is to foster a community of excellent, passionate, and groundbreaking ladies in the African Web3 space, who can work together, not only to challenge the status quo but also to create impactful open-sourced solutions in the Web3 space.\n\nThis is one of the largest Bitcoin communities in Africa, consisting of Africans from different parts of the continent who believe in the Bitcoin revolution and are building a movement to bolster its adoption. The Africa Bitcoin Organisation is led by human rights activist Farida Nabourema.\n\nBitcoin Dada is a community for the African woman to learn about Bitcoin, while being part of a women-focused community that wants her to succeed. The community was founded to try to resolve three issues in the ecosystem: reduce the knowledge barriers for everyday women to enter the Bitcoin world; make Bitcoin relatable to the masses; lastly, to narrow the gender gap in the space through education, community, and social network platforms.\n\nSince its launch, Bitcoin Dada has successfully trained two cohorts of students, held Bitcoin-only meet-ups in Nairobi, Kenya, helped some students start accepting Bitcoin as a payment option in their businesses, and recommended students to Bitcoin companies for employment.\n\nThis crypto community was initiated in 2022 to give its members access to information and tools necessary to profit from crypto and NFT projects. The discord-based community has since grown to 4,000 members.\n\nShare this article"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLXJlZmxlY3Rpbmctb24tYS1kZWNhZGUtb2YtYml0Y29pbi1mcm9tLTEwMDAwLWJpdGNvaW5zLWZvci1hLXBpenphLXRvLWEtMS10cmlsbGlvbi1tYXJrZXQtY2FwaXRhbGl6YXRpb24tMzA5NTU2NS_SAaoBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvYmxvY2tjaGFpbi1yZWZsZWN0aW5nLW9uLWEtZGVjYWRlLW9mLWJpdGNvaW4tZnJvbS0xMDAwMC1iaXRjb2lucy1mb3ItYS1waXp6YS10by1hLTEtdHJpbGxpb24tbWFya2V0LWNhcGl0YWxpemF0aW9uLTMwOTU1NjUvbGl0ZS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "Reflecting on a decade of Bitcoin: From 10,000 Bitcoins for a pizza to a $1 trillion market capitalization￼ - The Financial Express",
        "content": "By Parth Chaturvedi\n\nOn May 22, 2010, a programmer named Laszlo Hanyecz made history by purchasing two pizzas for 10,000 bitcoins. At the time, Bitcoin was worth just a fraction of a cent, and few people had even heard of it. Today, Bitcoin is the most valuable and widely recognised crypto asset in the world and had hit a peak market capitalization of over $1 trillion, during the last bull run. The value of 10,000 BTC today is approx ~$270mm!\n\nSo, while Laszlo Hanyecz’s decision to trade 10,000 bitcoins for two pizzas may seem foolish in hindsight, at the time, it was a bold and visionary move that helped demonstrate the potential of Bitcoin as a medium of exchange and was the first recorded purchase of goods via a crypto asset. The story of Bitcoin Pizza Day is a reminder of the early days of crypto when enthusiasts were experimenting with a new and untested technology.\n\nToday, Bitcoin Pizza Day has become an annual celebration of the crypto revolution and the incredible journey that this asset class has taken over the past decade. BTC is now accepted by merchants around the world, used as a store of value by investors, and even recognized as legal tender in some countries.\n\nThe growth of crypto has been driven by a combination of technological innovation, financial speculation, and a growing recognition of the flaws and limitations of traditional financial systems. The recent banking crisis, “Debt ceiling” debate and Trillions in money printing have further made BTC’s “hard money” and “fixed supply schedule” narrative more appealing to the holders of “Digital Gold”!\n\nBut what does the future hold for this rapidly evolving asset?\n\nOne key trend in the future of BTC as an asset class is its increasing recognition and adoption by mainstream institutions. Major corporations such as Tesla, MicroStrategy and most recently PayPal have significant investment holdings in Bitcoin, and a growing number of traditional financial giants like Fidelity and BNY Melon are exploring ways to incorporate BTC into their products and services. This increased acceptance and integration by mainstream institutions could help drive greater stability and acceptance of Bitcoin in the broader economy.\n\nAnother important trend in the future of Bitcoin is the development of new and innovative use cases beyond simple transactions and store of value. Post the Taproot upgrade, there has been an explosion of innovation using the underlying Bitcoin Network. The most recent and impactful development has been Ordinals, which are being used to create unique inscriptions on the Bitcoin Network and can store metadata such as artwork or collectibles.\n\nAs we look towards the future of Bitcoin and the broader crypto ecosystem, it is important to continue investing in innovation, collaboration, and responsible regulation. This will require the participation and cooperation of a diverse set of stakeholders, including government regulators, industry leaders, and everyday users. By working together to address the challenges and opportunities of crypto, we can create a more inclusive, transparent, and secure financial system for all.So, let’s raise a slice of pizza to Bitcoin, its incredible potential, and the exciting future ahead!\n\nThe author is Investments Lead, CoinSwitch Ventures\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm94Zm9yZG1haWwuY28udWsvbmV3cy8yMzUzODMxNS5hc2hsZXktbGlsZXMtbGV0Y2h3b3J0aC1tYW4tZ3VpbHR5LW94Zm9yZC1iaW9tZWRpY2EtYmxhY2ttYWlsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Ashley Liles: Letchworth man guilty of Oxford BioMedica 'blackmail' - Oxford Mail",
        "content": "Ashley Liles, of Fleetwood, Hertfordshire, has been charged with unauthorised computer access with intent to commit an offence and blackmail.\n\nThe 28-year-old gained access to an unauthorised computer between February 28, 2018, and March 13, 2018.\n\nREAD MORE: Bicester Village evacuated after shop fire\n\nHe is accused of using this computer to blackmail Oxford BioMedica after making an ‘unwarranted demand’ for £300,000 in Bitcoin, which is a virtual currency.\n\nLiles also pleaded guilty to the unauthorised modification of computer material between February 16, 2018, and March 13, 2018.\n\nHe originally denied the charges and was due to stand trial at Reading Crown Court last week (May 17).\n\nHowever, the trial has since cracked after Liles pleaded guilty to both counts.\n\nThe case has now been adjourned for sentencing at the same court on July 11.\n\nSouth East Regional Organised Crime Unit, which investigated the case, said Liles was a security analyst at Oxford Biomedica when the firm was hacked in February 2018.\n\n⚖️ CONVICTED\n\n\n\nA man has been convicted of blackmail and other offences after using his role to try to get the Oxford-based company he worked for to pay a ransom to him following a cyber incident.\n\n\n\nHe will be sentenced on 11 July.\n\n\n\nRead more - https://t.co/AUsUBKBCRW pic.twitter.com/iFe6YB58im — SEROCU (@SouthEastROCU) May 22, 2023\n\nHe was part of the team that began investigating the attack. But, unknown to anyone else, he began his own attack on the company that saw him alter the original blackmail email in order to change the payment address provided by the attacker.\n\nREAD MORE: Outrage at being 'told to foot sewage bill'\n\nHe did it in the hope that payment - if it were made - would be made to him rather than the original hacker, police said.\n\nLiles created a new email address that was nearly identical to the original hackers, and started emailing his employer - putting them under pressure to pay the cash.\n\nNo payment was made and detectives were able to identify Liles from searches he had made on the company's computer system. His home was searched, his computer and other digital devices seized, and data recovered from them.\n\nDI Rob Bryant of the South East Regional Organised Crime Unit's cyber crime team said: “I would like to thank the company and their employees for their support and cooperation during this investigation.\n\n\"I hope this sends a clear message to anyone considering committing this type of crime. We have a team of cyber experts who will always carry out a thorough investigation to catch those responsible and ensure they are brought to justice.”\n\nThe police said that firms who believed they had been the victim of cyber crime should contact Action Fraud immediately."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2dvbGQtYml0Y29pbi1ldGhlcmV1bS13aGljaC1vbmUtaXMtdG8td2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 May 2023 07:00:00 GMT",
        "title": "Gold / Bitcoin / Ethereum – Which One is to Win? - Analytics Insight",
        "content": "In the past, major precious metals have been viewed by investors as safe-haven assets during the development of financial crises. However, the rise of digital financial technology has given rise to a new type of digital gold: Bitcoin. This was highlighted by a recent analytical review by Bitcoinist experts who compared the dynamics of gold, Bitcoin and Ethereum.\n\nWhile gold prices are up 9 percent this year, bitcoin is up more than 70 percent, according to the analysis. Despite the U.S. banking crisis, Bitcoin has continued to gain momentum, rising 30% in the past week alone, from $19,000 to $28,500.\n\nEthereum, on the other hand, has lagged behind, with prices up just 13% over the past seven days.\n\nExperts from Bitcoinist point out that more and more investors are considering investing in the cryptocurrency space these days.\n\nBitcoin’s rise as digital gold is due to its scarcity, decentralization, and security. These factors, along with a growing number of institutional investors, have contributed to the incredible growth in the value of cryptocurrencies.\n\nWhile cryptocurrencies and their mining are certainly risky, the potential rewards are enormous. With the right knowledge and resources, it is possible to generate substantial profits and benefit from the growth of the cryptocurrency market.\n\nIf you want to try Bitcoin mining – it would be wise to focus on accumulating affordable mining hashrate before the price starts to rise. You can now choose your bitcoin mining contract in Idmining.\n\nIt will be interesting to see how the dynamics of gold, bitcoin and other cryptocurrencies evolve over time as the world continues to embrace digital financial technologies. Invest in Bitcoin while it is still cheap to get into Bitcoin mining and avoid future regrets for missed opportunities.\n\nWhat are the main advantages of investing in cloud mining contracts:\n\nWhen investing in BTC, you need to understand fundamental analysis to know when is the best time to buy or sell cryptocurrency. Cloud mining all but eliminates this need for investors. When buying a cloud contract, the revenue becomes passive: the company takes over the maintenance, repair and tuning of the mining machine, while the client simply withdraws the profit; Miners can hedge risk by selling BTC during growth and buying new contracts when the price drops (and becomes cheaper), or simply store the cryptocurrency in a secure wallet until growth resumes; Also, under the current blockchain hash rate conditions, when you buy a mining contract, it turns out that the BTC price will be lower than the price you buy on a crypto exchange. If you invest $2,000, you can only buy 0.13 BTC for this amount. But you can mine twice that amount – 0.3 BTC for the same amount of money.\n\nTherefore, investing in cloud mining is more flexible, profitable and secure, especially in the long-term.\n\nA legitimate cloud mining business was established in the UK in 2016 under the name IDMining. Like any legitimate hash provider, IDMining has commercial properties with a sizable tech park of specialized Bitcoin mining equipment.Brazil & Windhoek & Kazakhstan all have data center locations. Nowadays, IDMining pays out cryptocurrencies to more than 4,90K users from around the world.\n\nFeatures:\n\nSign up to get $5 immediately.\n\nAutomated daily payouts.\n\nNo overhead or electricity fees.\n\nAn affiliate program with 3% lifetime rewards.\n\nDifferent Crypto contracts to choose from.\n\nDDos and SSL protect the system.\n\n24-hour online support.\n\nNew Crypto Mining Plans\n\nContract Price Contract Terms Fixed Return $100 1 Day $100+$2 $300 3 Days $300+$20.7 $800 7 Days $800+$140 $1300 15 Days $1300+$546 $8200 40 Days $8200+$10496 $15800 60 Days $15800+$29388\n\nFor more IDMining details, please visit https://idmining.com/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMjEvMTN0aC1hbm5pdmVyc2FyeS1iaXRjb2luLXBpenphLWRheS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 May 2023 07:00:00 GMT",
        "title": "The 13th anniversary of Bitcoin Pizza Day - The Cryptonomist",
        "content": "May 22, 2023 will be the 13th anniversary of “Bitcoin Pizza Day,” the event that saw the first documented BTC transaction for a real product.\n\nHere are this year’s events.\n\nBitcoin Pizza Day: what is it and what is being celebrated?\n\nIt was 22 May 2010, when Laszlo Hanyecz, a programmer, made history by buying two Papa John’s pizzas for 10,000 BTC. At the time, the value was about $41.\n\nHanyecz’s intent was to demonstrate Bitcoin’s potential also as a currency for everyday transactions, a theory he created for himself as an early adopter of BTC.\n\nAnd so, Hanyecz posted an offer on a Bitcoin Talk forum, where he promised 10,000 BTC to anyone willing to buy him a couple of pizzas. It was not long before a forum user accepted the offer and ordered the pizzas for him.\n\nAs time went on, and as the price of BTC rose thanks to increased demand from users, the Bitcoin Pizza Day event became so symbolic for the entire crypto community that it is celebrated with dedicated events every year.\n\nNot only that, in addition to dedicated events, is also a day to meditate on the incredible value those two pizzas have achieved over time. For example, if we consider BTC at $27,000, now those two pizzas would be worth as much as $270 million.\n\nBitcoin Pizza Day: crypto-exchange events for this 13th anniversary\n\nAmong the biggest supporters of Bitcoin Pizza Day, you can’t miss the number one crypto-exchange in terms of popularity, Binance, which again this year is raffling off lots of prizes.\n\nTo celebrate #Bitcoin Pizza Day, we're kicking off a series of #BinancePizza events worldwide!\n\n\n\nHere’s some of what you can look forward to:\n\n🔸 Pizza\n\n🔸 Giveaways\n\n🔸 #Binance merch\n\n🔸 And much more!\n\n\n\nBut which countries are we heading to? Find out here 👇 pic.twitter.com/RoZlNhYYaY — Binance (@binance) May 15, 2023\n\nThe derivatives and copy trading crypto-exchange, Bitget, has also joined the initiative:\n\n🍕 #Bitcoin Pizza Day Treat!\n\n\n\nJoin and claim up to 1,000 $USDT airdrop package!\n\n\n\n⏰ May 16, 16:00 – May 22, 16:00 (UTC+8)\n\n\n\n👉 Click the link to know more and join now: https://t.co/JPfklUcSe9 pic.twitter.com/TxnMYBZInl — Bitget (@bitgetglobal) May 16, 2023\n\nBasically, these are many campaigns dedicated to new and “old” Bitget users, who will be able to claim their prizes in Tether (USDT) by simply following the actions to be taken.\n\nBitcoin Pizza Day 2023: Bitrefill wants to sponsor local meetups\n\nRenowned crypto gift card provider Bitrefill is also celebrating Bitcoin Pizza Day by offering to become a sponsor of local Bitcoin meetups.\n\nWe’re looking to sponsor local Bitcoin meetups for Bitcoin Pizza Day.\n\n\n\nTell us in the comments why your meetup deserves free Pizza! 🍕\n\n\n\nWinners will be announced in 5 days. 🎉 pic.twitter.com/zPYTflvxBR — Bitrefill (@bitrefill) May 11, 2023\n\nBitrefill will give the winners a free pizza and become a sponsor of their proposed meetups.\n\nReturning to cryptocurrency trading platforms, some have published their own events dedicated to Bitcoin Pizza Day to also offer prizes in BTC to their participating users. Gate.io has offered 1 BTC as a prize.\n\n“Don’t miss out! Join the #Bitcoin Pizza Day celebration with $1BTC. Submit your entry now to win!”\n\nLaszlo and paying for pizzas in Lightning Network\n\nThree years ago, the programmer who became famous for Bitcoin Pizza Day wanted to strike again by buying more pizzas in BTC, but using the Lightning Network (LN). At that time, Hanyecz paid 649,000 satoshi, or 0.00649 BTC.\n\nDespite his first big “loss” by buying the first two pizzas with 10,000 BTC, Laszlo wanted to demonstrate once again what could be the only solution to scale the Bitcoin blockchain, namely the Lightning Network.\n\nAt the time of writing, 0.00649 BTC is equivalent to $157, a far cry from the $270 million equivalent of the first pizzas."
    }
]