[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vcm1pLm9yZy9jcnlwdG9jdXJyZW5jeXMtZW5lcmd5LWNvbnN1bXB0aW9uLXByb2JsZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Cryptocurrency’s Energy Consumption Problem - Rocky Mountain Institute",
        "content": "Shares\n\nCryptocurrency’s Energy Consumption Problem\n\nWhat has been done and what still needs to be done to decarbonize crypto.\n\nCryptocurrency has an energy consumption problem. Bitcoin alone is estimated to consume 127 terawatt-hours (TWh) a year — more than many countries, including Norway. In the United States, cryptocurrency activity is estimated to emit from 25 to 50 million tons of CO 2 each year, on par with the annual emissions from diesel fuel used by US railroads.\n\nDecarbonizing the crypto industry thus remains essential to achieving a safe climate future. Yet, while RMI is proud to have played a role in initial decarbonization efforts in the crypto industry, moving forward, we will focus on decarbonizing the grid rather than crypto transactions.\n\nIn this article, we reflect on the state of the crypto industry: what work has been done so far, the challenges of decarbonizing crypto, and how RMI will continue to pursue this goal as part of our larger effort to decarbonize global supply chains.\n\nProgress to Date\n\nAs exorbitant electricity consumption from crypto mining became a public concern, RMI’s first step was to act as a co-convener of the Crypto Climate Accord (CCA), along with our partners Energy Web, the Alliance for Innovative Regulation (AIR), and the World Economic Forum. The CCA serves as a “private sector-led initiative focused on decarbonizing the cryptocurrency and blockchain industry,” where solutions and technologies for crypto decarbonization are created collaboratively among players across the web3 and crypto space.\n\nAs part of the CCA, RMI spearheaded the development of the CCA Accounting Guidance, a foundational guide to allocating emissions for the crypto industry. The guidance highlights the importance of a consequential accounting approach and the use of marginal emissions rates as a key to understanding crypto’s emissions impact. The guidance further supports the need to gauge grid impact rather than average emissions when assessing emissions impact.\n\nThis initial work was followed by participating in a roundtable during the drafting of the Crypto Climate Impact Accounting Framework, developed by the Crypto Carbon Ratings Institute (CCRI) and South Pole. This framework sought to define a methodology for allocating GHG emissions for crypto transactions and holdings. Because institutional investors hold an outsized stake of the crypto market, allocating emissions for these activities is vital to pressure both investors and crypto industry leaders to change their current practices.\n\nChallenges with Crypto Decarbonization\n\nProof-of-work energy usage\n\nWith lawmakers increasingly looking at the effects of Bitcoin mining, from both an environmental and grid-resiliency perspective, lowering energy usage of this crypto currency is a must. Bitcoin is the only major currency that uses proof-of-work mining. The large energy usage associated with proof-of-work mining is an inevitable consequence of the fundamental nature of its algorithms.\n\nEthereum moved to a far less energy intensive proof-of-stake consensus mechanism, reducing that network’s electrical usage by over 99.9 percent. (Here’s a discussion of the difference between proof-of-work and proof-of-stake.) A single transaction on Ethereum’s proof-of-stake network is now similar to the electrical usage of a Mastercard transaction. As a result, when we speak of the emissions impact of “crypto,” we are now largely speaking about the emissions impact of Bitcoin.\n\nTo mitigate crypto industry emissions, RMI supports the “Change the Code, Not the Climate” campaign, launched by Greenpeace and the Environmental Working Group, intended to motivate Bitcoin to move away from proof-of-work and toward a less energy-intensive consensus mechanism.\n\nA co-benefit of Bitcoin changing its consensus mechanism would be to mitigate Bitcoin’s significant e-waste problem. As proof-of-stake and other low energy protocols require less computing power and no specialized equipment, Bitcoin ditching proof-of-work would mean the network would require far less hardware — an additional win for the climate.\n\nPrice volatility\n\nIn addition to energy usage and e-waste, the price volatility associated with Bitcoin and other cryptocurrencies is a cause for concern. When prices are high, Bitcoin miners may be willing to power their operations with clean electricity. But as the price of Bitcoin comes down, smaller profit margins mean industry players are likely to seek out the cheapest electricity possible, which may not always be the cleanest. Digiconimist currently estimates a “cost percentage” of Bitcoin mining, which shows that miners spend a majority of their income on electricity.\n\nFurthermore, there are attempts to use Bitcoin for demand response on power grids, with Texas’ ERCOT being the prime example. There are concerns, however, about the ability of Bitcoin miners to be relied upon for these services. If prices are too high, miners won’t prioritize limiting power usage, putting increased pressure on a grid that has experienced significant stress in recent years.\n\nElectricity procurement\n\nWith emissions on the scale of entire countries, it is imperative for Bitcoin mining, in the absence of changing to a low-energy consensus mechanism, to be powered by new renewable energy, rather than drawing from existing renewable capacity. Because of the flexibility of Bitcoin’s load, or its ability to be mined anywhere in order to balance energy supply and demand, miners who are conscious about their footprint should be able to contract renewable energy to power their operations. Unfortunately, as public data from Greenpeace shows, this is not currently the case. Bitcoin miners are largely contracting energy from fossil sources and claims of sustainability tend to be based on being co-located near renewables.\n\nSome Bitcoin miners may not have direct control over their electricity usage if their mining computers are contracted out to larger data centers. This, combined with the fact that miners are not longstanding businesses with well-established credit, may make it difficult to dictate their electricity supply. In order to drive further renewable energy generation, rather than take credit for an existing portion of renewable capacity, Bitcoin miners must contract renewable energy directly.\n\nBut while energy usage remains high in Bitcoin mining, it is imperative that this energy is clean, sustainable, and additional. To ensure this, RMI developed the Renewable Energy (RE) Emissions Score, designed to assess the material impact of renewable energy procurement. By measuring the emissions impact, as well as the value provided by off-takers of renewable energy, the RE Emissions Score will allow any company, not just Bitcoin miners, to make meaningful claims about renewable energy procurement, prioritizing investment in high emissions areas and low-cost renewable projects. If Bitcoin mining is to continue, it must be powered by additional renewables so that it does not inadvertently increase required grid capacity and lead to more fossil generation.\n\nThe RE Emissions Score was born out of a need to allow Bitcoin miners to make quantifiable claims of renewable energy use and investment, but its implications are much wider. Any company currently procuring renewable energy can use this approach to show its commitment to total grid decarbonization. Focusing on the decarbonization of the grid as a whole is vital to any strategy for reducing crypto emissions.\n\nMoving Forward\n\nThe climate effects of crypto, especially Bitcoin, are no secret. With an extremely large appetite for energy, crypto has the potential to serve as an impediment to climate progress. Price volatility has hampered climate action in the space, and without proactive procurement by miners, regulatory pressure is inevitable. Campaigns such as the CCA show an interest in addressing these issues within the community. Participating organizations cannot afford to allow these pledges to be mere words, they must act. Guidance on measuring emissions, such as the CCA Accounting Guidance and the Crypto Climate Impact Accounting Framework, are vital first steps toward allowing industry participants to understand their own climate impact and take action to reduce it. The dictum applies: you can’t manage what you can’t measure.\n\nUntil such a time that a less energy-intensive consensus mechanism for bitcoin is developed and available, current Bitcoin mining operations should be powered by additional, renewable energy. The RE Emissions Score provides miners with the means to help ensure that contracted power is renewable and additional, which will be necessary to decarbonize US electricity grids by 2035.\n\nThough our direct engagement with crypto is coming to a close, RMI’s work to decarbonize the grid and transform the global energy system will continue."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTMwL25mdHMtY29taW5nLXRvLWJpdGNvaW4tc3BhcmtzLWhhbmR3cmluZ2luZy1hYm91dC1jcnlwdG8tcHVyaXN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ordinal NFTs Coming to Bitcoin Spark Debate Over Traditional Crypto - Bloomberg",
        "content": "NFTs are coming to the Bitcoin blockchain, sparking a debate among those who say the digital representations add a much-needed fresh use case and the purists concerned about deviating too far from the origins of the peer-to-peer cryptocurrency network.\n\nNonfungible tokens such as the now infamous Bored Apes and CryptoPunks are one of the driving forces that made Ethereum the most commercially important blockchain, where users can mint and trade digital assets that have been worth millions of dollars. Bitcoin was designed as a cryptocurrency, while Ethereum was built as a next-generation version that can handle decentralized applications."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvZGVmbGF0aW9uYXJ5LWV0aGVyLWlzLXVuZGVycGVyZm9ybWluZy1iaXRjb2luLWhlcmUtYXJlLTMtcmVhc29ucy13aHkv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8zMC9kZWZsYXRpb25hcnktZXRoZXItaXMtdW5kZXJwZXJmb3JtaW5nLWJpdGNvaW4taGVyZS1hcmUtMy1yZWFzb25zLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Deflationary Ether Is Underperforming Bitcoin, Here Are 3 Reasons Why - CoinDesk",
        "content": "\"For most macro investors, BTC is the obvious on-ramp into the crypto market – the most liquid, the widest range of on-ramps. We see this in the strong increase in BTC spot volumes (while ETH spot volumes have not risen much), surge in the open interest on CME and stronger positioning in the options market,\" Noelle Acheson, author of the popular \"Crypto Is Macro Now\" newsletter, said."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdHJ1dGhvdXQub3JnL2FydGljbGVzL2JpdGNvaW4tYXRtLWNvbXBhbmllcy1hcmUtcHJleWluZy1vbi10aGUtcG9vci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Companies Are Preying on the Poor - Truthout",
        "content": "There’s a laundromat in a working-class immigrant community on the outskirts of Washington, D.C. that is much more than a place to wash and dry clothes. The store offers alternative financial services — bill payment processing, money orders and check-cashing services — charging for many transactions that most banks perform for customers at no extra cost.\n\nMillions of people in the United States rely on services like those offered by the laundromat because they don’t have enough money to open bank accounts, with the potential for monthly fees to snowball into overdraft fees bleeding their modest income dry. But their reliance on stores like the Hyattsville, Maryland, laundromat leads them to incur up to thousands of dollars in additional costs every year. It’s the result of a phenomenon described by analysts and policy makers as people being either “unbanked” or “underbanked,” and it might be the most clear example of how, as the saying goes, it’s expensive to be poor.\n\nThe situation was supposed to change with the advent of cryptocurrency, according to the industry’s evangelists and their allies on Capitol Hill. They argued that the blockchain technology at the heart of crypto, which enables secure transactions through encrypted record-keeping on a public database, would lower the cost of offering basic services to the underbanked. But a closer look at the laundromat in Hyattsville, which prominently features a cryptocurrency ATM, shows how the industry has been able to fit seamlessly into the existing ecosystem of high-priced financial services used by people struggling to make ends meet.\n\nThe store’s cryptocurrency ATM charges up to 20 percent in exchange fees for Bitcoin purchases without disclosing the cost of the transaction to users, and is the product of a company called Bitcoin Depot, which has exploded in growth over the past few years, targeting low- and middle-income neighborhoods.\n\nTruthout recently visited the laundromat to get a firsthand look at how the kiosk operates. To execute a conversion of $40 into Bitcoin, the company disclosed that it was charging a $3 service fee but didn’t mention that the exchange rate it offered was 20 percent less favorable to buyers than the going market rate. Users must check prices themselves from another source to discern the real cost of the transaction, as numerous run-of-the-mill people have noted in social media complaints.\n\n“I deposited $334 anticipating to pay $3 handling fee,” one Twitter user noted, only to find that $67.40 “evaporated into Bitcoin Depot [sic] pocket … this is worse than loan shark [sic].”\n\n“Do not use @Bitcoin_Depot,” another said, “they say they only take 3% fee but in reality take 23%. It’s total fraud and scam. Fuck @Bitcoin_Depot.”\n\nBitcoin Depot, which controls roughly 20 percent of the crypto ATM market share in the United States, is far from the only one to employ shady practices while hawking their wares to the underbanked. Coin Cloud — number two in size to Bitcoin Depot with 15 percent control of the U.S. crypto ATM market — similarly charged 20 percent for Bitcoin exchanges without disclosing the spread between its price and the going market exchange rate, as verified by Truthout at a kiosk in Northeast Washington, D.C.\n\nAnother major retail crypto provider, Coinme, charges a markup of only about 7 percent, and the firm’s iPhone app alludes to the existence of a market rate with references to recent Bitcoin highs and lows. But in other ways, Coinme has uniquely predatory practices. As a partner of the payment processing giant MoneyGram, Coinme is used by the payday lending and check-cashing company ACE Cash Express to sell cryptocurrency, a highly volatile and scam-ridden asset class, to its clientele. A study published in November by the Bank of International Settlements estimated that roughly three-quarters of all Bitcoin buyers between 2015-2022 lost money on their purchase, and that price spikes tend to attract new buyers only after their likelihood of making money on the asset has decreased.\n\nCoin Cloud also boasts of having a partnership with ACE, though it appears to be based solely on the former placing its kiosks at the latter. The crypto company’s decision to highlight its ties with ACE contrasts sharply with its TV advertisement, released in July 2021, featuring legendary Black film director Spike Lee declaring: “Digital currency is viable for not just people of color, but anybody who has been historically excluded from traditional financial systems.”\n\nBoth MoneyGram and ACE have faced regulatory scrutiny for exploiting those “excluded from traditional financial systems.” The Consumer Financial Protection Bureau (CFPB) has repeatedly gone after each firm with the most recent punishment for each coming last year. In July, the agency sued ACE for allegedly “concealing free repayment plans from struggling borrowers” and racking up $240 million in revenue in the process. The CFPB sued MoneyGram in April for allegedly delaying remittance transfers in violation of federal law. Both companies are owned by private equity firms.\n\nLike Bitcoin Depot, ACE’s partners Coin Cloud and Coinme are also the subject of intense criticism that can be easily found on social media where many ripped-off consumers take their frustration hoping that it will in some way lead to restitution or greater awareness.\n\n“Literally just created a Twitter just so I could warn anyone that thinks of using you guys,” one Twitter user told Coin Cloud. “Never had to wait 3 plus hours w/ any exchange wallet & or pay the outrageous fee.”\n\n“This exchange is the scum of crypto industry,” another user said of Coinme. “Advertise 4-5% fees but you’re really paying 10-12%. Check quoted prices at time if [sic] purchase. They will steal your funds and lick your account for no reason.”\n\nNeither Bitcoin Depot, nor Coin Cloud, nor Coinme responded to requests for comment on this story.\n\nDuring crypto’s most recent boom cycle, the cryptocurrency ATM industry exploded in the United States. The estimated number of cryptocurrency ATMs in the country increased by a factor of almost eight: from 4,203 in January 2020 to 33,385 in January 2023. Growth slowed in the middle of 2022, after the cryptocurrency market started taking a series of nosedives that saw asset-holders lose some $2 trillion, roughly two-thirds of the entire market’s paper value, over the course of seven months, from November 2021 until June 2022.\n\nBut even if speculative efforts pan out for a slim minority of crypto buyers, the ATM industry quietly takes its pound of flesh. Companies typically charge between 6.5 percent and 20 percent in transaction fees buried in exchange rate figures, as observed by Truthout. And whether the companies fully disclose the cost or not, the price is much higher than the service charges imposed by conventional ATMs or even online crypto exchanges, which are fraught with their own problems, as the FTX collapse has demonstrated.\n\nIt’s also been known for years that the crypto ATM industry has had a focus on low-income neighborhoods. The Detroit Free Press reported on the issue in June 2018, and The Atlanta Journal-Constitution followed suit in February 2020. And while most of the interest from Washington has concerned the potential for crypto ATMs to facilitate criminal activity by enabling money laundering and ransomware hacks, regulators appear to be catching up. One report by the U.S. Treasury published in September 2022 cited the Free Press and Journal-Constitution reporting to classify the proliferation of crypto ATMs as an example of financial service companies targeting “vulnerable communities, especially low-income communities and communities of color … using deceptive sales tactics and marketing.”\n\nBitcoin Depot has practically admitted that it employs predatory tactics. The company has disclosed to investors that it relies on “demographic data” to strategically place its machines, and CEO Brandon Mintz has separately said that the company’s clientele is “more in that lower, middle income range. A lot of the people who are underbanked and unbanked prefer to use cash, so we try to focus on those areas.” At the same time, Bitcoin Depot also disclosed to investors that the company itself is somewhat wary of cryptocurrency as an asset class; specifically, that it uses “a sophisticated cryptocurrency management process to reduce our exposure to volatility in cryptocurrency prices by maintaining a relatively low balance of cryptocurrency at any given time.”\n\nIn other words, the company appears to pump cryptocurrency, with a focus on selling in working-class neighborhoods, before dumping whatever leftover crypto it still has on the books. There is legal ambiguity over the “pump” matter because Bitcoin Depot, like many other cryptocurrency ATM companies, denies that it offers investment advice in its fine print disclosures, in an apparent bid to insulate itself from regulatory enforcement actions by the Securities and Exchange Commission (SEC). In disclosures to investors, company executives said that the SEC could effectively shut down their operation “if we were to be deemed an investment company under the Investment Company Act of 1940.”\n\nAlthough none of the cryptocurrency ATM companies mentioned in this article responded to requests for comment, policy makers had more to say in response to Truthout’s findings.\n\n“Many Americans, especially those that have been turned away by banks time and time again, want financial products that work for them,” Sherrod Brown (D-Ohio), chair of the Senate Banking Committee told Truthout. “Unfortunately, as with payday lenders, they have been told that cryptocurrencies are helping build a more inclusive economy — but none of those promises have ever materialized. It is critical that we educate and protect consumers on cryptocurrencies’ risks and I will continue to work with my colleagues to do just that.”\n\nRep. Rashida Tlaib, (D-Michigan), who is on the House Financial Services Committee and has spoken about the impact of predatory crypto industry practices on her Detroit constituents, said she is “deeply concerned by the rise of so-called crypto ATMs.”\n\n“The cryptocurrency industry has spent billions on bullying regulators, lobbying Congress — and inundating my neighbors with advertising for get-rich-quick schemes,” Tlaib told Truthout. “Dressing up dangerous and predatory products in new technology and fancy buzzwords does not give financial companies a free pass to avoid regulation and consumer transparency.”\n\nBoth Brown and Tlaib are urging their fellow congressional representatives to act to protect consumers, echoing calls made on January 24 in an op-ed written by Representatives Chuy Garcia (D-Illinois) and Stephen Lynch (D-Massachusetts). Garcia and Lynch noted that the recent crypto downturn has “disproportionately harmed low-income, Latino, Black, and first-time investors.”\n\nNeither the SEC nor the Commodity Futures Trading Commission responded to a request for comment on general questions about their power over cryptocurrency ATM companies.\n\nThe CFPB declined the opportunity to comment, but highlighted various government agencies’ stated concerns about crypto ATMs being used to facilitate money laundering. The agency also pointed to its own consumer complaint database, a separate CFPB analysis of crypto-asset complaints, and flagged the Treasury Department’s report citing the crypto ATM industry as an example of a financial service provider preying on “vulnerable communities.”\n\nFor two experts who have been closely following cryptocurrency industry practices for years, one term came to mind: predatory inclusion. Brookings Institute fellow Tonantzin Carmona explained that the concept describes marginalized communities being granted new opportunities to better their material conditions, but with greater potential pitfalls than those that come with chances given to their white, upper-class counterparts.\n\n“Coin ATMs are such a great example of predatory inclusion,” Carmona said, with their marketing, their opaque fee structure, and the fact that they dispense high-risk financial assets. The industry ends up “monetizing inequities” rather than creating the low-cost alternative that it promised, she noted.\n\nMark Hays, senior policy analyst with Americans for Financial Reform, said predatory inclusion comes from the overall cryptocurrency market being based on a form of extraction capitalism. The industry has yet to demonstrate a clear use-value, other than facilitating both blue-collar and white-collar crime. Hays described the profitable crypto business model as: “Let’s get people’s cash into this market, pump up liquidity, get what we need and get out. Who cares if it crashes?”\n\nHe told Truthout that policy makers have allowed the situation to continue, in part, because they’ve been wowed by industry claims of novel innovation. “It’s deregulation being done in the name of innovation, which is something we need to be wary of,” Hays added.\n\nAs numerous analysts have noted, similarities between today’s cryptocurrency market and the subprime mortgage crisis have been maddening. Dangerous mortgage products were feted by lawmakers and regulators in the run-up to the Great Recession. In 2005, for example, then-Federal Reserve Chairman Alan Greenspan praised subprime mortgages for granting credit to “once more-marginal applicants.” Greenspan’s fellow travelers on the right would then go on to scapegoat this segment of the market to explain away their ideological failure.\n\n“Why did they make these investments?” Carmona asked rhetorically. “You had folks like Alan Greenspan promoting these things.”\n\nTired of reading the same old news from the same old sources? So are we! That’s why we’re on a mission to shake things up and bring you the stories and perspectives that often go untold in mainstream media. But being a radically, unapologetically independent news site isn’t easy (or cheap), and we rely on reader support to keep the lights on.\n\nIf you like what you’re reading, please consider making a tax-deductible donation today. We’re not asking for a handout, we’re asking for an investment: Invest in a nonprofit news site that’s not afraid to ruffle a few feathers, not afraid to stand up for what’s right, and not afraid to tell it like it is.\n\n\n\nCopyright © Truthout. May not be reprinted without permission."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcmRpbmFscy1wcm90b2NvbC1zcGFya3MtZGViYXRlLW92ZXItbmZ0LXMtcGxhY2UtaW4tdGhlLWJpdGNvaW4tZWNvc3lzdGVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ordinals protocol sparks debate over the place for NFTs in the Bitcoin ecosystem - Cointelegraph",
        "content": "The recent launch of a nonfungible token (NFT) protocol on the Bitcoin mainnet has the crypto community divided over whether it’ll be good for the Bitcoin ecosystem.\n\nThe protocol, referred to as “Ordinals,” was created by software engineer Casey Rodarmor, who officially launched the program on the Bitcoin mainnet following a Jan. 21 blog post.\n\nThe protocol essentially allows for the Bitcoin version of NFTs — described as “digital artifacts” on the Bitcoin network.\n\nThese “digital artifacts” can comprise of JPEG images, PDFs, video or audio formats.\n\nMeme-inspired, NFT-like “digital artifacts” are now being inscribed on the Bitcoin network. Source: Ordinals\n\nThe introduction of the protocol has the Bitcoin community divided, however, with some arguing that it offers more financial use cases for Bitcoin, while others say it’s straying away from Satoshi Nakamoto’s vision of Bitcoin as a peer-to-peer cash system.\n\nBitcoin bull Dan Held was one of those on board with the development, noting that it would drive demand for block space — and thus fees — while bringing more use cases to Bitcoin.\n\nWhy it's good:\n\n- Brings more financial use cases to Bitcoin\n\n- Drives more demand for block space (aka fees)\n\n\n\nMy take:\n\n- If you pay a tx fee, it's not spam.\n\n- Bitcoin is permissionless. Can't stop anyone from building it anyway. — Dan Held (@danheld) January 29, 2023\n\nSome have pointed out that these NFT-like structures have taken up block space on the Bitcoin network, which could drive up transaction fees.\n\nBREAKING: NFTs ON #BITCOIN\n\n\n\nOrdinals are taking up most of the BLOCKSPACE pic.twitter.com/Gxwq4vV8MI — Bitcoin News ⚡ (@BitcoinNewsCom) January 29, 2023\n\nAmong those include Twitter user “Bitcoin is Saving,” who argued to their 237,600 followers on Jan. 29 that “privileged wealthy whites” wanting to use JPEGs as status symbols may exclude marginalized people from participating in the Bitcoin network.\n\nCryptocurrency researcher Eric Wall disagreed, opining that Bitcoin’s built-in block size limit would prevent a rise in transaction fees.\n\nOthers such as Blockstream CEO and Bitcoin core developer Adam Back weren’t happy with meme culture being brought to Bitcoin, suggesting that developers take the “stupidity” elsewhere:\n\n\"you can't stop them\" well ofc! bitcoin is designed to be censor resistant. doesn't stop us mildly commenting on the sheer waste and stupidity of an encoding. at least do something efficient. otherwise it's another proof of consumption of block-space thingy. — Adam Back (@adam3us) January 29, 2023\n\nHowever, Ethereum bull Anthony Sassano, the host of The Daily Gwei, took a shot at the Blockstream CEO for wanting “undesirable” transactions to be censored, which many believe goes against the ethos of Bitcoin:\n\nAdam Back and Luke Dashjr are both Bitcoin core developers who have encouraged censorship over the last 48 hours of these \"undesirable\" transactions\n\n\n\nSo no, it isn't just Bitcoin maximalists - it's actual Bitcoin core developers — sassal.eth (@sassal0x) January 30, 2023\n\nIn a blog post, Rodarmor explained that the NFT-like structures are created by inscribing satoshis — the native currency of the Bitcoin network — with arbitrary content.\n\nRelated: Stacks ecosystem becomes #1 Web3 project on Bitcoin\n\nThese inscribed satoshis — which are cryptographically represented by a string of numbers — can then be secured or transferred to other Bitcoin addresses, according to notes in Ordinal’s technical documentation:\n\n“Inscribing is done by sending the satoshi to be inscribed in a transaction that reveals the inscription content on-chain. This content is then inextricably linked to that satoshi, turning it into an immutable digital artifact that can be tracked, transferred, hoarded, bought, sold, lost, and rediscovered.”\n\nThe inscriptions take place on the Bitcoin mainnet, no sidechain or separate token is needed, the document states.\n\nInscriptions are finally ready for Bitcoin mainnet.\n\n\n\nInscriptions are like NFTs, but are true digital artifacts: decentralized, immutable, always on-chain, and native to Bitcoin. https://t.co/a4dK7zdITS — Casey Rodarmor (@rodarmor) January 20, 2023\n\nIt appears that only 277 digital artifacts have been inscripted thus far, according to the Ordinals website.\n\nInterestingly, Rodarmor admitted in an Aug. 25 interview on Hell Money Podcast that Ordinals was created to bring memes to life on Bitcoin:\n\n“This is 100% a meme-driven development.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRyYWRlcy1oaWdoZXItbmlnZXJpYS1hbWlkLTE0NTk0NjAxMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin trades higher in Nigeria amid cashless economy drive - Yahoo Finance",
        "content": "Bitcoin was trading at a premium in Nigerian cryptocurrency exchanges on Monday as the central bank continued its cashless society campaign which includes ATM withdrawal limits that took effect earlier this month.\n\nSee related article: Weekly Market Wrap: Bitcoin rebounds above $23,000. Can it maintain momentum?\n\nA single Bitcoin was selling for roughly 17.5 million Nigerian nairas (NGN), or around US$38,000, at local exchanges NairaEX and Quidax as of 10 p.m. on Monday, Hong Kong time.\n\nThat price is about 40% higher than the global average Bitcoin price of US$23,100, according to CoinMarketCap. Bitcoin was reportedly trading at an even higher premium earlier in the day.\n\nThe Nigerian Bitcoin premium emerged after the Central Bank of Nigeria (CBN) recently imposed domestic ATM cash withdrawal limits as part of its cashless economy drive.\n\nAs per a December regulatory directive from the CBN, which has been effective since Jan. 9, citizens have been permitted to withdraw no more than 20,000 NGN from ATMs per day and up to 100,000 NGN per week.\n\nThe limits followed the CBN’s drive to replace existing bills with new and lower denomination banknotes. Nigerians had until Jan. 24 to swap for the new notes, but long queues and complaints about insufficient time led to a deadline extension to Feb. 10, the BBC reported.\n\nIn January, local media reported that the House of Representatives Committee on Capital Markets and Institutions plans to pass a law that recognizes digital currencies as investment capital."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NhbnQtaWdub3JlLWJpdGNvaW4tbmZ0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs: Love 'Em or Hate 'Em, You Can't Ignore 'Em - Blockworks",
        "content": "Ordinals, a non-fungible token protocol, has launched on Bitcoin mainnet, causing a ruckus in the community.\n\nOrdinals were created by software engineer Casey Rodarmor, and can be described as a numbering scheme for satoshis — the smallest denomination of bitcoin — which can track and transfer individual sats and allow “inscriptions” or “digital assets” to be uniquely identified.\n\n“Ordinal NFTs use an accounting-like method to distinguish between single (fungible) satoshis, making them non-fungible (differentiated) in this closed-off system,” Blockworks Research analyst Matt Fiebach said.\n\nOrdinals store texts, images, SVG, or HTML on-chain and can be authorized through a transaction — they can also be purchased, stored and gifted.\n\nThis was accomplished using a loophole from the Taproot upgrade in 2021, which enabled “practically unlimited (capped by block size) storage using Opcodes, an executable script in a txn that can store arbitrary data,” Fiebach said.\n\nRodarmor notes in a blog post that these digital artifacts will be held to a “higher standard” than NFTs, as they can not be stored off-chain and on centralized servers with back-door keys.\n\n“Inscriptions are immutable and on-chain, on the oldest, most decentralized, most secure blockchain in the world,” Rodarmor said. “They are not smart contracts, and do not need to be examined individually to determine their properties. They are true digital artifacts.”\n\nA torn community\n\nBitcoin’s purpose has been hotly debated since its inception, and not all community members are thrilled about Ordinals.\n\nFor a long time, community members have been torn on whether Bitcoin’s ledger should simply be a space to record financial transactions or a distributed data store for different applications, the pseudonymous Pourteaux wrote in a blog post.\n\nBefore the Taproot upgrade, Opcode was limited to 80 MB, Fiebach said.\n\n“Many BTC supporters believe block space should be reserved for sending BTC rather than storing data, or anything else, given BTC is supposed to be peer-to-peer electronic cash,” he said. “Others may argue that increased demand for block space could be considered a positive for the long term sustainability of securing the network.”\n\nThe pros and cons\n\nSo, what are the chances of Bitcoin becoming the next big hotspot for NFTs?\n\nOne of the appeals of purchasing NFTs on Bitcoin is the price. Since the Segwit upgrade in 2017, Bitcoin has already included a heavily discounted eip-4844-style blob space, cryptocurrency researcher Eric Wall tweeted.\n\n“That blobspace is now being abused by taproot to make full-block (≤4mb) bitcoin NFTs 10x cheaper than ETH L1,” Wall wrote.\n\nhttps://twitter.com/ercwl/status/1619644247313125376\n\nDespite this, a legitimate concern remains.\n\nAs Ordinals don’t operate on a separate sidechain or protocol and run on bitcoin mainnet, popular usage of Ordinals will increase transactions, creating congestion and hefty fees.\n\n“Even though with op_codes, the cost of storing an image on Bitcoin is much cheaper than Ethereum, it is still much more expensive to store data on-chain than through centralized data storage services,” Blockworks Research analyst Ren Yu Kong said.\n\nIf NFTs on bitcoin were to take off, and more people began storing images on the network with op_codes, transaction fees per block would significantly increase and full nodes will have to download much more data, Yu Kong said.\n\n“Over time, that leads to higher technical requirements to run a full node, and thus from a security standpoint, likely leads to further centralization for the set of full nodes verifying the chain,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtYml0Y29pbi13aGFsZS1kZXBvc2l0cy1vbi1leGNoYW5nZXMtc3VycGFzcy13aXRoZHJhd2Fscy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin BTC Price Trades Flat as GDP, Employment Data Signal Mild Growth - CoinDesk",
        "content": "Historically, the net volume metric tends to move in waves. Although the current development does not guarantee a selling spree, it may foreshadow what larger investors will do. A prolonged movement of bitcoin to exchanges would signal that larger holders are preparing to sell, which could lead to a price drop. The movement is in early stages, though."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFkb3B0aW9uLW9mLWd1YXRlbWFsYW4tbWVyY2hhbnRzLWdyb3dzLW9uZS1idGMtdGF0dG9vLWF0LWEtdGltZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin adoption of Guatemalan merchants grows one BTC tattoo at a time - Cointelegraph",
        "content": "Bitcoin (BTC) use in Guatemala is on the up. The Latin American country bordering El Salvador boasts Guatemalan-grown Bitcoin companies such as Ibex and Osmo, several Bitcoin Beach-inspired projects including Bitcoin Lake and now, free BTC tattoos.\n\nA 2022 Bitcoin merchant adoption competition hosted by Osmo Wallet — a Guatemala-based Bitcoin company — led to the free ink promotion. Cointelegraph spoke to Piero Coen, the co-founder of Osmo Wallet and Steven Marroquin, the owner of Soul’s Anchor, a tattoo parlor in Guatemala City.\n\nFree tattoo ideas from Soul's Anchor. Source: Piero Coen\n\nCoen explained how the mission is to get more people to use Bitcoin:\n\n“So we ran a competition among merchants to see who would process the most volume in Bitcoin sales in 2022. Turns out Soul’s Anchor Tattoo Shop in Guatemala City, who started accepting Bitcoin payments using Osmobusiness back in October, won the competition.”\n\nMerchant adoption is nothing new in Guatemala. So they thought about how to make things more exciting. They decided that offering free Bitcoin tattoos to customers might be a Bitcoin-friendly marketing tactic. Coen explained, “It was a huge hit. All the slots filled up in hours!”\n\nThe free Bitcoin tattoos get the thumbs up from Cointelegraph’s Bman. Source: Coen\n\nGuatemalan Bitcoin believers and Bitcoin tourists streamed into the store to ink their favorite Bitcoin meme, quote or art onto their skin. Marroquin, the owner of Souls Anchor, explained, “It’s been around seven months since we officially accepted Bitcoin and have two to three customers per month.” It’s a small amount, but payments are on the rise, he reports:\n\n“The first months we had only one customer, and even though it’s still a few percentages of our income, probably 1%, we are happy to have started accepting it.”\n\nCoen explains that “it’s still super early” for Bitcoin adoption in Guatemala and that “most business owners are still unsure about accepting and holding onto Bitcoin because of the volatility.”\n\nBy allowing instant Bitcoin to fiat currency conversion at the payment merchant terminal, merchants can sidestep the volatility. Instant BTC to fiat conversion is a growing trend in the Bitcoin payments space, as companies such as Strike — headed up by Jack Mallers — and CoinCorner offer similar solutions. Bitcoin as a means of exchange is burgeoning and Coen is optimistic about its future:\n\n“Bitcoin adoption in Guatemala City is on the rise, every day we see more and more people getting into it, learning about it and stacking up on Sats.”\n\nRikki, one-half of the Bitcoin Explorers couple who spent 45 days living off Bitcoin only in El Salvador, recently traveled around Guatemala, paying his way in Bitcoin. Rikki told Cointelegraph the level of “adoption of Bitcoin in Guatemala has really surprised us,” referring to himself and his partner Laura.\n\n“Locals are curious, they want to learn about Bitcoin and see it as an important alternative to credit cards whose fees are very high in the country.”\n\nIndeed, by accepting Bitcoin, businesses can save over 50% on transaction costs when compared with credit card payments, “So the incentives are there,” Coen explained.\n\nRelated: As Bitcoin debuts in El Salvador, Honduras and Guatemala study CBDCs\n\nRikki added that “orange-pilling” efforts by Guatemalan-based companies, such as Ibex and Osmo, “are pushing to raise awareness of the technology.” The couple also visited the Bitcoin Lake, a Bitcoin-beach-style community project, where a Guatemalan mayor is mining Bitcoin in his office, before getting inked themselves as part of the promotion.\n\n“We found the tattoo idea very cute. It is a company that wants to reward its shopkeeper who has received the most Bitcoin transactions by promoting its business.”\n\nBitcoin and crypto tattoos are increasingly common as crypto advocates brand themselves with their choice of coin. However, crypto tattoos can sometimes go very, very wrong.\n\nBitcoin tattoos belonging to Rikki (top) and Laura (bottom). Source: Rikki\n\nTake Mike Novogratz, the Galaxy Digital founder, as an example. His Terra (LUNA) tattoo is a constant reminder that investing requires humility. The LUNA token crashed by over 99% in 2021. Fortunately, the Bitcoin tattoos are safe for now, thanks to a January price pump."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvY3J5cHRvLW1hcmtldHMtdG9kYXktYml0Y29pbi1kaXBzLWJlbG93LTIzay1haGVhZC1vZi1mZWRzLW1lZXRpbmcv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8zMC9jcnlwdG8tbWFya2V0cy10b2RheS1iaXRjb2luLWRpcHMtYmVsb3ctMjNrLWFoZWFkLW9mLWZlZHMtbWVldGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Today: Bitcoin Dips Below $23K Ahead of Fed’s Meeting - CoinDesk",
        "content": "To be sure, the number of whale, or large bitcoin holder, deposits to exchanges has declined in recent weeks, which in isolation is bullish. But the volume of deposits to exchanges exceeds the number of withdrawals on a relative basis, which is not. The withdrawal of assets from exchanges is generally a bullish signal."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiowFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzMxL2ZpcnN0LW1vdmVyLWFzaWEtY2VudHJhbGl6ZWQtZXhjaGFuZ2UtdG9rZW5zLXBvc3Qtc29saWQtZ2FpbnMtaW4tamFudWFyeS1kZXNwaXRlLXNlYy1pbnRlcmVzdC1iaXRjb2luLWV0aGVyLWluLXRoZS1yZWQv0gGnAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzEvZmlyc3QtbW92ZXItYXNpYS1jZW50cmFsaXplZC1leGNoYW5nZS10b2tlbnMtcG9zdC1zb2xpZC1nYWlucy1pbi1qYW51YXJ5LWRlc3BpdGUtc2VjLWludGVyZXN0LWJpdGNvaW4tZXRoZXItaW4tdGhlLXJlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "First Mover Asia: Centralized Exchange Tokens Post Solid Gains in January Despite SEC Interest; Bitcoin, Ether in the Red. - CoinDesk",
        "content": "A big week in markets as the U.S. Federal Reserve meets to decide how high to raise interest rates amid signs of lower inflation and a cooling economy. Coinbase Institutional Head of Research David Duong joined \"First Mover\" to discuss. Johns Hopkins University Professor of Applied Economics Steve Hanke weighed in with his recession outlook. Also bankruptcy expert Dov R. Kleiner of Kleinberg Kaplan joined to discuss the latest in the FTX, Celsius Network, and Voyager Digital bankruptcy cases. Plus, crypto exchange Gemini is reportedly under investigation over FDIC claims."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMzEvYml0Y29pbi1jb21tdW5pdHktZXJ1cHRzLWluLWV4aXN0ZW50aWFsLWRlYmF0ZS1vdmVyLW5mdC1wcm9qZWN0LW9yZGluYWxzL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMzEvYml0Y29pbi1jb21tdW5pdHktZXJ1cHRzLWluLWV4aXN0ZW50aWFsLWRlYmF0ZS1vdmVyLW5mdC1wcm9qZWN0LW9yZGluYWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Community Erupts in Existential Debate Over NFT Project Ordinals - CoinDesk",
        "content": "The protocol’s opponents argue that Ordinals will compete with traditional payment transactions by crowding blocks and driving up transaction fees. Rodarmor disagrees. “To that I say, well, there's this fee market pricing mechanism that bitcoin has, that lets people pay the amount of fees according to how valuable doing the transaction is to them,” Rodarmor told CoinDesk in an interview. “And that applies both to financial transactions and to inscriptions. And so, the fee market already handles what people pay for transactions, what they think they're worth and then miners just pick the transactions with the highest fees. So it all sort of fits into Bitcoin’s security and incentive model.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iZXN0LWphbnVhcnktc2luY2UtMjAxMy01LXRoaW5ncy10by1rbm93LWluLWJpdGNvaW4tdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Best January since 2013? 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a key week with a familiar cocktail of price spikes mixed with fear that the bear market will return.\n\nAfter sealing its highest weekly close in almost six months, BTC/USD remains over 40% up year-to-date, with the monthly close just 48 hours away — can the gains hold?\n\nAgainst all odds, Bitcoin has rallied beyond expectations this month, making January 2023 its best in a decade.\n\nThroughout, concerns have called for an imminent comedown and even new macro BTC price lows as disbelief swept the market.\n\nThat grim turnaround has yet to come to fruition and the coming days could yet turn out to be a crucial period for Bitcoin’s long-term trend.\n\nThe catalysts are hardly in short supply. The United States Federal Reserve will decide on its next rate hike this week, with Fed Chairman Jerome Powell giving much-anticipated commentary on the economy and policy.\n\nThe European Central Bank (ECB) will make the same decision a day later.\n\nAdd to that the psychological pressure of the monthly close, and it is easy to see how the coming week could be more volatile in Bitcoin’s recent history.\n\nBuckle up as Cointelegraph takes a look at five key issues to consider when it comes to BTC price action.\n\nBitcoin price eyes $24K with FOMC volatility predicted\n\nBitcoin continues to defy naysayers and shorters alike by spiking ever higher on lower timeframes.\n\nThe weekend proved no different to others in January, with BTC/USD hitting $23,950 overnight into Jan. 30 — a new five-and-a-half-month high.\n\nThe weekly close achieved the same feat, with Bitcoin failing to tackle the $24,000 mark for a final flourish.\n\nBTC/USD 1-week candle chart (Bitstamp). Source: TradingView\n\nAt the time of writing, $23,700 formed a focal point, data from Cointelegraph Markets Pro and TradingView showed, with U.S. markets yet to begin trading.\n\nAt current prices, Bitcoin remains up a striking 43.1% in January — the best January since 2013 — Bitcoin’s first well-known bull market year.\n\nBTC/USD monthly returns chart (screenshot). Source: Coinglass\n\nMarket analysts are keen to see what will happen around the Fed rate hike decision at The Federal Open Market Committee (FOMC) on Feb. 1. A definitive source of volatility, the event could impact the monthly candle significantly, only for BTC price action to change tack immediately.\n\n“Perhaps with a little assistance from FOMC volatility? Not a prediction, but certainly a trade setup I'd be very interested in,” popular trader Crypto Chase commented on a chart predicting a retracement followed by further upside for BTC/USD.\n\nBTC/USD annotated chart. Source: Crypto Chase/ Twitter\n\nThat roadmap took Bitcoin over $25,000, itself a key target for traders — even those who remain wary of a mass capitulation event extinguishing January’s extraordinary performance.\n\nAmong them is Crypto Tony, who notes the proximity of $25,000 to Bitcoin’s 200-week exponential moving average (EMA).\n\n“The 200 Weekly EMA sits right above us at 25,000 which as you know is my target on BTC / Bitcoin,” he told Twitter followers on Jan. 29.\n\n“Now flipping the 200 EMA and range high into support is massive for the bulls, but we have yet to do this and people are already euphoric. Think about that.”\n\nAn accompanying chart still laid out a potential path downhill toward $15,000.\n\nAs Cointelegraph reported at the weekend, Il Capo of Crypto, the trader now famous for his misgivings about the recovery, remains short BTC.\n\nContinuing, on-chain analytics resource Material Indicators defined $24,000 as an important zone for bulls to flip to support, along with the 50-day and 200-day simple moving averages.\n\n“If bulls break $24k expecting upside illiquidity to get exploited up to the range of technical resistance ahead of the Feb 1 Fed EoY terminal rate projection. What JPow says will move markets,” it said, as part of a commentary on the bid and ask levels on the Binance order book read this weekend.\n\nMaterial Indicators referenced Powell’s forthcoming words at the FOMC, also noting that bid liquidity had shifted higher, causing the spot price to edge closer to that key area.\n\nBTC/USD order book chart (Binance). Source: Material Indicators/ Twitter\n\nMacro hinges on Fed rate hike, Powell\n\nThe coming week is set to be dominated by the Federal Reserve’s interest rate hike and accompanying comments from Powell.\n\nIn a familiar but still nerve-racking sequence of events for Bitcoin traders, the FOMC will meet on Feb. 1.\n\nThis time, the result may offer few surprises, with expectations almost unanimous in predicting a 25-basis-point hike. Nonetheless, the scope for volatility around the unveiling remains.\n\n“The first two days of Feb are going to be volatile (much fun),” trader and commentator Pentoshi tweeted last week, also noting that the FOMC would be followed by a similar decision from the European Central Bank a day later.\n\nAccording to CME Group’s FedWatch Tool, there is currently a 98.4% consensus that the Fed will hike by 25 basis points.\n\nThis will be a further reduction compared to other recent moves and the smallest upward adjustment since March 2022.\n\nFed target rate probabilities chart. Source: CME Group\n\n“Wouldn’t be surprised if markets pumped all week ahead of the FOMC announcements,” popular social media commentator Satoshi Flipper said.\n\n“We already know it’s 25 BP. So what is there even remaining for J Powell to give guidance about? Another 25 or 50 BP remaining for the year? My point is regarding rates: the worst is now behind us.”\n\nShould speculators be right in assuming that the Fed will now trend toward halting rate hikes altogether, this would notionally offer long-term breathing space to risk assets across the board, including crypto.\n\nHowever, as Cointelegraph reported, many are worried that the coming year will be anything but plain sailing when it comes to a Fed policy transition. That may only transpire when policymakers have no choice but to stop the economic ship from sinking.\n\nAnother comment, from former BitMEX CEO Arthur Hayes, calls for extensive risk asset damage before the Fed is forced to change course, including a $15,000 BTC price.\n\nContinuing the longer-term warnings, Alasdair MacLeod, head of research at Goldmoney, referenced geopolitical tensions surrounding the Russia-Ukraine conflict as a key future risk asset downside trigger.\n\n“No one is thinking through the effect on markets of the resumption of the Ukraine conflict,” he argued.\n\nMacLeod predicted that energy prices would be “sure to spike higher,” along with U.S. inflation estimates.\n\n“Bond yields will rise, equities will fall,” he added.\n\nIndex generates first “definitive buy signal” in 4 years\n\nWhile few pundits are willing to go on record calling an end to the latest Bitcoin bear market, one on-chain metric is potentially leading the way.\n\nThe Profit and Loss (PnL) Index from on-chain analytics platform CryptoQuant has issued a “definitive buy signal” for BTC — the first since early 2019.\n\nThe PnL Index aims to provide normalized cycle top and bottom signals using combined data from three other on-chain metrics. When its value rises above its one-year moving average, it is taken as a long-term buying opportunity.\n\nThis has now occurred with January’s move up in BTC/USD, but while CryptoQuant acknowledges that the situation may flip bearish again, the implications are clear.\n\n“Although it is still possible for the index to fall back below, the CryptoQuant PnL Index has issued a definitive buy signal for BTC, which occurs when the index (dark purple line) climbs above its 365-day moving average (light purple line),” it wrote in a blog post alongside an explanatory chart.\n\n“Historically, the index crossover has signaled the beginning of bull markets.”\n\nBitcoin PnL Index (screenshot). Source: CryptoQuant\n\nCryptoQuant is not alone in eyeing rare recoveries in on-chain data, some of which were absent throughout Bitcoin’s trip to all-time highs following the March 2020 COVID-19 market crash.\n\nAmong them is Bitcoin’s relative strength index (RSI), which has now bounced from its lowest levels ever.\n\nPlanB, the creator of the stock-to-flow family of Bitcoin price forecasting models, noted that the last rebound from macro lows in RSI occurred at the end of Bitcoin’s previous bear market in early 2019.\n\nBitcoin RSI chart. Source: PlanB/ Twitter\n\nBTC hodlers stay disciplined\n\nContrary to expectations, mass profit-taking by the average Bitcoin hodler has yet to kick in.\n\nOn-chain data from Glassnode confirms this, with the BTC supply continuing to age despite the recent price gains.\n\nCoins dormant in wallets for five years or more, as a percentage of the overall supply, hit new all-time highs of 27.85% this weekend.\n\nBitcoin % supply last active 5+ years ago chart. Source: Glassnode/ Twitter\n\nThe amount of hodled or lost coins — “large and old stashes” of BTC traditionally dormant — has also reached its highest level in five years.\n\nBitcoin active supply chart. Source: Glassnode/ Twitter\n\nBitcoin hodled or lost coins chart. Source: Glassnode/ Twitter\n\nMeanwhile, on lower timeframes, the amount of the supply last active in the past 24 hours hit one-month lows on Jan. 29.\n\nDespite this, a feeling of “greed” is rapidly entering the market psyche, especially among recent investors, data below from CryptoQuant warns.\n\nSentiment \"greediest\" since $69,000\n\nWhat began as disbelief became a textbook case of market exuberance as Bitcoin rose rapidly, non-technical data shows.\n\nRelated: Bitcoin will hit $200K before $70K ‘bear market’ next cycle — Forecast\n\nAccording to the Crypto Fear & Greed Index, the classic crypto market sentiment indicator, the mood among Bitcoin and altcoin investors is now predominantly one of “greed.”\n\nThe Index, which divides sentiment into five categories to identify potential blow-off tops and irrational market bottoms, currently measures 55/100 on its normalized scale.\n\nWhile still far from its extremes, that score marks the Index’s first trip into “greed” territory since March 2022 and its highest since Bitcoin’s November 2021 all-time highs.\n\nOn Jan. 1, 2023, it measured 26/100 — less than half its latest reading.\n\nNonetheless, as measured by fear and greed, sentiment has erased losses from the FTX and the Terra LUNA meltdowns.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nIn a cautious reaction, a CryptoQuant contributor warned that sentiment among those only recently entering the market is now echoing the atmosphere of early 2021 when BTC/USD was making new all-time highs on an almost daily basis.\n\n“Sentiment from Bitcoin short-term on-chain participants (short-term SOPR) has reached the greediest level since January 2021,” a blog post read, referencing the spent output profit ratio (SOPR) metric.\n\n“While SOPR trending above 1 indicates a bullish trend, the indicator is way above 1 right now and overly stretched. Without increase in stablecoin reserves on spot exchanges, the bull fuel could run out quickly.”\n\nAmong its other uses, SOPR offers insight into when Bitcoin investors may be more inclined to sell after entering profit.\n\nBTC/USD annotated chart (screenshot). Source: CryptoQuant\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByZW1pdW0taGl0cy02MC1pbi1uaWdlcmlhLWFzLWl0LWxpbWl0cy1hdG0tY2FzaC13aXRoZHJhd2Fsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin in Nigeria is 60% more expensive, but there's a catch - Cointelegraph",
        "content": "Disclaimer: This article was updated on Jan. 31 to clarify the \"Bitcoin premium\" it originally pointed to is a direct result of the disparity between the official dollar-to-naira rate and actual market conditions, not the Bitcoin price itself. Also, the update omits the conclusion that the ATM withdrawal limit caused the \"Bitcoin premium\" in Nigeria.\n\nThe price of Bitcoin (BTC) has skyrocketed to well above global market levels, but only if the official naira-to-U.S. dollar rate is used for calculation.\n\nAt the time of writing, the price of 1 BTC on the Nigerian crypto exchange NairaEX is 17.8 million nairas, equating to a whopping $38,792 in the official rate. However, local media points out that the official foreign currency rate listed by the Central Bank of Nigeria (CBN) doesn't reflect the actual USD price available to Nigerian citizens.\n\nAs per the official CBN exchange rate, $1 equals N460 as of Jan. 30. However, the exchange rate of USD in the parallel market, or the real price that Nigerian citizens can exchange Naira for U.S. dollars is close to N750. This disparity between the official naira-to-USD rate and the real market rate of USD for Nigerian traders causes it to appear Bitcoin has a 60% \"premium\" over the current market price — which is around $23,700 at the time of writing.\n\nRecently, CBN introduced new naira banknotes with the aim of curbing inflation and money laundering. The central bank imposed a deadline of Jan. 24 for Nigerians to exchange their old, higher denomination bank notes for the new currency.\n\nHowever, there were long queues and complaints that there was insufficient time to meet the deadline. The central bank has now extended that deadline to Feb. 10, the BBC reported on Jan. 29.\n\nRelated: Nigeria set to pass bill recognizing Bitcoin and cryptocurrencies\n\nNigeria has become the leading country for Bitcoin web searches, according to Google Trends.\n\n\"Buy Bitcoin\" interest by region. Source: Google Trends\n\nAdditionally, on Jan. 26 Reuters reported that the Central Bank of Nigeria launched a domestic card scheme to rival foreign cards like Mastercard and Visa.\n\nThe \"AfriGo\" card scheme was designed to give Nigerians better access to bank card services and circumvent often expensive foreign card fees and exchange costs."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFpbXMtZm9yLTI1ay1hcy1pbnN0aXR1dGlvbmFsLWRlbWFuZC1pbmNyZWFzZXMtYW5kLWVjb25vbWljLWRhdGEtc29vdGhlcy1pbnZlc3Rvci1mZWFyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin aims for $25K as institutional demand increases and economic data soothes investor fears - Cointelegraph",
        "content": "Bitcoin (BTC) price broke above $22,500 on Jan. 20 and has since been able to defend that level, accumulating 40.5% gains in the month of January. The move accompanied improvements in the stock market, which also rallied after China dropped COVID-19 restrictions after three years of strict pandemic controls.\n\nE-commerce and entertainment companies lead as the year-to-date market performers. Warner Bros (WBD) added 54%, Shopify (SHOP) rose 42%, MercadoLibre (MELI) climbed 41%, Carnival Corp (CCL) 35% and Paramount Global (PARA) managed a 35% gain so far. Corporate earnings continue to attract investors’ inflow and attention after oil producer Chevron posted the second-largest annual profit ever recorded, at $36.5 billion.\n\nMore importantly, analysts expect Apple (AAPL) to post a mind-boggling $96 billion in earnings for 2022 on Feb. 2, vastly surpassing the $67.4 billion profit that Microsoft (MSFT) reported. Strong earnings also help to validate the current stock valuations, but they do not necessarily guarantee a brighter future for the economy.\n\nA more favorable scenario for risk assets came largely from a decline in leading economic indicators, including homebuilder surveys, trucking surveys and contracting Purchasing Managers Index (PMI) data, according to Evercore ISI’s senior managing director, Julian Emanuel.\n\nAccording to the research from financial services firm Matrixport, American institutional investors represent some 85% of recent purchasing activity. This means large players are “not giving up on crypto.” The study considers the returns occurring during U.S. trading hours but expects the outperformance of altcoins relative to Bitcoin.\n\nFrom one side, Bitcoin bulls have reasons to celebrate after its price recovered 49% from the $15,500 low on Nov. 21, but bears still have the upper hand on a larger time frame since BTC is down 39% in 12 months.\n\nLet's look at Bitcoin derivatives metrics to better understand how professional traders are positioned in the current market conditions.\n\nAsia-based stablecoin demand approaches the FOMO region\n\nThe USD Coin (USDC) premium is a good gauge of China-based crypto retail trader demand. It measures the difference between China-based peer-to-peer trades and the United States dollar.\n\nExcessive buying demand tends to pressure the indicator above fair value at 100%, and during bearish markets, the stablecoin's market offer is flooded, causing a 4% or higher discount.\n\nUSDC peer-to-peer vs. USD/CNY. Source: OKX\n\nCurrently, the USDC premium stands at 3.7%, down from a 1% discount two weeks prior, indicating much stronger demand for stablecoin buying in Asia. The indicator shifted gears after the 9% rally on Jan. 21, causing excessive demand from retail traders.\n\nHowever, one should dive into BTC futures markets to understand how professional traders are positioned.\n\nThe futures premium has held a neutral stance since Jan. 21\n\nRetail traders usually avoid quarterly futures due to their price difference from spot markets. Meanwhile, professional traders prefer these instruments because they prevent the fluctuation of funding rates in a perpetual futures contract.\n\nThe three-month futures annualized premium should trade between +4% to +8% in healthy markets to cover costs and associated risks. Thus, when the futures trade below such a range, it shows a lack of confidence from leverage buyers — typically, a bearish indicator.\n\nBitcoin 3-month futures annualized premium. Source: Laevitas\n\nThe chart shows positive momentum for the Bitcoin futures premium after the basis indicator broke above the 4% threshold on Jan. 21 — the highest in five months. This movement represents a drastic change from the bearish sentiment presented by the futures’ discount (backwardation) present until late 2022.\n\nRelated: Bitcoin price is up, but BTC mining stocks could remain vulnerable throughout 2023\n\nTraders are watching to see if the Fed broadcasts plans to pivot\n\nWhile Bitcoin’s 40.5% gain in 2023 looks promising, the fact that the tech-heavy Nasdaq index rallied 10% in the same period raises suspicions. For instance, the street consensus is a pivot from the Federal Reserve’s interest rate hiking campaign at some point in 2023.\n\nBitcoin derivatives and stablecoin demand exited the panic levels but if the Fed’s expected soft landing takes place, the risk of a recessionary environment will limit stock market performance and hurt Bitcoin’s “inflation protection” appeal.\n\nCurrently, the odds favor bulls as leading economic indicators show a moderate correction — enough to ease inflation but not especially concerning, as solid corporate earnings confirm.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xMjAyNTAvb3JkaW5hbHMtbGF1bmNoZXMtbmZ0cy1vbi1iaXRjb2luLXRyaWdnZXJzLWNvbnRyb3ZlcnN50gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDI1MC9vcmRpbmFscy1sYXVuY2hlcy1uZnRzLW9uLWJpdGNvaW4tdHJpZ2dlcnMtY29udHJvdmVyc3k_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ordinals Launches NFTs on Bitcoin, Unsurprisingly Sparking Controversy - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhen it comes to digital collectibles, most enthusiasts think of Ethereum, Solana, or Polygon—deservedly, as proof-of-stake blockchains have cornered the NFT marketplace. But digital collectibles using the Bitcoin blockchain have existed since 2014, and several projects have made it their continuing mission to bring NFTs to the first and biggest cryptocurrency.\n\nNFTs are digital assets that are provably unique and linked to digital (and sometimes physical) content like digital art, movies, and music that show proof of ownership or membership in an exclusive group.\n\nEven though NFTs have been in the Bitcoin ecosystem for nearly a decade, however, some still don’t see the point.\n\nAD\n\nAD\n\nOne of these projects is Ordinals, and some Bitcoin maximalists are calling it an affront to Bitcoin principles.\n\n\"you can't stop them\" well ofc! bitcoin is designed to be censor resistant. doesn't stop us mildly commenting on the sheer waste and stupidity of an encoding. at least do something efficient. otherwise it's another proof of consumption of block-space thingy. — Adam Back (@adam3us) January 29, 2023\n\nOrdinals creator Casey Rodarmor takes the criticism in stride, saying the controversy helps his cause.\n\n“I actually love the haters,” he said. “I mean, they do more to drive people to find out about the project than anybody else. I don’t know what they think when they have these massive audiences, and they go, ‘This is an attack on Bitcoin’—it seems like you don’t want to do that if you don’t want people to use the thing.”\n\nRodarmor is a former Bitcoin Core contributor who designed Ordinals to allow the transferring of individual satoshis on the Bitcoin network. “The Ordinals protocol is just a system for numbering Satoshis, giving individual sats a serial number, and then tracking them across transactions,” Rodarmor told Decrypt in an interview.\n\nAD\n\nAD\n\nThe Ordinals protocol enables users to explore, transfer, and receive individual satoshis, which may include unique inscribed data such as videos and images. The process of adding assets to individual satoshis is called inscription. As Rodarmor explains, inscriptions make it possible to put content in a Bitcoin transaction and assign it to a satoshi. Once completed, Rodarmor says, the inscriptions are stored in a Bitcoin transaction’s signature.\n\nThe process stays entirely on the Bitcoin network and does not require a sidechain or additional token, according to Rodarmor. “My design goal, from the beginning, was to create something that would strike people as being Bitcoin native,” he said. “That means it can’t have a token, and it can’t be a sidechain.”\n\nSatoshis—named after Satoshi Nakamoto, the pseudonymous creator of the Bitcoin blockchain—is the smallest unit of a Bitcoin. When someone buys a cup of coffee using BTC, they are most likely using satoshis instead of a whole Bitcoin, which currently trades around $22,700 per coin, according to Coingecko.\n\nMarginalized peoples in developing countries will have to pay more to run their Bitcoin nodes and send transactions because privileged wealthy whites want to put JPEG drawings on the blockchain as status symbols. Just because you can doesn’t mean you should. — Bitcoin is Saving (@BitcoinIsSaving) January 29, 2023\n\n“This use of block space is probably the lowest impact use compared to other things that you can do,” Rodarmor says. “Full nodes download this data, but then they ignore it,” The inscriptions have no resource requirements, he adds, refuting claims that Ordinals and inscriptions abuse the Bitcoin protocol or would drive up transaction costs.\n\n“One thing that people don’t understand is that in order for Bitcoin to be secure, blocks must be full—that is part of the Bitcoin security model,” he said. “If blocks are not full, nobody has any reason to pay more than the minimum fee rate to have their transactions included. So, as a result, blocks must be full.”\n\nRodarmor says that while inscriptions contribute to making blocks full, inscriptions do not change the size of the Bitcoin block. That would be something Rodarmor says he would not advocate.\n\nEven in the event of another upgrade to the Bitcoin network, Rodarmor says it would be unlikely to cause any problems for Ordinals, as the protocol only relies on minor parts of the Bitcoin network.\n\nAD\n\nAD\n\n“[Ordinals] relies on the fact that transactions have inputs, transactions have outputs, [and] that inputs and outputs are valued in satoshis,” he said. “So you can’t break Ordinals in an upgrade without breaking a whole lot of other things.”"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWlzLXVwLWJ1dC1idGMtbWluaW5nLXN0b2Nrcy1jb3VsZC1yZW1haW4tdnVsbmVyYWJsZS10aHJvdWdob3V0LTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price is up, but BTC mining stocks could remain vulnerable throughout 2023 - Cointelegraph",
        "content": "Bitcoin (BTC) mining stocks usually follow BTC’s price because it directly influences company earnings. These stocks were beaten down heavily in the last quarter of 2022, especially in December. The downturn after FTX’s collapse worsened with the bankruptcy filing of the largest U.S.-based Bitcoin mining company, Core Scientific.\n\nDuring this time, other mining stocks, like Marathon Digital Holdings (MARA) in the chart below, exhibited a weak correlation with Bitcoin’s price, suggesting that December’s downturn was probably overblown.\n\nMARA/USD price chart with MARA-BTC Correlation Coefficient index. Source: TradingView\n\nThe negative trend reversed at the start of 2023 as most mining stocks posted impressive gains. The Hashrate Index mining stock index, which tracks the average price of publicly listed mining and hardware manufacturing companies, increased by 62.5% year-to-date. The positive price spike also restored the strong correlation between BTC price and mining stocks.\n\nHowever, the mining industry remains under stress, with low profit levels expected for prolonged periods. Since Q2 2022, mining companies have funded operations by selling BTC from reserves, selling newly mined BTC, raising debt and issuing new shares. Unless Bitcoin’s price consolidates above $25,000, the industry will likely witness a few takeover attempts or further treasury sales to pay off debt.\n\nSome mining companies are operating at a loss\n\nCurrently, the top mining companies’ price-to-earnings (PE) ratio is negative, suggesting that they’re operating at a net loss, making their stock prices vulnerable to steep downturns.\n\nRiot Blockchain, Bitfarms Ltd, Hive Blockchain Technologies, Cleanspark Inc, Marathon Digital Holdings and Hut 8 Mining are the largest publicly traded Bitcoin mining companies with over 1% of the global hash rate share. The top 15 public mining companies have a combined share of around 19%.\n\nMarket share of Bitcoin mining companies by hashrate. Source: TheMinerMag\n\nNotably, the PE ratio of most companies in the industry is between 0 and 2, except for Marathon, Hive and Hut 8. This raises alarms that these companies could be overvalued at their current valuations.\n\nPrice-to-earning ratio of top mining companies Source: CompaniesMarketCap.com\n\nA net loss position is no reason to reject a stock because markets are usually forward-looking. If one is long-term bullish on Bitcoin, the mining stocks are obvious choices. However, these companies must survive through the bear market before bearing the fruits of the next bull run.\n\nShareholders suffered losses due to bad debt and dilution\n\nOverleveraged or indebted firms that have to meet their interest obligations are particularly stressed and vulnerable to insolvency.\n\nMarathon, Greenidge and Stronghold have over $200,000 in debt per unit of Bitcoin mining, with Marathon’s debt peaking at $1.1 million per mined BTC. Marathon collateralized its loans with Bitcoin in its treasury, and the firm now holds 10,055 BTC worth around $235 million.\n\nBy the end of October, Marathon had$100 million in loans, which risks getting liquidated if Bitcoin’s price falls below the loan threshold value. For instance, if the loan threshold is 150%, the company will be forced to sell some of its BTC to clear the loans if Bitcoin price drops below $15,000.\n\nDebt per BTC produced by mining companies. Source: TheMinerMag\n\nIn this regard, it is encouraging to see that Hive, Hut8 and Riot are mostly debt-free and functioning essentially on equity capital. This reduces the pressure of paying interest rates on the debt and provides flexibility in raising funds or expanding by absorbing some of the market share left by now-bankrupt mining operations.\n\nHowever, there’s another way to raise funds. Instead of raising debt, miners can dilute their shares. The companies raise investment from public market investors in exchange for additional stock. This reduces the ownership ratio of shareholders. Hut 8 mining and Riot had diluted north of 40% of their shares by Q2 2022. Hut 8 diluted around 15% of shares again in the third quarter of the same year.\n\nShare dilution of public mining companies by Q2 2022. Source: Hashrate Index\n\nThe need to raise money has exposed these indebted companies to liquidation risks, while excess dilutions have also significantly reduced the value of investor holdings.\n\nRelated: Bitcoin miners’ worst days may have passed, but a few key hurdles remain\n\nMining company mandates on treasury holdings\n\nWhile mining companies are struggling with profitability, they are determined to conserve their Bitcoin treasury levels. Despite suffering losses since Q2 2022, Marathon was able to retain its treasury holding levels.\n\nMarathon’s Bitcoin Treasury holdings. Source: BitcoinTreasuries!Net\n\nAt the same time, Hut 8 mining uses a more aggressive policy in selling its mined BTC. This has led to a strong increase in its holdings since mid-2022.\n\n8Hut’s Treasury has increased since July 2021. Source: BitcoinTreasuries!Net\n\nWhereas others like Riot and Hive have resorted to using their BTC treasury to cover operational and expansion costs. Hive’s holdings have reduced significantly since the third quarter of 2022, from 4,032 BTC to 2,348 BTC. Hive is relying on the expansion of its miner fleet and cost reductions to sustain itself.\n\nClearly, Bitcoin mining companies remain vulnerable to BTC price, debt liquidations and shareholder losses due to excess dilution. According to on-chain analyst and Crypto Quant founder Ki Young Ju, 2023 will see entities taking over entire mining companies with a chance to buy them at a discount.\n\nWhile this won’t affect Bitcoin price much, mining stocks are still exposed to the threat of considerable losses.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8zMC9iaXRjb2luLXN1aXNzZS1jaGFpcm1hbi1zYXlzLWV1LXdvbnQtYmFuLWNyeXB0by1idXQtaXQtbWF5LXNlZWstdG8tY29udGFpbi1pdC_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDEvMzAvYml0Y29pbi1zdWlzc2UtY2hhaXJtYW4tc2F5cy1ldS13b250LWJhbi1jcnlwdG8tYnV0LWl0LW1heS1zZWVrLXRvLWNvbnRhaW4taXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Suisse Chairman Says EU Won’t Ban Crypto, but It May Seek to Contain It - CoinDesk",
        "content": "As part of the Committee's rules, it would also mean that crypto would not be recognized as collateral, Meisser said, making it more difficult for a bank to issue a client a loan in the future for example. Doing so would only give banks the runway to store crypto for their clients, he said."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZXh0ZW5kLWdhaW5zLXNvbGFuYS1sZWFkcy_SAUFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWV4dGVuZC1nYWlucy1zb2xhbmEtbGVhZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether extend gains; Solana leads among top 10 - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5zY21wLmNvbS95cC9kaXNjb3Zlci9uZXdzL2Vudmlyb25tZW50L2FydGljbGUvMzIwODM5Ni9ob3QtdGVjaC1ob3ctYml0Y29pbi1taW5pbmctc2VydmVycy1hcmUtaGVscGluZy10dWxpcHMtZ3Jvdy1ncmVlbmhvdXNlLW5ldGhlcmxhbmRz0gGUAWh0dHBzOi8vYW1wLnNjbXAuY29tL3lwL2Rpc2NvdmVyL25ld3MvZW52aXJvbm1lbnQvYXJ0aWNsZS8zMjA4Mzk2L2hvdC10ZWNoLWhvdy1iaXRjb2luLW1pbmluZy1zZXJ2ZXJzLWFyZS1oZWxwaW5nLXR1bGlwcy1ncm93LWdyZWVuaG91c2UtbmV0aGVybGFuZHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Hot tech: how bitcoin mining servers are helping tulips grow - YP",
        "content": "In a giant greenhouse near Amsterdam, Dutch engineer Bert de Groot inspects six bitcoin miners as they perform complex sums to earn cryptocurrency, filling the air with a noisy whine along with a blast of warmth.\n\nThat warmth is heating the hothouse where rows of tulips grow, cutting the farmers’ reliance on gas. Gas has become more expensive since Russia invaded Ukraine.\n\nThe servers in turn are powered by solar energy from the roof, reducing the normally huge electricity costs for mining, and cutting the impact on the environment.\n\nMeanwhile, both the farmers and de Groot’s company, Bitcoin Brabant, are earning cryptocurrency. “We think with this way of heating our greenhouse but also earning some bitcoin we have a win-win situation,” flower farmer Danielle Koning, 37, told Agence France-Presse.\n\nBrain Game: How would you explain cryptocurrency to someone from the 70s?\n\nThe Netherlands is the world’s biggest tulip producer and also the second biggest agricultural exporter overall after the United States, with much grown in greenhouses.\n\nBut the low-lying country is keenly aware of the agricultural industry’s effect on climate change, while farmers are struggling with high energy prices. According to Koning, huge energy costs have driven some Dutch agricultural firms that often rely on greenhouses to stop growing, while others have even gone bankrupt.\n\nOn the other hand, mining for cryptocurrency requires huge amounts of electricity to power its computers (see graphic), leading to a massive environmental impact amid global efforts to tackle climate change.\n\nDe Groot, 35, started his business last year. Now, he has 17 clients including restaurants and warehouses. He said bitcoin and tulips were a perfect fit for each other.\n\n“This operation is actually carbon negative, as are all the operations I basically build,” said the long-haired de Groot, sporting an orange polo shirt with his firm’s logo. “We’re actually improving the environment.”\n\nThe tulip collaboration started when Koning saw a Twitter video that de Groot had made about bitcoin mining, and called him up.\n\nYoung Egyptians battle plastic pollution by recycling waste into bricks\n\nNow there are six servers at their greenhouse – Koning asked to keep the exact location a secret to avoid thieves targeting the HK$124,000 machines.\n\nKoning’s company owns half of them and keeps the bitcoin they produce, while de Groot is allowed to keep his three servers there in exchange for monthly visits to clean dust and insects out of the servers’ fans.\n\nWith a 20-degree Celsius difference between the air entering the machine and leaving them, this provides the heat needed to grow the tulips and dry the bulbs that produce them.\n\n“The most important thing we get out of it is, we save on natural gas,” said Koning. “Secondly, well, we earn bitcoin by running them in the greenhouse.”\n\nAgence France-Presse\n\nBert De Groot uses his smartphone to show graphics that represent the bitcoin miners’ activity. Photo: AFP\n\nWhat else makes cryptocurrency mining bad for the environment?\n\nBesides generating heat, cryptocurrency mining produces large amounts of carbon dioxide and e-waste, while also consuming excess water.\n\nAccording to research published in 2019 in the journal Joule, bitcoin mining alone produces 22 to 22.9 million metric tons of carbon dioxide emissions in a year. This is equivalent to the carbon emissions generated by 2.6 to 2.7 billion homes in one year.\n\nGreenidge Generation is a former coal power plant in New York that switched to natural gas and began bitcoin mining. Based on an article published by Columbia Climate School, when Greenidge became one of the largest cryptocurrency mines in the US, its greenhouse gas emissions increased almost tenfold between 2019 and 2020.\n\nPower plants such as Greenidge also consume large amounts of water to help them cool down. Greenidge draws up to 526 million litres of fresh water out of Seneca Lake each day. The water it discharges back into the lake is hotter than the lake’s average temperature, endangering wildlife.\n\nThere is also the problem of e-waste, or discarded electronic appliances. To be competitive, miners need to use the most efficient hardware. However, this becomes obsolete about every 1.5 years and cannot be used for other purposes, adding to the world’s existing e-waste problem."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV5ZXMtMjVrLWFzLWJ0Yy1wcmljZS1uZWFycy1iZXN0LXdlZWtseS1jbG9zZS1pbi01LW1vbnRoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin eyes $25K as BTC price nears best weekly close in 5 months - Cointelegraph",
        "content": "Bitcoin (BTC) spiked into key liquidity for a third time on Jan. 29 as the weekly and monthly closes loomed.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nTrader on Bitcoin: $25,000 “in sight”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD briefly hitting $24,498 on Bitstamp overnight.\n\nAlthough short-lived, the move marked the pair’s third attempt to take sell-side liquidity above $23,400 in recent days.\n\nIn each instance, bulls appeared to lack momentum to reclaim new support levels. At the time of writing, the status quo remained the same, with Bitcoin trading just below liquidity at $23,250.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nPrevious order book data from Binance uploaded to Twitter by monitoring resource Material Indicators demonstrated the firepower needed to neutralize bears.\n\nAs of Jan. 27, resistance was stacked at $23,200, $24,500 and $25,000, with the latter nonetheless still on traders’ radar as a potential next target.\n\n“$25,000 target in sight,” a confident Crypto Tony told Twitter followers in comments on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nCrypto Tony additionally expected a move higher on altcoins, with the overall crypto market cap set for a retest of resistance above the $1 trillion mark.\n\n“I am still looking for a decent move up over the next few weeks, BUT Be cautious when we begin tapping the $1.2 - $1.33 trillion market cap resistance level. This is a significant level and I expect strong resistance here,” he wrote on Jan. 28.\n\nTotal crypto market cap annotated chart. Source: Crypto Tony/ Twitter\n\nLike others, however, Crypto Tony remained cautious on longer timeframes, keeping the door open for a new macro low to appear on Bitcoin and altcoins at some point in 2023.\n\nAmong them is fellow commentator Il Capo of Crypto, who, in an update on the day, avoided technical analysis to state that he remained “short and strong” BTC.\n\n“Interesting week ahead,” he added.\n\nBest January in a decade?\n\nAt current prices, BTC/USD looked set to close the week at its highest levels since mid-August 2022.\n\nRelated: Bitcoin ‘so bullish’ at $23K as analyst reveals new BTC price metrics\n\nWith the ramifications of the FTX meltdown absent from the charts, January gains stood at 39.8% at the time of writing, Bitcoin’s most profitable January since 2013.\n\nBitcoin monthly returns data (screenshot). Source: Coinglass\n\nIn addition to the monthly close, the coming week will see new potential macroeconomic triggers from the United States as the Federal Reserve decides on its latest interest rate hike.\n\nThis and more will feature in the forthcoming edition of the Cointelegraph Markets newsletter, released Jan. 30. Sign up to receive it free below.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXBhcmVzLXdlZWtlbmQtZ2FpbnMtYXMtYW5vdGhlci1jbWUtZ2FwLWx1cmtzLWJlbG93LTIwa9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price pares weekend gains as another CME 'gap' lurks below $20K - Cointelegraph",
        "content": "Bitcoin (BTC) struggled to maintain bullish momentum on Jan. 30 as the countdown to the monthly close kept the market nervous.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC price sees flash dip below $23,000\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD coming off its latest highs at just below $24,000 on the day.\n\nThese, while Bitcoin’s best performance for nearly six months, encountered problems with staying power as the week began, with pre-Wall Street trading seeing a brief trip below $23,000.\n\nAt the time of writing, Bitcoin traded at around $23,250 as United States equities limped into the final few days of January.\n\nAmong the topics of interest for analysts was the CME Bitcoin futures gap from the weekend getting swiftly “filled” by spot.\n\n“Gaps” in the futures chart often act as a short-term price magnet for spot once futures markets reopen after weekends. Another remained open between roughly $19,970 and $20,530.\n\n“CME gaps filled and overshooting now bc of Equity futures being negative,” popular trader John Wick wrote in his latest Twitter update.\n\n“We’re in for a wild week!”\n\nCME Bitcoin futures 1-hour candle chart. Source: TradingView\n\nAnalytics resource Material Indicators, meanwhile, focused on order book activity on Binance, with longs and shorts potentially signaling upward continuation.\n\n“Sometimes looking at leveraged assets on binance can give clues to what is happening with the underlying. BTCDOWN is at resistance and BTCUP is approaching support,” commentary on a chart of longs and shorts stated.\n\n“Things don’t have to play out as these charts indicate, but so far they correlate with current BTC PA.”\n\nBTC/USD longs/short charts (Binance). Source: Material Indicators/Twitter\n\nBitcoin analyst “not convinced”\n\nOn whether Bitcoin would make good on weeks of upside before the monthly close, others were far from confident.\n\nRelated: Best January since 2013? 5 things to know in Bitcoin this week\n\nAmong them was Crypto Ed, who, in a note to followers, said that he was “not convinced yet” over Bitcoin’s overall strength.\n\nBTC/USD annotated chart. Source: Crypto Ed/Twitter\n\nAn accompanying chart presented a possible retest of $22,000 as a downside target.\n\nAs Cointelegraph reported, the area around $25,000 had constituted a significant cloud of resistance for Bitcoin, being an area of significant potential short liquidations.\n\nThat price nonetheless remained a popular target should bulls recover their firepower.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1yZXZlbnVlLWp1bXBzLXVwLTUwLXRvLTIzbS1pbi1vbmUtbW9udGjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining revenue jumps up 50% to $23M in one month - Cointelegraph",
        "content": "As Bitcoin (BTC) shows a minor bull run, the connected mining ecosystems’ year-long struggle for survival has started to pay off. In the first month of 2023, the Bitcoin mining community experienced a 50% increase in revenue through mining rewards and transaction fees.\n\nOn Dec. 28, 2022, Bitcoin mining revenue dipped to $13.6 million for the first time since October 2020. This, coupled with rising energy prices amid geopolitical tensions, imposed tremendous financial pressure on mining companies, forcing some to shut down.\n\nAs Bitcoin remains well-positioned for a steady recovery, the mining industry witnessed a 50% growth in revenue in terms of U.S. dollars, as shown below.\n\nBitcoin mining revenue increased by 50% in January 2023. Source: Blockchain.com\n\nBitcoin mining revenue jumped from $15.3 million on Jan. 1 to nearly $23 million in the span of 30 days.\n\nAs more miners join to power and secure the decentralized Bitcoin network, the hash rate continues to reach new all-time highs. At the time of writing, the Bitcoin hash rate stood at around 300 exahashes-per-second.\n\nRelated: Bitcoin stays out of fear for 11 straight days as price tips near 24K\n\nOne of the biggest criticism of Bitcoin remains the high energy requirement for running the proof-of-work consensus mechanism. In October 2022, Cointelegraph reported that Bitcoin witnessed a 41% increase in energy consumption year-on-year.\n\nHowever, a drive for sourcing greener energy to power Bitcoin mining facilities aims to solve the predicament. A mining company recently tapped into a source of stranded energy in Malawi, a landlocked country in southeastern Africa.\n\n1600 families connected to this remote hydro minigrid in the mountains of southern Malawi. They have 50kW of stranded energy that we are testing out as a new Bitcoin mining site.\n\n\n\nVideos for context.\n\n\n\nStill working on venting, wiring, etc. pic.twitter.com/Sxf8ABGPWH — Gridless (@GridlessCompute) January 21, 2023\n\nAs Cointelegraph reported, the project — undertaken by Gridless — uses 50 kilowatts of stranded energy to test out as a new Bitcoin mining site.\n\nSpeaking about the overall impact of the initiative, Erik Hersman, co-founder and CEO of Gridless, stated, “The power developer had built these powerhouses a few years ago, but they weren’t able to expand to more families because they’re barely profitable and couldn’t afford to buy more meters to connect more families. So, our deal allowed for them to immediately buy 200 more meters to connect more families.”\n\nIn addition, the environmental footprint of the Bitcoin mining facility is low as it runs purely off river-based hydropower."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9icmljcy1jaGFsbGVuZ2VzLXUtcy1kb2xsYXItY2FuLWl0LWhhdmUtYW4taW1wYWN0LW9uLWJpdGNvaW4tYXMtd2VsbC_SAV9odHRwczovL2FtYmNyeXB0by5jb20vYnJpY3MtY2hhbGxlbmdlcy11LXMtZG9sbGFyLWNhbi1pdC1oYXZlLWFuLWltcGFjdC1vbi1iaXRjb2luLWFzLXdlbGwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "BRICS challenges U.S. dollar, can it have an impact on Bitcoin as well? - AMBCrypto News",
        "content": "Bitcoin may be thrust into unchartered territory as BRICS challenges the U.S. dollar.\n\nAssessing the potential outcome for Bitcoin if BRICS succeeds.\n\nAn interesting thing is happening in the global arena and it might just be one of the major factors that may influence Bitcoin demand later this year. A battle is being waged against the dollar and this might challenge its global reserve status.\n\nHow many are 1,10,100 BTCs worth today?\n\nGeopolitical tensions are also taking the battle to the economic front. Russia and China are in joint efforts to roll out a new common global currency called BRICS in alliance with numerous other nations.\n\nGeopolitical tensions are also taking the battle to the economic front with BRICS as an alternative for the dollar. This development can potentially cause a massive impact globally but what does this mean for Bitcoin?\n\nIf BRICS catches on and manages to attract more countries, then the U.S. dollar might lose its grip as the global reserve currency.\n\nSuch an outcome can potentially put the dollar on the fast lane to lose even more value. Bitcoin might enjoy higher demand as people embrace other means of holding value.\n\nThe USD may also face more pressure and less demand from investors due to the current debt situation and recession fears.\n\nMeanwhile, Bitcoin is about to conclude a bullish first month of 2023. And so far those addresses that have been buying seem to be holding on to their coins. Glassnode Alerts confirmed this about Bitcoin supply activity;\n\n? #Bitcoin $BTC Amount of Supply Last Active 1d-1w (1d MA) just reached a 1-month high of 490,925.339 BTC Previous 1-month high of 489,165.093 BTC was observed on 23 January 2023 View metric:https://t.co/8VrSovS3cQ pic.twitter.com/wkSBnBxxeF — glassnode alerts (@glassnodealerts) January 29, 2023\n\nBitcoin’s volatility index pivoted in favor of the upside since 20 January. This suggests that Bitcoin might be headed for more volatile price movements at the start of February.\n\nThe resurgence of confidence in Bitcoin bulls is perfectly timed to absorb some of the liquidity from the greenback outflows.\n\nBitcoin has so far demonstrated resilience against the downside. Its latest rally confirms the strong demand and low sell pressure as investors opt to hold on to their coins.\n\nThis allowed BTC to push closer to the $24,000 price range. It traded at $23750 at press time.\n\nCan BRICS take advantage of Bitcoin from a blockchain perspective?\n\nThere have been reports claiming that banks in BRICS member states are exploring potential blockchain implementation.\n\nWhile this may still be within the realm of speculation, it might be a strong move for BRICS member countries.\n\nThis is good news for Bitcoin because it will underscore robust efficiency and speed. It would not only offer BRICS a competitive advantage but also make it easier to use as a reserve.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nNot going the blockchain route will likely put BRICS at a disadvantage now that more countries are exploring this technology.\n\nBTC may get to interact with BRICS on its home turf. The potential implications may turn out quite interesting, especially for Bitcoin’s long-term outlook."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sdGMtYXZheC1hcHQtYW5kLWZ0bS1wcmVwYXJlLXRvLXJhbGx5LWFzLWJpdGNvaW4tcHJpY2UtdGFyZ2V0cy0yNGvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "LTC, AVAX, APT and FTM prepare to rally as Bitcoin price targets $24K - Cointelegraph",
        "content": "Bitcoin (BTC) has rallied nearly 40% so far in January, which is the best start to the year since 2013. The sharp up-move has turned several on-chain signals bullish, according to on-chain analyst Cole Garner.\n\nUsually, a sharp recovery from the market lows, driven by the leader, is a sign that strong hands may be buying aggressively. That could be because traders believe the selling may have been overdone in the near term or they found the valuation to be attractive.\n\nCrypto market data daily view. Source: Coin360\n\nAfter the initial runup, a swift correction could be expected, which will shake out the weak hands. The next fall will also confirm whether Bitcoin has formed a bottom or not. If the low is confirmed, several altcoins may start to outperform Bitcoin in the near term.\n\nWhich altcoins are showing promise in the near term? Let’s study the charts of Bitcoin and select altcoins to see which could extend their up-move in the next few days.\n\nBTC/USDT\n\nBitcoin has been trading above $22,800 since Jan. 25, which suggests that bulls are trying to flip the level into support.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day exponential moving average ($21,558) indicates that bulls are in command but the relative strength index (RSI) in the overbought territory suggests that the rally may be overextended in the near term.\n\nIf buyers kick the price above $23,816, the BTC/USDT pair could start its northward march toward $25,211. This level may act as a formidable resistance.\n\nOn the downside, the 20-day EMA is an important level for the bulls to defend because if it cracks, the pair may fall to the psychological support at $20,000.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe RSI on the four-hour chart is forming a negative divergence indicating that the buyers may be losing their grip. If bulls want to assert their dominance, they will have to push the price above the $23,816 resistance. That could start the next leg of the up-move.\n\nConversely, if the price turns down from the overhead resistance, the bears will try to yank the pair below the moving averages. There is a minor support at $22,715 but if this level collapses, the pair could retest $21,480.\n\nLTC/USDT\n\nLitecoin (LTC) has been in a strong uptrend for the past several days. After a brief consolidation, buyers propelled the price above the overhead resistance of $92, indicating that the up-move remains intact.\n\nLTC/USDT daily chart. Source: TradingView\n\nThe LTC/USDT pair could rally to the psychological level of $100 where the bears may again try to erect a roadblock. If bulls do not give up much ground from this level, the pair may extend its journey to $107. The upsloping 20-day EMA ($86) and the RSI near the overbought territory indicate advantage to buyers.\n\nThis positive view could invalidate if the price turns down and slips below the 20-day EMA. The pair could then drop to $81 and later to $75.\n\nLTC/USDT 4-hour chart. Source: TradingView\n\nThe break and close above the $92 level suggest that the consolidation resolved in favor of the buyers. If bulls sustain the price above $92, the pair could rise toward the pattern target of $98.\n\nThe bears are likely to have other plans. They will try to drag the price below the breakout level of $92 and trap the aggressive bulls. If they manage to do that, the pair could fall to $86. This is an important level for the bulls to defend because a break below it could shift the advantage in favor of the bears.\n\nAVAX/USDT\n\nAvalanche (AVAX) surged above the resistance line on Jan. 27 and reached the overhead barrier at $22 on Jan. 28.\n\nAVAX/USDT daily chart. Source: TradingView\n\nThe bears are trying to stall the recovery at $22 but the bulls do not seem to be in a hurry to book profits. This increases the likelihood of a break above the overhead hurdle. If that happens, the AVAX/USDT pair could accelerate toward $30. There is a minor resistance at $24 but it is likely to be scaled.\n\nAnother possibility is that the price turns down and retests the resistance line. If the price rebounds off this level, it will suggest that the bulls have flipped it into support. That could enhance the prospects of a break above $22. The bears may gain the upper hand if the price dives below the 20-day EMA ($17).\n\nAVAX/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows the pair has pulled back near the 20-dayEMA. If the price jumps from the current level, the bulls will again attempt to thrust the pair above the overhead obstacle at $22. If this level is scaled, the pair could rally to $24.\n\nThe first sign of weakness will be a break and close below the 20-EMA. That could present an opportunity for the bears to make a comeback. The sellers could gain the upper hand if they pull and sustain the pair below the resistance line.\n\nRelated: South Korea to deploy cryptocurrency tracking system in 2023\n\nAPT/USDT\n\nAptos (APT) has been having a dream run in the past few days. Usually, when an asset picks up momentum, it continues to move in the same direction for some time.\n\nAPT/USDT daily chart. Source: TradingView\n\nThe APT/USDT pair turned down from $20.40 on Jan. 26 but the bulls are trying to arrest the pullback at $16.62. The shallow correction shows that every minor dip is being purchased by the bulls. Buyers will try to drive the price above $20.40 and start the next leg of the uptrend. The pair could then soar to $24.\n\nThe risk to this assumption is that the RSI has been in the overbought territory for the past few days. This increases the risk of a short-term correction. If the price turns down and plummets below $16.60, the pair could slide to $14.57 and then to the 20-day EMA ($12.23).\n\nAPT/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows a negative divergence forming on the RSI. If the price breaks below the 20-EMA, the pair could test the 50-SMA. This is an important support to monitor because if it cracks, the pair could fall to $12.\n\nContrarily, if the price turns up and breaks above $20.40, it will indicate that bulls have reasserted their supremacy. That may invalidate the negative divergence developing on the RSI and resume the uptrend.\n\nFTM/USDT\n\nFantom (FTM) has been in a stupendous run since breaking above the downtrend line. The sharp rally of the past few days suggests aggressive buying by the bulls.\n\nFTM/USDT daily chart. Source: TradingView\n\nThe indicators signal that bulls are firmly in control. During strong up-moves, the corrections are short-lived as bulls buy on every minor dip. The bears are trying to stall the up-move near the psychological resistance at $0.50 but if bulls pierce this level, the FTM/USDT pair could soar to $0.56 and then to $0.63.\n\nSometimes, vertical rallies are followed by sharp declines. Therefore, traders must be careful as a break and close below $0.43 could sink the pair to the 20-day EMA ($0.37). This is the key level to watch out for on the downside because a break below it could signal that the uptrend may have ended in the near term.\n\nFTM/USDT 4-hour chart. Source: TradingView\n\nThe pair turned down from the overhead resistance at $0.50 but found support at the 20-EMA. This indicates that the sentiment remains positive and traders are buying the dips. The bulls will again attempt to clear the overhead hurdle at $0.50 and resume the up-move.\n\nThe bears may have other plans as they will try to pull the price below the 20-EMA. This is an important level to keep an eye on in the short term as a break below it could open the doors for a possible drop to the 50-day simple moving average. If this level also cracks, the next stop could be $0.36.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy92YWxreXJpZS13Z21pLWJpdGNvaW4tbWluZXJzLWV0Zi0xNTI4NDQ1MDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Valkyrie's WGMI Bitcoin Miners ETF named best-performing U.S. fund, surges 105% in 2023 - Yahoo Finance",
        "content": "Valkyrie’s Nasdaq-listed Bitcoin Miners exchange-traded fund (ETF), WGMI, has been the best-performing U.S. fund of 2023 so far, rising over 105% in January.\n\nSee related article: U.S.’ first nuclear-powered Bitcoin mining center to open in Q1\n\nFast facts\n\nWGMI’s January rally puts it roughly 25% ahead of the second-best performer, according to Bloomberg.\n\nWGMI, a popular acronym for “We’re Gonna Make It” among crypto traders, tracks the performance of cryptocurrency mining companies. The fund has Hive Blockchain Technologies Ltd, Digihost Technology Inc., Bitfarms Ltd, Marathon Digital Holdings Inc., Riot Platforms Inc. and Hut 8 Mng Corp. in its holdings.\n\nWGMI opened Monday’s trading day at US$9.14 on Monday, which is 66% lower than its all-time high of US$26.68 set in February 2022.\n\nVanEck’s Digital Assets Mining ETF (DAM) and Digital Transformation ETF (DAPP), and the Global X Blockchain ETF (BKCH), which are also crypto-related ETFs, were up by at least 60% in January.\n\nBitcoin mining difficulty hit a new all-time high on Sunday as it rose 4.68% in its latest difficulty adjustment.\n\nBitcoin was trading at US$23,113, down 1.9% in the 24 hours to 10:45 p.m. in Hong Kong, after it reached a five-month high of US$23,918 overnight.\n\nSee related article: Blockstream says it raised US$125 million to expand Bitcoin mining operations"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jaGFzZS5jb20vcGVyc29uYWwvaW52ZXN0bWVudHMvbGVhcm5pbmctYW5kLWluc2lnaHRzL2FydGljbGUvY3J5cHRvLW93bmVyc2hpcC1zdXJnZXMtbmV3LWpwbW9yZ2FuLWNoYXNlLXJlc2VhcmNoLXJldmVhbHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "New JPMorgan Chase Research Shows that Crypto Ownership Surged in Five Years | Chase - Chase News & Stories",
        "content": "Chase's website and/or mobile terms, privacy and security policies don't apply to the site or app you're about to visit. Please review its terms, privacy and security policies to see how they apply to you. Chase isn’t responsible for (and doesn't provide) any products, services or content at this third-party site or app, except for products and services that explicitly carry the Chase name."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjAxOTkvYml0Y29pbi1taW5pbmctZGlmZmljdWx0eS1oaXRzLW5ldy1hbGwtdGltZS1oaWdo0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDE5OS9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LWhpdHMtbmV3LWFsbC10aW1lLWhpZ2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Difficulty Hits a New All-Time High - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s just gotten even harder to mine Bitcoin.\n\nBitcoin’s mining difficulty has hit a new all-time high, rising roughly 4.68% from 37.59 trillion on Sunday to 39.35 trillion at the time of writing.\n\nMining difficulty is the figure representing the computational power required to mine a single BTC. It’s updated roughly every two weeks, getting more difficult as more miners enter the network and easier when they leave.\n\nAD\n\nAD\n\nBitcoin mining difficulty over the past month. Source: CoinWarz .\n\nMining difficulty has been climbing strongly and steadily over the past year, despite temporary decreases, such as in the month of December 2022.\n\nOn January 30, 2022, the mining difficulty sat at 26.24 EH/s as per the data from CoinWarz, but it has since risen to 39.35 EH/s, a roughly 50% increase.\n\nMeanwhile, Bitcoin’s hash rate, which measures the amount of computational power dedicated to mining the cryptocurrency, currently sits at 305.81 ExaHashes per second (EH/s). This figure is still below the all-time high registered on January 6 of 348.7 EH/S.\n\nThe current hash rate means Bitcoin miners are currently making over 305 quintillion codebreaking attempts every second in attempts to solve the computational equations needed to produce the proof-of-work (PoW) cryptocurrency.\n\nThis time last year, Bitcoin’s hash rate was roughly 182.37 EH/s, making for a total increase of over 67% to the time of writing.\n\nAD\n\nAD\n\nBitcoin hash rate from January 31, 2022, to the present. Image: CoinWarz .\n\nDespite both Bitcoin’s mining difficulty and hash rate spiraling up throughout 2022, the price of the end product hasn’t kept pace.\n\nThe price of Bitcoin, as per CoinGecko data, has declined from $38,232 on January 30, 2022, to $23,211 today, marking a roughly 39.3% decline.\n\nBitcoin miners in difficulty\n\nThis isn’t good news for some in the Bitcoin mining industry, a larger mining difficulty means more advanced machinery, more computers, and more power might be needed to produce the same amount of Bitcoin.\n\nAnd if the price of Bitcoin isn’t rising at a comparable pace to the mining difficulty, this could make mining a less profitable business.\n\nAlready bankruptcy and debt restructuring news has cropped up almost weekly in recent months.\n\nIn December 2022, Core Scientific, one of the largest publicly-traded U.S. mining companies declared bankruptcy.\n\nAnother major mining firm, Greenidge Generation has gone on record as saying that their continued viability is in “substantial doubt.\n\nIt’s not just low Bitcoin prices and higher miner difficulties putting stress on these firms. Industrial energy prices shot up 16% between 2021 to 2022, which has spelled trouble for firms running fleets of energy-intensive mining machines.\n\nAD\n\nAD"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8zMC9qYWlsZWQta2lja2JveGVyLWFuZHJldy10YXRlLXByb21vdGVkLWJpdGNvaW4tZm9yLXRheC1hdm9pZGFuY2UtaW4tdmlkZW8v0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAxLzMwL2phaWxlZC1raWNrYm94ZXItYW5kcmV3LXRhdGUtcHJvbW90ZWQtYml0Y29pbi1mb3ItdGF4LWF2b2lkYW5jZS1pbi12aWRlby9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Jailed Kickboxer Andrew Tate Promoted Bitcoin for Tax Avoidance in Video - CoinDesk",
        "content": "“What Andrew is trying to say is that crypto transactions are anonymous and the tax authorities will not be able to find them. Wrong on many counts,” Charles Kolstad told CoinDesk. Kolstad is an international tax lawyer at Withers Bergman LLP. “The IRS, the tax authorities in the [European Union] and elsewhere may be slow but they are not stupid. The tax authorities have blockchain analytic tracking software and will find you eventually. The IRS, the EU and members of the OECD are all focused on tax evasion through the use of crypto.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vc2VjdXJpdHlpbnRlbGxpZ2VuY2UuY29tL2FydGljbGVzL3NpbGstcm9hZC1kYXJrLXdlYi1sYXctZW5mb3JjZW1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "How the Silk Road Affair Changed Law Enforcement - Security Intelligence",
        "content": "The Silk Road was the first modern dark web marketplace, an online place for anonymously buying and selling illegal products and services using Bitcoin.\n\nRoss Ulbricht created The Silk Road in 2011 and operated it until 2013 when the FBI shut it down. Its creator was eventually arrested and sentenced to life in prison.\n\nBut in a plot twist right out of a spy novel, a cyber attacker stole thousands of bitcoins from Silk Road and hid them away. It took law enforcement years to find the perpetrator. By then, the Bitcoins were worth more than $3.3 billion.\n\nThe extended law enforcement operation was difficult and complex. But ultimately, this saga set the stage for future action against darknet marketplaces.\n\nHere’s what happened.\n\nHow Silk Road worked\n\nTwo technologies assured anonymity for both sellers and buyers on Silk Road: The Tor network and Bitcoin. The Tor network is a browser and service that routes internet traffic through a series of servers. Each of these servers then hides the IP address so that it becomes untraceable.\n\nBitcoin is a digital currency created in 2009. It allows for peer-to-peer transactions without the need for a central authority, such as a bank or government. Instead, the blockchain records, secures and authenticates these transactions.\n\nPeople bought and sold a wide range of products and services on the Silk Road. By 2013, however, some 70% of the purchases were drugs.\n\nTracing drugs shipped by mail to temporary P.O. boxes became The Silk Road’s undoing. This allowed law enforcement to arrest Ulbricht’s freelance employees and piece together the Silk Road story.\n\nStill, the Tor network prevented law enforcement from nailing down exactly who was behind Silk Road. That was the case until an FBI agent got a lucky break. A Reddit post warned that Silk Road’s IP address had become visible online. The agent probed the claim by posting various data on Silk Road, then used software to analyze the traffic until he could expose the IP address.\n\nAfter some incredible and persistent desk-jockey sleuthing, Ulbricht, who used the online nickname “Dread Pirate Roberts”, was eventually caught logged into the site from a public library. He was arrested and charged with money laundering, computer hacking crimes, conspiracy to traffic narcotics and attempted murder to silence at least five people who threatened to unmask Silk Road.\n\nUlbricht turned down a plea deal offering a minimum 10-year sentence, which turned out to be a big mistake. He was convicted, given five sentences, including two life sentences without parole, and fined $183 million.\n\nMystery of the missing billions\n\nInitiated by U.S. Senator Charles Schumer, the DEA and Department of Justice conducted a long and intense investigation to find the billions in Bitcoin stolen from Silk Road before the site’s shutdown.\n\nIn 2012, a man named James Zhong created some nine Silk Road accounts anonymously. He then triggered more than 140 transactions in a way that tricked Silk Road’s withdrawal processing system into releasing around 50,000 Bitcoins into those accounts.\n\nHe exploited a flaw in the system, where he made an initial deposit, then rapidly withdrew an amount less than the deposit but made the same withdrawal many times within a second before the system could register that the account was depleted. Zhong repeated this on multiple accounts, making a total of 140 withdrawals.\n\nZhong then moved his ill-gotten proceeds into a range of addresses to conceal who owned and controlled the Bitcoins.\n\nAlmost five years after this theft, Zhong benefited from a hard fork coin split, where Bitcoin split into two cryptocurrencies: traditional Bitcoin and Bitcoin Cash. He converted the latter back to Bitcoin, which amounted to 3,500 Bitcoin.\n\nHe then used an exchange to convert the stolen bitcoin to dollars. This made it easy for investigators to trace the transaction. They knew he was out there somewhere and waited for him to reveal himself.\n\nTo catch a bitcoin thief\n\nAfter the government had been investigating the crime for a decade, they finally got tipped off when a man in Athens, Georgia, called the police to say that he was burglarized and that the thieves stole “a lot of Bitcoin”, which attracted the attention of the IRS. That man was James Zhong.\n\nPolice raided his home and found Bitcoin hidden in a “single-board computer” stashed in a popcorn tin in Zhong’s bathroom. They also found $662,000 in cash, along with bars of gold and silver, in a floor safe.\n\nIn November of 2021, the U.S. Attorney for the Southern District of New York announced that a law enforcement operation seized more than 50,676 Bitcoin worth an incredible $3.36 billion.\n\nZhong pleaded guilty to one count of wire fraud, which carries a maximum sentence of 20 years in prison. He is scheduled to be sentenced on February 22, 2023, and is currently out on bail.\n\nHow the Silk Road affair changed crime and law enforcement\n\nThe value of the seizure, the second largest ever after the $3.6 billion in stolen crypto linked to the 2016 hack of Bitfinex, caused federal law enforcement to prioritize crypto-related crimes, adding expertise and developing methods for tracing such transactions.\n\nTo cyber criminals — and also many law-abiding citizens who shared Ulbricht’s utopian libertarian views advocating for the freedom for people to buy and sell anything they like — Ulbricht’s double life sentence without the possibility of parole was a shock and an outrage. Still, no doubt, it strongly discouraged participation in dark web sites for people within reach of Western law enforcement. It also motivated everyone involved in such marketplaces to up their security and anonymity."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmNsb3Vkd2FyZHMubmV0L2lzLWNyeXB0by1hbm9ueW1vdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Is Crypto Anonymous 2024 [Is Bitcoin More Traceable Than Cash] - Cloudwards",
        "content": "Is Crypto Anonymous in 2024 & Is It More Traceable Than Cash? Cryptocurrencies are often portrayed as a way to send and receive money in secrecy, but is crypto anonymous, really? Can you send money anywhere without people figuring out who you are, or are you tracked just as easily as with regular bank payments? Written by Fergus O'Sullivan (Writer, Former Chief Editor) Reviewed by Aleksandar Kochovski (Editor) Facts checked by Jasna Mishevska (Lead Fact-Checking Editor) Last Updated: 2024-01-23T20:05:18+00:00 All our content is written fully by humans; we do not publish AI writing. Learn more here.\n\nIn movies and shows, cryptocurrencies are shown as the best way to move money around anonymously, whether for purposes of money laundering or even just simple tax evasion. However, is crypto anonymous, really, or can you be tracked when using it? Key Takeaways: Crypto Anonymity Most cryptocurrencies, Bitcoin included, are not anonymous but pseudonymous, not hiding your identity as much as giving you a fake one. While a pseudonym can hide you, it’s not foolproof, either.\n\nThrough some smart searching of a cryptocurrency’s blockchain, you could find out the real-world identities behind wallets.\n\nTo combat this, there are some anonymous cryptocurrencies that can hide your transactions, though they’re a minority and not very popular yet. Turns out that most cryptocurrencies, Bitcoin included, don’t deserve their reputation for secrecy and anonymity. Though they’re a lot harder to track than regular electronic payments, you’re not exactly casting a veil of secrecy over your money when using it. Let’s look at why that is. Show all Meet the experts Learn more about our editorial team and our research process.\n\nIs Crypto Anonymous? The short answer is no, most cryptocurrency isn’t anonymous, although there are a few exceptions we’ll get into later. Instead, most cryptocurrency is pseudonymous, or replacing your name with a fake one. However, instead of everybody going by the name “John Smith” or something along those lines, your name is replaced with the numbers and digits of your wallet address. A wallet is where your crypto is stored. It’s a digital space that only people with the address and the access keys can get to and move the contents around. However, it’s also what makes crypto identifiable, since a wallet’s address is kept on a cryptocurrency’s blockchain. If you need an in-depth reference on what cryptocurrencies are, get back to basics with our article on Cyrpto for Dummies. How Blockchain Technology Prevents Anonymity Blockchain technology is what makes cryptocurrency possible. It’s a digital ledger that tracks when a certain token was created and how it has moved around since then, preventing fraud. Of course, the purpose of any ledger is to retrieve information when you need it; if the ledger was anonymous, that wouldn’t be possible. As a result, any transaction or movement that takes place on a blockchain is recorded, and so is the entity that carried it out. Though your real name won’t be there, your pseudonym — the wallet address — will. While there are ways around this, it involves adding an extra layer on top of the blockchain; the basics of the technology remain unchanged.\n\nCan Your Crypto Addresses Reveal Your Real World Identity? Of course, pseudonymous doesn’t mean “out in the open,” either. There’s a good chance that nobody will ever link your cryptocurrency transactions to you. However, that doesn’t make it impossible. For one, if a crypto exchange knows who you are (via “know your customer,” or KYC identification), they could pass that information along to law enforcement should they ever come knocking with a warrant. Aside from such judicial muscle, though, there’s no way to directly link a crypto address to any one person. Your name isn’t linked to a wallet, at least not publicly. However, you can look at the blockchain for a specific currency and try to link it with somebody’s known crypto transactions. Example: Are Bitcoin Transactions Anonymous? For example, we want to find out which Bitcoin address belongs to Bob. To do so, we need to know something about him, like that last Tuesday he bought two Bitcoin. Then, we’d have to go through the ledger of the Bitcoin network for that day and find all the transactions for two Bitcoin. Since there are likely more than one, we’d have to narrow it down with another data point. If we know Bob sold one of his coins the next day, that gives us another thread to work on. Alternatively, we can figure out if he bought the coins from somebody we know. For example, if he bought it from a public Bitcoin addresses like that of an exchange or a friend whose wallet address we know, we could establish a link that way. There won’t be a single event that identifies Bob’s address unless we get very lucky, but by puzzling together enough clues from the list of Bitcoin transactions, we can get to a point where we can say with some certainty which address belongs to Bob and roughly how many Bitcoin he has in it. It’s a painstaking process, but savvy thinking and some machine learning algorithms make it a lot easier.\n\nIs Bitcoin More Traceable Than Cash? As a result, Bitcoin and other cryptocurrency are a lot more traceable than cash, and it’s all down to the blockchain, the ledger. Cash doesn’t have a ledger: you can spend a $5 note in a shop now, and tomorrow it could be on the other side of the world and you’d be none the wiser. Technically speaking, notes can be traced using serial numbers, but that only works if you have a note in your hands. It won’t help you track ones that are out there. With the right tools and enough patience, you can track any cryptocurrency you’d like, as well as its owner, from anywhere and at any time.\n\nWhich Crypto Is Anonymous? As you can imagine, not everybody is happy with this state of affairs. Plenty of people would like their digital assets to be cloaked in secrecy, away from the prying eyes of, well, anybody. While some of the people seeking this kind of anonymity do so to hide criminal activity, there are also those who pursue it in the name of the moral principle of privacy. No matter the reason, there are a number of cryptocurrencies that offer greater secrecy. They’re all a bit obscure, but the biggest names are probably Monero, Bytecoin and Zcash. What they all share is that they have found ways to obfuscate, or otherwise encrypt transactions, on their respective blockchains. Monero, for example, randomizes your address for every transaction and also hides the amounts that changed hands. Zcash has written a whitepaper that goes into detail on all the math behind its technology. Bytecoin uses CryptoNote, a technology that effectively places another layer onto the blockchain, making it impossible to see what’s really happening. Of course, we can safely assume that law enforcement as well as hobbyists are hard at work trying to pierce veils like these by hunting down suspicious transactions or linking known users to purchases. Eventually they’ll succeed and another new anonymous coin will take their place.\n\nFinal Thoughts The way cryptocurrency works now, there’s no room for anonymity without adding an extra layer. Blockchain technology was designed for transparency, so hiding transactions goes against its grain in every way. Still, with some engineering, you can make crypto harder to trace, maybe even impossible. Of course, should crypto even be untraceable? What does it matter if anybody knows your true identity? Isn’t anonymous crypto a bigger danger? Let us know what you think in the comments below. As always, thank you for reading. FAQ Is Cryptocurrency Anonymous? No, most cryptocurrency is not anonymous. With some sleuthing, crypto can be linked to the real you.\n\nAre Cryptocurrency Transactions Anonymous or Pseudonymous? Bitcoin transactions are not anonymous, but pseudonymous, meaning you’re using a fake name (your wallet address).\n\nCan Cryptocurrency Be Traced? Most crypto assets can be traced using wallet addresses, transaction history and, of course, the blockchain. With some work, you could figure out where every Bitcoin ever made is right now, to name just one example.\n\nIs There an Untraceable Cryptocurrency? There are several cryptocurrencies that claim to be completely anonymous and untraceable, such as Monero, Zcash and Bytecoin. How anonymous they truly are, though, remains to be seen."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaW5hbmNlLW1hc3RlcmNhcmQtbGF1bmNoLWJpdGNvaW4tcmV3YXJkcy0xNDI3MDMyMDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Binance and Mastercard Launch Bitcoin Rewards Card in Brazil - Yahoo Finance",
        "content": "Binance and Mastercard have launched a prepaid rewards card in Brazil that will allow customers to make everyday purchases with cryptocurrency.\n\nNew and existing Binance users will be able to use the card to buy things and pay bills with Bitcoin and other cryptocurrencies across Mastercard’s network of 90 million merchants, Binance said in a statement seen by Decrypt.\n\nIt also comes with perks including up to 8% cashback in crypto on eligible purchases, and zero fees on ATM withdrawals.\n\nWhen the card becomes widely available in the next few weeks, it will make Brazil the second Latin American country where it is available, following Argentina’s rollout last year.\n\nLike the Argentinian card, user funds will be converted from crypto to fiat currency in real time at the point of purchase. Payments made using crypto are subject to a 0.9% conversion fee.\n\n“Brazil is an extremely relevant market for Binance and we will continue to invest in new services for local users, as well as contributing to the development of the blockchain and crypto ecosystem in the country,” said Guilherme Nazar, general manager at Binance for Brazil.\n\nCrypto, Binance and Brazil\n\nLast year, Brazil’s congress passed a bill that gives cryptocurrency payments legal status in the country—though without making the assets legal tender.\n\nIt was signed into law by then-President Jair Bolsanaro at the end of last year.\n\n“Brazilians are eager to embrace crypto beyond an investment asset,” Marcelo Tangioni, Mastercard’s country manager for Brazil, said of Binance’s latest announcement.\n\nCardholders in Brazil will be able to pay using 14 different currencies. In addition to the Brazilian Real, these include Bitcoin, Ethereum, and Binance’s own BNB and BUSD tokens.\n\nPlans are underway to increase the number of cryptocurrencies supported by the card, according to Binance’s statement, as well as to expand its availability to more countries around the world."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy1idGMtaW1taW5lbnQtcHJpY2UtcmV2ZXJzYWwtbWlnaHQtYmUtb24tdGhlLWNhcmRzL9IBVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy1idGMtaW1taW5lbnQtcHJpY2UtcmV2ZXJzYWwtbWlnaHQtYmUtb24tdGhlLWNhcmRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin’s [BTC] price reversal might be on the cards? - AMBCrypto News",
        "content": "BTC’s price has rallied by 40% since 1 January.\n\nInvestors have recorded significant gains, and now, a price reversal might follow.\n\nExchanging hands at the $23,200 price mark at press time, the leading coin Bitcoin [BTC], currently trades at levels last seen in August 2022. On a year-to-date basis, BTC’s price has rallied by 40%, per data from CoinMarketCap.\n\nSharing a statistically significant positive correlation with several other assets in the market, the growth in BTC’s price has resulted in the growth in the value of several other crypto assets in the last month.\n\nAccording to data from CoinGecko, global cryptocurrency market capitalization has increased by 21% in the last month.\n\nHow much are 1,10,100 BTCs worth today?\n\nHolders are in profit, but for how long?\n\nBTC’s rally to a five-month high in the last month has led many of its holders to log profits on their BTC holdings. An assessment of the cost basis for short-term and long-term holders revealed this.\n\nThe cost basis for any BTC holder is the average purchase price of the BTC they possess. This considers any variations in BTC’s price at the time of purchase. This cost basis determines capital gains or losses when the BTC is sold.\n\nAccording to Twitter analyst Will Clemente, the cost basis for short-term and long-term BTC holders were $18,900 and $22,300, respectively.\n\nHowever, since BTC’s price has rallied beyond these points, these cohorts of investors were “no longer underwater,” Clemente said.\n\nBitcoin has now reclaimed its long-term holder cost basis ($22.3k) in addition to its short-term holder cost basis ($18.9k) and the aggregated cost basis. Behavioral shift as holders in aggregate are no longer underwater. The last three times this has happened are shown below: pic.twitter.com/8fCSyU5sqk — Will Clemente (@WClementeIII) January 29, 2023\n\nFurther, CryptoQuant analyst Phi Deltalytics assessed BTC’s short-term Spent Output Profit Ratio (SOPR) and found that “sentiment from Bitcoin short-term on-chain participants has reached the greediest level since January 2021.” According to the analyst, the SOPR was positioned well above the bullish threshold of one, indicating an overly stretched market.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nDeltalytics noted further that the bullish trend could be short-lived without an increase in stablecoin reserves on spot exchanges.\n\nA look at Crypto Fear & Greed Index confirmed the analyst’s position. At press time, the index showed that greed permeated the cryptocurrency markets.\n\nWhen the index is in the “greed” range, it means that investors have become increasingly confident and optimistic about the market and may be more willing to take on risk.\n\nThis also suggests that prices are becoming overvalued and that a market correction may be imminent.\n\nAn assessment of BTC’s movement on the daily chart confirmed the possibility of a price correction. Since 21 January, the king coin has traded in a tight range.\n\nWhen BTC’s price oscillates within a tight range, it means that the price is not making significant moves in either direction and is staying within a relatively narrow band.\n\nAn analysis of BTC’s Money Flow Index (MFI) and Chaikin Money Flow (CMF) indicators raised more concerns as these technical indicators have been trending downwards since 21 January.\n\nThe tight range of BTC’s price combined with downtrends in the MFI and CMF suggested a lack of buying momentum and potential for increased selling pressure.\n\nThis also showed that the market was likely to break down from the tight range to the downside."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY3J5cHRvLm5ld3MvYml0Y29pbi1taW5pbmctZGlmZmljdWx0eS1oaXRzLWF0aC1vZi0zOS0zNXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining difficulty hits ATH of 39.35T - crypto.news",
        "content": "On Jan. 29, the bitcoin (BTC) mining difficulty, which is the complexity that miners must overcome to solve blocks, was adjusted upwards to an all-time high (ATH) of 39.35 trillion. The new figure is a 4.68% increase from the previous one, making it particularly difficult for miners to find a bitcoin block.\n\nNew difficulty adjustment is markedly lower\n\nThe latest percentage increase in mining difficulty is much lower than the 10.26% recorded in the network’s Jan. 15 adjustment, which moved from 34.09 trillion to 37.59 trillion. It has also been bettered on six occasions in the last 12 months, with the highest adjustment change, a whopping 13.55%, coming on Oct. 10, 2022.\n\nCrypto analysts believe this is a good indication because the underlying implication is that the network requires more miners to validate transactions, increasing its security. The mining difficulty adjustment may also affect the price of BTC and provide some insight into the direction it might be headed in the short term.\n\nBTC’s mining difficulty is automatically modified every two weeks to maintain a total block time of 10 minutes. According to the blockchain money transfer network OKLink, the next difficulty adjustment is scheduled for Feb. 11, and the website estimates it will probably rise by 4.41% to 41.09 trillion.\n\nBitcoin price on the rise\n\nThe price of BTC isn’t necessarily linked with the mining difficulty, as there have been instances where the price has remained within a narrow range. In contrast, at other times, it has been accompanied by a significant reduction or increase in price.\n\nBTC price action for January 2023. Source: CoinGecko\n\nSince the beginning of January, BTC prices have risen by about 42.7%. As seen in the chart above from crypto data aggregator CoinGecko, bitcoin was trading at $16,587 on Jan. 1, but at the time of writing, it had risen to about $23,683. The price rise could benefit BTC miners, but the 4.68% difficulty increase might mean significantly lower profits.\n\nMajority of BTC hashrate is controlled by two mining pools\n\nAs well as the difficulty, BTC’s hashrate rose to 295.55 exahashes per second (EH/s). This number is still much lower than the ATH of 361.20 EH/s the network recorded on Jan. 6 at a block height of 770,709.\n\nFurthermore, mining pool concentration has registered significant growth, with two mining pools commanding more than 51% of total hashrates in the last month.\n\nBTC pool hashrate ranking. Source: BTC.com\n\nAs seen in the chart above, Foundry USA enjoyed a 31.87% share of the January hashrate, followed by AntPool with 19.53%. According to BTC.com, of the 4,613 blocks mined in the last 30 days, Foundry was responsible for 1,470, while AntPool had 901.\n\nAt the time of this writing, there are 65,704 blocks left to be mined before the next halving, scheduled for April 13, 2024. There are still about 1,723,13.75 BTC left to be mined, and the more the number dwindles, the higher the mining difficulty will be.\n\nFollow Us on Google News"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS90b3AtNS1jb3VudHJpZXMtd2l0aC10aGUtbW9zdC1iaXRjb2luLWF0bXMtMTU3OTgxODEuaHRt0gFjaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L3RvcC01LWNvdW50cmllcy13aXRoLXRoZS1tb3N0LWJpdGNvaW4tYXRtcy0xNTc5ODE4MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Top 5 countries with the most Bitcoin ATMs - CNBCTV18",
        "content": "The first Bitcoin ATM (BTM) was set up in Vancouver, Canada on October 29, 2013. Since then, thousands of other cryptocurrencies have entered the market and the digital asset industry has skyrocketed. This has led to more than 40,000 BTMs being added over the last 10 years or so. Today, several countries around the world have opened Bitcoin ATMs that citizens can use to buy, sell and send various cryptocurrencies. However, the distribution of these BTMs is not exactly uniform, with some countries dwarfing others in terms of machine count. Here’s a look at the top 5 countries with the most Bitcoin ATMs today.\n\nUnited States\n\nThe United States of America has the maximum number of Bitcoin ATMs. At the time of writing the number of Bitcoin ATMs in the country stands at 33,769. That equates to roughly 86 percent of all Bitcoin ATMs in the world. However, the country also reported the most number of closed ATMs in 2022, with 188 machines taken offline last year.\n\nCanada\n\nCanada is the pioneer of Bitcoin ATMs. As mentioned earlier, it was the first country to open up a BTM. The machine was set up in a coffee shop in Vancouver and saw 348 transactions worth around $100,000 in its first week of operation. The company that operated that particular ATM, Robocoin, has since shut down. However, the number of crypto ATMs in the country has skyrocketed. Today, Canada has 2,657 BTMs, propelling it to the number 2 spot in terms of countries with the most crypto ATMs.\n\nAlso Read: US authorities to announce international cryptocurrency action\n\nSpain\n\nSpain is on a mission to become a leader in crypto adoption, both in Europe and across the world. Keeping with this goal, in Jan 2022, the country announced plans to add 100 new Bitcoin ATMs to existing BTM network. By Oct the same year, Spain seemed to be on track with its mission, toppling El-Salvador to become the third-largest crypto ATM hub. Currently, the country has nearly 270 Bitcoin ATMs spread across different cities. The plan is to reach 300 BTMs soon.\n\nAustralia\n\nJust a few months earlier, Australia was ranked fifth in terms of Bitcoin ATMs. However, according to recent reports, the land down under added 99 BTMs towards the end of 2022. In doing so, Australia effectively pipped El Salvador to become the fourth-largest crypto ATM hub in the world. At the time of writing, Australia had around 240 Bitcoin ATMs spread across the country serving its rapidly expanding crypto community. The country represents 0.6 percent of the global installations of Bitcoin ATMs and is on its way to overtaking the number of Bitcoin ATMs in Asia.\n\nEl Salvador\n\nEl Salvador was the first country in the world to adopt Bitcoin as its legal tender. President Nayib Bukele has always been a proponent of Bitcoin and has taken several measures to turn El Salvador into a pro-BTC country. He even went as far as using geothermal energy from volcanoes to power Bitcoin mining.\n\nTherefore, opening Bitcoin ATMs seemed to be a fundamental step towards furthering the dream of a Bitcoin-first nation. As such, in 2021, president Bukele decided to establish more than 200 BTC ATMs across the country. This put the El Salvador 3rd on the list of countries with the most BTMs. However, over the last few months, Spain and Australia have overtaken the island nation and currently, El Salvador is the fifth largest hub for crypto ATMs, with 212 machines installed across the nation.\n\nConclusion\n\nThere’s no denying it, 2022 was a terrible year for the crypto industry. The crypto winter caused prices to plummet and the situation was worsened by the FTX and Luna meltdowns. These circumstances could explain why the number of Bitcoin ATMs dropped in 2022.\n\nAccording to data from CoinATMRadar, the number of BTMs fell by 2.05 percent, with 796 crypto ATMs being pulled off the global network between Jan and September 2022. Moreover, only 94 new BTMs were added between July and the end of 2022. However, 2023 is off to a bright start and could signal a turnaround for the cryptoverse. This could result in more BTMs being added in the coming months."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yMzYwMC1zb2xhbmEtZXRoZXJldW0tYm5iLXJpc2VzLXVwLXRvLTYtMzY4MDQ4LTIwMjMtMDEtMzDSAYgBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLTIzNjAwLXNvbGFuYS1ldGhlcmV1bS1ibmItcmlzZXMtdXAtdG8tNi0zNjgwNDgtMjAyMy0wMS0zMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $23,600; Solana, Ethereum, BNB rises up to 6% - Business Today",
        "content": "Top crypto tokens were trading higher on Monday, thanks to gains in Bitcoin which flirted with $24,000 level over the weekend. Markets have remained largely hopeful the past week despite conflicting economic data and worrisome fourth quarter earnings reports.\n\nBitcoin was able to hold weekend gains and was firm above $23,500 level. Its largest peer, Ethereum was comfortable above $1,600-mark. Other Altcoins also posted decent gains.\n\nBitcoin hovered at $23,946 level over the weekend as markets continued to react to the US personal consumption data and the rise of investor sentiment. It is the highest level since August 2022, said Edul Patel, CEO and Co-founder at Mudrex.\n\n\"However, BTC is currently trading above the $23,600 level and rose by 2 per cent over the previous day. If bulls can hold BTC above the current level, the impulse may continue towards $24,000 and $25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" he said.\n\nBarring the US dollar pegged stablecoins, all top crypto tokens were trading higher on Monday. Solana surged 6 per cent, followed by Ethereum and BNB. Bitcoin and Polygon also added 2 per cent each during the early trade.\n\nThe global cryptocurrency market cap was trading higher at $1.08 trillion mark, rising about 2 per cent in the last 24 hours. However, the total trading volumes surged 24 per cent close to $49.64 billion.\n\nBitcoin is hitting new three month highs, boosted by institutional buying, wider adoption, and infrastructure improvements. Institutional investors are increasingly taking notice of cryptocurrencies, with companies like Tesla and Square investing in Bitcoin, contributing to demand and higher prices, said Sathvik Vishwanath, co-founder & CEO at Unocoin.\n\n\"Market sentiment plays a big role in the value of Bitcoin, with rising demand and belief that the price will rise to cause a self-fulfilling cycle. However, there is always the risk of market volatility and regulatory changes that may impact growth,\" he said.\n\nCrypto updates\n\nLawyers for Sam Bankman-Fried have argued he should be allowed access to assets and crypto held by his former company FTX, saying there's no evidence he's responsible for previous alleged unauthorized transactions.\n\nEmails obtained by CoinDesk shed new light on the ongoing debate over the opaque and disputed ownership of WazirX, India’s largest crypto exchange. In November 2019, the ownership of WazirX was uncontested: Binance published a blog post saying that it had purchased the Indian exchange. WazirX’s executives talked openly about the acquisition.\n\nTech View by Giottus Crypto Platform\n\nPolygon (MATIC), the popular layer 2 blockchain, has had a great 2022 in terms of its adoption and partnerships. Now, its token seems to be reflecting the added value, having gone from $0.75 earlier this month to nearly $1.2 today.\n\nOn its way, it has cleared several resistance levels, made higher highs and higher lows, and continued to hold its price. With such momentum, short term target of $1.3 (its last high in November) is certainly in play, but with its 200-day EMA untested throughout the month ever since its breakout, there may be some consolidation first. A confluence of resistances and an overbought RSI in the vicinity of the $1.2 level also suggest a path that may see a test of $1.04 first for MATIC.\n\nMajor Levels:\n\nSupport: $1.10, $1.04, $1.0\n\nResistance: $1.25, $1.30\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: ‘NFTs can help bring art closer to people': Actor Lisa Ray\n\nAlso read: Stocks in news: Tata Motors, NTPC, Vedanta, L&T, Tech Mahindra and more"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNpdHlhbS5jb20vY3J5cHRvLWFkb3B0aW9uLWluLWVtZXJnaW5nLW1hcmtldHMtYWNjZWxlcmF0ZXMtYXMtc2VjLWtlZXBzLXJlamVjdGluZy1iaXRjb2luLWV0ZnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto adoption in emerging markets accelerates as SEC keeps rejecting Bitcoin ETFs - CityAM - City A.M.",
        "content": "Crypto adoption in emerging markets accelerates as SEC keeps rejecting Bitcoin ETFs\n\nData from CryptoCompare shows that the price of Bitcoin moved mostly sideways throughout last week, starting off at $23,000 and dipping to a $22,500 low before moving strongly upward to $23,500. The cryptocurrency failed to remain at that level and has since dropped to $23,200.\n\nEthereum’s Ether, the second-largest cryptocurrency by market cap, traded upward at the beginning of the week, close to the $1,650 mark. It soon dropped to below $1,550, but it quickly recovered to now trade at $1580.\n\nOver the past week, it was revealed that cryptocurrency adoption in emerging markets has kept on rising throughout the past year, even as prices plunged and the sector was affected by a plethora of bankruptcies.\n\nAccording to CryptoCompare’s 2023 Q1 Outlook report, Binance saw its market share grow over the past year as cryptocurrency adoption grew in emerging markets, where high inflation rates led to a rise in investments in digital assets in a bid to protect wealth from depreciating currencies.\n\nBinance has been able to take advantage of this trend and is often the preferred choice for users in emerging markets. For instance, it has seen a significant increase in RUB and BRL volumes, with its BTC volumes on Binance rising by 232% and 72% respectively.\n\nWhile people in these markets have kept on adopting digital assets, in the U.S. the Securities and Exchange Commission (SEC) has once again rejected a proposal to launch a Bitcoin spot exchange-traded fund (ETF) from Cathie Wood’s ARK Invest and global crypto ETF provider 21Shares.\n\nThe SEC said that ARK has not been able to show that the rules of its exchange are sufficient to protect investors from “fraudulent and manipulative acts and practices.” The SEC was this week criticized by the CEO of Grayscale Investments, Michael Sonnenshein, who said that he believes the regulator has been slowing down Bitcoin’s progress.\n\nIn a letter, Sonnenshein said he agreed with an assertion that the SEC was “late to the game” when it came to cryptocurrency regulation and preventing the collapse of FTX and criticized its “one-dimensional approach of regulation and enforcement.”\n\nAnother notable development came from credit-ratings giant Moody’s, which is said to be working on a scoring system for stablecoins as the asset class keeps growing. The system will include an analysis of up to 20 stablecoins based on the quality of attestations on the reserves backing them.\n\nTesla’s Bitcoin holdings remain unchanged\n\nOver the week it was also revealed that the electric car market Tesla hasn’t bought or sold any Bitcoin in the last quarter of 2022, making it the second straight quarter in which the company’s BTC holdings remain unchanged. The value of Tesla’s Bitcoin holdings has dropped from $218 million to $184 million.\n\nThe decrease was caused by losses from the drop in Bitcoin’s value. At Q3 end, BTC was nearly $20,000, and at Q4 end, the crypto was around $16,500. Tesla didn’t alter its Bitcoin holdings during Q3 2022 but in Q2, it sold $936 million worth of BTC (about 75% of its holdings) to raise funds amid COVID-19 lockdown concerns in China.\n\nMeanwhile, bankrupt cryptocurrency lender Celsius Network has revealed it’s considering issuing a token to repay creditors as part of a proposal to reorganize and exit bankruptcy as a regulated cryptocurrency firm.\n\nDuring a video-court hearing, company attorney Ross Kwasteniet said that restructuring Celsius into a publicly-traded licensed company would generate more revenue for creditors, compared to selling its assets at current prices.\n\nBlockFi, another bankrupt crypto lender, has been revealed to have had over $1.2 billion in assets tied to Sam Bankman-Fried’s FTX and Alameda Research, according to financials that were recently uploaded without the redactions.\n\nThe cryptocurrency lender filed for Chapter 11 bankruptcy in November, after the failure of FTX, which had planned to save the struggling company before its own collapse.\n\nEthereum developers bring staked ETH withdrawals closer to reality\n\nEthereum developers have moved closer to enabling withdrawals of $26 billion in staked Ethereum with the successful deployment of the first mainnet shadow fork for the Shanghai upgrade.\n\nThe Shanghai upgrade, set to launch in March, will allow stakers to withdraw their staked ETH on the network. It’s the first major update since the Ethereum Merge in September, which moved the network to Proof-of-Stake and allowed users to deposit ETH to become validators and receive rewards in newly minted ETH.\n\nJP Morgan analysts believe this flexibility for stakers to withdraw funds anytime could mark a new chapter in staking for Coinbase, as locked staked ETH has been a disincentive to stake ETH in the past.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8zMC9mdHgtc2Vla3MtdG8tcmVtb3ZlLXR1cmtpc2gtdW5pdHMtZnJvbS1iYW5rcnVwdGN5LWNhc2Uv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAxLzMwL2Z0eC1zZWVrcy10by1yZW1vdmUtdHVya2lzaC11bml0cy1mcm9tLWJhbmtydXB0Y3ktY2FzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "FTX Seeks to Remove Turkish Units From Bankruptcy Case - CoinDesk",
        "content": "The parent company can still take action under Turkish law, and some Turkish creditors have already started filing private claims in local courts, the filing said. CoinDesk has previously reported that staff often put their paychecks into the company because of their distrust of local banks and depreciation of the lira."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9tYXJrZXRzL2JpdGNvaW4tYmFycmVscy10b3dhcmQtaGlzdG9yaWMtamFudWFyeS1hcy1jcnlwdG8tbWFya2V0LWp1bXBzLWJ5LTI4MC1ibi0xMjMwMTMwMDEwOTFfMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin barrels toward historic January as crypto market jumps by $280 bn - Business Standard",
        "content": "Bitcoin is set for its best January since 2013 on bets that monetary tightening and the crypto-sector crisis are both ebbing.\n\nThe largest token is up 40 per cent since the turn of the year, a first-month gain bettered only twice before when crypto was in its infancy. Smaller coins like Solana, Axie Infinity and Decentraland have doubled in value, part of a $280 billion January climb in digital assets overall, CoinGecko figures show. Bitcoin retreated 2.5 per cent to $23,200 as of 11:37 am in London on Monday amid broad declines in risk assets.\n\nThe rebound from last year’s deep"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5zdHJhaXRzdGltZXMuY29tL3NpbmdhcG9yZS9jb3VydHMtY3JpbWUvc2NhbS12aWN0aW0tcy0xMDAwMS1pcy11c2VkLXRvLWJ1eS1iaXRjb2luLWhpZ2gtY291cnQtcnVsZXMtY3J5cHRvLXNlbGxlci1nZXRzLXRoZS1tb25ledIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Scam victim's $10001 used to buy Bitcoin; High Court rules crypto seller gets the money - The Straits Times",
        "content": "SINGAPORE - A man who unknowingly sold his Bitcoin to a scammer was allowed to keep the money for now, even though the $10,001 used to transact the deal had come from the victim of a fraudulent bank transfer.\n\nA High Court judge found that there were two victims in the case – the man whose stolen funds were used by the scammer to buy the Bitcoin, and the man who sold his cryptocurrency.\n\nA court fight had ensued between the seller and the bank transfer victim after the money was seized in the course of police investigations. Each had claimed the money should be returned to him.\n\nIn a written judgment last Friday, Justice Aedit Abdullah ruled that both men had lawful possession of the money.\n\nOn the one hand, the money originated from the bank account of Mr Ling Kok Hua and was fraudulently transferred. On the other hand, Mr William Lim Tien Hou had received the money in a legitimate contractual transaction.\n\nHe ruled that the money should be returned to the individual it was seized from, which is Mr Lim.\n\nThe judge said: “I understand that both parties have been put to expense and time in dealing with the aftermath of a fraud that neither was implicated in, and which both were victims of.”\n\nHe noted that his decision was on the basis of provisions in the Criminal Procedure Code governing the return of seized property, and has no effect on a civil court if parties start a separate civil action to assert their rights.\n\n“However, I would urge the parties to see if they can come to some sort of resolution between themselves that would avoid further time and expense for both.”\n\nOn Nov 10, 2018, a user named “haylieelan” on localbitcoins.com contacted Mr Lim – who had placed an advertisement to sell Bitcoin on the peer-to-peer trading platform – for a Bitcoin trade worth $10,000.\n\nAfter Mr Lim asked “haylieelan” to provide a photograph and identity details, the user submitted a photo of Mr Ling holding his identity card and a note stating that he was buying Bitcoin from “cryptotil”, which was Mr Lim’s username.\n\nMr Lim received $10,000 in his bank account and released the Bitcoin to “haylieelan”. Later in the day, he received another $1 but had no idea what it was for.\n\nOn the same day, Mr Ling was duped into believing that he was communicating with his former supervisor on Facebook when, in fact, he was speaking with a scammer who had hacked the account.\n\nMr Ling agreed to help transfer funds to a Bitcoin trading account, which turned out to be Mr Lim’s.\n\nThinking that he was helping his former boss, Mr Ling provided his online banking credentials and allowed the scammer remote access to his bank account via the TeamViewer application.\n\nMr Ling first prepared a transfer of $1 to Mr Lim’s bank account."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1iaXRjb2luLXByaWNlLWZvci1mZWJydWFyeS0yOC0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Machine learning algorithm sets Bitcoin price for February 28, 2023 - Finbold - Finance in Bold",
        "content": "With a 40% increase since the beginning of the year, Bitcoin (BTC) is off to a great start in 2023. Bullish momentum has emerged as a consequence of investors grabbing on optimistic news about macroeconomic issues, and investors hope that current levels may serve as a foundation for the first cryptocurrency to continue its upward trajectory in February.\n\nAs Bitcoin looks to finish January making its fourth consecutive weekly green candle for the first time since August 2021, investors will be hoping for more of the same come the end of next month. Notably, the machine learning algorithms at PricePredictions project that Bitcoin will likely continue to climb further to trade at $24,342 on February 28, 2023.\n\nIn comparison, the crypto community at CoinMarketCap predicts that Bitcoin will change hands at an average price of $20,254 on February 28, 2023.\n\nThe artificial intelligence forecasts use different technical indicators, such as the Bollinger Bands(BB), moving averages (MA), moving average convergence divergence (MACD), relative strength index (RSI), and others; price forecast represents an increase of 4.5% from Bitcoin’s price at the time of publishing.\n\nBitcoin 30-day price forecast chart. Source: PricePredictions\n\nNotably, halfway through the month, Bitcoin is projected to stand at $23,868 on February 14, 2023, on Valentine’s Day, as per data collected on January 24.\n\nBitcoin price analysis\n\nAt press time, Bitcoin’s price was trading at $23,269, with a minor loss of about 0.68% in the last 24 hours. On the weekly chart, the asset has climbed by 1.63%.\n\nBitcoin one-day price chart. Source: Finbold\n\nBitcoin’s technical analysis on TradingView is mixed, with the summary aligning with the ‘buy’ sentiment at 14 while moving averages are for the ‘strong buy’ at 12. Oscillators are pointing at ‘neutral’ with 8.\n\nBitcoin 1-day technical analysis. Source: TradingView\n\nThe price of Bitcoin is maintaining its upward momentum in the market, and it is now on track to finish this month with its best monthly performance since 2013. However, when compared year over year, it continues to show losses that are more than 38%.\n\nConcerning the fear and greed index, the development that has taken place in Bitcoin over the last month is remarkable, as it has completely abandoned the severe fear, fear, and neutral positions. After a significant amount of time spent in greed, he is now already positioned with a 61.\n\nBitcoin investors will pay close attention to the Federal Reserve meeting that begins this week. This will be the first meeting of the year, and market analysts anticipate that it will result in a more moderate increase in interest rates, of up to 25 basis points from the previous 50 basis points.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYml0Y29pbmlzdC5jb20vaXMtMS1taWxsaW9uLXBvc3NpYmxlLWZvci1iaXRjb2luL9IBPWh0dHBzOi8vYml0Y29pbmlzdC5jb20vaXMtMS1taWxsaW9uLXBvc3NpYmxlLWZvci1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Is $1 Million Possible For Bitcoin? Here’s What This Analyst Thinks | Bitcoinist.com - Bitcoinist",
        "content": "Bitcoin is already seeing a drawdown which has sparked speculation that the mini-bull run has come to an end. However, over the long term, there is still a bullish case for the digital asset but how high the price will go remains anyone’s best guess. An analyst has taken to Twitter to share their own forecast, which paints one of the most bullish cases for bitcoin over time.\n\nPlanB Says Bitcoin At $1 Million Is Possible\n\nIn a YouTube video, the pseudonymous analyst known as PlanB on Twitter laid out a chart that showed an expected growth pattern for bitcoin. The chart follows through to the very beginning of bitcoin, presumably to show this growth pattern in action over the years.\n\nThe chart shows an old and new stock-to-flow model, popularly known as the S2F model, as well as the BTC price. It then ties in the movement of these three shows a pattern of progression of each one.\n\nFollowing this pattern, PlanB said the price of bitcoin will likely be above $32,000 in 2024, which is the year of the next BTC halving. On a much longer basis, the model puts the price of bitcoin between $100,000 and $1 million by 2025.\n\nPlanB says $100,000 to $1 million still possible | Source: Twitter\n\n“BTC bottom is in, 2024 halving >$32k, 2025 bull market >$100k” scenario could look like this. Note the $100k-$1m yellow range estimate for 2025,” the analyst said.\n\nNow, this is a wide range but PlanB is not the only one that has presented this $1 million scenario for BTC. ARK Invest’s Cathie Wood has also given this exact prediction for the digital asset, although the CEO puts it on a much longer timeframe (By 2030).\n\nCan BTC Really Reach $1 Million?\n\nThe $1 million figure is one that has been echoed by a number of notable personalities in the space. Others have also given equally bullish forecasts, as in the case of Skybridge Capital’s CEO Anthony Scaramucci, who believes that the price of the digital asset will cross $300,000. Another forecast comes from the CEO of Jan3, Samson Mow, who believes the cryptocurrency will reach $1 million in the next five years.\n\nBTC sees drawdown following upward rally | Source: BTCUSD on TradingView.com\n\nFor most of these predictions, the basis and argument behind them have been the capped supply of bitcoin. And with each halving, the bitcoin supply is reduced, something PlanB also highlights in his own analysis.\n\nBillionaire Tim Draper forecasted that BTC’s price will cross $250,000 but Draper believes that this will come with the adoption of BTC by women. The billionaire notes that women control most of the retail spending power and once they are able to direct that toward BTC by being able to use the digital asset to pay for goods and services, then he expects the cryptocurrency to “blow right through” $250,000.\n\nBitcoin is currently trading at $22,933 at the time of this writing. It is down 2.15% in the last 24 hours."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1wcm9maXRhYmxlLTkwLW9mLXRyYWRpbmctaGlzdG9yeS1mdWVsZWQtYnktd2lkZXNwcmVhZC1hZG9wdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin profitable 90% of trading history fueled by widespread adoption - Finbold - Finance in Bold",
        "content": "It is already clear that the cryptocurrency sector is growing, but nothing testifies to its unstoppable expansion better than the aggressive adoption growth of Bitcoin (BTC), which has been profitable for its holders almost 90% of the time since the beginning of its trading.\n\nSpecifically, Bitcoin has been profitable for 87.66% or 3,984 days of its total traded history, which amounts to 4,545 days (around 12 years and five months), as opposed to only 564 or 12.41% unprofitable days, according to the data retrieved from crypto trading platform Blockchain.com on January 30.\n\nBitcoin profitable days. Source: Blockchain.com\n\nAggressive Bitcoin adoption curve\n\nNotably, the chart shows the number of days in Bitcoin’s trading history where holding the decentralized finance (DeFi) token was profitable relative to today’s price, highlighting the aggressive growth of its adoption curve over time, also reflected in its price, as limited supply results in increased demand whenever the price moves up.\n\nFurthermore, “it also demonstrates the importance of understanding the market cycles of Bitcoin to avoid buying market cycle tops,” as “the drawdowns from cycle tops can last a long time, around 2-3 years in previous cycles.”\n\nMeanwhile, the cryptocurrency market resurgence has produced more than 44,000 new Bitcoin millionaires profiting from the 2023 bullish rally to join the elite crypto club, as Finbold reported on January 28.\n\nBitcoin price analysis\n\nBy press time, Bitcoin has slowed down its rally, changing hands at the price of $23,265, which means it has weakened 0.75% on the day but is still up 2.32% compared to seven days before, with a 40.12% gain on the monthly chart, as its market capitalization stands at $445.99 billion.\n\nBitcoin 30-day price chart. Source: Finbold\n\nIt is also worth noting that the machine learning algorithms over at PricePredictions have projected that Bitcoin would likely continue to climb further by the end of the next month, setting its price at $24,342 on February 28, 2023.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]