[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMjYvd2hlcmUtYXJlLWJpdGNvaW4tbWluZXJzLWluLTIwMjMtdGV4YXMuaHRtbNIBT2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzI2L3doZXJlLWFyZS1iaXRjb2luLW1pbmVycy1pbi0yMDIzLXRleGFzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin miners beef up Texas operations ahead of extinction-level event, exclusive data shows - CNBC",
        "content": "Foundry's Kevin Zhang with Jihan Wu, the founder and chairman of Bitdeer and a co-founder of Bitmain. Kevin Zhang\n\nCrypto winters don't scare Kevin Zhang, who has been in the business of mining bitcoin for ten years. He's lived through a few bear markets in the last decade, but no matter where he has set up shop — the U.S., Sweden, the Republic of Georgia, and China — he's survived every one. In fact, it is precisely when things look most grim for the sector that Zhang typically doubles down. In 2013, for example, China banned bitcoin for the first time. The world's largest cryptocurrency immediately began to crash, and it was a slow bleed down in price for the next few years. As a wave of Western companies went bankrupt, Zhang decided to jump into mining. \"I saw an opportunity to leverage my Chinese language skills and cultural background to become one of the earliest and largest overseas customers of Chinese ASIC manufacturers,\" said Zhang, who was born in America but spent his early childhood in Beijing and Shenzhen. For the next four years, he sourced gear and institutional knowledge from China, ultimately scaling up a site in Montana to become the largest bitcoin mining facility in North America. Zhang has since brought that same cavalier attitude to Foundry, a mining firm tucked under Barry Silbert's crypto empire. In May 2020, bitcoin miners suffered two big blows: Much of the world shut down as Covid cases spiked and the most recent halving had just slashed the mining reward from 12.5 to 6.25 bitcoin per block mined. Zhang and the team at Foundry shrugged off the double whammy of blackswan events and spent hundreds of millions of dollars on its mining business, deploying tens of thousands of machines. By Nov. 2021, bitcoin hit an all-time peak of nearly $70,000. But the stakes are higher this time around.\n\nBitcoin miners are barreling toward the \"halving\" — a major market-making event that some fear will be a death knell to many in the industry. It happens roughly every four years and refers to an inflation-curbing schedule baked into bitcoin's code where the reward for mining a new block of transactions gets cut in half. Historically, it also coincides with the start of a bull run in the price of cryptocurrencies. Whereas traders eagerly await the halving, hoping for a potential spike in bitcoin's price, it represents a direct hit to revenues for miners, as they will receive 50% less bitcoin for every block they verify. In a capital-intensive industry with already tight margins, the reduced reward has the potential to prove apocalyptic for some operators. \"This is the ultimate test for miners,\" said Zhang, Foundry's senior vice president of business development. \"Some may not make it through; some may. But I feel confident that if they work with us, and work with other strong actors, they may have a good chance to survive this.\" When the halving takes effect in Apr. 2024, the reward for miners will drop to 3.125 bitcoin, or around $83,000. By comparison, the first blocks of bitcoin mined in 2009 carried a reward of 50 bitcoin. Without a commensurate surge in bitcoin's price to counterbalance the diminished block rewards, many mining outfits — especially those burdened by rising energy costs, paying down on machines bought at peak pricing in 2021 — could get obliterated overnight. But rather than seeing the 2024 halving as an extinction-level event, Foundry is expanding its operations — diving into machine sales, on-site deployment, and logistics. FoundryX is a marketplace for buying and selling miners, both new and used — while their recently unveiled logistics arm deals in the deployment and shipment of miners across state lines and international borders. Managed site services is another program newly debuted where, for its U.S. customers, Foundry will help staff and manage miners on-site. \"Foundry is in this for the long haul,\" said Zhang. \"We're taking a long-term bet on bitcoin and on the fact that bitcoin mining will survive and will bounce back even stronger.\" After China launched a fresh campaign against bitcoin mining in 2021, much of the industry migrated west to the U.S. Since then, some states have battled it out to attract mining companies, while others have actively legislated against them. The controversy goes to energy consumption. Mining at-scale involves data centers packed with highly specialized computers that crunch math equations in order to validate transactions and simultaneously create new tokens. It requires expensive equipment, some technical know-how, and a lot of electricity. Whereas places like Texas and Wyoming welcome the trade, New York lawmakers have created rules designed, in part, to keep miners out. A mining pool lets a single miner combine its hashing power with thousands of other miners all over the world. Even though some miners opt to hide their geographic footprint with a virtual private network, pools still function as a useful gauge of the general geographic spread of the mining industry. Foundry opted to show states even with small amounts of hashrate — an industry term used to describe the computing power of all miners in the bitcoin network — to demonstrate that mining is happening across the country on the Foundry USA Pool.\n\nWhinstone CEO Chad Harris takes CNBC on a tour of the largest bitcoin mine in North America.\n\nThe new data also confirms that Texas has cemented its position as the crypto capital of the United States, as miners flock there for abundant clean energy and a permissive regulatory environment. Texas made up 8.43% of the hashrate in the U.S. as of the end of 2021, and that percentage has jumped to 28.50% as of July 27, 2023 — though Foundry notes that the data was aggregated during a period of heavy curtailment in July, so Texas's percentage of actual hashrate is even greater than what's reflected on their latest map. Zhang added that Texas's growth in Foundry's map also had to do with the fact that the firm took on more clients there in the past two years. Given that the U.S. is currently the world leader in terms of its share of the collective hashrate of the bitcoin network, that makes Texas the bitcoin capital of the world. Texas has grown to dominate bitcoin mining partly because of support from local authorities and the operator of the Texas energy grid, ERCOT. ERCOT has historically struggled with fluctuating energy prices and sporadic service, so it strikes deals with flexible energy buyers like bitcoin miners to help keep excess energy online during low-demand cycles, then offers incentives for miners to stop their work, allowing that excess energy to flow back to the grid when demand is high. Research from Castle Island Venture's Nic Carter and a collective of other industry practitioners including Lancium's Shaun Connell and the former interim chief of ERCOT, Brad Jones, found that over the past decade, instances of negative pricing surged considerably, accounting for more than 6% of all hours in 2022 across wholesale markets in the U.S. The research paper went on to note that negative priced power may increase further in Texas, in particular, given that the state is rapidly onboarding wind and solar to its grid. Those conditions are ideal for bitcoin miners.\n\nwatch now\n\n\"All you have to do is pay the miners slightly more than what they would have made mining for bitcoin that hour,\" said bitcoin mining engineer Brandon Arvanaghi, who now runs Meow, a company that enables corporate treasury participation in crypto markets. Arvanaghi calls the setup a \"a win-win.\" For years, Riot has been powering down operations at its Rockdale mine, about an hour from Austin, to help ease the burden on the state's grid. In July, for instance, bitcoin miner Riot Platforms raked in more than $31.7 million to keep its mining operations offline — $24.2 million came from energy sold back to the ERCOT grid and the other $7.4 million came via demand response credits. \"August was a landmark month for Riot in showcasing the benefits of our unique power strategy,\" said Jason Les, CEO of Riot, in a recent press release. \"The effects of these credits significantly lower Riot's cost to mine Bitcoin and are a key element in making Riot one of the lowest cost producers of bitcoin in the industry.\" Even during the bear market, Texas miners are building out, buying new sites and fresh fleets of hardware. Riot Platforms, for example, has aggressive expansion plans in place in other parts of the state, including Navarro and Milam counties. \"Riot's ability to source such a significant expansion opportunity in Texas exemplifies the Company's partnership-driven approach with all stakeholders, including the Company's business partners, ERCOT, and all levels of government, to commit to sustainable economic development,\" Les said of the expansion plan. Bitdeer, which operates its biggest facility four-tenths of a mile down the road Riot's mine in Rockdale, is also in expansion mode. The mining company was spun off from Chinese bitcoin mining giant Bitmain and went public via SPAC earlier this year. Meanwhile, Cipher Mining purchased 11,000 new mining machines for its facility in Odessa, Texas, while Foundry has acquired mining sites from the bankruptcy estate of Compute North in Minden, Nebraska, and Big Spring, Texas.\n\nElsewhere in the U.S., previous leaders in bitcoin mining saw their influence wane. In the last two years, Foundry's dataset shows that Georgia — a miner-friendly state offering competitive pricing on electricity, as well as a mix of renewable power sources including solar and nuclear, has seen its share of the U.S. hashrate plunge from 34.17% to 9.64%. The drop was driven by a combination of factors, including Texas's growth overall and Foundry's expanding operations in particular, as well as by measurement differences — one large miner in the state declined to have their activity included in this year's map. Though its growth was stagnant compared to the previous study, New York's share of the U.S. hashrate declined from 9.53% in 2021 to 8.75%, driven mainly by the state's moratorium against new miners issued in Nov. 2022. Other mining winners that showed notable growth during the period included New Hampshire and Pennsylvania, while Nebraska, North Carolina, Kentucky, Oklahoma and Washington all saw significant drops. Despite the plunge in bitcoin valuations since 2021, as well as increasing regulatory scrutiny from the Securities Exchange Commission and other agencies looking to regulate some cryptocurrencies like securities, the total U.S. hashrate — a proxy for industry competition — has more than doubled since the end of 2021. According to an analyst note from JPMorgan Chase on Sept. 1, the bitcoin network's overall hashrate set a record high for the eighth consecutive month in August. Foundry says the rise is driven in part by institutions entering the space. JP Morgan researchers also note that the mining business has gotten less lucrative — miners make an average of $66,400 per day per exahash of mining capacity, versus nearly $342,000 at bitcoin's peak in Nov. 2021. Meanwhile, the aggregate market cap of the 14 U.S.-listed miners tracked by the bank has plunged below $10 billion. Riot was the biggest loser in August, down 39%, while Bitdeer was the biggest winner, up 30%."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTI1L21pY2hhZWwtc2F5bG9yci1zLW1pY3Jvc3RyYXRlZ3ktbXN0ci1idXlzLW1vcmUtYml0Y29pbi1idGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Michael Saylor’s MicroStrategy (MSTR) Buys More Bitcoin (BTC) - Bloomberg",
        "content": "MicroStrategy Inc., the company best known as the largest publicly traded holder of Bitcoin, added to its hoard of the world’s largest cryptocurrency in the past two months, using stock sales to help fund the almost $150 million worth of purchases.\n\nThe enterprise-software maker co-founded by crypto proponent Michael Saylor bought 5,445 Bitcoin between Aug. 1 and Sept. 24 at an average price of $27,053 per token, according to a filing Monday with the US Securities and Exchange Commission. The purchases came as Bitcoin traded in a range of $25,000 to $30,000; the coin is up almost 60% this year."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjUvbWljcm9zdHJhdGVneS1wdXJjaGFzZWQtMTUwbS1vZi1iaXRjb2luLXNpbmNlLWF1Z3VzdC_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzI1L21pY3Jvc3RyYXRlZ3ktcHVyY2hhc2VkLTE1MG0tb2YtYml0Y29pbi1zaW5jZS1hdWd1c3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "MicroStrategy Bought 5,445 Bitcoin for $150M Since August - CoinDesk",
        "content": "The company said it had issued and sold a total of 403,362 MSTR shares to fund the purchase. In August, MicroStrategy said it may raise up to $750 million by selling more stock, and plans to use some of the proceeds to buy more bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tY29pbmJhc2Utc2F0b3NoaS1uYWthbW90b9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin held by Coinbase rivals Satoshi Nakamoto's in size - Blockworks",
        "content": "Crypto exchange Coinbase currently holds over $25 billion in bitcoin, establishing itself as the world’s largest bitcoin custody entity, with nearly 5% of all bitcoin in circulation.\n\nCoinbase’s holdings are roughly equivalent to the stash held by Satoshi Nakamoto, the enigmatic individual or group credited with creating bitcoin and authoring the original white paper in 2008, according to Arkham Intelligence.\n\nThe identified sum was spread across 36 million deposit and holding addresses used by Coinbasein, Arkham reported in a Saturday post on X. The largest cold wallet identified held about 10,000 bitcoin.\n\nLoading Tweet..\n\nBut the blockchain analytics company suggested that the exchange probably holds thousands more bitcoins that have not been categorized yet, based on latest financial data from Coinbase. Ongoing analysis will aim to uncover these additional addresses.\n\nCoinbase’s custody of ether (ETH) is significantly smaller when compared to its bitcoin holdings. As per Arkham’s data, the exchange held about $2.6 billion in ether.\n\nThe fact that Coinbase may hold as much bitcoin (BTC) as Nakamoto is notable because it is widely believed that the mysterious bitcoin creator mined an impressive amount of bitcoin, with estimates ranging from 600,000 BTC (equivalent to $13 billion) to as much as 1.1 million BTC ($23.8 billion) during the cryptoasset’s early years.\n\nTracking the whereabouts of all these bitcoins is considered somewhat challenging due to their dispersion across numerous addresses.\n\nShould the upper estimate prove accurate, Nakamoto would find themselves among the top 50 billionaires globally, closely trailing Chanel chairman Alain Wertheimer.\n\nThe identity of the Bitcoin creator has remained unverified, although one public profile which claimed association with Nakamoto indicated a location in Japan.\n\nIn Nakamoto’s writings, they variously used both American and British English spellings, as well as idiomatic expressions. This has led some to question whether the inventor’s claimed Japanese identity is accurate.\n\nThere have also been observations regarding the timestamps on Nakamoto’s comments, which have led some to speculate that they might not have been located in Japan while working on Bitcoin.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnJpYWludGVsLmNvbS9hcnRpY2xlLzJjOGt0dmZpMDQxbTdieG4xZ2x4Yy9pcy10aGUtc3BvdC1iaXRjb2luLWV0Zi1pbmV2aXRhYmxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Is the Spot Bitcoin ETF Inevitable? - RIAIntel.com",
        "content": "In October 2021, the SEC approved the first Bitcoin futures ETF and many experts thought a spot Bitcoin ETF was just a matter of time. However, the SEC has rejected more than 30 applications for a Bitcoin ETF since then.\n\nRic Edelman thinks this year might be different.\n\nIn June, BlackRock, the world’s largest money manager with more than $8 trillion in assets under management, submitted a spot bitcoin ETF application to the SEC. Eight other fund companies quickly filed similar applications, with the hope that they had sufficiently addressed the SEC’s concerns.\n\nEdelman, founder of the Digital Assets Council of Financial Professionals (DACFP) and founder of one the nation’s largest RIAs, sat down with RIA Intel to discuss a Bitcoin Spot ETF and what advisors should know.\n\nAnswers have been edited for clarity and length.\n\nInvestors and advisors already have access to Bitcoin and a couple of years ago, a futures Bitcoin ETF was approved. What makes a spot Bitcoin ETF so important and why should advisors be paying attention to it?\n\nThe spot Bitcoin ETF is important because ETFs are the most popular investment vehicle in the world. Most advisors use ETFs and many use them exclusively. They are very popular with clients for all the reasons everybody knows. They’re the cheapest investment vehicle available. They are highly liquid, highly transparent, and they allow you to build a diversified portfolio and manage it easily with rebalancing and dollar cost averaging, and tax loss harvesting. More easily than you can with virtually any other vehicle, and this is why 77 percent of advisors say that they’re waiting for an ETF to become available before they’re going to allocate to Bitcoin for their clients. There is already a futures ETF available but very few advisors recommend futures to their clients. They are expensive. They are cumbersome. They are complicated, and they’re far riskier than the spot asset. A futures ETF is not a substitute for a spot bitcoin ETF and since so many advisors are anxiously waiting for this, when it becomes available, there could easily be hundreds of millions of dollars, even tens of billions flowing into Bitcoin, which would have a dramatic impact on the price.\n\nSo, it makes sense to advisors but why would it make sense for investors? They can already directly own these assets.\n\nTwo-thirds of investors obtain their investments through their advisors. And if their advisor isn’t recommending a Bitcoin ETF, the investor isn’t going to access it in any other way. So, while a client certainly could go buy Bitcoin on their own, they aren’t likely to do so because they are depending on their advisor to handle this for them.\n\nWhat are the risks with investing in a spot Bitcoin ETF?\n\nThe primary risk is the risk of owning Bitcoin itself. Bitcoin is a relatively new asset. It is highly controversial. It has experienced substantial, even massive levels of volatility in the past, along the way to becoming the most profitable investment in history. Since inception, it’s grown 40,000,000 percent. That’s never going to happen again. But many believe that Bitcoin could still grow three times, five times over the next three years or so. So, there are volatility risks. There are risks to market demand. There are regulatory risks because the SEC has not yet issued regulations governing Bitcoin. So, the very high profit potential is matched by high levels of risk. This is why it is highly likely that most advisors will allocate very small amounts to client portfolios, 1 percent, 2 percent, or 3 percent allocations. This way you control the risk while allowing yourself to enjoy the potential returns.\n\nThe SEC has come down against crypto multiple times and this year has taken a lot of action that signaled\n\nThe SEC in the past has raised concerns about custody and price manipulation. The industry has resolved the SEC’s concerns about custody, and the remaining issue today is price legitimacy. The industry has responded, with BlackRock offering a surveillance approach that many believe will satisfy the SEC: that the price of Bitcoin that the ETF relies on is the true price of Bitcoin and not subject to manipulation or undue volatility. There is widespread optimism that all of these applications which contain a surveillance methodology will satisfy the SEC and lead to ultimate approval.\n\nIs that optimism warranted considering the SEC’s statements about crypto?\n\nMany believe that it is for three reasons.\n\nOne, we’re talking only about Bitcoin. We aren’t talking about any other coins or tokens. The SEC has stated that the vast majority of coins and tokens are securities and are not being properly registered under existing securities laws. That does not apply to Bitcoin. The SEC has said that Bitcoin is not a security. It’s the only digital asset that the SEC has made that statement about.\n\nSecond, for the very first time BlackRock filed an application for a spot Bitcoin ETF. BlackRock has never done that before. Many believe that BlackRock would not have done this if it did not have the confidence that it would gain SEC approval. Of Blackrock’s 575 ETFs, only once has it had an application rejected by the SEC.\n\nAnd third, the SEC lost the lawsuit that was filed against it by Grayscale. The SEC had rejected Grayscale’s application and Grayscale sued and won. The court ruled that the SEC was acting capricious and arbitrary in its denial of Grayscale’s application because the SEC had said yes to futures Bitcoin ETFs, but it said no to the spot ETF. That makes no sense. That’s saying you can eat Ketchup, but you can’t eat tomatoes. If the derivative is acceptable, then the underlying security must be acceptable. The court ordered the SEC to vacate its refusal. Based on this, we believe Gray Gensler no longer has a legitimate reason for opposing and rejecting these applications.\n\nWhere do we stand today? What are the next steps?\n\nThe SEC has 45 days from the filing of the application to approve it. The SEC has the right to delay approval for an additional 240 days. And that is what it has done in every case. The earliest applications will hit their 240-day deadline in January. So many people expect that the SEC will issue a ruling before that date occurs. It could come as early as tomorrow. This isn’t a complicated issue at this point. The surveillance question is the only issue on the table and it is not likely to take the SEC the full 240 days to resolve it. The SEC is also dealing with the aftermath of the Grayscale lawsuit. The SEC is also under severe criticism from Congress for its handling of these ETF applications today. So, there’s a lot of pressure that the SEC is experiencing to move on with this issue.\n\nConsidering everything that you’ve outlined about what the industry has done to address the SEC’s concerns, do you think the SEC will approve it?\n\nI am hopeful that the SEC will approve at least one of the applications but there is no certainty. Gary Gensler’s opposition is clear and he could very easily create delays. For example, the SEC the SEC could go back to the Grayscale and tell them that in light of the court ruling, they need to refile its application which would restart the 240-day clock. The SEC could also appeal the court’s ruling, which could delay further action for a year or more. The SEC could even take the futures Bitcoin ETFs off the market, which would seemingly satisfy the court which objected to the fact that the spot ETFs and the futures ETFs were being treated differently. The SEC can’t say yes to one and no to the other and everybody is hoping they will say yes to both, but they could frankly say no to both.\n\nIf the SEC rejects these applications, will that mean the end for the spot Bitcoin ETF?\n\nThe spot Bitcoin ETF is inevitable. The only issue is when. Canada, the United Kingdom, Europe, and Australia all have spot Bitcoin ETFs. The United States is looking increasingly foolish in its failure to provide these investments to American investors. It is not for the government to decide what people should or should not invest in, that’s for the industry to decide. It is the government’s job to make sure that the investments are operating appropriately under the law. We may have to wait for Gary Gensler’s term of office to expire in 2026.\n\nOne of the reasons that Gary Gensler has voiced opposition to the ETF is that he says he’s trying to protect the American investor. What he fails to realize is that the average investor who has an advisor is not getting assistance from their advisor with Bitcoin because there is no ETF that the advisor can provide. This is forcing investors to search for a way to buy Bitcoin. Most investors don’t know how to do this. The FBI says that 46,000 Americans have lost more than a billion dollars to crypto scams over the past two years. That wouldn’t have happened if those consumers had relied on their financial advisors. So, we don’t know whether Gensler will say yes tomorrow or if his successor will say yes in three years, but these ETFs will inevitably come onto the market. The longer it takes, the higher Bitcoin’s price will go, and the more harm investors will suffer by these delays.\n\nHaving founded what is today one of the large RIAs and having spent your career as a financial advisor, why did you pivot towards Bitcoin and crypto?\n\nMy goal throughout my career has been to provide our clients with the advice they need to help them create wealth. I am convinced that blockchain and digital assets represent the greatest wealth-building opportunity of this decade and advisors need to understand this. They need to understand how the technology works and how to fit these investments into a diversified portfolio so that they can benefit their clients and help them achieve their goals."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FuY2hvcndhdGNoLXJhaXNlcy0zbS10by1zb2xpZGlmeS1iaXRjb2luLWN1c3RvZHktYW5kLWluc3VyYW5jZS1wbGF0Zm9ybS0zMDE5Mzg0NjguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "AnchorWatch Raises $3M to Solidify Bitcoin Custody and Insurance Platform - PR Newswire",
        "content": "AnchorWatch's Trident Vault software provides a protocol native custody solution to owners of Bitcoin, backed by regulated high-quality insurance\n\nNASHVILLE, Tenn., Sept. 26, 2023 /PRNewswire/ -- Today, AnchorWatch , an insurer that covers commercial entities holding Bitcoin, announced a $3M funding round led by Ten31 with participation from Axiom BTC, Timechain, Bitcoin Opportunity Fund, UTXO Management (the asset management arm of Bitcoin Magazine and host of the Bitcoin Conference), and others. AnchorWatch's proprietary Trident Vault software provides a protocol native custody solution to owners of bitcoin, backed by regulated high-quality insurance.\n\nAnchorWatch\n\nWith this latest investment, AnchorWatch will be in position to complete all regulatory and capital requirements needed to deliver Trident Vault to customers and start selling policies. Additionally, AnchorWatch will undergo security audits by a number of credentialed firms to further solidify Trident Vault as a sound and viable custody solution for enterprise use.\n\nTrident Vault is the first bitcoin vault designed specifically for commercial use and integrating dispersed workflows for remote teams. It introduces key holder seniority and time-locked spending conditions to institutional bitcoin custody, bringing compliance and governance on-chain.\n\n\"Bitcoin owners are still faced with the binary choice between self-custody and third-party sole custodians,\" said Robert Hamilton, cofounder and CEO at AnchorWatch. \"In the case of the latter, high-risk trading strategies, or worse, blatant fraudulent activities have resulted in catastrophic losses for customers. Thus, they are hesitant to rely on the commercial key holder to deliver the services promised. AnchorWatch makes owning and holding the bearer asset practical, safe, easy, secure and verifiable.\"\n\nAnchorWatch achieves its superior collaborative custody in two ways. First, their Trident Vault enables supported custody by holding a minority of keys and employing protocol-level governance and compliance. With layered security, Trident Vault allows bitcoin to be custodied in a method that suits its technology by dispersing custody physically and among unrelated entities, reducing risks of loss from catastrophic events like fires and floods, but also from theft by internal and external bad actors.\n\nSecondly, AnchorWatch embeds regulated property insurance on the bitcoin in a Trident Vault itself. This guarantees that assets are insured in the case of catastrophe via regulated and collateralized property insurance. Because Trident enables superior security during custody, AnchorWatch is able to offer insurance at affordable rates.\n\n\"AnchorWatch is building both the technical infrastructure to advance bitcoin's potential as programmable money and the credentialed legal/financial infrastructure for bitcoin to be held by commercial institutions via its insurance offerings,\" said Jonathan Kirkwood, Managing Partner at Ten31. \"This is a pivotal step that directly aligns with our mission at Ten31 to establish bitcoin as a viable asset for institutions, and investing in the companies at the forefront of innovating in the ecosystem.\"\n\nAnchorWatch caters to family trusts, funds and pensions, family and multifamily offices, bitcoin miners and mining pools, and any other businesses that hold bitcoin. The Trident Vault is particularly applicable to estate and inheritance planning purposes. It can be utilized by estate attorneys, investment advisors, or technical advisors who advise multiple clients in the custody of their bitcoin.\n\nTo learn more about AnchorWatch, visit https://www.anchorwatch.com/ .\n\nAbout AnchorWatch\n\nAnchorWatch is an insurance provider, operating in the United States as a managing general agent (MGA) and captive insurer, building bespoke insurance products and technology designed for Bitcoin from the ground up. AnchorWatch property and casualty insurance policies are designed for individuals and commercial entities and cover Bitcoin stored in approved cold storage, facilitated via its robust Trident Vault software. Trident Vault combines the benefits and control of self-custody with the safety and governance of supported-custody in a way that brings new confidence to storing Bitcoin, all backed by high-quality insurance coverage.\n\nAbout Ten31\n\nTen31 is the leading platform investing in companies building infrastructure and technology in the Bitcoin ecosystem. With a footprint in Nashville and Austin, Ten31 seeks to support the ecosystem's most promising founders and companies, leveraging its deep understanding of Bitcoin, extensive experience, and broad reach to create value for its partners. Since the fund's inception, Ten31 has directed more than $100 million in equity to companies building on Bitcoin and the Lightning Network. For more information, visit www.ten31.vc\n\nContact\n\nInkhouse for Ten31\n\n[email protected]\n\nSOURCE Ten31"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzA5LzI1L21pY3Jvc3RyYXRlZ3ktYnV5cy0xNDdwb2ludDMtbWlsbGlvbi1iaXRjb2luLXRvdGFsLWhlbGQtNHBvaW50NjgtYmlsbGlvbi1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "MicroStrategy buys $147.3 million in bitcoin, bringing total held to $4.68 billion - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nMicroStrategy buys $147.3 million in bitcoin, bringing total held to $4.68 billion: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Brett Harrison, former FTX U.S. president and CEO of Architect, explains the new company's focus on investment tools for digital assets and traditional markets."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi91cy1ob3VzZS1sYXdtYWtlcnMtcHVzaC1zZWNzLWdlbnNsZXItdG8tYXBwcm92ZS1zcG90LWJpdGNvaW4tZXRmLWltbWVkaWF0ZWx5L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi91cy1ob3VzZS1sYXdtYWtlcnMtcHVzaC1zZWNzLWdlbnNsZXItdG8tYXBwcm92ZS1zcG90LWJpdGNvaW4tZXRmLWltbWVkaWF0ZWx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "U.S. House Lawmakers Push SEC’s Gensler to Approve Spot Bitcoin ETF ‘Immediately’ - CoinDesk",
        "content": "On the eve of his scheduled appearance before the House Financial Services Committee, four members of that panel sent Gensler a letter contending that a spot bitcoin ETF is “indistinguishable” from the crypto futures ETFs for which the agency has already granted its blessing. Because of that, the agency should sign off on applicants requesting SEC approval, such as Fidelity, BlackRock’s iShares and Grayscale Investments, which shares CoinDesk’s parent company, Digital Currency Group."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi9zZWMtZXh0ZW5kcy1hcmstZ2xvYmFsLXgtZXRmLWRlYWRsaW5lcy1hcy1nb3Zlcm5tZW50LXNodXRkb3duLWxvb21zL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi9zZWMtZXh0ZW5kcy1hcmstZ2xvYmFsLXgtZXRmLWRlYWRsaW5lcy1hcy1nb3Zlcm5tZW50LXNodXRkb3duLWxvb21zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "SEC Extends Ark, Global X ETF Deadlines as Government Shutdown Looms - CoinDesk",
        "content": "As the federal government braces for a potential shutdown brought about by a budget impasse in Congress, the securities regulator extended its next deadlines for the two applications well before the interim deadlines arrived. The SEC has a total of 240 days to make a final decision on any application after it starts reviewing, but there are a number of potential time marks during that period in which it has to do certain things or extend the time it’s allowed."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjUvY3J5cHRvLXRyYWRlcnMtYnJhY2UtZm9yLW5lYXJseS01Yi1iaXRjb2luLWFuZC1ldGhlci1vcHRpb25zLWV4cGlyeS_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzI1L2NyeXB0by10cmFkZXJzLWJyYWNlLWZvci1uZWFybHktNWItYml0Y29pbi1hbmQtZXRoZXItb3B0aW9ucy1leHBpcnkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Crypto Traders Brace for Nearly $5B Bitcoin and Ether Options Expiry - CoinDesk",
        "content": "\"In the past month, we have seen stable markets whilst the Gamma of the September expiries has increased gradually as a function of time. The impact of an uneven distribution of Gamma amongst traders would have resulted in much more volatility as compared to what we have seen these days. Therefore, we don't anticipate strong market moves in the coming week,\" Strijers said."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vYnVzaW5lc3NkZW4uY29tLzIwMjMvMDkvMjUvZnJhdWRzdGVycy11c2VkLWEtYml0Y29pbi1hdG0tdG8tc3RlYWwtMzhrLXNoZXJpZmYtc3Vlcy10by1nZXQtaXQtYmFjay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Fraudsters used a bitcoin ATM to steal $38K; sheriff sues to get it back - BusinessDen",
        "content": "Twenty-four minutes after midnight, Gordon Goff knew that something was wrong.\n\nThe day before — Nov. 4, 2022 — there had been a phone call from San Francisco. A fraud investigator from Wells Fargo, the man said, calling with bad news. There had been a hack, the man said, and Goff stood to lose $42,000 from his account. Unless he drove.\n\nDrove from his home in rural Logan County to a Wells Fargo branch in Sterling and withdrew $42,000 in cash. If a bank teller there asked any questions, Goff was to tell them it was for home improvements. He was not to use his cellphone or talk about the hack.\n\nThen he was told to drive again, to a nondescript gas station in Sterling, feed $42,000 worth of $20 and $50 bills into a cryptocurrency ATM there, and punch in a password (8-9-8-8-5) to send it away to the man on the phone. The man who would save his bank account.\n\nAnd Goff had done it all — almost. He and his wife had withdrawn the cash, driven to Everyday Convenience at 11 a.m., and spent four-and-a-half hours sliding bills into the ATM. They stopped only because the machine filled up. It couldn’t hold more than $38,100.\n\n“I seen them put money into it, then leave, come back in and repeat,” Chaze Winters, a cashier, later told deputies. He was surprised that an older couple was using a bitcoin ATM.\n\nGoff called the man in San Francisco. Was $38,100 enough? Could the remaining balance of $3,900 be forgiven? Yes and yes, he was told. The Goffs had saved their account.\n\nNow, eight hours later, Gordon Goff knew that something was wrong. So, he called police.\n\n“This is the first time I’ve ever seen anything like this, with this amount of money,” says Lt. Bill Dolan with the Logan County Sheriff’s Office, who investigated the Goff case.\n\n“They’re just the nicest older couple that you’ve ever met,” Dolan said of Gordon and Mary Goff, who are both in their seventies. “To watch them get defrauded is just horrible.”\n\nInvestigators caught a break initially. The ATM, owned by a company called CoinFlip, is emptied on Thursdays. Nov. 4 was a Friday, so the Goffs’ money was still inside. The sheriff’s office obtained a search warrant and seized the machine the next day. CoinFlip sent a courier to open it and remove $38,100, which was then locked away in an evidence room.\n\n“We made a phone call to Homeland Security,” Dolan said, “and asked if there was any way they could help us. They came back saying, ‘Yeah, there’s not a whole lot we can do.’”\n\nThe Goffs were unwitting victims of an international cryptocurrency crime ring. An agent at the U.S. Department of Homeland Security, Donald Hilling, traced the bitcoin they bought to Singapore, where it was transferred to a crypto exchange called Kucoin. As he told Dolan, the ATM fraud that ensnared the Goffs has taken $40 million from victims to date.\n\n“Based on prior investigations we have conducted, Kucoin does not comply with U.S. (law enforcement), thus we are at the end of the investigation,” Hilling emailed him May 21. “Sorry to give the bad news, I wish we could have done more to recover their money.”\n\nThe names of the people who robbed the Goffs will most likely never be known to them. That man on the phone from San Francisco called himself Viktor Krum, almost certainly a fake name lifted from the “Harry Potter” books, in which Krum is a quiet quidditch star.\n\n“I’m not a Harry Potter fan but our DA was like, ‘His name, that’s from ‘Harry Potter!’” Dolan said, referring to 13th Judicial District Attorney Travis Sides. “I was like, ‘OK.’”\n\nThere was little that Sides could do to obtain justice for the Goffs. Homeland Security closed its case in June. The next month, Sides determined that the Goffs “were victims of theft and possibly extortion.” But he can’t charge people in Singapore that he can’t name.\n\n“That is the part of this that is so frustrating,” Dolan said by phone last week from Sterling.\n\nPolice and prosecutors still had one tactic to try though. They had an evidence bag full of those greenbacks that Gordon and Mary Goff spent hours feeding into the CoinFlip ATM. So, Sides ordered the sheriff’s office to return that $38,100 to the couple on July 13.\n\n“They would seem to have the best ownership claim…as they would have been entitled to $38,100 in restitution had the suspects been identified,” he wrote in a memo. (That and other reports cited in this article were obtained from Logan County via records requests.)\n\nSides’ order met resistance from CoinFlip, which believes that money deposited in a CoinFlip ATM belongs to CoinFlip. On Sept. 13, Logan County Sheriff Brett Powell sued CoinFlip in a Sterling court and asked Judge Stephanie Gagliano to resolve their dispute. Gagliano ordered the money to be placed in a court registry for safekeeping until she can.\n\nCoinFlip’s lawyers have not yet responded to the lawsuit and company spokespeople did not respond to BusinessDen’s requests to discuss it. CoinFlip has 123 ATMs in Colorado, according to its website. Most are in the Denver area, including 17 within city limits.\n\nThe Goffs did not answer phone calls or return voicemails and emails last week."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTI2L3NlYy1kZWZlcnMtZGVjaXNpb24tb24tYXJrLTIxc2hhcmVzLXNwb3QtYml0Y29pbi1ldGYtZmlsaW5nLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "SEC Once Again Defers Decision on ARK 21Shares Spot Bitcoin ETF Filing - Bloomberg",
        "content": "The US Securities and Exchange Commission once again delayed making a decision on whether to approve the first US exchange-traded fund that invests directly in Bitcoin.\n\nThe primary US securities regulator deferred on a filing from crypto exchange-traded-products issuer 21Shares and Cathie Wood’s ARK Investment Management, according to documents posted on its website Tuesday."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWNyZWF0b3ItY2FzZXktcm9kYXJtb3ItcGl0Y2hlcy1icmMtdG9rZW4tYWx0ZXJuYXRpdmUtcnVuZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals creator Casey Rodarmor pitches BRC-20 alternative 'Runes' - Cointelegraph",
        "content": "The inventor of Bitcoin Ordinals is proposing a new Bitcoin-based fungible token protocol as a potential alternative to the BRC-20 token standard.\n\nThe BRC-20 standard was launched in March by anonymous developer “Domo.” Within two months, the BRC-20 market cap reached $1 billion, with PEPE and ORDI among the most notable BRC-20 tokens created on Bitcoin.\n\nNew terrible idea just dropped: Runes.\n\n\n\nA worse-is-better fungible token protocol for Bitcoin.https://t.co/TPVrUvWxm8 — Casey (@rodarmor) September 25, 2023\n\nBRC-20 enables the minting and transfer of fungible tokens via the Ordinals protocol on Bitcoin. But the issue with BRC-20 tokens is that they spam Bitcoin with “junk” unspent transaction outputs, or UTXOs, argues Rodarmor.\n\nBRC-20 tokens have the “undesirable consequence of UTXO proliferation,” he explained in a Sept. 25 blog post, proposing Runes as a UTXO-based alternative.\n\n“Protocols that are UTXO-based fit more naturally into Bitcoin and promote UTXO set minimization by avoiding the creation of ‘junk’ UTXOs.”\n\nTLDR on Runes - A potential fungible token protocol for Bitcoin\n\n\n\nᚱᚢᚾᛖᛊ\n\n\n\n- Casey remains skeptical, citing \"99.9% are scams and memes,\" but recognises they don't appear to be going away.\n\n- Employs a UTXO-based system, notably simpler than BRC-20.\n\n- Uses the letter 'R' in the… https://t.co/zYP43f70gh — Franken (@ItsFranken) September 25, 2023\n\n“If this protocol had a small on-chain footprint and encouraged responsible UTXO management, it might serve as harm reduction compared to existing protocols,” Rodarmor added.\n\nUTXOs represent the amount of cryptocurrency left in a wallet following a completed transaction, where the balance is used in subsequent transactions and is stored in the UTXO database.\n\nBitcoin’s UTXO model plays a role in making Bitcoin an auditable and transparent ledger by preventing the double-spending problem.\n\nRodarmor said other fungible token protocols on Bitcoin, such as Really Good for Bitcoin, Counterparty and Omni Layer, have problems of their own.\n\nRodarmor’s problems with existing fungible token protocols on Bitcoin: Source: Casey Rodarmor\n\nWhile Rodarmor admitted 99.9% of fungible tokens are filled with scams and memes, he believes the right fungible token protocol can add value to the Bitcoin network:\n\n“Creating a good fungible token protocol for Bitcoin might bring significant transaction fee revenue, developer mindshare, and users to Bitcoin.”\n\nRelated: Ordinals still make up majority of Bitcoin txs despite price collapse\n\nIn a Sept. 25 Twitter Spaces with The Ordinals Show co-host Trevor Owens, Rodarmor said he came up with the Runes idea last week and that he wasn’t sure whether he would pursue it any further.\n\nShortly after the call, Owens floated offering $100,000 from the Bitcoin Frontier Fund to prospective developers who can get a Rune application up and running as a means to further Rodarmor’s proposal.\n\nOpen $100k investment offer in upcoming @BTCFrontierFund accelerator for first team who can get a working (not terrible) Rune indexer, issuance and/or transfer app, up live and running\n\n\n\nDon't make the tickers required to be unique, will be a shit show\n\n\n\nDM me. Serious offer. pic.twitter.com/6W0IwlhB9x — trevor.btc (@TO) September 26, 2023\n\nCointelegraph reached out to Rodarmor for comment but did not receive an immediate response.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Blockchain games aren’t really decentralized… but that’s about to change"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxlZ2FsbHktcmVjb2duaXNlZC1kaWdpdGFsLWN1cnJlbmN5LXNoYW5naGFpLWNoaW5h0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin gains legal recognition as digital currency in Shanghai, China - Cointelegraph",
        "content": "The Shanghai No.2 Intermediate People’s Court in China has reportedly recognized Bitcoin (BTC) as a unique and non-replicable digital asset while acknowledging its scarcity and inherent value.\n\nThe Chinese court released a report on Sept. 25 discussing the development of internet technologies. The report stated that with the development of internet technology, digital currencies such as Bitcoin stand out as unique and non-replicable. The report states that among a sea of digital currencies, Bitcoin is different and unique from other digital assets.\n\nThe report also sheds light on some of the unique properties of Bitcoin, including its scarcity and property attributes. The report states that Bitcoin has key currency features such as scalability, ease of circulation, storage and payment. Bitcoin continues to see global usage despite its decentralized nature and lack of central authority administration.\n\nThe latest judicial report acknowledging Bitcoin and its attributes as an asset class gives Bitcoin and other digital currencies in China more legitimacy. Despite a blanket ban on cryptocurrencies in China, legal arguments for defining bitcoins as personal property have gained a lot of traction from the local Chinese courts.\n\nThe latest recognition from one of the key courts in Shanghai comes despite the hostile attitude of the Chinese government toward Bitcoin. China imposed a blanket ban on all forms of cryptocurrency activities, including Bitcoin mining, in 2021. However, several courts in China have recognized Bitcoin and other digital assets as legal properties protected by law.\n\nRelated: China announces plans for new national financial regulator\n\nAs Cointelegraph reported on Sept. 1, a People’s Court in China released a report assessing the legality of virtual assets and analyzing the criminal law attributes of these assets. The report observed that digital assets qualify as legal property and thus are protected by the law.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: DeFi faces stress test, DoJ fears run on Binance, Hong Kong’s crypto trading: Hodler’s Digest, July 30–Aug. 5"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjYvYml0Y29pbi1iYXJlbHktaG9sZHMtMjZrLWFzLWludGVyZXN0LXJhdGUtc3VyZ2UtY29udGludWVzL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjYvYml0Y29pbi1iYXJlbHktaG9sZHMtMjZrLWFzLWludGVyZXN0LXJhdGUtc3VyZ2UtY29udGludWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Barely Holds $26K as Interest Rate Surge Continues - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvdXMtZ292ZXJubWVudC0yNTBrLWJpdGNvaW4tcHJpY2UtcHJlZGljdGlvbi10aW0tZHJhcGVyLWhhbGwtb2YtZmxhbWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "US gov't messed up my $250K Bitcoin price prediction: Tim Draper, Hall of Flame - Cointelegraph",
        "content": "Tim Draper is a prominent venture capitalist, the founder of Draper University and the creator of the Meet The Drapers television series. He invested early in Tesla, SpaceX and Coinbase and has 254,000 followers on X.\n\n“Let me get my second prediction to actually happen, and then we’ll move on to other predictions,” Tim Draper tells Hall of Flame, refusing to be drawn on price predictions for XRP and Ethereum.\n\nThis makes sense, given it’s been six years since he forecast that Bitcoin would reach $250,000 by 2022.\n\nOops! I predicted $250k in 2022. My tweet last night was missing a zero. $250k is the number! — Tim Draper (@TimDraper) April 13, 2018\n\nSpoiler alert: It didn’t.\n\nWhich is not to say it won’t happen eventually, as Draper has been pretty far-sighted in the past.\n\nBack in 2014, Draper scooped up around 30,000 Bitcoin for $19 million after the U.S. Marshals took down Silk Road. Fast forward to today, and those Bitcoin have increased 4,165% in value to be worth a whopping $810.5 million.\n\nAround the same time, he made a prediction that Bitcoin would reach $10,000 in three years, and lo and behold, it hit that mark in 2017.\n\nDraper explains that he only dropped the $250,000 prediction because people kept asking after he totally nailed his first Bitcoin price guess.\n\n“The only reason I’ve given the second prediction was that the first one was so good. I had a lot of pressure to put another one out there,” Draper declares.\n\nHe has politely requested a deadline extension on Bitcoin reaching a quarter of a million, with a timeline that would give a university lecturer a heart attack.\n\n“Give me until the end of June next year,” he says.\n\nDraper accuses the U.S. government of messing up his price prediction. He had expected the growth of blockchain to be reminiscent of the internet era, similar to when he made his earlier investments in companies like Hotmail and Skype.\n\nHe emphasizes the significant benefit that the United States reaped by maintaining a hands-off approach to overregulating the internet.\n\n“I expected a much more light touch, the way Bill Clinton was with the internet; they said, hey, we got the internet! We regulated the internet, and Bill Clinton smartly left it alone, and it was fantastic for the whole world.”\n\nI went on a rant. I actually said all these things. US Government is killing the golden goose of Silicon Valley. Regulations smother innovators. #freedom #trust https://t.co/dUk6s8nDcV — Tim Draper (@TimDraper) May 8, 2023\n\nInvesting Alpha\n\nDespite the media coverage, Draper doesn’t spend his days making predictions; in fact, his schedule is quite packed.\n\nAt 65 years old, he remains highly active, renowned as a serial investor who chucked cash early in companies like Tesla, SpaceX, Coinbase, and, well … Theranos.\n\nHe enjoys playing basketball because it energizes him and puts him in an investment mindset.\n\n“When I play basketball, I’m thinking about how I can get the defender to move one way, and then I’ll move another,” he explains.\n\nDraper claims he possesses alpha instincts both on the basketball court and in the investment world.\n\n“I’m very aggressive; if I see something I like, I go right after it,” he says.\n\n“I guess as an investor, I invest like a chess move because I’m always evaluating not just the entrepreneur or the idea. But what happens if it’s successful? how great could it be? What does the world look like then?”\n\nWhat led to Twitter Fame?\n\nDraper started with a very modest Twitter following.\n\n“I think I had one Twitter follower, and it was my mother,” he jokes.\n\nWhile you might assume that one of Draper’s investments or media appearances helped his following to skyrocket, he describes his growth as very natural, attributing it to the content he has been consistently posting over the years, which has kept people coming back for more.\n\nHe is proud of how “truly organic” his following is.\n\n“I think I have the most steady increase of Twitter followers of any influencer,” he declares.\n\nPeople behaving badly! India's government banned Bitcoin, a currency providing great hope for prosperity in a country that desperately needs it. Shame on India leadership. Pathetic and corrupt. #India #bitcoin — Tim Draper (@TimDraper) July 17, 2019\n\nWhat type of content can people expect?\n\nDraper isn’t here to clutter up his followers’ feeds with nonsense.\n\nHe’s all about adding a little sprinkle of value to their lives, and he sticks to only posting about three times a week.\n\n“I tend to post where it’s something I feel like people should see or where one of my startups has done something extraordinary, and I want to promote them,” he explains.\n\nCongratulations to Draper VC startup Otter! https://t.co/JXRXJ4af0O — Tim Draper (@TimDraper) June 29, 2023\n\nWhat content does Tim Draper like?\n\nWithin the 2,400 accounts he follows on Twitter, he relies on a select group of trusted people to keep him informed about the crypto industry.\n\nAmong his trusted crew are Gemini founders Cameron and Tyler Winklevoss, Coinbase CEO Brian Armstrong, Ripple co-founder Chris Larsen and Silicon Valley investors Brad and Bart Stephens.\n\nCongratulations and thank you to Brian Armstrong and his team @coinbase for a very successful Direct IPO. We @drapervc are thrilled to be venture investors in this leading #crypto company as it brings the old world of currency and banking together with the modern world. #Bitcoin — Tim Draper (@TimDraper) April 15, 2021\n\nTim Draper predictions\n\nDraper is backing his 250,000 Bitcoin prediction so hard that if it doesn’t hit, he’ll bow out of predictions altogether.\n\n“If it’s not $250,000 or higher, then don’t listen to me ever again on that kind of prediction,” he laughs.\n\nWhen questioned about the chances of a Bitcoin ETF getting approved, he doesn’t sound hopeful.\n\n“It might have to wait for [Republican candidate] Nikki Haley to be president,” he declares.\n\n“Maybe it’s the cushy relationship they have with banks, maybe it’s the fact that they have uncertainty about it. Maybe a lot of our government is pretty old, maybe they’re just out of touch. But they’re missing something very, very important for the good of society, and I’m hoping they all come around.”"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMjYvYXJiaXRydW0tdXNlcnMtY2FuLW5vdy10cmFkZS1iaXRjb2luLW1pbmluZy1wb3dlci13aXRoLWVhY2gtb3RoZXIv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wOS8yNi9hcmJpdHJ1bS11c2Vycy1jYW4tbm93LXRyYWRlLWJpdGNvaW4tbWluaW5nLXBvd2VyLXdpdGgtZWFjaC1vdGhlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Arbitrum Users Can Now Trade Bitcoin Mining Power With Each Other - CoinDesk",
        "content": "Some miners, however, may have excess capacity that would otherwise lie vacant. Marketplaces such as Lumerin offer the rights to this power to buyers, who get a chunk of the bitcoin rewards."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJ1eXMtNS00ay1iaXRjb2luLWZvci0xNDdtaWxsaW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "MicroStrategy buys $147M worth of Bitcoin, now holds 158K BTC - Cointelegraph",
        "content": "MicroStrategy, a business intelligence firm and major Bitcoin (BTC) investor, is sending a bullish signal to the market by announcing the acquisition of another big stash of cryptocurrency.\n\nMichael Saylor, co-founder and executive chairman of MicroStrategy, took to X (formerly Twitter) on Sept. 25 to announce a 5,445 BTC purchase by the firm. The coins were bought for $147.3 million in cash at an average price of $27,053 per BTC.\n\nAccording to a Form 8-K filing with the United States Securities and Exchange Commission, MicroStrategy and its subsidiaries acquired the amount between Aug. 1 and Sept. 24.\n\nAs of Sept. 24, MicroStrategy and its subsidiaries held an aggregate of approximately 158,245 BTC, which was acquired at an average purchase price of roughly $29,582 per coin, inclusive of fees and expenses, the filing notes. The aggregate purchase price for MicroStrategy’s total Bitcoin holdings amounts to $4.68 billion.\n\nMicroStrategy has acquired an additional 5,445 BTC for ~$147.3 million at an average price of $27,053 per #bitcoin. As of 9/24/23 @MicroStrategy hodls 158,245 $BTC acquired for ~$4.68 billion at an average price of $29,582 per bitcoin. $MSTR https://t.co/GbJtUoQfXv — Michael Saylor⚡️ (@saylor) September 25, 2023\n\nThe new purchase comes as Bitcoin has traded sideways at around $26,000 over the past few weeks. After briefly touching $28,000 on Aug. 29, Bitcoin slipped to as low as $25,000 on Sept. 11. At the time of writing, Bitcoin is trading at $26,081, down 1.9% over the past 24 hours, according to data from CoinGecko. The cryptocurrency is also down around 4% over the past seven days.\n\nRelated: Bitcoin bought by corporate giants should not be feared — Michael Saylor\n\nMicroStrategy’s latest purchase further reaffirms the company’s bullish stance on Bitcoin. The firm previously bought 12,333 BTC for $347 million in June 2023 at an average purchase price of $29,668 per coin.\n\nIn Q1 2023, MicroStrategy reported its first profitable quarter since 2020 due to a one-time income tax benefit. The company managed to retain profitability in the next quarter, reporting $22.2 million in net income in early August.\n\nMagazine: Asia Express: PEX staff flee event as scandal hits, Mt. Gox woes, Diners Club crypto"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWZhbGwtdG9uY29pbi1sZWFkaW5nLTEwMjcxMTUyMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether fall with Toncoin leading losses in top 10 cryptos - Yahoo Finance",
        "content": "Bitcoin continued to fall in Monday afternoon trade in Asia, along with Ether and all other top 10 non-stablecoin cryptos, except Tron. Toncoin was the biggest loser. Global cryptocurrency markets weakened after the U.S. Federal Reserve at its September meeting indicated another interest rate hike by the end of the year, signaling that rates will remain higher for longer than anticipated.\n\nSee related article: South Korean entertainment firm NHN to build blockchain games on Sui despite local ban\n\nTron only gainer among top 10 cryptos\n\nBitcoin lost 1.44% to US$26,182 in 24 hours to 4 p.m. in Hong Kong, bringing its weekly losses to 2%, according to CoinMarketCap data. The world’s biggest cryptocurrency was hovering above US$26,500 over the weekend but lost the support level early Monday morning.\n\nEthereum also posted losses, dropping 0.69% to US$1,580 in the past 24 hours and 3.27% on the week. The world’s second largest cryptocurrency fell below the US$1,600 support level for the first time since Thursday.\n\nEIP-4844, also known as the Ethereum Cancun Upgrade, is a proposed Ethereum upgrade that aims to improve the speed and cost-effectiveness of the Ethereum network.\n\nThe average fee on the Ethereum blockchain dropped to around US$1.15 per transaction on Saturday, the lowest level since December 2022, according to blockchain intelligence firm Santiment.\n\n“Ethereum generated US$17.9 million in fees last week, the lowest since Dec. 26. Fees have peaked out in May this year and are gradually declining, this continues to be a crucial development for Ether prices. With less than one week left in September, fees are (so far) 50% less than in August,” Markus Thielen, head of research and strategy at digital asset service platform Matrixport, wrote on Monday.\n\n“We mostly worry about Ethereum as weak fundamentals plus a lack of hype around the EIP-4844 upgrade (which should come sometime in Q4 2023) could make the blockchain slowly obsolete. Holders do not have unlimited patience and these upgrades are not fast enough and are marginal,” Thielen added.\n\nStory continues\n\nAll other top 10 non-stablecoin cryptos fell except Tron, which rose 0.41% to US$0.08434 in the past 24 hours, and gained 0.53% on the week.\n\nTotal crypto market capitalization dropped 1.05% to US$1.04 trillion, while market volume gained 51.52% to US$22.17 billion.\n\nNFT market trade mixed\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index dropped 0.62% to US$1,953.35 in 24 hours to 7 p.m. in Hong Kong, bringing its weekly losses to 2.82%.\n\nForkast’s Ethereum and Polygon indexes also dropped while Solana index rose.\n\nTotal NFT sales volume gained 6.83% to US$9,746,899, while the number of NFT buyers increased 5.93% to US$48,312, according to CryptoSlam data.\n\nAmong blockchains, the Ethereum network topped rankings, gaining 33.47% to US$4.7 million. Polygon and Mythos blockchains ranked second and third respectively.\n\nPolygon-based DraftKings topped rankings among collections, but dropped 30.06% to US$1.04 million.\n\nMost global equities drop\n\nImage: Envato Elements\n\nMajor Asian equity markets dropped on Monday. China’s Shanghai Composite, the Shenzhen Component Index, South Korea’s Kospi, and Hong Kong’s Hang Seng declined, while Japan’s Nikkei 225 strengthened at the end of trading hours.\n\nU.S. stock futures were down as of 8 p.m. in Hong Kong on Monday. The Dow Jones Industrial Average futures, the S&P 500 futures as well as the Nasdaq 100 Futures were all in the red.\n\nThe U.S. central bank on Wednesday kept its interest rates unchanged between 5.25% and 5.5%, but revised its economic projection to indicate one more interest rate hike by the end of 2023. It also projects slower-than-expected rate cuts throughout 2024.\n\nMeanwhile, Amazon.com said Monday it will invest as much as US$4 billion in an attempt to become a major player in generative artificial intelligence (AI).\n\n“Amazon’s investment into a ChatGPT rival reinforces why almost all investors should have some AI exposure in their investment mix,” Nigel Green, founder and chief executive of financial management group deVere, said in an emailed statement.\n\n“This tech has the potential to disrupt existing industries or create entirely new ones. Early investors are likely to benefit from the exponential growth that often accompanies the adoption of such technologies. As these innovations gain traction, their valuations could skyrocket, resulting in significant returns on investment,” Green added.\n\nEuropean bourses weakened on Monday morning in Europe with the benchmark STOXX 600 and Germany’s DAX 40 lower. Traders continue to assess central bank activities from last week. Francois Villeroy de Galhau, France’s central bank governor, told CNBC that it is “premature” to bet on an interest rate cut by the European Central Bank.\n\n“We should remain at this level for a sufficiently long period of time. Betting now on the next cut is probably premature,” de Galhau said.\n\n(Updates with equity section.)"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWZsYXQtbWljcm9zdHJhdGVneS1hZGRzLTAxMzAyOTAxMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether flat; MicroStrategy adds to Bitcoin holdings - Yahoo Finance",
        "content": "Bitcoin traded flat below US$26,300 Tuesday morning in Asia. Ether also edged up but remained below the US$1,600 mark. Most other top 10 non-stablecoin cryptocurrencies, while recording marginal gains in the past 24 hours, logged losses for the week. Cardano’s ADA led the winners. Cryptos, along with global equities, face pressure from interest rate hike concerns and rising treasury yields. U.S. stock futures were flat during early morning trading in Asia after Wall Street closed higher on Monday. That rise broke a four-day losing streak triggered by hawkishness from the U.S. Federal Reserve.\n\nLosses for short-term Bitcoin holders\n\nBitcoin was little changed as of 07:40 a.m. in Hong Kong, trading at US$26,276.60 for a weekly loss of 1.78%, according to CoinMarketCap data. The world’s largest cryptocurrency dropped to US$26,011.47 on Monday evening, the lowest price since Sept. 13.\n\nEther also remained flat. It edged up 0.35% to US$1,586.87 but is down 3.06% for the past seven days. The token touched a high of US$1,595.84 on early Tuesday morning, but failed to move above the US$1,600 resistance level.\n\n“Cryptocurrency market sentiment remains weak, amid declines in global stock markets, a strong dollar and rising yields putting pressure on risk assets,” Hani Abuagla, senior market analyst at online trading broker XTB MENA, said in an emailed comment.\n\n“The economic policies enacted by central banks, particularly the Federal Reserve, have redirected capital towards less risky investments such as government bonds,” said Matteo Greco, research analyst at Canada-based digital asset investment firm Fineqia International, in an emailed note.\n\n“These bonds currently offer an attractive risk/reward ratio, offering a passive income while mitigating portfolio risk,” Greco added.\n\nCiting data from blockchain tracker Glassnode, XTB MENA’s Abuagla noted that over 97.5% of addresses owned by short-term Bitcoin holders are posting losses — an 11 month high. Short-term holders (STH) are those traders that have bought Bitcoin over the last 155 days.\n\nStory continues\n\n“This may mean that the pressure to sell BTC at a loss in the STH pool may be growing, as evidenced by the previous pattern of on-chain behavior (when the price fell below the average STH purchase price of BTC),” said Abuagla.\n\nMeanwhile, Abuagla said that a drop in Bitcoin prices could be a “contrary signal” indicating an oversold market. That may present a potential accumulation opportunity for long-term investors, he added.\n\nMicroStrategy, the U.S.-based analytics firm founded by Michael Saylor, revealed on Monday it purchased nearly US$150 million worth of Bitcoin from Aug.1 to Sept. 24 at an average price of about US$27,053 per coin.\n\nAs of Sept. 24, MicroStrategy held around 158,245 bitcoins, which were acquired at an aggregate purchase price of roughly US$4.68 billion.\n\n“While this is bullish and shows continued faith and strong buying pressure, crypto markets didn’t really react. Ironically, MicroStrategy’s buying announcements have historically been followed by mild pull-backs instead of rises, and the crypto space might be cautious about buying,” said Justin d’Anethan, head of Asia-Pacific business development at Belgium-based crypto market maker Keyrock.\n\n“The whole thing happens in an environment where investors are still digesting the Fed’s speech hinting at higher rates for longer, and therefore presumed lower valuations for most risk assets,” added d’Anethan.\n\nMost other top 10 non-stablecoin cryptocurrencies posted gains for the past 24 hours. Cardano’s ADA led the winners. The token rose 1.10% to US$0.2453 but lost 2.49% for the week.\n\nToncoin was the only top-10 non-stablecoin token to record a 24-hour loss. It dropped 1.83% to US$2.16 for a weekly loss of 10.28%.\n\nThe total crypto market capitalization edged up 0.28% in the past 24 hours to US$1.05 trillion, while trading volume rose 40.50% to US$24.94 billion.\n\nU.S. equities drop, China’s property woes continue\n\nImage: Getty Images\n\nU.S. stock futures were trading lower as of 09:50 a.m. in Hong Kong. The Nasdaq led the losses with a 0.40% drop. Wall Street closed higher Monday following a sharp decline Friday.\n\nMost major Asian stock indexes were down Tuesday morning. Hong Kong’s Hang Seng, South Korea’s Kospi and Japan’s Nikkei 225 all dipped. The Kospi led the declines with a 1.14% drop. China’s Shanghai Composite edged up 0.14%.\n\nBoth the S&P and Nasdaq indexes last Friday logged their biggest weekly losses since March. That followed U.S. Federal Reserve comments last week indicating it will keep interest rates higher for longer.\n\nChuck Carlson, chief executive officer at the U.S.-based investment advisor Horizon Investment Services, told Reuters Tuesday that he sees a “tug of war” dynamic playing among investors. There are now two groups, he said. Those concerned by Fed hawkishness and “bulls wondering maybe we have seen the correction and we can start to build from these levels higher.”\n\nKey economic data releases this week include the U.S. second-quarter gross domestic output (GDP) and personal consumption expenditure price index (PCE). Both are expected Thursday. Analysts project an acceleration in U.S. GDP growth and a slowdown in core PCE, according to Investing.com.\n\nThe benchmark U.S. 10-year treasury yield rose on Monday to close at 4.542%. That was the highest closing price since October 2007.\n\nThe Fed meets on Nov. 1 to make its next decision on interest rates. The CME FedWatch Tool predicts a 81.5% chance of no interest rate hike in November, up from 74.6% on Monday. It also gives a 60.9% chance of another pause in December, up from 59.3% on Monday.\n\nMeanwhile, the crisis at China’s real estate giant Evergrande Group worsened Monday. The firm’s mainland China unit, Hengda Real Estate Group Co., defaulted on principal and interest payments totaling about US$547 million due Sept. 25. The firm’s shares dropped 21.8% on Monday to their lowest closing level since Sept. 5.\n\nEvergrande filed for U.S. bankruptcy protection in August 2023 after its default on a dollar bond in December 2021 triggered widespread turmoil in the Chinese real estate industry.\n\n(Updates with equity section.)"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXRyZWFkLXdhdGVyLXUtMDE0NzQ5MTI4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether tread water; U.S. equities slide with mega-cap tech giants leading the declines - Yahoo Finance",
        "content": "Bitcoin dipped on Wednesday morning in Asia to trade range-bound below US$26,300. Ether edged higher but failed to reclaim the US$1,600 mark. Other top 10 non-stablecoin cryptocurrencies traded mixed in the past 24 hours, with Binance’s BNB token leading the winners. The Open Network’s (TON) Toncoin led the losers. U.S. stock futures were up during early morning trading in Asia after Wall Street recorded losses of over 1% on Tuesday. More key inflation data is expected Thursday as investors look out for signs of a U.S. recession and further interest rate hikes. Mega-cap tech giants including Amazon, Apple and Tesla led the Wall Street declines.\n\nBitcoin ‘firm within September trading range’\n\nBitcoin edged 0.28% lower to US$26,209.51 in the 24 hours to 07:40 a.m. in Hong Kong for a weekly loss of 3.70%, according to CoinMarketCap data. The world’s largest cryptocurrency fell to US$26,090.71 on Tuesday evening. But it managed to stay above the US$26,000 support level maintained for the past 14 days.\n\nWith Bitcoin staying “firm within its September trading range,” blockchain analytics firm K33 Research wrote in an emailed note, “a narrowing trading range accompanied by a slow news cycle has provided traders with few reasons to participate actively in the market.”\n\nThe options pricing of Bitcoin derivatives on the CME market “shows a more positive longer term than short-term outlook but has become slightly more bearish in tandem with BTC’s price decline over the last week,” the K33 report added.\n\nEther was also trading flat. It edged up 0.33% to US$1,592.60 over the past 24 hours but lost 3.10% for the week. The token hit US$1,598.10 on Tuesday evening. But it failed to rise above the US$1,600 level it gave up on Sunday.\n\nWhile Ether is trading near a 14-month low against Bitcoin (0.061 BTC per ETH), that trend could be about to change, K33 report.\n\n“We reiterate our stance that rotating towards ETH is a sound play for the coming months, as futures-based ETFs can turn the trend. The first half of October will be pivotal in that regard, as the final deadlines for the ongoing futures ETH ETFs are coming up in this period,” wrote K33.\n\nStory continues\n\nMost other top 10 non-stablecoin cryptocurrencies booked losses for the past 24 hours. The exceptions were Ether, Binance’s BNB and Tron’s TRX. Toncoin continued to lead the losses. It dropped 1.66% in the past 24 hours to US$2.12 for a weekly decline of 17.75%.\n\nBNB, the native token of cryptocurrency exchange Binance Holdings Ltd, led the winners. The coin gained 1.06% to US$212.17, but it recorded a weekly loss of 2.30%.\n\nBNB’s daily rise coincided with the announcement Tuesday that Binance, the world’s largest crypto exchange, is collaborating with Japan’s largest banking group Mitsubishi UFJ Trust and Banking Corporation to issue fiat-pegged stablecoins in 2024.\n\nThe total crypto market capitalization dipped 0.28% in the past 24 hours to US$1.04 trillion, while trading volume dropped 10.02% to US$22.56 billion.\n\nWall Street losses amid recession fears\n\nImage: Getty Images\n\nU.S. stock futures were trading higher as of 09:40 a.m. in Hong Kong. The S&P 500 futures led the gains with a 0.21% increase. Wall Street closed lower Tuesday with all three major indexes booking losses of over 1%. The Nasdaq Composite led the losers with a 1.57% slide.\n\nMajor Asian stock indexes were mixed on Tuesday morning. China’s Shanghai Composite and Hong Kong’s Hang Seng booked gains, while South Korea’s Kospi and Japan’s Nikkei 225 dipped.\n\nU.S. economic data released Tuesday raised fears of recession. The Consumer Confidence Index tracked by the Conference Board dropped to 103.0 in September, lower than the analysts’ expectation of 105.5.\n\nThe data showed that “consumers continued to be preoccupied with rising prices in general, and for groceries and gasoline in particular,” wrote Dana Peterson, chief economist at The Conference Board.\n\n“Consumers also expressed concerns about the political situation and higher interest rates,” Peterson said.\n\nThe Expectations Index, based on consumers’ short-term outlook for income, business, and labor market conditions, declined to 73.7 in September from 83.3 in August. A reading below 80 signals a recession within the next year, according to the Conference Board.\n\n“Consumers may be hearing more bad news about corporate earnings, while job openings are narrowing, and interest rates continue to rise — making big-ticket items more expensive,” wrote Peterson.\n\nMeanwhile, new single-family home sales in the U.S. fell 8.7% to a seasonally adjusted annual rate of 675,000 in August, lower than the analysts’ projection of 698,000. The tight house supply, elevated prices and historically high mortgage rates contributed to the drop in home sales, according to Bloomberg on Wednesday.\n\nThe Federal Reserve in September kept interest rates unchanged between 5.25% and 5.50%, the highest level since early 2001. But the central bank might need to make another 25-basis-point rate hike by the end of 2023, and keep the rates higher for longer, according to remarks from Fed Chair Jerome Powell last Wednesday.\n\nThe Fed meets on Nov. 1 to make its next decision on interest rates. The CME FedWatch Tool predicts a 82.5% chance of no interest rate hike in November, up from 81.5% on Tuesday. It also gives a 65.8% chance of another pause in December, up from 60.9% on Tuesday\n\nOn the corporation front, the U.S. online retail giant Amazon.com, Inc. was among the worst performers on Tuesday. Its share price closed 4.03% lower. The Federal Trade Commission and 17 states sued Amazon Tuesday, claiming the firm wields illegal monopoly power.\n\nThe share prices of technology giants Apple, Inc. and Tesla, Inc. also dropped 2.34% and 1.16 respectively on Tuesday.\n\nInvestors are now waiting for the U.S. second-quarter personal consumption expenditure price index (PCE) on Thursday, which will provide further insights into inflation.\n\nElsewhere, China’s monthly industrial profits in August surprisingly rose 17.2% from a year earlier, reversing a 6.7% annual decline in July. The industrial profit from January to August fell 11.7% from the same period last year. But the drop decelerated compared to a 15.5% slide in the first seven months of the year.\n\n(Updates with equity section.)"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy90b3AtaG9sZGVyLW9mLWJpdGNvaW4tcmV2ZWFsZWQtdGhpcy1jb21wYW55LWhvbGRzLXNhbWUtYnRjLWFzLXNhdG9zaGktbmFrYW1vdG8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Top Holder of Bitcoin Revealed: This Company Holds Same BTC as Satoshi Nakamoto - CCN.com",
        "content": "Key Takeaways\n\nArkham revealed to have found almost $25 billion worth of Bitcoin in Coinbase’s holdings.\n\nThe amount of Bitcoins held is around 948,000, closer to Satoshi Nakamoto’s 1 million.\n\nAccording to Arkham analysts on X, Coinbase is the largest Bitcoin holder in the world.\n\nAccording to blockchain intelligence company Arkham Intelligence , Coinbase is the top Bitcoin holder, meaning the largest organization in the world to possess Bitcoin (BTC), with a market cap of roughly $25 billion.\n\nArkham Claims Coinbase Has Almost 1M Bitcoins\n\nOn Friday, Arkham that it had detected approximately 1 million BTC for Coinbase reserves on-chain, making the US-based cryptocurrency giant “the largest Bitcoin entity in the world”.\n\nThe exchange’s BTC holdings are almost equal to the amount credited to Satoshi Nakamoto, the mysterious person who created Bitcoin, as they represent around 5% of all Bitcoins now in circulation.\n\nArkham has now identified $25B of Coinbase Bitcoin reserves (~1M BTC) on chain. This makes Coinbase the largest Bitcoin entity in the world on Arkham, with almost 5% of all BTC in existence – about as much as Satoshi Nakamoto. pic.twitter.com/7sDOczS7WT — Arkham (@ArkhamIntel) September 22, 2023\n\nA cold wallet with 10,000 BTC is among the 36 million deposit and holding addresses for BTC that Coinbase apparently hosts. The intelligence platform indicated that there might be millions of additional untagged assets.\n\nThe Coinbase portfolio also has 1.68 million Ethereum (ETH), 68.6 million Chainlink (LINK), roughly 223 million USD Coin (USDC), and 921,000 BNB (BNB) in addition to Bitcoin.\n\nAccording to information on Arkham as of September 22, these assets help to make up Coinbase’s approximately $29 billion cryptocurrency portfolio.\n\nAccording to Arkham, Coinbase has a total holding of 947,755 BTC in its Bitcoin portfolio. To put things in perspective, the cryptocurrency price tracking website CoinGecko estimates that there are currently 19,493,875 Bitcoins in circulation.\n\nHowever, it’s essential to emphasize that cryptocurrency exchange users primarily own the majority of these coins. Arkham revealed that Coinbase alone actively monitors and identifies nearly 36 million Bitcoin deposit and holding addresses using their on-chain analysis platform.\n\nObtaining AML Registration Approval From the Bank of Spain\n\nThe release of Arkham’s research coincides with Coinbase’s additional service expansion following regulatory permission in Spain.\n\nAs announced earlier, on September 22, Coinbase declared that it had secured Anti-Money Laundering (AML) registration with the Bank of Spain, marking a critical milestone in its global expansion strategy.\n\nWith the help of this registration, Coinbase is now able to provide the entire spectrum of its cryptocurrency services to institutional and retail customers in Spain while also adhering to the legal requirements of that nation.\n\nCoinbase now has official regulatory milestones in Spain in addition to those in Italy, Singapore, the Netherlands, Brazil, and Canada. The exchange is likewise struggling with US regulatory ambiguity.\n\nWho Owns Most Bitcoin\n\nAccording to Arkham Intelligence , the greatest Bitcoin holder is still Satoshi Nakamoto, who is said to own 1.1 million coins, valued at $30 billion at the time of writing.\n\nAfter Coinbase, two of the biggest exchange Bitcoin custodians are Binance and Bitfinex, with approximately 600,000 and 200,000 BTC, respectively.\n\nThe US government is allegedly the owner of 205,515 Bitcoin, said James Zhong , the owner of the Silk Road marketplace, and as a result of the Bitfinex hack.\n\nMany Bitcoin billionaire wallets remain unidentified, with most of them staying idle after receiving their initial Bitcoin input\n\nAn integral part of the project’s design is the fixed supply of 21 million Bitcoins, preventing artificial value inflation. Notably, the actual available Bitcoin supply is even smaller due to an estimated 3.7 million BTC permanently lost in inaccessible wallets."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9iaXRjb2luLXByaWNlLXN0cnVnZ2xpbmctbWljcm9zdHJhdGVneS1idXlzLWRpcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price Struggling as ETF Hopes Wane: MicroStrategy Buys the Dip with 5455 BTC - CCN.com",
        "content": "Key Takeaways\n\nMicroStrategy increased its corporate treasury by 5,445 BTC.\n\nThe company now possesses a total of 158,245 BTC, acquired at an average price of $29,582.\n\nBItcoin holdings amount to roughly $4.68B.\n\nSaylor remains optimistic about Bitcoin’s potential and advises selling altcoins due to perceived overvaluation.\n\nMicroStrategy has increased its corporate treasury by 5,445 Bitcoin, demonstrating its consistent commitment to the cryptocurrency.\n\nMicroStrategy has acquired an additional 5,445 BTC for ~$147.3 million at an average price of $27,053 per #bitcoin . As of 9/24/23 @MicroStrategy hodls 158,245 $BTC acquired for ~$4.68 billion at an average price of $29,582 per bitcoin. $MSTR https://t.co/GbJtUoQfXv — Michael Saylor⚡️ (@saylor) September 25, 2023\n\n158,245 Bitcoins (BTC) total, obtained at an average price of nearly $29,582 per Bitcoin, or roughly $4.68 billion, are now in the possession of MicroStrategy.\n\nMichael Saylor, CEO of MicroStrategy, has been a vocal supporter of Bitcoin, referring to it as “digital gold” and highlighting its function as a strategic treasury reserve asset. With this most recent acquisition, MicroStrategy has solidified its place as one of the leading institutional investors in Bitcoin.\n\nThose who have been monitoring MicroStrategy’s progress in the cryptocurrency space are not surprised by the decision.\n\nWhen it made its maiden acquisition in August 2020, the corporation launched its first foray into Bitcoin investments. Since then, it has kept acquiring Bitcoin, even financing some of its purchases with loans.\n\nAs this video from Bitcoin Historian Pete Rizzo demonstrates, Saylor has maintained that Bitcoin is “underestimated” in comparison to other crypto industry potential. Saylor has frequently said that altcoins should be sold because they are overpriced.\n\nIt’s uncertain if more institutions will emulate MicroStrategy as Bitcoin gains recognition as a store of value and a potential hedge against economic volatility.\n\nApproved BTC ETF Hopes Dash as SEC Continues to Defer Decision\n\nThe allure of exchange-traded funds (ETFs) had Bitcoin enthusiasts riding high on a wave of excitement this past summer, but it appears the tide has abruptly flipped.\n\nDespite earlier indications to the contrary, achieving approval for a US Bitcoin ETF still appears to be a distant goal.\n\nAs the drama plays out, the Securities and Exchange Commission (SEC) continues to put off the approval of large asset management companies like Fidelity and Invesco’s applications for Bitcoin ETFs.\n\nWhen BlackRock Inc., a major fund company, got on the Bitcoin ETF bandwagon in June, many people thought they might be holding the magic wand.\n\nBTC Price Rose\n\nBitcoin’s price increased due to the speculative nature of the cryptosphere, under the assumption that BlackRock had an advantage over its rivals. But as it is, BlackRock’s participation has merely increased tension and brought about eventual disappointment.\n\nAfter BlackRock’s announcement, Bitcoin prices did indicate a hopeful 20% increase, but by August, the steady rise abruptly came to an end. The reason? Due to rising interest rates, there has been a long waiting period and a decline in the general enthusiasm for cryptocurrencies.\n\nThe cryptocurrency community is well aware of the unpredictable relationship between Bitcoin and ETFs. By the conclusion of the week, Bitcoin had entered its third straight dip after a roller-coaster of price changes, hovering around the $25,700 level.\n\nEven worse, the SEC’s postponements of the ETF ruling served as further proof of the market’s inherent fragility.\n\nIt’s possible that October will serve as the final month. The SEC is now on a 45-day countdown to provide their next answer because of the recent deferments that are still in effect. This implies that the cryptosphere will undoubtedly awaken by mid-October.\n\nIn addition, the SEC will need to decide how to respond to the Grayscale ruling. The introduction of ether-futures ETFs, which, rumors have it, the SEC might just approve, is a third change to look forward to in the upcoming month."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYml0Y29pbi1kb3duLWJ1dC1ub3Qtb3V0L9IBTGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYml0Y29pbi1kb3duLWJ1dC1ub3Qtb3V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin - Down but Not Out? - Finance Magnates",
        "content": "Few names in the world of cryptocurrencies are as well-known as Bitcoin. Bitcoin has been a wild ride of highs and lows, attracting the attention of investors, authorities, and enthusiasts alike. Bitcoin's price has recently fluctuated significantly, prompting concerns about its stability and future prospects. This article investigates the elements that have influenced Bitcoin's recent performance and considers whether it is still a force to be reckoned with in the cryptocurrency world.\n\nBitcoin's Difficult Journey\n\nThe path of Bitcoin has been nothing short of extraordinary. Bitcoin has altered the norms of finance, from its humble origins as a cryptocurrency that could be mined on personal computers to the development of a worldwide cryptocurrency market worth billions. Its decentralized structure, based on blockchain technology, promised a financial revolution that would put established banking systems and monetary policy to the test.\n\nBitcoin's path, on the other hand, has been distinguished by significant price volatility. It had dramatic price increases, most notably in 2017 when it reached about $20,000 per Bitcoin, followed by precipitous drops. This volatility has been a feature of the bitcoin market, attracting both speculators and detractors.\n\nBitcoin Faces Uncertain Times as September Ends\n\nAs Bitcoin enters the last week of September, it grapples with the challenges posed by an ongoing price range and external factors impacting its direction.\n\nThe past week saw Bitcoin's price retesting the $26,000 level, reflecting a lackluster month with an uninspiring weekly close. While the cryptocurrency market has endured macroeconomic events, more tests lie ahead in September, including the release of United States GDP data and Personal Consumption Expenditures (PCE) figures.\n\nOne significant event on the horizon is a speech by Jerome Powell, Chair of the Federal Reserve, scheduled a week after the Fed's decision to maintain U.S. interest rates at elevated levels. Inflation remains a central concern, and Bitcoin continues to lack a clear trend as the weeks pass without decisive upward or downward movement.\n\nBitcoin's recent performance indicates that the crypto market is near two-week lows, fueling concerns among cautious analysts about potential future developments.\n\nAs September draws to a close, the cryptocurrency market remains dynamic and influenced by a variety of internal and external factors, setting the stage for potential shifts in Bitcoin's price trajectory.\n\nOctober, often referred to as \"Uptober\" among enthusiasts, is already generating discussions about potential market gains.\n\nPrice Changes in the Recent Past\n\nBitcoin has just experienced another episode of price volatility. After reaching an all-time high of over $60,000 in April 2021, its price dropped, causing alarm among many investors. Factors such as Chinese governmental crackdowns, environmental worries about Bitcoin mining, and more scrutiny from banking regulators all contributed to this downward trend.\n\nBitcoin's price swings have followed the broader cryptocurrency market attitude. It is worth mentioning that Bitcoin is sometimes used as a barometer for the whole crypto industry. When the price of Bitcoin rises, it tends to lift the price of other cryptocurrencies, and when it falls, it can cause a market-wide correction.\n\nRegulatory Obstacles\n\nRegulatory ambiguity is one of the main difficulties confronting Bitcoin and the broader cryptocurrency economy. Governments and financial regulators all around the world have debated how to classify and regulate cryptocurrencies. Some countries have welcomed digital assets, while others have imposed stringent rules or outright bans.\n\nChina, for example, has tightened its grip on cryptocurrency operations, including the prohibition of Bitcoin mining and the provision of cryptocurrency-related services by financial institutions. Meanwhile, countries such as El Salvador have accepted Bitcoin as legal tender, demonstrating the global regulatory disparity.\n\nThe regulatory landscape in the United States remains fluid, with organizations such as the SEC and the IRS attempting to clarify tax and securities legislation pertaining to cryptocurrencies. The lack of a single regulatory framework might create uncertainty for crypto investors and businesses.\n\nConcerns About the Environment\n\nBitcoin mining, the process of creating new Bitcoins and verifying transactions, has come under severe attention owing of its environmental impact. Bitcoin mining is based on energy-intensive computations, which are frequently carried out by mining farms outfitted with sophisticated machinery. Critics contend that mining's energy use is unsustainable and contributes to carbon emissions.\n\nConcerns concerning the environmental sustainability of cryptocurrencies have sparked debate. Because of Bitcoin's carbon impact, several investors and institutions have been hesitant to adopt it. As a result, there is an increasing trend among cryptocurrency projects to investigate more environmentally friendly consensus techniques.\n\nInterest from Institutions\n\nDespite the difficulties, institutional interest in Bitcoin and cryptocurrencies is still high. Banks, investment firms, and payment processors are among the major financial organizations that have made considerable investments in digital assets. Many see the introduction of institutional actors into the bitcoin industry as a sign of its gaining credibility.\n\nBitcoin has been incorporated to the balance sheets of companies such as Tesla, Square, and MicroStrategy as a store of value and a hedge against inflation. Furthermore, investment instruments such as Bitcoin exchange-traded funds (ETFs) have been approved in several jurisdictions, giving traditional investors access to the cryptocurrency market.\n\nBitcoin as a form of digital gold\n\nThe analogy to gold is one of the arguments in favor of Bitcoin's resiliency. Bitcoin supporters frequently refer to it as \"digital gold\" due to its rarity and potential as a store of wealth. Bitcoin, like gold, has a finite supply cap of 21 million coins, rendering it resistant to the inflationary pressures that plague traditional fiat currencies.\n\nThis story portrays Bitcoin as a hedge against economic insecurity and currency depreciation. It has grown in popularity, particularly during periods of economic instability, drawing investors looking for an alternative asset class with the potential for long-term growth.\n\nThe Bitcoin Road Ahead\n\nDespite considerable barriers such as regulatory challenges, environmental concerns, and price swings, Bitcoin continues to be a powerful presence in the cryptocurrency scene. Its qualities of decentralization, security, and wealth storage continue to entice investors and institutions.\n\nBitcoin's future path will most likely be determined by various factors, including:\n\nRegulatory Clarity: The cryptocurrency industry would benefit from clear and consistent regulatory frameworks around the world, which might give investors and businesses more confidence.\n\nContinuous development and innovation in blockchain technology may address some of the environmental challenges related with Bitcoin mining while enhancing scalability and efficiency.\n\nMaturity of the market: As the cryptocurrency market matures, it may become less prone to excessive price volatility, attracting a larger spectrum of investors.\n\nInstitutional Adoption: Continued attention and investment from institutional entities may promote market stability and credibility.\n\nConclusion\n\nIn conclusion, despite its ups and downs, Bitcoin remains a durable and influential force in the world of cryptocurrencies. Its status as a digital store of value and a pioneer in decentralized finance positions it for long-term viability. The cryptocurrency landscape, on the other hand, is dynamic, and Bitcoin's long-term success will be determined by its capacity to adapt to developing problems and grab opportunities in a quickly changing financial world."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRhbmdlci11cy1kb2xsYXItaW5kZXgtZ29sZGVuLWNyb3Nz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price at risk? US Dollar Index confirms bullish 'golden cross' - Cointelegraph",
        "content": "The Dollar Strength Index (DXY) achieved its highest level in nearly 10 months on Sept. 22, indicating growing confidence in the United States dollar compared to other fiat currencies like the British pound, euro, Japanese yen and Swiss franc.\n\nDXY “golden cross” confirmed\n\nMoreover, investors are concerned that this surge in demand for the U.S. dollar might pose challenges for Bitcoin (BTC) and cryptocurrencies, although these concerns are not necessarily interconnected.\n\nU.S. Dollar Index (DXY). Source: TradingView\n\nThe DXY confirmed a golden cross pattern when the 50-day moving average surpassed the longer 200-day moving average, a signal often seen as a precursor to a bull market by technical analysts.\n\nImpacts of the recession and inflation risks\n\nDespite some investors believing that historical trends are determined solely by price patterns, it’s important to note that in September, the U.S. dollar exhibited strength, even in the face of concerns about inflation and economic growth in the world’s largest economy.\n\nMarket expectations for U.S. gross domestic product growth in 2024 hover at 1.3%, which is lower than the 2.4% average rate over the preceding four years. This slowdown is attributed to factors such as tighter monetary policy, rising interest rates and diminishing fiscal stimulus.\n\nHowever, not every increase in the DXY reflects heightened confidence in the economic policies of the U.S. Federal Reserve. For example, if investors opt to sell U.S. Treasurys and hold onto cash, it suggests a looming recession or a significant uptick in inflation as the most likely scenarios.\n\nWhen the current inflation rate is 3.7% and on an upward trajectory, there’s little incentive to secure a 4.4% yield, prompting investors to demand a 4.62% annual return on five-year U.S. Treasurys as of Sept. 19, marking the highest level in 12 years.\n\nU.S. 5-year Treasury yield. Source: TradingView\n\nThis data unequivocally demonstrates that investors are avoiding government bonds in favor of the security of cash positions. This may seem counterintuitive initially, but it aligns with the strategy of waiting for a more favorable entry point.\n\nInvestors anticipate that the Fed will continue raising interest rates, allowing them to capture higher yields in the future.\n\nIf investors lack confidence in the Fed’s ability to curb inflation without causing significant economic harm, a direct link between a stronger DXY and reduced demand for Bitcoin may not exist. On one hand, there is indeed a decreased appetite for risk-on assets, evident from the S&P 500’s negative performance of 4.3% in September. However, investors recognize that hoarding cash, even in money market funds, does not ensure stable purchasing power.\n\nMore money in circulation is positive for Bitcoin’s price\n\nAs the government continues to raise the debt ceiling, investors face dilution, rendering nominal returns less significant due to the increased money supply. This explains why scarce assets, such as Bitcoin, and some leading tech companies may perform well even during an economic slowdown.\n\nRelated: How much is Bitcoin worth today?\n\nIf the S&P 500 continues its downtrend, then investors might exit risk markets regardless of their scarcity or growth potential, at least initially. In such an environment, Bitcoin could indeed face negative performance.\n\nHowever, it’s important to note that this analysis overlooks the fact that the same pressures from inflation and recession will likely increase the money supply, either through additional Treasury debt issuance or the Feds bond purchases in exchange for U.S. dollars.\n\nEither way, increased liquidity in the markets tends to favor Bitcoin since investors may seek refuge in alternative assets to protect against “stagflation” — a situation marked by stagnant economic growth alongside rampant inflation.\n\nTherefore, the DXY golden cross may not necessarily be a net negative for Bitcoin, particularly on longer timeframes.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1nb3Z0LXNodXRkb3duLWxvb21zLTUtdGhpbmdzLWJpdGNvaW4tdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "US gov't shutdown looms — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts the last week of September with a retest of $26,000 as a stubborn range persists.\n\nAn unimpressive weekly close sets the tone for the culmination of a traditionally lackluster month for BTC price action.\n\nHaving shaken off a hectic week of macroeconomic events, Bitcoin has plenty more to weather before September is over. United States gross domestic product figures for Q2 will come on Sept. 28, with Personal Consumption Expenditures (PCE) data following the day after.\n\nThe highlight, however, will likely come in the form of a speech from Jerome Powell, chair of the Federal Reserve, a week after it opted to hold U.S. interest rates at current elevated levels.\n\nInflation remains a major talking point into Q4, and Bitcoin still lacks direction as week after week goes by without a clear upward or downward trend emerging.\n\nWill this week be different? The countdown to the monthly close is on.\n\nBTC price weekly chart prints “death cross”\n\nBTC price performance, while steady over the weekend, deteriorated after the Sep. 24 weekly close.\n\nBTC/USD took a trip to $26,000, data from Cointelegraph Markets Pro and TradingView shows, with this level still managing to hold as support at the time of writing prior to the week’s first Wall Street open.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nEyeing the state of play on exchanges, commentators noted liquidations occurring for long and short BTC positions.\n\nBoth sides almost liquidated.\n\n\n\nNice long squeeze. Bulls trapped. https://t.co/FxUGbwxx3v pic.twitter.com/us8Cxno5PZ — IT Tech (@IT_Tech_PL) September 24, 2023\n\nBitcoin is still near two-week lows, bolstering arguments from already cautious analysts over what might come next.\n\nPopular trader and analyst Rekt Capital continued to track what he suggested could be a repeat of previous BTC price behavior. 2023, he argued at the weekend, might end up looking just like 2019 — its counterpart from the last cycle.\n\n“Bitcoin could follow the same bearish fractal from 2019 to drop lower in this Macro Range,” he suggested alongside a comparative chart.\n\nIn a subsequent debate on X, Rekt Capital put the potential fractal downside target at near $20,000.\n\nBTC/USD annotated chart. Source: Rekt Capital/X\n\nKeith Alan, co-founder of monitoring resource Material Indicators, meanwhile spied a so-called “death cross” on weekly timeframes.\n\nHere, the falling 21-week simple moving average (SMA) has crossed under its rising 200-week counterpart — a phenomenon that highlights the comparative weakness of recent price action.\n\nUploading a chart showing a downside warning from Material Indicators’ proprietary price tools, Alan added that this would be invalidated should BTC/USD reclaim $26,500.\n\nA #DeathCross + a new Trend Precognition ⬇️ Signal on the #btc Weekly Chart (Pump > $26.5 to invalidate).\n\n\n\nAny questions? pic.twitter.com/aBa64Be56D — Keith Alan (@KAProductions) September 25, 2023\n\nA more optimistic take came from trader and analyst Credible Crypto, who believed a rebalancing of market composition would result in a return to $27,000.\n\n“We had clear, visible and confirmed accumulation occurring in the green square,” he commented on a chart, building on analysis from the weekend.\n\n“This latest push down looks to be manipulation to the downside (red square) prior to expansion to the upside. 27k incoming imo.”\n\nBTC/USD annotated chart. Source: Credible Crypto/X\n\nSeptember 2023 clings to “green” status\n\nDespite the overnight weakness, Bitcoin remains in the black for September overall — a rare feat by historical standards.\n\nThe latest live data from monitoring resource CoinGlass puts BTC/USD up 0.8% month-to-date.\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nWhile this seems modest compared to the volatility generally seen with the pair, September usually forms a bearish prelude to a more substantial upside traditionally seen in October.\n\n2023 is thus still on track to be Bitcoin’s strongest September performance for seven years.\n\nOctober, which is informally known as “Uptober” among hodlers thanks to coinciding with BTC and broader crypto gains, is already a talking point.\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, suggested the start of next month could provide the fuel for the total crypto market cap to break above the 200-week exponential moving average (EMA).\n\n“Total market capitalization for Crypto fights the resistance here of the 200-Week EMA,” he told X subscribers late last week.\n\n“I think it’s just a matter of time until we flip above it. Probably 1-2 weeks if Ethereum ETF Futures could be approved and Uptober begins.”\n\nTotal crypto market cap annotated chart. Source: Michaël van de Poppe/X\n\nBitcoin’s 200-week EMA continues to act as support and currently sits at $25,700.\n\nPCE data, Fed’s Powell headline macro week\n\nIf last week’s macroeconomic events were not enough to induce significant volatility across Bitcoin and crypto markets, perhaps the month-end selection will have the desired effect.\n\nRevised U.S. Q2 GDP precedes comments from Fed Chair Powell, as well as five other speakers, including Governor Lisa Cook, later on Sept. 28. Markets, as ever, will be closely watching the language used — especially by Powell — to determine how future economic policy might play out.\n\nPCE data will come a day later; this is known to be one of the Fed’s preferred gauges for measuring inflation trends.\n\n“Very busy week just as volatility has returned,” financial commentary resource The Kobeissi Letter summarized in an X outlook.\n\nThe return of volatility is fantastic news for traders.\n\n\n\nMore Fed uncertainty is back and we are ready for it.\n\n\n\nWe're publishing our trades for the week shortly.\n\n\n\nIn 2022, our calls made 86%.\n\n\n\nSubscribe to access our analysis and see what we're trading:https://t.co/SJRZ4FrNBc — The Kobeissi Letter (@KobeissiLetter) September 24, 2023\n\nPrior to the data and Fed speakers, markets are pricing in a 75% chance that interest rates stay anchored at present levels at the next decision meeting in November, per data from CME Group’s FedWatch Tool.\n\nFed target rate probabilities chart. Source: CME Group\n\nWaiting in the wings before that, meanwhile, is the threat of a fresh U.S. government shutdown over budget wrangling. Politicians have until Oct. 2 to avert one, notes pro-Bitcoin commercial litigator Joe Carlasare.\n\nMajor October Catalysts (Part 2)\n\n\n\nPredictive markets now anticipate a 70% of a Government Shutdown on October 2.\n\n\n\nMillions of federal workers face delayed paychecks when the government shuts down, including many of the roughly 2 million military personnel and more than 2 million… pic.twitter.com/XTrt0g06t2 — Joe Carlasare (@JoeCarlasare) September 24, 2023\n\nAnalysis dismisses BTC exchange balance drop\n\nBitcoin available to buy on exchanges may be near its lowest levels since 2018, but this is no cause for celebration or even bullishness, one longtime analyst argues.\n\nFor Willy Woo, creator of the statistics platform Woobull, the “synthetic” nature of exchanges’ BTC balances means that their multi-year decline does not represent the BTC supply becoming more illiquid or scarce.\n\n“Will buying up the inventory of BTC on exchanges moon the price? NO! This is a fallacy,” he told X subscribers in a thread at the weekend.\n\n“This happened all through the 2022 bear. There’s no supply shock because synthetic BTC via futures markets added to inventory. The market made a bottom when futures markets relented.”\n\nBitcoin inventory on exchanges annotated chart. Source: Willy Woo/X\n\nWoo argued that approving a Bitcoin spot price exchange-traded fund in the U.S. would go some way to “rectify” the problem.\n\nFutures, he added, were the elephant in the room that skewed his perspective of the market at the start of 2022 before BTC/USD hit two-year lows of $15,600 in November.\n\n“I saw the market bullish in early 2022 by reading on-chain (spot) flows as bullish, all the while the leviathan of futures impact was saying the opposite,” he admitted.\n\nBitcoin offers “fascinating” 2020 similarities\n\nRegardless of near-term BTC price performance, some remain universally bullish when it comes to the overall health of Bitcoin this year.\n\nRelated: Bitcoin short-term holders ‘panic’ amid nearly 100% unrealized loss\n\nAmong them is the popular trader and analyst known as Moustache, who now believes that current levels could represent the last chance to “buy the dip” on BTC in 2023.\n\nUploading a chart comparing the status quo to that of 2020, Moustache additionally noted “fascinating” similarities in Bitcoin’s relative strength index (RSI).\n\nHe subsequently gave significance on the 200-week EMA holding as support.\n\n“95% wait for lower prices that won’t happen.,” he wrote in part of the accompanying commentary, with another chart placing BTC/USD in an expanding “megaphone” structure.\n\nBTC/USD annotated chart. Source: Moustache/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRyb3BzLWFzLXNlYy1kZWxheXMtZGVjaXNpb24tb24tYml0Y29pbi1ldGYtb2ZmZXJpbmctbmV3LXRyYWRpbmctb3Bwb3J0dW5pdGllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price drops as SEC delays decision on Bitcoin ETF, offering new trading opportunities - Cointelegraph",
        "content": "The SEC’s hesitation to approve the first Bitcoin ETF is putting pressure on the Bitcoin price, which is painful for crypto holders. Thanks to TradeSanta’s automated trading tools connected to spot and futures trading platforms, traders can reduce risks and take advantage of downturns.\n\nBitcoin had some attempts earlier this year to consolidate above the $30,000 mark, but it failed to do so. By the end of the year, the cryptocurrency may continue to trade below this psychological level, and one of the reasons behind the constant bearish pressure is the Securities and Exchange Commission’s (SEC) prolonged hesitation to approve a spot Bitcoin exchange-traded fund (ETF).\n\nThe SEC has postponed its decision on Bitcoin (BTC) ETFs, impacting numerous applicants, including BlackRock, a key player that encouraged other institutions to reapply.\n\nWho applied for a Bitcoin ETF with the SEC?\n\nMany asset managers, brokers, index fund providers and other institutions are seeking the green light for a Bitcoin ETF, which would bring more institutional and retail money into the crypto space. Here are the main applicants:\n\nBlackRock — The world’s largest asset manager, with $8.6 trillion under management, sent its application for a spot Bitcoin ETF in mid-June, indicating Coinbase would be its main data provider and crypto custodian. The filing boosted the Bitcoin price at the time, as BlackRock is probably the most influential player in the financial markets. The SEC accepted BlackRock’s application for review one month later.\n\n— The world’s largest asset manager, with $8.6 trillion under management, sent its application for a spot Bitcoin ETF in mid-June, indicating Coinbase would be its main data provider and crypto custodian. The filing boosted the Bitcoin price at the time, as BlackRock is probably the most influential player in the financial markets. The SEC accepted BlackRock’s application for review one month later. Fidelity — Financial services giant Fidelity is one of the companies that reapplied after BlackRock. The asset manager first applied in 2021 but was rejected. In July of this year, it refiled for its Wise Origin Bitcoin Trust to be turned into an ETF.\n\n— Financial services giant Fidelity is one of the companies that reapplied after BlackRock. The asset manager first applied in 2021 but was rejected. In July of this year, it refiled for its Wise Origin Bitcoin Trust to be turned into an ETF. VanEck — VanEck has been seeking the nod for a Bitcoin ETF since 2018, being one of the earliest applicants. After previously withdrawing its application on its own, the asset manager rejoined the Bitcoin ETF race in July 2023.\n\n— VanEck has been seeking the nod for a Bitcoin ETF since 2018, being one of the earliest applicants. After previously withdrawing its application on its own, the asset manager rejoined the Bitcoin ETF race in July 2023. ARK Invest — Investment management firm ARK has been waiting for the SEC’s approval for its ARK 21Shares Bitcoin ETF since June 2021.\n\n— Investment management firm ARK has been waiting for the SEC’s approval for its ARK 21Shares Bitcoin ETF since June 2021. Invesco and Galaxy Digital — Investment management firm Invesco joined forces with Galaxy Digital, seeking approval for the Invesco Galaxy Bitcoin ETF. This would be an ETF “physically backed” by Bitcoin, with Invesco as the sponsor.\n\nOther institutions planning to launch a Bitcoin ETF include WisdomTree, Valkyrie Investments, Bitwise and GlobalX.\n\nAt the end of August, the SEC delayed its spot Bitcoin ETF decision for all applicants.\n\nHow does the SEC’s delay affect the Bitcoin market?\n\nBitcoin was hovering above $28,000 at the end of August, trying to retest the resistance at $30,000. However, the SEC’s delay in its decision on all Bitcoin ETF applications discouraged the Bitcoin market, pushing the price down until it found support near $25,000.\n\nIn mid-September, the bearish pressure further extended, with the BTC price breaking below the $25,000 mark for the first time since mid-June, when BlackRock fueled the rally with its SEC filing.\n\nSource: TradingView\n\nHow to trade during bearish markets?\n\nWhile bearish markets scare many Bitcoin holders, active traders can seek advantages even during such harsh conditions by opening short positions. To make this process more efficient and take emotions out of the equation, crypto traders can use trading bots and automation tools from TradeSanta. This platform offers an array of algorithmic strategies that can work well, including during bearish trends.\n\nTradeSanta offers a versatile approach to trading that caters to both novice and experienced traders, allowing them to begin their trading activities based on their individual skills and preferences. Traders have three different ways to begin their journey: they can choose from a number of pre-designed strategies available in the marketplace for mirror trading, use preset algorithms, or opt for the customization option to create their own unique bots from scratch. This flexibility is especially beneficial for those looking to automate short strategies at specific price levels. Most importantly, TradeSanta’s short strategies are equipped with essential risk management controls.\n\nSource: TradeSanta\n\nTradeSanta offers its own trading venue to ensure a user-friendly experience. The platform also integrates with major exchanges like Binance, Coinbase, Kraken, Huobi, Bybit and more via API keys, eliminating the need to move funds. Moreover, TradeSanta’s trading terminal allows trading spot markets manually on different exchanges at once.\n\nSource: TradeSanta\n\nCapitalizing on downtrends becomes straightforward with TradeSanta. Designed for over 100 cryptocurrencies, traders can tactically set up any coin if it is traded on the exchange. For instance, if Bitcoin starts to lose ground, traders can open a short position on the BTC/USDT pair, with the intent of selling Bitcoin at a higher price and then buying the same amount back but at an even lower price. The bot automatically acquires Tether (USDT), manages profit orders and repurchases Bitcoin at the targeted dip, eventually, a trader gets back the same amount of BTC plus profit in USDT.\n\nBeyond bots, TradeSanta offers technical analysis tools, which help crypto traders better recognize trends and understand market sentiment.\n\nTradeSanta assists not only short traders with leveraging market downturns but also helps long traders minimize risks. Thanks to its stop-loss and trailing stop-loss features, bearish trends don’t take traders by surprise, minimizing potential losses and improving crypto portfolio management. Here is what you should consider for a proper stop-loss:\n\nCalculate your risk/reward ratio to align with your risk tolerance.\n\nIf trading based on support and resistance, place your stop-loss below the most recent support level.\n\nConsider using the moving average method, setting stop-losses below longer-term averages.\n\nAdditionally, TradeSanta enables users to enhance their trading strategies through copy trading by replicating successful traders’ strategies for maximum profitability.\n\nUser feedback and statistics indicate that TradeSanta’s risk management tools have been effective in helping users minimize losses and navigate volatile market conditions.\n\nLearn more about TradeSanta"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV4Y2hhbmdlLXZvbHVtZS01LXllYXItbG93cy1mZWQtYnRjLWhvZGxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin exchange volume tracks 5-year lows as Fed inspires BTC hodling - Cointelegraph",
        "content": "Bitcoin (BTC) exchanges have seen trading volume collapse as traders deal with constant macroeconomic uncertainty.\n\nAccording to new research from on-chain analytics platform CryptoQuant published on Sept. 25, daily BTC volumes are at lows rarely seen since 2018.\n\nFed keeps Bitcoin investors wary of “possible recession”\n\nBitcoin price action has stayed in a familiar range for several months, and as time goes by, interest in transacting appears to be fading.\n\nCryptoQuant data, which tracks activity on both spot and derivatives exchanges, highlights the extent to which volumes have decreased since BTC/USD entered its current range in March.\n\nThe past week saw between 8,000 and 15,000 daily spot exchange transactions — a fraction of the standard March daily tally, which exceeded 600,000.\n\nFor contributing analyst Caue Oliveira, a principal force behind the phenomenon is the macroeconomic climate.\n\n“One of the main reasons cited is the growing fear regarding the macroeconomic scenario,” he wrote in part of the commentary accompanying the data.\n\n“The actions of the United States Central Bank perpetuate a constant feeling of uncertainty, leaving investors waiting for a possible recession.”\n\nOliveira referenced current economic policy in the U.S., where the Federal Reserve has flitted between interest rate hikes and pauses in 2023 while keeping overall conditions tight.\n\nContinuing, he noted that Bitcoin hodlers have chosen to keep hold of BTC capital as a result.\n\n“Instead of seeking quick profits through short-term trading, more and more people are viewing bitcoin and other cryptocurrencies as a long-term investment,” he concluded.\n\n“They are more interested in holding their coins, believing in their future value, than selling at the first sign of profit.”\n\nBitcoin: Trading Volume (Spot vs. Derivative) chart. Source: CryptoQuant\n\nLittle food for BTC price bulls\n\nAs Cointelegraph reported, times have become tough for Bitcoin speculators in recent weeks.\n\nRelated: Bitcoin price fights for $26K as US dollar strength hits 10-month high\n\nShort-term holders — entities holding BTC for 155 days at most — now hold almost their funds at an unrealized loss, with their cost basis higher than the current spot price.\n\nIn further research this week, fellow CryptoQuant contributor Yonsei_dent concluded that the cost basis of various Bitcoin newcomers would act as “strong resistance.”\n\n“Excluding investors who have been holding for the long term since 1.5 years (12m) + HODLers, investors who entered the market over the past year are believed to have a stronger tendency to buy and sell in the short term,” he warned.\n\nAn accompanying chart showed unspent translation output (UTXO) numbers split by age band, forming resistance and support levels.\n\nBitcoin UTXO age bands annotated chart (screenshot). Source: CryptoQuant\n\nExternal interest in BTC exposure, meanwhile, also remains distinctly absent. Google Trends data shows the lowest interest in “Bitcoin” as a search term since October 2020.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sYXdtYWtlcnMtY2FsbC1zZWMtY2hhaXItYXBwcm92ZS1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "US lawmakers call on SEC chair to approve spot Bitcoin ETFs 'immediately' - Cointelegraph",
        "content": "Four members of the United States Congress are requesting Securities and Exchange Commission Chair Gary Gensler “immediately” approve the listing of spot Bitcoin (BTC) exchange-traded funds, or ETFs.\n\nIn a Sept. 26 letter to Gensler, U.S. Representatives Mike Flood, Wiley Nickel, Tom Emmer and Ritchie Torres claimed the SEC was “discriminat[ing] against spot bitcoin exchange traded products,” citing the legal precedent set by Grayscale Investments in winning a review of its own ETF offering. The four lawmakers told Gensler there was “no reason to continue to deny” spot crypto ETF applications following the Grayscale court decision, which ruled the SEC’s reasoning was “arbitrary and capricious” in having already approved investment vehicles tied to Bitcoin futures.\n\n“A regulated spot bitcoin ETP would provide increased protection for investors by making access to bitcoin safer and more transparent,” said the letter. “Congress has a duty to ensure the SEC approves investment products that meet the requirements set out by Congress.”\n\nThe lawmakers added:\n\n“We urge you to approve the listing of spot-bitcoin ETPs immediately.”\n\nBipartisan letter from @USRepMikeFlood @RepWileyNickel @GOPMajorityWhip and @RitchieTorres to SEC Chair Gensler on not approving a bitcoin spot ETF: “there is no reason to continue to deny such applications under inconsistent and discriminatory standards.” https://t.co/6x5XaUsUqT — Ron Hammond (@RonwHammond) September 26, 2023\n\nRelated: Grayscale wins the court battle, but what does this mean for a spot Bitcoin ETF?\n\nThe request came ahead of Gensler’s scheduled appearance before the House Financial Services Committee on oversight of the SEC. All four lawmakers are members of the committee and could address the matter in the Sept. 27 hearing. The proceeding will likely not be affected by the looming threat of a government shutdown, with lawmakers unable to reach an agreement on spending as of the time of publication.\n\nTo date, the SEC has not approved the listing of any spot BTC ETF. Many had expected the commission to reconsider pending ETF applications following the SEC’s loss to Grayscale in court in August. However, the regulator subsequently delayed decisions on ETFs from seven major firms — BlackRock, WisdomTree, Invesco Galaxy, Valkyrie, Bitwise, VanEck and Fidelity.\n\nMagazine: SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbWljcm9zdHJhdGVneS1idXlzLTU0NDUtbW9yZS1iaXRjb2luLWZvci0kMTQ3LjMtbWlsbGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "MicroStrategy Buys 5445 More Bitcoin for $147.3 Million - Nasdaq",
        "content": "In a move that underscores MicroStrategy's unwavering commitment to Bitcoin, the software company has added 5,445 more BTC to its corporate treasury.\n\nThe latest acquisition, made on September 24, 2023, comes at an average price of approximately $27,053 per Bitcoin, amounting to an investment of $147.3 million.\n\nThis purchase brings MicroStrategy's total Bitcoin holdings to a staggering 158,245 BTC, acquired at an average price of around $29,582 per Bitcoin, equivalent to approximately $4.68 billion.\n\nMicroStrategy's CEO, Michael Saylor, has been an outspoken advocate for Bitcoin, touting it as digital gold and emphasizing its role as a strategic treasury reserve asset. This latest acquisition further cements MicroStrategy's position as one of the most prominent institutional investors in Bitcoin.\n\nThe move comes as no surprise to those following MicroStrategy's journey in the world of cryptocurrencies. The company first ventured into Bitcoin investments in August 2020 when it made its initial purchase. Since then, it has continued to accumulate Bitcoin, even using debt to finance some of its acquisitions.\n\nAll the while, Saylor has continued to assert that Bitcoin is \"underestimated\" compared to other crypto market opportunities, as this video from Bitcoin Historian Pete Rizzo shows. Saylor has repeatedly said that altcoins are overvalued and should be sold.\n\nWith the growing recognition of Bitcoin's value as a store of value and a potential hedge against economic uncertainty, it remains to be seen whether more institutions will follow in MicroStrategy's footsteps.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnN1cmFuY2UtY29tcGFueS1hbmNob3J3YXRjaC1yYWlzZXMtJTI0My1taWxsaW9uLXRvLWJyaW5nLW11bHRpc2lnLW1haW5zdHJlYW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Insurance Company AnchorWatch Raises $3 Million to Bring Multisig Mainstream - Nasdaq",
        "content": "AnchorWatch, a leading insurer specializing in safeguarding Bitcoin holdings for commercial entities, announced a successful $3 million funding round today. The round was led by Ten31, with notable participation from Axiom BTC, Bitcoin Magazine Fund, Timechain, Bitcoin Opportunity Fund, and other investors. The infusion of capital will empower AnchorWatch to fulfill regulatory requirements and capital needs, paving the way for the launch of its Trident Vault software and the sale of insurance policies tailored for Bitcoin holders.\n\nAnchorWatch's Trident Vault software represents an another innovative solution for Bitcoin custody, combining protocol-native custody with high-quality, regulated insurance coverage. This addresses a critical gap in the Bitcoin market, providing greater confidence and security to BTC owners.\n\nTrident Vault is a Bitcoin vault designed exclusively for commercial use. It streamlines remote team workflows, introduces key holder seniority, and features time-locked spending conditions, thereby enhancing compliance and governance on-chain.\n\n“Bitcoin owners are still faced with the binary choice between self-custody and third-party sole custodians,” said Robert Hamilton, cofounder and CEO of AnchorWatch. “In the case of the latter, high-risk trading strategies, or worse, blatant fraudulent activities have resulted in catastrophic losses for customers. Thus, they are hesitant to rely on the commercial key holder to deliver the services promised. AnchorWatch makes owning and holding the bearer asset practical, safe, easy, secure, and verifiable.”\n\nAnchorWatch achieves collaborative custody through two key mechanisms. Firstly, Trident Vault facilitates assisted custody by holding a minority of keys and implementing protocol-level governance and compliance. This method enhances security by dispersing custody across different physical locations and unrelated entities, mitigating risks from events like fires, floods, and theft by internal or external actors.\n\nSecondly, AnchorWatch embeds regulated property insurance directly into Trident Vaults. This insurance ensures that assets are protected in the event of catastrophic incidents through regulated and collateralized property insurance. Thanks to Trident's advanced security, AnchorWatch can provide this insurance at competitive rates.\n\nJonathan Kirkwood, Managing Partner at Ten31, highlighted the significance of AnchorWatch's approach: “AnchorWatch is building both the technical infrastructure to advance bitcoin’s potential as programmable money and the credentialed legal/financial infrastructure for bitcoin to be held by commercial institutions via its insurance offerings. This is a pivotal step that directly aligns with our mission at Ten31 to establish bitcoin as a viable asset for institutions, and investing in the companies at the forefront of innovating in the ecosystem.”\n\nAnchorWatch caters to a diverse range of clients, including family trusts, funds, pensions, family offices, Bitcoin miners, and mining pools. The Trident Vault is especially valuable for estate and inheritance planning purposes, serving estate attorneys, investment advisors, and technical advisors who oversee multiple clients' Bitcoin custody needs.\n\nAnchorWatch's commitment to advancing Bitcoin custody and insurance solutions positions them at the forefront of the Bitcoin industry, ready to provide much-needed security and peace of mind for Bitcoin holders.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhhbHZpbmdzLWJ0Yy1wcmljZS1yYWxsaWVzLXVzLXRyZWFzdXJpZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Do Bitcoin halvings spark BTC price rallies, or is it US Treasurys? - Cointelegraph",
        "content": "The relationship between Bitcoin’s price and U.S. Treasury yields has long been considered a strong indicator due to historical data and the underlying rationale.\n\nBitcoin halvings vs. 10-year Treasury yields\n\nIn essence, when investors turn to government-issued bonds for safety, assets like Bitcoin (BTC), which are considered risk-on, tend to perform poorly.\n\nA noteworthy chart shared by TXMC on X (formerly known as Twitter) makes the argument that Bitcoin halvings have coincided with “relative local lows” in the 10-year Treasury yield. Despite the questionable use of the term “relative,” which doesn’t precisely match a three-month low, it’s still worth examining the macroeconomic trends surrounding past halvings.\n\n#BTC halvings have coincidentally arrived at local lows in treasury yields each of the first 3 times. After these moments, risk assets rose broadly while growth expectations also improved.\n\n\n\nThus a myopic Bitcoin narrative about supply shocks was born. But it was always macro. pic.twitter.com/KGQ4TMeKWC — (@TXMCtrades) September 18, 2023\n\nFirst and foremost, it’s important to emphasize that the author asserts that the correlation should not be taken as a “direct causal link between yields and BTC price.” Furthermore, TMXC argues that over 92% of Bitcoin’s supply has already been issued, suggesting that daily issuance is unlikely to be the factor “propping up the asset’s price.”\n\nCould the 10-year yield chart be useful vs. Bitcoin?\n\nFirst, it’s essential to recognize that human perception is naturally inclined to spot correlations and trends, whether real or imaginary.\n\nFor instance, during Bitcoin’s first halving, the 10-year yield had been steadily rising for four months, making it challenging to label that date as a pivotal moment for the metric.\n\nU.S. government bonds 10-year yield, 2012. Source: TradingView\n\nOne might give some benefit of the doubt since, in fact, leading up to Nov. 28, 2012, yields dipped below 1.60%, a level not seen in the previous three months. Essentially, after the first Bitcoin halving, fixed-income investors chose to reverse the trend by selling off Treasurys, thereby pushing yields higher.\n\nHowever, the most intriguing aspect emerges around Bitcoin’s third halving in May 2020, in terms of the “relative” bottom of yields. Yields plunged below 0.8% approximately 45 days before the event and remained at that level for more than four months.\n\nU.S. government bonds 10-year yield, 2020. Source: TradingView\n\nIt’s challenging to argue that the 10-year yield hit its lowest point near the third halving, especially when Bitcoin’s price only gained 20% in the ensuing four months. By comparison, the second halving in July 2016 was followed by a mere 10% gain over four months.\n\nConsequently, attempting to attribute Bitcoin’s bull run to a specific event with an undefined end date lacks statistical merit.\n\nRelated: Bitcoin price at risk? US Dollar Index confirms bullish ‘golden cross’\n\nTherefore, even if one concedes the idea of “relative” local lows on the 10-year yield chart, there’s no compelling evidence that Bitcoin’s halving date directly impacted its price, at least in the subsequent four months.\n\nWhile these findings don’t align with TMXC’s hypothesis, they raise an interesting question about the macroeconomic factors at play during actual Bitcoin price rallies.\n\nNo Bitcoin rally is the same, regardless of the halving\n\nBetween Oct. 5, 2020 and Jan. 5, 2021, Bitcoin saw a remarkable 247% increase in its value. This rally occurred five months after the halving, prompting us to question what notable events surrounded that period.\n\nFor instance, during that time, the Russell 2000 Small-Capitalization index outperformed S&P 500 companies by a significant margin, with a 14.5% difference in performance.\n\nRussell 2000 small-cap index relative to the S&P 500 (blue, right) vs. Bitcoin/USD (orange, left). Source: TradingView\n\nThis data suggests that investors were seeking higher-risk profiles, given that the median market capitalization of Russell 2000 companies stood at $1.25 billion, significantly lower than the S&P 500's $77.2 billion.\n\nConsequently, whatever drove this movement, it appears to have been associated with a momentum toward riskier assets rather than any trends in Treasury yields four months prior.\n\nIn conclusion, charts can be misleading when analyzing extended time periods. Linking Bitcoin’s rally to a solitary event lacks statistical rigor when the upswing generally initiates three or four months after the said event.\n\nThis underscores the need for a more nuanced understanding of the cryptocurrency market, one that acknowledges the multifaceted factors influencing Bitcoin’s price dynamics rather than relying solely on simplistic correlations or isolated data points.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtcHVzaGVzLWRlYWRsaW5lLWFyay0yMXNoYXJlcy1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "SEC pushes deadline for ARK 21Shares spot Bitcoin ETF to January - Cointelegraph",
        "content": "The United States Securities and Exchange Commission (SEC) is taking the maximum time allowed for the regulator to reach a decision on a spot Bitcoin (BTC) exchange-traded fund, or ETF, offering from ARK 21Shares.\n\nIn a Sept. 26 notice, the SEC said it would designate a longer period on whether to approve or disapprove of a proposed rule change that would allow ARK 21Shares’ spot BTC ETF on the Cboe BZX Exchange. The commission’s previous delay on Aug. 11 gave the regulator until Nov. 11 to decide whether to approve, disapprove, or again defer a decision.\n\n“The Commission finds that it is appropriate to designate a longer period within which to issue an order approving or disapproving the proposed rule change so that it has sufficient time to consider the proposed rule change [...] and the issues raised therein,” said the SEC.\n\nThe delay came the same day the SEC deferred a decision on the Bitcoin ETF offering from fund manager GlobalX. It’s unclear why the commission chose to designate longer periods to determine the fate of the spot Bitcoin ETF applications weeks ahead of their next deadlines in October and November — the regulator has usually waited until a few days before any deadline to file a delay.\n\nWith the additional 60 days to consider ARK 21Shares’ offering, the SEC’s final deadline for ARK 21Shares will be Jan. 10 — 240 days after the initial application was filed. The next deadline for GlobalX’s ETF will fall on Nov. 21.\n\nUPDATE: Wow. The SEC just came out SUPER early and delayed the @ARKInvest / @21Shares #Bitcoin ETF filing. This thing wasn't due for a decision until Nov 11.\n\n\n\nAlso delaying the @GlobalXETFs application which was due Oct 7. pic.twitter.com/7DiBq1h4Ef — James Seyffart (@JSeyff) September 26, 2023\n\nThe filing followed a letter from a group of four U.S. Representatives calling for SEC chair Gary Gensler to “immediately” approve a spot Bitcoin ETF. The lawmakers claimed the SEC was practicing “inconsistent and discriminatory standards” in approving ETFs linked to crypto futures but not spot investment vehicles.\n\nRelated: Following SEC delays, ARK Invest and 21Shares file for spot Ether ETF\n\nTo date, the SEC has not approved any spot BTC ETF for listing on a U.S.-based exchange. Many industry experts had speculated the commission would reconsider pending ETF applications following the SEC’s loss to Grayscale in court in August.\n\nAt the time of publication, the next deadlines for spot crypto ETF applications from 7 major firms — BlackRock, WisdomTree, Invesco Galaxy, Valkyrie, Bitwise, VanEck and Fidelity — are scheduled for October. The SEC can delay or extend these deadlines until March.\n\nMagazine: SEC delays BTC ETF decision, Grayscale triumphs over SEC and BitBoy gets the boot: Hodler’s Digest, Aug. 27 – Sept. 2"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xOTg2MzYvdGhpcy11cGRhdGUtY291bGQtY2hhbmdlLWJpdGNvaW4tZGV2ZWxvcG1lbnQtZm9yZXZlctIBVGh0dHBzOi8vZGVjcnlwdC5jby8xOTg2MzYvdGhpcy11cGRhdGUtY291bGQtY2hhbmdlLWJpdGNvaW4tZGV2ZWxvcG1lbnQtZm9yZXZlcj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "This Update Could Change Bitcoin Development Forever - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\n\"Libbitcoinkernel\" is a far-reaching, in-progress face-lift of Bitcoin's code that's been flying under the radar, but is likely to make it easier for developers to experiment with changes to Bitcoin.\n\nThe goal of the ambitious project is to untangle Bitcoin Core's code—the main software underlying Bitcoin—so that much of the \"security-critical\" code is sliced out from the rest of it. By doing so, it could unclog the path to new Bitcoin improvements.\n\nUntangling this code makes developers’ lives easier and the changes are likely to (eventually) ripple out to users as well. The faster developers can write up new features—whether privacy, security, or easier-to-use wallet tools — the faster users can take advantage of them.\n\nAD\n\nAD\n\nLibbitcoinkernel has a long-winded and esoteric name because the idea is it will ultimately be a library that developers can use. But even if it’s specifically geared towards developers, it could have wider consequences for the BTC universe.\n\n\"The thing that really drew me towards dedicating time to Libbitcoinkernel was when I realized that it could be a technical solution to some of Bitcoin Core’s social hurdles,\" Bitcoin developer Carl Dong told Decrypt. He's the one who initially spearheaded the project.\n\nWe've also made substantial progress on libbitcoinkernel's Phase 1, with many consensus-critical modules now decoupled from non-consensus-critical ones.🪢 https://t.co/GRSSqITJOt This work will be continued by @the_charlatan_, Cory Fields, and other members of the community. 3/n — Carl Dong (@carl_dong) August 31, 2022\n\nDong has since stepped back, letting Spiral-backed developer Sebastian Kung, veteran Bitcoin Core contributor Cory Fields, and others take the reins. Kung told Decrypt that he believes Libbitcoinkernel is one of the most impactful projects to be working on in Bitcoin right now.\n\nAvoiding a ‘nightmare scenario’\n\nUnderstanding Libbitcoinkernel starts with understanding “consensus” code. Consensus code is security critical code in Bitcoin Core, Bitcoin’s main underlying node software. This is the code that keeps all the nodes in the network in agreement with one another.\n\nAD\n\nAD\n\nIf half the network follows some rules, while the other half follows slightly different rules, this could lead to an unintentional “hard fork,” where the network effectively splits into two. “That’s the nightmare scenario that keeps Bitcoin developers up at night,” Dong said in a video presentation explaining his work on Libbitcoinkernel.\n\nThe issue is, the consensus code is tangled up with all the rest of Bitcoin Core’s code. This is a pain for developers trying to make changes, because it’s not always easy for them to detect when they’re touching a security-critical piece of code. And even if they do know, it can take some time to work around it.\n\nThe goal of Libbitcoinkernel is to slowly extract all this code into a separate library, so developers working on other sections of the code don’t have to nervously tip toe around it.\n\nIf developers can spend less time on trying to make sure they aren’t accidentally poking any landmines in the consensus code, they can spend more time on more interesting BTC features or bug fixes.\n\n“This allows developers to give more focused review on the critical consensus code while worrying less about the rest of Bitcoin Core. It also allows developers to talk about the body of consensus code as a well-defined entity for the first time,” Kung told Decrypt.\n\nThe 'flashy' goal: Multiple Bitcoin clients\n\nThere's also a second more long-term goal that can be achieved with the help of Libbitcoinkernel. Bitcoin Core is the main implementation of Bitcoin's code. Users run it to connect to the Bitcoin network and to verify transactions.\n\nBut what if there were other choices besides Bitcoin Core? If this was an option, developers would have a way to experiment with new features more easily. “Implementations can also prioritize features differently to serve their target users better,” Dong explained.\n\nAD\n\nAD\n\nSecond, multiple Bitcoin implementations could increase resiliency of the network—if one implementation is floored by a non-consensus related bug, the other implementation might be unaffected by the same bug, keeping Bitcoin intact. This could bolster Bitcoin’s decentralization, which is, well, BTC's entire M.O.\n\nBut multiple clients is easier said than done. Without Libbitcoinkernel, many BTC developers expressed concerns about having multiple implementations. The reasoning goes back to the tangled up consensus code. Say “Bitcoin B” tries to copy Bitcoin Core’s code. If Bitcoin B developers make a single misstep reimplementing this code, the network could split into two in an unintentional hard fork.\n\nLibbitcoinkernel could change this. By extracting the consensus code into a separate library, the Bitcoin Core and Bitcoin B can use the same consensus code. There’s no longer any need to worry about consensus subtle discrepancies wrecking havoc between the two implementations.\n\n\"Having a reusable consensus library would allow people to build alternative Bitcoin implementations, which were previously thought to be too dangerous because of the now-eliminated potential consensus incompatibilities,\" Dong said.\n\nLearning from abandoned attempts\n\nExtracting the consensus code from the rest is not a new idea. Early on in Bitcoin’s history, some of the consensus code was extracted, but the project was left unfinished. Then a 2016 attempt at resurrecting the project perhaps “crumbled under the weight of its own ambition,” as Dong put it.\n\nWith that in mind, Dong and Kung have been taking a more iterative approach in extracting the consensus code from the rest, one which “respects the sheer size of work.”\n\nWith that, the project has become a years-long, multi-step project, which ultra-curious readers can track on GitHub, the open source developer Mecca. The project’s developers have contributed tens of pull requests—proposed changes to Bitcoin Core—and there’s still much more to do.\n\nDevelopers expect the full project will take a number of release cycles. “This project is a marathon,” Dong said, “and a long one at that.”\n\nAD\n\nAD"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWdyYWZmaXRpLWNyZXctc3RyZWV0LWN5YmVyLXNwcmVhZGluZy1tZXNzYWdlcy1hYm91dC1idGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "From walls to wallets: Barcelona graffiti artists share their love for Bitcoin - Cointelegraph",
        "content": "From skate parks and construction sites to train stations and bus stops, a pair of Bitcoin-loving graffiti artists from Barcelona, Spain have been working tirelessly to spread the good word about Bitcoin.\n\nStreet Cy₿er, a collective of artists and enthusiasts, has been creating Bitcoin (BTC) street art all over Europe since its formation in January 2023 to raise awareness about the cryptocurrency.\n\nOne of Street Cy₿er’s co-founders, “Street,” told Cointelegraph that the crew is made up of over 100 educators, enthusiasts, artists, musicians, activists and journalists. Their efforts can be seen across Barcelona, London, Berlin, Madrid, Prague, Riga (Latvia) and Tallin (Estonia).\n\nBitcoin graffiti on Street CY₿ER’s website. Source: Street CY₿ER.\n\nMuch of their artwork, which they share on social media, aims to deliver powerful statements about the traditional financial system’s purported failures and where Bitcoin can step in. Other pieces of art simply look to raise awareness about cryptocurrency. Street told Cointelegraph:\n\n“Street art is also a way to bypass the traditional media, which is often controlled by powerful interests.”\n\nHe said Street Cy₿er’s motivation behind the Bitcoin street art is plain and simple: to push for a fairer world.\n\n“The symbiosis between street art and Bitcoin is a powerful one. By working together, these two movements help to create a more just and equitable world.”\n\nThe Street Cy₿er website’s gallery currently shows more than 70 images of their artwork, all of which feature the Bitcoin logo or mention its name.\n\n“Buy Bitcoin, defund the state”\n\nBitcoin graffiti by Street Cy₿er. Source: Street Cy₿er\n\nSpeaking to specific pieces of their work, Street said the premise behind “Buy Bitcoin Defund The State” was to get people thinking about how Bitcoin can help create a freer society by reducing the role of the state in people’s lives.\n\n“Bitcoin is a peaceful way to protest against the state and its policies. It is a way to opt out of the traditional financial system [and] escape the tyranny of the state.”\n\nStreet said Bitcoin is being used to build a “new society” that flourishes off of individual freedom and voluntary cooperation — a philosophy pushed by many cryptocurrency-anarchists around the world.\n\n“Make war unaffordable”\n\n“Make War Unaffordable” poster. Source: Street Cy₿er\n\nStreet says Bitcoin’s scarcity will make it difficult for governments to wage wars because they cannot print more BTC to finance them.\n\n“This will make it more difficult for governments to maintain large militaries and will make war less affordable,” he said.\n\nIf wars were hypothetically funded with Bitcoin, the cryptocurrency’s transparency would make it tough for state actors to hide war spending, believes Street, and such attacks would be more likely to be picked up by opposing states.\n\nGraffiti artist at work. Source: Street Cy₿er\n\nAdditionally, Street said the “Bitcoin Makes War Unaffordable” message ties back to promoting peace and freedom around the world.\n\n“Print books, not money”\n\n“Print Books Not Money” poster at a bus interchange in Barcelona. Source: Street Cy₿er\n\nStreet believes that if states used Bitcoin to fund education as opposed to printing money, free education worldwide could become a possibility.\n\nDue to Bitcoin’s scarcity, governments would think twice about where they allocate it, said Street:\n\n“Bitcoin is a scarce resource, so governments would have to be careful about how they spend it. This would make governments more accountable to their citizens and would help to ensure that education is a top priority.”\n\nNot all of Street Cy₿er’s Bitcoin street art is politically motivated — the crew is also appealing to cartoon lovers by showcasing Bitcoin’s symbol with the likes of Mario and Ronald McDonald.\n\nBitcoin graffiti by Street Cy₿er. Source: Street Cy₿er\n\nThe Street Cy₿er team recently created a “Bitcoin: The Art of Revolution” project based in Barcelona, Spain, which will host several exhibitions, workshops and classes for those wanting to learn more about Bitcoin.\n\n\"Announcing our newest Project!\"https://t.co/yqpZNf6owr\n\n\n\nName: “Bitcoin: The Art of Revolution\n\n\n\nLocation: Popular street art space in Barcelona such as the Gothic Quarter or Poblenou\n\n\n\nContent: The exhibition will feature a variety of street art installations, digital art… https://t.co/1vEiwYfq8G pic.twitter.com/UhAFzYrfFO — ⚡️Street CY₿ER⚡️ (@streetcyber_) August 23, 2023\n\nBitcoin logo around the world\n\nBitcoin proponents have also been using other innovative ways to spread the word about the cryptocurrency.\n\nIn March, a Bitcoin logo captioned “Study Bitcoin” was projected on the European Central Bank in Frankfurt, Germany and on the central banks of other countries such as the Czech Republic and Switzerland.\n\nThe projection occurred at a time when the global banking sector was under the spotlight following the collapse of Silicon Valley Bank and Signature Bank in the United States.\n\nLove the fact that it says \"Study Bitcoin\" and not \"Buy Bitcoin\".\n\n\n\nLogo projected onto the ECB building in Frankfurt.\n\n@artsince2010 pic.twitter.com/UtNNeFkFEI — Anita ⚡️‍ Bitcoin for Fairness (@AnitaPosch) March 30, 2023\n\nRelated: Bitcoin has entered a civil war — Over ‘art’\n\nAnother Bitcoin logo was shined on Berliner Fernsehturm tower, Germany’s tallest building, a few months earlier in January. The German Bitcoiner behind the idea said they wanted to call attention to the cryptocurrency.\n\nA spartan with Bitcoin-logoed eyes, captioned “HODL (Hold On for Dear Life),” was spotted by pedestrians in Hong Kong in 2020.\n\nThe art even received admiration from Tyler Winklevoss, CEO of cryptocurrency exchange Gemini.\n\n#Bitcoin street art in the heart of Hong Kong. Spartans HODL! pic.twitter.com/9EK8XOvnw4 — Tyler Winklevoss (@tyler) December 9, 2020\n\nSome advocates have gone with simpler means to spread awareness. “Stuff4btc” has been spreading the message by putting stickers on chairs, tables and light poles in the public.\n\nMagazine: Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iZXlvbmQtZmluYW5jZS1hbmQtYml0Y29pbi1ob3ctYmxvY2tjaGFpbi1pcy1kaXNydXB0aW5nLXNlY3VyZS1tZXNzYWdpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Beyond finance and Bitcoin: How blockchain is disrupting secure messaging - Cointelegraph",
        "content": "In the evolving landscape of decentralized messaging apps, Session stands out as a frontrunner, offering a robust, open-source and fully decentralized platform that puts security first and gives back data control to users.\n\nBlockchain is, by default, associated with financial applications and profit-making opportunities, with Bitcoin (BTC) being its first use case and decentralized finance (DeFi) representing its most promising trend.\n\nHowever, the technology is industry-agnostic and can transform any data-driven market where privacy and security are core elements.\n\nThe financial sector has already embraced the potential of blockchain technology, with influential global institutions such as the International Monetary Fund and the Bank for International Settlements regularly discussing it. However, there is another sector in need of increased security and decentralization — communication.\n\nThe most popular messaging apps, including WhatsApp, Telegram, Signal and Threema, use centralized servers, which leaves them vulnerable to security challenges like hacking attacks. This can affect the millions of users sharing their data with these apps. For example, in 2021, Facebook (now Meta) experienced a personal data leak that affected a whopping 500 million users, who saw their details shared online.\n\nWhile these centralized messaging apps apply advanced encryption methods, their centralized architecture is a security issue. Users have to trust these entities in the first place — sharing one’s name, phone number and even their bank account details with an unknown entity doesn’t come naturally to the modern individual without an element of trust.\n\nDecentralized messaging apps can bring more utility to the crypto world\n\nBuilding a decentralized messaging infrastructure can ensure greater privacy and security for end users and give them more control over their information while providing blockchain technology a considerable new market to demonstrate its potential to regular people. Acquiring new users beyond the tech-savvy crypto community is still a big task for blockchain, and communication is the most relevant market where this should happen.\n\nPreviously, explaining the benefits of decentralized, peer-to-peer (P2P) communication was more difficult, as most people would opt for a good user experience in any case. Today, decentralized messaging apps can leverage a large user base of cryptocurrency users who understand the power of censorship-resistant architecture very well. Eventually, regular people may use these messaging apps and join the Web3 space without necessarily hunting for profits or having to buy tokens.\n\nHow this decentralized messaging app offers privacy and security on layer 1\n\nSeveral decentralized messaging apps are addressing the persistent challenges of their centralized counterparts. The most popular of them is Session, an open-source, completely decentralized and end-to-end encrypted messaging app.\n\nSession has been running on the Oxen Service Node Network, a proprietary layer-1 network that comprises more than 1,700 community nodes dispersed worldwide. This infrastructure offers a private messaging experience for people who want to communicate freely without the fear of censorship or surveillance. The app, which currently boasts more than 800,000 monthly active users, is free to use and doesn’t require a phone number or email address to register.\n\nSource: Session\n\nAnother privacy-focused application that utilizes cryptocurrency to provide users with a better experience than competing apps is Brave Browser, which uses BAT (Basic Attention Token) to allow users to be paid directly by advertisers for their attention. Today, they have nearly 60 million users, and Session is well underway to become the Brave Browser of messaging apps.\n\nBy integrating crypto seamlessly into the app's infrastructure, it is able to provide security features that would not be possible without decentralization, and which centralized apps struggle to compete with. Likewise, users can easily avoid interacting with the token that powers the app if they choose to, meaning that the potential market for the product is not limited to crypto users only.\n\nThese sorts of applications can unlock the true potential of Web3. The key to mass adoption is that users don’t need to know how it works — it just works.\n\nSource: Protonmail\n\nChris McCabe, CEO of Session, said:\n\n“Session is a rare gem in the decentralized app space. It’s not just about blockchain. It’s about building an easy-to-use and functional platform. By putting the user first and letting crypto do the hard work behind the scenes, Session has carved out a niche that resonates with the real world.”\n\nThe door to mass adoption\n\nSession has been able to establish a strong reputation and uniquely large user base while running on a layer 1 chain. The next step on the road to mass adoption will allow it to fully take advantage of the power of Web3.\n\nThe app is in the process of transitioning from the layer-1 Oxen chain to an EVM-compatible chain, and the OXEN coin will become Session Token: a new ERC-20 token that will run on a layer 2 chain and be compatible with most Web3 applications. Session Token (SENT) will have a totally upgraded tokenomic structure that is designed to drive growth and enable scalability for Session and its network.\n\nEVM-compatible layer 2 networks such as Arbitrum, Optimism and Polygon bring more opportunities for Web3 integrations, easier access to liquidity and decentralized exchanges, as well as a familiar onboarding process. This is a major change that will resolve many of the challenges that have previously affected Sessions’ crypto layer.\n\nAdditionally, the use cases of the Session tokens will extend beyond just a means of exchange within the app to potentially support in-app purchases, governance, premium features or bridging communications with other DApps.\n\nIn essence, Session’s move to EVM compatibility is not only a technological advancement but a significant step that has the potential to revolutionize the crypto communication market and redefine the landscape of decentralized and more secure messaging.\n\nLearn more about Session"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY2FuLWJpdGNvaW4tb3ZlcnRha2Utb3RoZXItbWVhbnMtb2YtcGF5bWVudHMtaW4tMjAyNC_SAWhodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2Nhbi1iaXRjb2luLW92ZXJ0YWtlLW90aGVyLW1lYW5zLW9mLXBheW1lbnRzLWluLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Can Bitcoin Overtake Other Means of Payments in 2024? - Finance Magnates",
        "content": "As the world of cryptocurrency continues to expand, Bitcoin remains the most well-known and extensively used digital currency. It has established itself as a valuable store of value and a potential inflation hedge. However, many fans and investors are wondering whether Bitcoin can transition from being solely a store of wealth to a mainstream form of payment in 2024 and beyond.\n\nThe Evolution of Bitcoin: From Digital Gold to Digital Cash\n\nSatoshi Nakamoto, the enigmatic developer of Bitcoin, envisioned it as a peer-to-peer electronic payment system. It has undergone considerable changes over the years, with many now perceiving it as digital gold or a long-term store of value rather than a medium of exchange for everyday transactions.\n\nThe limits of Bitcoin's blockchain technology contributed to the shift from a digital currency system to a digital gold narrative. Because of scalability concerns and transaction fees, the Bitcoin network was less viable for modest, everyday transactions when compared to speedier and cheaper alternatives such as credit cards or digital wallets.\n\nSolutions for Layer 2 and Scalability\n\nThe rise of layer 2 solutions is one of the primary advances targeted at tackling Bitcoin's scalability difficulties. These are alternative protocols or networks developed on top of the Bitcoin blockchain, with the goal of enabling faster and more cost-effective transactions.\n\nThe Lightning Network is the most well-known example of a layer 2 Bitcoin solution. Off-chain transactions are possible, allowing users to conduct microtransactions and peer-to-peer payments with cheap costs and near-instant settlement. While still in its early phases, the Lightning Network shows promise in terms of boosting Bitcoin's utility as a payment method.\n\nAdoption by Institutions and Merchant Acceptance\n\nBitcoin's trajectory to becoming a mainstream payment method is inextricably linked to its acceptance by institutions and retailers. Some well-known organizations and financial institutions have begun to accept Bitcoin in recent years. Bitcoin has been incorporated to the balance books of major firms such as Tesla and Square, indicating the cryptocurrency's rising acceptance.\n\nFurthermore, some payment processors and fintech firms have integrated Bitcoin into their platforms, allowing users to seamlessly purchase, sell, and spend Bitcoin. The extent to which Bitcoin is accepted by mainstream merchants, on the other hand, remains a key element. Adoption by stores and enterprises would greatly improve its usability as a payment mechanism.\n\nConsiderations for Regulation\n\nThe regulatory climate has a significant impact on Bitcoin's presence in the payments sector. Governments and regulatory organizations throughout the world are actively monitoring cryptocurrencies, and their attitude to regulation may have an impact on Bitcoin's adoption as a payment method.\n\nClear and supportive legislation can instill trust and stability in businesses and consumers, encouraging increasing use of Bitcoin for payment. Stringent or ambiguous laws, on the other hand, may stifle its growth as a payment method, since firms may be hesitant to accept it due to compliance issues.\n\nPayment Methods That Compete\n\nOther digital payment mechanisms, such as stablecoins, central bank digital currencies (CBDCs), and developing cryptocurrencies, compete with Bitcoin. Stablecoins, such as USDC and USDT, provide price stability, making them more suitable for routine transactions.\n\nCBDCs, or digital representations of a country's fiat currency issued by its central bank, compete with Bitcoin as well. These digital currencies seek to combine the advantages of blockchain technology with the security of traditional fiat currencies.\n\nConsumer Attitudes and Trust\n\nConsumer behavior and trust are important elements influencing Bitcoin payment adoption. Bitcoin remains a somewhat confusing and volatile asset for many people. Price fluctuation, in particular, can prevent people from using Bitcoin for regular transactions because they are concerned about the currency's purchasing power.\n\nTo obtain widespread acceptability, Bitcoin must first establish customer confidence, ensuring that people are comfortable using it for both large and small transactions. The importance of education and user-friendly interfaces in attaining this goal cannot be overstated.\n\nDecentralized Finance's (DeFi) Role\n\nOne of the most notable advances in the blockchain space has been decentralized finance, or DeFi. On blockchain networks, DeFi platforms strive to imitate traditional financial services such as lending, borrowing, and trading. These services frequently accept cryptocurrency as payment and collateral.\n\nBitcoin's integration into the DeFi ecosystem could influence its evolution as a payment method. Projects that connect Bitcoin to DeFi platforms or allow it to be used as collateral for decentralized loans could broaden Bitcoin's utility beyond that of a store of value.\n\nExternal Events and Timing\n\nTiming and external events will also have an impact on Bitcoin's route to becoming a widespread payment method in 2024 or later. Economic crises, currency depreciation, or advancements in blockchain technology could hasten or slow its adoption.\n\nFor example, if a big economic crisis occurs, Bitcoin's appeal as a hedge against inflation and a means of transferring wealth across borders may increase, potentially leading to more widespread payment use.\n\nThe Rise of Stablecoins, the Threat to Visa, and the Uncharted Path of Digital Payments\n\nThe rise of dollar-pegged cryptocurrencies poses a significant challenge to industry giants like Visa, underscoring the immense potential in the digital payment sphere. Surprisingly, this trend has yet to be fully reflected in the stock market.\n\nStablecoins, with Tether as the largest representative, are typically tethered one-to-one to the U.S. dollar. They serve as the foundation of the cryptocurrency economy, often backed by cash or short-term Treasuries. Historically, these tokens have provided substantial liquidity to crypto trading and acted as a gateway for dollars into the digital assets realm. Now, their role in facilitating payments is on the rise.\n\nIn 2022, stablecoins facilitated transactions exceeding $11 trillion on the blockchain, surpassing PayPal's processing volumes and nearing Visa's transaction value of $11.6 trillion, according to a report by macro hedge fund Brevan Howard. More than 25 million blockchain wallets hold over $1 in stablecoin, with 80% of these wallets containing $100 or less. To put this into perspective, a bank with 25 million accounts would rank as the fifth-largest in the United States.\n\nThe surge in stablecoin usage highlights a lucrative opportunity for expansion in the payment sector. The issuer of Tether, for instance, is poised to generate nearly $6 billion in profit this year—surpassing BlackRock's earnings—thanks to its straightforward strategy of earning interest on the deposits backing its token.\n\nCoinbase, $COIN, is acquiring a minority stake in Circle Internet Financial. — unusual_whales (@unusual_whales) August 21, 2023\n\nCrypto brokerage Coinbase Global also made a notable move by acquiring a minority stake in Circle Internet Financial, issuer of the USD Coin, the second-largest stablecoin.\n\nHowever, the predominant challenge for stablecoins and companies looking to capitalize on their popularity remains regulation, or the lack thereof. U.S. lawmakers and regulators have scrutinized stablecoins early on, but progress toward regulatory clarity has been sluggish, with a potential resolution years away. This regulatory uncertainty is likely to continue dampening investor interest in the sector.\n\nFinal Thoughts on Bitcoin's Future\n\nWhile Bitcoin has made great progress in becoming a recognized asset and store of value, it is still a long way from becoming a widespread form of payment. Layer 2 solutions, institutional adoption, favorable legislation, and competition from alternative payment systems are all important factors in influencing its future.\n\nBitcoin's capacity to address scalability challenges, create consumer trust, and achieve wider acceptance by merchants and institutions will determine if it can surpass traditional forms of payment in 2024. The ability of the cryptocurrency to adapt to shifting market conditions and customer tastes may eventually determine its progression from digital gold to digital cash.\n\nBitcoin's place in the payments environment will undoubtedly be a source of curiosity and debate among enthusiasts, investors, and industry players as the cryptocurrency field evolves."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLWdyaW5kcy1sb3dlci0yNjAwMC_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvYml0Y29pbi1wcmljZS1ncmluZHMtbG93ZXItMjYwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price Grinds Lower And Seems Like Bears Are Not Done Yet - NewsBTC",
        "content": "Bitcoin price is again moving lower below the $26,500 support. BTC remains at risk of more losses below the $26,000 support in the near term.\n\nBitcoin started a fresh decline after it failed to clear the $27,500 resistance.\n\nThe price is trading below $26,500 and the 100 hourly Simple moving average.\n\nThere is a major bearish trend line forming with resistance near $26,500 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair is now at risk of more downsides below the $26,000 level.\n\nBitcoin Price Drops Again\n\nBitcoin price failed to clear the $27,500 resistance and started a fresh decline. BTC traded below the $27,000 and $26,500 support levels to enter a bearish zone.\n\nThere was also a move below the $26,200 support level. The price tested the $26,000 zone. A low was formed near $26,026 and the price is now consolidating losses. It is trading just above the 23.6% Fib retracement level of the recent decline from the $26,711 swing high to the $26,026 low.\n\nBitcoin is now trading below $26,500 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $26,350 level. The first major resistance is near the $26,500 zone, a connecting bearish trend line, and the 61.8% Fib retracement level of the recent decline from the $26,711 swing high to the $26,026 low.\n\nSource: BTCUSD on TradingView.com\n\nThe next key resistance could be near the $26,700 level, above which the price could gain bullish momentum. In the stated case, the price could even rise toward the $27,000 resistance. Any more gains might call for a move toward the $27,500 level.\n\nMore Losses In BTC?\n\nIf Bitcoin fails to start a fresh increase above the $26,500 resistance, it could continue to move down. Immediate support on the downside is near the $26,050 level.\n\nThe next major support is near the $26,000 level. A downside break and close below the $26,000 level might send the price further lower toward the next support at $25,400 in the coming sessions. Any more losses might call for a test of $25,000.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level.\n\nMajor Support Levels – $26,000, followed by $25,400.\n\nMajor Resistance Levels – $26,350, $26,500, and $26,700.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9taWNyb3N0cmF0ZWd5LWV4cGFuZHMtYml0Y29pbi1ob2xkaW5ncy13aXRoLTE0Ny0zLW1pbGxpb24tcHVyY2hhc2Uv0gFsaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYml0Y29pbi1uZXdzL21pY3Jvc3RyYXRlZ3ktZXhwYW5kcy1iaXRjb2luLWhvbGRpbmdzLXdpdGgtMTQ3LTMtbWlsbGlvbi1wdXJjaGFzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "MicroStrategy Expands Bitcoin Holdings with $147.3 Million Purchase - NewsBTC",
        "content": "In a strategic move, MicroStrategy, the business intelligence (BI) company, and its subsidiaries have made a bold financial maneuver by increasing their Bitcoin (BTC) holdings.\n\nMicroStrategy Bolsters BTC Holdings\n\nAccording to a recent filing with the US Securities and Exchange Commission (SEC), MicroStrategy has expanded its Bitcoin holdings by acquiring an additional 5,445 BTC, totaling approximately $147.3 million. The average purchase price for these Bitcoins was $27,053 per unit.\n\nWith this latest acquisition, MicroStrategy’s total Bitcoin holdings now stand at 158,245 BTC. The company has accumulated this substantial amount of digital assets at an average price of around $29,582 per Bitcoin, equivalent to approximately $4.68 billion.\n\nAccording to the company, these acquisitions underscore MicroStrategy’s commitment to Bitcoin and long-term belief in its potential. The company has been actively accumulating Bitcoin over time, establishing itself as a major participant in the cryptocurrency market.\n\nIn contrast, MicroStrategy’s stock, listed as MSTR on the Nasdaq, has followed a prolonged downward trend since July 13th.\n\nAs of the latest trading session, the stock is currently priced at $321.25, reflecting a decrease of 0.14% since the stock market’s opening.\n\nNotably, the stock’s performance has exhibited a significant correlation with the value of Bitcoin over the same period, as both have experienced declines.\n\nFurthermore, MicroStrategy’s decision to expand its Bitcoin portfolio coincides with a consolidation phase in the cryptocurrency market. Bitcoin has been trading between $25,000 to $27,000 since August 16.\n\nThe largest cryptocurrency in the market is valued at $26,200, representing a 1.5% decline over the past 24 hours and a decrease of over 4% over the past seven days.\n\nBitcoin Bearish Fractal Holds Strong\n\nRenowned crypto analyst Rekt Capital suggests that the bearish Bitcoin fractal, previously highlighted by NewsBTC, remains intact, raising whether the cryptocurrency is still in Phase A-B or has transitioned to Phase B-C, as seen in the chart below.\n\nAccording to Rekt Capita, Bitcoin typically forms a new lower high in Phase A-B, and recent price movements, whether reaching around $29,000 or as low as $27,400, satisfy this criterion.\n\nHowever, a more pronounced lower high is possible if the support level of $25,000 to $26,000 is broken and the Bull Market Support Band becomes resistant.\n\nFor Phase B-C to commence, two conditions need to be met. Firstly, a relief rally must occur, confirming a new lower high. Secondly, the $25,000 to $26,000 support area must be lost.\n\nAlthough a relief rally forming a new lower high has been witnessed recently, the second condition remains unfulfilled. Phase B-C will be initiated if the $25,000 to $26,000 support area fails.\n\nSeveral key technical events are anticipated. During the downward movement, Bitcoin may briefly touch the $25,000 to $26,000 area. If the price struggles to surpass $26,000 and acts as resistance, it could indicate weakening support in the $25,000 to $26,000 range.\n\nIn such a case, a collapse to the $22,000 to $24,000 region might occur to establish a local bottom denoted as “C.”\n\nTo invalidate the bearish Bitcoin fractal, three criteria need to be met. Firstly, the Bull Market Support Band must be held as support. Secondly, a weekly close above the lower high resistance is required. Finally, breaching the yearly high of $31,000 would further challenge the bearish scenario.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xOTg1OTYvbWljcm9zdHJhdGVneS1idXlzLWFub3RoZXItMTQ3LW1pbGxpb24td29ydGgtYml0Y29pbtIBVGh0dHBzOi8vZGVjcnlwdC5jby8xOTg1OTYvbWljcm9zdHJhdGVneS1idXlzLWFub3RoZXItMTQ3LW1pbGxpb24td29ydGgtYml0Y29pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "MicroStrategy Buys Another $147 Million Worth of Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMicroStrategy, the world’s largest corporate holder of Bitcoin, announced its latest acquisition of the market’s largest cryptocurrency.\n\nPer an SEC filing submitted on Monday, between August 1 and September 24, the firm and its subsidiaries purchased approximately 5,445 Bitcoin for about $147.3 million in cash. The average price per coin, inclusive of fees and expenses, was approximately $27,053.\n\nWith this recent purchase, MicroStrategy has swelled its coffers to an aggregate of about 158,245 Bitcoin purchased at an average purchase price of approximately $29,582.\n\nAD\n\nAD\n\nThe aggregate purchase price for MicroStrategy’s Bitcoin holdings has amounted to $4.68 billion, per the filing.\n\nMicroStrategy has acquired an additional 5,445 BTC for ~$147.3 million at an average price of $27,053 per #bitcoin. As of 9/24/23 @MicroStrategy hodls 158,245 $BTC acquired for ~$4.68 billion at an average price of $29,582 per bitcoin. $MSTR https://t.co/GbJtUoQfXv — Michael Saylor⚡️ (@saylor) September 25, 2023\n\nWhile MicroStrategy's ongoing accumulation of Bitcoin once again underscores the company's confidence in the asset as a store of value and a long-term investment, the continued bear market also means that it is significantly in the red on its historical investments in the first cryptocurrency.\n\nWith Bitcoin down 1.7% on the day and trading just above $26,100 at the time of writing, the fiat value of Bitcoin held on MicroStrategy's balance sheet is currently standing at roughly $4.1 billion.\n\nThe firm previously bought 12,333 BTC for $347 million in June 2023, at an average purchase price of $29,668 per BTC.\n\nAD\n\nAD\n\nMicroStrategy began acquiring cryptocurrency back in August 2020, with co-founder Michael Saylor stating at that time that the primary motivation was to use it as a hedge against inflation.\n\nEarlier this year, Saylor said the company’s strategy “is to buy and hold Bitcoin, and the key for us is to be consistent, transparent and responsible in the pursuit of that strategy.”\n\nMicroStrategy saw its first profitable quarter since 2020 in Q1 2023, primarily attributed to a one-time income tax benefit, sustaining profitability in the second quarter with $22.2 million in net income—despite a $24.1 million impairment charge on its Bitcoin holdings."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm1vcm5pbmdzdGFyLmNhL2NhL25ld3MvMjM5Njg3L2NhdGhpZS13b29kLW9uLWFpLW52aWRpYS1hbmQtYml0Y29pbi5hc3B40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Cathie Wood on AI, Nvidia and Bitcoin - Morningstar.ca",
        "content": "Valerio Baselli: Hello, welcome to Morningstar. The big news within the ETFs space is that the American asset management firm ARK Invest, which specializes in disruptive innovation, has acquired Rize ETF, a London-based provider of thematic and sustainable trackers. To talk about the future of ARK Invest in Europe, among other things, today I'm joined by the well-known founder and CEO of ARK Invest, Cathie Wood.\n\nWhy Did Cathie Wood and ARK Invest Expand Into Europe?\n\nSo, Cathie, first of all, welcome and thanks for being here. Let's start with the basics. Why this takeover in Europe and why now?\n\nCathie Wood: Well, it's been very interesting at ARK practically since the beginning when we monitor who the subscribers are to our research, which we give away free. We have found that 25% of them are from Europe, but we didn't have anything, any strategies, to offer in Europe. And so, we have been looking for quite some time and we found this gem hidden inside of AssetCo, and the DNA was just right. They're thematic, they're futures-oriented, mega-trend oriented, and it seemed like a great fit.\n\nWill Thematic Investing Work in European Markets?\n\nBaselli: So, as you know, thematic investment has enjoyed a booming rise in recent years in Europe, even though the pace of flows, for example, has slowed down compared to the explosion post COVID-19. What are your thoughts in investing thematically, especially here in Europe, where the average investor is probably different from the American one?\n\nWood: Well, judging from the responses to our research, I think the appetite is there. And I also do appreciate, certainly we're learning a lot from our new ARK Invest Europe team, that Europe is different. Different countries have different kinds of appetites for different strategies. I know, for example, Valerio, in your Italy, there's a huge appetite for thematic, perhaps in other areas not. So, we are going to leave it to them to direct us to the right places.\n\nWhy Thematic Investing is the Future, According to ARK Invest\n\nBaselli: That's interesting. What advice would you have for investors shopping for a thematic fund? And are there any themes in your view that don't really have investment merit, at least today?\n\nWood: Well, our focus at ARK Invest has been on actively managed ETFs and other wrappers, focused exclusively on disruptive innovation. And ARK Invest Europe is similarly minded. We don't think there are enough strategies out there that are focused on the future in the ways that we are, grounded in original research. We see a lot of strategies that are somehow flavours of broader-based benchmarks. And we think that the world of technology especially is moving so quickly that it will be very difficult for the benchmarks to keep up. And I'll just give one example. It took the S&P 500 in our country until Tesla [TSLA] reached $500 billion for the S&P to allow it into its index. $500 billion. There are not many companies bigger than that. And yet, in the case of Tesla, we think it has miles to go.\n\nWhy Did ARK Invest Exit Nvidia?\n\nBaselli: And let's talk of your flagship strategy, the ARK Innovation [ARKK] fund. After having performed extremely well between 2017 and 2020, the fund suffered for a couple of years. Now, in 2023, the year-to-date performance is very positive. But some might say that the strategy missed out on a big part of the artificial intelligence rally. The easiest example is of course Nvidia [NVDA], a name that you owned since inception, I believe, which is no more in the portfolio and is up roughly 190% for the year-to-date. So, why did you decide to close out your stake in Nvidia? And do you regret this decision?\n\nWood: Well, if you read our research going back to 2014, we've been very focused on the revolution called artificial intelligence. And we gained exposure to Nvidia when it was $5. Now, it's closer to $450. And we were pounding the table. So, we did very, very well with it. In fact, in the flagship strategy since inception, it is the fourth largest contributor to performance after Tesla, GBTC [GBTC], Invitae [NVTA], which is a genomics name, and then Nvidia.\n\nWhat we've been doing with our research is trying to figure out who else is going to win in a very big way. This is called real original research as opposed to checking a box, artificial intelligence, Nvidia. And we have found that the characteristics of companies that will win in this new age – and this is going to impact every industry, every company – are companies with domain expertise, and when it comes to innovation, that's really important, especially in areas like multiomics sequencing in life sciences. So, they have domain expertise, they have AI expertise, so we look at their talent, and perhaps most importantly, they have proprietary pools of data so that they can evolve specialized AI models and integrate them into the open source models out there to develop very powerful solutions. Almost every name in our flagship strategy is an exposure to artificial intelligence. Nvidia is much more expensive than most of the names in our portfolio, except for perhaps the multiomics names.\n\nNvidia Won't Outperform Our Other Stocks: ARK Invest\n\nBaselli: Yeah, exactly, and I wanted to ask you: What do you think of the current Nvidia valuation? Do you think market's expectations of its growth or margins are overly optimistic?\n\nWood: We think that it's going to be a good stock over time, but we don't think it is going to outperform the other stocks in our portfolio over time as more and more people, analysts, investors, do research, real research, on what this AI revolution means. And so, we think our current positions are misunderstood exposures to artificial intelligence. We do not regret selling Nvidia in the flagship, which has to incorporate all of our innovation platforms, so robotics, energy storage, artificial intelligence, blockchain technology, and multiomics sequencing. The other portfolios, which are more specialized, do own Nvidia. We've just taken the position down quite significantly.\n\nWhich AI Themes Are a Buy Today?\n\nBaselli: All right. Speaking of artificial intelligence, of course, you've been investing in it for years. Do you have a preferred way of gaining exposure to the theme? For instance, what do you prefer among solution providers, hardware providers, or maybe companies who will leverage AI into their own businesses, such as biotech firms?\n\nWood: Sure. As I mentioned, practically every stock in our portfolios we view through an AI lens in the way I described, especially focused on proprietary data. But for every dollar of hardware invested in the AI space – and Nvidia is primarily hardware, evolving more software solutions, but primarily hardware- for every dollar of hardware, we expect 8 to 20 times the amount of software. And so, we have a lot of software-oriented names in our portfolios.\n\nTo give you an example, UiPath [PATH] is a robotics process automation company. It is helping companies automate the most mundane administrative tasks in their companies. And it has proprietary data associated with many companies around the world and the solutions they are evolving to automate these mundane processes, including AI. So, it has all of that proprietary data. Other names that are not familiar, and that's what we offer is diversification in the disruptive innovation space. Other names include Twilio [TWLO], Exact Sciences [EXAS], even Zoom [ZTNO]. I think many people are surprised to see Zoom in our portfolios. But I think many people will be surprised to see how many AI applications Zoom is evolving here. So, on October 4th, stay tuned to Zoomtopia and you'll learn more about it.\n\nARK Invest on Interest Rates\n\nBaselli: Very interesting. Your investment process follows a clear philosophy. It concentrates the portfolio on high-conviction, high-growth names. So, an economic environment with rising interest rates is far from being ideal for this kind of strategy. How do you manage this? And what's your outlook on rates and economic growth?\n\nWood: Yes. During, it was 2021 and '22 that this was a real problem. First, the fear of rising interest rates hurt our strategy, and then the actuality, or the reality of rising rates last year really hurt our strategy. This year we've started outperforming, and I think it is because investors are looking over the top of these interest rate increases and anticipating the end of them, and then ultimately the decline. If we're right, disruptive innovation is going to cause a lot of deflation. That's a good thing. Deflation caused by disruptive innovation will cause an explosion in the growth rates of units in the disruptive innovation space. So, we think we've been through the worst of it, but I will also point to another period where interest rates were rising in 2017, for example. Our response back then is, wait a minute, the Fed is now sure that we're over the '08-'09 crisis, and it is going to allow the markets to work. Our portfolios, the flagship, was up 87% that year, even though interest rates were going up. Now, if interest rates have plateaued or are going down, that will be an extra good environment for our strategies, especially given what happened in '21 and '22. This will be the flip side of that.\n\nWe Are Very Optimistic on Bitcoin: Cathie Wood\n\nBaselli: And of course, if you think of disruptive innovation, you think of digital assets and cryptocurrencies. You have been one of the early adopters of Bitcoin. Now markets await the Securities and Exchange Commission decision on the first Bitcoin spot ETF. But from this point of view, we might say that Europe is probably a bit ahead of the game. There are dozens of crypto ETPs listed in Europe, as you know very well-- you have a partnership with 21Shares, the biggest crypto ETPs provider in Europe. So, what is your outlook for Bitcoin at this stage?\n\nWood: We are very optimistic on Bitcoin. One of the markers or milestones this year that I think surprised everyone was in the United States, we had a regional bank crisis in March. As regional bank stocks were plummeting, and some went bankrupt, Bitcoin increased from 19,000 to 30,000. What was that? That was a flight to safety. One of the reasons regional banks and most banks get into trouble is counterparty risk and depositors fleeing them. If you think about crypto assets and Bitcoin especially, it is completely decentralized. There's no counterparty risk. And it is completely transparent. You can see the movements by IP address and see where there might be trouble brewing. It's a giant neighborhood watch with a lot of people involved. This involves their livelihood. So, we think it's very robust. When institutions get the green light, and I think they're waiting for the SEC, I think that we're going to see significant participation in this new asset class by institutions.\n\nBaselli: Finally, going back to the start of the acquisition of Rize ETF, what will be your role for the European market and overall within the firm? Will you still manage the active ETFs?\n\nWood: Yes, the active equity ETFs ARK Invest in the U.S. will continue to manage. And ARK Invest Europe will manage the ARK indexed thematic strategies, and they also will distribute for us. So, we think it's a win-win.\n\nBaselli: Thank you so much, Cathie, for your time and your insights. I appreciate that. For Morningstar, I'm Valerio Baselli. Thanks for watching.\n\nSaoT iWFFXY aJiEUd EkiQp kDoEjAD RvOMyO uPCMy pgN wlsIk FCzQp Paw tzS YJTm nu oeN NT mBIYK p wfd FnLzG gYRj j hwTA MiFHDJ OfEaOE LHClvsQ Tt tQvUL jOfTGOW YbBkcL OVud nkSH fKOO CUL W bpcDf V IbqG P IPcqyH hBH FqFwsXA Xdtc d DnfD Q YHY Ps SNqSa h hY TO vGS bgWQqL MvTD VzGt ryF CSl NKq ParDYIZ mbcQO fTEDhm tSllS srOx LrGDI IyHvPjC EW bTOmFT bcDcA Zqm h yHL HGAJZ BLe LqY GbOUzy esz l nez uNJEY BCOfsVB UBbg c SR vvGlX kXj gpvAr l Z GJk Gi a wg ccspz sySm xHibMpk EIhNl VlZf Jy Yy DFrNn izGq uV nVrujl kQLyxB HcLj NzM G dkT z IGXNEg WvW roPGca owjUrQ SsztQ lm OD zXeM eFfmz MPk To view this article, become a Morningstar Basic member. Register For Free Already a member? Log In.\n\nSubscribe to Our Newsletters Sign Up Here"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vYWZyaWNhLmJ1c2luZXNzaW5zaWRlci5jb20vbG9jYWwvYmVzdC1iaXRjb2luLWNhc2lub3MtaW4tMjAyMy10b3AtMTAtY3J5cHRvLWNhc2luby1zaXRlcy92NDNzN2040gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Sep 2023 07:00:00 GMT",
        "title": "Best Bitcoin Casinos: Top Crypto Casino Sites in 2023 Ranked by Games & Bonuses - Business Insider Africa",
        "content": "The variety of payment methods is definitely good, but it leaves one major question — how do you select the best Bitcoin casino out of the hundreds on the market?\n\nWell, it takes a lot of time and energy to find the cream of the crop. Lucky for you, we’ve already done the hard work.\n\nAfter testing hundreds of Bitcoin casinos, 7Bit is undoubtedly the king of the crypto-gambling world. However, we’ve got nine other sites that are perfect alternatives.\n\nADVERTISEMENT\n\nReady to explore all of them with us? Let’s begin.\n\nBest Bitcoin Casinos\n\n7Bit: Best overall\n\nBitStarz: 5 BTC welcome offer\n\nWild.io: 10 BTC welcome bonus\n\nIgnition: Daily poker tournaments and events\n\nBovada: 200+ high-quality games\n\nRed Dog: 10+ live dealer games\n\nSuperSlots: Excellent slots selection\n\nmBit: Awesome game variety\n\nBC.Game: Best for altcoins\n\nMirax: Best VIP program\n\nThe best Bitcoin casinos have certainly gained a reputation for quick withdrawals and generous bonuses. Yet, these are just the tip of the iceberg. Join us as we unpack the unique features that set each of these BTC online casinos apart from the rest.\n\n1. 7Bit – Best Bitcoin Casino Overall\n\nADVERTISEMENT\n\nBI Africa\n\nPros:\n\n5 BTC welcome offer\n\n1,200+ games\n\n130+ progressive jackpots\n\n100 free spins\n\nExcellent mobile compatibility\n\n24/7 support\n\nCons:\n\nNo phone line for support\n\nSlightly cluttered homepage\n\nADVERTISEMENT\n\n7Bit has been around since 2014 and offers an impressive library of 1,200 games, a generous 5 BTC welcome offer, and many other exciting features.\n\nIt’s by far the best Bitcoin casino overall - let’s see why.\n\nGame Selection: 5/5\n\n7Bit delivers thousands of top-notch slots and table games. We spent hours exploring the game library and found everything you might want from a Bitcoin casino, and so much more!\n\nIf you thought the number of games was impressive, wait till you hear that they are all sourced from 20 different, world-renowned game providers.\n\nADVERTISEMENT\n\nSome of our favorite BTC games available at 7Bit include JetX, Wild Cash Dice, Dragon's Bonanza, Aviator, 2 Ways Royal, and Plinko.\n\nAdditionally, this Bitcoin casino offers exclusive games you can't find anywhere else, such as 7Bit Bonanza, 7Bit Million (notice a theme?), and many more.\n\nBonuses and Promotions: 4.9/5\n\nNew players at 7Bit are welcomed with a generous 100% deposit match bonus up to 1.5 BTC, along with 100 free spins.\n\nThe welcome offers don't stop there — your first four deposits can net you up to 5 BTC in total!\n\nADVERTISEMENT\n\n7Bit also keeps things interesting with ongoing promotions. Every Monday, for example, you can claim a 25% reload bonus up to 0.001 BTC.\n\nDepositing at least $55 or its equivalent on Wednesdays will grant you an additional 100 free spins.\n\n7Bit offers a strong VIP program and a 15% daily cashback to improve your gaming experience.\n\nSo whether you're new to 7Bit or a returning player, the bonus offerings are designed to make your Bitcoin casino experience more rewarding.\n\nPayment Options: 4.9/5\n\nADVERTISEMENT\n\n7Bit Casino offers a versatile range of payment options, allowing for both cryptocurrency and fiat currency transactions.\n\nWhen it comes to cryptocurrencies, they accept popular choices like Bitcoin, Litecoin, and Ethereum, among others. This means you have a broad range of crypto alternatives if Bitcoin isn't your preferred choice.\n\nIn terms of withdrawal speed, we found 7Bit to be impressive. If you opt for Bitcoin, your payout is processed in as little as 10 minutes, depending on server activity.\n\nUser Interface: 4.9/5\n\n7Bit has a unique retro theme inspired by arcade games.\n\nADVERTISEMENT\n\nNavigating the website is easy and the games are well-organized under different categories. So if you don’t have a specific game in mind, you can easily browse and discover your next favorite BTC title.\n\n2. BitStarz – Best Game Variety of All Top Bitcoin Casinos\n\nFeatured Post\n\nPros:\n\nADVERTISEMENT\n\n5 BTC welcome bonus + 200 free spins\n\nOver 4000 casino games\n\nAverage withdrawal of 8 minutes\n\nExclusive titles\n\n46 reputable software providers\n\n46 reputable software providers\n\nCons:\n\nNo sports betting options\n\nDark website theme might not be for everyone\n\nNot many Bitcoin online casinos can match the number of casino games, generous deposit bonuses, and available payment methods that BitStarz boasts.\n\nThis online casino was created in 2014 by Dama N.V. This company is known for producing many quality crypto gambling sites, making it a standout in the best Bitcoin casinos category, which already speaks volumes.\n\nADVERTISEMENT\n\nLet’s discover more.\n\nGame Selection: 5/5\n\nDo you know how many games you can discover at BitStarz? More than 4,000.\n\nIt is easy to get lost while surfing the website because you have so many options to choose from.\n\nHere, you will be able to discover everything you can think of, including slot games, table games, and live dealer games.\n\nADVERTISEMENT\n\nHowever, what we enjoyed the most was the BitStarz Originals category.\n\nThis section boasts titles that you will be unable to find anywhere on the internet, even in other best Bitcoin casinos. Plinko, Crash, and Limbo are just a few names you will see here.\n\nMoreover, casino games are provided by more than 45 software providers, including BGaming, BetSoft, and Belatra Games. Therefore, high-quality graphics and cool features are guaranteed.\n\nIf you are after the fairness of crypto games, then you are free to visit the Provably Fair Games category.\n\nThis allows players to manually verify the fairness of the titles they are playing.\n\nADVERTISEMENT\n\nBonuses and Promotions: 5/5\n\nPlayers who decide to sign up at BitStarz, a top choice among the best Bitcoin casinos, can claim a huge welcome bonus of 5 BTC and 180 free spins.\n\nThis offer is split over the first 4 deposits, so there is something exciting to look forward to each time you make a payment.\n\nNew customers can also claim a superb no deposit bonus of 20 free spins, so in total, you have 200 free spins to play your favorite online slots.\n\nThe promotions section also includes other exciting offers such as a 50% Monday reload bonus and Wednesday free spins.\n\nADVERTISEMENT\n\nPlayers who decide to stick with this Bitcoin casino can claim great bonuses as a part of the VIP program.\n\nPayment Options: 4.8/5\n\nTo make deposits and withdrawals, BitStarz supports eight different digital coins, including Bitcoin, Litecoin, and Dogecoin, among others.\n\nAccording to the website, the average cash-out time is around 8 minutes, and we can confirm it ourselves.\n\nOne thing that players might find frustrating is that there are no fiat currencies shown in the list of payment options.\n\nADVERTISEMENT\n\nHowever, there is nothing to worry about since you can purchase crypto with your credit/debit cards.\n\nAfter that, cryptocurrencies will automatically be credited to your account, which is super comfortable in the top choice among the best Bitcoin casinos!\n\nUser Interface: 5/5\n\nIn terms of the user interface, BitStarz has done a great job.\n\nThe website uses a darkish theme that is not too dark or very light. The main web page is super informative, displaying some of the most important data for visitors.\n\nADVERTISEMENT\n\nThe games are well-sectioned into different categories, and players can also use a search bar to look for their favorite titles.\n\nIt is even possible to translate the site into several languages, which makes it super comfortable for non-English customers.\n\n3. Wild.io – Top Bitcoin Casino Bonuses\n\nFeatured Post\n\nADVERTISEMENT\n\nPros:\n\n10 BTC welcome bonus\n\n10 different cryptocurrencies are available\n\nExcellent Loyalty Club\n\nAround 1500 games\n\nCons:\n\nMatch percentage varies based on deposit amount\n\nNo support via phone\n\nLooking for crypto casinos that don’t know limits when it comes to deposit bonuses?\n\nADVERTISEMENT\n\nThen Wild.io is the place for you, standing among the best Bitcoin casinos. With a massive welcome bonus, a variety of cryptocurrencies, and an amazing Loyalty Club, Wild.io has it all.\n\nGame Selection: 4.6/5\n\nThe total number of games available at this Bitcoin casino is around 1500.\n\nAmong them are slots, table games, and live casino games. All the popular titles are provided by BGaming, Endorphina, and Belatra, with 10 other top-notch software developers.\n\nIf you are after the bonus buy feature and want to get the best games in this category, we advise you to try Road 2 Riches, Aloha King Elvis, and Joker Queen.\n\nADVERTISEMENT\n\nBonuses and Promotions: 4.6/5\n\nWild.io gives newcomers the chance to boost their deposits with 520% in bonuses.\n\nIn total, players can claim up to 10 BTC as a welcome package. This offer is split over the first 4 deposits, and you can unlock it with as little as $10.\n\nThe good news is that the promotions section is filled with 5 other generous bonuses. 5% daily cashback and wild Monday free spins are our favorite and they stand out even among the best Bitcoin casinos.\n\nPayment Options: 4.65/5\n\nADVERTISEMENT\n\nThis Bitcoin casino is different from the ones we described above because it does not offer any fiat options.\n\nThe only way you can make deposits and withdrawals is by using digital coins. There are 10 available, including Bitcoin, Bitcoin Cash, Dogecoin, and Tether, among others.\n\nBecause this is a crypto-centric site, you can instantly withdraw your money while paying no additional fees.\n\nRelated:\n\nADVERTISEMENT\n\nUser Interface: 4.8/5\n\nThe website of Wild.io looks pretty nice and follows all the modern trends.\n\nOnce you visit it, you will be greeted with a dark theme; however, if you are not a big fan of it, you can easily switch it off.\n\nNavigating is super easy. All the categories are shown on the main page. Once you visit the game section, you can filter the titles using different categories or software providers.\n\nThere’s even a separate search bar that helps you find your favorite crypto games in a breeze.\n\nADVERTISEMENT\n\n4. Ignition – Best Bitcoin Casino for Poker\n\nBI Africa\n\nPros:\n\n$3,000 welcome bonus\n\nWithdrawals in less than 24 hours\n\nDaily poker tournaments and events\n\n25x wagering requirements\n\n13+ top-notch software companies\n\nADVERTISEMENT\n\nCons:\n\nNot every game can be played on mobile devices\n\nNo e-wallet support\n\nIgnition Casino was created back in 2016 and has been known to be one of the best Bitcoin casinos to play poker games.\n\nIts daily tournaments and high player traffic are among the few things you will love about this Bitcoin casino.\n\nGame Selection: 4.8/5\n\nADVERTISEMENT\n\nPoker is the most frequent word you will hear when describing Ignition Casino, and for a good reason.\n\nThere are different types of online poker tournaments here, and the casino's status as one of the best Bitcoin casinos means that you can enter a weekly contest every Sunday with a prize pool of at least $200,000.\n\nThere are different types of online poker tournaments here. For example, you can enter a weekly contest every Sunday with a prize pool of at least $200,000.\n\nYou can qualify for as little as $1, which is definitely super exciting.\n\nHowever, they all offer excellent quality since those titles are provided by great software developers, including RTG and Rival Gaming.\n\nADVERTISEMENT\n\nOn the video poker side of things, this site also shines, as it is easily one of the best 3 card poker sites among the best Bitcoin casinos.\n\nBesides poker, you can play table games, hot-drop jackpots, live dealer games, and even some virtual sports!\n\nBonuses and Promotions: 4.8/5\n\nThe welcome bonus available here, only adding to its reputation as one of the best Bitcoin casinos, is worth up to $3,000 for both poker and casino games if you sign up using the Ignition Casino bonus code or join using our link.\n\nIt is spread across the first two deposits, and the minimum deposit you have to make equals $20.\n\nADVERTISEMENT\n\nThe first time you fund your account, you will get a 150% deposit bonus up to $1,500 for poker, followed by the same amount for the casino section.\n\nThe best thing about it is that it comes with low wagering requirements of 25x.\n\nOf course, things do not end here. The Weekly Boost and Royal Flush Bonus, among others, are all waiting for you to explore.\n\nYou can even get a $100 referral bonus for inviting your friends to this Bitcoin casino, with an extra $25 if your buddy uses crypto to make their first deposit.\n\nPayment Options: 4.9/5\n\nADVERTISEMENT\n\nThe only difference is that here you can also use some fiat currencies with Vouchers, Visa, Mastercard, and Amex.\n\nAs for digital coins, this crypto casino site will let you make deposits using Bitcoin, Bitcoin Cash, Litecoin, and Ethereum. If you decide to go for any of these, you will be able to claim your winnings in less than 24 hours which is quite impressive.\n\nUser Interface: 4.8/5\n\nIgnition Casino’s user-friendly interface, combined with its selection of games and bonuses, solidifies its position as one of the best Bitcoin casinos.\n\nThe frequent use of the color orange is something that will let you remember the website. It is also possible to find all the necessary information with just a few clicks.\n\nADVERTISEMENT\n\nYou can even visit the special Ignition forum in case you need to hear opinions from other players. Moreover, Ignition looks equally good on your smartphone as well.\n\n5. Bovada – Best Bitcoin Casino for Jackpots\n\nFeatured Post\n\nPros:\n\nADVERTISEMENT\n\n$3,750 crypto welcome bonus\n\n25x wagering requirements\n\n9 payment options to choose from\n\nOver 30 sports betting markets\n\n200+ high-quality games\n\nCons:\n\nTransaction fees for credit cards\n\nSimple website design\n\nBovada is one of the most trusted Bitcoin casino sites available on the market and ranks among the best Bitcoin casinos.\n\nWhile traditional online casinos decide to focus only on games that revolve around slots and table games, Bovada chooses to offer you something more with a state-of-the-art sportsbook.\n\nADVERTISEMENT\n\nGame Selection: 4.75/5\n\nThe exact number of games available at Bovada is around 200.\n\nBlackjack games, slots, hot drop jackpots, roulette, and live dealer games are all available here. They are provided by RTG, Rival Gaming, Spinomenal, and Revolver Gaming.\n\nIn case you want to discover games with amazing jackpots, then visit the hot drop jackpots section.\n\n777 Deluxe, Golden Buffalo, and Lady’s Magic Charms all give you a chance to claim massive winnings.\n\nADVERTISEMENT\n\nOnce you are bored of playing online casino games here, you can easily switch to the sports section.\n\nHere, you can make bets on popular events for football, hockey, and basketball, just to name a few.\n\nWant to explore some eSports as well? No problem, as Call of Duty, Dota 2, and League of Legends matches are all available at Bovada, making it one of the best Bitcoin casinos.\n\nBonuses and Promotions: 4.7/5\n\nA quick glance at the available Bovada bonus codes is enough to tell you that this site heavily favors its crypto customers.\n\nADVERTISEMENT\n\nIf you make a deposit with crypto, you will be able to claim more than the standard fiat-based bonus offers.\n\nThe $3,750 casino welcome bonus is spread over your first three deposits, each letting you claim up to $1,250.\n\nSportsbook lovers are not forgotten as well, and they can claim a $750 welcome bonus to bet on their favorite events.\n\nThe promotions section is updated frequently, so make sure to check it out from time to time.\n\nPayment Options: 4.75/5\n\nADVERTISEMENT\n\nBovada offers you a total of 9 payment options, including the most popular digital coins and fiat currencies, an impressive number even among the best Bitcoin casinos. Among them are Bitcoin, Litecoin, Mastercard, Visa, and more.\n\nIn case you want to make fast withdrawals, then we advise you to use cryptocurrencies since your money will arrive in a crypto wallet in less than an hour.\n\nUser Interface: 4.7/5\n\nBovada’s user interface is nothing too different from Ignition. In fact, these two are pretty similar when it comes to categorizing the webpage into different kinds of games.\n\nHowever, it is essential to note that all the necessary information is well-displayed.\n\nADVERTISEMENT\n\nYou just need to click two lines in the upper right corner, and it will let you visit the promotions section along with the help and some articles page.\n\n6. Red Dog – Best Bitcoin Live Casino Games\n\nFeatured Post\n\nPros:\n\nADVERTISEMENT\n\n240% match bonus + 40 free spins\n\nNo fees for transactions\n\n13 live dealer games\n\nAll games offer the demo version\n\nPhone support available\n\nCons:\n\nA high minimum withdrawal fee of $150\n\nNo sportsbook\n\nRed Dog is another great Bitcoin casino that has become quite popular since its launch.\n\nIt was created in the late 2010s and, at first glance, looks like a regular crypto gambling site. However, it is one of the best Bitcoin casinos for people who enjoy live dealer games.\n\nADVERTISEMENT\n\nGame Selection: 4.7/5\n\nThe total number of games at Red Dog is around 160. Some might think that this can never be enough to cater to the needs of most gamblers, but that is far from the truth.\n\nFirst of all, all the titles here are provided by RTG. This company has been known for creating high-quality games, meaning that Red Dog prefers to concentrate on quality rather than quantity.\n\nThe site hosts all kinds of games; however, live casino games are the ones players enjoy the most, placing it among the best Bitcoin casino sites for live titles.\n\nYou have to create an account to be able to play them, but you can test out the other slots and table games even before registering by launching demo/practice mode.\n\nADVERTISEMENT\n\nBonuses and Promotions: 4.6/5\n\nOnce you decide to sign up at this Bitcoin casino, you will get the chance to unlock a generous 240% match deposit bonus with 40 free spins.\n\nThis offer comes with a standard 35x wagering requirement.\n\nApart from this, you can take part in 24/7 reload offers, and if you’re lucky enough, you may even come across a few Red Dog casino bonus codes that don’t require a deposit. That is why it’s considered one of the best Bitcoin casinos\n\nPayment Options: 4.7/5\n\nADVERTISEMENT\n\nThe banking options at Red Dog are not only limited to Bitcoin.\n\nBesides this digital coin, you can also go for Litecoin, Flexepin, Visa, Mastercard, and American Express, among others.\n\nGenerally, the payment process at this Bitcoin casino is super comfortable since you will never have to pay extra fees while making deposits or withdrawals.\n\nWithdrawals are not as fast as in other online crypto casinos. For instance, Bitcoin cashouts take 1 to 3 business days, while wire transfers can go up to 5 business days in total.\n\nUser Interface: 4.65/5\n\nADVERTISEMENT\n\nThe main website of Red Dog Casino is dominated by red and white colors.\n\nThe user interface is pretty normal, with nothing too impressive to offer. This efficiency in design places it among the most user-friendly sites among the best Bitcoin casinos.\n\nWhat we noticed is that Red Dog Casino offers excellent mobile compatibility. In fact, its website looks much nicer on smartphones than on the desktop version.\n\nBest Bitcoin Casinos - Runners-Up:\n\nADVERTISEMENT\n\nHow We Ranked the Best Crypto Casino Online Sites\n\nGame Selection\n\nWhen creating the list of the best Bitcoin casinos, we focused on several things, including the gaming portfolio.\n\nWe have only chosen websites that have all kinds of traditional games. Every type of gambler, including sports betting lovers, can find something to their liking.\n\nADVERTISEMENT\n\nBonuses and Promotions\n\nIt is a great feeling to win, but it is better to do so using a bonus.\n\nAll crypto casinos on our list are equipped with generous welcome bonuses along with other exciting deposit and no deposit offers. These features contribute to what makes them the best Bitcoin casino sites.\n\nPayment Options\n\nWe ensured that BTC casinos on our list offer every popular digital coin, such as Bitcoin, Litecoin, Dogecoin, and others.\n\nADVERTISEMENT\n\nSome online casinos even have fiat options. Withdrawal times, along with fees, are fair and reasonable.\n\nThis comprehensive range of payment options and fast processing times is what makes them some of the best Bitcoin casinos.\n\nUser Interface\n\nIn modern times where technology thrives, using a casino website should be easy and comfortable.\n\nThat’s why we examined each website in depth and made sure they functioned well and came with excellent visuals and graphics.\n\nADVERTISEMENT\n\nWhich Is the Best Bitcoin Casino?\n\n7Bit: Best overall\n\nBitStarz: 5 BTC welcome offer\n\nIgnition: Daily poker tournaments and events\n\nWild.io: 10 BTC welcome bonus\n\nBovada: 200+ high-quality games\n\nAccording to our research, 7Bit is the best of the best Bitcoin casinos online. It offers over 1,200 games, generous 5 BTC welcome offer, and many other awesome features.\n\nWhy is 7Bit the Best Bitcoin Casino Online?\n\n7Bit stands out as the best Bitcoin casino for several reasons. Here are some of the key features that make it an ideal choice for playing BTC games.\n\nADVERTISEMENT\n\nImpressive Game Library: Offering a selection of over 1,200 games, 7Bit ensures that players never run out of options. From classic slots to modern table games, the platform provides a rich variety sourced from 20 leading game developers.\n\nOffering a selection of over 1,200 games, 7Bit ensures that players never run out of options. From classic slots to modern table games, the platform provides a rich variety sourced from 20 leading game developers. Generous Bonuses : Newcomers are treated to an amazing welcome package that could add up to 5 BTC across the first four deposits. You can get up to 1.5 BTC + 100 free spins on your very first deposit!\n\n: Newcomers are treated to an amazing welcome package that could add up to 5 BTC across the first four deposits. You can get up to 1.5 BTC + 100 free spins on your very first deposit! Ongoing Promotions : 7Bit doesn’t stop at the welcome offer and provides regular promotions like Monday reload bonuses and Wednesday free spins.\n\n: 7Bit doesn’t stop at the welcome offer and provides regular promotions like Monday reload bonuses and Wednesday free spins. Quick and Diverse Payments : Whether you are a Bitcoin loyalist or prefer using Litecoin or Ethereum, the platform has you covered. And the best part is that Bitcoin transactions are completed in mere minutes!\n\n: Whether you are a Bitcoin loyalist or prefer using Litecoin or Ethereum, the platform has you covered. And the best part is that Bitcoin transactions are completed in mere minutes! User-Friendly Interface: The casino's retro-arcade theme isn't just a nostalgic nod - it makes for an easy-to-navigate interface. Games are categorized meticulously, making it simple for players to discover new favorites or quickly find classics.\n\nWhy Should I Play Bitcoin Casino Games?\n\nBitcoin games offer many advantages, which is why they are extremely popular. Here are a few of them:\n\nProvably Fair Algorithm: All Bitcoin games use this algorithm, meaning that players can check the fairness of a specific title manually. Provably fair games are pretty popular nowadays and provide great transparency.\n\nAll Bitcoin games use this algorithm, meaning that players can check the fairness of a specific title manually. Provably fair games are pretty popular nowadays and provide great transparency. Fastest Withdrawals: If we compare digital coins to fiat money options, we will see an actual difference. Credit cards, for instance, might take several business days to process, while Bitcoin transactions are mostly instant or take up to a few hours. Quick withdrawals are a feature that makes the best Bitcoin casinos stand out.\n\nIf we compare digital coins to fiat money options, we will see an actual difference. Credit cards, for instance, might take several business days to process, while Bitcoin transactions are mostly instant or take up to a few hours. Quick withdrawals are a feature that makes the best Bitcoin casinos stand out. No Transaction Fees: With Bitcoin, you will never have to pay any withdrawal commission. This is rarely true for fiat options, and they mostly have a minimum of a 5% fee attached to them.\n\nWhat Cryptos Can I Wager at Bitcoin Casinos?\n\nADVERTISEMENT\n\nThe best Bitcoin casino sites have expanded their payment options to accommodate various cryptocurrencies. Here's a rundown of some of the most commonly accepted ones:\n\nBitcoin (BTC)\n\nThe pioneer of the cryptocurrency world, Bitcoin offers secure and somewhat anonymous transactions. Fun fact: The first-ever Bitcoin transaction was for two pizzas back in 2010!\n\nEthereum (ETH)\n\nKnown for its smart contracts and decentralized applications, Ethereum brings versatility to crypto gaming.\n\nADVERTISEMENT\n\nLitecoin (LTC)\n\nLitecoin offers faster transaction confirmation times than Bitcoin. It was one of the first altcoins and paved the way for others.\n\nRipple (XRP)\n\nRipple is known for its digital payment protocol more than its cryptocurrency, XRP. It's particularly popular for cross-border transactions.\n\nDogecoin (DOGE)\n\nADVERTISEMENT\n\nInitially started as a meme, Dogecoin has a strong community and is very popular online.\n\nBitcoin Cash (BCH)\n\nThis is a fork of the original Bitcoin and offers quicker transaction times. It was created to improve the scalability issues that Bitcoin faced.\n\nTether (USDT)\n\nTether is a stablecoin, meaning its value is pegged to the U.S. dollar, offering a less volatile option for players.\n\nADVERTISEMENT\n\nWhat is the Best Instant Payout Bitcoin Casino?\n\n7Bit: Under 10 minutes\n\nBitStarz: Under 10 minutes\n\nIgnition: Under 24 hours\n\nWild.io: Under 24 hours\n\nBovada: 24-48 hours\n\n7Bit and BitStarz are the fastest payout Bitcoin casinos on our list. Both of them process payments under 10 minutes and thanks to the speed of crypto transactions you can expect your money in your crypto wallet in a matter of minutes.\n\nGuide to the Best Bitcoin Casinos\n\nAre Bitcoin Casino Sites Safe?\n\nADVERTISEMENT\n\nYes, Bitcoin casinos are absolutely safe; however, you should always stick to reputable and licensed options like the ones listed above among the best Bitcoin casinos.\n\nIn that case, you will be safe from any potential scams and fraud.\n\nWhat Games Are Available at Bitcoin Casinos?\n\nBitcoin casinos offer all kinds of titles, including slots, table games, and live casino games.\n\nHowever, the most popular ones are Provably Fair Games that let you test the fairness of outcomes yourself.\n\nADVERTISEMENT\n\nCan I Play Bitcoin Casino Games for Free?\n\nYes, you can definitely play crypto games that are free. Some of the best Bitcoin casinos offer demo mode for all their games.\n\nFor instance, if you decide to visit Red Dog Casino and launch any game in the demo mode, you won’t have to make any real money bets.\n\nDo Bitcoin Casinos Offer Bonuses?\n\nYes. In fact, crypto casinos tend to go all out when it comes to bonuses. For instance, users who join Wild.io can claim up to 10 BTC from the welcome package. Sounds pretty wild, right? This is another feature that makes these casinos the best Bitcoin casinos.\n\nADVERTISEMENT\n\nHow Can I Choose the Best Bitcoin Casino for Me?\n\nIt mostly comes down to your personal preferences and what you give the highest priority to.\n\nIf you are not sure where to start, we advise checking out 7Bit or the 9 other options on our list, as they all have something valuable to offer, making them some of the best Bitcoin casino sites.\n\nBest Online Bitcoin Casinos – Quick Comparison\n\nHere’s a reminder of what you can expect from our top 5 online crypto casinos, which are among the best online Bitcoin casinos.\n\nADVERTISEMENT\n\n7Bit : The best Bitcoin casino overall, 7Bit offers a 5 BTC + 100 free spins welcome package and 1,200+ games from top providers in the industry.\n\n: The best Bitcoin casino overall, 7Bit offers a 5 BTC + 100 free spins welcome package and 1,200+ games from top providers in the industry. BitStarz : Top choice for game variety, BitStarz is home to more than 4000 high-quality games from 45+ software providers. Make sure you take advantage of its 5 BTC welcome package with 180 free spins.\n\nTop choice for game variety, BitStarz is home to more than 4000 high-quality games from 45+ software providers. Make sure you take advantage of its 5 BTC welcome package with 180 free spins. Ignition : Want to have fun playing some of the best poker tournaments? Then Ignition can help. Start your online gambling journey with a combined $3,000 bonus for the poker and casino sections.\n\nWant to have fun playing some of the best poker tournaments? Then Ignition can help. Start your online gambling journey with a combined $3,000 bonus for the poker and casino sections. Wild.io : Grabbing generous offers is something you will never get bored of at Wild.io. Play around 1500 online casino games and grab up to 10 BTC in welcome bonuses.\n\nGrabbing generous offers is something you will never get bored of at Wild.io. Play around 1500 online casino games and grab up to 10 BTC in welcome bonuses. Bovada : This gambling site is a nice combination of casino and sports betting. Explore its $3,750 crypto bonus and have a look at the $750 sportsbook promotion as well.\n\nThis gambling site is a nice combination of casino and sports betting. Explore its $3,750 crypto bonus and have a look at the $750 sportsbook promotion as well. Red Dog: Live dealer games are the highlights here at Red Dog. Boost your bankroll with a 240% match bonus and 40 free spins, and create a memorable online gambling journey.\n\nHow to Register at a Casino Bitcoin Site\n\nDecided to create an account at one of the best crypto casinos? Then take a look at a step-by-step guide that we created for our top pick: 7Bit. The process is similar at other online Bitcoin casinos on our list.\n\nStep 1: Choose Your Favorite BTC Casino\n\nBrowse through crypto casino options on our list\n\nGo to the 7Bit homepage\n\nADVERTISEMENT\n\nWhy 7Bit? Solid reputation, generous bonuses, and extensive game selection\n\nStep 2: Start the Registration Process\n\nLocate and click the \"Sign Up\" button\n\nEnter required personal information\n\nProvide your email address\n\nChoose a strong username and password\n\nClick \"Proceed\"\n\nStep 3: Verify Your Email\n\nCheck your inbox for a confirmation email from 7Bit\n\nClick the verification link inside the email\n\nYour account is now verified!\n\nADVERTISEMENT\n\nStep 4: Make Your First Crypto Deposit\n\nLog in to your verified 7Bit account\n\nNavigate to the \"Deposit\" button\n\nSelect your preferred crypto payment method\n\nComplete the deposit details\n\nConfirm to finalize the transaction\n\nStep 5: Play Btc Online Casino Games\n\nBrowse through over 1,200 BTC games\n\nChoose your favorite\n\nStart playing!\n\nSo, What Are the Best Bitcoin Casinos?\n\nADVERTISEMENT\n\nNow you are equipped with all the necessary knowledge to choose the best Bitcoin casino site for your needs.\n\nIf you don’t know where to start, we recommend 7Bit , which got the number one position on our list, with BitStarz coming a close second.\n\nHowever, you are free to check out the other options we’ve listed, as each site is worthy in its own way.\n\nWith that being said, make sure you play for fun and gamble responsibly.\n\nDISCLAIMER: As we've always emphasized, gambling is a risky entertainment form. With this in view, you should never take this path to resolve financial difficulties as there's nothing assured. Remember, at any given point, the \"house always wins.\"\n\nADVERTISEMENT\n\nDo you feel as though you're approaching problem gambling, or do you know someone with a similar issue? Without further ado, call the National Gambling Helpline at 1-800-522-4700. Also, gambling sites are 18+ only.\n\nFor free gambling resources, visit:\n\n--"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1wcmljZS1wcmVkaWN0aW9uLWZvci1oYWxsb3dlZW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price prediction for Halloween 2023 - Finbold - Finance in Bold",
        "content": "With the quickly approaching Halloween, an interesting belief has arisen among cryptocurrency traders during this time of the year when it comes to Bitcoin (BTC), and chart patterns and machine learning (ML) algorithms indicate that there could be some truth behind this view.\n\nAs it happens, the price of Bitcoin on each Halloween, with the exception of 2018 and 2022, was higher than the year before, and if the ML algorithms, patterns, and other indicators are correct, this year should be no different, according to the latest data on September 26.\n\nSpecifically, the self-learning machine algorithm on the cryptocurrency market tracking platform CoinCodex has suggested that the flagship decentralized finance (DeFi) asset would grow its price by 9.56% by Halloween and trade at $28,703 on October 31, 2023.\n\nBitcoin 3-month price prediction. Source: CoinCodex\n\nIndeed, the phenomenon known as ‘Uptober’ has demonstrated its strength even during 2022, when the entire cryptocurrency sector was under massive selling pressure due to a combination of factors that ultimately culminated with the crash of what was once one of the largest crypto exchanges in the world, FTX.\n\nIn fact, by the end of the month or by Halloween 2022, Bitcoin was changing hands above the $21,000 price level, a significant increase from the $19,300 area it recorded 30 days earlier – on October 1, as Finbold reported on October 29, 2022 – despite being 66.56% lower than on October 31, 2021.\n\nNotably, on October 31, 2021, Bitcoin traded at $61,300 with a market valuation of $1.156 trillion, up 344.39% from its Halloween 2020 price of $13,794. Meanwhile, 28,488 respondents from the CoinMarketCap community bet the BTC price prediction for Halloween 2022 at $21,248.\n\nBitcoin price analysis\n\nAs things stand, Bitcoin is currently trading at the price of $26,198, which represents an increase of 0.39% in the last 24 hours, a decline of 3.49% across the previous seven days, and a 0.52% gain on its monthly chart, according to the most recent data on September 26.\n\nBitcoin 30-day price chart. Source: Finbold\n\nAll things considered, Bitcoin does, indeed, demonstrate a strong possibility of reaching the predicted increase in price and continuing the tradition of ‘Uptober’ by this Halloween, as well, despite regulatory uncertainty in the United States that has triggered a mass exodus of investors from the maiden crypto asset.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]