[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMjYvYml0Y29pbi1pcy1wb2lzZWQtdG8tYmxvdy11cC1hZnJpY2FzLTg2LWJpbGxpb24tYmFua2luZy1zeXN0ZW0uaHRtbNIBZ2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAzLzI2L2JpdGNvaW4taXMtcG9pc2VkLXRvLWJsb3ctdXAtYWZyaWNhcy04Ni1iaWxsaW9uLWJhbmtpbmctc3lzdGVtLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin is poised to blow up Africa's $86 billion banking system - CNBC",
        "content": "watch now\n\nACCRA, Ghana — Block CEO Jack Dorsey and his top brass descended on Accra for the inaugural Africa Bitcoin Conference in December to talk about one of the most potentially disruptive and transformative alternatives to the continent's existing financial system: bitcoin. Since its inception in 2008, this unfamiliar form of money has alternatively been disdained as an absurdly complex toy for libertarian techies, a legalized form of gambling, a speculative bet to get rich quick, and a vehicle for criminals and fraudsters to obscure the origins of their ill-begotten gains. But this parallel financial system can also serve a tangible social good, offering an onramp to the financial system for people who would otherwise be left out. In countries where the vast majority of the population is unbanked, national currencies are no longer a safe store of value, remittances comprise a hefty portion of GDP, and international sanctions complicate connections to the global economy, a virtual currency that doesn't require an intermediary to approve transactions can be a vital lifeline for survival. As cryptocurrency continues to rise in prominence and becomes a growing flashpoint for regulators, Dorsey and his deputies are providing an essential counternarrative: Bitcoin brings financial power to people who would otherwise have none. \"It doesn't matter to me if the price goes down or up, because I can still use bitcoin as a vehicle to move money around the world instantaneously,\" said Mike Brock, the CEO of TBD at Block, a unit which focuses on cryptocurrency and decentralized finance. \"I can exchange dollars for bitcoin and then bitcoin for Brazilian rial. There is a market for bitcoin in every corner of the world today,\" continued Brock.\n\nA broken financial system\n\nMoving money in Africa is an expensive and complicated process. Commercial bank branch access is limited, especially for people living in remote and rural areas. Digital banking options are also limited. Tack on rampant hyperinflation, widespread government corruption, and capital controls trapping domestic cash in banks, and money can stop making sense altogether. \"If someone wants to move money to the country next door, normally, you'd have to fill up a suitcase full of cash and move it over the border,\" explains Ray Youssef, CEO of Paxful. Part of the problem stems from the continent's quasi-colonial payment framework, in which roughly 80% of cross-border payments originating from African banks are processed offshore, mostly in the U.S. or Europe. That translates to higher costs and processing times that are sometimes measured in weeks. Then there's mobile money, which has been around since the early 2000s. Think of it like an electronic wallet tied to a phone number that does not require a smartphone or data to operate. Users can pay bills and shop with their phone through SMS texting, instead of having to rely on traditional banking options. Africa's mobile money transactions rose 39% to more than $700 billion in 2021, according to data from the GSM Association, a non-profit representing mobile network operators worldwide. World Bank data shows that account ownership at a financial institution — or via a mobile money service provider — has more than doubled in the last decade, rising to 55% of adults in Sub-Saharan Africa.\n\nAn employee uses a Nokia 1200 mobile phone inside an M-Pesa store in Nairobi, Kenya, on Sunday, April 14, 2013. Trevor Snap | Bloomberg | Getty Images\n\nBut even as adoption proliferates, mobile money users don't get the perks of legacy banking, including earning interest on banked savings and building up a credit score based on a history of spending. Interoperability on the continent also remains a major issue with this alternative way of banking. \"The entire banking system in Africa is completely and utterly broken, even amongst the mobile money providers, the telcos,\" said Youssef from Paxful, a peer-to-peer crypto marketplace where users can directly buy and sell tokens with one another. \"Two thousand payment networks and only 2% of them talk to each other. That number continues to grow. It's not getting better, it's actually getting worse,\" continued Youssef. Companies like Western Union and MoneyGram offer an expansive physical network of storefronts around the world designed to move money for those who are unbanked. That cash network was extraordinarily difficult and expensive to build, which is why there aren't a lot of direct competitors. It is also why those cash transfers often incur substantial fees. Bitcoin could eliminate all these intermediaries, allowing citizens to send digital payments directly to one another, without relying on credit and without incurring multiple settlement fees along the way. \"We're going to move to a model where we can make payments without IOUs, or credit, or promises, or fiat,\" said Alex Gladstein, chief strategy officer for the Human Rights Foundation, an organization that works with activists from authoritarian regimes around the world. \"It's literally like sending a piece of gold or a $20 bill instantly somewhere else.\" \"If you can get access to the internet, you can settle bitcoin payments,\" said Brock. \"And the government can't do anything about it.\" Dorsey points to the example of what happened in Nigeria during the protests against the brutality of the country's Special Anti-Robbery Squad — a movement referred to as #EndSARS. \"The Nigerian government went to various bank corps to stop protesters from receiving money — which bitcoin made up for,\" Dorsey said in Accra. \"So our whole reason for being as a company is solving the same problem that bitcoin will ultimately solve for everyone in the world.\"\n\nwatch now\n\nMoving money on the bitcoin blockchain at its base layer has its own challenges. At times of peak demand, fees will often spike higher, and if a user is unwilling to pay a premium for the transaction, they may have to wait for more blocks of transactions to get confirmed before their transfer goes through. Bitcoin's Lightning Network helps alleviate both of those problems by slashing the cost of transactions to virtually zero and enabling nearly instantaneous cash payments around the planet – making bitcoin a more effective payment rail. This so-called \"layer two\" technology is built on top of bitcoin's main chain, in part because bitcoiners are conservative about introducing changes to the base layer, for fear of opening it up to hacks or other mischief. Yellow Card — Africa's largest centralized cryptocurrency exchange run by CEO Chris Maurice — is also looking to embed this layer two technology into the platform, in order to drive down the price of transactions to virtually zero. Currently, the exchange doesn't charge a commission for transactions, but network fees can be pretty steep when a lot of trades are happening at once. \"It'll have a pretty big impact to our customers, because a lot of them are very price sensitive,\" says Justin Poiroux, the co-founder and CTO of Yellow Card. Yellow Card's plan is still in its infancy, but Poiroux tells CNBC that he thinks the Lightning Network could ultimately provide a lot of value for its retail customers.\n\nZoom In Icon Arrows pointing outwards Bitnob CEO Bernard Parah and Cash App's crypto product lead, Miles Suter, at the Africa Bitcoin Conference in Accra, Ghana. Bernard Parah\n\nBecause Lightning offers a universal monetary language, money can travel around the world between any Lightning-enabled bitcoin wallet. Someone who uses a platform like Block's Cash App — a regulated, American financial product with 51 million monthly transacting users which integrated with the Lightning Network in Feb. 2022 — can pay any Lightning invoice in the world instantly. \"It's a new way of doing business. It's a different paradigm entirely,\" said Gladstein. The crypto product lead at Cash App, Miles Suter, believes that a big part of bitcoin's utility is how it gets around broken and convoluted payment systems that don't talk to each other. \"At Cash App in particular, we've always been really interested in taking bitcoin beyond just being seen as an investment and bringing day-to-day utility to it,\" Suter told CNBC on the sidelines of the Africa Bitcoin Conference. \"In many ways, the people on the African continent are already doing that with the tools they have,\" continued Suter.\n\nSending cash with Lightning\n\nBernard Parah is a 30-year-old entrepreneur living in Jos, Nigeria, about a five hour drive from the capital city of Abuja. He's the CEO of Bitnob, an app that lets users across Africa buy, save, and invest in bitcoin. Bitnob is SMS-based and piggybacks on the mobile money system, making it easier for people to send money directly into bank accounts and mobile money wallets in African countries. Parah recently teamed up with Strike, a Lightning Network payments platform, to launch a feature called \"Send Globally\" that allows Americans to transfer money to people living in Nigeria, Ghana, and Kenya. It uses local fiat cash on either side of the transaction, but bitcoin is used under the hood as the pipeline to jump money over the border. The end user never touches the cryptocurrency themselves. \"We're able to settle into bank accounts or mobile money accounts, without the recipients having to interact with bitcoin themselves,\" Parah tells CNBC. \"Over time, we've seen that there are still people who really don't understand how to use bitcoin; who don't care about bitcoin. What they do care about is their problems getting solved,\" continued Parah.\n\nBitnob CEO Bernard Parah and Strike CEO Jack Mallers announcing the launch of 'Send Globally' on stage at the Africa Bitcoin Conference in Accra, Ghana. Bernard Parah\n\nIt feels like a wire transfer or a Venmo payment, according to Strike CEO Jack Mallers. \"It's instant. There's no debt. There's no credit. There's no delays,\" explains Mallers. The model works because Parah and Mallers are willing to take on the liability associated with the transfer by holding cash in escrow on either end of the exchange. Once the money is received in Nigeria, Bitnob — which is a regulated entity with connections to the local banks — will take that bitcoin and turn it into their local currency. \"It's just two regulated entities communicating over the language of bitcoin and cutting out excess fees,\" said Suter. \"I think that's revolutionary.\" Mallers says that they offer more competitive foreign exchange rates by using bitcoin as a price-setting intermediary, a sort of new world reserve currency. \"The rate that we got was actually 60% better than the traditional forex market rate,\" said Mallers. \"The way to actually think about how we're achieving forex if we clear through bitcoin is, 'I have dollars. How many bitcoin can I get for my dollars? And then how many naira can I get for my bitcoin?'\" said Mallers. \"It's acting as the most liquid, accessible, global instrument for us to clear and settle value amongst each other,\" he said. The arrangement also offers a few big ancillary benefits, including interoperability with payment apps around the world that have tens of millions of users. Block's Suter explained that Cash App could theoretically interoperate with Bitnob. \"We're only live in the U.S. right now, but that doesn't mean we can't speak to Bitnob in Nigeria and transfer value instantly and for free across these borders,\" Suter said of Cash App.\n\nMeeting customers where they are\n\nZoom In Icon Arrows pointing outwards South African developer Kgothatso Ngako built a custodial lightning wallet called Machankura. Kgothatso Ngako\n\nSouth African developer Kgothatso Ngako, who goes by KG, has integrated the Lightning Network into the GSM network, combining the best of a few worlds, in a larger effort to meet customers where they are. \"My focus is giving people without an internet connection the ability to send or receive bitcoin,\" Ngako said. KG calls his custodial Lightning wallet \"Machankura\" — South African slang for money. Whereas most Lightning transactions today require a smartphone and data, Ngako's service integrates lightning via Unstructured Supplementary Service Data, or USSD, which is the protocol that mobile money runs on. (It is similar to HTTP, or HyperText Transport Protocol, the protocol on which the web was built.) Ngako tells CNBC that he currently has around 3,000 users spread across eight countries, with a concentration in South Africa, Uganda, Kenya, and Nigeria. In his home market of South Africa, there are strict rules around currency exchange, which make his product even more appealing to some users looking to move their money abroad. \"The South African Reserve Bank regulates the cross-border flow of capital — including the exchange of currency — to and from South Africa. You need some form of approval to convert ZAR into foreign currency,\" said Ernest Marais, partner at Johannesburg law firm, Tabacks. KG's Machankura is compatible with any Lightning wallet on the planet. In practice, this means that someone with Cash App in San Francisco, for example, could instantly send bitcoin via Lightning to the phone number of someone with a data-less, basic phone living in a remote part of Uganda. Ngako's project does face some risks, including regulatory blowback. Marais tells CNBC that because the South African Reserve Bank cannot regulate the cross-border flow of cryptocurrency, it is considered to be illegal and a criminal offense — though crypto regulation largely remains nebulous across most of the continent. \"All African central banks, except for Central African Republic, have made notices stating that they don't issue bitcoin and hence they don't regulate it,\" counters Ngako, adding that a bitcoin transaction cannot be considered a cross-border exchange as bitcoin transactions aren't regulated within the central bank's institution. But the rules are confusing for everyone involved. \"The actual location of crypto assets is an anomaly. At what point does it leave the country?\" continued Marais. Ultimately, Ngako believes that once Machankura begins to scale, it will be a major driver of bitcoin adoption across the continent. To that end, Ngako is raising money and building — a common refrain among the entrepreneurs on the ground in Accra. As Dorsey said in Africa, \"More and more mass adoption will, in my belief, take away all the oxygen\" from governments attempting to control behavior through financial oppression. \"So what do we do? We build, we build, we build, we build, we build, they can't stop us. And that's what's important.\""
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmdyZWVucGVhY2Uub3JnL3VzYS9yZXNlYXJjaC9maW5hbmNpYWwtaW5zdGl0dXRpb25zLW5lZWQtdG8tc3VwcG9ydC1hLWNvZGUtY2hhbmdlLXRvLWNsZWFudXAtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Financial Institutions Need to Support a Code Change to Cleanup Bitcoin - greenpeace.org",
        "content": "Financial Institutions Need to Support a Code Change to Cleanup Bitcoin\n\nBig financial services companies like Fidelity need to acknowledge Bitcoin’s climate pollution and other environmental impacts by taking responsibility for the problem. The financial industry is generating revenue and creating services to help grow this energy-intensive cryptocurrency. At the same time, corporate pledges to reduce carbon emissions and sustainability plans don’t include Bitcoin’s climate impacts or risks.\n\nIntroduction\n\n“Humanity is on thin ice — and that ice is melting fast…Our world needs climate action on all fronts — everything, everywhere, all at once.”\n\nUnited Nations Secretary-General Antonio Guterres March 2023 1\n\nThe impacts of our climate crisis are growing every day. The fossil fuel industry continues to threaten lives and livelihoods, from families in Florida struggling to rebuild after Hurricane Ian to farmers in Central America displaced by drought to children living near coal-fired power plants suffering from asthma.2 Our society needs rapid decarbonization to avert accelerating climate change damage. According to the International Energy Association, achieving net-zero emissions by 2050 is necessary for limiting global temperature rise to 1.5 C, which requires no more investments in fossil fuel supplies and rapid growth of renewable energy.3\n\nPerhaps surprisingly, Bitcoin has become a substantial and growing barrier to slashing carbon emissions and phasing out fossil fuels. Bitcoin’s consensus mechanism or validating transactions on its digital ledger or blockchain consumes massive amounts of electricity from fossil fuels. Globally, its largest single source of electricity is coal-fired power plants.4 The digital “mining” involved in maintaining Bitcoin is now emitting more greenhouse gas emissions than many small and mid-sized countries.5\n\nThe financial industry is critical to all aspects of Bitcoin – from financing large digital “mining” companies, facilitating conversions to and from fiat currencies, and making the technology more accessible and widely adopted.6 Financial companies in various sectors are boosting their crypto and Bitcoin business, despite pledges to reduce climate emissions and increase corporate sustainability. Banks, asset managers, and payment processing companies need to take responsibility for the climate and community impacts of Bitcoin and support a code change to solve these growing problems at a global scale.\n\nBitcoin’s Dirty Energy Problem\n\nThe source of Bitcoin’s climate problem comes from its code. Here is how it works. Bitcoin is a digital cryptocurrency that operates outside of a central bank or government by using a decentralized and collectively-maintained database, or digital ledger, a record of all Bitcoin transactions stored on the blockchain. The records’ accuracy is protected through cryptography to prevent double counting and fraudulent transactions. This process requires a mechanism for validating transactions. Bitcoin does this through “Proof of Work” – meaning users must show they are committed to protecting the system’s integrity by putting in work, and thereby consuming electricity.7\n\nThe “work” is like a massive guessing game in which specialized computers, called ASICs (Application Specific Integrated Circuits), race against one another to guess the right answer to an algorithm. The computers act like random number generators, and those with more computing power can guess more numbers in less time, increasing their chances of picking the correct number. The winner gets to validate a new set, or “block,” of Bitcoin transactions added to the blockchain, and is rewarded with newly “mined” Bitcoin and fees.8\n\nSpeed demands large amounts of energy to power warehouses full of computers. Bitcoin mining is estimated to use more electricity than some entire countries, including what the Philippines and the Netherlands consumed in 2020.9 In the U.S., the seven largest crypto mining companies use the same amount of electricity needed to power every residence in Houston, with a population of 2.3 million people.10\n\nBitcoin mining is estimated to use more electricity than Netherlands\n\nThe amount of electricity will only increase; as more miners join the competition and computers become faster, Bitcoin’s system automatically adjusts making it more difficult to guess the right number, thus requiring even more computing power and electricity.11 In 2014 the electricity to mine a single Bitcoin was equal to what an average U.S. household used in 275 days but by 2022 that skyrocketed to around nine years.12\n\nThe cheaper the energy source, the more profit for the miners. Thus, miners have an incentive to seek cheap energy, which often means polluting fossil fuels like coal power. Researchers at Cambridge University estimate that 62% of the electricity used for Bitcoin mining globally in 2022 came from fossil fuels, with the most from coal and only 26% from renewables.13 Bitcoin mining companies have even reopened mothballed coal-fired power plants in the U.S.14 The world needs to speed up the transition away from coal, not bring more coal power online.15 The dirty energy powering the Bitcoin mining industry in 2021 produced around 65.4 MtCO2 annually, comparable to country-level emissions from Greece.16 And Bitcoin’s carbon footprint has only grown over time. Researchers estimate that in 2021, a single mined Bitcoin was responsible for emitting 126 times the CO2 as a Bitcoin mined in 2016.17\n\nThe environmental damages from Bitcoin go beyond the GHG emissions. Communities living near Bitcoin mining facilities face an array of negative impacts from air, water, and noise pollution. Stronghold Digital Mining, a company in which Fidelity Investments holds stocks, has purchased several waste-coal-fired power plants in Pennsylvania.18 Waste coal is one of the dirtiest forms of energy. Nearby residents are exposed to hazardous air pollution including sulfur dioxide and nitrogen, and safety risks from large trucks carrying waste coal on small country roads to the plant.19 Communities across the U.S. living near Bitcoin mines have also complained about the constant noise from the 24-hour operations.20 One person living near a mining facility in Limestone, Tennessee, described the noise as “like a jet engine idling on a nearby tarmac.”21 Water pollution can come from water withdrawal and discharge for power plant operations and cooling mining facilities, solid waste from burning fossil fuels, and land use changes from the construction of these industrial operations.22\n\nThe thousands of specialized Bitcoin mining computers only last a short time, and quickly become obsolete and turn into e-waste. Data is incomplete, but one estimate suggests Bitcoin mining generates roughly 45.51 kt of e-waste in a year, equivalent to the IT waste generated by the Netherlands.23\n\nTies Between Big Finance and Polluting Bitcoin\n\nWhile Bitcoin began as an alternative to traditional banking, it has become increasingly interconnected with the mainstream financial sector, which is helping grow Bitcoin and, in turn, its environmental damages. Some of the world’s largest banks, asset managers, and payment processing companies are creating new crypto-related services and platforms, and funding Bitcoin mining companies – all of which impact the climate crisis.\n\nMany different financial sectors are getting into cryptocurrency and providing services, capital, and expertise vital to Bitcoin’s expansion. Asset managers like Fidelity Investments control funds that own stock in Bitcoin mining companies and offer investment products that let institutional and retail customers bet on the price of Bitcoin.24 Banks, such as Goldman Sachs and JP Morgan Chase, are creating new opportunities for clients to invest in Bitcoin and the crypto sector, doing research and consulting on cryptocurrency, and directly investing in Bitcoin miners.25 Banks also provide vital services for cryptocurrency companies, like exchanges, to conduct daily operations, and move Bitcoin back and forth between U.S. Dollars.26 Meanwhile payment processing companies are making it easier to use Bitcoin for everyday transactions and partnering with crypto exchange companies to offer debit and credit cards that use Bitcoin.27\n\nWhile these large financial services companies have made pledges to reduce their carbon emissions, they continue to invest in carbon-intensive Bitcoin. Many banks, asset managers, and payment processing companies have supported the goals of the Paris Climate Agreement and made net-zero emissions pledges, joining global initiatives like the United Nations Net-Zero Banking Alliance, the United Nations Net-Zero Asset Owner Alliance, and the Glasgow Financial Alliance for Net-Zero.28 Yet these companies continue to invest in Bitcoin and have largely failed to report their Bitcoin-related emissions.\n\nCompanies know there is a problem. In 2017, Mastercard stated in its Corporate Sustainability Report that “new research shows that cryptocurrencies like Bitcoin are inherently more energy-intensive than Mastercard’s payment network.”29 Yet Bitcoin’s decentralized nature seems to have distributed responsibility for its impacts. Without traditional leadership, Bitcoin’s future depends on its users and stakeholders to guide its future. To date leaders in the financial industry have yet to acknowledge responsibility for the problem or taken meaningful steps to push for a code change that would clean up Bitcoin’s climate impacts. As the climate crisis worsens and Bitcoin’s appetite for electricity continues to grow, so will the pressure on financial firms tied to Bitcoin to address its impacts.\n\nFidelity Investments\n\nOur research finds that Fidelity Investments, the fourth largest asset manager in the world, is making a big splash into Bitcoin and leading the way for the financial industry.30 Fidelity was an early adopter of cryptocurrencies with a foray into Bitcoin mining in 2014 under the leadership of the new CEO Abigail Johnson, who is positioning the company to be a leader in cryptocurrency.31 Fidelity now offers many ways for institutional, private, and retail customers to invest in Bitcoin, and is using its brand and reputation to instill a sense of trust in volatile and polluting Bitcoin.\n\nThe company started a unit, Fidelity Digital Assets, in 2018 to focus on crypto investments and services.32 The unit began by offering crypto trading and custody – taking responsibility for securely storing investors’ digital assets – for institutions. In March 2023, the company launched its own Bitcoin trading and custody program for retail customers called “Fidelity Crypto.”33 This move marks the first time a major financial institution got involved in directly trading cryptocurrencies and could compete with exchanges run by crypto-focused companies like Coinbase.34\n\nIn a major move that could bring Bitcoin investing to millions of Americans, the company announced in 2022 that employers with Fidelity 401(k) retirement plans now have an option to let their employees direct a portion of savings into Bitcoin.35 This decision sparked widespread concern from regulators and policy-makers. The Department of Labor issued guidance suggesting 401(k) plans avoid speculative and volatile crypto investments.36\n\nThrough Fidelity’s numerous investment funds, the company enables investing in Bitcoin and holds stock in many Bitcoin-related companies. Fidelity is the first major asset manager to create an exchange-traded fund (ETF) tied to the current price of Bitcoin, the Fidelity Advantage Bitcoin ETF (FBTC). FBTC is listed on the Toronto Stock Exchange, which lets clients indirectly invest in Bitcoin.37 The Fidelity Crypto Industry and Digital Payments ETF (FDIG) invests in crypto-related companies.38 Fidelity holds stock in publicly traded Bitcoin mining companies, such as Marathon Digital Holdings, through these crypto-specific and other general market funds.39\n\nAt the same time, Fidelity has sustainability goals and reports on environmental and climate issues. Fidelity is a signatory to the United Nations Principles for Responsible Investment and supports recommendations from the Task Force on Climate-Related Financial Disclosures. Fidelity’s 2021 Environmental Report states that the company’s goal is, “to reduce our greenhouse gas emissions by expanding use of renewable energy, with a dedicated focus on reducing carbon.”40 The company’s Environmental Sustainability Statement of Intent claims it is beginning to adopt sustainability throughout the business, including fund operations, products, risk management, and procurement.41\n\nRecommendations\n\nBig financial services companies like Fidelity need to acknowledge Bitcoin’s climate pollution and other environmental impacts by taking responsibility for the problem. The financial industry is generating revenue and creating services to help grow this energy-intensive cryptocurrency. At the same time, corporate pledges to reduce carbon emissions and sustainability plans don’t include Bitcoin’s climate impacts or risks.\n\nTo help solve Bitcoin’s climate problem, these companies can use financial clout and influence to incentivize a Bitcoin code change that virtually eliminates its climate impacts and aligns Bitcoin with many other and newer cryptocurrencies that use dramatically less electricity.42 Financial companies can lead the way by convening experts, funders, and policymakers to create a clean-future for Bitcoin. Now is the time to catalyze creativity and ingenuity to design the next revolution in cryptocurrency.\n\nFinancial companies can use clout and influence to incentivize a Bitcoin code change that virtually eliminates its climate impacts\n\nOther cryptocurrencies have also changed, like Ethereum, the second largest cryptocurrency in the world. It slashed its energy use by 99.95% by transitioning from a Proof of Work consensus mechanism to a form of Proof of Stake.43\n\nBitcoin’s code has changed in the past and can be changed again to protect our climate and communities.44 Its code is open and transparent; anyone with the requisite skills can propose code modifications. The main challenge is not technical, but social; large and small stakeholders within the Bitcoin community can champion improvements and must reach consensus on making changes.45\n\nBitcoin can thrive without energy-intensive, noisy, and polluting digital mining. Bitcoin’s future growth may depend on it. The technology is still in its early years, having debuted in 2009. With the right resources, incentives, and support, new methods of securing its ledger and maintaining decentralization can be developed and adopted. To achieve this change, financial institutions connected to the system must work with other stakeholders to change it for the better.\n\nReferences"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzI3L21pY3Jvc3RyYXRlZ3ktcGF5cy1vZmYtc2lsdmVyZ2F0ZS1sb2FuLWJ1eXMtbW9yZS1iaXRjb2luL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzI3L21pY3Jvc3RyYXRlZ3ktcGF5cy1vZmYtc2lsdmVyZ2F0ZS1sb2FuLWJ1eXMtbW9yZS1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "MicroStrategy Pays Off Silvergate Loan, Buys More Bitcoin - CoinDesk",
        "content": "MicroStrategy also disclosed that it has raised $339.4 million this year through the sale of its shares and used the proceeds to pay back the loan from Silvergate."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vbW9uZXkuY29tL2hvdy10by11c2UtY29pbmJhc2UtYmVnaW5uZXJzL9IBOWh0dHBzOi8vbW9uZXkuY29tL2hvdy10by11c2UtY29pbmJhc2UtYmVnaW5uZXJzLz9hbXA9dHJ1ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Coinbase for Beginners: A Complete Guide to Buying and Selling Cryptocurrency on a Popular Exchange - Money",
        "content": "Ads by Money. We may be compensated if you click this ad. Ad Start investing in cryptocurrency Get App Supports 100,000+ crypto assets Free and easy-to-use mobile app and browser extension\n\nIntegrated to Coinbase crypto exchange and other major decentralized exchanges\n\nSafe storage for Ethereum and Polygon NFTs\n\nEnhanced security features such as two-factor authentication and biometric authentication technology\n\nGet App\n\nYour first 30 days are free Free stock when you open an account\n\nStart investing with just $1\n\nAll trades are commission-free\n\n4.9% APY on uninvested cash with Robinhood Gold Subscription (*Terms apply. Rate subject to change.)\n\nIf you’re looking to start trading cryptocurrency you’ve likely come across Coinbase.\n\nOne of the largest cryptocurrency exchanges in the U.S., Coinbase is a place to buy, sell and hold digital currencies like bitcoin and ether.\n\nNow that cryptocurrency has gone more mainstream, there are several ways to buy and sell coins on your own, whether it be via Venmo, Cash App or a trading app like Robinhood. But Coinbase is a popular option, touting more than 110 million verified users. The company made its public debut in April of 2021, which many saw as a vote of confidence for digital currencies as a whole. Crypto prices — and the crypto industry overall — have been on a wild ride since then, but investors are still logging into their Coinbase accounts to check how various tokens are performing, buy, sell and more.\n\nHere’s everything you need to know about trading cryptocurrency on Coinbase.\n\nAds by Money. We may be compensated if you click this ad. Ad Build your ultimate crypto portfolio Public provides investors, from beginners to experts, with a comprehensive crypto trading experience, on a powerful yet user-friendly platform. Start investing today by clicking on your state! Hawaii Alaska Florida South Carolina Georgia Alabama North Carolina Tennessee RI Rhode Island CT Connecticut MA Massachusetts Maine NH New Hampshire VT Vermont New York NJ New Jersey DE Delaware MD Maryland West Virginia Ohio Michigan Arizona Nevada Utah Colorado New Mexico South Dakota Iowa Indiana Illinois Minnesota Wisconsin Missouri Louisiana Virginia DC Washington DC Idaho California North Dakota Washington Oregon Montana Wyoming Nebraska Kansas Oklahoma Pennsylvania Kentucky Mississippi Arkansas Texas Download App Offer valid for U.S. residents 18+ and subject to account approval. There may be other fees associated with trading. See Public.com/disclosures.\n\nWhat is Coinbase?\n\nCoinbase is a trading platform that allows users to buy, sell and store cryptocurrency. There are around 240 tradable assets on the exchange, which you can browse here. Coinbase is more for beginners, while Advanced Trade is for avid and experienced traders who make high volume transactions and want more trading options. (Coinbase announced it was sunsetting its premium service Coinbase Pro in June of 2022 and migrating its users to Advanced Trade.)\n\nInterest in investing on apps like Robinhood has boomed recently. Cryptocurrency is no exception, and Coinbase reaped many of the benefits. Coinbase is now available in more than 100 countries.\n\nThe platform is pretty straightforward. Like many trading apps, users can see their balance and a watchlist, which allows them to track the prices of different kinds of cryptocurrencies. Traders can also check which cryptocurrencies are the biggest movers. The company also offers Coinbase Card, a Visa debit card that users can use to earn rewards for spending the assets in their portfolio.\n\nIn September 2021, Coinbase announced a new direct deposit option that will allow users to have their paychecks directly deposited to Coinbase and their pay automatically deposited as bitcoin or another cryptocurrency.\n\nIs Coinbase free?\n\nCoinbase charges a fee for trading via the platform (unlike apps like Robinhood, which touts “free trading”).\n\nThe fees differ for trading on Coinbase can be complicated, since it doesn’t charge a flat fee. The company is also not very transparent about its fees — you won’t be able to see exactly how much you’re paying until just before you submit your order. Fees are calculated when you place orders and take into account factors like your location, payment method and order size, as well as market conditions, volatility and liquidity. Coinbase also includes a spread in the price, which is the difference between the asset’s market price and the price you’re buying or selling that asset for.\n\nThe fee structure for Advanced Trade uses a simpler maker-taker model. (Maker orders are those that provide liquidity, while taker orders remove liquidity.) The fees are between 0% and 0.60% per trade with lower costs for larger dollar transactions. For example, a transaction of less than $10,000 has a 0.40% maker fee and a 0.60% taker fee, while a transaction between $10,000 and $50,000 has a 0.25% maker fee and a 0.40% taker fee.\n\nCoinbase doesn’t charge users to hold their assets in a digital wallet or to transfer cryptocurrency from one wallet to another within the Coinbase network. But Coinbase's fee can definitely chip away at your winnings, especially if you're not using Advanced Trade.\n\nHow to open a Coinbase account\n\nOpening a Coinbase account is pretty straightforward. You’ll need a government-issued photo ID, as well as information like your phone number and the last four digits of your Social Security number. Be ready to answer questions about what you’ll use the platform for. When choosing a password, use proper cyber hygiene — like a unique password you haven’t seen elsewhere and multi-factor authentication — to avoid hackers getting ahold of your account.\n\nBefore you begin trading, you’ll need to attach a payment method to your Coinbase account. In the U.S., you can use a bank account, debit card, wire transfer, PayPal account, Apple Pay or Google Pay. Actions like cashing out aren’t available across all these payment methods, but you can see what you can do with each here.\n\nOnce you have your digital wallet set up, you’re ready to trade. Coinbase doesn’t offer trading for all cryptocurrencies, but the exchange does regularly add new coins.\n\nAds by Money. We may be compensated if you click this ad. Ad Investing made easy - Get mobile access to the markets and choose how much you want to invest. Robinhood allows you to invest commission-free in individual companies or bundles of investments (ETFs). Begin Investing\n\nIs it a good time to invest in cryptocurrency?\n\nCrypto prices reached several record highs during the pandemic, but they’ve since fallen significantly.\n\nIn November 2021, bitcoin’s price hit a record high of around $68,000 per coin, more than double what the price had been in July of that year. Meanwhile, ether — the second-largest cryptocurrency by market value after bitcoin — also hit a new high in November 2021 at around $4,800. Altcoins, cryptocurrencies that aren’t bitcoin, have grabbed attention too: Dogecoin surged 8,000% in the first few months of 2021, and Shiba Inu coin and a token called Omicron once skyrocketed.\n\nNowadays, it’s a different story. The Federal Reserve has been raising interest rates since March 2022 — a move used to tamp down inflation but that also tends to weigh on the price of financial assets like stocks, bonds and crypto. The crypto industry has also experienced an extreme erosion of trust, in part due to the implosion of some previously trusted companies, like the major exchange FTX. The price of bitcoin has tumbled to below $20,000 per coin since its record high and, as of March 2023, is around $28,000 per coin.\n\nOf course, these wild ups and downs should give investors pause.\n\nAside from its price volatility, cryptocurrency is a risky investment. As a relatively new technology, crypto isn’t regulated the way financial assets like stocks and bonds are. While there have been recent moves to more closely regulate crypto, experts say the future is still uncertain (especially since added regulation could change up the way crypto companies do business). In March, the U.S. Securities and Exchange Commission (SEC) warned Coinbase that it had identified potential violations of U.S. law related to some of its crypto products in just the latest example of a crackdown on the industry. Overall, financial advisors tend to recommend not investing money in crypto that you aren’t prepared to lose.\n\nHow to buy and sell cryptocurrency with Coinbase\n\nIt’s time to pick your cryptocurrencies.\n\nCryptos that are among the most popular and expensive cryptocurrencies — like bitcoin, ethereum, litecoin and bitcoin cash — are often considered safer than others, Hanna Halaburda, an associate professor at NYU Stern School of Business, previously told Money. That’s because there is more computational power put into maintaining their blockchain, the technology behind cryptocurrencies, making them more expensive for hackers to attack. They have also been around for years, so if there was a bug, we would likely know about it, she adds.\n\nFor most investors, buying a bitcoin that has had a price as high as around $68,000 per coin likely isn’t an option. Ether has cost more than $4,000 per coin and even litecoin, which has cost more than $300 per coin in the past, may be more than you want to spend. But Coinbase allows users to buy a small fraction of a coin. It’s common for investing apps like Robinhood to allow traders to buy fractional shares — like investing $25 in popular stocks like Amazon and Apple instead of the more than $100 you would need to buy a full share. With Coinbase, traders can buy or sell as little as $2 worth of digital currency.\n\nBut that doesn’t mean there are no concerns in general. Cryptocurrencies have proven to be volatile — just look at the market’s last few years.\n\nThe digital currencies also, again, aren’t regulated in the same way as other assets. Before a company sells its stock to the public, it needs to go through strict scrutiny by the SEC. Before an investment advisor can recommend that stock, they need to be confident it’s in the investor’s best interest. There are a lot of protections for investors that you don’t have with crypto, says James Angel, a finance professor at Georgetown University.\n\nPlus, cryptocurrencies don’t actually have any intrinsic value, so the speculative asset is completely at the whim of the value the market attributes to it.\n\nIs it safe to buy and sell cryptocurrency with Coinbase?\n\nTo buy and sell cryptocurrency, you’ll need a digital wallet where you'll hold your currency between transactions. Unlike a regular wallet, a digital wallet has an added concern: Is the crypto wallet safe from hackers?\n\nThere are a few options, each with their own security measures.\n\nIf you don't want to worry about keeping cryptocurrency separate from the Coinbase app, you can use what is called a hosted wallet. This wallet is held for you by a third party — in this case, Coinbase — which means you don't have to worry about forgetting your password and losing all your cryptocurrency. (That’s a real concern: Some crypto investors have lost millions of dollars because they can’t remember how to get into their wallets.)\n\nCryptocurrency isn’t insured by the Federal Deposit Insurance Corporation (FDIC) or the Securities Investor Protection Corporation, like your bank account or investment portfolio. But Coinbase says it \"carries crime insurance that protects a portion of digital currencies held across our storage systems against losses from theft\" — like from a cybersecurity breach — but not from unauthorized access to your account. The company also says that it keeps 98% or more of its customers’ digital currency offline. A dollar balance of up to $250,000 is FDIC-insured on Coinbase.\n\nIf you want full control of your cryptocurrency without a third party's involvement, you can opt for what's called a non-custodial wallet. While you don't have to worry about the third party being hacked, you do have to remember your password yourself, or risk losing your cryptocurrency. But having more control means you can participate in more advanced activities, like yield farming, which allows the cryptocurrency owner to lend out their assets to generate higher returns. Coinbase customers can choose to download the Coinbase Wallet, separate from the app, which is a non-custodial wallet.\n\nIf you want security from your computer being hacked, you can go for a cold wallet — also called a hardware wallet — which is a physical device like a USB that’s not connected to the internet. They can be pricey; the Ledger Nano X is $149 and the Trezor Model T is $219 as of March 2023.\n\nWant to learn more? Money has a full list of the best crypto exchanges as well as a list of the best crypto wallets (spoiler: Coinbase is listed as the best for beginners on both). You can also check out our full review of the Coinbase crypto wallet.\n\nThis story was originally published in 2021 and has been updated.\n\nNewsletter Make smarter money decisions in just a few minutes every day Subscribe to Daily Money to get more of the latest personal finance news, stories, and analysis delivered everyday to your inbox. By clicking \"Sign Up\" I agree to receive newsletters and promotions from Money and its partners. I agree to Money's Terms of Use and Privacy Notice and consent to the processing of my personal information. Sign Up\n\nMore from Money:\n\nYou Can Buy Bitcoin on Venmo Now. Should You?\n\n3 Ways to Bet on Bitcoin Without Actually Buying Bitcoin\n\nRobinhood for Beginners: A Complete Guide to Investing With the Controversial Stocks App"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LXBheXMtb2ZmLXNpbHZlcmdhdGUtbG9hbi0xMjI1NDI2OTYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "MicroStrategy Pays Off Silvergate Loan, Buys More Bitcoin - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nMicroStrategy (MSTR), a software company that was co-founded by crypto advocate Michael Saylor and that holds a large amount of bitcoin (BTC), prepaid the remaining principal on its $205 million loan from failed, crypto-focused Silvergate Bank, according to a filing with the U.S. Securities and Exchange Commission on Friday.\n\nIn addition, MicroStrategy said it purchased another 6,455 bitcoins for roughly $150 million (about $23,238 per coin) over the past five weeks.\n\nThe loan payoff was made last Friday and totaled $161 million. As part of the satisfaction of the loan, 34,619 bitcoins held as collateral were returned to MicroStrategy's custody. The company took out the loan last March.\n\nThe acquisition of another 6,455 bitcoins brings MicroStrategy's holdings up to 138,955 bitcoins purchased at an average price of $29,817 each and worth roughly $3.88 billion at the current bitcoin price of $27,900.\n\nMicroStrategy also disclosed that it has raised $339.4 million this year through the sale of its shares and used the proceeds to pay back the loan from Silvergate.\n\nShares of MicroStrategy were up 0.9% premarket."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvbWljcm9zdHJhdGVneS1iaXRjb2luLWNyeXB0by1tYXJrZXRzLWludmVzdGluZy1maW5hbmNlLW1pY2hhZWwtc2F5bG9yLXNpbHZlcmdhdGUtbG9hbi0yMDIzLTPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy Snaps up 6,455 Bitcoin As Token Rallies - Markets Insider",
        "content": "MicroStrategy bought 6,455 bitcoins for about $150 million in the last five weeks, an SEC filing showed.\n\nThat brings the firm's total bitcoin holdings to 138,955 tokens, or about $3.88 billion.\n\nMicroStrategy also paid off the remaining principal on a $205 million loan from the failed Silvergate Bank.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nMichael Saylor's MicroStrategy bought 6,455 bitcoins over the last five weeks, according to a Friday SEC filing.\n\nThe purchases were made at an average price of about $23,238 per token, and totaled roughly $150 million.\n\nCrypto investments are not new for MicroStrategy, and Saylor frequently touts bitcoin from his Twitter account.\n\nThe recent acquisitions bring the software company's holdings up to 138,955 bitcoins, per CoinDesk, bought at an average price of $29,817 each.\n\nAdvertisement\n\nAll together, those holdings are worth about $3.88 billion, at the current bitcoin price of about $27,900.\n\nMicroStrategy's latest crypto buying spree comes as bitcoin has rallied to start the year. After a dismal 2022, the token is up about 62% year-to-date.\n\nLast week, the token hit a nine-month high and neared $30,000 as Credit Suisse's takeover by UBS failed to ease fears about the global banking system.\n\nCryptocurrencies across the board are notching gains. Ethereum is up about 42% year-to-date, and Solana is up about 51% in 2023.\n\nAdvertisement\n\nMeanwhile, per the SEC filing, MicroStrategy also paid off the remaining principal on a $205 million loan from failed, crypto-friendly bank Silvergate, which shut down its operations earlier this month. The total MicroStrategy paid was $161 million.\n\nAs part of the satisfaction of the loan, 34,619 bitcoins that were held as collateral were returned to Saylor's firm, the filing said.\n\n\"MicroStrategy repaid its $205M Silvergate loan at a 22% discount,\" Saylor tweeted on Monday."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTI3L2NyeXB0b2N1cnJlbmNpZXMtZGVjbGluZS1hZnRlci1iaW5hbmNlLWZvdW5kZXItc3VlZC1ieS1jZnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Drops as CFTC Sues Binance Over Regulation Violations - Bloomberg",
        "content": "Bitcoin touched a 10-day low and smaller cryptocurrencies also declined after Binance Holdings Ltd. was sued by the US Commodity Futures Trading Commission for allegedly breaking trading and derivatives rules.\n\nBinance, which exploded onto the crypto scene in 2017 and almost immediately took on and surpassed larger rivals, saw its market share surge after last November’s collapse of FTX. It accounts for about 60% of crypto spot and derivatives trading volume. The company has argued that the global exchange is not subject to US jurisdiction because it has no headquarters."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LmNjbi5jb20vd2h5LWJpdGNvaW4tdmFsdWUtZG9lc250LW1hdHRlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Why Bitcoin Value vs. The Dollar Doesn't Matter (and Never Will) - CCN.com",
        "content": "Today I will extend to you three key reasons why the Bitcoin value versus the “Almighty Dollar” is of little significance, and may be totally irrelevant both now, and in the future.\n\nOne reason can be from distilled from lessons learned in our history of decentralized networks versus other centralized networks. One can be realized through the present day landscape, and one looks into the future of money as we know it. So let’s begin with our ability to learn from history.\n\nTwenty years ago, when the Internet was just starting to gain momentum, it was in a similar state of development as Bitcoin is in today. “The Web” was replacing ancient communication methods like typewriters and snail mail at a slow, but steadily increasing rate. These wouldn’t be instantly replaced, but would be one day irrelevant. As we moved along a few more years, and the 21st century dawned upon us, mainstream news magnets like CNN and the Washington Post joined “The Online Revolution.” This caused newspapers to shrink in size, number and demand. As The Internet grew in scope, was it ever compared directly, on a daily basis, to the New York Times or Time Magazine in its relevance?\n\nJust as people today are asking “What is Bitcoin?,” people in 1994 were asking “What is e-Mail?,” and “What is The Internet?” Bitcoin is following the Internet’s lead, in essence, building its own blockchain technology on top of the Internet’s existing virtual blockchain, if you will. Bitcoin’s growing influence on monetary systems and global commerce are set to be similar in depth to the Internet’s inherent ability to change the way we all communicate worldwide. Bitcoin is not so much reinventing the wheel, although it may in the currency markets as it is setting the established wheel of the Internet in an exciting new direction. This potential will take another few years to realize fully how far Bitcoin value can go, but it is moving upward and onward, and the world is starting to take notice.\n\nBitcoin and Bitcoin value have scared some sovereign governments to the point that they have banned it outright, in practice, or through de facto capital controls. China attacking banks and account holders helped crash the BTC market at the beginning of this year. It has gone through the Mt.Gox fiasco, where trading bots were alleged to pump up the price of BTC, amounting to a market bubble. Also factor in Silk Road, the New York State Licensing controversy, and Alibaba’s IPO, the Bitcoin value is still up over 200% in USD value from this time last year. That Bitcoin value has not only survived on a global basis for more than five years, but thrived, and attracted some of the largest merchants worldwide (PayPal, Dell Computers, Dish Network, etc.). This is much more relevant than any comparison to a currency that is in it’s final years of relevance itself. If that doesn’t prove the inherent strength of Bitcoin value, nothing will. What else has gained 200% or more in these market conditions?\n\nComparing Bitcoin value to the dollar’s is like comparing a written letter to an email.\n\nThey may both transmit information or value, but that’s where the comparisons should end. Today, merely out of desperation, Bitcoin value is compared to the World’s Reserve Currency, the most liquid, most distributed, and most established currency of all time, the U.S. Dollar. We compare Bitcoin value to the dollar’s because they’re both seen as currencies, but Bitcoin value is much more than that. Currency is just Bitcoin’s first “app.” It appreciates in the range of 2-400% per annum, and that’s in the “off year” like this one. You can send 1000 bits of information within a Bitcoin. You can send millionths of a Bitcoin to someone as payment. The amount of Bitcoins produced is market capped. The distribution of Bitcoin is fully decentralized and is not bound by any primitive territories.\n\n“The Almighty U.S. Dollar”, on the other hand, is kind of like Jack Nicholson, Bill Clinton, the late Joan Rivers, or any other superstar from generations gone by. They’ve had their time in the sun, where they once ruled their market domain, and now they are fading into our history. The dollar’s value is found at this point solely in its liquidity, it’s history, and the ability of the U.S. to coerce smaller countries to use it at the business end of a gun. Just ask Muammar Gaddafi.\n\nThe U.S. Dollar is poised for a collapse of epic proportions, according to many experts. The “Great Recession” of 2008-2009 was just foreplay. A currency’s “Global Reserve Currency” status lasts anywhere from 65-70 years, on average, and the U.S. Dollar has been “in office” for over 70 years now. The sphere of influence of the U.S. Military worldwide, with well over 100 nations occupied by military bases, is the main thing keeping the dollar in business right now. But times are changing.\n\nThe BRICS Development Bank is a major regulatory step in advancing the demise of the dollar as an internationally relevant currency. BRICS nations (Brazil, Russia, India, China & South Africa) control 40% of the world’s currency reserves and population. When they basically spit in the face of the U.S. Dollar in July, and said they would work directly with each other, and without the current Global Reserve Currency, the U.S. was strangely silent. These countries have been dealing in “Bilateral trade agreements ” (International trade deals without exchanging their currency for US Dollars) for many years now. So this new world bank of commerce was just the next logical step.\n\nThey did this because the dollar is of little intrinsic value, and the Fed can’t seem to stop the bleeding. Federal Reserve officials have failed to get interest rates off of the pavement out of fear of collapsing the economy. They’re on the monetary version of life support. The U.S. Government can doctor the numbers, and change the metrics, but countries worldwide are turning their back on the depreciating asset known as the US Dollar, and they know it. Their main job is to make sure you don’t know it. You know what they say – ignorance is bliss. And that’s also why the mainstream media only reports Bitcoin value drops, not the usual rise in Bitcoin value.\n\nMany financial experts like Peter Schiff , Jeff Berwick , Mike Maloney , Ron Paul , and Robert Kiyosaki (see links for more information) are predicting the mother of all economic collapses when the dollar inevitably falls. In my former dealings on Wall Street myself as an investment banker, I have to concur. Even legendary super-investor George Soros says the dollar died in 2008 . Americans in particular are truly ignorant about economic collapses because they have never experienced one first hand. What happened in 2008 was a small heart attack, that is a prelude to your coming demise, if you don’t amend your ways. Has the U.S. done that, I ask you? Enough said. It’s only a matter of time.\n\n“Eventually, this [dollar] will go to it’s true worth. Zero. So all of you savers [of dollars] out there, you’re going to lose big time!” – Robert Kiyosaki, author of Rich Dad Poor Dad\n\nDoes this mean we won’t use a dollar in the U.S.? No. We still use typewriters and snail mail. We still read newspapers.\n\nSort of. Not really. But when, not if, the dollar eventually collapses, and heads to it’s true intrinsic value, Bitcoin value will have an inverse market relationship. It will then skyrocket to unimaginable heights, at least against “The Dying Dollar.” As the dollar continues to slip and slide, Bitcoin will continue its march into the future. The way I see it, the only thing that can stop Bitcoin from outlasting the dollar on the global stage is if Bitcoin defeats itself. Governments attacking Bitcoin out of fear of it’s abilities will only cause the “Streisand Effect ” to be enabled in their populace.\n\nSo the Bitcoin value versus the dollar right now is irrelevant, since Bitcoin is not going to replace the “World’s reserve currency” regardless. Ask Bitcoin industry leaders like Andreas Antonopoulos and Cameron Winklevoss, and they’ll tell you the price doesn’t matter. As Andreas once said on a Joe Rogan Podcast, the Internet’s value is not measured in its ability to replace a number of fax machines. So why measure Bitcoin in dollars? They are totally different ecosystems. Like comparing apples to oranges, literally.\n\nBitcoin has more than held it’s own in the face of great adversity over the last five years. Will the dollar, at the ripe old age of 70 years running in it’s global position, stand up through the next five years? With the international community turning on it, the Fed overproducing it, and Bitcoin beating it through attrition and superior technology? Don’t bet on it. The chances of the dollar going to zero in value in five years are at least even versus Bitcoin value doing the same. You may end up betting your bottom dollar on it, sooner than you think.\n\nImages from ObservationsandNotes.blogspot.com, Wikimedia Commons, Flickr and Shutterstock."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMjcvYml0Y29pbi1kcm9wcy1hZnRlci1jZnRjLXN1ZXMtY3J5cHRvLWV4Y2hhbmdlLWJpbmFuY2UtZm9yLWFsbGVnZWRseS1icmVha2luZy10cmFkaW5nLXJ1bGVzLmh0bWzSAYMBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDMvMjcvYml0Y29pbi1kcm9wcy1hZnRlci1jZnRjLXN1ZXMtY3J5cHRvLWV4Y2hhbmdlLWJpbmFuY2UtZm9yLWFsbGVnZWRseS1icmVha2luZy10cmFkaW5nLXJ1bGVzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin falls after CFTC sues crypto exchange Binance for allegedly breaking trading rules - CNBC",
        "content": "A worsening macroeconomic climate and the collapse of industry giants such as FTX and Terra have weighed on bitcoin's price this year.\n\nCryptocurrencies dropped on Monday morning after the CFTC sued Binance, the biggest crypto exchange in the world, for allegedly violating trading rules.\n\nThe price of bitcoin slid 3% to $26,955.61, according to Coin Metrics. Ether fell 3.5% to $1,704.56.\n\nIn a court filing, the CFTC, or the Commodity Futures and Trading Commission, said Binance violated eight provisions of a commodities trading law \"designed to prevent and detect money laundering and terrorism financing.\" The lawsuit, which was filed Monday in a federal court in Chicago, has the potential to upend the exchange's operations.\n\nDessislava Aubert, an analyst at crypto data provider Kaiko, said although bitcoin's March rally had already started to slow in the last week, the down move Monday was largely driven by the news about Binance. It's \"the largest crypto exchange and any U.S. regulatory action against it will have huge implications for the industry,\" she said.\n\nThe CFTC court filing follows a CNBC report on Binance employees who have worked to subvert the exchange's compliance controls in China. Similarly, CFTC alleges that Binance has instructed its workers and customers to circumvent these controls.\n\n\"Many knew Binance had a bullseye on its back, but this is still unnerving some crypto traders,\" said Ed Moya, an analyst at Oanda. \"Binance's success is needed to ensure a good part of the cryptoverse can grow.\"\n\nCrypto exposed equities suffered from the news too. Coinbase and Microstrategy each fell 10%. Miners Marathon Digital, Hut 8 and Riot Platforms lost about 8% each.\n\nThe losses came in tandem with a surge in bond yields, which pushed the tech-heavy Nasdaq Composite down 0.6%. Rising rates make future profits, like those promised by growth-oriented companies, less attractive."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMjcvYml0Y29pbi1oYXMtYmVuZWZpdGVkLWZyb20tdXMtZG9sbGFyLWxpcXVpZGl0eS10by1zdXBwb3J0LWJhbmtzLW1vcmdhbi1zdGFubGV5L9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMjcvYml0Y29pbi1oYXMtYmVuZWZpdGVkLWZyb20tdXMtZG9sbGFyLWxpcXVpZGl0eS10by1zdXBwb3J0LWJhbmtzLW1vcmdhbi1zdGFubGV5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Has Benefited From U.S. Dollar Liquidity to Support Banks: Morgan Stanley - CoinDesk",
        "content": "Morgan Stanley noted that over half of total tether issuance – and 70% of recent issuance – is on the Tron blockchain. Last week, the U.S. Securities and Exchange Commission sued Tron founder Justin Sun and his companies for fraud. Exchanges Kraken and Binance appear to be the main recipients of the new USDT, the note added."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWdhaW5zLWludmVzdG9ycy1kaXZlcnNpZnktYW1pZC0wMzMzMTIwNTkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin gains as investors diversify amid worries about banking system; U.S. equity futures rise - Yahoo Finance",
        "content": "Bitcoin and the other top 10 non-stablecoin cryptocurrencies opened the working week with gains in Monday morning trading in Asia, as investors seek to diversify portfolios amid banking turmoil and the Federal Reserve’s latest rate hike. Litecoin led the winners. U.S. equity futures rose this morning as authorities sought to reassure investors the financial system is sound following bank failures and sharp declines in some lender’s stocks.\n\nSee related article: Weekly Market Wrap: Bitcoin hovers around US$28,000 as banking concerns return. Will it hit US$30,000?\n\nBitcoin rose 1.69% to US$28,026 in the 24 hours to 09:00 a.m. in Hong Kong, adding 0.37% for the week, according to CoinMarketCap data. The world’s largest cryptocurrency dipped below the US$28,000 resistance level over the weekend, and bounced back above it early on Monday. Trading turned choppy later in the morning and it moved above and below that line.\n\n“Traders are flocking to Bitcoin and similar assets to diversify their holdings. Recent bank failures have also strengthened the case for investing in Bitcoin, along with murmurs of hyperinflation,” Maxwell Goldstein, cofounder of on-chain fine art investment platform Freeport, told Forkast.News on Friday. Due to fears of inflation, “investors are absolutely seeking a safe haven asset and Bitcoin fits the bill.”\n\nEther moved up 1.61% to US$1,780, a weekly gain of 0.16%. Ethereum developer Matter Labs launched the mainet of zkSync Era on Friday, making it the first zero-knowledge scaling system for Ethereum that was opened to general users.\n\nLitecoin led the winners for the past 24 hours, gaining 1,85% to US$93.57 and up 12.39% for the week.\n\nThe total crypto market capitalization rose 1.34% in the past 24 hours to US$1.17 trillion. Total trading volume over the last 24 hours dipped 4.67% to US$31.46 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 1.52% in the past 24 hours to 4,024.34 as of 09:30 a.m. in Hong Kong, moving down 2.66% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast sister company, CryptoSlam.\n\nU.S. equities closed higher on Friday. The Dow Jones Industrial Average rose 0.41%, the S&P 500 gained 0.56%, and the Nasdaq Composite Index moved up 0.31%. All three indices logged gains after a volatile week characterized by wobbly banks and the Federal Reserve’s latest 25-basis-point rate hike.\n\nDespite the gains, bank worries remain. Deutsche Bank, the largest lender in Germany, saw the cost of its default insurance jump on Friday, triggering an 8% sell-off in its stock, according to CNBC.\n\nOn the same day in the U.S., the Financial Stability Oversight Council said that although “some institutions have come under stress, the U.S. banking system remains sound and resilient.” Other officials from U.S. President Joe Biden on down have repeated the same in recent weeks.\n\nAhead of the opening of U.S. equity markets on Monday, stock futures rose as of 9:00 a.m. in Hong Kong. Dow Jones Industrial Average futures moved up 0.36%. S&P 500 futures gained 0.37%. The Nasdaq Composite Index futures edged up 0.24%.\n\nIn the week ahead, the U.S. Congress on Wednesday will hold a hearing on Silicon Valley Bank and Signature Bank, which both failed this month, and data releases are expected on U.S. inflation and GDP growth.\n\nThe Federal Reserve will meet on May 3 to make its next move on interest rates to tackle inflation. Analysts at the CME Group expect a 83.2% chance the Fed will keep rates at 4.75% to 5%. The chance of another 25 basis-point hike is at 16.8%, down from 34.2% on Friday."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTI3L21pY3Jvc3RyYXRlZ3ktcGF5cy1vZmYtYml0Y29pbi1iYWNrZWQtbG9hbi1mcm9tLXNpbHZlcmdhdGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "MicroStrategy Pays Off Bitcoin-Backed Loan From Silvergate - Bloomberg",
        "content": "MicroStrategy Inc., the biggest corporate owner of Bitcoin, paid off the remainder of its $205 million Bitcoin-backed loan from Silvergate Bank with proceeds from the sale of shares and purchased about $150 million more of the cryptocurrency.\n\nThe loan from the failed crypto-friendly bank was retired about two years early, releasing about 34,619 coins that were held as collateral, the enterprise-software maker said in a US Securities and Exchange Commission filing on Monday. MicroStategy disclosed that it raised $339.4 million this year through the sale of shares."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzI3L2JpbmFuY2UtYml0Y29pbi10cmFkaW5nLXZvbHVtZS1oaXRzLWxvd2VzdC1sZXZlbC1pbi04LW1vbnRocy1mb2xsb3dpbmctdGVybWluYXRpb24tb2YtemVyby1mZWUtdHJhZGluZy_SAZcBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8yNy9iaW5hbmNlLWJpdGNvaW4tdHJhZGluZy12b2x1bWUtaGl0cy1sb3dlc3QtbGV2ZWwtaW4tOC1tb250aHMtZm9sbG93aW5nLXRlcm1pbmF0aW9uLW9mLXplcm8tZmVlLXRyYWRpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Binance's Bitcoin Trading Volume Hits Lowest Level in 8 Months Following Termination of Zero-Fee Trading - CoinDesk",
        "content": "Before zero fees started, Binance’s trading market share for the 13 BTC pairs was just 25% before more than doubling. “It has now been just 5 days since fees were reinstated, and market share has halved and is currently below 30%,” Kaiko said."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhbGxzLWFzLWJpbmFuY2UtZmFjZXMtdXMtYmFuLTA4MzE1NTQyMC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin price falls as Binance faces US ban - Yahoo Finance UK",
        "content": "Bitcoin was down on Monday. Photo: Jakub Porzycki/NurPhoto via Getty (NurPhoto via Getty Images)\n\nBitcoin (BTC-USD) dipped below the $27,000 mark after news emerged that Binance, the world’s largest cryptocurrency exchange, is facing a US ban.\n\nBinance is being sued by the Commodity Future Trading Commission (CFTC), which could also lead to a possible trading and registration ban in the US.\n\nBitcoin fell 3.4% after the CTFC announcement, which stated: \"The Commodity Futures Trading Commission today announced it has filed a civil enforcement action in the US District Court for the Northern District of Illinois charging Changpeng Zhao and three entities that operate the Binance platform with numerous violations of the Commodity Exchange Act and CFTC regulations.\"\n\nADVERTISEMENT\n\nChangpeng “CZ” Zhao is the CEO of Binance, and the CFTC has accused him of encouraging Americans to “evade compliance controls” and breaking US law.\n\nThe Binance cryptocurrency exchange has also been accused of failing to properly register with the CFTC.\n\nThe impact of the CTFC investigation into Binance has added to already cautious investor sentiment pervading crypto markets, as traders await the outcome of the SEC's notice to Coinbase (COIN).\n\nBitcoin was down 3.4% to $26,935 on Monday.\n\nEthereum (ETH-USD) fell 3% to $1,712.\n\nThe annoucnement by the CTFC also contained a statement by CFTC chairman Rostin Behnam, who said: “Today’s enforcement action demonstrates that there is no location, or claimed lack of location, that will prevent the CFTC from protecting American investors.\n\n\"I have been clear that the CFTC will continue to use all of its authority to find and stop misconduct in the volatile and risky digital asset market.\n\n“For years, Binance knew they were violating CFTC rules, working actively to both keep the money flowing and avoid compliance.\n\n\"This should be a warning to anyone in the digital asset world that the CFTC will not tolerate willful avoidance of U.S. law. I applaud the diligent and dedicated work of the CFTC’s Enforcement team in bringing this action, and for their hard work in addressing illegal operations in the digital asset space.”\n\nStory continues\n\nAfter the news, the global cryptocurrency market cap was at $1.17tn, a fall of 2.8%, according to Coingecko data.\n\nCoinbase receives SEC Wells notice\n\nLast Wednesday, the US Securities and Exchange Commission (SEC) issued Coinbase Global Inc with a Wells notice — a formal declaration that the regulator intends to recommend an enforcement action.\n\nShares in Coinbase (COIN) dropped nearly 13% to $67.83.\n\nIf the SEC officially classifies cryptocurrencies as securities it would impact the trade volume on cryptocurrency exchanges such as Coinbase by trade volume.\n\nRead more: Crypto live prices\n\nAll cryptocurrencies, except bitcoin, would need to register with the SEC, and be forced to adopt technology systems to make their order books audit-compliant.\n\nThey would also face strict rules on order execution to prevent market manipulation.\n\nExchanges such as Coinbase could risk large fines from the SEC for listing cryptocurrencies that the regulator would deem as being unregistered securities.\n\nSEC chair Gary Gensler said he considers all cryptocurrencies securities except for bitcoin.\n\nCrypto market reaction to US Federal Reserve rate hike\n\nThe cryptocurrency market remained largely in the green after the Federal Reserve decided upon a less hawkish rate hike at last Wednesday's Federal Open Market Committee (FOMC).\n\nThe Fed's 0.25% increase takes the benchmark federal funds rate to a target range of between 4.75%-5%.\n\n“The Committee will closely monitor incoming information and assess the implications for monetary policy,” the FOMC’s post-meeting statement said.\n\nRead more: 'Dressing digitally' pins hope on blockchain to clean up fashion's carbon footprint\n\n“The Committee anticipates that some additional policy firming may be appropriate in order to attain a stance of monetary policy that is sufficiently restrictive to return inflation to 2% over time.“\n\nFederal Reserve chair Jerome Powell said: \"The process of getting inflation back down to 2% has a long way to go and is likely to be bumpy.”\n\nCryptocurrencies have historically reacted positively to lower interest rate environments, which can encourage more liquidity in global markets.\n\nWatch: Web3: Venture capital still pouring into crypto, claims head of Outlier Ventures | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMjgveHJwLXN1cmdlcy10by1maXZlLW1vbnRoLWhpZ2gtYXMtc29tZS1wb2ludC10by1iaXRjb2luLWNvbW1vZGl0aWVzLW1lbnRpb24v0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8yOC94cnAtc3VyZ2VzLXRvLWZpdmUtbW9udGgtaGlnaC1hcy1zb21lLXBvaW50LXRvLWJpdGNvaW4tY29tbW9kaXRpZXMtbWVudGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "XRP Surges to Five-Month High as Some Point to Bitcoin Commodities Mention - CoinDesk",
        "content": "Alarm bells in the broader crypto community were sounded last month as the U.S. Securities and Exchange Commission was rumored to be cracking down on staking-as-a-service products, or protocols that pay rewards to users who lock up token holdings for a specified amount of time."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nZXJtYW4tYmFua3MtYWNjZXNzLWJpdGNvaW4tdHJhZGluZy1wbGF0Zm9ybS0xMjQ2MjYwMjUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "German banks get access to bitcoin trading platform - Yahoo Finance",
        "content": "A new platform will allow 1,200 German banks the ability to offer bitcoin trading to their customers. Photo: Getty (nantonov via Getty Images)\n\nA new platform has been launched that allows 1,200 German banks to offer bitcoin (BTC-USD) trading to their customers.\n\nDWPBank, a leading Frankfurt-based bank, has announced plans to integrate bitcoin into its banking systems.\n\nThe digital asset platform, called wpNex, will allow 1,200 affiliated German banks to offer their customers the ability to buy and sell bitcoin while carrying out online banking activities, according to DWPBank.\n\nRead more: Crypto live prices\n\n\"DWPBank wants to connect the world of traditional securities business with the world of trading digital assets,\" DWPBank said.\n\n\"To this end, it uses its central position in the German financial market with established interfaces to around 1,200 banks and savings banks and expands its portfolio to include trading and safekeeping of new assets.\"\n\nDWPBank CEO Heiko Beck said the bank planned to expand its range of services by adding other cryptocurrencies, digital assets and tokenised securities to the new platform.\n\nHe said: \"Digitised assets will become increasingly important in the future.\n\n\"That is why we are expanding our range of services in this area and focusing our portfolio more closely on the future opportunities that arise here.\"\n\nThe new digital asset platform was first trialed by MLP Banking AG, a client of DWPBank.\n\nRead more: Bitcoin price falls below $28,000 after Coinbase's SEC notice\n\nHead of account and securities settlement at MLP Banking AG Paul Utzat said: \"In our MLP client portal, it is a logical addition to the existing wealth management offering.\"\n\nGermany has been named one of the world’s most favourable countries for crypto, in a report by Coincub.\n\nIn February, another German bank, DZ Bank, also announced plans to offer bitcoin trading for its customers.\n\nDZ Bank is Germany’s second-largest bank by assets with 8,500 branch offices across the country.\n\nWatch: The reasons why UK banks are blocking crypto exchanges | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9iaXRjb2luLXdpbGwtZHJvcC1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Price Prediction: Bitcoin will drop in 2023 - Cointribune EN",
        "content": "Mon 27 Mar 2023 ▪ 3 min of reading ▪ by La Rédaction C.\n\nBenjamin Cowen says that BTC is going to see a big move in 2023 that will scare a lot of people. He predicts that Bitcoin is going to drop in price later this year and induce panic selling.\n\nWhy Benjamin Cowen predicts a BTC crash in 2023\n\nBenjamin Cowen, founder and editor-in-chief of Into The Cryptoverse, is known for his rigorous and scientific approach to cryptocurrency market analysis.\n\n\n\nFollowing the Ether (ETH) prediction, Cowen shared in a recent video, a fascinating analysis of the current market situation and his predictions for bitcoin. He stated that Bitcoin (BTC) will make a big move this year that will frighten a lot of people.\n\n\n\nAccording to Benjamin Cowen, the recent rise in the price of bitcoin, which has predicted an increase in the price of bitcoin to $100,000, is largely due to an influx of liquidity from the altcoin market into BTC.\n\n\n\nHowever, he predicts that when that liquidity dries up, the price of Bitcoin will fall. In fact, he expects BTC to fall back down later this year, which will scare off many individuals.\n\nWhy investors shouldn’t panic\n\nWhile the expected decline of Bitcoin in 2023 has some investors worried, Benjamin Cowen encourages people not to panic.\n\n\n\nIn his opinion, this decline would be completely normal and should not discourage investors in the long run. He compares this situation to 2015 and 2019, when the price of BTC also fell before quickly recovering.\n\n\n\nAccording to Benjamin Cowen, investors should use this opportunity to strengthen their position before the next halving instead.\n\n\n\nHe also points out that interest rates have never been higher. However, the Fed will not be able to keep raising them indefinitely. So when quantitative easing starts up again, that will be a real argument in favor of Bitcoin.\n\n\n\nFurthermore, Benjamin Cowen points to recent events in the banking sector. Indeed, in the United States, three financial institutions that catered to companies in the technology and cryptocurrency sectors went bankrupt.\n\n\n\nThis economic turmoil has hit even Credit Suisse hard. Its rival UBS had to bail it out by buying its shares to avoid the collapse.\n\n\n\nFaced with this situation, many investors are gradually turning to bitcoin. For Cowen, these events are all arguments in favor of cryptocurrencies. He believes that they offer a credible alternative to traditional currencies. Especially in countries with high inflation, such as Argentina.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy94cnAtbHRjLXhtci1hbmQtYXZheC1zaG93LWJ1bGxpc2gtc2lnbnMtYXMtYml0Y29pbi1iYXR0bGVzLXRvLWhvbGQtMjhr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "XRP, LTC, XMR and AVAX show bullish signs as Bitcoin battles to hold $28K - Cointelegraph",
        "content": "The recent banking crisis in the United States seems to have shaken the belief of some customers in the legacy banking system. According to Federal Reserve data, customers pulled nearly $100 billion in deposits in the week ending March 15.\n\nAmerican venture capital investor and entrepreneur Tim Draper said in a March 25 report that “founders need to consider a more diversified cash management approach” due to the over-regulation of banks and micromanagement by the government. As part of a contingency plan, Draper suggested businesses keep “ at least six months of short-term cash in each of two banks, one local bank and one global bank, and at least two payrolls worth of cash in Bitcoin (BTC) or other cryptocurrencies.”\n\nCrypto market data daily view. Source: Coin360\n\nThe move from the traditional banking system to cryptocurrencies may have already started, as seen from the strong showing of Bitcoin in the past few days. Even after the recent up-move, investors do not seem to be hurrying to book profits in Bitcoin. However, the same cannot be said about most altcoins, as they have witnessed a minor pullback.\n\nIn the short term, traders need to be selective of the cryptocurrencies to trade. Let’s study the charts of Bitcoin and select altcoins which may start the next leg of the up-move.\n\nBitcoin price analysis\n\nBitcoin has been hovering around the $28,000 level for the past few days. A consolidation after a strong rally is a positive sign as it shows that traders are holding on to their position, expecting a further up-move.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day exponential moving average ($25,936) and the relative strength index (RSI) in the positive area suggest the bulls remain in control. That enhances the prospects of a break above $28,900.\n\nIf that happens, the BTC/USDT pair could rally to the $30,000 to $32,000 resistance zone. The bears will try to defend this zone with all their might because if they fail in their endeavor, the pair may skyrocket to $40,000.\n\nThe vital support on the downside is $25,250. If this level fails to hold up, the pair may tumble to the 200-day simple moving average ($20,179).\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the pair has been trading in a range between $26,500 and $28,900 for some time. The 20-EMA is flat and the RSI is just above the midpoint, indicating a balance between supply and demand.\n\nA break above $28,900 will signal that bulls have overpowered the bears. That will indicate the resumption of the up-move. On the contrary, if the price breaks below $26,500, the pair may tumble to $25,250 and then to $24,000.\n\nXRP price analysis\n\nXRP (XRP) soared above the overhead resistance of $0.43 on March 21. The bears tried to trap the aggressive bulls by pulling the price below the moving averages but the bulls held their ground.\n\nXRP/USDT daily chart. Source: TradingView\n\nBuyers are trying to push the price toward the overhead resistance at $0.51. If bulls clear this obstacle, the ETH/USDT pair could attempt a rally to $0.56. This level is likely to witness aggressive selling by the bears but if buyers bulldoze their way through, the next stop may be $0.80.\n\nAnother possibility is that the price turns down from $0.51. During the pullback, if bulls flip the $0.43 level into support, it will suggest that the sentiment has turned positive. That will increase the likelihood of a break above $0.51.\n\nThe crucial support to watch on the downside is $0.40. If this level gives way, the next support is $0.36.\n\nXRP/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are trying to defend the 61.8% Fibonacci retracement level at $0.46 and the bulls are buying the dips to the 20-EMA. This shows a state of equilibrium between the bulls and the bears.\n\nIf the price sustains above $0.46, it will suggest that bulls have seized control. The pair could then attempt a rally to $0.49 where the bears may again mount a strong defense. On the other hand, if the price slips below the 20-EMA, the pair may fall to $0.43 and then to $0.40.\n\nLitecoin price analysis\n\nWhile most major altcoins are struggling to start a recovery, Litecoin (LTC) is showing signs of strength. The 20-day EMA ($86) has started to turn up and the RSI is in the positive zone, indicating advantage to buyers.\n\nLTC/USDT daily chart. Source: TradingView\n\nThe LTC/USDT pair could first rise to $98 and then retest the strong overhead resistance at $106. This is an important level to keep an eye on because if it crumbles, the pair may accelerate to $115 and then to $130.\n\nAlternatively, if the price turns down sharply from $106, it will suggest that bears are active at higher levels. The pair could then drop to the 20-day EMA. If the price rebounds off this level, it will suggest that the sentiment remains positive. The bulls will then make another attempt to resume the up-move.\n\nThe first sign of weakness will be a break and close below the 20-day EMA. That could open the doors for a drop to $75.\n\nLTC/USDT 4-hour chart. Source: TradingView\n\nThe rebound off the 20-EMA on the four-hour chart shows that the bulls are viewing the dips as a buying opportunity. The bulls will try to kick the price above $96 and extend the up-move to the overhead resistance at $106.\n\nContrarily, if the price breaks below the 20-EMA, it will suggest that the bullish momentum is weakening. The pair could then descend to the uptrend line. This is an important level for the bulls to defend because if it cracks, the pair may tumble to $75.\n\nRelated: Bitcoin is 1 week away from 'confirming' new bull market — analyst\n\nMonero price analysis\n\nAfter trading near the moving averages for a few days, Monero (XMR) has broken free and is trying to climb higher.\n\nXMR/USDT daily chart. Source: TradingView\n\nThe 20-day EMA ($153) has started to turn up and the RSI is in the positive territory, indicating that buyers have the edge. There is a minor resistance at $170 but if bulls overcome this barrier, the XMR/USDT pair could pick up momentum and soar to $187 and subsequently to $210.\n\nThe moving averages are expected to provide support during pullbacks. A break and close below the 200-day SMA ($150) could turn the tide in favor of the bears. The pair may then slump to $132.\n\nXMR/USDT 4-hour chart. Source: TradingView\n\nThe 20-EMA on the four-hour chart is sloping up and the RSI is in the positive zone, indicating that bulls have the upper hand. The pair could reach $169, where the bulls may again face stiff resistance from the bears.\n\nHowever, on the way down, if bulls do not allow the price to break below the 20-EMA, it will increase the likelihood of a rally above $169. If that happens, the pair may climb to $180 and later to $188.\n\nThe first sign of weakness will be a break and close below the 20-EMA. That could open the doors for a possible drop to the 200-SMA.\n\nAvalanche price analysis\n\nThe bulls have successfully held Avalanche (AVAX) above the moving averages, indicating that lower levels are attracting buyers.\n\nAVAX/USDT daily chart. Source: TradingView\n\nThe price has been consolidating between $18.25 and the 200-day SMA ($16.05) for the past few days but this range-bound action is unlikely to continue for long. If buyers thrust the price above $18.25, the AVAX/USDT pair will attempt a rally to $22 where they may face strong selling by the bears.\n\nThis positive view will invalidate in the near term if the price plummets and sustains below the 200-day SMA. The pair could then slide to $15.24 and thereafter to $14.\n\nAVAX/USDT 4-hour chart. Source: TradingView\n\nThe bulls have successfully guarded the $16.25 level on the downside but they have failed to propel the pair above the resistance line. This indicates that the bears have not given up and they continue to sell on rallies. The flattish 20-EMA and the RSI near the midpoint do not give a clear advantage either to buyers or sellers.\n\nThis uncertainty could tilt in favor of the bulls if they take out the resistance line. The pair may then start the next leg of the recovery to $20 and later to $22. A break and close below $16.25 will tilt the advantage in favor of the bears.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGFpbHljb2luLmNvbS9ncmVlbnBlYWNlLWFudGktY3J5cHRvLWFydGlzdC1hZG1pdHMtd3Jvbmctb24tYml0Y29pbi1taW5pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Greenpeace Anti-Crypto Artist Admits They Were Wrong on Bitcoin Mining - DailyCoin",
        "content": "Following backlash for an anti-Bitcoin art piece, a Greenpeace-commissioned artist has had a change of heart.\n\nArtist activist Benjamin Von Wong admits he was wrong about Bitcoin and PoW.\n\nHe has offered a solution that would appease Greenpeace and Bitcoiners alike.\n\nEnvironmental agency Greenpeace has said that Bitcoin is fueling the climate crisis and claim that the cryptocurrency should simply switch its code to operate on a proof-of-stake (PoS) consensus mechanism.\n\nGreenpeace’s ongoing war with Bitcoin and its environmental impact reached a head when the organization unveiled its art piece dubbed the “Skull of Satoshi.” However, the artist of the piece, activist Benjamin Von Wong, admitted his belief about proof-of-work (PoW) was “wrong.”\n\nVon Wong’s piece was part of the “change the code, not the climate” campaign to convert Bitcoin’s consensus mechanism to a PoS. The artist took to Twitter after his artwork garnered the wrong kind of attention.\n\n“It was an optimistic hope that Bitcoin could shift away from the needless burning of fossil fuels without losing all the other features that make Bitcoin safe, secure, and decentralized,” Von Wong wrote.\n\nI made the Skull believing that Bitcoin Mining was a simple black-and-white issue. I’ve spent my entire career trying to reduce real-world physical waste, and PoW felt intuitively wasteful.\n\n\n\nOf course, I was wrong.\n\n\n\nFew things in the world are black and white. Dumb me. /4 — Von Wong (@thevonwong) March 25, 2023\n\nHe explained that he now understands that it is not “a simple black-and-white issue.” Following this admission, he went on to propose a solution that could work for both sides.\n\nVon Wong believes that Bitcoin miners should invest in renewable energy and away from fossil fuels, as that would leave Greenpeace nothing to argue against.\n\nA New Face of the Coin\n\nMuch of the reason for Von Wong’s turnabout in his stance has to come from the reaction of crypto enthusiasts. Instead of being deterred by the art piece, many admired it and looked to adopt it as a mascot.\n\nSo badass honestly pic.twitter.com/z68XVws6by — Will Foxley 🧭 (@wsfoxley) March 24, 2023\n\nAdditionally, other criticisms took away from the effectiveness of the message behind the work. It was pointed out that the skull, which was supposed to be made of electronic waste from Bitcoin mining, contained no ASIC-printed circuit boards.\n\nMoreover, the smokestacks on the skull resembled nuclear cooling towers, which emit steam, not pollution.\n\nIt appears Greenpeace was unable to source a single Bitcoin ASIC PCB for their propaganda. It's all general purpose computer motherboards, some CPU heatsinks, a couple old af PCI Ethernet NICs, maybe some old af pre-Bitcoin GPUs? Hilarious. pic.twitter.com/XGNzpXl5EL — magic internet moneyist (@notgrubles) March 23, 2023\n\nOn the Flipside\n\nAccording to the Bitcoin Mining Council’s 2022 report, 59.5% of the total Bitcoin mining global energy already comes from renewable sources and this figure is increasing.\n\nWhy You Should Care\n\nWhile there are arguments on either side for the harm Bitcoin mining does to the environment, a shift to more renewable energy can only be good. This move should also be manageable as renewable energy is usually more affordable and helps profit margins for miners.\n\nDelve deeper into DailyCoin’s crypto news:\n\nNvidia CTO Deems Crypto Useless While Advocating for ChatGPT AI\n\nForbes 30 Under 30’s Norman Wooding: Crypto Landscape Has Changed"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vaGFja2Vybm9vbi5jb20vY2FuLXlvdS1zZW5kLWJpdGNvaW4tYW5vbnltb3VzbHktYS1zdGVwLWJ5LXN0ZXAtZ3VpZGUtZm9yLXByaXZhdGUtY3J5cHRvLXRyYW5zYWN0aW9ucy1pbi1ub3ctd2FsbGV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Can You Send Bitcoin Anonymously? A Step-by-Step Guide for Private Crypto Transactions in NOW Wallet - hackernoon.com",
        "content": "4,435 reads\n\nCan You Send Bitcoin Anonymously? A Step-by-Step Guide for Private Crypto Transactions in NOW Wallet\n\nEN"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmNjbi5jb20vYml0Y29pbi10cmFuc2FjdGlvbi1yZWFsbHktd29ya3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "How a Bitcoin Transaction Works - CCN.com",
        "content": "By using CCN.com you consent to our privacy & cookie policy"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aWxsLWJ0Yy1kaXRjaC10aGUtYmVhci1tYXJrZXQtNS10aGluZ3MtdG8ta25vdy1pbi1iaXRjb2luLXRoaXMtd2Vla9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Will BTC ditch the bear market? 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) enters the last week of March in uncertain territory as a strong weekly close still keeps $30,000 out of reach.\n\nThe largest cryptocurrency has sealed seven days of practically flat performance despite some volatility in between as the market seeks fresh direction. Where could it go next?\n\nIn what was a week of more surprises from the macroeconomy, BTC/USD spent much time reacting to decisions from the United States Federal Reserve and associated commentary.\n\nNext up, however, is a period of relative calm, followed by a key monthly close, which analysis says could see the start of a new bullish trend.\n\nBitcoin is currently up 20% for March, meaning that the coming days will decide the strength of the ongoing recovery from multi-year lows.\n\nCointelegraph takes a look at five key topics to bear in mind during the final week of what has been a volatile month.\n\nCountdown to Bitcoin price monthly close\n\nBitcoin managed to close the week with a modest flourish, returning to the $28,000 mark, data from Cointelegraph Markets Pro and TradingView shows.\n\nBTC/USD 1-week candle chart (Binance). Source: TradingView\n\nThis meant that BTC/USD stayed practically unmoved versus the weekend prior, delivering some impressive stability despite the periods of volatility which occurred in the intervening period.\n\nNonetheless, concerns are brewing that the market may struggle to preserve current levels.\n\nIn a fresh analysis on March 27, popular Twitter account IncomeSharks flagged on-balance volume (OBV) as a telltale sign of decreasing momentum.\n\n“Just hard to ignore the weak OBV at resistance, price at resistance, and the lack of demand at these prices,” it commented alongside a chart.\n\n“If we drop we get a new wave of buying demand that should push us higher. Only way we go up from here is big news in the markets or another squeeze.”\n\nBTC/USD annotated chart. Source: IncomeSharks/ Twitter\n\nTrader and analyst Rekt Capital agreed that a retracement would be “healthy” for Bitcoin should it enter.\n\n“If BTC continues to struggle to break beyond $28,700 then a healthy dip may need to occur to gain fresh buyer interest at lower levels,” he tweeted on the day.\n\n“Technicals are showing some short-term weakness & it could be that a catalyst will soon appear to play that weakness out.”\n\nOver the weekend, Rekt Capital had flagged that price point as a critical area to watch while remaining upbeat about the longer-term trend.\n\nBTC/USD, he forecast, will “confirm” a breakout from its bear market at the end of March, provided the monthly close preserves the 200-week moving average (WMA) as support.\n\nThe 200WMA currently stands at around $25,500, giving bulls room for a modest dip.\n\n#BTC has broken back above the 200-week MA\n\n\n\nHowever, it hasn't technically been reclaimed as support\n\n\n\nIf $BTC were to soon dip, price could try to retest the 200-week MA as support\n\n\n\nSuccessful retest there would fully confirm the breakout beyond the 200-week MA#Crypto #Bitcoin https://t.co/RqdxRuAkwd pic.twitter.com/zdYjOHxwCE — Rekt Capital (@rektcapital) March 26, 2023\n\nSimilarly level-headed, but on shorter timeframes, is trader Crypto Tony, who eyed $27,700 and $26,600 to hold on the day.\n\n“We have yet to lose the EQ at $27,700 on a 4 hour time frame, so the doomsday tweets can take a break,” he summarized, referring to the point in a range where buy and sell pressure is balanced.\n\n“The range low at $26,600 is what we need to lose to begin a short hedge position for myself.”\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nPCE data in focus as SVB gets bought out\n\nUnlike last week, the final days of March are not slated to deliver surprises from the U.S. macroeconomic realm.\n\nThat is not to say that a curveball will not appear, but the rest of the month is comparatively quiet in terms of macro data releases.\n\nKey macro economic events for the week ahead:\n\n\n\n️ Thursday 30th (UTC)\n\n12:30 — US Gross Domestic Product (GDP)\n\n12:30 — US Unemployment Claims\n\n\n\n• GDP expected at the same 2.7%\n\n• Unemployment Claims expected at 196K from 191K\n\n\n\n️ Friday 31st (UTC)\n\n12:30 — US PCE Core… — Lambda (@lambdamarkets1) March 26, 2023\n\nThe one key exception could be the March 31 release of the Personal Consumption Expenditures Index (PCE), which holds crucial insights into U.S. inflation trends.\n\n“US PCE inflation numbers are due this week - last month this data caused a volatile move lower in risk,” markets commentator Tedtalksmacro commented.\n\n“However, this month core PCE is expected to cool to +4.4% YoY down from +4.7% previous. That would be risk positive.”\n\nShould Bitcoin react to PCE data that comes in outside expectations, the results could make for a volatile weekend just a day before the monthly close.\n\nAny new developments in the ongoing banking crisis would add uncertainty into the mix, and the risk is there — contagion remains in Europe, while the defunct Silicon Valley Bank (SVB) found a buyer overnight.\n\nJUST IN: First Citizens agrees to buy Silicon Valley Bank for $500 million.\n\n\n\nJust one year ago, SVB was worth nearly $40 billion and operated as the 14th biggest bank in the U.S.\n\n\n\nOne month ago, First Citizens was half the size of SVB.\n\n\n\nIt’s concerning how quickly SVB collapsed. — The Kobeissi Letter (@KobeissiLetter) March 27, 2023\n\nHaving hiked interest rates despite the crisis, the Fed is on a diverging path when it comes to interest rates, and further hikes could come, it says. In contrast, markets hold the opposite opinion due to the stress already induced by prior rate increases.\n\n“Much tighter financial conditions and ongoing signs of bank stress are major reasons why the market thinks the Fed will be forced to abandon their plans,” analysis platform Mosaic Asset explained in the latest edition of its updates series, “The Market Mosaic,” on March 26.\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nMosaic further warned that historically, risk assets performed worse immediately following news of a rate hike policy pivot.\n\n“If the Fed does pause the rate hiking campaign, it will signal growing concerns that the central bank is breaking something in the capital markets. But also consider that the Fed has a track record of adjusting policy only when it’s too late,” it continued.\n\nIt added that “as a result, in past bear markets the steepest stock market declines happened after the Fed pivots to a pause or outright rate cuts.”\n\nBTC hodlers setting up supply shock\n\nBitcoin hodlers are setting new records under current conditions and laying the foundations for a supply shock in the process.\n\nThe latest data from on-chain analytics firm Glassnode shows that the amount of the available BTC supply, which has not left its wallet in two years or longer, is now at all-time highs.\n\nAs of March 27, more than 52.5% of all mined BTC has stayed dormant since at least March 2021, with owners not selling or transferring during the ensuing bear market.\n\nBitcoin dormant 2+ years chart. Source: Glassnode/ Twitter\n\nAddress numbers are also in “up only mode,” with the number of wallets holding 0.1 BTC or more setting new records on the day.\n\nLikewise, wallets with a non-zero balance are more plentiful than ever, with 45,388,865 in existence as of March 27.\n\nBitcoin non-zero balance wallet chart. Source: Glassnode/ Twitter\n\nThe numbers feed into an existing narrative over what will happen to BTC price action during the next wave of mainstream consumer interest.\n\nWith so much of the supply now ferreted away into cold storage, any rush for BTC could spark the realization that one of the world’s hardest assets is already too scarce.\n\nAccording to Glassnode, the overall BTC balance held by major exchanges remains near its lowest in five years.\n\nExchange BTC balance chart. Source: Glassnode\n\nBitcoin delivers perfect timing\n\nFor some, BTC price action is right on track for repeating past cycles, setting a new all-time high in the process.\n\nAmong them is Tedtalksmacro, who notes that the timing of the November multi-year lows on BTC/USD was more or less perfect.\n\nSince then, a rally that began in January has stuck, and there have been no signs yet that fresh macro lows will appear to take out the $15,600 floor from November 2022.\n\n“~390 days until the next BTC halving,” Tedtalksmacro wrote on March 27, referencing a dedicated thread about Bitcoin’s performance from the end of January.\n\nBTC price is thus sticking to historical precedent by bottoming more than 400 days before its next block subsidy halving.\n\nTedtalksmacro, meanwhile, is not the only popular commentator taking halving cycle timing into account when it comes to price.\n\nEarlier this month, Rekt Capital estimated that the next all-time high should be in around 18 months.\n\n“It takes BTC around 900 days to rally from Downtrend breakout to Bull Market top,” he explained.\n\n“If history repeats, $BTC will perform a Bull Market top in the Summer of 2025.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nCrypto market sentiment stays greedy\n\nAs with last week, a potential thorn remains in the side of Bitcoin’s bull run, which comes from investors themselves.\n\nRelated: XRP, LTC, XMR and AVAX show bullish signs as Bitcoin battles to hold $28K\n\nDespite the volatility over the Fed rate hike and inability to push closer to $30,000, Bitcoin has seen the kind of sentiment absent since its late 2021 all-time highs.\n\nAccording to the Crypto Fear & Greed Index, “greed” presently characterizes market sentiment in crypto more broadly.\n\nOn March 21, the Index’s score hit 68/100, the most since November 2021, and has continued to circle the mid-60s since.\n\nWhile not near “extreme” levels, the higher the Index rises into greed, the more likely a market correction will occur.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvd2ViMy9ldWxlci1jb2luYmFzZS1jZW8tcmVndWxhdGlvbnMtYml0Y29pbi1saXF1aWRpdHktbmFzZGFxLWN1c3RvZHktcTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "'Crypto king' kidnapped, Euler exploiter returns $90m, Bitcoin flirts with 10-month liquidity lows - DLNews",
        "content": "‘Crypto king’ kidnapped and tortured\n\nCanada’s self-proclaimed “crypto king” Aiden Pleterski was kidnapped, tortured and held for ransom last year, according to court documents.\n\nPleterski’s crypto investment scheme was forced into bankruptcy in August.\n\nWhile he had pledged to pool investors’ money to invest in cryptocurrencies and foreign exchange positions, Pleterski allegedly only invested about 2% of the $41.5 million invested, burning roughly $16 million on his extravagant lifestyle.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nCourt documents filed in relation to the bankruptcy case on March 14 claim that Pleterski was kidnapped, tortured and held for ransom during three days in December.\n\nHe was eventually released after promising the kidnappers that he’d come up with the money for the ransom quickly.\n\nNOW READ: Do Kwon was nabbed in a private jet on tarmac in Montenegro with false Costa Rican passport\n\nEuler Finance exploiter returns $90m from $197m hack\n\nThe Euler Finance exploiter has returned $90 million of the $197 million worth of Ether stolen from the protocol.\n\nJoin the community to get our latest stories and updates\n\nOn March 13, the exploiter launched a flashloan attack to steal digital assets consisting primarily of ETH, WBTC, and USDC.\n\nThe attacker engaged in a series of on-chain messages with both Euler and North Korea-linked cybercriminal gang Lazarus, before publicly requesting to ”come to an agreement.”\n\nIt remains to be seen if the exploiter will return the remaining funds.\n\nSorry to interrupt the twitter algo programming, but the Euler exploiter has just returned a huge chunk of the funds.\n\n\n\nThis is some of the best news to cap off a very concerning week.https://t.co/NHh8M1SAAY pic.twitter.com/Zm72JuY2zX — scoopy trooples (@scupytrooples) March 25, 2023\n\nNOW READ: Hacker poised to pocket 2.8 million tokens in ‘compromised’ Arbitrum airdrop\n\nCoinbase CEO Armstrong calls for crypto activism\n\nCoinbase CEO Brian Armstrong has called on American voters to demand clear crypto regulations after the Securities and Exchange Commission slammed the exchange with a Wells notice, indicating pending legal enforcement.\n\nThe crypto boss made the demand late last week during a Twitter Space, urging listeners to push their local congressperson to adopt a pro-crypto stance.\n\nCoinbase launched advocacy programme Crypto 435 in February with the goal of raising awareness in the US regarding the crypto industry.\n\nArmstrong has previously asserted his resolve to fight the SEC in court if required.\n\nThe SEC has battered the crypto industry with enforcement actions this year, having launched similar cases against major crypto companies such as Kraken and Paxos.\n\nNOW READ: Coinbase ‘welcomes’ legal battle with SEC amid signs of widening crypto crackdown\n\nBitcoin liquidity hits 10-month low despite rally\n\nDespite strong price action in recent weeks, Bitcoin liquidity has dropped to a 10-month low.\n\nThe drop in liquidity comes following a wave of US bank collapses in March. A large chunk of USD-paired tokens relied on reserves held in banks such as Silvergate, Silicon Valley Bank, and Signature Bank.\n\nBitcoin has surged 70% this year, though debate rages as to whether it is a safe haven from banking system contagion or simply experiencing high volatility linked to low liquidity.\n\nNOW READ: Bitcoin becomes haven during bank bloodbath with 28% surge: ‘Extra liquidity, that’s the difference’\n\nNasdaq sets Q2 goal for digital asset custody service\n\nNasdaq is pushing to launch its digital asset custody service by the end of the second quarter, marking a possible silver lining for the crypto industry following a slew of custodian bankruptcies in March.\n\nFor a major exchange to offer custody services would mark a major milestone for crypto in the US, where such services have largely been handled by banks.\n\nNOW READ: Stablecoins and Binance next in SEC crosshairs after Coinbase warning\n\nNFT holder accidentally burns $129,000 CryptoPunk\n\nNFT trader Brandon Riley accidentally burned a CryptoPunk NFT worth $129,000 by sending the coveted piece to a burn address.\n\nRiley tweeted the mistake on Friday, stating that the NFT represented a third of his net worth.\n\nBecause burn addresses are built so no one can access its private keys, any assets sent to them are lost forever, highlighting the ever-present potential for loss, even by experienced crypto users.\n\nIn his tweet, Riley asked CryptoPunk creator Yuga Labs to sell him a wrapped “v1 Punk” with the same likeness to commemorate his loss.\n\nToday I accidentally burned a @cryptopunksnfts trying to wrap punk 685.\n\n\n\nI was so focused on following the instructions exactly, that I slipped up, destroying a third of of my net worth in a single transaction. @yugalabs please sell me the @v1punks 685 as a consolation. 🙏🏼 pic.twitter.com/jHoTGvlc7j — Brandon Riley (@vitalitygrowth) March 25, 2023\n\nFed releases Custodia rejection verdict, cites crypto-associated risks\n\nThe US Federal Reserve published its rejection of Custodia Bank’s application to become a Federal Reserve System member on Friday, outlining what it states to be bank run risks and Custodia’s “novel and unprecedented features.”\n\nCustodia is state chartered in crypto-friendly Wyoming, and proposes a new model for income generation, which makes money on fees rather than invested deposits.\n\nSome commentators are saying the rejection is based on perceived wider crypto-scepticism held by regulators.\n\nMore web3 news from around the web...\n\nWeb3 gaming developers continue to be favored by investors – Blockworks\n\nBlackRock’s tokenisation push is just the start — private asset boom may hit $290tn – DL News\n\n‘What the EU’s anti-money laundering regulations mean for crypto’ - The Block"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9ndWlkZXMvaW50cm9kdWN0aW9uLXRvLWJpdGNvaW4tb3JkaW5hbHMv0gFIaHR0cHM6Ly93d3cuY29pbnNwZWFrZXIuY29tL2d1aWRlcy9pbnRyb2R1Y3Rpb24tdG8tYml0Y29pbi1vcmRpbmFscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Introduction to Bitcoin Ordinals - Coinspeaker",
        "content": "The creation of Bitcoin ordinals is a thoughtful and innovative development for the world’s first cryptocurrency. It has gained massive adoption from several blockchain enthusiasts and onlookers within a short time. The following guide describes Bitcoin ordinals and how they function.\n\nSince the inception of non-fungible tokens (NFTs), many have begun to wonder about the correlation between a random digital item and the blockchain. In 2021, NFTs gained massive popularity generating over two billion dollars in revenue and finding numerous use cases. However, the Bitcoin (BTC) network could not cause any due to the rigidity of its build. Other blockchain networks like Ethereum (ETH), Polygon (MATIC), and Cardano (ADA), among others, accommodated the minting and trading of NFTs. Satoshi Nakamoto’s cryptocurrency initially focused on improving the speed, anonymity, and flexibility of financial transactions. However, many users opposed Bitcoin’s concentration on transactional activities against the multi-functionality of Ethereum, a decentralized, open-source blockchain with smart contracts.\n\nAfter several agitations, Bitcoin received several tweaking forks, thereby increasing the diversity of the blockchain. These forks include SegWit, Bitcoin Gold, Bitcoin Diamond (BTCD), Classic, Bitcoin Cash ABC, Bitcoin Cash SV, Taproot, and many others. Bitcoin ordinals, a recent upgrade developed by Casey Rodarmor, will allow users to inscribe metadata in images, JSON, and texts into satoshis. Satoshi is a fraction of a whole Bitcoin; there are 100 million satoshis in 1 BTC. This significant fork could be the birth of NFTs minting on the world’s first cryptocurrency. Interestingly, Bitcoin ordinals function on a different mechanism from the conventional NFT. Below we will discuss how.\n\nBitcoin Ordinals Defined\n\nBitcoin ordinals, alternatively called Bitcoin NFTs, are digital assets inscribed on the satoshi. As earlier stated, a satoshi is the lowest denomination of Bitcoin. Basically, these digital artifacts are “sats” that have been ordered and inscribed with a piece of information. These pieces of information transformed an ordinary satoshi into a de-facto NFT. Before the emergence of Bitcoin ordinals, other NFT attempts on the Bitcoin blockchain include Counterparty (2014) and Stacks (2017). Bitcoin NFTs were introduced in January 2023.\n\nHow Do Bitcoin Ordinals Work?\n\nBitcoin ordinals arose from contention among the Bitcoin community over the monotonous function of the blockchain. The lack of diversity in the Bitcoin blockchain was caused by its meager transaction size of 80 bytes which could barely contain text messages. The upgrade implemented through SegWit and Taproot turned things around by increasing Bitcoin transaction size to almost 4MB. These upgrades allow for a refined arrangement of transactional data.\n\nUsers can identify the position of sitting according to four parameters:\n\nThe index of sat in the block.\n\nThe index of the block in the difficulty adjustment period x/2016.\n\nThe index of the block in halving epoch x/210,000.\n\nThe cycle number.\n\nThis arrangement implies that a preceding sat is rarer than the immediate successive sat. In technical terms, ordinal uses remodeled codes as an envelope for data inscribed onto sats.\n\nOrdinal Inscriptions\n\nOrdinal inscriptions are metadata of digital artifacts written on sats; they do not require a sidechain or a separate token. The direct presence on the blockchain is one of the contrasts between Bitcoin NFTs and Ethereum-based NFTs. These data are stored in taproot script-path spend scripts under the storage of 4MB.\n\nThrough a two-step process, anyone can generate an ordinal inscription. To begin with, users should create a taproot output with inscription content. After that, they can spend the output to reveal the inscription content on the blockchain. The inscription content is enveloped in a type of no-op that does not change the script. Considering the ordinal theory, inscriptions can be transferred, traded, and recovered. The ordinal theory defines satoshis (sats) as the atomic unit that can be identified and traded individually on the Bitcoin network.\n\nInscriptions can be traded on the Ordinal Punks website. Users can explore the ordinals’ Discord channel. Gamma.io, the leading marketplace on Stacks, plans to unveil a paid marketplace where users can generate and trade inscriptions (text or images). Oridalsbot, a product designed by the creators of the Satoshibles NFT collection, also performs similar services. Some wallets like Xverse, Hiro wallet, and Sparrow wallet are currently rolling out support for Bitcoin NFT. A specialized wallet like Ordwallet can receive ordinals, create inscriptions and prevent accidental spending by freezing individual sats. To run an Ordwallet, users require a full Bitcoin node and 500 GB of disk space.\n\nBitcoin Ordinals vs Traditional NFTs\n\nBitcoin ordinals look relatively similar to traditional NFTs, intersecting in the ability to incorporate digital items. From a more technical standpoint, there are several differences between the two digital assets. Bitcoin ordinals can be found on-chain as all raw data are directly written on the blockchain. On the other hand, NFTs are minted separately as a new token that could have references to files on other blockchains.\n\nBitcoin currently has a hard cap of 21M total supply and a 4MB limit. These stats could hinder the amount of Bitcoin NFT mint if all space was used as ordinals. NFTs on other blockchains have a more flexible and expansive minting space. The Bitcoin space uniquely differs from Ethereum and has no smart contracts, decentralized exchange, or easily accessible wallets. It has a poor UI restricting trading of ordinal to over-the-counter. Regardless, ordinal trading has gathered attention from many users.\n\nThe rarity of a traditional NFT is solely determined by the attributes of the artwork, which invariably affects the asset’s price. For Bitcoin ordinals, rarity might depend on the order of minting. Collectors can decide to have a flare for the first 1000 sats mint. It is possible for Casey Rodarmor’s inscription of “tiny pixel art” of a skull, popularly known as Genesis Block, could be worth millions of dollars in the next few years.\n\nFinally, traditional NFT can regulate the kind of content generated, unlike Bitcoin, a permissionless sphere where the inscription on sats cannot be censored. This means users can freely generate permanent illicit and copyrighted content.\n\nBitcoin Ordinals’ Use Cases\n\nThe use cases of Bitcoin ordinals are very scanty at the moment. Their limited block size will significantly restrict their functionality against NFT-diversified use cases. For example, inscribing a game into a Bitcoin Ordinal is quite unfeasible due to the 4MB transaction size. Future exploration of Bitcoin Ordinals could revolve around the following: music, fashion, metaverse, supply chain, luxury products, and artworks.\n\nMost Popular Bitcoin NFT Collections\n\nWithin a short period, several Bitcoin NFT collections have surfaced. Amidst the numerous, here are a few popular Bitcoin NFT collections:\n\nOrdinal Punks – a collection of 100 NFTs minted within the first 650 inscriptions on the Bitcoin blockchain. It has a minimum bid price of 3.7 BTC and a maximum bid price of 50 BTC.\n\nTaproot Wizard – a creation by Udi Wertheimer consisting of an ordinal collection of hand-drawn NFT wizards.\n\nBitcoin Rock – a collection of 100 supply-capped NFTs featuring the aesthetic and spirits of Ether Rock, one of the first NFT collections on the Ethereum blockchain.\n\nTimechain Collection – a limited set of 21 ordinals depicting various forms of timepieces. These timepieces vary in rarity as Pocket Watches, Ancient Sundials, Wristwatches, Wall Clocks, Cyberpunk Alarm Clocks, Clock Towers, Monolith, and Grandfather Clocks.\n\nOrdinal Loops – this NFT is popularly known as Object 0; it is a rotating mathematical torus and is one of just seven similar animations in the first collection from Ordinal Loops. It was auctioned for 7.156 BTC ($156,500).\n\nBenefits and Challenges\n\nHere are some important benefits that accompany the introduction of Bitcoin ordinals. These digital artifacts will increase Bitcoin use cases, the number of users, and the adoption rate. Ordinals creator campaign is saying: “Come for fun, rich art, stay for the decentralized digital money.” Unlike Ethereum NFT, ordinal transactions are more decentralized, immutable, well-secured, and transparent. Assets are directly pegged to the blockchain with relatively cheaper transactional fees costing $50 to 1M bytes.\n\nThe violation of copyright and privacy might pose a serious threat to Bitcoin ordinals, thereby enabling the growth of malware. At the moment, there is no regulatory mechanism on the open network. For many Bitcoin core developers, the introduction of Bitcoin ordinals has deviated from its initial financial mission.\n\nConclusion\n\nThe creation of Bitcoin ordinals is a thoughtful and innovative development for the world’s first cryptocurrency. It has gained massive adoption from several blockchain enthusiasts and onlookers within a short time. Nevertheless, it must be treated cautiously, as exploitation is bound to occur. Hopefully, it will expand and maximize the utility of the Bitcoin network shortly."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjcvY3J5cHRvLWxlbmRlci1rb2tvbW9zLWRldmVsb3BlcnMtdXNlLXdyYXBwZWQtYml0Y29pbi1mb3ItNG0tZXhpdC1zY2FtL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjcvY3J5cHRvLWxlbmRlci1rb2tvbW9zLWRldmVsb3BlcnMtdXNlLXdyYXBwZWQtYml0Y29pbi1mb3ItNG0tZXhpdC1zY2FtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Crypto Lender Kokomo's Developers Used Wrapped Bitcoin for $4M ‘Exit Scam,’ Security Firm Says - CoinDesk",
        "content": "Another developer address was then used to maliciously approve a transfer of spending more than 7,000 sonne wrapped bitcoins, another bitcoin derivative token on Ethereum. Those tokens were then used to swap all user-supplied liquidity to Kokomo, amounting to over $4 million."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vdGVjaG5vbG9neS8yMDIzL21hci8yNi9jcnlwdG9jdXJyZW5jaWVzLWFkZC1ub3RoaW5nLXVzZWZ1bC10by1zb2NpZXR5LW52aWRpYS1jaGF0Ym90cy1wcm9jZXNzaW5nLWNyeXB0by1taW5pbmfSAYoBaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3RlY2hub2xvZ3kvMjAyMy9tYXIvMjYvY3J5cHRvY3VycmVuY2llcy1hZGQtbm90aGluZy11c2VmdWwtdG8tc29jaWV0eS1udmlkaWEtY2hhdGJvdHMtcHJvY2Vzc2luZy1jcnlwdG8tbWluaW5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrencies add nothing useful to society, says chip-maker Nvidia - The Guardian",
        "content": "The US chip-maker Nvidia has said cryptocurrencies do not “bring anything useful for society” despite the company’s powerful processors selling in huge quantities to the sector.\n\nMichael Kagan, its chief technology officer, said other uses of processing power such as the artificial intelligence chatbot ChatGPT were more worthwhile than mining crypto.\n\nNvidia never embraced the crypto community with open arms. In 2021, the company even released software that artificially constrained the ability to use its graphics cards from being used to mine the popular Ethereum cryptocurrency, in an effort to ensure supply went to its preferred customers instead, who include AI researchers and gamers.\n\nKagan said the decision was justified because of the limited value of using processing power to mine cryptocurrencies.\n\nThe first version ChatGPT was trained on a supercomputer made up of about 10,000 Nvidia graphics cards.\n\n“All this crypto stuff, it needed parallel processing, and [Nvidia] is the best, so people just programmed it to use for this purpose. They bought a lot of stuff, and then eventually it collapsed, because it doesn’t bring anything useful for society. AI does,” Kagan told the Guardian.\n\n“With ChatGPT, everybody can now create his own machine, his own programme: you just tell it what to do, and it will. And if it doesn’t work the way you want it to, you tell it ‘I want something different’.”\n\nCrypto, by contrast, was more like high-frequency trading, an industry that had led to a lot of business for Mellanox, the company Kagan founded before it was acquired by Nvidia.\n\n“We were heavily involved in also trading: people on Wall Street were buying our stuff to save a few nanoseconds on the wire, the banks were doing crazy things like pulling the fibres under the Hudson taut to make them a little bit shorter, to save a few nanoseconds between their datacentre and the stock exchange,” he said.\n\n“I never believed that [crypto] is something that will do something good for humanity. You know, people do crazy things, but they buy your stuff, you sell them stuff. But you don’t redirect the company to support whatever it is.”\n\nOriginally best known for producing powerful graphics cards for PC gamers to play the latest games, it was almost by chance that Nvidia’s products took their place at the heart of the AI boom.\n\nThe computationally intensive work of training a new AI system, which can take millions of billions of dollars-worth of computing power, happened to work significantly faster on the types of simple yet powerful processors that had been adopted by gamers.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nTwo weeks ago, Microsoft said it had bought tens of thousands of Nvidia’s AI-focused processors, the A100 GPU, in order to power the workload of OpenAI. Nvidia has sold 20,000 H100s, the successor to that chip, to Amazon for its cloud computing AWS service, and another 16,000 have been sold to Oracle.\n\nNvidia also rents access to the chips directly, with its DGX cloud service starting at just under $37,000 (£30,250) a month for just eight H100s wired together in a “cluster”.\n\nSpeaking at the company’s annual conference last week, Jensen Huang, Nvidia’s chief executive, described the company as the engine behind “the iPhone moment of AI”, and said the “generative AI” his firm powers would “reinvent nearly every industry”.\n\nLast year, Nvidia’s $40bn takeover of the UK-based tech firm Arm collapsed because of regulatory difficulties."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjQ2MjIvc2t1bGwtc2F0b3NoaS1hcnRpc3Qtc2F5cy13YXMtd3JvbmctYml0Y29pbi1taW5pbmfSAVJodHRwczovL2RlY3J5cHQuY28vMTI0NjIyL3NrdWxsLXNhdG9zaGktYXJ0aXN0LXNheXMtd2FzLXdyb25nLWJpdGNvaW4tbWluaW5nP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "'Skull of Satoshi' Artist Says He Was 'Wrong' About Bitcoin Mining - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBenjamin Von Wong, the Canadian artist who became Crypto Twitter's main character last week after unveiling his “Skull of Satoshi” installation, said the work “was never meant to be anti-Bitcoin.”\n\n“It was an optimistic hope that Bitcoin could shift away from the needless burning of fossil fuels without losing all the other features that make Bitcoin safe, secure, and decentralized,” Von Wong wrote in a Twitter thread.\n\nHe also said that when he began working on the installation, he genuinely believed that Bitcoin mining, which uses the proof-of-work (PoW) consensus algorithm, was “a simple black-and-white issue.”\n\nAD\n\nAD\n\n“I’ve spent my entire career trying to reduce real-world physical waste, and PoW felt intuitively wasteful,\" wrote Von Wong. \"Of course, I was wrong.”\n\nI made the Skull believing that Bitcoin Mining was a simple black-and-white issue. I’ve spent my entire career trying to reduce real-world physical waste, and PoW felt intuitively wasteful. Of course, I was wrong. Few things in the world are black and white. Dumb me. /4 — Von Wong (@thevonwong) March 25, 2023\n\nThe “Skull of Satoshi” was unveiled last week as part of the year-long campaign helmed by Greenpeace, the international environmental NGO, which seeks to highlight “the enormous climate impact” of Bitcoin mining.\n\nThe initiative, supported by the other environmental organizations and the likes of Ripple co-founder Chris Larsen, is called “Change the Code, Not the Climate” and seeks to move Bitcoin to a more environmentally friendly proof-of-stake (Pos) mechanism. The move would mean changing the leading cryptocurrency's underlying code.\n\nAfter the fierce backlash the idea received from the Bitcoin community, Greenpeace now says that it's \"not necessarily suggesting that Bitcoin should switch to some existing form of PoS.”\n\nAD\n\nAD\n\n“We are pointing to the fact that other cryptocurrencies realized that PoW has an energy problem and changed,” Rolf Skar, special projects manager at Greenpeace USA, told Decrypt. “Bitcoin is the laggard in this area and is sticking to decade-old technology while other newer cryptocurrencies are using different consensus mechanisms and cutting their carbon emissions.”\n\nAs for the artist himself, Von Wong said that he spent the last few days speaking to various members of the Bitcoin community and now wants “to take a pause and refrain from participating in more public discourse and spend more time quietly and privately observing and learning until I know exactly how my contributions can objectively contribute to helping the environment.”\n\n“I needed to first string together some official responses to the Twitterverse and had been trying to digest all the different fragments of information that I was receiving from various places,” Von Wong told Decrypt. “I'm trying to better understand the nuance between progress and perfection.”\n\nChanging the Bitcoin—mission impossible?\n\nAccording to Greenpeace, which earlier hinted that transitioning Bitcoin to PoS would require a soft fork, the organization is “optimistic about technological innovation and human creativity, so we aren’t going to throw up our hands and declare that this is 'impossible.'”\n\n“The climate crisis demands that we all–not just Greenpeace or Bitcoin–find ways to ensure a just and green future. We regularly work on issues that are objectively more complicated and difficult to figure out than changing Bitcoin’s code,\" Skar told Decrypt. \"It is only impossible if we refuse to try.”\n\nPeople working closely with Bitcoin, however, are far less optimistic.\n\n“Every node in the Bitcoin network verifies the new block header to be smaller than the given number, defined by mining difficulty. If you change that rule, all nodes that don't want to update to a new software version will fall off the consensus. That effectively will create a hard fork situation,” Viacheslav Zhygulin, co-founder and CTO of stroom.network, a liquid staking protocol for the Bitcoin Lightning Network, told Decrypt.\n\nAccording to Zhygulin, while Bitcoin’s open-source code allows anyone to make changes, all major upgrades to the Bitcoin network over the past decade, including SegWit and Taproot, have been executed as soft forks, and that there are “no chances” for a successful hard fork any time soon.\n\nAD\n\nAD\n\nUnlike soft forks, hard forks are not backward-compatible and require all node operators on the network to update to the latest software at a specified time.\n\n“There is virtually no chance that a hypothetical Bitcoin on PoS would be accepted as the original Bitcoin, and it's highly improbable that it would ever come into existence,” Phil Harvey, the CEO of Bitcoin mining consulting firm Sabre56, told Decrypt.\n\nAccording to Harvey, the Bitcoin code has been designed “to be practically impossible to change,” as doing so requires agreement from all network participants.\n\n“In the past, factions of nodes have hard-forked the code, but the resulting coins have not been considered Bitcoin anymore. This rigid design is largely due to the core developer and early adopter group's ideological commitment to the principles of sound money. While they might abandon Bitcoin, it's highly unlikely that they would ever switch to a PoS system,” said Harvey.\n\nThe Sabre56 founder also said that the value of digital assets stems from their ability to solve financial and other problems.\n\n“Bitcoin's use case as a sound, decentralized, immutable, uncensored, globally accessible, and self-custodied reserve currency is intrinsically connected to PoW. Its pillars, such as the halving cycles, mining economics, and block validation, all rely on this consensus mechanism,\" Harvey told Decrypt. \"Introducing PoS to the Bitcoin network would change its entire identity and value proposition.”"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWlzLTEtd2Vlay1hd2F5LWZyb20tY29uZmlybWluZy1uZXctYnVsbC1tYXJrZXQtYW5hbHlzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin is 1 week away from 'confirming' new bull market — analyst - Cointelegraph",
        "content": "Bitcoin (BTC) has a matter of days to go before beginning a new macro uptrend, the latest analysis says.\n\nIn his latest tweet, popular trader and analyst Rekt Capital flagged a key monthly close in the making for BTC/USD.\n\nBTC price action closely mimics past cycles\n\nDespite facing problems flipping $28,000 to support, BTC price action is firmly on the way to abandoning its bear market.\n\nThat is according to Rekt Capital, who on March 26 presented an optimistic picture of how BTC/USD would likely finish the month.\n\nThe pair’s recent gains have put it above a macro downtrend in place since its 2021 all-time highs, but the March close would be the first potential candle to complete above that trend line on monthly timeframes.\n\n“Next Saturday, the BTC Monthly Candle will have closed above the Macro Downtrend to confirm a new Bull Market,” Rekt Capital commented.\n\nRelated: Best and worst countries for crypto taxes — plus crypto tax tips\n\nAn accompanying chart compared 2023 price behavior to that of previous cycles and implied that Bitcoin is now breaking out toward new all-time highs after setting a bear market low.\n\nShould that be the case, the cycle low would have occurred in November 2022, just after the FTX debacle, when BTC/USD hit $15,600.\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nA further post reiterated that the current monthly candle fits Bitcoin’s historical patterns when it comes to breakouts from macro downtrends.\n\nNotice how #BTC Macro Downtrend Breakout Candles have historically had upside wicks form (yellow circles)\n\n\n\nThis current Monthly breakout candle looks no different$BTC #Crypto #Bitcoin pic.twitter.com/HSzaaXHGfe — Rekt Capital (@rektcapital) March 25, 2023\n\nNo flipping $28,000 as weekly close approaches\n\nBitcoin spot price action meanwhile continues to keep market participants guessing as the weekend comes to an end.\n\nRelated: Bitcoin bulls remain bullish, but macro and crypto-specific hurdles have BTC pinned below $30K\n\nMostly flat trading behavior has seen little by way of change, with a push over $28,000 the first notable event in several days. At the time of writing, however, BTC/USD was back below that level, as shown by data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-hour candle chart (Binance). Source: TradingView\n\nPopular analytics account Skew argued that exchange behavior was characteristic of weekends, with overall lower liquidity apt to move spot price more easily.\n\n$BTC Spot CVD Buckets & Delta Orders\n\nMMs selling pretty heavily here into some large buyer, typically price compresses till either side is out of capital to move price or gives up.\n\n\n\nSunday shenanigans, GN CT ❤️ pic.twitter.com/4MFz6qSAYf — Skew Δ (@52kskew) March 26, 2023\n\nAnalyzing potential scenarios, trader Crypto Chase highlighted $28,600 as the breaker level, while to the upside, $33,000 was tipped as the point at which a “major reversal” would take place.\n\nBTC/USD annotated chart. Source: Crypto Chase/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNoYWVsLXNheWxvci1zLW1pY3Jvc3RyYXRlZ3ktcmVwYXlzLXNpbHZlcmdhdGUtbG9hbi1hbmQtYnV5cy02LTVrLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy repays Silvergate loan and buys 6.5K BTC - Cointelegraph",
        "content": "MicroStrategy, a business intelligence firm and major Bitcoin (BTC) investor, is acquiring more BTC amid the recent cryptocurrency market recovery.\n\nMicroStrategy co-founder and former CEO Michael Saylor took to Twitter on March 27 to announce that the firm has repaid its $205 million loan to Silvergate.\n\nCiting a form 8-K filing with the United States Securities and Exchange Commission, Saylor stressed that MicroStrategy repaid the Silvergate loan at a 22% discount.\n\nThe company also acquired a significant stash of Bitcoin, purchasing 6,455 BTC for $150 million, or at an average price of $23,238 per coin as of March 23, the former CEO said. According to the filing, MicroStrategy acquired its latest batch of Bitcoin between Feb. 16, 2023 and March 23, 2023.\n\nWith the purchase, MicroStrategy has increased its total Bitcoins holdings to 138,955 BTC, bought for $4.1 billion at an average of $29,817 per coin, Saylor said.\n\nMicroStrategy repaid its $205M Silvergate loan at a 22% discount. As of 3/23/23, $MSTR acquired an additional ~6,455 bitcoins for ~$150M at an average of ~$23,238 per #bitcoin & held ~138,955 BTC acquired for ~$4.14B at an average of ~$29,817 per bitcoin. https://t.co/ALp9VLkTpt — Michael Saylor⚡️ (@saylor) March 27, 2023\n\nAs previously announced, MicroStrategy’s subsidiary MacroStrategy received a $205 million term loan from Silvergate Bank under its Silvergate Exchange Network Leverage program in March 2022. The loan was collateralized by certain Bitcoin owned by MacroStrategy and had a scheduled maturity date of March 23, 2025.\n\nUnder the terms of the credit agreement, MacroStrategy was required to maintain a loan to collateral value ratio of less than 50%. On March 24, 2023, MacroStrategy and Silvergate entered into a prepayment, waiver and payoff to credit and security agreement, with MacroStrategy voluntarily prepaying Silvergate around $161 million in full repayment.\n\n“Upon Silvergate’s receipt of the payoff amount, the credit agreement was terminated, and Silvergate released its security interest in all of MacroStrategy’s assets collateralizing the loan, including the Bitcoin that was serving as collateral,” the filing reads.\n\nRelated: Cathie Wood’s ARK loading up on Coinbase shares again, buying $18M\n\nIn the filing, MicroStrategy also mentioned that the company entered into an agreement with two companies — Cowen and Company and BTIG — to sell its aggregated class A common stock worth $500,000,000. According to the latest updates, MicroStrategy issued and sold an aggregate of 1,348,855 shares under the sales agreement for aggregate net proceeds to MicroStrategy of roughly $339 million.\n\nThe latest Bitcoin acquisition by MicroStrategy is apparently the first such transaction so far in 2023. The previous purchase took place in late December 2023, with MicroStrategy buying 2,395 BTC at an average price of $17,181 for a total of $42.8 million between Nov. 1 and Dec. 21.\n\nMicroStrategy did not immediately respond to Cointelegraph’s request for comment. This article will be updated with new information as it becomes available.\n\nMagazine: Crypto winter can take a toll on hodlers’ mental health"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9za3VsbC1zYXRvc2hpLXByb3Zlcy1iaXRjb2luLW1pbmluZy0xNzQ2NTQyMTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "The 'Skull of Satoshi' Proves Bitcoin Mining Discourse Isn't Dead - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nLast week, Benjamin Von Wong unveiled an art installation he was commissioned to create by Greenpeace USA for its “Change the Code, Not the Climate” campaign. The $5 million campaign is funded by Ripple co-founder Chris Larsen and aims to change Bitcoin's proof-of-work (PoW) consensus algorithm through a “code change” in order to save the environment.\n\nThe idea being that PoW uses energy and other consensus algorithms do not.\n\nThis article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.\n\nVon Wong’s art piece was revealed Thursday, March 23, in a blog post and video. He calls it the “Skull of Satoshi” – an apt name for an 11-foot tall skull made of wood, recycled styrofoam and 300+ pieces of electronic waste. The skull also features red laser eyes, a nod to the Bitcoin Twitter community who wear laser eyes in their profile pictures.\n\nInstead of enraging the Bitcoin community, as Greenpeace's campaign normally does, the Skull was almost immediately generally embraced because it was really cool.\n\nI mean, just look at how metal, how punk rock the whole art installation is. It’s literally an 11-foot skull with glowing red laser eyes and smokestacks growing out the top. What’s not to love?\n\nBitcoiners tweeted about how much they liked the Skull of Satoshi and some changed their Twitter profile pictures. Still there was hesitation from others to embrace the art because of where the money behind it came from. From that angle, Von Wong was lambasted.\n\nWithout getting into too much detail, the conversation about moving Bitcoin from proof-of-work to something else, like proof-of-stake (PoS), which doesn’t use much energy, is generally a nonstarter. Bitcoin will almost certainly never move away from proof-of-work. That isn’t obvious from the outside, so that’s exactly where Von Wong began his journey to understand bitcoin mining.\n\nStory continues\n\nIn a reflective tweet thread, Von Wong said he thought the Bitcoin environmental problem was “black and white.” After the “phenomenal accident” of the Skull of Satoshi, Von Wong spent time in conversation with environmentalist bitcoiners including Level39, Troy Cross and Daniel Batten. He now recognizes that Bitcoin can be a powerful force for improving the environment.\n\nThis creates a somewhat interesting parallel. Greenpeace will still presumably use the Skull of Satoshi to promote its “change the code” campaign, but it will work everywhere except on the internet where the skull has become somewhat of a mascot for Bitcoin’s environmental potential even without moving its consensus mechanism from proof-of-work.\n\nThe story here is that Von Wong went from “there’s only one way to fix Bitcoin’s environmental problem” to “actually, there are many ways to fix Bitcoin’s environmental problem” in the space of a few days. It’s not a story because Von Wong is someone big, important or special. It’s a story because as more and more people get interested in Bitcoin the environmental question will certainly come up again and again. And bitcoiners will, and must, be ready to engage constructively.\n\nFor someone who has been around Bitcoin for a while, I viewed Von Wong’s learning process around the nuances of bitcoin mining as honestly unsurprising. The fact that it was carried out in what seemed like a relatively nonabrasive way bodes well for onboarding future environmentalist-leaning bitcoiners.\n\nIf Bitcoin is to succeed, we need more bitcoiners. And because Bitcoin and environmentalism are not mutually exclusive, there are ways for PoW blockchains to be a positive force.\n\nBitcoin is for everyone, including environmentalists."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDMvMjcvYml0Y29pbi1jcnlwdG8tcmVsYXRlZC1zdG9ja3MtZmFsbC1hZnRlci1jZnRjLXN1ZXMtYmluYW5jZS_SAWVodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAzLzI3L2JpdGNvaW4tY3J5cHRvLXJlbGF0ZWQtc3RvY2tzLWZhbGwtYWZ0ZXItY2Z0Yy1zdWVzLWJpbmFuY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin and Ether decline, and Coinbase drops double digits after CFTC sues Binance - Fortune",
        "content": "The Commodity Futures Trading Commission sent the prices of crypto-related stocks and the most popular cryptocurrencies plummeting on Monday after it announced it was suing Binance and its CEO, Changpeng “CZ” Zhao, in federal court.\n\nBitcoin and Ether, the two leading cryptocurrencies, were down about 3% each over the past 24 hours, a change from the steady climb seen in recent days that saw each hit a monthslong high. The cryptocurrency BNB, which powers the Binance’s BNB chain, was down more than 6%.\n\nMany crypto-related stocks were down even more.\n\nShares of competing crypto exchange Coinbase fell just over 10% following the news. The company has recently run into its own regulatory trouble, with the Securities and Exchange Commission issuing a Wells Notice to the exchange related to “aspects of the Company’s exchange, our staking service Coinbase Earn, and Coinbase Wallet after a cursory investigation,” Coinbase said last week.\n\nShares of MicroStrategy, the Bitcoin “hodling” company founded by Michael Saylor, were also down more than 7% on Monday afternoon. In a tweet on Monday, Saylor said that the company had repaid a $205 million loan to collapsed crypto bank Silvergate at a 22% discount. Saylor added that the company spent around $150 million on 6,455 more Bitcoin tokens to bring its total holdings to 138,955, worth about $3.7 billion at current prices.\n\nMicroStrategy repaid its $205M Silvergate loan at a 22% discount. As of 3/23/23, $MSTR acquired an additional ~6,455 bitcoins for ~$150M at an average of ~$23,238 per #bitcoin & held ~138,955 BTC acquired for ~$4.14B at an average of ~$29,817 per bitcoin. https://t.co/ALp9VLkTpt — Michael Saylor⚡️ (@saylor) March 27, 2023\n\nThe share price of mining companies also fell. Marathon Digital Holdings was down more than 8%, while Colorado-based Riot Blockchain saw shares drop about 8%. Toronto-based crypto miner Hut 8 was down 6%.\n\nThe CFTC alleged in a 74-page complaint on Monday that the company “disregarded applicable federal laws while fostering Binance’s U.S. customer base…” The agency alleges in the lawsuit that Binance failed to implement know-your-customer and anti-money-laundering procedures, and helped U.S.-based customers “evade the compliance controls Binance purported to implement to prevent and detect violations of U.S. Law.”\n\nIn a Monday tweet, Zhao posted a message with just the number “4,” which he previously said meant to ignore FUD, a popular Crypto Twitter acronym for fear, uncertainty, and doubt."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vY29pbmdlZWsuY29tL2l0cy1hLWJpdGNvaW4tY29uc3BpcmFjeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "It's a Bitcoin conspiracy - CoinGeek",
        "content": "If you think the news is fake, how bad do you think the histories are?\n\nA conspiracy theory is like a tangled ball of yarn that a group of curious kittens unraveled, weaving an intricate web of mystery and intrigue—often chaotic, but usually at least a little bit compelling. Some are tales so mind-boggling that they make soap opera plotlines seem mundane, involving everything from secret societies to undercover aliens. They are the “whodunit” of alternative explanations, where the clues are often dubious, the logic sometimes stretches reality, and the endings are rarely satisfying.\n\nIn short, a conspiracy theory is a rollercoaster ride of suspense and surprise, where you’re never quite sure what’s fact, fiction, or just plain bonkers.\n\nBut a great many conspiracy theories do indeed end up being revealed to be true, and this is where real investigative journalism is needed.\n\nPrecedent\n\nOne of the most well-documented government conspiracy theories that was later proven to be true is the Watergate scandal. During the presidency of Richard Nixon, a break-in at the Democratic National Committee (DNC) headquarters occurred at the Watergate office complex in Washington, D.C., in June 1972.\n\nThe break-in was carried out by men who were eventually linked to Nixon’s re-election campaign. The Nixon administration initially denied, then tried to cover up the scandal, but investigative journalism by The Washington Post and other media outlets eventually uncovered a vast network of political espionage, sabotage, and illegal activities conducted by individuals connected to the White House.\n\nAs the evidence mounted, it became clear that high-ranking officials, including President Nixon himself, were involved in the cover-up. This led to a series of investigations, criminal prosecutions, and high-profile resignations, including the resignation of the President himself in 1974.\n\nThe Watergate scandal is a prime example of a government conspiracy that was initially dismissed as a baseless theory but was ultimately proven to be true. It also serves as a reminder of the importance of a free press and the role it plays in holding powerful institutions accountable.\n\nLet’s get a little spicier…\n\nThe existence of the MK-ULTRA program first came to light in 1973, when the CIA officially halted the project. Further details about MK-ULTRA were uncovered during a series of investigations by the U.S. Congress in the mid-1970s. In 1975, the Church Committee and the Rockefeller Commission both investigated the CIA’s activities, including the MK-ULTRA program, and exposed numerous unethical and illegal practices. These investigations brought the MK-ULTRA program into the public eye and confirmed its reality.\n\nFor 20 years, MK-ULTRA was a top-secret CIA program that was focused on researching mind control, chemical interrogation, and other forms of psychological manipulation. The project was initiated in response to concerns about the potential use of mind control by the Soviet Union during the Cold War.\n\nThe MK-ULTRA program involved conducting experiments on both animals and humans, often without the subjects’ knowledge or consent. Some of the experiments involved the use of hallucinogenic drugs, such as LSD, as well as other chemicals, electroconvulsive therapy, sensory deprivation, and various forms of psychological manipulation. The goal was to discover methods to control or influence human behavior for intelligence and military purposes.\n\nClaims about MK-ULTRA were deemed conspiracy theories for nearly a generation, but they were ultimately discovered to be largely true. The CIA was ultimately subjected to new oversight and restrictions, and the U.S. government issued formal apologies to the victims of the MK-ULTRA experiments.\n\nWhat about corporate conspiracies?\n\nTobacco Industry: Tobacco companies suppressed information about smoking’s harmful health effects for decades. They funded research that downplayed risks, manipulated public opinion, and lobbied against regulations.\n\nVolkswagen Emissions Scandal: In 2015, Volkswagen rigged millions of diesel vehicles with software to cheat emissions tests. The scandal led to substantial fines and criminal charges.\n\nSugar Industry: In the 1960s, the sugar industry funded research to shift heart disease blame from sugar to fat. The Sugar Research Foundation even paid Harvard researchers to downplay the link between sugar and heart disease, promoting saturated fat as the main culprit.\n\nPurdue Pharma Opioid Crisis: Purdue Pharma, the maker of OxyContin, marketed the drug as safe and effective for chronic pain, downplaying its addictive nature. Their deceptive marketing played a significant role in the opioid crisis, which has claimed thousands of lives in the United States.\n\nWhat does this have to do with Bitcoin?\n\nFor years, I have advocated for the Bitcoin community to stand firmly against the inherent conflict of interest that exists when Bitcoin-focused developers, custodians, exchanges and other businesses take investment money from companies in the legacy payment, finance and banking economies. New York Life, CME Group (NASDAQ: CME) and Mastercard (NASDAQ: MA) aren’t trustworthy bedfellows with a distributed electronic cash system that seamlessly combines data and money, are they? Of course not! So, the fact that they pay the salaries (through Digital Currency Group) of the developers who issue soft fork changes to the Bitcoin Core repo should be a gigantic, glaring, blaring red flag that something has gone completely awry!\n\nThe wolves are all the way in the hen house!\n\nWe know for a fact that soft forks cannot be resisted. Despite campaigns touting that you can’t “change the code,” the fact is that the code changes constantly, and the way that it changes leaves a small blocker with two options:\n\n1: Upgrade to the latest version to be able to validate transactions\n\nOR\n\n2: “Resist” the upgrade, and be unable to validate transactions.\n\nThere is NO OPTION to resist in any practical manner, which means there is no reason to run a node at all, and doing so makes a “node operator” nothing more than Maggie Simpson.\n\nBut instead of joining me to defend BTC, BCH and then BSV against the onslaught of Silicon Valley and old world finance, small blockers dance on bitcoin’s grave while calling folks like me a “conspiracy theorist” and focusing on non-news like the existence of the Lightning Sharks agency or Craig’s nefarious plan to spend a ton of money, time and reputational capital to stand up for deeply unpopular ideas as some sort of “scam.”\n\nIt’s tiresome, it’s nonsense, and I can’t wait until we move on to the era when today’s “crypto” influencers are laughed off of stages globally for being their unique mix of incompetence and malice for selling the bitcoin dream to the enemies!\n\nThankfully, there’s still rocks to look under, documents to inspect and facts to be revealed about the history of Bitcoin, Satoshi, the quiet coups, and the deep-seeded corruption that only Bitcoin can solve.\n\nEventually, the free independent press will pick this up too, and we will all be better for it.\n\nWatch: Bitcoin needs more salespeople\n\nwidth=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi93aHktdGhpcy1lY29ub21pY3MtcHJvZmVzc29yLXRoaW5rcy1iaXRjb2luLWlzLXdvcnRobGVzcy_SAWJodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vd2h5LXRoaXMtZWNvbm9taWNzLXByb2Zlc3Nvci10aGlua3MtYml0Y29pbi1pcy13b3J0aGxlc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Why This Economics Professor Thinks Bitcoin Is Worthless - NewsBTC",
        "content": "Steve Hanke, a professor of Applied Economics at Johns Hopkins University, is the latest scholar to trash Bitcoin.\n\nBitcoin Has No Fundamental Value, Says Professor\n\nIn a tweet on March 26, Hanke said Bitcoin is not a currency but a speculative asset whose fundamental value is zero. He appeared to back fiat, including the Japanese Yen and the USD, two of the world’s reserve currencies, as appropriate hedges in economic turmoil.\n\nBitcoin is not a currency. It's just a highly speculative asset with a fundamental value of zero. pic.twitter.com/leA4Fe9Ixz — Steve Hanke (@steve_hanke) March 26, 2023\n\nConsidering the role of the USD in the world’s market, the currency minted by the Federal Reserve has been historically used to hedge against economic crises. The USD remains as a store value, explaining the currency’s spike in valuation whenever the equities market tank.\n\nHanke’s comments come when Bitcoin and cryptocurrencies have been outperforming traditional assets, expanding amid the banking crisis in the United States.\n\nFollowing the bank run on Silicon Valley Bank (SVB) and the subsequent intervention by the United States government, where the Federal Reserve had to inject liquidity, averting a crisis, Bitcoin prices have been rallying. Last week, BTC peaked at around $28,800, the highest in over nine months.\n\nThe expansion of Bitcoin prices while banking stocks were under pressure, observers note, was enough to justify the digital gold’s role as a store of value. Hanke is pessimistic about Bitcoin, dismissing its use as a hedge. Specifically, he mentions the coin’s speculative nature, a trait also linked to the asset’s volatility.\n\nIn another tweet, the economist lauded the United States Securities and Exchange Commission (SEC) for getting serious about going after Coinbase, a cryptocurrency exchange. The regulator says Coinbase has violated a range of investor protection rules.\n\n1/ Today Coinbase received a Wells notice from the SEC focused on staking and asset listings. A Wells notice typically precedes an enforcement action. — Brian Armstrong (@brian_armstrong) March 22, 2023\n\nThe Wells Notice would possibly be the beginning of a legal showdown between the SEC, that’s been, in recent months, clamping down hard on crypto businesses, and Coinbase, the largest crypto exchange in the country.\n\nDr. Doom Celebrated The Failure Of Crypto-Friendly Banks\n\nHanke joins the likes of Nouriel Roubini, often known as “Dr. Doom”, who has been very vocal about his disdain for crypto. Roubini is a New York University professor emeritus and a Bitcoin critic. The professor celebrated the collapse of Silicon Valley Bank (SVB) and Signature Bank of New York in mid-March, slamming them for getting involved in cryptocurrencies.\n\nIn a tweet, Roubini said all banks supporting cryptocurrencies would collapse and that it was good riddance. He added that there was no logic in protecting depositors of Signature Bank, an institution that “recklessly decided to jump into the crappy crypto cesspool and bet the house on shitcoins biz.”\n\nEarlier, Roubini said crypto is risky, and the entire industry will go extinct.\n\nFeature Image From Canva, Chart From TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9zaXgtbWlsbGlvbi1iaXRjb2luLW5vdy1sb3N0LWZvcmV2ZXItd2h5LXRoaXMtbWF0dGVycy_SAV9odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vc2l4LW1pbGxpb24tYml0Y29pbi1ub3ctbG9zdC1mb3JldmVyLXdoeS10aGlzLW1hdHRlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Six Million Bitcoins Now Lost Forever? Why This Matters - NewsBTC",
        "content": "Over the years, millions of Bitcoin have been lost forever due to people forgetting or losing their keys, or possibly passing away without passing on their keys. With each passing year, this number grows and more BTC is lost. Now, this number is estimated to have crossed 6 million, which is quite bullish for the digital asset.\n\nSix Million BTC Are Out Of Circulation Forever\n\nIn a tweet, a manager at Cane Island Alternative Advisors, an investment advisory firm, revealed that the number of lost Bitcoins has crossed 6 million. Timothy Peterson shared this over the weekend where he explained that of the 19.3 million BTC that have been mined so far, there are only 13.3 million currently available. Going by Peterson’s numbers, over 31% of the current Bitcoin circulation supply is lost forever.\n\nI estimate that, as of this week, 6 million of the 19.3 million #bitcoin mined have been irretrievably lost. (See related research at https://t.co/ULso76SXjD ) This means 13.3 million remain with only 1.7 million left to be mined over the next 100+ years. In that time, it's… pic.twitter.com/WpiSNT9TSF — Timothy Peterson, CFA CAIA (@nsquaredcrypto) March 25, 2023\n\nThe investment manager further went on to state that another one million coins are expected to be lost by the time the remaining 1.7 million BTC are mined, which would take over 100 years with a halving happening every four years. Thus, “The 13 million circulating now is probably all you will have access to in your lifetime,” Peterson concludes.\n\nPeterson shared a link to a 2020 study from Cane Island Alternative Advisors which showed at the time that about 4 million BTC were lost forever, with the claims that there will never be more than 14 million BTC in circulation. However, the investment manager did not back his most recent claims with data.\n\nLost Bitcoin Good For Price?\n\nBitcoin already has a limited supply, which has been a boon for its value, but with millions of coins being lost as well, it reduces the already limited supply. If Peterson is correct and there will only be 14 million BTC in existence even when all 21 million are mined, then the value of Bitcoin could skyrocket beyond expectations.\n\nBTC price trending below $28,000 | Source: BTCUSD on TradingView.com\n\nBTC has no official burn, but other projects such as Shiba Inu have taken the burning approach to reduce the supply of the token and increase its value in the process. This works basically the same way for any asset, if supply remains lower than demand, then the value of that asset will continue to rise.\n\nCane Island Alternative Advisors acknowledges in its 2020 research note that the demand for BTC has been on the rise. “By all accounts, bitcoin demand has increased over time. Every metric – active addresses, transaction counts, hash rates, etc. has shown increased demand for bitcoin. Since price has also increased over that time, we can conclude that the increase in demand has outpaced the increase in supply.”\n\nAs Bitcoin adoption is expected to accelerate over the next few years and more BTC are lost, BTC at six figures become an even more likely reality.\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from The Enlightened Mindset, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbmdlZWsuY29tL21hc3RlcmluZy1iaXRjb2luLXdhbGxldHMtY29tYmluaW5nLWVsZWN0cnVtLXN2LXJvY2t3YWxsZXQtYW5kLWhhbmRjYXNoLWZvci1vcHRpbWFsLXVzZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Mastering Bitcoin wallets: Combining Electrum SV, RockWallet and HandCash for optimal use - CoinGeek",
        "content": "Are you ready to explore the world of Bitcoin wallets and learn how to maximize their potential? Dive into our comprehensive guide that meticulously examines Electrum SV, RockWallet, and HandCash, three prominent wallets in the Bitcoin SV (BSV) ecosystem. We’ll walk you through their unique features, capabilities, and limitations, empowering you to make informed decisions and leverage each wallet to suit your needs. Discover how using these wallets in tandem can elevate your Bitcoin experience and boost your Bitcoin journey.\n\nIn a previous article, I shared a simple way to create a Bitcoin address1, allowing you to receive BSVs (not BTC) in no time. As long as you keep your private key safe, your Bitcoins are secure in the blockchain.\n\nThis method is perfect for those who want to quickly start earning BSVs without diving deep into the technical side of Bitcoin. If your goal is to monetize your website, sell digital products (like ebooks, music, or software), or offer your services and expertise worldwide, it’s essential to focus on your business rather than the intricacies of Bitcoin. However, after some time and effort spent making sales, you’ll eventually accumulate a significant amount of Bitcoins (BSVs) in your address. So, how do you use, spend, or transfer your Bitcoins?\n\nAt this point, it’s time to expand your Bitcoin knowledge by exploring ‘warm’ or ‘hot’ wallets. These wallets are connected to the internet, making it easy to send Bitcoins. In contrast, a Bitcoin address alone is like a ‘cold’ wallet—not connected to the internet. I’ve tested three top BSV wallets—Electrum SV, RockWallet, and HandCash—and documented my findings in a video2. In this article, I’ll summarize what I discovered and suggest when and how to use each wallet.\n\nwidth=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nElectrum SV (Desktop version on Windows)\n\nElectrum SV is a popular wallet within the BSV community, providing users with a safe and flexible platform to manage their digital assets.\n\nOne standout feature is the ability to transform cold wallets into warm ones. By using your Bitcoin address’s private key, Electrum SV activates your cold wallet and imports its transaction history. It can also import wallets from other sources that use seed words. Once you’ve imported or activated your cold wallet, you’re ready to send Bitcoins to anyone worldwide.\n\nAdditionally, Electrum SV supports multi-signature wallets, an essential tool for businesses and individuals aiming to enhance their security. Multi-signature wallets protect your Bitcoins by only allowing transactions when a specific number of authorized signatories approve it. This feature has practical applications, like authorizing Bitcoin transfers only after a certain process is complete. For instance, a set amount of Bitcoins is sent after the seller, delivery company, and customer have all signed off on various transaction stages.\n\nWhile Electrum SV meets most needs, it lacks the ability to buy BSVs directly. That’s why I’d like to introduce RockWallet, which allows you to purchase BSVs with a credit card.\n\nRockWallet (Android version)\n\nRockWallet allows you to purchase BSVs using a credit card, making it a convenient option. It also offers a ‘sweep’ feature, enabling you to transfer the entire balance of your Bitcoin address (cold storage/paper wallet) to RockWallet’s Bitcoin address using the private key of your cold storage wallet. You can easily send, spend, or transfer your Bitcoins from there.\n\nRockWallet employs seed words to generate various Bitcoin addresses (public and private key pairs) for transactions, enhancing security and privacy. A notable feature is its ability to export transaction history to CSV files, which include essential details like source and destination Bitcoin addresses, amounts sent or received, transaction dates, and transaction IDs searchable via a Bitcoin Explorer. It also displays the prevailing exchange rate during each transaction, converting amounts to fiat currency values. This functionality is crucial for businesses, as they can export transaction histories to CSVs and import them into spreadsheets like Excel or Google Sheets for accounting or bookkeeping purposes.\n\nWhile RockWallet is excellent for personal and business use, let’s also explore HandCash, another fantastic wallet option.\n\nHandCash (Android version)\n\nHandCash is an impressive wallet that integrates seamlessly with various BSV apps and websites, providing users with a convenient and versatile platform for managing, spending, and earning Bitcoins as they use these apps and websites. For example, you can earn by selling your music or podcasts every time someone listens to your works (by using apps like Rare Generation, StreamableFM, and Real World Podcasts).\n\nYou can earn when you promote webpages (by using TonicPow). There is a list of games you can play too. They are all integrated into your HandCash wallet, so you can pay or earn automatically while playing. HandCash and the different apps and websites that utilize its power show off what is possible with BSV.\n\nFurther, HandCash provides APIs and SDKs so developers and programmers can easily integrate and monetize their apps, websites, and software with Bitcoin. So if you can code, consider looking into HandCash to plug into the power of BSV.\n\nI should mention that based on my tests on February 26, I could not buy BSV with HandCash with a credit card due to a temporary issue with their credit card partner. I am confident and hopeful that they will resolve this soon. In the meantime, you can easily transfer BSVs to your HandCash wallet from any wallet, including RockWallet and Electrum SV.\n\nNo need to choose—use multiple wallets\n\nIt’s essential to understand that you don’t have to pick just one wallet among Electrum SV, RockWallet, and HandCash. Knowing their capabilities, limitations, and features allows you to choose the right wallet for each transaction and situation. Feel free to use any or all of these wallets, as transferring funds between them is a breeze and can be done quickly.\n\nIn conclusion, the world of BSV wallets offers various options to cater to your unique personal or business-related needs. Electrum SV, RockWallet, and HandCash each bring strengths and features, ensuring you have the right tools for every transaction.\n\nYou don’t have to limit yourself to just one wallet; explore and utilize them all based on your requirements. Embrace the power and convenience of these digital wallets to enhance your Bitcoin experience. Give them a try and unlock the true potential of BSV to monetize your passions and improve your business and your everyday life.\n\nAbout the author\n\nMarquez Comelab, the founder of BSVSearch.com, is a firm believer in the potential of BSV to offer professionals, creatives, and small businesses a straightforward and cost-effective means of monetizing their products and services. Driven by his passion for sharing knowledge, Marquez aims to empower others to harness this cutting-edge technology. To complement this article, he has crafted a video demonstration showcasing the use of Electrum SV, RockWallet, and HandCash: https://youtu.be/Vlyux5zbEpk.\n\nNotes:\n\n[1] Please note that when we say Bitcoin, we mean Bitcoin SV, with the ticker symbol BSV. It should not be confused with BTC, an implementation that abandoned core principles described by its inventor (Satoshi Nakamoto) in the Bitcoin Whitepaper.\n\n[2] “Top Hot and Warm Wallets for BSV – Electrum SV, RockWallet and HandCash” by Marquez Comelab, BSVSearch.com, YouTube: https://youtu.be/Vlyux5zbEpk\n\nWatch: Lunch & Learn Bitcoin 101\n\nwidth=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL21pbnRnZW5pZS5saXZlbWludC5jb20vbmV3cy9wZXJzb25hbC1maW5hbmNlL2FyZS10aGUtd2luZHMtb2YtY2hhbmdlLWJsb3dpbmctZm9yLWNyeXB0b3MtaW4taW5kaWEtYXMtYml0Y29pbi1zcGlrZXMtNjUtdGhpcy15ZWFyLWV0aC00Ni0xNTE2Nzk3MzA4Nzg1MTnSAaMBaHR0cHM6Ly9taW50Z2VuaWUubGl2ZW1pbnQuY29tL2FtcC9uZXdzL3BlcnNvbmFsLWZpbmFuY2UvYXJlLXRoZS13aW5kcy1vZi1jaGFuZ2UtYmxvd2luZy1mb3ItY3J5cHRvcy1pbi1pbmRpYS1hcy1iaXRjb2luLXNwaWtlcy02NS10aGlzLXllYXItZXRoLTQ2LTE1MTY3OTczMDg3ODUxOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Are the winds of change blowing for cryptos as Bitcoin spikes 65% this year, ETH 46%? - MintGenie",
        "content": "Despite a high rate of tax on crypto , declining trading volumes and recently imposed money laundering provisions , India’s crypto sector still manages to garner an increasing interest of investors.\n\nThere are a number of reasons that explain this conundrum. This Calendar year is turning out to be relatively good for cryptocurrencies. Investors heaved a sigh of relief after bitcoin's price hit a 9-month high recently after the Silicon Valley Bank's collapse.\n\n“The collapse fuelled the rise in crypto prices because the belief in centralised banking systems was affected. As the flaws in the existing systems become more evident, the crypto sector will continue to have a revival,” says Avinash Shekhar, Founder & CEO, TaxNodes.\n\nSome experts have called this trend an affirmation of ‘reverse relationship’ between fiat currencies and blockchain-generated currencies.\n\nTo explain in simpler words: while banking system is undergoing a turmoil with the collapse of two US-based regional banks (Silicon Valley Bank and Signature Bank), blockchain- generated currencies are getting a much-needed boost at the same time.\n\n“In a truly remarkable decoupling from traditional finance, Bitcoin price has been soaring since the banking crisis started unfolding. Medium-size and regional banks in the US are under pressure due to fast rising interest rates and a run-on deposits, while industry observers are of the view that Bitcoin’s fixed supply schedule offers a unique hedge against the current macro environment,” says Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch.\n\nBitcoin has been rising considerably since the start of this year. Bitcoins prices rose from $16,625 (on Jan 1) to $27,493 (on Mar 24), reporting an increase of 65.37 percent in fewer than three months. Trading volumes spiked by 182 percent during this period.\n\nEthereum prices also rose considerably from $1,201 (on Jan 1) to $1,752 (Mar 24), reporting an increase of 45.87 percent. The ETH trading volumes during this period rose by 356 percent, CoinMarketCap data shows.\n\nBTC trading Volume\n\n(Source: CoinMarketCap)\n\nCoinswitch’s Parth Chaturvedi also confirms a similar trend. “Trading volumes across asset classes is a function of prices and usually increasing prices attract more trading volume. We have witnessed a similar trend in crypto trading volumes, since the beginning of the year, when prices started moving higher. We continue to onboard new domestic users and are also seeing existing users come back with renewed interest as crypto as an asset class is helping in portfolio diversification,” says Mr Chaturvedi.\n\n“The rally in bitcoin and other crypto prices will certainly add a positive outlook for cryptos for long-term investors,” adds Shekhar from TaxNodes.\n\nPolkadot conference\n\nNow since cryptocurrencies are made on blockchain technology, India’s large IT population and ever-growing tech infrastructure can turn things to its advantage, assert industry experts.\n\n“Due to government policies and increased market awareness, there has been a decoupling of cryptocurrency from blockchain. This shift in focus presents India with a unique opportunity to become a powerhouse of blockchain innovation, given its large IT competent population. This trend is a testimony to the shifting interests in the technology, and we can expect to witness more eastward movement of blockchains in the near future,” says Gaurav Mehta, Founder of Catax — Simple Crypto Taxes.\n\nAn upcoming global blockchain conference next month by Polkadot blockchain platform is seen as a validation of India’s growing importance in the blockchain technology.\n\nPolkadot blockchain platform is hosting first global conference in India in the first week of April in run up to its foray into India.\n\nWhile talking about the conference, Rishant (Rish) Kumar, Growth Lead, APAC, KILT Protocol said that India is an important hub for blockchain innovation.\n\nThis global conference can be seen by crypto optimists as one of the key events in the annals of blockchain industry and its growing significance in India.\n\nIt’s technology, stupid!\n\nExperts argue that the blockchain technology is revolutionary and its innovative use cases and implications continue to unfold. And the confusion happens when the entire focus of investors revolves around crypto prices instead of viewing blockchain in its entirety.\n\n“Despite its immense potential, the public at large has predominantly focused on the oasis of cryptocurrency, attracted by the promise of quick returns and libertarian ideals. As a result, blockchain technology has received less attention and remained outside of mainstream discourse and implementation,” says Mr Mehta from Catax.\n\nHowever, in view of the extreme volatility witnessed in the past, investors are advised to be wary before getting too bullish on cryptocurrencies.\n\nAfter all, despite the recently reported increase in bitcoin prices, this cryptocurrency still trades nearly 60 percent lower than its all-time high of $68,789.\n\n“Investors are finding merit in Bitcoin’s function as a store of value against monetary debasement, and the next few months will be crucial in supporting this narrative,” Parth Chaturvedi signs off.\n\nSo far, it may be a good year for cryptocurrencies, but what does the future hold for them — only a crystal ball reader can predict."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9jaXRpZXMvZGVsaGkvMi1tZW4tbHVyZS1iYW5rLWVtcGxveWVlLXRvLWludmVzdC1pbi1iaXRjb2luLWFuZC1kdXBlLWhpbS1hcnJlc3RlZC04NTE5MDc3L9IBgAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvY2l0aWVzL2RlbGhpLzItbWVuLWx1cmUtYmFuay1lbXBsb3llZS10by1pbnZlc3QtaW4tYml0Y29pbi1hbmQtZHVwZS1oaW0tYXJyZXN0ZWQtODUxOTA3Ny9saXRlLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "2 men lure bank employee to invest in Bitcoin and dupe him; arrested - The Indian Express",
        "content": "Investigation of the money trail led police to the bank account of a jeweller in Rohini in which the swindled amount was credited. “On enquiry, it was revealed that one Jatin Kumar Dhall, a class XII graduate, transferred the amount against the purchase of jewellery,” said DCP Kalsi. (Representational/File)\n\nTwo people were arrested for allegedly duping a bank employee of nearly Rs 1 lakh on the pretext of investing in Bitcoin by claiming it would yield high returns.\n\nDCP (North) Sagar Singh Kalsi said police received a complaint from the wealth manager of a reputed bank, a resident of Sarai Rohilla, who stated that last September, an unknown person messaged him through an Instagram ID and proposed that he invest money in Bitcoin. “The complainant got trapped in the inducement and transferred Rs 90,000 through his bank account on the assurance that he would get Rs 2,50,000 in three hours,” said the DCP."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tbGlxdWlkaXR5LWRyb3BzLXRvLWEtMTAtbW9udGgtbG93LWRlc3BpdGUtcHJpY2UtZ3Jvd3RoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Liquidity Drops to A 10-Month Low Despite Price Growth - Analytics Insight",
        "content": "Bitcoin liquidity drops due to the reason for loss of access to dollar-payment systems\n\nBitcoin continues to be the most popular cryptocurrency, providing an opportunity for numerous other digital assets that substantially contribute to the development of the cryptocurrency ecosystem. Even though Bitcoin is still the most widely used cryptocurrency, its existence also helps explain the popularity of numerous altcoins today. However, notwithstanding the cryptocurrency industry’s recent success, the past 12 months might have gone better. Following the announcement by regulators to ensure all depositors at Silicon Valley Bank and establish a fund to support other institutions nationwide, the price of bitcoin increased by around 18%. Despite Bitcoin price growth, Bitcoin liquidity drops due to the loss of access to dollar-payment systems by the companies that buy and sell cryptocurrency.\n\nEarly in March saw the collapse of Signature’s Signet network and Silvergate’s SEN, which exposed the cryptocurrency market to Bitcoin liquidity issues. It refers to a market’s capacity to facilitate the exchange of an asset for fiat money. Market inefficiencies brought on by narrow order books, slippage, and wide spreads prevent traders from losing traders to lose money when there is insufficient liquidity surrounding an asset. Also, it might lead to significant volatility and discourage experienced investors from making transactions.\n\nAccording to experts, the liquidity problem originally appeared as a $200 million decline in 1% trade volume following Silvergate’s network closure. By adding the bids and offers for the top 10 cryptocurrencies that are within 1% of the mid-price, the 1% market depth is determined. Market volatility decreases with enough market depth and high order book activity around the market price. From current quarterly opening levels, the market liquidity for Bitcoin and Ethereum is still down 16.12% and 17.64%, respectively” as per the decrypt site source.\n\nDue to the excellent liquidity of its underlying assets, cryptocurrencies are very marketable and have huge trade volumes. For this reason, they are also easily convertible into fiat money and other types of crypto assets. High liquidity is important in the cryptocurrency market though, as it typically signals to would-be investors that the underlying asset is stable. Thankfully, a high level of liquidity helps the cryptocurrency market because it allows for more precise pricing and charting. This makes it possible for analysts and investors to forecast market developments and trends. Owing to the vast number of market participants, the cryptocurrency market has significant liquidity, which speeds up the fulfillment of buy and sell orders. This entails that traders can enter or exit a contract without waiting immediately. The cryptocurrency had been performing exceptionally well before in 2021, but its popularity plummeted despite the excellent quality of its services. Markets occasionally experience liquidity problems, but the liquidity crisis in the cryptocurrency industry has lasted too long. Many individuals have worried about when the ongoing liquidity issue will resolve, which has raised questions. While analyzing the potential duration of the current liquidity issue, it is essential to comprehend crypto liquidity and how it affects the market’s development, efficiency, and future. Major cryptocurrencies like Bitcoin and Ethereum have experienced steep price declines, significantly lowering the sector’s market capitalization of the industry from the $2 trillion it reached at the beginning of 2022. The market suffered from contentious issues, such as Sam Bankman-FTX Fried’s failure. Nonetheless, the current liquidity problem, whose impact has been widely debated by analysts, is one significant issue.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzMtcmlzay1mcmVlLXRva2Vucy1mb3ItYnVsbC1tYXJrZXQtMjAyMy1iaXRjb2luLWJ0Yy1iaW5hbmNlLWNvaW4tYm5iLWFuZC1yZW5xLWZpbmFuY2UtcmVucS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "3 Risk-Free Tokens for Bull Market 2023: Bitcoin (BTC), Binance Coin (BNB), And RenQ Finance (RENQ) - Analytics Insight",
        "content": "Investing in the crypto market is like riding an unpredictable rollercoaster. To maximize profits, investors are continually searching for the next big opportunity. In 2023, the market is predicted to be in a bull run. Many investors are looking for risk-free options that can offer stable returns. We’ll explore three tokens considered low-risk options for the 2023 bull market: Bitcoin (BTC), Binance Coin (BNB), and RenQ Finance (RENQ).\n\nBitcoin (BTC): The King of Crypto\n\nBitcoin (BTC) is the most popular cryptocurrency. It has a limited supply of 21 million coins. The low supply makes it scarce and valuable. Bitcoin (BTC) is also frequently used as a form of payment and a store of value. It has a devoted following and a powerful network impact. Many investors agree that Bitcoin (BTC) is the market’s safest and most dependable cryptocurrency.\n\nBitcoin (BTC) is not governed by any middleman or central authority. Instead, it relies on a peer-to-peer network of nodes, which validates transactions and upholds consensus. Without authorization or trust, anybody may join the network and take part in the Bitcoin (BTC) protocol.\n\nCryptography is used by Bitcoin (BTC) to safeguard transactions and avoid duplicate spending. A Proof-of-work (PoW) consensus mechanism is used to generate new blocks and compensate miners for their labor. PoW requires a lot of computational power and energy, making it difficult for attackers to manipulate or reverse transactions.\n\nBeing an open-source project, anybody may check the source code of Bitcoin (BTC) to verify its operation. Moreover, its blockchain network functions as a shared ledger that records all network transactions. Everyone with availability to the blockchain may check the ownership and history of any Bitcoin (BTC).\n\nBinance Coin (BNB): The Utility Token of Binance\n\nBinance Coin (BNB) is the native token of Binance, the world’s largest and most trusted cryptocurrency exchange. Binance Coin (BNB) can be used to pay for trading fees on Binance and access various services and products offered by Binance and its partners. Binance Coin (BNB) also benefits from the growth and innovation of the Binance ecosystem, which includes Binance Smart Chain, Binance Launchpad, Binance NFT Marketplace, and more.\n\nBinance Coin (BNB) was launched in 2017 as an ERC-20 token on Ethereum but later migrated to its blockchain called Binance Chain. Binance Coin (BNB) has a total supply of 200 million tokens. Every quarter, Binance uses 20% of its profits to buy back and burn Binance Coin (BNB) tokens until 50% of the total supply is destroyed. This reduces the inflation rate and increases the scarcity and value of Binance Coin (BNB).\n\nRenQ Finance (RENQ): The Decentralized Lending Platform\n\nRenQ Finance (RENQ) is a decentralized lending platform that allows users to borrow and lend cryptocurrencies without intermediaries or centralized control. RenQ Finance (RENQ) uses smart contracts to automate loan agreements and enforce repayment terms. RenQ Finance (RENQ) also offers attractive interest rates for both borrowers and lenders. RenQ Finance (RENQ) is powered by its native token RENQ, which is used for governance and incentives on the platform.\n\nRenQ Finance (RENQ) intends to be community-driven, furthering its primary decentralization-related objective. The platform seeks to develop based on community decisions, employing a voting process where necessary and continuously taking into account and promoting forum conversations.\n\nRenQ Finance’s (RENQ) key objectives are to provide users anonymity, security, and transparency—some of the most crucial advantages a crypto exchange should have.\n\nAlthough many decentralized exchanges provide their users with these benefits, there are also some drawbacks. When comparing the two, investors frequently choose CEXs over DEXs since the former offers several advantageous features that many DEXs currently lack.\n\nConclusion\n\nBitcoin (BTC), Binance Coin (BNB), and RenQ Finance (RENQ) are all risk-free investments to add to your portfolio in 2023. However, RenQ promises greater returns. Since Bitcoin (BTC) and Binance Coin (BNB) are both well-established market leaders, further explosive growth is highly unlikely. RenQ Finance (RENQ), on the other hand, is a low-cap gem with enormous potential. During a bull run, such a crypto coin could gain over 1000x. According to market analysts, RenQ Finance will return up to 100x in 2023. Furthermore, they predict that the token will be worth between $10 and $15 by 2025. This is a huge jump from the current presale price of $0.030.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYm9sZC5jb20vYnVyZ2VyLWtpbmctaW4tcGFyaXMtbm93LWFjY2VwdHMtYml0Y29pbi1hbmQtY3J5cHRvLXBheW1lbnRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Burger King in Paris now accepts Bitcoin and crypto payments - Finbold - Finance in Bold",
        "content": "The international fast food giant Burger King has introduced Instpower power bank rental machines that accept cryptocurrency payments at its Paris locations. The machines are connected to crypto payment services Alchemy Pay and Binance Pay.\n\nAlong with Binance Pay and Alchemy Pay, Instpower, the industry-leading power bank charging service, now accepts cryptocurrency payments in assets such as Bitcoin from its customers at over 14,000 sites across the globe, as per an Alchemy Pay press release on March 27.\n\nThe latest news of Parisian Burger King is a major milestone for both the global fast food giant and the widespread use of cryptocurrencies as a means of payment for goods and services.\n\nCEO of the European distributor responsible for deploying Instpower machines, Yann Phu of Flash Development, is overjoyed that his company’s products are now available in Paris:\n\n“This collaboration with Burger King in Paris has taken us to the next level with our operations in Europe. Instpower’s machines will enable customers to power their devices while on the move.”\n\nThe CEO added:\n\n“In Asia, these powerbanks are used widely, but in Europe, the market is only just beginning to embrace them. By having Alchemy Pay helping users to pay with crypto via Binance Pay, we are bringing cutting edge payment options to Europeans.”\n\nBorderless payment option\n\nBecause of its borderless nature, crypto is a suitable payment option for Instpower’s shared power banks, which travelers often use to charge their gadgets while on the road.\n\nTo facilitate the acceptance of cryptocurrency payments by brick-and-mortar and virtual storefronts alike, Alchemy Pay introduced the first hybrid merchant payment acceptance solution in 2019. Almost two million businesses in seventy or more countries participated in the fiat-crypto payment acceptance system in 2021.\n\nNotably, last year food industry giants KFC, Taco Bell, and Pizza Hut filed NFTs and metaverse trademarks in March, following in the footsteps of fellow fast-food chain competitor McDonald’s (NYSE: MCD) decision to explore the metaverse."
    }
]