[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTEwLTE5L2JpdGNvaW4taXMtbm90LWdyZWF0LWZvci1tdXJkZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Is Not Great for Murder - Bloomberg",
        "content": "Programming note: Money Stuff will be off tomorrow, back on Monday.\n\nThere are three classic problems that you might encounter if you try to use Bitcoin to pay for goods and services. The first problem is that your Bitcoins might go astray: Bitcoin transactions are irreversible and involve sending money to long complicated addresses, and people are constantly trying to steal them. So if you send someone Bitcoin to pay for something, there will probably be a typo in the address and the person won’t get it and you’ll have to send it again and your first payment will just be permanently lost."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTAvMjAvYml0Y29pbi1wcmljZS1zb2Fycy1iaXRjb2luLWV0Zi1zZWMtcnVtb3JzL9IBVWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTAvMjAvYml0Y29pbi1wcmljZS1zb2Fycy1iaXRjb2luLWV0Zi1zZWMtcnVtb3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin breaks $30,000 as ETF rumors swirl - Fortune",
        "content": "It feels like something is finally happening in the crypto markets, whose famous volatility all but vanished in the past six months, only to be replaced by something that’s felt more like stagnation. During this time, Bitcoin has stayed mostly stuck in a sleepy band between $25,000 and $29,000.\n\nOn Monday, the action returned thanks to a screwy series of events. Trade publication Cointelegraph tweeted out “news” that the SEC had approved BlackRock’s application for a Bitcoin ETF, showing an alleged screenshot from Bloomberg’s authoritative news terminal. Bitcoin prices briefly shot up over $2,000 in response, suggesting a long-awaited rally was on its way.\n\nSince this is crypto, and anything can, and does, happen, the news turned out to be fake—part of an apparent news-based pump-and-dump scheme that raised awkward questions for Cointelegraph of who exactly had the keys to its social media accounts and why this happened. In any event, the rally petered out within an hour while whoever was behind the scheme presumably made a bundle on put and call options.\n\nIronically, though, the fake news served to uncover some real news—that price gains expected to coincide with the SEC approving a Bitcoin ETF were not, as many thought, already baked in. This appears to have nudged the price over the course of the week until Bitcoin crossed over the psychologically important $30,000 mark in the early hours of Friday before retreating to around $29,600 by midmorning.\n\nMeanwhile, a band of social media commentators set out trying to read—or misread—the tea leaves for when the SEC will actually flip the switch and approve a long-awaited Bitcoin ETF. This included seizing on the fact that Friday is the day when the Court of Appeals for the D.C. Circuit—which in August rejected the SEC’s reasons for not approving the ETF—checks a procedural box that it is done with the case. The date does not appear to be significant but sets off a spate of bullish chatter all the same.\n\nThings also took a further twist on Thursday when New York’s attorney general sued trading firm Genesis and its parent company, DCG, for joining the Winklevoss-owned Gemini in marketing 8% returns on cash and Bitcoin—a business that turned out to have been based around making huge loans to Sam Bankman-Fried’s fraudulent hedge fund. This has raised the question of whether the lawsuit against DCG means trouble for its subsidiary, Grayscale, which is one of the front-runners to land a Bitcoin ETF. A lawyer and an analyst who cover this space obsessively say the answer is no since Grayscale is a separate operation, but we shall see.\n\nAll of this underscores how an ETF remains crypto’s best hope of breaking out of its long-running slump, and how Bitcoin may be defined by drama once again.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe SEC has dropped charges against Ripple’s top executives, but the agency is still expected to pursue its appeal of a court ruling that XRP is mostly not a security. (Fortune)\n\nThe price of XRP jumped 7% on news of the SEC dropping the charges. (Fortune)\n\nSam Bankman-Fried’s trial is attracting journalists and lawyers—but also a motley crew of influencers and hangers-on, including a self-proclaimed “degen” named Taco. (New York Times)\n\nFormer ConsenSys employees are suing Ethereum cofounder Joe Lubin, accusing him of debasing their stock holdings by maneuvering the corporate ownership of valuable assets like MetaMask. (The Block)\n\nThe Treasury Department’s financial crimes unit will propose designating “mixers” as a money-laundering threat in response to recent concerns over Hamas and other terror groups using crypto. (CoinDesk)\n\nMEME O’ THE MOMENT\n\nRegulator cat:"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vYml0Y29pbi1icmllZmx5LWNyb3NzZXMtdXNkMzBrLW9uLWV0Zi1vcHRpbWlzbS04MzY0NDMw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Briefly Crosses $30K On ETF Optimism - Investopedia",
        "content": "KEY TAKEAWAYS The price of bitcoin briefly rose above $30,000 for the first time since August.\n\nA final mandate from courts soon, could bring more clarity on Grayscale Bitcoin Trust's conversion to an exchange-traded fund.\n\nThe bitcoin price briefly spiked roughly 10% on an incorrect report of a spot bitcoin ETF approval earlier this week.\n\nAnalysts think a spot bitcoin ETF could raise the bitcoin price as a regulatory stamp of approval from the SEC could make the crypto asset more accessible to investors.\n\n\n\nThe price of bitcoin briefly crossed the $30,000 mark Friday for the first time since August on optimism that a spot bitcoin exchange-traded fund (ETF) will likely be approved by the U.S. Securities and Exchange Commission (SEC) in the near future.\n\nSpot Bitcoin ETF Approval Expected Within Months\n\nMuch of the increased optimism around a spot bitcoin ETF approval comes from recent developments in a lawsuit regarding Grayscale Investments's intention to convert their Bitcoin Investment Trust (GBTC) into an ETF.\n\nThe Securities an Exchange Commission chose not to appeal a decision by the courts that disagreed with the regulator's reasons for turning down Grayscale's ETF conversion. The courts could issue a final mandate soon that will provide more clarity on the next steps in that process.\n\nBut there were other triggers too. On Monday, an incorrect report that the SEC had approved BlackRock's spot bitcoin application, pushed bitcoin prices higher.\n\n\"Some of this rally is way beyond the rumor,\" said Blackrock CEO Larry Fink, told Fox Business in an interview clarifying the incorrect report. \"I think the rally today is about a flight to quality with all the issues around the Israeli war now [and] global terrorism. And I think there are more people running into a flight to quality, whether that's in treasuries, gold, or crypto, depending on how you think about it. And I believe crypto will play that type of role as a flight to quality.\"\n\nIn an interview with CNBC earlier this week, Galaxy Digital Holdings CEO Michael Novogratz said he thinks the SEC's approval of a spot bitcoin ETF is going to happen before the end of the year.\n\nPreviously, Bloomberg analysts James Seyffart and Eric Balchunas estimated a spot bitcoin ETF's chances of approval by January 10, 2024 at 90%. A research report released by JPMorgan on Wednesday also indicated a spot bitcoin ETF approval is likely by that same date.\n\nThe eventual approval of a spot bitcoin ETF would be a major step toward the crypto asset's regulatory acceptance, making it easier for anyone to own the cryptocurrency and enabling more institutional money to enter the market. In a recent interview, Morgan Creek Capital CEO Mark Yusko indicated $300 billion could move into bitcoin following a spot ETF approval."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmdyZWVucGVhY2Uub3JnL3VzYS9yZXNlYXJjaC9yaW90LXBsYXRmb3Jtcy10aGUtY29tcGFueS1iZWhpbmQtdGhlLW1vc3QtZW5lcmd5LWludGVuc2l2ZS1iaXRjb2luLW1pbmUtaW4tdGhlLXUtcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Riot Platforms: The Company Behind the Most Energy Intensive Bitcoin Mine in the U.S. - greenpeace.org",
        "content": "Riot Platforms: The Company Behind the Most Energy Intensive Bitcoin Mine in the U.S.\n\nRiot Platforms is leading the polluting Bitcoin boom in Texas. The company operates the largest, and one of most energy and carbon-intensive, Bitcoin mines in the U.S. at their Rockdale facility and now plans to build an even bigger and dirtier mine in Corsicana.\n\nSummary\n\nRiot Platforms is leading the polluting Bitcoin boom in Texas. The company operates the largest, and one of most energy and carbon-intensive, Bitcoin mines in the U.S. at their Rockdale facility and now plans to build an even bigger and dirtier mine in Corsicana.\n\nRiot’s massive fossil fuel-generated energy use contributes to the climate crisis, while the company also profits from extreme weather. During heatwaves and cold snaps, Riot makes millions of dollars by simply doing nothing and selling energy back to the grid – often more than they earn mining Bitcoin.\n\nTexans are footing the bill with higher energy prices due to increased electricity demand from Riot, and tax incentives and subsidies going to Riot and other Bitcoin miners.\n\nBig financial companies including BlackRock, JP Morgan Chase, and Vanguard are helping bankroll Riot’s carbon emissions and water consumption.\n\nIntroduction\n\nAs the saying goes, everything is bigger in Texas, including Bitcoin mines. And that means big carbon emissions. Texas has become a hub for Bitcoin mining and since 2021, 2,234 megawatts (MW) of Bitcoin mining facilities have been built in the state by around 30 companies. [1] Standing out in this Bitcoin boom is Riot Platforms’ sprawling facility near Rockdale, Texas that is estimated to be the most energy and carbon-intensive Bitcoin mine in the U.S. [2] Riot now plans to grow that facility and while building an even bigger mine in the state, one that could be the largest in the world. This all means even more carbon emissions and local air, water, and noise pollution. [3]\n\nThrough its large Texas operations, Riot, a publicly traded company based in Castle Rock, Colorado, has grown into one of the largest Bitcoin mining companies in the U.S. Riot’s facilities also rely primarily on fossil fuel generated electricity leading to massive carbon emissions. [4] While the company contributes to the climate crisis, it makes money during extreme weather events, like heat waves and cold snaps, by getting paid to simply shut down and sell power back to the grid. [5] Meanwhile, everyday Texans are suffering from sweltering temperatures, paying higher energy bills, and dealing with the consequences of a strained electricity grid.\n\nEnvironmental and Community Impacts\n\nRiot Platforms operates the most energy and carbon-intensive Bitcoin mines in the United States out of an abandoned aluminum smelting plant in Rockdale, Texas. The facility is estimated to use 450 MW of power, equivalent to the amount of electricity used by the nearest 300,000 homes. [6] And almost all of that electricity comes from dirty fossil fuels, producing annual CO2 emissions of 1.9 million tons. Yet, according to Riot, the facility has even greater power capacity, 750 MW, and the company is in the process of expansion. [7] That would mean more GHG emissions and more electricity drained from the grid rather than going into people’s homes and offices.\n\nMeanwhile, Riot is constructing a new facility in Corsicana, Texas, about 60 miles south of Dallas in Navarro County, that would be even larger, potentially using 1 gigawatt of energy. [8] That could make it the largest Bitcoin mine in the world. The facility would generate even more carbon emissions and increase demand on the already-strained Texas electrical grid. [9] The added energy demand could push fossil fuel plants to keep operating and expand production.\n\nRiot’s approach to criticism is to either deny creating carbon emissions or greenwash its operations by claiming to support renewable energy. In response to an extensive New York Times investigation revealing the company’s huge energy use and GHG emissions, Riot released a video claiming the company’s mines have no emissions – a ridiculous argument that ignores how carbon emissions are calculated. [10] The company also issued a scathing statement in response that denied the company’s climate impacts. [11]\n\nYet, Riot’s environmental record is concerning. The company does not disclose GHG emissions or other environmental data which would provide vital transparency and accountability. It has a dismal ESG Score of 1.06 out of 10 from Bloomberg, and a 0 on environmental factors since the company does not disclose any environmental data, aside from discussing potential risks of climate change to its business. [12] In January 2022, a group of U.S. Senators and Congresspeople, including Elizabeth Warren and Edward Markey, wrote a letter to Riot and five other Bitcoin mining companies, over concerns about high energy use and requested more reporting and data including about the companies’ energy consumption and emissions. [13]\n\nBeyond the climate and air pollution implications of Bitcoin mining, these operations also create noise pollution that is harmful and disruptive to surrounding communities. Bitcoin mines are very loud largely due to the fans needed to cool the equipment. Facility noise can reach and remain at 95 dB, which some nearby residents have compared to having a jet-engine in your backyard. [14] All that noise has led to complaints and protests from affected communities in Texas and around the United States who are upset about the constant din from these industrial facilities that operate around-the-clock. [15] Riot’s Rockdale mine uses a mix of the loud air cooling method and some immersion cooling – submerging computers in liquid to keep them cool and clean, which reduces the need for fans. [16] The company has a water reservation agreement to pay approximately $2.1 million annually to get water from a nearby lake for use in cooling. [17] Riot says that the Corsicana mine will use immersion cooling. [18] However, it remains to be seen whether Riot actually uses this technology, which is more expensive.\n\nThe new Corsicana mine could use large amounts of water which is a major concern in an area enduring a historic drought. [19] The City of Corsicana plans to sell water to Riot which is projected to be up to 1.5 million gallons of water per day. [20] Meanwhile ranchers have recently been forced to sell cattle due to the lack of water in the region. [21]\n\nRunning on Public Money\n\nRiot’s polluting facilities benefit from a range of public subsidies and tax incentives, despite the anti-government rhetoric from the Bitcoin industry. [22] In particular, Riot receives payments from the Texas grid operator, ERCOT, to reduce and shut-down operations during periods of high demand and high energy prices. Thus, large energy users like Riot contribute to the climate crisis and strained energy grids while benefiting from extreme weather and an overloaded grid. [23] Riot has been paid millions by reducing usage and selling back electricity during periods of peak demand, like the record-setting deadly heat waves in summer 2023 when the company made $31.7 million in August alone. [24] Meanwhile, everyday Texans were asked to turn down their air conditioning and suffer through hot temperatures with no compensation.\n\nThe demand response program (in Texas called Responsive Reserve Service) that Riot participates in pays companies, with funds from ratepayers, for agreeing to cut back energy use. Yet residential customers cannot participate in the program and are asked to voluntarily cut back their use during energy crises. [25] Through the demand response program, Riot gets paid by promising to stop using electricity if ERCOT asks, even though ERCOT rarely requests them to do so. [26] Plus, miners might have shut-down at those times anyway given the high price of energy. Thus, miners like Riot can make millions of dollars for essentially doing nothing.\n\nAnother way Riot makes money is by selling electricity back to the grid which, in 2022, earned the company $18 million. [27] Miners like Riot secure long-term energy contracts with low prices and then can sell energy back at the higher market prices during periods of peak demand. [28] Price fluctuations are particularly extreme in Texas given the state’s independent and deregulated energy market. In 2022, the New York Times found that Riot saved around $27 million in potential fees by cutting back usage during periods of high demand. [29] At times Riot can make more money by shutting down and selling energy back to the grid than mining Bitcoin. [30] In August 2023, Riot made nearly four times as much money by selling energy than the company made mining Bitcoin.\n\nWhen winter storm Uri hit Texas in 2021, millions went without electricity for days during subzero temperatures and at least 246 people died, some freezing inside their homes. [31] And Texans who did have power faced astronomical electricity bills due to huge electricity price spikes. [32] Yet, miners like Riot were getting paid to scale back their operations and sell energy to the grid at high prices. Riot made $125 million selling energy during the storm. [33]\n\nWhile heat waves and winter storms have exposed vulnerabilities in the Texas energy grid, more and more energy demand from Bitcoin mining is being proposed, like Riot’s Corsicana facility. ERCOT is reviewing applications from Bitcoin miners to bring nearly 42 GW of electricity demand online by 2027, even a fraction of that would be a tremendous growth from the already substantial 3,000 megawatts used by the industry. [34]\n\nTexans are also paying more to keep their lights on than Riot pays to guess numbers in the race to win Bitcoin. Riot told investors in an August 2023 report that the company paid 2.8 cents per KwH compared to the average price of 7.2 cents for other industrial users and 13.5 cents for residents. [35] And miners like Riot are even making those electricity bills higher for residents. Analysis by energy research and consulting firm Wood Mackenzie finds that Bitcoin mining in Texas will lead to a 5% increase in electricity costs and cost an additional $1.8 billion per year. [36]\n\nRiot benefits from other tax incentives and subsidies as well. The company’s Whinstone mine in Rockdale is exempted from many state sales taxes through a Texas program for data centers that exempts companies from state sales and use tax on equipment and electricity. [37] The company that originally built the facility, Whinstone, also received public incentives and tax abatements. [38] Riot receives an abatement on improvements to the facility for an estimated taxable value of $151 million. [39] However the promise of 300 jobs at Riot’s Rockdale mine were overblown as only 14 new hires have been confirmed. [40]\n\nMeanwhile, Riot’s executives are making large sums of money. In 2022, CEO Jason Les and Chairman Benjamin Yi both made over $21 million in compensation while four other top executives all made between $2 and $3 million. [41] That was a year in which the company reported nearly $510 million in losses. [42]\n\nHopping on the Bitcoin Bandwagon\n\nRiot Platforms was not always in the mining Bitcoin business and used to develop veterinarian products and tools for diagnosing diseases. [43] In October 2017, amidst a wave of hype about blockchain and Bitcoin, the company made an abrupt shift after 17 years in biotech into the crypto industry. The company announced a name change from Bioptix to Riot Blockchain and told investors the company was getting into Bitcoin mining and other cryptocurrency services. [44] The company’s stock price soared and attracted lots of new buyers. But the sudden change was met with some criticism for following the hype about Bitcoin. Some large shareholders sold off large numbers of shares, making a lot of money, and several annual meetings were abruptly canceled. [45] This all led to several shareholder lawsuits and an SEC investigation. Ultimately, the lawsuits were dismissed and the SEC investigation ended without any recommendation of charges. [46] Still, the company continues to have weak governance practices. Bloomberg’s ESG scores give Riot a 4.68 out of 10 on governance issues which includes issues like executive compensation, board oversight, and the strength of auditing practices. [47]\n\nSince rebranding as a crypto company, Riot has acquired companies to grow its Bitcoin mining operations. In May 2021, under the leadership of the new CEO Jason Les, a former professional poker player, Riot made one of its largest acquisitions – a $651 million deal to buy Whinstone US, the company that built the Rockdale mining facility. [48] Riot has also sought vertical integration by expanding into industries that supply equipment services for Bitcoin mines. Also in 2021, Riot purchased ESS Metron, an electrical component engineering and manufacturing firm that caters to Bitcoin miners, for $50 million. [49] This gives Riot ownership over a company that provides essential infrastructure for its growing mining facilities. Riot also has a majority ownership stake in TessPay, a fintech company that offers a blockchain payment platform for telecom companies. [50]\n\nIn January 2023, the company changed its name again from Riot Blockchain to Riot Platforms to signal diversification from Bitcoin and cryptocurrency to other business streams, like high performance and cloud computing, amidst a period of economic turmoil for Bitcoin miners. [51] Riot’s share price had dropped 85% in 2022 as the price of Bitcoin slumped and the industry’s reputation struggled after numerous high-profile scandals. [52]\n\nPolitical Ties and Lobbying\n\nRiot, along with Bitcoin industry groups, has used its political muscle to secure and protect policies and subsidies favorable to miners’ bottom line. Riot has engaged in federal and state lobbying, and hired staff, often with ties to government agencies and conservative groups, to promote the companies’ interests.\n\nPublicly available data shows that Riot began spending on state and federal lobbying in 2022. In 2022, Riot (then named Riot Blockchain) reported spending $280,000 on federal lobbying through a contract with Holland and Knight, a Florida-based law firm that has a large federal lobbying operation. [53] As of August 2023, Riot has spent $220,000 on federal lobbying, which included paying $160,000 for lobbying services to Holland and Knight while the rest was done in-house by Riot staff. [54] Agencies that the company lobbied include the Commodity Futures Trading Commissions (CFTC) that oversees Bitcoin futures trading, the Department of Energy, Environmental Protection Agency (EPA), and Securities Exchange Commission (SEC). As of September 2023, Riot has spent between $70,000-$151,000 on hiring lobbyists in Texas for the 2024 election cycle. [55]\n\nThere is also a revolving door between former government officials and Riot’s staff and board, especially people with ties to right-wing politicians. In 2023 Riot hired a head of public policy, Brian Morgenstern, who is a former Trump Whitehouse official. Morgenstern served as deputy communications director and deputy press secretary for Trump starting in July 2020, and before that was a deputy assistant secretary for external affairs at the Department of the Treasury where he served as a senior aide and chief speechwriter to Trump-appointed Treasury Secretary Steven Mnuchin. [56] Morgenstern was named in an investigation by the U.S. Office of Special Counsel as one of the officials who violated the Hatch Act by promoting Trump’s reelection campaign during official interviews and media appearances. [57] After working for Trump, Morgenstern was a Senior Advisor at the America First Policy Institute – a group founded by ex-Trump administration officials to continue promoting Trump’s conservative policy agenda. [58] Morgenstern has a long career in Republican politics including working on Rudy Giuliani’s presidential campaign in 2008. [59] The company also hired Samuel Lyman as Director of Public Policy who also has ties to conservative politicians and powerful corporate interests who worked at the Orrin G. Hatch Foundation after being a speechwriter for Republican Senator Hatch, and was a speechwriter for the U.S. Chamber of Commerce – the wealthy corporate lobby group that has opposed action on climate change and environmental regulations. [60]\n\nIn May 2023, Riot announced that Brad Jones, the former Interim President and CEO of the Energy Reliability Council of Texas (“ERCOT”), was appointed to its advisory board. [61] Riot makes millions of dollars through various ERCOT programs and lobbies for those policies to continue in order to protect a key source of revenue.\n\nWhen Riot’s valuable ERCOT incentives were threatened by proposed state legislation, the company and allied industry groups pushed hard to block the bill. In spring 2023, Republican Texas state senator Lois Kolkhorst introduced Senate Bill 1751 that would cut back some incentives used by Riot and other miners. [62] The bill would cap miner’s enrollment in ERCOT’s emergency response services programs to 10% of all participants, require miners to register with ERCOT as “large flexible load,” and prohibit property tax breaks to Bitcoin mining facilities. The bill was passed by the Senate with bipartisan support, but didn’t make it out of a House committee in part due to mobilization by Riot and Bitcoin industry groups including the Texas Blockchain Council (TBC), the Satoshi Action Fund, and the Chamber of Digital Commerce. [63] Riot worked to stop the bill by issuing statements criticizing the legislation, telling legislators to vote against it, and having company leaders testify against the bill. [64] TBC was also a vocal opponent and has deep ties to Riot, which is an executive partner, the highest level of support for the group. Riot’s head of public policy is also a board member of the TBC. TBC has ties to powerful Texas Republicans like Governor Gregg Abbott. For example, the TBC’s VP for Public Policy and External Affairs, Reed Clay, was the Chief Operating Officer for the State of Texas under Governor Greg Abbott and helped advance Abbot’s far-right wing political agenda. [65] The industry celebrated killing the bill which they framed as an attack on the industry. [66]\n\nMeanwhile Riot has worked with Bitcoin mining and crypto industry groups to push favorable legislation. For example, the U.S. Congressman Pete Sessions, a Republican from Texas representing the district that covers Riot’s Rockdale mine, proposed House Resolution 238 that asserts proof-of-work mining is a boost for national energy goals and economic growth. [67] Sessions has appeared at events sponsored by the industry alongside representatives of Riot and praised the company. [68]\n\nBig Financial Backers\n\nRiot’s pivot to Bitcoin mining and continued expansion relies on investments from big financial companies and support from the traditional finance sector. Riot has funded its expansion in part by selling more shares in the company to large institutional investors. Currently, the two largest shareholders of Riot are asset managers Vanguard and BlackRock who control 9.68% (valued at $196 million) and 6.5% (valued at $131.58 million) of outstanding shares respectively. Other large banks and investment companies also control shares of Riot, including State Street with 2.68% of shares, Morgan Stanley with 1% of shares, JPMorgan Chase with 0.66% of shares, and Goldman Sachs with 0.35%. [69] These six big financial companies collectively hold nearly 21% of Riot’s shares which are valued at $421.54 million. Thus, Wall Street serves as a major source of capital for Riot and its polluting Bitcoin mines.\n\nIssuing new shares, or equity, relies on support from investment banks to facilitate the sale and take on the risk of buying the new stock and then selling it to investors. In May 2019, Riot issued additional shares in a deal managed by investment bank HC Wainright which raised $18.9 million that Riot said would be used for working expenses and capital. [70] In 2022, Riot again issued additional shares raising $267 million in a deal managed by B Riley along with BTIG LLC, Cantor Fitzgerald, DA Davidson & Co, Macquarie Capital USA, Northland Securities, and Roth Capital Partners. [71] Riot said this equity offering would be used for general corporate purposes which could include investments in current and future projects and strategic acquisitions. [72]\n\nOn August 9, 2023, Riot announced another share offering that is expected to raise $750 million. B Riley is the manager along with several other co-managers including BTIG LLC, Cantor Fitzgerald, Compass Point Research, Moelis & Co, Northland Securities, Roth Capital Partners, and Stifel Nicolaus & Co. [73] The deal is still in process and is presumably being used to help fund construction of the Corsicana site.\n\nBitcoin miners like all companies also need banking services to manage money flows, make payroll, and make payments. Riot reported having operating accounts with Signature Bank, which catered to the crypto industry, before it failed and was shut down by regulators in March 2023. [74] Riot has subsequently transferred deposits to other banks which have not been reported publicly.\n\nCommunity Resistance\n\nRiot’s large polluting and noisy facilities have sparked the ire of nearby residents and led to community resistance to the company’s expansion. As people become aware of the noise, strain on the energy grid, and large water usage from Bitcoin miners, opposition to Riot’s and other companies’ facilities around Texas has grown. Construction of the new Corsicana facility has met resistance from nearby residents. The Concerned Citizens of Navarro County, led by Jackie Sawicky, mobilized to oppose the project, voicing concerns about noise, water usage, increasing electricity bills, and public subsidies. [75] Concerned Citizens led a protest at the groundbreaking ceremony for the 265-acre site and continues to push for more public input and scrutiny into the opaque permitting and approval processes for the facility. [76] Residents are worried that Riot’s mine would use large amounts of water and drive up electricity prices which is a major concern for people who already pay a lot to cool their homes during the long, hot summers. [77] This is in an area where many people struggle to make ends meet. In 2020, Navarro County has a 15.5% poverty rate and a median household income of $47,574 which is below the national average. [78]\n\nIn summer 2023, Concerned Citizens joined with other advocates in Texas to form the Texas Coalition Against Cryptomining to coordinate communities across the state in addressing the environmental, economic, and social impacts of the rapidly growing Bitcoin mining industry. Texas activists are also connecting with a national network of groups working to stop expansion of Bitcoin mining in their backyards, often with little public input but large drains on public infrastructure. [79]\n\nEndnotes"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMjAvY29pbmJhc2UtY29uZmlkZW50LWEtdXMtYml0Y29pbi1ldGYtd2lsbC1iZS1hcHByb3ZlZC5odG1s0gFdaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMTAvMjAvY29pbmJhc2UtY29uZmlkZW50LWEtdXMtYml0Y29pbi1ldGYtd2lsbC1iZS1hcHByb3ZlZC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Coinbase is 'confident' a U.S. bitcoin ETF will be approved after SEC's court defeat - CNBC",
        "content": "Coinbase is confident that a U.S. bitcoin exchange-traded fund will be approved by the U.S. Securities and Exchange Commission, the company's chief legal officer, Paul Grewal, told CNBC.\n\n\"I'm quite hopeful that these [ETF] applications will be granted, if only because they should be granted under the law,\" Grewal said in an interview with CNBC's Arjun Kharpal.\n\nThe SEC was recently dealt a major court setback when a judge ruled that the regulator had no basis to deny crypto-focused asset manager Grayscale's bid to turn its huge GBTC bitcoin fund into an ETF.\n\nThe SEC last week declined to appeal that ruling by a key deadline, likely paving the way for a bitcoin-related ETF to be approved in the coming months.\n\n\"I think that the firms that have stepped forward with robust proposals for these products and services are among some of the biggest blue chips in financial services,\" Grewal added.\n\n\"So that, I think, suggests that we will see progress there in short order.\"\n\nHe didn't say when that's likely to happen, and added the caveat that any decision would ultimately be up to the SEC.\n\nBut, Grewal said, it's likely now that the SEC will approve a bitcoin ETF soon, highlighting the regulator's failure in court to block Grayscale from converting its GBTC bitcoin fund into an ETF."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOS9tYXRyaXhwb3J0LXNheXMtYml0Y29pbi13aWxsLXJpc2UtdG8tYmV0d2Vlbi00MmstYW5kLTU2ay1pZi1ibGFja3JvY2stZXRmLWlzLWFwcHJvdmVkL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOS9tYXRyaXhwb3J0LXNheXMtYml0Y29pbi13aWxsLXJpc2UtdG8tYmV0d2Vlbi00MmstYW5kLTU2ay1pZi1ibGFja3JvY2stZXRmLWlzLWFwcHJvdmVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Could Rise to Between $42K and $56K if BlackRock ETF Is Approved: Matrixport - CoinDesk",
        "content": "The SEC delayed a slew of ETF applications last month, saying it “finds it appropriate to designate a longer period within which to take action,” giving the regulator “sufficient time to consider."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LnRhbGxhaGFzc2VlLmNvbS9zdG9yeS9zcGVjaWFsL2NvbnRyaWJ1dG9yLWNvbnRlbnQvMjAyMy8xMC8xOS90aGUtZXZvbHV0aW9uLWFuZC1pbXBhY3Qtb2YtYml0Y29pbi83MTI0MDY0ODAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "The Evolution and Impact of Bitcoin - Tallahassee Democrat",
        "content": "Sixteen Ramos\n\nContributor\n\nStory by OKX\n\nThe 2008 financial crisis brought us the impact of Bitcoin. As the concept of cryptocurrency was revealed to the public, it received an exceptional amount of attention. As Bitcoin evolved over time, it had various negative and positive impacts on the market, a market of its own making.\n\nBitcoin helped radically redefine money and trust. On the blockchain, Bitcoin offered an entirely new type of financial asset. It was more secure and direct than any traditional banking option, elevating how we considered the financial sector as a society. A paper published in 2008 heralded it as, “Bitcoin: A Peer-to-Peer Electronic Cash System.” This was a nine-page manifesto outlining the blueprint for a decentralized currency that operated independently of governments or banks. Blockchain technology emerged on the scene, stapling financial autonomy into our collective future.\n\nBitcoin offered investors and ordinary people a way to exert full control over their financial assets without having to trust a traditional bank. Transactions were direct and practically infallible, with no fees or functions from third parties required. The monetary revolution was underway, and everyone wanted to join the action.\n\nThe minds behind Bitcoin went above and beyond to do their part in bringing cryptocurrency to the public. They produced resources for new investors, providing guidance, resolving issues, and contributing to the ever-strengthening system. A project that had started out as a fringe experiment culminated in the creation of cryptocurrency, a new, overarching way to work with financial assets that are bound to be the future structure of the system itself.\n\nThe traction that Bitcoin gained over the past decade and a half is unprecedented. Digital currency took to the market like wildfire, leaving skeptics and critics in the dust. Now, Bitcoin stands as a behemoth of the industry. If you haven’t heard of any other type of cryptocurrency, it’s still likely you’ve already heard of Bitcoin!\n\nTraditional finance is upgrading to include digital currencies in its fabric, taking the entire financial sector to the next level. As more people are drawn to the blockchain and decentralized finance, Bitcoin and other cryptocurrencies continue to change.\n\nOver the past few years, Bitcoin has seen some disappointing market moves that surprised investors. It wasn’t the only cryptocurrency affected by the pandemic and consequential financial struggles, such as pepe coin and Pepe price. Although parties experienced losses during this time, Bitcoin’s popularity was largely unaffected. It’s still one of the most popular and beloved cryptocurrencies on the market, a fact due to more than nostalgia. The efficacy of Bitcoin continues to remain strong.\n\nAfter things evened out, Bitcoin stabilized accordingly. It’s still one of the reigning cryptocurrencies into which investors entrust their financial assets. Those looking to become part of the cryptocurrency community or get in on the future of finance are drawn to Bitcoin, as well as seasoned investors. Although Bitcoin isn’t as boomingly successful in the market as it once was, it’s still taking the financial sector by storm, throwing us into the next evolution of finance.\n\nInvesting in digital assets carries a high level of risk and may not be suitable for all investors. Potential investors should ensure that they have an understanding of the risks involved, seeking professional advice where appropriate."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTAvMTkvZ3JheXNjYWxlLW5ldy1hcHBsaWNhdGlvbi1zZWMtc3BvdC1iaXRjb2luLWV0Zi_SAVlodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzEwLzE5L2dyYXlzY2FsZS1uZXctYXBwbGljYXRpb24tc2VjLXNwb3QtYml0Y29pbi1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Grayscale filed a new application with the SEC for a spot Bitcoin ETF. But a lawsuit against its parent company could complicate matters - Fortune",
        "content": "Grayscale filed a new application with the Securities and Exchange Commission for its Grayscale Bitcoin Trust as it looks to secure one of the first spot Bitcoin ETFs in the U.S.\n\nThe application, filed Thursday, is laying the groundwork for the company’s Grayscale Bitcoin Trust (GBTC) digital currency investment product to operate as a spot Bitcoin ETF listed on the New York Stock Exchange, pending SEC approval of its S-3 form.\n\n“Importantly, GBTC is ready to operate as an ETF upon receipt of these regulatory approvals, and on behalf of GBTC’s investors, Grayscale looks forward to working collaboratively and expeditiously with the SEC on these matters,” the company said in a statement.\n\nThe new filing comes after Grayscale’s recent court victory over the SEC in which the company was told the agency had no basis for denying Grayscale’s request to convert its GBTC product into a spot Bitcoin ETF. Last week, the SEC declined to appeal that ruling, improving the odds that a spot Bitcoin ETF is approved in the coming months.\n\nBut whether Grayscale is among the first to receive approval for a new ETF remains uncertain. On Thursday, New York State Attorney General Letitia James sued Grayscale parent company Digital Currency Group, along with crypto exchange Gemini and DCG subsidiary Genesis, a crypto lending firm. The lawsuit claims DCG was partly responsible for defrauding investors of more than $1 billion.\n\nThe lawsuit is also seeking to bar DCG from engaging in securities and commodities-related business in New York, which could complicate Grayscale’s effort to list a product on the NYSE.\n\nStill, as of Thursday, GBTC’s discount compared with its net asset value was closing, signifying that investors were increasingly confident in the product. The exchange-traded product was trading down less than 1%, around $22.18, as of Thursday morning."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjAvc3BvdC1iaXRjb2luLWV0Zi1leGNpdGVtZW50LWhpdHMtbWFpbi1zdHJlZXQtZ29vZ2xlLXNlYXJjaC1pbmRpY2F0ZXMv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8yMC9zcG90LWJpdGNvaW4tZXRmLWV4Y2l0ZW1lbnQtaGl0cy1tYWluLXN0cmVldC1nb29nbGUtc2VhcmNoLWluZGljYXRlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Excitement Hits Main Street, Google Search Indicates - CoinDesk",
        "content": "A spot ETF will track the price of bitcoin rather than the prices of bitcoin futures and involves the purchase and ownership of the cryptocurrency by the provider. It's suited for anyone looking to take direct exposure to bitcoin without having to own the cryptocurrency themselves."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTIwL2JpdGNvaW4tY2xpbWJzLWJhY2stYWJvdmUtMzAtMDAwLWJlZm9yZS1sYXRlc3QtZ3JheXNjYWxlLXJ1bGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Climbs Back Above $30000 Before Latest Grayscale Ruling - Bloomberg",
        "content": "Bitcoin briefly topped $30,000 for the second time this week on growing expectations that another favorable court action raises the likelihood than an exchange-traded fund holding the cryptocurrency will finally be approved.\n\nA US court in Washington is expected to issue a mandate as soon as Friday that could make effective an August opinion that went in favor of Grayscale Investments LLC, which had sued the Securities and Exchange Commission as it looked to convert its Bitcoin trust into an ETF. It’s the next step in the process after the SEC last week opted against appealing the previous ruling, which it had lost. The mandate may be given on Monday, Bloomberg Intelligence analyst James Seyffart said."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE4L3Nwb3QtYml0Y29pbi1ldGYtYXBwcm92YWxzLWNvdWxkLWFkZC0xLXRyaWxsaW9uLXRvLWNyeXB0by1tYXJrZXQtY2FwLWNyeXB0b3F1YW50LXNheXMv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbHMtY291bGQtYWRkLTEtdHJpbGxpb24tdG8tY3J5cHRvLW1hcmtldC1jYXAtY3J5cHRvcXVhbnQtc2F5cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Approvals Could Add $1 Trillion to Crypto Market Cap, CryptoQuant Says - CoinDesk",
        "content": "\"Nobody will dare to short BTC now for the foreseeable future. Even if this Cointelegraph news was false, BTC can still grind higher in anticipation of the approval,\" Markus Thielen, head of research and strategy at Matrixport, said in a Telegram broadcast."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzEwLzIwL2NyeXB0b2N1cnJlbmNpZXMtaGVhZC1mb3ItYS13aW5uaW5nLXdlZWstYml0Y29pbi1uZWFycy0zMDAwMC1vbi1ldGYtb3B0aW1pc20tYW5kLWZsaWdodC10by1zYWZldHkuaHRtbNIBigFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMC8yMC9jcnlwdG9jdXJyZW5jaWVzLWhlYWQtZm9yLWEtd2lubmluZy13ZWVrLWJpdGNvaW4tbmVhcnMtMzAwMDAtb24tZXRmLW9wdGltaXNtLWFuZC1mbGlnaHQtdG8tc2FmZXR5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrencies cap a winning week, bitcoin tops $30,000 on ETF optimism and flight to safety - CNBC",
        "content": "Bitcoin extended its weekly gains on Friday, briefly topping $30,000 for the second time this week, as confidence a spot bitcoin ETF will soon be greenlit grew and crypto investors continued weighing uncertainty in the U.S. and abroad.\n\nThe price of the flagship cryptocurrency was last higher by 2.76% on Friday at $29,538.99, according to Coin Metrics. It ended the week with a 10.4% gain, making it its best week since June 23 when it added 17%. At one point, it climbed as high as $30,193.87. Ether added 2.46% to trade at $1,606.42 on the day and was up 4% for the week — best week since Sept. 29, when it gained 4.4%. On Friday, Ether rose to a high of $1,630.03.\n\nThe gains come even as the benchmark 10-year U.S. Treasury yield briefly topped 5% for the first time in 16 years. Higher yields historically have had a negative effect on bitcoin, but the crypto asset is benefiting from a key catalyst investors have been watching all year: the approval of what would be the first spot bitcoin ETF in the U.S. Earlier this week, JPMorgan said the Securities and Exchange Commission is likely to approve an ETF in the next few months. Mike Novogratz, whose Galaxy Digital has an ETF application with the SEC in partnership with Invesco , told CNBC he thinks it could happen as soon as the end of the year."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN1cmdlcy1hYm92ZS0zMDAwMC1hZnRlci1hLXdpbGQtd2Vlay1mb3ItY3J5cHRvLWludmVzdG9ycy0xNTA4NDM4MDMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin surges above $30,000 after a wild week for crypto investors - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) briefly surged above $30,000 Friday after the Securities and Exchange Commission dropped legal charges against two cryptocurrency executives from Ripple Labs, another victory for the industry as it fights regulatory threats on several fronts.\n\nThe rise in bitcoin, which jumped 5% over the last day, pushed it above the $30,000 marker for the first time since August. Other digital assets also pushed higher, including the XRP (XRP-USD) token issued by Ripple. Year to date, bitcoin has rallied more than 80%.\n\nThe rally punctuated the end of a volatile week for crypto investors, who found reasons to cheer a series of legal developments, market chatter, and rumors involving the SEC, which is attempting a widespread crackdown on the crypto industry. The regulator has sued a number of big players, including Coinbase (COIN) and Binance.\n\nThe seal of the Securities and Exchange Commission at SEC headquarters in Washington. (Andrew Harnik/AP Photo, File) (ASSOCIATED PRESS)\n\nThe first development came last Friday when media reports suggested the SEC wouldn’t appeal a court ruling that improves the chances that asset manager Grayscale Investments will be able to launch a spot bitcoin exchange-trade fund.\n\nAsset managers have for years been trying to convince the SEC to approve a spot bitcoin ETF, which would allow investors to get exposure to the world’s largest cryptocurrency without having to own it. The SEC had denied the various applications, arguing the products were vulnerable to market manipulation.\n\n\"Once the SEC announced that they would not be pursuing an appeal, we saw a very compelling bid,\" Sean Farrell, a digital asset analyst with Fundstrat, told Yahoo Finance.\n\nThen on Monday a rumor circulated that giant money manager BlackRock (BLK) had received new SEC approval for a spot bitcoin ETF, and that pushed bitcoin near $30,000. Prices pulled back when BlackRock denied it.\n\nThe SEC is still considering applications from BlackRock, Grayscale, and a number of other asset managers; investors expect the agency to rule on the applications by Jan. 10.\n\nStory continues\n\nBlackRock headquarters in Manhattan. (STRF/STAR MAX/IPx) (STRF/STAR MAX/IPx)\n\n\"The time is right for a spot bitcoin ETF,” Bitwise chief investment officer Matt Hougan said on Yahoo Finance Live earlier this week. Bitwise is among the companies seeking SEC approval.\n\n\"The SEC has previously been worried about market manipulation, about a lack of maturity in the market, but the bitcoin market of today is not the bitcoin market of a few years ago.\"\n\nThe new rally in digital assets over the last 24 hours was triggered by an SEC decision on Thursday to dismiss its charges against Ripple co-founders Brad Garlinghouse and Chris Larsen, who were sued for helping Ripple sell XRP.\n\nSEC had argued that the sale of the token amounted to a violation of US law because XRP was not registered as a security with the SEC.\n\nThe US judge overseeing the case, Analisa Torres, resolved some claims against the executives and Ripple in mid-July when she ruled that XRP was not a security when it was purchased by the general public.\n\nBut she also partly ruled in the SEC’s favor by stating that XRP was in fact a security when sold to institutional investors. She later rejected an attempt by the SEC to appeal her split ruling.\n\nThe SEC’s claims against Garlinghouse and Larsen over the sale of XRP to those investors were still scheduled to be tried before a jury, but the SEC said Thursday it no longer wanted to pursue those charges.\n\nThe SEC asked the court to give the agency three weeks to confer with Ripple in the hope of establishing a financial settlement tied to its sale of XRP to institutional investors. The SEC declined comment.\n\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking and crypto.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy4xM3dtYXouY29tL2FydGljbGUvbW9uZXkvYnVzaW5lc3Mvc2FuZGVyc3ZpbGxlLWJpdGNvaW4tbWluZS1leHBhbmRpbmctYnJpbmdpbmctYmlnLWRvbGxhcnMvOTMtZWMxOGJmMTQtZTgwNy00ZGEwLWFiMTItN2Y1MjQ5ZGNjODlm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Sandersville leaders highlight economic boon of bitcoin expansion - 13WMAZ.com",
        "content": "CleanSpark started construction only a couple months ago. Now, the massive lot is becoming a sprawling bitcoin mine.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nSANDERSVILLE, Ga. — The newest mine in Sandersville has nothing to do with mining at all.\n\nIt's a bitcoin mine, and Sandersville leaders say it's making a major impact on the city's economy.\n\nLast year, 13WMAZ got a look inside the high-tech facility. Now, it's expanding, and our cameras once again got a tour.\n\nThe massive facility expansion has its own power substation just to help manage the 250-megawatt power output. That's 10 times what it takes to power the whole city. The city itself only uses 25 megawatts of power.\n\n\"There were some trees and a dirt field, and it's come a long way, and it's moving really quick,\" Site Manager Bo Ginn said.\n\nFast forward about two months and a sprawling tract of land is turning into a sprawling bitcoin mining facility.\n\n\"We're halfway, you know, up the hill here with six buildings coming up,\" Ginn said.\n\nEach building is as long as the Titanic.\n\nAll of them will eventually house hundreds of computers that crunch numbers all day to create bitcoin.\n\n\"Think of cash for a digital age. That's what bitcoin does,\" Chief Communications Officer at Cleanspark Isaac Holyoak said. \"Unlike some of these other digital currencies that have a CEO, there's no CEO of bitcoin.\"\n\nHolyoak says that's why the company's posted record profits. He says more people are buying in, and they need to meet the demand. So, they're expanding their Sandersville facility to become the company's flagship bitcoin mine.\n\n\"There is more energy in Georgia than there is use for that energy,\" Holyoak said.\n\nSandersville City Administrator Judy McCorkle says that creates an advantage for them. Since the city manages its own electric company, it reduces bills for everyone else.\n\nThat money flowing into the city's coffers can also help homeowners on their property tax bill.\n\n\"At some point, I could see that property tax bill being rolled back to almost nothing, almost 0%. That's huge for us,\" McCorkle said.\n\nGinn says those effects will be even stronger once they expand.\n\n\"We're sending over six figures back to the city each month, and that's going to be very significant post-expansion,\" Ginn said.\n\nHe estimates they'll pay $500,000 a month in taxes alone. That's about $6 million a year, all going to the city.\n\n\"That money is money that the city wouldn't be getting. It's going to schools, to roads, to other community infrastructure that may have been neglected for a while,\" Ginn said.\n\nMcCorkle says it's likely the city's property tax rate will eventually be as low as one mill. She says they're also considering building a hotel with the funds."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjAvYml0Y29pbi1pbmNoZXMtY2xvc2VyLXRvLTMway1hcy1ldGYtaG9wZS1kcml2ZXMtYnVsbHMv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8yMC9iaXRjb2luLWluY2hlcy1jbG9zZXItdG8tMzBrLWFzLWV0Zi1ob3BlLWRyaXZlcy1idWxscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Jumps Over $30K as ETF Hope Drives Bulls - CoinDesk",
        "content": "“Bitcoin has also been encouraged by possible ETF approval and an increasing number of ETF submissions by leading companies,” shared Lucy Hu, senior trader at Metalpha, in a message early Friday. “The SEC opted for a no-appeal on Grayscale’s ruling, and as the deadline for BTC spot ETF applications from institutions such as Blackrock looms closer, the market’s confidence in ETF approval has increased.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktMjAyNC1iaXRjb2luLWhhbHZpbmctcGxheS1vdXQtZGlmZmVyZW50bHktdGhhbi1wcmV2aW91c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Why the 2024 Bitcoin halving may play out differently than in the past - Cointelegraph",
        "content": "The impact of the Bitcoin halving on crypto prices is often overestimated, and the next halving, set for April 2024, may play out differently than previous ones — according to a leading analyst.\n\nThe halving event, which every four years cuts in half the rate by which new Bitcoin (BTC) is created, is generally considered one of the main catalysts driving Bitcoin’s biggest upside moves.\n\nDespite the bullish narrative surrounding the halving, however, the event by itself does not necessarily guarantee Bitcoin’s price appreciation.\n\nIf the reduced supply of new BTC is not accompanied by significant demand, prices are unlikely to surge.\n\nAlso, the halving is an entirely predictable event, meaning all market participants know in advance when it will occur. Therefore, its current price may already reflect the halving’s impact before it happens.\n\n“Things that we most anticipate generally don’t happen,” said Bloomberg analyst Mike McGlone, commenting on the much-anticipated event.\n\n“And that's what I’m concerned about. It’s complete consensus,” he continued.\n\nAlso, each time the halving occurs, its impact on the new Bitcoin supply decreases; and over time, its impact will eventually become irrelevant, he argued. Changes in demand, rather than supply, are therefore becoming the dominant factor influencing the price of Bitcoin.\n\nSo, how will the next Bitcoin halving impact the crypto market? And, if not the halving, what are the catalysts behind Bitcoin’s cyclical upside moves? To find out, check out the latest Cointelegraph Report on YouTube, and don’t forget to subscribe!"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzIwL2Nhbi1iaXRjb2luLXJlYWxseS1kb3VibGUtaW4tcHJpY2UtdG8tNjAwMDAtYnktdGhlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Can Bitcoin Really Double in Price to $60,000 by the End of 2023? - The Motley Fool",
        "content": "Ever since BlackRock (BLK -2.29%) announced its plans to apply for permission to create a spot Bitcoin (BTC -2.14%) exchange-traded fund (ETF) back in June, the crypto market has been buzzing about what this new fund's launch might mean for the price of Bitcoin. That buzz only intensified when six other financial institutions also announced plans to launch their own spot Bitcoin ETFs. The conventional wisdom is that the token could surge past the $30,000 level and begin another rally as new investor money floods into the crypto market.\n\nIn fact, a new report from blockchain analytics firm CryptoQuant says that Bitcoin could soar above $50,000 and start to challenge its all-time high of $68,790. It even speculates about a price jump to as high as $73,000. That would imply an increase of close to $1 trillion in the market cap of Bitcoin. Given the huge numbers involved here, it's only natural to ask: Just how realistic is this scenario?\n\nKey assumptions\n\nA number of key assumptions underpin this pricing model. The most important of them is that the financial institutions creating these new spot Bitcoin ETF products will recommend to their clients that they allocate at least 1% of their portfolios to Bitcoin. This percentage will give you a good idea of how much new money could flood into the crypto market after the ETF approvals.\n\nCombined, the firms with pending ETF applications have $15.6 trillion in assets under management. Take 1% of that number and you arrive at a figure of $156 billion. This gives you a rough idea of how much money theoretically could immediately start to flow into Bitcoin.\n\nBut we're not done yet. You also have to assume that there will be a sort of multiplier effect. In essence, new money pursuing a limited supply of tokens will lead to higher prices, which will attract even more new money from investors, which will lead to even higher prices, which will attract even more new money.\n\nIf you take a look at past Bitcoin bull market cycles and analyze how its market capitalization has increased during those periods, it's possible to calculate that the multiplier effect applies at a ratio of between 3 and 6. By taking the base figure of $155 billion, and then using this multiplier to determine upper and lower bounds, the total market cap of Bitcoin could increase by anywhere from $465 billion to $930 billion.\n\nStress testing the numbers\n\nTo see if these numbers make sense, it's important to provide some perspective about the total size of the crypto market. Right now, the total market capitalization of Bitcoin is roughly $560 billion and the total market cap of the entire crypto market is just over $1 trillion, so it accounts for more than half of the total value of the crypto market. This value, known as the Bitcoin dominance factor, has oscillated between 0.40 and 0.55 over the past three years, and now stands at 0.52.\n\nThat's why I think the multiplier effect might be much lower than some people think. After all, by saying that Bitcoin will double in value, you are making another implicit assumption: that investors will be pouring money into other crypto assets as well, keeping the ratio between Bitcoin and other tokens at roughly the same level. Otherwise, the Bitcoin dominance factor will go completely off the charts.\n\nEven if you are a Bitcoin super-bull who thinks that it really should account for 95% of the entire crypto market (as it did back in 2017, before there were so many other tokens), there is another way to think about the numbers. If the market cap of Bitcoin really does increase by $1 trillion, that would make it a $1.55 trillion asset. Right now, there are only a handful of companies in the world worth more than $1 trillion. Thus, you would be saying that Bitcoin should be worth more than Amazon ($1.35 trillion), NVIDIA ($1.06 trillion), Meta ($820 billion), or Tesla ($725 billion). Just about the only companies that would be more valuable than Bitcoin would be Apple ($2.7 trillion) and Microsoft ($2.5 trillion).\n\nWhere will Bitcoin be in 2024?\n\nWhile I'm certainly bullish on the prospects of a new spot Bitcoin ETF, it's important to push back on some of the assumptions that underpin any Bitcoin pricing model. From my perspective, some of the assumptions used by those who conclude that these ETFs could lead to a doubling in the price of Bitcoin appear to be overly optimistic.\n\nMoreover, it's important to keep in mind that Bitcoin-linked investment products already exist. For example, the Grayscale Bitcoin Trust (GBTC -3.29%) currently has $17.6 billion in assets, and the ProShares Bitcoin Strategy ETF (BITO -3.03%) has $1 billion in assets. So it's not like there aren't already ways to invest in Bitcoin beyond directly buying the tokens.\n\nThat said, I'm long-term bullish on Bitcoin. The flow of new institutional money should help to push up its price. And it should also help to make the crypto go even more mainstream. Anytime you have big Wall Street firms supporting Bitcoin, it helps to make it more attractive to all investors, which has the potential to send prices higher."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbnMtcmlzZS13aHktY2FsbGluZy1mbGlnaHQtMTgxNTE3OTkyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's rise: Why some are calling it a 'flight to quality' - Yahoo Finance",
        "content": "Between the bond market volatility, concerns about the Federal Reserve's rate path, and worries about a recession, some are turning to bitcoin (BTC-USD). Sean Farrell, VP of Digital Asset Strategy at Fundstrat Global Advisors, tells Yahoo Finance Live that amid all those concerns, there are now \"very well-reputed financial professionals who don't normally wade into crypto waters saying that this digital bearer asset is a good alternative\" to things like a 30-year Treasury. It comes after BlackRock CEO Larry Fink said the recent rally in the digital currency reflects a \"flight to quality.\"\n\nClick here to watch the full interview on the Yahoo Finance YouTube page or you can watch this full episode of Yahoo Finance Live here.\n\nVideo Transcript\n\nBRAD SMITH: We had actually discussed with Michael Sonnenshein, the Grayscale CEO, about what that crypto environment could look like after it looked like there was a clear pathway forward. And he said that they're expecting, or anticipating, an environment that we have not seen before, after that legal win took place. What could that look like from your purview, and what type of inflows do you think it could trigger for Bitcoin and other crypto-related assets?\n\nSEAN FARRELL: Yeah, look, I think-- that's a great question, and a great point by Michael. So assets trade based on who is trading them, right? And so historically, we've seen Bitcoin pretty closely correlated to tech stocks at times. At times, also very correlated, like this year, with gold. And a lot of that has to do with who is trading that asset.\n\nWhen there was-- we had the post-COVID monetary stimulus. All of the employees working from home and trading meme stocks. There was a lot of borrow, a lot of credit, in the crypto ecosystem. And so, what we saw is this incredible fervor rally that was largely correlated with unprofitable tech.\n\nBut now, I think people are seeing the volatility in the sell off in the bond market. They're seeing global calamity, a reducing of trust in and between different central banks. And that's reflected in sovereign debt prices.\n\nAnd you have very well-reputed financial professionals who don't normally wade into crypto waters, saying that this digital bearer asset is a good alternative for those who don't want to assume a 30-year bond in even a developed country. So I think you're going to see a new cohort of investors really seek Bitcoin in times of both increase in global liquidity to hedge against both asset and price inflation. And we'll also see it, as Larry puts it, a flight to quality."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzIwL2NvaW5iYXNlcy1ncmV3YWwtaXMtcXVpdGUtaG9wZWZ1bC10aGF0LWJpdGNvaW4tc3BvdC1ldGZzLXdpbGwtYmUtYXBwcm92ZWQv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTAvMjAvY29pbmJhc2VzLWdyZXdhbC1pcy1xdWl0ZS1ob3BlZnVsLXRoYXQtYml0Y29pbi1zcG90LWV0ZnMtd2lsbC1iZS1hcHByb3ZlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Coinbase's Grewal Is 'Quite Hopeful' That Bitcoin Spot ETFs Will be Approved - CoinDesk",
        "content": "\"I think that the firms that have stepped forward with robust proposals for these products and services are among some of the biggest blue chips in financial services,” Grewal told CNBC. “So that, I think, suggests that we will see progress there in short order,” he added."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8yMC9zZWMtbGlrZWx5LXRvLWFwcHJvdmUtc3BvdC1iaXRjb2luLWV0Zi1pbi1uZXh0LWZldy1tb250aHMtanBtb3JnYW4v0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzEwLzIwL3NlYy1saWtlbHktdG8tYXBwcm92ZS1zcG90LWJpdGNvaW4tZXRmLWluLW5leHQtZmV3LW1vbnRocy1qcG1vcmdhbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "SEC Likely to Approve Spot Bitcoin ETF in Next Few Months: JPMorgan - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL3doYXQtaGFwcGVucy10by1iaXRjb2luLWFmdGVyLWFsbC0yMS1taWxsaW9uLWFyZS1taW5lZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "What Happens to Bitcoin After All 21 Million Are Mined? - CCN.com",
        "content": "Key Takeaways\n\nBy 2140, 21 million Bitcoins will be mined, enhancing the network’s scarcity and value.\n\nMiners’ Bitcoin rewards decrease after every 210,000 blocks mined in an event called the Bitcoin halving and by 2140, miners will rely solely on transaction fees.\n\nMiners’ motivation to secure the network is done to seek profit, support decentralization, and view mining as a long-term investment.\n\nTransaction fees, which currently account for about 5% of miner’s revenue, may balance out the declining block rewards in the future, especially with off-chain solutions like the Lightning Network emerging.\n\nBitcoin mining was increasingly attractive due to the lucrative incentives for miners to maximize their Bitcoin yield. Starting at 50 Bitcoins every block back when it first launched, miners now earn 6.25 BTC for validating a block, a reward which has been halved thrice since Bitcoin’s inception. There are currently over 19.5 million Bitcoins currently in circulation, leaving 1.5 million yet to be mined before hitting the 21 million cap by the year 2140.\n\nBitcoins finite supply is a defining part of Satoshi Nakamoto’s decentralized protocol. In an effort to engineer the cryptocurrency with a predetermined limit, Bitcoin boasts scarcity which increases Bitcoins demand and value over time.\n\nWhy Do Miners Participate In Bitcoin Mining?\n\nMiners decide to engage in the mining process for a variety of reasons, both financial and ideological. Here are the primary motivations:\n\nFinancial Incentive\n\nThe most obvious reason is the potential for profit. Miners receive block rewards every ten minutes at random and transaction fees from the blocks they successfully mine. Especially in the early days of cryptocurrencies like Bitcoin, many miners were attracted by the prospect of earning substantial rewards.\n\nSupporting Decentralization\n\nCryptocurrencies offer a decentralized alternative to traditional centralized financial systems. By participating in mining, individuals contribute to this decentralization, ensuring that the network remains resistant to censorship and external control.\n\nLong-term Investment Strategy\n\nBy mining and accumulating cryptocurrency, some miners view their activities as a long-term investment strategy, hoping that the coins they mine now will appreciate in value in the future. The below chart illustrates the hashrate that is currently securing the network.\n\nA high hashrate on the Bitcoin network signifies its strength and robustness, instilling trust among investors about the network’s security.\n\nWhile there might be occasional dips in the hashrate due to various reasons, they often represent temporary shifts. For instance, when China implemented a ban on Bitcoin mining, in 2021, miners adapted by relocating their operations, showcasing the resilience and adaptability of the Bitcoin community. Such moments emphasize the dynamic nature of the network and its ability to overcome challenges.\n\nUnderstanding Bitcoin’s Supply Incentive And Miner Revenue\n\nDuring bull markets as illustrated in the LookIntoBitcoin chart below, the rise in fees becomes a greater source of income for miners. This surge in fees corresponds with heightened Bitcoin demand, as newcomers engage in and conduct transactions on the network. Conversely, in bearish phases, fees as a portion of the total miner earnings tend to decline.\n\nOver time as off-chain solutions like the Lightning Network begin to offer swift, cost-effective Bitcoin transfers, the layer one blockchain will not be used as often.\n\nSome argue that the escalating transaction fees, which presently account for 5% of miners’ revenue (illustrated above), will balance out the declining block rewards in the future.\n\nCan Bitcoin’s Hardcap Of 21 Million Be Changed?\n\nBitcoin’s hard cap of 21 million isn’t explicitly stated in a single code line. The protocol behind the monetary policy of Bitcoin emerges from its initial block reward combined with the halving schedule. Initially, miners received 50 BTC for each block mined, and this reward halves every 210,000 blocks. By following this halving pattern, by the year 2140, over 99.99% of Bitcoins will be mined, and the reward will diminish to a point where it becomes negligible.\n\nWhen an individual sums up the rewards from each of these halving periods, the total converges to the 21 million BTC cap. The built-in halving mechanism in Bitcoin’s code ensures that the minting of new Bitcoins will stop once this cap is reached. By 2140, miners will no longer earn block rewards, relying solely on transaction fees as compensation. This design guarantees that there will never exceed 21 million Bitcoins in circulation.\n\nWhat Happens When Bitcoin Mining Rewards Will Be Vanished?\n\nWhile the reward quantity has decreased over time, the soaring value of Bitcoin compensates for these reductions. Additionally, as Bitcoin becomes mainstream its transaction fees have also surged.\n\nBitcoin, often hailed as ‘Digital Gold’, possesses an intrinsic quality of scarcity with its fixed supply cap of 21 million coins. This design evokes an economic elegance, as it emulates the limited availability of precious resources in the universe. However, what unfolds when the last Bitcoin has been mined and miners can no longer receive block rewards? Why will miners continue to secure the network?\n\nHere are some key reasons miners will continue to mine:\n\nTransaction Fees\n\nAs miners pivot away from block rewards, the stakeholder who are deemed the lifeblood of the Bitcoin network, i.e. the miners will be incentivized primarily via transaction fees. This will ensure the network remains robust and continually processes transactions. It is expected that the transaction fee will be high enough in sats converted to the US dollar that the fee will be fair and justified.\n\nEconomic Renaissance\n\nBitcoin’s finite nature might further solidify its role as a store of value. With no more inflow of new coins, scarcity could induce an appreciation in value, making it even more sought-after as a hedge against traditional fiat systems.\n\nMining Resilience\n\nAlthough mining rewards will cease, the expectation is that transaction volumes would have grown exponentially by then, making fee-based mining still profitable and sustainable.\n\nInnovation and Evolution\n\nThe crypto landscape is dynamic. It is likely that new layers or solutions are emerging to make the post-reward era more efficient and economical for all participants.\n\nThe Debate On Altering Bitcoin’s Supply Cap\n\nTechnically, Bitcoin’s supply cap can be modified by changing its foundational code. While Bitcoin operates on software, any modifications necessitate consensus from developers, stakeholders, and the broader community. Achieving such a consensus would mean all nodes on the Bitcoin network adopting the proposed amendments.\n\nEnsuring unanimous acceptance is challenging due to Bitcoin’s inherent design to remain unchanged. Implementing these changes could lead to a hard fork. Which is a protocol change that redefines previously unauthorized actions as permissible. Ideally, all nodes would integrate the changes.\n\nConclusion\n\nIn contrast, a contentious scenario might emerge where only a subset supports the current 21 million BTC threshold. Miners and nodes resisting the modifications would persist with the existing Bitcoin protocol.\n\nThis divergence could instigate a competitive rift, resulting in a contentious hard fork and potentially spawning another Bitcoin variant, reminiscent of Bitcoin Cash’s emergence. However, to date it is still unknown what will happen so far out in time.\n\nWhilst the future for Bitcoin is bright, it becomes difficult to forecast exactly what will happen to Bitcoin after all 21 million coins are in circulation.\n\nIt is anticipated that by then miners would be well established and fully prepared for the next century. Even if a vision for Bitcoin seems clear today, the actual outcome may prove different.\n\n“Being too far ahead of your time is indistinguishable from being wrong.” – Howard Marks\n\nFAQs\n\nWhat happens to Bitcoin after all 21 million are mined?\n\nAfter all 21 million Bitcoins are mined by 2140, miners will no longer receive block rewards and will rely on transaction fees for compensation.\n\nWhy do miners participate in Bitcoin mining?\n\nMiners are motivated by profit from block rewards and transaction fees, supporting decentralization, and viewing mining as a long-term investment strategy.\n\nWhat’s the incentive for miners when no more rewards are given?\n\nMiners will be incentivized through transaction fees, ensuring the Bitcoin network remains robust. The scarcity and potential value increase of Bitcoin might also motivate continued mining activity.\n\nWill the number of Bitcoins ever surpass 21 million?\n\nNo, the built-in protocol ensures the total Bitcoin supply will never exceed 21 million. Miners’ rewards decrease over time and will eventually cease by 2140."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzIwL3doeS1iaXRjb2luLWFuZC1vdGhlci1tYWpvci1jcnlwdG9jdXJyZW5jaWVzLXJhbGxpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Why Bitcoin and Other Major Cryptocurrencies Rallied This Week - The Motley Fool",
        "content": "Major cryptocurrencies have soared over the past week, led by a 9% rise in the price of Bitcoin (BTC -2.14%). As of Friday's close, Bitcoin SV (BSV) -- a bitcoin fork token -- was up 61.6%, Stacks (SOL 6.20%) was up 27.7%, and Solana (STX -3.82%) had rallied 24.3% on the week, according to data provided by S&P Global Market Intelligence.\n\nThe moves were spurred by increased optimism in recent days over impending improvals by the U.S. Securities and Exchange Commission (SEC) of new spot bitcoin exchange-traded funds (ETFs).\n\nOptimism building for the first spot bitcoin ETF approvals\n\nThe crypto rally this week was teed up by encouraging crypto headlines starting last Friday (Oct. 13, 2023). According to sources speaking to crypto news site CoinDesk, the SEC decided it would not appeal a federal court's August reversal of its decision preventing crypto-asset manager Grayscale from converting its widely popular Grayscale Bitcoin Trust (GBTC -3.29%) into an ETF. Assuming those sources are accurate, the court could finalize its decision as early as next week.\n\nBut this news is specific to bitcoin, so why is it good for cryptocurrencies in general? Because ETFs are a much more investor-friendly medium with shares that can be purchased throughout each trading day via any brokerage firm similar to individual publicly traded equity securities. Any approvals of a spot ETF that tracks the price of bitcoin would broaden investors' access to, and in turn, their acceptance of all crypto asset classes. As a result, it would almost certainly lead to hundreds of billions of dollars in additional liquidity flowing into cryptocurrencies' market capitalizations in short order. Looking further down the road, according to a report from data analytics firm CryptoQuant earlier this week, the value of the overall crypto market could grow by a total of more than $1 trillion after bitcoin ETFs are finally approved.\n\nWhat's next for Bitcoin ETFs?\n\nSure enough, multiple ETF providers filed amended registration statements for potential bitcoin ETFs this week, including Grayscale, Blackrock, and Fidelity, apparently in response to the SEC's decision not to appeal the federal court's aforementioned ruling.\n\nFurthermore, according to a research report released on Wednesday (Oct. 18, 2023) by JPMorgan, the timing of any approvals remains unclear but should happen within the next several weeks. At the very latest, the report adds, the first SEC approvals should arrive before Jan. 10, 2024 -- the final deadline by which the SEC is required to respond to ARK Invest's open application for its \"21Shares\" bitcoin ETF.\n\nFinally, the firm also speculated that rather than approve individual ETFs over the course of several months -- and noting its deadline to respond to BlackRock's application is March 15 of next year -- the SEC will likely approve multiple applications at once in order to prevent any single bitcoin ETF from gaining a so-called \"first-mover\" advantage.\n\nThat's fair enough and will also mean millions of retail investors will suddenly have access to several seamless avenues to diversify their portfolios into the budding cryptocurrency asset class. To be clear, that doesn't mean the rise in all cryptocurrencies will continue indefinitely over the long term. But because liquidity tends to be one of the primary drivers of the direction of any given market, this week's gains could be extended over the near term as optimism reaches a fever pitch surrounding the SEC's first spot bitcoin approvals in the coming months."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE5L2JpdGNvaW4tZXRmLXJ1bW9yLWhhZC1hLXNpbHZlci1saW5pbmctYW5kLWl0cy1hcHBhcmVudC1pbi10aGUtY3J5cHRvLW9wdGlvbnMtbWFya2V0L9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE5L2JpdGNvaW4tZXRmLXJ1bW9yLWhhZC1hLXNpbHZlci1saW5pbmctYW5kLWl0cy1hcHBhcmVudC1pbi10aGUtY3J5cHRvLW9wdGlvbnMtbWFya2V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin ETF Rumor Had a Silver Lining and It's Apparent in the Crypto Options Market - CoinDesk",
        "content": "\"The short-lived pump we saw on the back of fake news on ETF approval provided a preview of what is to come in the event of BTC spot ETF approvals,\" said Dick Lo, the founder and CEO of quant-driven crypto trading firm TDX Strategies. \"The fact that BTC is holding well above $28k is encouraging and potentially shows that the market are under-invested and may be inclined to start building positions.\""
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy80LXN0b2Nrcy13YXRjaC1iaXRjb2luLW1ha2VzLTE1NTUwMDU2My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "4 Stocks to Watch as Bitcoin Makes a Solid Rebound - Yahoo Finance",
        "content": "Bitcoin (BTC) is rebounding again after losing sheen somewhat over the past couple of months. The rally started on Oct 16 after the Securities and Exchange Commission (SEC) decided not to appeal its loss against Grayscale Investments in the D.C. Circuit court.\n\nThis rekindled optimism that the approval of a bitcoin ETF may be on the horizon. This sent Bitcoin and other major cryptocurrencies like Ethereum (ETH), Cardano (ADA), Dogecoin (DOGE) and BNB (BNB) on a rally.\n\nBitcoin Rebounding Again\n\nThis week has particularly been good for Bitcoin. Following the SEC decision, Bitcoin’s price surpassed the $28,000 mark and was trading above $28,500 on Oct 19. Apart from the SEC’s decision in favor of Bitcoin, Members of Congress are working on new legislation to introduce stricter anti-money laundering regulations for cryptocurrencies.\n\nThis move comes in response to a Wall Street Journal report last week, following the surprise attack on Israel earlier this month. The report stated that Hamas and the Palestinian Islamic Jihad had received up to $134 million in cryptocurrencies since 2021.\n\nBitcoin made a solid turnaround this year after a dull 2022. The cryptocurrency was on a rally till July, when its price hit a 52-week-high of $31,500. However, the price has since fallen and hit a low of $24, 500 in late August and September.\n\nPrices of cryptocurrencies have since been rangebound, but a rebound started again last month after the Fed kept its benchmark policy rate unaltered in its September FOMC meeting to its current range of 5.25-5.25%.\n\nA higher market interest rate has a negative impact on high-growth sectors such as technology and cryptocurrencies. The Fed’s monetary tightening campaign has also raised worries that the economy might slip into a recession.\n\nHowever, the Fed has hinted at going for one more 25-basis point hike this year before going for two rate cuts in 2024. Cryptocurrencies are making an attempt to recover from their recent lows, with investors expressing more positive sentiments. This renewed optimism follows the dovish comments from several Federal Reserve officials.\n\nStory continues\n\nStocks in Focus\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence and mining or production of cryptocurrencies.\n\nNVIDIA’s expected earnings growth rate for the current year is 221.6%. The Zacks Consensus Estimate for current-year earnings has improved 0.7% over the last 60 days. NVIDIA presently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nCoinbase Global, Inc.COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nCoinbase Global’s expected earnings growth rate for the current year is 85.2%. The Zacks Consensus Estimate for current-year earnings has improved 2.8% over the last 60 days. Coinbase currently has a Zacks Rank #2.\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 69% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.6% over the last 60 days. SQ currently carries a Zacks Rank #3 (Hold).\n\nCME Group Inc.’s CME options give the buyer of the call/put the right to buy/sell cryptocurrency futures contracts at a specific price at some future date. CME offers bitcoin and ether options based on the exchange's cash-settled standard and micro BTC and ETH futures contracts.\n\nCME Group’s expected earnings growth rate for the current year is 14.1%. The Zacks Consensus Estimate for current-year earnings has improved 0.6% over the last 60 days. CME presently has a Zacks Rank #2.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTkvYml0Y29pbi1leWVzLTI5ay1kZWZ5aW5nLWZyZXNoLWNyeXB0by1sYXdzdWl0LXJhdGUtZmVhcnMv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xOS9iaXRjb2luLWV5ZXMtMjlrLWRlZnlpbmctZnJlc2gtY3J5cHRvLWxhd3N1aXQtcmF0ZS1mZWFycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Eyes $29K, Defying Fresh Crypto Lawsuit, Rate Fears; XRP Jumps 6% as SEC Drops Charges - CoinDesk",
        "content": "Also at work were U.S. Federal Reserve Chairman Jerome Powell's remarks at the Economic Club of New York. He said that inflation is still too high but rising long-term bond yields could mean less need for further interest rate hikes. Powell signaled the Fed will likely keep rates unchanged in November but kept the option open for a potential hike in December."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE5L2JpdGNvaW4tYXNzZXQtbWFuYWdlci1vbnJhbXAtdW52ZWlscy1tdWx0aXNpZy1wbGF0Zm9ybS1hZGRzLWJpdGdvLXRvLWN1c3RvZGlhbnMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE5L2JpdGNvaW4tYXNzZXQtbWFuYWdlci1vbnJhbXAtdW52ZWlscy1tdWx0aXNpZy1wbGF0Zm9ybS1hZGRzLWJpdGdvLXRvLWN1c3RvZGlhbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Asset Manager Onramp Unveils Multisig Platform, Adds BitGo to Custodians - CoinDesk",
        "content": "Tanguma said he believes bitcoin offers investors a degree of regulatory clarity that other digital assets lack. BTC's classification as a commodity by the U.S. Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC) is \"the only thing the [regulators] seem to agree on,\" he said."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5vbmxpbmVhdGhlbnMuY29tL3N0b3J5L25ld3MvbG9jYWwvMjAyMy8xMC8xOS9leC1hdGhlbnMtcmVzaWRlbnQtamFtZXMtamltbXktemhvbmctYml0Y29pbi1mcmF1ZC1mZWF0dXJlZC1ieS1jbmJjLzcxMjI2OTE0MDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Ex-Athens resident James 'Jimmy' Zhong Bitcoin fraud featured by CNBC - Online Athens",
        "content": "A new CNBC documentary details the story of James \"Jimmy\" Zhong and the 2019 Athens break-in that exposed a $3 billion cryptocurrency fraud.\n\n\"Crypto 911: Exposing a Bitcoin Billionaire\" shows never-seen-before footage and in-depth interviews with Athens-Clarke County police, a special agent with the IRS, a cyber intelligence expert and a private investigator. The half-hour feature was reported by CNBC's Eamon Javers and produced by Paige Tortorelli.\n\nZhong, who lived a lavish lifestyle using the billions of dollars he made of stolen cryptocurrency, was living on Ruth Street in Athens in March 2019, when he reported his home was burglarized while he was out of town. He came home to discover a window in a rear bedroom shattered and the thief had found a brief case that contained $400,000 cash and a USB thumb drive with personal information, according to the police report obtained by the Athens Banner-Herald.\n\nThat 911 call turned into a $3.36 billion bitcoin bust, described by the U.S. Attorney as the largest financial seizure ever by the Internal Revenue Service, according to previous reporting from the Athens Banner-Herald.\n\nIn 2012, Zhong hacked a site on the dark web called Silk Road, one of the earliest crypto marketplaces, where anonymous buyers and sellers exchanged all manner of illicit material. In the hack, Zhong stole 50,000 Bitcoins, which eventually increased in value to $3 billion.\n\nLawsuits by crime victims:Two Marsy's Law complaints filed against Western Circuit District Attorney\n\nAn investigation by ACCPD, the IRS and other agencies into Zhong’s Bitcoin finances led to a November 2021 search of Zhong’s home in Gainesville that resulted in the seizure of more than $3.36 billion in Bitcoin.\n\nWhen federal investigators searched Zhong’s home they seized bitcoin in an underground floor safe, bitcoin loaded on a computer that was hidden inside a popcorn tin, along with $661,900 cash and 11 1-ounce bars of silver and gold.\n\nThe ACCPD never solved the mystery of who burglarized Zhong, so he turned to private investigator Robin Martinelli, who owns and operates Martinelli Investigations in nearby Loganville, Georgia, according to CNBC.\n\nMartinelli looked through surveillance footage at his home, then surveilled Zhong's circle of friends. She said that they may have been using him a little bit, according to CNBC, and that he didn't like hearing about it.\n\nZhong told the police officer he felt the person who stole the money apparently knew him because he had hidden the brief case behind an air vent.\n\n\"Jimmy wanted to be loved,\" Martinelli told CNBC. \"Jimmy wanted friends.\"\n\nZhong plead guilty to wire fraud in November 2022 and was sentenced in April 2023 to one year and a day in federal prison. Zhong, 33, began his sentence at the federal prison camp in Montgomery, Alabama, on July 14, 2023, according to CNBC."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LnRleGFzc3RhbmRhcmQub3JnL3N0b3JpZXMvY2hpbmVzZS1vd25lZC1jcnlwdG8tbWluZXMtdGV4YXMtbmF0aW9uYWwtc2VjdXJpdHktZW5lcmd5LWdyaWQtY29uY2VybnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Chinese-owned crypto mines raise national security, grid concerns - Texas Standard",
        "content": "As bitcoin mining operations have sprawled across rural Texas and other remote parts of the country, questions have arisen about their impact on the power grid.\n\nBut a new concern is on the horizon as Chinese-owned companies, banned from mining crypto in their own country, have opened facilities in the U.S. The mines, which are warehouses full of powerful computers, have sometimes been located close to military bases or important infrastructure.\n\nGabriel J.X. Dance and Michael Forsythe have reported on Chinese crypto mine ownership for the New York Times. Dance says the web of companies and individuals who own crypto mines makes it unclear how closely connected the miners are to the Chinese government.\n\nListen to the interview above or read the transcript below.\n\nThis transcript has been edited lightly for clarity:\n\nTexas Standard: You found that a number of Chinese companies operate crypto mining operations in the U.S. I guess the question that everyone is asking is, are they connected with the Chinese government or the Chinese Communist Party? And is that the primary concern?\n\nGabriel Dance: Well, yes. What we have found is that not only are there a sprawling number of Bitcoin mines operated by Chinese nationals, but that several of them are directly connected to the government, as well as the different political agencies in China.\n\nBut I guess it would be difficult to ascertain which are connected and which aren’t. You write that Chinese ownership is a bit of a web with multiple companies at the same address, folks involved in multiple companies and so on. What have you been able to determine?\n\nYou’re right. It can be very difficult to determine. And I was very lucky to work with my colleague Michael Forsythe, who was based in China for several years and fluent in Chinese.\n\nAnd what we were able to determine is that several of these companies have direct ties back to whether it be directly with the Chinese government or associated with different political factions in China. Some of them are also just wealthy Chinese owners who are looking to make sure their currency exists outside of the reach of the authoritarian government.\n\nWhat’s the nature of the national security threat? What are the implications? What would Bitcoin mines represent on that front?\n\nThe primary concern we found was specifically about one mine. This mine is located in Cheyenne, Wyoming, and it is directly adjacent to a Microsoft data center.\n\nAnd what we found is that Microsoft data center filed a report with the U.S. government over concerns that this Chinese Bitcoin mine was not only located very close to the Microsoft data center, which was performing support information for the Pentagon, but it was also about a mile away from an Air Force base. And that Air Force base controls nuclear armed intercontinental ballistic missiles.\n\nThe concerns from Microsoft was that the location could allow the Chinese to “pursue full spectrum intelligence collection operations.” So the idea is that it might be a Bitcoin mine that is situated less than a mile from the Air Force base, but it might be a cover, and that cover could facilitate anything from intelligence operations to different types of data processing, information and espionage.\n\n» GET MORE NEWS FROM AROUND THE STATE: Sign up for Texas Standard’s weekly newsletters\n\nI mentioned that Bitcoin mines have sprouted up all across Texas. What did you learn about Chinese ownership of mines in Texas?\n\nSo there are many Chinese-owned Bitcoin mines in Texas, and several of them are very large. The two that we spoke directly to in the story are Bitdeer and Poolin. Now, Bitdeer is perhaps the largest mine operating in the United States right now – it’s a little difficult to determine because they’re not very forthcoming; most of these companies are not very forthcoming with how large they actually are.\n\nBut Bitdeer, which is situated in Rockdale, Texas, in an old smelting plant, consumes about the same amount of energy as over 300,000 U.S. homes. So it’s a very large operation. The owner of Bitdeer, a man named Jihan Wu, was born in China, raised in China, started a very large Chinese Bitcoin mining machine company. And in 2019, that company, Bitmain, established this mine in Rockdale.\n\nIn 2021, there was a fight between the owners of Bitmain, and Jihan Wu splintered his company off into a company called Bitdeer, and that company continues to operate in Rockdale, Texas. Now, in the time since then, Mr. Wu has changed his country of residence to Singapore, which is not uncommon for Chinese nationals to do nowadays.\n\nIs there any way of knowing whether or not either of those mines pose any national security threat or are of interest to national security staffers?\n\nThere is concern, and the concern is not necessarily at a national security level, but it is at a Texas electrical grid level, which is to say: If these mines were to turn up or down this huge power consumption rapidly at certain periods of time, they could cause rolling brownouts and even blackouts.\n\nAnd if the Chinese mines were to – or any other mines were to – operate in conjunction with one another, they could bring down the entire Texas grid.\n\nIn fact, there’s a 2021 Texas law that prevents foreign adversaries from running businesses involved in the state’s infrastructure. In fact, China is actually named in that in that legislation. Is that affecting Chinese Bitcoin interests in the state? And if so, how?\n\nIt appears not to be as of yet. And that was one of the main questions that we are looking to answer with our article. What seems to be happening is these Bitcoin mines operate in a bit of a gray area, according to the national regulator of federal grid security.\n\nWhich is to say there’s regulations that govern power generators and power transmission companies. But there’s very little regulation on power users, even very large power users.\n\nAnd what the Bitcoin miners like to talk about is the benefit they bring, which is true. They are able to help grid operators balance the grid under periods of strain. But the flipside is also true, which is to say that if they were to operate in ways that are unhelpful to the grid, they could cause some pretty serious problems.\n\nDid you get the sense that a growing Chinese involvement in U.S. Bitcoin operations has actually had an impact on the thinking of regulators or government officials? What’s happening in Wyoming?\n\nWell, in Wyoming, it’s actually a bit of a point of controversy. What many of these small rural communities are doing are looking for industries and jobs. What they don’t quite seem to understand until the Bitcoin mine comes there is that it brings very few jobs. And the main benefit is the sales tax: They’re able to collect from the electricity sales, which is quite a bit.\n\nBut there is certainly concern at the national level and at different state levels about this problem. We spoke with a former assistant secretary for infrastructure protection at the Department of Homeland Security, and he said that there was an enormous amount of concern, particularly if the Chinese infrastructure impacts key energy systems.\n\nAnd so you mentioned the Lone Star Infrastructure Protection Act. Well, that act pretty clearly makes it illegal for Chinese-owned and operated companies, as well as some other foreign adversaries, to interconnect with the electrical grid.\n\nBut I believe that Attorney General [Ken] Paxton has ruled that while that does apply to generators – so you couldn’t have a Chinese-owned wind farm, for example – I don’t believe that it’s been specified whether it whether it applies to these large electricity users.\n\nYou write that there seems to be something of a conflict between the way that Texas government officials have embraced crypto mining and a desire to be tough on China. What sort of situation did you have in mind? Was there something specific?\n\nWell, the state has these very lucrative incentives for Bitcoin miners, which make it a very popular destination. And the company I was referring to earlier, Bitdeer, has been awarded nearly $50 million for participating in these programs that help balance the grid."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy13aGF0LXRlc2xhLWRpZC13aXRoLWl0cy1iaXRjb2luLWhvbGRpbmdzLWluLXEzLTIwMjMv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2hlcmVzLXdoYXQtdGVzbGEtZGlkLXdpdGgtaXRzLWJpdGNvaW4taG9sZGluZ3MtaW4tcTMtMjAyMy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Here’s What Tesla Did With its Bitcoin Holdings in Q3 2023 - CryptoPotato",
        "content": "Tesla’s Q3 2023 financial report reveals that the company did not trade or sell any Bitcoin during the last three months.\n\nAs of Sept. 30, Tesla still possesses around 9,720 BTC, valued at approximately $275.6 million based on current market rates.\n\nTesla Still Holds its Bitcoin\n\nAccording to Tesla’s recently released Q3 2023 financial report, the electric vehicle manufacturer did not engage in any Bitcoin buying or selling activities over the past three months.\n\nAs of Sept. 30, Tesla still held around 9,720 BTC, valued at approximately $275.6 million at current market prices. This marks the fifth consecutive quarter that Tesla has maintained its Bitcoin holdings without making any changes.\n\nMeanwhile, Tesla’s stock faced a 4.78% decline after the market closed today, with shares valued at $242.68 each. In addition to the information about Tesla’s Bitcoin holdings, the company reported revenue of $23.35 billion for the third quarter, slightly below the estimated $23.9 billion projected by analysts.\n\nTesla also reported adjusted earnings of 66 cents per share, falling short of the 73 cents per share expected.\n\nTesla’s History with Bitcoin\n\nTesla first ventured into cryptocurrency in early 2021 when it invested $1.5 billion in Bitcoin, as reported in a filing with the United States Securities and Exchange Commission (SEC). At that time, the company acquired 43,000 BTC at an estimated price of approximately $34,000 per coin. Simultaneously, Tesla started accepting Bitcoin as a payment option for its vehicles and other products.\n\nHowever, shortly after this initial investment, concerns arose about the environmental impact of Bitcoin mining. CEO Elon Musk expressed reservations about the cryptocurrency and decided to sell 4,320 BTC from Tesla’s holdings. This move coincided with a decline in Bitcoin’s value, resulting in a $101 million impairment loss for the company.\n\nTesla continued to sell its Bitcoin holdings, and by the second quarter of 2022, it had reportedly disposed of 75% of its holdings. Musk explained that this decision was influenced by uncertainties surrounding the duration of COVID lockdowns in China, and the company needed to bolster its cash reserves. Since then, Tesla has maintained a consistent stance on its Bitcoin holdings, as emphasized by its recently released Q3 2023 report."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy90ZXNsYS1idGMtaG9sZGluZ3Mtc3RhYmxlLW11c2stY29vbHMtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Tesla BTC Holdings Not Going Anywhere As Musk Cools on Bitcoin - CCN.com",
        "content": "Key Takeaways\n\nElon Musk has previously made multiple commitments to not sell Bitcoin, and then changed his mind.\n\nTesla’s latest earnings report appears to show it kept hold of its share of BTC.\n\nIn recent years, Musk has turned his attention to the memecoin DOGE.\n\nBitcoin investors often look to companies with large crypto holdings like Tesla for clues on market sentiment. So Tesla’s latest earnings report will do nothing to excite holders of the world’s original cryptocurrency.\n\nConsidering Elon Musk’s famed ability to move markets with a single tweet (or “post”), perhaps Tesla’s Q3 earnings report showing stable Bitcoin holdings could be a welcome note of calm, considering the alternatives.\n\nTesla Appears To Cool on Bitcoin\n\nIt turns out Tesla’s love affair with Bitcoin may have cooled off significantly. The electric vehicle maker’s latest Q3 earnings report appears to show that its Bitcoin stash has remained unchanged for the fifth quarter in a row. The report did not explicitly mention Bitcoin, indicating that its holdings have remained the same.\n\nTesla is still holding steady at around 9,720 Bitcoins, valued at approximately $279 million as of October 19, 2023.\n\nThe car manufacturer made a big splash back in early 2021 by investing $1.5 billion in Bitcoin and saying it would accept the cryptocurrency for car payments. Those days are clearly over, however. After liquidating 75% of its crypto holdings last year at a hefty loss, and selling 4,320 Bitcoin in the first quarter of 2021, Tesla has pressed pause on any further Bitcoin buying or selling.\n\nIts current Bitcoin trove makes Tesla the third largest public company holder of crypto, trailing only MicroStrategy and Marathon Digital Holdings according to bitcointreasuries.net . But don’t expect that position to change anytime soon. While Tesla clocked lower earnings in Q3, down 44% year-over-year, crypto trading clearly isn’t the priority.\n\nCEO Elon Musk may have boosted Bitcoin prices back in the day by championing crypto. But Tesla’s breakup with Bitcoin seems pretty definitive now. The company dumped over 30,000 coins in mid-2022 and hasn’t touched its remaining crypto stash in months.\n\nMusk Was Never Much of a Fan\n\nDespite assumptions, the South-African born billionaire has never been a huge cheerleader of the world’s original cryptocurrency. Back in May 2021, Musk halted plans to accept Bitcoin for payments over rising concerns about its environmental impact.\n\nIn a tweet, the Tesla owner said the firm would be looking at other crypto alternatives, and that cryptocurrency itself was “a good idea on many levels.” Currently, the only cryptocurrency you can buy a Tesla with is DOGE, Musk’s personal favorite cryptocurrency.\n\nNot that you’d want to. According to Tesla’s official support page , orders placed with DOGE cannot be canceled, returned, or even refunded in the original form of payment if you accidentally overpay.\n\nLater that year in December, Musk explained his affinity for the memecoin, saying Bitcoin “just gives power to new rich people,” and “That’s why I’m pro doge.”\n\nIn July 2021, the billionaire explained he had no plans to sell any of his Bitcoin in the near future, and that he doesn’t believe in dumping when the price is high. “I would like to see Bitcoin succeed,” he said. As we know, Musk eventually changed his mind. SpaceX sold all of their Bitcoin holdings in August 2023, whilst Tesla sold Bitcoin in both 2021 and 2022."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8xOS9ncmF5c2NhbGUtZXRmLWNhc2VzLWZpbmFsLXdvcmQtY29taW5nLWluLWZlZGVyYWwtY291cnQtYXMtc2VjLWxvc3MtZm9ybWFsaXplZC_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTAvMTkvZ3JheXNjYWxlLWV0Zi1jYXNlcy1maW5hbC13b3JkLWNvbWluZy1pbi1mZWRlcmFsLWNvdXJ0LWFzLXNlYy1sb3NzLWZvcm1hbGl6ZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Grayscale ETF Case's Final Word Coming in Federal Court as SEC Loss Formalized - CoinDesk",
        "content": "According to procedure in such cases, the D.C. Circuit Court of Appeals had seven days to close the books on this matter after the SEC chose last week not to appeal the court's ruling that the agency must scrap its rejection of Grayscale's ETF application. That deadline is arriving on Friday, and there are a couple of possibilities for what the court does next: It can just terminate the case without comment, or it could issue some further direction to the SEC on what comes next."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJyaWVmbHktcmFsbGllcy1hYm92ZS11cy0xMzA4MTA4MjYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin briefly rallies above US$30,000 following Grayscale's new ETF application - Yahoo Finance",
        "content": "Bitcoin briefly rose to a near three-month high of US$30,104 on Friday in Hong Kong, fueled by recent developments around possible spot Bitcoin exchange-traded funds (ETFs) approvals in the United States. Bitcoin changed hands at US$29,708 at 6:40 p.m. in Hong Kong, according to CoinMarketCap.\n\nSee related article: Binance freezes over 100 accounts on Israeli police request: Financial Times\n\nFast Facts\n\nBitcoin briefly reclaimed the US$30,000 mark a day after Grayscale submitted a new spot Bitcoin ETF application with the U.S. Securities and Exchange Commission (SEC).\n\nIf accepted, Grayscale would convert its Grayscale Bitcoin Trust, the world’s largest Bitcoin fund, into a spot Bitcoin ETF on the New York Stock Exchange (NYSE) Arca.\n\n“A spot Bitcoin ETF has immense appeal for traditional institutional and retail investors. It would provide exposure to the largest cryptocurrency by market capitalization without having to manage wallets and the related storage and security issues,” said Jeff Mei, chief operating officer of the BTSE crypto exchange, in a statement shared with Forkast.\n\nBitcoin’s price rose to a two-month high of US$29,388 on Monday, after crypto media outlet Cointelegraph inaccurately reported on X (formerly Twitter) that the SEC approved the spot Bitcoin ETF application of BlackRock, the world’s largest asset manager.\n\nSee related article: BlackRock shares go digital on JPMorgan’s Onyx blockchain"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ncmF5c2NhbGUtbmV3LXNwb3QtYml0Y29pbi1ldGYtbnlzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Grayscale files for new spot Bitcoin ETF on NYSE Arca - Cointelegraph",
        "content": "Major cryptocurrency investment firm Grayscale Investments has filed a new application with the United States Securities and Exchange Commission (SEC) for a new spot Bitcoin (BTC) exchange-traded fund (ETF).\n\nOn Oct. 19, Grayscale submitted an S-3 form registration statement with the SEC, intending to list the shares of Grayscale Bitcoin Trust on the New York Stock Exchange (NYSE) Arca under the ticker symbol GBTC.\n\nThe new filing aligns with Grayscale’s ongoing effort to convert its Grayscale Bitcoin Trust into a spot Bitcoin ETF, according to a statement by Grayscale.\n\n“We remain committed to working collaboratively and expeditiously with the SEC on behalf of GBTC’s investors,” the firm wrote in the announcement.\n\nThe latest S-3 registration statement is a shorter filing version of a typical form S-1 statement that targets the initial public offering of equity securities registered under the Securities Act.\n\n“GBTC, however, is eligible to use Form S-3, a shorter filing that incorporates by reference its SEC disclosures and reports, because its shares have been registered under the Securities Exchange Act of 1934 since January 2020 and it meets the other requirements of the form,” Grayscale stated.\n\nThe firm mentioned that Grayscale would be able to convert GBTC to an ETF and issue shares on a registered basis once NYSE Arca’s 19b-4 application is approved and the Form S-3 must be declared effective by the SEC. The announcement added:\n\n“Importantly, GBTC is ready to operate as an ETF upon receipt of these regulatory approvals, and on behalf of GBTC’s investors, Grayscale looks forward to working collaboratively and expeditiously with the SEC on these matters.”\n\nThe news comes weeks after Grayscale won an SEC lawsuit for its spot Bitcoin ETF review, with the U.S. Court of Appeals for the District of Columbia Circuit ordering the SEC to explain why it rejected Grayscale’s application in June 2023. The company also filed with the SEC to list an Ether (ETH) futures ETF in September.\n\nRelated: Grayscale GBTC discount falls to 16% as markets bet on Bitcoin ETF approval\n\nGrayscale is one of several companies seeking the SEC’s approval to launch a spot Bitcoin ETF, including companies like ARK Investment, BlackRock, Fidelity and others.\n\nAccording to Bloomberg Intelligence analyst James Seyffart, BlackRock filed an updated Bitcoin ETF prospectus on Oct. 19 as well. The filing is “likely their response to SEC comments like we’ve seen from Ark, Fidelity, and others,” he said, adding that it brings “more confirmation that issuers are in talks with the SEC.”\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Beyond crypto: Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTIwL2JpdGNvaW4tYnRjLXJpdmFsLWV0aGVyLWV0aC1mYWx0ZXJzLWFzLXN0YWtpbmctZGVtYW5kLXdlYWtlbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Rival Ether (ETH) Falters as Staking Demand Weakens - Bloomberg",
        "content": "A key pillar of demand for Ether , the second-largest digital token, is weakening against a backdrop of elevated Treasury yields .\n\nCrypto investors can earn rewards by pledging Ether tokens to help operate the Ethereum blockchain, a return some cite as a potential prop for the coin. But the staking payout on pledged tokens has fallen to an annualized 3.5%, near the lowest in at least 10 months and well below a recent peak of more than 8%."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXNocnVncy1iZWFycy1taW5pbmctc3RvY2tzLXRha2UtYmVhdGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price shrugs off bears, but mining stocks take a beating: Report - Cointelegraph",
        "content": "Until Bitcoin (BTC) breaks its long-established $25,000–$30,000 trading range, the crypto market is arguably in what some analysts have called a “crab market.” It is likely that a decisive macroeconomic or crypto-specific catalyst will be necessary to break out of it. This failed to occur in the month of September.\n\nThe BTC price briefly tested the lower end of the established trading range and touched $25,200. In the second half of the month, however, the price recovered to $26,900 and posted a monthly close of +3.92%. This both bucked the historical trend of negative closes in September and went against traditional markets. The S&P 500 was down 5.4% over the same time frame.\n\nHowever, Bitcoin’s relative resilience did not stabilize the industry as a whole. Crypto stocks were hit with an even bigger correction than the S&P, and altcoins continued their month-long losing streak against BTC. As every month, the Cointelegraph Research Investor Insights report provides an overview of industry-wide developments. It is an invaluable resource, especially in bear market conditions when many of the less mature sectors of the industry drop out of the news headlines.\n\nThe report is available for Pro subscribers on the Cointelegraph Research Terminal.\n\nMajor mining companies down 30%\n\nMost publicly traded crypto companies faced a challenging month in September, and their stocks underperformed. In many cases, share prices dropped between 10% and 40%, and the sector averaged a decline of 22.4%. Crypto mining stocks were hit especially hard.\n\nTeraWulf, Marathon Digital and Iris Energy all lost almost one-third of their valuation. The miners affected by these large corrections had rallied massively in the first half of the year, sometimes gaining +300%. However, share prices started to decline in July and have now mostly erased these previous gains. Some of the reasons for this correction are specific to the mining sector and are unlikely to affect crypto more widely.\n\nBitmain releases new Antminer iteration\n\nThe large corrections in the stocks of the mining stocks can, among other things, be attributed to a tightening of mining economics. In April 2024, the next Bitcoin halving event will occur, which will slash rewards for validating votes in half overnight. Despite this outlook, network hash rate and difficulty show no signs of slowing down and keep hitting all-time highs.\n\nThe result is that Bitcoin mining is becoming increasingly competitive by the day, and profit margins are becoming slimmer. Once mining companies exhaust their ability to raise new capital, they could be financially squeezed after the halving unless Bitcoin puts in a significant rally.\n\nIn September, Bitmain, the largest producer of ASIC mining hardware, announced a new model of Antminer rigs that will intensify this competition further in the coming months. The new S21 rigs will have a mining efficiency of 17.5 J/TH — a more than 20% increase compared to the previous front-runner. Miners who manage to raise the capital for an upgrade quickly will be able to price out their competition once the effects of the halving kick in.\n\nThe Cointelegraph Research team\n\nCointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to providing the most accurate, insightful content available on the market.\n\nWith decades of combined experience in traditional finance, business, engineering, technology and research, the Cointelegraph Research team is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report.\n\nThe opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxvbmctdGVybS1pbnZlc3RvcnMtb3duLTc2LXBlcmNlbnQtYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Hodling hard: Bitcoin's long-term investors own over 76% of all BTC for the first time - Cointelegraph",
        "content": "Bitcoin (BTC) is becoming scarcer than ever — whether you are a BTC price speculator or new to the market.\n\nThe latest data from on-chain analytics firm Glassnode shows a record portion of the available BTC supply is locked up in long-term storage.\n\nBitcoin long-term holder presence beats all-time highs\n\nAt more than 76%, Bitcoin’s long-term holders (LTHs) control more of the BTC supply than at any point in history.\n\nDespite the supply increasing with every block, in percentage terms, the low-time preference Bitcoin investor cohort has a record market presence.\n\nAs noted by Charles Edwards, founder of quantitative Bitcoin and digital asset fund Capriole Investments, the achievement marks a first in Bitcoin’s lifespan.\n\n“A record 76.2% of the Bitcoin network is locked up with long-term holders today,” he wrote on X on Oct. 18.\n\n“Topping the record set in 2015. Less liquid supply means the same people are bidding on less coins. You do the math.”\n\nBitcoin long-term holder (LTH) % BTC supply share chart. Source: Charles Edwards/X\n\nEdwards referenced the knock-on effect of the LTH record — that coins available for other market participants are getting rarer.\n\nAn accompanying Glassnode chart shows LTHs increasing their BTC exposure dramatically from mid-2021 onward, “hodling” through the entirety of the subsequent bear market. Only during brief periods since has the percentage of supply that they control decreased.\n\nIn private comments to Cointelegraph, meanwhile, Edwards added that, while demand for Bitcoin itself fluctuates, the trend trajectory is clear.\n\n“I don’t mean demand is the same as 2015. I mean that for the same given demand and a reduced supply means price must go up — supply/demand economics,” he explained.\n\n“But in reality, demand has increased quite a lot since 2015, so it should put even more upward pressure on price for this cycle. We have never had Bitcoin’s supply this constricted going into a halving.”\n\nBTC speculators stay on the sidelines\n\nAs Cointelegraph reported, the opposite end of the spectrum to LTHs — short-term hodlers (STHs), or speculators — are also of major interest to market observers.\n\nRelated: BTC price models hint at $130K target after 2024 Bitcoin halving\n\nThe realized price of the STH cohort has functioned as support during much of this year, and this week, fresh data shows that the trend remains in play.\n\nThe STH realized price — the price at which all STH-owned coins last moved — sits at just below $27,000, and BTC/USD breaking above it this week is an important bullish impetus, analysis says.\n\nData from Cointelegraph Markets Pro and TradingView shows Bitcoin holding $28,000 support after hitting two-month highs.\n\nBTC/USD 1-day chart. Source: TradingView\n\nIn August, meanwhile, the historically low BTC exposure among STH entities was already on the radar.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY291bGQtYml0Y29pbi1iZS1nZWFyaW5nLXVwLWZvci1hLXllYXItZW5kLWJ1bGwtcnVuL9IBZ2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY291bGQtYml0Y29pbi1iZS1nZWFyaW5nLXVwLWZvci1hLXllYXItZW5kLWJ1bGwtcnVuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Could Bitcoin Be Gearing Up for a Year End Bull Run? - Finance Magnates",
        "content": "As the year comes to an end, cryptocurrency enthusiasts and investors are focusing on Bitcoin, the world's most renowned digital asset. Bitcoin has a history of generating big year-end rallies, prompting the moniker \"Santa Claus rally\" to be coined in the crypto community. With a variety of factors at play, including macroeconomic conditions and institutional acceptance, everyone is wondering whether Bitcoin is ready for another year-end bull run.\n\nBitcoin's Year-End Performance\n\nSince its introduction, Bitcoin's performance in the closing months of the year has been widely monitored. Historically, Bitcoin has had spectacular price increases in the later half of the year, notably in November and December. Several factors have been attributed to this phenomena by analysts.\n\nIncreased trading activity as investors restructure their portfolios before the end of the year is one important aspect. Tax considerations, portfolio rebalancing, and the prospect of a new year's start all contribute to increasing demand for Bitcoin and other cryptocurrencies.\n\nFurthermore, the holiday season tends to instill a sense of optimism and risk-taking in financial markets, and Bitcoin is no exception. As investors look for ways to end the year on a high note, the cryptocurrency market frequently sees an increase in trade volumes and bullish mood.\n\nKeep Reading TradingView Enhances DeFi Tools on Polygon via QuickSwap Partnership\n\nMarket maturation and institutional adoption\n\nThe growing participation of institutional investors in the cryptocurrency industry has been one of the most significant events in the last year. Companies such as Tesla, Square, and MicroStrategy have made high-profile endorsements and investments in the company.\n\nInstitutional adoption adds legitimacy and stability to the cryptocurrency market that was previously lacking. Institutional investors have a longer investment horizon, and their participation has aided Bitcoin's maturity as an asset class.\n\nFurthermore, the emergence of Bitcoin futures and other financial products on established exchanges has made it easier for institutions to have exposure to Bitcoin. This accessibility has not only increased demand, but has also allowed institutions to efficiently hedge their bets.\n\nThe Role of Macro Factors\n\nAside from crypto-specific dynamics, macroeconomic variables have had a substantial impact on Bitcoin's performance. Concerns have been made concerning inflation and currency depreciation as a result of unprecedented fiscal stimulus measures implemented by governments around the world in reaction to the COVID-19 epidemic.\n\nBitcoin, sometimes known as \"digital gold,\" has being marketed as a hedge against these economic concerns. Investors looking to preserve their assets from the potential depreciation of fiat currencies have turned to Bitcoin as a store of value.\n\nFurthermore, the low-interest-rate environment, combined with the possibility of negative real yields, has made traditional assets such as bonds and cash less appealing. In such an environment, Bitcoin's potential for high returns has piqued the interest of investors looking for alternative investments.\n\nRegulatory Advances\n\nWhile institutional adoption has given the crypto market credibility, regulatory events continue to be a cause of concern. Governments and authorities throughout the world are debating how to approach and regulate cryptocurrencies.\n\nClear and friendly regulatory frameworks can help the crypto market by creating trust in investors. Regulatory crackdowns or negative verdicts, on the other hand, might have a chilling impact.\n\nMarket participants are keeping a close eye on regulatory developments, particularly in the United States, where politicians are debating prospective laws governing cryptocurrencies and digital assets.\n\nMarket Attitudes and Technical Analysis\n\nAside from fundamental reasons, market sentiment and technical analysis frequently play an important influence in Bitcoin price changes. Traders and analysts employ a variety of techniques and indicators to assess market sentiment and forecast price changes.\n\nThe study of price charts and trends to determine probable entry and exit locations is known as technical analysis. To make informed trading decisions, traders employ indicators such as moving averages, the Relative Strength Index (RSI), and Fibonacci retracement levels.\n\nNews events, social media debates, and overall market attitude can all have an impact on market sentiment. Positive news, such as prominent corporations investing in Bitcoin, can feed optimistic enthusiasm, whilst negative news or regulatory developments can have the opposite impact.\n\nChallenges and Threats\n\nWhile the prospect of a year-end Bitcoin bull run is appealing, it is critical to understand the limitations and hazards connected with cryptocurrency investing. The price volatility of Bitcoin can result in big gains, but it also entails the danger of significant losses.\n\nBefore making investing decisions in the cryptocurrency market, investors should proceed with care and undertake extensive study. Diversification and risk management measures are critical for limiting the hazards associated with bitcoin investments.\n\nFurthermore, the bitcoin market is open 24 hours a day, seven days a week, and price changes can occur at any time. Investors should brace themselves for both short-term and long-term market swings.\n\nPast Performance No Guarantee of Future Results\n\nAs we approach the end of the year, predictions for Bitcoin's future value have already begun circulating in the cryptocurrency space. Analysts and experts have turned to historical data to make forecasts, but they also acknowledge that past performance doesn't guarantee future results.\n\nFor 2024, the range of Bitcoin price predictions is quite wide, indicating the uncertainty surrounding the cryptocurrency market's future.\n\nIn 2023, Bitcoin saw a remarkable increase of over 70%, largely driven by hopes of a banking crisis and the approval of a spot Bitcoin exchange-traded fund (ETF) in the United States. This surge in value led some to draw parallels between the market trends in 2023 and the period from 2017 to 2020.\n\nSome analysts suggest that the current market trend appears reminiscent of the price movement leading up to Bitcoin's historic peak of $69,000 in November 2021. This has sparked speculation that a significant breakout could happen once again, potentially setting the stage for a sustained bull run.\n\nDrawing from the analogy with the 2020 breakout, one might posit that Bitcoin might reach a price range of $45,000 to $50,000 by the end of 2024 if a similar pattern unfolds.\n\nHowever, the cryptocurrency landscape is in a different place than it was in 2020. Today, Bitcoin faces challenges posed by the tightening regulatory policies of the U.S. Federal Reserve and other financial authorities. These policy changes could have a substantial impact on the future of Bitcoin and the broader cryptocurrency market.\n\nAs investors eagerly await the new year, it's crucial to remember that while past performance can offer insights, cryptocurrency markets are highly volatile and influenced by various unpredictable factors. Thus, Bitcoin's future trajectory remains uncertain, and investors should approach these forecasts with a degree of caution.\n\nConclusion: The Uncertain Future\n\nThe question of whether Bitcoin will have a year-end bull run remains unanswered. While historical trends, institutional acceptance, and macroeconomic considerations all contribute to a favorable backdrop, the cryptocurrency market is notorious for its volatility.\n\nBitcoin and other cryptocurrencies should be approached by investors with a thorough grasp of the dangers and a long-term perspective. Whether or not a year-end boom occurs, Bitcoin's function as a digital asset and store of value continues to expand, impacting the broader financial and investment landscape."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvaXMtYml0Y29pbi1leWVpbmctYW5vdGhlci1idWxsLXJ1bi1vci1jcnlwdG8td2ludGVyL9IBZ2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvaXMtYml0Y29pbi1leWVpbmctYW5vdGhlci1idWxsLXJ1bi1vci1jcnlwdG8td2ludGVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Is Bitcoin Eyeing Another Bull Run or Crypto Winter? - Finance Magnates",
        "content": "The world of cryptocurrencies has been a hotbed of speculation and anticipation, frequently characterized by extraordinary volatility. Investors and enthusiasts are constantly looking for hints and insights to estimate the future trajectory of the cryptocurrency market, particularly Bitcoin, the pioneer and flagship cryptocurrency. Everyone is wondering whether Bitcoin is on the verge of another bull run or if the crypto winter is just around the horizon.\n\nUnderstanding Bitcoin's Cycles\n\nThe history of Bitcoin is marked by periods of rapid price gains followed by large corrections. These cycles are frequently referred to as bull markets (periods of significant price growth) and bear markets (periods of significant price decline). Understanding these cycles is critical for judging the market's current state.\n\nBitcoin's last major bull run happened in late 2020 and early 2021. During this time, the price of Bitcoin skyrocketed to an all-time high of approximately $64,000 in April 2021. The excitement, however, was short-lived, as Bitcoin and the larger crypto market saw a steep fall, resulting in a bear market that lasted most of 2021.\n\nFactors Contributing to Speculation\n\nSeveral variables have contributed to the conjecture about Bitcoin's potential price movement:\n\nKeep Reading TradingView Enhances DeFi Tools on Polygon via QuickSwap Partnership\n\nInstitutional Adoption: Institutions and huge organizations have showed increasing interest in Bitcoin in recent years. Tesla and Square have made big Bitcoin investments, and traditional financial institutions have begun to offer cryptocurrency-related services to their consumers. Institutional adoption is seen favorably for Bitcoin's long-term prospects.\n\nMacroeconomic Environment: Bitcoin has been referred to as \"digital gold\" and an inflation hedge. Concerns about currency depreciation and inflation have intensified as governments around the world implemented large stimulus packages in response to the COVID-19 outbreak. Some investors see Bitcoin as a potential safe haven against these economic risks.\n\nTechnological Advances: Ongoing developments in the Bitcoin ecosystem, such as the Taproot update and the Lightning Network enabling faster and cheaper transactions, have spurred confidence among the crypto community. These enhancements are intended to increase Bitcoin's utility and scalability.\n\nMarket Sentiment: Market sentiment influences crypto price changes significantly. Positive news, prominent endorsements, and social media talk can all lead to FOMO (fear of missing out) purchases, driving up prices. Negative news or regulatory changes, on the other hand, might cause selling and market downturns.\n\nRegulatory Uncertainty's Role\n\nRegulatory ambiguity is one of the crypto market's constant concerns. Governments and regulatory agencies all around the world are debating how to effectively control cryptocurrencies. This uncertainty has the potential to affect investor sentiment and market behavior.\n\nThere have been major regulatory developments in recent months, particularly in the United States. The Securities and Exchange Commission (SEC) of the United States has postponed judgments on multiple Bitcoin exchange-traded fund (ETF) applications, citing concerns about market manipulation and investor protection. The outcome of these regulatory decisions could have a significant impact on the future of Bitcoin.\n\nRisk Management and Market Volatility\n\nInvestors must understand that the crypto sector, including Bitcoin, remains extremely volatile. While there is the potential for huge gains, there is also the danger of significant losses. The need of risk management and diversification in one's investment plan is highlighted by this volatility.\n\nWhen entering the cryptocurrency market, investors should examine their risk tolerance and investment horizon. Stop-loss orders, dollar-cost averaging, and maintaining a diverse portfolio can all assist to manage the inherent risks.\n\nThe Long-Term Prospects\n\nPredicting the future of Bitcoin, or any other asset, is a difficult task. The crypto market is influenced by a plethora of internal and external forces, and its dynamics can shift quickly.\n\nSome industry experts and analysts remain bullish about Bitcoin's long-term prospects, citing rising usage, expanded use cases, and improving technology. They anticipate that the price of Bitcoin will hit new highs in the next years.\n\nSkeptics, on the other hand, claim that Bitcoin's price is mostly driven by speculation and that its volatility makes it an untrustworthy store of value. They underline the possibility of regulatory obstacles as well as the prospect of a prolonged crypto winter.\n\nBlackRock and JPMorgan's Entry Could Propel Bitcoin to Massive Bull Run\n\nInstitutional involvement is reshaping the crypto landscape, with BlackRock and JPMorgan leading the charge. These financial titans, managing $8.5 trillion and $3.8 trillion, respectively, are laying the groundwork for the next Bitcoin bull run.\n\nBlackRock's pioneering move involved utilizing JPMorgan's blockchain collateral system. Moreover, BlackRock is considering launching a spot Bitcoin exchange-traded fund (ETF), while JPMorgan displays optimism regarding Bitcoin mining's future.\n\nForbes even predicts that BlackRock and JPMorgan's involvement will ignite the upcoming bull run, driven by institutions pouring trillions into the crypto space, including BlackRock, Fidelity, Vanguard, and Grayscale.\n\nThis surge in institutional interest hints at the potential for substantial price momentum across various digital assets. Combined with the ongoing trend of long-term Bitcoin accumulation, market conditions seem primed for the next bull run.\n\nLong-term holders are already accumulating sizable amounts of Bitcoin each month, causing supply to diminish as demand soars.\n\nConclusion: The Uncertain Future\n\nThe crypto community and investors continue to debate Bitcoin's future as it sits at a crossroads. The history of bitcoin has proved that it is not immune to extreme price volatility and cycles.\n\nWhile Bitcoin's potential for another bull run remains a possibility, it is also critical to recognize the market's risks and uncertainties. Investors should proceed with prudence in the crypto realm, undertake extensive research, and remain cautious in risk management.\n\nUltimately, whether Bitcoin enters another bull run or experiences a crypto winter, its journey demonstrates the world of cryptocurrencies' ongoing fascination and inventiveness. The future remains unpredictable, but investors can use the lessons acquired from previous cycles to navigate the crypto landscape with caution and resilience."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjU4Njc1L2JpdGNvaW4tcHJpY2UtZmxpcnRzLXdpdGgtMzAwMDAtbWFyay1kdXJpbmctc3VzdGFpbmVkLXJhbGx50gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjU4Njc1L2JpdGNvaW4tcHJpY2UtZmxpcnRzLXdpdGgtMzAwMDAtbWFyay1kdXJpbmctc3VzdGFpbmVkLXJhbGx5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price flirts with $30,000 mark during sustained rally - The Block",
        "content": "Bitcoin BTC -1.91% has sustained its week-long rally and rallied up against the $30,000 mark on Friday, briefly rising above it.\n\nThe world's largest digital asset by market cap is up 5% in the past 24 hours, now changing hands for $29,970 at 6:55 a.m. ET, according to CoinGecko. The global cryptocurrency market cap increased today to $1.18 trillion, a rise of 5.0% in the last 24 hours, according to CoinGecko\n\nThe news comes after Federal Reserve Chair Jerome Powell's statement in New York on Thursday. Powell indicated the Fed is likely to pause interest rate hikes at the next FOMC meeting. He cited economic uncertainties and risks. \"Tight policy is putting downward pressure on economic activity and inflation,\" Powell said during a discussion at the Economic Club of New York.\n\nRELATED INDICES See crypto indices\n\nBitcoin's break-out above the $30,000 mark comes five days after the digital asset briefly touched the $30,000 mark on Monday. The brief spike was ignited by a false report that inaccurately asserted BlackRock's proposed spot bitcoin ETF had gained approval.\n\nThe digital asset's week-long rally has attracted positive commentary from senior figures in institutional finance. BlackRock's Larry Fink weighed in on Monday, suggesting the rally had more substance than the false report that ignited it. Fink proposed that investors seeking \"a flight to quality\" also contributed to the rally."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1ldGYtY3J5cHRvY3VycmVuY3ktYnVsbHMtdG9rZW4tcmFsbHktY3VycmVuY3ktbWFya2V0cy1ub3ZvZ3JhdHotMjAyMy0xMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price Jumps As ETF Bullishness Drives Token to $30,000 - Markets Insider",
        "content": "Bitcoin jumped as high as $30,000 on Friday, hovering about 4.5% higher in early trading.\n\nThe token spiked 10% briefly on Tuesday after a false report said the SEC approved BlackRock's spot bitcoin ETF.\n\nBullishness around a the spot bitcoin ETF is high, with calls growing for the SEC to sign off on a first-ever fund.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin moved above $30,000 on Friday, spiking above the closely watched threshold before paring some gains, as a week of bullishness around a spot bitcoin ETF helps push the token higher.\n\nBitcoin traded 4.5% higher, around $29,613, at 9:45 a.m. in New York. The world's largest cryptocurrency is close to a 10% gain for the week.\n\nHopes for a spot bitcoin exchange-traded fund have helped fuel the latest rally. On Tuesday, its price jumped 10% briefly after a false tweet from the trade publication CoinTelegraph that the Securities and Exchange Commission had approved BlackRock's application for a spot bitcoin ETF.\n\nThe SEC has already approved bitcoin futures ETFs, though regulators have turned down bitcoin spot ETF applications repeatedly in recent years. With big names such as BlackRock and Fidelity joining the race, however, optimism is climbing.\n\nAdvertisement\n\nBillionaire Mike Novogratz, CEO of Galaxy Digital and a bullish crypto investor, said he still expects a spot bitcoin ETF product to gain approval before 2024, pointing to the flurry of requests for the product over the last year.\n\n\"It's going to get approved...We think it happens this year in 2023,\" Novogratz said. \"All the indications of dealing seem to be heading in the right direction.\"\n\nIn the recent lawsuit between regulators and Grayscale, he explained, the court ruled against the SEC because allowing a futures ETF but not a spot ETF \"makes intellectually zero sense.\"\n\nIn a letter to Gary Gensler earlier this week, a group of House Financial Services Committee members urged the SEC to pull back its efforts to block the approval of a spot bitcoin ETF.\n\nAdvertisement\n\nMeanwhile, Google Trends shows search interest in \"spot bitcoin ETF\" is on track to hit a five-year high, as CoinDesk pointed out Friday, pointing to growing mainstream interest as well."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjAvc29sYW5hLXJhbGxpZXMtMjYtaW4tYS13ZWVrLWRlc3BpdGUtZnR4LXNhbGUtZmVhcnMtd2hhdHMtYmVoaW5kLXRoZS1tb3ZlL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjAvc29sYW5hLXJhbGxpZXMtMjYtaW4tYS13ZWVrLWRlc3BpdGUtZnR4LXNhbGUtZmVhcnMtd2hhdHMtYmVoaW5kLXRoZS1tb3ZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Solana Rallies 26% in a Week Despite FTX Sale Fears; What's Behind the Move? - CoinDesk",
        "content": "Friday's gain adds to SOL's remarkable comeback as one of the best-performing digital assets this year with a 170% year-to-date rise. This after Solana’s future was in doubt at the end of 2022 following the spectacular fall of Sam Bankman-Fried – one of the ecosystem’s top supporters and investors."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTkvdGhlLWNyeXB0by13aW50ZXItbWF5LWJlLW92ZXItbW9yZ2FuLXN0YW5sZXktd2VhbHRoLW1hbmFnZW1lbnQv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xOS90aGUtY3J5cHRvLXdpbnRlci1tYXktYmUtb3Zlci1tb3JnYW4tc3RhbmxleS13ZWFsdGgtbWFuYWdlbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "The Crypto Winter May Be Over: Morgan Stanley Wealth Management - CoinDesk",
        "content": "Most of bitcoin’s gains come directly after the halving, Galindo wrote, and this “bull-run period starts with the halving event and ends once the price of bitcoin hits its prior peak.” Roughly every four years the reward for successfully mining a bitcoin block is cut in half, an event known as the halving, and this reduces inflationary pressure on BTC."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvd2h5LWlzLXhycC1vbi1maXJlLXRvZGF5LW91dHNoaW5pbmctYml0Y29pbi1ldGhlcmV1bS1hbmQtZG9nZWNvaW4tZ2FpbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Why Is XRP On Fire Today, Outshining Bitcoin, Ethereum, And Dogecoin Gains? - Nasdaq",
        "content": "Ripple Labs’ creation XRP (CRYPTO: XRP), has exhibited a surge of 7% in the past 24 hours, outpacing other prominent cryptocurrencies such as Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH), and Dogecoin (CRYPTO: DOGE).\n\nWhat Happened: As of the latest data, XRP was trading at $0.51, while BTC, ETH, and DOGE saw comparatively modest gains of 2.18%, 2.01%, and 0.18%, respectively, over the same 24-hour period.\n\nThis notable rise in XRP’s value can be attributed to a significant development in the ongoing legal battle between Ripple and the Securities and Exchange Commission (SEC). The SEC has decided to no longer pursue claims against Ripple’s CEO, Brad Garlinghouse, and its Executive Chairman, Chris Larsen.\n\nThis development has led to the cancellation of a trial that was scheduled for the coming year, marking another favorable outcome for Ripple in the SEC’s lengthy legal battle against the company. However, the SEC still intends to pursue its claims against Ripple itself.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: The agreement reached between the parties involves the voluntary dismissal of the aiding and abetting charges against Garlinghouse and Larsen, with prejudice, meaning that these charges cannot be reinstated. The SEC will continue to pursue its claims against Ripple.\n\nGarlinghouse said, “For nearly three years, Chris and I have been the subject of baseless allegations from a rogue regulator with a political agenda. Instead of looking for the criminals stealing customer funds on offshore exchanges that were courting political favor, the SEC went after the good guys.”\n\nThis development follows a partial victory secured by Ripple in July when a judge ruled that the company had not violated federal securities laws by making XRP available to retail investors through exchanges. However, the judge also found that the company had violated federal securities law by directly selling XRP to institutional investors.\n\nPrice Action: At the time of writing, BTC was trading at $28,810.35, up 2.18% in the last 24 hours, according to Benzinga Pro.\n\nPhoto Courtesy: Diamond Visuals On Shutterstock.com\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saWdodG5pbmctbGFicy1yZWxlYXNlcy10YXByb290LWFzc2V0cy1hbHBoYS1icmluZ2luZy1zdGFibGVjb2lucy10by1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Lightning Labs releases Taproot Assets alpha, bringing stablecoins to Bitcoin - Cointelegraph",
        "content": "Bitcoin layer-2 infrastructure firm Lightning Labs has released the mainnet alpha of Taproot Assets, a protocol aimed at enabling stablecoins and real-world assets to be issued on the Bitcoin and Lightning Network.\n\nThe current version, Taproot Assets v0.3, will provide a “feature-complete developer experience” to issue, manage and explore stablecoins and other assets on the Bitcoin blockchain, according to Ryan Gentry, head of business development at Lightning Labs.\n\n“We believe this new era for Bitcoin will see a myriad of global currencies issued as Taproot Assets, and the world's foreign exchange transactions settled instantly over the Lightning Network.”\n\n“With this release, developers can issue financial assets on-chain in a scalable manner,” Lightning Labs stated on Oct. 18 in a separate post. “Today marks a new era of multi-asset bitcoin.”\n\nAnnouncing the first mainnet release of Taproot Assets , a protocol for assets on #bitcoin and Lightning.\n\n\n\nWith this release, developers can issue financial assets on-chain in a scalable manner.\n\n\n\nToday marks a new era of multi-asset bitcoin. https://t.co/2cNvZSvv8v — Lightning Labs⚡️ (@lightning) October 18, 2023\n\nThis version of Taproot Assets will work by routing through existing Bitcoin (BTC) liquidity on the Lightning Network.\n\nGentry says the integration will extend Bitcoin’s network effects and move it one step closer toward “bitcoinizing the dollar.” He added:\n\n“This is how we make bitcoin the global routing network for the internet of money. This is how we bitcoinize the dollar and the world’s financial assets.”\n\nGentry described developer demand for stablecoin applications on Bitcoin as “overwhelming,” particularly given that some stablecoin issuers hold more United States Treasurys than the likes of Germany and South Korea.\n\n“[It] signifies the importance of these assets globally, and gives a sense of scale for the global user demand,” Gentry added.\n\nRelated: BitVM wasn’t created to make Bitcoin a pseudo-Ethereum, says developer\n\nNearly 2,000 Taproot Assets were minted on testnets over the last several months in the lead-up to the mainnet alpha launch, according to Gentry.\n\nAlpha launches typically mean the development isn’t in its final state. Lightning Labs said the alpha tag indicates that they expect the community to test it for potential bugs.\n\nBitcoin Drivechains (through Bitcoin Improvement Proposal-300), Botanix Labs’ Spiderchain and the BitVM are among the other developments in the Bitcoin ecosystem looking to expand Bitcoin’s capabilities.\n\nMagazine: Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzE5L3RoaXMtMS1iaXRjb2luLW1pbmluZy1zdG9jay1ub2JvZHktaXMtdGFsa2luZy1hYm91L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "This 1 Bitcoin Mining Stock Nobody Is Talking About Is Up 340% for the Year - The Motley Fool",
        "content": "Throughout 2023, Bitcoin mining stocks have been on a roll. Marathon Digital Holdings is up a remarkable 130% year to date. Riot Platforms is up an even more impressive 160%. No surprise here, but these two Bitcoin mining stocks are getting all the attention from investors right now.\n\nBut what if I told you that the best-performing Bitcoin mining stock this year was not Riot Platforms or Marathon Digital? Instead, it's Cipher Mining (CIFR -7.66%), which has skyrocketed in value by about 370% this year. Due to its relatively small size, Cipher Mining has flown under the radar of many investors. But should it be on yours heading into 2024?\n\nA new investment thesis for Bitcoin mining stocks\n\nGiven that Bitcoin miners are most profitable when the price of Bitcoin is increasing, it's obvious why mining stocks are performing so well. Bitcoin is up about 70% this year, and that means the mantra for Bitcoin mining stocks in 2023 has been \"bigger is better.\" The more mining facilities you have, the more mining rigs you have deployed, and the more Bitcoin you are able to mine, the better it typically is for your bottom line. When Bitcoin miners report monthly operational updates, the focus is almost exclusively on how much Bitcoin they've been able to mine.\n\nHowever, this investment thesis for Bitcoin mining stocks could be starting to change. The next Bitcoin halving is scheduled for April 2024, and that landmark event is going to change what it means to be successful in the Bitcoin mining industry. In a halving event, the reward for mining a new block of Bitcoin falls by one-half. In other words, unless the price of Bitcoin rises or costs drop dramatically, Bitcoin miners are going to be making half as much money next year as they did this year.\n\nAs a result, the emphasis is most likely going to shift to operational efficiency. The goal will be to become a low-cost producer. Analysts are already starting to warn that only the most efficient Bitcoin miners are going to survive. CNBC has called the halving an \"extinction-level event\" for the Bitcoin mining industry. It is quite likely that only the most operationally efficient miners with the lowest cost structures are going to make it. Everyone else is doomed to become a dinosaur.\n\nSize vs. efficiency\n\nAnd this is what makes Cipher Mining potentially attractive. In its latest research note for the Bitcoin mining industry, JPMorgan specifically pointed out that Cipher Mining has the lowest power costs in the industry. While JPMorgan put out underweight ratings for both Riot Platforms and Marathon Digital, it put out a neutral rating for Cipher Mining. The one knock against Cipher Mining was that it is \"growth-constrained.\"\n\nTranslation: Cipher Mining is small. While Riot Platforms and Marathon Digital have market capitalizations of roughly $1.6 billion, Cipher Mining has a total market cap of less than $700 million. According to its latest operational report from September 2023, Cipher Mining has just 70,000 deployed mining rigs. By way of comparison, Riot Platforms has nearly 100,000 deployed mining rigs. Thus, it's easy to see why Cipher Mining has been overlooked in 2023. It simply can't produce as much Bitcoin as its larger rivals.\n\nInvest in Bitcoin or Bitcoin miners?\n\nThe big question, of course, is what's going to happen in 2024. From my perspective, the Bitcoin halving is going to exert greater and greater pressure on Bitcoin miners to become as efficient as possible. The goal will be to produce Bitcoin at the lowest possible price. This is almost definitely bad news for Marathon Digital, which has the highest energy costs in the industry. But it could provide an opening for smaller, more nimble Bitcoin miners such as Cipher Mining.\n\nHowever, given that investing in Bitcoin mining stocks is really just a leveraged bet on the future price of Bitcoin, one strategy might be to invest directly in Bitcoin. Yes, you are going to sacrifice some potential upside, but you also won't have to worry about picking winners in a highly competitive industry or trying to time each new Bitcoin cycle.\n\nIt really depends on your investment time horizon. If you are looking to maximize gains over a short- to medium-term time horizon, Bitcoin mining stocks could continue to outperform Bitcoin. But if you are a long-term investor, it might be easier and more profitable simply to invest in Bitcoin."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXNsYS1lYXJuaW5ncy1iaXRjb2luLWhvbGRpbmdzLWludmVzdG1lbnQtYWktZWxvbi1tdXNr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Tesla earnings: Bitcoin bags untouched as firm splashes out on AI - Cointelegraph",
        "content": "Electric vehicle maker Tesla made no changes to its sizeable Bitcoin (BTC) holdings for the fifth quarter in a row. However, it has directed more funds to double its computing capacity amid artificial intelligence (AI) efforts.\n\nTesla’s Q3 2023 results released on Oct. 18 show as of Sept. 30, it held $184 million worth of digital assets — a portion of the $1.5 billion worth of Bitcoin it first bought in March 2021.\n\nThe latest quarterly results mean it hadn’t bought or sold any Bitcoin since its sell-off of around 75% of its holdings in Q2 2022 when it fetched $936 million for more than 30,000 BTC.\n\nExcerpt of Tesla’s Q3 2023 balance sheet with its digital asset holdings highlighted. Source: Tesla\n\nOn the other hand, Tesla reported it had “more than doubled the size” of its computing power for its AI projects, citing a growing training data set and switching the training of its humanoid robot Optimus to AI rather than coded software.\n\n“We have commissioned one of the world’s largest supercomputers to accelerate the pace of our AI development, with compute capacity more than doubling compared to Q2.”\n\nTesla saw its third-quarter earnings and profits miss Wall Street estimates, with reported total revenues of $23.35 billion. While this was up by nearly 9% from the prior-year period, it missed Zacks Investment Research’s estimate of $24.38 billion.\n\nIt also missed projected profits, with reported earnings per share (EPS) of $0.66 compared to Zack’s $0.72 EPS estimate.\n\nTotal third-quarter operating expenses came in at $2.41 billion, marking more than a 13% increase from last quarter and over a 42.5% increase from the prior year.\n\nRelated: Bitcoin clean energy usage reportedly exceeds 50% — Will Tesla start accepting BTC payments?\n\nTesla’s research and development expenses were $1.16 billion in the quarter, a 58% jump from last year. It attributed the increases to its “Cybertruck, AI and other R&D projects.”\n\nTesla shares continued to fall after the bell to a low of $230.19. Source: Google Finance\n\nTesla shares were down nearly 4.8% on the day, closing at $242.68 and fell a further 4.25% in after-hours trading to $232.37 per Google Finance data.\n\nMagazine: NFT Collector: Creative AI art, Tomorrowland sells tomorrow’s future"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1jb3VsZC1saWZ0LXRoaXMtY3J5cHRvLXN0b2NrLWZ1bmQv0gFpaHR0cHM6Ly93d3cuZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFsLWNvdWxkLWxpZnQtdGhpcy1jcnlwdG8tc3RvY2stZnVuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Approval Could Lift This Crypto Stock Fund - ETF Trends",
        "content": "The Securities and Exchange Commission (SEC) recently decided not to appeal a court ruling in favor of Grayscale Investments. And now, speculation is mounting in the cryptocurrency and broader investment communities that approval of spot bitcoin ETFs in the U.S. is imminent.\n\nSome crypto experts believe the SEC could finally relent and green-light such ETFs before the end of this year. While there’s debate among crypto market observers about the extent to which a spot bitcoin ETF will lift prices of the largest digital currency, there’s no arguing that prices are already rallying and more upside could benefit assets such as the Invesco Alerian Galaxy Crypto Economy ETF (SATO) .\n\nSATO, which tracks the Alerian Galaxy Global Cryptocurrency-Focused Blockchain Equity, Trusts, and ETPs Index, doesn’t directly hold bitcoin or any other cryptocurrency for that matter. But it is among the equity-based ETFs correlated to bitcoin price movements. That status could make SATO a beneficiary of spot bitcoin ETF approval.\n\nSATO Ready for Primetime\n\nSATO turned two years old earlier this month and its time on the market has been eventful. The ETF’s primary industry exposure is crypto miners. This group came under considerable duress during the crypto winter of 2022. That bad news is in the rearview mirror. If the SEC approves spot bitcoin ETFs, SATO could be primed for better things. And some experts believe it’s just a matter of time.\n\n“It’s going to get approved… We think it happens this year in 2023,” said Galaxy Digital CEO Mike Novogratz in an interview with CNBC on Wednesday. “All the indications of dealing seem to be heading in the right direction.”\n\nNovogratz, who is one of the biggest names in crypto investing, noted that Grayscale’s recent court victory could be a positive sign for spot bitcoin ETF approval.\n\n“The judge said, ‘What are you talking about SEC? You have a futures ETF and you’re saying you can’t have a cash ETF. That makes intellectually zero sense.’ And I think that put the SEC on the back foot,” Novogratz told CNBC.\n\nWhile approval of spot bitcoin ETFs would be a clear catalyst for SATO, the Invesco ETF has other avenues through which it could generate upside. For example, roughly 64% of the ETF’s 37 holdings are classified as small-cap stocks. Currently, the valuation gap between large- and small-cap equities is at a 20-year high. If that chasm narrows, small-cap equities could benefit.\n\nvettafi.com is owned by VettaFi LLC (“VettaFi”). VettaFi is the index provider for SATO, for which it receives an index licensing fee. However, SATO is not issued, sponsored, endorsed, or sold by VettaFi, and VettaFi has no obligation or liability in connection with the issuance, administration, marketing, or trading of SATO."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtMi1tb250aC1oaWdoLWJpdGNvaW4tYnJlYWstMzJr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "BTC price hits 2-month high amid bet Bitcoin will break $32K 'soon' - Cointelegraph",
        "content": "Bitcoin (BTC) tapped $30,000 into the Oct. 20 Wall Street open as analysts directed attention to the weekly close.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price sets up weekly close showdown\n\nData from Cointelegraph Markets Pro and TradingView captured new two-month BTC price highs of $30,233 on Bitstamp.\n\nThe pair showed continued strength during the Asia trading session, with a slight comedown taking place at the time of writing, taking the spot price back below $29,500.\n\nWith volatility still evident, market participants argued that a weekly candle close was needed in order to establish the rally’s true staying power.\n\nFor Keith Alan, co-founder of monitoring resource Material Indicators, the 100-week moving average (MA) at $28,627 was of particular importance.\n\n“This move is one to watch, but what I’m watching for right now is to see if this Weekly candle closes above the 100-Week MA and if next week’s candle can stay above it with no wicks below,” he wrote in part of an X post on the day.\n\n“Some might consider that a confirmation of a bull breakout, but this market is known for squeezes and fake outs so I’m looking for more confirmations. For me BTC will also need to take out prior resistance at $30.5k, $31.5k and ultimately $33k to call a bull breakout confirmed and validated.”\n\nBTC/USD 1-week chart with 100MA. Source: TradingView\n\nEyeing required support zones, popular trader Pentoshi flagged $28,900 as the line in the sand for bulls to hold.\n\n$BTC update\n\n\n\nWould like to see shallow dips and now price maintain above 28.9-29.2k area https://t.co/12UUsbRRSq pic.twitter.com/Mq01tU4B7T — Pentoshi euroPeng (@Pentosh1) October 20, 2023\n\nTracking low-timeframe (LTF) market conditions, meanwhile, fellow trader Skew suggested that a sweep of late longs could result in an entry opportunity prior to upside resuming.\n\n“I suspect longs are starting to fomo in here around $30K,” he told X subscribers alongside a chart of exchange order book data as $30,000 reappeared.\n\n“So if this LTF trend breaks a nice sweep could be a nice entry before higher wouldn't be surprised to see something like this play out.”\n\nBTC/USD order book data. Source: Skew/X\n\nForecast expects “mass adoption,” Bitcoin ETF approval\n\nIn an optimistic longer-timeframe view, trading team Stockmoney Lizards predicted that resistance immediately above $30,000 would soon crack.\n\nRelated: Hodling hard: Bitcoin’s long-term investors own over 76% of all BTC for the first time\n\nUpdating a chart fractal comparing BTC/USD in 2023 to its 2020 breakout, analysts argued that the time for significant upside is now. An approval of the United States’ first Bitcoin spot price exchange-traded fund (ETF) would form the clinching factor.\n\n“31/32k will break soon,” part of accompanying commentary read.\n\n“P.S.: Many of you will once more say: ‘But 2020 was after halving, here we are before’ — answer: doesn't matter. This year mass adoption / ETF approval will be THE driver.”\n\nStockmoney Lizards referenced the upcoming block subsidy halving scheduled for April 2024.\n\nBTC/USD comparative chart. Source: Stockmoney Lizards/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmxlZGdlci5jb20vYmxvZy80LXdheXMtdG8taW1wbGVtZW50LWJpdGNvaW4tZ292ZXJuYW5jZS1zdHJhdGVnaWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "4 Ways To Implement Bitcoin Governance Strategies - Ledger",
        "content": "\n\nThings to know:\n\n\n\n– Your Ledger devices are extremely useful for letting users self-custody their Bitcoin. But what if you’re an organization, or a financial institution?\n\n\n\n– Multiple solutions exist to implement Bitcoin Governance with complex rules. Among them are Miniscript, Multi-Party Computation (MPC), as well as MuSig2 and FROST. Our Ledger devices already support Miniscript, and I’m glad to announce that we will support MuSig2 in the coming months.\n\n\n\n– We have also developed the Ledger Vault to empower organizations and financial institutions to efficiently manage Bitcoin and other crypto assets.\n\n\n\n– This solution leverages Hardware Security Modules (HSMs) and Personal Security Devices (PSDs). We have loaded the Ledger Operating System with its security property, isolation, and cryptographic implementation on the secure hardware and a governance framework.\n\n\n\n\n\nWhen a friend introduced me to the Bitcoin whitepaper in 2011, I decided to study this protocol’s cryptography, technology, double-spending problem, and decentralized consensus. I returned to my friend and told him: “Your Bitcoin thing is pretty interesting, but frankly, I don’t understand the use case!” When I joined Ledger in 2017, he made fun of me: “Do you finally get it?” he said. Yes, I finally got it.\n\nBitcoin is revolutionary because it brings something unprecedented: “Permissionless Money”. With Bitcoin, you don’t need to ask anyone to own and spend your digital value. No state, bank, or third-party can ever interfere with the value you hold and transact. With Bitcoin, you possess a piece of the Internet with complete self-sovereignty and freedom.\n\nTwo properties enabling permissionlessness: “decentralized consensus” & “self-custody”\n\nThe first property that contributes to Bitcoin’s permissionless nature is known as “decentralized consensus”. With Bitcoin, you have decentralized pools of miners that are incentivized to secure the network and prevent censorship over the execution of transactions. Simply put, when you want to make a transaction, no one can prevent you from making it.\n\nThe second property is self-custody. With self-custody, you own your value, and no one can prevent you from owning it, which allows you to control your crypto-assets fully. In order to own Bitcoin, you simply have to generate a public (which is essentially your address) and a private key (your key to prove ownership over your assets). If you lose your private key, you lose your assets, and if an attacker accesses your private key, he will be able to make a transaction… and there’s nothing you can do to revert it.\n\nThis need to protect your private keys from hackers is why we’ve built our Ledger Nano devices. This hardware embeds a secure element, where your secrets are generated within the enclave, and the cryptography is implemented within it so that your secrets don’t have to leave the enclave. Your device also features a trusted display, allowing you to understand the transaction you are about to consent to signing.\n\nAll of the elements I’ve explained above are pretty simple, but mostly apply to individuals. What does it mean when you are a group of people, an organization, or a financial institution?\n\nLeveraging Bitcoin at the institutional level\n\nYou may not want to store your assets on a Ledger Nano when you are an exchange (some did it at the expense of their customers, including FTX and QuadrigaCX). These devices are perfectly secure; you could keep billions on them, but you want to avoid the operational risk of having a single person from your organization fully controlling all the customers’ funds.\n\nWho has access to the coin if organization X decides to buy $100 Million worth of bitcoin? Who can rule whether they use it this way or that way? These are crucial questions, so let’s consider what kind of governance we can have over Bitcoin.\n\nThe initial and onchain option: MultiSig on Bitcoin\n\nIt used to be Partially Signed Bitcoin Transactions (PSBT). This is not very well known, but you have a scripting language called Script on Bitcoin. With this scripting language, you can define an account with different rules enforced on-chain. So, you can create a rule saying: ‘I can spend X amount of Bitcoin when I have these signatures.’ Then, the blockchain verifies that these free signatures happen.\n\nScript is great, but the Script language can be cumbersome to verify. That’s why Miniscript was created in 2019. Miniscript is a language for representing Bitcoin Scripts in a structured way, enabling efficient analysis, composition, generic signing, and more. For instance, “Alice can spend (main path), or a 3-of-3 of Bob, Carol, and Dave can spend, but after three months, two signatures are enough (secondary spending path).”\n\nOur hardware wallet devices have supported both PSBT and Miniscript on SegWit for over a year and Miniscript on Taproot will be supported in the next release. You can leverage all the security properties of Ledger devices and an onchain governance over Bitcoin accounts. You can even leverage miniscript with Ledger in order to further minimize trust.\n\nMulti-Party Computation (MPC) solutions\n\nMPC stands for secure Multi-Party Computation. That’s a wide field of cryptography that consists in doing computation in a distributed manner, such as, for example, jointly computing signatures. In particular, in a t-of-n threshold signature scheme, the signing key is distributed in n shares and a subset of t shares is required to compute a valid signature (where typically n=3 and t=2). From a blockchain standpoint, the resulting signature looks like a standard “single-party” signature.\n\nIt’s pretty elegant, but there are a few drawbacks to the currently implemented solutions.\n\nThe first drawback is address management. Existing threshold signature schemes are not compatible with BIP32, meaning it is not possible to have HD (hierarchical deterministic) wallets as with a standard seed. Additionally, due to the specific nature of MPC-based wallet, recovering your wallet on a standard BIP39 wallet could be impossible, which is a limitation to self sovereignty.\n\nThe second drawback is that current secure hardware does not support MPC today. That means that the cryptography of MPC protocols must be implemented in software, which is not a good practice. I often hear some dismissive marketing saying that as it’s MPC, there is no secret. This is not true. You still have secret key shards, and you need to secure them.\n\nThe third drawback is that currently available MPC protocols rely on ECDSA, the original signature scheme used in Bitcoin, resulting in complex and hard to implement schemes, as testified by the multiple vulnerabilities found in existing MPC wallets.\n\nMuSig2 and FROST\n\nThe good news is: Schnorr signatures have been standardized on Bitcoin around three years ago with the Taproot upgrade. The Schnorr signature scheme is really better than ECDSA for various reasons. First, it has better security guarantees than ECDSA which is not provably secure, and second, its algebraic structure is much simpler than ECDSA, which means that MPC protocols for Schnorr are much easier to design.\n\nIt’s been standardized on Bitcoin with these two papers. The first one is MuSig2, allowing multi-signature (i.e., n-of-n threshold signatures), and the second one is FROST, enabling you to do arbitrary t-of-n threshold signatures.\n\nAt Ledger, we are already supporting Schnorr on our devices and working on supporting MuSig2, allowing multi-signatures on-chain on Bitcoin, in the coming months.\n\nLedger Enterprise for Tailored Institutional Governance\n\nWhile perhaps not as widely well known as Ledger’s retail solutions, we have developed a suite of products designed to empower enterprises, organizations, and financial institutions in the secure and efficient management of digital assets at scale. This innovative solution leverages Ledger’s robust technology and secure hardware along with a flexible governance framework on top of it.\n\nThe solution is called Ledger Vault. It leverages Hardware Security Modules (HSMs) and Personal Security Devices (PSDs). We have loaded the Ledger Operating System with its security property, isolation, and cryptographic implementation on the secure hardware, and on top of this, a governance framework.\n\nWith Ledger Vault, you can achieve the same level of security and self-custody as Ledger Nanos, but with the valuable addition of a governance layer allowing corporations to establish various organizational roles, including shared owners, administrators, and operators.\n\nDepending on these roles, you can define rules and policies to regulate access and transactions. For example, it permits you to grant a specific group access to a set of accounts and restrict them to transactions to particular addresses. If a group intends to execute a transaction exceeding a certain threshold, it requires the consensus of three out of five approvals.\n\nThe governance can also be based on KYC/AML checks and connected to other actors like exchanges through our product TRADELINK, further enhancing its adaptability and compliance capabilities.\n\nLedger Vault offers this high level of flexibility within a secure framework, and is specifically designed to cater to the self-custody governance needs of institutional users. Its universality across different blockchains makes it a standout solution in the digital asset management space, ensuring it meets the diverse needs of users across the blockchain ecosystem.\n\nClosing Thoughts\n\nAs I’ve outlined above, Bitcoin is game-changing because it brings permissionless money, something enabled by two key concepts: decentralized consensus and self-custody. Self-custody is more complex when it comes to organizations, and my conviction is that self-custody is fully compatible with companies if you have some predetermined levels of governance over the tokens.\n\nThen, you have different possibilities. Some are on-chain, others are off-chain, but you can also consider a mix of them. At Ledger, we are supporting PSBT and Miniscript on Ledger Nano devices. We are also working on implementing MuSig2, which is coming soon. For enterprise organizations, we are offering Ledger Vault, provided by Ledger Enterprise.\n\nWhen you set up these solutions, you need to strongly consider governance frameworks. Governance includes who can access and who can spend the digital assets. It’s also about determining thresholds, maintaining whitelists, etc. Then you also have to think about security: where the essential materials are stored, how they are secured, how the cryptography is implemented. You must also strongly consider control, which means: who has access to the shards? This becomes particularly critical in a multisig setup that depends on a third party you don’t particularly trust. Finally, backup and interoperability are essential aspects. Having a backup and testing it is something you need to consider. Interoperability is significant, too. If your provider disappears, you need to keep control over your wallet."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yZWdhaW5zLTI5MDAwLWV0aGVyZXVtLWJlbG93LTE2MDAtc29sYW5hLXN1cmdlcy05LTQwMjcxMi0yMDIzLTEwLTIw0gGSAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yZWdhaW5zLTI5MDAwLWV0aGVyZXVtLWJlbG93LTE2MDAtc29sYW5hLXN1cmdlcy05LTQwMjcxMi0yMDIzLTEwLTIw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin regains $29,000; Ethereum below $1,600; Solana surges 9% - Business Today",
        "content": "Bitcoin and other crypto tokens posted better-than-modest gains on Friday after the US Fed chair's commentary last evening, which pushed the treasury yields higher. However, The state of New York has filed a lawsuit against Digital Currency Group, and its subsidiary Genesis Global Capital along iwht crypto exchange Gemini alleging fraud to the tune of more than $1 billion.\n\n\n\nAfter a short-lived profit booking, Bitcoin was back in green on Friday as the last crypto token surged more than 3 per cent to regain the 29,000-levels. However, its largest peer, Ethereum, also rose more than 2 per cent but remained below $1,600-level. Majority of altcoins were trading higher in the early morning.\n\n\n\nThe crypto market narrative is seemingly shifting more towards the increasing Bitcoin dominance. As Ethereum continues to fall against Bitcoin, other layer 2s have also been underperforming, said Shubham Hudda, Senior Manager at CoinSwitch Markets Desk. Social media company Reddit announced to wind down its internet points feature citing scalability issues, he said.\n\n\n\n\"India has been making moves in the blockchain technology space as HPCL has partnered with blockchain software firm Zupple Labs to use its service LegitDocs in helping in the automatic verification of its purchase orders (POs). After working on this for the last 6 months, HPCL seems to have now completed this integration,\" Hudda added.\n\n\n\nBarring the US dollar pegged Tether as only an exception, the majority of top crypto tokens were trading with big gains on Friday. Solana rallied about 9 per cent, while XRP gained about 7 per cent. Toncoin rose 6 per cent, while Bitcoin Cash was up 5 per cent. Litecoin added 4 per cent during the early trade.\n\n\n\nThe global cryptocurrency market cap was trading sharply higher, rising up $1.11 trillion-mark, as it surged about 3 per cent in the last 24 hours. However, the total trading volumes rose about 7 per cent to $42.60 billion.\n\n\n\nBitcoin has surpassed the $28,600 mark in response to the US Federal Chair Jerome Powell's announcement that the Federal Reserve is likely to maintain current interest rates in November, with a potential increase in December. This coincides with a 6-basis point jump in the 10-year US Treasury yield, said Edul Patel, Co-founder and CEO at Mudrex.\n\n\n\n\"There is a bullish sentiment in the market, as displayed by Bitcoin growing over 8% in the past week. Meanwhile, Ripple's price has surged by over 7 per cent in the last 24 hours following the US SEC's decision to drop charges against Ripple Labs' CEO Brad Garlinghouse and Chairman Chris Larsen,\" he said.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by Giottus Crypto Platform:\n\nMaker (MKR)is currently facing difficulty in breathing its resistance levels.MKR is witnessing mixed price action, after recording short-term losses earlier this month. The asset, trading at $1,420,is holding steady in a horizontal channel and is expected to continue in the near term.\n\n\n\nImage: Chart-Make\n\n\n\nIt is facing immediate resistance at $1,490 and if the price successfully surpasses this level, it could potentially lead to the next resistance at $1,585. Its50-day moving average is currently at $1,315 and MKR is holding well above this level. The asset has shown marginal signs of recovery in the last couple of days, with its RSI slope showing signs of recovery indicating an uptick in buying pressure.\n\n\n\nMajor Levels:\n\nSupport: $1,335, $1,265\n\nResistance: $1,490, $1,585\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGVjcnlwdC5jby8yMDI1NTQvd2Vlay1pbi1jb2lucy1zb2xhbmEtYml0Y29pbi14cnAtcmlwcGxl0gFHaHR0cHM6Ly9kZWNyeXB0LmNvLzIwMjU1NC93ZWVrLWluLWNvaW5zLXNvbGFuYS1iaXRjb2luLXhycC1yaXBwbGU_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "This Week in Coins: Solana Explodes 25%, Bitcoin Reclaims $30K on ETF Hopes and Ripple Wins - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt was a good week for holders of virtually all leading cryptocurrencies, including Bitcoin, Solana, and XRP.\n\nAfter many weeks of inertia and slow movement, Bitcoin (BTC) finally rebounded with some bullish price action, adding 10% over the last seven days to change hands at $29,523 as of this writing. The rest of the market rebounded with it.\n\nBitcoin’s rally began on Monday, following last Friday’s news that the U.S. Securities and Exchange Commission would not be appealing a court verdict that labeled the regulator’s rejection of crypto asset manager Grayscale’s ETF application “arbitrary and capricious.”\n\nAD\n\nAD\n\nThe world’s favorite cryptocurrency also received another boost—of around 10%—on Monday when Cointelegraph tweeted fake news that Wall Street titan Blackrock had been approved to launch a U.S. Bitcoin spot ETF.\n\nBlackRock CEO Larry Fink responded to the price pump that day, saying during an appearance on FOX Business: “It’s just an example of the pent-up interest in crypto. I think the rally today is about a flight to quality.” A marked change of tune from 2017 when Fink called Bitcoin an “index of money laundering.”\n\nLater in the week, BlackRock submitted an amended prospectus for its ETF application. Changes to its filing include acknowledgment of competition in the race for ETF approval and detailed explanations on the product’s pricing and reporting mechanisms. On a related note, a report released by JP Morgan that day (Wednesday) called it “most likely” that a spot Bitcoin ETF could get approved before January 10.\n\nBy Friday, the news had pushed Bitcoin’s price to briefly reclaim $30k, a level not seen since summer, according to CoinGecko.\n\nThe wider market: Solana, Ethereum, and Bitcoin Cash\n\nWhile Bitcoin generally acts as the industry’s pace-setter (typically when BTC rises, other coins and tokens rise with it), this week, the market leader’s gains were far outpaced by some of its rivals.\n\nAD\n\nAD\n\nClosest contender Ethereum (ETH) didn’t manage to catch up with it this week. Ethereum rose 3.4% to enter the weekend trading at $1.602.\n\nRipple’s XRP blew up this week, but not quite as much as Bitcoin. XRP grew 6.7% to $0.515669 off the back of news that the SEC had voluntarily dismissed charges against Ripple execs, CEO Brad Garlinghouse and Executive Chairman Chris Larsen. The SEC sued them alongside the company in December 2020 for allegedly violating securities laws with sales of XRP.\n\nThe biggest rallies this week came from two altcoins: Solana (SOL) and Bitcoin Cash (BCH). Bitcoin Cash blew up 11.6% and currently trades at $239.40, while Solana mushroomed a staggering 25% to hit $26.89 at the time of writing.\n\nSOL’s impressive rally appears to have been spurred by news that the FTX estate has decided to stake roughly $122 million in Solana held in the bankrupt exchange's crypto wallets rather than liquidate it.\n\nFinally, there were no significant losses among the top thirty cryptocurrencies by market capitalization. The only red candle this week was from Cosmos Hub’s ATOM, which fell 3.8% to $6.36.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLTMway14cnAtcHJpY2UtcmlwcGxlLWxlZ2FsLXZpY3RvcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin eyes $30K, XRP price jumps 6% after Ripple's legal victory - Cointelegraph",
        "content": "Bitcoin (BTC) passed $29,500 on Oct. 20 after an eventful 24 hours boosted BTC price trajectory, while XRP’s (XRP) price jumped above $0.50 in response to Ripple’s big legal win.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nHawkish Fed’s Powell fails to dent BTC price\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it edged closer to two-month highs from the start of the week.\n\nThe largest cryptocurrency appeared to feed off events surrounding a speech from Jerome Powell, chair of the United States Federal Reserve, the day prior.\n\nAmid a U.S. bond rout, Powell was under pressure to deliver appropriate wording, and analysis even predicted a “very dovish” tone would dominate. In the event, the speech, which was briefly interrupted by protesters, saw Powell as highly conservative on the outlook.\n\n“The stance of policy is restrictive, meaning that tight policy is putting downward pressure on economic activity and inflation,” he said about interest rate hikes.\n\n“Given the fast pace of the tightening, there may still be meaningful tightening in the pipeline.”\n\nPowell said that the Fed acknowledged the potential problems of hiking rates too far.\n\n“Doing too little could allow above-target inflation to become entrenched and ultimately require monetary policy to wring more persistent inflation from the economy at a high cost to employment. Doing too much could also do unnecessary harm to the economy,” he continued.\n\n“Given the uncertainties and risks, and how far we have come, the Committee is proceeding carefully.”\n\nData from CME Group’s FedWatch Tool showed changing tides among market expectations when it comes to future rate decisions.\n\nAt its next meeting on Nov. 1, the Federal Open Market Committee (FOMC) is now unanimously thought to hold rates at their current levels, per data from CME Group’s FedWatch Tool. Before Powell, the odds stood at 88%.\n\nFed target rate probabilities chart. Source: CME Group\n\nFollowing the speech, news broke that U.S. regulators had dropped criminal charges against executives of blockchain firm Ripple.\n\nXRP’s price responded immediately, trading up over 6% in 24 hours at the time of writing.\n\nXRP/USD 1-hour chart. Source: TradingView\n\nTrader suggests Bitcoin “impulse” is here\n\nAmid a backdrop of increasing anticipation over the approval of a U.S. Bitcoin spot price exchange-traded fund (ETF), Bitcoin gained momentum overnight.\n\nRelated: Bitcoin metrics ‘improve bullish odds’ as BTC price holds 200-week trendline\n\nAt the time of writing, the day’s highs stood at $29,689 — just $200 from the top of a snap volatility wick seen on Oct. 17.\n\n$BTC has launched.\n\n\n\nKeeping it as simple as it can get:\n\n\n\nThe same way 26.8k was the origin of our last impulse, 28.6k is now the origin of the current one. Above that, we are going A LOT higher, FAST.\n\n\n\nDrop below 28.6k and the local uptrend will be violated and we may get a bit… https://t.co/odakQpZbTL pic.twitter.com/CbhLBo133G — CrediBULL Crypto (@CredibleCrypto) October 20, 2023\n\n“Bitcoin filling the wick, slowly but surely. Let’s go for that $30k tap,” popular trader Jelle wrote in part of an X analysis on the day, having previously argued that Bitcoin looked “eager to fill” the Oct. 17 wick.\n\n“Today it’s going a very interesting day for trading... They have hit exactly $29400 where there were many liquidations,” fellow trader CrypNuevo continued.\n\nIn various X posts, CrypNuevo uploaded liquidation data from the past days, warning that long positions outnumbered shorts four to one. Bitcoin, he suggested, could retrace during the U.S. trading session.\n\n$BTC\n\n\n\nLiquidation levels and liquidation heatmaps.\n\n\n\nQuick thoughts:\n\n- All our liquidation levels to the upside from yesterday have been hit.\n\n- Delta long liquidations at $15B (mid-high amount and enough to consider a retrace is coming soon).\n\n- Current long-short open positions… pic.twitter.com/dAqbRbaimc — CrypNuevo (@CrypNuevo) October 20, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJhc2VkLWFpLWxhbmd1YWdlLW1vZGVsLWFpbXMtdG8tZHJpdmUtZWR1Y2F0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin-centric AI language model aims to drive BTC education and adoption - Cointelegraph",
        "content": "“It’s good at answering Bitcoin- and economics-related questions — at least better than GPT-4,” Aleksandar Svetski told Cointelegraph at a bustling Bitcoin Amsterdam.\n\nThe entrepreneur, author and founder of Spirit of Satoshi, a novel artificial intelligence (AI) large language model (LLM), begins to unpack the arduous journey his small startup has undertaken to create its Bitcoin-centric AI chatbot.\n\nThe model is the result of a time-consuming training process to generate responses based on reputable Bitcoin resources, the Austrian school of economics and libertarian ideals. Still in its infancy, Spirit of Satoshi reflects ideals from a “well-curated Bitcoin corpus,” including resources such as Saifedean Ammous’ best-seller The Bitcoin Standard.\n\nSpirit of Satoshi’s dashboard is reminiscent of ChatGPT, while its outputs invoke a Bitcoin-centric theme. Source: Spirit of Satoshi\n\nSvetski explained that the major difficulty in building the model was not just curating relevant sources of information from books, research papers and podcasts but also guiding the model to generate responses through an exhaustive training process. He added that a common misconception about LLMs is that they’re sourcing information like a search engine:\n\n“They are just probabilistically stringing words together in a way that is representative of the patterns within the model. So, it’s not even sourcing anything.”\n\nIt’s part of the reason why AI chatbots tend to “hallucinate” from time to time, Svetski explained, and why developing an LLM requires a focus on training it on a style of answering. Spirit of Satoshi is by no means perfect either, at least not in its current iteration.\n\n“Our model will also hallucinate. It’s also going to talk shit, but it’s going to say something more like a Bitcoiner would say.”\n\nHaving established a broad but targeted base of Bitcoin-centric information and data, Svetski’s team has set about feeding the model tens of thousands of question-and-answer pairs using programmatic methods. However, a human element is still required to help Spirit of Satoshi generate responses that might have come from its namesake.\n\nRelated: Bitcoin Amsterdam: BTC shines in depths of crypto bear market\n\nThe ongoing development of the model is leaning on the wider Bitcoin community as a result. Spirit of Satoshi employs an incentive process that allows the public to verify, create and validate data for the model.\n\nUsing credentials from the Lightning Network, Nostr or email addresses, a “proof-of-knowledge” mechanism allows users to get paid in satoshis for helping train the model.\n\nThe process uses a consensus model that will automatically impose a penalty if users are creating “junk data.” Svetski described it as the crucial “human” element to improve Spirit of Satoshi’s outputs:\n\n“It’s producing incredible content; it’s the last piece to take your content from 80% good to 95% good. And that has a huge impact on the quality of the model.”\n\nThe difference between responses generated by Spirit of Satoshi and ChatGPT is palpable, according to Svetski. The latter is trained on mainstream ideas of what Bitcoin (BTC) and concepts like inflation are:\n\n“If we ask ChatGPT about inflation, it will tell you it is a sign of a healthy economy. Well, it’s not; inflation is the sign of systemic problems, like your purchasing power decreasing.”\n\nSvetski said this scenario was part of the raison d’être behind Spirit of Satoshi, retraining the LLM to reflect the nuances that embody the type of thinking behind the Bitcoin movement:\n\n“If you ask about inflation, our model should say, ‘No, inflation is actually bad for the economy because it disincentivizes savings,’ or ‘Savings have a knock-on effect on people’s time preference.’”\n\nThe future of the platform is fairly open-ended, according to its founder. Spirit of Satoshi could be a learning tool or online tutor embedded into educational platforms or online universities. It could also be the basis for the “ultimate Bitcoin influencer” through its BTC-centric outputs:\n\n“I’d like to see it become the destination for the next 100 million or 500 million people that want to learn about Bitcoin — the point for their first steps of understanding.”\n\nSpirit of Satoshi was built on the basis of an existing open-source model that possesses inherent proficiency in English and a “Wikipedia-type of bias.” The latter was addressed by structuring the model’s responses to its Bitcoin and Austrian economics principles data sets.\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy93b3JsZC9jcnlwdG9jdXJyZW5jeS1iaXRjb2luLXJlYWNoZXMtMi1tb250aC1oaWdoLXN1cmdlcy1hYm92ZS0zMC0wMDAtaW4tdm9sYXRpbGUtd2Vlay1yZXBvcnQtMTE2OTc4MDk1OTQ0MzUuaHRtbNIBkwFodHRwczovL3d3dy5saXZlbWludC5jb20vbmV3cy93b3JsZC9jcnlwdG9jdXJyZW5jeS1iaXRjb2luLXJlYWNoZXMtMi1tb250aC1oaWdoLXN1cmdlcy1hYm92ZS0zMC0wMDAtaW4tdm9sYXRpbGUtd2Vlay1yZXBvcnQvYW1wLTExNjk3ODA5NTk0NDM1Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrency Bitcoin reaches 2-month high, surges above $30,000 in volatile week: Report | Mint - Mint",
        "content": "Cryptocurrency Bitcoin on 20 October surged above $30,000 for the first time since July, taking gains for the week past 10 percent, against a backdrop of volatile trading across cryptocurrencies, reported news agency Reuters .\n\nThe largest cryptocurrency by circulation, jumped as high as $30,022, its highest since July 23. It was last up 4 percent on the day. Bloomberg reported that Bitcoin rose as much as 5.2 percent to $30,223 as of 7:30 a.m. in New York, taking it back to price levels last seen in August.\n\nEnigma Securities' head of research Joseph Edwards on Friday said there was no immediate news catalyst for the move in bitcoin. As per details, Bitcoin is known for its volatility and the opacity of its markets.\n\nALSO READ: BNB, Arbitrum, and VC Spectra: Three Cryptocurrencies to Watch Out For in 2023\n\nThe mood across the broader financial markets has also been slightly uncertain. The war in the Middle East, a rise in benchmark U.S. 10-year yields towards 5%, and concern about the prospect of interest rates staying a lot higher for a lot longer have rattled investor sentiment.\n\nThis week, Bitcoin markets have been especially skittish, with investors awaiting news of the fate of applications with the U.S. Securities and Exchange Commission (SEC) for a spot bitcoin exchange-traded fund (ETF) by major financial firms including BlackRock.\n\nThe approval of any such applications, crypto investors have said, could usher in a new wave of capital to the asset class.\n\n\"Crypto assets are increasingly bucking the sell-off seen across stocks and bonds, as investors focus on the coming catalysts like a potential SEC approval of a spot ETF,\" eToro strategist Ben Laidler said.\n\nOn Monday, Bitcoin rose suddenly after asset manager BlackRock denied a crypto media report that its high-profile ETF application had been approved.\n\nWith agency inputs.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFtc3RlcmRhbS1odXJkbGVzLWZvci1jb25zZW5zdXMtb3Zlci1vc2Fsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Amsterdam highlights hurdles for consensus over improvement proposals - Cointelegraph",
        "content": "Bitcoin core developers have long been at odds over Bitcoin improvement proposals (BIPs) to address the pain points of the protocol, as was apparent in a heated panel discussion during Bitcoin Amsterdam 2023.\n\nLong-time Bitcoin developers Paul Sztorc and Peter Todd brought this to the fore in Amsterdam, with the latter coming across as highly critical of Sztorc’s work in the ongoing development of Drivechains.\n\nSztorc’s LayerTwo Labs has been working on BIP-300 for nearly six years, which advocates for the creation of layer-2 sidechains that have the potential to address several problems without requiring base layer changes to the Bitcoin protocol.\n\nThe ensuing debate, which was at times heated, with Todd talking over Sztorc, highlighted the difficulty in reaching a consensus over BIPs that could potentially improve the overall functionality of the Bitcoin protocol.\n\nJameson Lopp, co-founder and chief technology officer of Bitcoin (BTC) custody firm Casa, weighed in on the issue during an in-depth interview with Cointelegraph at the conference, saying that the velocity of improvements and protocol changes has slowed down more than he would have liked.\n\nThat has changed somewhat in recent weeks with the emergence of new projects like BitVM and SpiderChain, as Lopp explains, which leads him to believe that a couple of proposed soft forks may well be beneficial to the future of the protocol:\n\n“In general, I think that Bitcoin should implement functionality that will improve its ability to be what you could call a cryptographic accumulator. Bitcoin should enable functionality that will boost the ability of second layers.”\n\nLopp adds that any potential “hardcore ossification” that some maximalists have argued for in the past would have stifled innovation that led to the creation of solutions like the Lightning Network that has helped the Bitcoin network scale to better process transactions.\n\n“Lightning wouldn’t really be possible without OP_CLTV. It would have maybe been possible, but really clunky without SegWit. And without OP_CSV, it would not be possible to have indefinitely long-lived Lightning channels.”\n\nLopp was referencing CHECKSEQUENCEVERIFY (OP_CSV) and CHECKLOCKTIMEVERIFY (OP_CLTV) — two BIPs that were carried out to facilitate payment channels as soft forks. OP_CLTV was authored by Todd, describing a Bitcoin operation code that allows a transaction output to be made unspendable until some point in the future.\n\nRelated: Bitcoin Amsterdam: Focus on BTC fundamentals, says Edward Snowden\n\nLopp adds that while Bitcoin’s protocol may become static due to a lack of consensus over base layer improvement proposals, developers are likely to keep building in ways that don’t require permissions:\n\n“If it’s not possible to implement a solution that may be optimally implemented at the base layer at the base protocol, then generally what we see end up happening is solutions being kind of bolted-on in many cases.”\n\nThe Casa exec believes that if Bitcoin does not continue to scale, users will inevitably turn to storing and using BTC through a “handful of Bitcoin banks, aka custodians and exchanges,” which comes with significant trade-offs:\n\n“Then it’s IOUs, right? That’s not the future that I think any of us want to see.”\n\nAs Cointelegraph previously reported, Bitcoin proponents and analysts at Bitcoin Amsterdam 2023 highlighted the growing importance of the cryptocurrency’s value proposal and hard money characteristics amid a drawn-out bear market.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8xMC8yMC9iaXRjb2luLXNwb3QtZXRmLWFwcHJvdmFsLTIwMjQv0gFFaHR0cHM6Ly90ZWNoY3J1bmNoLmNvbS8yMDIzLzEwLzIwL2JpdGNvaW4tc3BvdC1ldGYtYXBwcm92YWwtMjAyNC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "There’s ‘great hope’ for bitcoin spot ETF approval in 2024, says Bitwise’s general counsel - TechCrunch",
        "content": "As the crypto market heats up in anticipation of a bitcoin spot ETF approval in the U.S., Katherine Dowling, general counsel and chief compliance officer at Bitwise Asset Management, is expecting good luck in the new year.\n\n“I have great hopes for 2024,” Dowling said on TechCrunch’s Chain Reaction podcast. “My spidey sense is that they’re looking at January.”\n\nThe SEC missed its Friday deadline to appeal the August court decision regarding converting Grayscale’s Bitcoin Trust (GBTC) into a bitcoin spot ETF.\n\nThere have been a lot of obstacles in the way, including the lawsuit, that probably inhibited dialogue with regulators. “So the fact that we have resolution for that and that most recently they’re not taking an appeal stance is actually a great step forward.”\n\nDowling also noted there has been some engagement from the SEC with crypto S-1 filings, and amendments have been made there, too. “That all suggests some forward motion, and we had some hints that there wasn’t going to be an appeal” due to prior talks of a potential government shutdown.\n\nBitwise is a crypto asset manager that is known for creating the world’s largest crypto index fund. The firm also filed for a bitcoin spot ETF in the U.S., making it one of a number of firms, like BlackRock, whose applications are pending after the SEC delayed its decisions.\n\n“Frankly, having more filers at once is what’s best if you’re going to approve a product; that’s what’s best for investors because then they have a wide array of choices,” Dowling said. “If you’re going to approve it, line us up all at once, so that the investor has the best opportunity to survey the offerings and go with what they think best fits their profile.”\n\nSEC oversteps\n\nIn past career roles, Dowling worked very closely with the SEC as a federal prosecutor for 11 years and as assistant U.S. attorney, with her last government gig in the economic crimes unit of the U.S. attorney’s office for the Northern District of California.\n\nBut there’s a question of what the current mission for the agency is in regards to the sector, as it differs from one administration to another. “There’s a divergence between what the staff is trying to do and get right versus what they’re being guided to work on and how to do that,” Dowling said. “The SEC has been very active in a number of areas, not just within crypto . . . [but] I do think there’s been some big oversteps with the current SEC.”\n\nDowling said the SEC can’t overstep its jurisdiction and try to “grab areas that maybe shouldn’t be within their purview.”\n\nShe thinks that the collapse of FTX has had an impact on regulators’ view on the crypto industry. “We were on a good pace to get toward some more regulatory clarity,” but the downfall of the crypto exchange took the industry “many steps back,” Dowling said.\n\nWithout the FTX collapse, she believes that there would have already been legislation around the industry in regards to subsectors like bitcoin spot ETFs and stablecoins. Even though FTX co-founder Sam Bankman-Fried’s trial is ongoing, Dowling thinks the FTX debacle won’t affect future regulators’ or legislators’ decisions as much given that “the big bombs have already exploded and that’s already baked in.”\n\nEven though the industry has been slowly moving toward regulation, the future looks bright. Dowling still holds hope that the crypto industry — and those advocating for it — are “pushing in the right direction.”\n\nThis story was inspired by an episode of TechCrunch’s podcast Chain Reaction. Subscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to hear more stories and tips from the entrepreneurs building today’s most innovative companies.\n\nConnect with us:"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vY3J5cHRvd2FsbGV0LmNvbS9hY2FkZW15L2Jlc3QtYml0Y29pbi13YWxsZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Top 11 Best Bitcoin Wallets Of 2024 - CryptoWallet.com",
        "content": "Welcome to our guide on the Best Bitcoin Wallets of 2024! The Bitcoin market is growing rapidly, with institutional interest and mainstream adoption now at unprecedented levels. It’s an exciting time to buy Bitcoin, and for would-be investors, the first step is choosing a safe and effective wallet to store your funds.\n\nBTC wallets offer a secure solution for safeguarding your BTC holding as well as other cryptocurrencies. With so many different types of BTC wallets available, it is quite important to select the one that aligns with your specific needs.\n\nThese top Bitcoin wallets cater to a range of cryptocurrencies including BTC, while some crypto wallets are designed exclusively for Bitcoin. Furthermore, BTC wallets are categorised into two primary types – hot wallets and cold wallets, which we will explain in the next section.\n\nCryptoWallet.com – Best wallet to spend Bitcoin\n\nCryptoWallet.com is the best Bitcoin wallet for daily use. You can send and receive BTC with ease and manage 800+ other cryptos on multiple blockchain networks. You can also buy and sell Bitcoin instantly and spend BTC with our Crypto Card. Ledger Nano X – Best Hardware wallet for BTC\n\n– Best Hardware wallet for BTC Trust Wallet – Best mobile wallet\n\n– Best mobile wallet Exodus – Best desktop wallet\n\nWhat is a Bitcoin Wallet?\n\nA Bitcoin wallet or BTC wallet is a software or a device that acts as an “account” to hold your BTC funds and stores the data required to access it. You can use your BTC wallet to access your Bitcoin, initiate transactions such as sending Bitcoin (withdrawal), receiving Bitcoin (deposit), and checking the status of transactions.\n\nEvery BTC wallet contains a pair of cryptographic keys — a private key and a public key. The private key is a secret code (or password) that enables the owner to access their Bitcoins and make transactions, while the public key is a wallet address that others can use to send Bitcoin (BTC) to the wallet.\n\nBTC Wallets come in various forms, including mobile apps, desktop software, web-based interfaces, and hardware wallet devices. Users can choose the type of wallet that suits their preferences and needs.\n\nSome Bitcoin wallets are custodial, meaning you don’t control the keys — this is similar to a bank having direct control over the money in your bank account, and it serves the same purpose, which is to share or deflect responsibility for looking after your funds to a professional.\n\nSome people prefer non-custodial wallets, which is more similar to walking around with cash in your pocket or keeping money under your mattress. Using a non-custodial BTC wallet means you’re in charge of the funds, and responsible for their safekeeping.\n\nHow to Choose The Best BTC Wallet?\n\nIf you want to choose the best Bitcoin wallet, the primary factor to consider is whether you prefer a hot wallet or a cold wallet.\n\nHot BTC wallets are connected to the internet and are convenient for everyday transactions. They include web wallets, mobile wallets, and desktop wallets. While they offer ease of use, they are more vulnerable to online threats compared to cold wallets.\n\nCold BTC wallets, also known as hardware wallets (for example Leder Nano X), are offline storage solutions that provide enhanced security. These wallets are less susceptible to hacking but may be less convenient for frequent transactions.\n\nChoosing the best BTC wallet depends on factors like security preferences, usage patterns, and the level of control users want over their private keys. It’s essential to research and select a reputable wallet provider to ensure the safety of your Bitcoin holdings.\n\n11 best Bitcoin Wallet Reviewed\n\nCryptoWallet.com\n\nOK, we know what you’re thinking — of course, we’re going to recommend our own product. However, we built CryptoWallet.com specifically to target the issues we found in other popular wallets.\n\nCryptoWallet.com is more than just a wallet. It’s a crypto neobank that offers various crypto banking services including crypto-powered IBAN, SEPA bank transfers using crypto funds, crypto card to spend Bitcoin and other assets directly and a built-in exchange to buy and sell cryptocurrencies.\n\nCryptoWallet.com offers the best wallet for spending BTC directly. We call our custodial Bitcoin wallet “Bitcoin Account” where you can hold your bitcoins and spend it anywhere with our Crypto Card.\n\nOn our exchange, you can buy Bitcoin with a credit card or debit card and use it for banking and payments – such as making bank transfers using your Bitcoin, spending it online with the crypto card, or converting it to fiat instantly at any ATMs.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Fiat currency: Yes\n\nYes Own exchange incorporated: Yes\n\nYes Ease of Use: Very Easy\n\nPros 👍\n\nWe made CryptoWallet.com to help you buy, store, trade, and sell Bitcoin. CryptoWallet.com is the Best BTC wallet that allows you to spend Bitcoin and other assets practically anywhere. It is an all-in-one solution. It comes with a built-in buy and sell feature that allows you to buy hundreds of cryptocurrencies, with fiat support for both euros and pound sterling.\n\nYou can even order your own crypto card and finally spend Bitcoin or over 800 other cryptos as real money! Order your crypto card here.\n\nThe ability to spend crypto online or in shops really sets our solution apart in our opinion, as the app provides you with everything you need for Bitcoin in one place.\n\nCons 👎\n\nCryptoWallet.com is a custodial BTC wallet which means users don’t control their own keys with CryptoWallet.com, unlike non-custodial solutions like Trust Wallet or Ledger hardware wallet. Again, this is a personal preference. Users with paper wallets or non-custodial solutions have sole access to their keys. However, with the card, you can link non-custodial wallets and spend funds directly from them if you wish, instead of the CryptoWallet.com wallets.\n\nOf course, self-custody means no exchange, no debit card, no customer support, no community, and no rewards program. We offer an enterprise-grade level of security, as well as all the perks mentioned above. We’re happy to put our name forward as the best wallet out there for users looking for the all-in-one Bitcoin wallet solution.\n\nLedger Nano X\n\nThe Ledger Nano X is a highly regarded hardware crypto wallet known for its mobile support (via Bluetooth) exceptional security features and wide-ranging coin support. Ledger the best Bitcoin wallet if you want to store large amounts of BTC for a long period of time.\n\nHardware wallets like Ledger is the SAFEST way to store Bitcoins (BTC) because your digital assets remain offline, protecting them from online threats and providing peace of mind for long-term cryptocurrency storage. It’s a trusted choice among crypto enthusiasts for safeguarding their investments.\n\nAs a product from Ledger, a prominent name in the crypto space, the Ledger Nano X builds upon the success of its predecessor, the Nano S. It offers enhanced storage capacity and compatibility with a vast range of cryptocurrencies.\n\nThe standout feature that distinguishes Ledger from Trezor is its Bluetooth connectivity, allowing the hardware wallet to sync with your mobile device, and providing the convenience of managing your cryptocurrencies while on the move.\n\nType of wallet: Hardware\n\nHardware Purchase cost: £109 or €149\n\n£109 or €149 Own exchange incorporated: No\n\nNo Ease of Use: Advanced\n\nPros 👍\n\nLedger Nano X is the best Bitcoin wallet that offers a “cold storage” solution to safeguard your BTC and other assets. This means that funds are kept offline when not in use. Hardware wallets are considered the most secure BTC wallets. Users can set up the Ledger software on their desktop computer and plug in the Ledger Nano X to transfer cryptos.\n\nCons 👎\n\nSetups can be complicated for hardware devices, and these crypto wallets are arguably for more advanced users.\n\nCoinbase Wallet (DeFi)\n\nCoinbase Wallet is a cryptocurrency wallet provided by Coinbase, a reputable cryptocurrency exchange. It is the best BTC wallet – ideal for beginners due to its user-friendly interface and strong security features. The wallet supports a vast array of cryptocurrencies, including popular ones like Bitcoin, Litecoin, and Dogecoin, along with thousands of ERC-20 tokens and tokens on EVM-compatible blockchains.\n\nOne crucial distinction is that Coinbase Wallet operates independently of the Coinbase exchange. While the exchange offers a web wallet convenient for trading, the Coinbase Wallet is non-custodial, meaning it doesn’t control your private keys.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Own exchange incorporated: Yes\n\nYes Ease of Use: Very easy\n\nPros 👍\n\nCoinbase Wallet offers a user-friendly interface for easy navigation and supports over 100 digital assets. It prioritizes security with features like multi-signature and two-factor authentication.\n\nCons 👎\n\nOnly available on mobile and tablet devices (except for Chrome extension)\n\nTrezor Model T\n\nThe Trezor Model T is a hardware wallet designed to securely store wide range of cryptocurrencies including BTC. It is compatible with Windows, MacOS, and Linux operating systems, offering versatility for various users. With support for over 1,000 cryptocurrencies and robust PIN code protection, USB-C, and a touchscreen interface. Additionally, it is compatible with the Exodus wallet and the wallet boasts a high trust rating, underlining its reliability and security.\n\nTrezor Model T is also one of the best hardware wallets to store Bitcoin. It is an ideal choice for beginners due to its simple setup process. It distinguishes itself by enabling users to purchase assets and tokens directly through its Trezor Wallet application, offering a unique feature not found in most other software wallets or Ledger hardware wallets.\n\nHowever, it’s worth noting that it comes at a relatively higher initial cost compared to other cryptocurrency wallets on the market. Read the full Trezor hardware wallet review.\n\nType of wallet: Hardware\n\nHardware Purchase cost: £190 or €219\n\n£190 or €219 Own exchange incorporated: Yes\n\nYes Ease of Use: Beginners\n\nPros 👍\n\nLike Ledger, Trezor is a hardware wallet that offers better security than software BTC wallets or “hot wallets”. Trezor is considered one of the best Bitcoin wallets that offers support for a growing number of currencies and is compatible with certain online wallets.\n\nCons 👎\n\nUnlike Ledger, Trezor doesn’t offer any mobile support. This means users cannot access their crypto funds instantly, especially on the go.\n\nTrust Wallet\n\nTrust Wallet is the best Bitcoin wallet for mobile. It is a top choice for mobile due to its outstanding features and impressive versatility. As our preferred mobile BTC wallet, it stands out for its user-friendly app interface, extensive support for decentralized applications (dApps) and NFTs, and an extensive array of supported digital assets.\n\nTrust Wallet supports a range of cryptocurrencies, including major coins like Bitcoin (BTC) and Ethereum (ETH), as well as numerous ERC-20, BEP-2, and BEP-20 tokens. Users can manage multiple assets within a single wallet.\n\nTrust Wallet is a non-custodial wallet, meaning users have full control over their private keys and funds. It doesn’t rely on a centralized third party to manage your assets, enhancing security and privacy.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Crypto exchange: Partners’ website\n\nPartners’ website Ease of Use: Beginners\n\nPros 👍\n\nTrust Wallet, chosen as the top mobile crypto wallet, stands out for its user-friendly mobile app interface and extensive support for thousands of cryptocurrencies and tokens. Owned by Binance, it offers an array of features including earning interest on 12 different cryptocurrencies and a built-in Web3 browser for easy access to decentralized applications (dApps) and NFTs.\n\nCons 👎\n\nHowever, its association with Binance, which has faced regulatory challenges in the US, may raise concerns for some users, and the wallet’s educational resources on cryptocurrencies are somewhat limited.\n\nExodus\n\nExodus is the best BTC wallet for desktop use, and we selected it due to its speedy transactions, user-friendly interface, and versatile features.\n\nExodus supports Bitcoin as well as various other cryptocurrencies such as Bitcoin, Litecoin, Ethereum and many other cryptos across a range of blockchain networks. It can also get linked to Trezor hardware wallet allowing you to store Bitcoins more safely offline.\n\nInitially designed exclusively for desktop use, Exodus has since expanded to include mobile apps for both iOS and Android platforms. However, its core offering remains its desktop application, which is compatible with Windows, Linux, and Mac operating systems and receives regular updates every two weeks.\n\nOne of Exodus’ standout features is its extensive support for cryptocurrencies and NFTs, with over 260 different digital assets available for storage and management. This impressive list covers established cryptocurrencies like Bitcoin, Ethereum, Litecoin, XRP, and Bitcoin Cash, along with popular meme coins such as Dogecoin and Shiba Inu.\n\nAdditionally, Exodus offers various apps that enhance its functionality, including tools for live crypto charts, staking, and crypto deposits, making it a versatile and visually appealing choice for cryptocurrency enthusiasts and investors.\n\nType of wallet: Mobile and desktop\n\nMobile and desktop Purchase cost: Free\n\nFree Fiat currency: No\n\nNo Own exchange incorporated: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nExodus offers support for over 260 different cryptocurrencies, ensuring users can manage a wide variety of digital assets within a single interface. Additionally, its compatibility with Trezor One and Trezor T hardware wallets provides an added layer of security, catering to users who prioritize cold storage solutions.\n\nCons 👎\n\nThere are a few drawbacks to consider when using Exodus. Notably, the wallet may incur high transaction fees on its in-wallet crypto exchange, potentially impacting users seeking cost-effective trading options.\n\nAtomic Wallet\n\nAtomic Wallet is a decentralized, non-custodial crypto wallet available in both mobile and desktop versions. It is another safe wallet to store your Bitcoin. Atomic Wallet is known for its user-friendly interface that allows users to securely and privately manage their digital assets.\n\nAtomic Wallet offers support for Bitcoin as well as a wide range of cryptos, making it a versatile solution for managing diverse digital assets. Users can perform cryptocurrency exchanges within the wallet interface without needing to leave the application. This feature is available in both the mobile and desktop versions.\n\nType of wallet: Mobile and Desktop\n\nMobile and Desktop Purchase cost: Free\n\nFree Buy/Sell Cryptos: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nUsers can store Bitcoin as well as hundreds of different digital assets on Atomic Wallet, and also carry out atomic swaps for select currencies (a form of crypto trading). The app is also supported on mobile devices.\n\nUsers can earn rewards through in-app staking, making it a convenient option for those interested in participating in cryptocurrency staking.\n\nCons 👍\n\nAtomic Wallet may not be compatible with a wide range of hardware wallets, potentially limiting options for enhanced security.\n\nUsers can’t spend cryptocurrency on real-life goods or services using Atomic, so it’s still necessary to use the app in conjunction with a bank or something similar for that purpose. Like most non-custodial wallets, there’s no customer support, nor are there security features such as 2FA.\n\nCrypto.com (DeFi wallet)\n\nCrypto.com’s DeFi Wallet is non-custodial crypto wallet, which is different from the Crypto.com exchange wallet. This wallet does not require users to create an account on Crypto.com’s exchange platform, giving you full control over your Bitcoin and other digital assets.\n\nCrypto.com’s DeFi Wallet is recognized as one of the best DeFi crypto wallets due to its comprehensive suite of decentralized finance tools, user-friendly onboarding process, and robust security measures. Designed for users venturing into the world of decentralized finance (DeFi), this wallet empowers individuals with full control over their digital assets and private keys, emphasizing self-custody and security.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Fiat currency: No\n\nNo Own exchange incorporated: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nKey features of the Crypto.com DeFi Wallet include the ability to engage in peer-to-peer crypto swaps and a diverse range of tools for earning passive income from existing cryptocurrencies.\n\nCons 👎\n\nJust like any other non-custodial wallet, your funds are inaccessible if you lose your private key and recovery phrase. The Built-in token swap also has some geo-restrictions\n\nElectrum\n\nElectrum is a highly respected Bitcoin wallet known for its robust security and user-friendly design. This desktop wallet offers a secure way to store and manage your Bitcoin assets. It employs a hierarchical deterministic structure, providing users with a seed phrase for wallet recovery. Electrum works on Windows, macOS, and Linux, and can be used in conjunction with popular hardware wallets like Trezor and Ledger for added protection.\n\nElectrum offers privacy-enhancing options, supports customizable transaction fees, and provides multi-language support.\n\nType of wallet: Desktop\n\nDesktop Purchase cost: Free\n\nFree Own exchange incorporated: No\n\nNo Ease of Use: Intermediate\n\nPros 👍\n\nFast and easy to set up and offer better security than other hot wallets\n\nCons 👎\n\nSetup and interface are not ideal for beginners and no customer support via chat, email or phone\n\nGuarda\n\nGuarda is a non-custodial Bitcoin wallet that supports BTC and a variety of other digital assets such as Litecoin, Ethereum and erc-20 tokens, USDT, and many more. Guarda is available as a web wallet, desktop application (Windows, macOS, and Linux), and mobile app (Android and iOS), providing users with flexibility and accessibility across various devices.\n\nIt is one of the best Bitcoin wallet that offers a built-in token swap service, enabling users to exchange one cryptocurrency for another without leaving the wallet. This can be convenient for trading and portfolio management.\n\nUsers can store, swap, earn interest, and buy Bitcoin and other cryptocurrencies directly within the wallet. Guarda offers in-app staking, allowing users to earn interest on their digital assets. Many supported cryptocurrencies feature opt-in staking opportunities.\n\nType of wallet: Mobile, Web, Desktop\n\nMobile, Web, Desktop Purchase cost: Free\n\nFree Buy/Sell Cryptos: Swap only\n\nSwap only Ease of Use: Easy\n\nPros 👍\n\nGuarda allows users to store funds on desktop, mobile, and web browsers. The wide variety of options will appeal to some traders. While Guarda is non-custodial, it still offers customer support in the event of an issue or lost funds. You can create multiple-user wallets for different currencies.\n\nIt is one of the best BTC wallets and features an intuitive and user-friendly interface, making it suitable for both newcomers and experienced cryptocurrency users.\n\nCons 👎\n\nGuarda Wallet charges transaction fees for in-app crypto purchases, with a standard transaction fee rate of 5.5%. This fee structure may be considered relatively pricey when compared to competitors. However, it does offer customizable transaction fees for users.\n\nThis solution is still a basic storage-only app, with no added features such as a debit card, bank account number, or affiliate program.\n\nRobinhood\n\nRobinhood is a stock trading app that also offers Bitcoin support.\n\nThe Robinhood Wallet app serves as a self-custodial wallet. You can securely store and oversee your cryptocurrency holdings across various networks, including Ethereum, Bitcoin, Dogecoin, Polygon, Arbitrum, and Optimism. Robinhood Wallet empowers you with complete authority over your digital assets, ensuring that you retain ownership of the private keys.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Own exchange incorporated: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nRobinhood is beginner-friendly, with a simple interface and access to stocks as well as cryptocurrencies.\n\nCons 👎\n\nRobinhood is also only available in the US.\n\nBest Hardware Wallet for Bitcoin\n\nA hardware or “cold” wallet will be the most secure way to store your Bitcoin tokens. These physical devices are always offline which prevents hackers from gaining access.\n\nTo access or transfer funds, you’ll need to connect it to an online device. This extra step, which ensures the safety of your funds, adds a level of complication that some investors prefer to avoid. This is why many investors opt for an easy-to-use assured software wallet like CryptoWallet.com instead.\n\nTrezor and Ledger offer the most reliable cold wallets on the market today. Both have a proven track record of security and offer a range of different features. If you’re looking for your first hardware wallet, you’ll want one that is easy to set up and use.\n\nWith Trezor, you’ll need to use a USB to connect it to a computer to use the Trezor Wallet desktop app. This means it may be harder to capitalize on sudden market changes.It’s a good choice for users who are concerned about the security of their funds above all else.\n\nLedger is Bluetooth-enabled and comes with a desktop and a mobile app called Ledger Live. This makes it that little bit easier to connect and use. It also supports a wider range of tokens. It is an ideal hardware wallet for intermediate traders. Let’s keep looking at Bitcoin wallets.\n\nTypes of Bitcoin (BTC) Wallets\n\nThere are several types of Bitcoin wallets, each with its own characteristics and use cases.\n\nHardware BTC Wallet\n\nThese are physical devices designed to store Bitcoin offline, making them highly secure from online threats. Examples include Ledger Nano X, and Trezor Model T.\n\nThese wallets are highly secure. Funds are stored offline, meaning it’s not possible for hackers to access them remotely. It’s a little tricky to set these wallets up, and buying and selling Bitcoin is more time-consuming as you’ll need to plug your wallet into a computer and operate it from the desktop app.\n\nCrypto investors sometimes keep large sums offline in a hardware wallet (or cold wallet) and smaller sums for convenient trading or spending in an online wallet (or hot wallet).\n\nRead More: Best Hardware Wallets\n\nSoftware BTC Wallets:\n\nDesktop Wallets: Desktop wallets store Bitcoin data on a desktop computer. You can store your private keys (similar to account passwords) in some of these wallets, and send and receive Bitcoin on your computer.\n\nThese wallets are only as secure as your desktop device, so one downside is the potential for funds to be vulnerable to viruses or hackers. Examples are Electrum, Exodus, and Bitcoin Core.\n\nMobile Wallets: Mobile wallets are typically mobile apps that allow users to send and receive Bitcoin. These wallets offer greater accessibility than desktop wallets, as you can use them anywhere.\n\nWith private key wallets, it’s possible to lose your phone and your private keys and thus your funds. However, many mobile wallets are offered by companies with customer support that secure your keys and make it very easy to restore funds should you lose or break your device\n\nWeb Wallets: A web wallet can be accessed on any web browser. These are device-agnostic, meaning you can use a mobile phone, desktop computer, tablet, or other internet device to access your funds. They are user-friendly but potentially less secure as they are connected to the internet.\n\nRead more: Best Crypto Wallet\n\nCustodial VS Non-Custodial Wallet\n\nCustodial wallets and non-custodial wallets are two different types of cryptocurrency wallets, each with its own set of characteristics and trade-offs:\n\nCustodial Wallets\n\nCustodial wallets, often provided by exchanges or wallet services, grant a third party control over your private keys and funds. Custodial wallets are often easier to use, making them suitable for beginners. Users can access their funds with a username and password.\n\nSince the Bitcoin wallet provider (company) holds your private keys, they are responsible for security measures, including safeguarding your funds and protecting against hacks. Some custodial wallets offer account recovery services, which can be helpful if you forget your login credentials.\n\nNon-Custodial Wallet\n\nIn a non-custodial wallet, you have full control over your private keys and, by extension, your cryptocurrencies. The wallet provider does not have access to your keys.Non-custodial wallets are considered more secure because they reduce the risk of hacks or breaches at the wallet provider’s end. Users are responsible for their wallet’s security.\n\nNon-custodial wallets can be more complex to set up and use, making them better suited for experienced users. These wallets often prioritize user privacy, as they don’t require users to provide personal information.\n\nThe choice between a custodial and non-custodial wallet depends on your preferences, experience level, and security priorities. If you value convenience and are willing to trust a third party with your funds, a custodial wallet might be suitable. On the other hand, if you prioritize security and want full control over your assets, a non-custodial wallet is the better option.\n\nCryptoWallet.com – The Best Bitcoin Wallet to Spend BTC\n\nThere are many factors to consider when choosing a crypto wallet that allows you to use Bitcoin for its intended purpose. At CryptoWallet.com, you can not only store your Bitcoins but also spend BTC with our crypto card.\n\nThe CryptoWallet.com card enables you to spend more than 800 cryptocurrencies directly from your crypto wallet, with real-time crypto conversion and the lowest transaction fees in the market among all currently available crypto cards.\n\nAdditionally, you can buy Bitcoin and other cryptos with a credit card and debit card. You can also sell your Bitcoins instantly on our exchange at low fees.\n\nWith a CryptoWallet.com account, you can create an IBAN to manage EUR funds, which you can use to buy and sell cryptos and perform crypto-powered bank transfers within the SEPA zone.\n\nBitcoin Wallet FAQs\n\nWhat is a BTC wallet? A BTC wallet, or Bitcoin wallet, stores your crypto funds safely — as long as you look after the private keys! A BTC wallet is a piece of software or a physical device that stores bitcoins. It can be thought of a little like a regular wallet, or a bank account. When you open a BTC wallet, you receive a string of characters and numbers called a public key. This is the wallet address, and if you want someone to send you BTC, you need to give them this address. You’ll also receive another series of characters and numbers called a private key, and this one is similar to a password. If you want to send BTC from your wallet, you need to enter this password. You don’t need to take any action to receive BTC. Some BTC wallets are non-custodial, meaning you don’t have control of the private keys. This takes us back to the bank account analogy — you’re not responsible for the funds, a professional is. Technically, it would be possible for them to freeze your funds under extreme circumstances, such as government intervention. Some people prefer to go for a non-custodial wallet, meaning they’re solely in control of the funds. This is similar to carrying cash in a wallet, or under a mattress. Nobody else is responsible for the safekeeping of these funds, and like regular fiat money, some people aren’t comfortable keeping large sums on their person or in their house. Sometimes, the best solution is a hybrid one. One BTC wallet for walking around money, and another for larger sums. Whatever you choose, you’ll need to protect your details to prevent any security breach from taking place. Look after your BTC wallet, and it will look after you! How do you cash out your Bitcoin wallet? Cashing out of a Bitcoin wallet has historically been very complicated. It was necessary to join an exchange like Coinbase and sell Bitcoin for cash, then transfer that cash to a bank account over the course of several days. Of course, that’s the beauty of CryptoWallet.com! With CryptoWallet.com account, you can simply cash out BTC to your bank account instatnly. Alternatively you can also withdraw Bitcoin (as cash) from any ATM using our Crypto Card, or even spend it directly on anything you like, whether online or in-store. Get your Crypto Card today! How to add funds to a Bitcoin wallet? You can add funds to a Bitcoin wallet from any other Bitcoin wallet. You can simply use the public key (wallet address) to send BTC to any Bitcoin wallet. If you want to buy Bitcoin, you can use any crypto exchange that accepts credit or debit cards. That includes CryptoWallet.com! When purchasing BTC, simply add the wallet address (public key), and the BTC will be transferred to your Bitcoin wallet. What is Bitcoin cold storage? Bitcoin cold storage refers to a method of keeping a reserve of Bitcoins offline (on Hardware wallets like Trezor or Ledger), which is completely isolated from the internet or any online computer network. The main purpose of cold storage is to provide a high level of security for your Bitcoin holdings by minimizing exposure to potential online threats, such as hacking, malware, or unauthorized access. What is a Bitcoin address? A Bitcoin address is a string of alphanumeric characters that show the destination of a Bitcoin payment. Your address is the same as the public key of your Bitcoin wallet. Should you use multiple Bitcoin wallets? Some people like to diversify crypto storage locations. When dealing in large sums, it can be a good idea to keep some funds on a hardware or offline wallet and some on an online wallet for easy trading or spending. Which is the safest Bitcoin wallet? When considering wallet safety there is no ‘one size fits all’ wallet. Fortunately, there exists a wide variety of different wallet systems that are each tailored to different accessibility and security needs. In terms of raw security, hardware wallets are considered to be the most secure means of storing Bitcoin. Hardware Wallets such as Ledger or Trezor are stored on a device similar to that of a USB key and are generally offline or ‘cold,’ and therefore extremely resistant to virus attacks. However, this type of wallet system may not be suitable for everyone’s needs, as they aren’t as easily accessible as other wallet types and are considered to be a little pricey. Desktop or Mobile Wallets systems are much cheaper and far more accessible, as they store one’s coins on an app installed onto one’s computer or handheld device. These wallets such as Hive Android or Mycelium have a high degree of accessibility allowing for easy trade through QR codes or Near Field Communication. The drawback to this accessibility is that they are considered ‘hot’ or online, and therefore more vulnerable to malware and phishing attacks. What is the best crypto wallet? Every crypto wallet will offer different features and levels of security. Some wallets prioritize convenience while others are focused on security above all else. Ultimately, the best crypto wallet will be the one that matches your requirements. If you’re looking for the most secure crypto wallet, a hardware wallet would be a perfect choice. These are physical devices which store your keys offline. This makes them less vulnerable to hacks or malware. You’ll need to connect them to an online device to fully use your assets which can be inconvenient. Software wallets offer much greater convenience as your keys are stored online and you can access your funds from anywhere. They are generally easier to use and set up than a hardware wallet. However, their constant online connection makes them more vulnerable to cyberattacks. At CryptoWallet.com, we don’t believe that you should have to sacrifice security for convenience. That’s why we’ve protected all funds held in our software wallets. The mobile app and cryptocurrency exchange are streamlined and intuitive to use. Our crypto wallet combines security, convenience and ease of use to make one of the best crypto wallets on the market. What is the best crypto wallet for beginners? If you’re looking to get started in the world of trading cryptocurrencies, you’ll want a crypto wallet tailored to your needs. An ideal crypto wallet would be secure, convenient and easily operated.\n\nSoftware wallets will be the easiest wallet to set up and use. They are more vulnerable to cyber attacks as they are constantly online but they are far easier to use. There are two types of software wallets available, self-custody or custodial. With a self-custody wallet, you have full control over your keys. While many investors prefer this, it comes with more responsibility and you may need to be more tech-savvy than with a custodial wallet. If you lose access to your wallet, your funds may be irretrievable. This is why many beginners choose custodial wallets. With custodial wallets, a third party, like an exchange, manages your keys. This is much more convenient and can be helpful if you lose your keys or login details. At CryptoWallet.com, we offer one of the most secure custodial wallets. This is ideal for anyone looking to get started safely. There is a dedicated customer support service for any questions you might have and an Academy if you want to broaden your knowledge. We also offer a cryptocurrency exchange, making our platform a perfect all-in-one option for beginners. What crypto wallet should I use? While there are a range of different crypto wallets on the market, the crypto wallet that you should use depends on what level of trading and features you’re looking for. Beginner traders and advanced traders may be looking for different things when it comes to choosing a crypto wallet. Some platforms offer an entire suite of DeFi products and thousands of coins. These wallets are ideal for advanced traders looking for savings accounts, highly-speculative investment opportunities and more. These platforms are often more difficult to navigate and get used to. Hardware wallets like Ledger and Trezor are the most secure but also the least convenient. As they are offline devices, you’ll need to connect them to an online device to use. They can be tricky to set up which makes them more suitable for intermediate or advanced inventors. Software wallets are more suitable for beginners but they are often less secure. They are constantly online meaning you can access your funds wherever you are. This also makes them more vulnerable to being hacked. If you’re looking for a robust option for beginners, CryptoWallet.com offers all of the convenience of a software wallet while assuring all funds are held. Our exchange is integrated with our mobile app making it extremely user-friendly.\n\nRead More: Best Ethereum Wallet ; Best USDT Wallets ; Best Litecoin Wallet, Best XRP Wallet, Best Solana Wallet"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTAvMjAvZ29vZ2xlLWRhdGEtc2hvd3MtZ3Jvd2luZy1pbnRlcmVzdC1pbi1zcG90LWJpdGNvaW4tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Google Data Shows Growing Interest in Spot Bitcoin ETF - Crypto Times",
        "content": "According to data from Google Trends, the global search interest for the term “spot bitcoin ETF” is expected to reach its highest point, indicating a surge in public curiosity.\n\nThe value for “bitcoin ETF” has also risen to 39, the highest it has been since the launch of ProShares’ futures-based ETF two years ago, when it also reached a peak of 100 in search interest.\n\nSpot Bitcoin ETF Trend\n\nPeople in the market believe that the U.S. SEC, which recently didn’t meet a deadline for a significant legal challenge, will likely give the green light to a spot ETF in the early part of next year. This approval is expected to bring a substantial increase in available funds and trading activity.\n\nThe idea of getting approval for a Bitcoin (BTC) Exchange-Traded Fund (ETF) has been a consistent topic of discussion in the cryptocurrency industry. Many people view it as a way to measure how widely accepted BTC is becoming in mainstream finance.\n\nGoogle Trends provides mostly unfiltered samples of search requests made on Google and ranges from 0 to 100, with 100 indicating the highest level of interest at a given time. In the past, when Bitcoin and Solana (SOL) reached a score of 100 on Google Trends, it often coincided with the peak of their price increases during bull markets.\n\nA spot ETF follows the real-time price of Bitcoin and doesn’t involve trading in Bitcoin futures. Instead, the ETF provider buys and holds actual Bitcoins. This is a good option for people who want to invest in Bitcoin without needing to personally own the cryptocurrency."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYml0Y29pbmlzdC5jb20vaG93LW1pY3Jvc3RyYXRlZ3lzLWJpdGNvaW4tc3RyYXRlZ3ktaXMtZ29pbmcv0gFIaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9ob3ctbWljcm9zdHJhdGVneXMtYml0Y29pbi1zdHJhdGVneS1pcy1nb2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "By The Numbers: Here’s How MicroStrategy’s Bitcoin Strategy Is Going - Bitcoinist",
        "content": "MicroStrategy’s Bitcoin holdings are now in profit again. MicroStrategy is well known to be one of the largest Bitcoin buyers in recent years. The company is such a believer in Bitcoin that it sold some of its stocks to increase its Bitcoin holdings. This would seem extreme to some investors, but as suggested by recent price action, MicroStrategy’s Bitcoin strategy seems to be paying off.\n\nHow MicroStrategy’s Bitcoin Strategy Is Going\n\nMicroStrategy started investing in Bitcoin in 2020, becoming one of the first companies to do so. The firm started by buying $250 million worth of Bitcoin in August 2020 and hasn’t slowed down since. In its latest move, MicroStrategy acquired approximately 5,445 Bitcoins for approximately $147.3 million between August 1, 2023, and September 24, 2023. According to the company’s purchase filing, as of September 24, 2023, MicroStrategy owns approximately 158,245 Bitcoins bought at an approximate price of $4.68 billion.\n\nOn the other hand, Bitcoin has had one of the strongest advances in the crypto market in recent weeks and is now trying to build a strong momentum over $30,000. At the time of writing, Bitcoin is up by 11.08% in a seven-day timeframe. Although the cryptocurrency is now trading at $29,838, it crossed over $30,000 in multiple instances during the week.\n\nAmidst all this upheaval in the market, MicroStrategy’s Bitcoin holdings have taken a turn for the better in terms of profitability. Given that the total Bitcoin holdings of MicroStrategy were purchased at an average of $29,582 per coin, the company has now achieved a total profit of about $67.4 million with Bitcoin at $30,000.\n\nBitcoin price nearing the $30K level today. Chart: TradingView.com\n\nA Sturdy Bitcoin Approach?\n\nBitcoin has been on an incredible run over the past year, massively outpacing the stock market and most other mainstream investments. The cryptocurrency is now in a prime position for a price surge in the coming months. Many financial analysts have hinted that a bull run to a new all-time high for the cryptocurrency could be on the horizon, especially as the industry awaits the approval of a spot Bitcoin ETF from the US SEC.\n\nIt’s been a while since MicroStrategy’s Bitcoin holdings turned a profit, as Bitcoin has been saddled with various market crashes. According to CryptoQuant data, MicroStrategy benefited massively during the 2021 bull run. But things have been calm since then, with the company only topping up its Bitcoin holdings from time to time.\n\nAs it stands, MicroStrategy stands to benefit more than most companies in the event of a new bull run. If Bitcoin reaches $50,000, MicroStrategy’s holdings would be almost double its current worth. The company will likely keep buying more Bitcoin over time as it plans to make Bitcoin a large percentage of its total assets.\n\nFeatured image from ETF Database"
    }
]