[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdG9kYXkudGFtdS5lZHUvMjAyMy8wMS8yMC9uZXctY2xhc3MtZXhwbG9yZXMtdGVjaG5pY2FsLWFuZC1lY29ub21pYy1mb3VuZGF0aW9ucy1vZi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "New Class Explores Technical And Economic Foundations Of Bitcoin - Texas A&M University Today",
        "content": "A new course offered at Texas A&M University this semester is “The Bitcoin Protocol” in which students learn about the technical and economic foundation of the much-talked about cryptocurrency.\n\nThe first of its kind at Texas A&M, the class is open to accounting and computer science students and is being taught by Mays Business School Associate Professor of Accounting and Founder of the Mays Innovation Research Center Dr. Korok Ray.\n\n“Bitcoin is an interdisciplinary project, and I was pleased to see the Mays Business School and the College of Engineering adopt an interdisciplinary mindset in approving this class,” Ray said.\n\nBenefits To Students\n\nAlthough there are other blockchain classes offered at Texas A&M in computer science and computer engineering, Ray’s course is the first to focus specifically on Bitcoin.\n\nThe class will cover all aspects of Bitcoin, such as the underlying technology, the game theory, the macroeconomics, and the application of cryptography.\n\nRay — whose research interests are accounting, game theory and technology — said the class is primarily for undergraduates to provide hands-on experience with Bitcoin. “The students will learn to code portions of the Bitcoin protocol from scratch, which is in itself a great learning experience,” he said.\n\nLearning about this “emerging economy” will open opportunities for students, Ray said.\n\n“The Bitcoin economy is booming, especially in Texas,” he said. “This class can prepare students for the growing Bitcoin mining industry, much of it in Texas. On top of this, Austin is becoming a hub for Bitcoin developers.”\n\nFrom an academic standpoint as well, much can be gained, Ray said. “First, Bitcoin is a novel way of storing and transferring value that has vast implications for finance and economics,” he said. “Bitcoin builds on decades of science and is itself a comprehensive learning tool across multiple disciplines. And Bitcoin is a zero-to-one, radical innovation that emerged outside of the traditional corridors of power and influence, and is therefore a deeply inspiring story of human achievement.”\n\nCrypto Controversies\n\nCryptocurrencies like Bitcoin have both proponents and doubters, as any sweep of social media or cable news channels will reveal. One thing everyone seems to agree on is the current state of affairs — a so-called “crypto winter,” meaning the market is performing poorly. The highly publicized FTX fiasco arguably added flame to the fire.\n\n“The current crypto winter will prove the difference between a decentralized protocol like Bitcoin and a centralized company like FTX that is subject to fraud and abuse,” Ray predicts. “I am confident that Bitcoin will emerge out of these ashes, but don’t trust me on that — verify for yourself.”\n\nCross-discipline Collaboration\n\nRay said faculty in both Mays and Engineering are to be credited with the creation of the Bitcoin class, namely Scott Schaefer of the Department of Computer Science and Nate Sharp of the Department of Accounting.\n\n“Leadership like this is vital to exposing students to the frontiers of new innovation, which happens precisely in between existing academic disciplines,” Ray said."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMjAvYml0Y29pbi1oYXMtY2xpbWJlZC1tb3JlLXRoYW4tMTBwZXJjZW50LXRoaXMtd2Vlay1vdXRwZXJmb3JtaW5nLXN0b2Nrcy5odG1s0gFvaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDEvMjAvYml0Y29pbi1oYXMtY2xpbWJlZC1tb3JlLXRoYW4tMTBwZXJjZW50LXRoaXMtd2Vlay1vdXRwZXJmb3JtaW5nLXN0b2Nrcy5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin has climbed more than 10% this week, outperforming stocks - CNBC",
        "content": "Cryptocurrencies rose this week even as U.S. equities briefly retreated from their new year rally and a major crypto lender submitted a long awaited bankruptcy filing.\n\nBitcoin was last higher by about 12% for the week, according to Coin Metrics, while ether has risen 14%.\n\nBy comparison, two of the three major stock averages were on track to post a losing week, which has been shortened for the Martin Luther King holiday. The S&P 500 and Doe Jones Industrial Average were last down 0.9% and 2.9%, respectively, for the week. The Nasdaq Composite, however, has been the outperformer. It's up slightly for the week and has gained 5% for the year, leading the other big indexes.\n\nBitcoin and ether rose 2.73% and 2.15%, respectively, in the same four-day period.\n\n\"Bitcoin seems to be trading along with the Nasdaq and risk assets again, after the past months of decoupling,\" said Sylvia Jablonski, CEO and chief investment officer at Defiance ETFs. \"This is good news for crypto investors in that if inflation is falling, and the Fed is closer to the end than the beginning of economic tightening, risk assets will catch a breath of fresh air and perhaps lure investors back in.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDEvMjAvb3Bpbmlvbi9iaXRjb2luLWdvbGQtaW5mbGF0aW9uLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Opinion | Is Bitcoin Replacing Gold? Maybe It’s Exactly the Opposite. - The New York Times",
        "content": "Jamie Dimon, the chief executive of JPMorgan Chase, recently had a few things to say about cryptocurrency. Bitcoin, he declared, is a “hyped-up fraud”; it’s a “pet rock.”\n\nTell us what you really think, Mr. Dimon.\n\nActually, Dimon seems to share the same view of Bitcoin that I and many other economists have had all along: The digital “currency” isn’t really a currency. That is, it can’t be used as a medium of exchange — there are very few things you can buy directly with Bitcoin — and it isn’t a stable store of value with reasonably predictable future purchasing power. So it’s basically useless — as Dimon says, it’s a pet rock.\n\nHowever, one concern that has long nagged at sophisticated crypto skeptics is that most of the negative things one could say about Bitcoin can also be said about gold. You can’t buy groceries, or even a house, with gold ingots. And historically the purchasing power of gold has been highly unstable. Here’s a chart from Macrotrends of the real price of gold — the price divided by the Consumer Price Index — since 1970:"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi10b3BzLTIxay1vdXRzaGluZXMtc3AtNTAwLWdvbGQv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8yMC9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLXRvcHMtMjFrLW91dHNoaW5lcy1zcC01MDAtZ29sZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin, Ether Rise Slightly After Genesis' Chapter 11 Filing - CoinDesk",
        "content": "Genesis Global Holdco LLC, the parent company of troubled cryptocurrency lender Genesis Global Capital, filed for Chapter 11 bankruptcy protection late Thursday after being pummeled by two of 2022's biggest industry collapses, those of hedge fund Three Arrows Capital and exchange FTX. In its filing, Genesis Global Capital, the partner firm of Gemini's defunct interest-bearing Earn program, estimated it has more than 100,000 creditors and between $1 billion and $10 billion in liabilities, as well as assets. Genesis owes over $3.5 billion to its top 50 creditors, including crypto exchange Gemini, trading giant Cumberland, investment firm Mirana, MoonAlpha Finance and VanEck’s New Finance Income Fund. Genesis and CoinDesk are both owned by Digital Currency Group, or DCG."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTIxL2JpdGNvaW4tcmVhY2hlcy1oaWdoZXN0LXNpbmNlLWF1Z3VzdC1hbWlkLXNlY29uZC13ZWVrZW5kLXN1cmdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Cryptocurrency (Crypto) Lunar New Year News - Bloomberg",
        "content": "Bitcoin rallied to its highest levels since August ahead of celebrations for the Lunar New Year holiday throughout Asia, surging at the start of the weekend for a second straight time.\n\nThe largest cryptocurrency rose as much as 2.1% to $22,786, the highest level since Aug. 18. It also had strong gains over Friday and Saturday last weekend. Second-ranked Ether advanced as much as 2.4% to levels not seen since September. This comes amid more predictions that the cryptocurrency market has passed its lows, and at the start of the Lunar New Year holiday celebrated across much of Asia, also often referred to as Chinese New Year."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXVwLTIxLWJlc3Qtd2Vla2x5LXBlcmZvcm1hbmNlLWZlYi0yMDIxLWJ1bGwtcnVuLWJ1bGwtdHJhcC_SAW5odHRwczovL2Zvcmthc3QubmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi11cC0yMS1iZXN0LXdlZWtseS1wZXJmb3JtYW5jZS1mZWItMjAyMS1idWxsLXJ1bi1idWxsLXRyYXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin up over 21% in best weekly performance since Feb. 2021. Bull run or bull trap? - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, rose 21.7% from Jan. 11 to Jan. 18, trading at US$21,212 at 2 p.m. on Wednesday in Hong Kong. Ether gained 18% in the same timeframe, changing hands at US$1,576.\n\nWith Bitcoin above the US$21,000 mark, the world’s benchmark cryptocurrency has returned to its price level from before the Nov. 11 collapse of the FTX cryptocurrency exchange. BTC prices have since slipped, trading at US$20,935 at 4.30 p.m. on Friday in Hong Kong.\n\nKasper Vandeloock, the chief executive officer of quantitative trading firm Musca Capital, attributes the recovery to “slower inflation, interest from venture capitalists and the tech sector.”\n\nChris Bradbury, chief executive officer of DeFi capital management protocol Oasis, said inflation may have peaked in developed countries and this is the primary driver for crypto and traditional markets. “The feeling also seems to be that the expected recession this year won’t be as deep as initially thought,” he said in an email response to questions.\n\nBradbury said Bitcoin and Ether are rallying because of the bullish momentum in traditional markets. “Bitcoin, along with most crypto assets, are still heavily correlated and priced like tech stocks, and we have seen most of these also increase in the last few weeks too, but often crypto prices move at an exaggerated rate.”\n\nVandeloock said that the crypto market is seeing some relief after a difficult year: “Many traders got aggressively short after FTX’s insolvency and they are now looking to get out of their position,” wrote Vandeloock, adding that “Ether has been able to find a bottom sooner than BTC, because of the Merge and interest from DeFi. BTC is simply catching up to what ETH has already done.”\n\n“The impressive price action seen in Bitcoin is clear evidence that investors are now positively accumulating the coin,” Abraham Piha, chief executive officer of Tomi, an anonymous decentralized autonomous organization (DAO), wrote to Forkast. “With Bitcoin mining activity increasing, as evidenced by the recent all-time high in hashrate, it is clear that miners ran out of coins to sell, resulting in more coins for investors to buy.”\n\nSolana’s native token was the week’s biggest gainer among the 10 largest non-stablecoin cryptocurrencies, up 39.3% on the weekly chart, trading at US$22.\n\nThe global crypto market cap exceeded US$1 trillion on Jan. 15, for the first time since Nov. 8, according to CoinGecko data. Bitcoin’s US$409 billion market cap currently accounts for 39.86% while Ether makes up 18.5% of the total market cap.\n\nMetaverse tokens gain momentum\n\nDecentraland’s MANA rose 71.1% this past week to trade at US$0.69. This represented the biggest weekly gains in the entire crypto market, according to CoinGecko data. The Sandbox’s native token, SAND, also rallied 42.3%, to change hands at US$0.74.\n\n“The metaverse is the new buzzword in the broader digital and tech ecosystem, and related tokens are benefiting from it. Many investors believe that metaverse protocols will be a major entry point into Web3 for billions of people, so the underlying tokens’ appeal has grown even stronger this year,” wrote Piha.\n\nVandeloock attributes this surge to the low liquidity of metaverse coins: “People were looking to play altcoins since many were double-digit green over the last few weeks. These metaverse coins are illiquid and have low volume making them the perfect market to play at these times.”\n\n“The liquidity of metaverse tokens is incredibly low, and as always when there are fairly large market movements, you will see lower liquidity tokens have larger than average swings, however, it often isn’t sustainable,” wrote Bradbury.\n\n“If you look at Uniswap, SAND only has US$1.5 million of value locked, MANA even less at US$640,000 – so again, short-term views to try and find conclusions like this are very difficult. The real test will be if things like SAND and MANA can sustain the excess gains they achieved over the next 30-60 days against BTC and ETH,” added Bradbury.\n\n“As Bloomberg’s market strategist, Mike McGlone, correctly pointed out, the current massive Federal Reserve tightening is a significant selling point that has been driving the price of BTC and the market as a whole. With their positive fundamentals, many altcoins are also contributing to the underlying market push,” wrote Piha.\n\nWhat’s in store for next week?\n\n“Last week, the crypto market cap crossed US$1 trillion several times. We can expect the industry valuation to form support at US$1 trillion while pushing for new highs. However, investors should be wary of monetary tightening in the near term due to interest rate hikes around the world,” wrote Piha.\n\n“The biggest effects on the price of the markets last year came from highly unexpected events, such as 3AC, FTX and so on. It’s likely the recent gains that appeared over the last two weeks will pull back slightly though, this is often what we see during uncertain times – the main question will be if the markets can at least hold onto some of the gains made,” wrote Bradbury, adding that “there is still a lot of uncertainty in traditional markets,” and that the industry “has a lot of trust to get back from all of its issues last year involving centralized parties such as 3AC, FTX and Genesis.”\n\nDespite last year’s events rocking the trust in centralized crypto companies and the wider crypto industry, Bitcoin’s 23% rally in the week through Jan. 15 represents its best weekly performance since Feb. 2021. According to Bloomberg analysts, this usually signals the start of a bigger rally: “Weekly climbs of at least 20% occurred nine times in the past five years, after which the token added an average of 40% over three months.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzIwL2JpdGNvaW4tbWluZXItMXRoYXNoLXNlbnQtYWxtb3N0LWFsbC1pdHMtYnRjLXRvLWJpbmFuY2Uv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDEvMjAvYml0Y29pbi1taW5lci0xdGhhc2gtc2VudC1hbG1vc3QtYWxsLWl0cy1idGMtdG8tYmluYW5jZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner 1Thash Sent Almost All Its BTC to Binance - CoinDesk",
        "content": "The conventional wisdom among crypto traders is that large BTC inflows from miners to exchanges like Binance is a bearish signal that miners may be preparing to sell BTC. The implication is that the recent crypto rally may have pushed prices to a level that’s too impossible to resist, especially with profit margins compressed in recent months by the crypto winter."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1kaXBzLWJlbG93LXVzMjEwMDAv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvbWFya2V0cy1iaXRjb2luLWRpcHMtYmVsb3ctdXMyMTAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin dips below US$21,000 - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvY3J5cHRvLW1hcmtldHMtdG9kYXktYml0Y29pbi1zdXJnZXMtYWJvdmUtMjJrLWdlbmVzaXMtaGFzLW92ZXItNWItaW4tbGlhYmlsaXRpZXMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvY3J5cHRvLW1hcmtldHMtdG9kYXktYml0Y29pbi1zdXJnZXMtYWJvdmUtMjJrLWdlbmVzaXMtaGFzLW92ZXItNWItaW4tbGlhYmlsaXRpZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Today: Bitcoin Surges Above $22K, Genesis Has Over $5B in Liabilities - CoinDesk",
        "content": ", which collapsed in the summer of 2022. That loss came out of the Genesis Asia Pacific unit (that also filed for bankruptcy), which managed Genesis’ lending relationship with 3AC. At the time of 3AC going under, Genesis had $2.4 billion in outstanding loans to the fund, of which Genesis was able to recover just half, according to the filing."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzIwL2NyeXB0by1tYXJrZXRzLWFuYWx5c2lzLWJpdGNvaW4tZXRoZXItdG9wLXdlZWtseS1sZWFkZXJib2FyZC1idXQtc29tZS1pbmRpY2F0b3JzLXN1Z2dlc3QtYS1tYXJrZXQtcmV0cmVhdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin, Ether Top Weekly Leaderboard, but Some Indicators Suggest a Market Retreat - CoinDesk",
        "content": "CNE’s decline departs from recent performance, and still remains the top performing sector for the month. The index itself is designed to capture price movements of assets within the virtual world, gaming, metaverse, art and social network universe. Notable assets include AXIE, APE and LPT."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvYml0Y29pbi1zb2Fycy1vdmVyLTIyay10by1yZWFjaC1mb3VyLW1vbnRoLWhpZ2gv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8yMC9iaXRjb2luLXNvYXJzLW92ZXItMjJrLXRvLXJlYWNoLWZvdXItbW9udGgtaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Soars Over $22K to Reach Four-Month High - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9hLWJ1bGxpc2gtY2FzZS1mb3ItYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "A Bullish Case for Bitcoin | Video - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAxLzIwL2NyYWlnLXdyaWdodHMtYmxhY2tsaXN0LXJlc2VtYmxlcy1iaXRjb2luLWtpbGwtc3dpdGNoLXNhdG9zaGktbmV2ZXItZm9sbG93ZWQtdGhyb3VnaC1vbi_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMS8yMC9jcmFpZy13cmlnaHRzLWJsYWNrbGlzdC1yZXNlbWJsZXMtYml0Y29pbi1raWxsLXN3aXRjaC1zYXRvc2hpLW5ldmVyLWZvbGxvd2VkLXRocm91Z2gtb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Craig Wright’s Blacklist Resembles Bitcoin ‘Kill Switch’ Satoshi Never Followed Through On - CoinDesk",
        "content": "“Imagine someone stole something from you. You can't get it back, but if you could, if it had a kill switch that could be remote[ly] triggered, would you do it?” Satoshi wrote in the Bitcoin Talk post. “Would it be a good thing for thieves to know that everything you own has a kill switch and if they steal it, it'll be useless to them, although you still lose it too? If they give it back, you can reactivate it.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTIwL2NyeXB0by1sYXRlc3QtYml0Y29pbi1pbmNyZWFzZXMtdGhyZWUtYXJyb3dzLWZvdW5kZXJzLXdhbnQtc3RhcnR1cC1mdW5kaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Latest: Bitcoin Increases, Three Arrows Founders Want Startup Funding - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nIs crypto back? That’s one question Bloomberg editors and reporters discuss in another This Week in Crypto episode. Already, the year is packed with digital asset action. Bitcoin is up nearly 30% so far in 2023. Lots of smaller tokens have climbed even more than that. Suddenly, crypto enthusiasts are uttering words like FOMO — Fear of Missing Out — again.\n\n\n\nThen there are some crypto comebacks happening. Or, at least, attempted comebacks. The guys behind 3AC, Three Arrows Capital, the cryptocurrency hedge fund credited in some circles with launching the crypto winter, are seeking funding for a new startup. Crypto Twitter has not been kind."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpbmFuY2UtYW1vbmctdG9wLXJlY2VpdmVycy1iaXR6bGF0by_SAT5odHRwczovL2Zvcmthc3QubmV3cy9iaW5hbmNlLWFtb25nLXRvcC1yZWNlaXZlcnMtYml0emxhdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Binance among top Bitcoin receivers of Bitzlato, FinCEN says - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9odXQtOC1taW5pbmctY2VvLW9uLWNyeXB0by13aW50ZXItYml0Y29pbnMtcHJlc2VuY2UtYXQtZGF2b3MtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Hut 8 Mining CEO on Crypto Winter, Bitcoin's Presence at Davos 2023 - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJhbGx5LXByb3ZpZGVzLW11Y2gtbmVlZGVkLXJlbGllZi1mb3ItYnRjLW1pbmVyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price rally provides much needed relief for BTC miners - Cointelegraph",
        "content": "Bitcoin mining powers network transactions and BTC price. During the 2021 bull run, some mining operations raised funds against their Bitcoin ASICs and BTC reserves.\n\nMiners also preordered ASICs at a hefty premium and some raised funds by conducting IPOs.\n\nAs the crypto market turned bearish and liquidity seized within the sector, miners found themselves in a bad situation and those who were unable to meet their debt obligations were forced to sell the BTC reserves near the market bottom or declare bankruptcy\n\nNotable Bitcoin mining bankruptcies in 2022 came from Core Scientific, filing for bankruptcy, but BTC’s early 2023 performance is beginning to suggest that the largest portion of capitulation has passed.\n\nDespite the strength of the current bear market, a few miners were able to increase production throughout 2022 and on-chain data shows Bitcoin miner accumulation began to increase in December 2022 and momentum appears to be continuing into 2023.\n\nBitcoin’s rally to $22,000 improves miner margins\n\nThe 2023 Bitcoin rally which saw BTC price hit a yearly high of $22,153 on Jan. 20, a 17% 7-day increase, has significantly helped BTC mining operations.\n\nAn increase in Bitcoin price and the network’s hashprice are helping BTC miners that kept net positive balances at the end of 2022 which is improving business stability. In addition, now Bitcoin miners are mostly back in profit.\n\nPublic miners Bitcoin sold vs mined. Source: Hashrate Index\n\nWhile more miners are turning back on Bitcoin mining rigs, the difficulty is increasing which may hinder future upside. With conditions improving will Bitcoin miners continue to accumulate or continue the trend of selling?\n\nRecapping 2022, Jaran Mellerud a Bitcoin mining analyst for Luxor Mining said:\n\n“Between January and November, the public miners offloaded 51,180 bitcoin, while producing 47,284 bitcoin.”\n\nBTC hashprice, a metric that measures the market value of mining or computing power, provides insight into Bitcoin mining operations’ profitability.\n\nSince Jan. 1, 2023, hashprice is up by over 20% and on Jan. 19. Bitcoin mining’s profitability grew from $0.06 per Terra Hash per day (TH/d) to $0.07874 TH/d and this has benefited from BTC’s price rally. Hashprice has not witnessed the recent levels since early October 2022.\n\nBitcoin hashprice. Source: Hashrate Index\n\nAlthough Bitcoin mining profitability has improved since the start of 2023, the industry is still facing rough waters ahead. According to Nico Smid, co-founder of Digital Mining Solutions:\n\n“The recent increase in hashprice is positive, but many miners are still operating on thin margins. A year ago, the hashprice was at $0.22/TH/day. While the market has reached its lowest point, the current economic conditions for mining remain challenging.”\n\nBitcoin miners are still selling the bulk of their mined BTC\n\nBitcoin miners are benefiting from the uptick in price and data shows many are continuing to sell their rewards.\n\nBitcoin miner positions and revenue. Source: CryptoQuant\n\nThe most robust mining operations actually limited debt and expansion or used a strategy of selling minded BTC while in profit. Using self-reported data, Anthony Power, Bitcoin mining analyst for Compass Mining, compiled a list of miners reserves at the start of the year versus the end of the year.\n\nA year that started with so much promise and optimism and ended with several high profile bankruptcies, with more likely more to follow.\n\n\n\nHere's part 1 of #BTC Mining's year in review for @compass_mining which looks at some of the biggest stories in 2022https://t.co/cbFm8gFmR4 pic.twitter.com/Uyz6iitZRU — Anthony P⭕️wer (@cazenove_uk) December 23, 2022\n\nMarathon Digital, the top holder out of the listed Bitcoin mining companies, held 8,133 BTC at the end of December 2022. The company is planning to increase production based on hashprice profitability to further their advantage.\n\nMining difficulty could hinder profits in the future\n\nWith more Bitcoin miners turning their BTC rigs back on, the mining difficulty metric adjusted upward by 10.26% on Jan. 16. Bitcoin difficulty indicates the time and cost to mine BTC in order to receive rewards. The adjustment was the largest since October 2022 and the increase in difficulty makes it more expensive for Bitcoin miners to earn rewards through the proof-of-work (PoW) consensus mechanism.\n\nBitcoin mining difficulty. Source: Hashrate Index\n\nWith the upcoming Bitcoin halving event due in 2024, mining BTC will become even more difficult and possibly more expensive for miners, providing more stress on already thin margins. On the upside, the last halving event in 2019 was followed by a 300% gain for BTC the year before.\n\nWhile miners are currently seeing some relief after a tough year, potentially rough roads lie ahead. The business operations are seemingly improving with Bitcoin miners selling for profits rather than taking on debt against Bitcoin holdings.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1pbi1hLXVuaXZlcnNpdHktZG9ybS1hLWNvb2xlci1idGMtc3RvcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining in a university dorm: A cooler BTC story - Cointelegraph",
        "content": "The humble university dorm is a place for students taking their undergraduate degrees to study, rest, make new friends, host wild dorm parties and, of course, mine Bitcoin (BTC).\n\nA master’s student in market research and self-described “data guy,” Blake Kaufman, has hooked up an S9 Bitcoin miner to the Bitcoin network.\n\nHe won the S9 miner in a raffle at a mid-Michigan Bitcoin meetup and immediately set about learning how to use it.\n\nBlake has consistently shown up to every https://t.co/2Q6OuIwW4O event with at least one friend, a tremendous attitude, and unmatched enthusiasm.\n\n\n\nGlad you won the S9 raffle!\n\n\n\nHash away at those KYC free sats, and enjoy the heat this winter! https://t.co/AQNzDjnDGC — Mid-Michigan Bitcoin (@517Bitcoin) November 17, 2022\n\nDuring a video call with Cointelegraph, Blake joked that he knew next to nothing about mining prior to the raffle. The moment he won, he raced to the nearest place offering a power cable and an ethernet connection to try it out, his dad’s office.\n\n“We turned it on, never hearing one [an S9] before. And if you know, when they start, they immediately rev up to 100% and we’re all just in the room like — oh my gosh — this thing is loud! We ran it for probably two hours and we walked into that office and it was hot.”\n\nThe hot and noisy realization kicked his brain into gear. The Michigan winter was fast approaching and his university provides free electricity. Why not mine Bitcoin from a dorm and take advantage of the waste heat? There was one minor but audible hurdle to overcome. “How can we fix the noise,” he questioned.\n\n“I just looked up online, like, how to noise cancel S9, and this picture of a cooler on Pinterest popped up. Me and my Dad were like, ‘Let's build it. Why not?’ So we bought a $5 cooler on Facebook Marketplace and we had the tubes in our attic and we spent about two hours drilling holes and it ended up working.”\n\nThe pair constructed the Bitcoin mining cooler box, which now takes up residence in Blake’s dorm. The finished product would not look out of place in any dorm room and is “actually quieter than an air conditioning unit,” he explains.\n\nTwo angles of the cooler-encased Bitcoin miner.\n\nBut aren’t there rules against this sort of thing at university? Won’t the energy-hungry Bitcoin miner put a dent in the university’s electricity overhead?\n\n“So the miner is about 900 watts an hour, a mini fridge is about 60 to 100 watts a day. So it’s pulling a decent amount of electricity there. I looked up all the rules and it didn’t say anywhere you couldn’t mine a Bitcoin or use a Bitcoin miner. So if they say you can’t do this, I’d be like, okay, you didn’t say I couldn’t.”\n\nIn a nutshell, Blake’s not breaking any rules. What’s more, one miner in one dorm in a large university home to thousands of students is unlikely to raise suspicion. It’s an ode to the famous saying attributed to Rear Admiral Grace Hopper that sometimes, “It is better to ask for forgiveness than permission.”\n\nThe ASIC S9 now whirrs away, generating roughly 0.000001 BTC or 100 satoshis — the smallest amount of a Bitcoin — per Bitcoin block, which occurs on average every 10 minutes. It translates to “about a dollar a day” in fiat-money terms. It’s a paltry amount but not to be sniffed at as a student.\n\nBlake’s total outlay to start his Bitcoin mining venture was a coolbox and a few cables at less than $20 and he can probably reuse the cooler come summertime.\n\nThe mining cooler interior.\n\nIncidentally, Blake’s next challenge is to work out what to do when the weather improves and the mercury rises. Peak summer days in Michigan can hit 95 degrees Fahrenheit (35 Celsius). As a result, the outside air temperature will not cool the miner, a vital part of its operation:\n\n“So I'll have to figure out something, maybe put it in a box of ice cubes and then something like that. I don't know yet.”\n\nBlake has already considered using the Bitcoin miner to heat his family home after graduation. The idea, Blake explains, is to experiment with whether he can offset the gas cost at home and make it profitable. “It’s just unfortunate because, in Michigan, our electricity cost is $0.14 a kilowatt hour.”\n\nMichigan’s energy costs are relatively high in the United States, as shown by a darker purple color. Source: Chooseenergy.com\n\nElectricity and heating costs are higher in Michigan than in energy-producing states like Texas. Using the waste heat from Bitcoin mining could be a way of offsetting the energy costs.\n\nRelated: The Bitcoin shitcoin machine: Mining BTC with biogas\n\nIndeed, tapping into Bitcoin miner waste heat is a growing trend, particularly prevalent for at-home or “chicken shack miners,” as they’re known. BTC Gandalf from the Braiins marketing team told Cointelegraph:\n\n“Chicken shack” miners are the backbone of the Bitcoin network hash rate. It’s incredible to see all the different ways they come up with to mine. They provide an invaluable service in keeping hash rate decentralized.”\n\nArmed with oodles of Bitcoin knowledge, Blake has since tried to orange pill his classmates and even professors. Unfortunately, some of them hold the belief that “Bitcoin is a scam.” He has taken it upon himself to set the record straight:\n\n“I’m emailing those teachers being like, Hey, office hours, when are they? Let’s have a chat. You can’t just come out and say Bitcoin is a scam with a Bitcoiner in the room.”\n\nIn the meantime, the S9 is whirring away in his dorm room, contributing to a network Blake strongly supports and generating 100% “free money.“\n\nWell, “Other than the $30,000-a-year tuition I pay, but it’s 100% free electricity,” he joked."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWR1ZS1uZXctYmlnLXJhbGx5LWFzLXJzaS1jb3BpZXMtMjAxOC1iZWFyLW1hcmtldC1yZWNvdmVyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin due new 'big rally' as RSI copies 2018 bear market recovery - Cointelegraph",
        "content": "Bitcoin (BTC) is in for a new “big rally” as market strength copies conditions from after the 2018 bear market.\n\nAccording to the latest analysis, BTC/USD will continue to head higher “after some consolidation” thanks to key signals from its relative strength index (RSI).\n\nBitcoin prints never-before-seen bullish divergence\n\nWith the BTC price gains still coming, Bitcoin bulls are feeling increasingly confident despite widespread mistrust of the longevity of the current rally.\n\nFor popular trader Crypto Wolf, a key phenomenon now underway sets Bitcoin’s latest recovery apart from all others.\n\nRSI, he noted on Jan. 18, had printed a long-awaited bullish divergence on weekly timeframes — something which has never happened before.\n\n“BTC printed a rare weekly RSI bullish divergence. Never happened in BTC history, a once in a life opportunity,” he summarized on Jan. 21.\n\nRSI is a fundamental gauge used by traders to determine whether an asset is overbought or oversold at a given price. The weekly print has been long in the making, with Cointelegraph reporting on its arrival in advance at the end of last year.\n\n“Technicals were there, charts were screaming bottom but as usual majority was in full bear mode,” Wolf added.\n\nBTC/USD 1-week candle chart (Bitstamp) with RSI. Source: TradingView\n\nAnalyst: \"Some consolidation\" will precede upside\n\nWith that, Bitcoin is beginning to repeat the kind of renaissance last seen at the end of its previous bear market in early 2019.\n\nRelated: Dead cat bounce? Bitcoin price nears $23,000 in fresh 5-month high\n\nTrader and analyst Trader Tardigrade, also known as Alan on social media, thus predicts that the good times will continue for a while to come.\n\n“BTC has been repeating the pattern in RSI and Price Action to 2019 bottom,” he told followers last week.\n\n“On daily chart, 1. RSI Strong uptrend to overbought zone 2. $BTC had a significant drop before that 3. Sudden buyers bought up $BTC. Big rally will be following after some consolidation.”\n\nBTC/USD annotated chart. Source: Trader Tardigrade/ Twitter\n\nDaily RSI stood at near 87 at the time of writing, Data from Cointelegraph Markets Pro and TradingView showed.\n\nThis is its highest since January 2021, months before BTC/USD set new all-time highs of $58,000 in April and $69,000 in November.\n\nBTC/USD 1-day candle chart (Bitstamp) with RSI. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV5ZXMtMjEtNGstem9uZS1hcy1hbmFseXN0LXByZWRpY3RzLWJ0Yy1wcmljZS13aWxsLWNoYXNlLWdvbGTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin eyes $21.4K zone as analyst predicts BTC price will chase gold - Cointelegraph",
        "content": "Bitcoin (BTC) rose toward new multi-month highs on Jan. 20 as analysis predicted a new trading range above $18,000.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBitcoin price range \"well defined\"\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD testing but preserving support at $21,000.\n\nThe pair edged higher at the Wall Street open, in line with United States equities as the third trading week of an explosive January drew to an end.\n\nDespite misgivings over the rally’s fundamental strength, Bitcoin continued to avoid significant corrections, with exchange order book analysis revealing $23,000 as the next big resistance zone to crack.\n\n“I view the lack of BTC liquidity below $18k and above $23k as a lack of sentiment for those levels at this time,” on-chain monitoring resource Material Indicators wrote in part of commentary about the Binance order book setup.\n\n“Nothing changes sentiment like price moving through support or resistance, but for now, the trading range is well defined.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nAn accompanying chart also revealed significant bid support in place at just above the psychologically significant $20,000 mark.\n\nIn terms of short-term targets, popular trader and analyst Crypto Ed hoped for a trip to $21,500 before a turnaround with a downside target of $19,800.\n\n“I still believe that we will get there, and maybe we are already on our way over there,” he said in a YouTube update on the day.\n\nThe area around $21,400 was equally important for fellow trader CJ, who told Twitter followers that this would be a suitable place to “tag longs.”\n\nAnalyst: Bitcoin should \"close gap\" with gold\n\nZooming out, others focused on continued impressive moves by safe haven gold, which had hit a new nine-month high on Jan. 19.\n\nRelated: Bitcoin can pass $30K before setting new bear market low — forecast\n\nIn a Twitter debate, analysts eyed a potential continued game of catch-up between gold and Bitcoin, which researcher and data analyst James V. Straten argued had been a “mirror image” of each other in 2022.\n\n“My bet BTC closes that gap soon,” he said while discussing the market implications of Federal Reserve policy.\n\nStraten added that BTC/USD had already “retraced the entire FTX collapse and approaching the end of the narrative for DCG,” referring to ongoing problems for crypto finance conglomerate, Digital Currency Group.\n\nBTC/USD vs. XAU/USD 1-day line chart. Source: TradingView\n\nAs Cointelegraph reported, expectations previously called for a copycat move on Bitcoin after gold took an early lead in recovering from lows.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vcHJvcHJpdmFjeS5jb20vdnBuL2NvbXBhcmlzb24vYmVzdC12cG4tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "5 Best VPNs for Bitcoin Payments in 2024 - ProPrivacy",
        "content": "Paying for your VPN subscription with Bitcoin instead of a credit card is a good way to bolster your privacy at the time of purchase. However, not every VPN service accepts bitcoin and other cryptocurrencies (either directly or through an intermediary). In this guide, we have rounded up five of the industry's best services that also accept payment via cryptocurrency for anyone that wants to take an extra step to improve their online privacy.\n\nWhat are the best VPNs that accept Bitcoin?\n\nYou'll find our top VPN picks below – these services all accept Bitcoin payments, have been carefully vetted by our team of researchers, and come packed with privacy-enhancing features. Keep scrolling to check out our detailed reviews of each provider.\n\nExpressVPN - The best VPN for bitcoin payments. You get access to fast servers all over the globe with excellent encryption. TIP In our testing we checked that all ExpressVPN plans work for Netflix. The one year plan is the best value: three months free and a 30 day risk-free trial. NordVPN - The best value VPN for bitcoin payments, with a huge network of servers, superb encryption, and apps for all devices. Private Internet Access - The best secure VPN for bitcoin payments. Includes a proven no-logs policy and a full suite of customizable features. PrivateVPN - The cheapest VPN for bitcoin payments. Incredibly private and with zero-logs, lots of features, and strong encryption. Surfshark - The best multi-device VPN for bitcoin payments. Offers unlimited simultaneous connections and apps for all your devices.\n\n5 Best Bitcoin VPNs | In-depth analysis\n\nBelow we have listed the best VPN services that accept payment via Bitcoin, If you'd like any more information about these services, take a look at our in-depth review pages.\n\n1. ExpressVPN Editor's Choice | March 2024 www.expressvpn.com ExpressVPN is the best VPN for Bitcoin payments. Consistently quick and works with most major streaming services, and even offers a 30-day money-back guarantee. Pricing 12 months + 3 months FREE + Backblaze backup: $6.67/mth 49% OFF 6 months: $9.99/mth 1 month: $12.95/mth\n\nPros Accepts Bitcoin payments via BitPay Compatible with all devices – even routers! Superb OpenVPN encryption Works with in-demand streaming services Lots of advanced security features\n\nCons Subscriptions are comparatively expensive Only 5 simultaneous connections No free trial\n\nServer locations 160\n\nSpeeds 100.00 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.expressvpn.com\n\nExpressVPN Demo\n\nExpressVPN gives its customers the option to pay for a subscription with Bitcoin via BitPay, which is ideal if you're looking to stay as anonymous as possible! In addition, the service comes stuffed with security features that'll ensure that your personal details stay private. So, whilst an ExpressVPN isn't exactly a budget VPN, you're getting a quality service that consistently sets the bar for its industry peers – and you can try it without risking a single cent, thanks to a 30-day money-back guarantee.\n\nBrowsing with confidence, confidentially\n\nDigital security is going to be a priority for most folks interested in paying for their VPN subscription with Bitcoin – and ExpressVPN doesn't disappoint when it comes to safeguarding privacy. Strong OpenVPN encryption ensures that no third-parties (including your ISP, government, and network administrator) can take a peek at what you're doing online, and I'm glad to see that the ExpressVPN kill-switch, called Network Lock, is automatically activated when you boot up the VPN.\n\n\n\nExpressVPN customers paying with Bitcoin won't even need to reveal their real name\n\n\n\nAs you'd expect from a provider of ExpressVPN's caliber, it abides by a no-logs policy that has been independently audited, and should reassure Bitcoin investors that their connection logs, IP addresses, and browsing history are never stored, and can never be passed on to any nosey authorities. Furthermore, being based in the British Virgin Islands keeps ExpressVPN out of the reach of US and EU jurisdictions.\n\nA free web\n\nExpressVPN boasts an impressive server network with coverage across the globe in 104 countries . This is hugely important if you're going to be accessing streaming services that enforce geo-restrictions! Connecting to an ExpressVPN server is as easy as selecting the location from a list, and once you have, you'll likely be impressed by just how speedy the service is. Whenever I put ExpressVPN to the test, I find that pages load quickly and videos play smoothly, in HD, without any annoying buffering circles.\n\nCustomers will be able to browse the international catalogs of several in-demand streaming services; Netflix, BBC iPlayer, Amazon Prime, and Hulu included. ExpressVPN is also adept at unblocking any social media platforms that might be restricted or banned in your location (or workplace), so you can stay up to date with recent events and all your loved ones. The service's split tunneling feature comes in handy, too, if you'd like to stream geo-restricted content (or scroll endlessly through Twitter) whilst accessing local sites at the same time!\n\nQuality for a price\n\nFew VPN apps look as stylish as ExpressVPN's, frankly. They download in a flash and can be installed on pretty much any device you can imagine – and that includes smart TVs and consoles, as well as compatible VPN routers. ExpressVPN currently only allows 8 simultaneous connections, however, and other services are beginning to offer more for cheaper.\n\nExpressVPN is a premium provider with a premium price tag, and there's no getting around the fact – but you get what you pay for. ExpressVPN's security offering is stellar, and customers paying with Bitcoin won't even need to reveal their real name, seeing as a valid email address is all that's required. If you've got any burning questions or need help picking out which server suits your needs best, be sure to reach out to the ExpressVPN customer service team, available 24/7 via live chat and email. 2. NordVPN www.nordvpn.com NordVPN is the best value VPN for bitcoin payments. It provides watertight privacy, works with streaming services around the globe, and has a 30-day money-back guarantee. Pricing 24 months + 3 months FREE: $3.69/mth 70% OFF 12 months: $4.99/mth 59% OFF 1 month: $11.99/mth\n\nPros An audited no-logs policy and superb encryption Accepts Bitcoin, Ethereum, and Ripple payments Server coverage across the globe Superb 24/7 customer support\n\nCons Only 6 simultaneous connections Client UI sometimes has issues Torrenting servers could be easier to find\n\nAccepts Bitcoin? Yes\n\nServer locations 84\n\nSpeeds 58.69 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.nordvpn.com\n\nNord Demo\n\nNordVPN accepts payments via Bitcoin, Ethereum, or Ripple – so prospective customers have some real choice when it comes to paying for a subscription! Total online anonymity is an elusive content, but NordVPN can certainly shore up your security, with well-implemented encryption and a number of must-have features.\n\nAnd remember, you can take NordVPN for a test drive with its 30-day money-back guarantee.\n\nCustomize your privacy\n\nAs mentioned earlier, NordVPN gives cryptocurrency investors three ways to purchase their subscriptions with Bitcoin, and real privacy fanatics can even opt to pay for their plan with cash in a retail store! These options prove NordVPN's commitment to security and cement the provider as a top-notch choice, and its AES 256-bit encryption is practically uncrackable, too. In addition, NordVPN users get to choose from a number of protocols, though OpenVPN is the best pick for anyone who wants to keep a low digital profile. To that end, obfuscated (stealth) servers are available, and defeat deep packet inspection by making your VPN traffic look like regular HTTPS.\n\nNordVPN also has its very own customizable kill-switch and offers multi-factor authentication, which I very much recommend using, seeing as it'll make your account way harder for hackers to hijack. When it comes to logs, NordVPN's no-logs claim has been thoroughly audited, so you can rest assured that your identifiable details aren't being squirreled away somewhere. Plus, the service is based in Panama, where there are no mandatory data retention laws!\n\nBeat those restrictions\n\nAny VPN worth its salt will be able to unblock geo-restricted sites and services, and NordVPN is certainly one of the best in the business! Streaming fans will be able to enjoy international content from all the most popular services, like Netflix, BBC iPlayer, and Amazon Prime. In my experience, NordVPN has always been more than capable of handling HD streams – thanks to its unlimited bandwidth and servers in 61 countries . NordVPN's encryption also puts an end to ISP throttling, which can occur if your ISP figures out you're engaging in data-intensive tasks (like streaming or gaming) and decides to limit your bandwidth.\n\n\n\nNordVPN gives cryptocurrency investors three ways to purchase their subscriptions with Bitcoin\n\n\n\nIf you're more into torrenting, you'll be glad to learn that NordVPN supports P2P activity and port forwarding, so your downloads will be ready in a flash and won't land you in trouble.\n\nFeatures on features\n\nA single NordVPN subscription comes with a whole heap of features – double VPN is a particularly nice extra, and routes your traffic through two servers to double up your encryption. Similarly, NordVPN's ad-blocking CyberSec features remove annoying ads and malicious websites from your browsing sessions, so you won't have to worry about any accidental mis-clicks or lapses in judgement. Best of all, NordVPN subscriptions are pretty budget-friendly, especially if you invest in one of the long-term plans.\n\nThe service is fully compatible with most platforms, including Windows, Mac, Android, iOS, and Linux, and users get up to 6 simultaneous connections to play with. Similar to ExpressVPN, this isn't a wholly generous amount, but it's certainly enough to cover all of your most important devices. If you run into any trouble during the setup process, the NordVPN customer service team is on standby, 24/7, to help however they can! 3. Private Internet Access www.privateinternetaccess.com Private Internet Access is the most secure VPNs for Bitcoin. It is famously privacy focused, proving its no-logs claims in court, and offers a 30-day money-back guarantee. Pricing 24 months + 2 months FREE: $2.19/mth 82% OFF 6 months: $7.5/mth 38% OFF 1 month: $11.95/mth\n\nPros Accepts various crypto payments! OpenVPN and WireGuard protocols are available 10 simultaneous connections\n\nCons VPN newcomers might be overwhelmed by advanced options Based in the US No-logs policy has not been audited\n\nAccepts Bitcoin? Yes\n\nServer locations 84\n\nSpeeds 23.93 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.privateinternetaccess.com\n\nPIA Demo\n\nPrivate Internet Access (PIA) customers are spoiled for choice when it comes to Bitcoin payments! PIA subscriptions can be purchased via Bitcoin and Bitpay, Bitcoin Cash, and Ethereum and Litecoin – and to top it all off, PIA plans are modestly priced, especially if you opt for a long-term subscription.\n\nAs with all good VPNs, you'll be able to try PIA before you buy, with a 30-day money-back guarantee.\n\nIt's all in the name\n\nPIA has been a favorite of Reddit users for a long time, and has 10 years of experience in the VPN industry – and that's impressive longevity that's backed up by must-have security features. First and foremost, PIA's AES 256-bit encryption keeps all your browsing sessions secure, regardless of whether you're at home or on the go. OpenVPN and WireGuard protocols are available, and advanced users will even be able to dig in to some seriously customizable security options to tailor the service to their needs! However, even novice users will be able to make good use of the PIA kill-switch, which keeps your original IP address from leaking in the event of a VPN dropout.\n\n\n\nPIA accepts Bitcoin, Ethereum, and Litecoin payments\n\n\n\nI'm also glad to see that PIA is a no-logs provider that simply isn't interested in keeping hold of, or recording, user data. Less encouraging is the fact that this no-logs policy has not yet been audited – and the provider's US headquarters will surely make some users wary, too.\n\nSpeedy streaming\n\nPIA has a massive network of servers in 84 countries across the globe – though the service claims that it also has a \"domestic focus\" in the United States. This makes PIA a particularly good choice for anyone looking to unblock Netflix US, as well as other US-based streaming services, although PIA is more than capable of accessing all the most sought after streaming platforms! And, thanks to optimized servers and unlimited bandwidth, HD streaming is a breeze, online gaming goes smoothly, and P2P downloads finish in a flash (and torrenters should note that the provider also offers port forwarding).\n\nProtect your network\n\nCurrently, PIA is compatible with all devices; Windows, Mac, Android, iOS, and Linux included. The service also supports up to Unlimited simultaneous connections – which is double what you'd get with ExpressVPN or NordVPN! In the unlikely event that you have trouble getting PIA setup, you can call on the 24/7 customer service team to lend a hand.\n\nEarlier, I mentioned that cryptocurrency investors have a number of ways to pay for a PIA plan, and that's entirely true! The provider accepts Bitcoin, Ethereum, and Litecoin payments, and doubles down on its commitment to user privacy by allowing customers to purchase or renew subscriptions with gift cards. So, if you have a spare Starbucks, Walmart, or Best Buy gift card lying around, you might want to consider putting it towards a PIA plan! 4. PrivateVPN www.privatevpn.com PrivateVPN is the cheapest VPN for bitcoin payments. With exceptional security features and easy-to-use apps, as well as a 30-day money-back guarantee. Pricing 36 months: $2/mth 84% OFF 3 months: $6/mth 50% OFF 1 month: $9.99/mth 17% OFF\n\nPros Accepts Bitcoin payments Excellent OpenVPN encryption safeguards browsing sessions Supports P2P activity and even has port forwarding\n\nCons No-logs policy has not been audited A smaller pool of servers compared to industry peers No WireGuard support\n\nAccepts Bitcoin? Yes\n\nServer locations 200\n\nSpeeds 23.64 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.privatevpn.com\n\nPrivateVPN Demo\n\nPrivateVPN more than lives up to its name, and gives customers the option to purchase their plans with Bitcoins. A PrivateVPN subscription comes with some important security features and serious unblocking power, and we've always been impressed by how reliable this young service is, even when compared against long-standing industry titans.\n\nIf you'd prefer to try PrivateVPN for yourself, on your own devices, you can do so by making good use of the 30-day money-back guarantee. A 7-day free trial is also available, and won't require you to fork over any money at all!\n\nFeature rich\n\nThe last thing any cryptocurrency investor wants is their ISP monitoring every digital move they make. Luckily, PrivateVPN's AES 256-bit encryption can put a stop to this – and it's fantastic to see that the service also offers OpenVPN and IKEv2 protocols, which are widely considered to be secure, if somewhat resource-intensive. PrivateVPN's kill-switch works nicely with an auto-connect feature, meaning that if your VPN connection drops, you won't need to worry about your original IP leaking, and you'll be able to reconnect to the VPN in a blink.\n\n\n\nNetflix, BBC iPlayer, Amazon Prime, Hulu – you name it, and PrivateVPN can probably access it\n\n\n\nTorrenters will certainly appreciate that PrivateVPN offers port forwarding and dedicated stealth servers – and these come in handy for people living in restrictive regimes with limited access to the web. Likewise, IPv6 and DNS leak protection is a huge plus for the provider, just like its no-logs policy, although I'd like to see the service invest in a third-party audit to allay any lingering concerns.\n\nStream on\n\nIt'd be all too easy to dismiss PrivateVPN as a non-contender, given that it has a smaller pool of servers than its industry peers, but don't count the service out! All of its servers are incredibly quick, and I've always been able to stream smooth, HD content when connected to the service. On that note, PrivateVPN is adept at unblocking all the hottest services from across the globe. Netflix, BBC iPlayer, Amazon Prime, Hulu – you name it, and PrivateVPN can probably access it. I find PrivateVPN to be particularly good at unblocking restricted YouTube videos, that may not be available in your location or the victims of a network administrator's ban.\n\nCross-platform compatibility\n\nYou'll be able to download PrivateVPN apps for all Windows, Mac, Android, iOS, and Linux devices, and the VPN is also compatible with selected routers. Users get 10 simultaneous connections to use as they see fit, too. Again, I personally don't think that this is a lot, considering how many internet-enabled devices we tend to have in our homes, but it's a good start – and a good basis for improvement.\n\nGetting PrivateVPN setup is a breeze, although the VPN's customer service team is on standby during European business hours if you need help at any point during the process. I've reached out to the team on multiple occasions now, and always found their advice to be timely and well-researched – which is probably because the team is made up of in-house developers! So, remember that 7-day free trial, and put PrivateVPN through its paces without risking a single cent. 5. Surfshark www.surfshark.com Surfshark is the best multi-device VPN for bitcoin payments. Unlimited simultaneous connections, tons of features, and a 30-day money-back guarantee. Pricing 24 months + 2 months FREE: $2.3/mth 83% OFF 12 months: $3.99/mth 70% OFF 1 month: $12.95/mth\n\nPros Unlimited simultaneous connections Unblocks multiple Netflix libraries (and other streaming services) Bitcoin, Ethereum, and Ripple payments accepted\n\nCons Speeds are decent, but not chart-topping Free trial unavailable to Windows users No port forwarding – a big issue for torrenters\n\nAccepts Bitcoin? Yes\n\nServer locations 140\n\nSpeeds 56.10 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.surfshark.com\n\nSurfshark Demo\n\nNo longer the new-kid-on-the-block, Surfshark continues to impress us with top-notch security measures, including OpenVPN encryption and an audited no-logs policy. Bitcoin investors have several options when it comes to purchasing a subscription – and Surfshark's prices won't break the bank, either!\n\nThis low-cost VPN is well worth a try, and you can do so without risking your hard earned cash (or coins) by taking advantage of the 30-day money-back guarantee, or the 7-day free trial available to Android, iOS, and Mac users.\n\nPay your own way\n\nAs befits a good no-logs VPN service, you can pay for Surfshark using Bitcoin (plus Ripple and Ethereum) using either the Coingate or CoinPayments processors. For such a young service, this is an impressive amount of options, and should highlight Surfshark's intent to prove itself as an industry leader.\n\n\n\nAs befits a good no-logs VPN service, you can pay for Surfshark using Bitcoin (plus Ripple and Ethereum)\n\n\n\nWith Surfshark, you'll also benefit from strong OpenVPN encryption, which prevents any prying eyes from taking a look at your traffic or identifiable details. Whilst I'd always recommend the OpenVPN protocol to the security conscious, WireGuard is a superb alternative, and might be a better pick for folks who want a lightweight solution that balances speed and security. It's also great to see that Surfshark has its own kill-switch – you'll just need to enable it via the settings menu, first.\n\nCheck out international content\n\nIf you're an avid streamer, you're in luck. Surfshark has no trouble unblocking a long list of in-demand streaming platforms – including the likes of BBC iPlayer, Prime Video, and a whopping 15 international Netflix libraries. Users get to browse content from overseas in a click, too, and even access social media platforms that have been restricted or otherwise banned in their country, workplace, or school. Surshark is like a digital skeleton key – it'll unblock and unblock pretty much anything you can think of!\n\nBest of all, actually accessing these streaming platforms with Surfshark is a breeze thanks to a clean and intuitive user interface. Selecting a server is just as easy, too, and there are thousands to choose from! In fact, the VPN boasts coverage across an impressive 100 countries . I really like that Surfshark has a selection of stealth servers. These are invaluable for folks who need to mask their VPN usage, who are living with restrictive internet laws, or who need an additional layer of privacy.\n\nSay goodbye to limits\n\nSurfshark offers its users unlimited simultaneous connections – and that's serious value for money! It also means that you'll be able to secure all of the internet-enabled devices in your home, or even share the love with friends and family if you're feeling generous. Surfshark apps are also available for just about every platform, are compatible with smart TVs and games consoles, and can travel with you on your mobile phone. So, you've got round-the-clock protection no matter where you are or what device you're using.\n\nBe sure to take advantage of that 7-day free trial (though Winders users will have to miss out), and don't hesitate to contact the Surfshark customer service team with any questions or concerns – they're around 24/7, after all!\n\nWhat do we mean by a Bitcoin VPN?\n\nMost VPNs these days allow customers to pay for their subscriptions by using a credit or debit card – and the vast majority accept PayPal, too. Some VPNs may also accept online gift cards and even cash payments. However, very few VPNs are set up to accept Bitcoin payments.\n\nAll the providers in this guide allow subscribers to pay anonymously via Bitcoin – it's why we chose them in the first place. If done correctly, Bitcoin holders can purchase a VPN subscription without ever having to hand over their real payment details, bank info, or any other personally identifiable information. This adds a crucial extra layer of confidentiality for anyone looking to retain optimum levels of privacy when signing up for a VPN.\n\nHow to pay for a VPN with Bitcoin\n\nAs long as your VPN accepts Bitcoin, you'll be able to make your purchase by following the instructions provided at the checkout.\n\nBear in mind that these instructions may vary from VPN to VPN because different VPNs use different services to receive crypto payments. Speaking generally, however, the steps will be roughly along the lines of those listed below:\n\nPick a VPN provider – and we'd recommend sticking to one of our hand-picked services that definitely accepts Bitcoin payments. Navigate to the VPN website, select your subscription plan from the options provided, and choose Bitcoin as the payment option when asked. Follow the instructions for BitPay (or whichever third-party payment system the VPN uses). You can usually either login or checkout as a guest. If prompted, enter the appropriate details, such as your email address. You will now receive a Bitcoin address for making a payment and a QR code. You can either scan the QR code with your wallet, or use the wallet address to make the payment manually. Check the amount and confirm the transaction details in your wallet to send the payment to the third-party payment provider. As soon as the payment is confirmed, you'll get an email confirming receipt of the payment, and you can continue signing up for the VPN on its website (this can take up to 24 hours).\n\nHow can I make my Bitcoin wallet anonymous?\n\nIt's entirely possible to make a Bitcoin wallet anonymous. The majority of wallets are stand-alone programs that you run on your own PC and do not require you to supply any form of identification. This means that you can create a wallet address and begin receiving Bitcoin payments in a completely anonymous manner.\n\nThe first thing you'll need to do is to set up the wallet using a pseudonym (username) that's not tied to your real identity in any way. Next, you'll need to set up an email account for the wallet – and make sure that this isn't connected to your real-life identity either.\n\nIt's vital that you never access the wallet (or the email account) using your actual IP address, as this could allow you to be tracked. Instead, use a VPN to conceal your location (and therefore your identity). Any time that you intend to send funds from your wallet, you'll need to use a VPN to conceal the IP address the funds are being sent from during the transaction. This way, you can maintain your privacy and avoid exposing your identity.\n\nOne thing worth bearing in mind is that a VPN provider could, potentially, be leveraged to trace Bitcoin payments back to your real IP address. For this reason, it is vital to stick to a no-logs/zero-logs VPN that stores no records of what you do while connected to its servers. This will ensure that even if the VPN is served with a warrant, the authorities won't be able to track your online identity, as there'll be nothing to hand over to them!\n\nThe VPN services we've recommended in this article are all zero-logs providers that are well suited for anybody who wants to use their VPN for managing Bitcoins privately and anonymously.\n\nAre cryptocurrency payments anonymous?\n\nCrypto-currencies are not necessarily designed to provide anonymity by default. However, if the proper precautions are taken, cryptocurrency can be used to make anonymous purchases.\n\nDon't fret! Some crypto-currencies are designed with privacy and anonymity in mind – like Monero and Zcash. Bitcoin isn't actually one of these crypto-currencies, however, but there are ways of acquiring and holding Bitcoin so that they can be spent anonymously.\n\nWhat it is important to remember, is that depending on how you acquire your Bitcoin and store it, the history of those coins and who they belong to may be easy to trace. Thus, in order to purchase a VPN with Bitcoin for added privacy, it is essential to ensure that those coins are not connected to you via an exchange, and have been washed properly with a Bitcoin mixer if necessary.\n\nDo I need to buy my VPN with Bitcoin?\n\nNo, most people don't need to go to these lengths. The vast majority of folks want a VPN to conceal their browsing habits from their Internet Service Provider (ISP) or to ensure that the websites they visit cannot track their real IP address.\n\nIf you feel strongly about purchasing your VPN anonymously; paying with Bitcoin can give you added privacy.\n\nFor those people, a paper trail that reveals that they purchased a VPN subscription at some point is not going to be a massive cause for concern. Thus, they'll be absolutely fine paying with a debit card or PayPal account. However, whether you want to reveal your identity at the time of purchase is largely down to you, and your personal threat model.\n\nCan a VPN help to protect my Bitcoin?\n\nWhenever you use peer-to-peer (P2P) services, you run the risk of revealing your IP address – be it to cybercriminals, your ISP, the government, or other snooping third parties. As a result, hackers and cybercriminals may use that opportunity to target you with malware and steal your access details for your crypto wallet(s).\n\nUsing a VPN with robust encryption is an excellent way to prevent this from happening. A VPN will conceal your original IP address and encrypt your internet traffic so it can't be intercepted. This puts a barrier between you and anyone wanting to steal your cryptocurrency, as well as giving you greater security and privacy online overall.\n\nCan a VPN allow me to unblock Bitcoin trading sites?\n\nSome countries have cracked down on crypto-currencies like Bitcoin. This can make it hard to access crypto services, exchanges, wallets, and apps. If you want to access a Bitcoin trading site/exchanges like Binance, a VPN is the best solution.\n\nWith a VPN, you can bypass local censorship imposed by the government. Simply connect to a VPN server in a country where purchasing and trading crypto is permitted, and you can access Binance, Coinbase, Cash App, Bisq, or any other cryptocurrency exchange or website service that is currently blocked in your country.\n\nCan I use a free VPN?\n\nIf you're looking to protect your cryptocurrency, then we strongly advise against using a free VPN service. That's not to say there aren't some good ones, but they seldom provide robust enough encryption and security features to justify their use. On top of this, free VPN services will regularly monitor users and sell on their information and usage (pretty much defeating the purpose of a VPN). A good VPN doesn't have to be expensive either. If cost is an issue, check out our top picks for cheap VPNs.\n\nHow does ProPrivacy review VPNs?\n\nThere are a lot of VPNs available on the market in 2024. That kind of choice sounds great, but sifting through hundreds of search results and comparing VPNs that all claim to be the best can quickly become overwhelming – especially if you're new to the tech. Luckily, that's what we're here for! The ProPrivacy team has been reviewing VPNs since 2013, and we're active contributors to the field of cybersecurity, as well as individuals who all use these services in our day-to-day lives.\n\nAs a result, all of the recommendations on this page are grounded in first-hand experience. I even made sure that these hand-picked Bitcoin VPNs met the following criteria before claiming a spot in the shortlist:\n\nPayment - This one's a no-brainer; if the VPN doesn't accept Bitcoin payments, it doesn't get a mention in our top five.\n\n- This one's a no-brainer; if the VPN doesn't accept Bitcoin payments, it doesn't get a mention in our top five. Security - VPNs should have your digital privacy in mind at all times. I always check out a VPN's encryption and test for data leaks.\n\n- VPNs should have your digital privacy in mind at all times. I always check out a VPN's encryption and test for data leaks. Ease-of-use - A VPN that's too difficult (or downright unpleasant) to use isn't worth paying a subscription for, and that's why I vet the services' apps.\n\n- A VPN that's too difficult (or downright unpleasant) to use isn't worth paying a subscription for, and that's why I vet the services' apps. Speed - Another vital consideration, seeing as nobody wants to endure slow-loading pages or low-quality streams.\n\n- Another vital consideration, seeing as nobody wants to endure slow-loading pages or low-quality streams. Customer support - If you have questions about your Bitcoin payment, or any concerns, you'll want them addressed quickly and comprehensively.\n\nInterested in learning more? For a more in-depth explanation about how we put VPNs to the test, head on over to our VPN review process page.\n\nConclusion\n\nUsing a VPN is a surefire way to keep yourself protected online when making Bitcoin payments. Plus, they come stuffed with features that can keep your identifiable data, and internet activity, hidden from prying eyes. If you're looking to increase your privacy with cryptocurrency, then here's a reminder of our top picks for VPNs for Bitcoin payments:\n\nFrom $6.67/month The best VPN for bitcoin payments. You get access to fast servers all over the globe with excellent encryption. ProPrivacy TrustScore: 10 out of 10 Simultaneous connections 8 Server locations 160 Free trial No Visit provider Read Review\n\nFrom $3.69/month The best value VPN for bitcoin payments, with a huge network of servers, superb encryption, and apps for all devices. ProPrivacy TrustScore: 9.9 out of 10 Simultaneous connections 6 Server locations 84 Free trial No Visit provider Read Review\n\nFrom $2.19/month The best secure VPN for bitcoin payments. Includes a proven no-logs policy and a full suite of customizable features. ProPrivacy TrustScore: 9.8 out of 10 Simultaneous connections Unlimited Server locations 84 Free trial No Visit provider Read Review\n\nFrom $2.00/month The cheapest VPN for bitcoin payments. Incredibly private and with zero-logs, lots of features, and strong encryption. ProPrivacy TrustScore: 9.7 out of 10 Simultaneous connections 10 Server locations 200 Free trial No Visit provider Read Review\n\nFrom $2.30/month The best multi-device VPN for bitcoin payments. Offers unlimited simultaneous connections and apps for all your devices. ProPrivacy TrustScore: 9.6 out of 10 Simultaneous connections Unlimited Server locations 140 Free trial Yes Visit provider Read Review\n\nBest VPNs for Bitcoin payments – FAQs\n\nCan I switch to another payment method after I paid for a VPN with a cryptocurrency? Yes, most VPNs that allow crypto payments use advanced payment systems, allowing you to switch from one payment method to another when renewing your subscription. To change your payment method with ExpressVPN, go to Subscription>Change plan>Select a different plan or payment method. The procedure should be similar with other VPNs on this list too.\n\nWhy do some VPNs not accept Bitcoin payments? As a relatively new payment method, Bitcoin payment is still not fully accepted and implemented across all companies and industries. Some innovation-driven VPNs, however (like those in this article), do accept Bitcoin and other cryptocurrencies to help you stay more anonymous online."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vbmV3cy93aGF0LXN0ZWxsYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Jan 2023 08:00:00 GMT",
        "title": "Stellar Blockchain: Overview, History, FAQ - Investopedia",
        "content": "What Is Stellar Blockchain?\n\nThe Stellar blockchain is one of the hundreds of networks that store and transmit cryptocurrencies. As bitcoin garnered headlines over the past ten years, many other virtual currencies and platforms racked up impressive gains and user bases. The stellar blockchain, with its lumens token, is one of them.\n\nIn early 2021, the value of Stellar's lumen token grew more than fivefold, from $0.13 to $0.73, before collapsing over the following year. As of early 2023, the lumen token is trading for about $0.08, according to the crypto data site CoinMarketCap.\n\nKey Takeaways The Stellar blockchain is a distributed ledger used to transmit digital currencies.\n\nThe main token of the Stellar blockchain is Stellar lumens or XLM.\n\nThe Stellar blockchain uses a consensus algorithm that is faster, cheaper, and more energy-efficient than that of Bitcoin.\n\nThe Stellar blockchain was launched in 2014 by Jed McCaleb, who also founded Mt. Gox and co-founded Ripple.\n\nCritics say that the Stellar blockchain is centralized around the Stellar Development Foundation, which controls a large share of the lumens tokens.\n\n\n\nUnderstanding Stellar Blockchain\n\nStellar's basic operation is similar to that of most decentralized payment technologies. It runs a network of decentralized servers with a distributed ledger that is updated every two to five seconds among all nodes. The most prominent distinguishing factor between Stellar and bitcoin is its consensus protocol.\n\n\n\nStellar’s consensus protocol does not rely on the entire miner network to approve transactions. Instead, it uses the Federated Byzantine Agreement (FBA) algorithm, which enables faster processing of transactions. This is because it uses quorum slices (or a portion of the network) to approve and validate a transaction.\n\nEach node in the Stellar network chooses another set of “trustworthy” nodes. Once a transaction is approved by all nodes within this set, then it is considered approved. The shortened process has made Stellar's network extremely fast and it is said to process as many as 1,000 network operations per second.\n\nHow the Stellar Blockchain Process Works\n\nThe current process for cross-border transfers is a complicated one. It requires domestic banks to maintain accounts in foreign jurisdictions in local currencies. Their correspondent banks must operate a similar account in the original country.\n\nThe Nostro-Vostro process, as it is known, for cross-border transactions with fiat currencies is a lengthy one involving conversion and reconciliation of accounts. Because it enables simultaneous validation, Stellar’s blockchain can shorten or eliminate the delays and complexity involved.\n\nStellar’s Lumens cryptocurrency can also be used to provide liquidity and streamline the process. According to some reports, banks will use their own cryptocurrencies to facilitate such transfers in the future. According to David Mazières, a Stanford University professor and SCP creator, the protocol has “modest” computing and financial requirements. This enables even organizations with minimal IT budgets, such as nonprofits, to participate in its network.\n\nHistory of Stellar Blockchain\n\nStellar was launched in 2014 by Jed McCaleb (pictured), who also co-founded the cryptocurrency company Ripple and the exchange Mt. Gox. After leaving Ripple over his differences with other co-founders, McCaleb and his partner Joyce Kim launched the Stellar protocol as a fork of the Ripple codebase. Payments company Stripe provided $3 million in seed funding.\n\nStellar came into the spotlight in October 2017 after it announced a partnership with IBM. The partnership envisages the setting up of multiple currency corridors among nations in the South Pacific.\n\nThe project stated a goal of processing up to 60% of all cross-border payments in the region, which includes countries like Australia, Fiji, and Tonga. This would enable connections between small businesses, non-profits, and local banking institutions to expedite commercial transactions. For example, a farmer in Samoa would be able to connect and conduct transactions with a buyer in Indonesia.\n\nIn 2016, prominent technology consulting firm Deloitte also announced a partnership with Stellar to develop a payments app. At a conference in 2017, McCaleb confirmed that 30 banks signed up to use Stellar’s blockchain for cross-border transfers.\n\nEach Stellar wallet must maintain a minimum balance in order to exist. At present, each account must maintain a base reserve of 1 XLM.\n\nConcerns About Stellar Blockchain\n\nFollowing the launch of the Stellar protocol, many investors raised alarms about the high number of lumens tokens controlled by the Stellar Development Foundation. Rather than let Stellar nodes \"mine\" new cryptocurrency, the creators of Stellar simply created 100 billion lumens tokens. The vast majority of them were assigned to the Stellar Development Foundation.\n\nAlthough these resources are ostensibly intended to fund development and adoption, some investors worry that they could be sold on the market, thereby diluting the holdings of potential investors. In order to address these concerns, the SDF intentionally destroyed 55 billion lumens tokens in 2019.\n\nThere are also concerns that the network relies on a small number of nodes, many of them controlled by the SDF. In 2019, two of those nodes unexpectedly failed, causing the Stellar blockchain to halt for over an hour.\n\nStellar Blockchain vs. Ripple\n\nStellar is an open-source payment technology that shares several similarities with Ripple and its XRP cryptocurrency. Like Ripple, Stellar is a payment technology that aims to connect financial institutions and reduce the cost and time required for cross-border transfers.\n\nBoth networks use similar protocols and were derived from the same codebase. In both protocols, there is no mining or algorithmic proof-of-work: All tokens were created at the moment the blockchain was launched.\n\nThe majority of XRP tokens are controlled by Ripple, a for-profit company, while the majority of lumens tokens are held by the nonprofit Stellar Development Foundation. While Ripple is a closed system, Stellar is open-source.\n\n\n\nThey also have different customers. Ripple works with established banking institutions and consortiums in order to streamline their cross-border transfer technology. In contrast, Stellar is focused on developing markets and has multiple use cases for its technology, including money remittances and bank loan distribution.\n\n\n\n\n\nWhat Is XLM Crypto? XLM, or Stellar lumens, is the native cryptocurrency of the stellar blockchain and it is used to pay transaction fees. However, it is not the only cryptocurrency on the Stellar blockchain, which can be used to move tokens representing anything from commodities to fiat currencies.\n\nHow Do I Check the Blockchain for a Stellar Transaction? You can check a stellar transaction on a stellar-focused block explorer. These are online tools that allow users to view recent transactions, blocks, and account balances. Popular Stellar explorers include Stellarchain.io, Blockchair.com, and StellarExpert.\n\nHow Does Stellar Blockchain Work? The Stellar blockchain uses a proof-of-agreement consensus algorithm to ensure coordination between different nodes. These nodes broadcast transactions to one another every five seconds, ensuring that they are all keeping identical versions of the Stellar ledger.\n\nThe Bottom Line\n\nThe Stellar blockchain is one of the thousands of competitors to Bitcoin and Ethereum. It is used for fast, cheap transactions with minimal computational or energy costs. Although it has occasionally enjoyed sharp price rises, the value of Stellar lumens has plunged with respect to other cryptocurrencies.\n\nInvesting in cryptocurrencies and other Initial Coin Offerings (“ICOs”) is highly risky and speculative, and this article is not a recommendation by Investopedia or the writer to invest in cryptocurrencies or other ICOs. Since each individual's situation is unique, a qualified professional should always be consulted before making any financial decisions. Investopedia makes no representations or warranties as to the accuracy or timeliness of the information contained herein. As of the date this article was written, the author owns cryptocurrency."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kZWFkLWNhdC1ib3VuY2UtYml0Y29pbi1wcmljZS1uZWFycy0yMy0wMDAtaW4tZnJlc2gtNS1tb250aC1oaWdo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Jan 2023 08:00:00 GMT",
        "title": "Dead cat bounce? Bitcoin price nears $23,000 in fresh 5-month high - Cointelegraph",
        "content": "Bitcoin (BTC) took a swing at $23,000 into Jan. 21 as Asia buyers drove fresh market strength.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBid liquidity causes suspicion\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD battling bears to reach $22,790 on Bitstamp overnight — its highest since August.\n\nWith new multi-month peaks coming in quick succession despite fears of a major correction, Bitcoin continued to surprise as traders cleared the way for more upside.\n\nAs noted by intraday trader Skew, Asia was leading the way into the weekend, with sellside pressure from market makers being absorbed on exchanges.\n\n“Another rally driven by asia bid. TWAP buyers absorbing the sell pressure from MMs. Large spot bid lifting offers & ask wall pulled prior to another short squeeze,” Skew commented on a composite chart.\n\nBTC/USD annotated charts. Source: Skew/ Twitter\n\nOn-chain analytics resource Material Indicators meanwhile flagged ask liquidity being removed on Binance the day prior, this allowing Bitcoin’s initial run beyond the $22,000 mark.\n\n“Volatility continues. Don't give it all back, be sure to take some profit along the way,” it wrote in part of a subsequent update.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nAs ever, Bitcoin was far from above suspicion at its latest highs, with some familiar faces still urging traders to prepare for the worst.\n\n“The bigger the pump, the harder BTC will fall down,” analyst Toni Ghinea tweeted, while Crypto Tony argued that the entire move may be nothing more than a “dead cat bounce.”\n\n“Regardless if this is dead cat relief wave or a reversal on Bitcoin, it is great to see some optimism back in Crypto,” he summarized.\n\nConsidering why further gains were coming after the end of the week’s TradFi trading, one popular commentator additionally suggested that traders were being manipulative.\n\n“No one who genuinely wants to buy and own crypto waits until the Friday close each week to execute,” an update read, adding that those buyers’ “aim is clear.”\n\nEarlier in the week, Material Indicators had likewise warned of “choreographed” bidding on BTC.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nKey moving average on the horizon\n\nAttention thus focused on the upcoming weekly close for BTC/USD, which if current prices were to sustain would be its best since mid-August.\n\nAt the same time, Bitcoin looked to be about to print a so-called “death cross” on the weekly chart, with the descending 50WMA about to cross over the still-rising 200 WMA.\n\nBTC/USD 1-week candle chart (Bitstamp) with 50, 200WMA. Source: TradingView\n\nRelated: Bitcoin faces $15K crash as US sparks ‘financial meltdown’ — Arthur Hayes\n\nA major target was the 200-week moving average (WMA), currently at $24,650 and out of reach for much of 2022.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAxLzIxLzMtcmVhc29ucy10by1pbnZlc3QtaW4tY3J5cHRvLWluLTIwMjMtYW5kLTEtcmVhc29uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Jan 2023 08:00:00 GMT",
        "title": "3 Reasons to Invest in Crypto in 2023 -- and 1 Reason Not To - The Motley Fool",
        "content": "It's no secret that the last year has been rough for crypto.\n\nBitcoin (BTC 2.41%) and Ethereum (ETH 1.95%) are both down roughly 70% from their peaks, and Cardano and Solana have plummeted by around 90%. Those numbers are tough to stomach, and many investors have fled the crypto market in recent months.\n\nIf you're nervous about the market right now, you're not alone. But should you keep investing? There are three reasons to stick with crypto in 2023, and one reason you're better off avoiding it for now.\n\nWhy now could be a smart buying opportunity\n\n1. Prices are at rock bottom\n\nAt its peak, Bitcoin cost nearly $70,000 per token, and Ethereum was priced at close to $5,000 per token. Today, Bitcoin stands at just under $21,000, with Ethereum at roughly $1,500.\n\nIf you've been looking for a more affordable time to invest in crypto, you may not get a better chance than right now. The crypto market is essentially on clearance at the moment, and it's possible to load up on quality investments for a fraction of the price.\n\n2. The upswing could be lucrative\n\nOf course, nobody knows for certain whether the crypto market will recover. However, downturns like this aren't necessarily uncommon in this industry, and major cryptocurrencies have faced worse in the past.\n\nFor example, back in 2018, Ethereum's price fell by nearly 95% over the course of the year. If you had invested at its lowest point, you would have seen returns of nearly 4,500% over the following three years alone.\n\nAgain, it's unclear what the future holds for crypto, and we may not see another rally similar to the 2020-2021 surge. But even if cryptocurrencies don't reach their all-time highs again anytime soon, even a relatively small upswing could still be lucrative if you invest at rock-bottom prices.\n\n3. You might regret not investing\n\nCrypto is a speculative investment, so nobody -- even the experts -- knows how it will fare over the long term. While it could fail, it could also change the world.\n\nWhen you're deciding whether to invest, consider which of these options you'd regret more: investing now and losing money if crypto fails, or not investing and missing out on the investment of a lifetime if crypto succeeds.\n\nTo be clear, this doesn't mean you should go all-in and invest every dollar you have in crypto. As with any investment, it's important to buy wisely and only invest what you can afford. But for some people, it's worth risking a little money to avoid the regret of not taking this chance.\n\nWhy it may be best to avoid crypto\n\n1. You're a risk-averse investor\n\nFor all its potential, crypto also carries a significant amount of risk. At the moment, it's impossible to know whether crypto will succeed, and there's always a chance that you could lose whatever you invest. If money is tight, now may not be the best time to buy.\n\nAlso, this investment is notorious for its extreme volatility. Even in good times, it can experience nauseating ups and downs. Not all investors have the stomach for crypto, and that's OK. If you know you'd lose sleep over that level of volatility, you might be better off sticking to stocks for now.\n\nThe future of crypto is uncertain, and whether you choose to invest now will depend largely on your risk tolerance and personal preferences. But if a rebound is on the way, right now may be one of the best chances to buy."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvY3J5cHRvY3VycmVuY3ktd29tZW4taW52ZXN0aW5nLWFzc2V0LWhvbGRpbmdzLWNhc2gtbWFya2V0cy1iaXRjb2luLWV0b3JvLXN1cnZleS0yMDIzLTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Cryptocurrency Is 2nd Most Widely Held Asset Among Women, Says Survey - Markets Insider",
        "content": "Crypto ownership rose among women during 2022, making it the second most widely held asset class held by that group, eToro said.\n\nIn its fourth-quarter survey, 34% of women said they owned crypto, up from 29% in the prior quarter.\n\nThe ownership rate among men edged up just by 1 percentage point during that period to 43% from 42%.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nCryptocurrencies have driven up in the ranks of financial assets held by women, an eToro survey shows, with a jump in ownership in 2022 taking place despite a sharp downturn in the market.\n\nCrypto has become the second most widely owned asset class for women, running just behind cash, the trading platform said this week in its Retail Investor Beat survey.\n\nIn the fourth quarter, 34% of women owned crypto, up from 29% in the third quarter. The increase in the pace of ownership was faster than that of men, as their rate edged up to 43% from 42%.\n\nCrypto appears to be \"succeeding where traditional financial markets have sometimes failed in bringing more women to the table,\" Ben Laidler, global market strategist at eToro, said in the report.\n\nAdvertisement\n\nWomen ramped up their holdings of digital assets during a so-called crypto winter that saw prices sinking for bitcoin, ether, and other digital coins. Bitcoin's valuation dropped by more than 60% last year, and the market's overall market capitalization fell below its high point of $3 trillion in November 2021 to below $1 trillion now.\n\nThe market ran into macroeconomic turbulence and a number of blow-ups in the crypto world, including the implosion of FTX.\n\nStill, women were part of a broader increase in the proportion of retail investors owning crypto. Overall, crypto was held by 39% of retail investors in the final quarter of 2022, up from 36% in the third quarter, even as it was last year's worst-performing asset class, eToro said.\n\n\"It's important to emphasise that retail investors are overwhelmingly long-term, with 63% holding onto investments for years or decades and just 4% holding them for days,\" said Laidler. \"Time is on their side in most cases and for many, the brutal tech valuation and expectations reset may set up for better returns ahead.\"\n\nAdvertisement\n\nEToro said 10,000 retail investors were surveyed across 13 countries between December 14 and 24."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLXByaWNlLWd1bm5pbmctZm9yLTM1MDAwL9IBPWh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLXByaWNlLWd1bm5pbmctZm9yLTM1MDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Jan 2023 08:00:00 GMT",
        "title": "Is Bitcoin (BTC) Price Gunning For $35,000 In Coming Months? - CoinGape",
        "content": "On January 18, the price of Bitcoin (BTC) recovered all of its previous losses caused by the FTX epidemic and reached its highest point at $22,216 on Friday afternoon. The asset’s rise to a level of more than $22,000 caused market participants to experience heightened levels of euphoria, even while crypto behemoths like Genesis filed for bankruptcy proceedings.\n\nBitcoin (BTC) Price To Hit $35K?\n\nBitcoin recently surpassed the $420 billion market cap as its trading volume witnessed an increase of 17.45% at $25 billion in the course of the past 24 hours. This has led many to believe Bitcoin’s (BTC) price to hit the coveted $25K price mark in the coming days if the crypto market is devoid of any further black swan events. However, according to the prominent crypto analyst, Michael van de Poppe, the price of the flagship cryptocurrency might reach as high as $35,000. According to his analysis, there will most likely be a certain time period this year –ranging from two to four months–during which the markets will see a significant relief rally. It’s possible that the scenario is already set in motion at the present time.\n\nadvertisement\n\nMassive BTC Whale Activity\n\nThis seems to hold true as reports of massive whale accumulation have also been tracked down. According to on-chain data, there has been an increase of more than 3% in the count of BTC whales owning 100 to 1,000 BTCs, in the recent two months. At the time of this publication, there were a total of 14,110 whale addresses in this cohort.\n\nRead More: Check Out The Top Crypto Telegram Channels Of 2023\n\nOn the other hand, Kim Young Ju, co-founder and CEO of CryptoQuant, a platform for crypto on-chain monitoring, also noted certain whale activities in the Bitcoin ecosystem. A notification was sent out by Ju in the form of a tweet indicating that miners participating in the 1THash pool had sent 3,336 Bitcoins to the Binance exchange.\n\nAs things stand, the Bitcoin (BTC) price is currently being traded at $22,106. This represents an increase of 4.67% on the day, in contrast to a gain of 14% during the week as per CoinGape’s crypto market tracker.\n\nAlso Read: Crypto Fraudster Charged In $4.5 Bn Bitcoin Theft Lands New Marketing Job"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xMTk2NDQvYml0Y29pbi1ldGhlcmV1bS1lbmpveS1idWxsaXNoLXdlZWstY3J5cHRvLW1hcmtldNIBUWh0dHBzOi8vZGVjcnlwdC5jby8xMTk2NDQvYml0Y29pbi1ldGhlcmV1bS1lbmpveS1idWxsaXNoLXdlZWstY3J5cHRvLW1hcmtldD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Enjoy Bullish Week as Crypto Market Adds $77B - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) and Ethereum (ETH) are leading the weekly gains among the ten largest cryptocurrencies by market cap as their prices soared 11.2% and 9.7%, respectively.\n\nAt the time of writing, Bitcoin was changing hands at $20,981, up 1% over the day, with Ethereum trading at $1,551, up 2% in the past 24 hours, data from CoinGecko shows.\n\nThese are by far the best results among the market’s largest crypto assets, with the sixth-placed XRP gaining 5% over the past week, followed by Polygon (MATIC), which is up 4.3% over the same span.\n\nAD\n\nAD\n\nThe solid performance shown by the two leading cryptocurrencies comes despite the Wednesday correction that occurred in anticipation of a major announcement from U.S. federal prosecutors that many thought would target a major player in the sector.\n\nThough markets indeed felt the pinch, with both BTC and ETH plunging about 5% immediately after the announcement of the announcement, the correction turned out to be largely short-lived as the criminal charges were filed against a little-known Hong Kong-based cryptocurrency exchange Bitzlato, which the Feds called of a key member of a so-called “crypto crime axis.”\n\nThe latest move has also been seen in the hefty rise in the entire market's capitalization. This time last week, the crypto market hovered around a $943 billion capitalization; today, that figure is over $1 trillion.\n\nHas Bitcoin bottomed yet?\n\nWith Bitcoin eyeing the key $21,000 level, the total market capitalization of all cryptocurrencies has once again surpassed the $1 trillion mark, something experts see as a sign of the market’s potential recovery after the painful crypto winter of 2022.\n\nAccording to CoinGecko’s recent annual crypto industry report, last year, which saw the demise of several high-profile players, ended with a total crypto market capitalization of $829 billion, which is 64.1% lower than the $2.3 trillion in January 2022.\n\nAD\n\nAD\n\nDaily trading volumes have steadily trended downwards over 2022 as well, averaging at $86.0 billion, said the report.\n\nSource: CoinGecko.\n\n“2022 marked a turning point for the crypto industry—one that flushed out unsustainable excesses from the bull run,” CoinGecko co-founder Bobby Ong said in a statement shared with Decrypt. “In this new year, we hope to see crypto slowly make a recovery, with more efforts going towards rebuilding trust and credibility.”\n\nAs for last week’s performance beyond the top ten, the three top gainers performers are Solana (SOL), which is up 28.5% over the past week, the Ethereum-based meme coin Shiba Inu (SHIB), whose price rallied 20.7% over the span, and Polkadot (DOT) with a 10.9% surge."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzIwL2NyeXB0by1pcy1hLXBldC1yb2NrLWFuZC1iaXRjb2luLWEtaHlwZWQtdXAtZnJhdWQtc2F5cy1qcG1vcmdhbi1jZW8tamFtaWUtZGltb24v0gF1aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMjAvY3J5cHRvLWlzLWEtcGV0LXJvY2stYW5kLWJpdGNvaW4tYS1oeXBlZC11cC1mcmF1ZC1zYXlzLWpwbW9yZ2FuLWNlby1qYW1pZS1kaW1vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Is a ‘Pet Rock’ and Bitcoin a ‘Hyped-Up Fraud,’ Says JPMorgan CEO Jamie Dimon - The Daily Hodl",
        "content": "Longtime crypto skeptic JPMorgan chief executive Jamie Dimon thinks Bitcoin (BTC) is a ‘hyped-up fraud,’ comparing crypto to pet rocks.\n\nIn a new interview with CNBC, Dimon says Bitcoin and other digital assets “don’t do anything.”\n\nDimon, however, views the merits of blockchain technology differently than crypto assets.\n\n“That’s different. Blockchain is a technology ledger system that we use to move information. We’ve used it to do overnight repo, intraday repo. We’ve used it to move money. So that is a ledger, that’s a technology ledger type of thing that we think will be deployable. Remember, we’ve been talking about that for 12 years too, and very little’s been done.”\n\nJPMorgan employs a platform called Liink, which is a blockchain developed by Onyx, an arm of the banking giant. According to Onyx, Liink is focused on providing seamless data-sharing abilities between institutions.\n\nDuring the CNBC interview, Dimon also questions whether Bitcoin is truly scarce and will stop at 21 million tokens.\n\n“How do you know it’s going to stop at 21 million? I’ve mentioned this to people – everyone says that. Well, maybe it’s going to get to 21 million and Satoshi’s picture’s going to come up and laugh at you at all and say, ‘Na Na.'”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/Konstantin Faraktinov"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL2Rhdm9zLWJpdGNvaW4tbWVyY2VkZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Owner of Infamous Davos Bitcoin Car Gets Sensitive Over Crypto Criticism - Futurism",
        "content": "\"If someone made bad decisions and lost money, it's their fault and not my car's.\"\n\nMercedes-Bitcoin\n\nEarlier this week, attendees at the World Economic Forum spotted a mysterious Bitcoin-branded Mercedes sports car parked near the event in Davos, Switzerland, which immediately drew criticism for its flashy display of opulence in the wake of last year's devastating crypto crash.\n\nNow, the owner of the vehicle has come forward — and he has a lot to say to his haters, CNBC reports.\n\nAs it turns out, the coupe's proud owner is Michael Chobanian, the founder of the Ukraine-based crypto exchange Kuna.\n\n\"How is the crash related to my property?\" he told the outlet. \"I am [in the] crypto and finance industry for ten years. I am not selling anything, nor promoting.\"\n\n\"If someone made bad decisions and lost money,\" Chobanian added, \"it's their fault and not my car's.\"\n\nIn other words, neither the Davos Bitcoin-mobile nor its testy owner are responsible for the 2022 crypto crashes. You heard it here first, folks.\n\n6/ \"What you also see in @Davos Switzerland is something like this vehicle, this beautiful #Mercedes Sports car and I wanna point out something that's extremely special about it...There is a #Bitcoin logo in the hood ornament right there on this car\" $HBARhttps://t.co/2K9WC3d4P9 pic.twitter.com/XZ4biPlxZ7 — Dany Eid (@DanyEid_) January 18, 2023\n\nCrypto Row\n\nThe Bitcoin-orange Mercedes, emblazoned with the currency's logo in the place of its German manufacturer's, has drawn both accolades from crypto industry types and jeers from critics.\n\nCritics were quick to point out that the car was one of the only remaining callbacks to the golden days of crypto at the gathering following a devastating year for the industry — and that it was ironically stationed near the so-called \"Blockchain Hub,\" which had become to be known as Davos' \"Crypto Row\" over the years.\n\nPlacing Blame\n\nWhile Chobanian's choice of parking location was interpreted as a symbol for the seeming death of the crypto industry, he said he parked there for a much more mundane reason, suggesting it was all one big coincidence.\n\n\"The car is there because this is the closest parking spot that I found,\" he told CNBC.\n\nMore on crypto: Harvard Finance Professor: Crypto Is \"Magical Thinking\" That \"Infected Capitalism\""
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL25ld3MvanBtb3JnYW4tY2VvLWNhbGxzLWJpdGNvaW4tYS1oeXBlZC11cC1mcmF1ZC1hbmQtY3J5cHRvLWEtd2FzdGUtb2YtdGltZS01OTA4MDUuaHRtbNIBfGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL2FtcC93b3J0aC9uZXdzL2pwbW9yZ2FuLWNlby1jYWxscy1iaXRjb2luLWEtaHlwZWQtdXAtZnJhdWQtYW5kLWNyeXB0by1hLXdhc3RlLW9mLXRpbWUtNTkwODA1Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "CEO Of US' Biggest Bank JPMorgan Calls Bitcoin A ‘Hyped-Up Fraud’ & Crypto A ‘Waste Of Time’ - Indiatimes.com",
        "content": "At a time when a strong start to 2023 has upped crypto investors' hopes for the industry’s bounce back this year, the CEO of the US’ biggest bank, JPMorgan Chase, Jamie Dimon, has bashed cryptocurrencies.\n\n\n\n\"Bitcoin Is Itself A Hyped-Up Fraud\"\n\nunsplash\n\nOn being asked about bitcoin at the World Economic Forum in Davos, Switzerland, JP Morgan's CEO told CNBC at the event “Why they waste any breath discussing the cryptocurrency. Bitcoin itself is a hyped-up fraud, a pet rock.”\n\n\n\nA few months ago, the US banking giant's CEO also warned about a recession hitting the US as well as the global economy in the middle of 2023.\n\n\n\nAlso Read: Why JPMorgan Was Fined $200mn For Using Whatsapp\n\n\"Not Surprised With FTX Failure\"\n\nThe JPMorgan CEO also weighed in on the ongoing saga with bankrupt crypto exchange FTX.\n\nReuters\n\nCEO Dimon stated that he was not surprised to see FTX fail and declare bankruptcy, and referred to it as a Ponzi scheme.\n\nWhen asked if he thought the cryptocurrency sector as a whole was a Ponzi scheme, he said, \"You guys have all seen the analysis of Tether and all these things, the lack of disclosures, it's outrageous. Regulators should have stopped this a long time ago. People have lost billions of dollars if you look at its lower-income people, in some cases retirees.\"\n\n\n\nThis isn't the first time JPMorgan's CEO has bashed cryptocurrencies. Jamie Dimon has been a vocal opponent of Bitcoin for a long time. Last year, he compared Bitcoin to a Ponzi scheme, like the infamous, decades-long scam run by Wall Street titan Bernie Madoff, as per a Forbes report.\n\nAlso Read: RBI Governor Says Next Financial Crisis Will Come From Private Crypto\n\nJPMorgan’s Crypto & Blockchain Projects\n\nreuters\n\nWhile JPMorgan’s CEO does seem to be totally against Bitcoin and crypto in general, it’s clear that as the biggest bank in the US, the company understands the need to hedge their bets.\n\n\n\nThe company is actively involved in the development of blockchain implementations into their services, and they’ve even created their own proprietary token, JPM Coin. This token has a specific use case within their system, being used for intraday repurchase agreements, as the report mentioned.\n\nAlso known as repos or RP, intraday repurchase agreements are short-term loans involving financial institutions. They’re used by big banks to help manage their short-term cash flow or to meet regulatory capital adequacy requirements.\n\nAnd that’s not all. Last year, in November, JPMorgan Chase also registered a trademark for a new cryptocurrency wallet. The United States Patent and Trademark Office (USPTO) granted JPMorgan Chase Bank’s trademark registration for “J.P. Morgan Wallet” for use in a wide range of financial services, including virtual currency transfers and exchanges as well as crypto payment services. It had applied for it in 2020.\n\nAlso Read: Crypto Will Collapse One Day, Says Rakesh Jhunjhunwala\n\nFor the latest and interesting financial news, keep reading Indiatimes Worth. Click here."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMjAvZmFudG9tLWJsb2NrY2hhaW4tdG8tZnVuZC1lY29zeXN0ZW0tcHJvamVjdHMtdXNpbmctcG9ydGlvbi1vZi1idXJudC1mdG0tZmVlcy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAxLzIwL2ZhbnRvbS1ibG9ja2NoYWluLXRvLWZ1bmQtZWNvc3lzdGVtLXByb2plY3RzLXVzaW5nLXBvcnRpb24tb2YtYnVybnQtZnRtLWZlZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Fantom Blockchain to Fund Ecosystem Projects Using Portion of Burnt FTM Fees - CoinDesk",
        "content": "Risks outlined by the now-passed proposal include malicious approvals of projects requesting funds from the Ecosystem Vault, influential entities or groups funding themselves or promoting projects they control and a project that overpromises and cannot deliver with the received funds."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZmluYm9sZC5jb20vbWlhbWktbWF5b3Itc2F5cy1zYWxhcnktaW5jcmVhc2VkLXNpbmNlLWhlLWJlZ2FuLWVhcm5pbmctYml0Y29pbi1kZXNwaXRlLWJlYXItbWFya2V0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Miami mayor says salary increased since he began earning Bitcoin despite bear market - Finbold - Finance in Bold",
        "content": "Miami Mayor Francis Suarez has revealed that he still receives his salary in Bitcoin (BTC), despite the extended bear market, noting that the decision has been ‘a good investment.’\n\nAccording to Suarez, his salary has increased since making the shift while stating the rise has emerged from taking advantage of price fluctuations, considering he earns after every two weeks, he said during an interview on CNBC’s Squawk Box show on January 19.\n\n“Sometimes people misunderstand that you’re buying it every two weeks, you’re buying it in the fluctuations. Since I bought it or since I started taking my salary in Bitcoin, my salary is up; it’s been a good investment. I think that’s part of the problem with this conversation about Bitcoin,” Suarez said.\n\nHowever, he clarified that the salary increment is not a result of trading. Suarez also pointed out there is a need for patience when dealing with Bitcoin and blockchain technology due to the early stages of development.\n\nGrowing confidence in Bitcoin\n\nAlthough Suarez’s decision was initially viewed as unusual, it is a testament to the growing acceptance of cryptocurrencies and their potential as an investment. In this line, a Finbold report indicated that crypto adoption accelerated in 2022 despite the prevailing bear market.\n\nSuarez’s decision to receive a portion of his salary in Bitcoin is a notable move, as it highlights public officials’ and institutions’ growing acceptance of cryptocurrencies.\n\nFor instance, New York City’s mayor Eric Adams also announced that he would receive his first three paychecks in Bitcoin as a vote of confidence in the maiden cryptocurrency.\n\nMiami’s crypto city initiative\n\nIt is worth noting that the mayor of Miami has been advocating for crypto businesses to set up bases in the city, aiming to make it a digital asset capital of the United States.\n\nAs reported by Finbold, Suarez was at some point influential in attempting to lure Chinese Bitcoin miners into setting up shop in the city after the activity was banned in the Asian country.\n\nThe official indicated he would spur conversations with power distributors to lower energy prices, considering miners prefer operating in regions with cheaper electricity.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vaGVyZXMtdGhlLWJpdGNvaW4tcHJpY2Utc2lnbmFsLXRvLXdhdGNoLWZvci1wYXJ0LXR3by1vZi1idWxsaXNoLXJhbGx5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Here's the Bitcoin price signal to watch for part two of bullish rally - Finbold - Finance in Bold",
        "content": "As the bullish streak for Bitcoin (BTC) is starting to wind down, and the price moves into a sideways pattern, crypto traders and investors are looking at signs that could indicate when the next extension of the rally for the largest cryptocurrency by market capitalization can be expected.\n\nLooking at the chart patterns, there are certain signals that stand out, allowing analysts to make reasonable assumptions about the price of Bitcoin for the near future, including the observations by the crypto analytics team TradingShot using the TradingView platform on January 20.\n\nThe analysts first drew attention to the application of the Adam and Eve (A&E) pattern (a bullish double bottom pattern with twin bottoms at around the same price) that started forming since the FTX implosion in November and which was accurate with its target, even though it “went under the radar.”\n\n“As you see, Wednesday’s peak wasn’t just a consequence of the $21,500 resistance that was formed by the November 5 top but also completed a +18.00% rise from the December 14 high, which was a proportional rise (18%) from the November 21 low.”\n\nAccording to the analysis, Bitcoin is currently trading sideways and moving to test the four-hour moving average on 50 data points (4H MA50) for the first time since January 6. Furthermore, “a break can seek the 4H MA200 as its last support.”\n\nBitcoin price movement analysis. Source: TradingShot/TradingView\n\nWhat to look for?\n\nOn the basis of these movements, confirmations can be looked for “that will either lead to that correction or the extension of the rally,” or more precisely, the moving average convergence divergence (MACD) and relative strength index (RSI) indicators, as follows:\n\n“First, keep an eye on the 4H MACD. A bullish cross will be a signal to buy into round 2 of the rally. The 4H RSI has a clear higher lows trend-line as its support, and a lower highs trend-line is leading it there. A break above the lower highs earlier will again be a buy signal.”\n\nAs a reminder, a bullish crossover happens when the MACD line crosses above the signal line presenting an entry point or buy opportunity for traders, as opposed to the bearish crossover that occurs when the MACD line crosses below the signal line indicating a sell opportunity or an exit point.\n\nBitcoin price analysis\n\nMeanwhile, the flagship decentralized finance (DeFi) asset was at press time changing hands at the price of $21,104, up 1.79% across the previous 24 hours, as well as increasing 11.83% over the past week, adding up to the cumulative gains of 25.14% on its monthly chart.\n\nBitcoin 7-day price chart. Source: Finbold\n\nIn the meantime, the crypto community at CoinMarketCap is bearish about BTC for the end of January, currently projecting it would be trading at the average price of $19.390 on January 31, which represents a drop of 8.09% from its current price.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]