[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzIxL3Byb3NoYXJlcy1zYXlzLWJpdGNvaW4tZXRmLWhhcy1tYXRjaGVkLWJ0Yy1wcmljZS1jbG9zZWx5LXJvbGwtY29zdC1jb25jZXJucy1hcmUtdW53YXJyYW50ZWQv0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjEvcHJvc2hhcmVzLXNheXMtYml0Y29pbi1ldGYtaGFzLW1hdGNoZWQtYnRjLXByaWNlLWNsb3NlbHktcm9sbC1jb3N0LWNvbmNlcm5zLWFyZS11bndhcnJhbnRlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "ProShares Says Bitcoin ETF Has Matched BTC Price Closely, 'Roll Cost' Concerns Are Unwarranted - CoinDesk",
        "content": "From the very beginning, observers speculated BITO and other futures-based ETFs would significantly underperform bitcoin due to costs associated with rolling over, or selling expiring futures contracts and buying the next set. Usually, longer-dated futures contracts trade at a premium to those closer to expiry, a condition known as contango. The contango tends to steepen during bull runs, and the steeper the contango, the higher the costs, and the so-called contango bleed."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDcvMjEvY3J5cHRvLWNvdXBsZS1hcHBlYXItc2V0LXRvLXBsZWFkLWd1aWx0eS1pbi1iaXRjb2luLW1vbmV5LWxhdW5kZXJpbmcuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA3LzIxL2NyeXB0by1jb3VwbGUtYXBwZWFyLXNldC10by1wbGVhZC1ndWlsdHktaW4tYml0Y29pbi1tb25leS1sYXVuZGVyaW5nLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "'Crypto Couple' appear set to plead guilty in bitcoin hack money laundering case - CNBC",
        "content": "The nature of the charge or charges in the information was not made public. It is common for informations to have fewer charges than those originally lodged against defendants, or to have different ones.\n\nAnother docket entry shows that Lichtenstein and the aspiring rapper Morgan have been ordered to appear in court on Aug. 3 for separate arraignments and plea hearings on the information.\n\nAn information is a type of charging document that federal prosecutors typically use when defendants have agreed to plead guilty.\n\nThe couple, Ilya Lichtenstein and Heather Rhiannon Morgan, have been newly charged in the case with a document known as an information, according to a new Washington, D.C., federal court docket entry Friday.\n\nThe New York couple charged with trying to launder $4.5 billion in bitcoin stolen in a 2016 hack of Bitfinex appear set to plead guilty in the case.\n\nJudge Colleen Kollar-Kotelly on Friday ordered prosecutors and defense lawyers to provide plea paperwork to her by Thursday, the docket shows.\n\nThat paperwork is to include \"charged offense(s) and statutory provision; charge(s) in plea and statutory provision; elements of the offense; copy of the plea agreement; penalties; and [federal sentencing] guideline calculations.\"\n\nThe couple was originally charged in a criminal complaint when they were arrested in February 2022, and had pleaded not guilty to the charges listed in that document – money laundering conspiracy and conspiracy to defraud the United States.\n\nMorgan, known as \"Razzlekhan,\" is free on a $3 million bond. Lichtenstein, whose nickname is \"Dutch,\" has been held in jail since February 2022 without bond after a judge ruled that the Russian emigre was a flight risk.\n\nThe U.S. Attorney's Office in Washington, which is prosecuting the couple, declined to comment. Their defense lawyers didn't immediately respond to requests for comment from CNBC.\n\nProsecutors had said weeks after the couple's arrests that they were in plea negotiations with them.\n\nThe couple's case has been repeatedly continued since their arrests. Until Friday's new docket entries, they had been scheduled to appear at a status hearing on Monday. That hearing was vacated as a result of the new charging document being filed.\n\nLichtenstein, 34, and the 32-year-old Morgan are accused of trying to launder the proceeds of 119,754 bitcoin that were stolen from Bitfinex's platform in August 2016. The couple was not charged in the hack of the Hong Kong-based cryptocurrency exchange.\n\nAt the time of their arrests, the Department of Justice said officials had been able to seize more than 94,000 bitcoin involved in the hack, which at that time of the seizure was worth about $3.6 billion. That was the largest financial seizure in DOJ history.\n\nThe bitcoin stolen in the hack was worth just $70 million at the time of the theft, but soared in value in the following years.\n\n\"Over the last five years, approximately 25,000 of those stolen bitcoin were transferred out of Lichtenstein's wallet via a complicated money laundering process that ended with some of the stolen funds being deposited into financial accounts controlled by Lichtenstein and Morgan,\" the DOJ said at the time of their arrests.\n\nNetflix in early 2022 announced it had commissioned a series on the couple."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA3LTIxL3BlcnNvbmFsLWZpbmFuY2Utc3BvdC1iaXRjb2luLWV0ZnMtYXJlLWNvbWluZy1iZXdhcmUtdGhlLXJpc2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETFs Are Coming. Beware the Risk. - Bloomberg",
        "content": "Last month, BlackRock Inc., the world’s biggest money manager, asked the Securities and Exchange Commission to approve a spot Bitcoin exchange-traded fund — a fund that would invest in the digital currency directly rather than through futures markets. BlackRock joins tens of other smaller ETF providers with the same request, so far without success. But with BlackRock’s heft behind growing demands for a spot Bitcoin fund, it’s only a matter of time before the SEC relents.\n\nAnd it should. A spot ETF would allow investors to buy, sell and hold Bitcoin more easily, cheaply and securely than they can today. In a crypto industry awash with scams, regulatory oversight would also give investors and money managers confidence that they’re buying a bona fide financial product, particularly if it has BlackRock’s name on it."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tbWluaW5nLWJhbm5lZC1rdXdhaXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "'Cheapest country to mine bitcoin' just banned the practice altogether - Blockworks",
        "content": "Kuwait’s capital markets regulator banned bitcoin mining this week as they reiterated prohibitions on crypto activities.\n\nThe prohibition came down via an official circular released on Tuesday. Kuwaiti authorities had previously only expressed disapproval of crypto payments.\n\nAs early as 2017, the local regulator had warned banks and other intermediaries that crypto wasn’t legal tender and prohibited institutions from handling digital assets.\n\nKuwait is now reinforcing restrictions on institutions and other payment services touching crypto, but so far it seems to have stopped short of outright criminalizing interactions with crypto for individuals.\n\nStill, regulators stated the use of crypto as a form of payment is strictly prohibited, and residents are advised against engaging in any transactions involving cryptocurrency.\n\nBut until now, the regulatory status of crypto mining had been ambiguous. The recent circular changes that.\n\nKuwait shuns crypto as neighbors open arms\n\nBitcoin mining is a resource-intensive process, requiring specialized equipment and substantial energy consumption — so low energy costs can greatly impact profitability.\n\nGauging realistic costs of mining bitcoin is difficult. Large-scale operations are often vertically integrated with their own power sources, or have specialized deals for cheaper rates, which can bring down costs.\n\nStill, estimates have previously dubbed Kuwait the most affordable location to mine bitcoin (BTC) worldwide. One roundup suggested the cost of mining in Kuwait was just $1,400 per BTC in 2022 compared to more than $18,000 in Texas (bitcoin was worth more than $40,000 at the time).\n\nLocal reports indicated some crypto miners had exploited Kuwait’s low electricity tariffs by disconnecting home cooling devices in favor of mining rigs to avoid drawing suspicion with high electricity usage.\n\nThe Ministry of Electricity and Water reportedly took measures to curb such practices, including cutting off power supplies.\n\nBitcoin mining aside, Kuwait regulators emphasized that they’re banned from granting licenses to entities for the purpose of offering crypto services as a commercial enterprise.\n\nThe capital markets authority warned that any violation of this regulation would be subject to penalties in accordance with the rules pertaining to money laundering and terrorist financing.\n\nIn contrast, neighboring Dubai has taken a more inclusive stance towards crypto, positioning itself as an attractive destination for the digital asset ecosystem.\n\nAt the beginning of the year, Dubai’s “crypto zone” had already attracted over 500 crypto companies.\n\nMore specific to mining, major outfit Marathon recently pledged to open two facilities in nearby Abu Dhabi.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmludGVjaG1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9kZXZlcmUtZ3JvdXAtYml0Y29pbi1wcmljZS10by1za3lyb2NrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin ETF: Price Surge! - FinTech Magazine",
        "content": "The CEO and Founder of financial advisory, asset management and fintech organisation deVere Group, Nigel Green, says the price of Bitcoin is set to soar.\n\nThis is based on a belief that the US Securities and Exchange Commission (SEC) will imminently approve spot Bitcoin exchange-traded funds (ETFs).\n\nWhy spot ETFs could boost Bitcoin’s value\n\nSpot ETFs allow for investment in underlying assets – usually stocks or bonds – at the current market or ‘spot’ price, replicating a particular asset class or performance by giving investors a portfolio of the actual securities that make up a particular asset class/index.\n\nSimilar to a mutual fund, ETFs differ in that they are bought and sold from other owners on stock exchanges as opposed to purchases from the issuer.\n\nEssentially a way to hedge your investments across multiple companies of a particular industry, the question remains: why could the regulation of spot Bitcoin ETFs boost the cryptocurrency’s value?\n\ndeVere’s Green offers four reasons: “First, a Bitcoin ETF allows investors to gain exposure to Bitcoin without directly owning or trading the cryptocurrency. Such increased accessibility for both can lead to a larger pool of potential investors entering the market, driving up demand for Bitcoin.\n\n“Second, the introduction of a Bitcoin ETF will undoubtedly attract institutional investors who have strict regulatory requirements and risk management policies. They’ll bring with them capital, expertise and clout.\n\n“Third, ETFs are traded on established stock exchanges, providing liquidity and ease of trading. This liquidity will attract more traders and increase market efficiency, reducing price volatility. As such, increased liquidity and market efficiency can positively impact the price of Bitcoin and other cryptocurrencies.\n\n“And fourth, a Bitcoin ETF will generate significant mainstream attention and media coverage which will drive up demand and prices in the crypto market.”\n\nThe path to spot Bitcoin ETF approval\n\nWhile spot Bitcoin ETFs are currently unapproved, the SEC has, for the first time, acknowledged the applications of WisdomTree, VanEck, Invesco, Fidelity, BlackRock and Bitwise, adding the request from regulated spot trading to the Federal Register.\n\nIt is usually a 45-day review process, and application requests can stretch as long as 240 days. So, while ETF traders will be hoping for a quick resolution, the result of these applications may stretch out longer than usual.\n\n\n\nA stretched review for spot Bitcoin ETF regulation may be more likely than in other cases, given the current temperature from crypto trading assets at the SEC, following the Ripple case over its XRP cryptocurrency."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLWZhbGxzLXVzMzAwMDAtaW5zdGl0dXRpb25hbC1pbnRlcmVzdC1ldGZzLWZhaWxzLWxpZnQtbWFya2V0cy_SAXFodHRwczovL2Zvcmthc3QubmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1mYWxscy11czMwMDAwLWluc3RpdHV0aW9uYWwtaW50ZXJlc3QtZXRmcy1mYWlscy1saWZ0LW1hcmtldHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin falls below US$30,000 as institutional interest in ETFs fails to lift markets - Forkast News",
        "content": "Bitcoin fell 4.66% from July 14 to July 21 to US$29,755 at 7:35 p.m. Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under the US$30,000 mark for most of the week. Ether lost 5.38% over the week to US$1,885.\n\nIn continued institutional interest in Bitcoin ETFs, the U.S. Securities and Exchange Commission (SEC) has accepted eight applications for spot Bitcoin ETFs so far, with the first from BlackRock on July 13 and the second from asset manager Valkyrie on Monday.\n\n“Institutional interest remains a driving force behind Bitcoin’s stability, as large corporations and financial institutions continue to invest in Bitcoin, while the SEC accepts more Bitcoin ETF filings for review,” Lucas Kiely, chief investment officer of digital asset platform Yield App, told Forkast.\n\n“ETFs are set to open up the Bitcoin market, and potentially crypto markets in general, to a large pool of global investors who until this point have not considered buying Bitcoin or other cryptocurrencies. It’s grown clearer that governments are inclined to regulate rather than ban cryptocurrencies, and the Ripple ruling has provided a sense of relief in the US crypto industry.”\n\nThe SEC’s move to accept the first eight Bitcoin ETF filings for review inspired confidence in other top asset managers, Aziz Kenjaev, financial analyst and director of business development at cross-chain liquidity protocol Entangle, told Forkast,\n\n“Investors and the crypto-community called this a beginning of a new bullish cycle. The US$30,000 is Bitcoin’s major support, therefore keeping Bitcoin above this level plays a key role for the bullish continuation of Bitcoin. It’s also a psychological level, whereas dropping below this level would trigger a panic sale in the market,” wrote Kenjaev, in a statement shared with Forkast.\n\nIn Europe, French bank Societe Generale on Tuesday obtained a crypto service license in the country that allowed its crypto unit, Forge, to offer crypto sales, custody and trading services.\n\nBitcoin and crypto prices have been more correlated to macroeconomic conditions in 2023, wrote digital asset manager Grayscale Investments in a Friday report.\n\n“Since January, Bitcoin has appreciated more than can be explained by the rally in tech stocks and fall in the US dollar. We think this reflects idiosyncratic positives, including optimism about eventual spot Bitcoin ETF approval, as well as Bitcoin’s surge in March following stress in regional banks,” wrote the report.\n\n“Although crypto has healed significantly since late 2022, valuations are now more closely tied to broader macro trends, and more Fed tightening could be a headwind for higher risk assets, including both equities and cryptocurrencies.”\n\nThe global crypto market capitalization stood at US$1.2 trillion on Friday at 7:35 p.m. in Hong Kong, down 4% from US$1.25 trillion a week ago, according to CoinMarketCap data. With a market cap of US$578 billion, Bitcoin represented 48.3% of the market while Ether, valued at US$226 billion, accounted for 18.9%.\n\nNotable Movers: MKR, XDC\n\nMaker DAO’s (MKR) governance token was this week’s biggest gainer among the top 100 coins, rising 25.83% to US$1,151. The coin started picking up momentum on Friday, hours after crypto intelligence firm Lookonchain shared that a16z deposited 12,864 MKR tokens to Coinbase while CMS Holdings deposited 525 MKR to Binance, presumably selling the coins before the rally.\n\nEnterprise-grade blockchain protocol XDC Network’s (XDC) token was the week’s second-biggest gainer, rising 25.15% to US$0.04187. The coin started picking up momentum yesterday, in anticipation of the protocol’s appearance at the Ethereum Community Conference (EthCC) in Paris.\n\nSee related article: USDT’s goal is to be the dollar, not beat it, says Tether CTO\n\nNext week: Fed’s interest rate decision\n\nThe Federal Reserve’s next meeting on monetary policy is scheduled for next Wednesday. The CME FedWatch Tool predicts a 99.8% chance the Fed will raise interest rates by 25 basis points at the next meeting. U.S. interest rates are currently at 5% to 5.25%, the highest since 2006.\n\nEntangle’s Kenjaev said that a close above last week’s high of US$31,800 will be needed to boost Bitcoin prices.\n\n“The four-hour Bitcoin chart below clearly shows key levels to watch within this week. The parallel channel of June 30 signals the bearish continuation of Bitcoin for this week’s end. Although Bitcoin was able to jump back into the parallel channel, it has to close above $30,300 and remain above to continue bullish or at least guard itself from a panic sell,” wrote Kenjaev, referencing the below chart.\n\nSee related article: XRP’s partial victory as Russia inches toward CBDC; Arkham draws flak"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWluY2gtYWJvdmUta2V5LTEwMDEwMDE4OC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether inch above key levels; Matic leads gainers - Yahoo Finance",
        "content": "Bitcoin and Ether rose during Thursday afternoon trading in Hong Kong, along with most other top 10 non-stablecoin cryptocurrencies by market capitalization. Bitcoin and Ether both recaptured key support levels. Institutional interest remains upbeat following a slew of Bitcoin exchange-traded fund (ETF) applications, industry experts told Forkast.\n\nSee related article: Weekly Market Wrap: Bitcoin rises past US$31,000, cryptos rally after Ripple’s win against U.S. SEC\n\nBitcoin, Ether return above key levels, top 10 cryptos rise\n\nBitcoin rose 0.97% during afternoon trading in Asia to US$30,210 as of 4:30 p.m. in Hong Kong, recovering from a daily low of US$29,854.\n\nEther gained 1.1% during afternoon trading in Asia to US$1,913, after it fell as low as US$1,884 earlier today.\n\n“Institutional interest remains a driving force behind Bitcoin’s stability, as large corporations and financial institutions continue to invest in Bitcoin, while the SEC accepts more Bitcoin ETF filings for review,” Lucas Kiely, the chief investment officer of digital asset platform Yield App, told Forkast.\n\n“Due to its vaunted position as a commodity, Bitcoin has emerged as a long-term investment opportunity and as a hedge against inflation amid aggressive central bank monetary policies. Given this backdrop, investors are more likely than ever to perceive Bitcoin as a store of value.”\n\nPolygon’s Matic token was the day’s biggest gainer, rising 5.09% to US$0.7816, followed by the XRP token that strengthened 4.59% to US$0.8208. The XRP coin increased 73.87% on the weekly chart amid trader optimism after last week’s court ruling that the sale of XRP did not constitute a security.\n\nThe total crypto market capitalization over the past 24 hours rose 0.96% to US$1.21 trillion while market volume increased 95.85% to US$63.22 billion, according to CoinMarketCap data.\n\nBitcoin, Ethereum NFT sales fall, Solana NFT sales gain\n\nThe Forkast 500 NFT index rose 0.96% to 2,728.65 points in the 24 hours to 4:30 p.m. in Hong Kong and gained 1.05% during the week.\n\nStory continues\n\nBitcoin’s 24-hour non-fungible token sales dropped 22.27% to US$1.04 million, as sales for Uncategorized Ordinals fell 45.42% to US$465,996.\n\nThe sales slump caused Solana to overtake Bitcoin in 24-hour NFT sales volume, with US$1.15 million. Despite the increase, the Forkast SOL NFT Composite fell 0.56% during the day.\n\nEthereum’s 24-hour NFT sales fell for a second consecutive day, declining 21.77% to US$10.26 million, while sales for the largest Ethereum-native NFT collection, the Bored Ape Yacht Club, rose 10.26% to US$356,746. CryptoPunks sales also fell 76.61% to US$110,440.\n\n“Ethereum has managed to cross 10,000 unique buyers, a number it has only fallen below a few times this year,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“With NFTs losing steam it’s likely we’ll see it fall below this threshold soon, especially as NFTs enter the slower time of the NFT market in the second half of the year.”\n\nThe Opepen collection also continued its decline, with 24-hour sales decreasing 55.36% to US$148,191.\n\nAsian equities, most U.S. stock futures fall with investors cautious ahead of interest rate decision\n\nImage: elements.envato\n\nMajor Asian equities fell as of 4:30 p.m. in Hong Kong. Japan’s Nikkei 225, the Shanghai Composite, Hong Kong’s Hang Seng Index and the Shenzhen Component all posted declines.\n\nMarkets were dragged down by the tech sector after Taiwanese chipmaker TSMC forecast a 10% drop in 2023 sales.\n\nHong Kong’s annual inflation rate shrank to 1.9% in June, from 2% in May. But inflation increased to 0.6% for housing, from 0.5% in May, according to Hong Kong’s statistics department.\n\nMost U.S. stock futures fell during Thursday afternoon trading in Hong Kong, except the Dow Jones Industrial Average futures. The S&P 500 futures index and the tech-heavy Nasdaq-100 futures both declined.\n\nOn the corporate front, Netflix shares tumbled 8% on lower-than-expected quarterly revenue. Investors now await earnings reports from Johnson & Johnson and Abbott Laboratories, scheduled for release later today.\n\nInvestors remained cautious ahead of the Federal Reserve’s next meeting on monetary policy on July 26. The CME FedWatch Tool predicts a 99.8% chance the Fed will raise interest rates by 25 basis points at the next meeting. U.S. interest rates are now at 5% to 5.25%, the highest since 2006.\n\nSee related article: Standard Chartered’s great expectations for Bitcoin in 2024\n\nUpdates with equities section"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDcvMjEvY3JhaWctd3JpZ2h0LXdpbGwtYmUtYWJsZS10by1maWdodC1iaXRjb2luLWNvcHlyaWdodC1jbGFpbS1pbi11ay1hZnRlci13aW5uaW5nLWFwcGVhbC_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA3LzIxL2NyYWlnLXdyaWdodC13aWxsLWJlLWFibGUtdG8tZmlnaHQtYml0Y29pbi1jb3B5cmlnaHQtY2xhaW0taW4tdWstYWZ0ZXItd2lubmluZy1hcHBlYWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Craig Wright Will Be Able to Fight Bitcoin Copyright Claim in UK After Winning Appeal - CoinDesk",
        "content": "\"This significant ruling ... enables Dr. Wright to advance his claim for copyright in the Bitcoin File Format which potentially affects all future use, and marketing, of Bitcoin and will prove to be a crucial development in intellectual property law,” Damon Parker, a partner at U.K. law firm Harcus Parker, said in a statement."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTIxL2JpdGNvaW4tcy1zaWRld2F5cy1jaHVybi1zZW5kcy12b2xhdGlsaXR5LXRvLWEtc2l4LW1vbnRoLWxvd9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Prices (BTC) Stuck in Narrow Range Sends Volatility to a Six-Month Low - Bloomberg",
        "content": "After reaching a fresh high for the year earlier this month, Bitcoin has market observers questioning whether the momentum is sustainable with prices again trading in a very narrow range.\n\nThe largest cryptocurrency has been stuck between $29,500 and $31,500 after a nine-day, 27% surge in June. The back-and-forth filling that followed saw Bitcoin make a failed attempt to break higher, with the token now finding itself at the low-end of the sideways congestion around the $30,000 price level."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzIwL21hY3JvLXN0YXRlLW9mLWNyeXB0by13aGVyZS1pdC1oYXMtYmVlbi1hbmQtd2hlcmUtaXMtaXQtZ29pbmcv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDcvMjAvbWFjcm8tc3RhdGUtb2YtY3J5cHRvLXdoZXJlLWl0LWhhcy1iZWVuLWFuZC13aGVyZS1pcy1pdC1nb2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Macro State of Crypto – Where It Has Been and What's Next - CoinDesk",
        "content": "Macro State of Crypto – Where It Has Been and What's Next\n\nAnalytics can offer insight into how recent and past crypto and regulatory events have affected prices and movement. Plus: A quick Q&A on retirement funds."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzIxL2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1mZWFyLWFuZC1ncmVlZC1pbmRleC1zaW5rcy1pbnRvLW5ldXRyYWwtdGVycml0b3J5LWEtc2lnbi1vZi1pbnZlc3Rvci11bmNlcnRhaW50eS_SAZoBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNy8yMS9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4tZmVhci1hbmQtZ3JlZWQtaW5kZXgtc2lua3MtaW50by1uZXV0cmFsLXRlcnJpdG9yeS1hLXNpZ24tb2YtaW52ZXN0b3ItdW5jZXJ0YWludHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Fear and Greed Index Sinks Into Neutral Territory, a Sign of Investor Uncertainty - CoinDesk",
        "content": "Ether, the second largest crypto in market value, was recently changing hands at $1,892, up a smidgen from Wednesday, same time. Most other major cryptos by market cap spent Thursday slogging into the red with XRP losing some of its big gains from the day before to trade below 80 cents – recently off more than 4%, and ADA and SOL, the tokens of smart contract platforms Cardano and Solana, down nearly as much."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjAvZWwtc2FsdmFkb3JzLWJvbmRzLXN1cmdlLTYyLWFtaWQtYml0Y29pbnMtZXRmLWRyaXZlbi1yYWxseS_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzIwL2VsLXNhbHZhZG9ycy1ib25kcy1zdXJnZS02Mi1hbWlkLWJpdGNvaW5zLWV0Zi1kcml2ZW4tcmFsbHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "El Salvador's Bonds Surge 62% Amid Bitcoin's ETF-Driven Rally - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjAvZmlyc3QtbW92ZXItYW1lcmljYXMteHJwLW1vbWVudHVtLWNvdWxkLXNldC1wcmVjZWRlbnQtZm9yLWJpdGNvaW4v0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNy8yMC9maXJzdC1tb3Zlci1hbWVyaWNhcy14cnAtbW9tZW50dW0tY291bGQtc2V0LXByZWNlZGVudC1mb3ItYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "First Mover Americas: XRP Momentum Could Set Precedent for Bitcoin - CoinDesk",
        "content": "Bitcoin spot ETFs could increase BTC demand to the tune of $30 billion, according to a report by NYDIG. The crypto trading firm estimates that there are $27.6 billion in spot-like products, compared with $210 billion invested in funds for gold, to which bitcoin is often compared. “Bitcoin is about 3.6x more volatile than gold, meaning that on a volatility equivalent basis, investors would require 3.6x less bitcoin than gold on a dollar basis to get as much risk exposure. Still, that would result in nearly $30B of incremental demand for a bitcoin ETF,” NYDIG writes. The possibility of a spot bitcoin ETF in the U.S. looks far more likely since BlackRock submitted an application to list one with a “surveillance-sharing” agreement, which the SEC sees as necessary to prevent market manipulation."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjEvc29sLXhycC1sZWFkLXNsaWRlLWluLWNyeXB0by1tYWpvcnMtYXMtYml0Y29pbi1zbGlwcy1iZWxvdy0zMGsv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNy8yMS9zb2wteHJwLWxlYWQtc2xpZGUtaW4tY3J5cHRvLW1ham9ycy1hcy1iaXRjb2luLXNsaXBzLWJlbG93LTMway9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "SOL, XRP Lead Slide in Crypto Majors as Bitcoin Lingers Below $30K - CoinDesk",
        "content": "“All they have to do is argue that a token is a \"transferable share\" \"a profit interest\" etc,” Gabriel Shapiro, general counsel at crypto fund Delphi Digital, tweeted. “XRP and such will be fine but DeFi can still be persecuted at will... actually the regulators will have expanded authority to do so.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjAvYml0Y29pbi10cmFkaW5nLWluLWphcGFuLXJpc2VzLWFzLXllbi10dXJucy12b2xhdGlsZS_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzIwL2JpdGNvaW4tdHJhZGluZy1pbi1qYXBhbi1yaXNlcy1hcy15ZW4tdHVybnMtdm9sYXRpbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Trading in Japan Rises as Yen Turns Volatile - CoinDesk",
        "content": "The share of bitcoin trade volume on Japanese exchanges rose from 69% to 80% in the first six months of the year, according to data tracked by Paris-based Kaiko. The total trading volume on Japanese exchanges was $4 billion in June, amounting to a 60% year-to-date surge."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjAvY2hhaW5saW5rcy1saW5rLXBvcHMtMTUteHJwLWxvc2VzLXN0ZWFtLWFzLWJpdGNvaW4tcmV2aXNpdHMtMjk2ay1yYW5nZS1sb3dzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjAvY2hhaW5saW5rcy1saW5rLXBvcHMtMTUteHJwLWxvc2VzLXN0ZWFtLWFzLWJpdGNvaW4tcmV2aXNpdHMtMjk2ay1yYW5nZS1sb3dzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Chainlink’s LINK Pops 15%, XRP Loses Steam as Bitcoin Revisits $29.6K Range Lows - CoinDesk",
        "content": "BTC’s price dipped to as low as $29,593 during the afternoon hours, near its lowest point in a month. The largest cryptocurrency by market value has been see-sawing in a tight channel since June 21, bouncing from the $29,500 level multiple times to trade as high as $31,809."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDcvMjAvYmVuLW1ja2VuemllLW5lZWRzLWEtaHVnLXRoZS1vYy1zdGFycy1jcnlwdG8tYm9vay1pcy1hbi1pbGwtaW5mb3JtZWQtZmxvcC_SAXRodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA3LzIwL2Jlbi1tY2tlbnppZS1uZWVkcy1hLWh1Zy10aGUtb2Mtc3RhcnMtY3J5cHRvLWJvb2staXMtYW4taWxsLWluZm9ybWVkLWZsb3AvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Ben McKenzie needs a hug: The ‘OC’ star’s crypto book is an ill-informed flop - Fortune",
        "content": "You probably remember Ben McKenzie as the 27-year-old playing a 17-year-old on the early aughts soap opera “The O.C.” (Just kidding. If you’re reading the Fortune Crypto beat, odds are you were watching Survivor during that time slot.) Anyway, by Ben’s account, during the COVID-19 pandemic he took some bad financial advice from a friend, smoked legal marijuana, and came up with the idea to write a cryptocurrency book called Easy Money as he lost over $200,000 in the market.\n\nLord, grant me this much confidence in the face of failure.\n\nEven without knowing the backstory, the many contradictions and half-baked arguments suggest this book grew out of a stoned idea. McKenzie claims, for instance, that Bitcoin is only owned by a small set of people and repeatedly compares crypto to the most recent banking crisis that devastated the global housing market. He makes an unintentionally credible defense that cryptocurrencies are not securities: “Cryptos aren’t tied to anything of real value, unlike shares in a company or a commodities future. They’re computer code uncorrelated with any actual asset.” I couldn’t have put it better myself!\n\nMcKenzie likes to mock online cryptocurrency believers for using the word “community” when they only share a “utopian vision of financial freedom,” but takes great pains to laud his own legitimate “community” of skeptics who have dorm room-style conversations over beers. There’s a constant insistence that cryptocurrencies have no use case while citing capital flight from authoritarian regimes and war-torn regions. McKenzie also can’t seem to decide if FTX founder Sam Bankman-Fried is a PR genius or a bumbling weirdo.\n\nEasy Money does touch on many valid criticisms of the cryptocurrency industry. McKenzie is correct that the prevailing crypto culture revels in conspiratorial thinking and has more than a tinge of misogyny and anti-semitism. He’s correct to note that many Bitcoin “maxis” are happy to embrace authoritarians who embrace the token. Likewise, the crypto industry does provide leverage to unsophisticated actors who get fleeced by established traders, while both crypto exchanges and venture capitalists are rife with conflicts of interests. These aren’t novel observations, but they are fair. I wish McKenzie had expanded upon them, rather than rushing to paint everything with vague accusations of fraud. Brief encounters with industry folks later found to be fraudsters—not found by McKenzie, of course—get more airtime than technical explanations that would be more useful to a general audience.\n\nThere are also numerous mischaracterizations within the book that point to either shoddy editing or insufficiencies in McKenzie’s decades-old BA in economics—the poor sheepskin is mentioned so often that it feels like a character in the book—to explain cryptocurrencies. I dispute McKenzie’s basic definition of a cryptocurrency wallet, his confusing characterization of FDIC insurance, his understanding of smart contracts, and his market research on crypto fees. The one section of the book that comes off even less believable than an alleged encounter with drunken CIA officers is his account of a hypothetical Bitcoin OTC trade with a 60% haircut. (Girl, those are 2009 numbers!)\n\nMy real beef, though, is with the bitterness that seeps through the book’s pages. McKenzie’s contempt for anyone sympathetic to the book’s subject matter only serves to clarify why he’s so befuddled by it. To him, no crypto-enthusiast could possibly have a credible intellectual defense for their position, rather they’re just all “boosters” (a potentially interesting historical concept to define, which the author doesn’t) or naïfs. Basic terms from economics are defined with snarky graphs, while more sophisticated activities like ETF market-making are characterized in a single line as akin to “playing video games.” McKenzie mocks emerging markets for their potential to host technical innovation hubs and makes pains to paint “people of color” as unsophisticated victims, inexplicably highlighting the ones gifted Bitcoin by Jay-Z.\n\nAnother reason to avoid Easy Money is the final third of the book, which is a wordy report of things like Twitter feuds that took place late last year as the FTX exchange and the TerraLuna “stablecoin” saw their chickens come home to roost. It’s lazy. McKenzie should have tried to coauthor with Dirty Bubble Media, a Twitter account manned by someone with the actual hustle to unearth some of the sinews connecting the cryptocurrency world’s nasty underbelly.\n\nSome people have the chutzpah to call out bullshit when they see it, even at great risk. Others wait 10 months to write a seething account of how “average Joes” making money convinced them that they should examine the global financial system for the first time. It’s a pity the wrong party wrote this book.\n\nAnd, my goodness, could the timing be worse? McKenzie’s assured claim that most cryptocurrencies are unregistered securities was upended by last week’s court ruling in the case SEC v. Ripple. Meanwhile, the excesses of the last crypto bubble have long since popped and the market seems to be renewing after a period of deleveraging. The time to write a warning or a screed based on the instability of the market was July 2022.\n\nThe next time I see McKenzie and his Emmy-award winning film crew at something like a near empty SXSW panel, I will offer him a hug. The one thing this book convinced me of is that he needs one.\n\nKathleen Breitman is a cofounder of Tezos. The opinions expressed in Fortune.com commentary pieces are solely the views of their authors and do not necessarily reflect the opinions and beliefs of Fortune."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGltZS5jb20vNjI5NTc2MS9iZW4tbWNrZW56aWUtY3J5cHRvLWVhc3ktbW9uZXktaW50ZXJ2aWV3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Ben McKenzie Exposes Dark Side of Crypto in \"Easy Money\" | TIME - TIME",
        "content": "Ben McKenzie is an unlikely anti-crypto crusader. The actor is best known for his role as a teen heartthrob on The O.C., which is not exactly a harbinger of technological or economic rigor.\n\nBut McKenzie also has an economics Bachelor’s degree from the University of Virginia, and has studied the long history of financial frauds around the world. Based on that foundation of knowledge, McKenzie became obsessed with crypto’s rise in 2021, convinced that it was little more than a house of cards that would inevitably topple.\n\nThat August, McKenzie reached out to the journalist Jacob Silverman and proposed collaborating together on crypto journalism that would expose its potential dangers and seedy underbelly. McKenzie believed he could wield his public profile to add some nuance to a crypto discourse that mostly surfed high on optimism and euphoria.\n\n“I told Jacob: ‘If I have a superpower, it’s as a mid-level celebrity and econ dork,'” McKenzie recounted in an interview over the phone with TIME. “Those two skills don’t often overlap. But they seemed to be potentially particularly powerful here, because crypto had gathered up so much momentum with the help of lots of people pouring money into it, that it was drowning out other voices. If there’s one thing I felt like I knew how to do, it was to make a little splash—quite frankly because I’m a public person—but also explain economic concepts relatively simply.”\n\nMcKenzie and Silverman co-published several articles together, including in the Washington Post. This week, they released the book Easy Money, a culmination of their reporting which traces crypto’s stunning recent rise and fall. McKenzie interrogated leaders of crypto who have since been arrested—including FTX’s Sam Bankman-Fried and Celsius’s Alex Mashinsky—and traveled to El Salvador to monitor their mostly disastrous Bitcoin experiment. Many crypto enthusiasts argue that the current lull in prices is temporary, and that Bitcoin rises upwards in a cyclical pattern. McKenzie and Silverman, in contrast, make that case that crypto’s downfall last year was inevitable, and that its markets rest on unsustainable economic models. “The system was so fragile, and based on such faulty economics, that mass liquidations and bank runs and all manner of contagion were practically expected,” they write in the book.\n\nMcKenzie spoke to TIME about Hollywood’s embrace of crypto, his strange encounter with Bankman-Fried and his response to pro-crypto critics of the book.\n\nThis interview has been condensed and edited for clarity.\n\nHow does crypto’s rise and fall in the last few years mirror a long history of financial bubbles?\n\nThe title of the book is Easy Money. When people can get money easily—either directly, in the case of COVID stimulus payments or in the form of credit—they have incentives to gamble with it. It’s basically free money, so you might as well try to see if you can get a return.\n\nThe line between investing and gambling is quite fuzzy. Some of the things people invest in, or gamble on, are truly innovative technologies that actually do change things. And those people make a lot of money. But some of them are fraud. Charles Kindleberger is an economic historian who studied this extensively.\n\nOnce I understood that essential element—that this followed a long history of bubbles—it made a lot more sense why crypto took off like wildfire in a particular time period: during the easy money time period after the global financial crisis, and then after COVID hit and the government pumped trillions of dollars into the economy. There was just so much money flooding around looking for a home that it was pretty natural that people would gamble with it.\n\nCrypto advocates often argue that crypto will help developing nations. During your reporting, you traveled to El Salvador, the first country to make Bitcoin legal tender. What did you learn about crypto’s impact on the people it was supposed to be helping?\n\nThat was a real eye opener. The pro-crypto argument I was most sympathetic to was that there are other countries where their currencies are much more unstable, and there are people who lack access to banking. Potentially, cryptocurrency could provide a bridge for those people.\n\nBut the things I had been told in the abstract were not true, at least in El Salvador. The day that the law went into effect, the price of Bitcoin crashed 10% in hours. The Chivo wallet system didn’t work: Every citizen was given $30, but a lot of people were immediately defrauded. Someone took a picture of their dog still got $30, so the system was not exactly tightly run.\n\nBy the time I’d gotten there around 9 months later, it was basically being ignored. Less than 2% of remittances were using Chivo wallets, according to their Central Bank’s own figures.\n\nUnfortunately, it seems like crypto was being used as a vehicle of corruption for a quasi-authoritarian state. El Salvador has the highest incarceration rate in the world. And so it’s deeply ironic to me that the only place where this quote-unquote currency—that was supposed to be democratizing and decentralizing—was also a place that was locking people up on meaningless charges. That felt deeply ironic.\n\nRead More: Why El Salvador’s Bukele Is Doubling Down on Bitcoin Despite the Crypto Crash\n\nHaving been part of entertainment industry for so long, why do you think Hollywood was so susceptible to the crypto and NFT boom?\n\nThe easy money was very appealing to Hollywood. Also, crypto is just a story, of how these things are going to do all this amazing stuff they don’t actually do. Where better to sell that story than the land of storytelling, and tell it through the most famous people on earth?\n\nEconomically, it’s a good fit for the parties involved. But it’s not such a good fit for the people that end up buying these worthless links to JPEGs.\n\nYou were able to score a one-on-one interview with FTX CEO Sam Bankman-Fried, who has since been criminally charged with fraud among other allegations. In your interview, did you sense an aura or a charisma that Sam seemed to captivate the rest of the world?\n\nI think what Sam did brilliantly was cut against what we think of as the profile of a fraudster. We think of older, tough men who project an aura of uber-confidence and slickness.\n\nSam cut the other way. He’s this kid who always wore a t-shirt and cargo shorts. If you didn’t know who he was, you’d think, ‘He’s a kid who’s coming in to fix my computer, or like, is hanging out on message boards.’ And so it forces you to go, ‘Well, he must be brilliant because he clearly doesn’t care about the way he looks. He’s not fitting into some Wall Street stereotype of a really wealthy person.’\n\nBut as soon as we started talking, I found the actual substance of his answers, or lack thereof, really quite shocking. I really had a hard time getting to anything that resembled true conversations of the merits of crypto that he could articulate in a real way.\n\nI asked him, ‘Show me one company that does anything that’s useful here.’ He initially said remittances, but I had just come back from El Salvador. So I called bull on that. We went around again, and he named Solana. But he happened to own a lot of that currency–and Solana breaks down all the time. He was advocating for it while potentially just pumping his bags.\n\nAnswers like that really left me aghast. It’s one thing for Joe Schmo on the floor of the Miami Bitcoin conference to say stuff like that. But for Sam, it was shocking, because he’s supposedly the titan. I left not knowing what to feel, but feeling very unsettled.\n\nRead More: Where Did FTX’s Missing $8 Billion Go? Crypto Investigators Offer New Clues\n\nJournalists more sympathetic to crypto have unsurprisingly criticized the book in the last few weeks. Brady Dale wrote in an Axios newsletter: “It’s a book where the two writers knew their conclusion before they did any reporting.” Would you like to respond?\n\nWe knew that it was one of the biggest frauds in history. Then we did 2 years of reporting and found out that was true. If that’s your ‘gotcha,’ okay. I guess we’re pretty smart, then. We certainly found a lot of fraud.\n\nCoinDesk’s Daniel Kuhn called you a “hypocrite” for writing this book after placing a $250,000 bet against crypto, arguing that your crusade against crypto is “essentially the same type of arrangement that McKenzie often criticized others [including Kim Kardashian] for.”\n\nI put my money where my mouth was. I was trying to warn people there was a lot of fraud, and that I suspected it was a bubble. Whether people heard that or not is really not up to me. But I wasn’t out there potentially selling unregistered, unlicensed securities. I was warning people it would go belly up, I thought—and sure enough, it did."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NvaW5iYXNlLXN0b2NrLW91dHBlcmZvcm0tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Coinbase stock has now outperformed bitcoin over the past year - Blockworks",
        "content": "Crypto stocks have been on a tear this year, outstripping most major cryptocurrencies.\n\nMajor bitcoin miner Core Scientific (CORZ) has clocked 1,140% gains to reach $0.87 per share.\n\nThe Texas-headquartered firm, which filed for bankruptcy last December, hopes to make a comeback. But it has a ways to go to fully repair its once-billion-dollar valuation — still down 56% over the past year and more than 90% since it went public in 2021.\n\nCipher Mining (CFIR) has also been buoyed by bitcoin’s year-to-date rally, having jumped almost 600%. BTC is up 80% in 2023, even after slipping below $30,000 this week.\n\nTeraWulf (WULF) — which debuted the US’s first nuclear-powered bitcoin mining facility in May — and Iris Energy (IREN) are respectively up 384% and 466%.\n\nExcluding Core Scientific, a trader who placed equal bets across top bitcoin mining stocks at the start of the year would be up nearly 250%.\n\nInvestments into the top 50 cryptocurrencies by market cap, meanwhile, would have netted the same individual an average of around 49% over the same period.\n\nEther (ETH) is up 58% and XRP has popped 130%, with markets for the latter reacting positively to a mixed court ruling in a long-running legal dispute.\n\nCoinbase (COIN), the only publicly-listed US crypto exchange, has also tripled this year, having started below $35 to $101 today. That converts to one-third gained over the past year, but it’s still 70% down since its April 2021 direct listing.\n\nBitcoin mining stocks are proving more volatile than bitcoin (chart by David Canellis)\n\nThe world’s largest asset manager, BlackRock, named Coinbase as the potential bitcoin custodian in its spot ETF filing last month.\n\nAn average of 22 Wall Street analyst forecasts on Coinbase points to a price target of $68.53, suggesting a 32% fall from its current price, per TipRanks.\n\nPerformance in the fintech payments sector, meanwhile, has been mixed. Block (formerly Square), the firm behind bitcoin-forward Cash App, has seen an 18% increase year to date.\n\nPayPal, which allowed users to buy and sell crypto back in October 2020, is down about 2%.\n\nWhile the corporate earnings season has kicked off across the broader economy in the US, publicly-traded crypto companies are not due to report until later this month.\n\nPositive earnings for crypto stocks this month may act as a catalyst for further growth across digital asset markets, although the same can’t be said for lackluster quarterly reports.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzIxL2JpdGNvaW4tZGF3ZGxlcy1iZWxvdy0zMGstYXMtaW52ZXN0b3JzLWV5ZS1jb21pbmctZmVkLXJhdGUtZGVjaXNpb24tYnRjLW9wdGlvbnMtZXhwaXJ5L9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzIxL2JpdGNvaW4tZGF3ZGxlcy1iZWxvdy0zMGstYXMtaW52ZXN0b3JzLWV5ZS1jb21pbmctZmVkLXJhdGUtZGVjaXNpb24tYnRjLW9wdGlvbnMtZXhwaXJ5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Dawdles Below $30K as Investors Eye Coming Fed Rate Decision, BTC Options Expiry - CoinDesk",
        "content": "\"We'll see for the most part prices stay flat, at least for the upcoming,\" Lewitinn said. \"Unless there's some exogenous variable, some sort of crazy news story – who knows what [SEC Chair Gary] Gensler could do. But all things being equal, we're probably going to end up at about $30,000, a slow week.\""
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1iaXRjb2luLW1pbmluZy1hbmQtaG93LWRvZXMtaXQtd29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "What is Bitcoin Mining and How Does It Work? - Decrypt",
        "content": "In brief Bitcoin mining is the process of adding and verifying blocks of transactions to Bitcoin’s public blockchain.\n\nBitcoin uses the “proof of work” consensus mechanism, which demands commitment from miners in the form of expensive mining hardware and electricity.\n\nMiners compete to solve a complex cryptographic puzzle, and are rewarded with newly-minted Bitcoin.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin mining is the process by which blocks of transactions are added to the public blockchain and verified. It’s also the process by which new Bitcoin is created—a mechanism that both secures the integrity of the blockchain and incentivizes participation in the network.\n\nMiners compete to add new blocks to the blockchain. Mining Bitcoin demands a substantial commitment on the part of miners; it’s a costly, time-consuming task, and one that’s necessary for the cryptocurrency to work and for people to have faith in its legitimacy.\n\nOver a decade since Bitcoin was created by Satoshi Nakamoto, most people have heard of mining. But what does it really mean—and how do you go about mining Bitcoin?\n\nAD\n\nAD\n\nWhat is Bitcoin mining?\n\nMining Bitcoin isn’t like digging for gold or coal deep underground. It refers to verifying the transactions made using Bitcoin. Miners are those individuals or companies that sustain and audit the blockchain network that supports the cryptocurrency.\n\nThey do so by completing \"blocks\" of verified transactions, which are added to the blockchain; when a miner completes a block, they are rewarded with Bitcoin.\n\nDid you know? Approximately every four years, the reward for mining Bitcoin is halved, an event known (unsurprisingly) as the “halving”. In May 2020, the block reward dropped from 12.5 BTC per block to 6.25 BTC.\n\nMining for Bitcoin isn’t as cheap as it once was, but this still doesn’t prevent investors from carrying out this activity. The block reward of Bitcoin is the incentive that powers cryptocurrency transactions through legitimizing and monitoring the network. Because this responsibility is carried out by many users throughout the world, Bitcoin is a decentralized cryptocurrency, meaning that it relies on no central authority such as a government or bank for its trustworthiness.\n\nWhy does Bitcoin need miners?\n\nMining is, in effect, a process of auditing and verifying Bitcoin transactions to prevent the problem of “double spending”. Double spending is where someone with cryptocurrency tries to spend the same coin twice. With physical currency, you can’t buy a drink in a pub with a £20 note and then pop to the shops to buy some groceries with the same £20 note.\n\nWith cryptocurrency, there is a risk that someone with Bitcoin could make a copy of that Bitcoin and send that to a merchant instead of the real thing. In the real world, the cashier looks at a £20 note to ensure it is not fake—and this is what Bitcoin miners are trying to do with cryptocurrency; they are checking to ensure that a transaction has not been made twice.\n\nAD\n\nAD\n\nWhat is the process of Bitcoin mining and what can you do with it?\n\nBitcoin uses a consensus mechanism called proof of work.\n\nThe process of mining Bitcoin works as follows:\n\n🖥️ A miner’s computer, called a node, collects and packages individual Bitcoin transactions from the last ten minutes into a block.\n\n🖧 This node competes with other nodes in the network to solve a complicated cryptographic problem to be the first to validate the new block for the blockchain.\n\n📡 The first miner to solve the problem broadcasts their success to the entire network.\n\n🧮 Other nodes then check if their solution is correct. If correct, the new block is added to the blockchain and the whole process starts again.\n\n💰 As the miner was first to solve the problem, it gets rewarded with Bitcoin.\n\nBitcoin mining hardware runs a cryptographic hashing function on a block header.\n\nWhat that means is that each miner creates a “candidate block” with unconfirmed transactions from the node’s memory pool, or mempool. This block includes a block header that summarizes the data inside the block, along with a reference to an existing block in the blockchain and a nonce (“number only used once”). In Bitcoin, the nonce is a whole number somewhere between 0 and 4,294,967,296.\n\nThis block header is then put through the SHA256 hash function; if the resulting number is higher than the current target hash, the miner adjusts the nonce and tries again. Miners do this many thousands of times per second. The difficulty target is a 256-bit number; it is adjusted every 2016 blocks (roughly every two weeks), to ensure that a block is mined on average once every 10 minutes.\n\nWhen a lucky miner’s hash function spits out a result that’s lower than the current target hash, the block is broadcast to the network. Each node checks that the block header hashes to meet the target, and if confirmed the newly mined block is added to the blockchain. The miner receives a reward of Bitcoin; this transaction, which creates new Bitcoin out of thin air, is known as the “coinbase transaction” and is included in the candidate block.\n\nThese rewards serve to incentivize participation and keep things running smoothly.\n\nAD\n\nAD\n\nThe rate at which coins are issued is set by the mining code, ensuring that the time it takes for a miner to win a block is always approximately 10 minutes. This is to protect the system and prevent miners from creating their own Bitcoin.\n\nEvery time Bitcoin is mined, the cryptographic problem becomes harder to solve, meaning that miners will require a higher hash rate to succeed in earning block rewards. This means that more computing power is needed to earn the same amount of cryptocurrency.\n\nThe first Bitcoin miners used their computers’ CPUs to complete the cryptographic problems. Soon, miners discovered that graphics processing units (GPUs) were more effective than CPUs, sparking an arms race in mining hardware. Now, Bitcoin miners use dedicated hardware known as ASIC (application-specific integrated circuit) miners—though miners of Ethereum and other cryptocurrencies still typically use GPUs, which has led to shortages of graphics cards.\n\nSolving cryptographic problems is necessary to protect the Bitcoin network from attacks. To reverse transactions in the blockchain would require 51% of the whole network’s computing power. This ensures that any attack is difficult and pointless as an attacker would have to own more mining hardware than anyone else.\n\nChina's Bitcoin mining crackdown, and beyond\n\nAs Bitcoin mining has matured, the barrier to entry for individual miners has been raised. Now, most mining is carried out by “pools” of miners who combine their resources and attempt to use their cumulative computing power to earn Bitcoin rewards.\n\nUp until mid-2021, the majority of mining pools were based in China. That changed in May 2021, when China's State Council included Bitcoin mining in a list of financial risks that required monitoring. It marked the start of a sweeping crackdown on crypto mining across China, prompted by the country's commitments to carbon neutrality and the imminent launch of its digital yuan, a central bank digital currency and Bitcoin rival.\n\nA succession of mining bans imposed by provincial governments including Inner Mongolia, Xinjiang, Qinghai, Yunnan and Sichuan followed, causing a collapse in the Bitcoin mining hash rate. Since then, Chinese miners have relocated to countries including Kazakhstan, while miners in other countries have picked up the slack, with the result that by October 2021, the U.S. had overtaken China as the world's largest market for Bitcoin mining.\n\nMiners are heavily influenced by electricity prices, since proof of work mining uses large quantities of electricity; many miners relocate their operations to make the most of cheap electricity.\n\nAD\n\nAD\n\nDid you know? The supply of Bitcoin is capped at 21 million. When all 21 million BTC are mined, in around 2140, miners will be rewarded with transaction fees.\n\nBitcoin mining has come in for criticism over its high energy consumption, which in 2021 was around 11.8 GW or 103.31 terawatt-hours—more than the output of twelve nuclear power plants.\n\nSome advocates of the cryptocurrency argue that it functions as an “energy currency” that incentivizes the use of surplus energy; indeed, several power plants in the USA and Iran are now using surplus natural gas to operate large-scale Bitcoin mining operations. Other miners are looking to nuclear power. The government of El Salvador, which made Bitcoin legal tender in 2021, has even started mining Bitcoin using geothermal energy from volcanoes.\n\nFigures for how much of Bitcoin's total energy consumption comes from renewables vary, with estimates ranging from 39% to as much as 75% (though the higher estimates typically come from firms involved in the crypto industry). Bitcoin miners currently generate a carbon footprint equivalent to that of Bangladesh.\n\nStung by this criticism, some cryptocurrencies are switching from a proof of work consensus mechanism to a system known as proof of stake (PoS).\n\nInstead of miners, proof of stake cryptocurrencies have validators. These validators stake their cryptocurrency on betting which blocks will be added next to a chain. If successful, the validators get a block reward in proportion to what they have staked. Ethereum, the second-biggest cryptocurrency by market capitalization after Bitcoin, is switching to a proof of stake model with its Ethereum 2.0 upgrade.\n\nBitcoin, however, is sticking with the tried-and-true proof of work consensus model espoused by Satoshi Nakamoto in the original Bitcoin whitepaper, over a decade ago."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItbWF0aWMtc29sYW5hLWNyeXB0by1tYXJrZXQv0gFCaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1ldGhlci1tYXRpYy1zb2xhbmEtY3J5cHRvLW1hcmtldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin price falls; Ether flat, Matic leads gainers, Solana the losers - Forkast News",
        "content": "Bitcoin fell on Friday morning in Asia as other top 10 non-stablecoin cryptocurrencies traded mixed. Bitcoin again slipped below support at US$30,000 after a week that saw buyers retreat. Developments in applications for Bitcoin exchange-traded funds (ETFs) failed to generate fresh investment, though some commentators say the pent up demand is there. Ether traded flat and is also a loser for the week. Matic led the early gainers on Friday, but is also in the red for the week.\n\nBitcoin backs off\n\nBitcoin fell 0.18% to US$29,824.09 as of 6:40 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency has lost 4.53% in the past seven days.\n\nThe drop came amid further developments in Bitcoin exchange-traded fund (ETF) applications by U.S. asset managers.\n\nSpot Bitcoin ETF applications from BlackRock, Fidelity, Invesco Galaxy, VanEck, and WisdomTree on July 19 were published in the Federal Register, which means the Securities and Exchange Commission (SEC) now has up to 240 days to accept or request the applications, according to Bloomberg.\n\nBloomberg research analyst James Seyffart wrote on Twitter that while this sets the clock ticking, the SEC may still reject all the applications.\n\nBlackRock, the world’s largest asset manager, filed its spot Bitcoin ETF application on June 15, sparking a round of buying of cryptocurrencies on expectations more institutional funds will start investing in the asset class.\n\nWhile that enthusiasm has faded, Alex Kuptsikevich, senior market analyst at London-based brokerage firm FxPro said latent demand for cryptocurrencies remains, although “the momentum is far from euphoric.” Kuptsikevich added that Bitcoin continued to find support this week on dips below $30,000. “A move to the upper boundary at $31,300 is most likely in this environment,” he said.\n\nAsia Pacific institutional investors “remain constructive across the digital asset complex following last week’s positive news on [ETFs],” said Matt Long, the APAC general manager of California-based international crypto brokerage FalconX. “They are well positioned for further appreciation in markets,” said Long in an emailed statement to Forkast.\n\nU.S.-based digital asset manager Grayscale Investments said in a Friday report that about half of Bitcoin’s 80% increase from December to mid-July relates to macro developments, while the rest is due to Bitcoin-specific positives.\n\n“Crypto no longer behaves as its own ecosystem: Bitcoin and other digital assets are now more correlated with other market indicators,” according to the report.\n\n“Since January 2023, Bitcoin has appreciated more than can be explained by the rally in tech stocks and fall in the US Dollar. We think this reflects idiosyncratic positives, including optimism about eventual spot Bitcoin ETF approval, as well as Bitcoin’s surge in March following stress in regional banks,” Grayscale said.\n\n“Valuations are now more closely tied to broader macro trends, and more Fed tightening could be a headwind for higher risk assets, including both equities and cryptocurrencies,” the report said.\n\nBack in Asia Friday morning trading, Ether edged up 0.31% to US$1,895.14, while falling 4.70% in the last week.\n\nOther top 10 non-stablecoin cryptocurrencies were mixed — Polygon’s Matic led gainers, rising 3.42% to US$0.7711. However, it posted a weekly loss of 8.46%.\n\nPolygon Labs is currently working on developing Polygon 2.0, a series of updates to the blockchain that the company says aim to make network governance more open and inclusive.\n\nSolana was the biggest loser among the top 10, declining 3.53% to US$25.49, amid a 0.72% weekly loss.\n\nThe total crypto market capitalization edged down 0.15% in the past 24 hours to US$1.2 trillion, while trading volume jumped 19.19% to US$37.15 billion.\n\nNFTs fall; OpenSea launches swap feature\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index fell 0.56% in the past 24 hours to 2,696.41 as of 08:30 a.m. in Hong Kong. The index gained a flat 0.01% in the last seven days.\n\nTotal NFT trading volume rose 1.62% to US$18.69 million in the past 24 hours, according to data from CryptoSlam. Forkast NFT market indexes measuring performance on the Ethereum, Polygon and Solana blockchains all dropped, while the Cardano index rose.\n\nOn Thursday, NFT marketplace OpenSea announced that it is launching “Deals,” a new peer-to-peer NFT swap function. The company said in a tweet that this will help users avoid falling victim to “sketchy DMs & websites” as OpenSea will provide the platform for users to directly engage with each other.\n\nYehudah Petscher, NFT Strategist at Forkast Labs, says this feature is “more significant than people may realize.”\n\n“One of the primary ways people are scammed in the NFT space is through fake trades. Often, legitimate trade sites are spoofed, and then trades offered through there,” said Petscher. “Now collectors will be able to trade using a platform they’re already familiar with and trust, and the best part is there are no fees involved other than gas.”\n\nCurrently, OpenSea allows only ERC-721 NFTs on Ethereum from verified collections to be traded on Deals. To make a “deal,” a user can offer one or more NFTs in return for another user’s NFTs, where one can also choose to add wrapped Ether (WETF) as part of the offer. The user accepting the deal will have to pay gas fees, according to OpenSea.\n\n“Easy to use, and hopefully will have a major impact on lowering scams. This was long overdue.” Petscher said.\n\nElsewhere, Yuga Labs’ Bored Ape Yacht Club topped CryptoSlam’s NFT collection ranking by trading volume, rising 3.80% in the last day to US$1.4 million.\n\nEthereum was the top performing blockchain network by NFT trade volume, gaining 5.63% to US$13.73 million. Solana placed second, up 4.41% to US$1 million.\n\nU.S. equity futures gain after mixed session\n\nU.S. Federal Reserve Board Chairman Jerome Powell | Image: Getty Images\n\nThe three major U.S. stock futures indexes gained as of 11:10 a.m. in Hong Kong on Friday, after equities had a mixed regular trading session on Thursday.\n\nThe Dow Jones gained on top of strong Q2 earnings reports from Johnson & Johnson and Goldman Sachs. The S&P 500 and Nasdaq 100 slipped as Tesla tumbled on weak second-quarter gross margins and Netflix reported less-than-expected revenue.\n\nIn Asia, China’s Shanghai Composite Index gained, partially recovering from disappointing economic growth data for Q2. Investors are betting on Beijing to step up its economic stimulus measures, according to Trading Economics. Hong Kong’s Hang Seng Index also rose on China news of authorities possibly easing home buying limits in big cities.\n\nJapan’s Nikkei 225 dipped after its inflation rate rose slightly in June. South Korea’s Kospi also slipped.\n\nOn macro events, the next U.S. Federal Open Market Committee meeting is next week on July 26 when the central bank will make its next move on U.S. interest rates. The CME FedWatch Tool predicts a 99.8% chance that the Fed will announce a further 25 basis points raise that will take rates to the 5.25%-5.50% range, which will be the highest since January 2001.\n\n(Updates to add equity section)"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvd29sZi1vZi1hbGwtc3RyZWV0cy13b3JsZC1iaXRjb2luLWhpdHMtMW0tMS1taWxsaW9uLWhhbGwtb2YtZmxhbWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Wolf Of All Streets worries about a world where Bitcoin hits $1M: Hall of Flame - Cointelegraph",
        "content": "Scott Melker is the host of The Wolf Of All Streets Podcast and author of The Wolf Den newsletter.\n\n“If I tweeted about a small cap [crypto] of some sort right now, the price would probably change by like 50%,” says Scott Melker, better known to his 904,800 Twitter followers as The Wolf Of All Streets.\n\nMelker says he takes this responsibility seriously and won’t share tweets that might “impact the market” – but this makes Twitter “a lot more boring” from his end. In fact, Melker declares that Twitter “stopped being fun” when he reached 100,000 followers.\n\n“That’s when I went through a phase of a real love-hate relationship with Twitter because that’s when I guess 10% of the people who respond to comments were trolling at any given time.”\n\nAll you can really post to 900,000 followers is “Bitcoin and inspirational quotes” because “everything else” will land you in hot water.\n\nAfter graduating from Penn State University with an Anthropology degree in 1999, Melker tried his hand at a “million” other things — finding the most success in his 20-year stint as a DJ.\n\nShortly after finishing university, he also started his own magazine in Philadelphia called 101 Magazine, focusing on street culture and city vibes.\n\nIt caught the attention of a “huge” magazine called Frank 151, which acquired it, and Melker became the editor-in-chief of both.\n\nDuring that time, he had the opportunity to attend “insane” parties and rub shoulders with legendary acts like the Wu-Tang Clan and Outcast.\n\nThe music industry led him to try crypto trading in the first place.\n\n“I just happened to look into crypto because there was a bunch of DJs trading it,” he says.\n\nHe first started trading on the Gemini crypto exchange in 2016 and recalls buying Bitcoin to send it to another exchange, Bittrex, so he “could buy Ethereum and Ripple.” ETH was “under 20 bucks” back then, he notes in a cheeky humble brag.\n\nRather than some lofty higher purpose, he says the main attraction was making cold hard cash.\n\n“I was really just trading, trying to make money to support a new family; it had nothing to do with what Bitcoin was or what the asset class was.”\n\nWhat led to Twitter fame?\n\nMelker initially started stacking up followers when he was “trading the market well” and posting about it on Twitter. At that point in time, his content was “100% charts and trades.”\n\nHowever, Melker didn’t want his account to be based on trades because it’s “fickle.”\n\nSo, he transitioned toward a more holistic approach to his content within the crypto industry.\n\n“I would love to tell you there was some strategy that I took to grow my account, but it was always just me doing whatever I enjoyed doing the most at any given time.”\n\nMelker has observed a direct correlation between his follower growth and the performance of the crypto market.\n\nDuring previous bull markets, he has experienced an insane influx of daily followers.\n\n“There was a time when I was getting a hundred thousand [followers] in two months,” he says.\n\nMelker used to “literally respond to everybody” who commented on his tweets or messaged him, but that ship has now sailed.\n\n“That’s like a full-time job, and then you just get to the point where you literally can’t open all your DMs anymore,” he says.\n\nBut it’s best not to refer to him as an “influencer.”\n\n“I hate the term influencer because, to me, I’m just a student of crypto, and it’s something I’m passionate about and want to learn more about.”\n\nWhat type of content do you do?\n\nMelker’s content revolves around crypto news and keeping people up-to-date with what’s happening in the market.\n\nHe likes to share his take on what’s important, and “what’s kind of noise and not signal.”\n\n“[My content includes] all the lessons that I’ve learned in my streams and podcasts, but I would say it’s generally educational/informational content about this market.”\n\nMelker emphasizes the overwhelming pressure he faces whenever he decides to “fire off a tweet,” considering how many followers he has amassed on Twitter.\n\n“Twitter is like a movie where you throw a grenade in a room and walk away, and there’s a huge explosion behind you. That’s how I feel every time I send a tweet now,” Melker says.\n\nExtreme beef: Gary Gensler\n\nMelker is not a fan of United States Securities and Exchange Commission Chair Gary Gensler.\n\nHe admits that his Twitter is filled with many “angry tweets against Gensler.”\n\n“I literally contributed to aggressively getting #firegarygensler trending on Twitter,” he declares.\n\nHe explains that his problem with Gensler is his recent regulatory actions, which he perceives as a “massive overcorrection” targeting crypto firms.\n\nHe believes that it stems from a sense of embarrassment over the fact Gensler was meeting with Sam Bankman-Fried before the collapse of FTX and didn’t realize “he was a fraud.”\n\nSpicy beef: ZachXBT\n\nZachXBT, a pseudonymous on-chain researcher, accused Melker of pumping and dumping shit coins to his followers in 2021. It was a troubling time for Melker, who received threats and became the target of white-hot anger.\n\nMelker vehemently refuted the claims and announced he would steer clear of tweeting about projects with small market caps altogether.\n\nMelker says he doesn’t want his audience to get the wrong idea and prefers to focus on the educational stuff. He reiterates that he “was passionate” about trading altcoins, but says it can be difficult to navigate the boundaries of what you should and shouldn’t talk about as your following grows.\n\n“You don’t just show up with 900,000 followers one day and understand what you can and cannot tweet about.”\n\nPrice predictions?\n\n“There’s nothing that makes you look dumber than a price prediction,” Melker states. He should know, given he took an optimistic swing at predicting Ethereum would hit five figures in 2021.\n\nI think $ETH will hit 5 figures this year. — The Wolf Of All Streets (@scottmelker) February 15, 2021\n\nHowever, he is bullish on Bitcoin hitting six figures in the next bull run.\n\n“I think the next cycle would be somewhere between 100 (thousand) and 250 (thousand),” he declares.\n\nBut Melker believes that after that, the market will see another huge decline before it hits half a million.\n\n“Then we drop down to 60 (thousand), and it’s boring forever. Then, we pop up to half a million, like we continue these four-year cycles.”\n\nHowever, Melker doesn’t want “to live in a world where Bitcoin is a million dollars.”\n\n“The faster it happens, the worse the world is,” Melker says.\n\n“Because if Bitcoin goes to a million dollars. It means that everything else has exploded, including the United States dollar, and we’re living in some Mad Max dystopian future.”\n\n“Where you and I are those guys without faces painted going to gas town, fighting off the enemies,” he describes, referring to the 2015 movie Mad Max: Fury Road.\n\nBut maybe in a couple of decades.\n\n“I would like to see Bitcoin at a million dollars in 20 years, following reasonable cycles,” he adds."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcmltaW5hbHMtcHJlZmVyLXN0YWJsZWNvaW5zLW92ZXItYml0Y29pbi1mb3ItaWxsaWNpdC11c2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin no longer asset of choice for criminals — former Elliptic crypto advisor - Cointelegraph",
        "content": "Crime in Web3 is shifting away from Bitcoin (BTC) to stablecoins, and Ponzi schemes remain prevalent, according to Elliptic’s former head of technical crypto advisory.\n\nTara Annison shared the latest insights from the murky world of cryptocurrency-related crime during a presentation on the final day of EthCC in Paris, addressing a wide variety of ways digital assets are either facilitating crime or being used to launder funds.\n\nThe presentation drew Web3 crime insights from Elliptic, Chainalysis and TRM Labs, with Annison talking in her capacity as a former employee of Elliptic having recently left the firm.\n\nAccording to Annison, Bitcoin is no longer the cryptocurrency of choice for illicit activities or laundering money. As the cryptocurrency industry has matured, the establishment of decentralized finance protocols, mixing services and stablecoins present new avenues for criminals to explore.\n\nSlide from Annison’s presentation. Source: Tara Annison.\n\nCriminals have shifted toward using dollar-denominated assets, like USD Coin (USDC), with their easy accessibility and ability to be laundered through decentralized exchanges (DEXs).\n\n“The criminals use that as a target point. It’s also super easy to launder through DEXs. There’s deep liquidity, really good volume, so that’s pretty worrying.”\n\nAnnison highlighted a potential silver lining from a law enforcement perspective, noting that centralized issuers like Circle could freeze specific USDC tokens before criminals can “off-ramp out of the asset” into fiat through DEXs or centralized exchanges.\n\n“What we’re seeing now is an increased number of accounts with USDC and USDT being blacklisted, and these are frozen funds that the criminals now can’t access.”\n\nPonzi and pyramid schemes remain a feature of the sector, with Annison noting that $7.8 billion was stolen from unwitting victims of these types of scams.\n\nRelated: How the IRS seized $10B worth of crypto using blockchain analytics\n\nCriminals are finding more sophisticated ways to launder funds. Annison said chain swapping and asset swapping are prevalent as criminals try to hide illicit activity.\n\n“We’ve seen that to the tune of about $4.1 billion. So they hop across using a DEX. They use a coin swap service, they use a mixer, they use a bridge, all basically to try and throw blockchain analytics firms off the trail.”\n\nAnnison said that $1.2 billion stolen from DEXs eventually ends up on centralized exchanges. In comparison with previous years, scams in the sector are down 46%. The reason, according to Annison, is the ongoing bear market, which has inevitably made the sector less appealing for cybercriminals.\n\n“They’re less hyped up, the prices are lower, so it’s not as profitable for criminals. So at least next time we’re in a bear market, do bear in mind that the scams are at least down.”\n\nAnnison also touched on the increasing use of cryptocurrencies to evade sanctions and finance terrorist activities, highlighting TRON (TRX) and Tether (USDT) as popular assets for illicit use.\n\nThe advent of metaverse experiences has also seen the space attract nefarious actors. Various crimes are emerging in virtual worlds, including phishing attacks, nonfungible token theft, wallet tainting and augmented reality hacks.\n\nAnnison’s presentation highlighted the reality of criminal activity in the sector, which will demand increased security measures to protect users and combat illicit activities.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTIxL2NyeXB0by1oZWlzdC1jb3VwbGUtc2V0LWZvci11cy1wbGVhLWRlYWwtb3Zlci1iaXRjb2luLWxhdW5kZXJpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Crypto Heist Couple Set for US Plea Deal Over Bitcoin Laundering - Bloomberg",
        "content": "A social-media rapper, who dubbed herself the “Crocodile of Wall Street,” and her husband have reached a plea deal with prosecutors in a case that involved laundering billions of dollars of stolen Bitcoin, according to a court filing and a person familiar with the matter.\n\nHeather Morgan and Ilya Lichtenstein are scheduled to appear for a plea hearing on Aug. 3, more than a year after they were charged, according to a filing Friday in federal court in Washington. The couple were arrested in February 2022, but requested delays in their case to facilitate plea discussions, which could indicate they are cooperating with authorities."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItdHJhZGUtZmxhdC1iaXRjb2luLWV0ZnMtcmlwcGxlLWZhZGUv0gFLaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1ldGhlci10cmFkZS1mbGF0LWJpdGNvaW4tZXRmcy1yaXBwbGUtZmFkZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether trade flat as buzz around Bitcoin ETFs and Ripple court ruling fade - Forkast News",
        "content": "Bitcoin edged higher in Thursday morning trading in Asia, along with most other top 10 non-stablecoin cryptocurrencies, but the token has lost much of its support at the US$30,000 line. Investors said buying enthusiasm for Bitcoin has faded after recent gains sparked by exchange-traded fund (ETF) applications and Ripple’s favorable court ruling in the case brought by the Securities and Exchange Commission. Ether fell back.\n\nBitcoin flatlines\n\nBitcoin rose 0.44% to US$29,919.68 as of 6:30 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency fluctuated around the US$30,000 support price earlier in the morning, but is now down 1.45% in the past seven days.\n\n“Crypto has been relatively flat following a stream of good news,” Nick Ruck, the chief operating officer of Singapore-based blockchain infrastructure platform ContentFi Labs, said in emailed comments. “The Bitcoin ETF news has been priced in and the market is waiting to see the financial products in action.”\n\nThe world’s largest asset manager, BlackRock and several other U.S. financial institutions started filing applications for Spot Bitcoin ETFs from mid-June, helping move Bitcoin’s price north of US$31,500 at one stage last week.\n\nRuck added that the U.S. court ruling last week in favor of Ripple Labs and its XRP token also helped drive the price gains, but the case isn’t the end of the regulatory war since the SEC can appeal the case to a higher court.\n\n“This case also didn’t finalize whether XRP and other tokens are securities, but instead added more regulatory confusion on how and when a token can be considered a security in some cases but not others,” said Ruck.\n\nAdrian Wang, the chief executive officer of Hong Kong-based digital asset manager Metalpha, agreed the optimism around XRP and ETFs looked to have run out of steam. He added in emailed comments that XRP had only a partial victory as the district court said “institutional sales of the tokens violated federal securities laws.”\n\nNonetheless, Ripple was the biggest gainer among the top 10 non-stablecoin cryptocurrencies Thursday morning. The token jumped 8.02% to US$0.8275 and added to a weekly surge of 75.85%.\n\nOther gainers included Cardano, which added 5.81% to US$0.3224 and is up 12.04% for the week. Solana rose 4.67% to US$26.53 for a weekly gain of 20.62%.\n\nOn Wednesday, Solana Labs, the blockchain infrastructure developer behind the token of the same name, introduced a new developer tool named Solang that it said will make smart contracts on the blockchain more accessible.\n\nEther was the main loser in early Asia trading, with the second largest cryptocurrency by market capitalization slipping 0.37% to US$1,892.30. However, it is still up 1.17% in the last week and has gained 57% for the year to date.\n\nThe total crypto market capitalization edged up 0.01% in the past 24 hours to US$1.2 trillion, with trading volume dipped 3.50% to US$31.11 billion.\n\nNFTs trade thin, but expansion into art world continues\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index fell 0.25% in the past 24 hours to 2,710.26 as of 08:00 a.m. in Hong Kong. The index rose 0.47% in the last seven days.\n\nTotal NFT trading volume fell 16.91% to US$15.87 million in the past 24 hours, according to data from CryptoSlam. Forkast NFT market indexes measuring performance on the Ethereum, Polygon and Solana blockchains all dropped, while the Cardano index rose.\n\n“Sales are very slow across all blockchains, which allows for newer mints like Garbage Bags to enter the top 10 collection rankings with just over US$200,000 in sales,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nThe Ethereum blockchain-based Garbage Bags placed seventh on CryptoSlam’s NFT collection ranking by trading volume, rising 19.75% to US$281,775. The NFT collection was first minted on July 17, with a supply of 6,500 NFTs.\n\nThe @garbagefriends mint will take place today 📅 𝟭𝟬 𝗔𝗠 𝗘𝗦𝗧\n\n\n\nHere is quick review and what you need to know about it 🧵👇\n\n\n\n(1/20) pic.twitter.com/7tV5m2mHwk — Jereziz (@jerezizzz) July 17, 2023\n\nAzuki performed best in terms of sales volume on Thursday, surging 92.06% to US$826,007. ImmutableX’s trading card game NFT collection Gods Unchained placed second with US$679,479.\n\nTotal trading volume on Ethereum, the largest NFT network, dropped 22.08% to US$10.52 million, with 12,244 buyers.\n\n“Ethereum has managed to cross 10k unique buyers, a number it has only fallen below a few times this year,” commented Forkast Labs’ Petscher. However, there is now a sense that the 10,000 unique buyer threshold could soon be under threat.\n\n“With NFTs losing steam it’s likely we’ll see it fall below this threshold soon, especially as NFTs enter the slower time of the NFT market in the second half of the year,” Petscher added.\n\nTrading volume on the Bitcoin network also fell 8.14% to a thin trade of US$1.12 million. That figure is less than half the sales volume recorded on the network at the beginning of this month.\n\nDespite the general decline in market activity, NFTs continue to make an impact in the art world. New York’s Jackson Pollock Studio released an art collection on Wednesday that includes both NFTs and physical prints of the late painter’s abstract expressionist work.\n\nNamed “Beyond the Edge,” the 500 Ethereum-based NFT artworks were released in collaboration with digital art platform Iconic Moments.\n\nPublic mint is live for The Jackson Pollock Studio Collection.\n\n\n\nMint: https://t.co/tIrYx4wJOq pic.twitter.com/zUw65k8WES — Iconic (@Iconic_NFT) July 19, 2023\n\nElsewhere, at Wednesday’s Art+Tech Summit held in New York’s Christie’s modern art museum, a group of digital art experts gathered for a panel discussion titled “AI, Digital Assets and the Future of Museums and Galleries.”\n\nOne theme central to the discussion was the use of blockchain technologies including NFTs as a way of making art institutions more accessible to audiences.\n\nSpeaking during the panel, Miami Institute of Contemporary Art’s Anthony Troisi said that the decentralized nature of NFT art offers vast possibilities for institutions, and that they are now “just scratching the surface” in the exploration of the technology — a potentially positive omen for the future of the wider NFT market.\n\nU.S. equity futures fall as heavyweights post mixed Q2 earnings\n\nImage: Envato Elements\n\nDuring Wednesday’s regular trading session, the Dow Jones and S&P 500 gained while the Nasdaq index dipped. The three major U.S. stock futures indexes dropped as of 11:20 a.m. in Hong Kong on Thursday, with the tech-heavy Nasdaq declining the most at 0.50%.\n\nTesla shares dropped despite reporting record-high quarterly revenue in Wednesday’s Q2 earnings call, as lower operating margins outweighed concern for investors. Elsewhere, stocks in Netflix plunged as the streaming giant posted lower-than-expected revenue.\n\nGoldman Sachs also reported missed estimates in its earnings report. The report revealed a 60% drop in profits during the second quarter due to write-downs in consumer business and real estate. However, with shares rising 2%, the firm’s CEO David Solomon nonetheless anticipates an imminent recovery in the investment banking sector.\n\nReuters reports that Solomon told a group of analysts via a conference call that he had noticed an increasing sense of positivity over the past six to eight weeks. “The inflation data’s been better, the client sentiment is better, and now we’ll have to watch and see,” he said.\n\nGlobal information technology conglomerate IBM reported mixed results in the second quarter. While earnings exceeded expectations, revenue fell short.\n\nInvestors now await more earnings reports on Thursday from U.S. heavyweights including Johnson & Johnson, Philip Morris, Lenovo Group and American Airlines.\n\nThe main stock markets in Asia were mixed. China’s Shanghai Composite Index and Japan’s Nikkei 225 fell, while Hong Kong’s Hang Seng Index jumped back up from a two-day decline. South Korea’s Kospi index also edged upward.\n\nMeanwhile, the U.S. Federal Reserve is holding its next Federal Open Market Committee meeting on July 26. The CME FedWatch Tool predicts a 99.8% chance that the Fed will use the meeting to announce a further 25 basis points raise that will take the interest rate to the 5.25%-5.50% range.\n\n(Updates to add equity section)"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL255cG9zdC5jb20vMjAyMy8wNy8yMS9iaXRjb2luLWJvbm5pZS1jbHlkZS1pbHlhLWxpY2h0ZW5zdGVpbi1oZWF0aGVyLW1vcmdhbi10by1wbGVhZC1ndWlsdHktZm9yLWFsbGVnZWQtNC01Yi1jcnlwdG9jdXJyZW5jeS1sYXVuZGVyaW5nLXNjaGVtZS_SAZoBaHR0cHM6Ly9ueXBvc3QuY29tLzIwMjMvMDcvMjEvYml0Y29pbi1ib25uaWUtY2x5ZGUtaWx5YS1saWNodGVuc3RlaW4taGVhdGhlci1tb3JnYW4tdG8tcGxlYWQtZ3VpbHR5LWZvci1hbGxlZ2VkLTQtNWItY3J5cHRvY3VycmVuY3ktbGF1bmRlcmluZy1zY2hlbWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "'Bitcoin Bonnie & Clyde' to plead guilty for alleged $4.5B cryptocurrency laundering scheme - New York Post",
        "content": "Crypto heist couple Ilya Lichtenstein and Heather Morgan — who were charged with laundering $4.5 billion in hacked Bitcoin in 2016 — are reportedly preparing to plead guilty ahead of their next scheduled court appearance on Aug. 3.\n\nThe so-called “Bitcoin Bonnie & Clyde” have been newly charged in the case with a document known as an information, which lays out criminal charges and is similar to an indictment, but which doesn’t require a grand jury’s vote, a Washington, D.C., federal court document filed Friday showed.\n\nFederal prosecutors have been known to use the special documents when defendants agree to plead guilty.\n\nRussian-born Lichtenstein, 34, and his wife Morgan, 32, previously pleaded not guilty in a February 2022 case that charged them of money laundering and conspiracy to defraud in the United States.\n\nThe pair were arrested at their Manhattan apartment earlier that month for allegedly attempting to launder an astounding $4.5 billion in cryptocurrency that had been stolen from Hong Kong’s Bitfinex, one of the world’s largest virtual cryptocurrency exchanges, in 2016.\n\n3 A new court filing hints that Ilya Lichtenstein (right) and Heather Morgan (left), who were charged with laundering $4.5 billion in hacked bitcoin back in 2016, appear to be gearing up to plead guilty. Alexandria Adult Detention Center\n\nFederal authorities accused the couple of trying to launder 119,754 bitcoin. At the time of the theft, the crypto amounted to about $70 million.\n\nHowever, at the time of their arrest, the price inflated into the billions. Today, 119,754 bitcoin is worth nearly $3.6 billion.\n\nLichtenstein — a Russian emigre known as “Dutch” — was not granted bail, and has been in a Washington, D.C., jail since his arrest after being billed a flight risk.\n\nMorgan — better known as the questionably talented rapper “Razzlekhan” who shares songs about being “the crocodile of Wall Street” — is free on a $3 million bond pending the outcome of negotiations.\n\nThe nature of the charges stated in the document are confidential, though the court docket showed that District of Columbia Judge Colleen Kollar-Kotelly ordered the couple’s defense to provide plea paperwork by Friday.\n\nJudge Kollar-Kotelly said the defendants’ paperwork must include “charged offense(s) and statutory provision; charge(s) in plea and statutory provision; elements of the offense; copy of the plea agreement; penalties; and [federal sentencing] guideline calculations,” according to the docket.\n\n3 Russian-born Lichtenstein, 34, and his wife Morgan, 32, previously pleaded not guilty in a February 2022 case that charged them of money laundering and conspiracy to defraud in the United States. Instagram/heatherreyhan\n\nThe Post has reached out to Lichtenstein’s counsel at Cahill Gordon & Reindell, as well as Morgan’s legal team at Burnham & Gorokhov.\n\nIf found guilty, Lichtenstein and Morgan could face up to 25 years years behind bars. It’s unclear how a plea deal could affect their sentence.\n\nMorgan has been spending her 24-hour house arrest holed up in the rented Wall Street high-rise she once shared with her husband.\n\nThe downtime had Morgan looking for remote work. In September, she tweeted saying: “Looking for remote B2B growth /marketing /sales /copywriting /demand gen work. Can be contract or potentially full-time. Have 10 years experience, including remotely managing distributed teams.”\n\n3 Morgan — a rapper who goes by Razzlekhan — has been free on a $3 million bond while Russian emigre Lichtenstein has been jailed in Washington, D.C. since last February. YouTube\n\nShe also asked that only “serious opportunities with B2B (tech) companies” reach out.\n\nThe post came before a judge granted Morgan’s request to amend the terms of her home confinement.\n\nIn January, US Magistrate Judge Zia M. Faruqui ruled that she could work from her employer’s New York office three days per week, from 10 a.m. to 8:30 p.m.\n\nFaruqui also granted Morgan permission to use a computer and a smartphone — with monitoring software installed on both — in order to work from home, though she remained barred from carrying out any cryptocurrency transactions.\n\nMorgan’s tweet appeared to have worked, as her lawyer, Eugene Gorokhov, said in a court filing that she was “in the role of growth marketing and business development specialist.” Her employer’s identity was kept confidential for safety reasons.\n\nAside from the tweet on Morgan’s job hunt, she’s been quiet on all social media fronts, even halting her YouTube videos where she shared rap songs, ironically, about her being a hacking nerd.\n\nOn Instagram, the last post shared to Razzlekhan’s account was on Feb. 7, 2022, where Morgan recorded herself complaining that she feels like “a tortured dog going to the vet” when she goes to the nail salon."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtbGFzdC1iaXRjb2luLWJ0Yy1taW5l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "The last Bitcoin: What will happen once all BTC are mined? - Cointelegraph",
        "content": "Satoshi Nakamoto mined the genesis block on Jan. 3, 2009, minting the first 50 Bitcoin (BTC) in history and kicking off what would become a billion-dollar industry centered around mining crypto. However, with a cap on Bitcoin supply, the fate of miners after the last coins are issued is unclear.\n\nBitcoin is created through mining, a process involving computer hardware to solve complex mathematical problems and verify transactions on the blockchain network. For their efforts, miners are rewarded with a predetermined amount of BTC for each block of transactions.\n\nAccording to the Blockchain Council, more than 19 million BTC has been awarded to miners in block rewards, and according to Nakamoto’s white paper, only 21 million are available. Once this cap is reached, miners will no longer receive rewards for verifying transactions.\n\nSpeaking to Cointelegraph, Nick Hansen, founder and CEO of Bitcoin mining firm Luxor Mining, says that despite the loss of block rewards, miners will continue to play an essential role in verifying and recording transactions on the blockchain, but how they are compensated will evolve.\n\nCurrently, successfully validating a new block on the blockchain rewards miners with 6.25 BTC, worth about $188,381 at the time of writing, according to CoinGecko. Miners also receive transaction fees.\n\nAccording to calculations shared in a May 1 tweet from on-chain analytics firm Glassnode, since 2010, fees and block rewards have netted miners over $50 billion.\n\nSince #Bitcoin's inception, Miners have earnt a total revenue of $50.2B from the block subsidy and fees, for an all-time estimated input cost of $36.6B.\n\n\n\nThis places the all-time-aggregate profit margin for Miners at $13.6B (+37%). pic.twitter.com/TYvBSZbsRo — glassnode (@glassnode) May 2, 2023\n\nHansen believes transaction fees will eventually become the primary incentive for miners to continue long after the last BTC is mined.\n\n“That’s why as transaction fees become an increasingly important part of Bitcoin mining economics, understanding transaction fee dynamics and forecasting them into the future becomes even more critical,” he said, adding:\n\n“Thus, it’s important to see fees increase over time, something that Bitcoin Ordinals, as of late, has helped with, for example.”\n\nHowever, this shift is still likely years away, given that nobody currently mining will be alive when the last BTC block reward is received.\n\nIt will be a long wait to find out\n\nAccording to Hansen, based on the block discovery rate and the halving process, which occurs roughly every four years — or every 210,000 blocks of transactions — the last BTC will most likely be mined around 2140.\n\nA Bitcoin halving is a planned reduction in the rewards that miners receive, with the next one currently predicted to occur around April 2024. This will reduce the reward for each block to 3.125 BTC or roughly $94,190 at the time of writing.\n\nIn theory, by limiting the supply of BTC, each coin’s value should increase as demand increases and supply remains fixed.\n\nHansen says the price of BTC in 2140 will depend on unpredictable factors such as market demand, the regulatory environment, technological advancements and macroeconomic factors.\n\n“The fact that all Bitcoin is in circulation may create scarcity, but whether this scarcity will translate to price increases is subject to market dynamics,” he said.\n\n“As we look to a future where all Bitcoin has been mined, it’s important to remember that Bitcoin was designed with this endgame in mind.\n\n“The tapering off of block rewards and shift toward transaction fees are intrinsic to the protocol, and represent an ingenious solution to ensuring the ongoing security and viability of the network,” Hansen added.\n\nRelated: Rising BTC transaction fees are a good thing, Bitcoin educator shares\n\nJaran Mellerud, a research analyst from Hashrate Index, told Cointelegraph that as Bitcoin adoption and usage grows, transaction fees will drastically increase and become the primary source of revenue for mining firms.\n\nMellerud said that, by the time the last BTC is issued, the block subsidy will have already been so minuscule that it will not significantly impact the coin supply.\n\n“Due to the huge block space demand relative to the scarce block space supply, transaction fees will have to skyrocket in a future scenario of hyperbitcoinization,” he said, adding:\n\n“If you don’t believe there will be sufficiently high transaction fees in the future to justify the existence of mining, you don’t really believe in Bitcoin.”\n\nWhat about fiat\n\nBy the time the last Bitcoin is mined, Mellerud believes its value won’t be measured in United States dollars or other fiat currencies.\n\nHe speculates that by then, fiat money systems will have long since collapsed, and Bitcoin could be the successor, becoming the standard unit of account globally.\n\n“Under such circumstances, the only valid way to measure the purchasing power of Bitcoin is by looking at how much energy a Bitcoin or satoshi can purchase,” Mellerud said.\n\n“Just as we currently measure the purchasing power of the U.S. dollar in energy terms, barrels of oil,” he added.\n\nA collapse of fiat money systems has long been predicted, spurred on by the many problems facing the traditional financial system. As recently as March 2023, Silicon Valley Bank collapsed due to a liquidity crisis, with Signature Bank and Silvergate Bank following.\n\nRelated: The first-world debt crisis means you can expect more pain ahead\n\nBefore the March 2023 banking crisis, a February survey conducted by business intelligence firm Morning Consult and commissioned by crypto exchange Coinbase found most respondents were already disillusioned with the global financial system.\n\nA large portion of respondents are disillusioned with the global financial system and want change. Source: Morning Consult\n\nBitcoin might not be the same in 120 years\n\nSpeaking to Cointelegraph, Pat White, co-founder and CEO of digital asset platform Bitwave, believes miners will remain a critical part of the ecosystem, but not all will survive, with some shutting down in the face of mounting costs.\n\nAccording to a March 24 report from Glassnode, since 2010, miners have already been experiencing long periods of unprofitability, with only 47% of trading days being profitable.\n\nAccording to data from Glassnode, miners have already been experiencing long periods of unprofitability. Source: Glassnode\n\n“I think it’s conceivable we’ll see some miners shut down or other manipulation techniques used in an effort to drive up fees,” White said, adding:\n\n“But I also imagine that will happen well before the last Bitcoin is mined since the last few halvings will get the block rewards down to the satoshi level.”\n\nHowever, White also says “a lot can happen in 120 years,” and BTC could fundamentally change over the next century.\n\nWhite believes that by 2140, quantum computers will likely have broken the core encryption under Bitcoin, though he says engineers working on it have long known it’s not quantum-secure.\n\n“That shouldn’t necessarily scare people because of this quantum security issue. Between now and 2140, there will have to be a major reworking of Bitcoin from the encryption layer upward,” he said.\n\n“At that point, the Bitcoin developer community will be able to assess whether or not we’re actually on track to have a functioning transaction fee-based network or if additional Bitcoin mining is necessary to ensure the security of the network,” White added.\n\nWhite further speculates that while Satoshi Nakamoto’s white paper states that 21 million BTC is the supply cap and the single most concrete rule, none of us will likely be alive by 2140 to enforce that rule.\n\nHe believes crypto boils down to coding and consensus; if the community thinks the transaction fee incentive is insufficient to keep the network secure, future miners could theoretically extend the BTC hard cap beyond 21 million.\n\nRelated: $160K at next halving? Model counts down to new Bitcoin all-time high\n\nWhat effect this could have on the price isn’t clear, but either way, White thinks that the price of Bitcoin will stabilize at some global inflation-reflecting price point, and the major price movement will occur at some time in the next 120 years if one or more nations seriously pick it up as their reserve currency.\n\nIn that instance, he says it will “likely be independent of Bitcoin mining schedules,” and it would be the most solidifying moment to drive up the price of BTC.\n\nRelated: US law protects institutions and exposes retail investors — Rep. Torres\n\n“There are things we can’t even imagine that might impact Bitcoin — wars and energy crises obviously — but what if we’re a true multiplanetary species by then and we have to extend the block production time to support solar system-level communication speeds,” White said.\n\n“What I always find important is to focus on the hardest problems we’re seeing today and do what we can to solve them. That might mean solving for payments or digital ownership, or banking the unbanked — these are the problems to focus on now,” he added."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9wdGlvbnMtYnRjLXRyYWRlLTMway1mcmlkYXktZXhwaXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin options tantalizing bears to push BTC price below $30K before Friday's expiry - Cointelegraph",
        "content": "This week’s Bitcoin (BTC) options expiry on Friday, July 21, could solidify the $30,000 resistance level and give the bears the upper hand for the first time since the 21% rally between June 14 and June 21.\n\nBitcoin options expiries coincide with volatility\n\nA review of Bitcoin’s recent price action shows that three out of the last four BTC options expiries triggered significant price movements, making it crucial for traders to pay close attention to these events.\n\nBitcoin/USD price index, 4-hour. Source: TradingView\n\nNotably, Bitcoin’s price has consistently shown strong reactions following the weekly 8:00 am UTC options expiry. While causation cannot be established, the magnitude of these price swings warrants extreme caution leading up to the weekly expiry on July 21.\n\nBitcoin bears benefit from stricter regulations\n\nWhile this week’s options expiry could give bears control of Bitcoin’s price in the short term, bulls have the potential advantage of the United States Securities and Exchange Commission reviewing spot exchange-traded fund proposals.\n\nAlthough these proposals are still in the early stages of regulatory scrutiny, the slow progression could partially explain why the bears have managed to defend $31,000 multiple times since late June.\n\nHowever, their best chance of keeping Bitcoin’s price below $30,000 lies in the worsening regulatory environment. On July 19, the global securities exchange Nasdaq suspended the launch of its cryptocurrency custodian solution due to a lack of regulatory clarity in the United States. This change of plans was justified by Nasdaq’s CEO, Adena Friedman.\n\nRelated: Bipartisan bill to regulate DeFi, crypto security risks introduced into US Senate\n\nFurthermore, on July 14, cryptocurrency exchange Coinbase announced the suspension of its staking services for clients in California, New Jersey, South Carolina and Wisconsin. This decision followed a June 6 lawsuit from the SEC that accused the exchange of operating as an unregistered security broker since 2019.\n\nBitcoin bulls’ overoptimism leads to a disappointing outcome\n\nBitcoin’s price briefly surpassed $31,000 on July 13 and July 14, fueling bullish bets by traders using options contracts. However, a four-hour correction brought the price back down to $30,000.\n\nDeribit Bitcoin options aggregate open interest for July 21. Source: Deribit\n\nThe 0.39 put-to-call ratio reflects the difference in open interest between the $430 million call (buy) options and the $170 million put (sell) options. However, the outcome will be lower than the $600 million total open interest since the bulls were overconfident.\n\nFor example, if Bitcoin’s price trades at $30,500 at 8:00 am UTC on July 14, only $18 million worth of call options will be accounted for. This distinction arises from the fact that the right to purchase Bitcoin at $31,000 or $32,000 becomes invalid if BTC trades below those levels upon expiration.\n\nBelow are the three most likely scenarios based on the current price action. The number of options contracts available on July 21 for call (buy) and put (sell) instruments varies depending on the expiration price. The imbalance favoring each side constitutes the theoretical profit:\n\nBetween $28,000 and $30,000: 100 calls vs. 2,400 puts. The net result favors the put (sell) instruments by $70 million.\n\n100 calls vs. 2,400 puts. The net result favors the put (sell) instruments by $70 million. Between $30,000 and $31,000: 600 calls vs. 1,800 puts. The net result favors the put (sell) instruments by $35 million.\n\n600 calls vs. 1,800 puts. The net result favors the put (sell) instruments by $35 million. Between $31,000 and $32,000: 3,100 calls vs. 1,400 puts. The net result favors the call (buy) instruments by $55 million.\n\nConsidering the recent weak macroeconomic indicators, it’s likely that bears will continue suppressing Bitcoin’s price until Friday’s expiry. Moreover, China’s second-quarter gross domestic product grew by 6.3% year-on-year, falling short of the 7.3% market expectation. Meanwhile, U.S. retail sales in June increased by 0.2% from the previous month, below the 0.50% consensus.\n\nConsequently, the bulls find themselves in a challenging position, as their call (buy) instruments will be invalidated if Bitcoin’s expiry price falls below $30,000. Therefore, the bears’ $35 million favorable outcome may not be a significant win, but it does increase the chances of $30,000 becoming a new resistance area.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdS50b2RheS9iaXRjb2luLWZhaWxzLXRvLWdlbmVyYXRlLWJsb2NrLWZvci1vdmVyLWFuLWhvdXItaGVyZXMtd2hhdC1oYXBwZW5lZNIBWGh0dHBzOi8vdS50b2RheS9iaXRjb2luLWZhaWxzLXRvLWdlbmVyYXRlLWJsb2NrLWZvci1vdmVyLWFuLWhvdXItaGVyZXMtd2hhdC1oYXBwZW5lZD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Fails to Generate Block for Over an Hour, Here's What Happened - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nPeckShield Alert has reported an unusual occurrence on the Bitcoin network.\n\nAdvertisement\n\nA block of Bitcoin (BTC) took more than an hour to mine, keeping transactions in an unconfirmed state.\n\nAccording to a screenshot posted by PeckShield, the time difference between the two recent blocks mined by F2pool and Foundry USA was about 95 minutes, or 1 hour and 35 minutes. The block time for each cryptocurrency varies, with Bitcoin taking about 10 minutes.\n\nSimilar circumstances were reported in October of last year, when Bitcoin had a block production delay of about 85 minutes.\n\nBitcoin price action\n\nAt the time of publication, Bitcoin, which makes up approximately half of the $1.2 trillion cryptocurrency market, was changed little at $29,748. Since reaching a high for the year of $31,818 on July 13, it has fluctuated between $30,000 and $31,000.\n\nAs alternative cryptocurrencies resumed the surge that started last week after a court decision that was considered positive for the digital asset market, altcoins like Stellar (XLM) and Maker (MKR) are on the rise.\n\nThe on-chain analytics firm hints at ongoing consolidation for Bitcoin, saying that the 14-day Bitcoin Price Range remains extremely tight, residing at a current value of 6.38%.\n\nOn July 19, it was noted that with only 5.63% of trading hours recording a tighter 14-day trading range, the probability of a volatile move in either direction is enhanced.\n\nCrypto analyst Willy Woo says there are early signs that BTC consolidation is nearing completion.\n\nThis is because futures demand is currently moving the market. Notably, this demand has been climbing against sideways price action, which remains a bullish signal.\n\nWoo also noted that volatility dynamics might be signaling that a larger move is probable."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stYml0Y29pbi1ldGYtaW50ZXJ2aWV3LWNoYXJsZXMtZWR3YXJkc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "BlackRock ETF will be 'big rubber yes stamp' for Bitcoin — Charles Edwards - Cointelegraph",
        "content": "Bitcoin (BTC) stands to win big thanks to the BlackRock exchange-traded fund (ETF), investor and analyst Charles Edwards believes.\n\nIn his latest interview with Cointelegraph, Edwards, who is founder of quantitative Bitcoin and digital asset fund Capriole Investments, goes deep into the current state of BTC price action.\n\nWith his previous bullish statements continuing to stand the test of time, and after an eventful few months, Edwards does not see the need to alter the long-term perspective.\n\nBitcoin, he argues, may be less of a sure bet on shorter timeframes, but the overarching narrative of crypto becoming a recognized global asset class undoubtedly remains.\n\nCointelegraph (CT): When we last spoke in February, Bitcoin price was around $25,000. BTC is not only 20% higher today, but Bitcoin’s NVT ratio is also at its highest levels in a decade. Does this suggest more upside?\n\nCharles Edwards (CE): NVT is currently trading at a normal level. At 202, it is trading in the middle of the dynamic range band, well below the 2021 highs. Given its normalized reading today, it doesn't tell us much; just that Bitcoin is fairly valued according to this metric alone.\n\nBitcoin Dynamic Range NVT Signal, using Blockchain.com data. Source: Capriole Investments/TradingView\n\nCT: At the time, you described Bitcoin as being in a “new regime” but forecast up to 12 months’ upward grind to come. How has your thinking evolved since?\n\nCE: That thinking mostly remains today. Bitcoin has steadily grinded up about 30% since February. The difference today is that the relative value opportunity is slightly less as a result, and we are now trading into major price resistance at $32,000, which represents the bottom of the 2021 bull market range and confluence with major weekly and monthly order blocks.\n\nMy outlook today over the short term is mixed, with a bias towards cash until one of three things occurs:\n\nPrice clears $32,000 on daily/weekly timeframes, or Price mean-reverts to the mid-$20,000s, or On-chain fundamentals return to a regime of growth.\n\nCT: At $30,000, miners have begun to send BTC to exchanges en masse at levels rarely seen. Poolin, in particular, has moved a record amount in recent weeks. To what extent will miners’ purported selling impact price moving forward?\n\nCE: It’s true that relative Bitcoin miner sell pressure has stepped up. We can see that in the two below on-chain metrics; Miner Sell Pressure and Hash Ribbons. Bitcoin’s hash rate is up 50% since January — that’s over 100% annualized growth rate.\n\nThis rapid rate of growth is not sustainable long term. Hence we can expect any slowdown will trigger the typical Hash Ribbon capitulation. This rapid growth in hash rate also can only mean one thing; an extraordinary amount of new mining rigs have joined the network.\n\nIt’s 50% harder to mine Bitcoin, there's 50% more competition and as a result 33% less relative BTC revenue for miners.\n\nThrough 2022 there were delays and backlogs in global mining hardware shipping for many months; we likely have seen that backlog flush out in the first half of the year with the large hash rate uptick. New mining hardware is costly, so it makes sense that miners would want to sell a bit more at relatively higher prices today to help cover operational costs and take advantage of the 100% price rally we have seen in the last 7 months.\n\nMiners are large Bitcoin stakeholders so if they are selling at a rapid rate it can impact prices. Though given their relative share of the network is diminishing, that risk factor is not what it once was.\n\nTwo on-chain metrics showing miner stress/selling. Source: Capriole Investments/TradingView\n\nCT: When it comes to U.S. macro policy, how do you see the Fed approaching inflation for the second half of the year? Are further hikes coming past July?\n\nCE: The market is pricing in a 91% chance of rate hikes through the rest of this year. There’s a 99.8% chance that the Fed will raise rates at next week's meeting, according to the CME Group FedWatch Tool. So it's probable we see one or two more rate hikes in 2023. That seems quite excessive given inflation (CPI) has consistently been trending down since April 2022, and is now well below the Fed funds rate of 5%.\n\nOf course things could change quite a bit over the next months, but if we take two more rate hikes as the base case, my expectation that any net change in the Fed’s plan would be toward a pause. We’ve already seen the considerable stress building in the banking system, with multiple bank collapses just a couple of months ago. 2023 was the biggest banking failure of all time in dollar value; more than 2008, so things could change considerably over the next six months.\n\nRegardless, the Fed has implemented the vast majority of its rate hike plan. 90% of the tightening is complete. It's now a game of wait and see — will inflation continue to decline as anticipated? And will that occur before or after the economy takes a turn?\n\nFed target rate probabilities chart. Source: CME Group\n\nCT: Bitcoin’s correlation with risk assets and inverse correlation with U.S. dollar strength has been declining of late. What’s the reason for this? Is this part of a longer-term trend?\n\nCE: Bitcoin has historically spent most of its life “uncorrelated” with risk markets, oscillating from periods of positive to negative correlation. Correlation comes in waves. The last cycle happened to see a very strong correlation with risk assets. This began with the Corona crash on March 12, 2020. When fear peaks, all markets go risk-off (into cash) in unison, and we saw a huge spike in correlations across asset classes as a result.\n\nFollowing that crash, a wall of money entered risk markets from the biggest QE of all time. In that regard, the following year was “all one trade” — up and to the right for risk. Then in 2022 we saw the unwinding of all risk assets as bonds repriced following the most aggressive Fed rate hike regime in history.\n\nSo it’s been unusual times. But there is no intrinsic need for Bitcoin to have a high correlation to risk assets. It is likely with time that as Bitcoin becomes a multi-trillion-dollar asset, it will be more interconnected with major asset classes and so expect to see a more consistent positive correlation with gold over the next decade, which has a highly negative correlation with the dollar.\n\nBitcoin’s correlation to the S&P 500 and Gold. Source: Capriole Investments/TradingView\n\nCT: How do you think U.S. regulatory pressure will impact Bitcoin and crypto markets going forward? Do you think Binance and Coinbase were the tip of the iceberg?\n\nCE: Impossible to say for sure, but I believe the regulatory fears of early 2023 have been well overblown. Bitcoin was long ago classified as a commodity, and from a regulatory perspective is in the clear. There’s definitely question marks on various altcoins, but the legal outcome of XRP being deemed not a security was definitely an interesting turn of events this month.\n\nFinally, it's pretty clear that industry and government — where it matters — is in support of this asset class and knows it's here to stay.\n\nBlackRock ETFs have a 99.8% success rate and its announcement to launch a Bitcoin ETF was essentially a regulatory and financial industry green light.\n\nWe’ve seen half a dozen other leading-tier financial institutions follow suit and, of course, now presidential candidate Kennedy is talking about backing the dollar with Bitcoin. This asset class is here to stay. There will be bumps and hiccups along the way, but the direction is clear to me.\n\nCT: How do you foresee progress of the BlackRock spot ETF and its effect on Bitcoin should it launch?\n\nCE: The BlackRock ETF approval will be huge for the industry.\n\nRelated: Bitcoin traders say ‘get ready’ as BTC price preps 2023 bull market\n\nBlackRock is the biggest asset manager in the world, and its (and regulatory) seal of approval will allow a new wave of capital to flow into the market. Many institutions sat on the sidelines last year due to concerns and uncertainty regarding crypto regulation. ETF approval will be a big rubber “yes” stamp for Bitcoin.\n\nETFs also arguably make it easier for institutions to put Bitcoin on their balance sheet, as they don't need to worry about custody or even entering the crypto space. So it opens a lot of doors. The best comparable we have for this event is the gold ETF launch in 2004. Interestingly it launched when gold was down 50% (much like Bitcoin is today). What followed was a massive +350% return, seven-year bull run.\n\nEssentially the Bitcoin ETF is just another goalpost on the pathway to broad regulatory acceptance and establishment of Bitcoin as a serious asset class. And it has big implications.\n\nCFDs on Gold annotated chart. Source: Charles Edwards/TradingView\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNy8yMC9rdXdhaXQtcmVndWxhdG9yLWJhbnMtY3J5cHRvLXBheW1lbnRzLWludmVzdG1lbnQtYW5kLW1pbmluZy_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDcvMjAva3V3YWl0LXJlZ3VsYXRvci1iYW5zLWNyeXB0by1wYXltZW50cy1pbnZlc3RtZW50LWFuZC1taW5pbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Kuwait Cracks Down on Crypto, Banning Payments, Investment and Mining - CoinDesk",
        "content": "The regulator warned citizens of the risks involving volatile, encrypted currencies that do not have legal status. Any violations of the prohibitions would result in penalties, the notice said."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDcvMjAvd29ybGQvY2FuYWRhL2NyeXB0by1raW5nLWFpZGVuLXBsZXRlcnNraS1raWRuYXBwaW5nLWFycmVzdC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Investor Charged With Kidnapping 'Crypto King' - The New York Times",
        "content": "Late one night in early December, Aiden Pleterski, a self-proclaimed “Crypto King,” was kidnapped, then beaten and tortured over three days, according to court records.\n\nEventually, his kidnappers — including one of his investors — let him go, but they left him with a threat: Pay up fast and don’t go to the police, court records said.\n\nThis week, Akil Heywood, 39, who had invested with Mr. Pleterski, 24, was charged with kidnapping him. The Toronto Police Service said in a statement on Monday that it had arrested and charged four men on counts of kidnapping for ransom and other charges: Mr. Heywood, Tyler Fast, 37, and Deren Akyeam-Pong, 24, all of Toronto, as well as Rakeem Henry, 24, of London.\n\nMr. Heywood was among dozens who invested with Mr. Pleterski, who was supposed to invest their money in cryptocurrency and foreign exchange positions, according to court documents. But after spending money feeding a lavish lifestyle, buying three Lamborghinis and three McLarens, Mr. Pleterski filed for bankruptcy in August, leaving investors wondering what had happened to their money."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVycy1idWxsaXNoLWRlc3BpdGUtYmVhci1tYXJrZXQtaHV0OC1mb3VuZHJ5LWJyYWlpbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin miners still bullish despite toughest bear market yet — Hut8, Foundry, Braiins - Cointelegraph",
        "content": "Bitcoin (BTC) miners have been up against the ropes over the past year, with record amounts of BTC sent to centralized exchanges to cover costs in 2023.\n\nAs Cointelegraph previously reported, the Bitcoin mining ecosystem has had an eventful year. The industry scored a staggering $184 million from transaction fees in the second quarter of 2023, eclipsing the total of 2022 on the back of a BTC price rebound and hype around BRC-20 tokens.\n\nStocks in prominent mining firms have also seen impressive gains in 2023, far exceeding Bitcoin’s market value performance. The top nine public Bitcoin mining firms saw their market capitalization increase by 257% from the start of 2023.\n\nMeanwhile miners have also been forced to continue selling mined BTC to cover operational costs as the industry continues to attempt to claw its way out of a prolonged bear market. Miners sent a record $128 million worth of Bitcoin to exchange in June 2023, with industry experts highlighting miners' propensity to send BTC to exchange to cash out, cover costs and lock in profits.\n\nRelated: How Irish farmers turn cow dung into digital gold (Bitcoin)\n\nA market report from Bitfinex suggests that mining firms are looking to derisk by offloading BTC to exchanges. Analysts believe miners are engaging in hedging activities in the derivatives market, carrying out over-the-counter orders or transferring funds through exchanges for other reasons.\n\nCointelegraph reached out to a number of prominent mining companies to unpack the current mining climate and the recent trends emerging from the sector.\n\nJaime Leverton, CEO of Hut8, highlighted the company’s efforts to close-off a merger with USBTC which has hampered its ability to raise capital through an at-the-market offering. After announcing the upcoming merger, Leverton said Hut8 treasury strategy included the option selling from its Bitcoin holdings and newly produced BTC to cover its operating costs:\n\n“We plan to revisit our treasury strategy once our merger is complete. As such, we were the last major Bitcoin miner to sell part of our production earlier this year.\n\nLeverton added that Hut8 still holds more that 9,100 BTC ($271 million) and the firm remains “bullish on Bitcoin and HODLing”, given that it retains one of the largest self-mined Bitcoin reserves from a publicly traded company.\n\nHut8 disclosed that it had sold 217 Bitcoin mined across May and June for $7.9 million in its most recently published production and operation update.\n\nRelated: A Glimpse Into The Future - What Happens When There Are No More Bitcoin To Mine?\n\nFoundry’s business development senior manager Charles Chong also weighed in on the subject, while the firm declined to comment on whether it had held any BTC holdings in 2023.\n\nAs Chong explained, bull market conditions in the past saw miners earning a 60-80% margin on production, while external capital was abundant, allowing many operators to hold onto their mined BTC.\n\n“However, we are in a different time now with scarce external capital and only a 15-30% margin, forcing miners to liquidate their bitcoin to cover operational costs.”\n\nChong also added that it was difficult to compare current market conditions to subsequent bear markets following market peaks in 2017 and 2021. He said that Bitcoin mining moved in cycles as miners “overinvest” in ASIC mining equipment during good times.\n\nIt’s worth noting that the Bitcoin mining difficulty has also hit recent all time highs, which suggests that the network is at its most robust. Chong explained that new, more efficient mining capable of higher hashrates have continuously been released into the market in 2023, which has forced miners to refresh their fleet to continue producing BTC at a profit.\n\n“That said, total energy usage by the network has been slowly creeping up as well, albeit at a slower pace, indicating increasing investment in security for the network.”\n\nA spokesperson from Braiins mining told Cointelegraph that continuing difficulty increases are a result of hashrate increasing, which signals that industry participants see potential upside for BTC's price in the future:\n\n\"To us, this is a sign that miners are still able to deploy machines profitably in the current environment and are bullish on Bitcoin's future price appreciation.\"\n\nOngoing market conditions have also seen the closure of some prominent mining firms, including Core Scientific which filed its chapter 11 bankruptcy plan in June 2023. The firm has already managed to raise significant capital to bootstrap a reorganization plan earmarked for September 2023 .\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJvbGxpbmdlci1iYW5kcy1lY2hvLWphbnVhcnktZ2FpbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Bollinger Bands echo move that ended in 40% January gains - Cointelegraph",
        "content": "Bitcoin (BTC) is lining up a burst of volatility that could rival its 40% January gains, on-chain data suggests.\n\nIn the latest edition of its weekly newsletter, The Week On-Chain, analytics firm Glassnode revealed the tightest Bollinger Bands since the start of 2023.\n\nBTC price due “strong moves” — but direction unknown\n\nBTC price has acted in a tight range for an entire month, using $30,000 as a focal point for sideways behavior.\n\nThis, popular analyst Aksel Kibar says, is putting both bulls and bears to the test.\n\n“Seems like $BTCUSD is exhausting many trader’s patience,” he summarized on July 21.\n\n“That is usually the condition you see before strong moves. Not sure about the direction though. I will stick with my well-defined boundaries. I know that increased volatility is around the corner. Capture the directional move.”\n\nBTC/USD annotated chart. Source: Aksel Kibar/Twitter\n\nAccording to Bollinger Bands behavior, that move should come sooner rather than later.\n\nThe classic volatility indicator is currently printing a telltale sign that the days of rangebound BTC price action are numbered.\n\nBollinger Bands use standard deviation around a simple moving average to determine when an asset’s price is due a shift in trend.\n\nOn BTC/USD, its upper and lower band are unusually close together at present — more compact, in fact, than at any time since Bitcoin began its 2023 upside.\n\n“The digital asset market continues to see remarkably little volatility, with the classic 20-day Bollinger Bands experiencing an extreme squeeze,” The Week On-Chain commented.\n\nIt added that with a range of just 4.2%, this marked the “quietest BTC market since the lull in early January.”\n\nAt the time, Bitcoin saw a breakout which then continued throughout the month, bringing January gains to around 40%.\n\nBitcoin Bollinger Bands range chart (screenshot). Source: Glassnode\n\nBitcoin hodlers channel early 2019\n\nContinuing, Glassnode noted that at current levels, there was little by way of active selling — either for profit or loss.\n\nRelated: Bitcoin rejects at 21-day trendline — How low can BTC price go?\n\nThis lack of “realized” activity comes despite the BTC price gains since January and is a historically common phenomenon in periods after price cycle lows.\n\n“This compression in volatility is matched by cyclical lows in realized profit and loss being locked in by the market,” it wrote.\n\nThe sum of profits plus losses currently equals around $290 million per day.\n\n“Whilst this is a significant sum on a nominal basis, it is again comparable to the 2019 peak, and to October 2020 where BTC prices were 50% lower than they currently are,” Glassnode explained.\n\n“As such, it suggests that even though the Bitcoin market cap is ~2x larger today, investors who are holding large profits or losses are extremely unwilling to spend their coins on-chain.”\n\nBitcoin short/long-term total realized value chart (screenshot). Source: Glassnode\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXNsYS1iaXRjb2luLWhvbGRpbmdzLW5vLWNoYW5nZS1pbi1zZWNvbmQtcXVhcnRlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Tesla's diamond hands: EV maker's Bitcoin holdings see no change in Q2 - Cointelegraph",
        "content": "For the fourth quarter in a row, Tesla hasn’t sold or added to its digital asset holdings, with the electric vehicle manufacturer continuing to hold $184 million worth of its remaining Bitcoin (BTC).\n\nIn Q2 2023 earnings released on July 19, the net value of Tesla’s Bitcoin holdings stood at $184 million, which has held at the same value for the past two quarters.\n\nTesla hasn’t bought or sold any Bitcoin since Q2 last year when it sold more than 30,000 Bitcoin — which accounted for roughly 75% of its total holdings — for $936 million.\n\nTesla’s Bitcoin holdings totaled $184 million at the end of Q2. Source: Tesla\n\nTesla first purchased $1.5 billion worth of Bitcoin in March 2021, with CEO Elon Musk promising to accept Bitcoin as payment for Tesla vehicles in the following days.\n\nMusk later halted Bitcoin payments for Tesla vehicles, however, and cited environmental concerns brought about by Bitcoin’s high energy usage as the reason for the backtrack.\n\nTesla has been outperforming analyst expectations this year, with the company reporting adjusted earnings per share of $0.91, beating analyst predictions by $0.09. Revenue also outperformed on the upside, with Tesla’s $24.9 billion in Q2 revenue beating expectations by 0.81%.\n\nRelated: Elon Musk kickstarts new AI company to ‘understand the universe’\n\nDespite beating expectations, the market seemingly failed to register much in the way of a positive response. Tesla’s stock price dropped 4.19% to $279.07 in after-hours trading, according to data from Google Finance.\n\nTesla stock price dropped 4.19% in after-hours trading. Source: Google Finance\n\nBitcoin is down nearly 5% for the week and is currently changing hands for $29,914, according to Cointelegraph data.\n\nSome traders expect Bitcoin to revisit a price of roughly $27,500 in the coming days after failing to hold strong above the $30,000 resistance mark.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Tokenizing music royalties as NFTs could help the next Taylor Swift"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2MyMjgxYWE4LTU2YjItNGVmZS1iZDZkLTFiYWZjNjdiZTNjZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "A carpet and flooring company really wants us to write about bitcoin - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nSure, OK, why not:\n\nWorthing, 20th July 2023 – Flooring Hut, a forward-thinking online carpet and flooring retailer, announces its decision to include Bitcoin holdings on its balance sheet, embracing the integration of digital assets into its financial reporting. With this strategic move, Flooring Hut demonstrates its commitment to staying at the forefront of technological advancements and adapting to the evolving financial landscape.\n\nFormed in 2015, Flooring Hut stocks a wide range of carpet, laminate and vinyl flooring solutions, and is obviously engineering the kind of publicity stunt that’s catnip for snarky blogs such as ours.\n\nBy diversifying its asset holdings to include Bitcoin, Flooring Hut embraces innovation and positions itself at the forefront of the digital economy.\n\nAccording to Companies House filings, the privately-owned company has four shareholders and two employees.\n\nFlooring Hut recognises the growing interest and demand from stakeholders, including investors, partners, and customers, who value transparency and progressive approaches to financial reporting. Including Bitcoin holdings on the balance sheet ensures that the company remains responsive to the expectations of its diverse stakeholders.\n\nIts 2023 accounts showed a loss of £173,423 and cash reserves of £75,105, which at spot pricing is enough to buy 3.2 bitcoins.\n\nDavid Greaves, CFO at Flooring Hut says: “Our decision to include Bitcoin on our balance sheet exemplifies our commitment to embracing digital transformation and being at the forefront of technological innovation. We recognise the potential of cryptocurrencies and their impact on the future of finance. By including Bitcoin holdings, we not only diversify our assets but also demonstrate our dedication to transparency and meeting the evolving expectations of our stakeholders.”\n\nNews of Flooring Hut’s endorsement of bitcoin follows an announcement on Tuesday that it would be “honouring the legacy of Nelson Mandela” through initiatives that combine “the principles of social responsibility with their expertise in flooring solutions.” On Monday it press-released the donation of a wall clock to K2 Leisure Centre in Crawley, West Sussex. Last week it highlighted the role that innovative flooring solutions play in Bastille Day celebrations. You get the idea.\n\nJournoLink charges companies £80 per press release or a £119-a-month unlimited subscription to send us this stuff. Flooring Hut has presumably been making the most of the latter option.\n\nBitcoin was up 1.3 per cent to $30,401.81 at press time, probably on unrelated factors.\n\nFurther reading:\n\n— The Pulitzer Prizes in Journalism - how to enter"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvcGVvcGxlLWN1bHR1cmUvdG9wLWNlbnRyYWwtYmFua2VyLWluLWNoaW5hLWNvbXBhcmVkLWJpdGNvaW4tdG8tYS1jb3Jwc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "China's expected next central bank chief once likened Bitcoin to 'a corpse' floating down a river - DLNews",
        "content": "Pan Gongsheng, tipped to be the next governor of the People’s Bank of China, is poised to continue taking a hard line on cryptocurrency trading and mining.\n\nChina has pushed major blockchain projects to support CBDCs and distributed ledger infrastructure.\n\nWestern-educated economist may take critical position as China struggles to revive its economy.\n\nWhen it comes to crypto, some hope China is on the rebound.\n\nHong Kong is reviving as a startup scene, state-run companies are pushing hard to get consumers to use digital yuan, and Beijing is backing an ambitious programme to build blockchain infrastructure for global businesses.\n\nBut there may be one major obstacle ahead — Pan Gongsheng, the deputy governor of the People’s Bank of China (PBOC). The Harvard and Cambridge-educated economist is tipped to be the next governor of the central bank.\n\nAnd he is not a big fan of Bitcoin and its ilk.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nCommunist party secretary\n\nNow speculation is mounting in both Chinese and foreign press that Pan is set to replace Yi Gang as the governor of the PBOC, which is one of the most influential positions in global banking.\n\nOn July 1, he was promoted to the communist party secretary at the central bank. And on July 8, Janet Yellen, the US Secretary of the Treasury, appeared to anticipate another promotion when a readout of her meeting with Pan called him the “head” of the PBOC during her diplomatic visit to Beijing.\n\nFreudian slip? US Treasury Secretary Janet Yellen referred to Pan Gongsheng as the 'head' of the People's Bank of China (Andrés Núñez, Rita Fortunato)\n\nRumours of his appointment have dashed hopes of a reversal on crypto policy in China. He’s been referred to as “anti-Bitcoin” and “Bitcoin’s worst nightmare” in the English-language crypto press.\n\nThe characterisations are based on a series of comments he made in the months after the 2017 ICO craze. He referred to Bitcoin as a speculative bubble and likened it to the tulip mania in 17th century Holland – and doesn’t think it will last.\n\nJoin the community to get our latest stories and updates\n\nQuoting Keynes\n\n“The market can remain irrational longer than you can remain solvent,” Pan reportedly said at a forum that year, invoking a famed comment from British economist John Maynard Keynes. “Sit by the river, watch, and one day the corpse of Bitcoin will float past you,” Pan added, paraphrasing French economist Éric Pichet.\n\nAt the same time, he added he was a “little scared” at the thought of unrestricted digital assets in China.\n\nBut his views reflect the general consensus in Beijing about cryptocurrency: it’s volatile, destined to collapse, and has no place in the Chinese financial system.\n\nNOW READ: Multichain workers in China fear for safety after CEO’s arrest, says Fantom boss\n\nPan has been a steady presence in the commercial banking sector in China for the last 20 years. He earned a Ph.D in economics at the Renmin University of China and then did postdoctoral research at the University of Cambridge in the UK and was a senior research fellow at Harvard University in the US.\n\nPrior to joining the PBOC in December 2012, he held several roles at the Industrial and Commerce Bank of China and served as executive director at the Agricultural Bank of China. Since April 2016, he’s been deputy governor of the central bank and held other senior positions.\n\n‘Sit by the river, watch, and one day the corpse of Bitcoin will float past you.’ — Pan Gongsheng, paraphrasing Éric Pichet\n\nBut whether his views on crypto have changed since he last spoke about it publicly isn’t known. “He is a bit of an elusive new character. But he’s also not that public of a figure,” Kai von Carnap, an analyst at the Mercator Institute for China Studies, tells DL News.\n\nNaturally, crypto is not high on the list of priorities for China’s next central bank governor.\n\nThe Chinese economic situation, several months on from the relaxation of Covid restrictions, is only just starting to find its feet again. The IMF predicts the economy will expand 5.2% this year following the lifting of pandemic restrictions. But its growth is expected to slow after the reopening boost.\n\nNOW READ: Why China’s rocky CBDC rollout is a ‘severe’ warning sign to Europe and America\n\n“The contraction in real estate remains a major headwind, and there is still some uncertainty around the evolution of the virus. Longer-term, headwinds to growth include a shrinking population and slowing productivity growth,” wrote IMF economist Diego A. Cerdeiro and Sonali Jain-Chandra, another senior official at the fund, earlier this year.\n\nChina also wants to instil confidence in foreign investors and businesses who are wary of committing more capital to the nation amid tense relations with the US and the West.\n\n‘He has the kind of background where he can talk to international people, to the Fed, to the ECB. I think that probably gave him the edge over potential competitors.’ — Kai von Carnap\n\n“You need to have this kind of character who can mediate some of the messaging,” von Carnap said. “He has the kind of background where he can talk to international people, to the Fed, to the ECB. I think that probably gave him the edge over potential competitors.”\n\nAs head of the PBOC, the digital yuan will also come under his portfolio. Von Carnap points to his expertise as useful for its internationalisation, though he cautions that it is still a mostly domestic project.\n\nBut is he in charge?\n\nThere has been no official statement yet as to his accession. This week, Yi declined to comment about his possible retirement during a lecture on the digital yuan organised by the Monetary Authority of Singapore.\n\n“My title is right here on the screen,” he said, although according to Channel News Asia a powerpoint at the event called him the “President of the China Society for Finance and Banking” as opposed to governor of the PBOC.\n\nHong Kong’s crypto push\n\nThat said, Yi, 65, was appointed to a second five-year term as governor by the National People’s Congress in March. It’s not clear whether that was for the purpose of helping to usher in a new leader. Yi has reached the retirement age for ministerial officials (Pan himself turns 60 this month).\n\nAs for crypto, Chinese entrepreneurs are hopeful that Hong Kong’s push to rekindle startup activity would spur the same story on the mainland. Tron founder and Huobi advisor Justin Sun, gushed about Hong Kong’s new crypto policies to Bloomberg TV late last year.\n\n“Right now they are using Hong Kong as an experiment base so they can see all the feedback, all the results, once they adopt crypto,” he said.\n\nNOW READ: China wants 1.4bn citizens to use digital yuan for shopping and bus fares, but consumers still love Alipay\n\nA burgeoning start-up scene in Hong Kong won’t persuade officials in China to abandon their view that cryptocurrencies are little more than a speculative bubble, even if Pan doesn’t take the job.\n\n“I don’t see how Hong Kong regulation would reflect or imply a change in Chinese crypto regulations by any stretch of the imagination,” says von Carnap.\n\nCallan Quinn, based in Hong Kong, covers Asia for DL News. Have a tip on crypto in China? Contact the author at callan@dlnews.com."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy94cnAtZHdhcmYtYml0Y29pbi1wb3N0LXNlYy1kZWNpc2lvbi1iZW5lZml0cy1yaXBwbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "XRP Dwarfs Bitcoin as Post-SEC Result Continues to Benefit Ripple - CCN.com",
        "content": "Key Takeaways\n\nXRP dominates in volume terms since SEC’s decision about it not being security\n\nXRP has outperformed BTC, accounting for 21% of all crypto transaction volume, to BTC’s 20%\n\nStill, the volume of transactions is declining, so it could mean the end of the rally\n\nSince the court determined that XRP is not a security, it has dominated in terms of volume, recently outpacing Bitcoin in terms of market cap volume.\n\nXRP Eclipsing Bitcoin\n\nA recent Twitter conversation brought up XRP’s increased trading volume by Dirk Schepens, the founder of xSPECTAR, an XRPL-based NFT project. He claimed that XRP had eclipsed Bitcoin (BTC) as the cryptocurrency with the largest trading activity following the court decision.\n\nWithin a 24-hour period after Judge Analisa Torres’ ruling, XRP’s trading volume had surpassed $10 billion.\n\nAnd while some questioned the accuracy of Schepens’ information, Ripple’s Chief Technology Officer David Schwartz answered provocatively.\n\nXRP's trading volume as a percentage of market cap is four times higher than BTC's. I'm not sure if that's good, bad, interesting, or meaningless. — David \"JoelKatz\" Schwartz (@JoelKatz) July 19, 2023\n\nSchwartz noted that there are many possible interpretations because XRP’s trading volume as a percentage of its market cap is four times higher than BTC’s.\n\nCalculating the Claims\n\nWith a trading volume of $2,248,762,398 and a market value of $$40,688,646,47, according to CoinMarketCap data analysis, it is clear that XRP has displayed exceptional trading activity during the last 24 hours.\n\nBTC, on the other hand, had a trading volume of $$13,569,814,934 and a large market cap of $579,361,777,905.\n\nIt has to be taken into account the trading volume as a proportion of the market capitalization for both XRP and BTC and compare the findings in order to verify Schwartz’s claim.\n\nA closer examination of the data reveals that the trading volume of XRP as a percentage of its market capitalization is roughly 9%. BTC’s percentage, which is 2%, is considerably lower in contrast.\n\nThese numbers support Schwartz’s earlier assertion and highlight XRP’s larger percentage of actively traded tokens in comparison to its market valuation.\n\nCumulative Spot Volume for XRP\n\nAdditionally, Kaiko , a trustworthy source of market information, provided insights on XRP’s gaining significance in the cryptocurrency industry.\n\nThe report claims that after the key court decision, XRP has outperformed BTC, accounting for 21% of all crypto transaction volume to BTC’s 20%. Ethereum (ETH) recorded a meager 8% share in contrast.\n\nThe trading activity on the sports market since July 13 is considered in this report from Kaiko and Schepens’ declaration.\n\nThis does not consider the 24-hour volume of trades across all marketplaces, since BTC continues to outperform XRP. Kaiko pointed out that data from 25 exchanges were used in the evaluation.\n\nAdditionally, data from the market data source CryptoCompare demonstrates that XRP and BTC are closely matched regarding trade volume. Notably, the volume for BTC is $1.95 billion, while the volume for XRP is $1.57 billion. Commentators contend that because CryptoCompare only examines spot volume, XRP might have previously surpassed BTC on this criteria.\n\nSimilar to how XRP dominated South Korean markets, earning at least $2.5 billion after a US court determined that the digital asset is not a security.\n\nThe XRP Rally May Be Coming to an End\n\nHowever, given that the token’s trading volume is beginning to decline, XRP rally may be nearing its end.\n\nThe ongoing decline in trading volume might perhaps result in a price reversal for XRP, which is now trading close to its local top. Following a landmark legal victory over the US Securities and Exchange Commission (SEC), XRP’s trading volume has been an important factor to monitor during its spectacular price surge.\n\nThe current drop may indicate a change in market sentiment, given that the token’s price ascent was mostly driven by an increase in trade volume.\n\nThe drop in volume shows that fewer XRP-related transactions are taking place. This frequently suggests that traders may begin to take profits or reduce their purchase activities during a price rally, possibly in anticipation of a market shift.\n\nThis signals that we might be approaching a turning point in the recent price trajectory of the token, together with the fact that XRP is trading close to its local top.\n\nA price reversal can occur if this volume decline keeps up. A rally’s large volume frequently reflects fervent investor interest and confidence in the prospects of the asset. However, if volume falls, it can be a sign that interest is dwindling and a sell-off is about to occur."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91ay1jb3VydHMtZ3JhbnRzLWFwcGVhbC1jcmFpZy13cmlnaHQtYml0Y29pbi1yaWdodHMtbGF3c3VpdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "UK court grants appeal from Craig Wright in Bitcoin rights lawsuit - Cointelegraph",
        "content": "A British court granted an appeal on July 20 that gave Craig Wright the right to argue in litigation that the Bitcoin file format is well-defined enough to qualify for copyright protection.\n\nWright, who since 2016 has claimed to be the inventor of Bitcoin (BTC), launched a lawsuit against 13 Bitcoin Core developers and a group of companies, including Blockstream, Coinbase and Block, alleging violation of his copyright to the Bitcoin white paper, its file format and database rights to the Bitcoin blockchain.\n\nThe decision reversed a ruling from February that considered Wright’s arguments insufficient to show how the Bitcoin file format was first recorded, a concept known as fixation in copyright law.\n\n“The Claimants may consider themselves unlucky to have had their application for leave to serve out come before a Judge with at least some understanding of the technology involved here,\" reads the decision from February, refusing permission to appeal. With this week’s reversal, Wright reopens the discussion on the case.\n\nIn a tweet on July 20, Wright wrote, without mentioning the decision: “The legal protection of intellectual property is necessary to ensure the rights of creators and innovators and to encourage the production of new ideas, inventions, and creative works.\"\n\nEngland and Wales Court of Appeal's decision on July 20. Source: BAILII\n\nThe Bitcoin Legal Defense Fund (BLDF), the developers’ legal representative, argues that Wright hasn’t been able to prove that he is Satoshi Nakamoto, the pseudonymous creator of the Bitcoin white paper and database.\n\n“Wright has claimed to be Satoshi since at least 2016 without providing a shred of evidence to back up this claim,\" BLDF noted in a statement, adding that Wright must prove to be Satoshi Nakamoto “before the courts can make a decision on the three primary claims named in the lawsuit.\" The case is expected to go to trial in early 2024.\n\nThe Bitcoin code is open-sourced and freely distributed under the Massachusetts Institute of Technology license, meaning that users have the right to reuse the code for any purpose, including in proprietary software. Wright has argued, however, that the Bitcoin Core developers represent a “Bitcoin Partnership,\" allegedly a centralized entity that controls the Bitcoin network.\n\n“They seem to be trying to muddy the waters and make it seem like Bitcoin development is a centralized process controlled by a few people, which is a key argument for their lawsuit,\" a spokesperson from BLDF told Cointelegraph.\n\nAccording to BLDF, the fact that courts in the United Kingdom are allowing his arguments to be heard is extremely concerning — not just for the crypto community but for the whole world. “It sets a dangerous precedent where developers can be sued for violating the file format of open source software that someone else claims to have created,\" it said.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum — Can we fix it?"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY3J5cHRvd2FsbGV0LmNvbS9hY2FkZW15L3doby1hY2NlcHRzLWJpdGNvaW4tcGF5bWVudHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Who Accepts Bitcoin? 50 Companies that Accept Bitcoin [2023] - CryptoWallet.com",
        "content": "As of 2023, there is no denying that Bitcoin (BTC) is a major financial entity in global economics. However, as with any currency, its value lies in the ability to spend it. Therefore many people are asking the question How can I spend my Bitcoin?\n\nIn this guide, we have explored “Who accepts Bitcoin” and compiled a comprehensive list of which online stores, retailers, and companies that accept Bitcoin payments in 2023.\n\nMoreover, as Bitcoin gains popularity as an alternative form of currency, you no longer need to look for companies accepting Bitcoin payments. Crypto cards (or Bitcoin cards) allow you to spend Bitcoins practically anywhere, directly from your BTC wallet!\n\nWith CryptoWallet.com Card, you can make payments in Bitcoins, from clothes, luxury watches, and iPhones, to a cup of coffee at a local cafe. Your Bitcoin is converted to cash at the point of sale at ZERO conversion fee. Get your Crypto Card today!\n\nHow to Spend Bitcoins?\n\nIf you are currently holding Bitcoin and wish to spend it, then you have a range of options.\n\nCompanies that accept Bitcoin: As Bitcoin has garnered global attention, the number of companies that accept Bitcoin has increased correspondingly. Companies accepting Bitcoins will typically have a crypto payment option at the online checkout.\n\nGift card purchase: Another option for purchasing products with Bitcoin is to purchase a gift card. If the company does not accept Bitcoin payments, it is often still possible to buy a gift card for that company with Bitcoin. The Gift card can then be used to purchase products on its respective site. There are a number of sites which facilitate this, such as Coinsbee and Bitpay. These sites offer gift cards for companies such as Amazon, Starbuck, Zara, Playstation, etc.\n\nCrypto Card: Another way of spending Bitcoin is to obtain a crypto card. Crypto cards are directly linked to your crypto wallet and will automatically convert cryptocurrency into your local fiat currency. There are various reputable crypto card providers and they will have varying fees, perks and benefits.\n\nRead More: How to Spend Bitcoins\n\nWho Accepts Bitcoin Payment in the UK?\n\nAs of 2023, throughout the UK, there are many retailers and companies that accept Bitcoin as payment. To give an overview of the diverse range of products and services available, we have compiled a list of assorted, crypto friendly, companies for our UK readers.\n\nExpress VPN A popular VPN service that offers subscriptions paid with Bitcoin. Twitch: Amazon-owned game streaming platform accepts Bitcoin and Bitcoin Cash as payment for its services. It’s A Mod Thing: This clothing shop sells vintage clothing and interesting furniture for crypto. C.W. Sellors: This high quality jewelers sells jewelry and luxury watches for Bitcoin. Cheap Air: A travel agency, which sells cheap flights with the possibility to pay in crypto. Bimble Solar: This is a renewable energy company which sells solar panels, kits and accessories which allows payment in Bitcoin. Hosting.co.uk: This is a web hosting company who takes payment in Bitcoin. Girl Meets Dress: This is a clothing company which specializes in renting designer dresses out for events. Academy For Distance Learning: This company provides flexible online learning, with fees payable in Bitcoin. The Real Rug Company: This company provides high quality carpets and rugs for Bitcoin. Art Galleries Direct: This company enables its customers to buy art using cryptocurrencies. Maths Gear: This toy company sells interesting toys and puzzles, all available to purchase with Bitcoin. Prestige Kent Cars: An automobile dealership which will allow its customers to pay for cars and accessories in Bitcoin. Private Fly: This company charters private jets for Bitcoin. 5wire.co.uk: An online retailer offering a wide range of products, from electronics to home appliances, and accepting Bitcoin as a payment option. Academy for Distance Learning: An educational institution providing distance learning courses and accepting Bitcoin payments for course enrollment. Bimble Solar: Specializing in solar power solutions, Bimble Solar allows customers to purchase solar panels and related products using Bitcoin. BitFolk: A UK-based virtual private server provider that accepts Bitcoin as a method of payment for their hosting services. Earth VPN: A virtual private network service allowing users to safeguard their online privacy, accepting Bitcoin payments for subscriptions. Jura Watches: A luxury watch retailer accepting Bitcoin as an alternative payment option for premium timepieces. Manchester VPS: A Manchester-based virtual private server provider that enables users to pay for hosting services using Bitcoin. Maths Gear: An online store offering unique and quirky math-related products, now accepting Bitcoin payments. Mullvad: A privacy-focused VPN provider allowing users to subscribe to their services using Bitcoin for enhanced anonymity. My Pashmina: Specializing in luxurious pashmina products, this retailer now offers the convenience of Bitcoin payments. Nitrous Networks: A game server hosting company accepting Bitcoin payments for their hosting services. Prestige Kent Cars: A luxury car dealership in Kent that embraces Bitcoin as a payment option for exclusive vehicle purchases. Private Internet Access: A renowned VPN service enabling users to pay with Bitcoin for enhanced online security and privacy. The Real Rug Company: A rug retailer accepting Bitcoin as an alternative payment method for their exquisite rug collections. The Seedbox Company: A seedbox hosting provider catering to users seeking privacy in their online torrenting activities, accepting Bitcoin payments. W Hamond: A renowned jeweler offering high-quality jewelry pieces, now allowing customers to purchase using Bitcoin.\n\nSource (As of 20 April 2023). If you are looking for a more detailed list of crypto merchants then Bitcoin.com has one of the the best lists available.\n\nCompanies That Accept Bitcoin in the US and Canada\n\nIf you are asking who accepts Bitcoin in the US, here is the list of major companies accepting Bitcoin as payment:\n\nSource\n\nCrypto Card: No Need to Find Who Accepts Bitcoin as a Payment\n\nCrypto cards are debit cards directly linked to your crypto wallet. These cards act like any other debit card and can be used in any establishment which accepts debit card payments. These cards are a bridge between the traditional fiat spending system and the cryptosystem.\n\nWhen using a crypto card it will take the equivalent amount of crypto currency out of your crypto wallet and trade it directly for the local fiat currency. You can even take cash out at ATMs.\n\nWhile they make spending Bitcoin easier and more intuitive than ever before, they will charge a small networking fee, so be sure to inform yourself of the terms and conditions. They also convert crypto in real time, so your holding can fluctuate violently up or down with the market. To help you choose your crypto card here is a link to the top ten best crypto cards in Europe.\n\nThe CryptoWallet.com crypto card launching in Q4 of 2023 has the most amount of cryptos and the lowest fees in the world – join the whitelist to order one now!\n\nWho Accepts Bitcoin? (Indirectly via Gift Cards)\n\nThere is an abundance of online shops, retailers and companies that will not accept payment in crypto currency but have the option of purchasing a gift card with crypto. You can then spend that gift card on products or services from that company. If you wish to buy a crypto gift card then you can do so at Coinsbee or Bitpay.\n\nHere is an overview of the diverse companies that have gift cards available to purchase for crypto.\n\nThere is an abundance of online shops, retailers and companies that will not accept payment in crypto currency but have the option of purchasing a gift card with crypto on platforms like Gyft or Bitpay.\n\nYou can then spend that gift card on products or services from that company. This is one of the best ways to spend Bitcoin (throigh Gift Cards) at some of the top brands in the world including\n\nincluding\n\nAdidas\n\nStarbucks\n\nPlaystation\n\nTaco Bell\n\nUber\n\nTwitch\n\nHotels.com\n\nDomino’s\n\nGAP\n\nBurger King\n\nAirbnb\n\nNike\n\nand many others. Find the complete list of gift cards you can buy with Bitcoin at Gyft.\n\nBitcoin as a Payment Method\n\nInitially, Bitcoin was primarily used by individuals trading on the internet. Then around 2014, cryptocurrencies started moving from the private world into everyday life when companies like Overstock and TigerDirect, started to accept Bitcoin.\n\nDue to its nature, Bitcoin has several extremely advantageous elements when used as currency. It is decentralized and allows peer-to-peer transactions, which means transferring funds between countries is a non-issue. It is unforgeable due to its blockchain software.\n\nIt also has a hard cap of twenty one million Bitcoin that can ever be minted, so it will never be subject to inflation. With all these amazing features Bitcoin is garnering a lot of interest from companies around the world and more and more businesses are starting to accept Bitcoin payments.\n\nPaying with Bitcoin can have its drawbacks as well, there can be high volatility in day to day prices which makes planning ahead essential. Furthermore, while it has been widely accepted, many countries have harsh regulations or even outright bans on Bitcoin trading.\n\nDespite these minor drawbacks, paying with Bitcoin remains an attractive payment option for businesses around the world. This article will discuss companies, retailers and online stores that accept Bitcoin as payment.\n\nHow to Accept Bitcoin Payments?\n\nNow that there are so many ways to spend Bitcoin, you may be wondering if it is possible to get paid in Bitcoin. With the integration of crypto currencies into global economic institutions, getting paid in Bitcoin has become a possibility in many parts of the world.\n\nHowever, countries such as China, India and Nigeria have banned Crypto currency transactions and many other countries have severe limitations, If you are a UK reader then you can find a tax guide here, if you are from elsewhere can check your country’s crypto regulations here.\n\nTo get paid in Bitcoin you will need a crypto wallet, you can set up a crypto wallet here. Once you have a crypto wallet set up there are many options for accepting Bitcoin payments. The easiest way to receive Bitcoin is to send your crypto wallet address to your client, from there your client can pay crypto directly into your wallet. You can read an in depth article about getting paid in Bitcoin here.\n\nFAQs: Who Accepts Bitcoin?"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2RlLWdyZWVuLWFwcGFyZWwtY29ycC1leHBhbmRzLTExMzAwMDU2Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Code Green Apparel Corp. Expands Cryptocurrency Mining Fleet with Purchase of 50 Bitcoin Miner S19 XP Units - Yahoo Finance",
        "content": "DRIPPING SPRINGS, TX / ACCESSWIRE / July 21, 2023 / Code Green Apparel Corp. (OTC PINK:CGAC) a leading player in the cryptocurrency industry, is proud to announce the acquisition of 50 state-of-the-art Bitcoin Miner S19 XP units via Compass Mining, marking a significant milestone in the company's growth strategy, bringing its fleet to 560 miners. The fleet number contains 5 S19j Pro & 100 S19 XP miners acquired during the asset purchase \"Operating Group 1\" & \"Operation Group 2\", 405 S19 Pro+ (this is a correction from 412 previously stated), and lastly, of course, the new acquisition of the 50 S19 XP Units. This strategic investment solidifies Code Green Apparel Corp.'s position as a critical player in the mining sector, along with obtaining an additional hash rate. It demonstrates its commitment to staying at the forefront of technological advancements in cryptocurrency mining.\n\nBitcoin mining plays a critical role in the decentralized nature and security of the Bitcoin network. Code Green Apparel Corp. recognizes the importance of utilizing efficient mining equipment to maintain a competitive edge. The acquisition of 50 Bitcoin Miner S19 XP units represents a substantial step forward in enhancing Code Green Apparel Corp.'s mining capabilities and maximizing operational efficiency.\n\nThe Bitcoin Miner S19 XP is renowned for its exceptional performance, energy efficiency, and reliability. By incorporating these cutting-edge units into its mining infrastructure, Code Green Apparel Corp. significantly increases its hashing power and overall mining capacity. This investment reinforces the company's commitment to driving innovation and maintaining a robust mining operation.\n\n\"We are thrilled to announce the purchase of 50 Bitcoin Miner S19 XP units, which will bolster our mining capabilities and further strengthen our position in the cryptocurrency industry,\" said Logan W. Rice, Chief Executive Officer at Code Green Apparel Corp. \"This strategic investment aligns with our mission to stay at the forefront of technology and solidify our role in the decentralization and security of the Bitcoin network.\"\n\nStory continues\n\nCode Green Apparel Corp. has a track record of embracing technological advancements and adopting best practices in the cryptocurrency industry. By investing in the Bitcoin Miner S19 XP units, the company not only enhances its mining operations but also contributes to the overall decentralization and security of the Bitcoin network.\n\nAs the cryptocurrency market continues to evolve and gain mainstream acceptance, Code Green Apparel Corp.'s commitment to innovation and strategic investments places it in a prime position to capitalize on future opportunities. By expanding its mining capabilities by acquiring the Bitcoin Miner S19 XP units, Code Green Apparel Corp. sets the stage for continued growth and success in the dynamic cryptocurrency landscape.\n\nAbout Code Green Apparel Corp.: Code Green Apparel Corp. is a prominent cryptocurrency player specializing in Bitcoin Mining. With a solid commitment to innovation, Code Green Apparel Corp. is dedicated to driving the widespread adoption of cryptocurrencies and blockchain technology while maintaining the highest standards of security and operational excellence.\n\nFor more information, please visit https://www.thenewcgac.co or contact:\n\nLogan William Rice. Chief Executive Officer\n\nCode Green Apparel Corp.\n\ncodegreenapparelcorporation@gmail.com\n\n(612) 889 - 2418\n\nSOURCE: Code Green Apparel Corp.\n\nvia PRISM Mediawire, LLC\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/769547/Code-Green-Apparel-Corp-Expands-Cryptocurrency-Mining-Fleet-with-Purchase-of-50-Bitcoin-Miner-S19-XP-Units\n\n\n\n"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmxlZGdlci5jb20vYmxvZy90b3dhcmRzLWEtdHJ1c3RsZXNzLWJpdGNvaW4td2FsbGV0LXdpdGgtbWluaXNjcmlwdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Towards a trustless Bitcoin wallet with miniscript - Ledger",
        "content": "\n\nThings to know:\n\n\n\n– Miniscript makes it possible to build Bitcoin software wallets that make a backdoor impossible to exploit in the hardware wallet. We’re glad to say that Ledger is the first commercial hardware wallet manufacturer to support miniscript.\n\n\n\n– The additional features can be implemented without compromising the user experience.\n\n\n\n\n\nHardware signing devices are engineered to safeguard the user from various common attack vectors, such as:\n\nUnauthorized access and extraction of the seed\n\nMalware infecting your associated software wallet\n\nSoftware vulnerabilities on the device itself\n\nLike any business, it’s in the manufacturer’s best interest to make devices as unbreakable as they can. Succeeding in this mission is paramount, and security companies like Ledger rely on a reputation built on their track record.\n\nHowever, some users might still have concerns. What prevents the company itself from hiding a backdoor in the devices?\n\nIn self-custody, we don’t trust, we verify.\n\nBut can the user really verify that a device does not have a backdoor?\n\nThat’s the key question this article delves into. More precisely, this article tackles the following topics:\n\nwhat is a backdoor, and why it’s difficult, if not impossible, to prove that there isn’t one;\n\nwhy only users can protect themselves from this risk;\n\nhow miniscript enables practical solutions to this challenge for bitcoin wallets.\n\nBy being the first hardware wallet to support miniscript, we hope to inspire developers to build secure solutions and upgrade our whole industry, and eliminate the chance of such a systemic risk from ever materializing.\n\nHow to build the unbackdoorable signing device\n\nLet’s put it clearly: you can’t.\n\nTo defend yourself against a potential backdoor, you need a different attack model than the one we outlined above: in this scenario, the adversary could be the vendor themselves, or a corrupted insider.\n\nThe often-touted solution to this issue is Open Source: after all, if you can inspect the code, what could possibly go wrong?\n\nHowever, the truth is more complex. Since the vendor assembles the hardware, a backdoor could be entirely contained within it. The hardware could be designed to disregard the software at certain points and execute malicious code instead.\n\nUnlike software that runs on general-purpose computing devices (like your laptop or phone), scrutinizing the hardware is practically impossible with today’s technology. Even if the hardware specifications were entirely open source, complete with the details of every single gate in the circuit, you would still need high-cost equipment to verify that a specific chip is built in accordance with them.\n\nHow to backdoor a hardware wallet\n\nHere are a few of the simplest methods a malicious hardware vendor could use to introduce a backdoor, along with some ways power users can protect themselves today.\n\nSeed generation\n\nMany devices offer you the ability to generate a seed (also called the Secret Recovery Phrase) directly on the device, using a True Random Number Generator.\n\n😈 The evil device could generate seeds that appear random but are actually predictable to the attacker.\n\n🛡️ Power users can circumvent this problem by generating a mnemonic offline. Additionally, incorporating a robust passphrase can also generate an entirely independent seed that the hardware vendor cannot predict. The trade-off is that users must ensure they properly back up the passphrase in addition to the mnemonic words.\n\nPublic key derivation\n\nHardware wallets derive and export the public keys (also called xpubs, short for extended public key as defined in BIP-32. The xpubs are used to generate the possible addresses for receiving coins.\n\n😈 The evil device could return public keys controlled by the attacker instead of the correct ones derived from the seed.\n\n🛡️ Users could validate the derived xpub on another, offline device. However, entering the seed on other devices carries its own risks. Security-aware users might deem any device that has accessed the seed as dangerous, potentially to the point of destroying them. The typical user might struggle to correctly perform this procedure while managing the additional risks.\n\nLeaking information\n\nAn airgap is frequently proposed as a solution to prevent a malicious or compromised device from exfiltrating private keys. After all, if a device can’t communicate with the outside world, it can’t do anything harmful, right?\n\nNot quite!\n\nThe device can always communicate when it’s in use: it produces signatures. These signatures end up inside transactions that are broadcast and stored forever on the blockchain.\n\nA signature is a random-looking byte string of at least 64 bytes. However, since more than one valid signature can correspond to the same message, a malicious device could communicate a few bits of information every time a signature is produced, by generating multiple signatures and selectively choosing which to publish.\n\n😈 A rogue device might produce non-random signatures that, over many transactions, reveal the seed to the attacker!\n\nAn attacker successful in installing such a backdoor would merely have to wait for malicious signatures to appear on the blockchain until they have enough information to reconstruct the entire seed.\n\n🛡️ For ECDSA signatures, using a standardized method of deriving the nonce deterministically (like RFC6979) thwarts this attack, provided one validates that the produced signature matches the expected one. However, ensuring this is the case requires loading a second device with the same seed, which leads to the same practical problems mentioned in the previous section.\n\n🛡️ An interesting approach is to use a smart way to force the device to actually choose a random nonce. A protocol for this purpose, known as anti-exfil or anti-klepto, is currently implemented in Blockstream Jade and ShiftCrypto BitBox02 hardware wallets. Read more on ShiftCrypto’s blog, which also includes a technical description of how such an attack might be executed.\n\nOk then, is there no hope?\n\nMost of the defenses🛡️ listed above mostly require the user to perform explicit, intrusive actions in order to protect themselves: either by generating the seed on their own (essentially, using their brain to replace the functionality from the hardware wallet), or utilizing an additional device to verify that computations are correctly executed.\n\nHowever, the anti-exfil protocol stands out: given that there’s always a machine intermediating between the hardware signer and the outside world, this machine can assist. Through an interactive protocol with the hardware signer, it can enforce the use of a genuinely random nonce, thereby diminishing or eliminating the chance of significantly manipulating the final signature.\n\nIn this blog post, we are primarily interested in these types of measures: while strategies that significantly worsen the UX could be appealing to power users, they are likely to make things worse in practice for the less technically adept users − which is the vast majority.\n\nThe security model\n\nStandard model for hardware signers\n\nHardware signer manufacturers aim to protect users from a variety of potential threats (for more details, see Threat Model). In this article, we focus on one, very important property, that can be summarized as follows:\n\nUsers can’t be deceived into an action resulting in fund loss, provided they understand and verify the on-screen information prior to approval.\n\nApproval is needed for any sensitive action, particularly signatures. Protecting the seed would be futile if malware could produce signatures for arbitrary messages, such as a transaction draining all the funds!\n\nIt’s crucial to emphasize that the above property must hold true even if the software wallet is completely compromised. What’s displayed on your laptop/phone screen cannot be trusted: malware could replace addresses, deceive you about which addresses are yours, present a transaction but then forward a different one to the device for signing, etc.\n\nTherefore, the firmware and applications running on a hardware signing device consider the software wallet inherently untrusted and untrustworthy.\n\nAnti-backdoor security model for software wallets\n\nIn this section, we flip the roles completely. We now want to design a software wallet that prevents the hardware manufacturer from stealing or causing fund loss, even if the device is completely malicious.\n\nHence, this can’t be a property of the device: rather, it’s a property of the software wallet setup. We could summarize it as follows:\n\nProvided that the software wallet is not compromised, the hardware manufacturer cannot cause the user to lose funds.\n\nThis may seem counterintuitive, as it directly contradicts the standard security model detailed above. However, “not having a backdoor” means “doing exactly what they are supposed to do”. Since the software wallet is the sole interface between the signing device and the external world, it’s the only place where protection against misbehavior can be enforced − whether because of a bug, or explicit compromission of the device.\n\nNote that this model extends significantly beyond a device failure, such as an exploitable bug. In this case, we’re operating within a scenario where the device is actively seeking to cause fund loss.\n\nOf course, there’s no possible protection if the manufacturer has successfully compromised both the device and also your machine that runs the software wallet. Therefore, it’s absolutely vital to ensure that your software wallet is Open Source and auditable, especially if built by the same vendor that manufactures the hardware.\n\nThe role of miniscript\n\nMiniscript equips wallet developers with the ability to fully utilize the advanced features of bitcoin Script. For an overview of the incredible possibilities miniscript unlocks, refer to our previous blog post. You might also want to listen to Episode 452 of the Stephan Livera Podcast for a discussion on what miniscript brings to the bitcoin landscape.\n\nThe Ledger Bitcoin app supports miniscript since its 2.1.0 release, which was deployed in February 2023. At the Bitcoin 2023 conference in Miami, Wizardsardine announced the 1.0 release of their Liana wallet, the first deployed wallet based on miniscript.\n\nThe basic idea of this post is that a bitcoin wallet account can be protected not just with one, but with multiple keys. This allows flexible security frameworks where even a total failure or compromission of a key is not catastrophic.\n\nMultisig musings\n\nMultisig is a significant upgrade in the strength of a self-custody solution. By leveraging the programmability of Bitcoin Script, it enables the creation of wallets that necessitate multiple keys instead of just one. A k-of-n multisig wallet requires a combination of k valid signatures, out of a total of n possible ones.\n\nHowever, multisig also places a UX burden on the user, and introduces new opportunities for errors. A 3-of-3 multisig setup, involving three different keys securely backed up in separate locations, offers strong security… but it also means that if even a single key is lost, the coins become permanently inaccessible!\n\nTherefore, setups offering more redundancy (like 2-of-3, or 3-of-5) tend to be more popular: should a single key be lost, the other keys can still facilitate recovery. But this introduces a tradeoff: if one key is compromised unbeknownst to you, the overall security is significantly reduced!\n\nCompanies like Casa and Unchained Capital specialize in self-custody solutions where they hold a minority of the keys for their customers. They also assist their users by guiding them through the onboarding process and simplifying the use of custody systems, which can otherwise be daunting for most non-technical users.\n\nMiniscript and time-locked recovery paths\n\nLiana uses miniscript to create wallets that have multiple ways of spending:\n\na primary spending condition, which is immediately available;\n\none or more additional spending conditions that become available after a certain period (the so-called timelock).\n\nThis enables many interesting use cases:\n\nRecovery : A standard wallet with either single-signature or multisig as the primary spending path; but a separate recovery mechanism (a key with a different seed, a multisig, a tech-savvy friend, a custodian) becomes available after 6 months.\n\n: A standard wallet with either single-signature or multisig as the primary spending path; but a separate recovery mechanism (a key with a different seed, a multisig, a tech-savvy friend, a custodian) becomes available after 6 months. Governance : A company with two directors could establish a 2-of-2 for the company’s treasury; in case of disagreement, a trusted lawyer could access the funds after 6 months.\n\n: A company with two directors could establish a 2-of-2 for the company’s treasury; in case of disagreement, a trusted lawyer could access the funds after 6 months. Decaying multisig : A wallet starts as a 3-of-3, transitions to a 2-of-3 after 6 months, and becomes a 1-of-3 after 9 months.\n\n: A wallet starts as a 3-of-3, transitions to a 2-of-3 after 6 months, and becomes a 1-of-3 after 9 months. Automatic inheritance: The recovery path after 6 months includes a 2-of-3 of your three children; perhaps a second recovery path after 1 year involves a notary, in case the heirs can’t reach a consensus.\n\nRemark: all the examples above use a relative timelock, which refers to the age of the coins (that is: the last time the funds were moved). The trade-off is that the user must remember to spend the coins (by sending them to themselves) if the timelock is nearing expiration.\n\nThese are just a few examples, but they should be enough to convince the reader that miniscript is a significant step forward towards realizing Bitcoin’s potential as programmable money.\n\nWallet policy registration\n\nFor Bitcoin wallet accounts utilizing multiple keys (be it multisig, or more sophisticated miniscript-based solutions), it’s crucial to train the device to identify the addresses that belong to that account. This is the only way the device can aid the user in ensuring that they’re receiving or spending from the correct addresses…\n\nValidating the policy and the xpubs of the cosigner against a trusted backup is essential, but relatively time-consuming.\n\nThe good news is that it only needs to be done once:\n\nOnce a policy is registered with a name (in the example “Decaying 3of3”), your device will be able to recognize it whenever such a policy is employed.\n\nThose interested in technical details can find more information in the BIP proposal.\n\nPolicy backup\n\nOne critical aspect to note is that while multi-key policies permit a subset of the private keys to authorize transactions, the knowledge of all the public keys (and the exact policy) are required.\n\nHowever, unlike the seed, backing up the policy and the public keys is far less risky: if someone were to discover it, they could trace all the transactions linked to that policy. Although this is not ideal − privacy matters! − it is not as disastrous as losing your coins and less enticing for potential attackers. Consequently, storing multiple copies of the policy in hot wallets, printing it and storing it in various places, encrypting it and storing it in cloud storage, and so on, are all viable strategies.\n\nThe unbackdoorable single-signature wallet\n\nLet’s take a step back. We’ve discussed multi-signature wallets, but now we’re going back to basics to create a single-signature wallet. More precisely, we want a wallet that feels and looks like a single-signature wallet, after an initial setup phase. Yet, we aim to create a wallet from which the manufacturer cannot steal your funds even if they are malicious 😈, and the hardware signing device behaves in unpredictable ways.\n\nThe approach can easily be generalized for multi-signature wallets.\n\nThe examples below will be written in a language called policy, rather than miniscript. Policy is easier for humans to read and think about, and can be compiled to miniscript with automated tools. Read more about miniscript and policy.\n\nThe hardware wallet can protect you in the standard security model. Miniscript can protect you in the anti-backdoor security model (and much more!).\n\nStep zero: the status quo\n\nThis is the policy most users use today: a single key that is derived from a seed produced in the hardware wallet.\n\npk(key_ledger)\n\nOf course, there is no way of proving the absence of a backdoor.\n\nStep one: double those keys\n\nThe first step is simple:\n\nand(pk(key_ledger), pk(key_client))\n\nHere, key_client is generated on the user’s machine, hence a hot key. Essentially, it’s a 2-of-2 multisig setup. The key aspect is that the user doesn’t interact much with key_client : the software wallet generates this key, includes it in the wallet’s backup, and signs whenever needed (for example, while the user is busy signing with their hardware signer).\n\nThis already seems quite interesting: the funds are unspendable without key_client , which is unavailable to the hardware vendor; even if the evil vendor had full knowledge of the key in the device, they would still be unable to move the funds without explicitly targeting the user, for example by compromising the machine that runs their software wallet.\n\nHowever, there’s an issue: during wallet onboarding, the hardware signer is the only entity capable of generating the public key (xpub) key_ledger used in the wallet. Hence, the device could intentionally generate a wrong xpub controlled by the attacker, and later decline (or be unable) to sign. Arguably, this is a fairly extreme attack scenario: the backdoor creator can’t steal the funds, and the most they can do is individually target the user and demand a ransom (“I can help you retrieve your money if you pay half to me”).\n\nMore realistically, this increases the chance of mistakes of mistakes: you now have two seeds / private keys, and you need both in order to be able to spend. Lose either, and coins are locked forever.\n\nStep two: timelocked recovery\n\nWe introduce a separate recovery key, accessible only after a specific timelock: and(older(25920) , pk(key_recovery)) , where 25920 is the approximate number of blocks in 6 months. The full policy becomes:\n\nor( and(pk(key_ledger), pk(key_client)), and(after(25920), pk(key_recovery)) )\n\nThis is similar to the previous scenario, but with a twist: if key_ledger or key_client becomes unavailable for any reason (most commonly, losing the seed backup!), a recovery path becomes accessible after 6 months.\n\nThere are several options for key_recovery , each with its own tradeoffs:\n\na. Use another hot key. This is a practical solution as long as the user remembers to reset the timelock. However, if the hot keys are compromised (a scenario that should generally be considered quite likely!), the attacker could attempt to access the funds as soon as the timelock expires, initiating a race with the legitimate owner.\n\nb. Use a separate hardware signing device. This is a robust solution and can be used in combination with a different vendor if desired; however, it increases the setup complexity and cost for the user in terms of user experience.\n\nc. Use a trusted external service. The software wallet could import an xpub from an external service, using it as key_recovery . This third party is only trusted if the timelock expires, which could be an appealing tradeoff for some users.\n\nAs mentioned, like for any policy with timelocks, it is important that the user remembers to refresh the coins before the expiration of the timelock.\n\nStep three: the untrusted third party\n\nLet’s blend both ideas (a) and (c): for the recovery path, we require a local hot key key_recovery_local , and a key_recovery_remote that is hosted with a semi-trusted service; we also retain the timelock.\n\nor(\n\nand(pk(key_ledger), pk(key_client)),\n\nand(older(25920),\n\nand(pk(key_recovery_local), pk(key_recovery_remote))\n\n)\n\n)\n\nThis decreases the level of trust needed from the recovery service. However, we must exercise caution: the service itself could be monitoring the blockchain and detect our UTXOs − after all, they provided us with the key_recovery_remote xpub, so they can scan for UTXOs containing pubkeys derived from key_recovery_remote . They will be able to learn about our financial history, even before the timelock expires, and even if we never utilized their service.\n\nRemark: Taproot trees can eliminate this privacy problem for certain policies, but this isn’t always the case and requires careful evaluation based on the specific policy.\n\nStep four: blind the third party 🙈\n\nIn order to prevent the recovery service from learning about our financial history, instead of using the pubkey they communicate to us, we can use a blind xpub technique explained by mflaxman in detail here. In short, instead of using key_recovery_remote in our policy, we choose four 31-bit random numbers a , b , c , d (the blinding factors), and we use the following BIP-32 derived pubkey:\n\nkey_recovery_remote_blind = key_recovery_remote/a/b/c/d\n\nIt’s crucial that we also add key_recovery_remote , and the blinding factors a , b , c and d to our backup, for future reference.\n\nIf we ever need to use the recovery service, then we will reveal a , b , c , d to them. Until then, they have no way of discovering that keys derived from their key_recovery_remote are being published on the blockchain: the number of possible combinations for the 4 blinding factors is 2^(31*4) = 2^124 , which makes it impossible to bruteforce them all.\n\nStep five: too many hot keys can burn you 🔥\n\nWe succeeded in making our software wallet unbackdoorable. However, we introduced a different problem: both spending conditions use a locally-generated, hot key that is not verified by the hardware wallet. Therefore, if the host machine is compromised, it might trick you into registering the policy using the pubkeys key_client and key_recovery_local , but put random, unrelated private keys in our backup (remember, the hot keys are part of our backup!).\n\nThat would basically make any funds sent to the wallet unspendable, as nobody controls the private keys necessary to sign.\n\nThere are a few solutions to solve this problem:\n\nDuring onboarding, after printing our backup on paper, we can use a separate device to verify that the private and public hot keys on the backup indeed match. This approach would eliminate the problem, as we would be certain we have all the required keys needed for reconstruction and signing.\n\nWe can add another spending condition with an even longer timelock (9 months, 38880 blocks) that only requires a key_ledger_failsafe from the hardware device. In this way, in the absolute worst-case scenario where everything else fails, we fall back to the security of a single signing device. In normal operations, we would never let the first timelock expire, thus, the second timelock also won’t expire!\n\nWith the second approach, the final policy would look like this\n\nor(\n\nand(pk(key_ledger), pk(key_client)),\n\nor(\n\nand(older(25920),\n\nand(pk(key_recovery_local), pk(key_recovery_remote_blind))\n\n),\n\nand(older(38880), pk(key_ledger_failsafe))\n\n),\n\n)\n\nThis software wallet configuration satisfies all the security properties that we claimed at the beginning. Moreover, it offers a recovery path in case the main spending keys key_ledger are lost. A nice feature to have!\n\nOnboarding to the unbackdoorable software wallet\n\nWhat would the user experience for a wallet using such a complex policy look like? Here’s a brief overview:\n\nThe user opens the software wallet and starts creating a new account.\n\nThe software wallet prompts the user to connect their signing device and retrieves the xpubs for key_ledger and key_ledger_failsafe .\n\nand . The software wallet autonomously generates the key_client hot key.\n\nThe software wallet obtains key_recovery_remote from a co-signing service or allows the user to specify a key in another manner. Optionally, it computes the key_recovery_remote_blind using the blinding technique mentioned previously.\n\nfrom a co-signing service or allows the user to specify a key in another manner. Optionally, it computes the using the blinding technique mentioned previously. The software wallet generates a policy backup containing the precise miniscript policy, all the xpubs, and the extended private key for the key_client hot key. This backup is securely stored (for instance, printed on paper or saved on a separate device).\n\nhot key. This backup is securely stored (for instance, printed on paper or saved on a separate device). Finally, the software wallet instructs the user to register the policy on the device. The user cross-checks the backup (on paper or any medium other than the screen controlled by the software wallet).\n\nThe software wallet manages most of the above steps, making the user’s involvement not more burdensome than the expected effort needed today to set up a multisignature wallet.\n\nThe onboarding should just require a few minutes once a good UX is built for it. Once complete, the software wallet can provide a user experience very similar to that of a typical single-signature wallet. This is how miniscript will change everything: by disappearing from the user’s sight!\n\nTaproot improvements\n\nLedger supports miniscript since version 2.1.0 of the Bitcoin app, released in March. While support for receiving to and spending from taproot addresses was enabled since the taproot softfork in November 2021, we are now putting the finishing touches on the next step of the roadmap: miniscript support for taproot.\n\nTaproot will have a huge impact on the usability of the approaches presented in this article. If the primary spending path is a single-key spending condition, the existence of recovery spending paths will be undetectable on the blockchain unless they’re utilized. This will greatly improve privacy by completely eliminating any fingerprints for the standard spending path. Furthermore, it improves scalability, as the standard spending path becomes as cost-efficient to spend as possible. This means no additional cost will be incurred due to the presence of recovery paths, unless they’re used. This is a significant upgrade from SegWit transactions, which require publishing the entire script, including all spending conditions, during any spend.\n\nFinally, more advanced protocols like MuSig2 (recently standardized) and FROST will supercharge the taproot keypath. Built on Schnorr signatures, these protocols allow to create a single aggregate pubkey that can be used to represent an n-of-n multisignature or a k-of-n threshold scheme. This would allow the use of the taproot keypath even in cases that today are more commonly represented with specific multisig scripts.\n\nConclusions\n\nThis article explores a small (but important) niche of the vast design space that miniscript unleashes for software wallets.\n\nWe showed how miniscript can be used to create an “unbackdoorable” software wallet, while also adding an additional recovery path that allows to prevent disastrous key losses. While hardware signing devices cannot enforce the anti-backdoor security model, by supporting miniscript they enable software wallets that do exactly that!\n\nBy cleverly utilizing a combination of multisignature schemes, timelocks, blind xpubs, and hot keys, we’ve demonstrated a secure wallet configuration that balances security, privacy, and robustness.\n\nMoreover, we argued that this is possible without negatively impacting the user experience, as the complexity of the setup does not translate to a great additional UX burden.\n\nWe are excited for the possibilities that miniscript will unlock for the next generation of bitcoin self-custody."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRmaW5leC1oYWNrZXJzLWFncmVlLWZvcmZlaXQtYmlsbGlvbnMtMTYyNzA4MDk5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitfinex Hackers Agree to Forfeit Billions in Bitcoin in Plea Deal - Yahoo Finance",
        "content": "The couple charged with laundering $4.5 billion in cryptocurrency and conspiracy to defraud the United States through a 2016 hack of crypto exchange Bitfinex have reached a plea deal, according to court documents Friday morning.\n\nAs part of the plea deal, the couple has agreed to forfeit proceeds from the almost 120,000 Bitcoin they stand accused of laundering. Ilya Lichtenstein and his wife Heather Morgan, both of whom were arrested early last year, are set to appear before a judge on August 3rd, and could face up to 20 years in prison.\n\nU.S. prosecutors said that the culprits employed “numerous sophisticated laundering techniques,” allegedly using false identities, automating transactions, and then depositing the funds on a variety of exchanges and darknet markets–a process known as “layering.”\n\nDOJ Seizes $3.6 Billion in Bitcoin From 2016 Bitfinex Hack, Arrests Couple\n\nUpon arrest in February 2022, the Department of Justice (DOJ) seized $3.6 billion, considered the department's “largest financial seizure ever,” said Deputy Attorney General Lisa O. Monaco. But many questions about how the hack and subsequent seizure of funds happened were left unanswered.\n\nAccording to court documents, both parties allegedly conspired to launder 119,754 Bitcoins, all stolen from the Bitfinex platform when it was hacked in 2016. Recently, the company recovered a small amount of the Bitcoin Cash that was stolen in the notorious hack."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9jcmltaW5hbHMtbm90LXVzaW5nLWJpdGNvaW4td2hhdC1pcy1jb2luLW9mLWNob2ljZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Criminals No Longer Bitcoin-Believers, What is the Coin of Choice for Illicit Crypto Use? - CCN.com",
        "content": "Key takeaways\n\nThe amount of Bitcoin used for illicit activity has decreased drastically over the last two years.\n\nCriminals are beginning to favor stablecoins for their accessibility and ubiquity.\n\nPonzi schemes remain a threat in the Web3 space.\n\nBitcoin is no longer the cryptocurrency of choice for criminals, according to Web3 crime trends outlined in a presentation during EthCC in Paris.\n\nTara Annison, former head of technical crypto advisory at Elliptic, delved into the world of crypto-related crime, highlighting shifting trends in the cryptocurrencies being used for money laundering and illicit activities.\n\nUnpacking insights from Web3 crime insights from Elliptic, Chainalysis and TRM Labs, Annison highlighted a shift away from criminals using BTC in illicit schemes to stablecoins and other cryptocurrency tokens.\n\nAccording to the speaker, criminals prefer using dollar-denominated assets, like USDC Coin (USDC), as they are easily accessible and can be laundered through decentralized exchanges (DEXs).\n\nPonzi schemes remain prevalent in the industry, with nearly $8 billion worth of funds stolen from unsuspecting users in 2022.\n\nCriminals are also becoming increasingly more savvy using a variety of cryptocurrency cross-chain bridges, DEXs and mixing services in an effort to avoid blockchain analytics firms’ detection.\n\nA Stable Option for Criminals\n\nA key takeaway from Annison’s presentation was the role that stablecoins are playing in the world of Web3 crimes.\n\nThe accessibility of stablecoins and their ubiquity across DEXs and centralized exchanges makes these assets an easy choice to quickly move funds around. Annison said digital assets\n\nthat are dollar-denominated feel “more accessible” which criminals use as a target point.\n\n“It’s also super easy to launder through DEXs. There’s deep liquidity, really good volume, so that’s pretty worrying.”\n\nThe caveat of the increased use of stablecoins like USDC is the ability for issuers like Circle to freeze blacklisted tokens associated with hacks or thefts before criminals are able to cash out the stablecoins to fiat currencies.\n\n“What we’re seeing now is an increased number of accounts with USDC being blacklisted, and these are frozen funds that the criminals now can’t access.”\n\nFeels Like the 80s\n\nPonzi schemes have been part and parcel of the cryptocurrency space dating back to the early years after Bitcoin’s inception. As Annison highlighted, scams are still prevalent and continually account for major losses.\n\n“It might feel a bit 80s, but they reign supreme. In 2022 we saw $7.8 billion worth of funds stolen from users in the space from ponzis and pyramids. The ten largest of these schemes accounted for about 54%. Ponzis and pyramids tend to get really big and dominate.”\n\nAnnison highlighted Forsage and Trade Coin Club, the latter of which was eventually charged by the SEC . Trade Coin Club raised more than 82,000 BTC from 100,000 investors globally over a two year period. The SEC also charged eleven individuals responsible for running Forsage for operating an illegal pyramid scheme that raised over $300 million from users.\n\nA New Type of Criminal\n\nThe presentation also suggested that criminals are becoming more sophisticated in laundering stolen funds by using chain swapping and asset swapping techniques, aiming to evade blockchain analytics firms’ detection.\n\n“Criminals employ chain swapping and asset hoping to throw off blockchain analytics firms and evade detection, making it harder to trace stolen funds.”\n\nAnnison also highlighted an interesting correlation between the number of scams in the industry and prevailing cryptocurrency market conditions. Scams in the cryptocurrency space have decreased due to the falling market prices, as fewer new investors are attracted, making it less profitable for criminals.\n\nTerrorists Using Tron, USDT\n\nAnnison also touched on sanctions evasion and terrorist financing, suggesting that terrorists are increasingly using crypto to bypass international financial barriers\n\n“Cryptocurrencies are being used for sanctions evasion and terrorist financing, with Tron and USDtt being favored by terrorist organizations.”\n\nAnnison also noted that some sanctioned nations have turned to Bitcoin mining in an effort to bypass sanctions. She highlighted reports and data from 2021 that estimated that 4.5% of all Bitcoin mining was carried out in Iran, with the proceeds used to evade sanctions.\n\nThreats From All Sides\n\nThe popularity of various metaverse platforms has also led to an element of criminality creeping in.\n\nPhishing attacks, NFT theft, wallet tainting, and augmented reality hacks have all become commonplace, according to Annison, presenting unique challenges for the sector to tackle with users’ reputations and security at risk.\n\nOverall, the cryptocurrency sector continues to face a range of criminal activities, demanding increased vigilance and security measures to protect users and combat illicit activities."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNDkzMzUvZWwtc2FsdmFkb3JzLWJvbmRzLWhhdmUtc2t5cm9ja2V0ZWQtYWxvbmdzaWRlLWJpdGNvaW4taW4tMjAyM9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNDkzMzUvZWwtc2FsdmFkb3JzLWJvbmRzLWhhdmUtc2t5cm9ja2V0ZWQtYWxvbmdzaWRlLWJpdGNvaW4taW4tMjAyMz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "El Salvador's Bonds Have Skyrocketed Alongside Bitcoin in 2023 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEl Savador's bonds, due in 2027, have risen by over 60% since the start of the year—in parallel with a price surge for Bitcoin that’s seen the cryptocurrency rise by 80%.\n\nA government bond represents debt that is issued by the government and sold to investors to support government spending.\n\nBack in September 2022, credit rating company Fitch Ratings lowered El Savador's debt rating and predicted that a debt default would take place in January 2023.\n\nAD\n\nAD\n\nA debt default occurs when a borrower cannot repay loans they have taken, meaning that El Salvador would not have been able to pay bond holders. Not only did this not happen, but the country repaid a $800 million bond in January.\n\nSince then the country's bonds have soared alongside Bitcoin—though other factors are at play, with investors lauding the appointment of former IMF official Alejandro Werner as an adviser to the finance minstry.\n\nEl Salvador and Bitcoin\n\nEl Salvador made Bitcoin legal tender in September 2021. Since then, the country has seen mixed results; tourism has increased, but reports indicate that not many citizens actually use the cryptocurrency.\n\nAccording to Bloomberg, the country holds 2,546 Bitcoin, worth roughly $76.6 million.\n\nBitcoin has rallied by over 80% since the start of January, as a result of multiple factors. Recent bullish events include the Federal Reserve pausing on the latest interest rate hike and Blackrock's application to launch a spot Bitcoin ETF.\n\nAD\n\nAD\n\nU.S. Senators remain wary of El Salvador’s drive to adopt Bitcoin. A U.S. Foreign Relations Committee blog post from May says, \"We must seek greater clarity on how the adoption of Bitcoin as legal tender may impact El Salvador’s financial and economic stability, as well as El Salvador’s capacity to effectively combat money laundering and illicit finances.”"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy90ZXNsYS1iaXRjb2luLWhvbGRlci13aGF0LXdvdWxkLWl0LWJlLXdvcnRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Tesla is Still a Bitcoin Hodler, But What Would its $1.5 Billion be Worth Today? - CCN.com",
        "content": "Key Takeaways\n\nTesla hasn’t lost much by selling most of its BTC a year ago\n\nWhat Did Tesla Make by Selling its Bitcoin?\n\nIs Tesla Still Interested in Crypto?\n\nIs Dogecoin Elon’s favorite?\n\nTesla, the world’s leading EV manufacturer, just released the company’s earnings report for the second quarter of 2023. Within the report, the company details its expenditures and income from various sources, including returns on investments. However, the report shows that the company has made no sales of digital assets — not for this quarter, nor the two quarters prior.\n\nTesla reports that it holds $184 million in digital assets, a figure that hasn’t changed since Q3 of 2022.\n\nConsidering the huge push both Tesla and its CEO Elon Musk made for crypto in 2021, the company’s inactivity in the crypto market tells a story about its change of attitude towards digital asset investment.\n\nTesla Dumped Bitcoin\n\nIf we rewind the clock all the way to 2021, we’ll remember how Tesla shocked the crypto market when it invested $1.5 billion in Bitcoin. According to the US Securities and Exchange filing , the company said that it “invested an aggregate $1.50 billion in Bitcoin under this policy and may acquire and hold digital assets from time to time or long-term. Moreover, we expect to begin accepting Bitcoin as a form of payment for our products in the near future.”\n\nThe move shocked the market as Bitcoin immediately rose in price by over $3,000.\n\nShortly after, Musk tweeted that the company “has suspended vehicle purchases using Bitcoin. We are concerned about rapidly increasing use of fossil fuels for Bitcoin mining and transactions, especially coal, which has the worst emissions of any fuel,” adding that “Cryptocurrency is a good idea on many levels and we believe it has a promising future, but this cannot come at great cost to the environment.”\n\nFast forward just over a year, in Q2 2022, the company sold 75% of its Bitcoin stash for $936 million, realizing a profit of $128 million.\n\nThe company then released its earning report reflecting the sale, stating, “As of the end of Q2, we have converted approximately 75% of our Bitcoin purchases into fiat currency.”\n\n“Conversions in Q2 added $936M of cash to our balance sheet.”\n\nThe company also commented on the huge Bitcoin offload, saying it was meant to “prove liquidity of Bitcoin as an alternative to holding cash on balance sheet.”\n\nThrough quick maths, we can assume that Tesla sold its Bitcoin stash for an average of $29,000 per token. The figure is shockingly close to the price of BTC at the time this article is being written, floating around $30,000.\n\nSo, had Tesla held onto its Bitcoin stash for a year longer, the company would’ve sold the same tokens in 2023 for $968 million, rather than $936 million.\n\nMeme-ing The Crypto Market\n\nIn the meantime, Tesla’s CEO Elon Musk has been fickle about his support for DogeCoin. As the company was making its huge purchase of Bitcoin, Musk posted a series of tweets to show support for DogeCoin, even momentarily including “Dogecoin” in his Twitter bio.\n\nDoge — Elon Musk (@elonmusk) February 4, 2021\n\nDogecoin is the people’s crypto — Elon Musk (@elonmusk) February 4, 2021\n\nNo highs, no lows, only Doge — Elon Musk (@elonmusk) February 4, 2021\n\nAs a result, DogeCoin saw a staggering 50% surge in price. Elon even gave another 30% boost to DogeCoin earlier this year when Twitter decided to change its logo from the typical blue bird to the DogeCoin logo.\n\nTesla still accepts DogeCoin as a form of payment on its websites. A whole FAQ page on Tesla’s website is dedicated to DogeCoin.\n\nPerhaps, as a result, Evan Spencer of Evan Spencer Law, A New York plaintiffs’ lawyer, filed accusations against Tesla and its CEO, claiming market manipulation.\n\nThe complaint states that Musk and Tesla used eight crypto wallets to sell DogeCoin after hyping up the token through Twitter shenanigans.\n\nMusk has responded with proof that he had disclaimed these wallets prior to the DogeCoin sale."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtZ2V0LXJlYWR5LWJ0Yy1wcmljZS1wcmVwcy0yMDIzLWJ1bGwtbWFya2V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin traders say 'get ready' as BTC price preps 2023 bull market - Cointelegraph",
        "content": "Bitcoin (BTC) is gearing up for its next bull run in classic style, say traders eyeing two key trend lines.\n\nIn some of their latest social media analysis, popular traders Moustache and Titan of Crypto revealed a BTC price breakout in the making.\n\nBitcoin “bull market line” eyes classic crossover\n\nBitcoin is closely copying prior BTC price cycles, and the time is almost right for a bullish surge, according to Titan of Crypto.\n\nUploading historical BTC/USD price data, he drew attention to the 21-week simple moving average (SMA), currently at $27,900 per Cointelegraph Markets Pro and TradingView.\n\nOnce this upward-sloping trend line clears the immediate spot price range, a protracted period of upside follows, giving the 21-week SMA its nickname — the “bull market line.”\n\nTitan of Crypto called the phenomenon a “bull market kick off.”\n\n“Once the weekly 21 MA crosses over BTC market structure it will kick off the Bull Market,” he forecast.\n\n“Be ready, it’s getting closer.”\n\nBTC/USD annotated chart with 21-week SMA. Source: Titan of Crypto/Twitter\n\nBitcoin’s last such MA cross occurred four years ago, in early 2019 — the same juncture as today’s price action during the previous cycle. This led to that year’s local high near $14,000.\n\nMarch 2020 saw a brief undoing of the cross thanks to the COVID-19 cross-market crash, something Titan of Crypto calls a “black swan.”\n\nBitcoin trader: “Imagine being bearish” above $28,600\n\nAnother trend line on the radar concerns longer timeframes — the 20-month SMA.\n\nRelated: Bitcoin bulls battle to reclaim $30K amid BTC price RSI ‘reset’\n\nThis, Moustache notes, has heralded every previous Bitcoin bull market — a monthly candle close above the 20-month SMA has seen every subsequent candle also close above it until the cycle high. Here again, March 2020 forms a fleeting exception to the rule.\n\n“Imagine being bearish, while $BTC holds above the monthly 20 SMA-line,” Moustache commented.\n\n“Once Bitcoin has closed above it, it has NEVER AGAIN fallen below it, until the cycle top. This is exactly how it was in 2016-2018 and 2019-2021.”\n\nThe 20-month SMA currently sits at $28,585.\n\nBTC/USD annotated chart with 20-month SMA. Source: Moustache/Twitter\n\nAs Cointelegraph reported, downside support remains tied to the 200-week SMA, along with various other daily and weekly trend lines functioning as a line in the sand during Bitcoin’s recent bear market.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmNoYWluYWx5c2lzLmNvbS9ibG9nL2JpdGZpbmV4LWhhY2stcGxlYS1qdWx5LTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitfinex Hack Money Launderers Plead Guilty - Chainalysis Blog",
        "content": "Today, paperwork was filed in the case of Ilya Lichtenstein and Heather Morgan (also known by her rap name Razzlekhan) for their role in laundering the more than 120,000 Bitcoin stolen from Bitfinex in 2016, suggesting the couple will plead guilty in a hearing scheduled for August 3rd. The stolen Bitcoin was valued around $70 million at the time of the theft, but worth over $4 billion at the time of their arrest in February 2022.\n\nAs we covered at the time, U.S. authorities were able to recover over 94,000 of the stolen Bitcoin following a joint investigation by the FBI, IRS-CI, and HSI. On August 9th 2022, in a previously unreported set of transactions, U.S. authorities recovered an additional 12,267 Bitcoin directly from the wallets of the initial theft. And on November 18th 2022, U.S. authorities recovered a further 1,155 Bitcoins. On January 5th, an additional 2.5 Bitcoins was recovered. The second, third, and fourth recoveries bring the amount recovered by U.S. authorities to over 108,068 Bitcoin.\n\nThe arrest and seizure, along with today’s filing, represent another major victory for law enforcement in the fight against cryptocurrency-based crime. We’ve written previously about how important it is for law enforcement to develop the ability to seize criminally-obtained cryptocurrency, and published a guide last year on how cryptocurrency businesses and law enforcement can work together to facilitate seizures. The Bitfinex investigation is a great example of this collaboration.\n\nBelow, we’ll explore how the husband-and-wife duo’s money laundering strategy evolved in the years following the hack, and tell you more about how law enforcement cracked the case.\n\nTracking Bitfinex’s stolen funds\n\nWe constructed the Chainalysis Reactor graph below based on the publicly-available DOJ indictment describing how Lichtenstein and Morgan moved the Bitcoin stolen from Bitfinex. While the information provided in the indictment wasn’t enough to trace the movements of funds to every cryptocurrency service mentioned, the graph below shows how the couple’s money laundering strategy evolved over time. We should also note that while not all of these businesses meet the conventional definition of an exchange, the DOJ indictment refers to all of them as Virtual Currency Exchanges (VCEs) and anonymizes them with simple, numbered labels (VCE 1, VCE 2, etc.), which we’ll also use here.\n\n\n\nThe laundering of the Bitfinex funds had five distinct components, some of which were carried out in overlapping time periods, involving several different cryptocurrency businesses.\n\nComponent 1: The theft\n\nFirst, we see the initial theft: In a series of 2,075 transactions taking place in August 2016, the hacker moved 120,000 Bitcoin from Bitfinex to a wallet we labeled “Bitfinex.com Stolen Funds.” Most of the funds never left that wallet. Directly above the hacker’s wallet, we see that those funds were seized by law enforcement and moved to a new wallet nearly six years later in February 2022.\n\nComponent 2: Using a darknet market as a mixer\n\nIn January 2017, Lichtenstein and Morgan moved a large portion of the funds to the now-defunct darknet market AlphaBay, which the couple essentially used as a mixer by depositing the stolen Bitcoin and withdrawing equivalent amounts. Some funds moved to AlphaBay directly from the initial theft wallet, while others were moved there through intermediary wallets.\n\nComponent 3: Movements to VCEs and first cashouts\n\nSoon after that, Lichtenstein and Morgan moved funds from AlphaBay to four cryptocurrency exchanges, which the indictment refers to as VCEs 1-4. The information provided in the indictment only allows us to show movements to VCEs 1 and 4 on the graph above, but the movements to VCEs 2 and 3 likely look similar. Lichtenstein and Morgan created several different accounts using fake identities at these exchanges to receive the Bitcoin laundered through AlphaBay — in at least some cases, compliance teams at the exchanges were able to detect that the accounts likely belonged to the same person, for instance due to similarities in the email addresses used to register them and overlaps in the IP addresses used to access the accounts. Some of the exchanges froze the accounts due to this suspicious activity, as well as Lichtenstein and Morgan’s inability to verify their identities or the source of the funds.\n\nComponent 4: Mixer usage and more VCEs\n\nBy 2019, AlphaBay had been taken down by law enforcement, so Lichtenstein and Morgan needed a new money laundering method. They began sending funds to a popular mixer, and then on to more VCEs (VCEs 5-10 in the indictment) where they swapped the Bitcoin for other assets, including Monero. Additionally, the pair sent some funds to a precious metals seller via a merchant services provider (labeled BTC PSP 1) in order to swap their cryptocurrency for gold. The indictment details how Lichtenstein and Morgan in some instances attempted to convince exchange representatives that their Bitcoin came from payment for advertising services, even creating a shell corporation to sell the story.\n\nComponent 5: Funds exchanged for cash at VCE 7\n\nFinally, in 2020 and 2021, Lichtenstein and Morgan were able to convert more funds into fiat currency at VCE 7 and move them into a U.S. bank account. The pair was also able to buy gift cards for Walmart and other businesses at VCE 10 — a specialized service devoted to crypto-for-gift card trades rather than a conventional cryptocurrency exchange — using the Bitcoin they’d moved to VCE 10 previously.\n\nBlockchain analysis and traditional police work solved this case\n\nIn the end, the gift card purchases described above provided crucial clues in the investigation. After tracing the initial movements of cryptocurrency, investigators discovered that a personal wallet address beginning with 36B6mu, which had received over $1 million worth of Bitcoin associated with the Bitfinex hack, provided funding for the account at VCE 10 used to purchase gift cards. Agents discovered that the Walmart gift card specifically was redeemed through Walmart’s iPhone app under an account in Heather Morgan’s name. That enabled agents to get a search warrant for Lichtenstein and Morgan’s home and cloud storage accounts, where they found files containing details of the cryptocurrency addresses used to move the stolen funds — including their private keys — along with the false information used to open accounts at cryptocurrency exchanges and plans to acquire fake passports. That discovery enabled investigators to trace the flow of funds in its entirety.\n\nThis case illustrates how blockchain analysis combined with traditional financial investigation techniques can empower law enforcement to solve cryptocurrency-related crime, win convictions, and seize stolen funds — in this case, over $3 billion worth at the time of arrest. We commend the agents at IRS-CI, FBI, and HSI who conducted this investigation, and look forward to working with our customers in the public sector to prevent further theft and abuse of crypto assets.\n\n\n\nThis website contains links to third-party sites that are not under the control of Chainalysis, Inc. or its affiliates (collectively “Chainalysis”). Access to such information does not imply association with, endorsement of, approval of, or recommendation by Chainalysis of the site or its operators, and Chainalysis is not responsible for the products, services, or other content hosted therein.\n\nThis material is for informational purposes only, and is not intended to provide legal, tax, financial, or investment advice. Recipients should consult their own advisors before making these types of decisions. Chainalysis has no responsibility or liability for any decision made or any other acts or omissions in connection with Recipient’s use of this material.\n\nChainalysis does not guarantee or warrant the accuracy, completeness, timeliness, suitability or validity of the information in this report and will not be responsible for any claim attributable to errors, omissions, or other inaccuracies of any part of such material."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjEtanVseS0yMDIzL2FydGljbGVzaG93LzEwMjAwODAwNC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTIxLWp1bHktMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAyMDA4MDA0LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $30,000; XRP, Solana shed up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed in Friday's trade. Bitcoin, Ethereum, XRP , and Cardano were trading with cuts, while BNB Dogecoin , and Polkadot were trading with gains.Bitcoin (BTC) fell 1.1% to $29,820, whereas Ethereum (ETH) was below the 1,900 level. BTC volume stood at approximately $15.1 billion, rising 31.47% in the last 24 hours.The global cryptocurrency market cap was trading lower, around $1.2 trillion, falling 0.91% in the last 24 hours.\"Bitcoin continued to trade below the US$30,000 mark for another consecutive day, influenced by various factors such as investors taking profits and the strengthening of the US dollar,\" Edul Patel, Co-founder and CEO at Mudrex, said.Currently, BTC faces immediate resistance at the US$30,000 level, while support can be found at the US$29,600 level, Edul added.The total volume in DeFi is currently $4.36 billion, 11.8% of the total crypto market 24-hour volume. The volume of all stablecoins is now $33.4 billion, which is 90.38% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $579 billion. Bitcoin's dominance is currently 48.26%, a decrease of 0.09% over the day, according to CoinMarketCap.\"The likelihood of Bitcoin remaining bearish below $30,000 is high, with potential support at $28,900 if it breaks below $29,500. A bullish breakout could push it to $30,000 and even $30,500,\" Sathvik Vishwanath, Co-Founder & CEO, Unocoin, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point to a Neutral sentiment. The Relative Strength Index (14) sits at 50, with a neutral outlook. The Stochastic %K (14, 3, 3) at 16 and the Average Directional Index (14) at 31 indicate a Neutral outlook.\"\"The MACD Level (12, 26), at 189, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 4 and William's Percentage too indicates a Buy sentiment at -83,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.20 hours, IST on July 21, 2023)Bitcoin $29,842 -0.95%Ethereum $1,892 -0.70%Tether $1 -0.02%BNB $242 0.22%XRP $0.7881 -4.53%Cardano $0.3149 -3.53%Dogecoin $0.07204 2.18%Solana $25.31 5.54%Polygon $0.7654 0.13% Litecoin $92.44 -0.24%Polkadot $5.50 4.31%Tron $0.08083 -0.01%Shiba Inu $0.000007784 0.14%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZWxlY3RyZWsuY28vMjAyMy8wNy8yMC90ZXNsYS1hcHBlYXJzLXJlYWR5LXRha2UtYml0Y29pbi1wYXltZW50cy1hZ2Fpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Tesla appears ready to take Bitcoin payments again - Electrek",
        "content": "Tesla appears to be ready to take Bitcoin payments again after briefly doing it a few years ago, but stopping after pressure about going against its mission.\n\nTesla’s history with Bitcoin\n\nEarly in 2021, Tesla invested $1.5 billion in Bitcoin. Shortly after, the automaker started accepting the cryptocurrency as payment on new vehicles.\n\nHowever, a few days later, Tesla took a step back with crypto by removing the Bitcoin payment option. The company noted concerns over the energy needs of the Bitcoin network:\n\nTesla has suspended vehicle purchases using Bitcoin. We are concerned about rapidly increasing use of fossil fuels for Bitcoin mining and transactions, especially coal, which has the worst emissions of any fuel.\n\nThis is a concern that many Tesla community members shared when Tesla first announced its Bitcoin investment, and many were angered by the fact that the company didn’t think about it in the first place.\n\nAt the time, Tesla noted that they were not selling their stake in Bitcoin and that they planned to resume taking Bitcoin payments once the network showed a higher mix of renewable energy.\n\nA year after the initial investment, Tesla’s Bitcoin holding increased to $2 billion, but the cryptocurrency lost a lot of its value in 2022 and the automaker’s position suffered greatly.\n\nLast year, we reported that Tesla was likely down by as much as $500 million on its Bitcoin investment.\n\nHowever, it looks like Tesla might have avoided some of those losses.\n\nWith the release of its Q2 2022 financial results, Tesla confirmed that it sold about 75% of its Bitcoin position:\n\nAs of the end of Q2, we have converted approximately 75% of our Bitcoin purchases into fiat currency. Conversions in Q2 added $936M of cash to our balance sheet.\n\nWith roughly $936 million from that 75% and having sold over $250 million as a sort of stress test early in its investment, Tesla is still likely up on its $1.5 billion investment in the cryptocurrency.\n\nIs Tesla finally going to take Bitcoin payments again?\n\nIt has been two years, and Tesla hasn’t seemed to be taking steps toward bringing back Bitcoin.\n\nNow internet sleuths have spotted that Tesla has added code on its website to accept Bitcoin payment again:\n\nBREAKING:\n\n\n\nTESLA HAS ADDED BITCOIN BACK INTO THEIR CODE FOR PAYMENTS ON THEIR WEBSITE pic.twitter.com/BhRL4C4BK9 — LilMoonLambo (@LilMoonLambo) July 20, 2023\n\nThe integration appears to be through Stripe, but it is still not available as an option on Tesla’s website.\n\nBut it is all over the code on Tesla’s ordering page:\n\nThe move could be due to recent reports stating that now more than half of Bitcoin mining is powered by renewable energy.\n\nIt could help Tesla justify bringing back Bitcoin as a mode of payment on its vehicles."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9taWNyb3N0cmF0ZWd5cy1zdG9jay1wb2lzZWQtYmVuZWZpdC1mcm9tLWJpdGNvaW4taGFsdmluZy1iZXJlbmJlcmctcHJlZGljdHMuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Microstrategy's Stock Poised to Benefit from Bitcoin Halving, Berenberg Predicts - Cryptonews",
        "content": "Microstrategy’s Stock Poised to Benefit from Bitcoin Halving, Berenberg Predicts\n\nSource: AdobeStock / JorgeEduardo\n\nBerenberg Capital has revealed its bullish case for Michael Saylor‘s Microstrategy ahead of the upcoming Bitcoin (BTC) halving event.\n\nIn a recent research note, the investment firm said the Bitcoin halving, scheduled for April 26, 2024, serves as the primary driving force behind the firm’s positive outlook.\n\nBerenberg currently holds a price target of $430 for the Virginia-based software company, a notable increase from its current price of $407.71 per share.\n\nBitcoin halving occurs approximately every four years and is ingrained in the Bitcoin protocol.\n\nIt refers to the reduction in the rate at which new bitcoins are created and awarded to miners for validating transactions. The halving mechanism is designed to control inflation and limit the supply of bitcoins in circulation.\n\nHalving events have significant implications for the supply and demand dynamics of Bitcoin, which can ultimately impact its price.\n\nThe reduction in new coin issuance creates a scarcity effect. With fewer BTC tokens entering the market, the available supply decreases.\n\nIf the demand for Bitcoin remains stable or increases, the reduced supply can lead to upward price pressure.\n\nMicrostrategy Expected to Rally Alongside Bitcoin\n\nGiven the strong correlation between Microstrategy’s stock price and the price of Bitcoin at approximately 90%, Berenberg suggests that Microstrategy’s stock is likely to rally alongside Bitcoin.\n\nSince the start of the year, Microstrategy’s stock has soared by over 181%, according to TradingView. This bullish trend continued on Monday, witnessing a 7% increase and ending the day at $407.71.\n\n“If the historical pattern established by the first three bitcoin halvings continues to play out with the fourth halving, then the pre-halving rally would begin about four months from now,” the firm wrote.\n\n“If a rally were to occur after the fourth halving, and if it were as long-lived as the rallies that occurred after the past couple of halvings, then it would continue until around October 2025.”\n\nThis is not the first time analysts at Berenberg have endorsed Microstrategy due to its massive exposure to Bitcoin.\n\nBack in May, Mark Palmer, an equity research analyst at Berenberg Capital Markets, claimed MicroStrategy is a safer bet compared to Coinbase due to the exchange’s regulatory issues.\n\n“Given the heightened uncertainty that Coinbase faces, we believe investors would be much better served investing in shares of MicroStrategy,” the analyst wrote.\n\nAs reported, the Litecoin (LTC) blockchain’s halving, which is poised to go through in another 21 days, has already positively impacted the price of LTC.\n\nOver the past month, the price of Litecoin has risen by 22%, while its 12-month performance shows an impressive 81% increase.\n\nThis performance has bolstered the confidence of Bitcoin investors who believe that the upcoming halvening event for Bitcoin will have a similarly positive impact on the price of the leading cryptocurrency.\n\nNotably, Bitcoin hit a 52-week high last month after BlackRock, the world’s largest asset manager, filed an application to create a spot Bitcoin ETF."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJlamVjdHMtdHJlbmRsaW5lLWJ0Yy1ob3ctbG93LWdv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin rejects at 21-day trendline — How low can BTC price go? - Cointelegraph",
        "content": "Bitcoin (BTC) failed to hold above $30,000 after the July 20 Wall Street open, with one analyst forecasting a return to range lows.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price sinks through $30,000\n\nData from Cointelegraph Markets Pro and TradingView tracked weak BTC price action after a rejection at the 21-day simple moving average (SMA).\n\nSitting at $30,400, that SMA provided the day’s high for Bitcoin, with the market then retracing its intraday progress entirely.\n\nBTC/USD 1-day chart with 21-day SMA. Source: TradingView\n\nReacting to the market action, Michaël van de Poppe, founder and CEO of trading firm Eight, warned that lower levels could well come next.\n\n“Not breaking the crucial area, seems like we’re going to have another sweep of the low for Bitcoin,” he told his Twitter followers.\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/Twitter\n\nPopular trader Daan Crypto Trades added that volatility could return thanks to rising open interest.\n\nOpen Interest rising sharply near these levels.\n\n\n\nLikely more volatility ahead for #Bitcoin.\n\n\n\nStay safe pic.twitter.com/GqUnaH20Ha — Daan Crypto Trades (@DaanCrypto) July 20, 2023\n\n“#Bitcoin Has been finding support on the bottom of the range and 4H 200MA/EMA,” he continued in a further tweet about the four-hour 200-period moving average and exponential moving average.\n\n“So far, the bounce has not been very convincing yet and the lower timeframes are extremely choppy. $30.5K and $29.5K remain my levels of interest in the short term.”\n\nBTC/USD annotated chart. Source: Daan Crypto Trades/Twitter\n\nOn-chain monitoring resource Material Indicators meanwhile noted the significance of the 21-day SMA, suggesting that a temporary peak may be in for BTC/USD.\n\n“A hard rejection from technical resistance at the 21-Day Moving Avg and more asks stacking at $31k could indicate things are getting toppy for the moment,” part of the July 20 analysis read.\n\n“Bulls need to regroup here and gather the herd if they want a legit chance to stampede past those sell walls.”\n\nA prior print of the Binance BTC/USD order book showed a lack of bid liquidity immediately below the $30,000 mark.\n\nBTC/USD order book data for Binance. Source: Material Indicators/Twitter\n\nLabor market data boosts U.S. dollar\n\nMacroeconomic events on July 20 meanwhile focused on strong tech earnings along with a slowdown in United States jobless claims.\n\nRelated: Bitcoin traders say ‘get ready’ as BTC price preps 2023 bull market\n\nThe impact on the U.S. dollar was pronounced, with the U.S. Dollar Index (DXY) gaining ground to near 101 for the first time in several days.\n\n“So today, Initial Jobless Claims was less than previous & forecasted so the trajectory expected for increasing layoffs is slower (lower is good for USD),” popular trader Skew wrote in part of a response.\n\nU.S. dollar index 1-day chart. Source: TradingView\n\nCointelegraph previously wrote about the changing dynamics between BTC price performance and DXY strength.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvd2ViMy1nYW1lci1lYXJuLWJpdGNvaW4tbWluZWNyYWZ0LXNlZ2EtYmxvY2tjaGFpbi1wbGFucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Web3 Gamer: Earn Bitcoin in Minecraft, BGA's 50/50 gender split, Oath of Peak hot take - Cointelegraph",
        "content": "Minecraft gets the Bitcoin treatment\n\nIt seems like Minecraft has been around since the invention of computers, and there is a reason for that. Along with its official free updates, which provide extra content, the Minecraft ecosystem has an incredibly active community, helping it stay up to date. Thanks to the game’s open-ended gameplay, there is tons of community-built content available to enjoy.\n\nHave you finished the standard content of the game? Then why not relive the industrial revolution with custom-built mods? Or enter a competition to see who can build a construction first against hundreds of others? There is a server for that. Pokemon in Minecraft? Pixelmon!\n\nAnd if you want to earn Bitcoin in Minecraft? Welp, you can even do that now.\n\nPlayers can earn Bitcoin in Minecraft with the partnership between Zebedee and Satlantis. (Zebedee)\n\nA community-operated Minecraft server by the name of “Satlantis” has integrated Zebedee’s gaming tech that lets players earn Bitcoin by completing in-game quests inspired by real-life BTC mining. Players in the server can join in-game mining pools, collect ASICs (popular hardware tailored for Bitcoin mining) and increase their hash rate to win block rewards. What a cool way to educate traditional gamers on the basics of Bitcoin!\n\nPlayers can withdraw their earnings to Zebedee’s app, where they can spend their gains on other games made by the company or move them to exchanges that support Bitcoin’s layer-2 Lightning Network.\n\n@Minecraft, meet #Bitcoin 🟧🧡\n\n\n\nIntroducing @PlaySatlantis, where you can earn real bitcoin in the world's most popular game.\n\n\n\nAll powered by the #ZEBEDEEapi\n\n\n\n🦾⚡Supercharge your creation w/ the power of Bitcoin & get started w/ ZEBEDEE for free today:https://t.co/PRAH5i4EVM pic.twitter.com/WBDwepIJg3 — ZEBEDEE (@zebedeeio) July 10, 2023\n\nDon’t get your hopes up for buying a Lambo with your earnings from building pixelated wonders. The server will give out a total of 1 million satoshis — equal to one hundred millionth of a BTC — per week. That’s around $300 per week divided by God-only-knows how many people. While it isn’t much, it’s a start that could become a trend.\n\nThe Bitcoin-friendly integration is an unofficial one, and neither Satlantis nor Zebedee is affiliated with the Minecraft developer Mojang Studios. The studio itself is pretty down on Web3, having previously banned Minecraft NFT integrations. Time will show how this integration fairs against the ban.\n\nBlockchain Game Alliance ramps up diversity efforts\n\nDiversity is a surprisingly new topic in the world of video games. Most major publishers had not even released a diversity report as recently as 2021. In 2022 Activision Blizzard gave itself five long years to meet its goal of 50% women and non-binary employees.\n\nMembers of the Blockchain Game Alliance, a key organization promoting Web3 and blockchain gaming, voted to install a gender-balanced board, with three men and three women. And the newly elected BGA board of 2023 is made up of all new faces.\n\nBlockchain Game Alliance 2023 board members. (BGA)\n\nThey are Leah Callon-Butler, director of consulting firm Emfarsis; Yasmina Kazitani, chief marketing and partnerships officer at Interverse; Christina Macedo, co-founder and chief operating officer at Ready gg; Hideaki Uehara, director of business development at Square Enix; Mariano Rubinstein, CEO and co-founder at Sura Gaming; and Alex Kosloff, head of business development at Altura.\n\nAs an avid gamer, I will be watching with interest to see if the make-up of the new board can help progress and innovation across the Web3 gaming space.\n\nSega not a fan of P2E but developing a blockchain game\n\nThe makers of all-time favorite franchises Sonic and Yakuza have had an on-again, off-again relationship with blockchain technology. Sega announced plans for NFTs as play-to-earn (P2E) rewards last year. Later, they stepped off the gas after a backlash from fans, who considered the initiative a money grab.\n\nThis year, Sega is also walking both sides of the street. Shuji Utsumi, co-chief operating officer at Sega, called blockchain games “boring” and said the Japanese gaming giant wouldn’t be using its biggest titles in blockchain gaming projects.\n\nHowever, Sega has announced a partnership with Line Next to bring its classic games to GAME DOSI, a Web3-friendly blockchain gaming platform. In light of this announcement, Utsumi clarified that investing in Web3 projects is within the company’s strategy but that they don’t intend to be a Web3 company but rather a “Web 2.5” one.\n\nLINE NEXT partners with SEGA to license and bring a classic game to the Web3 gaming platform GAME DOSI. (LINE)\n\nAs everyone’s aware, the mainstream gaming community is unenthusiastic about blockchain games and sees them as a temporary trend fueled by hype and speculation. Players are concerned about money grabs and the short lifespans of Web3 games, so it’s understandable Sega doesn’t want to put its big titles in an area where it has little-to-no experience.\n\nWhile some skepticism is warranted, it doesn’t mean blockchain technology won’t ever find its footing in the gaming industry. Multi-billion-dollar tech companies are aware of the possibilities Web3 gaming brings and know the importance of getting in on the ground floor.\n\nSega’s decision to test the water with its smaller IPs is a thoughtful and measured approach that respects its legacy while navigating the uncharted terrain of Web3 gaming.\n\nStudio’s $15M funding from Binance Labs for Web3 dino game\n\nBinance’s venture capital and incubator arm Binance Labs has invested $15 million in Web3 gaming startup Xterio. The company labels itself as a “free-to-play-and-own” game developer and publisher, meaning the games are free to play, and players are able to earn and keep NFTs. In August last year, it raised $40 million in funding from investors, including FunPlus, XPLA and now-extinct FTX Ventures.\n\nXterio seems to have a lot of experience on the gaming front, with Web2 gaming industry veterans on its founding executive team from companies including Ubisoft, Krafton and NetEase. There are 11 games in its repertoire, ranging from Age of Dino — a massively multiplayer online 4X (explore, expand, exploit, and exterminate) strategy game that features dinosaurs — to Overworld, a cross-platform sandbox RPG with anime-inspired graphics.\n\nXterio is developing an “emotion engine for AI,” with an aim to enhance player immersion by equipping game characters with realistic and dynamic emotional responses — The Matrix and the whole AI takes-control scenario were way ahead of their time.\n\nOverworld promotional art. (Xterio)\n\nThe company uses AI very actively as they host an AI toolkit for developers and are creating a digital companion game called AIpal which is entering its beta phase later this year.\n\nHot take — Oath of Peak\n\nThe undeniable success of Genshin Impact — a Chinese MMORPG with cute graphics and fast-paced action that was released on virtually every platform except Casio Scientific Calculator — sparked off a trend of introducing every possible bit of Chinese mythology to Western audiences among developers.\n\nOath of Peak promotional art. (Oath of Peak)\n\nOath of Peak, an action MMORPG game that diversifies with its Web3 elements, seems to capitalize on that itch. Available on iOS and Android platforms as a free download, the game offers an epic world that’s easy to get familiar with, thanks to its cute graphics.\n\nSimilar to other massively multiplayer games, players can pick from five different classes with fully customizable avatars. The game offers melee, assassin, ranger, mage and support characters — nothing groundbreaking.\n\nWith the recently-added English language support, it wasn’t hard to find my way around the colorful island. After completing some quests, I realized one cool thing about the game: it doesn’t shove its Web3 features at the player. Sure, the game has NFT monsters and a utility token that’s exchangeable with in-game currency, but it doesn’t become prominent until after players are invested in the game in terms of time and effort.\n\nIf you are in the market to check some new games with familiar mechanics, it’s worth taking a look at Oath of Peak, now available globally via app stores or its APK. It’ll only take 15-20 minutes for you to understand whether it’s a game for you or not anyway.\n\nMore from Web3 gaming space:\n\n— Eyeball Games, led by the team behind Miniclip’s 8 Ball Pool, has announced the launch of their blockchain-based mobile game, Eyeball Pool, on the Immutable platform in early 2024.\n\n— Polygon Labs’ president, Ryan Wyatt, is transitioning to an advisory role after over a year with the company. Polygon’s chief legal officer, Marc Boiron, will succeed Wyatt as the new CEO.\n\n— MetaGalaxy Land introduced the pre-alpha version of its metaverse platform, which utilizes Unreal Engine 5.\n\n— Major League Baseball became one of the first professional sports leagues to own a virtual world. Improbable, a metaverse tech firm, announced the new virtual space called “MLB virtual ballpark.”\n\n— Immutable has introduced OBS, its first Web3 racing game, as the latest addition to its game lineup.\n\n— Telescope Labs launched a comprehensive range of AI-driven solutions tailored for Web3 gaming, empowering gaming enterprises with the necessary resources to construct robust virtual economies.\n\n— Sweat Economy, a move-to-earn initiative, has revealed the introduction of Sweat Hero, an in-app game and NFT experience within their platform."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbmdlZWsuY29tL3VrLWNvdXJ0LW9mLWFwcGVhbC1ydWxlcy1jcmFpZy13cmlnaHQtY29weXJpZ2h0LWNsYWltLW92ZXItYml0Y29pbi1maWxlLWZvcm1hdC1jYW4tcHJvY2VlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "UK Court of Appeal rules Craig Wright's copyright claim over Bitcoin file format can proceed - CoinGeek",
        "content": "Dr. Craig Wright notched another win in the United Kingdom’s Court of Appeal today, as the court granted Dr. Wright’s appeal over his copyright in the Bitcoin file format. As a result, his copyright and database rights case against the BTC partnership—which includes Core developers and entities within the ecosystem such as Coinbase (NASDAQ: COIN)—will proceed on all fronts.\n\nDr. Wright had originally sued the BTC partnership which includes 26 defendants all of whom are involved in the use or promotion of the BTC network, arguing that the two airdrops which effectively carved out the BTC network from the original Bitcoin were breaches of his copyright in the Bitcoin white paper and the Bitcoin file format, and had additionally amounted to breaches of his database rights in the Bitcoin blockchain. Given how much of the industry went on to revolve around this new BTC, a finding that its creation was a breach of Dr. Wright’s rights has the potential to alter the digital asset industry forever.\n\nThe High Court allowed the suit to be served on the defendants with respect to the copyright claim in the white paper and the database rights claim in the Bitcoin blockchain. However, the judge found that there was no serious issue to be tried in respect of the Bitcoin file format claim, finding that the Bitcoin file format was not defined with sufficient precision and objectivity in order to be subject to copyright—a requirement known as ‘fixation.’\n\nToday, the court of appeal unanimously overruled the lower court. They found that the lower judge had ‘several flaws’ in his reasoning, beginning with the finding that Dr. Wright had failed to identify any relevant ‘work’ which defines the structure of the Bitcoin file format:\n\n“The work Dr. Wright relies upon, the Bitcoin File Format, has been clearly identified. The question of how and when that work was fixed is a different one. Dr. Wright’s case is that the work was fixed when the first block in the Bitcoin blockchain was written on 3 January 2009.”\n\nThe Court of Appeal went on to say that there was no requirement that there be additional content defining or describing the format in order for ‘fixation’ to be established. They agreed with Dr. Wright’s argument—which was rejected by the lower court—that third parties have been able to deduce the structure comprising the Bitcoin file format from the blockchain and thus proved that the work was identifiable with sufficient precision and objectivity.\n\nDamon Parker of Harcus Parker, which represents Dr. Wright, said:\n\n“We welcome this significant ruling which enables Dr. Wright to advance his claim for copyright in the Bitcoin File Format which potentially affects all future use, and marketing, of Bitcoin and will prove to be a crucial development in intellectual property law.”\n\nDr. Wright said in a statement:\n\n“I am pleased with the outcome of this appeal. As many developers do not fully document their entire body of work, this appeal shows that, even without documentation, their work is still considered to be capable of copyright protection.”\n\nThe Court of Appeal’s judgment is a powerful one. Though the Justices were only considering whether Dr. Wright’s claim had a serious prospect of success, the ruling nonetheless amounts to an encouraging rubberstamp from the second-highest court in the country. Now, all three limbs of Dr. Wright’s lawsuit against the BTC partnership will be in play when the case eventually goes to trial. All 26 BTC Core defendants will have to defend against the claim that they breached Dr. Wright’s copyright in the Bitcoin white paper; that they breached his copyright in the Bitcoin file format; and that they breached his rights in the Bitcoin database.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWNhc2gtaXMtYS1iZWFyaXNoLXRha2VvdmVyLW9uL9IBQGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWNhc2gtaXMtYS1iZWFyaXNoLXRha2VvdmVyLW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Cash: Is a bearish takeover on? - AMBCrypto News",
        "content": "Disclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion.\n\nThe bullish rally continued to wither, as BCH dipped below $250.\n\nShorts held a 52.21% advantage on the exchange long/short ratio.\n\nBitcoin Cash [BCH] went on a remarkable bullish rally in late June that launched it to a 2023-high of $329. However, July brought a change of fortunes for BCH, as bears formed a resistance level at $311 which led to a 30% dip.\n\nRead Bitcoin Cash’s [BCH] Price Prediction 2023-24\n\nWhile buyers are still up significantly, sellers can advance the bearish momentum with its price currently trading below $250. BCH bulls could see more of their gains erased if Bitcoin [BTC] continues its price correction under $30k.\n\nSellers primed to flip price momentum\n\nThe on-chart indicators hinted at a change in momentum for BCH. The Relative Strength Index (RSI) remained under the neutral 50 and continued to edge toward the oversold zone. The Chaikin Money Flow (CMF) also stayed negative with a reading of -0.14. Collectively, the indicators revealed declining buying pressure and strong capital outflows.\n\nThe 12-hour timeframe showed that bears had broken below the key $248 support level. With declining volume, bulls could lose more ground with sellers looking to drive the price to the $186 – $220 level.\n\nNonetheless, another rally by BTC to $31k could prop up Bitcoin Cash at the current support level with bulls able to target the $280 price level.\n\nShorts hedge bets on further dips\n\nHow much are 1,10,100 BCH worth today?\n\nAccording to Coinglass’ long/short ratio, shorts had a greater share of the open contracts for BCH. Shorts had a 52.21% share compared to longs 47.79% share. This reinforced the bearish sentiment in the futures market.\n\nThis could see sellers extend their gains toward the critical $186 – $220 level, especially with Bitcoin continuing to trade below $30k in the meantime."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMitwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bHktMjEtY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tc29sLXJpcHBsZS1zdGVsbGFyLTFpbmNoLTE2MTczNzbSAbsBaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1qdWx5LTIxLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXNvbC1yaXBwbGUtc3RlbGxhci0xaW5jaC0xNjE3Mzc2L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum, Other Top Coins In Doldrums, Chainlink Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency, failed to rise above the $30,000 mark early Friday. Other popular altcoins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Ripple (XRP), Litecoin (LTC), and Solana (SOL) — saw minor dips across the board. The Chainlink (LINK) token became the top gainer, with a 24-hour jump of over 18 percent. Rocket Pool (RPL), on the other hand, emerged to be the biggest loser, with a 24-hour loss of over 6 percent.\n\nThe global crypto market cap stood at $1.21 trillion at the time of writing, registering a minor 24-hour gain of 0.01 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $29,895.37, registering a 24-hour loss of 0.20 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 25.69 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,896.72 marking a 24-hour loss of 0.04 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.62 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 1.69 percent, as per CoinMarketCap data, currently priced at $0.07166. As per WazirX, Dogecoin price in India stood at Rs 6.19.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.40 percent. At the time of writing, it was trading at $92.59. LTC price in India stood at Rs 8,089.61.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.7925, seeing a 24-hour loss of 5.06 percent. As per WazirX, Ripple price stood at Rs 69.19.\n\nSolana (SOL) Price Today\n\nSolana price stood at $25.44, marking a 24-hour dip of 4.29 percent. As per WazirX, SOL price in India stood at Rs 2,230.\n\nTop Crypto Gainers Today (July 21)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nChainlink (LINK)\n\nPrice: $8.25\n\n24-hour gain: 18.41 percent\n\nMaker (MKR)\n\nPrice: $1,164.71\n\n24-hour gain: 15.24 percent\n\nSynthetix (SNX)\n\nPrice: $3\n\n24-hour gain: 9.95 percent\n\nCompound (COMP)\n\nPrice: $75.39\n\n24-hour gain: 8.62 percent\n\nPolkadot (DOT)\n\nPrice: $5.65\n\n24-hour gain: 7.65 percent\n\nTop Crypto Losers Today (July 21)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRocket Pool (RPL)\n\nPrice: $30.77\n\n24-hour loss: 6.23 percent\n\nMultiversX (EGLD)\n\nPrice: $33.84\n\n24-hour loss: 5.66 percent\n\nRipple (XRP)\n\nPrice: $0.7958\n\n24-hour loss: 4.71 percent\n\nSolana (SOL)\n\nPrice: $25.55\n\n24-hour loss: 3.97 percent\n\nHedera (HBAR)\n\nPrice: $0.05642\n\n24-hour loss: 3.64 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has persisted below the $30,000 threshold for yet another consecutive day, influenced by various factors such as investors taking profits after a rally and the US dollar's strengthening. At one point, BTC even dropped to a one-month low of $29,500. Currently, BTC faces resistance at the $30,000 level and finds support at $29,600. Apart from Bitcoin, XRP and Ethereum have also experienced value declines. On a positive note, LINK's performance has managed to avoid a downturn. Furthermore, a notable development is the United States government introducing a new bill to regulate digital assets, potentially impacting the future of cryptocurrencies.”\n\nShubham Hudda, Senior Manager, CoinSwitch Markets Desk, said, “BTC, for another day, traded flat while altcoins registered some significant developments. LINK (+17.3 percent) is making a big move after launching its CCIP (Cross-Chain Interoperability Protocol). Good moves in other prominent DeFi tokens like MKR (+8.38 percent), SNX (+5.96 percent), and COMP (+5.29 percent) underline that the current market interest is around accumulating quality DeFi protocols before Bitcoin coves out of its tight range of trading.”\n\nRajagopal Menon, Vice President, WazirX, offered his take, “The overall market sentiment remains neutral even as prices for Bitcoin and Ethereum decreased. The macroeconomic factors and equity markets results have had little impact on user sentiment. Altcoins continue their popularity streak even amidst price volatility.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin is currently hovering slightly above the important $29,500 support level, bolstered by a triple bottom pattern on the four-hour time frame. Technical indicators such as RSI (39) and MACD (-5) indicate bearish sentiment. The 50-day exponential moving average acts as resistance around $29,995. The likelihood of Bitcoin remaining bearish below $30,000 is high, with potential support at $28,900 if it breaks below $29,500. A bullish breakout could push it to $30,000 and even $30,500. If demand increases, a break of $30,450 could lead to a rally towards further resistance at $31,200. Watching the $29,500 level is vital as it could indicate a buying opportunity above or quick selling positions if breached.”\n\nShivam Thakral, the CEO of BuyUCoin, said, “The entire volume of the cryptocurrency market increased by an amazing 19.70 percent over the past day to reach an astounding $37.46 billion. Ripple's XRP, the third-largest cryptocurrency, gained 6.8 percent, while native cryptocurrencies Cardano, Solana, ADA, and SOL surged over 6 percent, outpacing Bitcoin and Ether. With a value of $29,905.69, Bitcoin continues to play a significant role in this rollercoaster. These numbers demonstrate the potential of the cryptocurrency sector and its indisputable influence on the financial landscape, which presents opportunities and difficulties for both investors and enthusiasts.”\n\nCoinDCX Research Team told ABP Live, “Bitcoin is holding a key support above $30,000 with a record-breaking accumulation of 5,92,000 BTCs worth $17.8 billion at the $30,200 level as per Glassnode, suggesting that investors are confident that BTC will continue to hold above this level. However, BTC dominance is close to its 1-month low, as investors are shifting their focus to smaller, riskier tokens. One such token is XRP, which has surpassed Bitcoin in trading volume after a court ruling determined that it is not a security.”\n\nSubscribe And Follow ABP Live On Telegram: https://t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL3d3dy5ub3RlYm9va2NoZWNrLm5ldC9UZXNsYS1jb3VsZC1hZGQtQml0Y29pbi1hbmQtRG9nZWNvaW4tcGF5bWVudC1tZXRob2RzLWFzLVR3aXR0ZXItc25vb3AtcmV2ZWFscy1zZXZlcmFsLW1lbnRpb25zLW9mLWNvbnRyb3ZlcnNpYWwtY3J5cHRvY3VycmVuY2llcy1pbi1zaXRlLWNvZGUuNzM1NDgxLjAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Tesla could add Bitcoin and Dogecoin payment methods as Twitter snoop reveals several mentions of controversial ... - Notebookcheck.net",
        "content": "After shelving Bitcoin as a payment method due to criticism over environmental concerns, it appears that Tesla may start accepting the cryptocurrency as payment for its electric vehicles in the near future. The site's code also makes mention of Dogecoin, which is Elon Musk's favourite crypto flavour. The company has not announced any intentions to resume Bitcoin payments just yet.\n\n4 Reviews\n\nTesla, and its CEO, Elon Musk, have a bit of a sordid history when it comes to cryptocurrency, but it has been a while since the electric car company has accepted Bitcoin as payment for orders. Now, it appears that Tesla may start accepting Bitcoin in the near future once more, if Twitter user @LilMoonLambo's discovery is to be believed.\n\nIn a tweet posted to the social media site, @LilMoonLambo reveals that Tesla has added code that enables Bitcoin payments back into the design of its website. This is not a concrete indication that Tesla will accept Bitcoin, but it would be odd to code the feature into the website again if it didn't plan on using it.\n\nInspecting the Tesla order site and searching for \"Bitcoin\" reveals numerous mentions of the cryptocurrency throughout the payments page. Somewhat comically, doing the same thing with \"Dogecoin\" as the search term also reveals numerous mentions throughout the payments page.\n\nGiven the reasons Bitcoin fell out of favour for the EV maker, it's unlikely the brand would resume using Bitcoin, much less Dogecoin. That said, Tesla appears to be making a number of sweeping changes to its strategy, with recent changes to its EV pricing putting intense pressure on other electric vehicle manufacturers. The widespread adoption of its NACS charging hardware and the Supercharger licensing that goes hand-in-hand with NACS may be another strategy to diversify the company's revenue streams.\n\nBuy a Hot Wheels RC 1:64 Scale Tesla Cybertruck Rechargeable Radio-Controlled Racing Car on Amazon."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5uZXdzMTguY29tL2J1c2luZXNzL2NyeXB0b2N1cnJlbmN5L2NyeXB0b3MtcmVib3VuZC1hZnRlci01LWRheXMtb2YtZmFsbC1jaGVjay1sYXRlc3QtYml0Y29pbi1ldGhlci1kb2dlLXByaWNlcy1vbi1qdWx5LTE5LTgzNzI5NjUuaHRtbNIBlgFodHRwczovL3d3dy5uZXdzMTguY29tL2FtcC9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9jcnlwdG9zLXJlYm91bmQtYWZ0ZXItNS1kYXlzLW9mLWZhbGwtY2hlY2stbGF0ZXN0LWJpdGNvaW4tZXRoZXItZG9nZS1wcmljZXMtb24tanVseS0xOS04MzcyOTY1Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Cryptos Rebound After 5 Days Of Fall: Check Latest Bitcoin, Ether, Doge Prices On July 19 - News18",
        "content": "Cryptocurrency Prices Today, July 19: The cryptocurrency market on Wednesday rebounded after five days of consecutive fall. Bitcoin rose 0.47 per cent, Ethereum was up 0.84 per cent, Dogecoin jumped 0.17 per cent and Ripple surged 7.66 per cent.\n\nShubham Hudda, senior manager, CoinSwitch Markets Desk, said, “Popular altcoins like XRP (+8.3%), XLM (+5.68%), and SNX (+4.58%) have shown some strength at the back of their recent developments. XRP pump can be attributed to the recent SEC lawsuit verdict while XLM, being a fork of XRP, is also gaining investor attraction. SNX however seems to gain from the recent from the recent CCIP integration on LINK (-2.28%).”\n\nHe added that the crypto market has been range-bound in the last 24 hours. The global crypto market capitalisation continues to remain at $1.25 trillion. The crypto fear and greed index, down 6 points, has now entered the neutral zone with a score of 50/100.\n\nBTC had its 5th consecutive red day as the price traded below $30k for most of the last 24-hour period.\n\nMeanwhile, Binance has integrated Lighting Network on Bitcoin withdrawals which has reduced the BTC withdrawal fees by more than 90%; from close to a few dollars to a few cents. This may further BTC’s adoption as transferring BTC will become cheaper.\n\nCrypto prices on CoinSwitch on July 19 (as of 10 am):\n\nBitcoin (BTC): INR 25,82,331.00 (+0.47%)\n\nEthereum (ETH): INR 1,65,841.00 (+0.84%)\n\nPolygon (MATIC): INR 65.31 (-1.92%)\n\nDogecoin (DOGE): INR 6.05 (+0.17%)\n\nTether (USDT): INR 85.85 (-0.39%)\n\nRipple (XRP): INR 67.72 (+7.66%)\n\nCardano (ADA): INR 28.11 (+5.01%)\n\nSolana (SOL): INR 2,263.13 (0.64%)\n\nLitecoin (LTC): INR 8,184.00 (+1.69%)\n\nBinance Coin (BNB): INR 21,388.62 (+0.18%)."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmV1cm9wZWFuYnVzaW5lc3NyZXZpZXcuY29tL2JpdGNvaW4tdnMtZ29sZC1tYXJrZXQtY2FwLXdpbGwtYml0Y29pbi1iZWNvbWUtdGhlZ29sZC0yLTAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Vs Gold Market Cap: Will Bitcoin Become the Gold 2.0? - The European Business Review",
        "content": "Bitcoin, the world’s first cryptocurrency, has attracted tremendous attention in recent years. Often referred to as “digital gold,” it has attracted many investors who see it as a way to diversify their wealth and secure their financial future. But the question remains: will Bitcoin ever outperform Gold’s market cap? Can it be the Gold 2.0?\n\nBitcoin Market Cap Vs Gold Market Cap\n\nFirst, it is important to understand what market cap is. Market cap is calculated by multiplying the total number of coins or tokens in circulation by the current market price. If a cryptocurrency has 1 million coins in circulation and is traded at $1 per coin, its market cap would be $1 million. Gold market capitalization is calculated by multiplying the total amount of gold in circulation by the current price of gold.\n\nIn 2021, Bitcoin’s market cap peaked at around $1 trillion, while gold’s market cap was around $11 trillion. Even when Bitcoin was at its best in history, it still had a long way to go to outperform gold. Bitcoin is currently trading at a market cap of $512 Billion as at this writing and Gold at $13 Trillion. Bitcoin needs to increase in price by a factor of 26 to be hot on the trail of gold.\n\nBitcoin critics like Peter Schiff in particular have always argued against a further increase in the price of Bitcoin. It is often argued that Bitcoin is still a very young and untested concept compared to gold. It has yet to prove itself to be a stable and reliable investment option, and it remains unclear how it will fare in economic downturns or other challenges.\n\nHowever, not everyone shares Peter Schiff’s opinion. Even his son, @SchiffSpencer, invests in Bitcoin.\n\nThe Digital Gold\n\nThere are many Bitcoin supporters who believe that the cryptocurrency will one day surpass gold’s market cap. They see it as an alternative investment option that deviates from traditional investment options and offers investors new opportunities. Bitcoin utility also trumps gold’s in some aspects.\n\nGold is certainly not suitable for everyday use; whether it be to clear a shopping cart on an online store or quick payment for a quick bite at Chick Fil a. Bitcoin isn’t really there yet either, but it clearly has potential. Many companies and online stores now accept Bitcoin as a valid means of payment and this will surely contribute to its worldwide acceptance as time goes.\n\nOne factor that could contribute to Bitcoin’s growth is the increasing adoption of cryptocurrencies by governments, businesses, and consumers. In recent years, some governments have already taken steps to regulate and integrate cryptocurrencies, and these efforts are expected to increase further in the future.\n\nAccording to Prof. Dr. Philipp Sandner: “Cryptocurrencies are a vehicle with excellent prospects for the future. They have the potential to overtake conventional financial products while providing more efficiency, less bureaucracy, and more transparency.” While this is not a general take and it is ‘just’ an opinion, investors have a real knack for taking risks and Bitcoin is considered by many as a risk worth taking.\n\nWe are in the digital age, and the most common investment among Gen Zs is cryptocurrency. A study by the Bank of America says that about 47% of wealthy young US investors invest in cryptocurrency. This is significant.\n\nBitcoin Vs Gold: The ‘Why’\n\nExperts have opposing opinions on what the future holds for Bitcoin and whether or not it will outperform gold’s performance. Comparisons between Bitcoin and gold are common and have grown over the years.\n\nBut what do Bitcoin and gold have in common that put them in the same category?\n\nWhy is everyone suddenly drawing parallels between a physical precious metal and a digital currency?\n\nThe truth is that, although there are quite marked differences between the two, Bitcoin and gold have several similarities that justify the comparison. One of these is the fact that investors see both assets as a kind of “bearer asset,” that is, a financial instrument that is transferred through possession without the need for formal registration of ownership. Thus, if you hold it, you own it. They are also both ‘sound money’ that maintains their value and purchasing power over time.\n\nGold has long been considered a crisis-proof currency, but the market’s leading cryptocurrency earned the name Digital Gold in 2020. It mirrored the trajectory of the precious metal and began to emerge as a potential store of wealth as the global economy faltered against the backdrop of the coronavirus pandemic.\n\nBitcoin, like Gold, also has a limited supply, which prevents excessive asset creation and therefore prevents runaway inflation as we see with fiat currencies. This is in addition to not being controlled by any government or central authority.\n\nAnd, let’s face it, the consensus that Bitcoins fulfill the functions of money as a “unit of value” and “means of exchange” is more than justified, with only the function of “store of value” remaining controversial. There are those who argue that gold has intrinsic value and real utility, unlike Bitcoin. However, only 7.5% of circulating gold is used for industrial purposes. The remainder is used for jewelry making, purchases for investment, and bank reserve purposes, which strongly weakens the “utility” argument.\n\nIn summary, gold is mostly priced and valued based on its speculative nature as a stable reserve of value against inflation. In this sense, it is practically indistinguishable from Bitcoin which has as its intrinsic utility embedded in its function as a peer-to-peer and decentralized transaction network.\n\nBitcoin or Gold: Which Should Invest In?\n\nAlthough both have been placed in the same category of “protection assets against inflation,” mainly with the collapse of the US banking system driving the search for assets with strong monetary appeal and “footprint” of the store of value, they are quite far apart from a practical investment point of view.\n\nThe first notable difference is that gold is seen as a more conservative investment and/or as a “risk-free” asset, while Bitcoin still exhibits sharp fluctuation in price and extreme volatility – thus, a lot of attributed risk. Bitcoin plunged more than 60% of its value in late 2022 and is only now recovering. Critics say, “so much for store of wealth.”\n\nHowever, we must take into account that Bitcoin is still extremely new and we are still “early adopters.” There is no way to expect stability from an asset on the rise and at the beginning of its S-curve adoption phase. There is usually a process of speculation, usually accompanied by rejection, fear, and, finally, understanding and study until the masses start to feel confident to invest and accept a new idea.\n\nSo does Bitcoin have what it takes to become Gold 2.0?\n\nPerhaps when answering this question one should not think in terms of finding a winner, but rather in terms of knowing both assets for the function they both serve.\n\nBitcoin has barely lasted a decade while Gold has been here for ages. Therefore, issues such as ‘trust’ or ‘security’ are under scrutiny of course. However, while these are essential aspects for means of payment or financial investment, what the future holds for Bitcoin remains exciting.\n\nFAQ\n\nCan Bitcoin Replace Gold?\n\nNot yet. Bitcoin still needs to prove itself as a sure-proof store of wealth against an asset that has existed for centuries. Bitcoin market cap will equal Gold’s when 1 BTC is approximately $500,000 – and experts don’t think this will happen soon.\n\nIs There a Correlation Between BTC and Gold?\n\nYes. Bitcoin’s price chart somewhat correlates with Gold’s. Their correlation currently stands at 50% according to Yahoo.\n\nIs it Better to Invest In Gold or Bitcoin?\n\nBitcoin is more volatile than Gold and therefore gives significantly more returns on investment. However, increased volatility means increased risk. Digital assets like Bitcoin can appeal to potential investors. Overall, you should invest according to your risk tolerance and appetite.\n\nMore information about markets and utilities for web 3.0 here\n\nGo to top\n\nDisclaimer: This article contains sponsored marketing content. It is intended for promotional purposes and should not be considered as an endorsement or recommendation by our website. Readers are encouraged to conduct their own research and exercise their own judgment before making any decisions based on the information provided in this article.\n\n\n\n"
    }
]