[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3N1c3RhaW5hYmlsaXR5L2ZlYXR1cmUvVGhlLWVudmlyb25tZW50YWwtaW1wYWN0LW9mLWJpdGNvaW4tbWluaW5nLWV4cGxhaW5lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "The environmental impact of bitcoin mining explained - TechTarget",
        "content": "For those who chase innovation or who are looking for a new way to make money, cryptocurrencies such as bitcoin may seem like an exciting but innocuous new tech. For those assessing the environmental impact of cryptocurrencies, however, the technologies are far from benign.\n\nIndeed, mining for bitcoin and other cryptocurrencies is antithetical to climate progress. This is due to the technologies' massive energy needs and resulting pollution. Understanding these issues and why activists and legislators are pushing for change is important for anyone concerned with ensuring a livable planet.\n\nThe number of bitcoin owners is just 3.4% of the worldwide population, or 267 million people as of June 2023, according to Crypto.com, a cryptocurrency exchange company based in Singapore.\n\nYet the currency has an outsized impact on the environment.\n\nHow does bitcoin mining and cryptomining work? To understand the environmental impact of cryptocurrency mining, particularly bitcoin mining, requires first understanding what cryptocurrency is and how the mining process works. A cryptocurrency -- such as bitcoin -- is a type of decentralized digital currency that can support international transactions, micropayments and peer-to-peer transactions. Some businesses and individuals accept cryptocurrency as a form of payment for goods and services, among other benefits and challenges. The underlying technology relies on blockchain, which is a digital record-keeping system simultaneously available in multiple locations, called nodes, within the network. Cryptocurrencies, like Bitcoin, don't rely on a central authority to oversee or regulate transactions. Instead, they use complex encryption techniques called cryptomining to secure and verify transactions and control the creation of new units. The environmental impact of cryptocurrency mining -- and Bitcoin mining, in particular -- is largely due to the main cryptomining approach in use called proof of work (PoW). The process requires a massive amount of computing power, as miners use complex algorithms and energy-intensive hardware and software to confirm transactions. To solve bitcoin's PoW system, miners compete to solve an encrypted puzzle within each block. The miners use specialized software to solve for the mathematical puzzle via trial and error, guessing until they get it right. Bitcoin miners are awarded a certain number of bitcoin for solving these puzzles, essentially being paid to do the validation work that enables the whole system. The PoW structure rewards miners who have the most powerful computers, since they can make more attempts in a shorter amount of time, making them more likely to solve the puzzle and earn bitcoin as a reward. A less-frequently used cryptomining approach is also in use. Proof of stake (PoS) requires significantly less energy and computing power than the PoW approach, largely in its limitation of participants. PoS means that the miner must provide a minimum deposit, or stake, to confirm the transaction.\n\nHow does bitcoin mining and cryptomining affect the environment? The cryptomining process has drawn criticism from sustainability advocates as well as some government officials and business leaders who fault the technology for its intense energy requirements, greenhouse gas emissions and significant hardware needs. Cryptocurrencies also generate emissions and have other environmental impacts along their production supply chain and during disposal, generating e-waste at their end of life. \"Proof of work is a huge competition across computers, and that race to find a solution takes a lot of power,\" said Marc Lijour, a member of the IEEE and CEO at Creative Emergy. \"It's very inefficient.\" The Cambridge Bitcoin Electricity Consumption Index (CBECI) compares bitcoin's energy needs to other activities, showing bitcoin requires nearly as much energy as powering all the lights and TVs in the U.S. Bitcoin mining has a presence in 58 countries, with most miners operating in the U.S. At 37.84%, the U.S. has the most energy-intensive bitcoin mining activity in the world, according to data from the CBECI. But the tech's environmental impact goes far beyond U.S. borders. Bitcoin's global electricity consumption of 173.42 TWh from 2020 to 2021 exceeds that of some countries, according to a study published by the journal Earth's Future. For example, that amount of power exceeds the combined electricity consumption of Argentina and the Philippines. That intense energy translates to massive levels of greenhouse gases. Bitcoin mining processes produced 85.89 MTCO2E, or metric tons of carbon dioxide equivalent, from 2020 to 2021, according to the study. This figure is comparable to 9,665 gallons of gasoline consumed by passenger vehicles, or 96,210 pounds of coal burned in one year, according to the U.S. Environmental Protection Agency's Greenhouse Gas Equivalencies Calculator. The environmental impact of bitcoin mining has environmental activists, governments and business leaders voicing concerns and questioning how to rein in its effects. Although there are over 10,000 cryptocurrencies in circulation, bitcoin is the most well-known. Ninety-five percent of cryptocurrency owners and people curious about ownership have heard of bitcoin, according to a 2021 report from cryptocurrency exchange company Gemini.\n\nBitcoin is the worst environmental offender The White House points to the fact that Bitcoin requires more energy than all other cryptocurrencies combined, according to the September 2022 report, \"Climate and Energy Implications of Crypto-Assets in the United States,\" published by the White House Office of Science and Technology Policy. Bitcoin accounted for 60% to 77% of total global crypto-asset electricity use as of 2022, according to the report. The second highest user, the Ethereum network, accounted for 20% to 39%. Bitcoin's energy consumption is reliant on primarily non-renewable sources. Researchers estimated that 62% of the electricity used for bitcoin mining globally in 2022 came from fossil fuels, with coal-generated power being the largest single source, according to data from the CBECI. The numbers for renewable energy resources remain low for bitcoin's energy demands. It's estimated that 26% of the electricity powering bitcoin mining came from renewables, while the remaining 12% came from nuclear energy, according to data from the CBECI. As a result, bitcoin's electricity requirements produce a significant amount of greenhouse gas emissions. Bitcoin's estimated greenhouse gas emissions were about 68.02 MTCO2E in 2022, according to data from Climate Watch, a digital platform managed by the World Resources Institute, a nonprofit organization based in Washington, D.C. In comparison, Singapore's greenhouse gas emissions were estimated to be about 67.3 MTCO2E in 2022, according to Climate Watch. The greenhouse gas emissions of Belarus were estimated at 65.3 MTCO2E in 2022. Although bitcoin's energy requirements and its corresponding greenhouse gas emission numbers draw the most scrutiny, experts said bitcoin impacts the environment in other ways. \"There are issues of concern beyond energy consumption,\" said David Boswell, senior director of community architecture at the Linux Foundation, a nonprofit organization headquartered in San Francisco. To start, bitcoin mining produces significant amounts of heat from the participating nodes. The production and disposal of hardware specifically for bitcoin mining is also a critical issue. \"Bitcoin miners cycle through a growing amount of short-lived hardware that could exacerbate the growth in global electronic waste,\" said Alex de Vries, founder of Digiconomist, and Christian Stoll, research affiliate at the Center for Energy Markets of the Technical University of Munich, in their September 2021 article \"Bitcoin's growing e-waste problem\" published by academic journal Resources, Conservation and Recycling. \"E-waste represents a growing threat to our environment, from toxic chemicals and heavy metals leaching into soils, to air and water pollutions caused by improper recycling.\" Bitcoin's e-waste adds up to 30.7 metric kilotons annually, which is comparable to the amount of IT and telecommunication equipment waste produced by the Netherlands, according to de Vries and Stoll. The amount of e-waste generated by bitcoin mining alone could surpass current global estimates. Bitcoin's annual amount of e-waste \"may grow beyond 64.4 metric kilotons\" while global e-waste is expected to grow by 70% from 2016 to 2050, according to de Vries and Stoll.\n\nIs sustainable cryptomining realistic? Some researchers have put the environmental impact of bitcoin mining on par with two other major industries with outsized negative climate impacts -- beef and crude oil. That's according to the September 2022 report, \"Economic estimation of Bitcoin mining's climate damages demonstrates closer resemblance to digital crude than digital gold,\" published by Scientific Reports. The report calculated that for each dollar in bitcoin value produced, the process resulted in 35 cents in global climate damages. Industry watchers are taking notice. Pressure is building to address the environmental concerns raised around bitcoin, blockchain and other Web3 technologies, said Joe Davey, partner at West Monroe, a digital services firm headquartered in Chicago. The concern is not coming only from environmentalists but from businesses, too, as many have set sustainability targets and net-zero goals and are questioning whether bitcoin's environmental track record can fit with their corporate objectives. \"The energy consumption issue comes up as a question,\" Davey said. Such concerns are prompting some changes in the Web3 space. According to some experts, the most notable change comes from the Ethereum blockchain network, which shifted from a PoW system to the more energy efficient PoS mechanism in September 2022. The shift -- known as the Merge -- cut energy requirements by more than 99%. Experts continue to debate whether bitcoin could transition toward more energy-efficient methods. \"For bitcoin to change, you'd need a consensus among a large group,\" Davey said. \"And you'd have forks in bitcoin and that's probably what it's going to take -- a fork [of miners] moving to proof of stake.\" For bitcoin users, such a move would present several challenges. \"There's so much sunk costs, with the equipment around the mining rigs, just because bitcoin is the oldest network out there,\" Boswell said. Still, experts said some efforts to make bitcoin more sustainable could happen, such as getting a higher percentage of its electricity from renewable sources and recycling its heat -- both of which are happening in some places."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvZy9nZW5lc2lzLWJsb2NrLmFzcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Genesis Block: Bitcoin Definition, Mysteries, and Secret Message - Investopedia",
        "content": "What Is a Genesis Block?\n\nA Genesis Block is the first block in a cryptocurrency blockchain. A blockchain consists of a series of blocks that are used to store information related to transactions that occur on a blockchain network. Each block contains a unique header, and each such block is individually identified by its block header hash.\n\nThese blocks are chained together by their encrypted headers, with the Genesis Block being the foundation—and they grow in number. A block's number is referred to as its height on the blockchain. So, the Genesis Block has a height of zero, the following block has a height of one, and so on. The chained information in each block is one of the things that makes a blockchain so secure.\n\nBitcoin's Genesis Block was the first instance of a proof-of-work blockchain system and is the template for all other blocks in its blockchain. In 2009, Bitcoin's anonymous developer, Satoshi Nakamoto, created the Genesis Block, which launched the cryptocurrency and blockchain boom.\n\nKey Takeaways A Genesis Block is the first block on a cryptocurrency blockchain.\n\nIn 2009, a developer named Satoshi Nakamoto created the Genesis Block on the Bitcoin blockchain.\n\nThe information from the Genesis Block is present in all blocks in a blockchain because of how information is encrypted and used in the following blocks.\n\nUnderstanding the Genesis Block\n\nBlocks are effectively digital containers where data pertaining to the transactions on a network are permanently recorded. A block records as many of the most recent Bitcoin transactions it can hold that have not yet entered any prior blocks. Thus, a block is like a ledger or a record book page. Each time a block is \"completed,\" it gives way to the next block in the blockchain. A closed block is thus a permanent store of records that, once confirmed, cannot be altered or removed.\n\nThe Genesis Block, also known as Block 0, is the very first block upon which additional blocks in a blockchain are added. It is effectively the ancestor that every other block can trace its lineage back to since every block references the one preceding it. This began the process of validating bitcoin transactions and introducing new bitcoins into existence.\n\nThe next block, Block 1, wasn't mined until five days after the Genesis Block. This is considered odd as the average timestamp gap between blocks is intended to be 10 minutes.\n\nThere are a few theories regarding the delay of five days between the first two blocks: Some have theorized that Nakamoto spent five days mining the original block to test out the Bitcoin system to make sure it was stable (then backdated the timestamp), while more cultish followers believe Satoshi intended to recreate the story of God's rest after creating the world in six days—even though the recorded difference is only five days.\n\nBitcoin Basics\n\nBitcoin is a type of cryptocurrency developed by Satoshi Nakamoto. Bitcoin (with a capital b) refers to the blockchain and network, and \"bitcoin\"—with a small \"b\"—refers to the virtual coinage that is used. There are no actual coins, hence the \"bit\"—or binary digit, the most basic unit of data in computing—before \"coin.\"\n\nIn the world of virtual currency, blocks are files where data about the Bitcoin network and its transactions are permanently recorded. Each time a block is completed—that is, when a miner guesses the solution—the block is closed, giving way to the next block in the blockchain. The only way to release new cryptocurrency into circulation is to mine it (receive it as a reward for doing work for the blockchain). So, to \"mine bitcoin\" is to \"mint currency.\"\n\nLike gold, Bitcoin cannot be created arbitrarily. Gold must be mined out of the ground, and bitcoin (BTC) must be mined via digital means.\n\nMoreover, Bitcoin's founder stipulated that, like gold, the supply of bitcoin should be limited and finite. Only 21 million BTC can be mined in total. When miners have unlocked this many bitcoin, the supply will be tapped out unless someone changes Bitcoin's protocol to allow for a larger supply.\n\nMysteries of the Genesis Block\n\nBeginning with the fact that the name \"Satoshi Nakamoto\" itself is a pseudonym, the Genesis Block and the founding of Bitcoin remain riddled with mystery. Shortly after Bitcoin's launch, the person calling themselves \"Satoshi Nakamoto\" vanished from the face of the earth, leaving barely a trace.\n\nThe First 50 BTC Could Not be Spent\n\nThe Genesis Block's beginnings were shrouded in the debate about a fine point of its creation: Was the code that rendered the Genesis Block effectively untradeable an intention or a mistake on the part of Nakamoto?\n\nAlthough the Genesis Block points to a web address—written into the Genesis Block's code—that link displayed an error message when activated. The system could not find the first transaction of 50 BTC in its database, and the spending transaction was rejected. So, the Genesis Block's transaction is not considered a \"real transaction\" by the original Bitcoin client.\n\nBut why? Did Nakamoto mean for the first bitcoin to be non-tradeable? Or was it a mistake? This became the subject of much debate among Bitcoin fans and insiders. Because of the precision of this developer, however, most believe it was hardly an error. Nakamoto likely wrote the code for the Genesis Block exactly the way he wanted it. We will never know why, as the quirk was not discovered until after Nakamoto disappeared.\n\nCurrent versions of the Bitcoin system handle the block/transaction databases differently from the original system, so the Genesis Block's transaction is now just a weird special case in the code.\n\nBitcoin's Genesis Block Message\n\nAnother puzzling aspect of the Genesis Block is the message that Nakamoto instilled within the Block's raw data: \"The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.\"\n\nAlthough Nakamoto never commented on the meaning of this text, most believe that it serves as a mission statement for Bitcoin itself.\n\nThe text is a headline for an article in the Jan. 3, 2009 edition of The [London] Times about the British government's failure to stimulate the economy following the 2007–08 financial crisis. Nakamoto spoke out against the idea of financial institutions that were too big to fail and wanted Bitcoin to be different. Most people think that Nakamoto's reference to the article in the Genesis Block's code was a hint as to how Bitcoin is different from the big investment banks that needed government bailouts in 2008.\n\nThe True Legacy of the Genesis Block\n\nBitcoin cannot be bailed out because its process eliminates the intermediary; no third party or corporate entity exists between BTC and the consumer.\n\nThe Bitcoin network checks and double-checks itself continuously using encryption, validation, and automated general consensus. Another failsafe is that because all transactions cannot be altered, the actions of miners can always be traced back to their wallet addresses, which makes it impossible to hide any evidence of wrongdoing. However, unless the owner of the wallet address makes their identity known, there is no way to know who it is.\n\nIn November 2013, early protegees of Nakamoto formed the Satoshi Nakamoto Institute (SNI) to educate the public about the history and vision of Bitcoin's creation. Among other interesting details, the SNI houses one of the biggest remnants of Nakamoto's online existence: An extensive list of forum posts, broken into subject categories, that the Bitcoin creator penned while still working on the project.\n\nSome Bitcoin fans hold the Genesis Block in a kind of cult-like reverence, as they do its anonymous creator. Fans are drawn to Bitcoin's arcane construct and idiosyncratic vocabulary with the fervor of one obsessed with a sophisticated arcade game.\n\nBitcoin devotees have been donating small amounts of BTC to the Genesis Block as a tribute to Satoshi Nakamoto. This is seen as a kind of sacrifice because once a coin is moved into the Genesis Block, it can never be used again—sort of like throwing a quarter into a bottomless fountain.\n\nIs Genesis Block 0 or 1? The first block on the Bitcoin blockchain is the Genesis Block, which has a block height of zero.\n\nWhy Is the Genesis Block Important? The Genesis Block is actually not that important unless you view it as a historical occasion. It is simply the first block that contains the first transaction, but it has been hyped as something special by fans.\n\nWhen Was the First Bitcoin Block? The first Bitcoin block is believed to have been mined on Jan. 3, 2009, as it contains a message with that date, and the blockchain recorded it as such.\n\nThe Bottom Line\n\nThe Genesis Block is the first block on the Bitcoin blockchain, but it is also a term that can be used to refer to the first block on any blockchain. It is special to cryptocurrency fans because it signifies an attempt to transition away from the current financial system, which is full of third parties chipping away at people's finances and causing widespread problems through corrupt practices.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMzAvc2VjLW1lZXRzLXdpdGgtZ3JheXNjYWxlLWJsYWNrcm9jay1hYm91dC1wb3RlbnRpYWwtYml0Y29pbi1ldGZzLmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8zMC9zZWMtbWVldHMtd2l0aC1ncmF5c2NhbGUtYmxhY2tyb2NrLWFib3V0LXBvdGVudGlhbC1iaXRjb2luLWV0ZnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC meets with Grayscale, BlackRock about potential bitcoin ETFs - CNBC",
        "content": "The U.S. Securities and Exchange Commission is formally engaging with asset managers ahead of a much anticipated decision on whether the regulator will approve a bitcoin exchange-traded fund, according to memos published this week.\n\nThe regulator said in a memo that it met with Grayscale on Thursday about the potential conversion of the Grayscale Bitcoin Trust into an ETF. The SEC had previously blocked this move, but Grayscale challenged that decision in court and won.\n\nSEC officials also met with representatives from BlackRock and the Nasdaq on Wednesday, according to a separate memo. BlackRock filed for a bitcoin ETF in June, followed shortly by a handful of other asset management firms.\n\nWhile the SEC could still decide to block crypto ETFs, many industry experts expect that such funds will launch in the U.S. early next year. The regulator has delayed decisions on several bitcoin funds in recent months and may choose to approve or deny all applications at around the same time.\n\nSEC Chair Gary Gensler has been a vocal critic of crypto but has said in recent public appearances that he would listen to his staff's input on a potential bitcoin ETF.\n\nGrayscale also recently hired John Hoffman, a longtime Invesco ETF executive, as a managing director. Hoffman will serve as the head of distribution and strategic partnerships for Grayscale, a sign that the crypto asset manager is gearing up to launch the fund if approved.\n\nThe growing confidence in the market that a bitcoin ETF will eventually be approved appears to have boosted the price of bitcoin. The cryptocurrency was trading above $37,000 on Thursday after falling to about $26,000 late this summer.\n\nDon't miss these stories from CNBC PRO:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvYml0Y29pbi1leWVzLTQway1hcy0xYi1pbi1idGMtd2l0aGRyYXdhbHMtc3VnZ2VzdHMtYnVsbGlzaC1tb29kL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvYml0Y29pbi1leWVzLTQway1hcy0xYi1pbi1idGMtd2l0aGRyYXdhbHMtc3VnZ2VzdHMtYnVsbGlzaC1tb29kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Eyes $40K as $1B in BTC Withdrawals Suggests Bullish Mood - CoinDesk",
        "content": "\"We are potentially entering in 2024 an opportunity for a net positive liquidity for the markets. Bitcoin is a pure reflection of net liquidity in the markets, and we would need to see positive liquidity to support any substantial bullish activity,\" Rousseau added."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTAxL2JpdGNvaW4tcmFsbHktcHVzaGVzLXRva2VuLXRvLWhpZ2hlc3QtbGV2ZWwtb2YtMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Price Rises to 2023 High - Bloomberg",
        "content": "Bitcoin soared to its highest price so far this year, as investors took on more risk ahead of comments from Federal Reserve Chair Jerome Powell which could give guidance on whether the US is closer to lowering interest rates.\n\nThe world’s largest cryptocurrency rallied as much as 2.87% to a high of $38,834 on Friday. Prices of other digital assets tracked by Bloomberg, such as Ether and Solana, were also up more than 2%. Bitcoin’s jump constitutes the token’s highest value since May 5 last year, just before the collapse of the TerraUSD stablecoin ecosystem rocked the sector and began a steady decline in asset prices."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiqgFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vY29tbW9kaXR5aW5zaWdodHMvZW4vbWFya2V0LWluc2lnaHRzL2xhdGVzdC1uZXdzL2VsZWN0cmljLXBvd2VyLzEyMDEyMy1iaXRjb2luLW1pbmluZy1wcm9maXRhYmlsaXR5LXBsdW5nZXMtYXMtcG93ZXItcHJpY2VzLXJpc2Utb24taGlnaGVyLWRlbWFuZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin mining profitability plunges as power prices rise on higher demand - S&P Global",
        "content": "End of November power demand highest on the year across Europe\n\nBitcoin mining profitability rates plunged across Europe as an end-of-November cold snap pushed day-ahead power prices higher due to rising demand, S&P Global Commodity Insights data showed.\n\nNot registered? Receive daily email alerts, subscriber notes & personalize your experience. Register Now\n\nBitcoin Renewable Quarq Spreads in Germany and France fell to negative Eur90/MWh as French power demand hit 70 GW. Meanwhile in Germany coal and lignite output ramped up to 27 GW to meet the increase in demand, the highest since the last winter.\n\nGermany/Belgium reverted to imports from France during evening peaks, that in turn turned to rare imports from Italy and Switzerland in addition to steady flows from Spain.\n\nBaseload day-ahead power price in Germany and France both averaged around Eur169/MWh Nov. 30. Meanwhile, hourly power prices across the Central Western Europe region spiked to Eur250/MWh during evening peak hours on Nov. 29, the highest since last winter, exchange data showed.\n\nSpanish day-ahead power prices were more resilient over the last week, with prices peaking at Eur107.9/MWh Nov. 27, and settling range bound within Eur80/MWh and Eur100/MWh between Nov. 29 – Dec. 1.\n\nBitcoin Renewable Quarq Spreads have been in-the-money in Norway NO4 and Sweden SE1 from Nov. 22, while profitability rates in Finland have been volatile. In Finland, a bidding error by a market participant on Nov. 23 saw Finland power prices settle at negative Eur500/MWh, which resulted in a Eur315.57/MWh profitability for bitcoin miners, Bitcoin Renewable Quarq Spreads index data showed.\n\nFinland's 1.6-GW Olkiluoto 3 (OL3) nuclear power plant was scheduled to resume power production late Nov. 30 after the new 1.6-GW reactor suffered a second outage this fortnight on Nov. 29.\n\nA shift to colder weather could maintain power prices high in the Nordic countries, which will result in lower bitcoin mining profitability.\n\nPlatts assessed the Bitcoin Energy Consumption Index at 384.04 MWh Nov. 30, down from a peak of 399.48 on Nov. 26.\n\nPlatts is part of S&P Global Commodity Insights. Platts Bitcoin Renewable Quarq Spreads are assessed across 42 locations in Europe and the US."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9jYW5hZGEtc3BvdC1iaXRjb2luLWV0Zi1zdXJnZS1wb3J0ZW5kcy1zaW1pbGFyLWJvb20taW4tdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin ETF's 60% surge in Canada signals what's coming in the US - DLNews",
        "content": "Canada dominates the global spot Bitcoin ETF market and might hint at how big US products will be.\n\nJPMorgan analysts said slow growth of Canadian ETFs shows how overblown the US hype is.\n\nAnalyst Eric Balchunas disagrees, and explains why \"it looks pretty good\" for the US.\n\nCanada stamped itself as a pioneer when it approved the world’s first spot Bitcoin exchange traded fund — the Purpose Bitcoin ETF — back in February 2021.\n\nThere have been hiccups since, but the funds have seen a resurgence in 2023.\n\nThe Canadian ETF explosion can be used as a proxy for what will follow in the “massive” US market, Eric Balchunas, an ETF analyst at Bloomberg Intelligence, told DL News.\n\nAssets under management at the Purpose Bitcoin ETF, the world’s largest spot Bitcoin exchange traded fund, soared 60% to over 947 million Canadian dollars this year, according to Cboe Global Markets’ Canadian arm. In US dollars, that’s almost $700 million.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nBalchunas noted that the US ETF market is 32 times that of Canada’s.\n\n“Based on Canada, if you extrapolate, it looks pretty good,” he said.\n\nCanada’s spot Bitcoin ETF market share sits at 48% of all global spot crypto ETFs, at around $2 billion in assets, according to CoinGecko.\n\nThe global market is worth about $4.2 billion. South of the border, Balchunas has been tracking fund giants BlackRock, Fidelity, Ark Invest and the handful of other firms awaiting spot Bitcoin ETF approval — expected in January.\n\nJoin the community to get our latest stories and updates\n\nOptimism surrounding a Securities and Exchange Commission nod has helped drive Bitcoin 126% higher this year.\n\nETF performance\n\nCanadian spot ETFs were initially predicted to be a game-changer, but when the Purpose Bitcoin ETF launched in 2021, its performance was underwhelming.\n\nExpected to rise to over $1 billion in assets under management within a week, inflows to Purpose in early weeks went slower than anticipated.\n\nBy April 2022, the ETF had amassed a record $1.7 billion in assets, but that figure was quickly washed away by the Terra collapse in May.\n\nLike many crypto markets, ETFs wallowed through 2022 and only started to recover this January.\n\nIn June, JPMorgan said there was “little interest” in Canadian ETFs, using it as an example to why the US ETF hype might be overblown.\n\nOthers reject that analysis — including Balchunas and Canadian regulators.\n\nThe Ontario Securities Commission wrote in a 2023 report that “much of the decline in AUM is due to the declining value of cryptocurrencies, rather than significant fund outflows.”\n\nBalchunas noted that crypto ETF flows accounted for 5% of all flows in Canada this year. The increase in assets under management in the market adds up to 23% organic growth, a number Balchunas said is undeniable.\n\n“The JPMorgan thing baffled me,” Balchunas said.\n\nCanada’s ETF-friendly past\n\nCanada has a history of pushing out ETFs well ahead of the US, as far back as the world’s first ETF, called the TIPs 35 Fund, which launched in 1990.\n\nThe US followed up with the SPY ETF in 1993. Balchunas cites Canada’s first cannabis ETF, launched in 2017, as another example where Canada beat the US to the ETF punch — it took the US nearly four years to approve a similar product.\n\nBalchunas cites “conservative” regulators in the US, compared to Canada’s “more liberal” regime.\n\nStill, Balchunas says, the tendency has been for US approval to follow.\n\n“Once the first ETF in the asset class breaks through, the rest will be approved,” he said.\n\nRoad to SEC approval\n\nPerformance of Canada’s ETFs isn’t the whole story.\n\nThe road to spot ETF approval has not gone smoothly — the SEC has rejected every application to date, and on Tuesday delayed approval of Franklin Templeton’s proposed ETF.\n\nThe SEC has raised concerns that spot ETFs may be vulnerable to market manipulation and fraud. It has asked the public to express its concerns with such issues.\n\nCanada, on the other hand, approved the crypto ETFs in short order, and has arguably stricter regulatory controls — the country rolled out a series of rules in 2022, which saw several major crypto firms exit the country, including leading global exchange Binance.\n\n“The most important difference between Canada and the US right now is regulatory certainty in Canada,” Laure Fouin, partner at Canadian law firm Osler, Hoskin & Harcourt, wrote in an email to DL News.\n\nFouin pointed to explicit crypto-related guidance issued by the Canadian Securities Administrators, which included agency expectations for crypto asset funds.\n\nCrypto firms in the US have long advocated for the SEC to produce explicit guidance for crypto assets.\n\nSEC Chair Gary Gensler has insisted that existing securities regulations are sufficient.\n\nThe SEC has so far only approved Bitcoin-related funds tied to futures contracts.\n\nTyler Pearson is a Researcher at DL News. If you’ve got a tip on Binance or another story, please reach out at ty@dlnews.com.\n\nA previous version of this article incorrectly stated that Osler, Hoskin & Harcourt is based in Calgary."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2Utbm92ZW1iZXItZGVjZW1iZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin price went up in November — will it go up in December? - Blockworks",
        "content": "Bitcoin is again inching closer to a potential price breakout, even as it hovers at its highest point in 18 months.\n\nMarkets priced bitcoin (BTC) above $38,600 on Friday morning — up 9% over the past month and more than double since this time last year.\n\nNumber-two crypto ether (ETH) is meanwhile playing catch-up. It’s also at its highest point since mid-last year, but trails bitcoin’s returns by nearly half.\n\nThe ETH/BTC ratio (the bitcoin cost of ether) has fallen by one-fifth over the past six months. It’s showing signs of closing the gap, however, having regained almost 4.5% in November.\n\nBitcoin bulls may explain the crypto’s strength with hype around spot bitcoin ETFs — like the one BlackRock wants to launch — which could be approved any day now.\n\nThose ETFs will be forced to buy BTC to meet investor demand, representing perhaps billions in upward pressure. They might even reason that the DOJ’s indictment of Binance and CEO Changpeng Zhao gives a certain clarity to the crypto market that can only be good for prices.\n\nCrypto investors could even feel a little floaty due to arrests of hombres like FTX fraudster Sam Bankman-Fried, Terra ringleader Do Kwon and Celsius rabble-rouser Alex Mashinsky.\n\nSo, the tide went out, took the bad actors with it and now billions in fresh ETF money might wash ashore, bringing the bull market back along with it, some might say.\n\nThe ETH/BTC ratio has even underperformed BNB over the past year\n\nBears would say it’s unclear whether ETFs would actually move the needle, considering the relatively small interest in the three spot funds already available to North American investors via Canadian markets.\n\nA fresh wave of spot ETFs could even be bad for bitcoin’s price, especially if Grayscale Bitcoin Trust (GBTC) loses ground to Wall Street operators like BlackRock and Fidelity.\n\nJPMorgan analyst Nikolaos Panigirtzoglou reckons up to $2.7 billion might flow out of GBTC and potentially be dumped on the market.\n\nStill, by some definitions, the bear market is squarely over. That doesn’t explicitly mean the start of a new bull market.\n\nAlthough momentum does count for something, and if Bitcoin went up in November, could it do the same in December?\n\nIt turns out Bitcoin’s price direction in December has matched November 10 times in its 13 years of existence, with only 2011, 2013, and 2014 not aligning — a 77% strike rate, per TradingView data.\n\nThat’s more common than with months overall: 94 of the 170 months on record, or 56%, have aligned with the previous month’s candle.\n\nAll this is probably statistically insignificant, on par with roulette math, given the small sample size.\n\nBut considering the crypto winter we’ve had, markets will take what they can get.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnNwaWNld29ya3MuY29tL3RlY2gvdGVjaC1nZW5lcmFsL2FydGljbGVzL3doYXQtaXMtYml0Y29pbi1taW5pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Exploring Bitcoin Mining, Its Process, and Software | Spiceworks - Spiceworks News and Insights",
        "content": "Bitcoin mining is defined as a process that secures and validates transactions on the Bitcoin network while introducing new bitcoins into circulation.\n\nThis process involves solving complex mathematical puzzles through computational power, and it plays a critical role in maintaining the decentralized nature of the Bitcoin system.\n\nIn this article, we explore the intricacies of Bitcoin mining, examining its operations, associated expenses, challenges, and recommended best practices.\n\nWhat Is Bitcoin Mining?\n\nBitcoin mining is a process that secures and validates transactions on the Bitcoin network while introducing new bitcoins into circulation. This process involves solving complex mathematical puzzles through computational power, and it plays a critical role in maintaining the decentralized nature of the Bitcoin system.\n\nAt its core, Bitcoin mining involves adding new blocks to the blockchain — a public and immutable ledger that records all Bitcoin transactions. Each block contains a group of transactions, and miners compete to create new blocks and append them to the existing chain. This is achieved through a consensus mechanism called proof of work (PoW).\n\nIn PoW, miners must find a special number called a “nonce.” They combine this nonce with transaction information and the previous block’s code to create a new code (hash) that must start with a specific number of zeros. The challenge lies in finding the right nonce that meets this requirement.\n\nTo keep the system running smoothly, the difficulty of finding this nonce is adjusted regularly. This adjustment ensures that, on average, a new block is mined every 10 minutes, no matter how much computing power is added to the network. It helps maintain a steady and predictable pace for creating new blocks in the blockchain.\n\nMining begins when a miner selects a set of unconfirmed transactions from the Bitcoin mempool (or memory pool) — a pool of pending transactions. The miner assembles these transactions into a block and starts working on finding the correct nonce. Since the process is computationally intensive, miners use specialized hardware, such as application-specific integrated circuits (ASICs), to perform trillions of calculations per second.\n\nThe first miner to find the correct nonce broadcasts the new block to the network, along with the solution to the PoW puzzle. Other miners then verify the block’s validity before accepting it into their copy of the blockchain. This verification ensures that the transactions within the block are legitimate and that the PoW solution is correct.\n\nOnce a block is accepted, it is linked to the previous block through its hash, forming an unbroken chain of blocks — the blockchain. The winning miner is rewarded with a fixed number of newly minted bitcoins, known as the “block reward,” and any transaction fees users pay to include their transactions in the block.\n\nHowever, as more miners join the network and computational power increases, the difficulty of finding the correct nonce rises. This is to maintain the 10-minute block time and ensure a controlled issuance of new bitcoins. The block reward is also halved approximately every four years through “halving.” This halving is programmed into the Bitcoin protocol and aims to limit the total Bitcoin supply to 21 million, making it a deflationary digital currency.\n\nMining also serves as a fundamental security mechanism for the Bitcoin network. The decentralized nature of mining prevents any single entity from controlling most of the network’s computational power. If a malicious actor were to gain control of over 50% of the network’s mining power, they could potentially manipulate transactions, double-spend coins, and undermine the system’s integrity. This is known as a “51% attack” and is a significant concern for any blockchain relying on PoW.\n\nSee More: Blockchain Engineer: Job Description, Key Skills, and Salary in 2022\n\nPrerequisites of Mining Bitcoin\n\nMining plays a pivotal role in the entire lifecycle of cryptocurrencies, encompassing transaction creation, transmission, and verification. This vital process ensures the digital currency’s smooth and secure movement from one party to another. However, the mining operation requires several key prerequisites. Let’s understand them in detail.\n\n1. Hardware requirements\n\nMining device : To mine efficiently, you need specialized hardware, preferably ASICs or graphics processing units (GPUs). ASICs are specifically designed for mining Bitcoin, while GPUs can also be used for other cryptocurrencies.\n\nProcessing power : The more processing power your mining hardware has, the higher your chances of successfully mining a block and earning rewards. Mining hardware is measured in hash rate, indicating the number of hashes it can calculate per second.\n\n2. Bitcoin wallet\n\nA Bitcoin wallet is essential to store the bitcoins you mine. Technically, a Bitcoin wallet contains private keys that allow you to access and control your Bitcoin holdings. You need a secure and reliable wallet to protect your earnings.\n\n3. Bitcoin mining software\n\nMining software connects your mining hardware to the Bitcoin network and enables you to participate in the mining process. The software receives and validates transactions, performs the PoW calculations, and communicates with the Bitcoin network. CGMiner, BFGMiner, and Easyminer are well-known mining software choices widely used in the mining community.\n\n4. Internet connectivity\n\nA stable and reliable internet connection is required to communicate with the Bitcoin network and other miners. Mining hardware must transmit blocks and receive new transactions and information from other nodes in real-time.\n\n5. Electricity and power costs\n\nMining is power-intensive, and electricity costs can significantly impact the profitability of mining operations. As mining hardware runs 24/7, you must consider the electricity consumption and the cost of electricity in your area.\n\n6. Cooling system\n\nMining hardware generates substantial heat; without proper cooling, it can overheat and fail. A cooling system, such as fans or liquid cooling, is necessary to keep the hardware at optimal operating temperatures.\n\n7. Knowledge and technical skills\n\nMining Bitcoin requires a certain level of technical expertise. You should understand computer hardware, software, networking, and troubleshooting well. You must be able to configure and optimize your mining hardware and software for maximum efficiency and stability.\n\n8. Joining a mining pool (optional)\n\nWhile it is possible to mine Bitcoin solo, the difficulty of mining has become so high that individual miners may take a long time to find a block. Joining a mining pool allows you to combine your hashing power with other miners, increasing the chances of earning regular rewards.\n\nMining pool members share the block rewards based on their contributed computing power.\n\n9. Secure environment\n\nMining hardware represents a significant investment, so it’s crucial to ensure a secure physical environment to protect it from theft and damage.\n\n10. Compliance and legal considerations\n\nDepending on your location, there might be legal and regulatory requirements related to cryptocurrency mining. Ensure you comply with local laws and tax regulations concerning cryptocurrency activities.\n\nRemember that the mining landscape evolves rapidly, and profitability can change due to factors like Bitcoin’s price, network difficulty, and the emergence of new, more efficient mining hardware. Therefore, staying informed and continually adapting your mining setup is crucial to remain competitive.\n\nSee More: What Is Computer Architecture? Components, Types, and Examples\n\nHow Does Bitcoin Mining Work?\n\nThe cryptocurrency mining market is experiencing substantial growth, driven by advanced distributed ledger technologies and increased electronic venture capital investments. As per a January 2023 report by Precedence Research, the global cryptocurrency mining market size reached $1.92 billion in 2022 and is projected to reach approximately $7 billion by 2032.\n\nAs we operate in this era of cryptocurrencies, it becomes crucial for industries to grasp the fundamental principles and mechanisms that facilitate Bitcoin mining. This can empower industries to make informed decisions and leverage the opportunities this evolving landscape presents.\n\nHere’s a step-by-step explanation of how Bitcoin mining works:\n\nTransaction collection : Users initiate Bitcoin transactions by sending and receiving bitcoins. These transactions are broadcast to the Bitcoin network and collected in a pool called the “mempool,” where they wait to be confirmed by miners. Block creation : Miners select a set of unconfirmed transactions from the mempool to include in a new block. Transactions are chosen based on transaction fees, with higher fees often prioritized to incentivize miners to include them in their blocks. Block header preparation : The selected transactions, along with the hash of the previous block, are combined to form the block header. The block header contains critical information that miners will modify to find a valid hash. Nonce finding : Miners attempt to find a specific numerical value known as a “nonce” by changing it in the block header. The nonce is an arbitrary number that miners can alter to generate different block header hashes. Proof of Work (PoW) : To create a valid block, miners must find a nonce that, when combined with the block header data, produces a hash that starts with a certain number of leading zeros (a hash with a specific difficulty level). This is the PoW puzzle that miners must solve. Hashing : Miners use the SHA-256 (Secure Hash Algorithm 256-bit) cryptographic hash function to compute the hash of the block header with the modified nonce. Since the hash function is deterministic, the same data and nonce will always produce the same hash. Difficulty adjustment : The difficulty of the PoW puzzle is adjusted every 2,016 blocks (approximately every two weeks) to ensure that new blocks are mined approximately every 10 minutes. If miners collectively find blocks too quickly or too slowly, the difficulty is adjusted up or down respectively. Finding the solution : Miners repeatedly change the nonce and hash the block header until they find a valid hash that meets the current difficulty requirement. This process requires substantial computational power to be completed successfully. Block broadcasting : Once a miner finds a valid hash, they broadcast the new block to the rest of the network. Other nodes and miners verify the validity of the block before accepting it. Block confirmation : As other nodes verify the validity of the new block, they add it to their copy of the blockchain. This process confirms the included transactions and ensures consensus across the network. Block reward : The miner who successfully mined the new block is rewarded with a fixed number of newly minted bitcoins, called the block reward. Currently, this reward is 6.25 bitcoins per block, but it halves approximately every four years through a process called halving. Transaction fees : In addition to the block reward, miners also collect transaction fees paid by users for including their transactions in the block. These fees serve as an incentive for miners to include transactions with higher fees in their blocks. Rinse and repeat : The mining process continues indefinitely as long as there are new transactions to process, and miners compete to find the next valid block and claim the block reward.\n\nIn summary, Bitcoin mining involves selecting transactions, creating a block, finding a nonce that results in a valid hash, and then broadcasting the new block to the network. The process requires significant computational power and serves as the foundation for securing the Bitcoin network and validating transactions.\n\nSee More: What Is Clickjacking? Definition, Methods, and Prevention Best Practices for 2022\n\nCosts and Challenges of Bitcoin Mining\n\nBitcoin mining operates as a business venture where profitability hinges on investing in various inputs. Three primary costs are associated with Bitcoin mining:\n\n1. Electricity\n\nRunning mining systems 24/7 incurs substantial electricity expenses, considering the energy consumption of the mining process, akin to that of certain countries. Additionally, cooling the mining rigs is essential due to the significant heat generated, leading to additional costs for air conditioning.\n\nIn May 2023, Statista reported that the annual global electricity consumption of Bitcoin mining reached around 95.58 terawatt-hours for that month alone.\n\n2. Mining systems\n\nWhile regular computers and gaming systems can be used for mining in a pool, the returns are limited due to shared rewards based on individual contributions. To be competitive, dedicated ASIC mining machines are necessary, each costing between $4,000 to $12,000. The mining speed and the number of rigs purchased determine the overall expenditure.\n\n3. Network infrastructure\n\nWhile network speed has minimal impact, low latency is crucial for efficient communication with the Bitcoin network. Mining farms need several internal connections, linking mining rigs to a central router or server for internet access. However, additional bandwidth is usually unnecessary for smaller operations using gaming rigs in a pool, with low latency being sufficient.\n\nFor profitability, the total costs of these inputs must be lower than the output, represented by the bitcoin price. The fluctuating nature of bitcoin prices adds complexity to the equation, making the venture uncertain. Despite the allure of minting one’s cryptocurrency, the economic challenges of Bitcoin mining might lead to lower profits and a longer breakeven time for those entering this lottery-like environment.\n\nChallenges of Bitcoin mining\n\nInvesting in Bitcoin cryptocurrency through mining is considered highly profitable. As per the Cambridge Digital Assets Program’s (CDAP) May 2022 report, the United States is the largest Bitcoin mining industry worldwide, contributing to over 38% of the global Bitcoin network’s hash rate.\n\nHowever, it has not been immune to challenges, and even today, Bitcoin mining companies encounter various issues. Here are some of the primary challenges that Bitcoin mining confronts:\n\nBitcoin Mining Challenges\n\n1. Shortage of skilled personnel\n\nLike most economic sectors, cryptocurrency also faces a scarcity of skilled personnel. As a relatively new technology, finding individuals proficient in machine operation and mining techniques is difficult. To address this, some Bitcoin mining firms invest in training new hires. However, this process is time-consuming and costly, resulting in slower mining operations and reduced revenue due to insufficient skilled personnel.\n\n2. Upfront initial costs\n\nThe initial costs involved in Bitcoin mining pose a significant challenge. In traditional manufacturing businesses, these costs are often referred to as production costs, but in Bitcoin mining, they are considered operational costs. Successful cryptocurrency mining now requires high-end supercomputers, unlike the early days when personal computers sufficed.\n\nWith increased participation in the mining venture, competition has intensified, driving the need for more powerful computers. However, without such robust equipment, mining agencies struggle to generate profits. Acquiring these powerful supercomputers requires a substantial capital investment, making it difficult for several organizations to fund their Bitcoin mining processes adequately and maintain network operations.\n\nThe higher initial costs have forced various mining companies out of business, leading to a scarcity of available Bitcoins. They have also prolonged the time needed to recover these initial investments and achieve significant growth. If the mining machines were more affordable, it would attract more participants, resulting in increased mining and more coins generated.\n\n3. Volatility in Price\n\nThe cryptocurrency sector is known for its unpredictable price variations, which pose a major drawback. Even traders on certified crypto exchanges like Immediate Edge struggle to navigate these fluctuations. Available data indicates that Bitcoin prices reached their peak in November 2021, surpassing $60,000. However, since January 2022, the prices have significantly declined. As of the time this article was written, the Bitcoin price is hovering around $37,000.\n\nThe price volatility presents a considerable threat to Bitcoin mining investors as it can result in unprecedented losses. When Bitcoin prices rise, miners can earn substantial income, but profits decrease considerably during price declines. The fluctuations in cryptocurrency prices will continue to be a key challenge for investors until the industry stabilizes.\n\n4. Escalating operational expenses\n\nHigh operational costs present a significant challenge in any business, as they directly impact the return on investment (ROI). For Bitcoin mining, operational expenses, especially electricity bills, account for a substantial portion of the revenue, ranging between 30 to 40 percent. This allocation of resources limits the ability to invest in newer and improved mining equipment or to maintain existing ones. As a result, achieving significant profits becomes difficult, posing a hindrance to the growth and efficiency of mining operations.\n\n5. Government regulations\n\nGovernment regulations play a pivotal role in the Bitcoin landscape. While certain countries have embraced Bitcoin and its use within their borders, many others have yet to follow suit. Some nations view cryptocurrencies as risky and have even deemed them illegal, creating barriers for aspiring Bitcoin mining investors in those regions.\n\nNotably, China has banned Bitcoin mining due to its substantial electricity consumption. Similarly, in January 2022, Kosovo took measures to address its energy crisis resulting from surging global prices by imposing a ban on cryptocurrency mining that contributed to increased electricity consumption in the region.\n\nThe future of mining holds promise as the global adoption of cryptocurrencies continues to grow. Once more countries fully embrace this digital currency revolution, mining will likely become more seamless and profitable globally.\n\nSee More: Top 10 Antivirus Software in 2022\n\nTop 4 Bitcoin Mining Software\n\nPresently, numerous industries view Bitcoin as a promising future for commerce. In 2022, a considerable majority of small and mid-sized businesses, approximately 75%, expressed intentions to incorporate cryptocurrency as a payment method within the next two years, according to a Deloitte survey. This trend also extends to larger businesses and organizations, with prominent names like Starbucks and Lamborghini adopting cryptocurrency.\n\nThough Bitcoin can be acquired through cash purchases, mining it using specialized hardware and software is the more prevalent approach. In this regard, let’s explore the top four Bitcoin mining software options currently available.\n\n1. CGMiner\n\nCGMiner, created by Con Kolivas in 2011, is a highly acclaimed open-source Bitcoin mining software known for its user-friendly interface and compatibility across various platforms and hardware. Utilizing a command-line interface, CGMiner allows remote mining and grants users direct control over settings like fan speeds. The software also excels in swiftly detecting new blocks and easily scaling up hashing power without delays.\n\nWhile Linux-based, CGMiner can run on Mac and Windows computers, offering cross-platform compatibility. Additionally, it supports a wide range of mining hardware, including FPGAs, GPUs, and CPUs, apart from ASICs. However, its lack of a graphical user interface might be more suitable for advanced users. Installing challenges have also been observed on Windows 10 systems due to conflicts with antivirus software like Windows Defender. CGMiner is freely available for download and use on GitHub.\n\n2. BFGMiner\n\nBFGMiner, introduced in 2012 by Luke Dashjr, is a highly favored mining software, ranking second to CGMiner in popularity. It stands out for its robust customization options, enabling users to monitor hardware temperature, manage rigs remotely, and even detect and initiate idle threads.\n\nOriginally designed to add FPGA support to a popular GPU miner, BFGMiner is compatible exclusively with FPGA and ASIC hardware. Written in C, the software runs on Linux, Mac, and Windows and can even be installed on Raspberry Pi. Notably, BFGMiner supports simultaneous mining of multiple cryptocurrencies, allowing users to hedge and diversify their risk across various mining algorithms like Scrypt and SHA256d.\n\nBFGMiner’s command-line interface, featuring customizable hotkeys, makes it user-friendly for advanced users, but its lack of a GUI may present challenges for beginners. Nonetheless, the software is freely available for download and use, making it a desirable choice for those seeking a powerful and flexible mining solution.\n\n3. MultiMiner\n\nMultiMiner, developed in 2013 by Nate Woolls, the creator of BFGMiner, offers a user-friendly experience with its intuitive GUI and quick-start mining features, making it a top choice for ease of use. Unlike many mining software requiring coding skills, MultiMiner caters to novices by guiding them through installation and automatically scanning hardware details, including average hashing power and linked pools.\n\nThe software further simplifies pool connection setup and provides remote access to mining rigs. It allows users to choose their mining strategy and automatically mine the most profitable or lowest-difficulty cryptocurrency, with estimated profits displayed.\n\nTargeted at Windows users, MultiMiner necessitates supplementary software for installation on Mac and Linux systems; however, the provided instructions simplify this procedure. Additionally, the software enables seamless transitioning between mining rigs, supporting GPUs, ASICs, and FPGAs. Novices appreciate the user-friendly interface, while advanced users can access more sophisticated features such as API settings and engine arguments. MultiMiner is available for free download and use, making it a valuable and accessible mining solution for both newcomers and experienced miners.\n\n4. Awesome Miner\n\nDeveloped by IntelliBreeze in 2014, Awesome Miner is a Windows-based cryptocurrency mining management application known for its centralized management capabilities, allowing users to efficiently handle multiple mining engines and pools through its user-friendly dashboard.\n\nThis powerful software supports various mining hardware types, including ASICs and FPGAs, and is compatible with over 50 mining engines and popular mining algorithms like SHA-256, Scrypt, X11, Ethereum, and Zcash. Users can effortlessly add, switch, and manage multiple miner pools with one-click convenience, streamlining the mining setup process. Awesome Miner’s comprehensive dashboard also provides crucial hardware information, such as fan speed and temperature. Moreover, miners can leverage the built-in C# script engine to create custom triggers and actions, enhancing mining control and optimization.\n\nWhile primarily designed for Windows and Linux, Awesome Miner offers web access through any computer or browser, ensuring convenient management from various devices. As a free-to-use solution, Awesome Miner proves to be a valuable asset for maximizing profits and minimizing downtime in large-scale cryptocurrency mining operations.\n\nSee More: What Is a Software Engine? Types, Applications, and Importance\n\nBest Practices for Mining Bitcoin\n\nNow that you have a grasp of the intricacies of Bitcoin mining, let’s delve into five essential best practices to optimize your Bitcoin mining endeavors:\n\n1. Research and planning\n\nBefore diving into Bitcoin mining, conduct thorough research to understand the process, hardware requirements, and potential profitability. Create a well-thought-out mining plan that includes factors like initial investment, energy costs, and expected returns. Stay updated with the latest developments in the mining industry.\n\n2. Invest in quality hardware\n\nBitcoin mining requires specialized hardware known as ASICs. Invest in high-quality and efficient ASIC miners to optimize your mining performance and increase profitability. Regular consumer-grade computers or GPUs are not suitable for competitive Bitcoin mining.\n\n3. Join a mining pool\n\nBitcoin mining has become highly competitive, and mining solo may not yield consistent rewards. Joining a mining pool allows you to combine your computational power with other miners, increasing the chances of finding blocks and receiving regular rewards. Choose a reputable and reliable mining pool with a fair reward distribution system.\n\n4. Monitor and optimize\n\nRegularly monitor your mining operation’s performance, including hash rate, hardware temperature, and power consumption. Optimize your mining setup to ensure maximum efficiency and reduce energy costs. Consider adjusting mining strategies based on market conditions and network difficulty.\n\n5. Secure and backup your wallet\n\nSet up a secure Bitcoin wallet to store your mined Bitcoins. Choose hardware or trusted software wallets with robust security features to protect your earnings from potential hacks or cyber threats. Regularly back up your wallet keys and critical data to prevent data loss.\n\nFollowing these best practices can enhance your Bitcoin mining experience and increase your chances of running a successful and profitable mining operation. Remember that mining Bitcoin requires dedication, continuous monitoring, and adapting to changing market conditions.\n\nSee More: What Is Jenkins? Working, Uses, Pipelines, and Features\n\nTakeaway\n\nThe future of Bitcoin mining looks promising but is also evolving with various challenges. As more individuals and institutions adopt cryptocurrencies, the demand for mining is expected to rise. However, the mining process’s energy consumption and environmental impact have raised concerns, leading to the exploration of more sustainable solutions.\n\nTo address the energy issue, there is a growing interest in renewable energy sources for mining operations. Additionally, mining hardware and software advancements will likely improve efficiency and reduce costs.\n\nAs the Bitcoin network matures, further regulatory developments and increased government oversight may impact mining operations in different regions. Overall, Bitcoin mining is poised for growth and innovation, but it will require continuous adaptation to remain sustainable in an evolving landscape.\n\nDid this article help you understand Bitcoin mining better? Comment below or let us know on FacebookOpens a new window , XOpens a new window , or LinkedInOpens a new window . We’d love to hear from you!\n\nImage source: Shutterstock"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmJ1c2luZXNzLmNvbS9hcnRpY2xlcy9yZWFzb25zLXJlc3RhdXJhbnRzLWFjY2VwdC1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Pros and Cons of Accepting Bitcoin in Restaurants - Business.com",
        "content": "While cryptocurrency isn’t as commonplace as emerging payment methods like mobile wallets and other digital payment forms, its use has become more widespread in recent years – and small business owners are taking note.\n\nBitcoin is the most popular cryptocurrency working its way into the mainstream. If you own a restaurant, you might think about accepting Bitcoin as a payment form to attract more customers to your restaurant and increase your restaurant’s profits. However, you may also be wary of Bitcoin’s price volatility and how it integrates with restaurant accounting systems.\n\nWe’ll explore Bitcoin and how it works and examine the benefits and challenges of accepting Bitcoin as a restaurant payment option.\n\nEditor’s Note: Considering a POS system? We can help you choose the one that’s right for you. Use the questionnaire below to have our sister site, BuyerZone, provide you with information from a variety of vendors for free:\n\nWhat is Bitcoin? Bitcoin was created in 2009, making it the first modern cryptocurrency. It is an all-digital currency that relies on peer-to-peer blockchain technology for tracking and trading. No centralized system, bank or government backs Bitcoin. Although Bitcoin was primarily designed as a payment form, most people currently use Bitcoin and its cryptocurrency cousins for investment purposes. Still, Bitcoin is by far the most common cryptocurrency businesses accept as payment. In 2021, Pew Research found that 16% of Americans (and 31% of Americans between 18 and 29) have invested in Bitcoin and other cryptocurrencies, and over 15,000 companies around the world accept Bitcoin, according to Zippia. FYI Did you know If your personal Bitcoin holdings increase in value, the IRS considers that a taxable event, and you’ll pay up to 37% on your profits. Consider hiring a CPA well-versed in crypto to stay compliant.\n\nHow does Bitcoin work? To accept Bitcoin in your restaurant, you’ll need to sign up for a Bitcoin merchant wallet account via an online platform like Confirmo, BitPay, or CoinGate. Many of these crypto wallets integrate with the best POS systems, as well as shopping cart and commerce platforms. Some of the best credit card processors accept cryptocurrency payments, making it easier for merchants to support Bitcoin payments. A typical restaurant payment transaction with Bitcoin would go something like this: The restaurant shows the Bitcoin-paying customer a QR code. The customer scans the QR code; their personal crypto wallet reads the virtual address where it should send the payment. This address is usually a one-time destination code. The customer enters their private key, which is like a password, to verify the transaction. Depending on your restaurant’s POS software or accounting software, you may be able to convert the Bitcoin payment into U.S. dollars for easy accounting and tax keeping. Did You Know? Did you know When a business accepts credit cards, transaction approval or denial is immediate. With Bitcoin, it can take up to an hour. Most Bitcoin merchants wait for the sixth blockchain confirmation before deeming a transaction successful.\n\nShould your restaurant accept bitcoin? There are several compelling reasons why your restaurant should accept cryptocurrency, but you’ll need to seriously weigh the downsides before making a decision. Here are some upsides of accepting Bitcoin in your restaurant: Lower transaction fees. Merchant service providers charge up to 4% per transaction – or even more if your diner is from overseas. Crypto fees can be 1% or less – but watch out for transaction fees called gas fees, particularly with Ethereum.\n\nMerchant service providers charge up to 4% per transaction – or even more if your diner is from overseas. Crypto fees can be 1% or less – but watch out for transaction fees called gas fees, particularly with Ethereum. Better cash flow. You might wait days to receive the cash from your merchant services provider for customer payments via credit card. With Bitcoin, you’ll receive it within the hour.\n\nYou might wait days to receive the cash from your merchant services provider for customer payments via credit card. With Bitcoin, you’ll receive it within the hour. No PCI compliance is required. PCI compliance doesn’t apply to Bitcoin transactions. However, this perk doesn’t count for much if you still take debit and credit card payments alongside Bitcoin payments.\n\nPCI compliance doesn’t apply to Bitcoin transactions. However, this perk doesn’t count for much if you still take debit and credit card payments alongside Bitcoin payments. Business from Bitcoin believers. Many Bitcoin holders are enthusiastic about cryptocurrency and its perceived ability to improve the financial system. If you accept Bitcoin, these individuals may seek you out to support your restaurant. “For marketing-savvy businesses, it is definitely a differentiator to be able to accept Bitcoins, and if you are trying to attract an audience that uses Bitcoin, you may be perceived as a techno-savvy restaurant or establishment,” according to technology futurist and podcast host Ian Khan.\n\nMany Bitcoin holders are enthusiastic about cryptocurrency and its perceived ability to improve the financial system. If you accept Bitcoin, these individuals may seek you out to support your restaurant. “For marketing-savvy businesses, it is definitely a differentiator to be able to accept Bitcoins, and if you are trying to attract an audience that uses Bitcoin, you may be perceived as a techno-savvy restaurant or establishment,” according to technology futurist and podcast host Ian Khan. No chargebacks. Accepting Bitcoin means you can avoid chargebacks. Unlike standard credit and debit cards, consumers can’t contact Bitcoin to have a transaction reversed. The only way you’ll ever reimburse a customer is if you choose to do so. Here are the downsides of accepting Bitcoin in your restaurant: Price volatility. Cryptocurrency exchange rate swings tend to be much more severe in both directions than traditional currency. Here’s an example of Bitcoin’s price volatility and how it might affect your restaurant: Let’s say your restaurant hosts a party of Cambodian citizens celebrating their country’s independence day on November 9, 2021. They spend $1,000. If you took that money in U.S. dollars, it would lose some value through inflation. Bitcoin’s value on that day was $66,938, but on June 18, 2022, it was worth $18,948.80 – a drop of 71.7%. If you accept Bitcoin, you’re also accepting its volatility.\n\nCryptocurrency exchange rate swings tend to be much more severe in both directions than traditional currency. Here’s an example of Bitcoin’s price volatility and how it might affect your restaurant: Let’s say your restaurant hosts a party of Cambodian citizens celebrating their country’s independence day on November 9, 2021. They spend $1,000. If you took that money in U.S. dollars, it would lose some value through inflation. Bitcoin’s value on that day was $66,938, but on June 18, 2022, it was worth $18,948.80 – a drop of 71.7%. If you accept Bitcoin, you’re also accepting its volatility. Wallet security. You may lose all your cryptocurrency if you choose a fake crypto exchange or if your legitimate provider goes under. In financial terms, crypto is still the Wild West compared to standard financial products.\n\nYou may lose all your cryptocurrency if you choose a fake crypto exchange or if your legitimate provider goes under. In financial terms, crypto is still the Wild West compared to standard financial products. Future regulation is a distinct possibility. Future regulations are possible if Bitcoin continues to grow in popularity and use. Regulations will likely make handling crypto more difficult and expensive.\n\nFuture regulations are possible if Bitcoin continues to grow in popularity and use. Regulations will likely make handling crypto more difficult and expensive. Accounting may be more challenging. Most cloud-based accounting packages aren’t set up to handle Bitcoin transactions. This will make bookkeeping more challenging, especially if you’re regularly converting from dollar to Bitcoin and vice versa. Tip Bottom line If you decide to accept Bitcoin, share the news via social media posts and signage in your restaurant. Consider promoting your restaurant by registering with websites like Coinmap.org and SpendBitcoins to draw in crypto users."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMzAvYml0Y29pbi1taW5lci1hbnRwb29sLXRvLXJlZnVuZC1yZWNvcmQtM20tYnRjLXRyYW5zYWN0aW9uLWZlZS_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzExLzMwL2JpdGNvaW4tbWluZXItYW50cG9vbC10by1yZWZ1bmQtcmVjb3JkLTNtLWJ0Yy10cmFuc2FjdGlvbi1mZWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Miner AntPool to Refund Record $3M BTC Transaction Fee - CoinDesk",
        "content": "Last Thursday, AntPool received the standard 6.25 bitcoin (BTC) as well as 85.2163 BTC in fees for all transactions included in that erroneous transaction, on-chain data shows. The sender's wallet was set up just minutes before the transfer, and the recipient received only 55.78 BTC of the original 139.42 BTC that was sent."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTIvMDEvYml0Y29pbi1oaXRzLWhpZ2hlc3QtbGV2ZWwtc2luY2UtbWF5LTIwMjItdG8ta2ljay1vZmYtZGVjZW1iZXItY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin hits highest level since May 2022 to kick off December - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin hits highest level since May 2022 to kick off December: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Grayscale Chief Legal Officer Craig Salm discusses what he believes will happen with the asset manager's plans to convert its bitcoin and ethereum trusts into ETFs."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTMwL3NheWxvci1zLW1pY3Jvc3RyYXRlZ3ktbXN0ci1idXlzLWFsbW9zdC02MDAtbWlsbGlvbi1vZi1iaXRjb2luLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Saylor’s MicroStrategy (MSTR) Buys Almost $600 Million of Bitcoin (BTC) - Bloomberg",
        "content": "MicroStrategy Inc. chairman and co-founder Michael Saylor placed one of his biggest bets yet, with the enterprise-software maker turned Bitcoin investment-fund proxy purchasing $593.3 million more of the largest cryptocurrency.\n\nThe Tysons Corner, Virginia-based firm said in a filing Thursday that it bought 16,130 Bitcoin in November, raising its holdings to roughly $6.5 billion. It was the company’s biggest purchase since it bought 19,452 Bitcoin for just over $1 billion in February 2021."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbXlzdGVyaW91cy1hZGRyZXNzLXRoYXQtYWRkZWQtMTBrLWJpdGNvaW4taXMtanVzdC1hLW5ldy1iaXRtZXgtd2FsbGV0L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbXlzdGVyaW91cy1hZGRyZXNzLXRoYXQtYWRkZWQtMTBrLWJpdGNvaW4taXMtanVzdC1hLW5ldy1iaXRtZXgtd2FsbGV0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "'Mysterious' Address That Added 10K Bitcoin Is Just a New BitMEX Wallet - CoinDesk",
        "content": "BitMEX was probably conducting an internal transfer because it is migrating most of its bitcoin holdings from the 3BMEX format to addresses with format bc1qmex, the firm said. There are also Bitcoin addresses that start with “bc1q” that support SegWit, a type of bitcoin transaction, natively, allowing more efficient transactions that can pay lower fees."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1oaXRzLTM4OGstZm9yLWZpcnN0LXRpbWUtaW4tb3Zlci1hLXllYXIv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8wMS9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLWhpdHMtMzg4ay1mb3ItZmlyc3QtdGltZS1pbi1vdmVyLWEteWVhci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Hits $38.8K for First Time in Over a Year - CoinDesk",
        "content": "The Brazilian Senate approved new income-tax regulations that could mean citizens will face paying up to 15% on earnings from cryptocurrencies held on international exchanges, Yahoo Finance reported Thursday. The regulation, if sanctioned by President Luiz Inacio Lula da Silva, could be effective as of Jan. 1. The bill has been approved by the Chamber of Deputies. Those affected will be Brazilians earning more than $1,200 from foreign exchanges and investment funds with a single shareholder. According to Yahoo Finance, the government set a revenue target of $4 billion for these taxes in the new year."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL2xhY3Jvc3NldHJpYnVuZS5jb20vYnJhbmRhdmVzdHVkaW9zL3VudmVpbGluZy1iaXRjb2lucy1wcmljZS1kcml2ZXJzLWtleS1rbm93bGVkZ2UtZm9yLXdpc2NvbnNpbi1yZXNpZGVudHMvYXJ0aWNsZV9mMjZiMjk3MS1kZDE4LTVhNWEtOTFkMy1mZDFlMTY2NTdkNGUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Unveiling Bitcoin's price drivers: Key knowledge for Wisconsin residents - La Crosse Tribune",
        "content": "Bitcoin (BTC) is the world's most popular digital currency, and in contrast to flat currencies like the dollar, pound, yen, and euro, it isn't issued by any government. So, how is Bitcoin valued? This article will explore the price drivers behind the digital coin, such as supply and demand, regulation, cost of production, and news and competition, highlighting why these factors make Bitcoin a volatile asset for investors in Wisconsin and the United States.\n\nBitcoin price dynamics: supply and demand impact\n\nSupply and demand will be familiar to those with an economic background. However, if this term seems alien to you, this explanation will help you understand how this concept directly affects the price of Bitcoin and the cryptocurrency market. For example, supply and demand work together to determine the quantity of a specific commodity and its market price. As this price increases, the demand for economic goods declines. This means sellers will create more of the commodity or vice-versa. This dynamic holds for Bitcoin and other cryptocurrencies, just like it does for the spot price of commodities (such as oil) that use flat exchange rates, for example, USD to GBP.\n\nImpact of competitive markets and news on Bitcoin\n\nWith cryptocurrencies becoming ever-more popular worldwide, Bitcoin has seen an influx of competition to its throne as the go-to crypto, which affects its price. Altcoins like Ethereum (ETH) and meme coins like Dogecoin (DOGE) have given investors plenty of ways to diversify their cryptocurrency portfolios. For example, any improvements to an altcoin like Ethereum may see Bitcoin's price plummet. Furthermore, media attention can fuel speculation and turn up price volatility. For instance, negative press surrounding cryptocurrencies, specifically Bitcoin, can lead to panic-selling by some Bitcoin owners, ultimately driving its price down. Alternatively, the inverse is also true, and positive news surrounding Bitcoin and cryptocurrencies can move its price upwards.\n\nImpact of accessibility and liquidity on Bitcoin prices\n\nThe accessibility of Bitcoin will significantly influence its price now and in the future. For example, the more widely adopted Bitcoin becomes, the more valuable it will be. For instance, crypto-friendly governments and countries like Switzerland, the first country to offer crypto companies business accounts in 2018, will positively affect Bitcoin's price. Furthermore, liquidity is something to consider when analyzing the price drivers behind Bitcoin. This is because Bitcoin is regarded as the most liquid cryptocurrency currently available to investors; why? Because it can be easily bought and sold on exchanges and converted for cash. While liquidity is often good for price stability, it's important to remember that changes in liquidity can cause Bitcoin prices to swing.\n\nBitcoin price drivers: risks and investing insights\n\nAnother factor that can affect Bitcoin's price is risks that may affect its supply and demand. For example, due to its digital nature, Bitcoin can be prone to events such as cyber-attacks. For instance, individuals' crypto wallets or the exchanges they hold Bitcoin on may get hacked, creating instability in Bitcoin's price. Moreover, regulations surrounding cryptocurrencies and Bitcoin vary in different countries and states in the US. This means there is always a chance that laws may be passed that could nationally and internationally affect the ownership of Bitcoin and its liquidity. However, rules and regulations set by governments can lead to surges in Bitcoin prices; for instance, cryptocurrency groups are expanding in Hong Kong due to the rules and restrictions placed upon digital currencies in mainland China.\n\nFinal notes: unveiling Bitcoin's price drivers\n\nInvestors in Wisconsin and the United States must note that the cryptocurrency market is highly volatile and influenced by government regulations, liquidity, competition between digital currencies, news surrounding cryptocurrencies, and supply and demand. In turn, this makes predicting the exact price movements of Bitcoin challenging; however, improvements in scalability, security, and privacy features may increase confidence in Bitcoin and make it a more appealing investment for a bigger audience in the future.\n\nInformation on this website is intended for educational purposes only and is not to be used as investment advice. As with all investments, there is risk, and the past performance of a particular asset class does not guarantee any future performance.\n\nThis provided content was produced by Lee Enterprises. The news and editorial departments had no role in its creation or display."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy5iZWFjb25qb3VybmFsLmNvbS9zdG9yeS9uZXdzL2xvY2FsLzIwMjMvMTEvMzAvYml0Y29pbi1jcnlwdG9jdXJyZW5jeS1jcnlwdG8tbWluaW5nLWNvbXBhbnktY2hpbmEtYWtyb24tb2hpby1oZWFkcXVhcnRlcnMtbmVhci1nb29keWVhci83MTQ3MzU2MDAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin cryptocurrency mining company operating in Akron, Ohio - Akron Beacon Journal",
        "content": "No commitment required. Cancel anytime.\n\n*Offer available to new customers only. All savings based off the regular rate.\n\nRead the full Subscription Terms and Conditions."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbWljcm9zdHJhdGVneS1ib3VnaHQtNjAwbS1vZi1idGMtaW4tbm92ZW1iZXItaW5jcmVhc2VkLWhvbGRpbmdzLWJ5LTEwL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbWljcm9zdHJhdGVneS1ib3VnaHQtNjAwbS1vZi1idGMtaW4tbm92ZW1iZXItaW5jcmVhc2VkLWhvbGRpbmdzLWJ5LTEwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy Bought $600M of BTC in November, Increased Holdings by 10% - CoinDesk",
        "content": "The Michael Saylor-founded software developer bought the bitcoin for around $593.3 million in cash at an average price of about $36,785 apiece, according to a regulatory filing on Thursday. It now holds 174,530 BTC bought at an average of about $30,252 per coin."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvYml0Y29pbi1yaXNlcy10by0zODhrLWZvci10aGUtZmlyc3QtdGltZS1zaW5jZS1tYXktMjAyMi_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzAxL2JpdGNvaW4tcmlzZXMtdG8tMzg4ay1mb3ItdGhlLWZpcnN0LXRpbWUtc2luY2UtbWF5LTIwMjIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Rises to $38.8K for the First Time Since May 2022 - CoinDesk",
        "content": "“In terms of seasonality, December is considered a relatively neutral month of the year, adding half the time over the past 12 years,” Alex Kuptsikevich, FxPro senior market analyst, said in an email. “The average gain is 30.8%, while the average decline is 12.8%.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNoYWVsLXNheWxvcnMtbWljcm9zdHJhdGVneS1tYWtlcy1iaWdnZXN0LTIwMjMwOTAwOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy makes its biggest bitcoin purchase in years as Wall Street grows more bullish - Yahoo Finance",
        "content": "MicroStrategy's Michael Saylor Joe Raedle/Getty Images\n\nMicroStrategy bought $593.3 million of bitcoin through November, its latest filing shows.\n\nThat's its largest purchase since a $1 billion acquisition in February 2021.\n\nChairman Michael Saylor is pursuing a strategy of acquiring as much bitcoin as possible.\n\nMicroStrategy bought $593.3 million worth of bitcoin this month, marking the firm's largest purchase in nearly three years.\n\nA Thursday filing disclosed that the company added 16,130 tokens to its holdings in November, purchased at an average price of $36,785 per bitcoin. MicroStrategy's total trove of bitcoins is now valued around $6.5 billion.\n\nThis month's bitcoin spree was the firm's biggest since February 2021, when MicroStrategy spent $1 billion to add 19,452 tokens, Bloomberg reported.\n\nIt comes as the asset is attracting renewed attention, amid growing confidence that a bitcoin spot ETF is soon to be approved by federal regulators.\n\nThe bullishness is seen in recent forecasts, which put the price at $100,000 by the end of next year, more than doubling after it already jumped 127% this year to $37,788.\n\nMicroStrategy's November purchase is also in line with Chairman Michael Saylor's plan to acquire as much of the cryptocurrency as possible on expectations that the token's market dominance would escalate aggressively.\n\n\"I think that the public is beginning to realize that bitcoin is the next bitcoin,\" he said in August. \"The next logical step is for bitcoin to 10x from here and then 10x again.\"\n\nEarlier bitcoin purchases also saw MicroStrategy sell shares to buy bitcoin, including a $150 million purchase between August and September.\n\nThe latest filing also disclosed that MicroStrategy entered an agreement for a possible $750 million sale of class A common stock.\n\nGiven the enormity of its bitcoin trove, MicroStrategy's stock performance has mirrored the token's surge in 2023, with shares up 174.68% this year.\n\nRead the original article on Business Insider"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbGlja29ybGFuZG8uY29tL2dldHRpbmctcmVzdWx0cy8yMDIzLzExLzMwL3VzLXNlY3JldC1zZXJ2aWNlLWxhdW5jaGVzLWNlbnRyYWwtZmxvcmlkYS1iaXRjb2luLWF0bS13YXJuaW5nLWNhbXBhaWduL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "US Secret Service launches Central Florida bitcoin ATM warning campaign - WKMG News 6 & ClickOrlando",
        "content": "ORLANDO, Fla. – The U.S. Secret Service Cyber Task Force began a seven-county Central Florida campaign Thursday to post warning signs at 433 identified ATM bitcoin hubs used in schemes across the state.\n\nFederal agents tell News 6 that conmen use scare tactics to convince victims to move their money to the digital accounts and the machines allow complete control once the money is transferred from cash to cryptocurrency.\n\nAn Orange County woman recently lost $21,000 when she transferred money to bitcoin accounts.\n\nThe victim told News 6 that imposters claiming to be with Bank America provided QR codes to transfer.\n\n[EXCLUSIVE: Become a News 6 Insider (it’s FREE) | PINIT! Share your photos]\n\nU.S. Secret Service Special Agent-in-charge Caroline O’Brien-Buster said the financial fallout in cryptocurrency scams has been overwhelming, with some victims pumping their life savings into bitcoin accounts set up by thieves.\n\nAccording to the Federal Trade Commission, Americans reported losses of more than $1 billion to cryptocurrency and bitcoin schemes between January and September of this year.\n\nFind more reports from our News 6 Investigators on YouTube:\n\nThe warning signs will posted on store windows and next to cryptocurrency ATMs.\n\n“The fliers we’re putting up focus on six of our highest types of (crypto) fraud‚” Obrien-Buster told News 6. “We’re hoping that by putting these up at the bitcoin ATMs or the windows at these different establishments, that a victim who’s fallen for one of these will think twice about putting their money into a bitcoin ATM.”\n\n[STORY CONTINUES BELOW IMAGE]\n\nBe on the lookout for these scams.\n\nTask force members from the Secret Service Orlando office, Seminole County Sheriff’s Office as well as officers from Lake Mary and Casselberry police departments delivered warning posters to roughly 70 ATM locations identified as bitcoin hubs in Seminole county.\n\nThe U.S. Secret Service has already run similar door-to-door poster campaigns at businesses in Washington D.C. and Tennessee with great success.\n\nNews 6 accompanied task force members and found merchants were completely cooperative, allowing agents to display the warning posters without reservation.\n\nSpecial Agent Matthew Roberts said the posters make clear “what could happen.”\n\n“Merchants have been very cooperative they want to work with law enforcement,” Roberts told News 6. “They understand the scams that have been going on but sometimes they don’t and we have to explain to them the machines have some good purposes but they can also be used in a scam.”\n\nO’Brien-Buster said the cyber task force will post warning signs at the remaining identified ATM bitcoin locations over the next few months.\n\nThose counties include Citrus, Lake, Sumter, Orange, Osceola and Brevard.\n\nIf you have been duped in a cryptocurrency ATM scheme, call the Secret Service Orlando office at 407-648-6333.\n\nOr you can email makeendsmeet@wkmg.com or text the words “make ends meet” along with your name and issue to 407-676-7428.\n\nGet today’s headlines in minutes with Your Florida Daily:"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbGlja29ybGFuZG8uY29tL25ld3MvaW52ZXN0aWdhdG9ycy8yMDIzLzEyLzAxL2JhbmstaW1wb3N0ZXJzLXVzZS1iaXRjb2luLWF0bS10by1zdGVhbC0yMWstZnJvbS1vcmFuZ2UtY291bnR5LXdvbWFuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bank imposters use bitcoin ATM to steal $21K from Orange County woman - WKMG News 6 & ClickOrlando",
        "content": "ORLANDO, Fla. – An Orange County woman lost $21,000 in cryptocurrency transactions orchestrated by imposters posing as security investigators with Bank of America.\n\nBarbara, who asked we only use her first name, saved the screenshot of the caller ID that clearly shows Bank of America.\n\nShe told News 6 the imposters claimed her account was being accessed by people she had never heard of and that she needed to withdraw all of the cash from her account and transfer it to bitcoin accounts to protect it.\n\n“They said they were from Bank of America,” Barbara told News 6. “And I have Bank of America logos and everything, everything is showing Bank of America.”\n\nOne of the imposters emailed her four QR codes to be used in bitcoin transactions, each with a Bank of America logo.\n\n“‘There’s a place on Colonial Drive,’ he’s directing me now (Colonial Liquor),” she recalled.\n\nFind more reports from our News 6 Investigators on YouTube:\n\nThe victim admits she had never heard of a bitcoin hub but was convinced this was the only way to protect her money.\n\nAt one point they told her the people trying to access her bank account worked for the bank.\n\nSpecial agent in charge Caroline O’Brien-Buster said the Secret Service Cyber Task Force is launching a seven-county alert from Citrus to Brevard counties to warn potential victims of the tactics used in cryptocurrency schemes.\n\nThe task force will post signs on store windows and near the ATM machines identified at roughly 433 locations.\n\nThis week, the task force posted cryptoscam warnings at roughly 70 locations in Seminole County.\n\n“We just want to bring awareness out to the community,” O’Brien-Buster said. “There’s just so many people being victimized by fraudsters and being told to use bitcoin ATMs.”\n\nThe Federal Trade Commission said between January and September this year, Americans lost more than $1 billion in cryptocurrency scams ranging from bank fraud to romance scams.\n\nThe posters highlight the six common scams used by the conmen including:\n\nWere you encouraged to send cryptocurrency to repair a virus on your computer?\n\nWere you told the only way to protect your money was by making deposits to cryptocurrency ATMs?\n\nDid someone ask you to lie to the bank or keep the reason for your cryptocurrency purchase a secret?\n\nThe poster also advises consumers “scammers may use cryptocurrencies because the transactions are irreversible and hard to trace.”\n\n“This is happening across the country,” Obrien-Buster said. “The reason the Secret Service is so focused on placing these fliers at the different establishments is because the deception is so prolific.”\n\nIn Barbara’s case, Obrien-Buster said the money is likely gone.\n\nIf you have been caught in a bitcoin ATM scam, contact the U.S. Secret Service Orlando Field Office at 407-648-6333.\n\nGet today’s headlines in minutes with Your Florida Daily:"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5ncmVlbnBlYWNlLm9yZy91c2EvbmV3cy9pbXBhY3RlZC1jb21tdW5pdGllcy1hbmQtZW52aXJvLWFkdm9jYXRlcy1yZWFjdC10by1uZXctcmVwb3J0LXNob3dpbmctY3J5cHRvbWluaW5ncy1tYXNzaXZlLXdhdGVyLWNvbnN1bXB0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Impacted Communities and Enviro Advocates React to New Report Showing Cryptomining’s Massive Water ... - greenpeace.org",
        "content": "Impacted Communities and Enviro Advocates React to New Report Showing Cryptomining’s Massive Water Consumption\n\nWashington, DC (November 30, 2023) – On Thursday, environmental advocates from across the country held a press conference following a groundbreaking report outlining the astounding volume of water used to mine Bitcoin. Published by Alex de Vries in the peer-reviewed Cell Reports Sustainability journal, the report is the first comprehensive estimate of total water consumption in the global Bitcoinindustry.de Vries joined national environmental advocates and local community members from New York, Texas, Pennsylvania, and Kentucky to address the concerning impact of nearby Bitcoin mining operations on water supplies and community health. Bitcoin mining’s significant water usage poses a pressing concern amid the global water crisis, with potential for even faster growth in water demand. The report warns that the sheer scale of Bitcoin mining’s water usage could impact drinking water supplies if it continues to operate without constraints, especially in countries that are already battling water scarcity, including the United States.\n\nNot only are Bitcoin mining plants using massive amounts of water to operate, they also often discharge the water back into local water supplies or wastewater treatment facilities. This thermal pollution endangers health and wildlife habitability, including but not limited to potential harmful algal blooms, fish deaths, biodiversity loss and migration, oxygen depletion, direct thermal shock, and changes in dissolved oxygen.\n\nWatch the virtual press conference here.\n\nProof-of-work cryptocurrency mining is an energy-intensive process that requires a massive fleet of single-purpose machines to operate around the clock in a race to guess numbers. A large amount of water is used to cool the computers at large data centers. In addition to cooling computers, coal and gas-fired power plants that generate electricity to power the mining must also use water to manage the temperature.\n\nThe recent report found the following:\n\nIn 2021, Bitcoin mining consumed over 1,600 gigaliters (GL) of water worldwide\n\nIn the United States, Bitcoin mining consumes about 93 GL to 120 GL of water every year, equivalent to the average water consumption of 300,000 U.S. households or a city like Washington, D.C.\n\nEach transaction on the Bitcoin blockchain uses 16,000 liters of water on average, about 6.2 million times more than a credit card swipe, or enough to fill a backyard swimming pool.\n\nThe water footprint of Bitcoin in 2021 significantly increased by 166% compared with 2020, from 591.2 to 1,573.7 GL, and it is only expected to increase to 2,300 GL in 2023.\n\nAlex deVries, the paper’s author and a Ph.D. student at Vrije Universiteit Amsterdam said, “Bitcoin is now responsible for consuming more water than the entire traditional financial system (bank notes + bank branches + ATMs + cashless transactions) combined. On average a backyard swimming pool worth of fresh water (over 16000 liters) goes up in smoke for every single transaction processed on the Bitcoin blockchain. This is about 6.2 million times more than the amount of water consumed for a regular credit card swipe. Many parts of the world are experiencing droughts, and fresh water is becoming an increasingly scarce resource. If we continue to use this valuable resource for making useless computations, I think that reality is really painful.”\n\nErik Kojola, Greenpeace USA Senior Researcher said, “This groundbreaking report underscores the widespread environmental impacts of Bitcoin mining. Bitcoin mining’s alarming water consumption is a stark reminder that the unbridled growth of this industry poses a direct threat to global water resources and necessitates immediate action. Furthermore, the disheartening contradiction of financial institutions, including BlackRock, Chase, Fidelity, and others, investing in Bitcoin mining despite their professed ESG goals raises serious concerns. The finance industry needs to accelerate action to address the environmental damage from its investment decisions – and it can start by engaging with us to clean up Bitcoin by transitioning away from the energy-intensive Proof-of-Work system.”\n\nMandy DeRoche, Deputy Managing Attorney at Earthjustice said, “For decades, fossil fuel power plants have been significant sources of water pollution, and energy-intensive cryptocurrency mining only prolongs this pollution. Examples like the Fortistar gas plant in North Tonawanda, New York, the Stronghold waste coal plants in Pennsylvania, and the Merom coal plant in Indiana all demonstrate the urgent need for regulatory oversight to mitigate environmental harms caused by these operations and to protect nearby communities.”\n\nAbi Buddington, member of Seneca Lake Guardian and Secretary of the Committee to Preserve the Finger Lakes said, “The Finger Lakes region, my home, faces peril from the escalating cryptomining industry, exemplified by the Greenidge Generation plant situated a mile from my property since 2020. With its massive water withdrawals from Seneca Lake and discharge into Keuka Lake Outlet, their extensive pollution, including harmful elements like arsenic and magnesium, imperils our precious ecosystem. As local New Yorkers devoted to safeguarding our natural heritage, we demand accountability for the environmental havoc caused by this industry. Seneca Lake’s splendor, and its surrounding community, deserve greater protection and respect.”\n\nJackie Sawicky of the Texas Coalition Against Cryptomining said,“Navarro County in particular, and Texas in general have serious drought issues. In the era of climate change and worsening drought, we should be exceedingly discerning with every drop of water we use. We have real industries that produce real products here and the Riot Platforms bitcoin “mine” will use more water per day than all of them. For what? To guess and throw away numbers in a digital lottery that most Texans want nothing to do with.”\n\nContact: Gujari Singh, Greenpeace USA Senior Communications Specialist, [email protected], (631) 404-9977; Ana Hall, Pythia Public, [email protected], 914-874-9288\n\nGreenpeace USA is part of a global network of independent campaigning organizations that use peaceful protest and creative communication to expose global environmental problems and promote solutions that are essential to a green and peaceful future. Greenpeace USA is committed to transforming the country’s unjust social, environmental, and economic systems from the ground up to address the climate crisis, advance racial justice, and build an economy that puts people first. Learn more at www.greenpeace.org/usa."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTAxL2JpdGNvaW4tYnRjLWJyaW5ncy00MC0wMDAtcHJpY2UtaW50by12aWV3LW9uLWV0Zi1mZWQtYmV0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Brings $40,000 Price Into View on ETF, Fed Bets - Bloomberg",
        "content": "Bitcoin ’s chances of hitting $40,000 are top of mind for crypto speculators as they head into the final stretch of a year during which the largest digital asset more than doubled in price.\n\nThe token has rebounded about 130% over the past 11 months from 2022’s crypto rout, outstripping investments like stocks or gold . Hopes for Federal Reserve interest-rate cuts next year, and expectations that the US will allow its first spot Bitcoin exchange-traded funds, together created a potent elixir."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmRlbnRhbGVjb25vbWljcy5jb20vbW9uZXkvYXJ0aWNsZS8xNDI5OTc2NS9iaXRjb2luLWluLWRlbnRpc3RyeS10aGUtZnV0dXJlLW9mLW1vbmV50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin in dentistry: The future of money - Dental Economics",
        "content": "In an age when technological advancements are redefining every profession, dentistry isn’t untouched. Artificial intelligence (AI), digital radiography, teledentistry, and intraoral scanners are just a few examples. But beyond dentistry-specific technology, there’s a financial revolution that every dentist—in fact, every professional—should be aware of: Bitcoin.\n\nWhat is Bitcoin?\n\nBitcoin is a digital currency that operates without a central authority or single administrator. Instead, it allows users to send money directly to each other through its own peer-to-peer network. This network uses cryptography to verify transactions, which are then recorded on a public digital ledger known as a blockchain.\n\nRelated reading:\n\nFunctions of money\n\nTo understand Bitcoin, it’s important to understand money. Money serves several key functions and has some specific properties:\n\nMedium of exchange: Money facilitates transactions by providing a universally accepted asset. Bitcoin, accepted globally, fills this role, cutting across traditional banking barriers.\n\nStore of value: Money retains value over time, allowing individuals to save for the future. With its limited supply, Bitcoin can potentially be an excellent store of value, similar to gold.\n\nUnit of account: Prices of goods and services are represented in terms of money, giving it a standard metric. Bitcoin’s increasing adoption makes it a growing metric for digital transactions.\n\nProperties of money\n\nDurability: Money should withstand wear and tear. Physical currencies, such as paper bills, have a life span, while digital ones don’t degrade.\n\nPortability: Money should be easily transported. Coins and notes have been handy, but digital currency takes portability to a new dimension. Imagine trying to transport large amounts of gold!\n\nDivisibility: Money should be easily divided. Just as a dollar can be broken down into cents, one Bitcoin can be split into 100 million smaller units called satoshis.\n\nFungibility: Every unit of money should be the same as every other unit. Every Bitcoin holds the same value as every other Bitcoin.\n\nLimited supply: To maintain its value, money should be somewhat scarce. Bitcoin is capped at 21 million coins, ensuring a fixed supply. Compare this to the current monetary supply which has no upper limit.\n\nAcceptability: People must accept money for it to have value. More and more merchants and individuals accept Bitcoin.\n\nBitcoin: digital gold\n\nFor centuries, gold has been a trusted store of value. Its scarcity, luster, and nonreactivity have made it a preferred asset. But in the digital age, Bitcoin is frequently referred to as “digital gold.” Here’s why:\n\nScarcity: Just as there’s a finite amount of gold on Earth, there’s a cap on Bitcoin—21 million coins.\n\nDecentralization: Gold isn’t governed by a single entity or country, and similarly, Bitcoin operates on a decentralized network, free from governmental controls.\n\nStore of value: Historically, in times of economic uncertainty, people flock to gold to preserve wealth. Bitcoin, with its noncorrelation to traditional financial markets, offers a similar haven in the digital world.\n\nPortability: While gold is heavy and challenging to transport, Bitcoin can be sent anywhere globally with an internet connection, making cross-border transfers seamless.\n\nWhy should we care?\n\nGlobal payments: Bitcoin can make transactions quicker and often cheaper, eliminating traditional banking and conversion fees.\n\nInvestment: Diversification is the key to a balanced investment portfolio. Including digital assets like Bitcoin can potentially hedge against inflation or economic downturns.\n\nFuture preparedness: As more patients become familiar with and begin to use cryptocurrencies, offering payment options in Bitcoin can make your dental practice more inclusive and tech-forward.\n\nBitcoin, with its unique properties aligning closely with the fundamental aspects of money, is reshaping the financial landscape. While its comparison to gold offers a touchpoint to its potential as a store of value, its digital nature gives it unparalleled advantages in a connected world.\n\nFor dental professionals, understanding and embracing Bitcoin not only offers novel financial avenues, but can position a practice at the forefront of modern, patient-centric services.\n\nJust as we’ve embraced technology in treatments and patient management, it may be time to do the same with money.\n\nEditor's note: This article appeared in the November 2023 print edition of Dental Economics magazine. Dentists in North America are eligible for a complimentary print subscription. Sign up here.\n\nRyan Wilson, DDS, is a general dental practitioner with more than 20 years of experience. He graduated with a degree in biology from Alma College before attending the University of Detroit Mercy Dental School. Alongside his wife, also a dentist, he serves the Rockford, Michigan, community with dedication and clinical excellence. When he’s not practicing dentistry, Dr. Wilson enjoys outdoor activities with his wife, son, and two dogs. Contact him at [email protected]."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Bpbm5pbmctZG93bi1iaXRjb2luLWV0Zi1hcHByb3ZhbC1kYXRlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Industry watchers pin down possible bitcoin ETF approval dates - Blockworks",
        "content": "Some industry watchers argue that the approval of spot bitcoin ETFs may occur within a three-day period in January, based on recent moves by the US Securities and Exchange Commission.\n\nBloomberg Intelligence analyst James Seyffart said in a Friday X post the approval of spot bitcoin ETFs — should the SEC choose to change its decade-long stance by greenlighting such products — could come between Jan. 8 and Jan. 10.\n\nLoading Tweet..\n\nThose following spot bitcoin ETF developments have looked ahead to Jan. 10 — the deadline for the SEC to rule on a proposal by Ark Invest and 21Shares.\n\nAn approval order could come before this date. But some believe the SEC would allow a bunch of bitcoin ETFs to launch at once, meaning the regulator could wait for the comment periods for other competing proposals to conclude.\n\nThe SEC is collecting public feedback for the proposed spot bitcoin ETFs by Franklin Templeton and Hashdex until Jan. 5, filings show.\n\nThe regulator said in a Tuesday disclosure it had chosen to “institute proceedings” to determine whether to approve or deny the Franklin Bitcoin ETF. It filed a separate order seeking comments on the Hashdex product the same day.\n\nThese filings to move along the proposal process for these ETFs came earlier than expected.\n\nThe SEC’s “quicker turnaround than usual” indicates it might be looking to line up a bunch of approvals at once, after that period ends on Jan. 5, Van Buren Capital general partner Scott Johnsson said in a Thursday X post.\n\nRead more: SEC should ‘stop picking winners’: VanEck exec\n\nBecause the regulator would not file spot bitcoin ETF approvals on the weekend, Johnsson noted, the timeframe between Jan. 8 and Jan. 10 would make sense.\n\n“[Five] days not a lot of time to review comments,” Johnsson added in a separate post. “There’s a good chance there won’t be any unique comments to work through anyway. And worst case they just get the approval shortly after the first cohort.”\n\nThe SEC could still choose to deny the current swathe of spot bitcoin ETF proposals, which include planned products by BlackRock, Fidelity, Invesco and others.\n\nA spokesperson for the regulator has declined to comment on this matter.\n\nBloomberg Intelligence analysts have said they believe there is a 90% chance the SEC will approve these funds by Jan. 10, citing Grayscale Investments’ August court win against the regulator and issuers’ ongoing dialogue with the agency.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvZ2F1Z2luZy1zcG90LWJpdGNvaW4tZXRmcy1pbXBhY3Qtb24tcHJpY2Utdm9sYXRpbGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Gauging Spot Bitcoin ETF's Impact on Price Volatility - CoinDesk",
        "content": "\"We need a reference price where we audit the fund to calculate the NAV,\" Kssis said in a Telegram interview. \"With in-kind creations, APs purchase assets and deliver them to the issuer. With cash creations, if the issuer manages to buy them cheaper, then it makes a little profit, but if it buys them higher, it coughs up the excess.\""
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJlc3Qtbm92ZW1iZXItc2luY2UtMjAyMC1wY2UtYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin eyes best November since 2020 as PCE fails to move BTC price - Cointelegraph",
        "content": "Bitcoin (BTC) brushed off fresh United States macro data into the Nov. 30 Wall Street open as traders focused on the monthly close.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nPCE keeps Fed pivot pressure alive\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price movements sticking to a narrow intraday range below $38,000.\n\nAfter a failed breakout the day prior, hopes were high that the Federal Reserve’s “preferred” inflation metric, the Personal Consumption Expenditures (PCE) Index, would help fuel volatility.\n\nThis, however, had not come to pass at the time of writing, with November’s final Wall Street open still to come.\n\nPCE came in broadly in line with expectations — a boost for the Fed’s monetary tightening and reinforcement of declining inflation.\n\nQuerying whether interest rates might now begin to fall — the key takeaway for risk assets — financial commentary resource The Kobeissi Letter nonetheless stayed cautious.\n\n“Another sign inflation is falling but still above the Fed’s 2% target. Can the Fed really pivot now?” it queried on X (formerly Twitter) after the PCE results.\n\nKobeissi once again alluded to words from Bill Ackman, founder and CEO of hedge fund Pershing Square Capital Management, who earlier in the week predicted rate cuts beginning as soon as Q1, 2024.\n\n“It’s important to note that the effects of monetary policy lag. However, does the Fed really want to risk jumping the gun and cutting rates too soon?” it continued.\n\n“We believe calls for rate cuts in Q1 2024 are too ambitious.”\n\nFed target rate probabilities chart. Source: CME Group\n\nPCE did not manage to dent market expectations of Fed policy, with data from CME Group’s FedWatch Tool still showing almost unanimous expectations of a rate hike pause continuing next month.\n\nNovember BTC price gains near 10%\n\nFor Bitcoin market participants, however, the monthly close was of more interest.\n\nRelated: Bitcoin ETF will drive 165% BTC price gain in 2024 — Standard Chartered\n\nBTC/USD was up nearly 10% in November at the time of writing, making it the first “green” 11th month of the year since 2020. Above $37,660, the close would become its highest since May 2022.\n\nIn November 2021 and 2022, Bitcoin fell 7.1% and 16.2%, respectively, per data from statistics resource CoinGlass.\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nAnalyzing the current chart setup, popular trader Jelle saw reasons to be bullish in Bitcoin’s relative strength index (RSI) readings.\n\n“After spending the past month building up a giant hidden bullish divergence, Bitcoin has breached its RSI downtrend!” he told X subscribers earlier on the day.\n\nAn accompanying chart showed the required area for bulls to secure.\n\n“If price can hold the grey box, I think this starts moving higher soon. All eyes on the monthly close,” Jelle added.\n\nBTC/USD chart with RSI. Source: Jelle/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1Mzk3L2JpdGNvaW4tbG9uZy1mdXR1cmVzLW9wZW4taW50ZXJlc3QtaGVsZC1ieS1hc3NldC1tYW5hZ2Vycy1oaXRzLWFsbC10aW1lLWhpZ2jSAXRodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjUzOTcvYml0Y29pbi1sb25nLWZ1dHVyZXMtb3Blbi1pbnRlcmVzdC1oZWxkLWJ5LWFzc2V0LW1hbmFnZXJzLWhpdHMtYWxsLXRpbWUtaGlnaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin long futures open interest held by asset managers hits all-time high - The Block",
        "content": "The open interest in bitcoin long futures held by asset managers on the Chicago Mercantile Exchange (CME), has reached an all-time high.\n\nOpen interest of CME bitcoin long futures by asset managers increased from $1.04 billion at the end of October, to a current value of $1.98 billion, according to The Block's Data Dashboard.\n\nThe current value of the contracts held by asset managers eclipsed the former all-time high. When bitcoin's price reached an all-time high in November 2021 of $68,000, the CME bitcoin long futures open interest held by asset managers at the time went only as high as $1.67 billion.\n\nThe uptick in open futures contracts suggests asset managers are anticipating bitcoin price appreciation by the time the current contracts expire on the last Friday of December.\n\nThe open interest from hedge funds going long on bitcoin futures on the CME is also at a high point. Currently, there's $680 million of open interest from hedge funds going long, which remains below the all-time high of $960 million.\n\nThat said, hedge funds are also responsible for the majority of open interest for short positions for bitcoin futures on the CME. Such hedge funds are responsible for more than $2 billion of open interest in this direction.\n\nRELATED INDICES See crypto indices\n\nOverall, asset managers have a net long position that's $1.97 billion in size, while hedge funds have a net short position, worth $1.36 billion, according to The Block's Data Dashboard.\n\nOn November 10, CME bitcoin futures flipped Binance’s BTC -3.45% futures markets in terms of size, showing increased demand from institutional investors. According to data from Coinglass, the total open interest on the CME for bitcoin futures is now $4.15 billion, compared to $4.08 billion on the Binance futures market.\n\nData from The Block's Data Dashboard also shows an all-time high for large open interest holders of CME bitcoin futures, for both long and short positions. The uptick in open interest for positions involving at least 25 bitcoin shows increased activity in the derivatives market by participants with large holdings. This would suggest market activity is leaning towards trades by more sophisticated, experienced investors."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWhvcGVzLWxpZnRlZC0yMzAzMDUyODEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETF Hopes Lifted by SEC Move - Yahoo Finance",
        "content": "SEC\n\nThe Securities and Exchange Commission has initiated a public comment period on spot bitcoin exchange-traded fund applications from Wall Street investment-management firm Franklin Templeton and Brazil-based cryptocurrency-focused investment firm Hashdex, the agency announced in a filing on Nov. 28.\n\n\n\nThe SEC has 240 days to approve or deny an ETF filing and must provide an update on its decision at certain intervals. It wasn’t due for another decision on Franklin Templeton's application until Jan. 1. Starting the public comment period earlier than that may indicate that the SEC is accelerating its timeline for an anticipated “spotcoin” ETF approval.\n\n\n\nBloomberg analyst James Seyffart wrote on X, the social-media platform formerly called Twitter, that the SEC move to open a comment period on Hashdex “all but confirms for me that this was likely a move to line every applicant up for potential approval by the Jan. 10, 2024 deadline.”\n\nFranklin Templeton, which has about $1.5 trillion in assets under management, first filed for a spot bitcoin ETF in October. Its filing was previously delayed on Nov. 15.\n\n\n\nOn Nov. 29, Franklin Templeton amended its prospectus, saying that it had responded to the SEC’s questions and concerns about its application.\n\nSpot Bitcoin ETFs\n\nWhile asset managers have attempted to roll out a spot bitcoin ETF for years, the SEC has denied or delayed those funds based on concerns about market manipulation and investor protection.\n\n\n\nYet, after the SEC lost a watershed lawsuit to Grayscale Investments in August, it began to work more closely with about a dozen firms to potentially bring the funds to market.\n\nMany hopeful firms, including ARK Invest’s Cathie Wood, believe the SEC will approve multiple applications all at once to avoid giving any single firm a first-mover advantage.\n\nContact Lucy Brewster at lucy.brewster@etf.com.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LnRoZXJlZ2lzdGVyLmNvbS8yMDIzLzExLzMwL2JpdGNvaW5fbWluaW5nX3dhdGVyX2NvbnN1bXB0aW9uL9IBTGh0dHBzOi8vd3d3LnRoZXJlZ2lzdGVyLmNvbS9BTVAvMjAyMy8xMS8zMC9iaXRjb2luX21pbmluZ193YXRlcl9jb25zdW1wdGlvbi8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's thirst for water is just as troubling as its energy appetite - The Register",
        "content": "It probably won't come as a shock to those aware of the electricity usage of the Bitcoin network, but the world's most popular cryptocurrency also uses tons of water to keep itself running.\n\nAccording to Digiconomist founder and Vrije University data science PhD candidate Alex de Vries, the Bitcoin network may be using as much as 2,237 gigaliters of water in 2023, which equates to around 590 billion US gallons, or 492 billion imperial gallons, De Vries concluded in a paper published yesterday.\n\nTo put that in perspective, let's look at just the US alone, where around a third of the world's Bitcoin mining takes place. In the course of a year, US Bitcoin mining operations chug somewhere between 39 and 120 gigaliters of water, De Vries estimates, which is equivalent to the water consumption of 300,000 US households, or a city the size of Washington DC.\n\nBitcoin mining is the process of solving cryptographic problems to validate entries on the blockchain. It's an incredibly energy intensive process incentivized by paying miners in newly minted Bitcoin; the higher the price the more miners participate, and the more energy is burned to solve a transaction.\n\nThe price of Bitcoin crashed last year, leading to a comparable drop in electricity and water consumption, but a rebound this year led to an all-time high in energy consumption in March 2023, De Vries said in his paper. March's annualized energy usage amounted to around 141.9 terawatt-hours – a 35 percent increase compared to energy usage in 2021.\n\nWith the price of Bitcoin continuing to climb over the course of 2023, \"water consumption is probably at an all-time high right now too,\" De Vries told The Register – even higher than earlier this year.\n\nMuch of the reporting on Bitcoin's environmental impact has centered on its carbon footprint and electricity usage, which De Vries has maintained a record of on Digiconomist since founding the site in 2014. Water usage has been far less reported; Cell Reports, where De Vries' paper was published, says his research is the first comprehensive look at Bitcoin's water use.\n\nTalk about Bitcoin liquidity\n\n\"The most painful thing about cryptocurrency mining is that it uses so much computational power and so much resources, but these resources are not going into creating some kind of model, like artificial intelligence, that you can then use for something else. It's just making useless computations,\" De Vries said.\n\nAgain, to put things into perspective, De Vries cites estimates from 2021, when global Bitcoin mining operations used around 1,600 GL of water, which amounts to around 16,000 liters of water per Bitcoin transaction – 6.2 million times more than the amount of water used for a single credit card swipe. Keep in mind the estimated water usage is even higher this year.\n\nWith such an environmental impact, is there anything that can be done to reduce Bitcoin's water footprint? Yes, but whether it'll happen is another thing altogether.\n\n\"What you can do technically is a completely different story from what will likely happen,\" De Vries told us, citing Ethereum's transition to proof-of-stake, a blockchain consensus mechanism that uses far less energy to validate transactions. \"It's not an exaggeration to say this could all be solved tomorrow,\" De Vries added.\n\nIt's the Bitcoin community that De Vries sees as the biggest hurdle to jump in making its digicoin of choice more environmentally friendly. \"The Bitcoin community is extremely conservative and doesn't want to change anything about Bitcoin – its mechanism, transaction cap – anything,\" De Vries said. Bitcoiners, De Vries added, see their coin as a stable store of value because it isn't prone to making such drastic changes as switching its mechanism, \"and that's a sticking point.\"\n\nDe Vries cited recent EU cryptocurrency regulations that require disclosure of environmental impact as a way to lead to greater awareness of what it costs to keep the Bitcoin blockchain running, which he notes in the paper could spell serious problems for the world amid growing water scarcity.\n\nIn Kazakhstan, which became a large source of Bitcoin mining after China banned the practice, water shortages are already becoming a crisis, with climate change-exacerbated water shortages predicted to leave the country's capital 75 GL short of water by 2030. In 2021, Kazakhstani Bitcoin mining consumed around 1,000 GL of water, De Vries said.\n\n\"There's no obvious evidence that this is a concern within the BTC community,\" De Vries told us. ®"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEyLzAxL2NvdWxkLWJpdGNvaW4tYmUtd29ydGgtbW9yZS10aGFuLTEtdHJpbGxpb24taW4tMjAyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Could Bitcoin Be Worth More Than $1 Trillion in 2024? - The Motley Fool",
        "content": "With Bitcoin (BTC -3.76%) up more than 125% this year, it's becoming increasingly possible that this high-flying crypto might surge through the $1 trillion valuation mark sometime next year. Given Bitcoin's circulating supply of roughly 20 million coins, a valuation of $1 trillion implies a price of about $50,000. This represents a 30% gain from today's price of almost $38,000.\n\nThat price target certainly seems possible, given that it wouldn't even require Bitcoin to regain its all-time high of almost $69,000. Could Bitcoin rally to $50,000 and top a $1 trillion valuation in the coming months? Let's take a closer look.\n\nThe Bitcoin ETF factor\n\nBitcoin's current rally has been driven, to a large extent, by investor anticipation of the first-ever spot Bitcoin exchange-traded fund (ETF) for the U.S. market. In June, BlackRock led the way with a spot Bitcoin ETF application. Within the span of just a few weeks, a handful of other large institutional investors were also lining up with their own spot Bitcoin ETF applications. The current thinking is that the Securities and Exchange Commission (SEC) could give its final approval for a spot Bitcoin ETF sometime in the first quarter of 2024.\n\nThere are a number of useful back-of-the-envelope calculations that can be used to assess the impact of this approval. The easiest approach is to add up all the assets under management of the large institutional investors applying for these spot Bitcoin ETFs, and apply a scaling factor of, say, 1% to that number. That tells you how much new money might be flowing into Bitcoin. For example, if you assume that institutional investors will allocate just 1% of their $5 trillion in assets under management to Bitcoin, that would result in a new influx of $50 billion into Bitcoin.\n\nAnother approach is to consider Bitcoin from the perspective of a precious metal. Bitcoin is often described as \"digital gold,\" and many investors view it as a store of value, similar to physical gold. Thus, it's not out of the realm of possibility to think that some investors might move their assets out of precious metals and into Bitcoin. Right now, about $120 billion is held in precious metals ETFs. So, if you assume that anywhere from 10% to 20% of that might be reallocated to Bitcoin, that would result in a potential influx of anywhere from $12 billion to $24 billion. This new flow of money, presumably, would help to bid up the price of Bitcoin.\n\nThe global growth factor\n\nYou're probably thinking, \"That sounds great, but hasn't the market already priced in some, if not most, of the impact of a spot Bitcoin ETF?\" If you believe in the efficient market hypothesis, which says that the market has already priced in all known information, then you could be right. Coinbase Global, for example, has already run the numbers and concluded that some of the spot Bitcoin ETF impact might already have been priced in.\n\nThat's why I have a second big reason Bitcoin could rally to $50,000 and beyond in 2024: the global growth factor. In short, Bitcoin is becoming an increasingly important part of the world's financial system, and that is leading to new demand for Bitcoin as an asset.\n\nIn its Big Ideas report for 2023, Ark Invest shared its forecast for several different market segments where it saw Bitcoin building momentum worldwide. By estimating how much of each market segment Bitcoin might command in the future, Cathie Wood of Ark Invest came up with a base, bear, and bull case scenario for Bitcoin for the year 2030.\n\nFor example, Wood calculated that, in a base case scenario, Bitcoin might account for 3% of the M2 money supply of emerging market countries, and 2.5% of the portfolio allocation of institutional investors. All of that led to a base case forecast of $682,800 for Bitcoin. So even if you dial back some of these numbers (such as changing the portfolio allocation percentage from 2.5% to 1%), you're still going to get a huge number. The bear case scenario for Bitcoin, says Wood, calls for a price of $258,500 by the year 2030.\n\nCan Bitcoin reach $50,000?\n\nGiven the above, I don't think $50,000 is an outlandish price target for Bitcoin. Especially given the fact that some analysts are already projecting that Bitcoin could top $100,000 by the end of 2024. Standard Chartered Bank, for example, recently doubled down on a $100,000 price target for Bitcoin.\n\nAt today's prices, a target of $50,000 requires only a 30% rise for Bitcoin. If you consider all the money that could be flowing into Bitcoin as a result of a spot Bitcoin ETF approval, and then layer on top of that the overall growth that Bitcoin is seeing on a global basis, then Bitcoin might actually hit a $1 trillion market valuation in 2024. Just keep in mind, though, that given Bitcoin's historical volatility, that path to $1 trillion is likely to be filled with a bit of turbulence along the way. So buckle up."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzMwL3dvcmxkcy1sYXJnZXN0LWJpdGNvaW4tZnV0dXJlcy1ldGYtYnJlYWtzLTIwMjEtcmVjb3JkLWhpZ2hzLWZvci1hc3NldHMtdW5kZXItbWFuYWdlbWVudC_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8zMC93b3JsZHMtbGFyZ2VzdC1iaXRjb2luLWZ1dHVyZXMtZXRmLWJyZWFrcy0yMDIxLXJlY29yZC1oaWdocy1mb3ItYXNzZXRzLXVuZGVyLW1hbmFnZW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "World's Largest Bitcoin Futures ETF Breaks 2021 Record Highs for Assets Under Management - CoinDesk",
        "content": "Unlike some other bitcoin futures ETFs, BITO closely tracks the asset's spot prices, which has likely added to its allure among traders. In June, investors poured in more than $65 million in a single week, making it the largest inflow in a year and breaking a previous 2023 high of just over $40 million in April."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJ1eXMtNjAwbS1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin for Christmas: MicroStrategy buys another $600M - Cointelegraph",
        "content": "Business intelligence firm MicroStrategy purchased 16,130 Bitcoin (BTC) in November, bringing its total holdings to more than $6 billion.\n\nIn a Nov. 30 announcement, MicroStrategy co-founder Michael Saylor said the company acquired the BTC for roughly $593.3 million — a price of $36,785 per Bitcoin. As of Nov. 29, MicroStrategy reported it held 174,530 BTC — worth roughly $6.6 billion at the time of publication — at a price of $37,726.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/3XHhpIvsuA — Michael Saylor⚡️ (@saylor) November 30, 2023\n\nThe business intelligence firm has consistently purchased large volumes of Bitcoin since announcing it would adopt the cryptocurrency as its treasury reserve asset in August 2020. Saylor’s last announcement was in September, reporting MicroStrategy bought 5,445 BTC for roughly $147 million.\n\nRelated: MicroStrategy’s Bitcoin stash back in profit with BTC price above $30K\n\nMicroStrategy’s Bitcoin purchase announcement followed as the cryptocurrency price rose roughly 10% in November. The firm reported a gain of $900 million for its Bitcoin holdings in the third quarter of 2023, with CEO Phong Le hinting at the time that the company would continue to make consistent purchases.\n\nMagazine: How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1NDY3L21pY3Jvc3RyYXRlZ3ktYnV5cy01OTMtMy1taWxsaW9uLWluLWJpdGNvaW4tbWF5LXJhaXNlLXVwLXRvLTc1MC1taWxsaW9uLWluLW5ldy1zdG9jay1zYWxl0gGBAWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2NTQ2Ny9taWNyb3N0cmF0ZWd5LWJ1eXMtNTkzLTMtbWlsbGlvbi1pbi1iaXRjb2luLW1heS1yYWlzZS11cC10by03NTAtbWlsbGlvbi1pbi1uZXctc3RvY2stc2FsZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy buys $593.3 million in bitcoin, may raise up to $750 million in new stock sale - The Block",
        "content": "MicroStrategy, a software firm best known for its bitcoin holdings, has purchased more of the digital asset and may raise additional funds through the sale of new shares.\n\nBetween Nov. 1 and Nov. 29, it purchased an additional 16,130 bitcoin for $593.3 million, with an average price of $36,785 per token, the company said in a filing. Founder and Chairman Michael Saylor said in a post on X that the company now \"hodls\" 174,540 bitcoin that was acquired at an average price of $30,252 each.\n\nThe company said it may raise up to $750 million through the sale of new Class A common stock shares.\n\nRELATED INDICES See crypto indices\n\nBitcoin BTC -3.54% was mostly flat on Thursday, trading at $37,652 at 11:35 a.m. ET, according to The Block data. The world's largest digital asset by market capitalization is up 10% over the past month and 122.8% over the past year."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTExLTMwL2NtZS1iaXRjb2luLWZ1dHVyZXMtYWJvdW5kLW9uLWV0Zi1ob3Blcy1hbmQtYW54aWV0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "CME Bitcoin Futures Abound on ETF Hopes and Anxiety - Bloomberg",
        "content": "In this issue of the Bloomberg Crypto newsletter, Olga Kharif sizes up the surge in open interest for CME Bitcoin futures.\n\nWhen traders load up on derivatives, it can often be hard to know if they are preparing for good or bad news."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qcG1vcmdhbi1wb3RlbnRpYWwtMi03LWJpbGxpb24tMTYxMTE1NjYxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "JPMorgan: Potential For $2.7 Billion In Outflows From Grayscale Bitcoin Trust (GBTC) - Yahoo Finance",
        "content": "Grayscale recently met with the Securities and Exchange Commission (SEC) to discuss its application for a spot Bitcoin exchange-traded fund (ETF). As the date for a decision on the application draws closer, many are beginning to wonder what will happen if spot Bitcoin ETFs are allowed.\n\nBecause Jan. 10 is the final day for a previously delayed decision on the Ark and 21Shares ETFs, JPMorgan has said it is also a date to watch for a potential announcement on spot Bitcoin ETFs.\n\nJPMorgan is also looking ahead to what may happen after the Grayscale Bitcoin Trust is converted into a spot Bitcoin ETF. It predicts there could be outflows totaling more than $2.7 billion because the current ETF — GBTC — is trading below net asset value (NAV).\n\nDon’t Miss:\n\nWhether you have $10 or $10,000, you can start trading crypto today.\n\nThe VC firm that backed Apple before its IPO in 1980 is focusing on AI — Here's how you can do the same with $1,000.\n\nThis is significant because if Grayscale's spot Bitcoin ETF is approved, the ETF will be converted from the current Bitcoin Trust into a spot Bitcoin ETF. If it is approved and converted, speculative traders will be able to pocket the difference between the current price and NAV.\n\n“To proxy the buying flow into [the Grayscale Bitcoin Trust] since the beginning of the year, we cumulate the daily signed dollar volume, i.e., the daily volume in thousands of shares times the price times the sign of the price change, positive if the price had increased over that day and negative if the price had decreased,” JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Nov. 16.\n\nPanigirtzoglou went on to say that “this methodology produces an estimate of around $2.5 billion for the net cumulative flow into [the Grayscale Bitcoin Trust] since the beginning of the year. This number increases to close to $2.7 billion if one also adds the covering of the short interest since the beginning of the year.”\n\nStory continues\n\nTrending: All Time Best Crypto Brokers To Start Trading Right Now\n\nJPMorgan also said that the outflows could be even greater if the fees for the spot Bitcoin ETF are above the level of their competitors.\n\n\"We envisage a more intense competition with the average fee for Bitcoin ETFs converging towards that of Gold ETFs, which currently stands at around 50 basis points,\" according to the report.\n\nIf traders are indifferent between the several applications for spot Bitcoin ETFs, they will likely go to the one with the lowest fees. This could result in outflows exceeding the $2.7 billion that JPMorgan discussed.\n\nIf you are looking to buy Bitcoin before the potential spot Bitcoin ETFs go live, Kraken is the place to do so. It offers trading features for beginners and seasoned traders. Offering over 200 cryptocurrencies, it is also one of the most comprehensive platforms in the space. It is especially well-known for its security, liquidity and ease of use. You can get started today with just $10.\n\nRead Next:\n\nWith returns as high as 300%, it’s no wonder this asset is the investment choice of many billionaires. Uncover the secret.\n\nThis brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article JPMorgan: Potential For $2.7 Billion In Outflows From Grayscale Bitcoin Trust (GBTC) originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzEyLzAxL2JpdGNvaW4tZmluaXNoZXMtbm92ZW1iZXItc3Ryb25nLWFzLWludmVzdG9ycy1lbnRlci1hLXdhaXRpbmctcGVyaW9kLWluLXRoZS1maW5hbC1tb250aC1vZi0yMDIzLS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin finishes November strong as investors enter a waiting period in the final month of 2023 - CNBC",
        "content": "November was perhaps the most significant month of this year for the crypto industry and gave bitcoin a strong setup as investors look toward 2024. Bitcoin ended the month up about 9%, according to Coin Metrics. It was the underperformer, however, compared to ether , which advanced 13%, and Solana's sol token, which jumped 63%. Investors found relief after FTX's disgraced leader Sam Bankman-Fried was found guilty of criminal fraud — just about a year after the short-lived exchange's spectacular collapse — and the CEO of Binance, the largest exchange in the world, pleaded guilty to charges brought by the U.S. Department of Justice. For many, these events allowed them to close a painful chapter of crypto history as it prepares to open a new one. If a spot bitcoin exchange-traded fund gets approved soon, it could bring a wave of new investors into the market who have been sitting on the sidelines waiting for the industry to clean up. BTC.CM= 1M mountain Bitcoin closes November up 9% Now, traders are waiting in earnest. \"It's safe to say that the market is grinding higher in anticipation of a spot bitcoin ETF approval in January,\" said Ryan Rasmussen, research analyst at Bitwise Asset Management. \"There's also the next bitcoin halving set to occur in May 2024, which is a strong catalyst for price that most people are missing as they're hyper-focused on a spot bitcoin ETF.\" \"Some investors will continue trying to front-run the potential spot bitcoin ETF approval, but December is essentially a 'wait and see' period for bitcoin,\" he said. Broad consensus is that an ETF is likely to be approved soon. Part of what's driving that optimism is reports that the U.S. Securities and Exchange Commission, which has long held a reputation for being dismissive or unengaging with the crypto industry, appeared to make greater efforts in November by holding closed-door discussions with several ETF filers, giving them feedback and meeting with them again . November is a historically strong month for bitcoin. This is its seventh positive one out of the 11 since its inception, according to CoinGlass. December's track record isn't as rosy, however. CoinGlass says it has ended in the green in just four of the past 10. This year, however, it may give investors a good opportunity to buy one more dip before key events play out in the beginning of 2024. According to Wolfe Research, \"all signs\" point toward a near-term pullback in bitcoin's price, though there's plenty of upside left for it to run. November gains bring bitcoin up about 127% for 2023. Ether and sol have gained 70% and 482%, respectively, for the year. \"While this is part of a rotation we often see — a bitcoin rally, followed by an Ethereum rally, followed by a rally in altcoins — it's a telling signal for where we are in this next crypto cycle,\" Rasmussen said. \"It tells us that investors are interested in more than just the potential for a spot bitcoin ETF. They're looking ahead to 2024 and focusing on other narratives [and] recognize the potential for crypto to gain a meaningful share of investor attention next year.\""
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMzAvbWlrZS1ub3ZvZ3JhdHotZ2FsYXh5LWRpZ2l0YWwtYml0Y29pbi1hbGwtdGltZS1oaWdoLXNwb3QtZXRmcy_SAWhodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzMwL21pa2Utbm92b2dyYXR6LWdhbGF4eS1kaWdpdGFsLWJpdGNvaW4tYWxsLXRpbWUtaGlnaC1zcG90LWV0ZnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Galaxy Digital CEO Mike Novogratz says Bitcoin will rebound to its all-time high by next year in wake of ETF approvals - Fortune",
        "content": "Billionaire crypto investor and Galaxy Digital CEO Mike Novogratz is betting that by this time next year Bitcoin will be back at its highest levels ever.\n\nAnalysts at Bloomberg predict that the first U.S. spot Bitcoin ETF could be approved by Jan. 10, and Novogratz said that could drive billions of dollars into the sector, causing Bitcoin to skyrocket.\n\n“Could we go to old highs by this time next year?” Novogratz said during a Bloomberg TV interview on Wednesday. “Of course.”\n\nBitcoin has been on a tear since September, shooting up 45%, to about $37,600, as of Wednesday, but the coin is still down from its all-time high of $69,000. Bitcoin reached that peak in November 2021 before falling below $16,000 a year later, according to data compiled by CoinGecko.\n\nNovogratz said making it easier to invest in cryptocurrencies via ETFs will help attract a fresh set of retail investors. Galaxy Digital is working with the investment management company Invesco to introduce a spot Bitcoin ETF.\n\n“Prices are set on the margin, so that’s all new money,” Novogratz said. “We will see a pretty successful shift of psychology when the government says you are allowed to buy Bitcoin.”\n\nThe SEC has still not approved a spot Bitcoin ETF in the U.S. and has continually delayed making a decision on several applications. Earlier this year, the agency faced a setback on a lawsuit against crypto asset manager Grayscale regarding its application to create a spot Bitcoin ETF. The regulator chose not to appeal the ruling.\n\nStill, other high-profile leaders in traditional finance and the crypto space have recently renewed their optimism that Bitcoin will have a resurgence.\n\nOn Thursday, MicroStrategy founder Michael Saylor wrote in a post on X that the company had purchased an additional $593.3 million worth of Bitcoin at an average price of $36,785. MicroStrategy has now spent more than $5 billion on Bitcoin since 2020.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/3XHhpIvsuA — Michael Saylor⚡️ (@saylor) November 30, 2023\n\nIn the traditional financial world, BlackRock’s Larry Fink has also compared Bitcoin to digital gold and called it an “international asset.” His comments pushed the coin to a 14-month high in July."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL2JpdGNvaW4tdHJhbnNhY3Rpb24td2FzdGVzLXN3aW1taW5nLXBvb2wtd2F0ZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "The Average Bitcoin Transaction Wastes a Full Swimming Pool of Water, Scientists Say - Futurism",
        "content": "Yikes.\n\nDown the Drain\n\nEverytime Bitcoin is bought or sold, it wastes enough water to fill an entire swimming pool, new research shows, further evidence of the staggering environmental impact of cryptocurrencies.\n\nThe research, a study published in the journal Cell Reports Sustainability, also found that Bitcoin's water footprint is rapidly escalating, rising by 166 percent between 2020 and 2021.\n\nNow, each transaction is estimated to expend over 16,000 liters of water. According to Alex de Vries from the Vrihe Universiteit Amsterdam, the study's sole author, that's around six million times more than what you use buying something with a credit card.\n\n\"It's sort of hard to surprise me, given how I've already worked on this topic I'm kind of used to big numbers popping up,\" de Vries told The Verge. \"But then again, the numbers are still mind blowing even to me every time I look at it.\"\n\nCool It\n\nGlobally, Bitcoin mining used about 1,600 gigaliters — that's a billion liters times 1,600 — in 2021, and the figure could be upwards of 2,200 gigaliters this year, with the US alone accounting for up to 35 gigaliters of that consumption. The steep increase will likely be driven by Bitcoin's climbing value, which encourages more mining.\n\nAn enormous amount of water is used to cool the tireless computers that mine and process Bitcoin around the clock. It's an intensive process that devours absurd amounts of energy — as much as a small country, in fact.\n\nThat energy bill figures into de Vries's calculations. Most of its water footprint comes from the water used in generating the electricity that Bitcoin burns through, though cooling systems still formed a massive part of the total proportion.\n\nLowering the Stakes\n\nIt doesn't have to be this way, according to de Vries. Most cryptocurrencies including Bitcoin use what's known as \"proof of work\" to validate transactions on the blockchain — the \"work\" being the mining done by those toasty computers — which is wildly inefficient.\n\n\"You have millions of devices around the world, constantly competing with each other in a massive game of what I like to describe as 'guess the number,'\" de Vries told the BBC. \"All of these machines combined are generating 500 quintillion guesses every second of the day, non stop — that is 500 with 18 zeros behind it.\"\n\nThere is at least one major cryptocurrency, however, that works around this: Ethereum, which last year started using \"proof of stake\" instead of work to validate transactions without any mining whatsoever, cutting its energy bill by 99 percent.\n\nShort of ditching crypto entirely, switching them over to more efficient systems could cause \"all the electricity consumption\" and \"associated water consumption\" to \"disappear overnight,\" de Vries told The Verge.\n\nBeyond that, using renewables and switching over to cooling methods that either recycle or don't use water at all could help soften crypto mining's grim environmental toll.\n\nMore on crypto: Execs of Top Meme Coin Charged With Spending Customers' Money on Luxury Cars"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzAxL2F2YWxhbmNoZS1oZWxpdW0tbGVhZC1tb250aGx5LWNyeXB0by1nYWlucy1hcy1idWxsaXNoLWJpdGNvaW4tY29uc29saWRhdGlvbi1zcHVycy1hbHRjb2luLXNlYXNvbi1jYWxsL9IBlgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzAxL2F2YWxhbmNoZS1oZWxpdW0tbGVhZC1tb250aGx5LWNyeXB0by1nYWlucy1hcy1idWxsaXNoLWJpdGNvaW4tY29uc29saWRhdGlvbi1zcHVycy1hbHRjb2luLXNlYXNvbi1jYWxsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Avalanche, Helium Lead Monthly Crypto Gains as Bullish Bitcoin Consolidation Spurs Altcoin Season Call - CoinDesk",
        "content": "The widening breadth of the crypto rally signals that we are in the midst of an \"altcoin season,\" investment advisory firm ByteTree said in a report this week. Market observers refer to altcoin seasons as periods when smaller cryptos outperform bitcoin."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vYml0Y29pbnMtdm9sYXRpbGUtcGVyaW9kLW1heS1oYXZlLWVuZGVkLWhlcmVzLXdoeS_SAVBodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2JpdGNvaW5zLXZvbGF0aWxlLXBlcmlvZC1tYXktaGF2ZS1lbmRlZC1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin’s volatile phase may have ended — Here’s why - AMBCrypto English",
        "content": "BTC was down by nearly 1% over the last 24 hours.\n\nSocial metrics were high, but other indicators looked bearish.\n\nBitcoin [BTC] has not been very volatile of late, as its price took a sideways trajectory. As AMBCrypto reported earlier, investors might have to expect a few more slow-moving days, which was further established by the latest datasets.\n\nNotably, Bitcoin’s MACD and Money Flow Index (MFI) looked bearish. But can anything cause a change in the trend in the near term?\n\nBitcoin might not get volatile\n\nIntoTheBlock recently posted a tweet highlighting that the 30-day average intraday move for Bitcoin was going lower than traditional markets. This indicated a period of relatively low volatility for BTC.\n\nMoreover, AMBCrypto found that while BTC’s price went sideways, its Open Interest remained relatively high. High Open Interest generally indicates that the ongoing price trend might continue further.\n\nHas anything changed overnight?\n\nThough BTC did not register much movement, investors continued to accumulate at press time. This was evident from the fact that BTC’s Exchange Outflow spiked in the recent past.\n\nOn top of that, BTC’s Supply on Exchanges remained lower than its Supply outside of Exchanges, suggesting that buying pressure on the coin was higher than selling pressure, reflecting investors’ confidence in the king of cryptos.\n\nThings looked good for BTC on the social front too, as its Social Dominance surged by more than 50% over the last week. But despite the sluggish price movement, Bitcoin’s Market Dominance registered an increase, which looked optimistic.\n\nHowever, a bearish metric was the coin’s AltRank, which increased over the last seven days.\n\nWhen AMBCrypto checked BTC’s daily chart, we found that not much had changed over the last few hours. The MACD continued to show an ongoing tussle between the bulls and the bears at press time.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nThe Bollinger Bands’ data also revealed that the coin’s price was in a less volatile zone.\n\nHowever, the Relative Strength Index (RSI) went sideways, but its Money Flow Index (MFI) looked bullish as it moved up slightly in the recent past. At press time, BTC was trading at $37,787.55, with a market capitalization of over $739 billion."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vbnltYWcuY29tL2ludGVsbGlnZW5jZXIvMjAyMy8xMi9ob3ctdGhlLXdpbmtsZXZpaXMtc2Vjb25kLWFjdC1pbi1iaXRjb2luLXdlbnQtYmFkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "How the Winklevoss Twins' Bitcoin-Based Second Act Went Bad - New York Magazine",
        "content": "Photo-Illustration: Intelligencer; Photo: Getty\n\nThis article was featured in One Great Story, New York’s reading recommendation newsletter. Sign up here to get it nightly.\n\nIn early June 2019, Cameron and Tyler Winklevoss invited the author Ben Mezrich to a private get-together at the Park Avenue South headquarters of their crypto exchange, Gemini, an office where the money and ambition of the digital currency world were on outlandish display: A giant chrome statue reminiscent of the MTV Moon Man trophy hung from the ceiling; employees were called “astronauts”; the C-suite was referred to as “mission control.” Mezrich, of course, was a key figure in the Winklevosses’ lives. As the author of The Accidental Billionaires: The Founding of Facebook, a Tale of Sex, Money, Genius, and Betrayal — the 2009 book that became The Social Network — he had helped define them, before their 30th birthdays, as spoiled Ivy League monozygotic brats who got rich thanks to their dad’s lawyer. “The Winklevii aren’t suing me for intellectual property theft,” Jesse Eisenberg, playing the Mark Zuckerberg character, says in one of the movie’s key lines. “They are suing me because, for the first time in their lives, things didn’t go exactly the way they were supposed to for them.”\n\nYet, ten years later, Mezrich was hawking his new book, Bitcoin Billionaires: A True Story of Genius, Betrayal, and Redemption, casting the twins as heroes — to their own employees. “That was a weird day,” one onlooker said. Attendance was optional, but the midday event did have pizza, and who doesn’t love pizza, so dozens showed up. The twins seemed relaxed, far from their normally stiff selves, two others said. “I remember them asking what Ben’s process was, and him saying, ’I write books I can turn into movies,’” a fourth attendee said. What was so strange about the whole thing is that Mezrich’s book hardly even mentions Gemini. Then, after it was all over, the twins asked their employees to grab a free copy and form a line, so all three of them — the author and his dual protagonists — could all sign the book.\n\nThe Winklevoss twins have, for the better part of a decade, been trying to convince the world they made a comeback. For anyone who stopped paying attention to them after the Facebook movie came out, here’s the general trajectory: The $65 million settlement from Zuckerberg over their claims to the Facebook idea turned into a major bet on bitcoin, back when the digital currency traded for about $8. (Lately it trades around $38,000.) Gemini, which they started in 2014, was supposed to be their legacy — a highly profitable business that would not only cement their status as serious players in the growing crypto industry. If everything went right, it had the potential to be a $100 billion company of their own. In an often sketchy or even scammy sector plagued by hacks and FBI raids, they branded themselves as rule followers using financial best practices to create a dependable “next generation” exchange that wealthy investors and institutions could rely on as they got involved in crypto investing. They would be the kind of entrepreneurs who would work with government regulators even as much of the rest of the industry tried to avoid oversight. “In the beginning of Gemini’s history, we were very focused on asking permission, and not asking for forgiveness,” a former executive said. “We always acted on the expectation of how regulators would want us to work.”\n\nGemini is, of course, a reference to twins, as well as a NASA space flight — but any astrologer could tell you that geminis have a tendency for saying one thing and doing another. Last month, New York Attorney General Letitia James sued the Winklevosses’ exchange, claiming that it defrauded 290,000 people out of $1.1 billion worth of crypto. The suit presented a company that was not only willing to overlook its own internal concerns about a partner firm that was holding a huge chunk of its customers’ deposits but to continue representing to those customers that their money was secure even as the board was privately comparing this partner to Lehman Brothers in 2008. Interviews with nine sources, together with court records, reveal a company that began taking larger and larger risks as it attempted to keep up with competitors like FTX and Binance, both of which later ran spectacularly afoul of law. (None of the sources are being named since they continue to work in the industry and fear getting sued for talking about the companies.) That frantic chase is said to have led Gemini to stray from the rule-following conservatism that was the original cornerstone of the brand. Now that they’ve been accused of lying to their customers — and their exchange has fallen out of the top 100 by global trading volume — the twins are facing the most consequential test to their credibility yet.\n\nAfter their famous Facebook settlement, the Winklevosses made some questionable investments. There was Treats!, a porn magazine, in 2014. There was Hukkster, an online retailer, soon after. Cameron co-founded “Guest of a Guest,” a “Page Six” knockoff. But their bitcoin bet was an unqualified jackpot. As Mezrich describes in his more recent book, it began at an Ibiza foam party called F@@k Me I’m Famous. A man they’d never met buttonholed them about “the oldest social network on earth.” He was talking about money, specifically in the form of the digital currency, and the twins were hooked. They bought up about 1 percent of all the bitcoin in the world. At first, they tried to turn their investment into a kind of company of its own, the world’s first exchange-traded fund for bitcoins. This would give the investing public an easy way to make the digital currency part of their 401(k)s — all for a small fee — but their applications were repeatedly denied by federal regulators.\n\nStill, Gemini was their biggest idea. Following the 2014 debacle of Mt. Gox — the largest bitcoin exchange in the world until it was hacked and robbed — there was a strong appetite for reliable crypto companies. “It was super exciting,” an early executive said of Gemini’s formative years. “I was working my ass off and I loved it.” Early on, the twins went out of their way to involve the New York Department of Financial Services, a historically nosy Wall Street regulator, and by 2015 would be one of the first to get a charter allowing it to operate in the state.\n\nThe business plan was to be one step ahead of Wall Street. As the hedge funds and Goldman Sachses of the world discovered crypto, the thinking went, Gemini would already be there, an inviting gateway into this new realm. Gemini was scrupulous about following the rules, employees said. In addition to working with New York regulators, the Winklevoss brothers would fly to Europe to meet with the financial authorities there. Gemini’s ad campaigns had taglines like “Crypto Without Chaos” and “The Revolution Needs Rules.” Whenever Gemini wanted to list a new digital currency for customers to trade, it informed the Department of Financial Services ahead of time, giving the regulators the chance to register an objection. Most times, DFS officials would either approve the request or decline to act against them — which, in effect, was seen to be the same thing, according to people familiar with the inner workings of the company. Generally, this plan worked. By 2019, Gemini had captured about 5 percent of the U.S. crypto exchange market — a small, but valuable, slice of a rich new industry.\n\nIn a wonderful twist of irony, Gemini nearly captured the business of a certain blockbuster client: Zuckerberg. Starting in 2018, the Facebook founder wanted to launch his own cryptocurrency, called Libra. At one point, according to three people directly familiar with the plans, Libra’s parent company was preparing to issue the digital currency through Gemini. Gemini employees had figured that DFS regulators were fine with it after hearing nothing back from a proposal. “It technically was approved,” said one person. The PR value of the plan would have been hard to overstate — here were the twins, getting back into business with their onetime nemesis, letting bygones go on a grand quest to get insanely rich. It was only after informing regulators again — extra safe, by the rules — that they raised concerns about the launch. Libra encountered further regulatory scrutiny after that, particularly on concerns that Facebook was too big, and was quietly euthanized in 2022.\n\nIn the months preceding the pandemic, ex-employees told me, something began to change. Their market share was not growing. Their biggest U.S. competitor, Coinbase, was becoming the go-to exchange. “We felt like we were missing out,” one ex-employee said. Abroad, the growth was even bigger. Binance, which had no headquarters (and thus no obvious regulatory obligations), had cemented itself as the world’s largest exchange. Sam Bankman-Fried’s FTX was also growing rapidly from its offshore outpost in Hong Kong, before relocating to an even friendlier jurisdiction in the Bahamas (where it would commit its epic $14 billion fraud). Inside Gemini, the bet on institutional customers appeared to be going nowhere. Goldman wasn’t giving them real business, and they were getting as much as they’d hoped from hedge funds, insiders said.\n\nIn 2020, the twins decided it was time for a pivot. They no longer wanted Gemini to be just an exchange where customers traded crypto. Instead, it would look more like a consumer bank, selling lots of financial products — credit cards, bank accounts, maybe even mortgages, one ex-employee said. At the center of that was a top-secret project called Earn, which would basically act like a high-yield checking account, except for crypto holdings instead of cash. “We would have this savings-like account. That’s how we viewed it internally, even though we never ever say that publicly anywhere, because we knew that we weren’t allowed to say that,” one person directly involved with the program said. It was an aggressive move to offer the general public a brand new interest-bearing product without clear regulatory approval — and this time Gemini didn’t ask the Department of Financial Services for permission ahead of time, according to two people familiar with the approval process. To knowledgeable observers in the crypto world, the logic of the Winklevosses’ strategy shift toward riskier and more aggressive product offerings was obvious enough. “They were hemorrhaging market share,” said Cory Klippsten, the CEO of Swan Bitcoin, a digital currency financial services company. “In an effort to stay alive, they basically did exactly what SBF did, which was go after retail deposits.”\n\nEarn worked by, essentially, connecting Gemini’s generally conservative customers and some of crypto’s wildest risk-takers. Gemini depositors could opt to put their crypto (say, their bitcoin or ethereum) in a special account that would pay them interest — as much as an 8 percent annualized — on the balance. For many depositors, it seemed like an easy way to make a little extra income while they waited for their crypto bags to moon. But, of course, the yield had to come from somewhere. At a traditional bank, a checking account yield comes from the bank lending out those same funds at a higher rate of interest. In the case of Earn, Gemini would lend out their customers’ crypto to other players in the industry (with crypto speculation at a fever pitch, there was a strong institutional demand to borrow crypto for trading) for a higher rate of interest than it ultimately paid to its customers. If everything went smoothly, it was win-win.\n\nInside Gemini, people involved said, the whole process of setting up the program took nearly a year, and involved intense debates about what kind of interest rates they should offer and whether they should lend out the crypto to multiple partners or only one. Gemini’s product managers considered partnering with a handful of lenders, including two companies that were successful doing what Earn aimed to do, paying retail investors interest on their crypto holdings by lending them other institutions. One was BlockFi, a firm that the twins had already invested in. The other was Celsius, a competitor. While the two firms appeared to be doing very well during the crypto bull market of 2020 and 2021, both would collapse in 2022 with their customers losing everything they had deposited. (Celsius’s founder, Alex Mashinsky, has since been charged with criminal fraud, and his trial is set for September 2024.)\n\nWhen Earn was publicly announced in February 2021, Gemini’s press release did not mention any lending partner and instead touted its own safety and reliability “on par with those offered by top financial institutions,” the company said. The company it chose as a partner was Genesis Trading, a big institutional player in the crypto space. Like Gemini, it was based in New York City and a related entity, Genesis Capital, was regulated by state watchdogs. Genesis was also a subsidiary of one of the companies that helped create the crypto industry, Digital Currency Group. The parent company was sitting on the world’s largest bitcoin horde (over 600,000 of them, held as part of a lucrative publicly tradable product called the Grayscale Bitcoin Trust). Because Genesis was overseen by such a big moneymaker — DCG booked more than $1 billion in revenue in 2021 — it was considered about as creditworthy as you could get in the crypto business.\n\nEarn was a surprise hit and quickly became the Winklevoss twins’ biggest product. In the first two weeks, according to internal metrics, it brought in $500 million in deposits; a month later, Gemini had made $1 million in fees. By June, the internal data showed, 73 percent of the customers had 99 percent of their money in Earn. Gemini depositors loved it because they earn high interest rates for doing basically nothing, all while working with the “crypto without the chaos” company. “Gemini has always had a reputation for being a trustworthy and secure platform,” said one Earn depositor, Glen, who asked to have his full name withheld for security reasons and because his family doesn’t know. “I trusted Gemini and assumed that any partnerships they had would be equally trustworthy.” On the back of that success and a booming market generally for all things crypto, Gemini reached a valuation topping $7 billion. The twins made the Forbes billionaires list, with $6 billion between them.\n\nStill, some Gemini employees were concerned. They thought that the crypto industry was too dependent on Genesis remaining stable and managing its risks intelligently. For skeptics, it looked like it could be a systemic point of failure in a larger crypto collapse. “If you didn’t know that Genesis was the counterparty to every interest-bearing crypto product, you were not paying attention,” one former Gemini employee told me. But an executive overseeing the project “would repeatedly say that he thought that their financials were very strong and that they are blue chip or whatever. He seemed to think that they were trustworthy.”\n\nIn the end, Genesis Trading wasn’t trustworthy. Internal records revealed during the criminal trial of Bankman-Fried showed that Genesis didn’t play by anything resembling the rules of a traditional financial firm. For instance, the company routinely approved billions of dollars in loans over Signal chats. One former loan officer said that confidential information was kept unsecured on the company’s servers. “Our credit risk team was a sham. I don’t know what they were doing,” said another ex-employee. “They had no risk reporting at all,” said a third. “There wasn’t a way to look at the portfolio very easily.” By early 2022, Genesis had discovered that about 60 percent of all its loans were concentrated in Bankman-Fried’s hedge fund, Alameda Research – which, of course, would blow up spectacularly before the end of the year.\n\nGemini was not unaware of the risks it was taking by parking a huge chunk of its customers’ funds with Genesis, according to ex-employees and court documents. The attorney general’s office alleged that Gemini’s risk team had downgraded Genesis’s risk level to junk status by February 2022. In the spring of that year, a Genesis employee privately met with Jared Shaw, Gemini’s head of finance, to tell him about how concentrated Genesis was in Alameda. (Shaw hadn’t responded to a request for comment prior to publication. Afterwards, he said “I had no private meetings or met with anyone at Genesis while at Gemini.”)\n\nAs 2022 rolled on, everything was starting to come apart — fast. In May, two of the world’s biggest cryptocurrencies, TerraUSD and Luna, collapsed, instantly evaporating $60 billion from the larger crypto economy. A month later, the hedge fund Three Arrows Capital went under, defaulting on more than $3 billion in obligations — including $2.3 billion in loans from Genesis, according to court records. According to the attorney general’s suit, this nearly led to Genesis’s bankruptcy. DCG, its parent company, issued a promissory note that appeared to plug a $1.1 billion hole in its balance sheet, though no money was actually exchanged. (One former Genesis employee said that the flimsy nature of DCG’s support﻿ was not known among rank-and-file employees at Genesis.)\n\nAt Gemini, the steep decline in crypto markets following the Terra-Luna and Three Arrows debacles only appeared to make the twins more remote. In January 2022, the twins had hired a new chief technology officer, Pravjit Tiwana, from Amazon. Seen internally as a likely candidate to one day run the exchange, Tiwana favored the kind of move-fast-and-break-things model that Silicon Valley ran on, dismantling the company’s quality assurance team, and pushing out several of the most experienced people on the risk team, former employees said. Tiwana was widely unpopular among those who’d helped build the company in its early years, particularly for weekly, companywide presentations where, ex-employees said, he and his lieutenants would grill employees on why they hadn’t hit goals that seemed far out of reach. (Tiwana left the company on November 15.) After laying off 10 percent of Gemini’s workforce in June, the twins went on a band tour, where they would play covers of Rage Against the Machine and Blink-182, among others. In one widely circulated clip of their set, they couldn’t quite remember the words to “Don’t Stop Believin’”:\n\nuh so i saw the winklevoss twins' band? tonight? like, it's really them pic.twitter.com/xVqYwQrztL — maggie ;) (@arch_nem) June 10, 2022\n\nMeanwhile, the problems with Earn were growing more obvious inside the company. Requests from Gemini risk officers for standard disclosures — like who Genesis was loaning money to — went unanswered, two people said. According to the New York attorney general’s lawsuit, Gemini knew that Genesis wouldn’t have the money to pay back its loans if it went under. Cameron said during a board meeting that Genesis was “lying about financials.” A lawsuit that Gemini would later file against the lender claims that Genesis gave them “falsified balance sheets and other financial reports, which falsely indicated that [Genesis] was solvent when in reality it was not.”\n\nOn October 13, Gemini gave Genesis 30 days notice that it would end the Earn program, court documents show. However, according to the attorney general’s suit, Gemini never stopped promoting Earn on its website and continued to funnel money into the soon-to-be bankrupt lender. Before those 30 days were up, Bankman-Fried’s crypto empire collapsed, revealing his extensive criminal fraud and sending crypto markets into freefall. Simultaneously, the true extent of Genesis’s risky lending was exposed. With so many loans concentrated with Alameda, Genesis was insolvent and soon after declared bankruptcy. When it did so, the $900 million in Earn customer funds that it controlled immediately became frozen — as they remain today. (Since those funds are invested in crypto and those markets are up dramatically in 2023, the overall value of the Gemini customer assets trapped with Genesis is now more than $1.1 billion.)\n\nIn the wake of the collapse, the twins tried to come to a settlement with DCG and its founder and CEO, billionaire and longtime crypto-Twitter troll Barry Silbert. During these negotiations, four people who were either inside one of the companies or were briefed on the discussions directly were told that Silbert and the twins discussed paying back customers some portion of their deposits immediately — but less than what they’d deposited. The payments would have taken the form of shares of DCG’s Grayscale Bitcoin Trust — which the twins’ exchange had secured in collateral, according to the suit filed against Genesis by Gemini.\n\nThe talks collapsed in December, and soon after, one of Gemini’s attorneys, Niels Gjertsen, left the company. (Gjertsen declined to comment.) The twins would soon take their fight against Silbert to Twitter, and add to their portfolio of lawsuits when they sued Genesis in Manhattan federal bankruptcy court for more shares of the bitcoin trust. (The U.S. Securities and Exchange Commission filed a civil suit accusing both companies of other financial violations that month.) Silbert’s company has claimed that Gemini’s suit is a “publicity stunt,” while Gemini is accusing its former lending partner of basically stealing from Earn customers. With the dispute playing out in court, Gemini’s Earn customers are still in limbo. Their assets show up in their accounts, but they are unable to access them. The day before Thanksgiving things got even worse: Genesis filed a suit seeking to claw back $689 million from Gemini customers who were able to get their money out before the collapse, making it less clear when or whether the other customers will ever be able to do so. (It’s also unclear whether, should the customers ever get paid back, it would be in current crypto prices, or the dollar amount of assets at the time of the bankruptcy, which were much lower.)\n\nMultiple former Gemini employees expressed frustration at what they saw as a mishandling by the Winklevoss brothers of a situation that didn’t need to leave the exchanges customers stranded and fearful of losing their assets. Among the victims are a 79-year-old grandmother who, according to the attorney general’s suit, invested her husband’s entire $199,000 savings into the program. She “had hoped to use this money to pay for her grandchild’s education. Outside of her Earn investment, she and her husband have little savings,” according to the suit. Glen, the depositor, declined to say how much he put into Earn but said that he’s had to delay a medical procedure because his money is frozen. “As for Gemini, I do believe they bear some responsibility, considering they were the ones offering and promoting the Earn program,” he said. “It seems only fair that they should cover at least a portion of the deposits to help mitigate the losses for users like myself.”\n\nThe twins are fighting the New York State charges against their business. Silbert is doing the same. (While Silbert was named as a defendant in the attorney general’s suit, the Winklevosses were not. Representatives from Gemini and Genesis didn’t respond to requests for comment.) Regardless of the outcome, the Winklevosses’ big opportunity appears to have passed them by. Coinbase, its largest U.S. competitor, saw 42 times more trading volume than Gemini on one recent November day, according to publicly available data. Its CEO, Brian Armstrong, has already cast himself as the most trustworthy major crypto CEO left. “We now have an opportunity to start a new chapter for this industry,” he recently said on X. In fact, the new chapter looks a lot like the vision that the twins first pitched before the last bubble burst.\n\nIn the crypto world, investors are preparing for another boom. Bitcoin has more than doubled off its 2022 lows. BlackRock, the world’s largest asset manager, is on the verge of offering its own bitcoin and ethereum ETFs — the very thing the Winklevosses tried to do a decade ago. JPMorgan Chase, the largest bank in the U.S., plans on issuing its cryptocurrency during the next year or so. Rather than scramble to win back a potential new wave of institutional business, the twins are, at least publicly, lamenting that they ever played by the rules at all. “We spent years doing things the right way, going in the front door, asking permission not forgiveness,” Cameron — or is it Tyler? — said in a June Instagram post. “And honestly, at this point, it’s unclear what good it’s done for us.”\n\nThis story was updated to include a comment from Jared Shaw denying meeting with any Genesis employees, and to clarify the timeline of the Genesis bankruptcy proceedings."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzMwL2JpdGNvaW4tZ29pbmctZnJvbS1ib2lsaW5nLXRoZS1vY2VhbnMtdG8tZHJhaW5pbmctdGhlbS1hY2NvcmRpbmctdG8tY3JpdGljL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzMwL2JpdGNvaW4tZ29pbmctZnJvbS1ib2lsaW5nLXRoZS1vY2VhbnMtdG8tZHJhaW5pbmctdGhlbS1hY2NvcmRpbmctdG8tY3JpdGljL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Going From Boiling the Oceans to Draining Them, According to Critic - CoinDesk",
        "content": "Bitcoin Going From Boiling the Oceans to Draining Them, According to Critic\n\nA data scientist for the Dutch National Bank, Alex De Vries, claims every bitcoin transaction uses enough water to fill a swimming pool.\n\nBy Jamie Crawley Nov 30, 2023 at 8:03 p.m. UTC"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd2VhdGhlci5jb20vbmV3cy9jbGltYXRlL3ZpZGVvL2Etc2luZ2xlLWJpdGNvaW4tdHJhbnNhY3Rpb24tdXNlcy0xMDAtYmF0aHR1YnMtb2Ytd2F0ZXItc3R1ZHktc2hvd3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "A Single Bitcoin Transaction Uses 100 Bathtubs Of Water, Study Shows - Videos from The Weather Channel - The Weather Channel",
        "content": "There’s plenty of data out there showing how much electricity is burned by bitcoin mining – it’s about the same amount each year as the entire country of Poland. New research looks at how that plays into water usage and how many gallons are consumed by a single bitcoin transaction."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1NDA4L3RydXN0LXdhbGxldC1iaXRjb2luLXRyYW5zYWN0aW9uc9IBSWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2NTQwOC90cnVzdC13YWxsZXQtYml0Y29pbi10cmFuc2FjdGlvbnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Trust Wallet says Bitcoin node issue is causing missing, failed transactions - The Block",
        "content": "Binance-owned Trust Wallet has reported experiencing a Bitcoin node issue, leading to users experiencing failed or delayed transactions and missing transactional history in the wallet app.\n\nThe non-custodial wallet provider attributed the issue to a recent surge in Bitcoin transactions. “Increased transactions per block in the Bitcoin network are putting pressure on nodes, causing instability across providers,” the team posted on X.\n\nTrust Wallet said it was closely monitoring the situation, but “users may experience missing transaction history for the Bitcoin-blockbook chain, up to six hours, and failed transactions.” Bitcoin Blockbook, initially developed to support Trezor wallets, is a blockchain indexer and backend solution for cryptocurrency wallets, enabling efficient queries for specific information, like transaction history or wallet balances.\n\nIn response to the post, some users complained the issue had already been ongoing for several hours. Trust Wallet said it was working diligently to address the issue. However, there had been no update since yesterday at the time of publication.\n\nTrust Wallet later updated users on the issue, stating it had implemented a fix. \"We found that an address with extremely high volumes and frequency caused issues when interacting with our system,\" Trust Wallet said, assuring users all funds were and continue to be safe.\n\nBitcoin transactions on the rise\n\nThe seven-day moving average of transactions on the Bitcoin network reached a record high of over 600,000 this week, according to The Block’s data dashboard.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe rise is mainly attributed to the latest surge in Bitcoin Ordinals inscriptions, frequently hitting 300,000 to 400,000 daily transactions over the last week, according to a Dune Analytics dashboard.\n\nAverage Bitcoin transaction fees also recently spiked to around $14 amid the surge, far higher than the usual $1 to $2 range but significantly less than the record average fees of over $50 in April 2021.\n\nUpdated with Trust Wallet's response."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi0xNjUtYnRjLXByaWNlLWdhaW4tMjAyNC1zdGFuZGFyZC1jaGFydGVyZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETF will drive 165% BTC price gain in 2024 — Standard Chartered - Cointelegraph",
        "content": "Bitcoin (BTC) may hit $100,000 in one year’s time thanks to “earlier than expected” exchange-traded funds (ETF) launching, says Standard Chartered.\n\nIn a research note issued on Nov. 28 quoted by sources including Business Insider, the banking giant doubled down on its bullish BTC price targets.\n\nStandard Chartered still expects six-figure BTC price\n\nBitcoin is in line to trade at six figures by the end of 2024, the latest forecast from Standard Chartered concludes.\n\nThanks to the United States potentially approving Bitcoin spot price ETFs, BTC/USD has the ability to almost treble from its current $37,700 over the coming 12 months.\n\n“We now expect more price upside to materialize before the halving than we previously did, specifically via the earlier-than-expected introduction of US spot ETFs,” Geoff Kenrick, Standard Chartered’s head of EM FX Research, West and Crypto Research, wrote.\n\n“This suggests a risk that the USD 100,000 level could be reached before end-2024.”\n\nThe figure continues the consumer banking giant’s already optimistic vision of how Bitcoin will grow in the coming years.\n\nIn July, research eyed the declining availability of the BTC supply as a reason to believe that much higher prices were in store. Specifically, Kenrick said at the time that $50,000 was on the cards by the end of 2023.\n\nHe also suggested that miners would begin hoarding more of their own BTC stocks amid increasing hash rate and the upcoming block subsidy halving decreasing BTC earned per block by 50%.\n\n“Increased miner profitability per BTC (bitcoin) mined means they can sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,” he summarized.\n\nSpot Bitcoin ETF: Counting down the weeks\n\nThe ETF narrative is firmly in the spotlight this month as derivatives premiums shoot higher and buzz around a potential approval in January heightens.\n\nRelated: Spot Bitcoin ETF: Why this time is different\n\nBTC price trajectory has been sensitive to related news. Earlier in November, the market gained rapidly over anticipation of a possible approval coming from U.S. regulators before the January window.\n\nSpot Bitcoin ETF application data. Source: James Seyffart/X\n\nAt the same time, concerns linger over large-volume investors selling off once the greenlight appears — in what would constitute a “buy the rumor, sell the news” event, which could leave latecomers at a loss.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvcy9zaWxrLXJvYWQuYXNw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "What Was the Silk Road Online? History and Closure by FBI - Investopedia",
        "content": "What Was Silk Road?\n\nSilk Road was a digital black market platform that was popular for hosting money laundering activities and illegal drug transactions using Bitcoin. Silk Road, regarded as the first darknet market, was launched in 2011 and eventually shut down by the FBI in 2013. It was founded by Ross William Ulbricht, who is now serving a life sentence in prison for his role in Silk Road.\n\nSince that time, several other darknet markets have risen.\n\nKey Takeaways The Silk Road was an online black market where buyers and sellers of illegal or unethical items could transact anonymously.\n\nUtilizing privacy techniques such as the Tor network and cryptocurrency transactions, people were able to transact in drugs, hacked passwords, illegal data, and other contraband.\n\nThe FBI shut down Silk Road in 2013, and its founder, Ross Ulbricht, was sentenced to prison for life.\n\nUnderstanding Silk Road\n\nThe digital era has brought many technological innovations to our home fronts and created lifestyles that were unthinkable at the turn of the century. We can now conduct transactions online with ecommerce sites, pay for online transactions using virtual currency, get loans online using social lending sites, operate anonymously on the web using data anonymization technology, and even connect with company recruiters using social media sites. The list of digital technology inventions goes on and ventures into every sector of the world's economy.\n\nWhat Lead to Its Creation?\n\nAn increase in the use of cyber technology like cryptocurrency and ecommerce marketplaces led to an increase in the demand for data privacy. Demand for privacy increased regulation and laws over how data is used; additionally, an increase in technological tools and platforms was created to serve users who prefer to live more anonymously. While the initiation of data anonymization tools helps protect users' personally identifiable information (PII), these tools are also used by entities who intend to conduct illegal and criminal activities. In 2011, the Silk Road was born out of a need to connect illicit drug sellers with interested buyers online while protecting their identities and transactions using anonymization techniques.\n\nThrough a combination of data anonymization technology, a trading platform, and a feedback system, Silk Road created a haven for drug traders. The site was accessible only through a network known as Tor, which exists mainly to anonymize user data and activities online. Tor obfuscates users' addresses so they appear hidden from unwanted parties looking to surveil the users' transactions and activities—in other words, Silk Road, Tor, and cryptocurrency was the ultimate privacy toolkit for illegal operations.\n\nBitcoin is designed to be anonymous, with only the wallet's public address displayed on the blockchain. If the wallet owner doesn't want to be associated with the address, there isn't any way to identify them if they don't reveal themselves some other way. Addresses with questionable transactions are monitored by authorities for activity, which is how many illegal transactions using cryptocurrency are identified.\n\nPrivacy and Feedback\n\nSome Silk Road buyers and sellers brazenly conducted illegal drug transactions without fear because their IP addresses could not be traced back to them. Another reason Silk Road thrived was the buyer feedback system implemented on the platform. Buyers would normally provide feedback on sellers after receiving their goods. The feedback received was then used by the site to weed out fraudulent sellers, while reputable sellers had their products highly sought after. This promoted buyer confidence in the online platform.\n\nAll trades on Silk Road were conducted using the virtual currency known as Bitcoin. Every Bitcoin transaction is recorded on a public ledger, which is easily surveilled by legal and regulatory bodies.\n\nThe Fall of Silk Road\n\nThe Silk Road came to its demise in 2013 after the FBI learned about the existence of the hidden marketplace and colluded with the DEA, IRS, and Customs agents. Although the federal agents admitted that the use of Tor and Bitcoin to obscure addresses were significant obstacles that they encountered, they were still able to crack down on the underground drug market.\n\nThe FBI shut down the site permanently, seized more than 144,000 bitcoins (then valued at $34 million), and arrested several users of the site, including the founder, Ross Ulbricht, who made about $80 million in commissions from transactions carried out within the site. Ulbricht was convicted in 2015 and is currently serving a life sentence without the possibility of parole.\n\nDoes the Silk Road Still Exist Today? The Silk Road, as it was before being taken down in 2013, no longer exists. However, the dark web is still operating, and most things found on Silk Road are available via various venues. Authorities continue to crack down on illegal operations.\n\nWhat Happened to the Bitcoins Seized From Silk Road? More than 144,000 were recovered at the time of the takedown. But in 2022, James Zhong pled guilty and was convicted of wire fraud. IRS special agents recovered more than $3 billion in cryptocurrency from his home, stolen from Silk Road in 2012.\n\nDoes Ross Ulbricht Still Have Bitcoin? Ulbricht is still in prison as of 2023 and no longer has any bitcoin unless it is hidden somewhere and agents did not find it.\n\nThe Bottom Line\n\nSilk Road was the name of a platform used on the dark web to sell illegal goods, providing anonymity for those who required it for their activities. Federal agents took the site down, and the founder was arrested in 2013.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzAxL2dyYXlzY2FsZS1nZWFycy11cC1mb3ItYml0Y29pbi1ldGYtcmFjZS1ieS1oaXJpbmctaW5kdXN0cnktdmV0ZXJhbi1mcm9tLWludmVzY28v0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzAxL2dyYXlzY2FsZS1nZWFycy11cC1mb3ItYml0Y29pbi1ldGYtcmFjZS1ieS1oaXJpbmctaW5kdXN0cnktdmV0ZXJhbi1mcm9tLWludmVzY28vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Grayscale Setting Up for Bitcoin ETF Race by Hiring Industry Veteran From Invesco - CoinDesk",
        "content": "“The Grayscale team is thrilled to have John Hoffman join us as Managing Director and Head of Distribution and Strategic Partnerships. John has a wealth of industry and ETF expertise, which will be invaluable to our team and clients, especially during this exciting time at Grayscale,” Dave LaValle, Global Head of ETFs at Grayscale said."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5ud2l0aW1lcy5jb20vYnJhbmRhdmVzdHVkaW9zL2Rpc3NlY3RpbmctYml0Y29pbnMtcHJpY2UtZmx1Y3R1YXRpb25zLWtleS1mYWN0b3JzLWV4cGxvcmVkL2FydGljbGVfMjY4NmJhOGItZGY2OC01NTRiLTlkMzctYTVkYzI5OWIzYzIwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Dissecting Bitcoin's price fluctuations: Key factors explored - The Times of Northwest Indiana",
        "content": "Bitcoin is the world's most popular cryptocurrency, and it has seen a wave of price fluctuations over the years. At times, Bitcoin's value has soared to unprecedented heights. However, it has also seen significant drops in value, leaving investors cautious and wondering about the critical factors behind these fluctuations. Throughout this article, we will explore these Bitcoin price fluctuations in detail, providing investors in Indiana and beyond a better understanding of what makes the cryptocurrency tick.\n\nAnalyzing Bitcoin's market sentiment\n\nMarket sentiment is one of the driving forces behind Bitcoin price fluctuations. For example, when investors are optimistic about Bitcoin and the cryptocurrency market, the Bitcoin price in USD tends to increase in value. On the other hand, when there is negative market sentiment from investors or the public, the cost of Bitcoin tends to fall. But what factors influence market sentiment? News reports, social media posts from prominent figures, market trends, and regulatory changes can affect cryptocurrency.\n\nDecoding Bitcoin's regulatory shifts\n\nGovernment's outlook on cryptocurrencies is an ever-changing landscape, with countries worldwide having opposing views on digital currencies, and this can have massive implications on the price fluctuations of Bitcoin. For example, in 2021, China banned cryptocurrency trading and mining, leading to a drop in Bitcoin's price; this stance has been kept up in 2023 with Beijing-based social media app Weibo removing 80 popular crypto influencers from its platform. However, other countries have a more positive outlook on Bitcoin and cryptocurrencies. For example, El Salvador became the first country to recognize Bitcoin as a legal tender, driving its price up.\n\nBitcoin's vulnerability to market manipulation\n\nBitcoin and the cryptocurrency market to which it belongs are vulnerable to market manipulation. For example, some investors and traders use tactics like pump and dumps and spoofing and wash trading schemes to manipulate the price of Bitcoin and other cryptocurrencies. Unfortunately, this can lead to sudden drops and spikes in Bitcoin's price, harming the general opinion of cryptocurrencies and Bitcoin.\n\nUnderstanding Bitcoin's market rivals\n\nAnother critical factor to discuss and understand when exploring Bitcoin's price fluctuations is its competition from other cryptocurrencies. For example, Bitcoin faces stiff competition from other emerging cryptocurrencies like Ethereum, Binance Coin, and Cardano, which offer different benefits and features. This can lead to investors choosing other cryptocurrencies over Bitcoin as their sole market investments, leading to Bitcoin's price decline.\n\nEconomic drivers in Bitcoin's market\n\nBitcoin's price fluctuations are also affected by the economy as a whole in the United States. For example, inflation and global economic conditions like recessions and interest rates can all affect Bitcoin's price. These factors can make investors change their focus to markets that are more traditional and other investments, hurting Bitcoin's price. Nevertheless, Bitcoin did see a remarkable rise in its price during 2020, when there was a global pandemic, US-China tensions, and Brexit in the United Kingdom. These are all factors that would usually make investors wary.\n\nEnvironmental concerns in Bitcoin mining\n\nFurthermore, concerns have been raised over the energy consumed during Bitcoin mining and its environmental impact. For example, environmental groups such as Greenpeace have called out financial management and payment process companies that have ventured into Bitcoin mining. This has led to more people opting out of investing in Bitcoin due to their ecological beliefs and the scrutiny they may face for supporting it, which, in turn, has led to a decline in Bitcoin's price.\n\nSummarizing Bitcoin's price fluctuations\n\nIn conclusion, Bitcoin's price is affected by environmental concerns in Bitcoin mining, economic drivers like inflation, cryptocurrency market rivals, market manipulation, regulatory shifts from governments, and market sentiment. This makes it crucial for investors to watch the latest news reports and trends regarding cryptocurrencies and Bitcoin to make more informed investment decisions.\n\nInformation is intended for educational purposes only and is not to be used as investment advice. As with all investments, there is risk and the past performance of a particular asset class does not guarantee any future performance.\n\nThis provided content was produced by Lee Enterprises. The news and editorial departments had no role in its creation or display."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yZXNlYXJjaC10aGUtZHluYW1pY3Mtb2YtbWFya2V0LW1hbmlwdWxhdGlvbi1iZWZvcmUteW91LWp1bXAtaW4tYml0Y29pbi1ldGZz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Research the dynamics of market manipulation before you jump in Bitcoin ETFs - Cointelegraph",
        "content": "Investors are eagerly anticipating the potential approval of a spot bitcoin exchange-traded fund (ETF) by the United States Securities and Exchange Commission (SEC). The excitement began in early June when the investment giant BlackRock submitted a filing for the product and gained further momentum after a court decision mandated the SEC reconsider its rejection of Grayscale's proposal to transform its Bitcoin Trust (GBTC) into a spot ETF.\n\nThe SEC’s objection to ETFs is related to the fact that Bitcoin (BTC) is traded in unregulated venues around the world, which poses a challenge in preventing fraud and price manipulation.\n\nOne attempt to address the issue has included surveillance-sharing agreements (SSA) with some cryptocurrency exchanges. In theory, this would allow the identification of bad actors who attempt to manipulate the market. Critics question the efficacy of these SSAs given they cannot cover the entire market. ETFs are based on precedent decisions that allowed spot commodity ETFs based on the relevance of the underlying commodity futures markets.\n\nRelated: With Bitcoin’s halving months away, it may be time to go risk-on\n\nThe SEC has established that the futures should lead the spot in price formation in order to be considered a “regulated market of significant size.” In other words, information from the futures market takes precedence over the spot market in the price discovery process. Yet, even if price discovery is led by the futures market, there are still some cases where manipulation in the spot markets can spread to the ETF. The devil is in the details, and more specifically, in the price source for the net asset value (NAV) calculation and in the creations and redemptions method (in-cash or in-kind).\n\nConsider a scenario where a manipulator successfully drives the underlying commodity price down by 5% in unregulated spot markets.\n\nA 2019 Bitwise report on using volume-weighted median price to protect against manipulation of the NAV. Source: Bitwise\n\nIf the creations and redemptions are in-kind, there is a straightforward arbitrage that acts like communicating vessels between the ETF and the unregulated spot markets. In this example, the arbitrageur can exploit it by simply buying underpriced spot commodity and selling the corresponding amount of the ETF, and then using the bought commodity to create new ETF units and cover the short ETF position. The profitability of this trade will last until there is a substantial convergence of the spot commodity price and the equivalent amount of the ETF. How much each price will move toward the convergence depends on their liquidity, but some of the adjustment will come from the ETF price, meaning that the manipulation in the spot market spreads to the ETF, at least in part.\n\nIn a case where the creations and redemptions are in cash and the NAV is calculated with commodity prices derived from the unregulated spot markets, a very similar arbitrage is possible. The arbitrageur buys underpriced spot commodity and sells the ETF, uses cash to create ETF units to cover the short position and sells the commodity trying to replicate the pricing methodology used in the NAV calculation (which determines the price paid for the creations). Apart from worse capital efficiency (due to cash disbursement for creation) and a small execution risk when replicating the NAV price, the trade is basically the same as with in-kind creation and the consequences are similar.\n\nRelated: Futures will be the best crypto game in town even after a Bitcoin spot ETF\n\nIs there a setup that effectively shields the ETF from manipulation? The use of spot prices derived from the futures curve for calculating NAV, coupled with in-cash creations and redemptions, emerges as the most promising alternative. If an arbitrageur attempts to apply the same method as in the previous case, there is no guarantee of selling the commodity at a price similar to that used in NAV calculation, especially in the presence of a manipulator in the spot market. The trade is no longer an arbitrage. The pipes connecting the spot price and the ETF price are obstructed.\n\nOn the flip side, this setup facilitates a straightforward arbitrage path between the ETF and futures. Whenever the ETF price diverges from the spot price implied by the futures curve, an arbitrageur can execute a trade in the opposite position with perfect hedging on futures, establishing a robust link between the ETF and the futures market. It is reasonable to believe that an ETF with such characteristics would be as resistant to manipulation in unregulated spot markets as the futures contracts or a futures ETF.\n\nBoth academics and practitioners have already found some robust evidence supporting the idea that CME Bitcoin Futures are dominant in Bitcoin’s price discovery. Undoubtedly, a spot Bitcoin ETF in the U.S. would be a good development for the traditional markets and the crypto industry. As the American pastor Chuck Swindoll once said, \"The difference between something good and something great is attention to detail.\" By keeping the devils away, a Bitcoin ETF has the potential to be truly great for investors.\n\nJoão Marco Braga da Cunha is the portfolio manager at Hashdex. He obtained a master of science in economics from Fundação Getulio Vargas before obtaining a doctorate in electrical and electronics engineering from the Pontifical Catholic University of Rio de Janeiro.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wYW5kby1zcG90LWJpdGNvaW4tZXRmLWJsYWNrcm9jay1yZXZpc2VzLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETF race gets 13th entrant, BlackRock revises ETF model - Cointelegraph",
        "content": "Swiss asset manager Pando Asset has become an unexpected late entrant into the spot Bitcoin (BTC) exchange-traded fund (ETF) race in the United States.\n\nOn the same day, investment giant BlackRock met with the country’s securities regulator to pitch an updated ETF model based on the agency’s feedback.\n\nOn Nov. 29, Pando submitted a Form S-1 to the U.S. Securities and Exchange Commission (SEC) — used to register securities with the agency — for the Pando Asset Spot Bitcoin Trust.\n\nLike other ETF bids, the trust aims to track Bitcoin’s price with the custody arm of the crypto exchange Coinbase to hold Bitcoin on behalf of the trust.\n\nPando is the 13th applicant for an approved spot Bitcoin ETF in the U.S. and joins the race with a dozen others, including BlackRock, ARK Invest and Grayscale.\n\nIn a Nov. 29 X (formerly Twitter) post, Bloomberg ETF analyst Eric Balchunas said he has “more questions than answers” about Pando’s filing, questioning why it came so late.\n\nmore questions than answers: where have they been for last 3mo? why bother at this point? if they make Jan 10 crew what does that say about fair play and even society as we know it? And what exactly is a Pando? — Eric Balchunas (@EricBalchunas) November 29, 2023\n\nBalchunas also raised concern about the implications should Pando’s ETF be among the Bitcoin ETF filings he predicts will be approved on Jan. 10.\n\n“What does that say about fair play and even society as we know it?” he added.\n\nBalchunas and fellow Bloomberg ETF analyst James Seyffart have put their money on Jan. 10 as the day all spot Bitcoin ETFs would be approved at once, as it’s the deadline for the SEC to deny or approve ARK Invest’s application.\n\nHowever, Seyffart told his followers on X that he doubts Pando’s ETF “is ready to go on [the] first day with the others but crazier things have happened I guess.”\n\nBlackRock meets with SEC to discuss ETF bid\n\nMeanwhile, the SEC met with BlackRock and Invesco executives on Nov. 28 to discuss their ETF bids, according to agency documents.\n\nBlackRock pitched a revision to its redemption model to address the SEC’s concerns from an earlier meeting on balance sheet impacts and risks to U.S. broker-dealers dealing with offshore crypto entities.\n\nRelated: ‘Buy the rumor, sell the news’ — Bitcoin ETF may spark TradFi sell-off\n\nBalchunas explained the revision sees the offshore entity getting Bitcoin from Coinbase and pre-paying the U.S. registered broker-dealer in cash, which cannot directly handle Bitcoin.\n\nHere's the original vs revised in-kind model, look like the new thing is STEP 4, which is the offshore entity market maker getting bitcoin from Coinbase and then pre-paying in cash to the US registered broker dealer (who is not allowed to touch bitcoin). pic.twitter.com/bDgYAnufWA — Eric Balchunas (@EricBalchunas) November 29, 2023\n\nBalchunas explained in a Nov. 17 X post that broker-dealers can’t deal in Bitcoin, and the SEC was asking ETFs to have redemption models that “puts [the] onus on issuers to transact in Bitcoin and keeps broker-dealers from having to use unregistered subsidiaries or third party firms to deal [with] the BTC.”\n\nMagazine: Crypto City Guide to Helsinki: 5,050 Bitcoin for $5 in 2009 is Helsinki’s claim to crypto fame"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1Mzg3L2FudHBvb2wtYWdyZWVzLXRvLXJlZnVuZC1yZWNvcmQtMy1taWxsaW9uLWJpdGNvaW4tdHJhbnNhY3Rpb24tZmVl0gFpaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1Mzg3L2FudHBvb2wtYWdyZWVzLXRvLXJlZnVuZC1yZWNvcmQtMy1taWxsaW9uLWJpdGNvaW4tdHJhbnNhY3Rpb24tZmVl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "AntPool agrees to refund record $3 million Bitcoin transaction fee - The Block",
        "content": "Bitcoin BTC -3.54% mining pool AntPool has agreed to refund the record-breaking $3 million transaction fee it mined last week, pending owner verification.\n\n“On November 23rd, some user submitted 83 BTC as a gas fee,” AntPool wrote in the announcement. “The risk control system of AntPool temporarily froze the fee when packaging the transaction. Please contact us before 00:00 (UTC+8) on December 10, 2023 and verify personal identity. After verification, AntPool will refund the fee.”\n\nAntPool requested the original owner of the funds to prepare a signing tool, such as Electrum or Bitcoin Core — the most widely used software implementation of the Bitcoin protocol — using the private key of the address that sent the transaction to sign the message “AntPool”, then send the signed text to its support email address.\n\nRecord-breaking $3 million fee\n\nLast week, a Bitcoin user appeared to have accidentally paid the transaction fee of over $3 million last week, setting a new record in U.S. dollar terms for a single Bitcoin transaction.\n\nThe transaction paid 83.65 BTC ($3.1 million) to transfer 55.77 BTC ($2.1 million). The pre-transaction balance was 139.42 BTC ($5.2 million), with the user overpaying by 120,528 times, according to Bitcoin explorer Mempool.\n\nThe transaction was mined by AntPool in block 818,087 but it had not publicly commented on the matter until now. The previous record $500,000 fee paid in September was subsequently identified as a “fat finger” overpayment by the crypto services provider Paxos. F2Pool, the miner facilitating that transaction, agreed to reimburse the fee to Paxos.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nHack claim\n\nThe incident was followed by a Bitcoin user claiming to be the victim of the $3 million transaction fee, stating that it was their wallet that paid the fee and that they had been hacked.\n\n“I created a new cold wallet, transferred 139 BTC to it and it got transferred out to another wallet immediately,” the user “83_5BTC” posted on X. “I can only imagine that someone was running a script on that wallet and that the script had a weird fee calculation. 55 BTC gone forever. 83.5 BTC to be decided.”\n\nThe same user had signed a message appearing to demonstrate ownership of the key that made the transaction, verified by Mononaut, the pseudonymous developer behind the Bitcoin explorer Mempool. However, if the wallet was compromised, it could also have been signed by an attacker. This means AntPool would need another method to verify the victim’s identity, Mononaut added. It is unclear whether AntPool intends to do this.\n\nAccording to Mononaut, the likely cause of a hack was the use of a low-entropy wallet, possibly a brainwallet, meaning it was created with insufficient randomness, making it vulnerable to attacks. The transaction was quickly fee-bumped using replace-by-fee (RBF) — a Bitcoin protocol feature that allows a sender to increase the transaction fee on an unconfirmed transaction, enabling quicker network processing. If it was indeed a low-entropy wallet, multiple attackers could have been competing to steal the funds, Mononaut suggested. This would explain the high fee, with scripts configured to spend a significant portion of the transaction to hinder competitors.\n\nAntPool did not immediately return a request for comment from The Block."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJlc3QtbW9udGhseS1jbG9zZS0xOS1tb250aHMtYnRjLXByaWNlLTM4a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin sees best monthly close in 19 months as BTC price taps $38K - Cointelegraph",
        "content": "Bitcoin (BTC) returned to $38,000 on Dec. 1 after the November monthly close became its best since April 2022.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin bears fail to spark monthly close sell-off\n\nData from Cointelegraph Markets Pro and TradingView tracked impressive overnight BTC price performance, which held key support.\n\nThe close came in at just over $37,700, with bid liquidity preserving the intraday range and avoiding a last-minute sell-off, per order book data from trading resource Material Indicators.\n\nBTC/USDT order book data. Source: Material Indicators/X\n\n“Monthly close looks pretty good closing above $35K,” popular trader Skew reacted on X (formerly Twitter).\n\n“Could see some multi week compression between $35K - $39K.”\n\nBTC/USD 1-month chart. Source: Skew/X\n\nSkew added that major resistance on monthly timeframes now lies higher — at $47,000 and around the 2021 all-time high of $69,000.\n\n“Monthly candle was excellent with a candle body low of $34.5K, this is important in that the lower candle BODY low was higher then the preceding candle BODY high. This is a sign of strength!” fellow trader and chartist JT continued in part of his own summary.\n\n“And lest we forget we closed $3K higher this month than last month, and thats progress!”\n\nJT described the high-timeframe chart outlook as “consistent and constructive.”\n\n$BTC\n\n\n\nBitcoin breaking out on low time frame. pic.twitter.com/MBBXmZ2iBz — The Wolf Of All Streets (@scottmelker) December 1, 2023\n\nThe trip above the $38,000 mark, which came hours after the close, marked Bitcoin’s first noticeable move in the latter half of the week. United States macroeconomic data prints, conversely, failed to attract much of a response.\n\nJerome Powell, chair of the Federal Reserve, was due to speak on the day in what would be the last chance for external volatility to be triggered.\n\nBTC price range has “significant” features\n\nHighlighting the stubborn nature of the current range below $40,000, meanwhile, Material Indicators co-founder Keith Alan argued that clearing it would be highly significant.\n\nRelated: Bitcoin ETF will drive 165% BTC price gain in 2024 — Standard Chartered\n\nAlan referenced the historical resistance/support (R/S) lines in play within the range, which are of similar importance to those already cleared, such as the previous cycle’s 2017 all-time high near $20,000.\n\n“If you think BTC is hovering around an arbitrary price you would be mistaken. There is a significant amount of historical confluence in this little R/S Flip Zone,” he wrote overnight.\n\nAn accompanying chart showed the levels to note on the monthly chart, along with long and short signals from one of Material Indicators’ proprietary trading indicators.\n\nBTC/USD 1-month chart. Source: Material Indicators/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1Mzc2L2JpdGNvaW4tY2FwaXRhbC1pbmZsb3ctZmVkLXJhdGUtcGF1c2UtZGVjZW1iZXLSAVZodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjUzNzYvYml0Y29pbi1jYXBpdGFsLWluZmxvdy1mZWQtcmF0ZS1wYXVzZS1kZWNlbWJlcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin capital inflow may rise with expected Fed rate pause in December - The Block",
        "content": "Bitcoin BTC -3.54% could see more capital inflow if the U.S. Federal Reserve pauses rates at its next meeting on Dec. 13, according to analysts.\n\n\"There is anticipation of a pause in the Fed's interest rate hikes, as indicated by Federal Reserve Governor Christopher Waller's recent statements,\" Bitfinex analysts told The Block, adding: \"An interest rate pause could lead to more capital flowing into risk assets like bitcoin.\"\n\nThe Bitfinex analysis referenced a speech by Federal Reserve Governor Chris Waller earlier this week. In the speech, Waller mentioned that the easing of the U.S. economy's pace was an encouraging sign, indicating that the current monetary policy aligns with the Fed's 2% inflation goal. \"Data for October indicated an easing in economic activity, and forecasts for the fourth quarter show the kind of moderation that is more in keeping with progress on lowering inflation,\" Waller said in a speech on Tuesday.\n\nHigh probability of a rate pause\n\nWaller added that he is confident current monetary policy is \"well positioned to slow the economy and get inflation back to 2%.\" His comments — combined with CME FedWatch's 95% probability of a rate pause at the next Federal Open Market Committee meeting in December — are fostering optimism among analysts.\n\nThe Fed official was encouraged by the consumer price index inflation reading for October. \"This is what I want to see,\" he said. \"For the month, there was no inflation, prices were virtually flat, and unlike earlier moments where improvements were concentrated in some goods and services, the moderation in inflation was broadly distributed,\" he added.\n\nRELATED INDICES See crypto indices\n\nHowever, Bitfinex analysts stressed that it is important to note that Waller also cautioned that inflation is still high. There is uncertainty about whether the slowing trend will be sustained. \"Therefore, while a rate pause might boost bitcoin and other cryptocurrencies in the short term, the long-term impact would depend on a range of economic factors and the overall direction of monetary policy,\" Bitfinex analysts said.\n\nThe potential of Fed rate cuts in 2024\n\nInvestors are looking forward to the next Federal Reserve rate announcement with anticipation. Particular attention will be given to the nuances in Fed Chair Jerome Powell's post-announcement press conference and any signals about possible rate cuts in 2024.\n\nBitfinex analysts pointed to signals that indicate the market anticipates the U.S. central bank will commence cutting rates in the spring of 2024. \"The anticipation of such a pause has already influenced bond yields and trader expectations, with rate cuts being priced in starting from May 2024,\" Bitfinex analysts said.\n\n\"We believe part of the current price action and long-term holder positioning for a sustained long-term price increase is part of this effect. This shift in monetary policy, if it occurs, could create a more favorable environment for investment in risk assets, including cryptocurrencies,\" the analysts added."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5kdHYuY29tL3NjaWVuY2UvYS1zaW5nbGUtYml0Y29pbi10cmFuc2FjdGlvbi1jb25zdW1lcy1lbm91Z2gtY2xlYW4td2F0ZXItdG8tZmlsbC1hLXN3aW1taW5nLXBvb2wtc3R1ZHktNDYyNDAwMdIBgQFodHRwczovL3d3dy5uZHR2LmNvbS9zY2llbmNlL2Etc2luZ2xlLWJpdGNvaW4tdHJhbnNhY3Rpb24tY29uc3VtZXMtZW5vdWdoLWNsZWFuLXdhdGVyLXRvLWZpbGwtYS1zd2ltbWluZy1wb29sLXN0dWR5LTQ2MjQwMDEvYW1wLzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "A Single Bitcoin Transaction Consumes Enough Clean Water To Fill A Swimming Pool: Study - NDTV",
        "content": "Bitcoin mining consumed 1.6 trillion litres of water worldwide in 2021.\n\nA single Bitcoin transaction could use the same amount of clean water needed to fill a garden swimming pool, according to a new study on the world's most popular cryptocurrency. According to New Scientist, Alex de Vries at the VU Amsterdam School of Business and Economics in the Netherlands calculated that Bitcoin mining, used in part to create new Bitcoins, consumed 1.6 trillion litres of water worldwide in 2021. Broken down per transaction, that means a single Bitcoin trade consumed approximately 16,000 litres of clean water, which is enough to fill a small swimming pool.\n\nNow, experts believe that the use of clean water in Bitcoin mining will rise to 2.3 trillion litres this year. According to the study published in the journal Cell Reports Sustainability, this sheer scale of Bitcoin mining's water consumption could impact drinking water if it continues to operate without regulation, especially in countries that are already battling water scarcity, including the United States. This is \"increasingly hard to defend,\" said Mr Alex.\n\nAccording to the study, mining Bitcoin requires huge computing power to solve mathematical equations on the internet. Water, which is evaporated, is used to cool the computers at large data centres and also to lower the temperature of coal-and-gas-fired power plants that also power Bitcoin mining computers.\n\n\"The mining devices are effectively just generating random numbers all day long, and they just throw them all away and nothing - nothing - useful comes out,\" Mr Alex wrote in the paper. \"It's just one backyard swimming pool going, going up in the air, literally evaporating on average per Bitcoin transaction,\" he added.\n\nAlso Read | Google DeepMind Discovers \"800 Years' Worth Of Knowledge\"\n\nNotably, according to Euronews, the environmental impact of mining Bitcoin has been widely documented, but this is the first assessment of its water use and wider environmental impact. Study authors believe that with the rise in Bitcoin price, its water consumption will also increase to 2,300 gigalitres, which is more than 40% compared to 2021. Mr Alex argued that using renewable energy instead of electricity would not be a solution to reducing Bitcoin's carbon footprint.\n\nHowever, in the study, he also wrote that if Bitcoin changed its technology to be more environmentally friendly, the crypto's environmental damage would reverse overnight. \"If you make the change you cut the majority of everything: the carbon emissions, water footprint, electronic waste, it all goes out the window overnight. Literally, the moment you make the software change, it's all gone,\" Mr Alex said. \"Bitcoin is responsible for half a per cent of global electricity consumption, [and] we could cut this by tomorrow,\" he added."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8yMDgzMzIvaXMtYml0Y29pbi1wb2lzZWQtZm9yLWFub3RoZXItYnVsbC1ydW4tZXhwZXJ0cy13ZWlnaC1pbtIBV2h0dHBzOi8vZGVjcnlwdC5jby8yMDgzMzIvaXMtYml0Y29pbi1wb2lzZWQtZm9yLWFub3RoZXItYnVsbC1ydW4tZXhwZXJ0cy13ZWlnaC1pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Is Bitcoin Poised for Another Bull Run? Experts Weigh In - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin today hit $39,000 per coin for the first time since a brutal digital asset crash in May 2022 that brought with it a long and painful bear market.\n\nThe virtual coin has since made a terrific comeback: at the start of January, it was trading for less than $17,000 per coin; it is now up 128%.\n\nCould this mean we’re seeing the beginning of a bull run? Some experts say it’s only up from here.\n\nAD\n\nAD\n\nA lot has happened in the crypto space since blockchain project Terra collapsed last year, leading to a plunge in every virtual coin and token and lots of bankruptcies—most notably, mega exchange FTX.\n\nChased by a toxic mix of industry failures alongside historically high interest rates and it looked like the crypto would never make it back.\n\nBut institutions—including Wall Street giant BlackRock—have since shown big interest in the crypto sphere: the firm and other prestigious names in finance have applied to the Securities and Exchange Commission for a spot Bitcoin exchange-traded fund (ETF).\n\nAnd the Federal Reserve might just be done with fiscal tightening, which last year caused investors to avoid “risk-on” assets such as equities and crypto.\n\nIn a report Friday, crypto asset manager Grayscale’s research team said that it sees “gradually improving crypto fundamentals”—so long as the central bank “has finished tightening and the U.S. economy can avoid a ‘hard landing’ (recession).”\n\nAD\n\nAD\n\nGrayscale also mentioned next year’s halving, which will see Bitcoin miner rewards slashed in half and lead to more scarcity in the market—and therefore “should be positive for valuations.”\n\nAnd James Butterfill, head of research at digital asset manager CoinShares, told Decrypt that investors are wanting to branch out—and this could be good for Bitcoin.\n\n“The increasing correlation between bonds and equities—now at a record high of 42%, excluding the COVID-19 period—is prompting a search for effective diversification among investors,” he said, adding that “Bitcoin has proven to offer significantly greater diversification compared to other asset classes.”\n\nAs more investors realize this, the higher the price of the asset will go in the new year, he argued.\n\nMeanwhile, Amberdata’s director of derivatives Greg Magadini told Decrypt that the data shows that “option traders are very bullish for BTC spot prices and expect prices to move higher relatively soon.”\n\nIf investors do finally get the Bitcoin ETF the SEC has repeatedly rejected for the better part of a decade, capital could flood the market, analysts at CryptoQuant predicted.\n\nAlthough the future may look bright right now, there are other things to consider.\n\n“There are also headwinds facing Bitcoin’s price,” Sam Callahan from Swan Bitcoin said. “These include the risk of a recession and the potential denial of a Spot Bitcoin ETF,” he continued, adding that a denial from the SEC could lead to a “shock to the market.”\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhpdHMtMzlrLXBvd2VsbC1mZWQtcmF0ZS1oaWtlcy1vdmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin price hits $39K as Powell stirs bets Fed rate hikes are over - Cointelegraph",
        "content": "Bitcoin (BTC) hit $39,000 for the first time since mid-2022 on Dec. 1 as the United States Federal Reserve boosted hopes of policy easing.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nPowell: Calling end to hikes would be “premature”\n\nData from Cointelegraph Markets Pro and TradingView confirmed a new 19-month BTC price high of $39,000 on Bitstamp.\n\nBitcoin bulls, already in a strong position, beat out resistance as Fed Chair Jerome Powell took to the stage at Spelman College in Atlanta, Georgia for a scheduled appearance.\n\n“The FOMC is strongly committed to bringing inflation down to 2% over time and to keeping policy restrictive until we’re confident that inflation is on a path to that objective,” he said in prepared remarks.\n\n“It would be premature to conclude with confidence that we have achieved a sufficiently restrictive stance, or to speculate on when policy might ease.”\n\nWhile keeping his tone cautious, Powell appeared to boost risk asset sentiment with his comments on the current state of the U.S. economy and progress toward reducing inflation.\n\nReacting, financial commentary resource The Kobeissi Letter was among those with a more sober take on what the Fed might do in the future.\n\n“Their narrative has not changed since last year, but markets continue to call for a Fed pivot,” it wrote in part of a post on X (formerly Twitter).\n\n“As we have stated before, the Fed would rather spark a mild recession than risk a resurgence of inflation. This means that a long PAUSE is still likely.”\n\nBitcoin nonetheless took full advantage of the mood, contrasting with a flat reaction to the week’s earlier U.S. macro data prints.\n\nAs Cointelegraph reported, the next meeting of the Federal Open Market Committee, or FOMC, is due in mid-December, when any changes to interest rates will be announced. Per data from CME Group’s FedWatch Tool, as of Dec. 1, market expectations unilaterally favored a pause in hikes.\n\nFed target rate probabilities chart. Source: CME Group\n\nBTC price targets extend beyond $39,000\n\nTurning to Bitcoin markets, popular trader Daan Crypto Trades revealed the size of the sell-side liquidity involved in the brief trip to $39,000.\n\nRelated: ‘Buy the rumor, sell the news’ — Bitcoin ETF may spark TradFi sell-off\n\nKeith Alan, co-founder of trading resource Material Indicators, meanwhile, uploaded a snapshot of BTC/USDT order book liquidity to X following Powell’s speech.\n\nThis showed $39,000 and $39,200 remaining as significant resistance overhead, while the nearest substantial buyer support lay at $38,000.\n\nBTC/USDT order book liquidity data. Source: Keith Alan/X\n\n“I strongly believe that today we will finally close above $38K. A daily close above $38K is a powerful signal of a god candle,” fellow popular trader BitQuant forecast earlier on the day.\n\nDaan Crypto Trades added that Bitcoin seemed to be “leaving its previous trading range for the time being,” while Crypto Ed, founder of trading and training group CryptoTA, predicted upside taking Bitcoin to “at least” $39,200 next.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGVjcnlwdC5jby8yMDgxNjUvbXlzdGVyaW91cy1iaXRjb2luLXdoYWxlLW1pbGxpb25zLWJ0Y9IBRWh0dHBzOi8vZGVjcnlwdC5jby8yMDgxNjUvbXlzdGVyaW91cy1iaXRjb2luLXdoYWxlLW1pbGxpb25zLWJ0Yz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "'Mysterious Whale' Is Accumulating Millions in Bitcoin—Or Is It? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe mystery of a large, unlabelled Bitcoin address has the cryptocurrency space buzzing with questions about who the “whale” holding over $450 million in Bitcoin might be.\n\nThe “bc1qc” Bitcoin address holds a balance of 12,070 BTC, worth around $455,616,665 at current prices, according to blockchain analytics sites Arkham Intelligence and Blockchair. The address has received tens of millions of dollars worth of Bitcoin in the last several weeks, mostly in large batches. But it might not be a whale at all, according to the various experts who spoke with Decrypt.\n\nA “whale” refers to an investor who hoards large amounts of cryptocurrency. So the idea of a single entity loading up on Bitcoin, at a time when market sentiment is turning bullish, would be an encouraging sign to holders, to say the least.\n\nAD\n\nAD\n\nIt’s no wonder that Crypto Twitter influencers, such as author and investor Jason Williams and Wealth Mastery founder Lark Davis, are pushing this narrative to their collective millions of followers.\n\nBREAKING 🚨 NEWS : A mystery whale keeps up its daily buying streak, acquiring 539 #Bitcoin this morning, following the accumulation of 1,178 #BTC yesterday 👀 Over the past 28 days, they have amassed a total of 10.3K #Bitcoin , propelling them to number 73 on the #BTC rich… — Jason A. Williams (@GoingParabolic) November 28, 2023\n\n“A mystery whale keeps up its daily buying streak, acquiring 539 [Bitcoin] this morning, following the accumulation of 1,178 [BTC] yesterday,” Williams tweeted two days ago. “Seems like institutional investors are trying to front-run the spot Bitcoin ETF approval,” Davis followed up today, referring to the rumors that an SEC approval for a long-anticipated Bitcoin ETF is imminent.\n\nA mystery whale has been accumulating large amounts of $BTC recently. Over the last 4 weeks, they have accumulated 10.3K $BTC. Seems like Institutional investors are trying to front-run the Spot Bitcoin ETF approval. pic.twitter.com/cTlSMIzSAK — Lark Davis (@TheCryptoLark) November 30, 2023\n\nThe chatter also found its way to Reddit, with a Redditor commenting on a since-removed, but highly upvoted r/Bitcoin post: “Mystery new Bitcoin whale buys another 612.5 BTC, acquiring a total of 11,005.82 Bitcoin in just 29 days!”\n\nAD\n\nAD\n\nBut blockchain analysts are raining on the BTC-pumpin’ parade. It’s much more likely that the wallet belongs to an exchange, moving funds into cold storage (i.e. an offline hardware wallet)\n\n“We cannot say with 100% certainty but its on-chain behavior suggests that it is most likely part of cold storage infrastructure for an exchange,” a Chainalysis investigator told Decrypt in an email. That’s partly because the address only shows incoming transactions, with none going out.\n\nAmberdata Director of Research Chris Martin concurred.\n\n“It's not 100% certain that it's an individual or an exchange, but there is a very strong connection with BitMEX,” Martin told Decrypt. “Almost all of the funding sources were BitMEX hot wallets, but the address doesn't follow their normal address schema (having BMEX, or qmex in the address).”\n\nMartin speculated, though, that the transactions are an exchange consolidating into a single wallet but left open the idea that it may be a whale after all.\n\n“There's an off-chance it could be a large BitMEX whale leaving the platform,” he said. BitMEX did not immediately respond to Decrypt’s request for comment.\n\nConsolidating wallets is not unusual in the cryptocurrency space. Both individuals and companies can have multiple, sometimes hundreds of addresses and consolidating them into a single address makes the management of digital assets more accessible. Even still, accounts moving large sums of Bitcoin will always draw attention.\n\nIn April, a wallet created in the early days of Bitcoin moved 400 BTC, around $11 million, after being dormant for 12 years. Another wallet moved 279 BTC, around $8 million at the time, that same month. In June, another wallet moved $1.2 million after 13 years of inactivity.\n\nAD\n\nAD\n\nSo long as blockchains are pseudonymous, and unmarked entities are moving large sums of digital money around, people will continue to speculate about the motives behind the moves."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8yMDgxMTQvbWljcm9zdHJhdGVneS1ib3VnaHQtNTkzLW1pbGxpb24tbW9yZS1iaXRjb2luLWluLW5vdmVtYmVy0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzIwODExNC9taWNyb3N0cmF0ZWd5LWJvdWdodC01OTMtbWlsbGlvbi1tb3JlLWJpdGNvaW4taW4tbm92ZW1iZXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy Bought $593 Million More Bitcoin in November - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTech company MicroStrategy has bought even more Bitcoin—bringing its holdings to 174,530 BTC. As of Thursday morning, its Bitcoin stash is worth approximately $6.6 billion.\n\nIn a Thursday tweet, MicroStrategy founder and chairman Michael Saylor said that his firm, which provides software solutions for companies wanting to analyze their data, had this week bought an extra 16,130 BTC for a price of $593.3 million.\n\nThe company, based in Tyson, Virginia, has now spent a total of $5.28 billion on the cryptocurrency, according to Saylor's announcement.\n\nAD\n\nAD\n\nIt is the largest corporate holder of the digital asset by far.\n\nMicroStrategy first bought Bitcoin back in August 2020 during the COVID-19 pandemic. A bull run followed soon after.\n\nSaylor—who was CEO of the company at the time—argued that the asset was a hedge against inflation and would be the best strategy for getting maximum returns for shareholders as the business was sitting on so much cash.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/hSEZyzGBsr — Michael Saylor⚡️ (@saylor) November 30, 2023\n\nAnd his plan appears to be working: MicroStrategy stock is up 238% since the company adopted its \"Bitcoin standard.\" Saylor has argued that buying shares in the company is a way investors can get exposure to cryptocurrency.\n\nAD\n\nAD\n\nMicroStrategy stock—MSTR on the Nasdaq—is currently priced at $493.15 a share. That's a 17% gain in the past month, but shares are down 2% from yesterday's close.\n\nSaylor has repeatedly spoken about how Bitcoin is a superior asset to real estate and gold and a \"dependable store of value and an attractive investment asset with more long-term appreciation potential than holding cash.\"\n\nOther companies have since followed suit—most notably electric car company, Tesla. The clean energy company headed up by the world's richest man, Elon Musk, holds 9,720 BTC, or $366 million in digital coins.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8yMDgyNTIvYml0Y29pbi1ldGYtd2luZG93LXNvb24taGVyZS1hcmUtZGF0ZXMtd2F0Y2jSAUxodHRwczovL2RlY3J5cHQuY28vMjA4MjUyL2JpdGNvaW4tZXRmLXdpbmRvdy1zb29uLWhlcmUtYXJlLWRhdGVzLXdhdGNoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin ETF Approval Window Opens Soon—Here Are the Dates to Watch - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs Bitcoin ETF decision deadlines loom, there's growing interest in figuring out when, exactly, the U.S. Securities and Exchange Commission will make its announcement.\n\nThere's a handful of spot Bitcoin ETF applications pending with the regulator. The SEC missed another window for a decision, choosing instead to extend all of its deadlines. But but there's also been word that the SEC has met with Grayscale and BlackRock in the interim to discuss amendments to their applications.\n\nTo be clear, the SEC could still deny any or all of the pending applications. There's mounting optimism from Coinbase CEO Brian Armstrong to JP Morgan analysts, but there's no guarantee that the SEC will give any spot Bitcoin ETF the green light in early 2024. Still, experts who have been tracking the applicants' odds say they've never been better, and they have narrowed down a potential approval window to a handful of days in early January.\n\nAD\n\nAD\n\nBloomberg Intelligence ETF analyst James Seyffart says while the window is technically from January 5 through January 10, the securities regulator is unlikely make an announcement on a Friday and even less likely to drop news about the ETF applicants over the weekend.\n\nSo that shrinks the window to Monday, January 8 through Wednesday, January 10. \"Mark your calendars people,\" he wrote on Twitter.\n\nWindow is officially Jan 5th to Jan 10th. Really this means that any potential approval orders are going to come on either Monday Jan 8, Tuesday Jan 9, or Wednesday Jan 10. Mark your calendars people. https://t.co/8ob8Y6pgU5 — James Seyffart (@JSeyff) December 1, 2023\n\nThe crypto industry has been waiting for a spot Bitcoin ETF to be approved for years.\n\nIn the U.S., regulators have approved Bitcoin futures and even leveraged Bitcoin futures ETFs to trade. But a genuine Bitcoin ETF, one that directly tracks BTC and not just derivatives, has so far eluded investors.\n\nAD\n\nAD\n\nThe idea is this: shares in a Bitcoin ETF would gain and lose value as Bitcoin's price fluctuates, and investments in those shares would allow buyers to gain exposure to BTC without actually buying or holding digital coins.\n\nBecause an ETF makes it easier for traditional investors to jump into crypto, analysts have long predicted that such a product would bring a massive influx of capital into the market. Recently, researchers at blockchain data firm CryptoQuant said they expect an ETF to double Bitcoin's market cap, and potentially increase the overall crypto market by $1 trillion. For context, Apple's market cap sits at a cool $2.9 trillion today.\n\nJust the chance that an ETF might be approved has been incredibly bullish for Bitcoin's price. The world's oldest and largest cryptocurrency by market capitalization has found buoyancy thanks to all the attention from institutions and the upcoming Bitcoin halving, which limits Bitcoin's inflation rate and could further drive up demand.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8yMDgyNDcvYml0Y29pbi1oaXRzLTM5ay1hcy1idWxsaXNoLWV0Zi1vcHRpbWlzbS1ib29zdHMtY3J5cHRvLW1hcmtldNIBXWh0dHBzOi8vZGVjcnlwdC5jby8yMDgyNDcvYml0Y29pbi1oaXRzLTM5ay1hcy1idWxsaXNoLWV0Zi1vcHRpbWlzbS1ib29zdHMtY3J5cHRvLW1hcmtldD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Hits $39K as Bullish ETF Optimism Boosts Crypto Market - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin today hit $39,000 per coin for the first time April 2022.\n\nThe biggest digital coin by market capitalization was last sitting at that level before crypto project Terra collapsed in May 2022—which subsequently brought chaos to the digital asset ecosystem by plunging the price of every cryptocurrency and leading to a number of high-profile bankruptcies.\n\nAccording to figures from America's biggest crypto exchange Coinbase, Bitcoin hit $39,000 per coin at 11.30am Eastern Time.\n\nAD\n\nAD\n\nIt has since dipped and is now trading for $38,777, the same data shows.\n\nThe coin is up nearly 3% in the past 24 hours. Over the month, it has risen by more than 12%.\n\nBitcoin has attracted renewed interest from investors because a number high-profile Wall Street firms have applied to the U.S. Securities and Exchange Commission to release a spot Bitcoin exchange-traded fund (ETF).\n\nSuch an investment vehicle would give traditional investors exposure to the cryptocurrency in a safe and regulated way. Because of this, some analysts expect a capital to flood the digital asset market.\n\nBloomberg Intelligence analysts have said they expect the top regulator to approve one of the applications by January 10.\n\nAD\n\nAD\n\nAlso, this week, Federal Reserve governor Christopher J. Waller said that he was \"increasingly confident that policy is currently well positioned to slow the economy and get inflation back to 2 percent\"—leading investors with an appetite for risk-on assets to feel bullish.\n\nAt the start of the year, Bitcoin was trading for less that $17,000 per coin.\n\nBut it is still well below its November 2021 all-time high of $69,044 per coin.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tYXJrZXQvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1zdXJnZXMtMi04Ny10by1pdHMtaGlnaGVzdC1sZXZlbC10aGlzLXllYXItMTE3MDE0MjkwMDU0NzAuaHRtbNIBeWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tYXJrZXQvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1zdXJnZXMtMi04Ny10by1pdHMtaGlnaGVzdC1sZXZlbC10aGlzLXllYXIvYW1wLTExNzAxNDI5MDA1NDcwLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin surges 2.87% to its highest level this year | Mint - Mint",
        "content": "Bitcoin rallied to its highest price in 2023 as the cryptocurrency jumped 2.87% to a high of $38,834 on Friday. The surge in Bitcoin's value marks its peak since May 2022 just before the disruption of the TerraUSD stablecoin ecosystem, causing a ripple effect in the sector and initiating a gradual decrease in asset values. The second-largest token by market cap Ethereum is also doing well and is trading above the psychological benchmark of $ 2,000 with a price being $2,090.4 on 1 December.\n\nThe rally is seen across the cryptocurrency market with other popular coins like Dogecoin, and Polkadot also reporting gains. The recent rally has infused the investors with fresh confidence as institutional investors have also shown interest in the cryptocurrency. Recently MicroStrategy Inc., the foremost publicly traded corporate entity holding Bitcoin, acquired an additional $593 million worth of the cryptocurrency.\n\n130% rebound this year\n\nThe recent surge in Bitcoin has increased the chances of cryptocurrency hitting $40,000 by the end of December. The year 2023 has been great for Bitcoin as it rebounded about 130% following a challenging period for cryptocurrencies in 2022. As per Bloomberg News, the optimism around potential interest-rate reductions by the Federal Reserve in the coming year, coupled with the anticipation of the US permitting its inaugural spot Bitcoin exchange-traded funds, has contributed to a powerful combination of factors driving this positive trend.\n\n“In order to get to $40,000, we just need that approval for the spot Bitcoin ETF,\" Fiona Cincotta, senior financial markets analyst at City Index Ltd. told Bloomberg.\n\nAlso Read: This New BTC Alternative Is Sparking Interest Among Shiba Inu Holders\n\nAmid the optimistic sentiment around Bitcoin, Bloomberg Intelligence anticipates that a group of spot Bitcoin exchange-traded funds (ETFs) in the United States will secure approval from the Securities and Exchange Commission by January.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2RlY2xpbmUtaW4tZXRoYnRjLXJhdGlvLXNob3dzLWJpdGNvaW5zLXJpc2luZy1tYXJrZXQtZG9taW5hbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Decline in ETH/BTC ratio shows Bitcoin's rising market dominance - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Learn more ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8yMDgzMjEvZ3JheXNjYWxlLWJpdGNvaW4tZXRmLWFwcHJvdmFsLXdoZW4tbm90LWlm0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzIwODMyMS9ncmF5c2NhbGUtYml0Y29pbi1ldGYtYXBwcm92YWwtd2hlbi1ub3QtaWY_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Grayscale: Bitcoin ETF Approval Is a 'Matter of When, Not If' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDigital asset manager Grayscale continues to say it's just a matter of time before a Bitcoin ETF is finally approved.\n\nThat includes the possibility that the digital asset manager will get approval from the U.S. Securities and Exchange Commission to convert its Grayscale Bitcoin Trust (GBTC)—currently an open-ended trust available on the OTCQX Market—into a spot Bitcoin ETF. If converted to an ETF, the firm is aiming to have the fund listed on the NYSE Arca exchange.\n\nAnd to that end, the firm asked Craig Salm, its chief legal officer, and Edward McGee, its chief financial officer, to address some common questions about the potential conversion.\n\nAD\n\nAD\n\n“We believe that regulatory approval of a spot Bitcoin ETF in the U.S. is a matter of ‘when,’ not a matter of ‘if,'\" Salm wrote in a company blog post today. Once approved, Grayscale “would immediately work with our partners to uplist GBTC to NYSE Arca,” he added.\n\nBut for every bullish Bitcoin ETF prediction, there's a caveat. Grayscale did not provide an expected timeline for GBTC’s conversion. “Timelines are inherently uncertain,” Salm said.\n\nSome ETF analysts have offered educated guesses about when the SEC might make a decision on pending applications. Bloomberg Intelligence analyst James Seyffart said he expects to see some movement from the SEC between Monday, January 8 and Wednesday, January 10.\n\nIn 2022, Grayscale filed a lawsuit against the SEC, claiming the Commission had been unfair in refusing to accept an application to convert the Grayscale Bitcoin Trust into an ETF. Being an ETF would allow the fund to perform simultaneous creations and redemptions of shares to trade in line with Bitcoin's real-time price.\n\nThere's been signs that Grayscale has been making progress. For starters, a judge decided in August that the SEC does need to accept the firm's application. In October, it became clear the SEC wasn't going to file an appeal to the decision and was then ordered to officially review the ETF bid.\n\nAD\n\nAD\n\nTo that end, a memo published by the SEC revealed that the SEC met with Grayscale CEO Michael Sonnenshein and McGee last month to discuss \"NYSE Arca, Inc.’s proposed rule change to list and trade shares of the Grayscale Bitcoin Trust (BTC) under NYSE Arca Rule 8.201-E.\"\n\nEven without being a spot ETF, GBTC already accounts for more than 3% of the total BTC supply. It currently trades at an 8% discount to its net asset value. But as Salm pointed out in the Grayscale blog post, converting to an ETF structure would allow Grayscale to “more closely track the price of Bitcoin.\"\n\nEdited by Guillermo Jimenez\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tbmVhcmx5LTIxLTAwMC1ibG9ja3MtYXdheS1mcm9tLWZvdXJ0aC1oYWx2aW5nLWJ0Yy1ob2xkZXJzLWF3YWl0LWFwcHJvdmFsLW9mLXNwb3QtZXRmLTIwMjMxMjAxMDYxMtIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLW5lYXJseS0yMS0wMDAtYmxvY2tzLWF3YXktZnJvbS1mb3VydGgtaGFsdmluZy1idGMtaG9sZGVycy1hd2FpdC1hcHByb3ZhbC1vZi1zcG90LWV0Zi0yMDIzMTIwMTA2MTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin to hit $125,000 in 2024 according to Matrixport research - FXStreet",
        "content": "Halvings are typically considered bullish events as they slash the block reward in half for miners, constricting the supply of the asset. At consistent demand if the supply reduces, the asset’s price climbs. This has been observed in Bitcoin and Litecoin.\n\nMacroeconomic events like the US Federal Reserve’s decision on interest rates influence risk assets like Bitcoin, mainly through the direct impact they have on the US Dollar. An increase in interest rate typically negatively influences Bitcoin and altcoin prices, and vice versa. If the US Dollar index declines, risk assets and associated leverage for trading gets cheaper, in turn driving crypto prices higher.\n\nA hack is an event in which an attacker captures a large volume of the asset from a DeFi bridge or hot wallet of an exchange or any other crypto platform via exploits, bugs or other methods. The exploiter then transfers these tokens out of the exchange platforms to ultimately sell or swap the assets for other cryptocurrencies or stablecoins. Such events often involve an en masse panic triggering a sell-off in the affected assets.\n\nToken launches like Arbitrum’s ARB airdrop and Optimism OP influence demand and adoption among market participants. Listings on crypto exchanges deepen the liquidity for an asset and add new participants to an asset’s network. This is typically bullish for a digital asset.\n\nAlex RTB, analyst behind the X handle @rutradebtc reaffirms Kaleo’s prediction and argued that BTC is likely to hit the $40,000 target this week. The analyst identified an ascending triangle setup in the Bitcoin price chart, a bullish continuation pattern.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin . As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/hSEZyzGBsr\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9taWNyb3N0cmF0ZWd5LWJvb3N0cy1iaXRjb2luLWhvbGRpbmdzLXdpdGgtNTkwLW1pbGxpb24tcHVyY2hhc2UtdG90YWxpbmctMTc0NTMwLWJ0Yy_SAX1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9iaXRjb2luLW5ld3MvbWljcm9zdHJhdGVneS1ib29zdHMtYml0Y29pbi1ob2xkaW5ncy13aXRoLTU5MC1taWxsaW9uLXB1cmNoYXNlLXRvdGFsaW5nLTE3NDUzMC1idGMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy Boosts Bitcoin Holdings With $590 Million Purchase, Totaling 174,530 BTC - NewsBTC",
        "content": "In a testament to its unwavering confidence in Bitcoin (BTC), MicroStrategy, one of the largest Bitcoin holding companies, has once again expanded its cryptocurrency portfolio.\n\nThe company’s former CEO, Michael Saylor, announced the acquisition of an additional 16,130 BTC, valued at approximately $593 million. This strategic move comes as Bitcoin enters a phase of accumulation above the $37,000 mark.\n\nMicroStrategy Adds To Bitcoin Stash\n\nAs announced, MicroStrategy’s latest purchase was made at an average price of $36,700 per Bitcoin. With this acquisition, the company’s total Bitcoin holdings now stand at an impressive 174,530 BTC.\n\nThroughout 2023 and previous years, MicroStrategy has consistently demonstrated its commitment to BTC, accumulating a substantial amount of the cryptocurrency.\n\nThe total cost of MicroStrategy’s Bitcoin investments exceeds $5.20 billion, with an average purchase price of $30,252 per Bitcoin. This significant investment reflects the company’s long-term bullish outlook on Bitcoin’s potential as a store of value and hedge against inflation.\n\nAs reported by NewsBTC, the company has reaped substantial gains from the recent uptrend in the overall cryptocurrency market and Bitcoin’s impressive price surge. With BTC experiencing a 36% increase since October, Microstrategy has now amassed over $1 billion in unrealized profits.\n\nNotably, Bitcoin’s positive performance has directly impacted Microstrategy’s stock, traded under the ticker name MSTR. The stock has witnessed a significant surge in value, closely tied to the ongoing bullish momentum of BTC.\n\nOn November 9, as Bitcoin reached its previous yearly high of $38,000, the price of MSTR stock also soared to an all-time high (ATH) of $533 per share. This milestone further proves Microstrategy’s successful investment strategy over the past three years.\n\nMichael Saylor, a prominent advocate for Bitcoin, has been a vocal proponent of the cryptocurrency, emphasizing its superior qualities compared to traditional fiat currencies.\n\nMicroStrategy’s continued accumulation of Bitcoin reinforces Saylor’s conviction in its long-term prospects and serves as a testament to the company’s belief in the digital asset’s store-of-value properties.\n\nPotential For Short-Term Pullback Looms\n\nIn a recent market update by the CryptoQuant author IT Tech, short-term insights on the Bitcoin derivatives market shed light on the current upward momentum and the potential for a minor pullback.\n\nAccording to the analysis, the ongoing upward momentum in the Bitcoin market heavily relies on perpetual movement. The rising price of Bitcoin has been a key driving force, contributing to the bullish sentiment.\n\nHowever, the Crypto Volatility Divergence (CVD) Spot indicator suggests a relatively flat movement in spot demand. This indicates that a significant increase in immediate spot demand may not support the current price surge.\n\nIn the absence of strong spot demand materializing in the market, IT Tech suggests a possible minor pullback in the near term.\n\nThis potential pullback could be attributed to several factors, including profit-taking by traders or a lack of sustained buying pressure from spot investors.\n\nThe analysis also highlights the possibility of Bitcoin liquidations in the short term, which could indicate further upward movement to liquidate late short positions.\n\nThis suggests that additional buying pressure may be from those who have taken short positions on Bitcoin. As these shorts are liquidated, it could continue the upward trend.\n\nAs of the latest update, Bitcoin (BTC) is trading at $37,600, showing a slight decrease of 0.5% over the past 24 hours. However, it has maintained a gain of 1.5% over the past seven days, indicating a period of consolidation for the cryptocurrency\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5taWQtZGF5LmNvbS9saWZlc3R5bGUvaW5mb3RhaW5tZW50L2FydGljbGUvYml0Y29pbi0zNjAtYWktY3J5cHRvLXRyYWRpbmctc29mdHdhcmUtcmV2aWV3cy0taXMtYml0Y29pbi0zNjAtbGVnaXQtYml0Y29pbi0tMjMzMjI1NzLSAZEBaHR0cHM6Ly93d3cubWlkLWRheS5jb20vYW1wL2xpZmVzdHlsZS9pbmZvdGFpbm1lbnQvYXJ0aWNsZS9iaXRjb2luLTM2MC1haS1jcnlwdG8tdHJhZGluZy1zb2Z0d2FyZS1yZXZpZXdzLS1pcy1iaXRjb2luLTM2MC1sZWdpdC1iaXRjb2luLS0yMzMyMjU3Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin 360 Ai Crypto Trading Software Reviews - Is Bitcoin 360 Legit Bitcoin Trading Tool? Official Website 2023 Reports - mid-day.com",
        "content": "Bitcoin 360 AI's trading account, traders do not need to research trades and look at the system all day.\n\nToday's world is full of facilities, and digital mediums have provided you with so much convenience that just touching the mobile in any corner of the world, millions of facilities are created in front of you, something like this on trading. This also applies where people are earning money just by touching the phone. Still, for most people, it is challenging to choose which trading platform is better for them, where they can start trading in the crypto market without becoming a victim of any fraud.\n\nBut some platforms are proving to be more beneficial not only for newcomers but also for people who have gained good experience in trading systems, one of which is Bitcoin 360 Ai. Choosing the right crypto trading platform and trade opportunities is crucial when investing in cryptocurrencies.\n\nADVERTISEMENT\n\nBitcoin 360 AI platform's website claims to be designed to increase your trading strategies and cryptocurrency trading accuracy, with its main focus being Bitcoin. The official website 2023 of the Bitcoin 360 AI platform says that it is a powerful trading app and trading software that allows everyone from experienced people to newbies to the world of the crypto market to make trading decisions and trade and earn money from Bitcoin 360 AI.\n\nIn this Bitcoin 360 AI review, we will know why this trading platform is so popular. How does it work? How Bitcoin 360 AI is designed, what Features of Bitcoin 360 AI, and what are its benefits? Is Bitcoin 360 AI legit or a scam?\n\nClick Here to Star Trading with Bitcoin 360 Ai\n\nWhat is Bitcoin 360 Ai?\n\nBitcoin 360 AI is an automated trade platform. Bitcoin 360 AI claims that it can identify the technical setup, and once the technical design is determined, it can help any trader in trade from beginning to end. According to the website, it executes trades automatically till the end.\n\nThis means the trader does not need to work hard to trade in Bitcoin 360 AI, which means trading with Bitcoin 360 AI is straightforward. Due to the Bitcoin 360 AI's trading account, traders do not need to research trades and look at the system all day. Bitcoin 360 AI account can work automatically through an AI trading system without intervention.\n\nBitcoin 360 AI claims to offer crypto market information and gives users a legit crypto trading environment where they can start trading or investing without any hassle. Bitcoin 360 AI runs entirely on AI algorithms. Bitcoin 360 AI can help provide real-time data, price alerts, trading signals, and digital intelligence.\n\nThe website of Bitcoin 360 AI also states that you can create a demo account in which you can test Bitcoin 360 AI without investing your own money, as well as use the Bitcoin 360 AI platform for free, where a Bitcoin 360 AI starts trading after the minimum deposit. That means 360 AI is a free cryptocurrency trading app. According to the Bitcoin 360 AI website, the minimum amount you deposit is used to start trading. It does not charge any withdrawal fees and also does not charge any commission on profitable trades. This is what Bitcoin 360 AI does. Its specialty makes it a good and successful trading platform in the crypto world.\n\nClick Here to Start Trading with Bitcoin 360 Ai\n\nHow does Bitcoin 360 AI work?\n\nBitcoin 360 AI website states that the platform claims that it uses artificial intelligence to identify profitable trade cryptocurrency. Once Bitcoin 360 Ai detects a single pattern in trading Bitcoin and other cryptocurrencies, it uses the funds in the trader's account to place live trades. The way the AI ​​intelligence receives the signal, it starts trading in the same direction and then returns the money to the Bitcoin 360 AI traders with profit. 360 AI's key feature is that the trader can withdraw money whenever possible.\n\nHow to use Bitcoin 360 AI?\n\nAs we told you, this is an auto-trading app, so if you want to use the Bitcoin 360 AI app website, you must sign up by following some rules. To sign up, you will have to follow some steps. First, you must go to the btc 360 AI official app website, and after visiting the Bitcoin 360 AI, you must fill out a form. After filling in some of your information, like name, address, and some personal information in the state, you will have to deposit a minimum amount. This amount starts from $ 250.\n\nAfter depositing the minimum amount, a demo trading account will appear before you. To know Bitcoin 360 AI, you can use this demo account in which you can also practice trading with virtual money. Your registration will be completed after creating a demo account and practicing trading. You can use it automatically after registration and start trading with Bitcoin 360.\n\nBenefits of Bitcoin 360 AI\n\nBitcoin 360 AI auto-trading platform, so when the price of cryptocurrencies such as Bitcoin and Ethereum increases in the crypto market, the popularity of cryptocurrency platforms also starts rising. Cryptocurrency trading platforms have their advantages like any person can access cryptocurrency trading platforms through the internet. The AI ​​algorithm keeps trading 24/7 due to the fluctuations in the market.\n\nIn Bitcoin 360 AI, you do not need to deposit, withdraw, or pay trading fees. Also, if there is any problem in trading, then 24/7 customer support is ready to help you. Along with this, the most significant advantage of Bitcoin 360 I is that it gives a demo account to newcomers, due to which you can understand trading first.\n\nClick Here To Trade With Bitcoin 360 AI For Free\n\nFAQ related to Bitcoin 360 AI\n\nIs Bitcoin 360 AI a real trading platform?\n\nBitcoin 360 AI claims that it is an automated platform that trades many popular cryptocurrencies for the user. Also, this platform does not share any personal information of the user; it is entirely safe.\n\nHow do you connect with Bitcoin 360 AI?\n\nTo join Bitcoin 360 AI, you must first register an account. You will have to provide information like your phone number, email address, and name, and along with this, you will have to deposit a minimum amount of $ 250, which you can withdraw whenever you want.\n\nDoes Bitcoin 360 AI have any relation with Elon Musk?\n\nThere is a rumor that Bitcoin 360 AI has some connection with Elon Musk, but there is no proof.\n\nIs Bitcoin 360 AI legit or a scam?\n\nWhile Bitcoin 360 AI is a crypto trading bot that has a lot of benefits to earn good profit that creates a sense of scam among users and people who are new to cryptocurrency, Bitcoin 360 AI is a pure trading platform that helps the users make a profit with the help of AI to analyze the market movements, etc. Using the AI and other analytical skills the interface becomes very user friendly. People are okay with starting to trade cryptocurrencies on this platform (even the newbies). All these features are free. You can also use the free account to understand the app's algorithm to trade in real. However, one of the drawbacks of the Bitcoin 360 is that the minimum deposit to trade in the app is 250 dollars, and you are good to go. Apart from the other cryptocurrencies, the main focus is on Bitcoin. 360 AI can be used to understand the crypto market and the latest Bitcoin news.\n\nClick Here To Trade With Bitcoin 360 AI For Free\n\nConclusion\n\nTo conclude, in simpler terms, Bitcoin 360 AI is a trading bot that is designed in a way that catapults the trading accuracy in cryptocurrencies such as Bitcoin. (Bitcoin was first created in 2009). For the first-timers who are new to bitcoin trading or the crypto market, this application helps a lot in understanding the terms, movements, and other analytical methods to make profits and explore other cryptocurrencies like bitcoin (for the people thinking the Crypto market is difficult to understand) as bitcoin 360 AI provides all the insights and factors that affect the market so that the user puts the money in the right place. If you want to use Bitcoin 360 AI, first, you must sign up by visiting the official website. Then, after signing up, the next process is to deposit the minimum fund (or more), which is 250 dollars. We will recommend you start the minimum deposit. After this step, you will be able to access the demo account with virtual money to start practicing the trading process so that you learn all the basics needed. Once done, registered users will be able to start trading the cryptocurrencies. Even many celebrities use Bitcoin 360 AI along with general people. All the data regarding users who started Bitcoin 360 ai suggest mostly positive experiences towards app 360. It is no secret that using AI can increase the performance of any software in any industry.\n\n“Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.”"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tcHJpY2UtdG9kYXktbm92ZW1iZXItMzAtbG9zc2VzLWV0aGVyLWNhcmRhbm8tY3J5cHRvY3VycmVuY3ktaW5kaWEtNDYyMDI3NtIBhAFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tcHJpY2UtdG9kYXktbm92ZW1iZXItMzAtbG9zc2VzLWV0aGVyLWNhcmRhbm8tY3J5cHRvY3VycmVuY3ktaW5kaWEtNDYyMDI3Ni9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin Briefly Hit 19-Month High, Losses Strike Ether, Cardano Among Others - Gadgets 360",
        "content": "Bitcoin briefly touched its 19-month high of $38,000 (roughly Rs. 31 lakh) today. Amid the market volatility, the oldest cryptocurrency clocked a small gain on Thursday, November 30, taking its price to $37,866 (roughly Rs. 31.5 lakh). The month of November proved to be rather lucrative for the crypto market, which saw Bitcoin's price escalate up till its current value point. As per market analysts, Bitcoin's tight trading pattern indicates potential for a bullish continuation for the coming weeks.\n\nEther, for a change, did not follow Bitcoin's price trajectory and found itself on the loss-making side of the crypto price chart. With a loss of 1.08 percent, the value of ETH presently stands at $2,030 (roughly Rs. 1.69 lakh).\n\n“BTC retraced from the $38,000 (roughly Rs. 31 lakh) resistance level following the Wall Street open on November 29, influenced by better-than-expected US gross domestic product (GDP) figures. BTC fluctuated around that level and eventually dropped after the release of US macro data. On the other hand, Ethereum saw a slight decline but held its ground above the 20-day exponential moving average (20 EMA D),” the CoinDCX research team told Gadgets360.\n\nWith Bitcoin and Ether taking different price routes today, the crypto chart has been divided.\n\nAmong profit-making cryptocurrencies, Solana, Dogecoin, Tron, Avalanche, Polygon, and Litecoin marked their presence alongside Bitcoin.\n\nLeo, Stellar, Near Protocol, Iota, and Dash also managed to mint small gains.\n\nMeanwhile, loss-making cryptocurrencies included Tether, Binance Coin, Ripple, Cardano, Chainlink, and Polkadot alongside Ether.\n\nOther altcoins trading in the reds are Shiba Inu, Bitcoin Cash, Uniswap, Cosmos, Monero, and Cronos.\n\nThe overall crypto market cap slipped minutely by 0.01 percent in the last 24 hours. The sector valuation, as of today, stands at $1.43 trillion (roughly Rs. 1,19,18,735 crore), as per CoinMarketCap.\n\n“The altcoin in focus today would be dYdX (-1.5 percent) as the DEX token is going to witness it's one of the biggest token unlocks on December 1 with 150 million tokens getting unlocked. While dYdX has been on a slight decline for the past few days, traders are shifting their focus to decentralized exchanges. It could also be a ‘sell the rumour, buy the news' event,” the CoinSwitch markets desk told Gadgets360.\n\nIn other news, Binance has preponed the ending of its support of the stablecoin BUSD, which it has launched in support with Paxos. Earlier, the company said they would stop supporting BUSD by February 2024. BNB (-0.7 percent) meanwhile, is trading flat on the news.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nIs the Samsung Galaxy Z Flip 5 the best foldable phone you can buy in India right now? We discuss the company's new clamshell-style foldable handset on the latest episode of Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    }
]