[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vcm1pLm9yZy9jcnlwdG9jdXJyZW5jeXMtZW5lcmd5LWNvbnN1bXB0aW9uLXByb2JsZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Cryptocurrency’s Energy Consumption Problem - Rocky Mountain Institute",
        "content": "Shares\n\nCryptocurrency’s Energy Consumption Problem\n\nWhat has been done and what still needs to be done to decarbonize crypto.\n\nCryptocurrency has an energy consumption problem. Bitcoin alone is estimated to consume 127 terawatt-hours (TWh) a year — more than many countries, including Norway. In the United States, cryptocurrency activity is estimated to emit from 25 to 50 million tons of CO 2 each year, on par with the annual emissions from diesel fuel used by US railroads.\n\nDecarbonizing the crypto industry thus remains essential to achieving a safe climate future. Yet, while RMI is proud to have played a role in initial decarbonization efforts in the crypto industry, moving forward, we will focus on decarbonizing the grid rather than crypto transactions.\n\nIn this article, we reflect on the state of the crypto industry: what work has been done so far, the challenges of decarbonizing crypto, and how RMI will continue to pursue this goal as part of our larger effort to decarbonize global supply chains.\n\nProgress to Date\n\nAs exorbitant electricity consumption from crypto mining became a public concern, RMI’s first step was to act as a co-convener of the Crypto Climate Accord (CCA), along with our partners Energy Web, the Alliance for Innovative Regulation (AIR), and the World Economic Forum. The CCA serves as a “private sector-led initiative focused on decarbonizing the cryptocurrency and blockchain industry,” where solutions and technologies for crypto decarbonization are created collaboratively among players across the web3 and crypto space.\n\nAs part of the CCA, RMI spearheaded the development of the CCA Accounting Guidance, a foundational guide to allocating emissions for the crypto industry. The guidance highlights the importance of a consequential accounting approach and the use of marginal emissions rates as a key to understanding crypto’s emissions impact. The guidance further supports the need to gauge grid impact rather than average emissions when assessing emissions impact.\n\nThis initial work was followed by participating in a roundtable during the drafting of the Crypto Climate Impact Accounting Framework, developed by the Crypto Carbon Ratings Institute (CCRI) and South Pole. This framework sought to define a methodology for allocating GHG emissions for crypto transactions and holdings. Because institutional investors hold an outsized stake of the crypto market, allocating emissions for these activities is vital to pressure both investors and crypto industry leaders to change their current practices.\n\nChallenges with Crypto Decarbonization\n\nProof-of-work energy usage\n\nWith lawmakers increasingly looking at the effects of Bitcoin mining, from both an environmental and grid-resiliency perspective, lowering energy usage of this crypto currency is a must. Bitcoin is the only major currency that uses proof-of-work mining. The large energy usage associated with proof-of-work mining is an inevitable consequence of the fundamental nature of its algorithms.\n\nEthereum moved to a far less energy intensive proof-of-stake consensus mechanism, reducing that network’s electrical usage by over 99.9 percent. (Here’s a discussion of the difference between proof-of-work and proof-of-stake.) A single transaction on Ethereum’s proof-of-stake network is now similar to the electrical usage of a Mastercard transaction. As a result, when we speak of the emissions impact of “crypto,” we are now largely speaking about the emissions impact of Bitcoin.\n\nTo mitigate crypto industry emissions, RMI supports the “Change the Code, Not the Climate” campaign, launched by Greenpeace and the Environmental Working Group, intended to motivate Bitcoin to move away from proof-of-work and toward a less energy-intensive consensus mechanism.\n\nA co-benefit of Bitcoin changing its consensus mechanism would be to mitigate Bitcoin’s significant e-waste problem. As proof-of-stake and other low energy protocols require less computing power and no specialized equipment, Bitcoin ditching proof-of-work would mean the network would require far less hardware — an additional win for the climate.\n\nPrice volatility\n\nIn addition to energy usage and e-waste, the price volatility associated with Bitcoin and other cryptocurrencies is a cause for concern. When prices are high, Bitcoin miners may be willing to power their operations with clean electricity. But as the price of Bitcoin comes down, smaller profit margins mean industry players are likely to seek out the cheapest electricity possible, which may not always be the cleanest. Digiconimist currently estimates a “cost percentage” of Bitcoin mining, which shows that miners spend a majority of their income on electricity.\n\nFurthermore, there are attempts to use Bitcoin for demand response on power grids, with Texas’ ERCOT being the prime example. There are concerns, however, about the ability of Bitcoin miners to be relied upon for these services. If prices are too high, miners won’t prioritize limiting power usage, putting increased pressure on a grid that has experienced significant stress in recent years.\n\nElectricity procurement\n\nWith emissions on the scale of entire countries, it is imperative for Bitcoin mining, in the absence of changing to a low-energy consensus mechanism, to be powered by new renewable energy, rather than drawing from existing renewable capacity. Because of the flexibility of Bitcoin’s load, or its ability to be mined anywhere in order to balance energy supply and demand, miners who are conscious about their footprint should be able to contract renewable energy to power their operations. Unfortunately, as public data from Greenpeace shows, this is not currently the case. Bitcoin miners are largely contracting energy from fossil sources and claims of sustainability tend to be based on being co-located near renewables.\n\nSome Bitcoin miners may not have direct control over their electricity usage if their mining computers are contracted out to larger data centers. This, combined with the fact that miners are not longstanding businesses with well-established credit, may make it difficult to dictate their electricity supply. In order to drive further renewable energy generation, rather than take credit for an existing portion of renewable capacity, Bitcoin miners must contract renewable energy directly.\n\nBut while energy usage remains high in Bitcoin mining, it is imperative that this energy is clean, sustainable, and additional. To ensure this, RMI developed the Renewable Energy (RE) Emissions Score, designed to assess the material impact of renewable energy procurement. By measuring the emissions impact, as well as the value provided by off-takers of renewable energy, the RE Emissions Score will allow any company, not just Bitcoin miners, to make meaningful claims about renewable energy procurement, prioritizing investment in high emissions areas and low-cost renewable projects. If Bitcoin mining is to continue, it must be powered by additional renewables so that it does not inadvertently increase required grid capacity and lead to more fossil generation.\n\nThe RE Emissions Score was born out of a need to allow Bitcoin miners to make quantifiable claims of renewable energy use and investment, but its implications are much wider. Any company currently procuring renewable energy can use this approach to show its commitment to total grid decarbonization. Focusing on the decarbonization of the grid as a whole is vital to any strategy for reducing crypto emissions.\n\nMoving Forward\n\nThe climate effects of crypto, especially Bitcoin, are no secret. With an extremely large appetite for energy, crypto has the potential to serve as an impediment to climate progress. Price volatility has hampered climate action in the space, and without proactive procurement by miners, regulatory pressure is inevitable. Campaigns such as the CCA show an interest in addressing these issues within the community. Participating organizations cannot afford to allow these pledges to be mere words, they must act. Guidance on measuring emissions, such as the CCA Accounting Guidance and the Crypto Climate Impact Accounting Framework, are vital first steps toward allowing industry participants to understand their own climate impact and take action to reduce it. The dictum applies: you can’t manage what you can’t measure.\n\nUntil such a time that a less energy-intensive consensus mechanism for bitcoin is developed and available, current Bitcoin mining operations should be powered by additional, renewable energy. The RE Emissions Score provides miners with the means to help ensure that contracted power is renewable and additional, which will be necessary to decarbonize US electricity grids by 2035.\n\nThough our direct engagement with crypto is coming to a close, RMI’s work to decarbonize the grid and transform the global energy system will continue."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNsb3Nlcy1vdXQtYmVzdC1qYW51YXJ5LXNpbmNlLTIwMTMtMjMyMjE1MjcwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin on track to close out best January performance since 2013 - Yahoo Finance",
        "content": "With a gain of 39.4% this month, Bitcoin is closing out its best month since a 40% rally in October 2021 and its best January since 2013.\n\nCurrently changing hands at $22,910, bitcoin (BTC-USD) has been trading over the past week at its highest level since August of last year. The largest cryptocurrency hasn't given holders such an uplifting January in a decade.\n\n“We started January off with some explosive price action the week of December's CPI print,” said Christopher Newhouse, options trader with crypto market maker GSR.\n\nFrom Newhouse's perspective, buyer side demand from institutional takers — whether macro driven traders or hedge funds — returned in the first two weeks of the month, which sparked initial short seller liquidations.\n\nIn the 12 days following December's inflation report released on Jan. 12, $1.3 billion worth of short positions on bitcoin were liquidated, or $611 million as net of long positions, according to crypto derivatives aggregator CoinGlass. Over the past week, the trend has reversed with $331 million in long positions liquidated, or $108 million net of short positions.\n\nBetween January 10 and 20, which is when bitcoin saw its largest moves higher, speculation-driven momentum traders returned to the market, spearheading bitcoin breaking out from a range of between $15,700 and $18,000.\n\n\"Bitcoin’s pushes above $20,000 and $22,000 both happened on Fridays as dealers had large amounts of negative gamma exposure and forced to hedge towards the end of U.S. hours trading,\" Newhouse observed.\n\nAnalysts say the next leg for bitcoin will likely be determined in the days following the Federal Reserve's monthly rate hike decision.\n\n“This market is going to start to trade very technical,” Edward Moya, a senior analyst at Oanda told Yahoo Finance, \"Volatility is coming back.\"\n\nThe return of bitcoin buying looks similar to what occurred from July through early August according to Michael Safai, co-founder and partner with crypto trading firm, Dexterity Capital.\n\nStory continues\n\n\"It takes about two months or so for the crypto market to stabilize after a major shock, and we’re at that point post-FTX,\" Safai said over email.\n\n\"The worst of the damage has been inflicted, investors are relatively confident that there are no more shoes to drop, as reflected in the muted reception to the Genesis bankruptcy, and risk appetite is starting to slowly return.\"\n\nNEW YORK, US - JANUARY 03: Sam Bankman-Fried leaves the court in New York, on January 03, 2023. (Photo by Fatih Aktas/Anadolu Agency via Getty Images) (Anadolu Agency via Getty Images)\n\nYear to date, the total market capitalization for cryptocurrencies is up 24% to $1.05 trillion, according to Coinmarketcap. Across spot exchanges worldwide, global crypto volume has risen to $5.5 trillion, which is up 61% since the beginning of the year, according to crypto indexing platform Nomics.\n\nData collected by blockchain analytics platform Glassnode finds since bitcoin regained a price above $21,000, the current market rally has pushed buyers of the largest cryptocurrency from 2019 and earlier back above breakeven.\n\n\"These psychological levels matter,\" Moya added.\n\nClick here for the latest crypto news, updates, values, prices, and more related to Bitcoin, Ethereum, Dogecoin, DeFi and NFTs\n\nRead the latest financial and business news from Yahoo Finance\n\nDownload the Yahoo Finance app for Apple or Android\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTMwL25mdHMtY29taW5nLXRvLWJpdGNvaW4tc3BhcmtzLWhhbmR3cmluZ2luZy1hYm91dC1jcnlwdG8tcHVyaXN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ordinal NFTs Coming to Bitcoin Spark Debate Over Traditional Crypto - Bloomberg",
        "content": "NFTs are coming to the Bitcoin blockchain, sparking a debate among those who say the digital representations add a much-needed fresh use case and the purists concerned about deviating too far from the origins of the peer-to-peer cryptocurrency network.\n\nNonfungible tokens such as the now infamous Bored Apes and CryptoPunks are one of the driving forces that made Ethereum the most commercially important blockchain, where users can mint and trade digital assets that have been worth millions of dollars. Bitcoin was designed as a cryptocurrency, while Ethereum was built as a next-generation version that can handle decentralized applications."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvZGVmbGF0aW9uYXJ5LWV0aGVyLWlzLXVuZGVycGVyZm9ybWluZy1iaXRjb2luLWhlcmUtYXJlLTMtcmVhc29ucy13aHkv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8zMC9kZWZsYXRpb25hcnktZXRoZXItaXMtdW5kZXJwZXJmb3JtaW5nLWJpdGNvaW4taGVyZS1hcmUtMy1yZWFzb25zLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Deflationary Ether Is Underperforming Bitcoin, Here Are 3 Reasons Why - CoinDesk",
        "content": "\"For most macro investors, BTC is the obvious on-ramp into the crypto market – the most liquid, the widest range of on-ramps. We see this in the strong increase in BTC spot volumes (while ETH spot volumes have not risen much), surge in the open interest on CME and stronger positioning in the options market,\" Noelle Acheson, author of the popular \"Crypto Is Macro Now\" newsletter, said."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMS8zMS90ZXNsYS1yZWNvcmRzLTIwNG0tbG9zcy1mcm9tLWJpdGNvaW4taW4tMjAyMi_SAVNodHRwczovL3RlY2hjcnVuY2guY29tLzIwMjMvMDEvMzEvdGVzbGEtcmVjb3Jkcy0yMDRtLWxvc3MtZnJvbS1iaXRjb2luLWluLTIwMjIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Tesla records $204M loss from bitcoin in 2022 - TechCrunch",
        "content": "Tesla recorded a $204 million impairment loss in 2022 on its bitcoin holdings, according to regulatory filings. The loss was offset by $64 million in profits from bitcoin trading, leaving the automaker with a net loss of $140 million.\n\nTesla had invested $1.5 billion in bitcoin during the first quarter of 2021, stating that it believed in the longevity of the cryptocurrency. At the time, the company said bitcoin was a great place to store cash and still access it immediately, all the while providing a better return on investment than more traditional central banks. In fact, after its initial purchase, Tesla promptly trimmed its position by 10%, making the automaker a quick $101 million.\n\nIn March 2021, CEO Elon Musk said Tesla would start accepting bitcoin as payments for Tesla vehicles, causing the price of the crypto to boom. A few weeks later, Musk and Tesla backpedaled on that decision, expressing concern for the amount of energy needed to mine bitcoin. The price of bitcoin then subsequently sank.\n\nLast year, as the value of bitcoin began to plunge, Tesla sold 75% of its bitcoin holdings and used the proceeds to buy traditional currency. The automaker today owns about $184 million worth of bitcoin, and may be holding out for a rebound.\n\nThe crypto market has experienced a dramatic drawdown over the past year. Today, bitcoin is trading at $23,045.50, which is about 66% below the all-time high of $68,789.63. Despite losing over half its value, some experts say bitcoin has remained resilient and may experience a comeback, especially as buyers spooked by the crypto market in general gravitate toward household names and more mature ecosystems, like bitcoin or ether.\n\nTesla disbanded its press department and could not be reached for comment."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3Jvc3NjdXQuY29tL3BvbGl0aWNzLzIwMjMvMDEvd2FzaGluZ3Rvbi1hbmQtb3JlZ29uLW1heS1yZWd1bGF0ZS13aWxkLXdlc3QtY3J5cHRvLW1pbmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Washington and Oregon may regulate the wild West of crypto mining - Crosscut",
        "content": "“We were getting inquiries that would have tripled our load for the county” back in 2018, said Christine Pratt, public information officer for the utility. “The actions we’ve taken have prepared us to deal with that type of customer fairly.”\n\nInvestigateWest (invw.org) is an independent news nonprofit dedicated to investigative journalism in the Pacific Northwest. This story was made possible with support from the Sustainable Path Foundation.\n\nThe swell of crypto mining interest in the region was driven by some of the cheapest hydropower in the U.S. produced by the Grand Coulee and other dams. So the utilities in central Washington used tiered power rate increases to manage the high electricity usage that is characteristic of the industry.\n\nFee schedules have also wound up being one of the few ways that any public authority in Washington has sought to regulate the crypto mining industry.\n\nSeveral years of bitcoin’s boom-and-bust cycles later, environmental regulations around crypto mining have remained relatively sparse in Washington and the rest of the Pacific Northwest.\n\nEven at state agencies tasked with environmental protections beyond emissions, such as water quality or e-waste disposal, spokespeople echoed a common refrain that they have little or no specific insight into the impacts of bitcoin mining.\n\nSlowly, that’s beginning to change."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzEvZmVkLXByZXZpZXctcG93ZWxsLXRvLXRyaWdnZXItaGVhbHRoeS1wdWxsYmFjay1pbi1iaXRjb2luLWV4cGVydHMtc2F5L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzEvZmVkLXByZXZpZXctcG93ZWxsLXRvLXRyaWdnZXItaGVhbHRoeS1wdWxsYmFjay1pbi1iaXRjb2luLWV4cGVydHMtc2F5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Fed Preview: Powell to Trigger 'Healthy Pullback' in Bitcoin, Experts Say - CoinDesk",
        "content": "\"I expect the Fed to raise funds rate by 25bp (already priced in) and send out Powell to talk all hawkish, but a barking dog never bites,\" macro investor James Choi tweeted. \"Market is forward-looking, and it will start pricing in a \"PAUSE\" in March, in which by the time the S&P 500 will be at 4500.\""
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtYml0Y29pbi13aGFsZS1kZXBvc2l0cy1vbi1leGNoYW5nZXMtc3VycGFzcy13aXRoZHJhd2Fscy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin BTC Price Trades Flat as GDP, Employment Data Signal Mild Growth - CoinDesk",
        "content": "Historically, the net volume metric tends to move in waves. Although the current development does not guarantee a selling spree, it may foreshadow what larger investors will do. A prolonged movement of bitcoin to exchanges would signal that larger holders are preparing to sell, which could lead to a price drop. The movement is in early stages, though."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzMxL2JpdGNvaW4tbWluZXItZ3JlZW5pZGdlLWdlbmVyYXRpb24tcmVzdHJ1Y3R1cmVzLWFub3RoZXItMTFtLW9mLWRlYnQv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDEvMzEvYml0Y29pbi1taW5lci1ncmVlbmlkZ2UtZ2VuZXJhdGlvbi1yZXN0cnVjdHVyZXMtYW5vdGhlci0xMW0tb2YtZGVidC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Greenidge Generation Restructures Another $11M of Debt - CoinDesk",
        "content": "Greenidge previously reduced $76 million of debt to NYDIG to $17 million by transferring mining rigs that had 2.8 exahash/second of computing power to the lender along with accrued coupons and credits. Greenidge can further cut its debt to NYDIG by $10 million if it facilitates \"for NYDIG the rights to a mining site within three months.\" Greenidge has signed five-year hosting agreements with NYDIG, which \"includes a profit-sharing component,\" according to the press release."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMzEvc3RyaWtlLWV4cGFuZHMtbGlnaHRuaW5nLXBvd2VyZWQtcmVtaXR0YW5jZXMtdG8tcGhpbGlwcGluZXMv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMS8zMS9zdHJpa2UtZXhwYW5kcy1saWdodG5pbmctcG93ZXJlZC1yZW1pdHRhbmNlcy10by1waGlsaXBwaW5lcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Strike Expands Lightning Network-Powered Remittances to Philippines - CoinDesk",
        "content": "“There's all sorts of tax consequences involved – if I wanted to remit money from here to the Philippines, I have to tell the IRS about it. That's ridiculous,” Maller said. “We use the properties of Lightning under the hood. So our users don't even know we're using it. They're just sending dollars and receiving pesos.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvY3J5cHRvLW1hcmtldHMtdG9kYXktYml0Y29pbi1kaXBzLWJlbG93LTIzay1haGVhZC1vZi1mZWRzLW1lZXRpbmcv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8zMC9jcnlwdG8tbWFya2V0cy10b2RheS1iaXRjb2luLWRpcHMtYmVsb3ctMjNrLWFoZWFkLW9mLWZlZHMtbWVldGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Today: Bitcoin Dips Below $23K Ahead of Fed’s Meeting - CoinDesk",
        "content": "To be sure, the number of whale, or large bitcoin holder, deposits to exchanges has declined in recent weeks, which in isolation is bullish. But the volume of deposits to exchanges exceeds the number of withdrawals on a relative basis, which is not. The withdrawal of assets from exchanges is generally a bullish signal."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcmRpbmFscy1wcm90b2NvbC1zcGFya3MtZGViYXRlLW92ZXItbmZ0LXMtcGxhY2UtaW4tdGhlLWJpdGNvaW4tZWNvc3lzdGVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ordinals protocol sparks debate over the place for NFTs in the Bitcoin ecosystem - Cointelegraph",
        "content": "The recent launch of a nonfungible token (NFT) protocol on the Bitcoin mainnet has the crypto community divided over whether it’ll be good for the Bitcoin ecosystem.\n\nThe protocol, referred to as “Ordinals,” was created by software engineer Casey Rodarmor, who officially launched the program on the Bitcoin mainnet following a Jan. 21 blog post.\n\nThe protocol essentially allows for the Bitcoin version of NFTs — described as “digital artifacts” on the Bitcoin network.\n\nThese “digital artifacts” can comprise of JPEG images, PDFs, video or audio formats.\n\nMeme-inspired, NFT-like “digital artifacts” are now being inscribed on the Bitcoin network. Source: Ordinals\n\nThe introduction of the protocol has the Bitcoin community divided, however, with some arguing that it offers more financial use cases for Bitcoin, while others say it’s straying away from Satoshi Nakamoto’s vision of Bitcoin as a peer-to-peer cash system.\n\nBitcoin bull Dan Held was one of those on board with the development, noting that it would drive demand for block space — and thus fees — while bringing more use cases to Bitcoin.\n\nWhy it's good:\n\n- Brings more financial use cases to Bitcoin\n\n- Drives more demand for block space (aka fees)\n\n\n\nMy take:\n\n- If you pay a tx fee, it's not spam.\n\n- Bitcoin is permissionless. Can't stop anyone from building it anyway. — Dan Held (@danheld) January 29, 2023\n\nSome have pointed out that these NFT-like structures have taken up block space on the Bitcoin network, which could drive up transaction fees.\n\nBREAKING: NFTs ON #BITCOIN\n\n\n\nOrdinals are taking up most of the BLOCKSPACE pic.twitter.com/Gxwq4vV8MI — Bitcoin News ⚡ (@BitcoinNewsCom) January 29, 2023\n\nAmong those include Twitter user “Bitcoin is Saving,” who argued to their 237,600 followers on Jan. 29 that “privileged wealthy whites” wanting to use JPEGs as status symbols may exclude marginalized people from participating in the Bitcoin network.\n\nCryptocurrency researcher Eric Wall disagreed, opining that Bitcoin’s built-in block size limit would prevent a rise in transaction fees.\n\nOthers such as Blockstream CEO and Bitcoin core developer Adam Back weren’t happy with meme culture being brought to Bitcoin, suggesting that developers take the “stupidity” elsewhere:\n\n\"you can't stop them\" well ofc! bitcoin is designed to be censor resistant. doesn't stop us mildly commenting on the sheer waste and stupidity of an encoding. at least do something efficient. otherwise it's another proof of consumption of block-space thingy. — Adam Back (@adam3us) January 29, 2023\n\nHowever, Ethereum bull Anthony Sassano, the host of The Daily Gwei, took a shot at the Blockstream CEO for wanting “undesirable” transactions to be censored, which many believe goes against the ethos of Bitcoin:\n\nAdam Back and Luke Dashjr are both Bitcoin core developers who have encouraged censorship over the last 48 hours of these \"undesirable\" transactions\n\n\n\nSo no, it isn't just Bitcoin maximalists - it's actual Bitcoin core developers — sassal.eth (@sassal0x) January 30, 2023\n\nIn a blog post, Rodarmor explained that the NFT-like structures are created by inscribing satoshis — the native currency of the Bitcoin network — with arbitrary content.\n\nRelated: Stacks ecosystem becomes #1 Web3 project on Bitcoin\n\nThese inscribed satoshis — which are cryptographically represented by a string of numbers — can then be secured or transferred to other Bitcoin addresses, according to notes in Ordinal’s technical documentation:\n\n“Inscribing is done by sending the satoshi to be inscribed in a transaction that reveals the inscription content on-chain. This content is then inextricably linked to that satoshi, turning it into an immutable digital artifact that can be tracked, transferred, hoarded, bought, sold, lost, and rediscovered.”\n\nThe inscriptions take place on the Bitcoin mainnet, no sidechain or separate token is needed, the document states.\n\nInscriptions are finally ready for Bitcoin mainnet.\n\n\n\nInscriptions are like NFTs, but are true digital artifacts: decentralized, immutable, always on-chain, and native to Bitcoin. https://t.co/a4dK7zdITS — Casey Rodarmor (@rodarmor) January 20, 2023\n\nIt appears that only 277 digital artifacts have been inscripted thus far, according to the Ordinals website.\n\nInterestingly, Rodarmor admitted in an Aug. 25 interview on Hell Money Podcast that Ordinals was created to bring memes to life on Bitcoin:\n\n“This is 100% a meme-driven development.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRyYWRlcy1oaWdoZXItbmlnZXJpYS1hbWlkLTE0NTk0NjAxMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin trades higher in Nigeria amid cashless economy drive - Yahoo Finance",
        "content": "Bitcoin was trading at a premium in Nigerian cryptocurrency exchanges on Monday as the central bank continued its cashless society campaign which includes ATM withdrawal limits that took effect earlier this month.\n\nSee related article: Weekly Market Wrap: Bitcoin rebounds above $23,000. Can it maintain momentum?\n\nA single Bitcoin was selling for roughly 17.5 million Nigerian nairas (NGN), or around US$38,000, at local exchanges NairaEX and Quidax as of 10 p.m. on Monday, Hong Kong time.\n\nThat price is about 40% higher than the global average Bitcoin price of US$23,100, according to CoinMarketCap. Bitcoin was reportedly trading at an even higher premium earlier in the day.\n\nThe Nigerian Bitcoin premium emerged after the Central Bank of Nigeria (CBN) recently imposed domestic ATM cash withdrawal limits as part of its cashless economy drive.\n\nAs per a December regulatory directive from the CBN, which has been effective since Jan. 9, citizens have been permitted to withdraw no more than 20,000 NGN from ATMs per day and up to 100,000 NGN per week.\n\nThe limits followed the CBN’s drive to replace existing bills with new and lower denomination banknotes. Nigerians had until Jan. 24 to swap for the new notes, but long queues and complaints about insufficient time led to a deadline extension to Feb. 10, the BBC reported.\n\nIn January, local media reported that the House of Representatives Committee on Capital Markets and Institutions plans to pass a law that recognizes digital currencies as investment capital."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiowFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzMxL2ZpcnN0LW1vdmVyLWFzaWEtY2VudHJhbGl6ZWQtZXhjaGFuZ2UtdG9rZW5zLXBvc3Qtc29saWQtZ2FpbnMtaW4tamFudWFyeS1kZXNwaXRlLXNlYy1pbnRlcmVzdC1iaXRjb2luLWV0aGVyLWluLXRoZS1yZWQv0gGnAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzEvZmlyc3QtbW92ZXItYXNpYS1jZW50cmFsaXplZC1leGNoYW5nZS10b2tlbnMtcG9zdC1zb2xpZC1nYWlucy1pbi1qYW51YXJ5LWRlc3BpdGUtc2VjLWludGVyZXN0LWJpdGNvaW4tZXRoZXItaW4tdGhlLXJlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "First Mover Asia: Centralized Exchange Tokens Post Solid Gains in January Despite SEC Interest; Bitcoin, Ether in the Red. - CoinDesk",
        "content": "A big week in markets as the U.S. Federal Reserve meets to decide how high to raise interest rates amid signs of lower inflation and a cooling economy. Coinbase Institutional Head of Research David Duong joined \"First Mover\" to discuss. Johns Hopkins University Professor of Applied Economics Steve Hanke weighed in with his recession outlook. Also bankruptcy expert Dov R. Kleiner of Kleinberg Kaplan joined to discuss the latest in the FTX, Celsius Network, and Voyager Digital bankruptcy cases. Plus, crypto exchange Gemini is reportedly under investigation over FDIC claims."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NhbnQtaWdub3JlLWJpdGNvaW4tbmZ0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs: Love 'Em or Hate 'Em, You Can't Ignore 'Em - Blockworks",
        "content": "Ordinals, a non-fungible token protocol, has launched on Bitcoin mainnet, causing a ruckus in the community.\n\nOrdinals were created by software engineer Casey Rodarmor, and can be described as a numbering scheme for satoshis — the smallest denomination of bitcoin — which can track and transfer individual sats and allow “inscriptions” or “digital assets” to be uniquely identified.\n\n“Ordinal NFTs use an accounting-like method to distinguish between single (fungible) satoshis, making them non-fungible (differentiated) in this closed-off system,” Blockworks Research analyst Matt Fiebach said.\n\nOrdinals store texts, images, SVG, or HTML on-chain and can be authorized through a transaction — they can also be purchased, stored and gifted.\n\nThis was accomplished using a loophole from the Taproot upgrade in 2021, which enabled “practically unlimited (capped by block size) storage using Opcodes, an executable script in a txn that can store arbitrary data,” Fiebach said.\n\nRodarmor notes in a blog post that these digital artifacts will be held to a “higher standard” than NFTs, as they can not be stored off-chain and on centralized servers with back-door keys.\n\n“Inscriptions are immutable and on-chain, on the oldest, most decentralized, most secure blockchain in the world,” Rodarmor said. “They are not smart contracts, and do not need to be examined individually to determine their properties. They are true digital artifacts.”\n\nA torn community\n\nBitcoin’s purpose has been hotly debated since its inception, and not all community members are thrilled about Ordinals.\n\nFor a long time, community members have been torn on whether Bitcoin’s ledger should simply be a space to record financial transactions or a distributed data store for different applications, the pseudonymous Pourteaux wrote in a blog post.\n\nBefore the Taproot upgrade, Opcode was limited to 80 MB, Fiebach said.\n\n“Many BTC supporters believe block space should be reserved for sending BTC rather than storing data, or anything else, given BTC is supposed to be peer-to-peer electronic cash,” he said. “Others may argue that increased demand for block space could be considered a positive for the long term sustainability of securing the network.”\n\nThe pros and cons\n\nSo, what are the chances of Bitcoin becoming the next big hotspot for NFTs?\n\nOne of the appeals of purchasing NFTs on Bitcoin is the price. Since the Segwit upgrade in 2017, Bitcoin has already included a heavily discounted eip-4844-style blob space, cryptocurrency researcher Eric Wall tweeted.\n\n“That blobspace is now being abused by taproot to make full-block (≤4mb) bitcoin NFTs 10x cheaper than ETH L1,” Wall wrote.\n\nhttps://twitter.com/ercwl/status/1619644247313125376\n\nDespite this, a legitimate concern remains.\n\nAs Ordinals don’t operate on a separate sidechain or protocol and run on bitcoin mainnet, popular usage of Ordinals will increase transactions, creating congestion and hefty fees.\n\n“Even though with op_codes, the cost of storing an image on Bitcoin is much cheaper than Ethereum, it is still much more expensive to store data on-chain than through centralized data storage services,” Blockworks Research analyst Ren Yu Kong said.\n\nIf NFTs on bitcoin were to take off, and more people began storing images on the network with op_codes, transaction fees per block would significantly increase and full nodes will have to download much more data, Yu Kong said.\n\n“Over time, that leads to higher technical requirements to run a full node, and thus from a security standpoint, likely leads to further centralization for the set of full nodes verifying the chain,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMzEvYml0Y29pbi1jb21tdW5pdHktZXJ1cHRzLWluLWV4aXN0ZW50aWFsLWRlYmF0ZS1vdmVyLW5mdC1wcm9qZWN0LW9yZGluYWxzL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMzEvYml0Y29pbi1jb21tdW5pdHktZXJ1cHRzLWluLWV4aXN0ZW50aWFsLWRlYmF0ZS1vdmVyLW5mdC1wcm9qZWN0LW9yZGluYWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Community Erupts in Existential Debate Over NFT Project Ordinals - CoinDesk",
        "content": "The protocol’s opponents argue that Ordinals will compete with traditional payment transactions by crowding blocks and driving up transaction fees. Rodarmor disagrees. “To that I say, well, there's this fee market pricing mechanism that bitcoin has, that lets people pay the amount of fees according to how valuable doing the transaction is to them,” Rodarmor told CoinDesk in an interview. “And that applies both to financial transactions and to inscriptions. And so, the fee market already handles what people pay for transactions, what they think they're worth and then miners just pick the transactions with the highest fees. So it all sort of fits into Bitcoin’s security and incentive model.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9uLWNoYWluLWRhdGEtYW5kLWJ0Yy1zLXJlY2VudC1wcmljZS1yYWxseS1wb2ludC10by1hLWhlYWx0aGllci1lY29zeXN0ZW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin on-chain data and BTC's recent price rally point to a healthier ecosystem - Cointelegraph",
        "content": "Bitcoin (BTC) had a rough time all throughout 2022.\n\nBut fresh on-chain and futures market data show positive signs that the leading cryptocurrency by market capitalization has started to recover.\n\nAfter a bevy of short liquidations, the futures market is pointing toward renewed equilibrium. According to data from Glassnode, short position liquidations cleared out unhealthy market speculators, on-chain and exchange data now point to an improving spot market and exchange netflows.\n\nA large group of investors that were previously at a loss is now back in the category that Glassnode analysts label as “unrealized profits.”\n\nMassive short liquidations set the groundwork for new investors to thrive\n\nFutures data typically hold an equilibrium between longs and shorts. As the market moves, investors tend to update their futures to avoid liquidation. Conversely, in mid-January, investors were caught off guard which resulted in an all-time high of 85% short liquidations.\n\nFutures liquidation long versus short ratio. Source: Glassnode\n\nThe short liquidation dominance has helped fuel the current Bitcoin rally. In January, over $495 million in short futures were liquidated. Liquidated shorts create automatic Bitcoin purchases, thus driving up the BTC price. The year-to-date liquidations have three large waves that peaked at $165 million in one day of liquidations.\n\nTotal liquidations. Source: Glassnode\n\nAfter the historic amount of short liquidations, the futures market is trending toward longs. On Jan. 30, 51.46% of open interests are long positions rather than shorts.\n\nLong versus short ratio. Source: Coinglass\n\nThe liquidation of shorts not only helped Bitcoin price rally but also seemingly suggests a return of positive sentiment in the BTC market.\n\nGlassnode researchers said:\n\n“Across both perpetual swap, and calendar futures, the cash and carry basis is now back into positive territory, yielding 7.3% and 3.3% annualized, respectively. This comes after much of November and December saw backwardation across all futures markets, and suggests a return of positive sentiment, and perhaps with a side of speculation.”\n\nBitcoin annualized premium. Source: Glassnode\n\nCentralized exchange netflows reach equilibrium\n\nIn March 2020, centralized exchange (CEX) Bitcoin balances reached an all-time high. Since then, Bitcoin has flowed out of spot exchanges. Approximately 2.25 million BTC are currently held across 21 of the top exchanges, which is a multi-year low. The 11.7% of the total Bitcoin supply held on centralized exchanges was last witnessed in February 2018.\n\nBitcoin exchange balance. Source: Glassnode\n\nTypically throughout Bitcoin’s history, exchange inflows and outflows are similar, creating an even balance. This balance was disrupted in November when net outflows of Bitcoin from exchanges reached $200 million to $300 million per day. The large outflow during this period was historic, resulting in 200,000 Bitcoin leaving exchanges ovethe month.\n\nBitcoin net position change on exchanges. Source: Glassnode\n\nAs Bitcoin started gaining bullish momentum in January, centralized exchange inflow and outflow has normalized. The net flows are now closer to neutral, with a reduction in the high outflow trend.\n\nMultiple Bitcoin investor cohorts return to the “unrealized profit” zone\n\nBitcoin’s movement in and out of exchanges helps provide analysts an estimate for investors’ BTC acquisition price. During the 2022 bear market, only investors from before 2017 were in potential profit. Investors arriving to Bitcoin after 2018 were all at an unrealized loss.\n\nAccording to Glassnode researchers:\n\n“Through the 2022 downtrend, only those investors from 2017 and earlier avoided hitting a net unrealized loss, with the class of 2018+ seeing their cost basis taken out by the FTX red candle. The current rally however has pushed the class of 2019 ($21.8k) and earlier back into an unrealized profit.”\n\nBitcoin average withdrawal price. Source: Glassnode\n\nThe fact that a growing number of investor cohorts have returned to profitability is a good sign, especially after Bitcoin witnessed record realized losses in December.\n\nTwo of the largest investor groups, those who purchased BTC on Coinbase and Binance, hold an average BTC acquisition price of $21,000. As Bitcoin continues to try to reach $24,000, any upcoming correction caused by macro factors may push down the unrealized profits in these groups.\n\nExchange average withdrawal price. Source: Glassnode\n\nPositive signs of Bitcoin’s price recovery can be seen in on-chain, spot exchange and futures data. The futures market is indicating a renewed equilibrium following a record-high amount of short liquidations.\n\nThe market is now showing improved exchange netflows and spot market activity suggests that investors are slowly trickling back into the crypto market.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXB1bXBlZC00My1pbi1qYW51YXJ5LTIwMjMtd2hhdC10by1leHBlY3QtaW4tZmVicnVhcnktd2F0Y2gtdGhlLW1hcmtldC1yZXBvcnQtbGl2ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin pumped 43% in January 2023! What to expect in February — Watch The Market Report live - Cointelegraph",
        "content": "This week on The Market Report, the resident experts at Cointelegraph discuss Bitcoin’s (BTC) impressive January rally and whether there are any indicators that suggest it could continue in February.\n\nWe start off this week’s show with the latest news in the markets:\n\nBest January since 2013? 5 things to know in Bitcoin this week\n\nAfter sealing its highest weekly close in almost six months, BTC/USD remains over 40% up year-to-date, with the monthly close just 48 hours away — can the gains hold? Throughout, concerns have called for an imminent come-down, and even new macro BTC price lows as disbelief swept the market. That grim turnaround has yet to come to fruition, and the coming days could yet turn out to be a crucial period for Bitcoin’s long-term trend. It’s going to be a busy week for the markets as the United States Federal Reserve will decide on its next rate hike this week, with Fed Chairman Jerome Powell giving much-anticipated commentary on the economy and policy. The European Central Bank will make the same decision a day later. Add to that the psychological pressure of the monthly close, and it is easy to see how the coming week could be more volatile in Bitcoin’s recent history. So, buckle up as our experts break down the five key things to know in Bitcoin this week.\n\nBitcoin premium hits 60% in Nigeria as country limits ATM cash withdrawals\n\nAt the time of writing, the price of 1 BTC on the Nigerian crypto exchange NairaEX is 17.2 million nairas, equating to a whopping $37,341. That is a hefty premium over the current market price of Bitcoin, around $22,874 at the time of writing. It comes as the Central Bank of Nigeria has continued to impose limits on ATM cash withdrawals amid an ongoing effort to accelerate its shift to a cashless society. Will this have any impact on the price of Bitcoin, considering more and more people will be flocking to purchase the top digital currency, and how will it impact the rest of the markets?\n\nElon Musk wants Twitter payments system built with crypto in mind\n\nTwitter chief Elon Musk has reportedly instructed his developers to build the platform’s payments system in such a way that crypto functionality can be added in the future. The payment feature will support fiat currencies to start with but will have the capability to accommodate cryptocurrencies if the opportunity arises. For now, things are still pretty vague as to whether the system will involve blockchain or crypto technology, but people are hopeful considering the Twitter CEO has had a lot of influence in the crypto space.\n\nOur experts cover these and other developing stories, so make sure you tune in to stay up-to-date on the latest in the world of crypto.\n\nNext up is a segment called “Quick Crypto Tips,” which aims to give newcomers to the crypto industry quick and easy tips to get the most out of their experience. This week’s tip: How do you evaluate a crypto project?\n\nMarket expert Marcel Pechman then carefully examines the Bitcoin and Ether (ETH) markets. Are the current market conditions bullish or bearish? What is the outlook for the next few months? Pechman is here to break it down.\n\nLastly, we’ve got insights from Cointelegraph Markets Pro, a platform for crypto traders who want to stay one step ahead of the market. Our analysts use Cointelegraph Markets Pro to identify two altcoins that stood out this week, so make sure to tune in to find out which ones made the cut.\n\nDo you have a question about a coin or topic not covered here? Don’t worry — join the YouTube chat room and write your questions there. The person with the most interesting comment or question will have a chance to win a one-month subscription to Markets Pro worth $100.\n\nThe Market Report streams live every Tuesday at 12:00 pm ET (5:00 pm UTC), so be sure to head on over to Cointelegraph’s YouTube page and smash those Like and Subscribe buttons for all our future videos and updates."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDEvYml0Y29pbi11dHhvcy1vbGRlci10aGFuLTUteWVhcnMtc3VyZ2VkLWR1cmluZy1iZWFyLW1hcmtldC_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzAxL2JpdGNvaW4tdXR4b3Mtb2xkZXItdGhhbi01LXllYXJzLXN1cmdlZC1kdXJpbmctYmVhci1tYXJrZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin's Blockchain Data Offers Evidence of Continued Investor HODLing During Bear Market - CoinDesk",
        "content": "Joe Burnett, head analyst at Blockware Solutions, called the aging of UTXOs a bullish development, in response to a tweet by Capriole's founder Charles Edwards referring to the UTXO data as proof of long-term holders accumulating coins at the fastest pace in eight years."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzMxL2JpdGNvaW4tbWluZXItY29yZS1zY2llbnRpZmljLXRvLWJvcnJvdy03MG0tZnJvbS1iLXJpbGV5L9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzMxL2JpdGNvaW4tbWluZXItY29yZS1zY2llbnRpZmljLXRvLWJvcnJvdy03MG0tZnJvbS1iLXJpbGV5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Core Scientific to Borrow $70M From B. Riley - CoinDesk",
        "content": "Core Scientific's downfall followed a sorry 2022 for the bitcoin mining industry, in which firms were squeezed between falling crypto valuations and rising electricity costs. The bitcoin miner filed for bankruptcy protection in December with estimated liabilities of between $1 billion-$10 billion and between 1,000-5,000 creditors. At the time, Core Scientific accounted for around 10% of the computing power on the Bitcoin network."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFkb3B0aW9uLW9mLWd1YXRlbWFsYW4tbWVyY2hhbnRzLWdyb3dzLW9uZS1idGMtdGF0dG9vLWF0LWEtdGltZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin adoption of Guatemalan merchants grows one BTC tattoo at a time - Cointelegraph",
        "content": "Bitcoin (BTC) use in Guatemala is on the up. The Latin American country bordering El Salvador boasts Guatemalan-grown Bitcoin companies such as Ibex and Osmo, several Bitcoin Beach-inspired projects including Bitcoin Lake and now, free BTC tattoos.\n\nA 2022 Bitcoin merchant adoption competition hosted by Osmo Wallet — a Guatemala-based Bitcoin company — led to the free ink promotion. Cointelegraph spoke to Piero Coen, the co-founder of Osmo Wallet and Steven Marroquin, the owner of Soul’s Anchor, a tattoo parlor in Guatemala City.\n\nFree tattoo ideas from Soul's Anchor. Source: Piero Coen\n\nCoen explained how the mission is to get more people to use Bitcoin:\n\n“So we ran a competition among merchants to see who would process the most volume in Bitcoin sales in 2022. Turns out Soul’s Anchor Tattoo Shop in Guatemala City, who started accepting Bitcoin payments using Osmobusiness back in October, won the competition.”\n\nMerchant adoption is nothing new in Guatemala. So they thought about how to make things more exciting. They decided that offering free Bitcoin tattoos to customers might be a Bitcoin-friendly marketing tactic. Coen explained, “It was a huge hit. All the slots filled up in hours!”\n\nThe free Bitcoin tattoos get the thumbs up from Cointelegraph’s Bman. Source: Coen\n\nGuatemalan Bitcoin believers and Bitcoin tourists streamed into the store to ink their favorite Bitcoin meme, quote or art onto their skin. Marroquin, the owner of Souls Anchor, explained, “It’s been around seven months since we officially accepted Bitcoin and have two to three customers per month.” It’s a small amount, but payments are on the rise, he reports:\n\n“The first months we had only one customer, and even though it’s still a few percentages of our income, probably 1%, we are happy to have started accepting it.”\n\nCoen explains that “it’s still super early” for Bitcoin adoption in Guatemala and that “most business owners are still unsure about accepting and holding onto Bitcoin because of the volatility.”\n\nBy allowing instant Bitcoin to fiat currency conversion at the payment merchant terminal, merchants can sidestep the volatility. Instant BTC to fiat conversion is a growing trend in the Bitcoin payments space, as companies such as Strike — headed up by Jack Mallers — and CoinCorner offer similar solutions. Bitcoin as a means of exchange is burgeoning and Coen is optimistic about its future:\n\n“Bitcoin adoption in Guatemala City is on the rise, every day we see more and more people getting into it, learning about it and stacking up on Sats.”\n\nRikki, one-half of the Bitcoin Explorers couple who spent 45 days living off Bitcoin only in El Salvador, recently traveled around Guatemala, paying his way in Bitcoin. Rikki told Cointelegraph the level of “adoption of Bitcoin in Guatemala has really surprised us,” referring to himself and his partner Laura.\n\n“Locals are curious, they want to learn about Bitcoin and see it as an important alternative to credit cards whose fees are very high in the country.”\n\nIndeed, by accepting Bitcoin, businesses can save over 50% on transaction costs when compared with credit card payments, “So the incentives are there,” Coen explained.\n\nRelated: As Bitcoin debuts in El Salvador, Honduras and Guatemala study CBDCs\n\nRikki added that “orange-pilling” efforts by Guatemalan-based companies, such as Ibex and Osmo, “are pushing to raise awareness of the technology.” The couple also visited the Bitcoin Lake, a Bitcoin-beach-style community project, where a Guatemalan mayor is mining Bitcoin in his office, before getting inked themselves as part of the promotion.\n\n“We found the tattoo idea very cute. It is a company that wants to reward its shopkeeper who has received the most Bitcoin transactions by promoting its business.”\n\nBitcoin and crypto tattoos are increasingly common as crypto advocates brand themselves with their choice of coin. However, crypto tattoos can sometimes go very, very wrong.\n\nBitcoin tattoos belonging to Rikki (top) and Laura (bottom). Source: Rikki\n\nTake Mike Novogratz, the Galaxy Digital founder, as an example. His Terra (LUNA) tattoo is a constant reminder that investing requires humility. The LUNA token crashed by over 99% in 2021. Fortunately, the Bitcoin tattoos are safe for now, thanks to a January price pump."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdHJ1dGhvdXQub3JnL2FydGljbGVzL21pYW1pcy1tYXlvci13ZW50LWFsbC1pbi1vbi1jcnlwdG9jdXJyZW5jeS1oaXMtY29uc3RpdHVlbnRzLXN1ZmZlcmVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Miami's Mayor Went All In on Cryptocurrency. His Constituents Suffered. - Truthout",
        "content": "In 2021, Miami Mayor Francis Suarez said that Sam Bankman-Fried, the now disgraced former head of FTX, embodied the “ethos of Miami.”\n\nSuarez was inadvertently right.\n\nMiami is a sunny place for shady people and Bankman-Fried’s shameless grift does indeed embody the corruption that is so commonplace in the city — a place where con artists, corrupt politicians, drug traffickers, money launderers, and all sorts of white-collar criminals make their homes. Crypto scammers love Miami, hiding their greed and grift behind empty libertarian rhetoric about a war against central banking and promising to establish a parallel financial system accessible to those who are “unbanked,” despite never providing a compelling case for how it could work.\n\nThose of us who live in Miami know that serious issues plague the city. It has the most unaffordable housing market in the country, skyrocketing rent costs, a crumbling property insurance market, chronic flooding even when there is a light storm, a complete lack of public transportation and out of control corruption.\n\nInstead of addressing any of these actual problems, Suarez has been singularly focused on pushing cryptocurrency to the detriment of his other responsibilities as mayor. At a recent Bitcoin conference hosted in Miami Beach, Suarez articulated what he referred to as the “vision for Bitcoin America 2024,” calling for the next president of the United States to be “pro-Bitcoin” and for Bitcoin to be integrated into “every aspect of our society.” None of it has aged well after the recent spectacular collapse of the crypto market in which about $2 trillion in wealth has been wiped out, likely sending Suarez idol Bankman-Fried to prison and decimating the life savings of working people.\n\nSuarez is the epitome of what it would be like to have a stereotypical Miami bro in office. He is the son of former Miami Mayor and County Commissioner Xavier Suarez, who is probably most well known for being removed from office after being associated with a voter fraud scheme. In 2009, Suarez, who is a registered Republican, followed in his father’s footsteps and using his family connections and name recognition, was elected to the City of Miami Commission.\n\nAfter serving mostly unremarkably as a commissioner, he followed in his father’s footsteps in 2017 to become the mayor of Miami. Since then, Suarez has ridden the boom of the cryptocurrency market to a sort of national prominence, positioning himself as the “most Bitcoin friendly” politician in the United States and proposing outlandish plans to fund the city’s activities through crypto mining. While on the “Decrypt Media” podcast with Bankman-Fried, Suarez embodied the cavalier attitude of Miami politicians — who are often willing to do the bidding of anyone throwing a substantial amount of money their way in order to skirt rules and regulations.\n\nDuring the interview, Bankman-Fried was asked how FTX could possibly and reasonably be given a 19-year contract to the naming rights for the arena where the Miami Heat play. Suarez himself wasn’t a direct decision maker in the deal, as the arena is owned by Miami-Dade County and he is mayor of the smaller City of Miami, but he encouraged its approval. Bankman-Fried fumbled through a completely gibberish non-answer claiming that FTX made so much money in one year that they don’t need to worry about the other 18 years. Suarez was completely distracted by his phone the whole time, and looked up just at the end to give a double-thumbs up. It was truly beyond parody.\n\nThis is not the only time that Suarez propped up Sam Bankman-Fried. The Miami New Times documented several instances in which Suarez showered the disgraced former billionaire with sycophantic praise in efforts to bring further FTX investments to Miami. After FTX secured the naming rights for the Heat Arena, Bankman-Fried ridiculously tweeted that he looked forward to bringing “peace and prosperity” to Miami residents, prompting Suarez to weigh in.\n\n“Overjoyed that your commitment to our community advances our efforts to be the most crypto friendly city on the planet. All I need to do now is figure out how to put the red laser dots on my eyes,” Suarez responded.\n\nIn another online exchange that has not aged well, Suarez welcomed FTX after Bankman-Fried announced the company would be moving its headquarters to Miami.\n\n“[FTX] is one of the most innovative companies on the planet and you [SBF] are one of the most innovative technologists. Welcome HOME!” Suarez tweeted.\n\nOn top of his vocal support of Bankman-Fried and his ridiculous announcement of a Bitcoin political platform, Suarez also made ludicrous promises to Miami residents regarding the city’s own cryptocurrency: MiamiCoin. Despite its name, MiamiCoin is not actually owned by the City of Miami but by a company called CityCoins, which proposed that when people minted this token, 30 percent would be automatically sent to the Miami’s digital wallet and the remainder would be kept by the user per an agreement between Miami and CityCoins. MiamiCoin has since lost 99 percent of its value and is now worthless.\n\nOther cities like New York and Austin have explored similar cryptocurrency partnerships with sketchy entities like CityCoins, but none with the same level of enthusiasm as Miami. That’s largely because of Suarez’s endorsement of the project and his promotion of MiamiCoin to residents and investors.\n\nQuartz obtained emails between representatives of CityCoins and Suarez’s staff showing that the mayor’s media appearances promoting MiamiCoin were creating problems for the project and could cause regulatory red flags:\n\nWe need to get an hour with the Mayor for a comms training session on CityCoins and MiamiCoin. It’s great that he is doing press but he would greatly benefit from an hour session with Patrick on how to best communicate the project. There are a few regulatory wires the Mayor has tripped in recent interviews and it’s really important for the sustainability of the project that he is better prepared. We really care about the Mayor and his role in making MiamiCoin a success—it’s critical that we get time with him as soon as possible.\n\nSuarez’s promotion of the MiamiCoin grift reached such a ridiculous crescendo that he actually claimed during an appearance on Fox & Friends that the revenue generated by the City of Miami’s stake in MiamiCoin would be given “as a dividend to all of our residents in Bitcoin” through a “digital wallet.” Even more absurdly, he added that “if this thing continues to grow, there is a world under which we can actually run the city without taxes.”\n\nYes, he actually claimed that this crypto scam — which lost 99 percent of its value — would lead to the abolition of taxes in Miami.\n\nOne of the most infuriating parts about this crypto scam is that Suarez doesn’t seem to have much faith in cryptocurrency when it comes to putting his own skin in the game. In February of 2021, Suarez proposed paying city employees in Bitcoin and offered to take his own paycheck in the cryptocurrency. The plan fortunately never got off the ground, but financial disclosures later revealed that Suarez only held about $11,000 in cryptocurrency by December of 2021, a miniscule amount compared to his two investment properties worth a combined $700,000.\n\nDespite the collapse of FTX and the broader cryptocurrency market, Suarez shows little remorse for his role in legitimizing Sam Bankman-Fried and promoting MiamiCoin. In an appearance on CNBC, he was completely unapologetic, saying, “When people lose money, they want to blame someone,” and “A lot of this is media driven. Maybe in 6 months Bitcoin is at 30,000, or 40,000. Are you going to have me back on and say ‘Mr. Mayor, you’re super smart?'”\n\nAs the 2024 presidential election cycle heats up, Suarez is actually gearing up to run for president himself. It’s hard to discern if he actually believes he can be elected to the highest office in the United States or if this is just another grift to elicit campaign donations for other future political campaigns. What we do know is that his promotion of cryptocurrency seems to be paying off as his 2021 mayoral campaign drew donations from the industry, including a $25,000 donation from former child actor turned blockchain mogul Brock J. Pierce.\n\nSuarez is doing his best to do damage control but at the end of the day MiamiCoin, which was preposterously sold to residents as something that could have ended city taxes, is a scam that lost 99 percent of its value and is now worthless.\n\nWhen it comes to Miami’s ruinous flirtation with crypto scams, acclaimed documentary filmmaker and hometown gadfly Billy Corben put it best when quoted in a Washington Post article. “A bunch of con men selling imaginary coins and magic beans is not that interesting of a story,” said Corben, a longtime skeptic of Suarez’s embrace of Bitcoin. “But the fact is the government and its elected officials were complicit in it and dragged the city in it.”\n\nThat’s exactly right. It’s one thing for cryptocurrency to be the hobby horse of gamblers and speculators hoping, and mostly failing, to make a quick buck. It’s another for elected officials, who are supposed to be good stewards of our public assets and have our best interest in mind, to be peddling these grifts so shamelessly and unapologetically.\n\nTired of reading the same old news from the same old sources? So are we! That’s why we’re on a mission to shake things up and bring you the stories and perspectives that often go untold in mainstream media. But being a radically, unapologetically independent news site isn’t easy (or cheap), and we rely on reader support to keep the lights on.\n\nIf you like what you’re reading, please consider making a tax-deductible donation today. We’re not asking for a handout, we’re asking for an investment: Invest in a nonprofit news site that’s not afraid to ruffle a few feathers, not afraid to stand up for what’s right, and not afraid to tell it like it is.\n\n\n\nCopyright © Truthout. May not be reprinted without permission."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iZXN0LWphbnVhcnktc2luY2UtMjAxMy01LXRoaW5ncy10by1rbm93LWluLWJpdGNvaW4tdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Best January since 2013? 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a key week with a familiar cocktail of price spikes mixed with fear that the bear market will return.\n\nAfter sealing its highest weekly close in almost six months, BTC/USD remains over 40% up year-to-date, with the monthly close just 48 hours away — can the gains hold?\n\nAgainst all odds, Bitcoin has rallied beyond expectations this month, making January 2023 its best in a decade.\n\nThroughout, concerns have called for an imminent comedown and even new macro BTC price lows as disbelief swept the market.\n\nThat grim turnaround has yet to come to fruition and the coming days could yet turn out to be a crucial period for Bitcoin’s long-term trend.\n\nThe catalysts are hardly in short supply. The United States Federal Reserve will decide on its next rate hike this week, with Fed Chairman Jerome Powell giving much-anticipated commentary on the economy and policy.\n\nThe European Central Bank (ECB) will make the same decision a day later.\n\nAdd to that the psychological pressure of the monthly close, and it is easy to see how the coming week could be more volatile in Bitcoin’s recent history.\n\nBuckle up as Cointelegraph takes a look at five key issues to consider when it comes to BTC price action.\n\nBitcoin price eyes $24K with FOMC volatility predicted\n\nBitcoin continues to defy naysayers and shorters alike by spiking ever higher on lower timeframes.\n\nThe weekend proved no different to others in January, with BTC/USD hitting $23,950 overnight into Jan. 30 — a new five-and-a-half-month high.\n\nThe weekly close achieved the same feat, with Bitcoin failing to tackle the $24,000 mark for a final flourish.\n\nBTC/USD 1-week candle chart (Bitstamp). Source: TradingView\n\nAt the time of writing, $23,700 formed a focal point, data from Cointelegraph Markets Pro and TradingView showed, with U.S. markets yet to begin trading.\n\nAt current prices, Bitcoin remains up a striking 43.1% in January — the best January since 2013 — Bitcoin’s first well-known bull market year.\n\nBTC/USD monthly returns chart (screenshot). Source: Coinglass\n\nMarket analysts are keen to see what will happen around the Fed rate hike decision at The Federal Open Market Committee (FOMC) on Feb. 1. A definitive source of volatility, the event could impact the monthly candle significantly, only for BTC price action to change tack immediately.\n\n“Perhaps with a little assistance from FOMC volatility? Not a prediction, but certainly a trade setup I'd be very interested in,” popular trader Crypto Chase commented on a chart predicting a retracement followed by further upside for BTC/USD.\n\nBTC/USD annotated chart. Source: Crypto Chase/ Twitter\n\nThat roadmap took Bitcoin over $25,000, itself a key target for traders — even those who remain wary of a mass capitulation event extinguishing January’s extraordinary performance.\n\nAmong them is Crypto Tony, who notes the proximity of $25,000 to Bitcoin’s 200-week exponential moving average (EMA).\n\n“The 200 Weekly EMA sits right above us at 25,000 which as you know is my target on BTC / Bitcoin,” he told Twitter followers on Jan. 29.\n\n“Now flipping the 200 EMA and range high into support is massive for the bulls, but we have yet to do this and people are already euphoric. Think about that.”\n\nAn accompanying chart still laid out a potential path downhill toward $15,000.\n\nAs Cointelegraph reported at the weekend, Il Capo of Crypto, the trader now famous for his misgivings about the recovery, remains short BTC.\n\nContinuing, on-chain analytics resource Material Indicators defined $24,000 as an important zone for bulls to flip to support, along with the 50-day and 200-day simple moving averages.\n\n“If bulls break $24k expecting upside illiquidity to get exploited up to the range of technical resistance ahead of the Feb 1 Fed EoY terminal rate projection. What JPow says will move markets,” it said, as part of a commentary on the bid and ask levels on the Binance order book read this weekend.\n\nMaterial Indicators referenced Powell’s forthcoming words at the FOMC, also noting that bid liquidity had shifted higher, causing the spot price to edge closer to that key area.\n\nBTC/USD order book chart (Binance). Source: Material Indicators/ Twitter\n\nMacro hinges on Fed rate hike, Powell\n\nThe coming week is set to be dominated by the Federal Reserve’s interest rate hike and accompanying comments from Powell.\n\nIn a familiar but still nerve-racking sequence of events for Bitcoin traders, the FOMC will meet on Feb. 1.\n\nThis time, the result may offer few surprises, with expectations almost unanimous in predicting a 25-basis-point hike. Nonetheless, the scope for volatility around the unveiling remains.\n\n“The first two days of Feb are going to be volatile (much fun),” trader and commentator Pentoshi tweeted last week, also noting that the FOMC would be followed by a similar decision from the European Central Bank a day later.\n\nAccording to CME Group’s FedWatch Tool, there is currently a 98.4% consensus that the Fed will hike by 25 basis points.\n\nThis will be a further reduction compared to other recent moves and the smallest upward adjustment since March 2022.\n\nFed target rate probabilities chart. Source: CME Group\n\n“Wouldn’t be surprised if markets pumped all week ahead of the FOMC announcements,” popular social media commentator Satoshi Flipper said.\n\n“We already know it’s 25 BP. So what is there even remaining for J Powell to give guidance about? Another 25 or 50 BP remaining for the year? My point is regarding rates: the worst is now behind us.”\n\nShould speculators be right in assuming that the Fed will now trend toward halting rate hikes altogether, this would notionally offer long-term breathing space to risk assets across the board, including crypto.\n\nHowever, as Cointelegraph reported, many are worried that the coming year will be anything but plain sailing when it comes to a Fed policy transition. That may only transpire when policymakers have no choice but to stop the economic ship from sinking.\n\nAnother comment, from former BitMEX CEO Arthur Hayes, calls for extensive risk asset damage before the Fed is forced to change course, including a $15,000 BTC price.\n\nContinuing the longer-term warnings, Alasdair MacLeod, head of research at Goldmoney, referenced geopolitical tensions surrounding the Russia-Ukraine conflict as a key future risk asset downside trigger.\n\n“No one is thinking through the effect on markets of the resumption of the Ukraine conflict,” he argued.\n\nMacLeod predicted that energy prices would be “sure to spike higher,” along with U.S. inflation estimates.\n\n“Bond yields will rise, equities will fall,” he added.\n\nIndex generates first “definitive buy signal” in 4 years\n\nWhile few pundits are willing to go on record calling an end to the latest Bitcoin bear market, one on-chain metric is potentially leading the way.\n\nThe Profit and Loss (PnL) Index from on-chain analytics platform CryptoQuant has issued a “definitive buy signal” for BTC — the first since early 2019.\n\nThe PnL Index aims to provide normalized cycle top and bottom signals using combined data from three other on-chain metrics. When its value rises above its one-year moving average, it is taken as a long-term buying opportunity.\n\nThis has now occurred with January’s move up in BTC/USD, but while CryptoQuant acknowledges that the situation may flip bearish again, the implications are clear.\n\n“Although it is still possible for the index to fall back below, the CryptoQuant PnL Index has issued a definitive buy signal for BTC, which occurs when the index (dark purple line) climbs above its 365-day moving average (light purple line),” it wrote in a blog post alongside an explanatory chart.\n\n“Historically, the index crossover has signaled the beginning of bull markets.”\n\nBitcoin PnL Index (screenshot). Source: CryptoQuant\n\nCryptoQuant is not alone in eyeing rare recoveries in on-chain data, some of which were absent throughout Bitcoin’s trip to all-time highs following the March 2020 COVID-19 market crash.\n\nAmong them is Bitcoin’s relative strength index (RSI), which has now bounced from its lowest levels ever.\n\nPlanB, the creator of the stock-to-flow family of Bitcoin price forecasting models, noted that the last rebound from macro lows in RSI occurred at the end of Bitcoin’s previous bear market in early 2019.\n\nBitcoin RSI chart. Source: PlanB/ Twitter\n\nBTC hodlers stay disciplined\n\nContrary to expectations, mass profit-taking by the average Bitcoin hodler has yet to kick in.\n\nOn-chain data from Glassnode confirms this, with the BTC supply continuing to age despite the recent price gains.\n\nCoins dormant in wallets for five years or more, as a percentage of the overall supply, hit new all-time highs of 27.85% this weekend.\n\nBitcoin % supply last active 5+ years ago chart. Source: Glassnode/ Twitter\n\nThe amount of hodled or lost coins — “large and old stashes” of BTC traditionally dormant — has also reached its highest level in five years.\n\nBitcoin active supply chart. Source: Glassnode/ Twitter\n\nBitcoin hodled or lost coins chart. Source: Glassnode/ Twitter\n\nMeanwhile, on lower timeframes, the amount of the supply last active in the past 24 hours hit one-month lows on Jan. 29.\n\nDespite this, a feeling of “greed” is rapidly entering the market psyche, especially among recent investors, data below from CryptoQuant warns.\n\nSentiment \"greediest\" since $69,000\n\nWhat began as disbelief became a textbook case of market exuberance as Bitcoin rose rapidly, non-technical data shows.\n\nRelated: Bitcoin will hit $200K before $70K ‘bear market’ next cycle — Forecast\n\nAccording to the Crypto Fear & Greed Index, the classic crypto market sentiment indicator, the mood among Bitcoin and altcoin investors is now predominantly one of “greed.”\n\nThe Index, which divides sentiment into five categories to identify potential blow-off tops and irrational market bottoms, currently measures 55/100 on its normalized scale.\n\nWhile still far from its extremes, that score marks the Index’s first trip into “greed” territory since March 2022 and its highest since Bitcoin’s November 2021 all-time highs.\n\nOn Jan. 1, 2023, it measured 26/100 — less than half its latest reading.\n\nNonetheless, as measured by fear and greed, sentiment has erased losses from the FTX and the Terra LUNA meltdowns.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nIn a cautious reaction, a CryptoQuant contributor warned that sentiment among those only recently entering the market is now echoing the atmosphere of early 2021 when BTC/USD was making new all-time highs on an almost daily basis.\n\n“Sentiment from Bitcoin short-term on-chain participants (short-term SOPR) has reached the greediest level since January 2021,” a blog post read, referencing the spent output profit ratio (SOPR) metric.\n\n“While SOPR trending above 1 indicates a bullish trend, the indicator is way above 1 right now and overly stretched. Without increase in stablecoin reserves on spot exchanges, the bull fuel could run out quickly.”\n\nAmong its other uses, SOPR offers insight into when Bitcoin investors may be more inclined to sell after entering profit.\n\nBTC/USD annotated chart (screenshot). Source: CryptoQuant\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Jlc2VhcmNoLWJpdGNvaW4tcHJpY2UtZXhwZWN0ZWQtdG8tanVtcC1vbi1ob3Blcy1mb21jLXJhdGUtc2NoZWR1bGUtdG9wcy1vdXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Research: Bitcoin price expected to jump on hopes FOMC rate schedule tops out - CryptoSlate",
        "content": "Data analyzed by CryptoSlate suggests the strong correlation between Bitcoin and gold could mark the start of a price run-up, depending on whether the Fed’s hiking schedule is done by March.\n\nThe Federal Open Market Committee (FOMC) meeting is set to conclude on Feb. 1, with the market overwhelmingly expecting a 25 basis point hike, which will take the federal funds rate to 4.5% – 4.75%.\n\nThe subsequent FOMC meeting is scheduled to conclude on March 22, with analysts majority betting on another 25 bps hike. From there, it is expected the Fed will hold rates marking the top of the hiking schedule.\n\nBitcoin and FOMC meetings\n\nExamining the Bitcoin price percentage change for each 2022 FOMC meeting the day before the event, during, and after, 13 of the 24 instances resulted in a drawdown for the leading cryptocurrency.\n\nWhen the Fed first began raising rates, a negative Bitcoin performance could be explained by sell pressure resulting from fearful markets. However, over the year, as the market accepted the inevitability of higher interest rates, a less negative reaction is expected.\n\nOf greater significance than daily price movements is the long-term movement in relation to the Fed’s rate schedule.\n\nStrong BTC-gold correlation\n\nPlotting the performance of the S&P and gold, since 1998, against the federal funds rate, it was noted the top of the Fed’s hiking schedule coincided with a bottoming in the gold price, as denoted by the black arrows on the chart.\n\nIn these cases, the price of gold went on to move significantly higher. For example, in late 2005 as it went from $400/oz to $1,920/oz over a six and half year period.\n\nSimilarly, pauses in the interest rate schedule coincided with the S&P bottoming, shown by the red arrows below, leading to sustained moves higher for tech stocks.\n\nSince February 2022, the price of Bitcoin and gold has shown an 83% correlation – the highest rate in over a year.\n\nIf gold reacts as it did in past instances of the Fed hiking schedule topping out, and Bitcoin mimics gold, BTC could be in for a significant jump in price.\n\nHowever, there is no certainty that March will mark the top of the Fed’s rate schedule. In addition, other macroeconomic and geopolitical factors are in play, as is the developing situation at Genesis following its bankruptcy filing.\n\nMentioned in this article"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc3RyaWtlLWxhdW5jaGVzLWluc3RhbnQtY2hlYXAtcmVtaXR0YW5jZXMtZm9yLXRoZS1waGlsaXBwaW5lcy11c2luZy1iaXRjb2luLWxpZ2h0bmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Strike Launches Instant, Cheap Remittances For The Philippines Using Bitcoin Lightning - Nasdaq",
        "content": "U.S. users of Strike can now use Send Globally to send instant, cheap remittances to loved ones in the Philippines.\n\nStrike, the leading digital payment platform built on Bitcoin's Lightning Network, has announced the expansion of its \"Send Globally\" product to the Philippines. This will allow for fast, secure and low-cost money transfers between the U.S. and the Philippines, which is one of the world's largest remittance markets. The Philippines relies on more than $35 billion annually in money sent from abroad, with over $12 billion coming from the U.S. alone.\n\nStrike has partnered with Pouch.ph to enable transfers from U.S. dollars to Philippine pesos, which can be received in a bank or mobile money account in the Philippines.\n\nStrike uses the Lightning Network to make digital payments faster, cheaper, and more accessible, particularly in countries with a high number of unbanked individuals. With Send Globally, dollars are converted into bitcoin, sent via the Lightning Network to a third-party partner in the recipient's country, then converted into local currency and sent directly to the recipient's bank or mobile money account. This eliminates the need for both the sender and recipient to worry about bitcoin's tax treatment, dollar volatility or custody implications.\n\n“Remittances are a broken system and Strike delivers an incredibly empowering experience for people to send money around the world in nearly an instant,” Jack Mallers, founder and CEO of Strike commented. “We’re excited to partner with Pouch.ph to advance financial inclusion and bring fast, low-cost cross-border payments via the Lightning Network to the Philippines. Our technology allows us to both improve on the existing cross-border experience and include those that have previously been excluded by legacy payment rails.”\n\nBitcoin Magazine was fortunate enough to interview Mallers on the development, which can be viewed below:\n\nSend Globally was launched in December 2022 starting with transfers from the U.S. to Nigeria, Kenya, and Ghana. CoinCorner has also partnered with Pouch.ph to enable remittances for European customers.\n\n\n\nWith the integration of Pouch.ph and Strike, the cross-border payment experience has been revolutionized and has further empowered people to easily send money to their loved ones back home. Lightning will continue to expand into more markets with more partners to provide better payment services to communities around the world.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByZW1pdW0taGl0cy02MC1pbi1uaWdlcmlhLWFzLWl0LWxpbWl0cy1hdG0tY2FzaC13aXRoZHJhd2Fsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin in Nigeria is 60% more expensive, but there's a catch - Cointelegraph",
        "content": "Disclaimer: This article was updated on Jan. 31 to clarify the \"Bitcoin premium\" it originally pointed to is a direct result of the disparity between the official dollar-to-naira rate and actual market conditions, not the Bitcoin price itself. Also, the update omits the conclusion that the ATM withdrawal limit caused the \"Bitcoin premium\" in Nigeria.\n\nThe price of Bitcoin (BTC) has skyrocketed to well above global market levels, but only if the official naira-to-U.S. dollar rate is used for calculation.\n\nAt the time of writing, the price of 1 BTC on the Nigerian crypto exchange NairaEX is 17.8 million nairas, equating to a whopping $38,792 in the official rate. However, local media points out that the official foreign currency rate listed by the Central Bank of Nigeria (CBN) doesn't reflect the actual USD price available to Nigerian citizens.\n\nAs per the official CBN exchange rate, $1 equals N460 as of Jan. 30. However, the exchange rate of USD in the parallel market, or the real price that Nigerian citizens can exchange Naira for U.S. dollars is close to N750. This disparity between the official naira-to-USD rate and the real market rate of USD for Nigerian traders causes it to appear Bitcoin has a 60% \"premium\" over the current market price — which is around $23,700 at the time of writing.\n\nRecently, CBN introduced new naira banknotes with the aim of curbing inflation and money laundering. The central bank imposed a deadline of Jan. 24 for Nigerians to exchange their old, higher denomination bank notes for the new currency.\n\nHowever, there were long queues and complaints that there was insufficient time to meet the deadline. The central bank has now extended that deadline to Feb. 10, the BBC reported on Jan. 29.\n\nRelated: Nigeria set to pass bill recognizing Bitcoin and cryptocurrencies\n\nNigeria has become the leading country for Bitcoin web searches, according to Google Trends.\n\n\"Buy Bitcoin\" interest by region. Source: Google Trends\n\nAdditionally, on Jan. 26 Reuters reported that the Central Bank of Nigeria launched a domestic card scheme to rival foreign cards like Mastercard and Visa.\n\nThe \"AfriGo\" card scheme was designed to give Nigerians better access to bank card services and circumvent often expensive foreign card fees and exchange costs."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTMxL2JpdGNvaW4tYmVhdGluZy11cy1nb3Zlcm5tZW50LWJvbmRzLWlzLWEtd2hvbGUtdmliZS1zaGlmdC1pbi1tYXJrZXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Beating US Government Bonds Is a Whole Vibe Shift in Markets - Bloomberg",
        "content": "Want to see what’s different in markets so far in 2023? Look no further than the performance of Bitcoin versus bonds.\n\nThe cryptocurrency has surged almost 40% so far this year thanks to a general return of risk appetite and the expectation that the Federal Reserve will hit the pause button on hiking interest rates. Of course, those same factors have sparked a rally in bonds — but not enough to offset historic losses incurred last year."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzMxL2NyeXB0by1tYXJrZXRzLWFuYWx5c2lzLWJpdGNvaW4tZXRoZXItcHJpY2Utc3VyZ2UtYS1yZXZlcnNhbC1mcm9tLWRhcmtlc3QtZGF5cy1vZi0yMDIyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin, Ether Price Surge a Reversal From Darkest Days of 2022 - CoinDesk",
        "content": "The RSI indicator measures the speed and magnitude of price changes and ranges between 0-100. Readings above 70 imply that an asset is overbought, and readings below 30 indicate that an asset is oversold. Bitcoin and ether recently rose as high as 87 and 86, respectively, and have since declined to 70 and 59."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFpbXMtZm9yLTI1ay1hcy1pbnN0aXR1dGlvbmFsLWRlbWFuZC1pbmNyZWFzZXMtYW5kLWVjb25vbWljLWRhdGEtc29vdGhlcy1pbnZlc3Rvci1mZWFyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin aims for $25K as institutional demand increases and economic data soothes investor fears - Cointelegraph",
        "content": "Bitcoin (BTC) price broke above $22,500 on Jan. 20 and has since been able to defend that level, accumulating 40.5% gains in the month of January. The move accompanied improvements in the stock market, which also rallied after China dropped COVID-19 restrictions after three years of strict pandemic controls.\n\nE-commerce and entertainment companies lead as the year-to-date market performers. Warner Bros (WBD) added 54%, Shopify (SHOP) rose 42%, MercadoLibre (MELI) climbed 41%, Carnival Corp (CCL) 35% and Paramount Global (PARA) managed a 35% gain so far. Corporate earnings continue to attract investors’ inflow and attention after oil producer Chevron posted the second-largest annual profit ever recorded, at $36.5 billion.\n\nMore importantly, analysts expect Apple (AAPL) to post a mind-boggling $96 billion in earnings for 2022 on Feb. 2, vastly surpassing the $67.4 billion profit that Microsoft (MSFT) reported. Strong earnings also help to validate the current stock valuations, but they do not necessarily guarantee a brighter future for the economy.\n\nA more favorable scenario for risk assets came largely from a decline in leading economic indicators, including homebuilder surveys, trucking surveys and contracting Purchasing Managers Index (PMI) data, according to Evercore ISI’s senior managing director, Julian Emanuel.\n\nAccording to the research from financial services firm Matrixport, American institutional investors represent some 85% of recent purchasing activity. This means large players are “not giving up on crypto.” The study considers the returns occurring during U.S. trading hours but expects the outperformance of altcoins relative to Bitcoin.\n\nFrom one side, Bitcoin bulls have reasons to celebrate after its price recovered 49% from the $15,500 low on Nov. 21, but bears still have the upper hand on a larger time frame since BTC is down 39% in 12 months.\n\nLet's look at Bitcoin derivatives metrics to better understand how professional traders are positioned in the current market conditions.\n\nAsia-based stablecoin demand approaches the FOMO region\n\nThe USD Coin (USDC) premium is a good gauge of China-based crypto retail trader demand. It measures the difference between China-based peer-to-peer trades and the United States dollar.\n\nExcessive buying demand tends to pressure the indicator above fair value at 100%, and during bearish markets, the stablecoin's market offer is flooded, causing a 4% or higher discount.\n\nUSDC peer-to-peer vs. USD/CNY. Source: OKX\n\nCurrently, the USDC premium stands at 3.7%, down from a 1% discount two weeks prior, indicating much stronger demand for stablecoin buying in Asia. The indicator shifted gears after the 9% rally on Jan. 21, causing excessive demand from retail traders.\n\nHowever, one should dive into BTC futures markets to understand how professional traders are positioned.\n\nThe futures premium has held a neutral stance since Jan. 21\n\nRetail traders usually avoid quarterly futures due to their price difference from spot markets. Meanwhile, professional traders prefer these instruments because they prevent the fluctuation of funding rates in a perpetual futures contract.\n\nThe three-month futures annualized premium should trade between +4% to +8% in healthy markets to cover costs and associated risks. Thus, when the futures trade below such a range, it shows a lack of confidence from leverage buyers — typically, a bearish indicator.\n\nBitcoin 3-month futures annualized premium. Source: Laevitas\n\nThe chart shows positive momentum for the Bitcoin futures premium after the basis indicator broke above the 4% threshold on Jan. 21 — the highest in five months. This movement represents a drastic change from the bearish sentiment presented by the futures’ discount (backwardation) present until late 2022.\n\nRelated: Bitcoin price is up, but BTC mining stocks could remain vulnerable throughout 2023\n\nTraders are watching to see if the Fed broadcasts plans to pivot\n\nWhile Bitcoin’s 40.5% gain in 2023 looks promising, the fact that the tech-heavy Nasdaq index rallied 10% in the same period raises suspicions. For instance, the street consensus is a pivot from the Federal Reserve’s interest rate hiking campaign at some point in 2023.\n\nBitcoin derivatives and stablecoin demand exited the panic levels but if the Fed’s expected soft landing takes place, the risk of a recessionary environment will limit stock market performance and hurt Bitcoin’s “inflation protection” appeal.\n\nCurrently, the odds favor bulls as leading economic indicators show a moderate correction — enough to ease inflation but not especially concerning, as solid corporate earnings confirm.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluaW5nLWRpZmZpY3VsdHktaGl0cy1uZXctYWxsLXRpbWUtaGlnaC13aXRoLTQtNy1yaXNlL9IBWGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluaW5nLWRpZmZpY3VsdHktaGl0cy1uZXctYWxsLXRpbWUtaGlnaC13aXRoLTQtNy1yaXNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining difficulty hits new all-time high with 4.7% rise - Forkast News",
        "content": "Bitcoin’s mining difficulty level rose 4.68% on Sunday, hitting an all-time high, as the networks’ hashrate also continued to increase.\n\nSee related article: Blockstream says it raised US$125 million to expand Bitcoin mining operations\n\nFast facts\n\nThe mining difficulty reading came in at 39.35 trillion at block height 774,144 in Sunday’s biweekly adjustment, following a 10.26% rise in the previous adjustment on Jan. 16, according to data from BTC.com.\n\nThe latest Bitcoin mining difficulty reading was nearly 48% higher than on Jan. 21 of last year, when the difficulty reading was at 26.64 trillion.\n\nBitcoin mining difficulty, which determines how much computing power is required to verify blocks on the blockchain in exchange for Bitcoins rewards, changes roughly every two weeks.\n\nBitcoin’s hashrate, a measure of computational power used by miners, was at around 311 exahashes per second on Monday, up from 274.69 exahashes on Jan. 16, BTC.com data showed.\n\nBitcoin’s price gained 2% over the last 24 hours to trade at US$23,690 at 1:30 p.m. in Hong Kong, as part of its 4.16% weekly gain and 43% monthly rise, according to data from CoinMarketCap.\n\nThe profitability rate of Bitcoin mining stood at US$0.074 per terahash per second in the past 24 hours, down from US$0.185 from a year ago, data from BitInfoCharts showed.\n\nSee related article: U.S.’ first nuclear-powered Bitcoin mining center to open in Q1"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xMjAyNTAvb3JkaW5hbHMtbGF1bmNoZXMtbmZ0cy1vbi1iaXRjb2luLXRyaWdnZXJzLWNvbnRyb3ZlcnN50gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDI1MC9vcmRpbmFscy1sYXVuY2hlcy1uZnRzLW9uLWJpdGNvaW4tdHJpZ2dlcnMtY29udHJvdmVyc3k_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ordinals Launches NFTs on Bitcoin, Unsurprisingly Sparking Controversy - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhen it comes to digital collectibles, most enthusiasts think of Ethereum, Solana, or Polygon—deservedly, as proof-of-stake blockchains have cornered the NFT marketplace. But digital collectibles using the Bitcoin blockchain have existed since 2014, and several projects have made it their continuing mission to bring NFTs to the first and biggest cryptocurrency.\n\nNFTs are digital assets that are provably unique and linked to digital (and sometimes physical) content like digital art, movies, and music that show proof of ownership or membership in an exclusive group.\n\nEven though NFTs have been in the Bitcoin ecosystem for nearly a decade, however, some still don’t see the point.\n\nAD\n\nAD\n\nOne of these projects is Ordinals, and some Bitcoin maximalists are calling it an affront to Bitcoin principles.\n\n\"you can't stop them\" well ofc! bitcoin is designed to be censor resistant. doesn't stop us mildly commenting on the sheer waste and stupidity of an encoding. at least do something efficient. otherwise it's another proof of consumption of block-space thingy. — Adam Back (@adam3us) January 29, 2023\n\nOrdinals creator Casey Rodarmor takes the criticism in stride, saying the controversy helps his cause.\n\n“I actually love the haters,” he said. “I mean, they do more to drive people to find out about the project than anybody else. I don’t know what they think when they have these massive audiences, and they go, ‘This is an attack on Bitcoin’—it seems like you don’t want to do that if you don’t want people to use the thing.”\n\nRodarmor is a former Bitcoin Core contributor who designed Ordinals to allow the transferring of individual satoshis on the Bitcoin network. “The Ordinals protocol is just a system for numbering Satoshis, giving individual sats a serial number, and then tracking them across transactions,” Rodarmor told Decrypt in an interview.\n\nAD\n\nAD\n\nThe Ordinals protocol enables users to explore, transfer, and receive individual satoshis, which may include unique inscribed data such as videos and images. The process of adding assets to individual satoshis is called inscription. As Rodarmor explains, inscriptions make it possible to put content in a Bitcoin transaction and assign it to a satoshi. Once completed, Rodarmor says, the inscriptions are stored in a Bitcoin transaction’s signature.\n\nThe process stays entirely on the Bitcoin network and does not require a sidechain or additional token, according to Rodarmor. “My design goal, from the beginning, was to create something that would strike people as being Bitcoin native,” he said. “That means it can’t have a token, and it can’t be a sidechain.”\n\nSatoshis—named after Satoshi Nakamoto, the pseudonymous creator of the Bitcoin blockchain—is the smallest unit of a Bitcoin. When someone buys a cup of coffee using BTC, they are most likely using satoshis instead of a whole Bitcoin, which currently trades around $22,700 per coin, according to Coingecko.\n\nMarginalized peoples in developing countries will have to pay more to run their Bitcoin nodes and send transactions because privileged wealthy whites want to put JPEG drawings on the blockchain as status symbols. Just because you can doesn’t mean you should. — Bitcoin is Saving (@BitcoinIsSaving) January 29, 2023\n\n“This use of block space is probably the lowest impact use compared to other things that you can do,” Rodarmor says. “Full nodes download this data, but then they ignore it,” The inscriptions have no resource requirements, he adds, refuting claims that Ordinals and inscriptions abuse the Bitcoin protocol or would drive up transaction costs.\n\n“One thing that people don’t understand is that in order for Bitcoin to be secure, blocks must be full—that is part of the Bitcoin security model,” he said. “If blocks are not full, nobody has any reason to pay more than the minimum fee rate to have their transactions included. So, as a result, blocks must be full.”\n\nRodarmor says that while inscriptions contribute to making blocks full, inscriptions do not change the size of the Bitcoin block. That would be something Rodarmor says he would not advocate.\n\nEven in the event of another upgrade to the Bitcoin network, Rodarmor says it would be unlikely to cause any problems for Ordinals, as the protocol only relies on minor parts of the Bitcoin network.\n\nAD\n\nAD\n\n“[Ordinals] relies on the fact that transactions have inputs, transactions have outputs, [and] that inputs and outputs are valued in satoshis,” he said. “So you can’t break Ordinals in an upgrade without breaking a whole lot of other things.”"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy81LWFsdGNvaW5zLXRoYXQtcHJvZHVjZWQtZG91YmxlLWRpZ2l0LWdhaW5zLWFzLWJpdGNvaW4tcHJpY2UtcmFsbGllZC1pbi1qYW51YXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "5 altcoins that produced double-digit gains as Bitcoin price rallied in January - Cointelegraph",
        "content": "The rally in cryptocurrency markets started in early January with a spike in heavily-shorted altcoins and Ethereum (ETH) liquid staking derivative (LSD) tokens due to the upcoming network upgrade in March. Soon gains started to show across the board as buyers started to play catch up.\n\nThe improving macroeconomic conditions, such as reduced inflation and a stable job sector in the United States, provided additional tailwinds for the positive rally. Bitcoin (BTC) is en route to its most impressive closing for January since 2013. Its price has gained 40% year-to-date from the opening value of $16,530.\n\nAnother important catalyst for January’s rally was a short squeeze across the crypto market. After the FTX debacle and the lack of bullish narratives for the niche space, most investors expected growth to slow down in 2023.\n\nThere are unresolved issues such as potential Digital Currency Group fallout, geopolitical tension between Russia and Ukraine and recession risks due to the Fed’s aggressive quantitative tightening policies. Thus, most traders didn’t expect strong price rallies so early inthe year.\n\nAs it turns out, negative sentiment and crowded positions in the futures market continued to fuel more upside. There’s a strong chance of a pullback soon after steep gains. It remains to be seen if the pullback levels are attractive enough for buyers to turn it into a medium-to-long-term bullish trend. Let’s take a look at the top performing cryptocurrencies for January.\n\nTop crypto market gainers in January. Source: CoinMarketCap\n\nAptos (APT)\n\nLaunched in October, Aptos is a relatively new blockchain in the space that leverages the technology of Facebook/Meta’s discarded crypto project, Libra. It carries significant face value based on its executive team, composed of former Meta engineers who also built the Move programming language to make the chain scalable and decentralized.\n\nWhile the project carries much reputation, its fundamentals do not justify the price. The disbelief among investors is part of the reason behind the APT price rally. A market capitalization of $3 billion for a four-month-old project has surprised many onlookers. There’s also suspected market manipulation in the APT/KRW pair on Upbit, giving rise to the Kimchi premium. It is difficult to pinpoint a specific factor driving its demand in South Korea.\n\nAPT/USD broke above its previous peak of around $10, recorded around its launch. Technically, the token is in price discovery mode right now. Thus, there are few sell-side resistance levels besides the latest peak of $20 and the psychological level at $25. Unless the positive catalysts in the negative funding rate for perpetual swaps and the Kimchi premium cool off, the rally may still have wings.\n\nBut the token’s relative strength index (RSI), a price momentum indicator, has spiked to oversold territory, suggesting the possibility of a pullback. The moving average convergence divergence (MACD) indicator shows a slight bullish deviation with a less steep rise in the metric compared to the price. Still, the presence of buying volume is reassuring for APT bulls. The support for the token lies at $14.75 and $10.40.\n\nAPT/USD daily price chart with RSI and MACD indicator. Source: TradingView\n\nGala (GALA)\n\nSimilar to Aptos, Gala (GALA) also benefited from the excess negative positioning in the futures market. The gain in GALA/USD from $0.02 to $0.07 can be primarily attributed to wipe out of short positions.\n\nGALA price (yellow) and funding rate. Source: Coinglass\n\nThe token suffered significant inflation of around 17,123,286 GALA daily, which accounts for around $28.2 million monthly at current prices. This raises concerns that the recent price pump could be short-lived.\n\nOn Jan. 25, Gala’s team introduced a new roadmap of the project in which they seek to update the tokenomics to reduce inflation and introduce a new burn mechanism. They are working on an independent Gala chain, where GALA tokens will be used to pay transaction fees.\n\nOn top of that, the daily issuance of GALA may also reduce after a vote is passed to change the time-based halving schedule to a supply-based one, bringing the halving closer than July 21.\n\nThe upgrade announcements have added to the buying pressure in GALA/USD, evident in a spike in buying volume. The token is trading above its 200-day exponential moving average at $0.052. If buyers build support above this level, the price can run toward the July 2022 breakdown levels near $0.164.\n\nGALA/USD daily price chart. Source: TradingView\n\nThreshold (T)\n\nThreshold was born from the merger of two projects, Keep Network and NuCypher, which have combined their technologies to build a decentralized bridge network. Node operators on the Threshold network stake the platform’s native T token and Ether to validate the transfers between Bitcoin and Ethereum. This technology was borrowed from Keep Network, while NuCypher adds a layer of privacy to the protocol.\n\nIn January, the project’s native token nearly tripled in price, benefiting from the v2 launch and Coinbase’s listing announcements. The upgraded version of the Threshold protocol will enable tBTC (threshold Bitcoin) mints on Ethereum, which are backed by Bitcoin and pegged 1:1 to the BTC price.\n\nThe beginning of tBTC mints on Ethereum via Threshold Network will likely increase the network’s total locked value (TVL), making Threshold nodes more valuable. Initially, the project will launch a semi-decentralized version, Optimistic Minting, and gradually move to a decentralized system of nodes.\n\nThere’s a significant market opportunity for Threshold after the dissolution of RenBTC. Wrapped Bitcoin (WBTC) currently commands a dominant share of 93.6% of the total Bitcoin bridged to Ethereum.\n\nStill, the recent 190% increase is starting to show signs of a buy-the-rumor, sell-the-news type of event, especially factoring in the Coinbase-led rise. The support for buyers lies at $0.027, with the next level of resistance at $0.145.\n\nDecentraland (MANA)\n\nThe metaverse-themed projects Decentraland (MANA) and The Sandbox (SAND) witnessed a revival of the VR narrative as Apple is rumored to be launching its VR headset collection this spring. More recently, the Decentraland team released its manifesto for the current year, with a focus on growing its developer and creator community.\n\nWhile Decentraland is one of the earliest metaverse projects with a massive opportunity to capture the future Web3 market, the present rally is showing overbought characteristics in the short-term.\n\nThe RSI indicator shows a reading above its bullish resistance. The MACD indicator shows a divergence with little to no-change in the metric to complement the Jan. 28 surge of 16.5%.\n\nMANA/USD daily price chart. Source: TradingView\n\nNevertheless, the breakout above 200-day moving average and resistance from the FTX breakdown levels at 0.70 is encouraging for technical buyers. It remains to be seen if the surge was a just stop hunt of short orders or stemming from actual demand. Support for the token lies at the 50-day EMA, current at $0.54, and 2022 lows of $0.27.\n\nSolana (SOL)\n\nSolana (SOL) benefited from excessive negative sentiment around the blockchain’s future. The price rally was a classic case of a short squeeze in the futures market. While the fundamentals pointed toward a death spiral in its price, the market played out differently. By leveraging low liquidity conditions, buyers were able to push the prices higher until few sellers remained.\n\nThe market maker and venture capitalist entity, Alameda Research, was the primary source of liquidity for Solana’s DeFi projects. It was also one of the largest backers of its ecosystem projects. The DeFi community will face significant challenges within Solana due to a lack of liquidity.\n\nSolana developers and the foundation have been working hard to make the network stable and more decentralized. While the network remained stable through the FTX debacle, it appears to have lost the market’s trust thanks to frequent downtimes. Moreover, Alameda/FTX owns around 10.7% of the total supply of SOL, which will likely add to the selling pressure for the next few years.\n\nTheir NFT space, while placed second in terms of trading volume across blockchains, is starting to see the departure of top performers like DeGods, y00ts, and most recently, F Studio. It remains to be seen if the community can build back up. The task will be challenging without the support of its most prolific backers.\n\nOn long timeframes, the $30 level is a crucial resistance and support level for SOL/USD. If buyers consolidate above this level, the positive momentum in the token’s price will likely stretch into Q1 2023. However, given that the rally is mainly driven by a short-side wipeout in the futures market, there’s a higher likelihood for a significant correction, followed by a period of accumulation, until a meaningful run can take form.\n\nLast but not least, the LSD-narrative tokens deserve a mention in the monthly winners list. The native tokens of Ethereum LSD platforms nearly doubled in price across the board thanks to the upcoming Shanghai upgrade.\n\nThe Frax DAO was the highest gainer among LSD tokens, benefiting from a strong rise in the staked Ether on its platform. The platform is able to attract liquidity by providing additional yield on staking ETH through leveraging its position on Curve Finance.\n\nThe Frax DAO is the largest owner of CVX tokens, which gives them priority control over Curve emissions. Currently, staking frxETH on Curve earns around 9-10% annual yield, which is two times higher than the average LSD yield of around 4%.\n\nGiven that Ethereum’s Shanghai upgrade is still a month away and there’s room for growth of LSD platforms, the attention toward LSD tokens could likely sustain through February.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1hZHZvY2F0ZS1pcy1nb2luZy1zdGF0ZS10by1zdGF0ZS10by1lZHVjYXRlLXVzLWxhd21ha2Vyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining advocate is going state-to-state to educate US lawmakers - Cointelegraph",
        "content": "Dennis Porter, CEO of the Satoshi Action Fund, is taking the fight for hearts and minds on Bitcoin mining to Washington, D.C., and beyond in an effort to support friendly legislation.\n\nPorter, who first discovered Bitcoin (BTC) in 2017, told Cointelegraph his path advocating the benefits of mining has taken him to support bills in at least six U.S. states, with federal lawmakers also in his crosshairs. The Satoshi Action Fund CEO met with U.S. senators and representatives on Jan. 25 in support of proposed legislation aimed at eliminating discrimination against miners.\n\nAccording to Porter, the Lummis-Gillibrand Responsible Financial Innovation Act — a bill introduced in June aimed at addressing the roles of the U.S. Commodity Futures Trading Commission and Securities and Exchange Commission on crypto regulation — has a provision addressing taxation for BTC mining rewards. He said the legislation could close a loophole allowing the Internal Revenue Service to have two bites of the apple on miners’ revenue.\n\n“We believe that Bitcoin mining is being unfairly targeted and double taxed by the IRS currently,“ said Porter.\n\nThe conversations between Porter and members of Congress — including Senators Ron Wyden, Cynthia Lummis and Ted Budd — marked the first time the Satoshi Action Fund had stepped up in person to the national stage in defense of BTC miners. However, the organization has also stood behind bills being considered in New Hampshire, Montana, Mississippi, Missouri and Oklahoma.\n\nCrypto mining operations in the United States have many critics among lawmakers and citizens alike, with complaints about the energy consumption of proof-of-work cryptocurrencies like Bitcoin as well as the noise pollution from crypto-mining machines. In November, New York Governor Kathy Hochul signed into law a two-year moratorium on PoW mining.\n\nDennis Porter. Source: Twitter\n\nRelated: Bitcoin mining revenue jumps up 50% to $23M in one month\n\nPorter added leaders in Montana have attempted to push miners out using zoning laws and considered policies including higher electricity rates. The legislatures in Mississippi and Missouri have separately introduced bills aimed at protecting certain activities of miners following visits from the Satoshi Action Fund, while Texas is home to many major blockchain firms following a crackdown in China.\n\n“We’re just going to keep pushing hard until we get actual policy passed,” said Porter."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWlzLXVwLWJ1dC1idGMtbWluaW5nLXN0b2Nrcy1jb3VsZC1yZW1haW4tdnVsbmVyYWJsZS10aHJvdWdob3V0LTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price is up, but BTC mining stocks could remain vulnerable throughout 2023 - Cointelegraph",
        "content": "Bitcoin (BTC) mining stocks usually follow BTC’s price because it directly influences company earnings. These stocks were beaten down heavily in the last quarter of 2022, especially in December. The downturn after FTX’s collapse worsened with the bankruptcy filing of the largest U.S.-based Bitcoin mining company, Core Scientific.\n\nDuring this time, other mining stocks, like Marathon Digital Holdings (MARA) in the chart below, exhibited a weak correlation with Bitcoin’s price, suggesting that December’s downturn was probably overblown.\n\nMARA/USD price chart with MARA-BTC Correlation Coefficient index. Source: TradingView\n\nThe negative trend reversed at the start of 2023 as most mining stocks posted impressive gains. The Hashrate Index mining stock index, which tracks the average price of publicly listed mining and hardware manufacturing companies, increased by 62.5% year-to-date. The positive price spike also restored the strong correlation between BTC price and mining stocks.\n\nHowever, the mining industry remains under stress, with low profit levels expected for prolonged periods. Since Q2 2022, mining companies have funded operations by selling BTC from reserves, selling newly mined BTC, raising debt and issuing new shares. Unless Bitcoin’s price consolidates above $25,000, the industry will likely witness a few takeover attempts or further treasury sales to pay off debt.\n\nSome mining companies are operating at a loss\n\nCurrently, the top mining companies’ price-to-earnings (PE) ratio is negative, suggesting that they’re operating at a net loss, making their stock prices vulnerable to steep downturns.\n\nRiot Blockchain, Bitfarms Ltd, Hive Blockchain Technologies, Cleanspark Inc, Marathon Digital Holdings and Hut 8 Mining are the largest publicly traded Bitcoin mining companies with over 1% of the global hash rate share. The top 15 public mining companies have a combined share of around 19%.\n\nMarket share of Bitcoin mining companies by hashrate. Source: TheMinerMag\n\nNotably, the PE ratio of most companies in the industry is between 0 and 2, except for Marathon, Hive and Hut 8. This raises alarms that these companies could be overvalued at their current valuations.\n\nPrice-to-earning ratio of top mining companies Source: CompaniesMarketCap.com\n\nA net loss position is no reason to reject a stock because markets are usually forward-looking. If one is long-term bullish on Bitcoin, the mining stocks are obvious choices. However, these companies must survive through the bear market before bearing the fruits of the next bull run.\n\nShareholders suffered losses due to bad debt and dilution\n\nOverleveraged or indebted firms that have to meet their interest obligations are particularly stressed and vulnerable to insolvency.\n\nMarathon, Greenidge and Stronghold have over $200,000 in debt per unit of Bitcoin mining, with Marathon’s debt peaking at $1.1 million per mined BTC. Marathon collateralized its loans with Bitcoin in its treasury, and the firm now holds 10,055 BTC worth around $235 million.\n\nBy the end of October, Marathon had$100 million in loans, which risks getting liquidated if Bitcoin’s price falls below the loan threshold value. For instance, if the loan threshold is 150%, the company will be forced to sell some of its BTC to clear the loans if Bitcoin price drops below $15,000.\n\nDebt per BTC produced by mining companies. Source: TheMinerMag\n\nIn this regard, it is encouraging to see that Hive, Hut8 and Riot are mostly debt-free and functioning essentially on equity capital. This reduces the pressure of paying interest rates on the debt and provides flexibility in raising funds or expanding by absorbing some of the market share left by now-bankrupt mining operations.\n\nHowever, there’s another way to raise funds. Instead of raising debt, miners can dilute their shares. The companies raise investment from public market investors in exchange for additional stock. This reduces the ownership ratio of shareholders. Hut 8 mining and Riot had diluted north of 40% of their shares by Q2 2022. Hut 8 diluted around 15% of shares again in the third quarter of the same year.\n\nShare dilution of public mining companies by Q2 2022. Source: Hashrate Index\n\nThe need to raise money has exposed these indebted companies to liquidation risks, while excess dilutions have also significantly reduced the value of investor holdings.\n\nRelated: Bitcoin miners’ worst days may have passed, but a few key hurdles remain\n\nMining company mandates on treasury holdings\n\nWhile mining companies are struggling with profitability, they are determined to conserve their Bitcoin treasury levels. Despite suffering losses since Q2 2022, Marathon was able to retain its treasury holding levels.\n\nMarathon’s Bitcoin Treasury holdings. Source: BitcoinTreasuries!Net\n\nAt the same time, Hut 8 mining uses a more aggressive policy in selling its mined BTC. This has led to a strong increase in its holdings since mid-2022.\n\n8Hut’s Treasury has increased since July 2021. Source: BitcoinTreasuries!Net\n\nWhereas others like Riot and Hive have resorted to using their BTC treasury to cover operational and expansion costs. Hive’s holdings have reduced significantly since the third quarter of 2022, from 4,032 BTC to 2,348 BTC. Hive is relying on the expansion of its miner fleet and cost reductions to sustain itself.\n\nClearly, Bitcoin mining companies remain vulnerable to BTC price, debt liquidations and shareholder losses due to excess dilution. According to on-chain analyst and Crypto Quant founder Ki Young Ju, 2023 will see entities taking over entire mining companies with a chance to buy them at a discount.\n\nWhile this won’t affect Bitcoin price much, mining stocks are still exposed to the threat of considerable losses.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMS8zMS9iaXRjb2luLWJhc2VkLWFwcC1zdHJpa2UtZXhwYW5kcy1pbi1waGlsaXBwaW5lcy10by1ncm93LWNyb3NzLWJvcmRlci1wYXltZW50LXNvbHV0aW9ucy_SAX1odHRwczovL3RlY2hjcnVuY2guY29tLzIwMjMvMDEvMzEvYml0Y29pbi1iYXNlZC1hcHAtc3RyaWtlLWV4cGFuZHMtaW4tcGhpbGlwcGluZXMtdG8tZ3Jvdy1jcm9zcy1ib3JkZXItcGF5bWVudC1zb2x1dGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin-based app Strike expands in Philippines to grow cross-border payment solutions - TechCrunch",
        "content": "Strike, a Bitcoin-based payment network and financial app, is expanding to the Philippines to grow cross-border payments and remittance markets.\n\n“The Philippines is one of the biggest remitting markets in the world, especially from the United States,” Jack Mallers, CEO of Strike, said to TechCrunch. In 2021, about $12.7 billion in cash remittances was sent from U.S.-based Filipinos to the Philippines, according to Statista data.\n\n“As far as the technology we build, it’s one of the lowest-hanging fruits — international payments are a huge pain and always have been. There’s been incremental innovation from SWIFT and Western Union, but it’s still incredibly difficult.”\n\nEven across Western countries, traditional cross-border money transfers services are slower as bank transfers can take multiple days for funds to move from one account to another.\n\nStrike uses instantaneous, low-cost micropayments through the Lightning Network, a layer-2 payment protocol on top of Bitcoin, which allows millions to billions of transactions per second to transpire across the platform. The app’s platform also allows users to transfer U.S. dollars to local fiat currencies, like the Philippine peso, for less than 1 cent per transaction through the network, Mallers noted.\n\n“None of our users have to touch Bitcoin,” Mallers said. The app uses Bitcoin to transfer money from one user’s account to another, regardless of its price. “The aspiration of the business is to hide Bitcoin under the hood” so users could benefit from its payment network, he added.\n\nFor example, if a customer wants to take $5 and send it to a country like the Philippines, the Bitcoin is converted over the Lightning Network and reconverted into the local currency “in the order of seconds to minutes as opposed to days or weeks,” Mallers said.\n\nAside from the Philippines, Strike plans on expanding further in the Latin American and African regions as well due to the “extreme amount of demand,” Mallers shared. “We’re seeing partners pop up all over the world.”\n\nNow, Strike is gaining demand and partners seeking out integrations from everywhere between the U.K. and throughout Europe all the way to “20 new countries we’ll potentially add in February in Africa,” Mallers added.\n\nEarlier this month, Strike partnered with payments provider Fiserv, the parent company of Clover (the fancy white digital register at many small businesses today), to expand its services.\n\nLast year, it raised $80 million in a Series B round to drive its efforts to grow payment solutions for merchants, marketplaces and financial institutions, the company said. Strike also joined forces with Visa in August 2022 to launch a rewards card that pairs with its application.\n\nIn general, the company’s partnerships and announcement point to its focus on growing the remittance market through its application and other alternative avenues, like Clover.\n\n“The goal is to make cross-border payments and global payments cheaper and faster,” Mallers said. “But also more accessible. There’s huge value here for financial inclusion.”\n\nSome Strike users will send amounts as little as 10 cents to their families, Mallers shared. But through a traditional financial system, the fees would outweigh the benefits, he added. “We can process a 10-cent payment…and you don’t have to log into Chase for an international wire transfer.”\n\nGoing forward, there are opportunities to improve the existing remittance markets while also unlocking new markets, he added. “You’ll start to see a renaissance of tools really closing that big delta gap and you’ll start seeing more financial institutions like Square and CashApp take advantage of this.”\n\nOver the next decade, Mallers thinks remittance networks and applications like Lightning and Strike will expand opportunities from the 2 billion to 3 billion people that are “generally included in the global international payments system” to all 8 billion.\n\n“That’ll be like a renaissance moment,” Mallers said. “It’s a really huge deal.”"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vc2FsdGFuZGxpZ2h0LnNnL21vbmV5L3doYXQtZG9lcy10aGUtYmlibGUtaGF2ZS10by1zYXktYWJvdXQtYmxvY2tjaGFpbi1iaXRjb2luLWFuZC10aGUtZGlnaXRhbC1lY29ub215L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "What does the Bible have to say about blockchain, bitcoin and the digital economy? - Salt & Light",
        "content": "Is cryptocurrency “the mark of the beast” that is related to the Antichrist mentioned in Revelation (Revelation 13:17)? Is blockchain biblical? What is the Christian to make of the digital economy?\n\nThese were questions about new wealth that Jason Lee addressed when he spoke at the N5 Conference 2022.\n\nN5 is short for Nehemiah 5, a part of the Bible which deals with economics and personal finance. The conference has been so named because it deals with biblical perspectives of personal wealth.\n\nIs cryptocurrency “the mark of the beast”?\n\nRunning on two consecutive years, the N5 Conference is the largest annual Kingdom-focused personal finance conference.\n\nDelegates from four countries came together over two days with Kingdom-minded business and ministry leaders to share their insights over more than 20 sessions.\n\nThe theme for the second conference was Arise and Build for Generations to Come.\n\nJason spoke on the topic Blockchain and the Bible. Jason is the Global Head of Community for the Algorand Foundation as part of the Algorand blockchain protocol. Algorand is an open-source, decentralised blockchain network.\n\nAn advocate for emerging technologies, Jason was on the Forbes 30 Under 30 Asia list in 2018.\n\nHe is a board member of the Lausanne Movement, an international organisation that aims to connect influencers and ideas for global mission. In addition, he stewards a community called Christians in Crypto and Blockchain Community.\n\nWhy should we care?\n\nCryptocurrency is an example of new wealth that is a “once-in-the-history-of-the-human-race kind of thing”, stated Jason.\n\n“We are here to learn about how we can be good stewards of our wealth, including cryptocurrency.”\n\nCurrently, 50% of the world is persistently connected to the Internet.\n\nIn 10 years’ time, 90% will be persistently connected.\n\nPeople are already starting to transact and live their lives online.\n\nVirtual traffic will only increase.\n\nPart of the transactions that takes place happens in the world of blockchain and much wealth will be generated from this.\n\n“We are here to learn about how we can be good stewards of our wealth,” said Jason.\n\nKey terms in the world of digital economy\n\nBlockchain\n\nBlockchain is a shared ledger of all transactions across a distributed peer-to-peer network, or computers and devices.\n\nIt is the equivalent of the centralised book-keeping of old where records of properties, taxes, births, marriages, stocks and debts were kept. An example of such records is the genealogy of Jesus, spanning over 42 generations all the way to Adam.\n\nIn the past, because the records were kept in physical books, they could be easily destroyed or lost. Blockchain addresses this problem with new technology that allows the records to be kept simultaneously across many computers.\n\nSo, even if one computer is destroyed, others exist to maintain the record. The idea is so powerful that blockchain has become a US$3 billion industry.\n\nBlockchain has become the infrastructure in which many applications take place. There are over 100 blockchains in the world and many of the world’s most recognised companies use blockchain technology.\n\nBitcoin\n\nThe most popular application of blockchain technology is bitcoin. Bitcoin is the world’s first successful decentralised cryptocurrency and payment system where you can buy, sell and exchange without an intermediary.\n\nIn a seminal white paper written by Satoshi Nakamoto, it was mentioned that there are 21 million bitcoins in the world which can be mined. 18-odd million have already been mined. Each time a bitcoin is mined, the person who mines it receives a cryptocurrency. Because the demand for bitcoin is so high, its value has also risen.\n\nDuring the pandemic, the value of bitcoin rose from US$6,000 to US$60,000. But cryptocurrency is very volatile. The value of bitcoin has since fallen to US$20,000.\n\nBitcoin is not the only cryptocurrency. There are others.\n\nCryptocurrency\n\nA cryptocurrency is a representative store of digital value that lives on a given blockchain. There are 13 to 15,000 cryptocurrencies. Crypto comes from the word cryptographic much like what is used in Morse code.\n\n“So, when you transfer cryptocurrency, there’s a level of pseudo-anonymity, meaning no one knows who is the owner. But you can track it because it’s on the blockchain.”\n\nWhile cryptocurrency is rising in popularity, it is but a fraction of the world stock market. The cryptocurrency market capitalisation, which is the total value of all the coins that have been mined, is US$1 trillion. The global stock market is a US$70-odd trillion industry.\n\nNFT\n\nA Non-Fungible Token is a digital asset that confers ownership of a virtual good that cannot be divisible. An NFT is like a cryptocurrency except that it cannot be broken up. Bitcoin, for example, can be divided up to eight times.\n\nNFTs can be anything from art to event tickets, music, gaming items and sports.\n\nThe NFT market was valued at US$11.3 billion in 2021. The sector is predicted to grow 33.7% over the next 10 years. As a result, there will be a lot of new wealth generated.\n\nDeFi\n\nDeFi is a financial system based on blockchain technology that reimagines transactions by removing intermediaries. This is a play on CeFi which is centralised financed where banks are needed as the go-between when you want to transfer money from one person or organisation to another.\n\nThe financial market size of DeFi is US$11 billion and it is expected to grow at a rate of 42.5% over the next 10 years.\n\nCryptocurrency Wallet\n\nTo transact in cryptocurrency, you will need a cryptocurrency wallet to store your cryptocurrencies. Every wallet comes with a password and a private key.\n\nWho holds the key determines the type of wallet you have. A hot wallet is one where a third party holds the key. A cold wallet is one where the owner holds his own keys.\n\nCryptocurrency Exchange\n\nA cryptocurrency exchange is a marketplace platform where cryptocurrencies can be bought, sold and exchanged. It is the third party in the hot wallet.\n\nThere are over 520 cryptocurrency exchanges in the world, many of which are regulated.\n\nWeb3\n\nWeb3 is the entire decentralised online ecosystem based on blockchain technology.\n\nIn the early days of the Internet, there was only Web 1.0 from the 1990s up to 2004. Then, we could only read what was on the web. With emails came the era of Web 2.0. We could not only can read but write and respond on the web.\n\nWeb 3.0, which started in 2014, allows us to read, write and own.\n\n“We are no longer users of products. Now, we have an opportunity to own a part of the network. When you own a cryptocurrency, you own a part of the network because the cryptocurrency lives on the blockchain.”\n\nShould we invest in cryptocurrencies?\n\nGiven the vast amount of wealth involved in the digital economy, should the Christian be involved? Should a Christian buy cryptocurrencies? Which cryptocurrency would make a worthwhile investment?\n\n“Cryptocurrency is at the top end of risks, alongside private investments in companies.”\n\nJason gave this advice: “There are three considerations when you are thinking about this.\n\n“One, your ability. Do you have the ability to learn and understand it? Two, your liquidity. Do you have money in the bank so you won’t fall into debt? Three, your suitability. This is a very high-risk profile.\n\n“Cryptocurrency is at the top end of risks, alongside private investments in companies.\n\n“Cryptocurrecny also has the VUCA element – volatility, uncertainty, complexity and ambiguity.\n\n“So, you need to take a lot more time to learn about it instead of jumping into it.”\n\nWhat does the Bible have to say about the digital economy?\n\n1. Stewardship over speculation\n\n“If Jesus was living with us in 2022, I have little doubt that Jesus would have told The Parable of the Bitcoin (Matthew 25:14-20),” said Jason to laughter amongst the audience.\n\n“What would Jesus do if He were a crypto native?”\n\nThere are three mentalities that we have to be aware of, continued Jason. The first is the Get-rich Quick Mentality which 1 Timothy 6:9-10 warn us against.\n\n“Cryptocurrency is a form of digital money,” said Jason, adding that he knows of Christians who got badly burnt in the cryptocurrency market and walked away from the Church as a result, as well as those who have gotten confused and have asked to learn what the Bible has to say about cryptocurrency.\n\nThe second is the Greed is Good Mentality which Luke 12:15 speaks against.\n\n“Now people are trying to define themselves by the possessions that they have, and the digital world and identity is linked to how they see the crypto space as well.\n\nFinally, there is the Trap of Debt Mentality (Proverbs 22:7). Don’t borrow to invest, warned Jason.\n\n2. Technology as a tool\n\nDrawing from the story of the Tower of Babel (Genesis 11:1-9), Jason talked about the power of collaborative effort.\n\n“Even the Lord acknowledged that when people collaborate, nothing is impossible for them (Genesis 11:6). That is why the US$1 trillion industry exists which did not exist before 2009.”\n\n“The hands that built the golden calf also built Israel. The question is: How can we use the technology as a tool?”\n\nBut the technology that has made all this possible has also resulted in workaholism for the people working in the cryptocurrency industry, hyper opportunities where people are constantly on the look-out for cryptocurrency investments and even criminal behaviour such as scams, frauds and unethical behaviour.\n\nAn example is the massive cryptocurrency scam by former FTX CEO Sam Bankman-Fried in 2022.\n\nTechnology is but a tool used to extend human capabilities, like any other tools, Jason pointed out. Cain built a city, Noah built an ark, the people built the Tower of Babel and King Solomon built the temple with tools. Jesus used tools as a carpenter. Paul used letters and numbers to write letters and those can be considered a type of tool.\n\nTools can be used for good or bad.\n\n“The same hands that built the Tower of Babel also caused the destruction that caused them to scatter. The hands that built the golden calf were also the ones that built Israel. The question is: How can we use the technology as a tool?”\n\n3. Bible over bitcoin\n\n“Follow Christ not crypto, the Bible not bitcoin,” said Jason.\n\n“Follow Christ not crypto, the Bible not bitcoin.”\n\n“As godly stewards of our money, we should not squander it even though we received it. We should say, ‘What would Jesus do if He were a crypto native?’”\n\nThere are some Christians in the cryptocurrency space who are passionate about seeing how God works in that space.\n\nOne such organisation is the Christians in Crypto and Blockchain Community, of which Jason is a part.\n\nThey have a WhatsApp group of some 175 people who communicate regularly and meet over Zoom to pray over major cryptocurrency events.\n\nIs bitcoin the one-world currency of Revelation 13?\n\n“We will never know. What we know is that if it is really true, then as Christians we should be part of something like this.\n\n“We should be light in the darkness, and we should know and understand the workings of this. So, I want to encourage you not to shun this but to look into this,” said Jason.\n\nHow should we view the power that comes with technology?\n\nThe power that technology affords us today is “God-like” in its proportions, says Jason.\n\nJesus knew of such limitless power. Yet, He chose to humble Himself even if it meant He had to die on the cross.\n\n“This Christian virtue of humility was actually revolutionary. In the language of tech, it is disruptive.\n\n“It is against the winner-takes-all, blitzscaling strategy, having first-mover advantage, building the next unicorn.\n\n“So, we do not need to become like God and choose all this technology because we have Someone who walked among us and has unparalleled power to be like God. So, I want to remind us to go back to Jesus when times are difficult for you with your personal finance, and in your quest to find financial success and stewardship.”\n\nIssues of concern\n\nThere were questions from the floor which Jason answered as well.\n\nIs investing in cryptocurrency a zero-sum game? If I invest in it, will I cause others to lose money?\n\n“See cryptocurrency as an extension of money. So, the question is the same as: Is the stock market a zero-sum game? Is investments into other opportunities a zero-sum game? It is as much a zero-sum game as any other investments.”\n\nAdmittedly, cryptocurrency is a lot more volatile and speculative. But it also moves in a cycle.\n\nIt has gone as low as US$1,200 and as high as US$60,000. So, as with all investments, research is important.\n\nCryptocurrencies have made it possible to be very rich, very quickly. What do you think of overnight millionaires?\n\n“Go back to the fundamentals. Be discipled. Jesus had his 12. We need discipleship particularly among those who are in the industry.\n\n“This form of discipleship has helped people to understand things better and to create faith-based crypto and blockchain applications to be light in the darkness,” said Jason.\n\nHow do you stop yourself from getting scammed in the crypto market?\n\n“As with traditional scams, ask people around you. Have a good close-knit community whom you can approach.\n\n“Do proper due diligence. Check with people you can trust,” said Jason.\n\nRELATED STORIES:"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmZpbnNtZXMuY29tLzIwMjMvMDEvaG93LWRpZC1iaXRjb2lucy1wcmljZS1jaGFuZ2UtZHVyaW5nLXRoZS1uZXcteWVhcnMtcGVyaW9kLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "How Did Bitcoin's Price Change During the New Year's Period? - FinSMEs",
        "content": "Bitcoin has not been in a very strong position throughout 2022, and now that the year has come to a close, many people are wondering what 2023 holds in store for the original cryptocurrency.\n\nBitcoin’s performance during the New Year’s period is of particular interest due to the fact that it may set the stage for the rest of the year, and as you are going to find out today, Bitcoin might finally be getting the break it needs.\n\nIn this article, we will be taking a look at the current BTC price and seeing how it changed throughout the New Year period, as well as extrapolating the results to give us an indication of what we might see from Bitcoin this year. Let’s get straight into it.\n\nImage by MichaelWuensch from Pixabay\n\nA Small But Noticeable Upwards Trend\n\nFor all of you bitcoin investors out there, we may have some good news. Over the New Year’s period, bitcoin experienced a small but noticeable increase in value, and this may give some evidence to suggest that 2023 is going to be a much better year for bitcoin when compared to 2022.\n\nOf course, there are no guarantees in investing – this should be a concept that you are more than familiar with if you have been in the investing scene for any reasonable length of time.\n\nThere are a plethora of factors that have had an impact on its price, and the fact that bitcoins value is currently on the rise after New Year might not be the ray of light that crypto investors are looking for.\n\nHowever, bitcoin’s current performance can certainly give a glimmer of hope to those who want to see bitcoin return to its former glory. Only time will tell whether or not this upwards trend will continue and whether it will break its previous ATH (All Time High)..\n\nAny Differences Are Not All That Impactful\n\nWhile bitcoin’s increase in value is most definitely going to be taken as a good omen by most, there are a few extra factors you need to consider before you start liquidating your portfolio. New Year has historically been an incredibly prosperous period for crypto as well as all investments, and the fact that bitcoin has seen a rise is only in line with most of its competitors.\n\nAlmost all of the top ranked cryptocurrencies experienced growth during the New Year period, as this is the time when people are the most likely to invest due to New Year’s resolutions and promises. That goes without even mentioning people’s general willingness to spend money during the New year’s holiday – this is one of the few times of the year when people just allow themselves to splurge.\n\nWhatever the reasoning may be, bitcoin’s growth is not as impressive as you may first suspect. You most definitely do not want to base any of your decisions when it comes to buying/selling bitcoin on the small increase in value it experienced during the New Year’s period.\n\nThe difference in value really is minuscule, and when you pair this with the fact that the vast majority of the reasons as to why bitcoin rose in value were nothing to do with bitcoin, it just becomes all the less significant.\n\nWhat Does This Mean For Investors?\n\nSo, what does bitcoin’s increase in value mean for you and I? Well, as we have already explained, not so much. Barring the several external factors that could have had a positive influence on bitcoin’s price, the value increase it experienced is still minuscule at best, and there is next to no evidence to suggest that bitcoins price increase was due to increased demand.\n\nHowever, just because the New Year’s period might have not impacted bitcoin as much as some would like is not to say bitcoin is in a bad position. On the contrary; bitcoin looks to be in much better shape when compared to the state it was in just a few months ago, and it seems as though the upwards trend it is currently on might be set to stay.\n\nWhile we can never say for sure what the markets have in store, bitcoin is looking incredibly promising in the early months of 2023. we can’t wait to see where it ends up.\n\nWe hope we have been able to give you a better insight into how Bitcoin’s price changed over the New Year’s period. While any changes are minimal, there certainly is an upwards trend taking place with bitcoin’s value, and this may be able to give us an indication that bitcoin is finally beginning to gain the investor confidence it needs.\n\nHowever, to play devil’s advocate; there are numerous reasons why bitcoin’s price went up, most of which have nothing to do with bitcoin at all. Most cryptos saw an increase in value over the new year period and bitcoin was already in green before New Year’s came, meaning this period might have had little to no effect on price.\n\nWe will just have to wait and see to find out if bitcoin is on the road to recovery. There just isn’t enough data on hand to suggest that Bitcoin’s value increase over New Year’s is of any significance."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8zMC9iaXRjb2luLXN1aXNzZS1jaGFpcm1hbi1zYXlzLWV1LXdvbnQtYmFuLWNyeXB0by1idXQtaXQtbWF5LXNlZWstdG8tY29udGFpbi1pdC_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDEvMzAvYml0Y29pbi1zdWlzc2UtY2hhaXJtYW4tc2F5cy1ldS13b250LWJhbi1jcnlwdG8tYnV0LWl0LW1heS1zZWVrLXRvLWNvbnRhaW4taXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Suisse Chairman Says EU Won’t Ban Crypto, but It May Seek to Contain It - CoinDesk",
        "content": "As part of the Committee's rules, it would also mean that crypto would not be recognized as collateral, Meisser said, making it more difficult for a bank to issue a client a loan in the future for example. Doing so would only give banks the runway to store crypto for their clients, he said."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLTctbW9udGgtaGlnaC1kb21pbmFuY2UtaGFzLWJ0Yy1wcmljZS1leWVpbmctMjVrLXdpbGwtZXRoZXJldW0tc3BvaWwtdGhlLXJhbGx50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin 7-month high 'dominance' has BTC price eyeing $25K — Will Ethereum spoil the rally? - Cointelegraph",
        "content": "Bitcoin (BTC) is rapidly regaining its lost dominance in the crypto market so far into 2023.\n\nOn Jan. 30, Bitcoin accounted for 44.82% of the total crypto market capitalization, the highest since June. In September, Bitcoin’s dominance index was as low as 38.84%.\n\nThe index typically rises when most crypto investors reduce their exposure to smaller tokens and seek safety in Bitcoin. The reasons include Bitcoin’s better liquidity and lower volatility than alternative cryptocurrencies, or altcoins, primarily in a bear market.\n\nBitcoin’s market dominance to grow further?\n\nAs of Jan. 31, Bitcoin is up 38% year-to-date at around $23,000. In comparison, the second-largest cryptocurrency, Ether (ETH), gained 30% in the same period, showing most investors remain gravitated toward Bitcoin so far in 2023.\n\nFrom a technical perspective, the Bitcoin dominance index may rise further in the coming weeks as it reclaims its 50-week exponential moving average (the red wave in the chart below) as support.\n\nBitcoin dominance index weekly performance chart. Source: TradingView\n\nIn doing so, the index could rise toward 48.5%, which has acted as resistance since May 2021.\n\nOn the other hand, independent market analyst Rekt Capital sees the Bitcoin dominance index rising toward 46%, which coincides with the upper trendline of a giant descending channel pattern, as shown in the monthly-timeframe chart below.\n\nBitcoin dominance index monthly performance chart. Source: TradingView, Rekt Capital\n\nThe short-term bullish scenario in the Bitcoin dominance index chart appears in line with a similar upside in the spot Bitcoin market, with bulls eyeing a run-up toward $25,000.\n\nThe strength of #bitcoin on the 4-hour charts continues to be impressive.\n\n\n\nWhile price action has trended sideways for over a week, short term indicators (MACD, RSI) have once again reset... and are now ramping higher.\n\n\n\nA price surge to ~$25k is probable.\n\n\n\n(Not investment advice) pic.twitter.com/QaPbNrxtxZ — Dr. Jeff Ross (@VailshireCap) January 29, 2023\n\nEthereum vs. Bitcoin the main driver of BTC dominance\n\nThe bearish argument is that the Bitcoin dominance index may start losing its upside momentum after testing its descending channel resistance, as it had done on several occasions in the recent past.\n\nRelated: Bitcoin sees most long liquidations of 2023 as BTC price tags $22.5K\n\n“Bitcoin Dominance is further overextending beyond red on the Monthly TF,” noted Rekt Capital, while citing the index’s horizontal trendline support near 44.11%. The analyst adde:\n\n“A Monthly Close above red could set BTCDOM for another dip into red which would benefit Altcoins.\"\n\nBitcoin dominance index monthly price chart (zoomed). Source: TradingView, Rekt Capital\n\nThe above analysis appears as ETH eyes a potential bullish reversal versus Bitcoin in the coming weeks.\n\nNotably, the ETH/BTC pair has been consolidating near its support area (purpled) inside the 0.0676- 0.0655 BTC range since Jan. 24.\n\nETH/BTC daily price chart. Source: TradingView\n\nThe ETH/BTC pair will likely see a rebound rally toward its descending trendline resistance (blacked) around 0.075 BTC if it continues to hold the support area. That, in turn, would reduce Bitcoin’s dominance in the cryptocurrency market as Ether’s share would rise toward 20%.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXBvaXNlZC1mb3ItYW5vdGhlci1hdHRhY2stb24tMjRrLWFzLXRyYWRlci1wcmVkaWN0cy1iZWFyaXNoLWZlYnJ1YXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin poised for another attack on $24K as trader predicts 'bearish February' - Cointelegraph",
        "content": "Bitcoin (BTC) rose above $23,000 into the Jan. 31 Wall Street open as markets braced for a fresh macroeconomic reckoning.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nTrader: $25,000 “best case” for BTC/USD\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD gaining around 1% in a single hourly candle before the start of trading, overcoming resistance in place overnight.\n\nWith hours to go until the monthly close, the pair remained around $800 short of its weekend highs, which, at $23,950, marked Bitcoin’s strongest performance since mid-2022.\n\nInspecting the status quo, however, traders were unconvinced that the largest cryptocurrency would produce further gains in February.\n\nJanuary had produced upside of over 40%, making it Bitcoin’s best first month of the year since 2013.\n\n“Another high up to $25,000 is the absolute best case for me on Bitcoin,” popular trader Crypto Tony told Twitter followers on the day.\n\nHe added that he expected a “bearish February” with price targets of $21,400 and even $19,000.\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nCrypto Tony also referenced the U.S. dollar, which spiked to two-week highs on the day to continue a four-day uptrend. The U.S. Dollar Index (DXY) is traditionally inversely correlated with crypto markets.\n\nOn that note, fellow trader and analyst Scott Melker, known as “The Wolf Of All Streets,” focused on the weekly candle close of the S&P 500 after the index closed above its 50-week moving average for the first time since April last year.\n\n“SPY closed a weekly candle above the 50 MA for the first time since April. Currently testing it as support, with FOMC coming tomorrow and a volatile week likely. Watch the close on Friday,” he tweeted on the day.\n\nU.S. dollar index (DXY) 1-day candle chart. Source: TradingView\n\nBitcoin evokes run-up to all-time highs\n\nFormal analysis from on-chain analytics firm Glassnode nonetheless steered clear of predictions for next month.\n\nRelated: Best January since 2013? 5 things to know in Bitcoin this week\n\nIn the latest edition of its weekly newsletter, “The Week On-Chain,” analysts focused on the significance of January as the month that Bitcoin came back to life.\n\n“As the end of January approaches, Bitcoin markets have seen the strongest monthly price performance since Oct-2021, fueled by both historic spot demand, and a sequence of short squeezes, it summarized.\n\n“This rally has brought a large portion of the market back into profit, and resulted in futures markets trading at a healthy contango. We also note that initial impulse of exchange outflows, in the aftermath of FTX have calmed to neutral, and are now balanced by newly motivated inflows.”\n\nAs Cointelegraph reported earlier, various sources believe that Bitcoin’s rally is already coming to an end.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZXh0ZW5kLWdhaW5zLXNvbGFuYS1sZWFkcy_SAUFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWV4dGVuZC1nYWlucy1zb2xhbmEtbGVhZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether extend gains; Solana leads among top 10 - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5zY21wLmNvbS95cC9kaXNjb3Zlci9uZXdzL2Vudmlyb25tZW50L2FydGljbGUvMzIwODM5Ni9ob3QtdGVjaC1ob3ctYml0Y29pbi1taW5pbmctc2VydmVycy1hcmUtaGVscGluZy10dWxpcHMtZ3Jvdy1ncmVlbmhvdXNlLW5ldGhlcmxhbmRz0gGUAWh0dHBzOi8vYW1wLnNjbXAuY29tL3lwL2Rpc2NvdmVyL25ld3MvZW52aXJvbm1lbnQvYXJ0aWNsZS8zMjA4Mzk2L2hvdC10ZWNoLWhvdy1iaXRjb2luLW1pbmluZy1zZXJ2ZXJzLWFyZS1oZWxwaW5nLXR1bGlwcy1ncm93LWdyZWVuaG91c2UtbmV0aGVybGFuZHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Hot tech: how bitcoin mining servers are helping tulips grow - YP",
        "content": "In a giant greenhouse near Amsterdam, Dutch engineer Bert de Groot inspects six bitcoin miners as they perform complex sums to earn cryptocurrency, filling the air with a noisy whine along with a blast of warmth.\n\nThat warmth is heating the hothouse where rows of tulips grow, cutting the farmers’ reliance on gas. Gas has become more expensive since Russia invaded Ukraine.\n\nThe servers in turn are powered by solar energy from the roof, reducing the normally huge electricity costs for mining, and cutting the impact on the environment.\n\nMeanwhile, both the farmers and de Groot’s company, Bitcoin Brabant, are earning cryptocurrency. “We think with this way of heating our greenhouse but also earning some bitcoin we have a win-win situation,” flower farmer Danielle Koning, 37, told Agence France-Presse.\n\nBrain Game: How would you explain cryptocurrency to someone from the 70s?\n\nThe Netherlands is the world’s biggest tulip producer and also the second biggest agricultural exporter overall after the United States, with much grown in greenhouses.\n\nBut the low-lying country is keenly aware of the agricultural industry’s effect on climate change, while farmers are struggling with high energy prices. According to Koning, huge energy costs have driven some Dutch agricultural firms that often rely on greenhouses to stop growing, while others have even gone bankrupt.\n\nOn the other hand, mining for cryptocurrency requires huge amounts of electricity to power its computers (see graphic), leading to a massive environmental impact amid global efforts to tackle climate change.\n\nDe Groot, 35, started his business last year. Now, he has 17 clients including restaurants and warehouses. He said bitcoin and tulips were a perfect fit for each other.\n\n“This operation is actually carbon negative, as are all the operations I basically build,” said the long-haired de Groot, sporting an orange polo shirt with his firm’s logo. “We’re actually improving the environment.”\n\nThe tulip collaboration started when Koning saw a Twitter video that de Groot had made about bitcoin mining, and called him up.\n\nYoung Egyptians battle plastic pollution by recycling waste into bricks\n\nNow there are six servers at their greenhouse – Koning asked to keep the exact location a secret to avoid thieves targeting the HK$124,000 machines.\n\nKoning’s company owns half of them and keeps the bitcoin they produce, while de Groot is allowed to keep his three servers there in exchange for monthly visits to clean dust and insects out of the servers’ fans.\n\nWith a 20-degree Celsius difference between the air entering the machine and leaving them, this provides the heat needed to grow the tulips and dry the bulbs that produce them.\n\n“The most important thing we get out of it is, we save on natural gas,” said Koning. “Secondly, well, we earn bitcoin by running them in the greenhouse.”\n\nAgence France-Presse\n\nBert De Groot uses his smartphone to show graphics that represent the bitcoin miners’ activity. Photo: AFP\n\nWhat else makes cryptocurrency mining bad for the environment?\n\nBesides generating heat, cryptocurrency mining produces large amounts of carbon dioxide and e-waste, while also consuming excess water.\n\nAccording to research published in 2019 in the journal Joule, bitcoin mining alone produces 22 to 22.9 million metric tons of carbon dioxide emissions in a year. This is equivalent to the carbon emissions generated by 2.6 to 2.7 billion homes in one year.\n\nGreenidge Generation is a former coal power plant in New York that switched to natural gas and began bitcoin mining. Based on an article published by Columbia Climate School, when Greenidge became one of the largest cryptocurrency mines in the US, its greenhouse gas emissions increased almost tenfold between 2019 and 2020.\n\nPower plants such as Greenidge also consume large amounts of water to help them cool down. Greenidge draws up to 526 million litres of fresh water out of Seneca Lake each day. The water it discharges back into the lake is hotter than the lake’s average temperature, endangering wildlife.\n\nThere is also the problem of e-waste, or discarded electronic appliances. To be competitive, miners need to use the most efficient hardware. However, this becomes obsolete about every 1.5 years and cannot be used for other purposes, adding to the world’s existing e-waste problem."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNlZXMtbW9zdC1sb25nLWxpcXVpZGF0aW9ucy1vZi0yMDIzLWFzLWJ0Yy1wcmljZS10YWdzLTIyLTVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin sees most long liquidations of 2023 as BTC price tags $22.5K - Cointelegraph",
        "content": "Bitcoin (BTC) swapped bullish gains for chop into Jan. 31 as the end of the month saw nervous price action.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n$46 million of longs liquidated\n\nData from Cointelegraph Markets Pro and TradingView tracked a less confident BTC/USD as it briefly wicked to just above $22,500 on Bitstamp overnight.\n\nA rebound saw the pair flip $23,000 to short-term resistance, and was still trading below that level at the time of writing.\n\nThe stakes remained high for traders, long and short, with the monthly close just hours away. This was followed by interest rate decisions from the United States Federal Reserve on Feb. 1, along with the European Central Bank a day later.\n\nWith volatility likely lying in wait, liquidations mounted despite Bitcoin maintaining a fairly narrow trading range.\n\nThe trip to $22,500 sparked $46 million of long liquidations on Jan. 30, which according to data from Coinglass was the highest daily total of 2023 so far.\n\nBitcoin liquidations chart. Source: Coinglass\n\nFurther data from on-chain analytics resource Material Indicators meanwhile highlighted the tense situation on the Binance order book.\n\nBid and ask liquidity remained in flux, with incremental shifts up and down having a tangible impact on BTC price trajectory. Bids just below $22,000 and asks at $24,000 kept BTC/USD in check.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\n“It’s worth noting that this is the same block of bids that have been pushing BTC price for weeks and because it’s prone to move, could end up getting rugged,” Material Indicators commented in a Twitter thread on Jan. 30.\n\nContinuing, the analysis said that the location of the liquidity was “no coincidence,” singling out Bitcoin’s old all-time high from 2017 as a “last stand” support zone should current levels fail to hold.\n\nBTC/USD annotated chart. Source: Material Indicators/ Twitter\n\nCrypto traders stem “dry powder\" inflows\n\nCatalysts for a Bitcoin and altcoin comedown had already been mounting at the week’s Wall Street open.\n\nRelated: Best January since 2013? 5 things to know in Bitcoin this week\n\nU.S. equities lost ground on Jan. 30, with marketwide nerves over the Fed showing themselves in decreased risk appetite.\n\nThis was also conspicuous on crypto exchanges as stablecoin deposits cooled, reducing what one analyst called “dry powder” available for deployment into crypto assets.\n\n“Right now there is a negative correlation between price and stablecoin deposits. Of course, this is not the only one indicator which we need to check but Fed meeting will be held within this week and we also see this negative correlation,“ Kripto Mevsimi, a contributor to on-chain analytics platform CryptoQuant, summarized in a blog post.\n\n“We can expect high volatility within this week however we need to be careful since there is not much dry powder coming into exchanges anymore.“\n\nAn accompanying chart showed a divergence in stablecoin deposits relative to BTC/USD growth in the second half of January.\n\nBTC/USD vs. stablecoin deposits chart (screenshot). Source: CryptoQuant\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXBhcmVzLXdlZWtlbmQtZ2FpbnMtYXMtYW5vdGhlci1jbWUtZ2FwLWx1cmtzLWJlbG93LTIwa9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price pares weekend gains as another CME 'gap' lurks below $20K - Cointelegraph",
        "content": "Bitcoin (BTC) struggled to maintain bullish momentum on Jan. 30 as the countdown to the monthly close kept the market nervous.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC price sees flash dip below $23,000\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD coming off its latest highs at just below $24,000 on the day.\n\nThese, while Bitcoin’s best performance for nearly six months, encountered problems with staying power as the week began, with pre-Wall Street trading seeing a brief trip below $23,000.\n\nAt the time of writing, Bitcoin traded at around $23,250 as United States equities limped into the final few days of January.\n\nAmong the topics of interest for analysts was the CME Bitcoin futures gap from the weekend getting swiftly “filled” by spot.\n\n“Gaps” in the futures chart often act as a short-term price magnet for spot once futures markets reopen after weekends. Another remained open between roughly $19,970 and $20,530.\n\n“CME gaps filled and overshooting now bc of Equity futures being negative,” popular trader John Wick wrote in his latest Twitter update.\n\n“We’re in for a wild week!”\n\nCME Bitcoin futures 1-hour candle chart. Source: TradingView\n\nAnalytics resource Material Indicators, meanwhile, focused on order book activity on Binance, with longs and shorts potentially signaling upward continuation.\n\n“Sometimes looking at leveraged assets on binance can give clues to what is happening with the underlying. BTCDOWN is at resistance and BTCUP is approaching support,” commentary on a chart of longs and shorts stated.\n\n“Things don’t have to play out as these charts indicate, but so far they correlate with current BTC PA.”\n\nBTC/USD longs/short charts (Binance). Source: Material Indicators/Twitter\n\nBitcoin analyst “not convinced”\n\nOn whether Bitcoin would make good on weeks of upside before the monthly close, others were far from confident.\n\nRelated: Best January since 2013? 5 things to know in Bitcoin this week\n\nAmong them was Crypto Ed, who, in a note to followers, said that he was “not convinced yet” over Bitcoin’s overall strength.\n\nBTC/USD annotated chart. Source: Crypto Ed/Twitter\n\nAn accompanying chart presented a possible retest of $22,000 as a downside target.\n\nAs Cointelegraph reported, the area around $25,000 had constituted a significant cloud of resistance for Bitcoin, being an area of significant potential short liquidations.\n\nThat price nonetheless remained a popular target should bulls recover their firepower.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90b3AtNS1iaXRjb2luLWRvY3VtZW50YXJpZXMtdG8tYWRkLXRvLXlvdXItd2F0Y2hsaXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Top 5 Bitcoin documentaries to add to your watchlist - Cointelegraph",
        "content": "Bitcoin documentaries play an important role in educating and informing the public about the cryptocurrency space. They can help to demystify complex concepts and technology, making them more accessible to a wider audience. Additionally, documentaries can provide a historical perspective on the development of Bitcoin (BTC) and the cryptocurrency industry, helping to contextualize current events and trends.\n\nBy highlighting the potential benefits and drawbacks of Bitcoin and other cryptocurrencies, documentaries can also contribute to public discourse and decision-making. They can also help to raise awareness of issues, such as financial inclusion, privacy and security, which are vital considerations for the future of the cryptocurrency space.\n\nFurthermore, Bitcoin documentaries can serve as a tool for advocacy, helping to promote the adoption and acceptance of BTC and other cryptocurrencies among individuals, businesses and governments.\n\nHere are five Bitcoin documentaries to add to your watchlist:\n\n“The Rise and Rise of Bitcoin” (2014)\n\nThe Rise and Rise of Bitcoin is a 2014 documentary film that explores the history and development of Bitcoin and the cryptocurrency industry. The film covers the early days of Bitcoin, including the mysterious creation of the first Bitcoin by the pseudonymous Satoshi Nakamoto and the subsequent emergence of the Bitcoin community.\n\nThe documentary also features interviews with key figures in the Bitcoin industry, including entrepreneurs, developers and investors, who provide insight into the technology, culture and potential of Bitcoin. The film examines the ability of Bitcoin to disrupt traditional financial systems, as well as the challenges and risks associated with the use of the digital currency.\n\nThe Rise and Rise of Bitcoin also covers the early days of the cryptocurrency industry, including the Mt. Gox hack and the emergence of other cryptocurrencies. It also looks at the growing interest in BTC from mainstream businesses and investors, as well as the increasing government scrutiny of the cryptocurrency space.\n\nI just watched the 2014 documentary \"The Rise and Rise of Bitcoin\" for the first time.\n\n\n\nCharlie takes orders at BitInstant. Mark shows off Mt. Gox's servers. Vitalik writes for Bitcoin Mag. Erik sells SatoshiDICE. Brian & Fred found Coinbase. BTC runs up to $100.\n\n\n\nWhat a trip. — Jake Chervinsky (@jchervinsky) January 18, 2021\n\n“Bitcoin: The End of Money as We Know It” (2015)\n\nBitcoin: The End of Money as We Know It is a 2015 documentary film that examines the impact of BTC on the global financial system and the potential implications for the future of money. The film explores the features of Bitcoin that make it different from traditional currencies, such as its decentralized nature and the use of blockchain technology.\n\nThe documentary also looks at the potential of Bitcoin to democratize finance by providing access to financial services to individuals and businesses that are currently unbanked or underbanked. It also explores the potential for Bitcoin to disrupt traditional financial systems, such as banks and governments, and the implications of this for privacy, security and monetary policy.\n\nRelated: What is the economic impact of cryptocurrencies?\n\nThe film features interviews with experts in the field, including Bitcoin developers, entrepreneurs and academics, who provide insight into the technology, economics and politics of Bitcoin. It also includes footage from conferences, meetups and other events that highlight the growing interest in Bitcoin and other cryptocurrencies.\n\n“Banking on Bitcoin” (2016)\n\nBanking on Bitcoin is a 2016 documentary film that takes a closer look at the early days of BTC and the people who helped shape its development. The film covers the creation of Bitcoin by the pseudonymous Satoshi Nakamoto and the subsequent emergence of the Bitcoin community. It also covers the first-ever Bitcoin transaction, the first Bitcoin exchange, and the rise and fall of the first BTC marketplaces, such as the now-defunct Mt. Gox.\n\nThe documentary includes interviews with prominent Bitcoin industry professionals, such as business owners, programmers and investors, who offer their perspectives on the technology, culture and future of Bitcoin. Along with the rising interest in BTC from established firms and investors, it also discusses the legal and regulatory difficulties the Bitcoin industry is currently facing.\n\nThe film provides a comprehensive look at the early days of Bitcoin, from its creation to its rise as a global phenomenon. It also covers the challenges faced by the BTC community and the industry in the early days, including hacking, thefts and regulatory issues.\n\nWatching “Banking on Bitcoin”, a 2016 Documentary. I have watched It many times. It’s so interesting to see what people were thinking six years ago. It’s available on @peacockTV. #Bitcoin pic.twitter.com/TOIrZItqu3 — Kenneth Čuzelis ₿ (@cuzelis) June 1, 2022\n\n“Magic Money: The Bitcoin Revolution” (2017)\n\nMagic Money: The Bitcoin Revolution is a 2017 documentary film that explores the potential of Bitcoin and other cryptocurrencies to disrupt the traditional financial system. The film looks into the characteristics of Bitcoin that set it apart from other forms of money, namely its decentralized structure and usage of blockchain technology.\n\nThe documentary discusses both Bitcoin’s potential advantages, such as financial inclusiveness and the ability to avoid conventional financial intermediaries, and disadvantages, such as a lack of regulation and the possibility of illicit activity. It also examines how investors and corporations in established industries are becoming more interested in Bitcoin and other cryptocurrencies, as well as how governments are becoming more involved in the cryptocurrency industry.\n\nThe film features interviews with experts in the field, including Bitcoin developers, entrepreneurs and academics, who provide insight into the technology, economics and politics of Bitcoin. It also includes footage from conferences, meetups and other events that highlight the growing interest in BTC and other cryptocurrencies.\n\n“Cryptopia: Bitcoin, Blockchains and the Future of the Internet” (2018)\n\nCryptopia: Bitcoin, Blockchains and the Future of the Internet is a 2018 documentary film that examines the potential of blockchain technology and its impact on the future of the internet. The film explores the features of blockchain technology, such as its decentralized nature, security and transparency, and how it can be used to create new decentralized applications and services.\n\nThe documentary covers various use cases for blockchain technology, such as cryptocurrency, supply chain management and voting systems. It also looks at the potential implications of blockchain technology for industries such as finance, healthcare and the sharing economy. The film also examines the challenges faced by blockchain technology, such as scalability, regulation and energy consumption.\n\nRelated: Five major challenges in the blockchain industry\n\nThe movie includes discussions with professionals in the industry, such as blockchain technologists, business owners and academics, who offer their perspectives on the technology, its potential and its present difficulties. Additionally, it contains videos from conferences, get-togethers and other occasions that demonstrate the rising popularity of blockchain technology and its potential influence on the future."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1yZXZlbnVlLWp1bXBzLXVwLTUwLXRvLTIzbS1pbi1vbmUtbW9udGjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining revenue jumps up 50% to $23M in one month - Cointelegraph",
        "content": "As Bitcoin (BTC) shows a minor bull run, the connected mining ecosystems’ year-long struggle for survival has started to pay off. In the first month of 2023, the Bitcoin mining community experienced a 50% increase in revenue through mining rewards and transaction fees.\n\nOn Dec. 28, 2022, Bitcoin mining revenue dipped to $13.6 million for the first time since October 2020. This, coupled with rising energy prices amid geopolitical tensions, imposed tremendous financial pressure on mining companies, forcing some to shut down.\n\nAs Bitcoin remains well-positioned for a steady recovery, the mining industry witnessed a 50% growth in revenue in terms of U.S. dollars, as shown below.\n\nBitcoin mining revenue increased by 50% in January 2023. Source: Blockchain.com\n\nBitcoin mining revenue jumped from $15.3 million on Jan. 1 to nearly $23 million in the span of 30 days.\n\nAs more miners join to power and secure the decentralized Bitcoin network, the hash rate continues to reach new all-time highs. At the time of writing, the Bitcoin hash rate stood at around 300 exahashes-per-second.\n\nRelated: Bitcoin stays out of fear for 11 straight days as price tips near 24K\n\nOne of the biggest criticism of Bitcoin remains the high energy requirement for running the proof-of-work consensus mechanism. In October 2022, Cointelegraph reported that Bitcoin witnessed a 41% increase in energy consumption year-on-year.\n\nHowever, a drive for sourcing greener energy to power Bitcoin mining facilities aims to solve the predicament. A mining company recently tapped into a source of stranded energy in Malawi, a landlocked country in southeastern Africa.\n\n1600 families connected to this remote hydro minigrid in the mountains of southern Malawi. They have 50kW of stranded energy that we are testing out as a new Bitcoin mining site.\n\n\n\nVideos for context.\n\n\n\nStill working on venting, wiring, etc. pic.twitter.com/Sxf8ABGPWH — Gridless (@GridlessCompute) January 21, 2023\n\nAs Cointelegraph reported, the project — undertaken by Gridless — uses 50 kilowatts of stranded energy to test out as a new Bitcoin mining site.\n\nSpeaking about the overall impact of the initiative, Erik Hersman, co-founder and CEO of Gridless, stated, “The power developer had built these powerhouses a few years ago, but they weren’t able to expand to more families because they’re barely profitable and couldn’t afford to buy more meters to connect more families. So, our deal allowed for them to immediately buy 200 more meters to connect more families.”\n\nIn addition, the environmental footprint of the Bitcoin mining facility is low as it runs purely off river-based hydropower."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9icmljcy1jaGFsbGVuZ2VzLXUtcy1kb2xsYXItY2FuLWl0LWhhdmUtYW4taW1wYWN0LW9uLWJpdGNvaW4tYXMtd2VsbC_SAV9odHRwczovL2FtYmNyeXB0by5jb20vYnJpY3MtY2hhbGxlbmdlcy11LXMtZG9sbGFyLWNhbi1pdC1oYXZlLWFuLWltcGFjdC1vbi1iaXRjb2luLWFzLXdlbGwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "BRICS challenges U.S. dollar, can it have an impact on Bitcoin as well? - AMBCrypto News",
        "content": "Bitcoin may be thrust into unchartered territory as BRICS challenges the U.S. dollar.\n\nAssessing the potential outcome for Bitcoin if BRICS succeeds.\n\nAn interesting thing is happening in the global arena and it might just be one of the major factors that may influence Bitcoin demand later this year. A battle is being waged against the dollar and this might challenge its global reserve status.\n\nHow many are 1,10,100 BTCs worth today?\n\nGeopolitical tensions are also taking the battle to the economic front. Russia and China are in joint efforts to roll out a new common global currency called BRICS in alliance with numerous other nations.\n\nGeopolitical tensions are also taking the battle to the economic front with BRICS as an alternative for the dollar. This development can potentially cause a massive impact globally but what does this mean for Bitcoin?\n\nIf BRICS catches on and manages to attract more countries, then the U.S. dollar might lose its grip as the global reserve currency.\n\nSuch an outcome can potentially put the dollar on the fast lane to lose even more value. Bitcoin might enjoy higher demand as people embrace other means of holding value.\n\nThe USD may also face more pressure and less demand from investors due to the current debt situation and recession fears.\n\nMeanwhile, Bitcoin is about to conclude a bullish first month of 2023. And so far those addresses that have been buying seem to be holding on to their coins. Glassnode Alerts confirmed this about Bitcoin supply activity;\n\n? #Bitcoin $BTC Amount of Supply Last Active 1d-1w (1d MA) just reached a 1-month high of 490,925.339 BTC Previous 1-month high of 489,165.093 BTC was observed on 23 January 2023 View metric:https://t.co/8VrSovS3cQ pic.twitter.com/wkSBnBxxeF — glassnode alerts (@glassnodealerts) January 29, 2023\n\nBitcoin’s volatility index pivoted in favor of the upside since 20 January. This suggests that Bitcoin might be headed for more volatile price movements at the start of February.\n\nThe resurgence of confidence in Bitcoin bulls is perfectly timed to absorb some of the liquidity from the greenback outflows.\n\nBitcoin has so far demonstrated resilience against the downside. Its latest rally confirms the strong demand and low sell pressure as investors opt to hold on to their coins.\n\nThis allowed BTC to push closer to the $24,000 price range. It traded at $23750 at press time.\n\nCan BRICS take advantage of Bitcoin from a blockchain perspective?\n\nThere have been reports claiming that banks in BRICS member states are exploring potential blockchain implementation.\n\nWhile this may still be within the realm of speculation, it might be a strong move for BRICS member countries.\n\nThis is good news for Bitcoin because it will underscore robust efficiency and speed. It would not only offer BRICS a competitive advantage but also make it easier to use as a reserve.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nNot going the blockchain route will likely put BRICS at a disadvantage now that more countries are exploring this technology.\n\nBTC may get to interact with BRICS on its home turf. The potential implications may turn out quite interesting, especially for Bitcoin’s long-term outlook."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY3J5cHRvLW5hcnJhdGl2ZXMtYW5kLXRoZS1iaXRjb2luLWFudGktbmFycmF0aXZlL9IBZGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY3J5cHRvLW5hcnJhdGl2ZXMtYW5kLXRoZS1iaXRjb2luLWFudGktbmFycmF0aXZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Crypto Narratives and the Bitcoin Anti-Narrative - Finance Magnates",
        "content": "The word narrative is overused in crypto, and it might elicit a roll of the eyes if uttered in dialogue with a committed Bitcoin maxi. It refers to a story, in this case about a coin, protocol or product, that will drive attention and attract buyers.\n\nYou could argue that rather than narratives, crypto needs concrete real-world utility, but still, when sentiment picks up and bullishness stirs for certain, the reality, whether we like it or not, is that narratives have a gravitational effect on incoming traders.\n\nAs for when crypto bullishness might return, opinion is split. Some observers reckon the early stirrings are already upon us, and that BTC’s recent price rise is indicative that the bottom has been reached and the cycle is rotating us into a fresh phase. Others, meanwhile, maintain that recent pumps are the result of an oversold market in which too many traders were positioned short, and don’t represent a meaningful shift in structure.\n\nEither way, it’s worth being ready for incoming storylines that can become prominent when bulls are back in control, and, regardless of whether or not we actually believe in them, we can already get an idea of what those narratives might be.\n\nKeep Reading Nigeria Presses Binance amid Economic Turmoil and Detains Executives\n\nCrypto Narrative and Bitcoin Anti-Narrative Explained\n\nArtificial Intelligence\n\nAt the tail-end of 2021, the metaverse was a hot topic, and accordingly, any coin that was connected via metaverse notions briefly rode the waves of that hype.\n\nWith the rise of ChatGPT, and with investment channeling into AI and Machine Learning Machine Learning Machine learning is defined as an application of artificial intelligence (AI) that looks to automatically learn and improve from experience without being explicitly programmed. Machine learning is a rapidly growing field that also focuses on the development of computer programs that can access data and use it learn for themselves.This has many potential benefits for most industries and sectors, including the financial services industry. Machine Learning ExplainedMachine learning can be explained Machine learning is defined as an application of artificial intelligence (AI) that looks to automatically learn and improve from experience without being explicitly programmed. Machine learning is a rapidly growing field that also focuses on the development of computer programs that can access data and use it learn for themselves.This has many potential benefits for most industries and sectors, including the financial services industry. Machine Learning ExplainedMachine learning can be explained Read this Term development, we can expect next time around that any crypto protocols related to AI will perform well. This has, in fact, already played out in miniature, with coins such as Fetch and AGIX experiencing gains while ChatGPT has dominated tech news, and that dynamic can perhaps play out more dramatically under bullish conditions.\n\nGaming and the Metaverse\n\nSpeaking of the metaverse, we should not imagine that it’s a bygone topic from an earlier cycle. Development continues on metaverse projects across several companies, including Yuga Labs, The Sandbox, Decentraland and Meta (formerly Facebook), and though media attention has shifted for the moment, there’s every chance that another bout of hype, hopefully with inviting products attached, will bubble up again in the future.\n\nGaming and metaverse coins, such as GALA and NAKA had strong runs in 2021, and that was without even having mainstream adoption to showcase. Should some genuinely enjoyable-to-use products start picking up momentum (and there is plenty of development on this front), then gaming can become a strong narrative.\n\nOn this note, another one to watch might be the TreasureDAO gaming ecosystem and its MAGIC token, operating on the Arbitrum network, which has stated that it wants to build a decentralized version of Nintendo.\n\nWatch this recent FMLS22 panel on reimagining the crypto market structure.\n\nDecentralized Storage and Oracles\n\nIf blockchains are to enable decentralized computing (and, as a caveat, not everyone agrees that this is the main purpose of crypto development), then there are practical considerations around how to store and recall data in a securely decentralized manner, and how to gather information from the web to be used in on-chain applications.\n\nStorage protocols deal with the issue of keeping and accessing files without the need for centralized entities and include the likes of Filecoin, Sia, Arweave and Storj. Robust permissionless storage is particularly relevant to NFTs, as, at the moment, while NFTs are crypto tokens, many simply link to image files kept on regular, centralized servers.\n\nThen there are Oracles, which are protocols to connect decentralized applications with the wider world by retrieving outside data for smart contracts. Leading the way is Chainlink, with projects such as Band Protocol and UMA also in the running.\n\nDecentralization should be at the core of the crypto discussion, it’s a fundamental driving concept, and if there’s a refocus on basic principles after the multiple wayward shambles of 2022, then achieving full decentralization, utilizing storage and oracles, could be prioritized.\n\nThe Bitcoin Anti-Narrative\n\nThere is also the anti-narrative of having no narrative at all, which is embodied most clearly, or perhaps uniquely, by Bitcoin. In this case, there is a refreshing simplicity: Bitcoin is sound money, digitally decentralized, for making payments Payments One of the bases of mediums of exchange in the modern world, a payment constitutes the transfer of a legal currency or equivalent from one party in exchange for goods or services to another entity. The payments industry has become a fixture of modern commerce, though the players involved and means of exchange have dramatically shifted over time.In particular, a party making a payment is referred to as a payer, with the payee reflecting the individual or entity receiving the payment. Most commonl One of the bases of mediums of exchange in the modern world, a payment constitutes the transfer of a legal currency or equivalent from one party in exchange for goods or services to another entity. The payments industry has become a fixture of modern commerce, though the players involved and means of exchange have dramatically shifted over time.In particular, a party making a payment is referred to as a payer, with the payee reflecting the individual or entity receiving the payment. Most commonl Read this Term, saving, and preserving wealth. It’s an attractive, no-nonsense proposition and doesn’t require any decorative elaboration.\n\nOther Stories\n\nOther niches and narratives are at play, some of which can gain traction. Among these, there are Layer 2s (Polygon and Arbitrum are notable), Ethereum competitors (Solana, Avalanche, Cardano and more), privacy coins (Monero is most prominent), and Cosmos present itself, ambitiously, as the internet of blockchains, which, as with TreasureDAO aiming to become the blockchain Nintendo, sounds compelling.\n\nIt’s also plausible that NFTs will, at some point, go on another run to match, or even exceed, that of 2021. Many seasoned crypto traders remained on the NFT sidelines last time, caught unawares by the sudden explosion of interest, and unsure what to make of what appeared, from a certain perspective, to be limited-supply meme coins with JPEGs attached.\n\nNFTs have established themselves more robustly since then, some projects are building prolifically, and there is a better understanding of what they are and how they can perform. In fact, if buyers are searching for crypto utility and crossover appeal, it may even be NFTs that can lead the way."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy92YWxreXJpZS13Z21pLWJpdGNvaW4tbWluZXJzLWV0Zi0xNTI4NDQ1MDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Valkyrie's WGMI Bitcoin Miners ETF named best-performing U.S. fund, surges 105% in 2023 - Yahoo Finance",
        "content": "Valkyrie’s Nasdaq-listed Bitcoin Miners exchange-traded fund (ETF), WGMI, has been the best-performing U.S. fund of 2023 so far, rising over 105% in January.\n\nSee related article: U.S.’ first nuclear-powered Bitcoin mining center to open in Q1\n\nFast facts\n\nWGMI’s January rally puts it roughly 25% ahead of the second-best performer, according to Bloomberg.\n\nWGMI, a popular acronym for “We’re Gonna Make It” among crypto traders, tracks the performance of cryptocurrency mining companies. The fund has Hive Blockchain Technologies Ltd, Digihost Technology Inc., Bitfarms Ltd, Marathon Digital Holdings Inc., Riot Platforms Inc. and Hut 8 Mng Corp. in its holdings.\n\nWGMI opened Monday’s trading day at US$9.14 on Monday, which is 66% lower than its all-time high of US$26.68 set in February 2022.\n\nVanEck’s Digital Assets Mining ETF (DAM) and Digital Transformation ETF (DAPP), and the Global X Blockchain ETF (BKCH), which are also crypto-related ETFs, were up by at least 60% in January.\n\nBitcoin mining difficulty hit a new all-time high on Sunday as it rose 4.68% in its latest difficulty adjustment.\n\nBitcoin was trading at US$23,113, down 1.9% in the 24 hours to 10:45 p.m. in Hong Kong, after it reached a five-month high of US$23,918 overnight.\n\nSee related article: Blockstream says it raised US$125 million to expand Bitcoin mining operations"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLWdyZWVuaWRnZS1jdXRzLW55ZGlnLWRlYnQtZnJvbS03Mm0tdG8tMTdt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin miner Greenidge cuts NYDIG debt from $72M to $17M - Cointelegraph",
        "content": "Bitcoin (BTC) mining company Greenidge Generation Holdings has significantly reduced its debt with the investment management firm New York Digital Investment Group (NYDIG).\n\nOn Jan. 30, Greenidge entered into several agreements associated with its secured debt with NYDIG, transferring ownership of Bitcoin mining hardware and certain credits to NYDIG. The transaction reduced the principal and accrued interest balance of debt with NYDIG from about $76 million to roughly $17 million, resulting in total aggregate debt reduction of around $59 million.\n\nOne of the agreements, the senior secured loan agreement, also enables an opportunity for a voluntary prepayment of the loan by transferring ownership of certain mining infrastructure assets. Subject to a binding agreement by NYDIG, the loan agreement can potentially reduce the principal balance of the debt to approximately $7 million.\n\nAs previously reported, Greenidge originally signed the deal in mid-December 2022, expecting to reduce its NYDIG debt by at least $57 million and up to $68 million.\n\n“The debt restructuring we’ve announced today significantly improves our balance sheet and provides us with a clear path forward as we enter 2023,“ Greenidge CEO Dave Anderson said. The executive expressed confidence about the strong mining industry development ahead, stating:\n\n“The completion of this debt restructuring, coupled with the execution of the new hosting agreements, has significantly improved our immediate liquidity and allows us to continue participating in the future upside potential of Bitcoin.”\n\nDespite essentially restructuring the company into a hosting firm for Bitcoin mining rigs, Greenidge continues to own about 10,000 miners, maintaining a capacity of 1.1 exahashes per second (EH/s), the firm said.\n\nAmid a tough cryptocurrency winter, many mining firms have been moving to decrease their debt using similar strategies. In late December 2022, Argo Blockchain reduced its total debt by $41 million by selling its flagship Helios mining facility and getting a $35 million loan from Mike Novogratz’s crypto investment firm Galaxy Digital.\n\nRelated: Public Bitcoin mining companies plagued with $4B of collective debt\n\nIn addition to the debt reduction, Greenidge also released preliminary financial results for the fourth quarter of 2022, reporting $15 million in revenues and up to $130 million in losses. The firm produced approximately 683 BTC ($15.7 million) during Q4 2022.\n\nGreenidge also mentioned the sale of its software subsidiary Support.com on Jan. 17. The sale generated approximately $2.6 million net proceeds."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jaGFzZS5jb20vcGVyc29uYWwvaW52ZXN0bWVudHMvbGVhcm5pbmctYW5kLWluc2lnaHRzL2FydGljbGUvY3J5cHRvLW93bmVyc2hpcC1zdXJnZXMtbmV3LWpwbW9yZ2FuLWNoYXNlLXJlc2VhcmNoLXJldmVhbHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "New JPMorgan Chase Research Shows that Crypto Ownership Surged in Five Years | Chase - Chase News & Stories",
        "content": "Chase's website and/or mobile terms, privacy and security policies don't apply to the site or app you're about to visit. Please review its terms, privacy and security policies to see how they apply to you. Chase isn’t responsible for (and doesn't provide) any products, services or content at this third-party site or app, except for products and services that explicitly carry the Chase name."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjAxOTkvYml0Y29pbi1taW5pbmctZGlmZmljdWx0eS1oaXRzLW5ldy1hbGwtdGltZS1oaWdo0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDE5OS9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LWhpdHMtbmV3LWFsbC10aW1lLWhpZ2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Difficulty Hits a New All-Time High - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s just gotten even harder to mine Bitcoin.\n\nBitcoin’s mining difficulty has hit a new all-time high, rising roughly 4.68% from 37.59 trillion on Sunday to 39.35 trillion at the time of writing.\n\nMining difficulty is the figure representing the computational power required to mine a single BTC. It’s updated roughly every two weeks, getting more difficult as more miners enter the network and easier when they leave.\n\nAD\n\nAD\n\nBitcoin mining difficulty over the past month. Source: CoinWarz .\n\nMining difficulty has been climbing strongly and steadily over the past year, despite temporary decreases, such as in the month of December 2022.\n\nOn January 30, 2022, the mining difficulty sat at 26.24 EH/s as per the data from CoinWarz, but it has since risen to 39.35 EH/s, a roughly 50% increase.\n\nMeanwhile, Bitcoin’s hash rate, which measures the amount of computational power dedicated to mining the cryptocurrency, currently sits at 305.81 ExaHashes per second (EH/s). This figure is still below the all-time high registered on January 6 of 348.7 EH/S.\n\nThe current hash rate means Bitcoin miners are currently making over 305 quintillion codebreaking attempts every second in attempts to solve the computational equations needed to produce the proof-of-work (PoW) cryptocurrency.\n\nThis time last year, Bitcoin’s hash rate was roughly 182.37 EH/s, making for a total increase of over 67% to the time of writing.\n\nAD\n\nAD\n\nBitcoin hash rate from January 31, 2022, to the present. Image: CoinWarz .\n\nDespite both Bitcoin’s mining difficulty and hash rate spiraling up throughout 2022, the price of the end product hasn’t kept pace.\n\nThe price of Bitcoin, as per CoinGecko data, has declined from $38,232 on January 30, 2022, to $23,211 today, marking a roughly 39.3% decline.\n\nBitcoin miners in difficulty\n\nThis isn’t good news for some in the Bitcoin mining industry, a larger mining difficulty means more advanced machinery, more computers, and more power might be needed to produce the same amount of Bitcoin.\n\nAnd if the price of Bitcoin isn’t rising at a comparable pace to the mining difficulty, this could make mining a less profitable business.\n\nAlready bankruptcy and debt restructuring news has cropped up almost weekly in recent months.\n\nIn December 2022, Core Scientific, one of the largest publicly-traded U.S. mining companies declared bankruptcy.\n\nAnother major mining firm, Greenidge Generation has gone on record as saying that their continued viability is in “substantial doubt.\n\nIt’s not just low Bitcoin prices and higher miner difficulties putting stress on these firms. Industrial energy prices shot up 16% between 2021 to 2022, which has spelled trouble for firms running fleets of energy-intensive mining machines.\n\nAD\n\nAD"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8zMC9qYWlsZWQta2lja2JveGVyLWFuZHJldy10YXRlLXByb21vdGVkLWJpdGNvaW4tZm9yLXRheC1hdm9pZGFuY2UtaW4tdmlkZW8v0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAxLzMwL2phaWxlZC1raWNrYm94ZXItYW5kcmV3LXRhdGUtcHJvbW90ZWQtYml0Y29pbi1mb3ItdGF4LWF2b2lkYW5jZS1pbi12aWRlby9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Jailed Kickboxer Andrew Tate Promoted Bitcoin for Tax Avoidance in Video - CoinDesk",
        "content": "“What Andrew is trying to say is that crypto transactions are anonymous and the tax authorities will not be able to find them. Wrong on many counts,” Charles Kolstad told CoinDesk. Kolstad is an international tax lawyer at Withers Bergman LLP. “The IRS, the tax authorities in the [European Union] and elsewhere may be slow but they are not stupid. The tax authorities have blockchain analytic tracking software and will find you eventually. The IRS, the EU and members of the OECD are all focused on tax evasion through the use of crypto.”"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vc2VjdXJpdHlpbnRlbGxpZ2VuY2UuY29tL2FydGljbGVzL3NpbGstcm9hZC1kYXJrLXdlYi1sYXctZW5mb3JjZW1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "How the Silk Road Affair Changed Law Enforcement - Security Intelligence",
        "content": "The Silk Road was the first modern dark web marketplace, an online place for anonymously buying and selling illegal products and services using Bitcoin.\n\nRoss Ulbricht created The Silk Road in 2011 and operated it until 2013 when the FBI shut it down. Its creator was eventually arrested and sentenced to life in prison.\n\nBut in a plot twist right out of a spy novel, a cyber attacker stole thousands of bitcoins from Silk Road and hid them away. It took law enforcement years to find the perpetrator. By then, the Bitcoins were worth more than $3.3 billion.\n\nThe extended law enforcement operation was difficult and complex. But ultimately, this saga set the stage for future action against darknet marketplaces.\n\nHere’s what happened.\n\nHow Silk Road worked\n\nTwo technologies assured anonymity for both sellers and buyers on Silk Road: The Tor network and Bitcoin. The Tor network is a browser and service that routes internet traffic through a series of servers. Each of these servers then hides the IP address so that it becomes untraceable.\n\nBitcoin is a digital currency created in 2009. It allows for peer-to-peer transactions without the need for a central authority, such as a bank or government. Instead, the blockchain records, secures and authenticates these transactions.\n\nPeople bought and sold a wide range of products and services on the Silk Road. By 2013, however, some 70% of the purchases were drugs.\n\nTracing drugs shipped by mail to temporary P.O. boxes became The Silk Road’s undoing. This allowed law enforcement to arrest Ulbricht’s freelance employees and piece together the Silk Road story.\n\nStill, the Tor network prevented law enforcement from nailing down exactly who was behind Silk Road. That was the case until an FBI agent got a lucky break. A Reddit post warned that Silk Road’s IP address had become visible online. The agent probed the claim by posting various data on Silk Road, then used software to analyze the traffic until he could expose the IP address.\n\nAfter some incredible and persistent desk-jockey sleuthing, Ulbricht, who used the online nickname “Dread Pirate Roberts”, was eventually caught logged into the site from a public library. He was arrested and charged with money laundering, computer hacking crimes, conspiracy to traffic narcotics and attempted murder to silence at least five people who threatened to unmask Silk Road.\n\nUlbricht turned down a plea deal offering a minimum 10-year sentence, which turned out to be a big mistake. He was convicted, given five sentences, including two life sentences without parole, and fined $183 million.\n\nMystery of the missing billions\n\nInitiated by U.S. Senator Charles Schumer, the DEA and Department of Justice conducted a long and intense investigation to find the billions in Bitcoin stolen from Silk Road before the site’s shutdown.\n\nIn 2012, a man named James Zhong created some nine Silk Road accounts anonymously. He then triggered more than 140 transactions in a way that tricked Silk Road’s withdrawal processing system into releasing around 50,000 Bitcoins into those accounts.\n\nHe exploited a flaw in the system, where he made an initial deposit, then rapidly withdrew an amount less than the deposit but made the same withdrawal many times within a second before the system could register that the account was depleted. Zhong repeated this on multiple accounts, making a total of 140 withdrawals.\n\nZhong then moved his ill-gotten proceeds into a range of addresses to conceal who owned and controlled the Bitcoins.\n\nAlmost five years after this theft, Zhong benefited from a hard fork coin split, where Bitcoin split into two cryptocurrencies: traditional Bitcoin and Bitcoin Cash. He converted the latter back to Bitcoin, which amounted to 3,500 Bitcoin.\n\nHe then used an exchange to convert the stolen bitcoin to dollars. This made it easy for investigators to trace the transaction. They knew he was out there somewhere and waited for him to reveal himself.\n\nTo catch a bitcoin thief\n\nAfter the government had been investigating the crime for a decade, they finally got tipped off when a man in Athens, Georgia, called the police to say that he was burglarized and that the thieves stole “a lot of Bitcoin”, which attracted the attention of the IRS. That man was James Zhong.\n\nPolice raided his home and found Bitcoin hidden in a “single-board computer” stashed in a popcorn tin in Zhong’s bathroom. They also found $662,000 in cash, along with bars of gold and silver, in a floor safe.\n\nIn November of 2021, the U.S. Attorney for the Southern District of New York announced that a law enforcement operation seized more than 50,676 Bitcoin worth an incredible $3.36 billion.\n\nZhong pleaded guilty to one count of wire fraud, which carries a maximum sentence of 20 years in prison. He is scheduled to be sentenced on February 22, 2023, and is currently out on bail.\n\nHow the Silk Road affair changed crime and law enforcement\n\nThe value of the seizure, the second largest ever after the $3.6 billion in stolen crypto linked to the 2016 hack of Bitfinex, caused federal law enforcement to prioritize crypto-related crimes, adding expertise and developing methods for tracing such transactions.\n\nTo cyber criminals — and also many law-abiding citizens who shared Ulbricht’s utopian libertarian views advocating for the freedom for people to buy and sell anything they like — Ulbricht’s double life sentence without the possibility of parole was a shock and an outrage. Still, no doubt, it strongly discouraged participation in dark web sites for people within reach of Western law enforcement. It also motivated everyone involved in such marketplaces to up their security and anonymity."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmNsb3Vkd2FyZHMubmV0L2lzLWNyeXB0by1hbm9ueW1vdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Is Crypto Anonymous 2024 [Is Bitcoin More Traceable Than Cash] - Cloudwards",
        "content": "Is Crypto Anonymous in 2024 & Is It More Traceable Than Cash? Cryptocurrencies are often portrayed as a way to send and receive money in secrecy, but is crypto anonymous, really? Can you send money anywhere without people figuring out who you are, or are you tracked just as easily as with regular bank payments? Written by Fergus O'Sullivan (Writer, Former Chief Editor) Reviewed by Aleksandar Kochovski (Editor) Facts checked by Jasna Mishevska (Lead Fact-Checking Editor) Last Updated: 2024-01-23T20:05:18+00:00 All our content is written fully by humans; we do not publish AI writing. Learn more here.\n\nIn movies and shows, cryptocurrencies are shown as the best way to move money around anonymously, whether for purposes of money laundering or even just simple tax evasion. However, is crypto anonymous, really, or can you be tracked when using it? Key Takeaways: Crypto Anonymity Most cryptocurrencies, Bitcoin included, are not anonymous but pseudonymous, not hiding your identity as much as giving you a fake one. While a pseudonym can hide you, it’s not foolproof, either.\n\nThrough some smart searching of a cryptocurrency’s blockchain, you could find out the real-world identities behind wallets.\n\nTo combat this, there are some anonymous cryptocurrencies that can hide your transactions, though they’re a minority and not very popular yet. Turns out that most cryptocurrencies, Bitcoin included, don’t deserve their reputation for secrecy and anonymity. Though they’re a lot harder to track than regular electronic payments, you’re not exactly casting a veil of secrecy over your money when using it. Let’s look at why that is. Show all Meet the experts Learn more about our editorial team and our research process.\n\nIs Crypto Anonymous? The short answer is no, most cryptocurrency isn’t anonymous, although there are a few exceptions we’ll get into later. Instead, most cryptocurrency is pseudonymous, or replacing your name with a fake one. However, instead of everybody going by the name “John Smith” or something along those lines, your name is replaced with the numbers and digits of your wallet address. A wallet is where your crypto is stored. It’s a digital space that only people with the address and the access keys can get to and move the contents around. However, it’s also what makes crypto identifiable, since a wallet’s address is kept on a cryptocurrency’s blockchain. If you need an in-depth reference on what cryptocurrencies are, get back to basics with our article on Cyrpto for Dummies. How Blockchain Technology Prevents Anonymity Blockchain technology is what makes cryptocurrency possible. It’s a digital ledger that tracks when a certain token was created and how it has moved around since then, preventing fraud. Of course, the purpose of any ledger is to retrieve information when you need it; if the ledger was anonymous, that wouldn’t be possible. As a result, any transaction or movement that takes place on a blockchain is recorded, and so is the entity that carried it out. Though your real name won’t be there, your pseudonym — the wallet address — will. While there are ways around this, it involves adding an extra layer on top of the blockchain; the basics of the technology remain unchanged.\n\nCan Your Crypto Addresses Reveal Your Real World Identity? Of course, pseudonymous doesn’t mean “out in the open,” either. There’s a good chance that nobody will ever link your cryptocurrency transactions to you. However, that doesn’t make it impossible. For one, if a crypto exchange knows who you are (via “know your customer,” or KYC identification), they could pass that information along to law enforcement should they ever come knocking with a warrant. Aside from such judicial muscle, though, there’s no way to directly link a crypto address to any one person. Your name isn’t linked to a wallet, at least not publicly. However, you can look at the blockchain for a specific currency and try to link it with somebody’s known crypto transactions. Example: Are Bitcoin Transactions Anonymous? For example, we want to find out which Bitcoin address belongs to Bob. To do so, we need to know something about him, like that last Tuesday he bought two Bitcoin. Then, we’d have to go through the ledger of the Bitcoin network for that day and find all the transactions for two Bitcoin. Since there are likely more than one, we’d have to narrow it down with another data point. If we know Bob sold one of his coins the next day, that gives us another thread to work on. Alternatively, we can figure out if he bought the coins from somebody we know. For example, if he bought it from a public Bitcoin addresses like that of an exchange or a friend whose wallet address we know, we could establish a link that way. There won’t be a single event that identifies Bob’s address unless we get very lucky, but by puzzling together enough clues from the list of Bitcoin transactions, we can get to a point where we can say with some certainty which address belongs to Bob and roughly how many Bitcoin he has in it. It’s a painstaking process, but savvy thinking and some machine learning algorithms make it a lot easier.\n\nIs Bitcoin More Traceable Than Cash? As a result, Bitcoin and other cryptocurrency are a lot more traceable than cash, and it’s all down to the blockchain, the ledger. Cash doesn’t have a ledger: you can spend a $5 note in a shop now, and tomorrow it could be on the other side of the world and you’d be none the wiser. Technically speaking, notes can be traced using serial numbers, but that only works if you have a note in your hands. It won’t help you track ones that are out there. With the right tools and enough patience, you can track any cryptocurrency you’d like, as well as its owner, from anywhere and at any time.\n\nWhich Crypto Is Anonymous? As you can imagine, not everybody is happy with this state of affairs. Plenty of people would like their digital assets to be cloaked in secrecy, away from the prying eyes of, well, anybody. While some of the people seeking this kind of anonymity do so to hide criminal activity, there are also those who pursue it in the name of the moral principle of privacy. No matter the reason, there are a number of cryptocurrencies that offer greater secrecy. They’re all a bit obscure, but the biggest names are probably Monero, Bytecoin and Zcash. What they all share is that they have found ways to obfuscate, or otherwise encrypt transactions, on their respective blockchains. Monero, for example, randomizes your address for every transaction and also hides the amounts that changed hands. Zcash has written a whitepaper that goes into detail on all the math behind its technology. Bytecoin uses CryptoNote, a technology that effectively places another layer onto the blockchain, making it impossible to see what’s really happening. Of course, we can safely assume that law enforcement as well as hobbyists are hard at work trying to pierce veils like these by hunting down suspicious transactions or linking known users to purchases. Eventually they’ll succeed and another new anonymous coin will take their place.\n\nFinal Thoughts The way cryptocurrency works now, there’s no room for anonymity without adding an extra layer. Blockchain technology was designed for transparency, so hiding transactions goes against its grain in every way. Still, with some engineering, you can make crypto harder to trace, maybe even impossible. Of course, should crypto even be untraceable? What does it matter if anybody knows your true identity? Isn’t anonymous crypto a bigger danger? Let us know what you think in the comments below. As always, thank you for reading. FAQ Is Cryptocurrency Anonymous? No, most cryptocurrency is not anonymous. With some sleuthing, crypto can be linked to the real you.\n\nAre Cryptocurrency Transactions Anonymous or Pseudonymous? Bitcoin transactions are not anonymous, but pseudonymous, meaning you’re using a fake name (your wallet address).\n\nCan Cryptocurrency Be Traced? Most crypto assets can be traced using wallet addresses, transaction history and, of course, the blockchain. With some work, you could figure out where every Bitcoin ever made is right now, to name just one example.\n\nIs There an Untraceable Cryptocurrency? There are several cryptocurrencies that claim to be completely anonymous and untraceable, such as Monero, Zcash and Bytecoin. How anonymous they truly are, though, remains to be seen."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaW5hbmNlLW1hc3RlcmNhcmQtbGF1bmNoLWJpdGNvaW4tcmV3YXJkcy0xNDI3MDMyMDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Binance and Mastercard Launch Bitcoin Rewards Card in Brazil - Yahoo Finance",
        "content": "Binance and Mastercard have launched a prepaid rewards card in Brazil that will allow customers to make everyday purchases with cryptocurrency.\n\nNew and existing Binance users will be able to use the card to buy things and pay bills with Bitcoin and other cryptocurrencies across Mastercard’s network of 90 million merchants, Binance said in a statement seen by Decrypt.\n\nIt also comes with perks including up to 8% cashback in crypto on eligible purchases, and zero fees on ATM withdrawals.\n\nWhen the card becomes widely available in the next few weeks, it will make Brazil the second Latin American country where it is available, following Argentina’s rollout last year.\n\nLike the Argentinian card, user funds will be converted from crypto to fiat currency in real time at the point of purchase. Payments made using crypto are subject to a 0.9% conversion fee.\n\n“Brazil is an extremely relevant market for Binance and we will continue to invest in new services for local users, as well as contributing to the development of the blockchain and crypto ecosystem in the country,” said Guilherme Nazar, general manager at Binance for Brazil.\n\nCrypto, Binance and Brazil\n\nLast year, Brazil’s congress passed a bill that gives cryptocurrency payments legal status in the country—though without making the assets legal tender.\n\nIt was signed into law by then-President Jair Bolsanaro at the end of last year.\n\n“Brazilians are eager to embrace crypto beyond an investment asset,” Marcelo Tangioni, Mastercard’s country manager for Brazil, said of Binance’s latest announcement.\n\nCardholders in Brazil will be able to pay using 14 different currencies. In addition to the Brazilian Real, these include Bitcoin, Ethereum, and Binance’s own BNB and BUSD tokens.\n\nPlans are underway to increase the number of cryptocurrencies supported by the card, according to Binance’s statement, as well as to expand its availability to more countries around the world."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vamFsb3BuaWsuY29tL3Rlc2xhLWxvc3QtMTQwLW1pbGxpb24tb24tYml0Y29pbi1pbi0yMDIyLTE4NTAwNTQ4MzfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Tesla Lost $140 Million on Bitcoin in 2022 - Jalopnik",
        "content": "Tesla if one of those bleeding edge, forward-thinking #disruptor companies — the kind of company that would have kombucha on tap if it cared about its employees. As such, it’s deeply interested in cryptocurrency as the future — and deeply invested to match. So invested, in fact, that the company was able to lose $140 million on Bitcoin alone in 2022.\n\nTesla, Just Like You, Lost a Ton of Money on Bitcoin in 2022 CC Share Subtitles Off\n\nEnglish view video Tesla, Just Like You, Lost a Ton of Money on Bitcoin in 2022\n\nIn 2021, Tesla invested $1.5 billion in B itcoin and actually scored some modest returns on that money in 2022. An SEC filing from the company revealed gains of $64 million from its various Bitcoin trades last year, which comes out to a whopping 4.3% return. Of course, those gains are overshadowed by the company’s losses: $204 million.\n\nAdvertisement\n\nAdvertisement\n\nThose gains and losses total out to a net negative of $140 million, nearly 10 percent of the company’s initial investment. Incredibly, that number actually outperforms the traditional stock market — $SPY, an ETF tied to the S&P 500, dropped over 18% during that same period. Of course, considering the environmental effects of cryptocurrency, it’s tough to say those mitigated losses are worth it.\n\nAdvertisement\n\nOddly, Tesla’s SEC filing makes no mention of any other cryptocurrency holdings. CEO Elon Musk confirmed that the company had holdings in Dogecoin during 2022, but only the Bitcoin holdings appear in the legal paperwork. Considering Dogecoin is the only digital currency Tesla currently claims to accept, one would think it’d be important enough to mention to regulators. But, perhaps there’s more to come on that front — you never know when investigators will dig something up."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9zcG9uc29yZWQtY29udGVudC93aGF0LWZvdXIteWVhcnMtb2YtYnRjLW9wdGlvbnMtdHJhZGluZy10ZWFjaGVzLXVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "What Four Years of BTC Options Trading Teaches Us - CoinDesk",
        "content": "News\n\nThe Protocol: Is Ethereum's Dencun Update All It's Cracked Up To Be?"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9tb25leS9pcy10aGUtYml0Y29pbi00LXllYXItbWFya2V0LWN5Y2xlLXJlYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Is the Bitcoin 4-Year Market Cycle Real? - Benzinga",
        "content": "Happy birthday, Bitcoin! On Jan. 3, 2023, the Bitcoin blockchain reached the age of fourteen. In some ways, 2009 seems like a lifetime ago and in other ways like it was yesterday. After 14 years, Bitcoin, the first successful cryptocurrency, is still the king, and, as king, the rest of the crypto market follows it.\n\nThroughout Bitcoin’s short history, its price has experienced enormous swings to new all-time highs, followed by retracements that take back most of the gains. Studying the four Bitcoin market cycles, it becomes clear that other than the first cycle, the others are relatively consistent regarding timing.\n\nThis trend is especially true of the last two cycles, which are very close to 4 years each from peak to peak and bottom to bottom. Some have speculated that this timing results from the Bitcoin halving that occurs approximately every four years (210,000 blocks mined). The question now is: Is the Bitcoin 4-year cycle a real phenomenon or just a coincidence? And if it is real, will it continue?\n\nget started Limited Time Offer: Trade $100, Get $10 Buy $100 worth of crypto and get a $10 bonus! get started Disclosure: eToro supports the following currencies: BTC, ADA, DASH, DOGE, EOS, ETH, LTC, NEO, XLM, XTZ, TRX, ZEC. eToro USA LLC; Investments are subject to market risk, including the possible loss of principal. T&Cs apply. *The bonus is available to Benzinga readers in the US for open states only. Served by eToro USA LLC. Show More\n\nDissecting Bitcoin’s Market Cycles\n\nFor clarity, this article defines a market cycle from one bear market bottom to the next.\n\n2010 to 2011 Market Cycle\n\nThe first accurate Bitcoin price tracking occurred in July 2010. By October, Bitcoin's price started to rise and peaked on June 8, 2011, at $31.90. The price began to fall over the next five months and bottomed at $2.01 on Nov. 19, 2011. This first cycle was the shortest of all the cycles to date.\n\n2011 to 2015 Market Cycle\n\nCycle #2 began at the 2011 bear market bottom on November 19, after which the price bounced higher almost immediately. After the bounce, there was a six-month period of consolidation. After BTC broke out of the consolidation, it peaked at over $268 on April 10, 2013; a 76% drop followed that peak.\n\nBTC recovered almost immediately and hit a bull market peak of $1,177 on Nov. 30, 2013. An 86% drop followed that peak; the bottom was hit on Jan. 14, 2015.\n\n2015 to 2018 Market Cycle\n\nThe third cycle began at the 2015 bear market bottom on January 14. For the first 9 ½ months, the price of Bitcoin accumulated in a range of about $100. After the price of Bitcoin broke out of the accumulation range, it re-tested the range once before moving higher.\n\nThe move higher culminated in the bull market peak at just under $20,000 on Dec. 17, 2017. Once again, a price drop of 84% followed the peak and the bottom was hit almost one year later, on Dec. 15, 2018.\n\n2018 to 2022 Market Cycle\n\nThe fourth cycle began on Dec. 15, 2018, and after about four months of accumulation, the price of Bitcoin broke out in a dramatic fashion. Over the next three months, the price of Bitcoin increased by over 200% and hit a high of $13,831 on June 26, 2019.\n\nOver the remainder of the year, Bitcoin’s price slowly dropped but still finished up about 90% for the year. The start of 2020 saw a 45% increase in the price of Bitcoin, which peaked in mid-February. That was followed by the COVID crash, which bottomed in mid-March.\n\nThe recovery from the COVID crash was swift and eventually led to the next bull market. This bull market was reminiscent of the 2013 bull market. After pushing higher throughout much of 2020, the price of Bitcoin peaked on April 14, 2021. This peak was followed by a 55% pullback that bottomed on July 20.\n\nOver the next month, the price of Bitcoin increased by over 134%, which led to the ultimate bull market peak on Nov. 10 at $69,000. Bitcoin’s price immediately began to drop and just over a year later, on Nov. 21, 2022, it hit what appears to be the bottom at $15,495.\n\nBitcoin’s (BTC) Entire Price History - Weekly Chart\n\nBy zooming out and looking at the entire price history of Bitcoin, you can calculate the timing of each market cycle. In the chart above, the green vertical lines mark the bull market peaks and the time intervals between them. The yellow dashed lines mark the bear market bottoms, with the time intervals between them.\n\nTake note of the timing of the last two market cycles. They are close to a four-year cycle, from one peak to the next and from bottom to bottom. Another interesting observation is the time of year when the peaks and bottoms occur.\n\nOther than the very first peak in 2011, all the others occurred in November, December or January. November has the most with two peaks and two bottoms, assuming that Nov. 21, 2022, marks the bottom for this bear market. Is this timing a coincidence, or is there a reason behind it?\n\nAnother observation is that each bear market low is higher than the previous low. Will that continue? Below is another chart showing the entire price history of Bitcoin.\n\nBitcoin’s (BTC) Entire Price History - Weekly Chart\n\nThe vertical lines on this chart mark each peak (green), when each halving occurred (red) and the date one year before each halving (yellow). The percentage increase in price is then measured between the vertical lines for each cycle. It is calculated for the year leading up to the halving and from the halving to the following peak.\n\nIt is clear that with each successive cycle, the percentage increase in price for the year leading up to the halving is declining. The same pattern is evident from the halving to the following peak. Again, with Bitcoin’s short history, it is unclear whether or not this pattern will continue. Visually, it is easy to see the diminishing returns with each successive cycle.\n\nTiming for Bitcoin Bottoms - Halvings - Peaks\n\nThis chart shows how consistent the timing is from the bottom to the halving and from the halving to the following peak. The next halving is estimated to occur on March 28, 2024. Just for fun, extrapolating the data from the other cycles puts the next bull market peak in late October 2025.\n\nIs there a meaning behind these patterns? Will these patterns continue? Can you even call these patterns with the limited amount of data? So many questions and because no one has a crystal ball, all people can do is watch as the next Bitcoin market cycle unfolds. It should also be noted that because many altcoins follow Bitcoin’s price action, there is also a crypto market cycle.\n\nWill Bitcoin’s 4-Year Market Cycle Continue or Evolve?\n\nAnother important question is how the changing investor demographics will affect the Bitcoin market cycle. Over the last couple of years, the number of institutional investors has been increasing. The number of corporations holding Bitcoin has been growing as well. As more regulation is brought into the sector, institutional investment will grow.\n\nThe days of only retail investors and traders buying Bitcoin are over. Will this trend affect Bitcoin’s market cycle? As investor demographics change, the steep bear market pullbacks may become shallower. If this does occur, it will affect not only Bitcoin but also the entire crypto market cycle.\n\nRetail buyers will come in late and panic sell when the market turns against them. As they become a minor part of the overall investor pool, their effect on Bitcoin’s price will diminish.\n\nInstitutional investors and corporations will be more likely to hold onto their Bitcoin. And depending on their average cost, they may even hold through bear markets. Together, these changes may significantly impact Bitcoin’s market cycle.\n\nWhat is Bitcoin’s Current Market Condition?\n\nThe bottom of the 2018 bear market occurred two days shy of the one-year anniversary of the 2017 bull market peak. The low set on Nov. 21, 2022, at $15,476 (Binance), is one year and eleven days after the bull market peak on Nov. 10, 2021.\n\nIt may be too early to say that Nov. 21, 2022, is the bottom for this bear market. But, after 49 days of sideways price movement, Bitcoin’s price surged over 50% to just under $24,000. The likelihood of that being the bottom continues to increase.\n\nBitcoin (BTC) Daily Chart\n\nIn Bitcoin’s history, a macroeconomic environment like the past 12 months has not occurred. Inflation has soared to levels not seen in 40 years. To combat this, central banks worldwide increased interest rates to slow economic growth. The unknown now is whether this policy will result in recessions in some countries or worse worldwide.\n\nA severe recession would drop markets worldwide and most likely put downward pressure on the price of Bitcoin. If a severe downturn can be avoided, 2023 should be a year of recovery for BTC. January has only a few days left and Bitcoin is up about 45% for the month, which marks an excellent start to the year.\n\nHistorically, the meat of bull markets has occurred after each halving. The next halving is estimated for the end of March 2024, so if this cycle follows past cycles, the next macro bull market should begin soon after.\n\nMark Twain is credited with saying, “History never repeats itself, but it does often rhyme.” This does appear to be true for Bitcoin’s market cycles. Whether or not rhyming continues is anyone's guess. What is becoming more evident is that with each day inches closer to the most exciting time in crypto. Will you be prepared for liftoff?\n\nHow to Buy Bitcoin\n\nNow that you know how to use Bitcoin market cycles to get an idea of what the future holds for Bitcoin and the crypto market in general, here's how to buy Bitcoin. Because Bitcoin is the largest and most popular crypto in the world, it is offered by essentially all crypto exchanges. Some of the best exchanges that offer Bitcoin trading are eToro, WeBull, Gemini, Binance, Uphold and HYCM. Once you buy your Bitcoin, you should keep the coins off of the exchange to custody your crypto yourself for the best security. Ledger hardware wallets are all you need to keep your crypto safe and they support more than 1,800 cryptos including Bitcoin, Ethereum, Dogecoin, Ripple and all ERC-20 tokens."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnRyYWRlc3RhdGlvbi5jb20vaW5zaWdodHMvMjAyMy8wMS8zMS9iaXRjb2luLWZlYXItZ3JlZWQtcmlzaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Crypto Fear & Greed Index Hits 14-Month High as Bitcoin Climbs - TradeStation Market Insights",
        "content": "Cryptocurrencies like Bitcoin tumbled in the last year as the Federal Reserve hiked interest rates, but now spirits could be improving.\n\nThe Crypto Fear & Greed Index, which includes factors like Volatility and Momentum, hit 61 on Monday. It was the highest reading since November 2021, when Bitcoin was 150 percent higher.\n\nThe increase followed a three-week rally in the cryptocurrency. BTCUSD now finds itself back above $22,000 and is testing peaks from last August. Investors could find it interesting for a few reasons.\n\nFirst is the Federal Reserve meeting tomorrow. Cryptocurrencies shot to new highs in late 2020 after policymakers cut interest rates near zero. They also fell in late 2021 as investors braced for higher rates. In that respect, they’ve been leading equities — especially growth stocks on the Nasdaq-100.\n\nCrypto Fear & Greed Index, courtesy of Alternative.me.\n\nThe market broadly expects the Fed to raise interest rates by 25 basis points on Wednesday, with the possibility of one more hike on March 22. (According to CME’s FedWatch tool.) Any indications of central bankers pausing earlier could potentially impact Bitcoin because it would probably lower borrowing costs. Softer monetary policy could also depress the U.S. dollar, increasing the appeal of assets like precious metals and cryptos.\n\nSecond, fundamentals of the crypto market have tightened. Data from CryptoQuant.com shows fewer than 2.2 million Bitcoin available on public exchanges, down from 3.1 million three years ago. That suggests less supply is available, which may help support prices.\n\nCharting Bitcoin\n\nBitcoin has been pushing against its September high around $22,750. Traders could next eye the August peak of $25,200.\n\nTo the downside, chart watchers could focus on the $21,500 level. That was a level from November that Bitcoin broke on January 20.\n\nStill, participation has been narrow as other digital assets like Ethereum, BNB and Polygon struggle. That’s different than Bitcoin’s last bull run. At that time (December 2020) Bitcoin rallied but shrank as a percentage of the total crypto market. So-called Bitcoin dominance slid from over 70 percent to under 40 percent by May 2021, according to TradingView data. The move resulted from money streaming into the broader market. This time, it’s mostly going to Bitcoin.\n\nThere could be three ways to view the relative strength of Bitcoin.\n\nBitcoin (BTCUSD), daily chart, with key levels cited above, courtesy of TradingView.\n\nA pessimistic view would be that investors have lost interest in cryptos overall and Bitcoin is the “last man standing.”\n\nAn optimistic view would note that Bitcoin dominance tends to peak as bear markets end. Therefore if other tokens like Ethereum gain versus Bitcoin in coming weeks, it could suggest investors are returning to the broader space.\n\nA mixed view could be favorable toward Bitcoin alone. After all, BTCUSD was the first major crypto and has always boasted the largest market capitalization. It’s received the the most attention by large investors. It could also have the least risk of being regulated as a security, according to regulators.\n\nIn conclusion, Bitcoin could be nearing a turning point as sentiment brightens and markets look for the interest rates to stop rising. Investors who’ve abandoned cryptocurrencies could start looking again."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdS50b2RheS9zdGFyLXRyZWstbGVnZW5kLXdpbGxpYW0tc2hhdG5lci13YW50cy1iaXRjb2luLWJ0Yy10by1nby10by1tb29u0gFUaHR0cHM6Ly91LnRvZGF5L3N0YXItdHJlay1sZWdlbmQtd2lsbGlhbS1zaGF0bmVyLXdhbnRzLWJpdGNvaW4tYnRjLXRvLWdvLXRvLW1vb24_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Star Trek Legend William Shatner Wants Bitcoin (BTC) to Go to Moon - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCanadian actor William Shatner from the iconic sci-fi film series Star Trek, the performer of the famous Admiral James T. Kirk role and a crypto enthusiast, took to Twitter to say that Bruce Fenton should make Bitcoin go \"to the moon.\"\n\nBruce Fenton is the chief executive of Chainstone Labs, one of the oldest Bitcoiners in the crypto space, is currently on a trip in the UAE. Shatner's tweet was a comment on a photo he took in a hotel there. Neither Fenton nor Shatner shared any details of this trip.\n\nHave fun this week. Make Bitcoin go “to the moon”! 😝😉👍🏻 https://t.co/aTRoBWyUGB — William Shatner (@WilliamShatner) January 30, 2023\n\nShatner and Ethereum\n\nTwo years ago, Shatner seemed to make several attempts to enter the crypto space, advocated Ethereum and was even on friendly terms with Justin Sun, the creator of Tron chain and former CEO of the Tron Foundation.\n\nThe famous actor has not been tweeting about crypto much recently. However, last fall, as U.Today reported, right after Ethereum switched from the proof-of-work protocol to the proof-of-stake one by implementing the Merge upgrade, Shatner sent his greetings and congratulations to Vitalik Buterin — the frontman and co-founder of the second largest blockchain platform.\n\nIn February, Ethereum is expected to unleash another major upgrade, Shanghai. Among other things that it will add to Ethereum, it will allow stakers to begin withdrawing their ETH from the Ethereum 2.0 deposit contract, which has been locked there for about two years now.\n\nBitcoin is important now, Robert Kiyosaki says\n\nAccording to a prominent investor and entrepreneur in the sphere of financial education, the author of famous book \"Rich Dad, Poor Dad,\" Robert Kiyosaki, the flagship cryptocurrency Bitcoin is \"priceless now.\"\n\nAs reported by U.Today earlier, Kiyosaki reckons that currently, the global economy has entered a period of global recession, which is a lot worse than the Great Depression.\n\nMany companies are making workers redundant, including crypto companies and tech corporations around the world. Companies are going bankrupt, the crypto space included, as the FTX exchange filed for insolvency in November and Genesis crypto lender — which belongs to the Digital Currency Group created by Barry Silbert — filed for bankruptcy just recently.\n\nMore people are becoming homeless and losing their pensions, commented Kiyosaki. In this regard, as a long-term Bitcoin believer, he tweeted that BTC is priceless now, and there are bargains on gold and silver, which he also believes to be worthy assets."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS90b3AtNS1jb3VudHJpZXMtd2l0aC10aGUtbW9zdC1iaXRjb2luLWF0bXMtMTU3OTgxODEuaHRt0gFjaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L3RvcC01LWNvdW50cmllcy13aXRoLXRoZS1tb3N0LWJpdGNvaW4tYXRtcy0xNTc5ODE4MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Top 5 countries with the most Bitcoin ATMs - CNBCTV18",
        "content": "The first Bitcoin ATM (BTM) was set up in Vancouver, Canada on October 29, 2013. Since then, thousands of other cryptocurrencies have entered the market and the digital asset industry has skyrocketed. This has led to more than 40,000 BTMs being added over the last 10 years or so. Today, several countries around the world have opened Bitcoin ATMs that citizens can use to buy, sell and send various cryptocurrencies. However, the distribution of these BTMs is not exactly uniform, with some countries dwarfing others in terms of machine count. Here’s a look at the top 5 countries with the most Bitcoin ATMs today.\n\nUnited States\n\nThe United States of America has the maximum number of Bitcoin ATMs. At the time of writing the number of Bitcoin ATMs in the country stands at 33,769. That equates to roughly 86 percent of all Bitcoin ATMs in the world. However, the country also reported the most number of closed ATMs in 2022, with 188 machines taken offline last year.\n\nCanada\n\nCanada is the pioneer of Bitcoin ATMs. As mentioned earlier, it was the first country to open up a BTM. The machine was set up in a coffee shop in Vancouver and saw 348 transactions worth around $100,000 in its first week of operation. The company that operated that particular ATM, Robocoin, has since shut down. However, the number of crypto ATMs in the country has skyrocketed. Today, Canada has 2,657 BTMs, propelling it to the number 2 spot in terms of countries with the most crypto ATMs.\n\nAlso Read: US authorities to announce international cryptocurrency action\n\nSpain\n\nSpain is on a mission to become a leader in crypto adoption, both in Europe and across the world. Keeping with this goal, in Jan 2022, the country announced plans to add 100 new Bitcoin ATMs to existing BTM network. By Oct the same year, Spain seemed to be on track with its mission, toppling El-Salvador to become the third-largest crypto ATM hub. Currently, the country has nearly 270 Bitcoin ATMs spread across different cities. The plan is to reach 300 BTMs soon.\n\nAustralia\n\nJust a few months earlier, Australia was ranked fifth in terms of Bitcoin ATMs. However, according to recent reports, the land down under added 99 BTMs towards the end of 2022. In doing so, Australia effectively pipped El Salvador to become the fourth-largest crypto ATM hub in the world. At the time of writing, Australia had around 240 Bitcoin ATMs spread across the country serving its rapidly expanding crypto community. The country represents 0.6 percent of the global installations of Bitcoin ATMs and is on its way to overtaking the number of Bitcoin ATMs in Asia.\n\nEl Salvador\n\nEl Salvador was the first country in the world to adopt Bitcoin as its legal tender. President Nayib Bukele has always been a proponent of Bitcoin and has taken several measures to turn El Salvador into a pro-BTC country. He even went as far as using geothermal energy from volcanoes to power Bitcoin mining.\n\nTherefore, opening Bitcoin ATMs seemed to be a fundamental step towards furthering the dream of a Bitcoin-first nation. As such, in 2021, president Bukele decided to establish more than 200 BTC ATMs across the country. This put the El Salvador 3rd on the list of countries with the most BTMs. However, over the last few months, Spain and Australia have overtaken the island nation and currently, El Salvador is the fifth largest hub for crypto ATMs, with 212 machines installed across the nation.\n\nConclusion\n\nThere’s no denying it, 2022 was a terrible year for the crypto industry. The crypto winter caused prices to plummet and the situation was worsened by the FTX and Luna meltdowns. These circumstances could explain why the number of Bitcoin ATMs dropped in 2022.\n\nAccording to data from CoinATMRadar, the number of BTMs fell by 2.05 percent, with 796 crypto ATMs being pulled off the global network between Jan and September 2022. Moreover, only 94 new BTMs were added between July and the end of 2022. However, 2023 is off to a bright start and could signal a turnaround for the cryptoverse. This could result in more BTMs being added in the coming months."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yMzYwMC1zb2xhbmEtZXRoZXJldW0tYm5iLXJpc2VzLXVwLXRvLTYtMzY4MDQ4LTIwMjMtMDEtMzDSAYgBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLTIzNjAwLXNvbGFuYS1ldGhlcmV1bS1ibmItcmlzZXMtdXAtdG8tNi0zNjgwNDgtMjAyMy0wMS0zMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $23,600; Solana, Ethereum, BNB rises up to 6% - Business Today",
        "content": "Top crypto tokens were trading higher on Monday, thanks to gains in Bitcoin which flirted with $24,000 level over the weekend. Markets have remained largely hopeful the past week despite conflicting economic data and worrisome fourth quarter earnings reports.\n\nBitcoin was able to hold weekend gains and was firm above $23,500 level. Its largest peer, Ethereum was comfortable above $1,600-mark. Other Altcoins also posted decent gains.\n\nBitcoin hovered at $23,946 level over the weekend as markets continued to react to the US personal consumption data and the rise of investor sentiment. It is the highest level since August 2022, said Edul Patel, CEO and Co-founder at Mudrex.\n\n\"However, BTC is currently trading above the $23,600 level and rose by 2 per cent over the previous day. If bulls can hold BTC above the current level, the impulse may continue towards $24,000 and $25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" he said.\n\nBarring the US dollar pegged stablecoins, all top crypto tokens were trading higher on Monday. Solana surged 6 per cent, followed by Ethereum and BNB. Bitcoin and Polygon also added 2 per cent each during the early trade.\n\nThe global cryptocurrency market cap was trading higher at $1.08 trillion mark, rising about 2 per cent in the last 24 hours. However, the total trading volumes surged 24 per cent close to $49.64 billion.\n\nBitcoin is hitting new three month highs, boosted by institutional buying, wider adoption, and infrastructure improvements. Institutional investors are increasingly taking notice of cryptocurrencies, with companies like Tesla and Square investing in Bitcoin, contributing to demand and higher prices, said Sathvik Vishwanath, co-founder & CEO at Unocoin.\n\n\"Market sentiment plays a big role in the value of Bitcoin, with rising demand and belief that the price will rise to cause a self-fulfilling cycle. However, there is always the risk of market volatility and regulatory changes that may impact growth,\" he said.\n\nCrypto updates\n\nLawyers for Sam Bankman-Fried have argued he should be allowed access to assets and crypto held by his former company FTX, saying there's no evidence he's responsible for previous alleged unauthorized transactions.\n\nEmails obtained by CoinDesk shed new light on the ongoing debate over the opaque and disputed ownership of WazirX, India’s largest crypto exchange. In November 2019, the ownership of WazirX was uncontested: Binance published a blog post saying that it had purchased the Indian exchange. WazirX’s executives talked openly about the acquisition.\n\nTech View by Giottus Crypto Platform\n\nPolygon (MATIC), the popular layer 2 blockchain, has had a great 2022 in terms of its adoption and partnerships. Now, its token seems to be reflecting the added value, having gone from $0.75 earlier this month to nearly $1.2 today.\n\nOn its way, it has cleared several resistance levels, made higher highs and higher lows, and continued to hold its price. With such momentum, short term target of $1.3 (its last high in November) is certainly in play, but with its 200-day EMA untested throughout the month ever since its breakout, there may be some consolidation first. A confluence of resistances and an overbought RSI in the vicinity of the $1.2 level also suggest a path that may see a test of $1.04 first for MATIC.\n\nMajor Levels:\n\nSupport: $1.10, $1.04, $1.0\n\nResistance: $1.25, $1.30\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: ‘NFTs can help bring art closer to people': Actor Lisa Ray\n\nAlso read: Stocks in news: Tata Motors, NTPC, Vedanta, L&T, Tech Mahindra and more"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91ay1uYXRpdmUtc3RhYmxlY29pbi1pbnRlZ3JhdGVzLWludG8tMTgtMDAwLWF0bXMtbmF0aW9ud2lkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "UK-native stablecoin integrates into 18,000 ATMs nationwide - Cointelegraph",
        "content": "A partnership between Poundtoken and BitcoinPoint will make the country’s first 100%-backed British pound stablecoin, GBPT, accessible to retail consumers via a network of 18,000 ATMs across the United Kingdom. The move marks another step toward the U.K. becoming a “crypto hub” and is in line with the government’s push to use stablecoins for wholesale settlements.\n\nBitcoinPoint is a Lightning Network-enabled Bitcoin (BTC) and cryptocurrency exchange, licensed and registered in the United Kingdom. Poundtoken is the sole issuer of GBPT, which it states is fully backed in pounds at all times, with monthly attestations provided by auditor KPMG.\n\nCryptocurrencies including Bitcoin and Ether (ETH) can already be swapped for cash at ATMs across the United Kingdom. However, listing GBPT on BitcoinPoint means that users can now access retail and wholesale payments using the pound stablecoin and use a currency familiar to Brits as an on-ramp into crypto.\n\nThere are thousands of ATMs in London alone. Source: ATM Map\n\nBenoit Marzouk, CEO of BitcoinPoint, told Cointelegraph that the move could democratize “access to crypto for non-tech savvy people in the United Kingdom.” He explained that:\n\n“It’s also fully in line with the government’s consideration to integrate stablecoins with the U.K. economy.\"\n\nThe U.K. is the second-largest economy in Europe. Its government is recruiting for senior roles in central bank digital currencies as well as a digital pound rollout, while Prime Minister Rish Sunak has been vocal in his support for “digital settlement assets,” the country’s new, preferred terminology for crypto.\n\nCrosbie explained to Cointelegraph that Poundtoken came about as a result of the “rise in USD stablecoins” such as Tether (USDT) and USD Coin (USDC) and the fact that there is no U.K.-based alternative.\n\n“The purpose of GBPT is really to bring the blockchain and crypto to the U.K. and make it easier for adoption in the U.K. [...] It’s time the U.K. started to realize its potential as a world leader in crypto.”\n\nThe partnership works to normalize the use of stablecoins to conduct everyday financial practices. Marzouk explained, “We are Bitcoiners at BitcoinPoint, and we really see value in stablecoin projects — it really makes sense.”\n\nUsers require a phone number and a BitcoinPoint account to use the service. Source: Marzouk\n\nStablecoin use has proliferated around the world, from inflation-ridden Argentina to European financial hub Switzerland. However, the scars of the Terra algorithmic stablecoin crash are still fresh for the crypto industry, forcing some jurisdictions, such as Hong Kong, to outlaw their use entirely.\n\nScoring systems from traditional finance risk assessors such as Moody’s may give credibility to the burgeoning stablecoin ecosystem, while efforts from Bitcoin-advocate groups such as the Bitcoin Policy Institute may pave the way toward a crypto- and stablecoin-based future.\n\nRelated: United Kingdom banks are a threat to crypto, and that's bad news for everyone\n\nMarzouk told Cointelegraph that in the U.K., cashing out via an ATM off-ramp using BitcoinPoint remains low — less than 5% — and it is unlikely that there will be a dramatic uptick in numbers of users taking advantage of GBPT to hold physical cash. However, he is “quite confident about the on-ramp [into crypto].”\n\n“We see Bitcoiners opting out from the banking system and becoming Bitcoin only. You could also have people who don’t want to have a bank account and could therefore use GBPT. So, when they need cash, they can off-ramp into GBPT to get cash.”\n\nThe move could allow more and more crypto enthusiasts to participate without a bank. The integration is now live across the United Kingdom’s 18,000 ATMs."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0zMS1qYW4tYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1zb2xhbmEtcG9seWdvbi1zaGliYS1pbnUtMTU4MDMyODEuaHRt0gGMAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9waG90b3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LTMxLWphbi1iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXNvbGFuYS1wb2x5Z29uLXNoaWJhLWludS0xNTgwMzI4MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum down over 3%, most other tokens fall - CNBCTV18",
        "content": "1 / 8\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, fell 3.5 percent to $22,846.2. Its market value stood at $440.2 billion. The trade volume was at nearly $27.02 billion.\n\n2 / 8\n\n\"Bitcoin was seen changing hands at $22,800. BTC is down by three after reaching a high on Sunday of $24,000. Support for BTC is now $22,700, and resistance is $23,000,\" said Edul Patel, CEO and Co-Founder of Mudrex.\n\n3 / 8\n\nEthereum | The second largest virtual currency, Ethererum or Ether also fell 3.9 percent to $1,574.2 at the last count, with a market capitalisation of nearly $192 billion. The trade volume of Ethereum was almost $9.1 billion in the last 24 hours.\n\n4 / 8\n\nDogecoin | Meme-based virtual currency, Dogecoin, rose 0.7 percent to $0.1. Its market value stood at $11.9 billion. The trade volume was at nearly $837.4 billion.\n\n5 / 8\n\nSolana | Solana slumped six percent to $24.2 with a market capitalisation of $8.9 billion. The trade volume of Solana was $1 billion in the last 24 hours.\n\n6 / 8\n\nShiba Inu | Shiba Inu fell 2.2 percent with a market capitalisation of almost $6.4 billion. The trade volume was almost $306.8 million in the last 24 hours.\n\n7 / 8\n\nPolygon | Polygon fell 5.6 percent with a market capitalisation of $9.5 billion. The trade volume was $588.7 million in the last 24 hours.\n\n8 / 8"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vbGF3c3RyZWV0bWVkaWEuY29tL25ld3MvdGVjaC9iaXRjb2luLW1pbmluZy1lbnRlcnByaXNlLWFyZ28tc2Vlcy1zZWN1cml0aWVzLXN1aXQtYWZ0ZXItcHJvZHVjdGlvbi1zbG93cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Enterprise Argo Sees Securities Suit After Production Slows - Law Street Media",
        "content": "A lawsuit filed in the Eastern District of New York has taken aim at London, England-headquartered Argo Blockchain PLC and its directors over a September 2021 initial public offering that investors claim went bust.\n\nDuring and after the IPO, Argo’s Bitcoin (BTC) mining business took several nose dives that investors said were foreseeable and that the company failed to disclose in Securities and Exchange Commission (SEC) filings, thereby damaging purchasers of NASDAQ-traded Argo American Depository Shares (ADSs).\n\nArgo’s cryptocurrency mining business is worldwide, the complaint says, noting that Argo maintains a fleet of thousands of BTC mining machines at facilities in Canada and Dickens County, Texas, the latter of which is called the “Helios” facility.\n\nIn September 2021, Argo conducted its IPO, issuing 7.5 million ADSs to the public at the price of $15 per share for approximate net proceeds of $105 million. Yet less than a year later, the shareholder contends that the company began to face significant production obstacles, each of which caused the stock price to tumble when publicized.\n\nIn June 2022, Argo announced that it had mined approximately 25% fewer BTC in May 2022 compared to April 2022 because of increased network difficulty, higher electricity prices, and the curtailment of mining operations at its Helios facility. Then, in October 2022, it announced a change to an equipment contract, its intent to sell 3,400 mining machines for £6 million, and its intent to raise approximately £24 million from a “strategic investor.”\n\nA few days later, the company came forward with more disappointing BTC mining results from lessened operations at the Helios factory. After this news hit the market, ADS were trading at $2.19, well below their $15 offering price.\n\nThe shareholder argues that Argo and its board kept material information from the public including that the company was “highly susceptible to and/or suffered from significant capital constraints, electricity and other costs, and network difficulties.” This impacted Argo’s ability to deliver on BTC mining goals, and showed that Argo’s business was less sustainable than believed to be and its prospects overstated.\n\nThe suit seeks damages under federal securities laws for the omissions or misstatements that caused American consumers to invest to their detriment. The plaintiff and putative nationwide class are represented by Pomerantz LLP."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8zMC9mdHgtc2Vla3MtdG8tcmVtb3ZlLXR1cmtpc2gtdW5pdHMtZnJvbS1iYW5rcnVwdGN5LWNhc2Uv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAxLzMwL2Z0eC1zZWVrcy10by1yZW1vdmUtdHVya2lzaC11bml0cy1mcm9tLWJhbmtydXB0Y3ktY2FzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "FTX Seeks to Remove Turkish Units From Bankruptcy Case - CoinDesk",
        "content": "The parent company can still take action under Turkish law, and some Turkish creditors have already started filing private claims in local courts, the filing said. CoinDesk has previously reported that staff often put their paychecks into the company because of their distrust of local banks and depreciation of the lira."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzMxL21hbmdvLW1hcmtldHMtZXhwbG9pdGVyLXRob3VnaHQtYS1kYW8tcHJvdGVjdGVkLWhpbS10aGVuLXVzLWNvdXJ0cy1zaG93ZWQtdXAv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDEvMzEvbWFuZ28tbWFya2V0cy1leHBsb2l0ZXItdGhvdWdodC1hLWRhby1wcm90ZWN0ZWQtaGltLXRoZW4tdXMtY291cnRzLXNob3dlZC11cC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Mango Markets Exploiter Thought a DAO Protected Him. Then US Courts Showed Up - CoinDesk",
        "content": "“In their isolated system the votes undoubtedly seem powerful, and they are in a business sense as they operate as a cooperative of sorts aggregating purchasing power,” they said. “But that doesn’t mean that a DAO proposal and vote can cure all ills: like it or not, that’s what the courts are for.”"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9tYXJrZXRzL2JpdGNvaW4tYmFycmVscy10b3dhcmQtaGlzdG9yaWMtamFudWFyeS1hcy1jcnlwdG8tbWFya2V0LWp1bXBzLWJ5LTI4MC1ibi0xMjMwMTMwMDEwOTFfMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin barrels toward historic January as crypto market jumps by $280 bn - Business Standard",
        "content": "Bitcoin is set for its best January since 2013 on bets that monetary tightening and the crypto-sector crisis are both ebbing.\n\nThe largest token is up 40 per cent since the turn of the year, a first-month gain bettered only twice before when crypto was in its infancy. Smaller coins like Solana, Axie Infinity and Decentraland have doubled in value, part of a $280 billion January climb in digital assets overall, CoinGecko figures show. Bitcoin retreated 2.5 per cent to $23,200 as of 11:37 am in London on Monday amid broad declines in risk assets.\n\nThe rebound from last year’s deep"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMS8zMS9zdHJ1Y3R1cmVkLWZpbmFuY2UtcGxhdGZvcm0taW50YWluLW9wZW5zLXRva2VuaXplZC1tYXJrZXRwbGFjZS1mb3ItYXNzZXQtYmFja2VkLXNlY3VyaXRpZXMv0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzMxL3N0cnVjdHVyZWQtZmluYW5jZS1wbGF0Zm9ybS1pbnRhaW4tb3BlbnMtdG9rZW5pemVkLW1hcmtldHBsYWNlLWZvci1hc3NldC1iYWNrZWQtc2VjdXJpdGllcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Structured Finance Platform Intain Opens Tokenized Marketplace for Asset-Backed Securities - CoinDesk",
        "content": "“Attempts by the blockchain industry thus far have focused on tokenization, but for a financial instrument based on a complex structure, tokenization itself neither addresses the need of transparency nor efficiency,” said Siddhartha S, founder and CEO of Intain."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5zdHJhaXRzdGltZXMuY29tL3NpbmdhcG9yZS9jb3VydHMtY3JpbWUvc2NhbS12aWN0aW0tcy0xMDAwMS1pcy11c2VkLXRvLWJ1eS1iaXRjb2luLWhpZ2gtY291cnQtcnVsZXMtY3J5cHRvLXNlbGxlci1nZXRzLXRoZS1tb25ledIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Scam victim's $10001 used to buy Bitcoin; High Court rules crypto seller gets the money - The Straits Times",
        "content": "SINGAPORE - A man who unknowingly sold his Bitcoin to a scammer was allowed to keep the money for now, even though the $10,001 used to transact the deal had come from the victim of a fraudulent bank transfer.\n\nA High Court judge found that there were two victims in the case – the man whose stolen funds were used by the scammer to buy the Bitcoin, and the man who sold his cryptocurrency.\n\nA court fight had ensued between the seller and the bank transfer victim after the money was seized in the course of police investigations. Each had claimed the money should be returned to him.\n\nIn a written judgment last Friday, Justice Aedit Abdullah ruled that both men had lawful possession of the money.\n\nOn the one hand, the money originated from the bank account of Mr Ling Kok Hua and was fraudulently transferred. On the other hand, Mr William Lim Tien Hou had received the money in a legitimate contractual transaction.\n\nHe ruled that the money should be returned to the individual it was seized from, which is Mr Lim.\n\nThe judge said: “I understand that both parties have been put to expense and time in dealing with the aftermath of a fraud that neither was implicated in, and which both were victims of.”\n\nHe noted that his decision was on the basis of provisions in the Criminal Procedure Code governing the return of seized property, and has no effect on a civil court if parties start a separate civil action to assert their rights.\n\n“However, I would urge the parties to see if they can come to some sort of resolution between themselves that would avoid further time and expense for both.”\n\nOn Nov 10, 2018, a user named “haylieelan” on localbitcoins.com contacted Mr Lim – who had placed an advertisement to sell Bitcoin on the peer-to-peer trading platform – for a Bitcoin trade worth $10,000.\n\nAfter Mr Lim asked “haylieelan” to provide a photograph and identity details, the user submitted a photo of Mr Ling holding his identity card and a note stating that he was buying Bitcoin from “cryptotil”, which was Mr Lim’s username.\n\nMr Lim received $10,000 in his bank account and released the Bitcoin to “haylieelan”. Later in the day, he received another $1 but had no idea what it was for.\n\nOn the same day, Mr Ling was duped into believing that he was communicating with his former supervisor on Facebook when, in fact, he was speaking with a scammer who had hacked the account.\n\nMr Ling agreed to help transfer funds to a Bitcoin trading account, which turned out to be Mr Lim’s.\n\nThinking that he was helping his former boss, Mr Ling provided his online banking credentials and allowed the scammer remote access to his bank account via the TeamViewer application.\n\nMr Ling first prepared a transfer of $1 to Mr Lim’s bank account."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNpdHlhbS5jb20vY3J5cHRvLWFkb3B0aW9uLWluLWVtZXJnaW5nLW1hcmtldHMtYWNjZWxlcmF0ZXMtYXMtc2VjLWtlZXBzLXJlamVjdGluZy1iaXRjb2luLWV0ZnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto adoption in emerging markets accelerates as SEC keeps rejecting Bitcoin ETFs - CityAM - City A.M.",
        "content": "Crypto adoption in emerging markets accelerates as SEC keeps rejecting Bitcoin ETFs\n\nData from CryptoCompare shows that the price of Bitcoin moved mostly sideways throughout last week, starting off at $23,000 and dipping to a $22,500 low before moving strongly upward to $23,500. The cryptocurrency failed to remain at that level and has since dropped to $23,200.\n\nEthereum’s Ether, the second-largest cryptocurrency by market cap, traded upward at the beginning of the week, close to the $1,650 mark. It soon dropped to below $1,550, but it quickly recovered to now trade at $1580.\n\nOver the past week, it was revealed that cryptocurrency adoption in emerging markets has kept on rising throughout the past year, even as prices plunged and the sector was affected by a plethora of bankruptcies.\n\nAccording to CryptoCompare’s 2023 Q1 Outlook report, Binance saw its market share grow over the past year as cryptocurrency adoption grew in emerging markets, where high inflation rates led to a rise in investments in digital assets in a bid to protect wealth from depreciating currencies.\n\nBinance has been able to take advantage of this trend and is often the preferred choice for users in emerging markets. For instance, it has seen a significant increase in RUB and BRL volumes, with its BTC volumes on Binance rising by 232% and 72% respectively.\n\nWhile people in these markets have kept on adopting digital assets, in the U.S. the Securities and Exchange Commission (SEC) has once again rejected a proposal to launch a Bitcoin spot exchange-traded fund (ETF) from Cathie Wood’s ARK Invest and global crypto ETF provider 21Shares.\n\nThe SEC said that ARK has not been able to show that the rules of its exchange are sufficient to protect investors from “fraudulent and manipulative acts and practices.” The SEC was this week criticized by the CEO of Grayscale Investments, Michael Sonnenshein, who said that he believes the regulator has been slowing down Bitcoin’s progress.\n\nIn a letter, Sonnenshein said he agreed with an assertion that the SEC was “late to the game” when it came to cryptocurrency regulation and preventing the collapse of FTX and criticized its “one-dimensional approach of regulation and enforcement.”\n\nAnother notable development came from credit-ratings giant Moody’s, which is said to be working on a scoring system for stablecoins as the asset class keeps growing. The system will include an analysis of up to 20 stablecoins based on the quality of attestations on the reserves backing them.\n\nTesla’s Bitcoin holdings remain unchanged\n\nOver the week it was also revealed that the electric car market Tesla hasn’t bought or sold any Bitcoin in the last quarter of 2022, making it the second straight quarter in which the company’s BTC holdings remain unchanged. The value of Tesla’s Bitcoin holdings has dropped from $218 million to $184 million.\n\nThe decrease was caused by losses from the drop in Bitcoin’s value. At Q3 end, BTC was nearly $20,000, and at Q4 end, the crypto was around $16,500. Tesla didn’t alter its Bitcoin holdings during Q3 2022 but in Q2, it sold $936 million worth of BTC (about 75% of its holdings) to raise funds amid COVID-19 lockdown concerns in China.\n\nMeanwhile, bankrupt cryptocurrency lender Celsius Network has revealed it’s considering issuing a token to repay creditors as part of a proposal to reorganize and exit bankruptcy as a regulated cryptocurrency firm.\n\nDuring a video-court hearing, company attorney Ross Kwasteniet said that restructuring Celsius into a publicly-traded licensed company would generate more revenue for creditors, compared to selling its assets at current prices.\n\nBlockFi, another bankrupt crypto lender, has been revealed to have had over $1.2 billion in assets tied to Sam Bankman-Fried’s FTX and Alameda Research, according to financials that were recently uploaded without the redactions.\n\nThe cryptocurrency lender filed for Chapter 11 bankruptcy in November, after the failure of FTX, which had planned to save the struggling company before its own collapse.\n\nEthereum developers bring staked ETH withdrawals closer to reality\n\nEthereum developers have moved closer to enabling withdrawals of $26 billion in staked Ethereum with the successful deployment of the first mainnet shadow fork for the Shanghai upgrade.\n\nThe Shanghai upgrade, set to launch in March, will allow stakers to withdraw their staked ETH on the network. It’s the first major update since the Ethereum Merge in September, which moved the network to Proof-of-Stake and allowed users to deposit ETH to become validators and receive rewards in newly minted ETH.\n\nJP Morgan analysts believe this flexibility for stakers to withdraw funds anytime could mark a new chapter in staking for Coinbase, as locked staked ETH has been a disincentive to stake ETH in the past.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1zdGFydHMtbmV3LWdlb21ldHJpYy1jeWNsZS0xNTBrLXdpdGhpbi1yZWFjaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin starts new geometric cycle; $150k within reach? - Finbold - Finance in Bold",
        "content": "In line with the sentiment on the general cryptocurrency market, Bitcoin (BTC) has been seen slowly consolidating from its bullish movements that started at the turn of the year, but some signs indicate the possibility of a parabolic rally in the future.\n\nAs it happens, Bitcoin has recently started a new geometric cycle, which suggests that there is a chance its price could soar to as high as $150,000, according to the detailed examination of its current activities by the cryptocurrency analytics team TradingShot using the finance tracking website TradingView published on January 31.\n\nWhat does this mean?\n\nAs they explained, Bitcoin has been seen “aggressively rebounding,” after the logarithmic moving average convergence divergence (LMACD) on the one-week time-frame hit and bounced on its historic support that formed the 2015 and 2018 cycle bottoms, suggesting a new bull cycle has started.\n\nIllustrated by the geometric shapes from bottom to top and accompanied by the indicators, including the Ichimoku Cloud and Fibonacci moving averages (MA), the resulting pattern appears for the possible Bitcoin movements from Tuesday, January 31 onward.\n\nBitcoin price action analysis and predictions. Source: TradingShot/TradingView\n\nAs the analysts explained:\n\n“First, consider that the next cycle bottom could be around October 2026 if the (approximately) 1,430-day (205-week) time range holds. The next (and final, according to this model) bullish confirmation of the new cycle is the price entering the (red) Ichimoku Cloud.”\n\nSix-figure predictions align\n\nAccording to the team, “when this happened in June 2012, October 2015, and May 2019, the bull cycle never looked back (an obvious exception, of course, is the March 2020 crash due to COVID).” Furthermore, a break above multiple three of the Fib MAs will most likely kickstart the parabolic rally (but most likely, this will be after halving 4), as it has done during all previous bull cycles.”\n\nTaking into account the plotting of the past cycles, this geometric adjustment places them “fairly easily” within the projected current one, and the experts add that “we should see the next cycle top around August 2025.”\n\nInterestingly, the above analysis goes in hand with the predictions of Bloomberg’s senior commodity expert Mike McGlone, who earlier said on January 30 that Bitcoin could hit $100,000 sometime around the next halving or by 2025, as Finbold reported.\n\nBitcoin price analysis\n\nAs things stand, the flagship decentralized finance (DeFi) asset is currently changing hands at the price of $23,068, which represents a decrease of 0.11% in the last 24 hours but nonetheless an increase of 0.36%, and a more significant 39.46% gain over the previous month.\n\nBitcoin 30-day price chart. Source: Finbold\n\nIt is also important to note that the maiden crypto has been profitable for its holders almost 90% of the time in its traded history, as it recorded close to 4,000 profitable days in nearly 12 and a half years, thanks to the aggressive adoption of Bitcoin.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1iaXRjb2luLXByaWNlLWZvci1mZWJydWFyeS0yOC0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Machine learning algorithm sets Bitcoin price for February 28, 2023 - Finbold - Finance in Bold",
        "content": "With a 40% increase since the beginning of the year, Bitcoin (BTC) is off to a great start in 2023. Bullish momentum has emerged as a consequence of investors grabbing on optimistic news about macroeconomic issues, and investors hope that current levels may serve as a foundation for the first cryptocurrency to continue its upward trajectory in February.\n\nAs Bitcoin looks to finish January making its fourth consecutive weekly green candle for the first time since August 2021, investors will be hoping for more of the same come the end of next month. Notably, the machine learning algorithms at PricePredictions project that Bitcoin will likely continue to climb further to trade at $24,342 on February 28, 2023.\n\nIn comparison, the crypto community at CoinMarketCap predicts that Bitcoin will change hands at an average price of $20,254 on February 28, 2023.\n\nThe artificial intelligence forecasts use different technical indicators, such as the Bollinger Bands(BB), moving averages (MA), moving average convergence divergence (MACD), relative strength index (RSI), and others; price forecast represents an increase of 4.5% from Bitcoin’s price at the time of publishing.\n\nBitcoin 30-day price forecast chart. Source: PricePredictions\n\nNotably, halfway through the month, Bitcoin is projected to stand at $23,868 on February 14, 2023, on Valentine’s Day, as per data collected on January 24.\n\nBitcoin price analysis\n\nAt press time, Bitcoin’s price was trading at $23,269, with a minor loss of about 0.68% in the last 24 hours. On the weekly chart, the asset has climbed by 1.63%.\n\nBitcoin one-day price chart. Source: Finbold\n\nBitcoin’s technical analysis on TradingView is mixed, with the summary aligning with the ‘buy’ sentiment at 14 while moving averages are for the ‘strong buy’ at 12. Oscillators are pointing at ‘neutral’ with 8.\n\nBitcoin 1-day technical analysis. Source: TradingView\n\nThe price of Bitcoin is maintaining its upward momentum in the market, and it is now on track to finish this month with its best monthly performance since 2013. However, when compared year over year, it continues to show losses that are more than 38%.\n\nConcerning the fear and greed index, the development that has taken place in Bitcoin over the last month is remarkable, as it has completely abandoned the severe fear, fear, and neutral positions. After a significant amount of time spent in greed, he is now already positioned with a 61.\n\nBitcoin investors will pay close attention to the Federal Reserve meeting that begins this week. This will be the first meeting of the year, and market analysts anticipate that it will result in a more moderate increase in interest rates, of up to 25 basis points from the previous 50 basis points.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vY29tbW9kaXR5LWd1cnUtbWlrZS1tY2dsb25lLXNlZXMtYml0Y29pbi1hdC0xMDBrLWJ5LTIwMjUtaGVyZXMtd2h5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Commodity guru Mike McGlone sees Bitcoin at $100k by 2025; Here's why - Finbold - Finance in Bold",
        "content": "The cryptocurrency industry has started the new year on a bullish note, although it has been consolidating slightly in recent days. Senior commodity strategist at Bloomberg Mike McGlone shared his views on the future of the market and its representative asset, Bitcoin (BTC).\n\nIndeed, McGlone admitted that he was not yet bullish on cryptocurrencies in the short term, but that Bitcoin could reach six figures in the next couple of years, as he told Scott Melker, a.k.a. Wolf of All Streets, in an interview published on January 30.\n\nCommenting on the market movements in general, he explained that:\n\n“The correlations have all gone almost one-to-one, certainly on the way down and bounced back up this year, and the key leading indicator has been crypto. So with that view, I just can’t get bullish on cryptos yet in the short term.”\n\nAs for the flagship decentralized finance (DeFi) asset, McGlone has retained his well-known optimistic attitude for the long term, previously stating that Bitcoin could outperform gold as its top competitor in the future. According to him:\n\n“I fully expect Bitcoin in the next couple of years, by probably around the halving, maybe 2025, to get to $100,000.”\n\nCrypto shakeout = long-term success?\n\nMcGlone added that the recent “massive shakeout in the crypto market has cleansed it,” getting “rid of some of the bad players, and unfortunately, some innocents get hurt,” reiterating that this “really cleanses the market for a good longer-term run,” which, as he said, wasn’t witnessed in the stock market.\n\nIn terms of Bitcoin, its fourth halving event, which is set to take place in May 2024, further halving the award of every block created to 3.125 BTC apiece, is widely regarded as a critical event that could trigger a significant upward pump for the price of the maiden crypto.\n\nIn December, the commodities expert also predicted a ‘warm spell’ for Bitcoin, suggesting it would resume its rally in 2023 and potentially outperform the financial markets, under the influence of the Federal Reserve pivoting to easing its aggressive monetary policy.\n\nBitcoin price analysis\n\nMeanwhile, at the time of publication, Bitcoin was trading at the price of $22,898, which represents a decline of 0.39% on the day and 0.38% over the previous week but still a notable gain of 38.44% compared to 30 days before, according to the data retrieved on January 31.\n\nBitcoin 30-day price chart. Source: Finbold\n\nAt the same time, it is also worth noting that Bitcoin was profitable for its holders nearly 90% of the time since it started trading, recording 3,984 profitable days out of 4,545 (close to 12 and a half years), fueled by the asset’s aggressive adoption, as Finbold reported earlier.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk.\n\nWatch the entire video below:"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYm9sZC5jb20vd29sZi1vZi13YWxsLXN0cmVldC1qb3JkYW4tYmVsZm9ydC1zaGFyZXMtaGlzLW91dGxvb2stZm9yLWJpdGNvaW4taW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "'Wolf of Wall Street' Jordan Belfort shares his outlook for Bitcoin in 2023 - Finbold - Finance in Bold",
        "content": "Former stockbroker, commonly known as the “Wolf of Wall Street,” Jordan Belfort, has delved into the possible Bitcoin (BTC) outlook for 2023 as the crypto sector attempts to exit last year’s bear market.\n\nBelfort talked about Bitcoin during The Wolf of Wall Street podcast session, where he hosted Robert Beadles, the founder of the Monarch crypto wallet, on January 13.\n\nDuring the session, Belfort noted that amid increased talk on regulating Bitcoin, any form of legislation would likely be a bullish catalyst for the maiden cryptocurrency.\n\n“I think you’d agree that generally speaking, to the price of the asset class in general regulation, I believe, would be bullish,” Belfort said.\n\nIt is worth noting that Belfort has been a big advocate of crypto regulations, noting that assets like Bitcoin are likely to benefit in an environment whose laws are well-defined.\n\nFor instance, he pointed out that if regulations existed, the crypto market would not have undergone the recent FTX meltdown that saw customers lose money while most assets corrected.\n\nPossible Bitcoin price catalyst\n\nFurthermore, Belfort enquired about Beadles’s 2023 cryptocurrency outlook when he noted that the maiden crypto would likely surge in value if the government continues to print money and fails to control inflation.\n\nBeadles suggested that an uptick in inflation figures is a possible trigger for Bitcoin’s continued rally while projecting the enactment of more regulations.\n\n“It’s how much the Federal Reserve is going to keep printing that’s inflation that’s going to be the key issue there. I don’t see a huge uptick in Bitcoin price without inflation kicking.<…> There’s just too much regulation coming,” Beadles said.\n\nInterestingly, Bitcoin’s current rally was triggered by a slowdown in the United States inflation rate that signaled an easing of the Fed’s monetary policy.\n\nThe future of Bitcoin\n\nAt the same time, Belfort termed last year’s crypto winter as a challenging moment for the sector while noting that the industry can get a glimpse of what happens next.\n\nIn this line, Beadles pointed out that the resilience of Bitcoin could indicate that the asset is here to stay.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1wcm9maXRhYmxlLTkwLW9mLXRyYWRpbmctaGlzdG9yeS1mdWVsZWQtYnktd2lkZXNwcmVhZC1hZG9wdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin profitable 90% of trading history fueled by widespread adoption - Finbold - Finance in Bold",
        "content": "It is already clear that the cryptocurrency sector is growing, but nothing testifies to its unstoppable expansion better than the aggressive adoption growth of Bitcoin (BTC), which has been profitable for its holders almost 90% of the time since the beginning of its trading.\n\nSpecifically, Bitcoin has been profitable for 87.66% or 3,984 days of its total traded history, which amounts to 4,545 days (around 12 years and five months), as opposed to only 564 or 12.41% unprofitable days, according to the data retrieved from crypto trading platform Blockchain.com on January 30.\n\nBitcoin profitable days. Source: Blockchain.com\n\nAggressive Bitcoin adoption curve\n\nNotably, the chart shows the number of days in Bitcoin’s trading history where holding the decentralized finance (DeFi) token was profitable relative to today’s price, highlighting the aggressive growth of its adoption curve over time, also reflected in its price, as limited supply results in increased demand whenever the price moves up.\n\nFurthermore, “it also demonstrates the importance of understanding the market cycles of Bitcoin to avoid buying market cycle tops,” as “the drawdowns from cycle tops can last a long time, around 2-3 years in previous cycles.”\n\nMeanwhile, the cryptocurrency market resurgence has produced more than 44,000 new Bitcoin millionaires profiting from the 2023 bullish rally to join the elite crypto club, as Finbold reported on January 28.\n\nBitcoin price analysis\n\nBy press time, Bitcoin has slowed down its rally, changing hands at the price of $23,265, which means it has weakened 0.75% on the day but is still up 2.32% compared to seven days before, with a 40.12% gain on the monthly chart, as its market capitalization stands at $445.99 billion.\n\nBitcoin 30-day price chart. Source: Finbold\n\nIt is also worth noting that the machine learning algorithms over at PricePredictions have projected that Bitcoin would likely continue to climb further by the end of the next month, setting its price at $24,342 on February 28, 2023.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL2J1c2luZXNzLXNwb3RsaWdodC9iaXRjb2luLWJhbmstcmV2aWV3cy0yMDIzLWZyYXVkLW9yLWxlZ2l0LXRydXRoLWJlaGluZC10aGUtdHJhZGluZy1hcHAtbmV3cy0yNTgzNDHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Bank Reviews 2023 (Fraud or Legit) Truth Behind The Trading App - Outlook India",
        "content": "Bitcoin Bank trading is automated and performed by bots. Clients can set up the bot and how much influence they want to use, then start trading once they have paid an installment. Once you have traded, you can relax and let the bot bring in the cash. Bitcoin Bank has a stop-misfortune capability to help traders limit the cash that might be taken if cryptographic money markets fall. This element protects the client's venture, especially for unpredictable traders. Within 24 hours of the client requesting a withdrawal, they are paid with cash. This is an easy cycle."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDEvMzEvb3JkaW5hbHMtbGF1bmNoZXMtbmZ0cy1iaXRjb2luLW5ldHdvcmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Ordinals launches NFTs on the Bitcoin network - The Cryptonomist",
        "content": "Ordinals protocol has launched NFTs on Bitcoin’s mainnet dividing the crypto community between those who are against and polemic and those who are enthusiastic, telling how they are in favor of the project.\n\nOrdinals and NFTs on Bitcoin\n\nOrdinals is a protocol created by software engineer Casey Rodarmor, who officially launched the program on Bitcoin’s mainnet on 21 January last year, which allows NFTs to be created.\n\nInscriptions are made on sats, which are tracked and transferred using ordinal theory, which gives sats individual identities and allows them to be tracked and transferred across transactions.https://t.co/DtAddPfuPP — Casey (@rodarmor) January 20, 2023\n\nEssentially, the protocol enables Bitcoin’s version of NFTs, described as “digital artifacts” that can include JPEGs, PDFs, or video or audio formats. Rodarmor is a former Bitcoin Core contributor who designed Ordinals to enable the transfer of individual satoshi over the Bitcoin network.\n\nOrdinals and Bitcoin NFTs: Rodarmor’s design\n\nThus, this involves using Bitcoin’s blockchain like that of Ethereum, Solana or Polygon, the current proof-of-stake blockchains pioneered by the NFT industry. Moreover, the Ordinals protocol would be a system for numbering satoshi, giving individual satoshi a serial number, and then tracking them in transactions.\n\nDespite the fact that digital collectibles have been on Bitcoin’s blockchain since 2014, some are now expressing disappointment with Ordinals, while others are excited about the evolution the protocol would bring to the Bitcoin mainnet.\n\nAnd indeed, on this subject, Rodarmor himself, in a roundup of tweets, comments on the controversy that has been brewing in recent days.\n\nI welcome the debate and criticism! It is a sign of the health of the Bitcoin community. I encourage everyone to keep it civil and avoid personal attacks. — Casey (@rodarmor) January 29, 2023\n\nOrdinals’ Bitcoin NFTs: crypto community divided between naysayers and supporters\n\nWhile Rodarmor takes the various controversies philosophically, here’s what the launch of his Ordinals protocol and Bitcoin NFTs has sparked.\n\nThe Bitcoin maximalist, CEO and co-founder of Blockstream, said:\n\n\"you can't stop them\" well ofc! bitcoin is designed to be censor resistant. doesn't stop us mildly commenting on the sheer waste and stupidity of an encoding. at least do something efficient. otherwise it's another proof of consumption of block-space thingy. — Adam Back (@adam3us) January 29, 2023\n\nFor someone else, Ordinals has become an affront to the principles of Bitcoin:\n\nMarginalized peoples in developing countries will have to pay more to run their Bitcoin nodes and send transactions because privileged wealthy whites want to put JPEG drawings on the blockchain as status symbols. Just because you can doesn’t mean you should. — Bitcoin is Saving (@BitcoinIsSaving) January 29, 2023\n\nHowever, there are also those who enthusiastically support Ordinals and Bitcoin NFTs:\n\nWhy it's good:\n\n– Brings more financial use cases to Bitcoin\n\n– Drives more demand for block space (aka fees) My take:\n\n– If you pay a tx fee, it's not spam.\n\n– Bitcoin is permissionless. Can't stop anyone from building it anyway. — Dan Held (@danheld) January 29, 2023\n\nNFT market: CryptoPunks dominate in terms of market cap\n\nSince the beginning of this 2023, the famous CryptoPunks have returned to dominate the NFT scene. Indeed, according to NFTGo’s data, today the total market cap of CryptoPunks’ NFT collection amounts to 820,000 ETH, placing them first in the ranking.\n\nBored Ape Yacht Club’s famous NFT collection is also high in the NFT rankings, albeit by total sales volume.\n\nIn fact, BAYC ranks first in total sales volume, which now stands at over 972,000 ETH, compared to CryptoPunk’s 959K ETH\n\nMoreover, from what has emerged, it appears that the 2023 sales volume increases are also coming from one particular NFT marketplace: Blur.\n\nOn the day of 2 January 2023, Blur had reported a total sales volume of over $98 million, surpassing the $97 million recorded on that same day by the infamous OpenSea.\n\nBlur is an NFT aggregator, where users can compare NFTs across marketplaces and manage wallets with advanced analytics and thereby purchase NFTs."
    }
]