[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3l1Z2EtbGFicy1uZnQtY29sbGVjdGlvbi1iaXRjb2luLW9yZGluYWxz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Yuga Labs Debuts First NFT Collection on Bitcoin - Blockworks",
        "content": "Parent company of the popular Bored Apes NFTs, Yuga Labs, has announced an experimental 300-piece generative art collection called TwelveFold, housed on the Bitcoin blockchain.\n\nTwelveFold is a mathematically-based art system that utilizes a 12×12 grid to represent data and comes amid the company’s debut launch on the Bitcoin blockchain.\n\nThe collection will be inscribed onto satoshis and will feature 3D and hand-drawn elements that pay tribute to the current practice of creating ordinal inscriptions by hand, according to a company blog post on Monday.\n\nThe use of a base 12 system explores the relationship between time, mathematics, and variability in what Yuga Labs describes as “a visual allegory for the cartography of data.”\n\nEach satoshi within the collection can be located by tracking when it was minted via the Ordinal Theory protocol — which continues to gain attention following its release to the Bitcoin mainnet last month.\n\nYuga Labs said its decision to pursue both the type of collection as well as its release on Bitcoin marked a departure from what’s expected from the company.\n\n“But, you know. F**k doing expected things,” the company wrote in its post. “Stepping into the Ordinals Discord a month ago felt like getting a glimpse of the 2017-era Ethereum NFT ecosystem.”\n\nIt comes as a team from Dubai launched 10,000 BTC BAYC NFTs featuring monkeys with Satoshi masks on Ordinals, earlier this month. The move raises potential copyright issues as they are not affiliated with Yuga Labs’ assets based on the Ethereum blockchain.\n\nWhile the infrastructure and tooling around inscriptions on Bitcoin are still nascent, the foundational principles of provenance, self-custody and ownership are present, Yuga Labs said.\n\nThe company expects the technology and ecosystem around inscriptions to evolve and become more sophisticated over time leading to further experimentation and releases down the road.\n\nFurther details about timing and auction mechanics are expected to be announced in the coming weeks, Yuga Labs said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjgvYml0Y29pbi1yaXNrcy1kZWVwZXItcHVsbGJhY2stdG93YXJkLTIway1jaGFydC1hbmFseXN0cy_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI4L2JpdGNvaW4tcmlza3MtZGVlcGVyLXB1bGxiYWNrLXRvd2FyZC0yMGstY2hhcnQtYW5hbHlzdHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin at Risk of Deeper Pullback Toward $20K: Chart Analysts - CoinDesk",
        "content": "\"Technically, bitcoin is selling off after touching its 200-week moving average. And due to the negative momentum at the end of the week, it has also fallen below the 50-week moving average. This dynamic may be a prologue to further declines, a predictable tug-of-war near trend levels,\" Kuptsikevich said in an email on Monday."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMjgvYml0Y29pbi1ldGhlci1vbi10cmFjay1mb3ItYS1wb3NpdGl2ZS1mZWJydWFyeS1kZXNwaXRlLWZhZGluZy0yMDIzLXJpc2stcmFsbHkuaHRtbNIBdmh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAyLzI4L2JpdGNvaW4tZXRoZXItb24tdHJhY2stZm9yLWEtcG9zaXRpdmUtZmVicnVhcnktZGVzcGl0ZS1mYWRpbmctMjAyMy1yaXNrLXJhbGx5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, ether on track for a positive February despite mid-month drop and fading 2023 risk rally - CNBC",
        "content": "Bitcoin and ether are on pace for a modest February win, even after suffering a big drop earlier in the month.\n\nBitcoin had eked out a 0.2% gain for the month by 4:15 p.m. ET, according to Coin Metrics. In January bitcoin posted a 38% rise and its best month since 2021. Meanwhile, ether had risen higher by 1.7%, following a January gain of 31%. Unlike traditional markets, the crypto market remains open 24 hours a day, even on weekends and public holidays.\n\nInvestors were spooked earlier in the month after what appeared to be the beginning of a potential regulatory crackdown on crypto businesses in the U.S. — including the Securities and Exchange Commission's enforcement action against Kraken, its Wells Notice of a future settlement against Paxos and the New York State Department of Financial Services' ordering Paxos to stop minting the Binance USD (BUSD) stablecoin.\n\nThat led to a brief sell-off in crypto assets that took bitcoin and ether down about 6% and 8.5%, respectively, in the three-day period ended Feb. 10. Although they quickly recovered those losses the following week, they've been in a bit of a lull since.\n\n\"It's pretty easy to say that the lows are behind us because there really isn't any disparate further selling, but in terms of what actually takes us higher – that's harder,\" said Jeff Dorman, chief investment officer at Arca.\n\n\"Most of the negative news right now is coming out of regulators, but it's just not really having any long-term effect on the market because everything in crypto has perfect substitutes,\" he added, meaning when certain crypto companies in the past have been hit by regulators, traders have always been able to move their activity somewhere else.\n\nWhile regulatory scrutiny is ramping in the U.S., reports that Hong Kong is planning to legalize retail crypto trading as part of a bigger push to become a global crypto hub surfaced this month, with a quiet backing from China. The move has been a positive catalyst for crypto.\n\nIn the U.S., however, investors are on Fed watch, said James Lavish, managing partner at the Bitcoin Opportunity Fund.\n\n\"Bitcoin has been the tip of the spear for risk assets for a long time,\" he said. \"It's what moves first typically when you're talking about either buying or selling risk assets as part of your portfolio allocation and when we do in fact have a Fed pivot I expect that bitcoin is going to sniff that out first. It's going to have a strong move.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLXJlbWFpbi1pbi1jaGFyZ2UtZXZlbi1pbi10aGUtZmFjZS1vZi1pbmNyZWFzaW5nLXJlZ3VsYXRvcnktZnVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bulls remain in charge even in the face of increasing regulatory FUD - Cointelegraph",
        "content": "Bitcoin (BTC) price broke above $25,000 on Feb. 21, accruing a 53% year-to-date gain. At the time, it made sense to expect the rally to continue after U.S. retail sales data from the previous week vastly surpassed the market consensus. This fuelled investors’ hope for a soft landing and a possible averted recession in the U.S. economy.\n\nThe apex of the U.S. Federal Reserve’s strategy success would be increasing interest rates and scaling back its $9 trillion balance sheet reduction without significatively damaging the economy. If that miracle happens, the outcome would benefit risk assets, including stocks, commodities and Bitcoin.\n\nUnfortunately, the cryptocurrency markets took a hit after the $25,200 level was rejected and Bitcoin price plunged 10% between Feb. 21 and Feb. 24. Regulatory pressure, mainly from the U.S., partially explains investors' rationale for the worsening market conditions.\n\nIn a Feb. 23 New York Magazine interview, Securities and Exchange Commission Chair Gary Gensler claimed “everything other than Bitcoin” is potentially a security instrument and falls under the agency’s jurisdiction. However, multiple lawyers and policy analysts commented that Gensler’s opinion is “not the law.” Hence, the SEC had no authority to regulate cryptocurrencies unless it proved its case in court.\n\nAdditionally, at a G20 meeting, U.S. Treasury Secretary Janet Yellen stressed the importance of implementing a strong regulatory framework for cryptocurrencies. Yellen’s remarks on Feb. 25 followed International Monetary Fund managing director Kristalina Georgieva pointing out that “if regulation fails,” then outright banning “should not be “taken off the table.”\n\nLet's look at Bitcoin derivatives metrics to better understand how professional traders are positioned in the current market conditions.\n\nAsia-based stablecoin demand is stagnant\n\nTraders should refer to the USD Coin (USDC) premium to measure the demand for cryptocurrency in Asia. The index measures the difference between China-based peer-to-peer stablecoin trades and the United States dollar.\n\nExcessive cryptocurrency buying demand can pressure the indicator above fair value at 104%. On the other hand, the stablecoin's market offer is flooded during bearish markets, causing a 4% or higher discount.\n\nUSDC peer-to-peer vs. USD/CNY. Source: OKX\n\nAfter peaking at 4% in late January, the USDC premium indicator in Asian markets has declined to a neutral 2%. The metric has since stabilized at a modest 2.5% premium, which should be interpreted as positive considering the recent regulatory FUD.\n\nBTC’s futures premium stuck even after price rejected at $25,000\n\nBitcoin’s quarterly futures are the preferred instruments of whales and arbitrage desks. Due to their settlement date and the price difference from spot markets, they might seem complicated for retail traders. However, their most notable advantage is the lack of a fluctuating funding rate.\n\nThese fixed-month contracts usually trade at a slight premium to spot markets, indicating that sellers are requesting more money to withhold settlement longer. Consequently, futures markets should trade at a 5% to 10% annualized premium on healthy markets. This situation is known as contango and is not exclusive to crypto markets.\n\nBitcoin 2-month futures annualized premium. Source: Laevitas\n\nThe chart shows traders flirting with the neutral sentiment between Feb. 19 and Feb. 24 as the Bitcoin price held above $23,750. However, the indicator failed to enter the neutral-to-bearish 0% to 5% area as additional regulatory uncertainty was added, especially after Gensler’s remarks on Feb. 23. As a result, it became clear that pro traders were not comfortable with Bitcoin price breaking above $25,000.\n\nRelated: Is the SEC’s action against BUSD more about Binance than stablecoins?\n\nWeak economic data shifted control to the bulls\n\nSince Feb. 25, Bitcoin price has gained 4.5%, indicating that the impact of the regulatory newsflow has been limited. More importantly, the global stock market reacted positively on Feb. 27 after the U.S. Commerce Department reported durable goods orders down 4.5% in January versus the previous month. This data added pressure for the Fed to reduce its interest rate hike program earlier than expected.\n\nSince Bitcoin's 50-day correlation with the S&P 500 futures presently stands at 83%, cryptocurrency traders are more inclined to support risk asset prices strengthening throughout the week. A correlation indicator above 70% indicates that both assets are moving in tandem, meaning the macroeconomic scenario is likely playing a pivotal role in determining the overall trend.\n\nUnless there’s added pressure from regulators or conflicting economic data, odds favor Bitcoin bulls considering the BTC futures and Asian stablecoin metrics.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NlYy1jaGFpci1nZW5zbGVyLWNvbmZpcm1zLWV2ZXJ5dGhpbmctb3RoZXItdGhhbi1iaXRjb2luLWlzLWEtc2VjdXJpdHktaW1wbGljYXRpb25zLWFuZC1hbmFseXNpcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "SEC chair Gensler confirms \"everything other than Bitcoin\" is a security: Implications and analysis - CryptoSlate",
        "content": "The following is a guest post from Anndy Lian.\n\nSEC Chair Gary Gensler reiterated that Bitcoin is not a security but a commodity under the Commodity Futures Trading Commission (CFTC) purview. He also stated that “everything else other than bitcoin is a security,” which has significant implications for regulating cryptocurrencies and digital assets in the United States.\n\nGensler’s statement reflects the SEC’s long-held view that many cryptocurrencies and digital assets are securities under U.S. law. The SEC’s definition of a security is broad — it includes any investment contract in which an individual invests money in a common enterprise with the expectation of profits solely from the efforts of others. In other words, if an asset is sold as an investment with the expectation of profit based on the efforts of others, it is likely to be considered a security.\n\nGensler’s comments have sparked debate in the cryptocurrency community. Some argue that his view is overly broad and that many digital assets do not fit the SEC’s definition of a security. Others argue that the SEC’s approach is necessary to protect investors from fraudulent or manipulative activities in the cryptocurrency market.\n\nOne of the key implications of Gensler’s comments is that many digital assets may be subject to SEC regulation. This could include initial coin offerings (ICOs), a crowdfunding campaign where investors purchase digital tokens in exchange for cryptocurrencies like Bitcoin or Ethereum. Many ICOs have been criticized for their lack of transparency and accountability, and the SEC has taken enforcement action against several ICO issuers in recent years.\n\nAnother implication is that exchanges that trade digital assets may be subject to SEC oversight. Under U.S. law, exchanges facilitating securities trading must register with the SEC and comply with various regulations. If the SEC views many digital assets as securities, then exchanges that trade those assets may also be required to register with the SEC and comply with its regulations.\n\nHis comments suggest that the SEC may take a more aggressive approach to regulating the cryptocurrency market. This could include increased enforcement actions against issuers of digital assets considered securities and against exchanges that facilitate trading those assets. It could also lead to new regulations to increase transparency and accountability in the cryptocurrency market.\n\nThe SEC’s approach to regulating cryptocurrency has been debated for several years. Some argue that the SEC’s current approach is too cautious and stifling innovation in the cryptocurrency space. Others argue that increased regulation is necessary to protect investors from fraud and manipulation.\n\nGensler’s comments suggest that the SEC will likely take a more assertive approach to regulate the cryptocurrency market in the coming years. This could include increased enforcement actions, new regulations, and closer scrutiny of digital assets and exchanges that operates in the U.S.\n\nMaybe we can take a step back to look into a few things. Firstly, it’s important to understand the context of Gensler’s statement. As mentioned earlier, Gensler reiterated the SEC’s stance in an interview with CNBC in July 2022 that Bitcoin is not a security but a commodity that falls under the Commodity Futures Trading Commission’s jurisdiction. He did not label other digital assets, avoiding answering the question directly. However, in a tweet by Jake Chervinsky in February 2023, it was suggested that Gensler may have prejudged that every digital asset aside from Bitcoin is a security.\n\nThen my question is: What exactly is a security? In the US, the Securities Act of 1933 defines a security as any investment contract, note, stock, or any other type of investment in a common enterprise with the expectation of profits solely from the efforts of others. In simpler terms, it means an asset representing an ownership interest or a right to receive future profits or cash flows from a third party.\n\nSuppose we consider Gensler’s statement that everything other than Bitcoin is a security. In that case, it implies that most digital assets such as Ethereum, XRP, and other cryptocurrencies would be considered securities under US law. This means that they would be subject to SEC regulations and oversight. It’s worth noting that this is not a new position for the SEC. For years, the SEC has warned cryptocurrency companies that their tokens could be classified as securities if they meet certain criteria.\n\nThe implications of this classification are significant. If a digital asset is classified as a security, the issuer must comply with SEC regulations, including registration and disclosure requirements. It would also have to follow strict trading, reporting, and investor protection rules. Additionally, investors would be protected under federal securities laws, which could increase their confidence in the digital asset market. However, it could also lead to additional costs and regulatory burdens for the companies issuing digital assets.\n\nMy opinion on this matter is that while Gensler’s statement may have been perceived as a blanket statement, the SEC’s approach to regulating cryptocurrencies is nuanced and fact-specific. The SEC has been clear that it will evaluate each token on a case-by-case basis to determine whether it meets the legal definition of a security. In other words, just because a digital asset is not Bitcoin does not automatically mean it’s a security.\n\nFurthermore, regulatory oversight is necessary for the cryptocurrency market to mature and gain mainstream adoption. The lack of clear regulations has been a major roadblock for institutional investors, who are hesitant to invest in a market perceived as unregulated and risky. Clear regulations would also protect retail investors who may not have the knowledge or resources to navigate the complex world of cryptocurrencies.\n\nTo conclude, while Gensler’s statement that “everything other than Bitcoin” is a security may have caused some alarm in the cryptocurrency community, we believe that it’s important to view it in the context of the SEC’s broader approach to regulating digital assets. The SEC’s focus on investor protection and market integrity is crucial for the long-term success of the cryptocurrency market.\n\nAs the market continues to evolve, we expect that the SEC’s approach will continue to evolve, and we look forward to seeing how it develops. Meanwhile, I hope SEC can be more precise and take a more responsible stance when putting statements out in the market.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1vcmRpbmFscyUzQS13aGF0LWludmVzdG9ycy1zaG91bGQta25vd9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals: What Investors Should Know - Nasdaq",
        "content": "By Landon Manning\n\nA new project has appeared on the crypto scene, creating a new use case for Bitcoin; a system for tracking individual satoshis on the Bitcoin blockchain, effectively enabling Bitcoin NFTs.\n\nThis project, led by a former Bitcoin Core developer Casey Rodarmor, is essentially a protocol for assigning numbers to specific satoshis that can allow them to be tracked and specifically transferred. Representing one hundred-millionth of a single bitcoin, the satoshi is the smallest unit of bitcoin that can be used in transactions. By using the Ordinal protocol, users can assign content to a satoshi that they please, essentially opening the door for NFTs to run directly on Bitcoin’s blockchain.\n\nNFTs (non-fungible tokens) can be a contentious issue, not only in the greater world of traditional finance but also among crypto advocates and Bitcoiners in general. The launch of this program immediately saw pushback from within the Bitcoin community, with people claiming that such an asset has little to do with Bitcoin adoption or daily usage for most people, and might even take up valuable resources. Still, there has been significant interest in Ordinals, as more than 90,000 inscriptions have been minted over the course of about a month.\n\nFor many, the purpose of an NFT is to create a speculative financial instrument, allowing users to provide a specific tracker for a piece of code, typically a piece of artwork, that cannot be replicated even if the art itself is copied. The first generation of NFTs, largely based on Ethereum’s blockchain, bubbled to widespread popularity in 2022 before popping spectacularly in the year’s subsequent crypto crash. If NFTs are to slowly return, finding use cases in things like online stores for video games or social media, it seems reasonable to believe that a Bitcoin infrastructure will provide many distinct advantages over an Ethereum one. Because each Ordinal inscription is tied to a satoshi, this will make their verification system “on-chain” at a fundamental level, instead of previous attempts that have a third-party workaround to merely align with an existing blockchain.\n\nAlthough there is certainly skepticism about the viability of Ordinals in the long term, the buzz of excitement from its nascent community can definitely be seen as a positive for Bitcoin. As Fortune pointed out, bitcoin’s price bounce in early 2023 is largely correlating with the emergence of Ordinal. It quotes Jon Wong from the Solana Foundation as saying, “As Ordinal mints have increased, the minters have been willing to pay the miners, the computers that run and secure Bitcoin’s blockchain, more and more in transaction fees.” In other words, then, the increased frenzy could be one of the reasons behind bitcoin’s recent price increase.\n\nAlthough the long-term staying power of Ordinals is unclear at the moment, it can’t be denied that ideas like this are a prime example of the endless iterations and innovations made by a strong Bitcoin community. The emergence of new ideas and technologies like Ordinals have provided many of the great use-cases of Bitcoin over the years, and both successful and failed projects can stimulate interest and activity in Bitcoin itself. Potential investors will have to choose carefully before deciding to put money into this new project, but for those who already have exposure to NFTs, it seems a no-brainer to bet on Bitcoin.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMDIvMjgvMTA2OTE5MC9ldGhlcmV1bS1tb3ZlZC10by1wcm9vZi1vZi1zdGFrZS13aHktY2FudC1iaXRjb2luL9IBamh0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMDIvMjgvMTA2OTE5MC9ldGhlcmV1bS1tb3ZlZC10by1wcm9vZi1vZi1zdGFrZS13aHktY2FudC1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum moved to proof of stake. Why can’t Bitcoin? - MIT Technology Review",
        "content": "Bitcoin mining, the computationally intensive process by which new coins are created and accounted for, has become a global concern. After China cracked down on the process in mid-2021, miners sought out other areas of the world where energy was cheap, but not always clean. In places like Kazakhstan, miners put pressure on the power grid, which relies heavily on carbon-intensive coal-fired power stations, causing localized blackouts and contributing to civil unrest. In upstate New York, where miners took over shuttered factories and empty warehouses, locals have complained of rising energy bills and the high-frequency whine of whirring data center fans—and worried about the environmental toll mining is taking. The US currently hosts 38% of all bitcoin mining operations.\n\nA single Bitcoin transaction uses the same amount of energy as a single US household does over the course of nearly a month. But does it have to be that way? The Bitcoin community has historically been fiercely resistant to change, but pressure from regulators and environmentalists fed up with Bitcoin’s massive carbon footprint may force them to rethink that stance.\n\nA variety of other countries, including Kazakhstan, Iran, and Singapore, have also set limits on crypto mining. In April 2023, the European Parliament is due to pass a landmark crypto bill called Markets in Crypto Assets (MiCA), which mandates environmental disclosures from crypto firms. The law is expected to go into force sometime in 2024.\n\nThat may be just the start for the EU: the European Central Bank has previously stated it cannot imagine a world where governments would ban gasoline-powered cars in favor of electric vehicles but not act on Bitcoin’s persistence in pumping out CO2. “Some members of the European Parliament are already wondering why Bitcoin is not following Ethereum,” Alex de Vries, the data scientist behind Digiconomist, a website that tracks cryptocurrency energy use, told MIT Technology Review.\n\nEfforts to crack down on Bitcoin’s waste are gaining steam in the US as well. In November, New York became the first state to enact a temporary ban on new cryptocurrency mining permits at fossil-fuel plants. The new law also requires New York to study crypto mining’s impact on the state’s efforts to reduce its greenhouse-gas emissions.\n\nSo what would it take to make a switch?\n\nProof of work vs. proof of stake\n\nCryptocurrencies have no central guardian, like a bank, to oversee their public ledgers—the shared digital record of every transaction on the blockchain. Instead, they rely on consensus mechanisms to agree on updates. In proof of work, the approach Bitcoin relies on, a worldwide network of computers—known as “miners”—spends electricity trying to win a lottery of sorts. Whoever wins gets to append the next block and collect new coins in the process. The chance of winning is in direct proportion to the number of computations a miner does. As a result, massive server farms have sprung up around the globe dedicated solely to winning this lottery.\n\nProof of stake, the approach Ethereum now uses, does away with this massive energy consumption. Instead of miners, proof-of-stake systems employ vast numbers of “validators.” To become a validator, you have to deposit, or “stake,” a set amount in coins—32 ether, in the case of Ethereum. Staking gives validators a chance to check new blocks of transactions and add them to the blockchain so they can earn rewards on top of their staked coins. The more coins you stake, the better your odds of getting picked to add the next block of transactions to the chain."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjgvY29udGludWVkLXRoaW5uaW5nLW9mLWxpcXVpZGl0eS1pbi1iaXRjb2luLWFuZC1ldGhlci1tYXJrZXQtd29ycmllcy10cmFkZXJzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjgvY29udGludWVkLXRoaW5uaW5nLW9mLWxpcXVpZGl0eS1pbi1iaXRjb2luLWFuZC1ldGhlci1tYXJrZXQtd29ycmllcy10cmFkZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto Traders Worried About Liquidity Thinning in Bitcoin and Ether - CoinDesk",
        "content": "Data from Paris-based crypto data provider Kaiko show bitcoin's 2% market depth for USDT pairs aggregated from 15 centralized exchanges has slipped to 6,800 BTC, the lowest since May 2022 when the Terra network collapsed and below the level that followed the demise of crypto exchange FTX. It's down significantly from the October highs of above 15,000 BTC. Ether's 2% market depth has more than halved to 57,000 ETH since October, led by Binance."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzI4L2JpdGNvaW4tbWluZXItbWFyYXRob24tZGlnaXRhbC10by1yZXN0YXRlLXNvbWUtcmVzdWx0cy1vbi1hY2NvdW50aW5nLWlzc3Vlcy_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yOC9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLWRpZ2l0YWwtdG8tcmVzdGF0ZS1zb21lLXJlc3VsdHMtb24tYWNjb3VudGluZy1pc3N1ZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Marathon Digital to Restate Some Results on Accounting Issues - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI3L2FsbHVyZS1vZi1iaXRjb2luLW9yZGluYWxzLWRlZmktZHJpdmVzLWNyeXB0by1mdW5kcy10by1iaXRjb2luLWxheWVyLTItdG9rZW4tc3RhY2tzL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI3L2FsbHVyZS1vZi1iaXRjb2luLW9yZGluYWxzLWRlZmktZHJpdmVzLWNyeXB0by1mdW5kcy10by1iaXRjb2luLWxheWVyLTItdG9rZW4tc3RhY2tzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Allure of Bitcoin Ordinals, DeFi Drives Crypto Funds to Bitcoin Layer 2-Token Stacks - CoinDesk",
        "content": "Stack’s STX tokens have jumped 23% in the past 24 hours, adding to a 50% surge over a seven-day rolling period, CoinGecko data shows. Demand for the tokens has increased since the arrival of the Ordinals protocol, which went live on Jan. 21 and allows users to inscribe references to digital art into small transactions on the Bitcoin blockchain. The token's market cap topped $1.2 billion as of Monday."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yOC9iaXRjb2luLWNvcmUtZGV2ZWxvcGVyLWx1a2UtZGFzaGpyLWNhbGxzLW91dC11bmF1dGhvcml6ZWQtb3JkaW5hbC1uZnQtd2l0aC1oaXMtbmFtZS_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMjgvYml0Y29pbi1jb3JlLWRldmVsb3Blci1sdWtlLWRhc2hqci1jYWxscy1vdXQtdW5hdXRob3JpemVkLW9yZGluYWwtbmZ0LXdpdGgtaGlzLW5hbWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Core Developer Luke Dashjr Calls Out Unauthorized Ordinal NFT With His Name - CoinDesk",
        "content": "Dashjr also said on Twitter that someone – again, not identified – purportedly with Scarce.City reached out to him to “donate” to him 90% of its value. He has been a vocal critic of the Ordinals protocol, telling CoinDesk in a previous statement that it was an “attack” on Bitcoin."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzAxL2NyeXB0by1tYXJrZXQtZmVicnVhcnktcm91bmR1cC1iaXRjb2luLWxheWVyLTItcHJvdG9jb2wtc3RhY2tzLWV0aGVyZXVtLXN0YWtpbmctZGVyaXZhdGl2ZS10b2tlbnMtc3VyZ2Uv0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvY3J5cHRvLW1hcmtldC1mZWJydWFyeS1yb3VuZHVwLWJpdGNvaW4tbGF5ZXItMi1wcm90b2NvbC1zdGFja3MtZXRoZXJldW0tc3Rha2luZy1kZXJpdmF0aXZlLXRva2Vucy1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market February Roundup: Bitcoin Layer 2 Protocol Stacks, Ethereum Staking Derivative Tokens Surge - CoinDesk",
        "content": "“Altcoin cycles tend to be short-lived, but this is beyond the norm and has all the hallmarks of a bored market chasing opportunities, in addition to no new capital inflows,” he wrote, adding: “Poor liquidity facilitates this erratic pattern, and you do not want to be the one holding the bag when the music ends.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDIvMjcveXVnYS1sYWJzLWFubm91bmNlcy1nZW5lcmF0aXZlLW9yZGluYWxzLW5mdC1jb2xsZWN0aW9uLW9uLWJpdGNvaW4tYmxvY2tjaGFpbi_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vd2ViMy8yMDIzLzAyLzI3L3l1Z2EtbGFicy1hbm5vdW5jZXMtZ2VuZXJhdGl2ZS1vcmRpbmFscy1uZnQtY29sbGVjdGlvbi1vbi1iaXRjb2luLWJsb2NrY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bored Ape-Parent Yuga Labs' Next NFTs Will Live on Bitcoin Blockchain - CoinDesk",
        "content": "While Yuga Labs’ empire is built upon the success of its blue-chip Bored Ape Yacht Club collection, which recently expanded its ecosystem through its skill-based mint Dookey Dash, the company specified that its new collection does not come with extended utility or has any affiliation to its current Ethereum-based collections."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8yNy9nYXJ5LWdlbnNsZXJzLXRha2Utb24tY3J5cHRvLWRvZXNudC1tYXR0ZXIv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAyLzI3L2dhcnktZ2Vuc2xlcnMtdGFrZS1vbi1jcnlwdG8tZG9lc250LW1hdHRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Gary Gensler’s Take on Crypto Doesn’t Matter - CoinDesk",
        "content": "Bitcoin market manipulation should be stomped out too, it’s not just a nonbitcoin crypto problem. It’s not like commodities are immune from market manipulation or anything like that (just ask gold and silver). Practically, from the perspective of a lawyer, trader or entrepreneur, it might matter if Gensler stands up and contends that some asset is a security."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMjgvcHJvcG9zZWQtYml0Y29pbi12YXVsdC1mZWF0dXJlLWNvdWxkLXRod2FydC1tYWxpY2lvdXMtaGFja2Vycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Proposed Bitcoin Vault Feature Could Thwart Malicious Hackers - CoinDesk",
        "content": "O’Beirne recommended Speedy Trial – the same process used to activate the 2021 Taproot upgrade – as the preferred method for activating op_vault. Speedy Trial allocates a three-month activation window for the Bitcoin network to reach a threshold of miners who signal support for a proposed upgrade. The upgrade is adopted only if that specific threshold is reached. The use of Speedy Trial isn’t without its detractors, some of whom believe it gives certain groups within the Bitcoin community too much influence."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRlcG90LWNvbnZlcnRzLWJ0Yy1hdG1zLXRvLXNvZnR3YXJlLXRvLXJlZHVjZS1vcGVyYXRpbmctY29zdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Depot converts BTC ATMs software to reduce operating costs - Cointelegraph",
        "content": "Disclaimer: The article has been updated to reflect that Bitcoin Depot converted the operating software of the Bitcoin ATMs.\n\nCrypto ATM installations have seen a steady decline across the world over the past several months. While some ATMs have been taken out of operation due to geopolitical tensions and revenue decline, providers like Bitcoin Depot have started converting the operating software of physical Bitcoin (BTC) ATMs to improve bottom lines.\n\nBitcoin Depot recently converted the operating software of all 7,000 crypto ATMs and kiosks to a software-based offering powered by BitAccess. The software conversion drive came after Bitcoin Depot acquired majority equity in Bitaccess in November 2022. Months before the deal, Bitcoin Depot had revealed plans to go public in 2023 via an $885 million deal with a special-purpose acquisition company.\n\nThe software conversion of the crypto ATMs, which vertically integrates Bitcoin Depot’s hardware and software, eliminates annual software licensing fees. The fees previously accounted for $3 million in annual operational costs.\n\nCrypto ATM growth by manufacturers. Source: Coin ATM Radar\n\nIn the first half of 2022, BitAccess became a market leader. However, since July 2022, the company has seen a consistent decline in total ATM installations, confirms data from Coin ATM Radar.\n\nAs shown in the above graph, BitAccess is currently down to third position after Genesis Bytes and Genesis Coin, both of whom have increased their market share in the same timeline. Explaining the motive behind the move, Bitcoin Depot’s vice president of BTM operations, Jason Sacco, stated:\n\n“By swapping out the existing hard drive with one preloaded with BitAccess software, we quickly completed the software conversion while avoiding certain technical issues that can happen in field conversion projects.”\n\nSacco also revealed that the first 6,000 of Bitcoin Depot’s Bitcoin ATMs were software converted in 10 weeks. The increase in crypto ATMs is directly proportional to the amount of crypto exposure for the general public.\n\nWhen El Salvador opted for Bitcoin as a legal tender, President Nayib Bukele announced the country would build a supporting infrastructure of 200 ATMs and 50 branches.\n\nRelated: Australia overtakes El Salvador to become 4th largest crypto ATM hub\n\nThe United Kingdom’s financial regulator, the Financial Conduct Authority (FCA), recently announced that all crypto ATMs operating in the U.K. are unregistered and illegal.\n\nAt the time, FCA’s executive director of enforcement Mark Steward shared the intention to disrupt unregistered crypto businesses in the country."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV4Y2hhbmdlcy1ub3ctb3duLTE2LWxlc3MtYnRjLXRoYW4tdGhlLW9sZGVzdC1ob2RsZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin exchanges now own 16% less BTC than the oldest hodlers - Cointelegraph",
        "content": "The latest data shows that Bitcoin (BTC) exchanges have less BTC to buy than at any time since early 2018.\n\nOn-chain analytics firm Glassnode confirms that as of February 2023, exchange reserves are at five-year lows.\n\n“Wild stat” shows Bitcoin supply maturation\n\nThe latest statistics reflect the determination of Bitcoin hodlers, as major exchanges’ BTC balances are in “down only” mode.\n\nAs of Feb. 27, the latest date for which data is available, the platforms tracked by Glassnode held a combined 2,272,798 BTC.\n\nIt was in March 2018 that the number was previously so low, with March 2020 representing the current all-time high of 3,202,326 BTC.\n\nAfter the COVID-19 cross-market crash, exchange reserves began to fall, accelerating through the 2022 bear market to stand 29% lower today.\n\nBitcoin exchange balance chart. Source: Glassnode\n\nThe impressive numbers, meanwhile, do not end there.\n\nAs noted by William Clemente, co-founder of Bitcoin-focused research firm Reflexivity, the exchange balance lows mean they now hold less BTC than the oldest hodler addresses.\n\n“There is now more Bitcoin that hasn’t moved in at least 10 years than there is on exchanges. Wild stat,” he commented on Feb. 28.\n\nGlassnode data also puts the total BTC dormant for ten years or more at 2,645,956 BTC — 16% more than the total exchange balance.\n\nBTC supply last active 10+ years ago chart. Source: William Clemente/ Twitter\n\nNo panic selling here\n\nAs Cointelegraph reported, hodlers have stepped up their resilience in 2023 after weathering a brutal bear market in the past year.\n\nRelated: BTC whale population shrinks to early 2020 levels — 5 things to know in Bitcoin this week\n\nEven as BTC price action headed higher, the hodling continued, with limited sales combined with increasing exposure.\n\nThat trend shows little sign of reversing at current levels, with hodlers’ combined net position change reaching four-month highs this weekend.\n\nBitcoin hodler net position change chart. Source: Glassnode/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1wcmljZS1sYXRlc3QtYnVsbC1tYXJrZXQtMjAyMy1iMjI5MDI5Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price set for second month-on-month rise for first time since 2020 - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThe price of bitcoin is looking to close February up more than 40 per cent since the start of the year, marking the most positive start to a year for the cryptocurrency since the record-breaking 2021.\n\nBitcoin is currently trading at just above $23,000, having dipped slightly from the eight-month highs of $25,000 last week.\n\nIt is a significant price increase from last November, when BTC hit two-year lows of below $16,000 – down more than 70 per cent from its record high from November the previous year.\n\nIt has given hope that bitcoin is finally transitioning from a bear market to a bull market, and that the so-called “crypto winter” is coming to an end.\n\nDespite the recent price gains, bitcoin remains a long way off its former peak and continues to face resistance at around the $25,000 level.\n\nWhether the move into a bull market can be achieved will depend on whether this price can be surpassed over the coming days, according to Mike McGlone, a senior macro strategist at Bloomberg Intelligence.\n\n“Headwinds remain strong,” he wrote on Twitter. “$25,000 resistance may prove significant for all risk assets.”\n\nCrypto market analysts warned on Monday that further interest rate rises in the US could prove detrimental to bitcoin and the broader cryptocurrency space.\n\n“While still markedly above their lows, the crypto market is looking tentative in the face of the possibility of stickier than expected inflation and labour market in both the US and elsewhere,” said Simon Peters, an analyst at the online trading platform eToro.\n\n“This macro data is key in central banks’ thinking around rate hikes with main markets now pricing in no rate cuts in 2023. While bitcoin and ether don’t seem to be in full on fear, there is most certainly an element of jitters among market participants watching for fresh updates, and this is showing in the price movement of the past week.”\n\nOther analysts remained hopeful that bitcoin could continue its upward momentum, with popular commentator Kaleo claiming that $30,000 is “still a magnet”."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdGFja3Mtc3R4LXN1cmdlcy1hcy1iaXRjb2luLW5mdC1oeXBlLWdyb3dzLWJ1dC1pdHMtYmxvY2tjaGFpbi1hY3Rpdml0eS1yYWlzZXMtY29uY2VybtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Stacks (STX) surges as Bitcoin NFT hype grows, but its blockchain activity raises concern - Cointelegraph",
        "content": "Stacks is one of the first blockchains to enable a way for minting Bitcoin (BTC) Ordinals, which puts it in an excellent position to benefit from the hype. However, Ordinals have invoked an issue from the past where Bitcoin maximalist ideologies will be tested if the NFTs lead to network congestion.\n\nOn top of that, Stacks has yet to deliver all the functionalities required to support an NFT trading ecosystem and it faces competition from projects in other blockchain ecosystems. The fundamental and technical analysis of the project suggests that the price surge might have reached overbought conditions and may correct in the near term.\n\nOrdinals development is unpredictable for now\n\nThe recent focus on inscribing NFTs on the Bitcoin network peaked in the last month after Casey Rodarmor inscribed an Ordinal on Jan. 29. While the trend took off to an overwhelming start, the minting is limited to technical users with a Bitcoin node and trading primarily takes place through OTC channels.\n\nIn comparison to Ethereum NFT marketplaces, the infrastructure for Bitcoin NFT trading remains significantly underdeveloped in regards to complex activities like decentralized trading. Many investors have expressed their belief that there needs to be a way to spin up marketplaces and NFT minting platforms for Ordinals.\n\nThe Bitcoin developer community has previously discouraged using the network for anything other than payments because it clogs the space and increases transaction fees. In the bull run of 2020 and 2021, many Ethereum users paid hundreds of dollars in fees per transaction as user activity on it exploded. On the other hand, Bitcoin’s fees stayed at optimum levels throughout the bull run, but the usage and earnings of the protocol lagged behind Ethereum.\n\nAccording to a CoinShare report, the adoption of Ordinals will again be subject to the social acceptance of the method to inscribe additional data on the Bitcoin blockchain, which is bound to present challenges such as network congestion and increased fees.\n\nThe report goes on to review previous failed attempts to use the Bitcoin blockchain for smart contract activity, saying that “similar projects of Bitcoin’s past have had little impact on investors and users alike.”\n\nThe number of Ordinals inscribed on Bitcoin surged significantly at the start of February as the instrument exploded. However, the trend slowed down due to a lack of trading infrastructure, with less than 10,000 NFTs inscribed on most days.\n\nStack blockchain’s native STX (STX) token jumped by 256% in February, thanks to hype around Bitcoin NFTs and an upcoming upgrade to the project.\n\nNumber of ordinals inscribed on Bitcoin daily. Source: Dune\n\nIt remains to be seen how the Bitcoin community reacts to an increase in network congestion and Bitcoin fees if the Ordinals hype grows.\n\nStacks price rises on speculation, while activity is low\n\nThe idea is that Stacks will make Bitcoin Ordinals more accessible to users by facilitating minting processes and hosting marketplaces.\n\nStacks Foundation, the team managing the blockchain, on Feb. 22 announced a new upgrade to the protocol, Stacks 2.1, which seeks to improve the blockchain by adding EVM compatibility and synthetic Bitcoin (sBTC) through a secure bridge to Bitcoin.\n\nOn top of that, the .BTC naming service lives on the Stacks network, which could generate a lot of trading activity if the demand for .BTC addresses increases. In its current state, a .BTC Stacks address is largely detached from the Bitcoin network. Meaning, users cannot send and receive Bitcoin at these addresses like its .ETH counterpart.\n\nAfter the 2.0 upgrade, Stacks will enable direct sending of Stacks assets to Bitcoin addresses. It will enable proxy access to the Bitcoin blockchain without creating a separate Stacks address. It remains to be seen if Bitcoin users find the feature attractive.\n\nWhile the upgrades sound promising, there’s still insufficient blockchain activity to justify the STX price surge. Only around 1,000 unique active wallets engaged with DApps on Stacks in February. The most striking part of Stack’s usage data was that the NFT marketplace Gamma also failed to attract considerable users to its platform, with less than 100 wallets trading daily on the marketplace.\n\nTop used dApps on Stacks between Jan. 28 and Feb. 27. Source: DappRadar\n\nGamma supports minting and sending Bitcoin ordinal NFTs via Stacks. However, many users have faced UX-related problems while using the feature, as it requires a separate address in a Stacks wallet that is Ordinal compatible. Many users have mistakenly sent their NFTs to wrong addresses. The wallet issue has also restricted the trading of Bitcoin NFTs.\n\nGamma NFT marketplace stats. Source: DappRadar\n\nDevelopers in the Stacks ecosystem, like the Xverse team, are working on a wallet to bring user-friendly Ordinals support. There's also an experiment with atomic swaps between Bitcoin NFTs and STX in the works. The aim is to develop this functionality into a complete marketplace.\n\nHowever, other ecosystems are also looking to bank on this trend. For instance, Ordinex is developing an Ordinals trading platform, which will be accessible for Ethereum users through Metamask. Some Ethereum native projects, like OnChainBirds and SappySeals, have also inscribed the NFTs on Bitcoin and enabled trading on OpenSea. However, the trading activity of these collections remains average, with little hype.\n\nBesides Stacks, many other ecosystems are trying to bank on the opportunity by facilitating Bitcoin NFTs. While Stacks enjoys a technical advantage over others, Ethereum has a loyal user base and adequate liquidity to outperform Stacks’ ecosystem if a feasible solution emerges. Moreover, in the end, it will depend on the response and demand of these NFTs from the Bitcoin community, which may not support euphoria around it.\n\nSTX/USD reaches key resistances zones\n\nThe STX token dilutes at the rate of 2.5% annually. The inflation will reduce after the Bitcoin halving, which is expected to occur in April 2024. The rate of supply increase of STX is low compared to other layer-1 blockchains like Solana and Cardano, which is encouraging. However, the network’s total fees or token economics do not balance the inflation, which needs to change soon.\n\nTechnically, the STX/USD pair is near the top of its two-year trading range at $1.02, which is a potential yellow flag for buyers. If bulls are able to overcome this level, STX can possibly take a shot at the all-time highs near $3.00. However, given that network activity doesn’t correlate to the price rise as of yet, there’s a chance of a pullback toward $0.68 and $0.24.\n\nSTX/USD daily price chart. Source: TradingView\n\nSimilarly, the STX/BTC pair is also near its all-time range of 0.00004350 BTC, which raises the possibility of a correction once those levels are tagged. The downside targets of STX are at 0.00002744 BTC and 0.00001233 BTC.\n\nSTX/USD weekly price chart. Source: TradingView\n\nBitcoin NFTs have a lot of potential, but it is still unclear if the Bitcoin community, which is usually against speculation and activities that clog the network, will allow the trend to prosper.\n\nCurrently, the most crucial aspect of NFT trading — an easily accessible marketplace and wallet — is still missing from the Ordinals ecosystem. As a Bitcoin sidechain, Stacks enjoys technical advantages with Bitcoin integration and it has a slight advantage over other blockchains in providing the tools to support an Ordinals craze.\n\nHowever, the applications to support Ordinals are still in development. Meanwhile, Stacks faces competition from other more liquid ecosystems, which could develop more feasible solutions to integrate Bitcoin NFTs on their chain.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LnlvdWhvZGxlci5jb20vYmxvZy9iaXRjb2luLWxpZ2h0bmluZy1uZXR3b3Jr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "The Bitcoin Lightning Network: The Ultimate Guide - YouHodler.com",
        "content": "Despite its revolutionary impact on the finance industry, Bitcoin still faces challenges in terms of scalability. With a processing capacity ranging from three to seven transactions in the real world, Bitcoin's transaction speed is significantly slower than traditional payment processors like VISA, making it unsuitable for everyday payments.\n\nHowever, the Bitcoin Lightning Network as a second-layer solution offers a potential solution. By setting up user payment channels, the Lightning Network provides instant transactions with lower fees while maintaining the Bitcoin network's security.\n\nBefore we dive deeper into all the details about the Bitcoin Lightning Network, let's get to know what it is and what it tries to achieve.\n\nWhat is the Bitcoin Lightning Network?\n\nThe Bitcoin Lightning Network is a second-layer payment protocol developed by Lightning Labs to enhance the capabilities of Bitcoin. It is a network of micropayment channels that allows users to send and receive payments instantaneously and without the high fees associated with Bitcoin transactions.\n\nThe Lightning Network operates on top of the Bitcoin blockchain, which means that it benefits from the security of the blockchain. It also helps to reduce the congestion on the blockchain, which speeds up transaction times and reduces fees. This is achieved by using a system of payment channels, essentially private payment channels created between two users.\n\nUsing these payment channels, users can: send and receive Bitcoin in real time. Additionally, the Lightning Network allows for the creation of smart contracts and multi-signature scripts, which help to ensure that transactions are secure and reliable.\n\nThe Lightning Network also helps to reduce the energy consumption associated with Bitcoin transactions. As the number of Bitcoin transactions has grown, so has the energy required to process them. The Lightning Network addresses this issue by enabling off-chain transactions that do not require the same level of computation as traditional Bitcoin transactions.\n\nHow does the Bitcoin Lightning Network work in theory?\n\nTheoretically, the Lightning Network establishes a network of payment channels between users, enabling quick and safe transactions without needing the approval of the Bitcoin network. Users finance a payment channel using Bitcoin to start the process, after which they may rapidly and directly deal with one another.\n\nNodes are computers connected to the Lightning Network and used to transmit transaction information, making up this decentralized network. Nodes can serve as middlemen, enabling parties to do business without disclosing their names or locations. This configuration may speed up and improve the effectiveness of Bitcoin transactions. Usually, Bitcoin transactions require around 10 minutes to process, but confirmation times are nearly instantaneous thanks to the Lightning Network.\n\nEach node must place a particular bitcoin amount into a channel to access the Lightning Network. This ensures the node won't defraud or steal any money. When two nodes wish to communicate, they create a channel and engage in as many transactions as they like. When everything is done, they terminate the channel and send the Bitcoin to the right addresses.\n\nA promising technology for individuals interested in Bitcoin and cryptocurrencies, the Lightning Network has the potential to boost transaction speed and efficiency while lowering fees. The Lightning Network might have a bigger impact on the financial system as it develops and gets better.\n\nPros and cons of the Bitcoin Lightning Network\n\nPros\n\nInstant transactions : The Lightning Network allows for instant transactions between users on the Bitcoin network.\n\n: The Lightning Network allows for instant transactions between users on the Bitcoin network. Low fees : The Lightning Network allows for low transaction fees, making transacting on the Bitcoin network cheaper.\n\n: The Lightning Network allows for low transaction fees, making transacting on the Bitcoin network cheaper. Scalability: The Lightning Network improves the scalability of the Bitcoin network, allowing for more transactions to be processed per second.\n\nCons\n\nCentralization: The Lightning Network creates a network of payment channels centralized around nodes with more Bitcoin. This could lead to the centralization of the network and potential security risks.\n\nThe Lightning Network creates a network of payment channels centralized around nodes with more Bitcoin. This could lead to the centralization of the network and potential security risks. Liquidity: The Lightning Network requires users to have the liquidity to open payment channels. This could limit its adoption by users who do not have enough Bitcoin to fund channels.\n\nBitcoin Lightning Network stats\n\nThe Lightning Network has seen steady growth since its launch in 2018. One key measure of growth is the number of nodes on the network. As of February 2023, there are over 76,000 Lightning Network active channels, with around 16,000 online nodes. This indicates that the Lightning Network is increasingly decentralized, with nodes spread across different geographical locations.\n\nLightning network capacity\n\nThe Lightning Network's capacity has also been increasing steadily. As of January 2023, the total capacity of the Lightning Network has reached over 5,490 BTC, worth over $128 million. This is a significant increase from the early days of the network when the total capacity was just a few hundred Bitcoin. This capacity growth indicates that the Lightning Network is becoming a more attractive option for users who want to transact Bitcoin quickly and efficiently.\n\nLightning network channel size\n\nLightning network nodes and channels via https://explorer.acinq.co/\n\nThe average Lightning Network channel size is around 0.070 Bitcoin, which is equivalent to around $1,696. This indicates that the Lightning Network is being used for small transactions, which aligns with its intended use case. The Lightning Network aims to enable micropayments and fast transactions, and the small average channel size is evidence that it is achieving this goal.\n\nLightning network speed and scalability\n\nThe Lightning Network's speed and scalability are essential to its success, and it can process thousands of transactions per second. This is significantly higher than the Bitcoin blockchain's current capacity, around seven transactions per second. The Lightning Network's ability to process transactions quickly and efficiently is essential for micropayments and small transactions, which are often not feasible on the Bitcoin blockchain due to high transaction fees and slow confirmation times.\n\nBitcoin lightning network adoption\n\nFinally, the Lightning Network has gained significant adoption in the Bitcoin community, with several wallets and exchanges supporting Lightning transactions. Merchants and businesses have also started accepting Lightning payments. This adoption is a crucial factor in the Lightning Network's success. It enables more users to transact using Lightning channels, increasing the network's usage and adoption.\n\nHow can I invest in the Bitcoin Lightning Network?\n\nIf you're interested in investing in the Lightning Network, there are two primary ways.\n\nPurchase and Hold Bitcoin\n\nPurchasing and holding Bitcoin is a straightforward way to invest in the Lightning Network. To begin, you must create an account with a reliable platform like YouHodler. Once you've signed up, you can purchase Bitcoin with fiat currency, stablecoins or even cryptocurrency.\n\nAfter purchasing Bitcoin, you can transfer it to a secure YouHodler wallet. By holding Bitcoin, you're indirectly investing in the Lightning Network since the network's growth and demand is closely tied to the adoption of Bitcoin.\n\nBenefits of Purchasing and Holding Bitcoin:\n\nYou can benefit from the Bitcoin and Lightning networks' growth.\n\nYou can store your Bitcoin in a secure wallet, away from potential security threats on exchanges.\n\nYou can sell your Bitcoin anytime, allowing you to liquidate your investment quickly.\n\nRun a Lightning Node\n\nRunning a Lightning node is another way to invest in the Lightning Network. By operating a node, you can help facilitate Bitcoin transactions on the network and earn small amounts of Bitcoin in transaction fees. You'll need some technical knowledge and equipment to run a Lightning node.\n\nHere are the steps to set up a Lightning node:\n\nChoose a Lightning Network client : There are several Lightning Network clients available, including LND, C-Lightning, and Eclair. Choose the one that best fits your technical skill level and equipment.\n\n: There are several Lightning Network clients available, including LND, C-Lightning, and Eclair. Choose the one that best fits your technical skill level and equipment. Install and configure the client : Follow the instructions provided by the developer to install and configure the Lightning Network client on your device.\n\n: Follow the instructions provided by the developer to install and configure the Lightning Network client on your device. Fund your Lightning wallet: To facilitate transactions on the Lightning Network, you'll need to fund your Lightning wallet with Bitcoin. The amount you need to fund will depend on the network's activity and your willingness to open channels with other nodes.\n\nTo facilitate transactions on the Lightning Network, you'll need to fund your Lightning wallet with Bitcoin. The amount you need to fund will depend on the network's activity and your willingness to open channels with other nodes. Connect your Lightning node: Once your wallet is funded, you can connect your Lightning node to other nodes on the network. Using node explorers such as 1ML or Lightning Explorer, you can find other nodes.\n\nOnce your wallet is funded, you can connect your Lightning node to other nodes on the network. Using node explorers such as 1ML or Lightning Explorer, you can find other nodes. Start facilitating transactions: After you've connected your Lightning node, you can start facilitating transactions on the Lightning Network. You'll earn small amounts of Bitcoin in transaction fees for each transaction you facilitate.\n\nBenefits of Running a Lightning Node:\n\nYou can earn small amounts of Bitcoin in transaction fees.\n\nYou can help facilitate faster and cheaper Bitcoin transactions on the Lightning Network.\n\nYou can contribute to the growth and adoption of the Lightning Network and Bitcoin.\n\nConclusion\n\nIn summary, the Lightning Network is a crucial component of the Bitcoin network's future, and anyone interested in Bitcoin and cryptocurrencies should take the time to understand how it works and its potential impact on the financial system. Whether you want to invest in the Lightning Network directly or indirectly through Bitcoin, it is an exciting time to be a part of this revolutionary technology."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tZW5kcy1mZWJydWFyeS1mbGF0LWFzLTIwMjMtcmFsbHktc3RhbGxzLTIzMDAwMTAyNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto ends February flat as 2023 rally stalls - Yahoo Finance",
        "content": "Cryptocurrencies closed out February largely unchanged as an enthusiastic rally to kick off 2023 stalled in the year's second month.\n\nIn February, ether (ETH-USD), the market's second-largest cryptocurrency, outpaced its larger peer bitcoin (BTC-USD) rising 1.6% against bitcoin's more modest 0.4% increase during the month. In January, bitcoin gained nearly 40% to record its best start to a year since 2013.\n\nChristopher Newhouse, a crypto options trader with GSR, said the February action in bitcoin was \"definitely more boring for directional trading than in January.\"\n\nAs Newhouse explained, crypto derivatives trading volume remained high in February but volatility fizzled over the month. Bitcoin is still the most popular cryptocurrency for traders, but in recent weeks those bets \"toward the end of the month have been mixed or slightly bearish.\"\n\nOver the same period, the major U.S. indexes were lower, with the benchmark S&P 500 (^GSPC) falling 2.5% during the month.\n\n\"Only short-term interest in Bitcoin was tepid,\" Michael Safai, co-founder and partner of crypto trading firm, Dexterity Capital told Yahoo Finance. Safai pointed to U.S. regulatory crackdowns over recent weeks as another reason investors may be taking a more cautious approach to cryptocurrencies.\n\nIn an annual report filed Monday afternoon, Robinhood (HOOD) shared the latest regulatory probe, alerting investors that the SEC subpoenaed the company in December to inquire about how it lists and holds cryptocurrencies in custody.\n\n\"There's still optimism that things will start to get figured out in the coming months,\" Safai added, pointing to longer-dated bitcoin call options placed this month with a strike price of $30,000.\n\nSince the beginning of 2023, bitcoin watchers have focused closely on whether bitcoin's price can breach $25,000. Between February 19-20, the level was briefly reached. Bitcoin has since fallen more than 6% and is currently changing hands near $23,200.\n\nStory continues\n\n“Bitcoin is comfortably in a trading range and that might be the case for a while longer,” said Edward Moya, senior analyst with Oanda.\n\nBased on historical data compiled by Yahoo Finance, in March bitcoin has shown a positive return in only three of the past nine years. On average, the coin has shown a loss of approximately 5.3%\n\nA man wears a t-shirt with the logo of Bitcoin as he waits for Sam Bankman-Fried, the founder and former CEO of crypto currency exchange FTX, to attend a hearing at the Magistrate Court building in Nassau, Bahamas December 19, 2022. REUTERS/Marco Bello (Marco Bello / reuters)\n\nMeanwhile, interest in ether over bitcoin (ETH-BTC), which serves as an indicator for general risk-taking within the crypto market, has steadily picked up in recent weeks.\n\nEthereum is also drawing more attention as it nears its next protocol upgrade slated for early April.\n\n\"Generally, Ethereum has underperformed over the last six weeks,\" strategists at Fundstrat said in a note on Monday. \"This looks to be changing.\"\n\nClick here for the latest crypto news, updates, values, prices, and more related to Bitcoin, Ethereum, Dogecoin, DeFi and NFTs\n\nRead the latest financial and business news from Yahoo Finance\n\nDownload the Yahoo Finance app for Apple or Android\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saXF1aWRpdHktaGFzLW1vc3QtYWZmZWN0ZWQtYml0Y29pbi1zLXByaWNlLWluLXRoZS1sYXN0LXllYXItYWNjb3JkaW5nLXRvLXRyYWRlci1icmlhbi1rcm9nc2dhcmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "'Liquidity' has most affected Bitcoin's price in the last year, according to trader Brian Krogsgard - Cointelegraph",
        "content": "Cointelegraph’s Crypto Trading Secrets podcast has published Episode 6, covering an array of content that should pique the interest of cryptocurrency traders. This episode’s guest is Brian Krogsgard, also known as Ledgerstatus on Twitter. Krogsgard is a trader and one of the co-founders of Flip.xyz, a nonfungible token (NFT) platform. He is also a podcaster in the crypto space.\n\nAmong the questions fielded during the Feb. 16 recording, host Benjamin Pirus asked Krogsgard to give his opinion on what he thinks has most impacted the price of Bitcoin (BTC) over the past year. “Liquidity,” he responded.\n\n“People just do not have spare liquidity for a multitude of reasons. They have counterparties that went bankrupt, and that might have forced them to lose money. They got coins stuck on places that went bankrupt. Lost access to them, lost in trading, lost because of taxes, whatever.”\n\n“Those are all challenges for liquidity, and you need liquidity for the healthiest of markets, and so that’s been a challenge,” he added. Amid the runaway train that was the 2022 crypto bear market, the space saw significant turmoil. Several cryptocurrency companies failed, including the likes of crypto exchange giant FTX.\n\n“I would actually say the problems go way before that with Bitcoin because we saw with FTX there was massive rehypothecation of Bitcoin,” Krogsgard continued. “Rehypothecation” is when entities use customers’ collateral for other activities, according to Investopedia. The collapse of FTX in November 2022 sparked numerous headlines, such as allegations of customer asset misuse by FTX and sister entity Alameda Research.\n\n“So, the Bitcoin people thought they had on FTX was not there, and FTX was selling it to do other things. And that rehypothecation was actually a burden to Bitcoin’s price even in a bull market. And now that we have liquidity issues, it’s just been a consistent kind of drag on price and presented challenges for a year and then some.”\n\nKrogsgard provided his thoughts and opinions on several other points during the episode and also chatted about his background.\n\nCheck out this and other episodes from Cointelegraph’s Crypto Trading Secrets podcast on Cointelegraph’s podcast page, Apple Podcasts, Spotify, Google Podcasts or TuneIn.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTI4L2JpdGNvaW4tYnRjLXJhbGx5LWlzLW5lY2Vzc2FyeS1mb3ItY3J5cHRvLW1pbmVycy1wb3N0LTIwMjMtcTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Rally Is Necessary for Crypto Miners Post 2023 Q1 - Bloomberg",
        "content": "Bitcoin ’s new year rally is resuscitating many crypto-mining companies seeking to escape from near financial ruin after one of the most devastating quarters ever for the nascent industry. Whether they succeed in making a comeback remains in question.\n\nHigh electricity costs, a plunge in digital assets prices and persistent network competition in the fourth quarter slashed mining profit margins and made it difficult for miners to stay afloat. Core Scientific Inc., the largest public Bitcoin mining company by computing power, went bankrupt and multiple major miners warned of liquidity crunches. While struggling miners have garnered some relief from Bitcoin’s 40% rebound this year, they are still under financial pressure."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vbmV3cy5hcnRuZXQuY29tL21hcmtldC9iaXRjb2luLW5mdHMtb3JkaW5hbC1pbnNjcmlwdGlvbnMtZXhwbGFpbmVyLTIyNjI2OTLSAVtodHRwczovL25ld3MuYXJ0bmV0LmNvbS9tYXJrZXQvYml0Y29pbi1uZnRzLW9yZGluYWwtaW5zY3JpcHRpb25zLWV4cGxhaW5lci0yMjYyNjkyL2FtcC1wYWdl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "The Crypto Community Has Gone Nuts for Bitcoin NFTs. Here’s How the New Niche Collectibles Are Building Buzz and Value - artnet News",
        "content": "For a niche subset of the Bitcoin maximalist circles, Ordinal Inscriptions have surprisingly and swiftly developed an outsized footprint in the cryptocurrency community. As of February 28, more than 210,000 of these digital assets have been inscribed—from a copy of Doom to a CryptoPunks-inspired collection—and upwards of $1.31 million has been spent in mining fees.\n\nLike NFTs, which are typically linked to the Ethereum network, Ordinal Inscriptions are digital assets that are inscribed on a satoshi, which is the smallest denomination of Bitcoin.\n\nBut unlike NFTs, which can be purchased via platforms like OpenSea and Nifty Gateway, Ordinals are bought and sold on Telegram and Discord channels, as marketplaces or even dedicated wallets for Bitcoin Ordinals have yet to take off.\n\nSo what accounts for their popularity?\n\n5/ It feels like fun early-days alpha Swapping Ordinals in small Discord channels via trusted OTC in an awkward way is exactly what alpha tastes like. You have a passionate group of people who see something special even though the tooling is incredibly bad — dotta (@dotta) February 1, 2023\n\nDevelopers have been striving to integrate NFTs onto the top blockchain, Bitcoin, for almost a decade. This journey began in 2014 with Counterparty, which created the Rare Pepe NFT collection, and continued in 2017 with Stacks. The inscription process involves writing the content data into the witness, or authenticating signature, of the Bitcoin transaction.\n\nWhile Bitcoin’s blockchain can technically support the creation of NFTs, it was not designed with this specific use case in mind, but rather developed to provide a secure, immutable ledger of peer-to-peer transactions. Other blockchain networks, such as Ethereum, were designed with more flexible programming languages and smart contract capabilities that allowed for the creation and management of NFTs from the outset.\n\nDid you know that ordinals are not the first NFTs on Bitcoin? In fact, Bitcoin has had NFTs for nearly a decade! In 2015 Spells of Genesis tokenized the first gaming assets and in 2016 Rare Pepes gave birth to the cryptoart movement. pic.twitter.com/NibfcKxNRZ — Leonidas.og (@LeonidasNFT) February 15, 2023\n\nTechnical details aside, the ability to add inscriptions onto the Bitcoin blockchain has prompted some rather uncanny depictions.\n\nBlock 0, the genesis Ordinal block, pays tribute to the pseudonymous founder of Bitcoin, Satoshi Nakamoto, featuring an interlocking looped GIF of a 3D block, created with ASCII text, spinning against lines from Satoshi’s original white paper.\n\nThe second block of Ordinals paid homage to Hal Finney, the first person to receive a Bitcoin transaction from Nakamoto. Block 1 showcases the hash of the block containing Finney’s transaction and features abstract art that symbolizes the impact of ALS, a disease that had a debilitating effect on Finney’s health.\n\nThen, there were the Ordinal Punks, a set of 100 NFTs nodding to the original CryptoPunks, minted within the first 650 inscriptions on the Bitcoin chain. The 192×192-pixel generative PFP collection was created using an open-source algorithm by the pseudonymous Web3 creator, FlowStay.\n\nThe novelty and relative scarcity of Oridinal Punks have fueled their rise in value. According to a Google Sheet database of sales (again, there are no major marketplaces for Ordinals), the current lowest bid for an Ordinal Punk sits at 3.7 BTC, or 51.26 ETH (nearly $84,000), and the highest asking price is 50 BTC, or 692.66 ETH ($1,132,500).\n\nOn February 27, Yuga Labs announced that it would be launching an Ordinals collection of its own, a collection of 300 generative art NFTs.\n\nIntroducing TwelveFold. A limited edition collection of 300 generative pieces, inscribed on satoshis on the Bitcoin blockchain.https://t.co/aFWEIhzqcI pic.twitter.com/PjWABKKBr4 — Yuga Labs (@yugalabs) February 27, 2023\n\nIn line with Yuga Labs’s buy-in, a host of services have emerged over the past month to provide support for Ordinal transactions, not limited to Bitcoin wallets like Xverse and Hiro Wallet, and NFT marketplaces including Gamma and Oridalsbot.\n\nBut are Ordinals more than a fad?\n\nLike any niche collectible, including art, the market that develops around Ordinals is only as big as the bags of those willing to purchase it. But Bitcoin, with a current market cap of $449.21 billion, is by far the world’s largest cryptocurrency, far outstripping the $199.70 billion cap of Ethereum.\n\nAs it is, the momentum of Ordinals has yet to falter, being boosted by alphas in the space, burgeoning market interest, and, as with most things in the crypto sphere, no small amount of hype. Research firm Delphi Digital, for one, has dubbed the emergence of Ordinals “Bitcoin’s New Narrative,” calling them “the most interesting thing to happen to Bitcoin since El Salvador made it legal tender.”\n\nFor now, though, Ordinals remain closer to 4Chan than Hauser & Wirth. Whatever art that gets transcribed onto the Bitcoin network will likely not (yet) constitute some broader art historical turn or pivot, but rather something much simpler: A small, three or four MB file, tick-tock, next block.\n\nMore Trending Stories:\n\nResearchers in Vietnam Discovered That Two Deer Antlers Languishing in Museum Storage Are Actually 2,000-Year-Old Musical Instruments\n\nA Photographer Who Found Instagram Fame for His Striking Portraits Has Confessed His Images Were Actually A.I.-Generated\n\nArchaeologists on Easter Island Have Discovered a Previously Unknown Moai Statue Buried in a Dried-Out Lake Bed\n\nTwo Curators Tried to Find Out If Salvador Dalí Really Painted This Strange Seven-Foot Canvas. They Ended Up Solving an Even Bigger Mystery\n\nArt Industry News: A California Court Revives a Lawsuit Over a ‘Disrespectful’ Marilyn Monroe Statue + Other Stories\n\nThe Dutch Are Going Wild for a Reality TV Show Where Artists Compete to Paint Vermeer’s Lost Masterpieces\n\nWhat I Buy and Why: Filmmaker Ku-Ling Yurman on Her Mission to Collect Works by Women and Her Prized Jewelry Pieces\n\nSo-Called ‘Open Editions’ Are Suddenly Reigniting the Wintry NFT Market. Here’s Why They’ve Become So Popular With Collectors\n\nMarginalia Uncovered in Leonardo’s Famous Codex Arundel Suggests the Renaissance Polymath Theorized Gravity Before Galileo\n\nFollow Artnet News on Facebook:"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tbGF3eWVycy1mbGFtZS1nZW5zbGVyLW92ZXItY2xhaW1zLXRoYXQtYWxsLWNyeXB0by1hcmUtc2VjdXJpdGllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Crypto lawyers flame Gensler over claims that all crypto are securities - Cointelegraph",
        "content": "Cryptocurrency lawyers have rebuffed comments made by the head of the United States securities regulator, who claimed in a recent interview that every cryptocurrency except Bitcoin (BTC) is a security that falls under its jurisdiction.\n\nIn a wide-ranging Feb. 23 New York Magazine interview discussing crypto, Securities and Exchange Commission Chair Gary Gensler claimed “everything other than Bitcoin” falls under the agency’s remit.\n\nHe added other crypto projects “are securities because there’s a group in the middle and the public is anticipating profits based on that group,” which he said is not the case with Bitcoin.\n\nGensler in @NYMag on crypto:\n\n\n\n-everything is a security except bitcoin\n\n-every company out there is in violation\n\n-crypto is pointless but blockchain is kinda neat\n\n\n\nHard to argue you’re acting in good faith if admittedly trying to stamp out an entire industry. pic.twitter.com/Ozw8ZJ3ETO — Alexander Grieve (@AlexanderGrieve) February 26, 2023\n\nJake Chervinsky, a lawyer and policy lead at the crypto advocacy group the Blockchain Association, argued however in a Feb. 26 tweet that Gensler’s “opinion is not the law” despite his claimed command over the crypto sector.\n\nChair Gensler may have prejudged that every digital asset aside from bitcoin is a security, but his opinion is not the law. The SEC lacks authority to regulate any of them until and unless it proves its case in court. For each asset, every single one, individually, one at a time. — Jake Chervinsky (@jchervinsky) February 26, 2023\n\nHe added “until and unless” the SEC “proves its case in court” for its jurisdiction over each individual token “one at a time” then it “lacks authority to regulate any of them.”\n\nLawyer Logan Bolinger also chimed in, tweeting on Feb. 26 “that Gensler’s opinions on what is or isn’t a security are not legally dispositive” — meaning it’s not the final legal determination.\n\nFriendly reminder that Gensler’s opinions on what is or isn’t a security are not legally dispositive.\n\n\n\nIn this country, judges - not SEC chairs - ultimately determine what the law means and how it applies.\n\n\n\nDoesn’t mean his thoughts are irrelevant. They’re just not dispositive. — Logan Bolinger (@TheWhyOfFI) February 26, 2023\n\n“Judges — not SEC chairs — ultimately determine what the law means and how it applies,” Bolinger added.\n\nThe policy lead at advocacy body Bitcoin Policy Institute, Jason Brett, said Gensler’s comments “shouldn't be celebrated, but feared” and stated, “there are ways to win other than via a regulatory moat.”\n\nThe Gary Gensler thing is no bueno. There are ways to win other than via a regulatory moat. And anytime this is the way, the script can be flipped and before you know it, everyone is crying due process. Gensler's comments in NY Magazine shouldn't be celebrated, but feared. — Jason Brett (@RegulatoryJason) February 26, 2023\n\nSEC needs 12,305 lawsuits: Delphi Labs counsel\n\nMeanwhile, Gabriel Shapiro, the general counsel at investment firm Delphi Labs, outlined in a series of tweets the seemingly impossible enforcement that the SEC would have to carry out on the industry to cement its rule.\n\nShapiro said that over 12,300 tokens worth around $663 billion are — according to Gensler — unregistered securities that are illegal in the U.S. and, as mentioned by Chervinsky, the agency would have to file a lawsuit against each token creator.\n\nRelated: Emojis count as financial advice and have legal consequences, judge rules\n\nThe SEC has handled crypto in two main ways, according to Shapiro: Either fining token creators and requiring the issuer to register, or fining them and ordering the created tokens to be destroyed and delisted from exchanges.\n\nso far, SEC has handled tokens in mainly 2 ways:\n\n\n\n(1) fine + registration requirement--this failed every time so far, with the companies becoming bankrupt\n\n\n\n(2) fine + order to destroy all premined tokens and delist tokens from all exchanges\n\n\n\nboth ways, tokens go to $0 — _gabrielShapir0 (@lex_node) February 26, 2023\n\n“SEC registration is not only too expensive for most token creators — there is also no clear path for registration of tokens,” Shapiro said, adding:\n\n“What is the plan here? Since registration is not feasible, it can only be [that] everyone pays huge fines, stops working on the protocols, destroys all dev premines, and delists [tokens] from trading. That would mean 12,305 lawsuits.”\n\n“What is the plan? We are all wondering, and billions of American [dollars] are at risk.”"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdGhpcy1taW5pbmctcG9vbC1zdHJpdmVzLXRvLW1ha2UtYml0Y29pbi1ncmVlbmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "How this mining pool strives to make Bitcoin greener - Cointelegraph",
        "content": "Bitcoin (BTC) miners consume massive amounts of energy to secure the network and process transactions. While the network offers many benefits, like banking the unbanked, Bitcoin’s energy consumption is a controversial topic for critics. However, new solutions are emerging to reduce the environmental impact of Bitcoin mining.\n\nThe Cambridge Center for Alternative Finance estimates that the Bitcoin network currently consumes about 109.34 terawatt-hours (TWh) per year. Bitcoin miners use this energy to generate hash keys. When they guess the correct key, they receive BTC as a reward for their contribution to securing the network.\n\nCambridge Center for Alternative Finance\n\nThe current electricity demand is at record heights, and there is a new influx of miners. However, many miners still rely on fossil fuels, contributing to the network’s reliance on dirty energy sources.\n\nEnvironmental concerns\n\nMost of the world is pursuing a green transition, stepping away from fossil fuels as much as possible. With Bitcoin relying on its proof-of-work (PoW) protocol, the network is targeted by critics like Greenpeace, as it does not align with the organization’s mission to make the world’s industries more sustainable. In addition, Bitcoin’s reputation is at stake, with governments mulling over strict regulations for the mining industry and brands like Tesla dropping BTC as a payment method.\n\nIn other words, this stride for sustainability is also relevant for the Bitcoin mining community. A switch to sustainable energy sources seems like a logical step to take, but it isn’t the easiest. In many countries, fossil fuels are simply the cheapest option, making them the first choice for miners.\n\nCurrently, many different initiatives are pushing Bitcoin in a greener direction. For example, miners can minimize methane’s environmental impact by converting flared methane and vented landfill gasses into electricity. What’s more, smaller miners can now also contribute to the green effort by joining mining pools like PEGA Pool.\n\nAccelerating Bitcoin’s green future\n\nPEGA Pool, a platform based in the United Kingdom, is one of the newest mining pools in the industry. Of course, mining in a network, joining forces with other miners and earning BTC together is nothing new. PEGA Pool, however, offers miners a way to make their operations more sustainable.\n\nThere are several ways this mining pool makes the work of participating miners more sustainable. First, miners that use sustainable energy resources get a 50% reduction in pool fees, giving clean energy sources an advantage over other participants in the PEGA mining pool.\n\nSecondly, miners using “dirtier” energy sources are also welcome to join. However, PEGA Pool reserves a portion of the fees these miners pay to offset their environmental impact. More specifically, the project uses the fees to plant new trees, which capture the carbon these miners emit while mining Bitcoin.\n\nPEGA Pool might be a relatively new platform, but its green mission has already attracted many miners. According to blockchain explorer BTC.com, the pool already ranks among the biggest mining pools in the industry, taking the 11th spot on the list. Currently, it produces a hash rate of 2875.62 peta hashes per second, closely following Poolin. The pool has already mined 771 Bitcoin by mining 121 blocks, all with minimal environmental impact.\n\nGreen initiatives like PEGA Pool may positively impact the future of Bitcoin, even if it is unlikely that Bitcoin will join Ethereum in its transition to a proof-of-stake (PoS) protocol. However, mining can become a more sustainable industry by focusing on renewable energy. In turn, it can increase the demand for renewable energy, possibly benefiting more than just the miners themselves. Miners looking to make their operation greener can find more information about PEGA Pool on its official website.\n\nLearn more about PEGA Pool"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZGVjcnlwdC5jby8xMjIzMDIvYm9yZWQtYXBlLXlhY2h0LWNsdWItY3JlYXRvci15dWdhLWxhYnMtcmV2ZWFscy1maXJzdC1iaXRjb2luLW5mdC1wcm9qZWN00gFoaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMjMwMi9ib3JlZC1hcGUteWFjaHQtY2x1Yi1jcmVhdG9yLXl1Z2EtbGFicy1yZXZlYWxzLWZpcnN0LWJpdGNvaW4tbmZ0LXByb2plY3Q_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bored Ape Yacht Club Creator Yuga Labs Reveals First Bitcoin NFT Project - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYuga Labs, the $4 billion company behind dominant NFT collection Bored Ape Yacht Club, will debut its first-ever Bitcoin-based NFT project later this week, the company announced Monday.\n\nThe collection, TwelveFold, will consist of 300 limited-edition generative art pieces each inscribed to the Bitcoin blockchain. It’s one of the highest-profile launches to date via Ordinals, a recently-launched way of committing artwork and media to Bitcoin by permanently attaching each to an individual Satoshi, or 1/100,000,000 of a full Bitcoin (BTC).\n\nThe pieces, all 12x12 grids—an homage to the manner in which data is stored on the Bitcoin blockchain—will combine 3D graphics and hand-drawn features. The project was designed and created by Yuga’s in-house art team, and the company said that it has no connection to its Ethereum-based IP and will have no future interactions or utility in that regard.\n\nAD\n\nAD\n\nPromotional artwork for Yuga Labs' first Bitcoin NFT project. Image: Yuga Labs\n\nTwelveFold marks a departure from Yuga’s past offerings in a few key ways. Most notably, every other project under the Yuga banner currently lives on the Ethereum blockchain, the leading network for NFT projects.\n\nThat list includes the Bored Ape Yacht Club (BAYC), spinoff Mutant Ape Yacht Club (MAYC), and virtual land plots for the upcoming Otherside metaverse game. Yuga Labs also owns CryptoPunks and Meebits, two “blue chip” Ethereum NFT projects created by Larva Labs that Yuga purchased the IP rights to last year.\n\nTwelveFold also stands apart from those projects in terms of size. Whereas all other Yuga-owned collections boast 10,000 or more NFTs, TwelveFold will consist of only 300 pieces. It’s closer in approach to Autoglyphs, an influential Larva Labs generative art project on Ethereum that spans just 512 NFTs.\n\n“All of these choices are a departure from what’s expected from Yuga,” co-founder Greg Solano wrote in a blog post accompanying Monday's announcement. “But, you know. Fuck doing expected things.”\n\n“We’re excited about Ordinal inscriptions and what the future holds for digital artifacts on Bitcoin,” he continued. Yuga said that it will announce auction details later this week, and that the information will come 24 hours in advance of the actual sale.\n\nAD\n\nAD\n\nOne of the generative art pieces in Yuga Labs' TwelveFold series. Image: Yuga Labs\n\nOrdinals have commanded the attention of the NFT world over the past month, and while the idea of NFT-like assets imprinted on the blockchain has irked some Bitcoin maximalists, it’s catching on in a big way. More than 200,000 unique Ordinals have been minted as of today, including from notable projects like DeGods and OnChain Monkey. There are even CryptoPunks clones on Bitcoin now.\n\nYuga’s foray into Bitcoin NFTs also comes at a time when the company’s most stable revenue stream appears to be in jeopardy. NFT creators like Yuga depend on creator royalties—a fee typically between 5% and 10%—levied on secondary sales of NFTs on Ethereum marketplaces like OpenSea.\n\nEarlier this month, however, OpenSea stopped enforcing some royalties in an effort to stave off competition from its emergent rival, NFT trading platform Blur. Yuga Labs had previously criticized OpenSea for considering the move."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtd2hhbGUtcG9wdWxhdGlvbi1zaHJpbmtzLXRvLWVhcmx5LTIwMjAtbGV2ZWxzLTUtdGhpbmdzLXRvLWtub3ctaW4tYml0Y29pbi10aGlzLXdlZWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "BTC whale population shrinks to early 2020 levels — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) keeps pushing for a bullish end to February as the monthly close starts another week’s price action.\n\nThe largest cryptocurrency looks set to preserve its gains as it closes the second month of 2023 — and keeps bulls’ hopes alive.\n\nCan the good times continue? The coming week could mean decision time for a key area of BTC price action around $25,000.\n\nAnalysts are eyeing a breakout toward $30,000 if support can become more permanent, while concerns remain that a trip back toward resistance reclaimed in January is still on the cards.\n\nAmid a quiet week for macroeconomic data, any catalysts for determining whether BTC/USD goes up or down may come from within Bitcoin itself.\n\nOne thing is for sure, on-chain data shows long-term Bitcoin hodlers are in no mood for selling yet, and at current prices, continue to add to their BTC exposure en masse.\n\nCointelegraph looks at some major factors that could impact Bitcoin in the coming week.\n\nBitcoin monthly close precludes March trend showdown\n\nIt looked touch-and-go into the weekend, but Bitcoin has managed to avoid a major retracement and reversed upward into the new week.\n\nA weekly close at around $23,500 was music to the ears of those keen to see a bullish rebound sooner rather than later.\n\n“BTC has managed to break back above the ~$23400 level which is the Range High of the macro Monthly Range,” popular trader and analyst Rekt Capital explained.\n\n“This is what BTC needs to keep doing for a bullish bias as February nears its end. Upcoming Monthly Close will be very interesting.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nAt current levels, BTC/USD is up around 1.25% in February 2023 — modest by historical standards but still conspicuous in preserving the year’s gains.\n\nFor Rekt Capital, March marks the real make-or-break month for BTC/USD as it approaches a long-term trend line, a break of which would signal a full trend reversal.\n\n“February nears its close & indeed not too much excitement for BTC, as has historically been the case for a pre-breakout Monthly Candle,” he continued.\n\n“Given how the Macro Downtrend is a sloping trendline, the breakout price for BTC will be a little lower in March at ~$24500.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nA further post reiterated $25,000 as the level to break to “confirm” a macro uptrend.\n\nFellow trader Crypto Chase was more definite about short-term price action. In a tweet overnight, he likewise flagged $25,000 as the line in the sand.\n\n“Perfect tag of 22.7 and bounce. Weekend move though.. I wouldn’t be surprised to see another retest of the 0.618 or a 3rd drive,” he commented about the weekend lows.\n\n“At that point, it becomes make or break for me. Hold and we can still see 25K+ liq, lose it and 20K next.”\n\n#Bitcoin\n\n\n\n4h chart - short term bullish reversal pic.twitter.com/ukjn3kOqIh — Stockmoney Lizards (@StockmoneyL) February 26, 2023\n\nTrading resource Stockmoney Lizards meanwhile described a “short-term bullish reversal” for both price and relative strength index (RSI) on the 4-hour chart as the weekend ended.\n\nMacro focus flips to central bank liquidity\n\nIn a refreshing change to the previous two weeks, United States macroeconomic data releases will be more subdued at the start of March.\n\nAs Cointelegraph reported, however, analysts are increasingly eyeing macro releases from Asia as a potential BTC price influencer.\n\nCentral bank liquidity injections — in contrast to the Federal Reserve — remain a key topic.\n\n“Global liquidity - projected to rise in 2023, but recently has pulled back,” popular commentator Tedtalksmacro tweeted on the day.\n\n“- China injected ~$450Bn into money markets during December + January - US liquidity has flat lined, government liquidity has outpaced Fed QT recently. Markets are a product of liquidity * risk appetite.”\n\nMacro liquidity comparison chart. Source: Tedtalksmacro/ Twitter\n\nTedtalksmacro nonetheless highlighted a potential countertrend in the form of Japan’s central bank, the Bank of Japan (BoJ), which he warned may yet resort to financial tightening to tame inflation.\n\n“On Friday last week, Japanese core inflation printed at the highest level since 1981 --> fueling speculation that the BOJ will need to tighten after years of extremely easy monetary policy,” he noted.\n\nComparing U.S. macro asset performance to crypto following the January Consumer Price Index (CPI) data print, meanwhile, he added that crypto assets remained “stubborn” despite others beginning to move higher.\n\nMacro asset comparison chart. Source: Tedtalksmacro/ Twitter\n\nAnalysis platform Mosaic Asset focused on the potential for the Fed to hike benchmark interest rates more than expected at its March meeting.\n\n“With no signs that the economy is slowing and yet another inflation report running hotter than expected last week…that’s ratcheting up pressure on the Federal Reserve to keep hiking rates quicker and longer than markets are expecting,” it wrote in the latest edition of its updates series, “The Market Mosaic,” on Feb. 26.\n\n“You can see that reflected in the odds of the next rate hike’s magnitude, where market implied estimates currently favor another 0.25% increase. But views are quickly shifting to the possibility of 0.50%, with more on the way while rates stay higher for longer.”\n\nAccording to CME Group’s FedWatch Tool, the odds of a 0.5% hike instead of the 0.25% in February currently stand at 27.7%.\n\nFed target rate probabilities chart. Source: CME Group\n\nSellers see first week of net losses in 2023\n\nWhile Bitcoin may be up over 40% year-to-date, the road to recovery for the average hodler remains fragile.\n\nThat is the conclusion of the latest data from research firm Santiment, which shows that last week’s mixed BTC price action still managed to deliver net realized losses among sellers.\n\nEther (ETH) saw the same phenomenon, marking the first week in 2023 when sellers lost out.\n\n“Bitcoin & Ethereum are both having more traders sell at a loss than at a profit this week, the first such week so far in 2023,” Santiment commented.\n\n“Historically, once the crowd is exiting their positions more frequently at a loss, bottoms are more likely to form.”\n\nBitcoin, Ethereum realized losses annotated chart. Source: Santiment/ Twitter\n\nSellers’ bad luck contrasts with the strategy still firmly in place for long-term holders, who continue to add to their BTC positions.\n\nAccording to on-chain analytics firm Glassnode, hodlers’ net position change reached a new four-month high this weekend, reflecting the rate at which accumulation occurs.\n\nBitcoin hodler net position change chart. Source: Glassnode/ Twitter\n\nIn addition, the percentage of the BTC supply, which has now been dormant for at least five years, is now higher than ever at 28.24%.\n\nBitcoin % supply last active 5+ years ago chart. Source: Glassnode/ Twitter\n\nBitcoin revenue hits 8-month high\n\nA broadly similar situation is currently being witnessed among Bitcoin miners.\n\nGlassnode data shows that on a rolling 30-day basis, miners are holding onto more BTC than they sell, but current prices are keeping the trend precarious.\n\nWhile it would not take much of a price decrease to flip it back to net selling, current conditions remain far healthier than those seen in previous months.\n\nBitcoin miner net position change chart. Source: Glassnode\n\nA silver lining comes in the form of miner revenue, which while modest, is nonetheless at its highest in eight months.\n\nBitcoin miner revenue chart. Source: Glassnode/ Twitter\n\nIncome was helped by ordinals fees, crossing the $1 million mark in February.\n\nOrdinal fees paid to Bitcoin miners cross $1M\n\n\n\nWhat is an Ordinal - its arbitrary data stored on BTC blockchain into a taproot address. BTC block sizes were raised to 4MB per block, allowing for the storage of data, such as NFTs in the form of images. pic.twitter.com/yz0RM9kBLt — Jack Levin (@mrJackLevin) February 18, 2023\n\nDespite ordinals resulting in a “fuller mempool” for Bitcoin, as the research noted last week, miners have still managed to clear it, Glassnode shows.\n\nBitcoin mempool chart. Source: Glassnode\n\nFor Bitcoin whales, it's early 2020\n\nThey may be responsible for some interesting events on exchange order books, but Bitcoin whale numbers are dwindling.\n\nRelated: Bitcoin may only need 4 weeks to hit $30K as key monthly close looms\n\nWith price action still a good 65% below all-time highs, the biggest Bitcoin investors have not yet decided that now is the time to return to the market.\n\nAccording to Glassnode, whale numbers are now at their lowest in three years — just 1,663 unique entities now control 1,000 BTC or more. Three years ago, in February 2020, Bitcoin traded at under $10,000.\n\nGlassnode defines a unique entity as “a cluster of addresses that are controlled by the same network entity.”\n\nAt their peak in February 2021, there were 2,161 whale entities.\n\nBitcoin whales chart. Source: Glassnode\n\n“Clusters” of whale transaction activity can offer insight into support and resistance, even with depleted whale numbers.\n\nAs monitoring resource Whalemap notes, $23,000 remains a key price focus thanks to that whale factor this month.\n\nBTC broke through bubble resistance\n\n\n\nNow it will be our support in case we start falling\n\n\n\n$27,100 seems to be the closest target according to onchain on the way up\n\n\n\nBeastly BTC performance today pic.twitter.com/fOcag9eBFX — whalemap (@whale_map) February 15, 2023\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2luZmxhdGlvbmFyeS12cy1kZWZsYXRpb25hcnktY3J5cHRvY3VycmVuY2llcy1leHBsYWluZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Inflationary vs. deflationary cryptocurrencies, Explained - Cointelegraph",
        "content": "What is an inflationary cryptocurrency? Some cryptocurrencies are inflationary because the supply of coins increases over time. Inflationary cryptocurrencies use a combination of predetermined inflation rates, supply constraints, and mechanisms for distributing tokens to maintain the supply and incentivize participation in the network. Looking at their monetary systems, cryptocurrencies have various coin-creation and supply mechanisms. Inflationary cryptocurrencies have a steadily increasing supply of coins entering the cryptocurrency market. Typically, there is a predetermined rate of inflation set, which specifies the percentage increase in the currency’s total supply over time. Moreover, the inflationary token’s maximum supply is usually fixed or variable, setting the total number of tokens that can be created. Once the maximum supply is reached, no more tokens can be minted. Nonetheless, different cryptocurrencies still have varying tokenomics, which may be adjusted over time. For instance, Dogecoin (DOGE) once had a hard cap of 100 billion tokens until the supply cap was removed in 2014. With this decision, DOGE now has an unlimited supply of coins. How does an inflationary cryptocurrency work? Inflationary cryptocurrencies distribute newly minted coins to network participants utilizing dedicated consensus mechanisms, such as proof-of-work (PoW) and proof-of-stake (PoS), through which new coins can either be mined into existence (Bitcoin (BTC)) or distributed to network validators (Ether (ETH)). Through Bitcoin’s PoW consensus mechanism, miners validate transactions and are rewarded based on who solves the puzzle first. In PoS, when a block of transactions is ready to be processed, the PoS protocol will choose a validator node to review the block. The validator checks if the transactions in the block are accurate. If so, the validator adds the block to the blockchain and receives ETH rewards for their contribution, generally proportional to the validator’s stake. In some cryptocurrencies, the distribution of new tokens can be influenced by governance decisions. For example, decentralized autonomous organizations (DAOs) may vote to release treasury funds, change staking rewards and set vesting periods, ultimately affecting the currency’s inflation rate and the distribution of new tokens.\n\nWhat is a deflationary cryptocurrency? Deflationary cryptocurrencies deflate over time because the supply decreases. Deflationary tokens use various mechanisms to reduce their supply, with coins usually destroyed through transaction fees and coin burning. Deflationary cryptocurrencies have a predetermined deflation rate coded in the protocol. This rate determines the percentage decrease in the currency’s total supply over time. For instance, a cryptocurrency might have an annual deflation rate of 2.5%, meaning that the currency’s total supply will decrease by 2.5% annually. Like many inflationary cryptocurrencies, deflationary cryptocurrencies can have a fixed or variable maximum supply that limits the total number of tokens created. Generally, no more units can be minted once the supply limit is reached, but this is not always the case. Notably, the economics of deflationary cryptocurrencies is influenced by stakeholders’ incentives, including miners, developers and users, who have varying motivations and goals that impact the cryptocurrency’s supply and demand. Miners mine new coins into existence and tend to hold newly mined coins in bull markets instead of selling them on the market. Likewise, supply caps can be removed, like in the case of DOGE, making some cryptocurrencies prone to manipulation. How does a deflationary cryptocurrency work? Deflationary cryptocurrencies may have direct or indirect mechanisms to destroy circulating coins. Some deflationary currencies may use transaction fees to facilitate burning to reduce the total number of coins in circulation. Coin burning may also involve sending a specific amount of coins to an inaccessible address, directly removing them from circulation. BNB (BNB) adopted two coin-burning mechanisms, reducing its supply by 50% over time. The first is burning a portion of the BNB spent as gas fees on the BNB Chain, and the second is quarterly BNB burning events. Deflationary cryptocurrencies also use other instruments to reduce token supply, including “halving.” Roughly every four years, the halving event cuts the ming rewards BTC miners receive for their work, directly affecting BTC’s scarcity.\n\nWhat is the difference between inflationary and deflationary cryptocurrencies? Inflationary and deflationary cryptocurrencies differ in their monetary mechanisms and supply dynamics. These distinctions have significant implications for the usage and value of each type of cryptocurrency. Both deflationary and inflationary cryptocurrencies can have unique tokenomics that impact their value and use. Deflationary cryptocurrencies typically have a fixed total coin supply limit, which results in increased purchasing power over time. Inflationary cryptocurrencies often have a flexible coin creation rate, arguably decreasing purchasing power over time. Inflationary cryptocurrencies offer some advantages over deflationary ones. They incentivize spending and discourage hoarding. Depending on the use case, they may allow for increased liquidity and rapid adoption, either due to their utility or functionality as a medium of exchange. Additionally, they arguably offer a more flexible monetary policy than deflationary cryptocurrencies and some fiat currencies. The token’s inflation can be adjusted to match the ecosystem’s needs, such as fund development, incentivizing participation or counteracting inflationary pressure from the fiat legacy systems. Deflationary cryptocurrencies incentivize holding and discourage spending, increasing scarcity and adoption of the currency as a store of value. Additionally, deflationary cryptocurrencies can hedge against inflation, hyperinflation and stagflation, preserving value over time. The decreasing token supply can counteract inflationary pressure caused by external factors, including government policies or economic events.\n\nIs Bitcoin inflationary or deflationary? The classification of Bitcoin (BTC) as either inflationary or deflationary depends on various factors. BTC is inflationary because new coins are continuously mined and enter the supply. However, disinflationary measures, such as halving, reduce inflation over time. The argument for BTC being deflationary is based on the fact that the supply of BTC is limited and inherently incorporates a disinflationary measure called halving. The halving event cuts the rewards for miners, affecting BTC’s scarcity and reducing inflation over time. As the mining reward continues to fall over time, it becomes increasingly difficult and expensive to mine BTC. The 21 million cap on supply means once all coins are mined, no more are added to the market. Once BTC’s hard cap is reached around the year 2140, inflation stops because no new coins will be added into circulation. Finally, as the adoption and demand for BTC continue to increase due to rising external demand and its internal disinflationary mechanics, its price could continue to increase. BTC can hedge against inflation due to its internal mechanics, which gradually reduce its inflation rate."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93cmFwcGVkLWJpdGNvaW4tc3VwcGx5LWRyb3BzLXRvLW5lZ2F0aXZlLWFmdGVyLTExLTUwMC13YnRjLWJ1cm4tbGlua2VkLXRvLWNlbHNpdXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Wrapped Bitcoin supply drops to negative after 11,500 wBTC burn linked to Celsius - Cointelegraph",
        "content": "The supply of wrapped Bitcoin (wBTC) dropped to its lowest since May 2021 after the second-largest single-day burn on Feb. 27.\n\nA total of 11,500 wBTC ($260 million) linked to now-bankrupt crypto lender Celsius was burned, turning its growth rate negative. The current total supply of the wrapped token is 164,396 wBTC, with a monthly growth rate of -7.39%.\n\nwBTC daily mint and burn. Source: Dune\n\nWBTC is an Ethereum-based ERC-20 token that mirrors the value of Bitcoin and is pegged 1:1 with the price of Bitcoin (BTC). Bitgo co-developed wBTC in 2019 alongside blockchain interoperability protocol Ren and multichain liquidity platform Kyber. WBTC is managed by the decentralized autonomous organization wBTC DAO, which comprises over 30 members.\n\nWhen merchants want to exchange BTC for wBTC, they start a burn transaction and alert the custodians. The merchant transfers real BTC to a custodian address on the Bitcoin blockchain, which is locked. Once it receives the real BTC, the custodian address mints the equivalent amount in wBTC on Ethereum.\n\nBeing an ERC-20 token makes the transfer of wBTC faster than normal Bitcoin, but the key advantage of wBTC is its integration into the world of Ethereum wallets, decentralized applications and smart contracts.\n\nDuring the peak of the bull run, wrapped tokens became a popular tool of use in the decentralized finance ecosystem. WBTC’s supply peaked at 285,000 in April 2022, when the price of BTC was trading above $48,000.\n\nHowever, with the advent of the bear market and numerous crypto contagions, the demand started to fade away. The first signs of lowering demand came after the Terra collapse, which forced several crypto lenders to redeem their wBTC. According to one report, Celsius Network redeemed about 9,000 wBTC amid a growing withdrawal demand.\n\nRelated: Celsius Network coin report shows a balance gap of $2.85 billion\n\nA similar scenario occurred in November 2022 after the FTX collapse, where reports indicate the now-bankrupt crypto exchange tried redeeming 3,000 wBTC just before filing for bankruptcy. After the FTX collapse in November, wBTC experienced its largest monthly coin redemption, with over 28,000 wBTC redeemed back to the original coin.\n\nInteresting nugget from today's $WBTC Twitter Space w/ @BitGo and @KyberNetwork:\n\n\n\nDuring FTX turmoil, someone from Alameda tried to redeem 3k WBTC for BTC.\n\n\n\nBitGo refused to honor.\n\n\n\nTokens were burned anyway.\n\n\n\nBitGo isn't sure what to do w/ the 3k BTC.https://t.co/A1wYY72skb — Chris Blec (@ChrisBlec) December 14, 2022\n\nThe market contagion caused by the FTX collapse also depegged wBTC from the original value of BTC. Although the slippage was just about 1.5%, it raised serious concerns about whether such synthetic tokens were a viable mode of value transfer."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS90aGUtY3J5cHRvLW1hcmtldC1iaWRlcy1pdHMtdGltZS0xMjk2NTc00gFEaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL3RoZS1jcnlwdG8tbWFya2V0LWJpZGVzLWl0cy10aW1lLzEyOTY1NzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Price – Bullish Short-term Technical Picture for Bitcoin and Ethereum - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xMjIyNjQvdGVyYXd1bGZzLW51Y2xlYXItYml0Y29pbi1wbGFudC1vbmUtcGllY2UtZ3JlZW4tbWluaW5nLXB1enpsZdIBXWh0dHBzOi8vZGVjcnlwdC5jby8xMjIyNjQvdGVyYXd1bGZzLW51Y2xlYXItYml0Y29pbi1wbGFudC1vbmUtcGllY2UtZ3JlZW4tbWluaW5nLXB1enpsZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "TeraWulf’s Nuclear Bitcoin Plant Is Just One Piece of the Green Mining Puzzle - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn Northeast Pennsylvania, a unique Bitcoin mining experiment is about to come online.\n\nCalled Nautilus, Terawulf is spinning up a nuclear-powered mining facility.\n\nFirst announced back in 2021, Terawulf said that when Nautilus is at full capacity later in Q1 this year, the facility’s fleet of 15,000 mining rigs will have a hash rate of 1.6 exahashes per second (EH/s). That amounts to 1.6 quintillion hashes every second, or about 0.54% of the total computational power of the entire Bitcoin mining network today, which is currently running at 294.09 EH/s.\n\nAD\n\nAD\n\nMore importantly, though, none of this new mining capacity will be powered by fossil fuels, potentially addressing years-long criticism of the premier cryptocurrency.\n\nBitcoin uses a proof-of-work (PoW) mining algorithm to validate transactions and secure the network. Miners, or computers optimized for verifying transactions and getting rewarded in Bitcoin, currently consume around 117 terawatt hours a year—the equivalent of a small country.\n\nThis figure doesn’t look like it will be slowing down anytime soon, either, as miners continue to deploy updated machines and even whole new fleets. The amount of global computing power used to mine Bitcoin, understood as hash rate, has been on a steady rise since 2016.\n\nBitcoin’s global hash rate since inception. Source: CoinWarz .\n\nIt’s not just miners watching this chart, either. With roughly 62% of the current energy mix powering all those machines coming from fossil fuels, regulators are taking note too.\n\nJust last year, New York signed a two-year moratorium banning any new fossil-fuel-powered Bitcoin miners to set up shop within state boundaries. A similar proposal targeting proof-of-work (PoW) mining was also put before European lawmakers, who comfortably voted it down.\n\nAD\n\nAD\n\nWhen asked if he had any concerns about a regulatory clampdown on PoW-based mining, Terawulf’s co-founder, CTO, and COO Nazar Khan told Decrypt that he hopes “they take input from people like ourselves.”\n\nTerawulf takes aim at green Bitcoin mining\n\nFounded in 2021 by Nazar Khan and Paul Prager, who were senior executives of Beowulf, an energy infrastructure company Prager had launched in 1990, Terawulf pitched itself as a “leading sustainable Bitcoin mining company.”\n\nWhen he began learning more about crypto in 2017, Khan had already spent over twenty years developing and operating power-generation facilities in the U.S. and abroad.\n\n“Once I started to understand how Bitcoin mining worked, it was clear to me that efficient and economic Bitcoin mining was heavily dependent on infrastructure and the cost of energy,” Khan says of his early days networking with miners.\n\n“Pick the name of a Bitcoin miner and I’ve probably talked to them at some point, trying to find a way to work together,” he told Decrypt. “I said, ‘hey, I know power, I know energy, let me find someone who knows Bitcoin mining.’ It became very clear to me that the level of sophistication in the space around energy, energy procurement, and development was very low.”\n\nA year before founding Terawulf, Khan’s team had also completed the construction of a large-scale facility for Marathon, one of the world’s largest mining companies.\n\nThis collaboration was followed by a call from energy company Talen, whose subsidiary, Cumulus Data, had built a data center adjoining the parent company’s 2.5 gigawatt Susquehanna nuclear power plant to host Bitcoin mining operations.\n\nThus, Nautilus was born.\n\nAD\n\nAD\n\nAdd Nautilus’ stats to the projected 3.8 EH/s capability of Terawulf’s hydro-powered Lake Mariner facility on the western side of the state of New York and it’s clear that Terawulf will have one of the biggest Bitcoin mining operations in the world, powered almost exclusively by renewable energy.\n\nBut it's about more than crypto miners tapping into abundant clean energy.\n\nKhan said how the Terawulf team’s long experience in energy infrastructure can also help make operations like Nautilus and Lake Mariner reliable consumers of Talen’s excess renewably-sourced electricity, but also responsive assets for local electrical grid operators.\n\nThe term “asset” broadly refers to mining farms that are both useful to have on a grid, and intangible assets to energy providers, offering high customer lifetime value (CLV)—essentially the value derived from having regular, dependable customers—thanks to their strategic locations that can keep energy prices low.\n\nIt’s all about location\n\nIn 2016, Beowulf parent company Riesling Power LLC bought a decommissioned coal plant in Somerset, on the western side of New York state. The Paris Agreement had been signed in New York City the previous year, leading to a 76% reduction in plans for new coal plants across the globe. The team knew they were essentially buying the plant to retire it.\n\nThe plant was integrated into the state grid through a network of transmission lines—those thick cables you see held up by imposing towers along global motorways. When it was operational, the transmission lines were rigged to move 700 megawatts of power out of the plant and onto the grid.\n\nDue to Khan’s professional background in energy infrastructure, though, he knew Terawulf could just as easily move 700 megawatts of power into the site to feed a fleet of Bitcoin miners.\n\nKhan then began sourcing energy for the site and found that the local zone (Zone A) of the grid—which is controlled by a not-for-profit company called the New York System Independent System Operator (NYISO)—produces “about four to five gigawatts” of power drawing from primarily renewable sources, namely hydroelectric power.\n\nAD\n\nAD\n\nBy March 2022, Terawulf’s first Bitcoin mine was operational: Lake Mariner.\n\nOf that five gigawatts, local demand only soaks up “a gig or a gig and a half” leaving an excess generation of more than three gigawatts to be conducted by transmission lines across the state, mostly to feed the Big Apple’s energy demands, known to the power industry as the “New York City load pocket.”\n\nKnowing local energy demands is key for strategically placing mining plants. If you position massive electrical loads in areas of high demand, you’re not only going to get high prices, you may drive them up further.\n\n“Bitcoin mining is one of the most efficient and economic load sinks around,” Khan explained. “We’re locating our loads in places where there’s high electricity supply and not much demand, so we can be a ‘sink’ to soak up energy at attractive prices while providing a way to sell electricity in places where there typically aren’t many buyers.”\n\nLocation is everything, but even more so for renewables. Nuclear reactors and hydroelectric plants don’t stop generating, and these facilities sometimes run for years without stopping.\n\nAnd just as not having enough energy can cause rolling blackouts, like what was seen in Texas last year, having too much energy can be just as dangerous for a grid.\n\nHerein lies another potential advantage of well-placed mining outfits.\n\nThey can turn machines off almost instantly during high demand or skim off excess energy from a grid when there's a high supply.\n\nAD\n\nAD\n\nGrid operators' minds blown\n\nThe grid is designed to meet peak demand plus a margin, but it only hits peak demand for 50-100 hours a year, says Khan.\n\nThat’s generally not something to worry about for a mining farm soaking up abundant clean energy in a low-demand area, but if the grid gets too heated, Terawulf’s mines—and Bitcoin mines in general—can drop their demands in seconds.\n\nThis is thanks to a tool at grid operators’ disposal called Automatic Generation Control (AGC). AGC adjusts the output of generators at different power plants in a given area of the grid to maintain a balance between generation in a given area (the power produced) and electrical load (the power consumed).\n\nIf a grid operator needs to add 15 or 25 megawatts to an area where the load is tight, Khan explains, they send a signal to a power plant in an area with excess generation to tell it to come down. In other words, when operators need to add generation to an area, they have to bring it down somewhere else.\n\nTypically, AGC has a 15-minute response time, so from the moment the grid operators send the signal to the plant to the moment the plant has achieved its satisfactory level, a quarter of an hour has passed.\n\nFor Bitcoin mining, the response time is more like fifteen seconds.\n\n“[Grid operators’] mind is kind of blown when they think about it,” said Khan. “We have a load that’s responsive in 10, 20, 50, 100 megawatts in less than a minute, and you can bring it back up just as quickly. That kind of responsiveness is unheard of, and when operators understand how responsive we can be, they’re enamored with it.”\n\nThis rapid response time is due to the fact that a typical top-of-the-line Application-Specific Integrated Circuit (ASIC) or mining machine can be turned off in less than a minute, making even a fleet of them more responsive than a nuclear generator.\n\nAD\n\nAD\n\nThe signal to turn off can also be scheduled a day ahead or in real time with no difference in the ability of the electric load to respond. This isn’t the case with most industrial-scale loads.\n\nSeen this way, miners like Terawulf emerge less as pioneers of green crypto mining, and more as another tool that grid operators can turn to maintain a delicate balance of supply and demand.\n\nMiners can change their needs on a dime, soaking up excess energy when there's a glut of energy, or turning their machines off in the case of higher demands elsewhere."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2luLWNvcmUtZGV2ZWxvcGVyLWx1a2UtZGFzaGpyLWNhbGxzLW91dC11bmF1dGhvcml6ZWQtb3JkaW5hbC1uZnQtd2l0aC1oaXMtbmFtZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Core Developer Luke Dashjr Calls Out Unauthorized Ordinal NFT With His Name - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZyaWVuZGx5LWNhc2gtYXBwLWludGVncmF0ZXMtdGF4Yml0LWFtaWQtdGF4LWZpbGluZy1zZWFzb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin-friendly Cash App integrates TaxBit amid tax-filing season - Cointelegraph",
        "content": "Mobile payments processor Cash App has integrated crypto tax and accounting software TaxBit into its services, giving Bitcoin (BTC) holders a more streamlined approach to reporting their taxes.\n\nAs of Feb. 28, Cash App users can now keep track of their Bitcoin transactions for tax reporting purposes using TaxBit, both companies announced. TaxBit’s chief operating officer Lindsey Argalas said her company’s platform simplifies tax reporting “for everyone who has integrated digital assets into their portfolio.”\n\nCash App launched its Bitcoin trading services in 2018 and rolled out BTC deposits the following year. The company claims to have over 10 million Bitcoin users. Cash App’s parent company, Block Inc., has generated billions of dollars in Bitcoin revenue over the years. According to United States Securities and Exchange filings, Block Inc. generated $1.96 billion in Bitcoin revenue during the fourth quarter of 2021.\n\nRelated: What is crypto tax-loss harvesting, and how does it work?\n\nTaxBit launched TaxBit Network in 2022 to provide crypto traders free tax forms. The industry consortium launched with over a dozen U.S.-based companies, including PayPal, Coinbase, Binance.US, Paxos and Gemini.\n\nThree things are certain in life: Death, taxes, and Bitcoin's scarcity! pic.twitter.com/Y3WZwIUpGV — Cointelegraph (@Cointelegraph) January 9, 2022\n\nWashington’s Internal Revenue Service, or IRS, set Jan. 23 as the start of the 2022 tax filing season. Most taxpayers have until April 18 to file and pay taxes owed. In January, the IRS reminded taxpayers of their crypto income reporting obligations — this includes capital gains from trading, mining and staking activities."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91a3JhaW5lLW5ldHRlZC03MG0taW4tY3J5cHRvLWRvbmF0aW9ucy1zaW5jZS1zdGFydC1vZi1ydXNzaWEtY29uZmxpY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ukraine netted $70M in crypto donations since start of Russia conflict - Cointelegraph",
        "content": "Ukraine has received over $70 million in cryptocurrencies since the start of the Russian-Ukrainian conflict, providing the nation with funds for military equipment and humanitarian assistance.\n\nThe figures came from a Feb. 24 report by blockchain data platform Chainalysis, which found the majority of the funds to have come in the form of Ether (ETH) and Bitcoin (BTC).\n\nETH donors led the way with $28.9 million given, while donors of BTC and Tether (USDT) chipped in $22.8 million and $11.6 million, respectively.\n\nCryptocurrencies donated to Ukraine wallets provided by the Ukrainian government. Source: Chainalysis\n\nDonations have also come in the form of nonfungible tokens, such as UkraineDAO’s auction of a Ukrainian flag NFT thasold for $6.1 million.\n\nAround 80% of the total $70 million donated came in the first few months of the war, with the speed of cryptocurrency payments fast-tracking the country’s ability to respond to the Russian invasion, Ukrainian deputy digital minister Alex Bornyakov explained in an interview with Yahoo Finance on Feb. 24:\n\n“If we used the traditional financial system it was going to take days [...] We were able to secure the purchase of vital items in no time at all via crypto, and what is amazing is that around 60% of suppliers were able to accept crypto, I didn’t expect this.”\n\nBornyakov added that the Crypto Fund Aid For Ukraine was an “absolute success” and that he was blown away by not only the amount of donations that came through but the ease at which the digital ministry could access those funds for Ukraine’s defense.\n\nAlona Shevchenko, co-founder of Ukraine DAO, also explained to Yahoo Finance that cryptocurrencies provided a solution when restrictions were imposed on the Ukrainian central banking system:\n\n“The central bank introduced limits on foreign currency transfers in and out of Ukraine to stop the run on the hryvnia [...] Thanks to crypto we were able to cover some of our defenders’ immediate needs, there was literally no other way at the time.”\n\nAccording to an August tweet bMykhailo Fedorov, Ukraine’s vice prime minister and minister of digital transformation, much of the cryptocurrency payments to the digital ministry have been used to fund the country’s military equipment, armor clothing and a range of vehicles and medicine.\n\nWith $54 M raised by @_AidForUkraine, we've supplied our defenders with military equipment, armor clothes, medicines and even vehicles. Thanks to the crypto community for support since the start of the full-scale invasion! Donation by donation to the big victory. Report below. pic.twitter.com/lifHAP8R4f — Mykhailo Fedorov (@FedorovMykhailo) August 17, 2022\n\nThe increased reliance on cryptocurrencies in Ukraine looks to have increased adoption in the country, with a September report by Chainanalysis finding Ukrainians to be the third-highest adopters, behind Vietnam and the Philippines.\n\nRelated: What the Russia-Ukraine war has revealed about crypto\n\nHowever, pro-Russian military groups have also used cryptocurrency to crowdfund their war efforts, including using crypto donations to fund military purchases, spread disinformation and create pro-invasion propaganda, according to Chainalysis.\n\nTotal value received by Russian military groups since February 2021. Source: Chainalysis\n\nThe 100 groups have received a total of $5.4 million over the course of the war, however, incoming donations have fallen considerably since July.\n\nIt is unclear what impact sanctions had on this downtrend, but a 10th package of sanctions against Russia was introduced on Feb. 24.\n\nMeanwhile, a recent crime report by Chainalysis found that of the $456.8 million total ransomware payments in 2022, a majority of these funds were taken by “actors” believed to be based in Russia.\n\nChainalysis explained that such attacks are often utilized by bad actors for political agendas, such as that of Russia-based pro-conflict ransomware group Conti, which reeled in $66 million from victims in 2022 and has previously announced its “full support” of the Russian government."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGFpbHljb2luLmNvbS95dWdhLWxhYnMtZHJvcC1uZnQtY29sbGVjdGlvbi1vbi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "BAYC Creators Yuga Labs Drop First NFT Collection on Bitcoin - DailyCoin",
        "content": "The Web3 giant Yuga Labs apes into Bitcoin NFTs with TwelveFold.\n\nThe generative art collection explores time, mathematics, and variability.\n\nCrypto Twitter divided by the unexpected move, BAYC floor price drops 2%.\n\nYuga Labs announced the TwelveFold NFT collection, the company’s first on Bitcoin’s blockchain. TwelveFold NFT is a generative art collection inscribed in Satoshis, the smallest recognizable part of the Bitcoin blockchain. The NFTs combine featured 3D animations with hand-painted elements.\n\nHere’s how Yuga Labs co-founder Greg Solano explained the idea behind the first Bitcoin NFT collection:\n\n“TwelveFold is a base 12 art system localized around a 12x12 grid, a visual allegory for the cartography of data on the Bitcoin blockchain.”\n\nIntroducing TwelveFold. A limited edition collection of 300 generative pieces, inscribed on satoshis on the Bitcoin blockchain.https://t.co/aFWEIhzqcI pic.twitter.com/PjWABKKBr4 — Yuga Labs (@yugalabs) February 27, 2023\n\nWhen to Expect TwelveFold NFTs\n\nEven though no exact launch date was given, the official Yuga Labs Twitter handle mentioned there would be a “24-hour notice” sometime later this week. Besides, the generative 12 x 12 art pieces are limited to 300 NFTs, meaning the NFT collection will likely sell out in hours.\n\nThe TwelveFold auction will launch later this week. There will be a 24-hour notice with auction details and exact timing. — Yuga Labs (@yugalabs) February 27, 2023\n\nDespite the news, Yuga Labs native Bored Apes NFT floor price dipped by 2% after the message and now stands at 69.69 Ethereum (ETH). However, the ground-breaking news painted a bullish pattern for the Mutant Ape Yacht Club (MAYC), as trading volume soared 43% on OpenSea. In addition, the news positively impacted Bored Ape Kennel Club and Otherdeed for Otherside NFT projects, with 16% and 6% daily gains, respectively.\n\nMoreover, the Yuga Labs Satoshi-inscribed collection rides the wave of Ordinals. The protocol lets its users inscribe NFTs on Bitcoin’s blockchain, which made the feature technically possible after the Taproot upgrade went live. Ordinals have been the reason for record block height on the blockchain, as well as heated debates on whether Bitcoin should host NFTs.\n\nYuga's TwelveFold auction next week could be the Ordinals equivalent of the $69M Beeple sale. Don't fade NFTs on Bitcoin. — Leonidas.og (@LeonidasNFT) February 28, 2023\n\nOn the Flipside:\n\nThe move by Yuga Labs caused immense backlash from Crypto Twitter, as some NFT enthusiasts are calling it “a total cash grab” and “being desperate for money.”\n\nWhy You Should Care:\n\nGenerative art NFT collections ignited a new trend, resulting in the year’s biggest surge in NFT trading volume.\n\nLearn more about the top trending NFT collections:\n\nOpepen NFTs on Blur Surge 700%, Blur Breaks Trading Record\n\nCoinbase NFT Mint Extended in Base Upgrade Celebration"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbmdlZWsuY29tL29yZGluYWxzLW9uLWJpdGNvaW4td2l0aG91dC1zZWd3aXQtYW5kLXRhcHJvb3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ordinals on Bitcoin without SegWit and Taproot - CoinGeek",
        "content": "This post was first published on Medium.\n\nOrdinals has become a hot topic in BTC circles to create non-fungible tokens (NFTs). Its main feature is storing the NFT itself entirely on chain.\n\nWe show that the original Bitcoin protocol can already support it. No breaking changes, including both SegWit and Taproot, are needed for Ordinals to work. Actually, it works better on the original protocol: 100,000X cheaper and 12.5X bigger.\n\nHow Ordinals Works\n\nOrdinals is the latest manifestation of color coins, which marks individual satoshis (thus “coloring” them) such that they can carry extra information. More specifically, every satoshi is sequentially ordered based on the time it is mined, which was first proposed in the Bitcoin forum in 2012. Each satoshi will have an ordinal number between 0 and 2,100,000,000,000,000 (hence the term “ordinals”) assigned. Each unique satoshi can then be inscribed with some other information to create NFTs (aka inscriptions).\n\nWhen an Ordinal NFT is minted in a transaction, it is inscribed on the first satoshi of the first output of the transaction. The transaction contains some extra data: text, images, videos, etc. Afterward, it can be transferred just like regular bitcoins.\n\nConsider an example transaction with three inputs and two outputs.\n\nThere are six satoshis from three addresses in the inputs. The outputs contain five satoshis to two different addresses. The remaining one satoshi is used as a fee to pay the miner.\n\nOrdinals uses the first-in-first-out algorithm to assign each satoshi of the inputs to the outputs. Any missing ordinals go to the miner. In the example, Ordinals (and their represented NFTs, if any) A, B, C, and D go to the first output, F to the second, and F to the miner.\n\nCompare with other Bitcoin-based NFTs\n\nPrevious colored coins usually use OP_RETURN, an unspendable output with only 80 bytes of metadata maximally, which means a link/reference to NFT is stored.\n\nOrdinals stores the entire NFT image/content on-chain using these techniques.\n\nThe Taproot upgrade in 2021 removed the data limit entirely, as long as it fits inside a block. Segregated Witness (Segwit) software upgrade in 2017 allows up to 3MB of witness data to be stored ‘outside’ of the 1MB block limit. Together, they provide up to 4MB worth of storage space for the inscription content. Inscriptions are stored in an “envelope” between Opcodes OP_IF and OP_ENDIF. OP_FALSE precedes OP_IF to ensure that this data is never actually used in script execution and does not take up stack space. No OP_RETURN is used, and the output containing an inscription is spendable and thus unprunable. The following example inscribes the text “Hello, world!”:\n\nOrdinals on Bitcoin SV\n\nThe original Bitcoin protocol of today, Bitcoin SV (BSV), pioneered storing NFT entirely on chain as early as 2021. Since BSV and BTC share the same algorithm for issuing satoshis, they can assign satoshis ordinal numbers in the same way. Ordinals on BSV works overwhelmingly better than on BTC.\n\nCost: BTC fees are around 10 sat/byte, while BSV’s are only 0.05 sat/byte¹. Given the price of $25,000/BTC vs. $45/BSV as of today, minting the same NFT is >100,000X cheaper! Data size: BSV has restored the full Script after the Genesis upgrade, so the same envelope works. It also has more ways to embed the data in a transaction. For example, OP_RETURN can be used in a spendable output. Currently, up to 50MB of data can be included in a single transaction, 12.5X bigger than the 4MB limit on BTC. Here is a transaction of 27MB and another of 12MB. Data limit is expected to increase continuously as usage grows. More advanced NFT protocol on top has already stored NFT over 1GB, by breaking it up across multiple transactions.\n\nWe are thrilled to announce that in partnership with STAS and @Bitstocks_, we have minted the largest #NFT ever on a public blockchain. At 1.07 GB in size, this single NFT is ~1/300th the size of the #BTC blockchain. Relysia Infrastructure – It's time to upgrade! #BSV pic.twitter.com/0vAE3OziCF — Relysia (@Relysia_SV) October 7, 2021\n\nBSV does so without changing the protocol. No SegWit and Taproot is needed.\n\nReferences\n\n[1] https://docs.ordinals.com/\n\n[2] https://medium.com/coinmonks/ordinals-an-overview-of-bitcoin-nfts-795c39447e23\n\n[3] https://tara-annison.medium.com/a-comprehensive-explanation-of-ordinals-nfts-on-bitcoin-67b11868e74f\n\n[4] https://www.chain.com/blog/what-are-bitcoin-ordinals\n\n***\n\nNOTE:\n\n[1] We compare the average fee rate. In BTC, SegWit can bring 4X discount, and in BSV, some miners take 0.01 sat/byte, a 5X discount.\n\nWatch: Smart Contracts and Computation on BSV\n\nwidth=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDIvMjcvZHJha2UtbG9zZXMtNDAwMDAwLXdvcnRoLW9mLWJpdGNvaW4tYWZ0ZXItYmV0dGluZy1vbi1qYWtlLXBhdWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Drake Loses $400,000 Worth of Bitcoin after Betting on Jake Paul - Crypto Times",
        "content": "The five-time Grammy Award-winning rapper, Drake, lost $400,000 in bitcoin, about 17 BTC, after betting that Jake Paul would defeat British professional boxer Tommy Fury in the boxing matchup held in Diriyah, Saudi Arabia.\n\nYouTuber-turned-boxer Jake Paul becomes the latest victim of the infamous ‘Drake Curse,’ as the rapper has a history of supporting an individual or team for them to lose eventually.\n\nBefore this game, Paul had won six consecutive games. World heavyweight champion Tyson Fury’s half-brother Tommy Fury defeated Paul in the eight-round fight by split decision despite being knocked out in the final bout.\n\nDon’t judge me by my wins, judge me by my losses. Congrats to Tommy, his team and his family. Thank you to everyone that tuned in. Saudi Arabia thank you as well. I will be back. — Jake Paul (@jakepaul) February 27, 2023\n\nPaul’s biggest match to date took place as he had only faced MMA fighters, YouTubers, and ex-NBA players in the ring before his fight with Tommy Fury. Drake placed the bet on the crypto gambling platform Stake.\n\nPaul made light of Drake’s bet during the press conference that followed the fight saying “F***! This is Drake’s fault! Drake, bro, why did you do this to me? No, it’s my fault. $400,000 is nothing to him – he has won a lot more money betting on me before. He’s probably about even now. Sorry, Drake, I’ll get that win in the rematch.”\n\nDrake is known for placing various crypto bets. Last May, Drake lost more than $200,000 worth of bitcoin on a Spanish Grand Prix bet. The rapper previously bet $1.26 million worth of bitcoin on the Super Bowl match between the LA Rams and the Cincinnati Bengals."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wMi8yOC8yNjE3NTAwLzAvZW4vVGhlLU1vb25iaXJkcy10by1CZS1SZWxlYXNlZC1hcy1hLUJpdGNvaW4tTkZULUNvbGxlY3Rpb24uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "“The Moonbirds” to Be Released as a Bitcoin NFT Collection - GlobeNewswire",
        "content": "Brighton, UK, Feb. 28, 2023 (GLOBE NEWSWIRE) -- Moonbird NFTs attracted nearly $500 million in sales last April. Users now will have a chance to enter the promising Birds NFT collection on Bitcoin via the recently introduced Ordinals protocol.\n\n\n\nAfter a meteoric rise in popularity, the BAYC monkeys have solidified themselves as one of the top-selling NFT collections, with a whopping value of $1.3M. The descendant of the final collection of NFTs has now been released on the Bitcoin blockchain, drawing lots of attention from the NFT enthusiasts worldwide.\n\n\n\nThe Birds NFT collection is about to pick up the trend, dropping their collection onto the Bitcoin’s NFT Ordinals Protocol with a $200,000 prize for one of the participants. Birds BTC is a collection of unique utility-enabled PFPs that feature a rich, diverse and unique pool of rarity-powered traits on the Ordinals protocol. The collection is bound to live up to its global name and maintain its unchallenged leadership in the NFT \"PFP\" space, spinning off as Bitcoin NFTs.\n\n\n\nConsisting of 10,000 PFPs, the collection comes with a special set of rare traits available on Ordinals. With design elements comparable to projects like Bored Ape Yacht Club and CryptoPunks, it's no surprise this Bitcoin-based series has sparked excitement in the entire NFT space.\n\n\n\nThe world of Bitcoin and NFTs is getting more interesting by the minute. The demand for a reunion with the “root of all blockchains” has sent its growth skyrocketing, proving this could be another sign pointing towards the bull market. The Ordinals protocol has been shaking up the crypto marketplace ever since making its debut in 2014. However, it was only two weeks ago that things truly started to heat up when NFTs found their way onto Bitcoin's blockchain thanks to the nifty code updates of SegWit and Taproot. Adding even more fuel to the fire, Ordinals recently made headlines again as they debuted a collection called 'Ordinal Punks,' taking inspiration from CryptoPunks' iconic designs.\n\nThe Birds NFT collection is the next to join the fast-growing Bitcoin NFT boom. Since the Moonbirds launch on April 16th, 2022 on Ethereum, it has already raked in a whopping $500 million from the buyers, with an impressive first 48 hours being bolstered by over $200 million alone. Ethereum put up quite a fight, but now bets are firmly placed against them as speculators make bold predictions of even greater success for its Bitcoin “spin-offs” down the line.\n\nWith record revenues and CryptoSlam placing this project second only to their bestselling counterpart, it's not a surprise that its titanic popularity has attracted some high-profile fans such as Beeple, Tim Ferriss, Garry Vee and Alex Ohanian, among many others. Its 10k utility-enabled PFP tokens provide additional value along with unique mint features, making sure that the Moonbirds stay flying high. After the first 500 Bird NFTs are purchased, $5,000 will be split among 32 purchasers. Once the 10,000 Bird NFTs are sold out, $200,000 will be awarded to a random purchaser. Purchasing more than 10 Bird NFTs in one transaction applies a discount of 5 up to 20%.\n\nHead over to moonbirdsbtc.com on February 28th at 12:00 UTC and get your hands on a unique Birds NFT on the thriving Bitcoin for only 0.008 BTC.\n\nFollow them on Twitter, Telegram and Discord\n\n"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRoZW5ld3NtaW51dGUuY29tL25ld3MvZGVmaS1iaXRjb2luLXdoYXQtc3RhY2tzLXN0eC0xNzM4NzfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "DeFi on Bitcoin: What is Stacks (STX)? - The News Minute",
        "content": "After the phenomenal success of Bitcoin, people like Vitalik Buterin figured out that the functionality of Bitcoin was inherently limited. For instance, Bitcoin has proved itself to be the best performing asset of the decade. Yet when it comes to scaling the Bitcoin network to say, a billion users, challenges arise. Satoshi Nakamoto had given utmost importance to security and decentralization when designing the protocol leaving no room for bigger alterations that can be made to the network to handle high traffic or complex protocols. Despite the shortcomings, several developers have built innovative products on top of Bitcoin."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1idWxsLXJ1bi1vbi10aGUtaG9yaXpvbi1leHBlcnRzLWFuYWx5c2Utc3VyZ2UtcGFzdC0yNWstaW4tMjAyMy0xMDE2NzMzMS5odG1s0gGSAWh0dHBzOi8vd3d3Lm1vbmV5Y29udHJvbC5jb20vbmV3cy9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWJ1bGwtcnVuLW9uLXRoZS1ob3Jpem9uLWV4cGVydHMtYW5hbHlzZS1zdXJnZS1wYXN0LTI1ay1pbi0yMDIzLTEwMTY3MzMxLmh0bWwvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bull run on the horizon? Experts analyse surge past $25k in 2023 - Moneycontrol",
        "content": "Bitcoin, the world’s largest digital currency, surged last week, breaking past the $25,000 mark and reaching a new high for 2023. This was an almost 60 percent gain for the cryptocurrency from the low of $15,742 in 2022 following the FTX crisis in November. Bitcoin's value has been increasing steadily since then.\n\nThe last time Bitcoin was at a similar level was in mid-June of 2022, after which it stagnated for a prolonged period, with values hovering in the $19,000 to $21,000 range for several months. The cryptocurrency is still well below its peak of $68,992, which it reached in November 2021.\n\nStory continues below Advertisement Remove Ad\n\nExperts said that while the surge above $25,000 was a positive sign, the market remains susceptible to sudden changes. They advise investors to remain vigilant and prepared to react quickly to market movements.\n\nAccording to Ben Sharon, cofounder of LumiShare SRG, factors such as regulatory changes, geopolitical tensions, and the performance of major players like Bitcoin will all have an impact on the market, which looks positive at this stage. “The bull market will begin within the next two quarters,” Sharon told Moneycontrol.\n\nAlso Read: Top Cryptocurrency Prices Today February 27: Bitcoin, Ether in green as crypto mcap rises\n\nMatter of regulation\n\nAnother market analyst said Bitcoin is still largely misunderstood or misrepresented and the real question for investors is how regulatory authorities treat the cryptocurrency ecosystem.\n\nNathan Thompson, a lead tech writer at Bybit, noted that Bitcoin is currently traded as a risk asset and is affected by many macro factors. These include inflation, recession, and general discourse, which have a direct impact on the price of cryptocurrency.\n\nStory continues below Advertisement Remove Ad\n\nStory continues below Advertisement Remove Ad\n\nThompson emphasised that Bitcoin and other blockchain-based assets are a net gain in terms of access and efficiency and if allowed to flourish, they will increase productivity and growth worldwide. Sean K. August, CEO of The August Wealth Management Group, said crossing the $25,000 mark is a significant milestone for Bitcoin, which could potentially continue to rise in the short term.\n\nHowever, the future of Ethereum, the second-biggest cryptocurrency by market capitalisation, may depend on factors such as the adoption of the Ethereum blockchain and the launch of new projects and applications.\n\nAugust said the crypto market is highly volatile and subject to fluctuations, influenced by factors such as regulatory changes, adoption by institutional investors, and the macroeconomic environment. Modulus CEO Richard Gardner notes that the macroeconomy is only moving the market for the short term, and the real question for Bitcoin investors is how regulatory authorities will treat crypto.\n\nUntil there is regulation, the sector will be stuck in a holding pattern. Gardner predicts that crypto will truly break free in a meaningful way only when regulatory authorities provide oversight.\n\nIntergovernmental blockchain expert Anndy Lian said the recent surge in BTC price cannot be attributed solely to its intrinsic value – it is also heavily influenced by the current global economic climate. Bitcoin is viewed as a safe haven asset and its decentralised nature makes it an attractive option for those who are sceptical of traditional financial institutions.\n\nWhitney Setiawan, a research analyst at cryptocurrency exchange Bitrue, has predicted that the current market for Bitcoin and Ethereum could signal the start of a bull run in the near future. According to Setiawan, the crypto market is influenced by factors such as inflation slowing globally and the US Federal Reserve taking a slightly dovish tone.\n\nSetiawan cited the bottoming of crypto prices and the buy-on-the-dip mentality of traders as the main drivers for the recent price surge. Setiawan noted that historically, bear market rallies with a parabolic upward movement are quite common before a substantial decrease in price, and this could be the case this time as well."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS90YXhlcy9maWxpbmcvYml0Y29pbi1jcnlwdG8tdGF4ZXMtMjAyMy13aGF0LXlvdS1uZWVkLXRvLWtub3cv0gFgaHR0cHM6Ly93d3cuZ29iYW5raW5ncmF0ZXMuY29tL3RheGVzL2ZpbGluZy9iaXRjb2luLWNyeXB0by10YXhlcy0yMDIzLXdoYXQteW91LW5lZWQtdG8ta25vdy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin and Crypto Taxes in 2023: What You Need To Know - GOBankingRates",
        "content": "Since cryptocurrency exchanges are still in their infancy, you shouldn’t expect them to provide you with any year-end tax information regarding your crypto holdings or transactions. The same was true in the early days of stock brokerages. But whereas brokerage firms now provide customers with transaction data and gain/loss information regarding their holdings, most crypto exchanges still do not. This is scheduled to change in tax year 2023 when crypto exchanges will be required to send out a 1099 to customers. But for now, you should take care to record all of your transactions on your own, particularly when it comes to calculating taxable gains or losses."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNpdHlhbS5jb20vb2t4LXNheXMtaXQtaG9sZHMtOC02LWJpbGxpb24taW4tYml0Y29pbi1ldGhlcmV1bS1hbmQtZG9sbGFycy1hcy1wcm9vZi1vZi1yZXNlcnZlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "OKX says it holds $8.6 billion in Bitcoin, Ethereum and dollars as proof-of-reserves - CityAM - City A.M.",
        "content": "OKX says it holds $8.6 billion in Bitcoin, Ethereum and dollars as proof-of-reserves\n\nLennix Lai\n\nOKX, the world’s second-largest crypto exchange by trading volume, has revealed it holds $8,6 billion in Bitcoin, Ethereum and US dollars.\n\nThe Web3 platform published its fourth monthly proof-of-reserves (PoR) to allow users to view the reserves as well as using open-source tools to check their liabilities.\n\nOKX says more than 175,000 unique users visit the PoR page and in excess of 90,000 unique users verify their liabilities accounted for in the PoR. Third party data shows that OKX holds the largest 100% clean asset reserves among major exchanges.\n\n“We are proud to continue the monthly publishing of our proof-of-reserves in line with our unwavering commitment to transparency and trust here at OKX,” said Lennix Lai, Managing Director of Financial Markets.\n\n“Our data shows that hundreds of thousands of our users have taken an active interest in viewing our historical reserves and using open-source tools to verify their liabilities are included. Proof-of-reserves is far from a niche topic – it is of vital importance to building user trust and we are dedicated to ensuring OKX shows continued leadership in this area.”\n\nWhat does ‘proof-of-reserves’ mean?\n\nProof-of-reserves is a report of crypto assets that ensures the custodian (in this case OKX) holds the assets it claims to hold on behalf of its users. OKX uses the Merkle tree (hash tree) to prove this claim in two ways. First, users can find their balance in the tree and prove their assets are held in the total OKX balance. Second, the total OKX balance is compared to the publicized OKX on-chain wallet balance to determine proof-of-reserves.\n\nWhat are ‘clean reserves’?\n\nAssets are considered ‘clean’ in PoR when a third party analysis determines they do not include an exchange’s platform token, and are solely made up of high market cap ‘traditional’ crypto assets such as BTC, ETH and USDT. Blockchain analytics firm CryptoQuant monitors PoR across the industry, and found OKX’s assets to be ‘100% clean‘."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vY3J5cHRvY3VycmVuY3kvc3RvcnkvYml0Y29pbi1ldGhlcmV1bS1zb2xhbmEtaW4tdGhlLXJlZC16b25lLW9uLTI4LWZlYnJ1YXJ5LTIwMjMtMjM0MDUyNy0yMDIzLTAyLTI40gGBAWh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vYW1wL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2JpdGNvaW4tZXRoZXJldW0tc29sYW5hLWluLXRoZS1yZWQtem9uZS1vbi0yOC1mZWJydWFyeS0yMDIzLTIzNDA1MjctMjAyMy0wMi0yOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency price in India 28 February 2023: Bitcoin at $23,480, Ethereum falls 0.99%, the market remains in the red zone - India Today",
        "content": "After remaining in the green yesterday, the prices of top cryptocurrencies on Tuesday noticed a fall. Bitcoin decreased by 0.35 percent to stand at $23,480. This continued in the value of Ethereum by a 0.49 percent fall to trade at $1633.\n\nOn the declining value of Bitcoin, Mr. Sathvik Vishwanath, Co-Founder and CEO of Unocoin said, \"The cryptocurrency market has seen mixed moves over the past 24 hours, with Bitcoin facing significant resistance at $23,750, leading to a bearish correction that may push the value further down to $22,800.\"\n\nadvertisement\n\nHe added, \"On the other hand, the price of Ethereum fell by 0.99 percent to $1,627.03 with a trading volume of $7,497,106,810. However, there is still hope for an upside if Ethereum breaks the $1,625 resistance level, or eventually reaches $1,674.\"\n\nAs the market fell, the price of other top tokens like Solana and Litecoin recorded a loss of 1.95 percent to $22.58, and 0.74 percent to $94.32, respectively. This decline was further noticed in Polkadot by 1.42 percent to $6.58. The price of Avalanche was down by 2.88 percent to $17.80, followed by a slip in XRP of 0.29 percent to $0.375445. At that time, Cosmos dropped 0.81 percent and Monero dipped 1.89 percent.\n\nOn 28 February, the global crypto market cap decreased by 0.45 percent to $1.07 trillion in the past 24 hours. Contrastingly, the total crypto market volume stood at $45.38 billion, having registered an increase of 30.57 percent.\n\nGainers and decliners of the day\n\nAccording to CoinMarketCap, the top gainers were NEM, SingularityNET, Synthetix, and Stacks. Contrarily, the top losers were Bone ShibaSwap, Conflux, Polygon, and Aave.\n\nMeme coins notice decrease\n\nOn Tuesday, the value of meme coins plunged. Shiba Inu recorded a slip of 2.58 percent to $0.000013. The value of Dogecoin fell 0.06 percent to $0.082019. This continued in Dogelon Mars with a 3.70 percent decrease.\n\nMetaverse tokens in the green\n\nA majority of the top metaverse tokens remained in the red zone. The price of The Sandbox recorded a loss of 0.57 percent, which continued in Axie Infinity by a 0.27 percent reduction. In contrast, Decentraland was up by 0.27 percent."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWNvcmUtZGV2ZWxvcGVyLWNhbGxzLW91dC1uZnQtYXVjdGlvbi1mb3ItdXNpbmctaGlzLWNyZWRlbnRpYWxzL9IBYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWNvcmUtZGV2ZWxvcGVyLWNhbGxzLW91dC1uZnQtYXVjdGlvbi1mb3ItdXNpbmctaGlzLWNyZWRlbnRpYWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Core developer calls out NFT auction for using his credentials - AMBCrypto News",
        "content": "Bitcoin Core developer Luke Dashjr has called out the organizers of a recent NFT auction for using his name.\n\nDashjr’s name and code was reportedly used without his consent to solicit more than $9500 from an NFT buyer.\n\nLuke Dashjr, a core developer for Bitcoin [BTC], took to Twitter to share his concerns about Non-Fungible Tokens [NFT] that were being sold using his name. The incident involved a picture of the core developer’s code, which was presented to the public as an NFT at an auction. The code fetched 0.41 BTC ($9500).\n\nI want to make public my concern about \"NFTs\" which are being sold utilizing my name. Recently, a picture of code I wrote was sold at auction for .41 BTC. It was advertised as my code in the listing and presented to the public for sale and profit. ?1/9 pic.twitter.com/5TcEJu4p5e — Luke Dashjr (@LukeDashjr) February 27, 2023\n\nLuke Dashjr’s name and code used without consent\n\nAccording to the Twitter thread, the organizers of the third-party auction used the Bitcoin Core developer’s name and code without his consent or knowledge. Dashjr accused the organizers of misleading the public and creating confusion in the market, citing the fact that the winner of the auction had personally contacted him.\n\nLuke Dashjr clarified that the organizer had contacted him to offer 90% of the proceeds of the auction, with a 10% cut as auction fees. However, the Bitcoin Core developer refused to accept the payment, claiming that it was an attempt to bribe him into silence after the auction had already taken place. He further asked the organizer to refund 100% of the amount to the buyer.\n\nDashjr revealed that this wasn’t the first time that his name was used for such purposes. According to him, other Bitcoin developers have also faced similar situations.\n\nThrough his tweet, while bringing awareness to the situation, he said:"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL25ld3MvbWlkbGFuZHMtbmV3cy9tYXJ0aW4tbGV3aXMtZGV2YXN0YXRlZC1pdHYtbW9ybmluZy0yNjM1MDM5M9IBZGh0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL25ld3MvbWlkbGFuZHMtbmV3cy9tYXJ0aW4tbGV3aXMtZGV2YXN0YXRlZC1pdHYtbW9ybmluZy0yNjM1MDM5My5hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Martin Lewis devastated as ITV This Morning viewer loses £12,000 in dreadful mistake - Birmingham Live",
        "content": "Martin Lewis has issued a warning on ITV This Morning after being left \"sick\" following a viewer falling victim to a scam. Mr Lewis spoke out over a Bitcoin scam as he dialled in via video link.\n\nMr Lewis was called by a caller who has lost £12k to a fake Bitcoin advert. Mr Lewis, addressing Holly Willoughby and Phillip Schofield, was left fuming at the callous scammers.\n\nMartin said: \"Every time I hear a story like that, it makes me fell slightly sick If I'm honest with you.\" He added:\"It is very difficult, there are push payment regulations now and scam regulations that means maybe the bank will be able to recoup the money from the scammers bank. I would certainly in the first instance speak toCitizens Advice Consumer Helpline.\n\nREAD MORE Good Morning Britain slapped with complaints after 'uncomfortable' Ed Balls and Lee Mead interview\n\n\"When I sued Facebook about this, I settled for a £3 million donation to set up Citizens Advice scam action and you can get 1-1 scam help from the consumer helpline. Clearly the information given me isn't enough for me to help you and to be honest, there's not much I can do.\n\n\"It is very difficult to fix after it's happened. So all those, especially This Morning fans, because Phil and Holly they use you as well, you're often in the picture with me or by yourself. We don't talk about this, this isn't about Bitcoin, none of this has anything to do with crypto-currency, this is just what people do.\"\n\nHe continued: \"They think, hmmm, what we can use what people trust? Whether it is myself, or it is Phil and Holly or their faces, and it is one of the Dragons from BBC Dragons Den, or Richard Branson, or one of the others. They use our faces and they use a word somebody knows: Bitcoin.. They put the two together as a dog whistle to get people to think that these are proper get rich schemes, then they steal your money.\"\n\nMartin added: \"Because they are criminals, they are thieves, there is no investment and it may sound plausible and they will always start off with 'give us £250'.\" He added: \"Guess what? Your investment has done really well - give us a bit more.\" He added: \"They are sophisticated, clever and physiologically devious. You have to protect yourself, we have to keep getting the word out.\""
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvYml0Y29pbi1kZWZpLWd1aWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "DeFi on Bitcoin Explained | How Does It Work? Beginner's Guide - Finbold - Finance in Bold",
        "content": "This guide will delve into DeFi on Bitcoin, explaining what DeFi is and how it has been applied to the Bitcoin network, as well as consider some challenges inherent within this nascent ecosystem. Additionally, we highlight notable projects within this space and consider their advantages over others created on rival blockchains.\n\nWhat is DeFi?\n\nDefinition Decentralized Finance, or DeFi for short, refers to financial tools and products designed to revolutionize and replace traditional forms of banking that dictate how one accesses services such as loans and savings. DeFi aims to make finance accessible to anyone and everyone without the help of intermediaries such as banks.\n\nDeFi is more dominant on the Ethereum (ETH) network, a leading smart contract platform and the second-largest blockchain by market capitalization. Ethereum has benefited from a first-mover advantage in this field, being the first public network to support decentralized apps (dApps) since 2015.\n\nHowever, it is increasingly facing stiff competition from newer blockchains, including Solana (SOL), Avalanche (AVAX), Cardano (ADA), and Polkadot (DOT). Often overlooked in this conversation is Bitcoin, the flagship blockchain network designed to enable peer-to-peer online transactions.\n\nRecently, however, developers on the Bitcoin network have found ways to expand its capabilities beyond payments, and it is now possible to launch DeFi applications native to the Bitcoin ecosystem.\n\nWhat is DeFi on Bitcoin?\n\nDeFi on Bitcoin is a feature that was introduced in November 2021 thanks to the successful implementation of the Taproot upgrade, which enabled greater functionality with regard to complex scripting. With Taproot, Bitcoin coud now support decentralized apps, making it a viable alternative to Ethereum for developers looking to launch dApps.\n\nBefore the launch of DeFi apps on the Bitcoin network, BTC holders were able to convert their holdings into wrapped versions on other blockchains. The most popular was the Wrapped BTC (wBTC) asset on the Ethereum network (ERC-20 token).\n\nwBTC enabled BTC holders to participate in Ethereum-based DeFi protocols by locking their assets in a smart contract and receiving an equal amount (i.e., 1:1 ratio) in the derivative asset, which could then be used to save, lend, and earn passive income through yield farming on these platforms.\n\nHowever, since the launch of the DeFi on Bitcoin, conversions to other assets become unnecessary, and BTC coins can be used natively on these Bitcoin-based DeFi platforms.\n\nHow DeFi on Bitcoin works\n\nThe most popular way DeFi works with Bitcoin is to use a wrapped version of BTC on a non-Bitcoin blockchain. With wBTC, an investor will send BTC coins to a custodian who stores these tokens and issues wBTC in return at the same ratio.\n\nFor instance, if you send 1 BTC, you receive 1 wBTC in return. The wrapped tokens can be used on Ethereum-based DeFi protocols such as Curve (CRV), Balancer (BAL), or AAVE (AAVE).\n\nTo redeem your BTC, you send back your wBTC tokens, and the custodian (smart contract) will refund your coins to you.\n\nWith the Bitcoin Taproot upgrade launch, DeFi is now possible on Bitcoin but with a caveat. The native Bitcoin blockchain, which still uses the limited Script programming language, does not support smart contracts. Taproot helped introduce the advanced capabilities which can only be realized on layer-2 scaling solutions and sidechains.\n\nThe side chains and layer-2 protocols host dApps in various markets, including DeFi, non-fungible tokens, and gamefi ecosystems, among others.\n\nWhy do we need DeFi on Bitcoin?\n\nSo far, the flagship cryptocurrency is used mainly as a store of value and, to some extent, as a payment method. By accommodating DeFi, Bitcoin increases its utility while becoming attractive to a wider audience of users.\n\nDecentralized finance, on the other hand, needs the security and assurance that Bitcoin enjoys and that most DeFi investors and users value. Every so often, a DeFi protocol loses user funds to hackers leading to a loss of trust.\n\nDeFi on Bitcoin solves these issues and increases the trustworthiness of various solutions, thereby making them more attractive to potential developers and investors.\n\nChallenges facing DeFi on Bitcoin\n\nDeFi on Bitcoin faces three main challenges, which are:\n\nScalability; Compatibility; Security.\n\nThese challenges might not be unique to Bitcoin, but here is how they affect it.\n\nScalability\n\nBlockchain scalability measures how many transactions a decentralized network can process in a specified period, typically one second. The higher the transaction count, the higher the throughput, and vice versa.\n\nBitcoin is one of the slowest blockchains currently in the market, as it’s able to process about seven transactions every second (7 TPS). In comparison, Ethereum can handle about 12-15 TPS, while Cardano and Polkadot can manage as many as 1,000 TPS.\n\nNote The TPS figures referred to above are used to show a network’s capacity. It does not necessarily mean that these networks have achieved these figures in actual daily usage (if ever). The figures are often based on test results to show the capability of a given protocol.\n\nScalability is a major consideration for developers looking for a host network for their DeFi platform, and Bitcoin’s figures do not stack up well against the competition.\n\nComposability\n\nComposability is a system design principle that defines the inter-relations between various modular components. A highly composable system means that its various components can be assembled in multiple combinations to form several different creations.\n\nIn its current implementation, Bitcoin is not very composable due to its use of a limited scripting language. This contrasts with its rivals, such as Ethereum, which are designed from the ground up to be composable.\n\nAs a result, DeFi developers have the propensity to lean toward Bitcoin’s rivals as their protocols of choice to launch their apps. It is much easier to develop on these protocols because they have access to a wide range of assets that are easily compatible, free to use, and comply with various internal coding standards.\n\nSecurity\n\nBitcoin is, arguably, the most secure blockchain in the market currently, and it has stood the test of time. However, it is worth considering how secure the sidechains and layer-2 chains are, given that they are so few with little history if any.\n\nEven though these second-layer blockchains rely on Bitcoin’s proven security infrastructure, they still pose a security risk similar to that other dApps, and dApp platforms face on Bitcoin’s rival networks. Smart contract vulnerability is a major risk that every investor and developer has to consider before interacting with one.\n\nMost of the DeFi platforms and apps on the Bitcoin network are relatively recent, meaning that they are yet to be thoroughly tested, iterated, and improved upon to ensure the security of assets under management.\n\n3 Innovative Bitcoin DeFi Solutions\n\nHere are three notable companies building DeFi on Bitcoin solutions for the masses:\n\nMintlayer; Stacks; Rootstock.\n\nLet’s consider each project in further detail.\n\n1. Mintlayer: Making DeFi with Bitcoin a Reality\n\nMintlayer is a Bitcoin layer-2 scalability solution with support for smart contracts, including DeFi, NFT, decentralized exchanges (DEXs), and more. Think of it as an Ethereum rival with Bitcoin’s security.\n\nMintlayer homepage\n\nCreated in 2019, Mintlayer is designed to offer a sustainable infrastructure to support DeFi development and deployment on both the Bitcoin and Lightning Networks. The latter is a layer-2 payment protocol looking to support micro-payments on the flagship blockchain.\n\nSimilar to Ethereum, Mintlayer is a platform on which developers can launch their dApps, thereby unlocking and extending Bitcoin’s full potential. This way, it solves all three challenges facing DeFi on Bitcoin.\n\nMintlayer seeks to empower blockchain developers through four key programs, which are:\n\nEcosystem fund – enabling project creators to access funding from VCs to create solutions within the Bitcoin ecosystem;\n\n– enabling project creators to access funding from VCs to create solutions within the Bitcoin ecosystem; Incubator program – designed to nurture early-stage teams and projects to increase their chances of achieving success;\n\n– designed to nurture early-stage teams and projects to increase their chances of achieving success; Accelerator program – targeting already established projects seeking to reach higher levels in terms of adoption by porting over from other platforms such as Ethereum to Mintlayer;\n\n– targeting already established projects seeking to reach higher levels in terms of adoption by porting over from other platforms such as Ethereum to Mintlayer; Grants – designed to offer compensation to open-source developers to create or incentivize the creation of Mintlayer solutions.\n\nMintlayer is not only looking to extend Bitcoin’s functionality, it is also paving the way for other developers to create and launch innovative solutions to enhance its utility further.\n\n2. Stacks.co\n\nStacks.co is an independent, smart contract blockchain linked to Bitcoin through a novel consensus mechanism dubbed Proof of Transfer (PoX). The PoX mechanism enables it to settle its transactions to the more secure Bitcoin blockchain. It is, therefore, not a layer-2 blockchain.\n\nStacks blockchain website\n\nAs a smart contract platform, Stacks offers the following features:\n\nBitcoin NFTs and their marketplaces with support for micropayments through the Lightning network;\n\nBlockchain naming system similar to Ethereum’s ENS;\n\nCommunity support through the accelerator and grant programs;\n\nA native token, STX, can be staked for passive income and fee payment.\n\nStacks is extending Bitcoin’s capabilities, but so far, to a lesser and limited extent compared to Mintlayer.\n\n3. RSK – Rootstock\n\nRootstock (RSK) is another independent Bitcoin sidechain with smart contract capability similar to Mintlayer and Stacks. It was created in 2017 to enhance Bitcoin’s feature set by enabling dApp support.\n\nRootstock homepage\n\nA unique feature of RSK is that it uses the same Proof of Work (PoW) consensus mechanism as Bitcoin with the same algorithm enabling community members to engage in merged mining.\n\nIn this kind of mining, one computer can be used to validate transactions in two different blockchains concurrently. As a result, RSK is theoretically as secure as Bitcoin since it shares the same hash rate.\n\nFeatures offered by the RSK blockchain include:\n\nCompatibility with Ethereum dApps;\n\nProvides a native token dubbed RBTC for fee payment, staking, and value transfer;\n\nFaster block generation times of sub-thirty seconds compared to Bitcoin’s ten minutes.\n\nSupport for DeFi dApps enabling users to borrow, lend, trade, and do more with their assets.\n\nFinal thoughts\n\nThere is a growing demand for DeFi on Bitcoin as more people appreciate the need for secure cryptocurrency investments over potential high yields. Bitcoin is not only the most secure open network but also one of the most well-known and trusted. As a result, it is becoming more attractive to DeFi developers and investors looking.\n\nInnovative projects such as Mintlayer, Stacks, and Rootstock provide further incentives for the right people to join and help create the next DeFi ecosystem. Not only that, but they are also helping extend the Bitcoin capability beyond its initial payments and store of value utility.\n\nHowever, as the Bitcoin DeFi space grows, whether it will be popular enough to displace Ethereum as the go-to dApp deployment platform remains to be seen.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing in crypto, your capital is at risk.\n\nFrequently Asked Questions about DeFi on Bitcoin\n\nWhat is DeFi on Bitcoin? DeFi is an umbrella term that refers to various financial tools and products available on decentralized networks (in this case, Bitcoin), enabling people to stake, borrow, lend, and earn passive income.\n\nWhat are some of the challenges facing Bitcoin DeFi? The three main challenges that DeFi on Bitcoin faces are scalability, composability, and security.\n\nWhy do we need DeFi on Bitcoin? Bitcoin and DeFi need each other. Bitcoin needs DeFi to attract more users and therefore gain further adoption. On the other hand, DeFi needs a more secure alternative to the current crop of smart contract platforms, thereby eliciting trust and attracting more investors."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYm9sZC5jb20vZGVlcC1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1iaXRjb2luLXByaWNlLWZvci1tYXJjaC0zMS0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Deep learning algorithm sets Bitcoin price for March 31, 2023 - Finbold - Finance in Bold",
        "content": "Despite recording significant growth since the year’s turn, Bitcoin (BTC) still had a challenging few weeks recently, and cryptocurrency traders and investors are looking for indicators of its further movements, including those provided by machine learning platforms.\n\nIn this context, the deep learning algorithms over at the cryptocurrency monitoring platform PricePredictions have set the price of Bitcoin at $23,597 by the end of March, according to the data accessed by Finbold on February 28.\n\nBitcoin 30-day forecast. Source: PricePredictions\n\nAs it happens, the algorithms rely on technical analysis (TA) indicators, including relative strength index (RSI), moving averages (MA), moving average convergence divergence (MACD), Bollinger Bands (BB), average true range (ATR), accumulation/distribution line (A/D), and on-balance volume (OBV).\n\nProvided that the projections made by the algorithms deploying these indicators prove correct, it would mean the flagship decentralized finance (DeFi) asset on March 31 would be changing hands 0.79% higher than its current price, which at press time stood at $23,413.\n\nMeanwhile, the sentiment on the 1-day gauges at the finance and crypto tracking website TradingView is generally bullish and suggests ‘buy’ at 12, as summarized from the oscillators indicating ‘neutral’ at 8 and moving averages in the ‘strong buy’ range at 11.\n\nBitcoin 1-day sentiment gauges. Source: TradingView\n\nBitcoin price analysis\n\nAs things stand, the current price of Bitcoin represents a decline of 1.33% on the day and a more significant 5.54% loss across the previous week but is nonetheless 1.7% higher than 30 days before, as indicated on the latest charts retrieved on February 28.\n\nBitcoin 30-day price chart. Source: Finbold\n\nWhether the maiden digital asset manages to reach the price predicted by the deep learning algorithms will depend on the developments surrounding it, such as rare indicators flashing green and Bored Ape creators Yuga Labs announcing their next non-fungible tokens (NFTs) on the Bitcoin blockchain.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvYnV5LWJpdGNvaW4td2l0aC1maXJzdC1hYnUtZGhhYmkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "How to Buy Bitcoin and Crypto with First Abu Dhabi Bank [2024] - Finbold - Finance in Bold",
        "content": "Summary: First Abu Dhabi Bank (FAB) does not offer its customers the choice to purchase cryptocurrencies on its platform. Instead, UAE crypto investors can link their banking accounts to their chosen broker or a crypto exchange to buy digital assets such as Bitcoin (BTC) and Ethereum (ETH) by depositing Dirham from their FAB bank account.\n\nTo buy crypto with FAB, we suggest using a multi-asset investment platform, eToro. After trialing more than ten crypto trading platforms, we found it to be the best option, as it offers low trading fees and a wide selection of assets trusted by over 30 million users.\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nCan you buy crypto with First Abu Dhabi Bank?\n\nYou can buy crypto with First Abu Dhabi Bank, but you need to connect to a licensed cryptocurrency exchange. As mentioned above, this is because First Abu Dhabi does not offer cryptocurrency services directly through its online banking platform.\n\nHow to buy crypto with First Abu Dhabi Bank?\n\nThe best way to buy Bitcoin or any other cryptocurrency with FAB is through a broker like eToro, which is a widely trusted multi-asset investing platform with over 70 cryptocurrencies and unique features such as “Copy Trading” (enables users to imitate top-performing crypto traders), a staking service, custom watchlist, as well as advanced charts and technical analysis tools.\n\nHow to buy crypto with First Abu Dhabi Bank: Step-by-Step\n\nYou can get started in minutes with four simple steps:\n\nStep 1: Create an account on eToro and complete your verification (personal or company);\n\nCreate an account on and complete your verification (personal or company); Step 2: Enter the AED amount you want to deposit on the eToro platform;\n\nEnter the AED amount you want to deposit on the eToro platform; Step 3: Connect your FAB online account to deposit your selected fiat currency;\n\nConnect your FAB online account to deposit your selected fiat currency; Step 4: The final step is to find the cryptocurrency you want to purchase and execute your trade.\n\nDisclaimer: Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment and you should not expect to be protected if something goes wrong. Take 2 mins to learn more.\n\nCrypto on eToro. Source: etoro.com\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nAbout First Abu Dhabi Bank\n\nFirst Abu Dhabi Bank (FAB) is the largest bank in the United Arab Emirates, headquartered in Abu Dhabi. The bank was established in 2017 through a merger between First Gulf Bank (FGB) and the National Bank of Abu Dhabi (NBAD) and offers a comprehensive selection of banking services, including personal, corporate, commercial, and investment banking.\n\nFAB’s homepage. Source: Bankfab.com\n\nFirst Abu Dhabi Bank crypto policy\n\nFirst Abu Dhabi is a crypto-friendly bank with no policies prohibiting its users from buying and selling Bitcoin or any other cryptocurrency through licensed trading platforms. Therefore, First Abu Dhabi crypto users can use their banking accounts to link and transfer funds to a licensed crypto exchange to buy digital assets.\n\nImportant Please note that the cryptocurrency exchanges in the UAE must acquire a license from the Abu Dhabi Global Markets (ADGM) to operate legally, so check this before choosing your preferred broker. We recommend using the online investment platform eToro as it is a globally licensed exchange that offers over 3,000 assets in 120 countries.\n\nAs for First Abu Dhabi’s stance in the crypto space, the bank announced in February 2023 plans to introduce digital asset offerings to its clients. Moreover, FAB plans to implement Web3 technologies in their services, with Srinivasan Sampath, chief technology officer at the bank, stating:\n\n“We’re getting ready to leverage Web3 along with digital assets. We’re at an advanced stage in terms of getting the approvals to initiate it. Initially, we’ll probably allow customers to use crypto to pay [for] or use some of our services.”\n\nHow to buy crypto safely\n\nWhile crypto can be a lucrative investment with astronomically high returns, its volatile nature makes it considerably riskier than stocks. In fact, many people have been scared away from investing in any digital assets because of the high amount of scams and cybercrime that target inexperienced and seasoned investors alike.\n\nThankfully though, licensed crypto brokers in the UAE are required to comply with the UAE anti-money laundering, anti-terrorism financing, cybersecurity, and data protection laws, as well as develop technology platforms that provide real-time information on ownership and trading.\n\nTips for starting out with crypto\n\nTo make sure you’re being careful when starting out with digital assets, apply these best practice guidelines to your investing strategy:\n\nResearch the cryptocurrency you want to buy: Make sure you understand how it works and what the risks are;\n\nMake sure you understand how it works and what the risks are; Only use a safe device: Avoid public computers and Wi-Fi networks. Always use your personal computer with a VPN, which helps establish a secure connection between you and the web, keeping your sensitive information safe;\n\nAvoid public computers and Wi-Fi networks. Always use your personal computer with a VPN, which helps establish a secure connection between you and the web, keeping your sensitive information safe; Choose a reputable exchange: Ensure the exchange has a license from an appropriate regulator in your country and has a solid track record. Study the exchange’s user terms and agreements carefully to learn more about where they’ll keep your money and what happens to it if the business goes bankrupt. You may also want to scour through user reviews to catch any red flags;\n\nEnsure the exchange has a license from an appropriate regulator in your country and has a solid track record. Study the exchange’s user terms and agreements carefully to learn more about where they’ll keep your money and what happens to it if the business goes bankrupt. You may also want to scour through user reviews to catch any red flags; Secure your account: Use two-factor authentication and a strong password to protect your account;\n\nUse two-factor authentication and a strong password to protect your account; Use a secure wallet: Store your cryptocurrency in a secure wallet to protect it from hackers. You can opt for either a hot (online) or cold (offline) wallet. To choose the right one for you, make sure to check out our in-depth guide on crypto wallets;\n\nStore your cryptocurrency in a secure wallet to protect it from hackers. You can opt for either a hot (online) or cold (offline) wallet. To choose the right one for you, make sure to check out our in-depth guide on crypto wallets; Don’t invest money you can’t afford to lose: Because the crypto market can be so volatile, you need to be conservative with your investments, particularly when starting out. For more investing tips, have a look at our guide on investing mistakes to avoid;\n\nBecause the crypto market can be so volatile, you need to be conservative with your investments, particularly when starting out. For more investing tips, have a look at our guide on investing mistakes to avoid; Monitor your investments: Keep an eye on the market and be aware of any changes in the price of the cryptocurrency you’re investing in.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk.\n\nFAQs about how to buy crypto with First Abu Dhabi Bank:\n\nIs it legal to trade crypto in the UAE? There are no prohibitions against the trading of crypto assets in the UAE. However, cryptocurrency exchanges must acquire a license from the Abu Dhabi Global Markets (ADGM) to operate legally.\n\nIs Bitcoin legal in UAE? Yes, Bitcoin is legal in the UAE. There are no prohibitions against trading crypto assets, with the government taking a supportive approach. However, cryptocurrency exchanges must acquire a license from the Abu Dhabi Global Markets (ADGM) to operate legally.\n\nHow to buy crypto with First Abu Dhabi Bank? You can buy crypto with First Abu Dhabi Bank by depositing United Arab Emirates Dirham (AED) to a licensed third-party trading platform that offers cryptocurrencies.\n\nCan you buy crypto with First Abu Dhabi Bank? You can buy crypto with First Abu Dhabi Bank, but it doesn’t offer crypto trading directly through its own platform. Instead, customers can connect their FAB accounts to a regulated cryptocurrency exchange to buy digital assets.\n\nWhat is First Abu Dhabi Bank's crypto policy? First Abu Dhabi Bank has no policies prohibiting its users from buying and selling cryptocurrencies through licensed crypto exchanges.\n\nWhat crypto exchanges does First Abu Dhabi Bank allow? Customers can deposit funds from their First Abu Dhabi accounts to brokers like eToro."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvYnV5LWJpdGNvaW4td2l0aC1lbWlyYXRlcy1pc2xhbWljLWJhbmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "How to Buy Bitcoin and Crypto With Emirates Islamic Bank [2024] - Finbold - Finance in Bold",
        "content": "Summary: Emirates Islamic Bank doesn’t offer investors the chance to buy cryptocurrencies on its own platform. However, its customers can use their bank accounts to connect to a crypto broker to purchase digital assets like Bitcoin (BTC) and Ethereum (ETH).\n\nIn short, to buy Bitcoin and other cryptos with Emirates Islamic, investors in the United Arab Emirates will need to sign up with a crypto-friendly exchange and deposit United Arab Emirates Dirham (AED) from their bank account. For this, we recommend going through a multi-asset investment platform, eToro. After testing over ten other trading platforms, we concluded it to be the top choice for Emirates Islamic Bank customers, as eToro offers low trading fees and has a wide selection of cryptocurrencies.\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nCan you buy crypto with Emirates Islamic Bank?\n\nYou can buy crypto with Emirates Islamic Bank, but you need to connect to a licensed cryptocurrency exchange. As mentioned above, this is because Emirates Islamic does not offer cryptocurrency services directly through its online banking platform.\n\nHow to buy crypto with Emirates Islamic Bank?\n\nThe best way to buy Bitcoin (BTC) or any other cryptocurrency with Emirates Islamic Bank is through a broker like eToro, which is a widely trusted multi-asset investing platform with over 70 cryptocurrencies and unique features such as Copy Trading (enables users to imitate top-performing crypto traders), a staking service, custom watchlist, as well as advanced charts and technical analysis tools.\n\nHow to buy crypto with Emirates Islamic Bank online banking: Step-by-Step\n\nYou can get started in minutes with four simple steps:\n\nStep 1: Create an account on eToro and complete your verification (personal or company);\n\nCreate an account on and complete your verification (personal or company); Step 2: Enter the AED amount you want to deposit on the eToro platform;\n\nEnter the AED amount you want to deposit on the eToro platform; Step 3: Connect your Emirates Islamic online account to deposit your selected fiat currency;\n\nConnect your Emirates Islamic online account to deposit your selected fiat currency; Step 4: The final step is to find the cryptocurrency you want to purchase and execute your trade.\n\nDisclaimer: Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment and you should not expect to be protected if something goes wrong. Take 2 mins to learn more.\n\nCrypto on eToro. Source: etoro.com\n\n\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nAbout Emirates Islamic Bank\n\nEmirates Islamic is an Islamic bank headquartered in Dubai, United Arab Emirates. Founded in 2004, it delivers banking services in line with Sharia principles.\n\nEmirates Islamic Bank’s homepage. Source: emiratesislamic.ae/eng\n\n\n\nServices offered by Emirates Islamic include:\n\nPersonal banking: Checking and savings accounts, credit cards, loans;\n\nChecking and savings accounts, credit cards, loans; Business banking: Business banking accounts and cards.\n\nEmirates Islamic Bank crypto policy\n\nEmirates Islamic has no policies prohibiting its users from buying and selling cryptocurrencies through licensed and regulated trading platforms.\n\nTo conclude, the bank hasn’t launched any official policies or press releases about its rules on transferring funds to crypto exchanges or online brokers. Therefore, Emirates Islamic Bank crypto users are free to use their bank accounts to link to investing platforms that offer digital currencies, like eToro. Check the Emirates Islamic Bank website for any up-to-date fees for using your Emirates Islamic banking account to buy crypto.\n\nHow to buy crypto safely\n\nAs a relatively new asset class, cryptocurrencies remain affected by extreme price volatility, making them much riskier than traditional financial instruments such as stocks or bonds. In addition, fraud and cybercrime in the crypto sphere are particularly rampant, putting both seasoned and inexperienced investors at risk.\n\nTips for starting out with crypto\n\nFortunately, there are steps you can take to ensure you’re being careful when buying crypto. Let’s look at a few tips on what you should do when getting started with digital assets and how to best protect yourself and your money:\n\nResearch the cryptocurrency you want to buy: Make sure you understand how it works and what the risks are;\n\nMake sure you understand how it works and what the risks are; Only use a safe device: Avoid public computers and Wi-Fi networks. Always use your personal computer with a VPN, which helps establish a secure connection between you and the web, keeping your sensitive information safe;\n\nAvoid public computers and Wi-Fi networks. Always use your personal computer with a VPN, which helps establish a secure connection between you and the web, keeping your sensitive information safe; Choose a reputable exchange: Ensure the exchange has a license from an appropriate regulator in your country and has a solid track record. Study the exchange’s user terms and agreements carefully to learn more about where your money is kept and what happens to your funds if the business goes bankrupt. You may also want to scour through user reviews to catch any red flags;\n\nEnsure the exchange has a license from an appropriate regulator in your country and has a solid track record. Study the exchange’s user terms and agreements carefully to learn more about where your money is kept and what happens to your funds if the business goes bankrupt. You may also want to scour through user reviews to catch any red flags; Secure your account: Use two-factor authentication and a strong password to protect your account;\n\nUse two-factor authentication and a strong password to protect your account; Use a secure wallet: Store your cryptocurrency in a secure wallet to protect it from hackers. You can opt for either a hot (online) or cold (offline) wallet. To choose the right one for you, make sure to check out our in-depth guide on crypto wallets;\n\nStore your cryptocurrency in a secure wallet to protect it from hackers. You can opt for either a hot (online) or cold (offline) wallet. To choose the right one for you, make sure to check out our in-depth guide on crypto wallets; Don’t invest money you can’t afford to lose: Because the crypto market can be so volatile, you need to be conservative with your investments, particularly when starting out. For more investing tips, take a look at our guide on investing mistakes to avoid;\n\nBecause the crypto market can be so volatile, you need to be conservative with your investments, particularly when starting out. For more investing tips, take a look at our guide on investing mistakes to avoid; Monitor your investments: Keep an eye on the market and be aware of any changes in the price of the cryptocurrency you’re investing in.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk.\n\nFAQs about how to buy crypto with Emirates Islamic Bank:\n\nIs it legal to trade crypto in the UAE? There are no prohibitions against the trading of crypto assets in the UAE. However, cryptocurrency exchanges must acquire a license from the Abu Dhabi Global Markets (ADGM) to operate legally.\n\nHow to buy crypto with Emirates Islamic Bank? You can buy crypto with Emirates Islamic Bank by depositing AED to a licensed third-party trading platform that offers cryptocurrencies.\n\nCan you buy crypto with Emirates Islamic Bank? While Emirates Islamic Bank doesn’t offer crypto trading directly through its own platform, customers can connect their Emirates Islamic accounts to a regulated cryptocurrency exchange to buy digital assets.\n\nCan you buy Bitcoin with Emirates Islamic Bank? Yes, Emirates Islamic Bank crypto users can use their banking accounts to buy Bitcoin by connecting to a regulated cryptocurrency exchange. However, Emirates Islamic Bank doesn’t offer crypto trading directly through its platform.\n\nWhat is Emirates Islamic Bank's crypto policy? Emirates Islamic Bank has no policies prohibiting its users from buying and selling cryptocurrencies through licensed crypto exchanges.\n\nWhat crypto exchanges does Emirates Islamic Bank allow? Customers can deposit funds from their Emirates Islamic accounts to crypto brokers like eToro."
    }
]