[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vYWJjbmV3cy5nby5jb20vQnVzaW5lc3MvYml0Y29pbi1jbGltYmVkLTY1LXllYXItZGVzcGl0ZS1jcnlwdG8td29lcy1leHBlcnRzL3N0b3J5P2lkPTk5MjUyOTIy0gFpaHR0cHM6Ly9hYmNuZXdzLmdvLmNvbS9hbXAvQnVzaW5lc3MvYml0Y29pbi1jbGltYmVkLTY1LXllYXItZGVzcGl0ZS1jcnlwdG8td29lcy1leHBlcnRzL3N0b3J5P2lkPTk5MjUyOTIy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin has climbed 65% this year despite crypto woes. Experts explain why. - ABC News",
        "content": "The digital currency benefited from a shift to well-known coins, experts said.\n\nBitcoin has climbed 65% this year despite crypto woes. Experts explain why.\n\nThe cryptocurrency industry, in recent months, has suffered some blows: high-profile bankruptcies, the arrest of wunderkind Sam Bankman-Fried and a regulator lawsuit against top crypto exchange Binance.\n\nDespite it all, the price of the largest cryptocurrency, bitcoin, has surged.\n\nBitcoin has climbed 65% this year, far surpassing the S &P 500, which has jumped 7%. Even the Nasdaq, a tech-heavy index, has delivered just a quarter of bitcoin's gains.\n\nIn fact, bitcoin has benefited from crises in the cryptocurrency arena, analysts said, since the unrest has pushed investors away from lesser-known coins and toward the sector's household name.\n\nPlus, the price has gained a boost from wider economic forces like trouble in the financial system and slowing interest rate hikes, they said.\n\nBut the coming months pose uncertainty, experts added, as a looming recession could test the performance of an asset less than 15 years old.\n\nThe blockbuster performance of bitcoin in 2023 comes after the digital currency's price plummeted last year. In all, the price of bitcoin fell 65% last year, exceeding the losses suffered by the S &P 500, which dropped about 20%.\n\nThe price struggles for bitcoin, which extended throughout much of the cryptocurrency sector, coincided with an aggressive series of interest rate hikes that put downward pressure on many assets, including the major stock indexes.\n\n\"There had been a big bubble,\" James Butterfill, head of research at digital asset management firm CoinShares, told ABC News. \"The bubble was pricked by the Fed.\"\n\nThe distress in cryptocurrency helped trigger a slew of failures. Last May, a major coin, Terra, collapsed along with its sister coin Luna. Meanwhile, several crypto lenders such as Block Fi, Celsius and Genesis filed for bankruptcy last year.\n\nIn dramatic fashion, crypto exchange FTX filed for bankruptcy in November after a collapse in a matter of days that was followed by the arrest of Bankman-Fried, the company's founder and former CEO. Bankman-Fried has pleaded not guilty to all 13 counts he faces, including fraud and conspiracy.\n\nThe unrest last year sent crypto investors toward well-known digital currencies, Callie Cox, an analyst at the investment company eToro who tracks cryptocurrencies, told ABC News.\n\n\"Bitcoin has been the beneficiary of a flight to quality within the crypto industry,\" Cox said. \"This is the crypto name that my mom and your family probably know.\"\n\nButterfill, of CoinShares, echoed the point: \"People are becoming a lot more discerning. There are 50,000 crypto coins out there and a lot of them are rubbish.\"\n\nFTX founder Sam Bankman-Fried leaves Manhattan federal court in New York, Feb. 16, 2023. John Minchillo/AP, FILE\n\nEthereum, the world's second-largest cryptocurrency, has surged 52% this year, benefiting as well from the rush toward prominent coins, Butterfill said.\n\nThe rise in the price of bitcoin has coincided with favorable developments across the wider economy, since the Federal Reserve has slowed its interest rate hikes and unrest in the traditional banking sector has pushed some investors to seek a digital alternative, experts said.\n\nSince March, three of the nation's 30-largest banks have collapsed. Shares of regional lender PacWest Bancorp plummeted on Thursday after the bank said it lost 9% of deposits last week, suggesting that financial instability persists.\n\n\"When the banking system faced threats, a lot of investors saw reason to doubt the financial system,\" said Cox, of eToro. \"They went looking for alternatives.\"\n\nThere is little data available that depositors pulled money out of banks and placed it in bitcoin, Butterfill noted, adding that he had heard anecdotes of bank customers transferring funds to crypto.\n\nIf the Fed halts its rate hikes, as many investors expect, bitcoin could continue its rise over the latter part of the year, experts said. However, they cautioned that a potential recession could bring volatility.\n\n\"There might be nervousness about bitcoin as we move closer to a recession,\" Cox said, pointing out that interest rates would remain elevated even after a pause. \"There are a lot of crosswinds for crypto right now.\"\n\nButterfill acknowledged uncertainty about the outlook of day-to-day performance for bitcoin, but remained optimistic about the remainder of 2023, even if it involves a recession.\n\n\"Economic data continues to deteriorate,\" Butterfill said. \"In that environment, bitcoin would be volatile and perform quite well.\""
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvYW1vbmctYml0Y29pbi1kZXZlbG9wZXJzLWRlYmF0ZS1pcy1yYWdpbmctb3Zlci13aGV0aGVyLXRvLWNlbnNvci1vcmRpbmFscy1icmMtMjBzL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvYW1vbmctYml0Y29pbi1kZXZlbG9wZXJzLWRlYmF0ZS1pcy1yYWdpbmctb3Zlci13aGV0aGVyLXRvLWNlbnNvci1vcmRpbmFscy1icmMtMjBzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Among Bitcoin Developers, Debate Is Raging Over Whether to Censor Ordinals BRC-20s - CoinDesk",
        "content": "The soaring fees have forced some bitcoin users in Africa to seek alternative payment options including stablecoins, while crypto exchange Binance said it’s in the process of integrating the “layer 2” scaling solution for Bitcoin known as Lightning Network. It’s been a windfall for Bitcoin miners but has presented an existential conflict for purists of a blockchain designed to be a peer-to-peer payments network but also free from censorship."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWzSAYMBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin briefly falls below $26,000, posts worst week since November - CNBC",
        "content": "In this article BTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nBitcoin. Nurphoto | Getty Images\n\nBitcoin traded at its lowest level since mid-March on Friday as volatility, driven by low liquidity, continued to hit cryptocurrency markets. Bitcoin ended the day lower by 2.58% at 26,181.46 after briefly hitting a low of 25,833.34 the lowest level since March 17, according to Coin Metrics. The biggest crypto asset by market cap posted a weekly loss of 11.25%, making it its worst week since Nov. 11. There are a number of issues facing crypto markets right now including low liquidity, a crackdown on the industry from regulators in the U.S. and macroeconomic worries.\n\nLiquidity issues\n\nBitcoin is up around 59% this year but prices have remained volatile, with low liquidity exacerbating moves higher and lower. Clara Medalie, director of research at Kaiko, said there has been a \"notable drop in market depth\" for bitcoin. Market depth refers to a market's ability to absorb relatively large buy and sell orders. When market depth is low, then relatively small orders can cause the price of an asset to move up or down in a substantial way. And the liquidity situation could be set to get worse after Bloomberg reported that Jane Street and Jump Crypto, two of the biggest crypto market makers, will take a step back from crypto trading in the U.S. as the country's regulators continue their crackdown on the nascent industry.\n\n\"While it is yet unclear the catalyst for today's sharp drop, the volatility is to be expected given the current state of liquidity, especially after larger market maker Jane Street and Jump Crypto revealed they were winding down their crypto exposure,\" Medalie said. Liquidity has been a big issue for crypto markets since the closure of Silvergate and Signature Bank — two key platforms that people used to buy into the crypto market.\n\nRegulatory scrutiny, congestion issues\n\nScrutiny from U.S. regulators on the digital currency industry has ramped up since the collapse of crypto exchange FTX last year. The U.S. Securities and Exchange Commission warned American crypto exchange Coinbase in March over potential securities law violations. Coinbase CEO Brian Armstrong said the company is preparing for a years-long court battle with the SEC. Meanwhile, the Commodity Futures and Trading Commission alleged in March that crypto exchange Binance violated trading rules.\n\nwatch now"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA1LzEzL2dyaW1lcy1hbmQtYml0Y29pbi1ob3ctY3J5cHRvLWFuZC10aGUtb3Blbi1zb3VyY2UtbW92ZW1lbnQtb2ZmZXItbGVzc29ucy1mb3ItdGhlLW11c2ljLWluZHVzdHJ5LWluLXRoZS1hZ2Utb2YtYS1pL9IBnAFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA1LzEzL2dyaW1lcy1hbmQtYml0Y29pbi1ob3ctY3J5cHRvLWFuZC10aGUtb3Blbi1zb3VyY2UtbW92ZW1lbnQtb2ZmZXItbGVzc29ucy1mb3ItdGhlLW11c2ljLWluZHVzdHJ5LWluLXRoZS1hZ2Utb2YtYS1pL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "Grimes and Bitcoin: How crypto and the open-source movement offer lessons for the music industry in the age of A.I. - Fortune",
        "content": "An A.I.-generated song featuring a “collaboration” between Drake and The Weeknd turned up on streaming services and TikTok last month, quickly racking up millions of listens. In response, Universal Music Group, which represents the musicians, issued an agitated statement, and then, as the song turned up on other platforms, embarked on a legal whack-a-mole campaign in a bid to put the A.I. cat back in a bag.\n\nAll of this came even as the legal status of the song remains unclear. Some music business veterans argue the song was functionally no different than a remix, while others decried it as a dangerous new paradigm. Rarely does a video made by a random handle create such uproar.\n\nThen there’s Grimes, who may not be as famous as fellow Canadian Drake, but is a critically acclaimed musician in her own right. Grimes, who is not affiliated with any record label, announced she will use that relative freedom to perform a radical experiment called “Elf.Tech.” Using A.I., Elf.Tech allows users to generate a Grimes-style work with their own inputs. In return, all Grimes asks is for tasteful use of their now-open-source talent and a 50% cut on any master recording royalties.\n\nBecause the cost of producing high-quality music has dropped precipitously with advancements in A.I., the race to design a new distribution model is afoot. Currently, platforms must obtain permissions from both publishers and labels to play a song—in most instances, the label owns the sound recording while the publisher controls the underlying music and lyrics. In Grimes’s case, she could be the performer and also own the sound recording.\n\nTellingly, the first prompt on Elf.Tech asks users to connect to an email account or a cryptocurrency wallet. Presumably, the platform anticipates using blockchain and crypto to help enforce the suggested royalty split.\n\nUnfortunately, as veterans of the NFT space know, while smart contracts have the potential to create a more efficient royalties system, the reality is that the process remains messy since NFT marketplaces circumvent the rules. Nonetheless, many maintain hope a cultural or technical innovation—likely tied to crypto—will emerge to help artists enjoy a fairer compensation system.\n\nThough technology doesn’t exist to enforce it yet, my long-term bet is that Grimes’s approach will prevail over Universal’s. The reason is that the challenges of generative A.I. have striking parallels to those of another disruptive technology: open-source software.\n\nAll software began as “open source.” Software vendors would provide their clients with their source code, the human-readable version of the software that’s then transformed into machine code before it’s executed. Tinkerers and computer scientists would modify software, learn from it, and share ideas. As the field commercialized, source code became closely protected, like a trade secret. While companies made handsome profits exerting copyright over their code, allowing for additional investments, the downside was a less cooperative environment.\n\nThe open-source movement, a reaction to ever-tighter controls over software, promoted the release of source code under permissive licenses to foster the tinkering, sharing of ideas, and collaboration seen in the field’s early days. Today, open-source projects range from small hobbyist efforts to large-scale projects such as the Linux kernel, which is deployed in billions of devices around the world.\n\nIn similar fashion, traditional music publishers and labels thrived in a world where counterparties and IP were tightly controlled. Their moat was legal agreements that could hamstring pirates and, in some unfortunate cases, the artists themselves. As experimentation from pseudonymous creators—including those who deploy A.I.—shifts the balance of power from this model, artists will have to find new ways to engage with the increasing commoditization of their work.\n\nBitcoin, the first successful cryptocurrency, succeeded in large part because it was open-sourced. Alternatives to centralized institutions that issue credit require a radically transparent, queryable code base to stand apart. Early enthusiasts trusted the outcome of the Bitcoin ledger because they trusted the process, and because they could check it themselves. Today’s music pioneers would be smart to take note.\n\nThe next few years will see more explicit separation of designing versus controlling music production. To that end, Grimes’s experiment is a worthy exercise pushing the limits of a multibillion-dollar business and our burgeoning world of open-sourced talent.\n\nKathleen Breitman is a cofounder of Tezos. The opinions expressed in Fortune.com commentary pieces are solely the views of their authors and do not necessarily reflect the opinions and beliefs of Fortune."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vZmVhdHVyZXMvMjAyMy1jcnlwdG8td2ludGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Winter 2022 Cost Bitcoin ($BTC) Holders More Than Cash - Bloomberg",
        "content": "Tales From the Crypto Winter Some acolytes lost faith, others blamed devils—and some went even harder. An essay exploring what happens when the prophecy of blockchain fails.\n\nShare this article\n\n\n\n\n\n\n\n\n\nOne day in early 2021, my old friend George called. I always enjoyed our catch-ups. We’d usually talk about dating, movies and his screenwriting career. But this time he steered the conversation toward a new topic: Bitcoin.\n\nGeorge, whose surname I’m omitting to protect his privacy, seemed genuinely eager for me to learn about the cryptocurrency. He sent me podcasts featuring blockchain “experts” and chart-heavy newsletters about “on-chain analytics.” George was planning his financial future around Bitcoin, he told me, and didn’t want his friends to get left behind. For a while, I ignored his appeals—the whole thing seemed complicated and vaguely annoying. But as the price of Bitcoin rose, his messages became more insistent. I agreed to look into it, and after “doing my own research,” i.e., half-listening to a few podcasts set on 2x speed, I decided to buy some.\n\nA series of cascading implosions caused the value of crypto to plummet last year. After that, George and I had a very different conversation. “Let me issue a blanket apology here,” George said. “It was the blind leading the blind.” Indeed, since I’d bought it, Bitcoin had lost three-quarters of its value. We were deep in what the blockchain faithful are calling crypto winter—an extended downturn that has yet to thaw.\n\nFor George, apologizing to me wasn’t the hardest part. He’d persuaded his Chinese immigrant parents to refinance their mortgage and lend him $50,000 to invest in Bitcoin. He stored the funds on Celsius, a sort of crypto bank where they could accrue interest. The company collapsed into bankruptcy, and now the money was frozen, much of it likely lost. “I said, ‘I’m really sorry, I’m deeply ashamed, and I will commit ritual seppuku if you demand it,’ ” he says. They didn’t, but he said he plans to pay them back when he can.\n\nIt seemed that George, like a lot of us who got caught up in crypto, was experiencing not just a financial loss but a kind of financial grief—a tangle of guilt, second-guessing and that awful feeling of having fallen for something. Bitcoin’s price has bounced back some since we spoke, but that’s little comfort if you’ve had your money stuck on a janky platform such as Celsius, or lost funds on Sam Bankman-Fried’s allegedly fraudulent FTX exchange, or held one of the now-worthless “altcoins” that popped up like mushrooms in a big rain during the pandemic trading boom. For many, crypto had become an identity, a way to feel smart and subversive and on the cutting edge of a new technology. What happens to that self-image when its foundation erodes? When instead of being someone’s savvy son or daughter, you are the sheepish adult child who has to explain where the family savings went? (Disclosure: I haven’t sold the tokens—mostly Bitcoin and Ether—that I bought near the top of the bull market, making me the object of delicate inquiry and gleeful mockery at family gatherings.)\n\nIt’s complicated. George, despite the frauds, the constant hacks and the market’s collapse, says he still has faith. “I still believe blockchain is a revolutionary development,” he says. “In 10, 20, 50 years, I do believe—I want to believe, badly—that we’ll look back and say Bitcoin was an invention on the scale of the printing press or the internet.”\n\nIn their seminal 1956 social psychology study, When Prophecy Fails, Leon Festinger, Henry Riecken and Stanley Schachter described how followers of a doomsday cult responded when their prophet’s precise predictions of apocalypse turned out to be false: They just pushed the date back. Some became even stronger believers and proselytized more. They’d already committed too much, perhaps quitting their jobs or giving away money, to accept that there was nothing to it. The study became a classic example of the “cognitive dissonance” that occurs when evidence contradicts one’s model of the world.\n\nI was curious how people in crypto were handling the dissonance. In the summer of 2021, with blockchain fervor in full swing, I wrote an article about crypto communities and found it useful to divide them into factions based on their favorite investment. There were the Bitcoin maximalists, who thought the OG token was the one true way to resist the scourges of modern finance and government; Ethereum hobbyists who regarded blockchains as a nifty Lego set for building new widgets; DeFi (decentralized finance) day traders who just gambled for the buzz. Each group came with its own values and culture. Today it feels more apt to sort people by their narratives of what the hell happened to crypto and where it all goes from here.\n\nTHE DOUBLE-DOWNERS\n\nAt a dude-heavy meet-up at a Midtown bar in New York in January, a group stood in a circle debating what had gone wrong with crypto. One guy blamed the large amount of “fluff” in the market, because anyone could spin a token out of nothing. Another pointed to the lack of transparency in many crypto institutions. A trader named Boris Friedman said that while people are currently “fearful” of crypto because of FTX, he expects the market to rebound in the next three to five years. “Long term, there will be more adoption,” he said.\n\nNearby, Corey Wilson, wearing two necklaces—one featuring the Egyptian Eye of Ra, the other the logo for a blockchain called HEX—sipped a margarita. Wilson told me that after losing funds on the crypto scam BitConnect and then making it all back and more with HEX, he still buys tokens every day. “I see a higher upside now that we’re in the lows of the market,” he said. (HEX is down almost 90% from its peak.)\n\nWilson buys tokens every day. Photographer: Levi Mandel for Bloomberg Businessweek He sports a necklace with the logo of a favorite token. Photographer: Levi Mandel for Bloomberg Businessweek\n\nRich Etienne, an engineer in Florida who lost about $100,000 in the Celsius collapse, said in a phone interview that he has a good feeling about the market now. He says it’s a matter of watching for patterns in the charts—“little movements, fake-outs, certain people shilling.” It’s less science than art, he says: “You start to get the vibe that this is it.”\n\nA Dutch institutional investor-turned-Bitcoin analyst who goes by the handle “Plan B” is best known for his charts predicting that Bitcoin would pass $100,000 in 2021. When that didn’t happen, his reputation took a hit. “You see a lot of hate,” Plan B told me over Zoom. (Like many crypto influencers, he prefers to be identified by his handle out of concern for his safety.) He stands by his optimistic analysis, particularly his popular “stock-to-flow” model that predicts Bitcoin will continue trending upward as the issuance of new coins slows, as it was programmed to do by its pseudonymous creator, Satoshi Nakamoto. (The model assumes Bitcoin’s price is driven by scarcity, a logic familiar to gold bugs as well as Beanie Babies collectors.) Plan B now estimates that by 2028, Bitcoin will be worth $100,000 to $1 million, up from about $27,000 today. The date, in other words, moved back a few years. “For me it’s the long game,” he says. He adds that his bet on Bitcoin is all-or-nothing: “It’s either going to zero or it’s going to be the successor to the US dollar.”\n\nAcademics say this type of thinking—doubling down on one’s conviction, despite a crash—is consistent with the psychology of both trading and gambling. Investors are more apt to sell assets that have gained in value than to let go of ones that have dropped; it’s a phenomenon known as the disposition effect. There are different explanations for this, says Tobin Hanspal, assistant professor of finance at the Vienna University of Economics and Business. One is that traders with plunging assets become risk-loving because they feel they have nothing to lose. Another says they’re avoiding feelings of regret. People “do not want to admit defeat or face the realization that they made a mistake,” Hanspal says. (This is me.)\n\nBlec blames the collapse on “too much trust.” Photographer: Tamara Reynolds for Bloomberg Businessweek\n\nOthers keeping the faith describe the crash as a purge that proves crypto must return to its roots. The whole point of Bitcoin, according to Satoshi’s white paper, was to allow people to transact money directly with “no central authority” like a government or bank, or a company such as FTX or Celsius. This idea of decentralization has a totemic power for some, with a resonance that seems as much emotional as intellectual.\n\nChris Blec, who writes an online newsletter called the Blec Report, has made a career out of criticizing any crypto project that deviates from the original purpose of blockchain technology. Companies such as FTX were “abusing Satoshi’s invention,” he says. “They’re using it in ways it’s not intended to be used.” Blec argues that most of the projects that collapsed over the past year suffered from the same problem: “too much trust.” Any system that requires trusting human beings is inherently unstable, he says, and can create a bubble. “Every time it bursts,” he says, “more people understand that.”\n\nThose Who Knew\n\nFrances Coppola wasn’t always a crypto hater. “When Bitcoin first came out, I was quite keen on it,” she says. The UK-based writer on economics and banking had long seen a need for an alternative to the bank-based payment system, and cryptocurrencies seemed like a promising development. But by 2021 she’d turned skeptic. That summer she posted a Twitter thread explaining why even decentralized crypto systems run by code could be prone to catastrophic failure. She argued that they’d suffer digital bank runs if investors started to pull their money out quickly, which their algorithms wouldn’t be able to stop. “The algos are built on the assumption that humans never panic and stampede for the exit, ignoring the overwhelming evidence that they do,” she wrote.\n\nHer tweets caught the attention of Do Kwon, the creator of TerraUSD, a then-hot coin that used a decentralized algorithm to maintain a steady value of $1. TerraUSD was a popular substitute for US dollars among DeFi traders, and it could be reinvested to earn high yields. “I don’t debate the poor on Twitter,” Kwon tweeted in Coppola’s thread.\n\nCoppola foresaw the crypto panic. Photographer: Jack Kenyon for Bloomberg Businessweek\n\n“Schadenfreude is the right term”\n\n“That came back to haunt him,” Coppola says. “I ended up being cited in the court case.” She then bursts into a merry laugh. In May 2022, TerraUSD unraveled in exactly the type of bank run Coppola had described. Kwon is now being sued by investors and has been charged with fraud by US prosecutors; he’s denied wrongdoing. For Coppola, the crash, which TerraUSD’s fall partly triggered, has been bittersweet. She doesn’t want to take pleasure in it, given how many people have gotten hurt. And yet, “I did feel a bit, ‘So there,’ ” she says. “Schadenfreude is the right term.”\n\nCoppola belongs to a community of skeptics who have long pushed back against the narratives spread by crypto boosters. During the bull market, many of those boosters swamped the skeptics with derision. “We did take a lot of abuse from the ‘Have fun staying poor’ crowd,” she says. Since the crash, the skeptics have taken a victory lap. “I wouldn’t say people are opening bottles of Champagne,” says Amy Castor, another prominent crypto critic, who works as a freelance journalist and writes a reader-supported blog. But they’ve seen their ranks grow. “There were a handful of us before, screaming into the abyss,” she says. “Now there’s a lot more.”\n\nThe Blame-casters\n\nIn crypto, 2022 was the year of the “bad actor.” (As in malefactor, not Steven Seagal.) Bad actors were suddenly everywhere, tainting the purity of the otherwise unassailable technology. Instead of pointing to structural problems in crypto—the lack of investor protections, say, or the fundamental question of how to prevent a fully decentralized, largely anonymous currency from being used to fund terrorism—believers blamed individuals (or groups) for … acting badly.\n\nThe baddest actor of all, of course, is the man now known across the cryptosphere as “Scam Bankrupt-Fraud.” Molly White, a vocal crypto critic who runs the site Web3 Is Going Just Great, has argued that Bankman-Fried is a useful scapegoat for crypto fans. “It’s very convenient for them to say, ‘This isn’t our problem, this is just one guy,’ ” she said in a recent podcast interview. (Bankman-Fried, who’s facing criminal fraud charges, has denied wrongdoing.)\n\nOther scapegoats abound. On Fox News’ Tucker Carlson Tonight, guest host Tulsi Gabbard highlighted an unfounded theory that American politicians were channeling US taxpayer dollars to Ukraine, which was then investing in FTX, which was then funneling money back to Democrats. (Bankman-Fried was a major Democratic donor; his colleague Ryan Salame gave millions to Republicans.) Ukraine’s deputy minister of digital information tweeted that Ukraine “never invested any funds into FTX.”\n\nThe Communitarians\n\nPerhaps the only byword in the crypto lexicon as powerful as decentralization has been community. Across Twitter and Telegram and Discord, owners of the same asset gather to discuss the greatness of their asset, share memes about it and trash competing assets. This was particularly true of nonfungible tokens, or NFTs, those bits of digital art that in some cases traded for hundreds of thousands of dollars. Now, previously bustling Discord chatrooms lie quiet, and a few remaining fans wait for updates. “Devs, do something” is the pitiable refrain, the digital equivalent of poking a dead animal with a stick.\n\n“It’s very funny to look back and think, ‘Were we all just drunk or something?’ ”\n\nThe dissolution of these communities has left scars—some of them literal. In February 2022, Emma Crudgington was scrolling Twitter at her office in Brisbane, Australia, when she spotted a hot new NFT. It was called Tasty Bones, and the logo featured a cartoonish skull with an ice cream cone upended on it. The art was “cute,” she thought, and, more important, the project was getting lots of hype. Demand for access to the presale exceeded supply, and she needed a way to distinguish herself. “I was like, ‘What’s the most extreme thing I can do?’ ” she says. She got the logo tattooed on her arm. She posted a photo of it on the Tasty Bones community Discord chat, and the creators put her on the list to receive two NFTs. She ended up selling them a week later, netting around $12,000.\n\nCrudgington may lose her Tasty Bones tattoo. Photographer: Tammy Law for Bloomberg Businessweek\n\nNow that the project has disintegrated—a Tasty Bones currently sells for about $50—Crudgington is amused by the tattoo. “It’s a great story to tell people,” she says. “It’s very funny to look back and think, ‘Were we all just drunk or something?’ ” She expects she’ll have it removed or covered up. Crudgington is still involved in an NFT project called Sappy Seals. She spends hours every week talking to a subgroup of Seals owners called Sappy Sisters. “It’s like having a personal therapist,” she says. “We talk about the most random things, from physics to lip gloss.” Crudgington says the Sisters have transcended their origins. They’ve raised money for a dog charity, rallied support for a community member with cancer and discussed sexual harassment in the NFT space. She can be vague describing the nature of their bond (“the theme of the community is community”) but says the connection is authentic.\n\nConnection in crypto can be dicey. White has coined the term “predatory community” for the way it can foster bonds at the expense of its users, much like a multilevel marketing scheme. When emotions get tied up with money and a sense of belonging, it can be hard to see oneself and one’s peers clearly, especially in communities that tout virtuous causes. Such environments are ripe for manipulation. Countless projects have gotten “rugged,” or sold off by the creators, leaving investors with worthless tokens. Those that simply fizzle produce the same result.\n\nCrudgington says she recognizes such communities can be exploitative, but the Sappy Sisters are different. “There’s no monetization,” she says. “There’s no ulterior motive behind it.”\n\nThe Ones Who Step Away\n\nIn 2021, after working half a decade in traditional finance—TradFi is the dismissive crypto term—Jill took a job at a firm specializing in DeFi. (She requested I not use her full name so she can speak candidly about her work.) She was drawn to the idea of transaction without go-betweens, particularly in a world where governments can prohibit bank accounts from being used for, say, sex work or birth control. “For a while, I drank that Kool-Aid,” she says. “Then I realized no one had any idea about OFAC rules.” (The Office of Foreign Assets Control enforces sanctions against terrorist organizations.) The more she learned about the technical aspects of crypto, the less it seemed about financial freedom than “getting around capital controls.” She says she was also put off by its consumerist culture of boats and models: “I did not fit in.” She recently left that job and is looking for work in TradFi.\n\nThe idea of boats and models didn’t seem to bother another former crypto worker I spoke to, who asked not to be named at all. (People in this group are skittish about talking.) After making six figures in the 2021 bull run, he dropped out of college and took a job at a crypto venture capital firm. His thinking was simple, he says: School sucked, and he wanted to be free, make a ton of money and have a Lambo. The business model in the space was to find a project, promote it, wait for its tokens to rise and take profits. This didn’t seem sinister because everyone was making money. When he did think about the morality of his work, it wasn’t hard to justify; if anyone was getting rugged, it was rich people. In retrospect, he says it was callous not to think about what was going on under the hood.\n\nAfter the market began to slip, what had felt to him like a positive-sum game suddenly seemed zero-sum. He realized that if anyone was making outsize returns, that wasn’t happening for free. A lot of projects his firm had invested in had failed, and he found it hard to get excited about the new ones. I asked if his colleagues believed the projects had real value. They do, he says, and he thinks that’s delusional. Last fall he went back to school.\n\nIn early March, I told David, my normally laconic barber, that I was writing about crypto winter. He perked up and, taking long pauses between snips of hair while gesturing with his scissors, delivered an analysis of what he assured me is the next big thing: artificial intelligence tokens.\n\nIndeed, after the debut of ChatGPT in November, crypto tokens with some link to AI technology (the connection isn’t always clear) have rocketed in value. Multiple people I spoke with mentioned AI integration as a possible path forward for crypto. Perhaps chatbots will be able to spend cryptocurrency to accomplish their tasks. Maybe blockchain technology can help verify authenticity in a world saturated with deepfakes. The influential Twitter account @punk6529 recently posted, “AI will unveil what crypto’s true purpose is.” The tone of these conversations—hushed, commiserating, vaguely oracular, comically speculative—felt familiar. I told David I’d look into it. I have not.\n\nBeam is a freelance journalist. He made his first crypto purchase in April 2021; he hasn’t made a trade since April 2022."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21pbGxpb24tYWRkcmVzc2VzLW93bi0xLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "Going Full Bitcoiner: 1 Million Addresses Now Own 1 BTC or More - Blockworks",
        "content": "Bitcoin hit a wild high of $69,000 in November 2021. And despite a healthy rally in this year’s first quarter, it’s still down nearly two-thirds from its price record.\n\nThe good news? This price drop made it easier for folks to jump on the bitcoin bandwagon or continue stacking sats.\n\nOne million addresses now hold more than 1 BTC ($26,800), according to data from Glassnode.\n\nMost recently, the number of addresses with full BTC status picked up considerably at the end of February last year, when bitcoin was halfway through correcting after its record high.\n\nThere’s some inverse correlation with bitcoin price and the number of ‘full bitcoiner’ addreses\n\nDan Ashmore, head of research at Investoo Group, told Blockworks that holding a full bitcoin is equal to roughly half the median US salary. So, while it’s now easier than it was back in late 2021, it could eventually be out of reach for many once again if high prices return.\n\n“This is what we saw during the relentless bull market during the pandemic — a clear leveling off of the previous trajectory at which the number of addresses containing 1 bitcoin or more was growing,” Ashmore told Blockworks.\n\n“As bitcoin fell in price last year, the previous upward trajectory in the growth of these addresses was resumed. I would not expect this pattern to change going forward.”\n\nIt’s worth noting that one bitcoin address doesn’t always represent one person, so this doesn’t necessarily mean one million people own 1 BTC. Certain individuals control multiple bitcoin addresses, while some addresses may belong to institutions or groups of people.\n\nAccording to Ashmore, the 1 million milestone highlights how deeply Bitcoin has established itself in the mainstream realm in recent years.\n\nWhales (and exchanges) among million full Bitcoin addresses\n\nDespite the Bitcoin network’s inherent decentralization, the distribution of wealth is more concentrated than commonly assumed.\n\nOnly 7% of the supply (1.356 million BTC, worth $36.4 billion) is distributed among the nearly 46.5 million addresses with at least some bitcoin — but less than one — per BitInfoCharts.\n\nThe other 93% (18 million BTC, worth $482.7 billion) exists in the one million addresses that now own a full BTC.\n\nSo, the addresses containing more than 1 BTC represent about 2.1% of all non-zero Bitcoin addresses.\n\nIt must be stressed that those stats are somewhat skewed considering how much BTC resides within crypto exchange addresses — which mostly represent aggregate user holdings.\n\nCoinGlass shows 1.89 million BTC ($50.7 billion) sitting with crypto exchanges, about one in every 10 bitcoin in circulation, led by Binance, Coinbase and Bitfinex.\n\nThere’s also the 1.46 million BTC ($39.2 billion) that Glassnode considers “probably lost” forever, equal to 7.5% of all bitcoin in existence right now.\n\nStill, Erik Saberski, vice president of data science at The Tie, pointed out that even distribution across financial systems leads to stability in associated asset classes.\n\nFewer holders, on the other hand, results in imbalanced buying and selling pressure, causing significant price fluctuations. So, more people holding a full bitcoin could indicate increased price stability, reflecting bitcoin’s maturation.\n\n“Because bitcoin is the flagship asset of the crypto economy, this signal of adoption seems to portend broader growth for the overall digital asset ecosystem,” Saberski told Blockworks.\n\n“With this in mind, a measure for adoption does not necessarily suggest anything about the market in the short term. Indeed, adoption happens on a much slower timescale.”\n\nDavid Canellis contributed reporting.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1kaXBzLTEzMTAzOTQ1NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin dips to US$26,166 as memecoins flood the blockchain - Yahoo Finance",
        "content": "Bitcoin fell 9.42% from May 5 to May 12 to trade at US$26,365 as of 7:30 p.m. on Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under US$30,000 since April 19. Ether fell 7.3% over the week to US$1,765, losing the key US$1,800 support level.\n\nimage 3\n\nThe U.S. Consumer Price Index (CPI) released this week showed slower headline inflation in April, boosting hopes for the Federal Reserve to pause rate hikes next month. U.S. annual inflation slowed to 4.9% last month, from 5% in March, but gained 0.4% on the month.\n\nBitcoin briefly topped US$28,300 following the release of U.S. inflation data, but has since been trading lower.\n\n“Bitcoin dropped to US$26,900 after rejecting from the ~US$28,200 area. The reaction from the ~US$26,900 area was quite strong,” tweeted pseudonymous crypto analyst Rekt Capital. “The US$28,200 resistance is the resistance to beat if the price is to enjoy bullish momentum,” he added.\n\nThe global crypto market capitalization stood at US$1.1 trillion on Friday at 07:30 p.m. in Hong Kong, down 8.33% from US$1.2 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$510 billion market cap accounted for 46.3% of the market, while Ether’s US$214 billion accounted for 19.4%.\n\nBitcoin stuck in traffic\n\nIn another milestone for the world’s first blockchain, the number of non-zero balance Bitcoin addresses reached an all-time high of 46.6 million on Thursday, boosted by the surging interest in Ordinals, a protocol that allows data to be inscribed in the smallest monetary unit of Bitcoin, according to on-chain data analytics firm Glassnode.\n\nAs a result, Bitcoin congestion issues worsened. The network faced a growing backlog of transactions exacerbated by the network surpassing 5 million Ordinals inscriptions, fueled by the arrival of memecoins in the form of BRC-20 tokens, a fungible token standard built on Ordinals protocol. BRC-20 tokens surpassed US$1 billion in market capitalization on Tuesday.\n\nStory continues\n\nAdding to the negative market sentiment, Binance temporarily halted Bitcoin withdrawals twice in 12 hours on Monday, due to a “large volume of pending transactions.” The world’s largest crypto exchange resumed Bitcoin withdrawals on the same day, while Bitcoin fell as low as US$27,419 on Monday.\n\n“[The correction] was highly due to that since Binance witnessed historically-high BTC outflows,” said Leena ElDeeb, a research associate at 21.co, the parent company of 21Shares, an issuer of crypto exchange-traded products.\n\nBitcoin supply on exchanges fell to a five-year low of 5.84% on Tuesday, according to crypto analytics firm Santiment, indicating that long-term holders are increasingly opting for self-custody solutions.\n\n“The downtrend was also influenced by misinformation on Twitter, calling the congestion a denial of service attack when, in fact, it was increased demand that led to that congestion and skyrocketing transactions only meant that people were willing to pay more money for faster settlements,” ElDeeb added.\n\nNilesh Verma, crypto market analyst and founder of Crypto Granth consultancy in India, pointed to a separate thread of inaccurate information dissemination surrounding the U.S. government and its Bitcoin holdings as a significant factor in the declining value of Bitcoin this week.\n\nMisinformation emerged on Wednesday, stating that the U.S. government started selling its Bitcoin holdings. According to a March 31 court filing, the U.S. government seized 51,351.89 Bitcoin (worth US$1.4 billion) from Ross Ulbricht, the creator of the darknet marketplace Silk Road. The government sold 9,861 Bitcoin (US$279 million) on March 14 and is planning to sell the remaining 41,490 Bitcoin (US$1.1 billion) in four batches this year.\n\n“Someone shared fake news that the U.S. government will sell Bitcoin by showing the wrong labeling on the Arkham Platform… same we saw on April 27, when Bitcoin dropped from US$29,000 to US$27,000 on a glitch in the Arkhram platform,” Verma said.\n\nMarket analysis\n\nCrypto Granth’s Verma said that Bitcoin has strong support around US$26,111. “Bitcoin has to hold this support for continued bullish momentum. As of now, we can see a retest of this area. We believe that we will see strong buying near US$25,000-26,000. Weekly closing below US$26,000 will make Bitcoin bearish,” wrote Verma.\n\nBut Dr. Jeff Ross, founder and chief executive officer of investment firm Vailshire Capital Management, said Bitcoin needs to dip lower before starting a new rally.\n\n“Short-term momentum indicators need one more flush lower, ideally to US$24,000, to complete the healthy reset and begin the next leg higher, starting in mid-to-late May,” wrote Ross on his verified Twitter account.\n\nBiggest gainers:\n\nKava, the governance token of a layer-1 blockchain of the same name, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. Kava rose 17% to US$0.9204, after the protocol announced that its mainnet launch is one week away.\n\nBitcoin SV (BSV) – a fork of Bitcoin Cash focused on scalability – was this week’s second biggest gainer, rising 8.47% to US$35.88. The token saw a surge of interest after congestion on the Bitcoin network caused transaction fees to rise .\n\nSee related article: Central Banks’ actions move Crypto; Standard Chartered eyes $100K Bitcoin\n\nNext week: All eyes on the U.S. debt ceiling\n\nNegotiations over raising the U.S. debt ceiling of US$31.4 trillion to keep the government solvent continued on Wednesday, with congressional Republicans demanding more budget cuts. President Biden’s meeting with top Congress leaders planned for Friday was postponed to next week, three sources familiar with the matter told NBC News.\n\nInvestors are also anticipating Europe’s Harmonised Indices of Consumer Prices report, scheduled for next Wednesday. Euro area annual inflation for April is expected to come in at 7% for April, up from 6.9% in March, according to flash estimates from Eurostat, the European Union’s statistical office.\n\nIn the crypto space, liquid Ether staking protocol Lido Finance is preparing for its V2 upgrade, enabling Ether and staked Ether (stETH) withdrawals directly on the protocol. The Lido DAO is set to vote for the V2 upgrade starting today, from 10 p.m. Hong Kong time. With the community’s approval, the upgrade is expected to go live next Monday.\n\nWeb 3.0 gaming protocol Gala Games is also preparing for a contract upgrade on Monday. The protocol will issue its new Gala V2 token in a 1:1 ratio for all Gala token holders, while support and utility for the initial token will cease simultaneously. While most major exchanges signaled their support for the new token, Coinbase stated that it will not be supporting Gala V2.\n\nSee related article: Crypto and NFT Market Update – May 11th"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmV1cm9uZXdzLmNvbS9idXNpbmVzcy8yMDIzLzEyLzA0L3RvZGF5cy1tYXJrZXRzLWJpdGNvaW4taXMtMTUwLXVwLWdvbGQtZmxpcnRzLXdpdGgtbmV3LXJlY29yZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Today's markets: Bitcoin is 150% up, gold flirts with new record - Euronews",
        "content": "Investors are eyeing good news from the US economy while concerns of a broader Israel-Hamas war temporarily pushed the price of gold to new levels.\n\nADVERTISEMENT\n\nBitcoin has reached $42,245 as it rides a wave of momentum on expectations about US interest rate cuts and as traders anticipate the imminent approval of US stock market-traded bitcoin funds.\n\nThe world's biggest cryptocurrency jumped more than 8% above $42,000 on Monday, its highest since April 2022.\n\nBitcoin is up by over 150% so far this year - with its price standing at $17,140 a year ago - though the current price is still more than 40% lower than its all-time high in 2021.\n\nMeanwhile, gold has been shining once again, as safe haven investments do in periods of geopolitical volatility.\n\nAn attack on an American warship and commercial vessels in the Red Sea on Sunday kept investors on their toes and inflamed fears that the Israel-Hamas war could widen into a broader conflict.\n\nThe precious metal reached a new record, amidst expectations that the US Federal Reserve (Fed) will cut interest rates next year, as well as tension in the Middle East and a weaker dollar. The price shortly visited $2,144 an ounce, an all-time high, before easing back around $2,090 in the Monday morning trade.\n\n\"The market is sensitive to any expansion of this conflict,\" said Quincy Krosby, chief global strategist at LPL Financial. \"I think active managers in any event are more likely to lock in their gains if this is a harbinger of a deeper military conflict that involves the US.\"\n\nOil prices are down\n\nDespite some expectations and the rising geopolitical tensions, oil prices went south, pressured by investor scepticism over the latest OPEC+ decision on supply cuts and uncertainty surrounding global fuel demand, though the risk of supply disruptions from the Middle East conflict limited losses.\n\nMonday's fall adds to a 2% decline last week after the supply cuts announced on Thursday by the Organization of the Petroleum Exporting Countries (OPEC) and allies including Russia, together known as OPEC+.\n\nBrent crude futures were hovering above $78 and WTI crude futures fell below $74 per barrel on Monday morning.\n\nHow did data from Europe set the mood Monday morning?\n\nThe main European stock indexes showed a mixed picture on Monday morning, with only the German DAX and the Spanish IBEX 35 showing slight gains, as a handful of data has been released to set a mood for investors.\n\nThe trade surplus in Germany increased to €17.8 billion in October 2023, as exports fell by 0.2% compared to the previous month to €126.4 billion. Imports however fell more spectacularly to €108.6 billion, down by 1.2% from the previous month and 16.3% from a year earlier, largely due to lower energy prices.\n\nMeanwhile, in Spain, the number of people registering as jobless fell by 24,573, or 0.9%, to 2.73 million in November 2023. Spain's unemployment rate was 11.84% in the third quarter of 2023.\n\nAnother positive development from the heart of Europe came in the form of Switzerland's inflation rate slowing to a two-year low. Prices rose 1.4% in November from a year earlier, according to the Federal Statistics Office.\n\nIt's the final reading ahead of the Swiss National Bank's (SNB) next interest rate decision on 14 December. The SNB's current policy interest rate is at 1.75%, while its inflation target range is 0% to 2%.\n\nThe European Central Bank (ECB) is also holding its monetary policy meeting on 14 December and investors are closely watching whether recent surprisingly good inflation data was good enough news for the Eurozone lender to relax its tight monetary policy.\n\nHowever, ECB Vice-President Luis de Guindos cautioned the markets of high uncertainty at a financial event on Monday, adding that \"it was too early to declare victory,\" writes Reuters.\n\nWhat could drive investors' hands this week?\n\nMarkets are hungrily watching signs of easing inflation and hope the Fed is done raising interest rates.\n\nADVERTISEMENT\n\nAsian stocks mainly fell on Monday amidst concerns over China’s economic health. Indian shares were the exception, as they rose fuelled by financial and energy stocks, while key wins for the ruling party in state elections lifted the domestic market.\n\nUS stocks closed at their highest level since March 2022 on Friday after comments from Fed chair Jay Powell fuelled hopes that the central bank is done raising interest rates and will start cutting rates sooner than expected.\n\nOn the wave of this, last Friday the S&P 500 (index tracking 500 of the largest companies listed on stock exchanges in the US) reached a new 2023 high.\n\nThis week, investors are going to closely watch oil inventories in the US and the various jobs reports from the country, as the world's biggest economy is expected to pull a fast recovery and avoid recession next year.\n\nAs new jobs are a leading indicator of economic health, Tuesday's JOLTs job openings, unemployment claims on Thursday, and Friday's unemployment rate are certainly going to drive investors' hands.\n\nADVERTISEMENT\n\nThe next Fed monetary policy meeting is on 12-13 December.\n\nIn Europe, the Eurozone GDP and employment data due for Thursday could give more details about the bloc's economy, which is feared to be facing recession."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZGVjcnlwdC5jby8xMzk5NDQvYml0Y29pbi1zdXJmaW5nLXRvdXJpc3RzLWFyZS1mbG9ja2luZy10by1lbC1zYWx2YWRvci13aGF0cy10aGUtYmlnLWRlYWzSAWdodHRwczovL2RlY3J5cHQuY28vMTM5OTQ0L2JpdGNvaW4tc3VyZmluZy10b3VyaXN0cy1hcmUtZmxvY2tpbmctdG8tZWwtc2FsdmFkb3Itd2hhdHMtdGhlLWJpZy1kZWFsP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Surfing Tourists Are Flocking to El Salvador—What’s the Big Deal? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTourists are flocking to El Salvador in record numbers, according to the country’s tourism minister.\n\nThe announcement comes as the Central American country ramps up its PR campaign to show the world that it is no longer a tiny backwater plagued by hyper violent street gangs—but rather a Bitcoin and surf paradise.\n\nOn Thursday, President Nayib Bukele, the country’s social media savvy, millennial leader, posted a cinematic video on Twitter announcing that El Salvador had just gone 365 days without a single homicide.\n\nAD\n\nAD\n\nWe ended on May 10, 2023, with 0 homicides nationwide. With this, it's 365 days without homicides, a full year. pic.twitter.com/SlupO8vN6J — Nayib Bukele (@nayibbukele) May 12, 2023\n\n“El Salvador today is undisputedly the safest country in Latin America,” a dramatic voice narrates in the video.\n\nAFP reported that the figure was “the total number of days without murders since 2019” rather than consecutive days.\n\nTourism minister Morena Valdez added on Twitter that the country had received one million visitors so far this year.\n\nUntil recently, El Salvador was largely unpopular on the “gringo trail,” other than with hardcore surfers. That's because it repeatedly dropped in and out of the most violent nations on the planet lists.\n\nAD\n\nAD\n\nIn 2015, with at least 6,640 murders, it was ranked the most murderous country in the Western Hemisphere.\n\nBut El Salvador made headlines in 2021 when it became the first country in the world to make Bitcoin legal tender. Its eccentric leader has gone on Bitcoin-buying sprees and businesses now have to accept the cryptocurrency by law.\n\nPresident Bukele has turned things around in the country by launching a historic crackdown on El Salvador’s notorious criminal groups. He in turn hopes to transform the country into a tech hub.\n\nAnd Salvadorans seem pleased with the turnaround: Murders are down and Bukele regularly polls well.\n\nBut human rights groups have criticized his crime-tackling strategy and institutions like the World Bank and the IMF have slammed the Bitcoin idea.\n\nReal data is hard to get hold of, too: No one other than the Salvadoran government knows how much murders have really dropped by—or how much Bitcoin the government owns.\n\nStill, the impact of the Bitcoin and surf tourism campaign is undeniable. Travel guide giant Lonely Planet in November rated El Salvador as one of 11 top countries to visit in 2023.\n\nAD\n\nAD"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xMi9hcy1iaXRjb2luLXNjYWxlcy13ZS1uZWVkLWJldHRlci1jdXN0b2RpYWwtc29sdXRpb25zL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xMi9hcy1iaXRjb2luLXNjYWxlcy13ZS1uZWVkLWJldHRlci1jdXN0b2RpYWwtc29sdXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "As Bitcoin Scales, We Need Better Custodial Solutions - CoinDesk",
        "content": "All you need is a little trust. Of course, this is exactly what bitcoin was created to avoid – as a purely peer-to-peer version of electronic cash that can be sent directly from one party to another without going through a financial institution. But it's true, custodial solutions might actually be the easiest way to use the Lightning Network."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2UtYW5hbHlzaXMtc3VwcG9ydC1tb21lbnR1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Price Analysts Eyeing $25K as Support Following Momentum Shift - Blockworks",
        "content": "Bitcoin (BTC) continues to flirt with valuations not seen in nearly two months, as price momentum nosedives.\n\nThe asset, which is down 2.5% on the day to $26,300, lost its footing above a support threshold along $27,000 sending it to its lowest point since March 14.\n\nBitcoin’s return to $25,000 looks like a very “real prospect” in the coming days, FxPro senior market analyst Alex Kuptsikevich told Blockworks in an email.\n\n“The bears will have their work cut out for them here, as some oversold conditions will have built up by then,” he said, highlighting the distorted equilibrium between buyers and sellers.\n\nFor a time, volatility was muted as prices remained relatively locked between $27,000 and $30,000. That was expected to persist throughout May, as declining interest across crypto derivatives effectively sapped long and short sellers.\n\nIt’s worth noting that as of May 8, bitcoin volatility was hovering at its lowest point since the beginning of January at 29% — down significantly from March 13’s peak of 63%, data from IntoTheBlock shows.\n\nHowever, volatility has been spiking on the daily time frame since May 8 and that uptick is poised to feed into medium-term price action.\n\nStill, the fact that the price has not yet breached $25,000 is significant when viewing this year’s performance, Kuptsikevich added.\n\n“Now it has every chance of becoming an equally reliable support,” he said.\n\nBut first, bitcoin would need to sort out its congestion issues, Rich Rosenblum CEO of market maker GSR told Blockworks.\n\nData reveals a significant increase in unconfirmed Bitcoin transactions, which currently stand at 284,369. This is a 440% rise compared to the figure of 52,600 observed nearly two months ago on March 17.\n\nThe current weight of the mempool, which refers to the total data size within it, is about 871 MB. This exceeds the default maximum mempool limit of 300MB set by Bitcoin Core, data shows.\n\nIt’s important to note that not every node operator sticks to the default 300MB limit. Some opt for higher thresholds to prevent discarding transactions with lower fees.\n\nWhen this occurs, transactions continue to be processed, they just might come with a higher cost, likely the result of a newly popular use case for the world’s oldest crypto.\n\nOver the past week, there has been a substantial increase in the number of Ordinals inscriptions on the Bitcoin network, which has almost doubled from 2.5 million to 4.78 million. This surge is largely attributed to the growing interest in the BRC-20 token.\n\n“Organic congestion due to excitement over BRC-20? Well, that’s probably bullish that we’re finally seeing enough adoption that it’s slowing the network,” Rosenblum said.\n\nIf, on the other hand, the network is deliberately flooded with a continuous cycle of small transactions in an attempt to profit from a bitcoin short position. “That’s bearish and hard to police in a decentralized world,” he added.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYml0Y29pbi1sb3Nlcy0xMC1vbi10aGUtd2Vlay1hcy1tZW1lY29pbnMtdHVtYmxlL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYml0Y29pbi1sb3Nlcy0xMC1vbi10aGUtd2Vlay1hcy1tZW1lY29pbnMtdHVtYmxlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Loses 10% on the Week as Memecoins Tumble - CoinDesk",
        "content": "\"The hype of meme coins is usually exciting, but often followed by a market crash, similar to what we saw with DOGE and SHIB two years ago,” said Youwei Yang, chief economist at publicly traded bitcoin mining company, BTCM. “The market correction for memecoins this week is largely due to the calm down of the FOMO (fear of missing out) sentiment with these new memecoins.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8xMi9iaXRjb2luLW1pbmVyLXJpb3Qtc3Vlcy1wZWVyLXJob2RpdW0tZW50ZXJwcmlzZXMtZm9yLWFsbGVnZWQtMjZtLWluLXVucGFpZC1mZWVzL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8xMi9iaXRjb2luLW1pbmVyLXJpb3Qtc3Vlcy1wZWVyLXJob2RpdW0tZW50ZXJwcmlzZXMtZm9yLWFsbGVnZWQtMjZtLWluLXVucGFpZC1mZWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Riot Sues Peer Rhodium Enterprises for Alleged $26M in Unpaid Fees - CoinDesk",
        "content": "Separately, Riot claims that Rhodium's units were amassing power credits on their books for two years that it didn't have rights to. Riot also wants the court to declare that Riot doesn't owe Rhodium any power credits. Riot claims that those power credits could have had a legal basis from previous contracts, but those were superseded by the December 2020 agreements."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvZnJvZ3MtZmV2ZXJzLWFuZC1mZWVzLWJpdGNvaW5zLW5ldy1nb3Zlcm5hbmNlLWNoYWxsZW5nZS_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzEyL2Zyb2dzLWZldmVycy1hbmQtZmVlcy1iaXRjb2lucy1uZXctZ292ZXJuYW5jZS1jaGFsbGVuZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Frogs, Fevers and Fees: Bitcoin’s New Governance Challenge - CoinDesk",
        "content": "Still, the core problem here is not that Bitcoin is being used to represent frog images per se, but that its value as an efficient, intermediary-free settlement system for transferring value of all kinds is undermined by blockspace congestion. (As CoinDesk columnist David Z. Morris wrote this week, Bitcoin would be experiencing the same problems if, as its advocates hope, millions more people were using Bitcoin for monetary purposes.) That’s where the governance conversation needs to be focused."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvZmlyc3QtbW92ZXItYW1lcmljYXMtbWVtZWNvaW4tcGVwZS1oaXRzLTFiLW1hcmtldC1jYXAv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8xMi9maXJzdC1tb3Zlci1hbWVyaWNhcy1tZW1lY29pbi1wZXBlLWhpdHMtMWItbWFya2V0LWNhcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Falls to 2-Month Low - CoinDesk",
        "content": "Crypto miner Hive Blockchain is planning to sell up to $100 million in common shares through an at-the-market sale in order to fund the goal of doubling its computing power. Hive is aiming to increase its hashrate from 3 exahash/second (EH/s) to 6 EH/s, part of which it says it can achieve by the end of Q2 with machines already purchased. No further details have been offered on the timeline of the sale, for which Canadian investment firms Canaccord Genuity and Stifel are to act as agents. Following the turbulence of 2022, of which several miners did not live to tell the tale, firms are now taking advantage of a modest rebound in crypto prices so far this year to set new growth and operational targets."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYnRjLXNsaXBzLXRvLTItbW9udGgtbG93LWFzLWNvaW5kZXNrcy1iaXRjb2luLXRyZW5kLWluZGljYXRvci1zaGVkcy1idWxsaXNoLWJpYXMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYnRjLXNsaXBzLXRvLTItbW9udGgtbG93LWFzLWNvaW5kZXNrcy1iaXRjb2luLXRyZW5kLWluZGljYXRvci1zaGVkcy1idWxsaXNoLWJpYXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Prices Slip to 2-Month Lows as CoinDesk’s Bitcoin Trend Indicator Turns Neutral From Bullish - CoinDesk",
        "content": "\"We could get an acceleration on the downside IF U.S. equities also start to roll over,\" Lo told CoinDesk. \"$25,200 is key support for BTC followed by $23,100 on potential downside acceleration.\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctd2lsbC1sb3dlci1pbnRlcmVzdC1yYXRlcy1iZW5lZml0LWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "How will lower interest rates benefit Bitcoin? - Cointelegraph",
        "content": "Macro Markets, hosted by crypto analyst Marcel Pechman, airs every Friday on the Cointelegraph Markets & Research YouTube channel and explains complex concepts in layperson’s terms, focusing on the cause and effect of traditional financial events on day-to-day crypto activity.\n\nToday’s show starts by discussing the economic crisis in Argentina, a Latin American country that is experiencing hyperinflation. After years of populist measures, its local currency, the peso, saw its value go down by 70% in two years. The government’s overspending caused another issue: a lack of United States dollars for the government and companies to pay for imports and remittances. But what does that mean for the U.S. dollar, Bitcoin (BTC) and gold?\n\nAccording to Pechman, gold poses serious problems, as there is no easy way to ensure whether or not the precious metal is fake, and it doesn’t actually work for remittances. Therefore, dollars and euros are the preferred means of savings and exchange for those facing a weak domestic currency.\n\nPechman proceeds to explain how fintechs’ costs and government control limit their potential in Argentina, and why stablecoins are the preferred vehicle for remittances. On the other hand, the analyst shows why cryptocurrencies fail to attract people in those fragile economies, including El Salvador.\n\nThe next segment of Macro Markets focuses on the Federal Deposit Insurance Corporation (FDIC). Reuters reported that the 113 biggest banks in the U.S. will have to cover the recent FDIC loss of $16 billion caused by saving failed financial institutions. Consequently, there’s a cascading effect as the remaining institutions are obligated to cover the losses. Pechman mentions how the Federal Reserve will eventually reduce interest rates and benefit risk-on assets, including Bitcoin.\n\nIf you are looking for exclusive and valuable content provided by leading crypto analysts and experts, make sure to subscribe to the Cointelegraph Markets & Research YouTube channel. Join us at Macro Markets every Friday."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1mYWxsLW1vc3QtdG9wLTEwLWNyeXB0b3MtdS1zLWZ1dHVyZXMtcmlzZS1kZWJ0LWNlaWxpbmctbmVnb3RpYXRpb25zL9IBc2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1mYWxsLW1vc3QtdG9wLTEwLWNyeXB0b3MtdS1zLWZ1dHVyZXMtcmlzZS1kZWJ0LWNlaWxpbmctbmVnb3RpYXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether fall along with most top 10 cryptos; U.S. futures rise ahead of debt ceiling negotiations - Forkast News",
        "content": "Bitcoin and Ether fell during Friday afternoon trading in Asia, along with most of the top 10 non-stablecoin cryptocurrencies by market capitalization, apart from the XRP token. Most Asian equities declined despite data reflecting an economic recovery in Hong Kong U.S. stock futures strengthened for a second consecutive session, as negotiations over raising the debt ceiling are set to resume in the world’s largest economy.\n\nSee related article: Bitcoin congestion issues continue amid BRC-20 memecoin, Ordinals surge\n\nCrypto market declines as Bitcoin falls below US$27,000\n\nBitcoin dropped 4.14% to US$26,293 in 24 hours to 4:30 p.m. in Hong Kong, according to CoinMarketCap data. The daily decline by the world’s first cryptocurrency was the biggest daily drop in the top 10 coins by market cap.\n\n“Bitcoin has to hold [US$26,111] for continued bullish momentum,” Nilesh Verma, crypto market analyst and founder of Crypto Granth consultancy, told Forkast. “We believe that we will see strong buying near US$25,000-26,000,” he added.\n\nEther fell 3.48% in the past 24 hours to trade at US$1,757, falling below US$1,800 for the second time this week.\n\nThe Beacon Chain of the Ethereum Network briefly stopped validating transactions on early Friday morning, with Ethereum developers tweeting later that the outage had been resolved and the cause still under investigation.\n\nThe XRP token was the only one in the green, inching up 0.75% to US$0.4271.\n\nThe global crypto market capitalization fell 2.81% to US$1.1 trillion, while the total crypto market volume decreased 9.30% to US$42.22 billion in the last 24 hours.\n\nNFTs sales on Ethereum fall\n\nIn the NFT market, the Forkast 500 NFT index decreased 2.21% to 3,363.89 points in the 24 hours to 4:30 p.m. in Hong Kong and declined 7.77% during the week.\n\nNFT trading is slowing due to the recent memecoin hype, with very few new users entering the space, according to Eric Dettman, NFT advisor at CryptoSlam. NFT buyers on the Ethereum blockchain totaled 45,298 in the past seven days, a drop of 72.97%.\n\n24-hour NFT sales on Ethereum dropped 51.7% to US$16.3 million, after yesterday’s strong session. Sales for the Bored Ape Yacht Club, the largest Ethereum-native NFT collection, fell 60.02% to US$2.4 million, while sales for the Mutant Ape Yacht Club also decreased 61.78% to US$1.4 million. 24-hour sales for Milady Maker dropped 88.83% to US$864,000, after generating over US$9.6 million of sales for the network on Thursday.\n\nAs for the day’s most notable NFT transactions, Bored Ape #6805 sold for US$349,967 3 hours ago and CryptoPunk #1232 sold for US$148,324 8 hours ago, according to CryptoSlam data.\n\nMost Asian equities fall; U.S. futures rise for second consecutive session\n\nAsian equities declined on Friday, tracking losses on Wall Street, except for Japan’s Nikkei 225 that rose 0.9%. The Shanghai Composite dropped 1.12%, Hong Kong’s Hang Seng Index fell 0.59% and the Shenzhen Component Index declined 1.23%\n\nInvestors reacted negatively to government data showing that Hong Kong’s economy grew 2.7% year-on-year in the first quarter, recovering from a 4.1% contraction in the previous quarter, accounting for a lower Hang Seng Index on the day. The expansion was Hong Kong’s first economic upturn since the fourth quarter of 2022, mainly supported by a recovery in the tourism sector and domestic demand\n\nU.S. stock futures strengthened for a second consecutive trading session, after consumer prices eased more than expected in April and bolstered expectations that the Federal Reserve will pause interest rate hikes.\n\nOvernight, U.S. jobless claims increased, adding to market concern of a potential recession, with the job market as one of the pillars that prop up the economy.\n\nThe S&P 500 futures index rose 0.39%, the tech-heavy Nasdaq-100 futures gained 0.22% and the Dow Jones Industrial Average futures increased 0.41%.\n\nThe U.S. dollar index inched up 0.06% to 102.1 points, set for its first weekly gain in three weeks. The euro inched down 0.07% to US$1.09, the lowest value in three weeks.\n\nPresident Joe Biden is set to continue negotiations to raise the debt ceiling later today, to keep the U.S. government solvent. Wednesday’s talks over the matter ended with no deal in sight.\n\nThe Bank of England raised interest rates by 25 basis points on Thursday, marking its 12th consecutive hike, increasing borrowing costs to 4.5% – the highest since October 2008.\n\nLondon’s benchmark FTSE 100 rose 0.47% on Friday, after three consecutive sessions of losses, after data showed that the UK’s economy expanded 0.1% in the first quarter of the year, in line with market expectations.\n\nSee related article: Crypto and NFT Market Update – May 11th"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdGhlLTIwMjQtcHJlc2lkZW50aWFsLWVsZWN0aW9uLWNvdWxkLW1ha2Utb3ItYnJlYWstYml0Y29pbi1pbi10aGUtdS5zLtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "The 2024 Presidential Election Could Make Or Break Bitcoin In The U.S. - Nasdaq",
        "content": "This is an opinion editorial by Robert Hall, a content creator and small business owner.\n\nThe race for the 2024 U.S. presidential election is starting to kick into gear, featuring some of the same cast of characters from the last few elections. On the Democratic side, you have Joe Biden, Robert F. Kennedy and Marianne Williamson suggesting they will run. Then, Former President Donald Trump, Nikki Haley, Ron DeSantis and Vivek Ramaswamy are on the other side of the aisle.\n\nIf you have been following the race so far, you might know that Trump seems to be walking away with the nomination before the process even starts next year. If he ends up being the nominee, we will likely get a re-run of 2020, where we have two men over 70 years old who both think that they know what is right for the country. Who else is tired of having baby boomers running the show? I am, to be honest.\n\nBoomer Presidents Don’t Understand Bitcoin\n\nBaby boomers, you’ve had their time in the sun. It’s time to leave the stage and let the younger generations of leaders have a chance to lead the country. We need leaders who understand the emerging challenges facing America as we speak.\n\nWe need leaders who thoroughly understand economic policy and the value of innovation in the financial space. For instance, the baby boomers at the top of the ticket don’t have the depth or the capacity to understand the once-in-a-lifetime opportunity that Bitcoin presents to America and the American people.\n\nBiden and Trump have been openly hostile towards Bitcoin because they believe in the supremacy of the fiat dollar system. The time is now to elect someone with a bold vision for the future, who understands that the way that the entitlement systems are set up and the dollar's role in the world isn’t sustainable over the long term.\n\nIf America stays on its current path, it will only lead to chaos, lawlessness, and a lower standard of living for everyone. Is this the future that you want for your children and grandchildren? 2024 is our chance to start a new journey toward freedom, the rule of law and the opportunity to make something of yourself, regardless of your station in life.\n\nWhy We Need A Bitcoiner As President\n\nIt has been reported recently that the mayor of Miami, Francis Suarez, is close to a decision on whether to run for president next year. For those who don’t know him, he is one of the most pro-Bitcoin politicians in the country. He has actively courted Bitcoiners to come to Miami and help make it the Bitcoin capital of the world. So far, he has largely succeeded in doing that.\n\nBut in addition to making the U.S. an epicenter for Bitcoin innovation, having a Bitcoiner like Suarez as president will, critically, stop the emergence of a central bank digital currency (CBDC) in America dead in its tracks. If Biden or Trump is elected, it is almost certain that some form of CBDC will be activated in America. With the deployment of a CBDC, you can kiss your financial freedom goodbye. You can kiss your privacy goodbye.\n\nYou will no longer have autonomy over what you can eat or how far you can travel. You will have a social credit score, as has been implemented in China. Is this the type of life that you want? We have to strive for a better life.\n\nJust recently, the rails for a CBDC were introduced to the public. FedNow, as it is called, will be operational by July 2023. It is said that it will be used to speed up payments between customers and businesses, which may be accurate at the moment. However, as with any system, it will likely evolve into something vastly different than what it was intended to be.\n\nCan we really trust a government that has given us the Patriot Act, PRISM and now the proposed RESTRICT Act to resist total control over what you spend your money on?\n\nThe RESTRICT Act, for instance, put forth by none other than Bitcoin-hating Senator Elizabeth Warren, has the potential to harm Bitcoiners in the United States with its overly-broad language about digital communication tools being a threat to national security. While the overt target may be TikTok, nothing is stopping regulators from using this law against Bitcoin in the future.\n\nLooking past this smokescreen, you can see that they are building their case to the public: Hilary Clinton, international regulators and the U.S. Treasury have all warned about the dangers of cryptocurrency.\n\nNow, put this in the context of $31 trillion in U.S. national debt, unsustainable entitlement spending, a world slowly moving away from the dollar, high gas prices and uncontrollable inflation. Then it becomes clear that they will close off the exits to Bitcoin before most people learn about how to use them. They want to herd the masses into a CBDC for a “great reset” of the monetary system. This is coming if we don’t start electing people who understand that Bitcoin is our last chance to escape a sinking ship.\n\nMayor Saurez gets it, and if any other politicians in America understand Bitcoin, it is time that we support them and get more Bitcoiners in office. The dollar is the Titanic, and Bitcoin is the lifeboat. Will enough people get on to be saved? Time will tell and the upcoming presidential election could be a final chance.\n\nThis is a guest post by Robert Hall. Opinions expressed are entirely their own and do not necessarily reflect those of BTC Inc or Bitcoin Magazine.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRpdmUtbGlxdWlkYXRlcy0xMDBtLWJ0Yy1mdXR1cmVzLXRyYWRlcnMtYnVsbGlzaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin's dive under $27K liquidates $100M — So why aren't margin traders flipping bearish? - Cointelegraph",
        "content": "Bitcoin’s price (BTC) broke below its 55-day support at $27,000 on May 12. As a result, the two-day, 7% correction to $26,155 caused $100 million worth of long BTC futures contracts to be liquidated.\n\nHowever, Bitcoin margin and futures markets displayed strength during the down-move, fueling hope of a recovery toward $28,000.\n\nRegulatory pressure, stronger U.S. dollar bite\n\nRegulatory uncertainty in the United States significantly increased after Bitcoin miner Marathon Digital received another subpoena. The publicly traded mining company informed investors on May 10 that it received a subpoena from the U.S. Securities and Exchange Commission (SEC) concerning whether it may have violated federal securities laws, among other things, by using related-party transactions.\n\nFurthermore, there’s the additional risk of the 627,522 Bitcoin held by the Grayscale Bitcoin Trust, which has been trading at a steep discount for over a year as Grayscale’s holding company, Digital Currency Group (DCG), struggles with some failing subsidiaries. DCG’s crypto lending and trading firm, Genesis Capital, filed for Chapter 11 bankruptcy protection in January.\n\nDespite having separate corporate structures, Genesis had “intercompany obligations” with holding company DCG, so the consequences for the administration of the Grayscale funds are unknown. Additionally, the group reportedly owes Gemini’s clients about $900 million, and the U.S. SEC charged Genesis and Gemini in January.\n\nBitcoin’s 7.2% correction happened as the U.S. Dollar Strength Index (DXY), which measures the U.S. currency against a basket of foreign exchanges, displayed strength. The indicator reached 101 on May 8, nearing its 12-month low, a sign of low confidence in the government’s ability to curb inflation while simultaneously managing to increase the debt limit.\n\nHistorically, there has been an inverse correlation between the DXY index and risk-on assets such as Bitcoin, given that a weaker dollar tends to drive demand for alternative stores of value and scarce assets.\n\nLet’s look at derivatives metrics to better understand how professional traders are positioned in the current market environment.\n\nBitcoin margin market traders slightly less optimistic\n\nMargin markets provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.\n\nOKX, for instance, provides a margin lending indicator based on the stablecoin/BTC ratio. Traders can increase their exposure by borrowing stablecoins to buy Bitcoin. On the other hand, Bitcoin borrowers can only bet on the decline of the cryptocurrency’s price.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe above chart shows that OKX traders’ margin lending ratio decreased between May 8 and May 11. Still, that is not concerning, given that those traders remain favoring bullish strategies as the stablecoin (long) demand currently surpasses the BTC (short) demand by a factor of 18, which is healthy.\n\nRelated: Texas votes to add crypto to state’s Bill of Rights\n\nNo signs of panic selling after Bitcoin price crash\n\nTo exclude externalities that might have solely impacted the margin markets, traders should analyze the long-to-short metric. The metric gathers data from exchange clients’ positions on spot, perpetual, and quarterly futures contracts, thus offering better information on how pro traders are positioned.\n\nThere are occasional methodological discrepancies between different exchanges, so readers should monitor changes instead of absolute figures.\n\nExchanges’ top traders Bitcoin long-to-short ratio. Source: Coinglass\n\nEven though Bitcoin broke below the $28,000 support, professional traders have increased their leveraged long positions using futures, according to the long-to-short indicator.\n\nAt crypto exchange OKX, the long-to-short ratio increased from 0.92 on May 8 to 1.01 on May 12. Meanwhile, at Binance, the long-to-short ratio stabilized at 1.13, indicating there was no shift to a bearish position from whales and market makers.\n\nTherefore, despite the 12% price decline from a high of $29,865 on May 6, traders using margin and futures contracts did not abandon their bullish stance. The movement indicates confidence that Bitcoin is more likely to reclaim $28,000 than succumb to the next support level near $24,500.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kb24tdC1zaG9ydC13aGVuLWl0LXMtZGFyay1ncmVlbi1ob3ctdG8tdHJhZGUtdGhlLTIwMjQtYml0Y29pbi1oYWx2aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "'Don't short when it's dark green': How to trade the 2024 Bitcoin halving - Cointelegraph",
        "content": "Bitcoin (BTC) is entering prime “buy the dip” territory as the clock ticks down to the 2024 block subsidy halving.\n\nThat is the conclusion of several well-known market participants this month, with Bitcoin just one year away from its “very interesting” next halving.\n\nBitcoin vs. the halving: Time to buy?\n\nBitcoin halving cycles are known to follow patterns when it comes to price activity in a given period.\n\nThese four-year “epochs” have so far contained a macro high and macro low for BTC price, with those events likewise four years apart from one another.\n\nWhat’s more, in each cycle, the macro low has tended to occur a little over one year before the next halving. For longtime Bitcoin figures, including crypto media guru Pete Rizzo, there is thus little reason to believe that the future will be substantially different.\n\n“A small reminder the world’s most valuable money is only designed to get more scarce. Plan accordingly,” he wrote in part of a tweet on May 12.\n\nRizzo was celebrating the three-year anniversary of the 2020 halving, and an accompanying chart underscored BTC price behavior relative to how many months remained before a halving event.\n\nBTC/USD monthly chart with time to halvings marked. Source: Pete Rizzo/Twitter\n\nCommenting, investor and entrepreneur Alistair Milne went further, suggesting that for those looking to profit from BTC exposure, the time to buy is now, while the months before the halving are less beneficial entry points.\n\n“Don’t short when it’s dark green and be all in before it’s blue…,” he summarized the chart’s contents.\n\nPlanB: 2024 halving “not priced in”\n\nEarlier in the month, meanwhile, another popular yet controversial Bitcoin industry figure used the same halving narrative to insist that the price cycles were not a matter of chance.\n\nRelated: Bitcoin Halving: How it works and why it matters\n\nIn a post of his own, PlanB, the pseudonymous creator of the Stock-to-Flow (S2F) family of Bitcoin price forecasting models, claimed that half of market participants considered the relationship between halvings and price was random.\n\nHis comments came within the context of how halvings relate to S2F, a theory that itself continues to see widespread criticism as a result of missed price targets from 2021 onward.\n\nNevertheless, for PlanB, too, BTC/USD remains low, with the upcoming halving not yet given sufficient market appreciation.\n\n“Why is bitcoin S2F/halving not priced in? Because ~50% thinks the BTC price jumps after last 3 halvings (red) are a coincidence,” he wrote alongside an illustrative chart.\n\n“Halvings are key to S2F, but these critics focus on auto-correlation between halvings and conclude there is no relation between S2F/halvings and price. I disagree, obviously. 2024 halving will be very interesting!”\n\nBitcoin Stock-to-Flow chart. Source: PlanB/Twitter\n\nIn a subsequent discussion, PlanB called the idea of Bitcoin price increasing as halvings decrease available supply, or “flow,” a “no-brainer.”\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xNDAwNTgvYW5jaWVudC1iaXRjb2luLWNoYW5nZXMtd2FsbGV0cy1hZnRlci0xMi15ZWFycy1kb3JtYW500gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MDA1OC9hbmNpZW50LWJpdGNvaW4tY2hhbmdlcy13YWxsZXRzLWFmdGVyLTEyLXllYXJzLWRvcm1hbnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "‘Ancient’ Bitcoin Changes Wallets After 12 Years Dormant - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAsleep for ages, more sats wake from years of slumber.\n\nBitcoin bought in 2011 came back to life on Thursday, when 139 Bitcoin belonging to address 1H1Ab6 moved into a newly created Segwit address.\n\nThe owner—who hodled for nearly twelve years–bought the coins in June 2011 for a bit over $2,250 dollars, only to see them grow into a staggering $3.5 million at bitcoin’s current price mark.\n\nAD\n\nAD\n\nThese coins belong to what’s known as Ancient Supply, which refers to Bitcoin purchased at least 7 years ago, although some analysts use 5 years as their base date.\n\nThis year has seen a significant amount of movement from ancient Bitcoin, with 3,200 BTC reviving—1,100 of which pre-date 2013, according to a report from Glassnode.\n\nSpurring the curiosity of many, the market saw a truly ancient wallet—created in October 2010 when the price was an obscene $0.19 USD—sell off 429 Bitcoins in March last year. A year later, in February 2023, another Satoshi-era address moved 412 Bitcoin worth $9.6 million dollars after more than a decade.\n\nIt's hard to tell whether these owners' convictions have changed and whether these movements are related to the selling of the coins or simply personal custodial practice. Given Bitcoin’s pseudonymous nature, we might never really know who these ancient coins belong to or what they are doing with them–especially when thinking of Satoshi’s stash, which is said to sit at 5% of the total supply.\n\nGlassnode does offer some insight, however. According to the on-chain analytics provider, dormant coins become increasingly unlikely to sell after 155 days, although when these are sold, they could signal a change in conviction. A recent newsletter by the company did show that the number of Bitcoin held long term is growing by 100,000 BTC per month.\n\nAD\n\nAD\n\nDespite yesterday’s move, and the sporadic satoshi-era spending, many consider the majority of Bitcoin’s ancient supply—4.25 million of which only 356,000 have ever been spent—to be lost forever."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcmRpbmFscy1hbmQtYnJjLTIwLXdpbGwtZGlzYXBwZWFyLWluLW1vbnRocy1qYW4zLWNlby1zYXlz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "Ordinals and BRC-20 will disappear in a matter of months, says Jan3 CEO - Cointelegraph",
        "content": "The latest hype around Bitcoin Ordinals and BRC-20 tokens is unsustainable and will fade away in a matter of months, according to Jan3 CEO Samson Mow.\n\n“These guys are basically paying massive amounts of fees that go directly to Bitcoin miners, and there is no way this can be sustained,“ Mow said in an exclusive interview with Cointelegraph.\n\n“They will fade away after even months, let’s not talk about years here,” he continued.\n\nGrowing activity around Ordinals and BRC-20 — a crypto technology that allows users to mint fungible and nonfungible tokens on the Bitcoin blockchain — is the main cause provoking a spike in transaction fees, which resulted in the congestion of the Bitcoin network.\n\nRelated: Bitcoin BRC-20 token standard becomes new destination for meme tokens\n\nWhile many members of the Bitcoin community see Ordinals as a use case that could boost Bitcoin (BTC) adoption, Mow considers them just as spam clogging the network.\n\n“These are just short-term money grabs similar to most things on competing chains like Ethereum and Solana,” he pointed out.\n\nTo Mow, mass adoption of Bitcoin will happen because of its use case as a saving technology and as a means of exchange, not because of “people minting JPGs and sticking them in the chain.”\n\nTo learn more about Mow’s argument against Ordinals, watch the full interview on our YouTube channel. Don’t forget to subscribe!\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvY29pbmJhc2Utc2NyZXdzLXVwLWZsb3JpZGEtYmFucy1jYmRjcy1hbmQtb3JkaW5hbHMtZmFjZS1jb250cm92ZXJzeS1ob2RsZXJzLWRpZ2VzdC1tYXktNy0xMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "Coinbase screws up, Florida bans CBDCs, and Ordinals face controversy: Hodler's Digest, May 7-13 - Cointelegraph",
        "content": "Top Stories This Week\n\nCoinbase calls Pepe a ‘hate symbol,’ prompting calls to boycott the exchange\n\nAn email sent out to Coinbase customers describing the Pepe the Frog meme as a “hate symbol” co-opted by alt-right groups has drawn significant ire from the PEPE memecoin community this week. Two hours after the email was sent, the hashtag “#deletecoinbase” hit the trending sidebar on Twitter, with over 14,000 comments calling on users to boycott the exchange. Paul Grewal, the Coinbase’s chief legal officer, took to Twitter to respond to the outrage and apologized: “We screwed up and we are sorry.”\n\nFlorida governor signs CBDC bill into law, restricting some uses of US and foreign CBDCs\n\nUnited State’s Florida Governor Ron DeSantis signed a bill restricting the use of central bank digital currencies (CBDCs) in the state. The new law prohibits the use of a United States federal CBDC “as money within Florida’s Uniform Commercial Code (UCC).” It also bans the use of CBDCs issued by foreign governments and calls on other states to use their commercial codes to institute similar prohibitions. DeSantis said he was spurred into action by White House studies of the new financial technology. The law takes effect on July 1.\n\nMilady memecoin surges 5,250% after Musk tweet, exchange listings\n\nMilady (LADYS), the self-organized memecoin based on the anime avatar NFT collection of the same name, surged by over 5,250% on May 11 after Elon Musk tweeted a meme using the imagery of a Milady NFT. The tweet also boosted the collection’s average sale price. “LADYS is a meme coin without any intrinsic value or expectation of financial return. There is no formal team or roadmap,” said the token developers. “The coin is completely useless and for entertainment purposes only.”\n\nOrdinals good or bad for Bitcoin? Supporters and opposers raise voices\n\nBitcoin Ordinals continue to inspire debate among the Bitcoin community. Soon after their introduction in January 2023, opponents of the technology began to raise concerns about its perceived flaws, citing slow speeds and rising transaction costs. Meanwhile, its supporters claim that the ordinals provide more opportunity, improve decentralization and ensure freedom of expression. The technology enables adding text, images and code on a satoshi — the smallest unit of Bitcoin.\n\nTo catch a scammer: Kraken builds fake crypto account to ‘bait’ fraudsters\n\nCrypto exchange Kraken has provided a novel method for flagging malicious wallets — building a fake crypto environment to “scam bait” bad actors. Kraken created the “custom environment” for popular streamer Kitboga to frustrate a scammer posing as U.S. President Joe Biden. The punchline comes when Kitboga, who portrays an elderly person with a $450,000 balance in Bitcoin, infuriates the scammer after incorrectly typing his wallet address before sending over all of the funds.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $26,707, Ether (ETH) at $1,803 and XRP at $0.43. The total market cap is at $1.12 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Kava (KAVA) at 15.28%, Bitcoin SV (BSV) at 5.19% and PAX Gold (PAXG) at 0.20%.\n\nThe top three altcoin losers of the week are Pepe (PEPE) at -54.43%, PancakeSwap (CAKE) at -27.15% and WOO Network (WOO) -24.48%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“A blanket pause on AI’s training, together with existing trends that seem to be de-prioritizing investment in industry AI ethics efforts, will only lead to additional harm and setbacks.”\n\nChristina Montgomery, chief privacy and trust officer at IBM\n\n“The tokenization of real-world assets may offer an unprecedented opportunity to create new market infrastructure and drive efficiency in the trading of products across the globe.”\n\nCathy Clay, executive vice president, global digital and data solutions at Cboe Global Markets\n\n“The metaverse is dead! Let’s organize an online wake so that we 600,000,000 monthly active users in Fortnite, Minecraft, Roblox, PUBG Mobile, Sandbox, and VRChat can mourn its passing together in real-time 3D.”\n\nTim Sweeney, CEO of Epic Games\n\n“We screwed up and we are sorry [about comments regarding Pepe the Frog].”\n\nPaul Grewal, chief legal officer at Coinbase\n\n“People are actually adopting [crypto] inside of their portfolios. Whether you’re talking about the retail side, high net worth or institutional investors, everyone’s looking at their portfolios and trying to get that type of exposure.”\n\nNeil Tan, chair of the FinTech Association of Hong Kong\n\n“The key lessons learned from the Terra LUNA crash include proper diligence. Doing due diligence on each project would save potential investors future heartache.”\n\nObinna Uche Uzoije, Twitter analyst\n\nPrediction of the Week\n\nBitcoin enters $26K ‘bearadise’ as BTC price approaches 2-month lows\n\nBitcoin neared two-month lows on May 12 amid fears that a “head-and-shoulders” pattern would put bears ahead.\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching $26,100 on Bitstamp — its lowest since March 17. Despite encouraging macroeconomic conditions for risk assets, Bitcoin failed to capitalize on the potential for gains as bid liquidity headed lower.\n\nThis “head-and-shoulders pattern” would create a negative precedent if confirmed. “We simply cannot let the #Bitcoin head and shoulders crowd win,” said pseudonymous financial commentator Tedtalksmacro, before adding that if Bitcoin climbs back above $27k things could get “very interesting.”\n\nFUD of the Week\n\nPepe memecoin frenzy gets unwanted attention from scammers\n\nBad actors have taken notice of the hype surrounding the Pepe memecoin, resulting in scam attempts that now plague the crypto community. According to blockchain security firm PeckShield, at least 10 memecoin scams have been created over the past few days. The firm reported scam tokens that recently had their liquidity removed, rug-pulling investors. Fake Pepe claim sites are also starting to become increasingly common on Twitter.\n\n‘Bitcoin is not under attack:’ BTC maxis allay fears of a DoS offensive\n\nA sudden rise in Bitcoin transaction fees and unconfirmed transactions sparked concern on Crypto Twitter over the week about a potential denial-of-service attack on the network. Bitcoin average transaction fees were at $19.20 on May 8, according to BitInfoCharts, while the backlog of transactions stood at 459,341 on the same day. The increased demand on the network has even caused total fees per block to temporarily exceed the block subsidy reward of 6.25 BTC. Bitcoin analysts and commentators have rushed to allay community fears.\n\nParaSpace team clashes with CEO over alleged whereabouts of protocol funds\n\nNFT protocol ParaSpace published several alleged irregularities tying its CEO Yubo Ruan to mismanagement of funds equaling 2,909 Ether. The funds had previously been stolen during a hack, but were later recovered thanks to white hats. Ruan, however, returned only a portion of the funds to the protocol treasury. ParaSpace employees have now taken full control of the protocol and are calling on Ruan to step down. The CEO denied any wrongdoing.\n\nBest Cointelegraph Features\n\nCryptocurrency trading addiction: What to look out for and how it is treated\n\nTreatment centers are seeing an uptick in clients struggling with cryptocurrency addiction. Although the symptoms are not difficult to spot, some crypto traders may not even be aware of what’s troubling them.\n\n$3.4B of Bitcoin in a popcorn tin: The Silk Road hacker’s story\n\nThe Silk Road hacker lived the high life for a decade with his stolen billions — but was caught due to a transfer of pocket change.\n\nWilliam Clemente III tips Bitcoin will hit six figures toward end of 2024: Hall of Flame\n\nWill Clemente III ditched school to become a crypto analyst and says Bitcoin has a strong chance of hitting six figures toward the end of 2024."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvLm5ld3Mvb3JkaW5hbHMtZXhwbGFpbmVkLW5ldy1lcmEtb2YtbmZ0cy1vbi1iaXRjb2luLW5ldHdvcmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ordinals explained: New era of NFTs on Bitcoin network? - crypto.news",
        "content": "The Bitcoin (BTC) network is witnessing a paradigm shift as ordinals, an advanced breed of non-fungible tokens (NFTs), rapidly gain traction within the crypto sphere. April 2023 saw the daily ordinals inscriptions record smashed several times, illustrating the escalating curiosity surrounding these digital assets. While ordinals may create new opportunities for the Bitcoin network, skeptics raise concerns about potential negative consequences.\n\nOrdinals, a class of digital assets closely related to non-fungible tokens (NFTs), are inscribed onto satoshis, the smallest denomination of bitcoin. In April, ordinals experienced a surge in popularity, accounting for a significant portion of the network fees.\n\nhttps://twitter.com/CryptoNikyous/status/1656248837986746368?s=20\n\nIn May 2023, the cumulative fees paid for ordinals over time have reached an astounding $300 million, with the majority of this expenditure occurring between April and May.\n\nOrdinals fees paid over time (Source: Dune Analytics)\n\nOrdinals gained prominence after the Taproot upgrade, which facilitated improved transaction management, privacy, and reduced transactions costs.\n\nHow do ordinals work?\n\nTo truly understand ordinals, we need to talk about satoshis. Named after bitcoin’s founder, Satoshi Nakamoto, a satoshi is the smallest fraction of bitcoin – one hundred millionth of a bitcoin, to be precise.\n\nWhat’s interesting about satoshis is that each carries a unique number, determined by the order in which it was mined. This unique number, or “ordinal,” is what gives each satoshi its identity.\n\nThink of satoshis as tiny digital canvases, each with a unique identifying number. Now, when you “inscribe” these satoshis with data – text, images, audio, or more – they transform into unique digital assets, which can be used in numerous applications, from games to artworks.\n\nInscription is a process of storing information on the blockchain, reflecting ownership of digital objects. When a transaction is confirmed by bitcoin miners and added to the blockchain, it’s as good as etched in stone – it becomes immutable proof of ownership.\n\nWhen you inscribe data on the Bitcoin blockchain, it gets associated with a particular satoshi, much like marking a personal item with your name. This marked satoshi then allows the transfer and assignment of ownership of that on-chain data or inscription.\n\nSo, in a nutshell, ordinals are like digital stamps, unique and secured on the Bitcoin blockchain. Using an open, permissionless protocol, you can use ordinals to create your own digital assets, owning, selling, and transferring them as you wish.\n\nNFTs vs. Bitcoin ordinals\n\nThe primary distinction between conventional NFTs and Bitcoin ordinals stems from their foundational infrastructure.\n\nYou might also like: Over 225,000 bitcoin transactions are unconfirmed as Ordinals bloat mempool\n\nTraditional NFTs, often built on Ethereum (ETH) or alternative blockchains, operate on separate layers from their base networks and frequently employ smart contracts to enable creation and transfer.\n\nBoth NFTs and ordinals function as distinctive digital assets with provable scarcity. However, what sets ordinals apart is their direct integration with the Bitcoin network, which means they share bitcoin’s security and immutability.\n\nThat said, there’s a flip side to this coin. The integration of ordinals with Bitcoin might lead to network clogging and a spike in transaction costs.\n\nYou might also like: Ordinals and meme coins cripple Bitcoin network, core developer claims\n\nThis has ignited a debate over the long-term feasibility and impact of ordinals.\n\nhttps://twitter.com/avaxbuildr/status/1655129967586320385?s=20\n\nAdvocates argue that ordinals add value by creating new use cases for the network. Conversely, critics contend that ordinals consume precious block space and inflate network fees, contradicting Bitcoin’s fundamental principles.\n\nThere are so many people advocating for an increase of the #Bitcoin block size limit to fit Ordinals inscription data and lower transaction fees.\n\n\n\nThese people probably just haven't been here long enough to know that an increase in block size was already attempted in 2017. The… pic.twitter.com/X7I1MMmouQ — Mark Harvey (@thepowerfulHRV) May 8, 2023\n\nCreating ordinals: in-house and third-party approaches\n\nThere are two approaches to creating an ordinal on the Bitcoin network: establishing an ordinals wallet and following a specific procedure or utilizing a third-party Bitcoin NFT marketplace.\n\nThe first method involves downloading Bitcoin Core, syncing the node to the blockchain, and sending satoshis to an ordinals wallet. For an in-depth guide, users can consult the Inscriptions handbook provided by the creators of the first ordinal.\n\nAlternatively, a more straightforward method involves minting an ordinal via reputable Bitcoin NFT marketplaces like Gamma, which operate similarly to Ethereum-based NFT marketplaces such as OpenSea or Magic Eden.\n\nThe growth of ordinals and its implications\n\nThe ordinals ecosystem has experienced exponential growth since its inception, with over 5 million inscriptions recorded as of May 12, 2023, as per Dune Research data.\n\nOrdinals inscriptions over time (Source: Dune Analytics)\n\nThis surge is primarily attributed to the widespread adoption of the Taproot soft fork, which has reached new all-time highs in adoption and utilization.\n\nIf you're looking to make it:\n\n\n\n* Taproot adoption is at ATH\n\n* Taproot makes it simple to productize #BTC blockspace into any protocol\n\n* People will build on #BTC\n\n* We'll see massive demand for #BTC blockspace\n\n* This blockspace will have to be sold\n\n* BRC-20s like $VMPX will pump https://t.co/DrWumi9TGp pic.twitter.com/cUR2kNOPjo — Halloween 2008 (@HalloweenIn2008) May 8, 2023\n\nConsequently, average block size and network fees have increased lately, highlighting the potential and challenges posed by the burgeoning popularity of ordinals.\n\nBTC average block size (Source: YCharts)\n\nThe environmental impact of ordinals\n\nCryptocurrencies, particularly those using proof-of-work (PoW) consensus algorithms like bitcoin, have long been a subject of environmental contention.\n\nOrdinals have rekindled the debate surrounding the Bitcoin network’s energy consumption. With a rise in transactions and demand for block space, ordinals contribute to the network’s overall energy usage.\n\nCritics argue that the environmental impact of ordinals is an unnecessary burden, given that alternative blockchain networks, such as Ethereum, have transitioned to more energy-efficient consensus algorithms like proof-of-stake (PoS).\n\nHowever, ordinals’ supporters stress the importance of leveraging the robust security and decentralization provided by the Bitcoin network, which they infer outweighs environmental concerns.\n\nMICHAEL SAYLOR‼️ Ordinals are a catalyst for #Bitcoin adoption. pic.twitter.com/SgHYH23ZOr — Bitcoin Archive (@BTC_Archive) May 10, 2023\n\nLegal and regulatory challenges\n\nLike other digital assets, ordinals may face regulatory scrutiny. Governments worldwide have adopted varied approaches to regulating cryptocurrencies and NFTs, with similar expectations for ordinals.\n\nIn some jurisdictions, ordinals may be considered digital property subject to taxation, while in others, they may face stringent regulations and restrictions, only time will tell.\n\nAs the legal landscape surrounding digital assets evolves, it is crucial for ordinals creators and users to stay informed about changing regulations and ensure compliance with applicable laws.\n\nFuture of ordinals\n\nAs ordinals continue to gain popularity, their use cases and applications are likely to extend beyond digital art and collectibles.\n\nBitcoin Ordinals are not a \"fad.\"\n\n\n\nThey cleared the cupcake phase of attention for me. It was the right time to jump in and besides my trust in ZK’s insight, what the brand had to offer was more than just one person.\n\n\n\n▸Brand Alignment\n\n▸Marketing\n\n▸Community — Minh (@MINHxDYNASTY) May 3, 2023\n\nIndustries such as gaming, real estate, and intellectual property could benefit from the properties of ordinals, opening up new possibilities for the Bitcoin ecosystem.\n\nOngoing developments in the Bitcoin space, including Lightning Network upgrades and potential protocol enhancements, could alleviate some concerns surrounding network congestion and scalability. This, in turn, could pave the way for broader adoption and acceptance of ordinals in the future.\n\nFAQs\n\nWhat are ordinals? Ordinals are non-fungible tokens (NFTs) built on the Bitcoin network. They enable the creation, ownership, and transfer of unique digital assets, such as digital art, collectibles, and other forms of digital property. How are ordinals different from traditional NFTs? While the core concept of representing unique digital assets remains the same, ordinals are built on the Bitcoin network, leveraging its security and decentralized nature. Traditional NFTs, on the other hand, are predominantly built on Ethereum or other blockchain networks. What are the use cases for ordinals? Besides digital art and collectibles, ordinals have the potential to be utilized in various industries, including gaming, real estate, intellectual property, and even supply chain management, as a means of verifying authenticity and provenance. How do ordinals impact the Bitcoin network? As demand for ordinals increases, the competition for block space on the Bitcoin network can lead to higher transaction fees and longer confirmation times. However, ongoing developments like the Lightning Network and other protocol improvements may help address these issues in the future. Are ordinals environmentally friendly? The environmental impact of ordinals is a topic of debate, as they contribute to the overall energy consumption of the Bitcoin network, which uses the energy-intensive proof-of-work (PoW) consensus algorithm. Critics argue that more energy-efficient alternatives like proof-of-stake (PoS) should be pursued instead. However, proponents emphasize the security and decentralization benefits provided by the Bitcoin network. What is the future of ordinals? The future of ordinals is uncertain, with potential for growth in various industries and the possibility of technological advancements addressing current limitations. As the crypto ecosystem continues to evolve, the true potential of ordinals and their role in the world of digital assets will gradually become clearer.\n\nFollow Us on Google News"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWVudGVycy0yNmstYmVhcmFkaXNlLWFzLWJ0Yy1wcmljZS1hcHByb2FjaGVzLTItbW9udGgtbG93c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin enters $26K 'bearadise' as BTC price approaches 2-month lows - Cointelegraph",
        "content": "Bitcoin (BTC) neared two-month lows on May 12 amid fears that a “head-and-shoulders” pattern would put bears ahead.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalysis of BTC price: “Welcome to bearadise”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching $26,100 on Bitstamp — its lowest since March 17.\n\nDespite encouraging macroeconomic conditions for risk assets, Bitcoin failed to capitalize on the potential for gains as bid liquidity headed lower.\n\n“Welcome to bearadise,” on-chain monitoring resource Material Indicators summarized.\n\nA chart uploaded to Twitter the day before showed principal buy support now around $25,750, with BTC/USD eating liquidity higher overnight.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nOn daily timeframes, concerns among market participants thus focused on whether the pair would now stay lower after three local tops.\n\nThis “head-and-shoulders pattern,” now clearly visible on the chart, would create a negative precedent should it confirm.\n\n“We simply cannot let the #Bitcoin head and shoulders crowd win,” financial commentator Tedtalksmacro insisted.\n\n“Back above $27k things will get very interesting…”\n\nBTC/USD annotated chart with \"head and shoulders\" pattern marked. Source: Tedtalksmacro/ Twitter\n\nTrader and analyst Moustache meanwhile showed that it was already time for the key 200-week moving average (WMA) to receive a retest.\n\nA “make or break level,” the 200 WMA has served as support since mid-March.\n\n#Bitcoin (W)$BTC is currently testing the MA 200 (W). This line marked the bottom in 2015,2019 and 2020.\n\n\n\nAt the same time, $BTC is testing the middle line in the Gaussian Channel.\n\n\n\nThis is really strong support and a make it or break it level imo. pic.twitter.com/auzL125G1W — ⓗ (@el_crypto_prof) May 12, 2023\n\nAs Cointelegraph reported, multiple traders were already looking for a deeper retracement to $25,000 or lower.\n\n#BTC repeating same path\n\n\n\n25k$ seems to be the logical level everyone tends to spam the BUY button\n\n\n\nAnticipating pic.twitter.com/QUyYpOFahM — Mikybull Crypto (@MikybullCrypto) May 12, 2023\n\nThese included nominally bullish Jelle, who conceded on the day that Bitcoin may make a “last stab” at the $25,000 mark before reversing.\n\nHe noted that relative strength index (RSI) readings were not serving sellers well on low timeframes.\n\n“Bitcoin nuked straight through support, next major zone of interest is around 24-25k,” he tweeted.\n\n“RSI is failing to push into the extremes, suggesting sellers are getting exhausted. One last stab into 25k that gets quickly bought up, would make sense.”\n\nBTC/USD annotated 4-hour chart with RSI. Source: Jelle/ Twitter\n\nLongs get bolder as BTC price sinks\n\nMore confident that the worst losses would soon be over was analyst Philip Swift, co-founder of trading suite DecenTrader and creator of data resource LookIntoBitcoin.\n\nRelated: Bitcoin price can ‘easily’ hit $20K in next 4 months — Philip Swift\n\nIn a tweet, he noted that while the price has been falling, the long/short ratio has diverged, with long positions now prevalent.\n\nIm not convinced we have a major correction coming on this Bitcoin move down.\n\n\n\nNear term though it is interesting to note that the long/short ratio has been climbing as price has trended down. pic.twitter.com/sefGEi39CD — Philip Swift (@PositiveCrypto) May 12, 2023\n\nAdditional data from Coinglass put the long/short ratio at 58.7% long at the time of writing on May 12.\n\nBTC long/short ratio chart. Source: Coinglass\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8xMzk4NzcvYml0Y29pbi1saXF1aWRpdHktYmluYW5jZS1oYXMtbW9yZS10aGFuLWhhbHZlZC1zaW5jZS1mZWJydWFyeS1rYWlrb9IBY2h0dHBzOi8vZGVjcnlwdC5jby8xMzk4NzcvYml0Y29pbi1saXF1aWRpdHktYmluYW5jZS1oYXMtbW9yZS10aGFuLWhhbHZlZC1zaW5jZS1mZWJydWFyeS1rYWlrbz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Liquidity on Binance Has More Than Halved Since February: Kaiko - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBinance trading volumes and liquidity have been steadily declining in the first quarter of 2023 amid the spate of U.S. banking failures and after ending its zero-fee promotion.\n\nThe result?\n\nIt’s led to even more chop for the price of Bitcoin, Kaiko analyst Dessislava Aubert told Decrypt.\n\nAD\n\nAD\n\nAubert said that \"Overall, Bitcoin liquidity on Binance has more than halved relative to the start of February from around $45 million to $16 million in early May.\"\n\nThe primary reason for the decline in liquidity was the removal of Binance’s 10-month zero-fee promotion for 13 different BTC pairs, which also caused market makers to leave the platform.\n\nSpecifically, monthly trading volumes for the exchange’s most-traded pair, BTC-USDT, volume fell from $16 billion in March to $2 billion in April, said the Kaiko analyst.\n\nAubert added that the drying liquidity “has been more pronounced” after the spate of banking failures earlier this year. The collapse of two key on-ramps for the industry in Silvergate and Silicon Valley Bank also hit specific firms, including Ripple, Circle, Yuga Labs, and many others.\n\nBitcoin market liquidity and trading volume on Binance. Source: Kaiko.\n\nThe 1% market depth, a measure of liquidity calculated using the bids and asks within 1% of the mid-price, on Binance declined significantly after the banking failures.\n\nAD\n\nAD\n\nLow Bitcoin liquidity — So what?\n\nThe result of reduced liquidity and volumes on Binance has been increased volatility.\n\nKaiko’s intraday volatility metric for the 10-minute interval surged considerably around the time liquidity began dropping on Binance.\n\nBitcoin intraday volatility at 10-minute intervals. Source: Kaiko.\n\nLow-liquidity conditions mean thin order books on exchanges which provide room for wild price swings from large orders.\n\n“We have seen this with BTC's recent sudden price move which did not have a clear catalyst,” said Aubert. “Volatility is unlikely to go away especially after some larger market makers (Jane Street and Jump Crypto) revealed they were reducing down their crypto exposure.”\n\nNotably, Bitcoin’s price dropped this week despite favorable conditions such as a positive CPI report and market expectations largely inclined toward an interest rate cut in the future by the U.S. Federal Reserve.\n\nA low-interest rate environment enables cheaper debt in the economy which fuels a rise in speculative assets like Bitcoin.\n\nHowever, the asset failed to stage an uptrend likely due to poor liquidity."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmFpZXIub3JnL2FydGljbGUvY2VhLWRlc2VydmVzLWFuLWYtb24tYml0Y29pbi1taW5pbmctdGF4LWFuYWx5c2lzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "CEA Deserves an F on Bitcoin Mining Tax Analysis - AIER - Daily Economy News",
        "content": "On May 2, President Biden’s Council of Economic Advisers (CEA) released a statement describing a proposed Digital Asset Mining Excise (DAME) tax. The proposal would impose a tax on cryptomining equal to 30 percent of the electricity used in this activity. In outlining this proposal, the CEA displayed a great deal of ignorance about energy usage, bitcoin, and economic policy.\n\nFor starters, we should dispense with the term cryptomining. Bitcoin miners are the only people engaged in what the CEA deems cryptomining. The proposed rule is a tax on bitcoin mining.\n\nWhat is bitcoin mining?\n\nThe bitcoin network allows people to send the digital asset known as bitcoin to one another without any trusted third-party serving as an intermediary. These transactions are recorded on a digital ledger known as a blockchain. When one person wants to send bitcoin to another person, the transaction is broadcast to the network. “Miners” then compete to add blocks of these transactions to the ledger.\n\nThe mining process entails passing information about the block of transactions through a cryptographic hashing algorithm to generate an output of fixed-length. The first miner to find an output below a particular threshold value broadcasts its solution to the rest of the network. Other miners verify the solution, add the block of transactions to the blockchain, and start work on the next block of transactions. Although it is difficult to find an output below a particular threshold, it is easy to verify. This allows for decentralized maintenance of the ledger. Rather than relying on one individual or entity to maintain the ledger, the ledger is updated through the consensus of those on the network.\n\nProducing an appropriate hash and, hence, adding a block to the blockchain is random. Miners are essentially guessing solutions until one is found. They use specialized machines designed to guess solutions quickly. Since it is random, it is impossible to know ahead of time which miner will find the next block. The faster a machine can guess, the better the odds of success. But greater computational power is no guarantee of success.\n\nMiners have an incentive to maintain the ledger. Successfully mining a block of transactions comes with a block reward of newly issued bitcoin, and any transaction fees offered by users. The block reward is currently 6.25 bitcoin, which is worth roughly $175,000. (Eventually, around the year 2140, the block reward will cease and miners will only receive transaction fees. At that point, the supply of bitcoin will be fixed.)\n\nBitcoin mining is computationally intensive. But this computational intensity has a purpose. By making the mining process random, the settlement of bitcoin transactions is resistant to censorship. Since the next successful miner cannot be known ahead of time, there is no single party that gets to determine whether a transaction is valid, no individual or entity that can be threatened or punished to prevent adding a transaction to the ledger, and no single point of failure.\n\nBitcoin mining makes it possible to engage in electronic peer-to-peer transactions similar to the physical exchange of cash; to trade without the permission of some trusted third party. It is particularly valuable for people living under authoritarian regimes or under governments that impose strict capital controls.\n\nWhy does the CEA want to tax bitcoin mining?\n\nGiven the computational intensity involved in bitcoin mining, a number of people have expressed concerns about its environmental impact. According to the CEA, the DAME tax is motivated by the fact that bitcoin miners “do not have to pay for the full cost they impose on others, in the form of local environmental pollution, higher energy prices, and the impacts of increased greenhouse gas emissions on the climate.” They argue that imposing the tax will force bitcoin miners to internalize these costs.\n\nIn other words, the CEA is making an externality argument. While bitcoin mining benefits miners, the CEA says it imposes an additional cost — a negative externality — on third parties that miners do not take into account when deciding how much to mine. If so, miners will tend to mine too much and a tax on mining might be used to discourage them from doing so.\n\nThe CEA claims the externality comes in the form of an environmental cost. Bitcoin miners require electricity to operate, and the generation of electricity creates environmental costs.\n\nProblems with the CEA’s argument\n\nThe CEA’s argument fails on a number of counts. Consider first the externality. The careful reader will note that the source of the environmental cost is electricity generation, not bitcoin mining. If generating electricity imposes costs on third parties, then the externality argument implies that a tax should be placed on electricity generation. Taxing a particular type of electricity-using activity does not provide an incentive to reduce electricity. It provides an incentive to switch from the taxed electricity-using activity to other, untaxed, electricity-using activities.\n\nThe CEA implicitly assumes that a reduction in electricity used by bitcoin mining is a reduction in electricity generated. Even ignoring the prospect of switching from taxed to untaxed electricity-using activities, that’s not true. A lot of electricity production is wasted: the electricity is produced, but isn’t used. To the extent that bitcoin miners use electricity that would otherwise be wasted, reducing bitcoin mining will not reduce electricity generation. That’s unfortunate, since there is no social cost of mining bitcoin with wasted energy.\n\nIn some cases, there is even a social benefit to mining bitcoin with wasted energy. For example, stranded natural gas is typically burned, emitting methane in the process. Currently, people are purchasing this stranded natural gas and using it to generate electricity to power bitcoin miners. In doing so, they are limiting harmful methane emissions associated with flaring natural gas. In these cases, bitcoin mining generates a positive externality. Applying the CEA’s logic, this type of activity should be subsidized — not taxed.\n\nIn places like Texas, bitcoin mining is used as a way to balance the electrical grid. Bitcoin miners run when electricity usage (and therefore the price of electricity) is low. When electricity costs are high, the miners turn off and allow for other uses. The result is a more stable and predictable supply of electricity for ordinary users — another positive externality.\n\nThe ability of bitcoin mining to stabilize electricity supply can also be used to make green energy more effective, which the CEA fails to appreciate. Windmills and solar panels are capable of generating electricity, but they are intermittent sources: if the wind isn’t blowing or the sun isn’t shining, no electricity is generated. Furthermore, if the timing of electricity use does not line up with the times when the wind is blowing or the sun is shining, then some of the energy produced using green methods is wasted. This can make it hard to justify using these technologies to generate electricity at scale. By serving as a buyer of last resort, bitcoin mining can create the conditions under which these technologies can be used at scale to produce electricity — still another positive externality.\n\nMore generally, the CEA ignores the fact that all electricity is not generated from the same source. Windmills, natural gas, coal, and the natural flow of moving water can all be used to generate electricity. Each of these sources, however, produces a different degree of environmental costs in the production of electricity. By taxing a particular use case of electricity, the tax treats the environmental costs as identical across different methods of generating electricity.\n\nThis point is especially important when considering the global effects of the DAME tax. The DAME tax would make mining prohibitively expensive in the United States. By discouraging bitcoin mining in the US, the DAME tax would make bitcoin mining more profitable elsewhere. As a result, bitcoin mining would relocate, likely to places where electricity generation has significantly higher environmental costs than in the US. In other words, the DAME tax would likely increase global emissions on net.\n\nOverall, the CEA’s discussion of the DAME tax proposal is disappointing. The CEA seems to be ignorant of bitcoin and the process by which energy is produced and consumed. And its economic analysis is flawed. Externalities associated with electricity generation are not unique to bitcoin mining and, hence, do not justify a tax on bitcoin mining. If such a tax is warranted, it is warranted on electricity generation — and only to the extent that the particular type of electricity generation is characterized by a negative externality. The CEA’s argument would result in a failure on an introductory microeconomics exam. One expects better from a team of professional economists."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnVzYXRvZGF5LmNvbS9zdG9yeS9tb25leS9pbnZlc3RpbmcvMjAyMy8wNS8xMy9jcnlwdG8tdG8tYnV5LW5vdy10b3AtMy83MDIxNDc4MzAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "Crypto to buy now: Top investor shares the 3 to choose in May - USA TODAY",
        "content": "Dominic Basulto\n\nThe Motley Fool\n\nAgainst the backdrop of the domestic banking crisis and the potential for a U.S. debt default, some investors are now exploring crypto as a potential safe haven asset to weather the economic storm. Such thinking would have been unimaginable just six months ago, when the common consensus was that \"crypto winter\" would extend into much of 2023.\n\nBut are any cryptos really safe to buy right now? And, if so, which ones should investors be thinking about adding to their portfolios this month?\n\nBitcoin\n\nFirst up is Bitcoin (CRYPTO: BTC), which is regaining its status as \"digital gold\" in the minds of many investors due to all the uncertainty in the market today. The correlation between Bitcoin and gold has been surging in recent months, and the growing consensus is that Bitcoin is probably the safest crypto to invest in right now. Of course, \"safest\" is a relative term, because we all know how risky and volatile Bitcoin can be. Last year, for example, the value of Bitcoin plummeted by nearly 65%.\n\nDollar dollar bill, y'all:Gen Z is using cash more than ever in the face of inflation\n\nBut one factor in Bitcoin's favor is its long track record, which has made it a favorite of both retail and institutional investors. Bitcoin, which was created back in 2013, has survived several different market crashes over the past decade, and has emerged stronger each time. Bitcoin continues to offer tremendous upside potential, based on the pace of its international adoption as both a form of payment and a store of value.\n\nIn fact, Cathie Wood of Ark Invest has modeled the long-term growth potential of this crypto and concluded that Bitcoin could soar past the $1.48 million price mark by 2030. Less aggressive estimates have Bitcoin hitting the $100,000 mark by the end of 2024. Thus, from my perspective, Bitcoin offers the optimal blend of risk and reward of any top cryptocurrency.\n\nEthereum\n\nNext up is Ethereum (CRYPTO: ETH), which is the second-largest cryptocurrency by market cap, trailing only Bitcoin. Ethereum offers investors a well-diversified ecosystem, with exposure to every key segment of the blockchain and crypto world. This includes non-fungible tokens (NFTs), decentralized finance (DeFi), and blockchain gaming. Thus, by holding Ethereum, you are diversifying away some of the risk of holding crypto in your portfolio.\n\nMost impressively, Ethereum continues to upgrade its blockchain, ensuring that it remains the premier Layer 1 blockchain in the world. Last year, for example, Ethereum completed The Merge. This technological upgrade helped to make Ethereum faster, more efficient, and more scalable. And it prepared Ethereum for the next wave of growth in the blockchain world. And then, in March of this year, Ethereum came through again with Shapella (also known as \"Shanghai\"), another major upgrade to secure its status as a premier blockchain.\n\nAnd Ethereum shows no signs of stopping with future updates. Its founder, Vitalik Buterin, has already given investors a detailed roadmap for what's coming next in 2023 and 2024. The goal is to make Ethereum the highest-throughput, fastest, and most scalable blockchain in the world.\n\nSolana\n\nFor the third pick, I would have to go with Solana (CRYPTO: SOL), an Ethereum competitor with an $8.15 billion market cap. This is one of the few blockchain projects with the potential to outperform both Bitcoin and Ethereum this year. Year to date, Solana is already up 107%, which is more than Bitcoin (65%) and Ethereum (53%).\n\nWhile some might argue that this remarkable rebound in Solana is nothing more than a dead cat bounce after the FTX (CRYPTO: FTT) meltdown last year, there are several key steps that Solana has taken in 2023 that have me very optimistic about its future. One of these is the recent launch of Saga, the first-ever mobile phone by a major blockchain network. The Android-powered Saga has been described as a \"crypto phone\" due to its integration of crypto-friendly features. This mobile phone could be the key to Solana gaining a key foothold in the Web3 market, where Solana is preparing other initiatives.\n\nWhich crypto to buy first?\n\nIf there's one cryptocurrency to buy first this month, it's Bitcoin. As noted above, this is the one crypto that offers the optimal blend of risk and reward. This is an especially important consideration, given the economic headwinds swirling around the market right now. Thus far, at least, Bitcoin has proven to be a safe haven asset worth holding at a time when America's regional banks seem to be failing on a frequent basis.\n\nBut if you're really looking to outperform the market, that's when it's time to explore the altcoins that are much smaller (and hence, much riskier) than either Bitcoin or Ethereum. My personal pick is Solana, which has already skyrocketed to triple-digit gains in 2023. Solana comes with its share of drawbacks -- such as continued concerns about network stability -- but is a blockchain that I think is building a long-term future in the crypto world.\n\nDominic Basulto has positions in Bitcoin and Ethereum. The Motley Fool has positions in and recommends Bitcoin, Ethereum, and Solana. The Motley Fool has a disclosure policy.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nOffer from the Motley Fool:10 stocks we like better than BitcoinWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\n\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Bitcoin wasn't one of them! That's right -- they think these 10 stocks are even better buys.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of May 8, 2023"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzEyL2JpbmFuY2UtYW5ub3VuY2VzLWV4aXQtZnJvbS1jYW5hZGEtY2l0aW5nLXJlZ3VsYXRvcnktdGVuc2lvbnMv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDUvMTIvYmluYW5jZS1hbm5vdW5jZXMtZXhpdC1mcm9tLWNhbmFkYS1jaXRpbmctcmVndWxhdG9yeS10ZW5zaW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Binance Announces Exit from Canada, Citing Regulatory Tensions - CoinDesk",
        "content": "Over the past year, Binance has received increased scrutiny from North American regulators, and appears to be ramping down operations in the region. Earlier this year, Binance said it was considering severing ties with its U.S. business partners."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy10by1idXktYml0Y29pbi13aXRoLWdvb2dsZS1wYXktYS1ndWlkZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "How To Buy Bitcoin with Google Pay? A Guide - Analytics Insight",
        "content": "This guide will walk you through the four easy steps to buy Bitcoin using Google Pay\n\nNowadays, a variety of fiat payment options are accepted by Bitcoin trading platforms. You can use them to purchase Bitcoin and other readily available cryptocurrencies and deposit fiat currency (such as USD, GBP, or EUR) into your account. You’ve come to the correct place if you want a quick and straightforward way to invest in Bitcoin and have a Google Pay account. With Google Pay, you can use your smartphone or computer to pay for goods and services online and in physical stores. On some platforms that accept Google Pay as a means of payment, you can also use it to buy Bitcoin and other cryptocurrencies. This guide will walk you through the four easy steps to buy Bitcoin using Google Pay.\n\n1. Pick a website that supports Google Pay.\n\nThe first step is selecting a platform that enables Google Pay for Bitcoin purchases is the first step. This option is available on several platforms, including Binance, Coinbase, CEX.IO, and Xcoins. On Finty, you can compare their attributes, charges, and accepted currency. After selecting a platform, you must sign up for an account and confirm your identity. You might need to supply some personal information and a photo ID to comply with the KYC (Know Your Customer) and AML (Anti-Money Laundering) rules.\n\n2. Register your Google Pay account on the official platform.\n\nThe following action is to link your Google Pay account to the website. First, linking your debit card or bank account to Google Pay might be necessary. Then, navigate to the platform’s deposit page and choose Google Pay as your payment option. After entering your desired deposit amount, you must confirm the transaction. Enter your Google Pay PIN or use biometric authentication to authorize the transaction.\n\n3. Spend your deposited money to purchase Bitcoin.\n\nThe third stage involves spending your deferred funds to purchase Bitcoin. Go to the platform’s purchasing page and choose Bitcoin as the coin you want to buy. Type in the amount you want to spend or receive in Bitcoin. Review the order information, then confirm the transaction. You might have to reenter your Google Pay PIN or perform biometric authentication to confirm the payment.\n\n4. Keep your bitcoins safe in a wallet.\n\nKeeping your Bitcoin in a wallet is the last step. Keep your Bitcoin in the wallet provided by your platform, or move it to a different wallet of your choice. A wallet is a piece of hardware or software that lets you transfer, receive, and store cryptocurrency safely. Web wallets, mobile wallets, desktop wallets, hardware wallets, and paper wallets are a few examples of the various types of wallets.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLWNyb3NzLWNoYWluLWJpdGNvaW4tYnRjLWxpcXVpZGl0eS1pbi1kZWZpLWFycml2ZXMtdmlhLXdvcm1ob2xl0gFdaHR0cHM6Ly91LnRvZGF5L3NvbGFuYS1zb2wtY3Jvc3MtY2hhaW4tYml0Y29pbi1idGMtbGlxdWlkaXR5LWluLWRlZmktYXJyaXZlcy12aWEtd29ybWhvbGU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Solana (SOL): Cross-chain Bitcoin (BTC) Liquidity in DeFi Arrives via Wormhole - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nWormhole has received tBTC integration, and Austin Federa, head of strategy at Solana Foundation, reacted with excitement concerning the new development. \"Solana is about to be the best place to trade Bitcoin,\" he tweeted.\n\nAdvertisement\n\nWormhole, a communication bridge between Solana and other top decentralized finance (DeFi) networks, has welcomed the arrival of tBTC to the platform.\n\nSolana is about to be the best place to trade #Bitcoin 🔥 https://t.co/YaXeSs3E44 — Austin Federa (@Austin_Federa) May 11, 2023\n\nBTC is a scalable Bitcoin equivalent that enables users to access the Ethereum and cross-chain DeFi ecosystems. Threshold DAO is the network behind tBTC.\n\nThe Wormhole integration will allow tBTC to be moved to both Ethereum Virtual Machine (EVM) chains such as Arbitrum, Optimism and Polygon and non-EVM chains such as Solana, Aptos, Sui and Cosmo.\n\nThe integration with Wormhole relies on a novel technique for bridging ERC-20 tokens that enables capital deployment to Ethereum L2s without liquidity fragmentation. Instead of creating wrapped tokens for each chain, tBTC will be minted on Ethereum, and a canonical token native to each new ecosystem will be deployed.\n\nIntending to establish tBTC as the predominant form of BTC in on-chain DeFi, Wormhole proposed an incentive program to the Threshold community in mid-April 2023. On April 29, 2023, the proposal received broad community support and was approved in its entirety.\n\nThe program will involve Threshold integrating with the Wormhole Token Bridge and rewarding liquidity providers with token options to mint tBTC to be sent across as many as 20 new ecosystems of Wormhole-connected chains.\n\nUsers can create tBTC by locking their Bitcoin in a deposit on the Bitcoin blockchain (without using a custodian), which results in the creation of a corresponding tBTC token on the Ethereum network."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvaC9oeXBlcmxlZGdlci5hc3DSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Hyperledger: Open-Source Blockchain Framework and Standards - Investopedia",
        "content": "What Is Hyperledger?\n\nHyperledger is a global enterprise blockchain project that offers the necessary framework, standards, guidelines, and tools to build open-source blockchains and related applications for use across various industries. Hyperledger's projects include a variety of enterprise-ready permissioned blockchain platforms, where network participants are known to one another and therefore have an intrinsic interest in participating in the consensus-making process.\n\nUsing the available components under the Hyperledger umbrella, a business can apply various modular blockchain solutions and services to significantly improve the performance of their operations and the efficiency of their business processes.\n\nKey Takeaways Hyperledger is an open-source community focused on developing a suite of stable frameworks, tools, and libraries for permissioned, enterprise-grade blockchain deployments.\n\nIt is a global collaboration, hosted by The Linux Foundation, and includes member organizations that are leaders in finance, banking, Internet of Things, supply chains, manufacturing, and technology.\n\nSeveral sub-projects exist, including Hyperledger Fabric, Sawtooth, Composer, and Cello.\n\nHyperledger varies from Bitcoin as it is not a cryptocurrency but instead used to develop frameworks and tools.\n\nHyperledger uses a consensus layer, smart contract layer, communication layer, and API.\n\nUnderstanding Hyperledger\n\nThe Hyperledger project was created in December 2015 by the San Francisco, California–based Linux Foundation. It started with 30 member firms and has grown to about 140 member companies today.\n\nHyperledger was set up with the aim of accelerating industry-wide collaboration for developing high-performance and reliable blockchain and distributed ledger-based technology framework that could be used across the various industry sectors to enhance the efficiency, performance, and transactions of the various business processes.\n\nHyperledger is a global collaboration that includes leading businesses from the fields of finance, banking, Internet of Things (IoT), supply chain management, manufacturing and production, and technology. They include big names like Bosch, IBM, Microsoft, Oracle, Deloitte, Hitachi, American Express, JP Morgan, and Visa, in addition to a host of blockchain-based startups like ConsenSys.\n\nThe Linux Foundation has launched over 70 open sourced organizations with Hyperledger being among the fastest growing.\n\nHyperledger's Organizational Structure\n\nEssentially, Hyperledger is not an organization, a cryptocurrency network, or a blockchain system. It does not support a cryptocurrency like bitcoin, but it works by providing the necessary infrastructure and standards for developing various blockchain-based systems and applications for industrial use. Think of Hyperledger as a hub, where various individual blockchain-based projects and tools that adhere to its defined design philosophy operate under its umbrella.\n\nThe various projects include the following:\n\nHyperledger Fabric is a platform for building various blockchain-based products, solutions, and applications for business use. A now-defunct layer called Hyperledger Composer has since been replaced with Fabric as well.\n\nA now-defunct layer called Hyperledger Composer has since been replaced with Fabric as well. Hyperledger Cello allows blockchain to be used through an on-demand “as-a-service” deployment model (Blockchain-as-a-Service).\n\nHyperledger Explorer is a dashboard utility that allows for the monitoring, searching, and maintenance of blockchain developments and related data.\n\nHyperledger Burrow is a permissioned Ethereum smart-contract blockchain node that handles transactions and executes smart contract code on the Ethereum Virtual Machine (EVM). It was discontinued in 2022.\n\nHyperledger Sawtooth is an enterprise-level, permissioned, modular blockchain platform that uses an innovative Proof of Elapsed Time consensus algorithm.\n\nHyperledger Caliper is a blockchain benchmark tool that is used to evaluate the performance of a specific blockchain implementation.\n\nAll such projects under the Hyperledger umbrella follow the design methodology that supports a modular and extensible approach, interoperability, and security features. The projects remain agnostic to a particular token or cryptocurrency, though a user can create one as required.\n\nHyperledger was founded in 2016 with 30 founding corporate members.\n\nHyperledger Technology Layers\n\nIn terms of the architecture, Hyperledger uses the following key business components:\n\nThe consensus layer takes care of creating an agreement on the order and confirming the correctness of the set of transactions that constitute a block.\n\nThe smart contract layer is responsible for processing transaction requests and authorizing only valid transactions.\n\nThe communication layer takes care of peer-to-peer message transport.\n\nThe identity management services are the necessary function for maintaining and validating the identities of users and systems and establishing trust on the blockchain.\n\nThe API, or application programming interface, enables external applications and clients to interface with the blockchain.\n\nHyperledger vs. Bitcoin\n\nAs mentioned earlier, Hyperledger is vastly different from Bitcoin in that it is not a cryptocurrency. The fundamental purpose and nature of the technology is to develop enterprise-grade blockchain frameworks and tools. While Bitcoin enables peer-to-peer transactions without the need for intermediaries, Hyperledger is more geared towards facilitating business processes.\n\nHyperledger frameworks are often private, permissioned blockchains meaning permission to the network is limited to a small number of trusted users. On the other hand, Bitcoin is a public blockchain meaning anyone can participate in the network. Each uses a different form of consensus mechanism as well, as Bitcoin transactions are substantiated using a proof-of-work consensus mechanism while Hyperledger supports Byzantine fault tolerance or other algorithms.\n\nAs hinted to in the previous paragraph, Bitcoin is decentralized. This means no single entity owns it, and the system relies on the collection of the network's participants. Alternatively, Hyperledger is governed by the Linux Foundation.\n\nLast, Bitcoin is not known for its smart contracts. It's primary use is to store value, not support complex programmability to facilitate agreements. Alternatively, Hyperledger offers greater smart contract capabilities. This allows businesses to engage in complex agreements relying heavily on logic to distribute assets on a blockchain network.\n\nIs Hyperledger Better Than Ethereum? Hyperledger provides a scalable, customizable, and permissioned blockchain solution for enterprise use cases with a focus on privacy and confidentiality. Should companies feel they need greater support with open development and innovation, Ethereum may be the more suitable option that offers a more robust platform with a larger developer community.\n\nIs Hyperledger a Cryptocurrency? Hyperledger isn't a cryptocurrency, though. The Linux Foundation is hosting a collaborative open-source project with the goal of creating enterprise-grade blockchain frameworks and tools. Hyperledger does not entail the development or use of a cryptocurrency and instead focuses on creating private, permissioned blockchain networks for corporate purposes.\n\nWhat Coin Does Hyperledger Use? There is no native coin for Hyperledger. It is a blockchain framework that puts the emphasis on creating enterprise-grade solutions rather than using or creating a particular coin or cryptocurrency.\n\nThe Bottom Line\n\nThe Linux Foundation is home to the Hyperledger open-source collaborative project which aims to provide business-grade blockchain frameworks and technologies. Businesses may build private, permissioned blockchain networks for a variety of use cases. Hyperledger uses include supply chain management and smart contracts, and Hyperledger is known for its modular and adaptable solutions.\n\n"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnRvbXNoYXJkd2FyZS5jb20vbmV3cy9yYXNwYmVycnktcGktZ2FtYmxlcy1mb3ItYml0Y29pbi13aXRoLWFudC1taW5lctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "Raspberry Pi Zero Gambles for Bitcoins with USB Antminer - Tom's Hardware",
        "content": "If you’ve got a spare Raspberry Pi lying around, you really should put it to good use. If you don’t have a functional project in mind, you could always gamble a bit like maker Data Slayer is doing with this Bitcoin mining project . With a Raspberry Pi Zero alongside a USB Antminer device, he’s taking a chance (a very small chance) that he will luck out and win some serious cryptocurrency.\n\nThe way the project works is simple enough. The Raspberry Pi is running Raspberry Pi OS. It’s connected to an Antminer via USB which is responsible for handling Bitcoin mining algorithms. The system is connected to it Bitcoin wallet which will receive a handsome deposit if he’s lucky enough to win an entire hash. Because the system is so small, it’s not practical enough for regular mining and is better suited for what’s called lotto mining. In this case, he has a 1 in 2 billion chance of winning a whole block each day.\n\nData Slayer is using a Raspberry Pi Zero W which needs network connectivity to function. It’s connected to the Antminer USB stick which requires a huge heatsink while operating to keep cool. For storage, the project is relying on a 32 GB micro SD card. The system is a headless setup so it must be operated over SSH.\n\nTo conserve resources, Data Slayer is using the 32-bit Lite version of Raspberry Pi OS. Once he had the operating system installed, he remoted into the Pi via SSH to install CG Miner. This application is main driver behind the mining operation. In the demo, Data Slayer is using the SHA-256 algorithm for mining which can be configured in CG Miner. The project video shares plenty of details on how to install the system, set up the miner, and connect it to your wallet.\n\nIs this project practical? Not really. Is it fun and worth tinkering around with on a lazy afternoon? Absolutely. If you want to recreate this Raspberry Pi project or just get a closer look at how it goes together, check out the original video shared to YouTube by Data Slayer and be sure to follow him for more cool projects as well as any future updates on this one."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9pcy10aGUtdXMtZ292ZXJubWVudC1pbnZvbHZlZC13aXRoLWJpdGNvaW5zLXJlY2VudC1wcmljZS1kcm9wLTE2NjQ2OTIxLmh0bdIBdmh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9pcy10aGUtdXMtZ292ZXJubWVudC1pbnZvbHZlZC13aXRoLWJpdGNvaW5zLXJlY2VudC1wcmljZS1kcm9wLTE2NjQ2OTIxLmh0bS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Is the US government involved with Bitcoin’s recent price drop? - CNBCTV18",
        "content": "On May 11, Bitcoin's price unexpectedly plummeted below $27,000, a support level it had maintained since March 17, amid reports that the US government was allegedly selling its Bitcoin assets. However, it was later reported the ‘fake’ news might have triggered fear, uncertainty, and doubt (FUD) amongst crypto investors, leading to a sporadic decline in Bitcoin’s price. Here’s a recap of the events that followed in the past few days.\n\nDid the U.S. government sell its BTC holdings?\n\nBitcoin's market had been choppy in recent weeks, moving between the upper and lower bands of $30,000 and $27,000, respectively. However, on May 11, Bitcoin dropped below this lower band and touched $26,723, its lowest point in nearly two months. The dip was mostly unexpected given that the announcement of US inflation statistics on May 10 was followed by a brief uptick in Bitcoin's price.\n\nAlso Read: A quick guide on how to verify your crypto transaction\n\nFollowing Bitcoin's dip, it was reported that news of the US government selling confiscated bitcoins may have caused an unanticipated drop in its price. It is currently unknown where the news came from, however, it is known that various social media accounts were fast to spread the story. During the same day, Coinglass, an analytical platform, revealed that $47 million in long positions were liquidated in less than an hour, the second-largest Bitcoin liquidations in 2023 so far.\n\nThe US government has amassed a sizable stockpile of Bitcoins over the years. The coins were obtained through seizures from the Silk Road marketplace, thefts on the crypto exchange Bitfinex, and James Zhong, who pleaded guilty in 2012 to manipulating the Silk Road transaction system in order to siphon Bitcoins. The government typically sells these Bitcoin confiscations in public auctions conducted by the U.S. Marshals Service. According to Glassnode, the US Government held 205,515 BTC as of 9 March. The same is valued at $5.42 billion based on Bitcoin’s current market price.\n\nWas this just a rumor?\n\nIn the aftermath of Bitcoin’s price drop, several social media accounts argued that recent news of the US government selling its BTC holdings was likely just a rumor which fueled market FUD.\n\nFor instance, social media user and on-chain analyst ZachXBT, searched blockchain addresses to demonstrate that addresses associated with US authorities had not engaged in any such transactions. Later that day, analytical platform CryptoQuant tweeted that several social media accounts spread unverified news without fact-checking, resulting in Bitcoin liquidations.\n\nThere was also a rumor which suggested that the problem was caused by a faulty feature on blockchain analytics platform, Arkham Intelligence. Some argued that user labels used to mark addresses on Arkham Intelligence were responsible for the trouble. The Arkham interface allows users to manually add or remove labels to modify data sets, which may have led some clients to misuse this feature. However, the platform later denied these rumors. It also confirmed that it had identified seven Bitcoin wallets associated with the US government, and none of them were involved in any BTC transactions of late.\n\nConclusion\n\nIt is difficult to ascertain whether the US government has sold any of its Bitcoin assets this week until an official statement is issued. However, according to some on-chain experts, the same remains a rumor for the time being. At the time of writing, Bitcoin’s price traded at $26,420, down by 3.5 percent over the last 24 hours and down by 9 percent over the last 7 days."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2JpdGNvaW4vd2hhdC1pcy1iaXRjb2luLXBpenphLWRheS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: A Slice of Crypto History - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvd2h5LWlzLWJpdGNvaW4tYW5kLXRoZS1jcnlwdG8tbWFya2V0LWRvd24tdG9kYXkv0gFRaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy93aHktaXMtYml0Y29pbi1hbmQtdGhlLWNyeXB0by1tYXJrZXQtZG93bi10b2RheS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Why Is Bitcoin And The Crypto Market Down Today? - NewsBTC",
        "content": "Bitcoin price continues to fall, dragging the broader crypto market down with it. BTC is down 4.52% in the last 24 hours, while ETH is down 4.10%. With a current price of $26,289, Bitcoin records its lowest value since March 14 this year, when the price dipped as low as $26,544.\n\nWhy Is Bitcoin And Crypto Down?\n\nAs always, the reasons for the deep pullback of the Bitcoin price are complex. Remarkably, there was actually good news on Wednesday, May 10, as the CPI continued to fall causing the Bitcoin price to rise as high as $28,317.\n\nHowever, then fake news about an alleged sale of 9,800 BTC by the U.S. government shook the market. The Bitcoin price flash crashed as a result and has seemingly not been able to recover since. But this narrative is only half the story.\n\nA variety of other factors are currently weighing on the crypto market: the dollar index (DXY) is currently experiencing a bounce and was recently able to hold above the historically important support, the liquidity issue intensified once again with the departure of US market makers Jump and Jane Street, BTC formed a (supposed) head and shoulders pattern in the 1-day chart, the congestion of the Bitcoin and Ethereum blockchains and last but not least a lot of FUD (US government selling, Binance US and Grayscale).\n\nNot surprisingly, uncertainty in the Bitcoin and crypto market is currently quite high. The Dollar Index (DXY) is currently hovering above historically crucial support at 101.8. Since early April, DXY has already been suspiciously close to support, but has so far been able to fend off any attack from the bears.\n\nAs Christopher Inks of Texas Wet Capital writes, the DXY saw another move higher yesterday (to 102.056) and is currently preventing a rally in risk assets:\n\nThe $DXY rally is making longs difficult this morning. So, if you’re trying to get long on risk-off assets it’s best to wait and watch for a bit.\n\nLiquidity Issues, A Bearish Chart Pattern And FUD\n\nAnother bitter blow to the crypto market on Tuesday was the news of Jump and Jane Street’s departure from the U.S. crypto market. The move by the two major market makers comes as a result of regulatory uncertainty in the US.\n\nAs NewsBTC reported, liquidity has been a huge problem before, which could now get worse. Due to low liquidity, higher volatility is likely as larger buy and sell orders move the market faster.\n\nIn addition, a (supposed) head and shoulders pattern on Bitcoin’s 1-day chart is currently causing fear among traders. The pattern may signal a crash to $25,000.\n\nRemember the bearish diamond pattern that everyone was shilling at 21-22k? It’s H&S now, just saying! https://t.co/2HlUIZ1XrJ pic.twitter.com/yyivuwcF82 — tedtalksmacro (@tedtalksmacro) May 12, 2023\n\nAdding to the uncertainty has certainly been the congestion of the Bitcoin blockchain by Ordinals and the controversial BRC-20 meme coins, which are seen as a DDoS attack by part of the community. Although 300,000 transactions are still waiting for confirmation in the mempool, the problem is slowly easing.\n\nThe popularity of Bitcoin Ordinals transactions is declining. Trading volume has dropped for three consecutive days after reaching an all-time high of $18.13 million on May 8. Yesterday, trading volume fell to $4.86 million. The number of transactions has also dropped from 17,000 to 6,000. UniSat’s market share has dropped from 80-90% to 50-60% currently.\n\n#Bitcoin block size war 2.0? 👀 According to Dune data, transactions through Unisat have grown exponentially since the beginning of May. 🚨 Unisat, the core wallet of BRC20, is developed by a Chinese development team of the BSV community. pic.twitter.com/DfW46mbhZb — Jake Simmons (@realJakeSimmons) May 11, 2023\n\nLast but not least, there are currently some unconfirmed rumors (FUD) circulating about Binance US and Grayscale. Binance US caused a stir in the last few days because the Bitcoin price showed a high price premium. The reasons have been the subject of much speculation.\n\nGrayscale is currently being hotly debated because DCG supposedly owes bankrupt crypto lender Genesis Trading about $575 million in May, with the loans coming due next week. The rumor says that Grayscale may be selling something on Coinbase to cover the capital needed to repay the loan.\n\nAt press time, the Bitcoin price stood at $26,289, initially receiving support from the 100-day EMA.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tZmVlcy10b28taGlnaC1oZXJlLWFyZS0xMC13YXlzLXRvLWxvd2VyLXRoZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Fees Too High? Here are 10 Ways to Lower Them - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzA1LzEyL2JpdGNvaW4taGl0cy10d28tbW9udGgtbG93LWFtaWQtd2Vhay1tYXJrZXQtbGlxdWlkaXR5LWFuZC1yZWd1bGF0b3J5LWF0dGFja3Mv0gF3aHR0cHM6Ly9uYWlyYW1ldHJpY3MuY29tLzIwMjMvMDUvMTIvYml0Y29pbi1oaXRzLXR3by1tb250aC1sb3ctYW1pZC13ZWFrLW1hcmtldC1saXF1aWRpdHktYW5kLXJlZ3VsYXRvcnktYXR0YWNrcy8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin slumps on low liquidity and regulatory pressure - Nairametrics",
        "content": "Article Summary\n\nBitcoin’s value has dropped by 10% this week, and liquidity is thin, even for large assets like Bitcoin, causing concern among investors.\n\nExperts believe that Bitcoin’s recent drop could lead to further declines towards $25,000, which is a significant support area, and a drop below this level could be disastrous for uptrend buyers.\n\nThe Securities and Exchange Commission (SEC) has subpoenaed Marathon Digital, a Bitcoin mining firm, for alleged violations of securities laws, as part of an ongoing investigation into a data center in Montana. Despite this, Bitcoin is considered to be the most decentralized and resilient of all cryptocurrencies.\n\nBitcoin fell below $26,200 on Friday as the market continued to react to falling risky asset prices. The flagship cryptocurrency lost a tenth of its value this week, trading at two-week lows.\n\nCurrently, liquidity appears to be “very thin,” even for large crypto assets like Bitcoin. Market indicators cannot pinpoint a direct reason for the weakness, but concerns that reduced participation by institutional market makers could lead to more price volatility have pushed mid-to-larger bids to stomp the market, making it fall.\n\nRecently, liquidity or market depth has deteriorated on major exchanges, including Binance, making it difficult for traders to fill large orders without impacting prices.\n\nExperts believe Bitcoin’s drop to two-month lows has confirmed a bearish head-and-shoulders reversal pattern on technical charts. This breakdown opens every door for further declines toward the support near $25,000.\n\nBackstory\n\nAfter a failed breakout in early April, the price is firming below the $30,000 resistance level. The downward pressure over the past few days has also pushed the 50-day moving average to break near $28,000.\n\nThe $25,000 support area could be the next target, followed by the next important 200-day moving average near $22,000. Both are significant, and a drop below these levels would be disastrous for uptrend buyers.\n\nOn the other hand, a further breakout above the 50-day moving average will likely thwart the downside scenario, which, in turn, will likely push the price above $30,000.\n\nAt the regulatory level, the Securities and Exchange Commission (SEC) has targeted prominent Bitcoin mining firm Marathon Digital for alleged violations of securities laws that further added pressure on the cryptocurrency market.\n\nBitcoin mining firm Marathon Digital Holdings has announced that it has been subpoenaed by the SEC for alleged securities law violations as part of an ongoing investigation into a data center in Montana.\n\nMarathon Digital, the second-largest listed Bitcoin miner in the United States, has been subpoenaed by the SEC to produce documents and information related to its operations. Marathon has announced its intention to cooperate fully with the SEC’s investigation.\n\nBut of all the crypto assets, Bitcoin is the most decentralized and resilient given what happened when China completely banned cryptocurrency trading. The mining business was just offshored, and now China’s bitcoin mining has resumed, producing the second-highest hash power in the world.\n\nWhat you should know and expect in the nearest future\n\nThe banking crisis won’t go away anytime soon, and it could get worse. The US economy could face a major collapse later this year and into 2024, and the war between Russia and Ukraine is still raging."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYm9sZC5jb20vdGhpcy1pcy13aGVuLWJpdGNvaW4tY291bGQtcmVhY2gtYS1uZXctYWxsLXRpbWUtaGlnaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 May 2023 07:00:00 GMT",
        "title": "This is when Bitcoin could reach a new all-time high - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) has been struggling to break through the crucial $30,000 price level in recent weeks, despite gaining renewed support from factors such as the United States banking crisis.\n\nAs the maiden cryptocurrency experiences a lackluster performance, market analysts are closely monitoring its next price trajectory, especially regarding the next all-time high.\n\nIn particular, a recognized pseudonymous crypto analyst El_crypto_prof, who took to Twitter on May 13, suggested that Bitcoin’s price action follows a pattern of higher highs and higher lows that often leads to a parabolic rally. This means that as the cryptocurrency’s value increases, it tends to surge even faster, resulting in exponential growth.\n\nBased on this pattern, the analyst suggested that Bitcoin could achieve a new all-time high before 2025. This is because the cryptocurrency has been consistently exhibiting a series of higher lows over the past few months, which could indicate that it is on track to establish a new higher high.\n\n#Bitcoin (W)\n\n\n\nLooking at my timeline, there are only a handful of analysts who see what $BTC is doing here.\n\n\n\nIt works on the upside just like it works on the downside.\n\n\n\nA series of higher highs and higher lows eventually results in a parabolic rally.\n\n\n\nNew ATH before 2025 imo. pic.twitter.com/DrtgtEqwaT — 𝕄𝕠𝕦𝕤𝕥𝕒𝕔ⓗ𝕖 🧲 (@el_crypto_prof) May 13, 2023\n\nBitcoin’s next all-time high\n\nBesides the historical chart pattern trends, Bitcoin is also banking on factors like the upcoming halving and possible regulatory clarity as a potential foundation for a new all-time high. The last record high was in late 2021 when the asset peaked at almost $69,000.\n\nIt’s worth noting that Bitcoin has been unable to maintain gains above the $30,000 level since mid-April. As of May 12, the cryptocurrency saw its lowest level of trade since mid-March, dropping below $27,000 due to ongoing volatility fueled by low liquidity in the cryptocurrency markets.\n\nThe renewed losses in Bitcoin can also be attributed to the increased regulatory scrutiny in the industry. Recently, Bitcoin miner Marathon Digital received a subpoena from the U.S. Securities and Exchange Commission (SEC), raising concerns about potential violations of federal securities laws through related-party transactions. This development has created uncertainty for the publicly traded mining company.\n\nAs Bitcoin looks to reclaim a new record high, the crypto community is projecting a possible price decline in the coming weeks. As per Finbold report, a crypto community with 82% historical accuracy predicted that Bitcoin would likely tumble and trade at $24,753 on May 31.\n\nBitcoin price analysis\n\nAs of press time, Bitcoin was trading at $26,801, reflecting a modest daily gain of around 1.6%. However, on the weekly, the cryptocurrency has declined by almost 7%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nA look at Bitcoin’s technical analysis shows a bearish sentiment prevailing. According to a review of one-day gauges obtained from TradingView, the recommended sentiment is ”sell” at 11. The moving averages indicate a ”sell” sentiment at 9, while the oscillators are neutral at 8.\n\nBitcoin technical analysis. Source: TradingView\n\nIn the meantime, Bitcoin is attempting to breach the $27,000 support level, potentially creating room for the cryptocurrency to reclaim the $30,000 level.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]