[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMjQvYml0Y29pbi1yaXNlcy10by1uZXctaGlnaC1mb3ItdGhlLXllYXItZnJpZGF5LWFib3ZlLTM4MDAwLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8yNC9iaXRjb2luLXJpc2VzLXRvLW5ldy1oaWdoLWZvci10aGUteWVhci1mcmlkYXktYWJvdmUtMzgwMDAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin rises to new high for the year Friday above $38,000 - CNBC",
        "content": "Crypto prices have recovered from a big dip earlier in the week, with bitcoin hitting a new high for 2023 on Friday.\n\nBitcoin was last higher by 1.42% at $37,862.76 for the first time since May 2022, according to Coin Metrics. It's on pace to end the week higher by 3.9%. Coin Metrics measures a week in crypto, which trades 24 hours a day, from 4:00 p.m. ET on a given Friday to the same time the following Friday.\n\nMeanwhile, ether has moved back above the key psychological level of $2,000, last trading 1.8% higher at $2,104.14. The second-largest token by market cap is outperforming the crypto market this week, on pace to end up more than 8%.\n\nSolana , the big outperformer on the year — up more than 476% compared to bitcoin's 130% — trailed the major tokens this week. It's hovering just under the flat line for the week."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmtpcGxpbmdlci5jb20vaW52ZXN0aW5nL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tMjAyMy1oaWdoLXByaWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Tops $38000 For First Time This Year In Hectic Crypto Week - Kiplinger's Personal Finance",
        "content": "Bitcoin hit a 2023 high at the end of a week that saw chaos at other cryptocurrencies.\n\nThe price of Bitcoin briefly went over $38,000 on Friday, the first time it's done so this year. This is the first time the cryptocurrency saw those numbers since last summer, and it's been rallying since a dip in the back half of 2022.\n\nCoinbase, too, reached a 2023 high at the end of the week, at its highest level since spring 2022. But while it's a promising time for some investors, the crypto world has had shakeups this week.\n\nSubscribe to Kiplinger’s Personal Finance Be a smarter, better informed investor. Save up to 74% Sign up for Kiplinger’s Free E-Newsletters Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. Sign up\n\nTwo cryptocurrency platforms were hacked, according to CNBC, with a possible $115 million stolen. The affected platforms are the HTX digital currency exchange, which used to be known as Huobi, and the blockchain bridge Heco Chain. Both are linked to entrepreneur Justin Sun.\n\nHTX and Heco Cross-Chain Bridge Undergo Hacker Attack. HTX Will Fully Compensate for HTX's hot wallet Losses. Deposits and Withdrawals Temporarily Suspended. All Funds in HTX Are Secure, and the Community Can Rest Assured. We are investigating the specific reasons for the hacker…November 22, 2023 See more\n\nHTX said it would \"fully compensate for any losses incurred due to the hot wallet attack,\" according to CNBC, and is working on finding the source of the hack.\n\nMeanwhile, Binance and its CEO, Changpeng Zhao (CZ), pleaded guilty to federal charges related to money laundering, the Department of Justice announced Tuesday. The plea came with an agreement to pay more than $4 billion.\n\n\"Binance became the world’s largest cryptocurrency exchange in part because of the crimes it committed – now it is paying one of the largest corporate penalties in U.S. history,\" Attorney General Merrick Garland said in a statement.\n\nThe DOJ's statement also included apparent warnings to other crypto platforms, highlighting the work the department has done to crack down on the industry.\n\n\"The message here should be clear: using new technology to break the law does not make you a disruptor, it makes you a criminal,\" Garland continued.\n\n\"Any institution, wherever located, that wants to reap the benefits of the U.S. financial system must also play by the rules that keep us all safe from terrorists, foreign adversaries, and crime or face the consequences,\" Secretary of the Treasury Janet L. Yellen said in the same announcement.\n\nBinance users pulled over $1 billion off the exchange since the news came out, CNBC reported.\n\nOf course, this all comes in the wake of FTX founder Sam Bankman-Fried being found guilty of fraud earlier this month, making it a largely chaotic month for the crypto world."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvYml0Y29pbi1leWVzLTQway1hZnRlci1icmVhY2hpbmctMzhrLWZvci1maXJzdC10aW1lLXNpbmNlLW1heS0yMDIyL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvYml0Y29pbi1leWVzLTQway1hZnRlci1icmVhY2hpbmctMzhrLWZvci1maXJzdC10aW1lLXNpbmNlLW1heS0yMDIyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Eyes $40K After Breaching $38K for First Time Since May 2022 - CoinDesk",
        "content": "\"When approved, the volatility of BTC will be significant during these periods which create additional risks for investors but as well opportunities for those arbitraging. Would not be surprised if we see 40K being broken this weekend,\" Kssis said."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY0NTY3L2JpdGNvaW4tNDAwMDAtaW5ldml0YWJsZS1hZnRlci1iaW5hbmNlLXNldHRsZW1lbnTSAVlodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjQ1NjcvYml0Y29pbi00MDAwMC1pbmV2aXRhYmxlLWFmdGVyLWJpbmFuY2Utc2V0dGxlbWVudA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's rise above $40,000 'inevitable' following Binance settlement: Matrixport analyst - The Block",
        "content": "Bitcoin BTC -2.25% 's price could surpass $40,000 this year after Binance’s DOJ settlement and former CEO Changpeng Zhao’s guilty plea to financial violations signaled a turning point in the crypto landscape, according to Matrixport analyst Markus Thielen.\n\nBinance's agreement to pay $4.3 billion in fines marks one of the largest corporate settlements in U.S. history. After stepping down as CEO, Zhao will pay a $50 million fine and a $175 million personal recognizance bond. He also faces a possible 18-month prison sentence, with a hearing set for Feb. 23.\n\nThe outcome, less severe than a feared $10 billion fine and not accusing Binance of misappropriating user funds or alleging market manipulation, suggests it will likely remain a top-three exchange over the next 2 to 3 years, the analyst argued.\n\nDespite the Binance news initially being perceived as a risk-off event, bitcoin only experienced a temporary correction, Thielen said, bouncing back from the $36,000 level in a \"robust counter-trend reaction.” with “bitcoin surging above $40,000 inevitable.”\n\n“We anticipate bitcoin surpassing $38,000 by the end of this month with an 80% probability, followed by a rally above $40,000 in December with 90% probability,” Thielen added.\n\nBitcoin seasonality\n\nOctober 2023 saw bitcoin's price soar by 28%, a trend that may continue with the anticipated approval of a bitcoin spot ETF in the U.S., the Matrixport analyst said, something that would further underscore confidence in bitcoin as a legitimate asset class.\n\nSeasonality is another factor, with average December returns of 12% potentially lifting bitcoin to $42,000 by this metric alone, he added.\n\nRELATED INDICES See crypto indices\n\nTether’s USDT market capitalization increases by $5 billion\n\nSince September, Tether’s USDT market capitalization has increased by $5 billion, signaling a growing trend among institutional investors shifting from fiat into stablecoins, potentially converting them into other cryptocurrencies, such as bitcoin, Thielen said.\n\n“Last night, another $600 million USDT appeared to be minted, potentially signaling inflows into bitcoin after the Binance/CZ deal with U.S. enforcement authorities that seemed to increase the probability that a U.S.-listed spot bitcoin ETF could be approved by January,” Thielen added.\n\nMacro environment supportive of crypto\n\nThe macro-environment also continues to support crypto, Thielen said, with Matrixport anticipating another halving of inflation toward 1.6% and a decline in bond yields to 2.60% by 2024 or 2025, following the peak of the U.S. 10-year Treasury yield at 4.95% in this cycle.\n\nThe adjustment in bond yields is expected to usher in a surge for the stock market, which often correlates with cryptocurrencies, the analyst added."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXNlbmRlci1taXN0YWtlbmx5LW92ZXJwYXlzLXJlY29yZC0wNTMzMzgzMzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Sender Mistakenly Overpays Record $3M in Transaction Fees - Yahoo Finance",
        "content": "Bitcoin Sender Mistakenly Overpays Record $3M in Transaction Fees\n\nA Bitcoin (BTC) sender made a costly error by paying an unprecedented $3 million in transaction fees for a single transaction. The sender intended to send 139.42 BTC, valued at around $5.1 million, but mistakenly lost 83.64 BTC in fees, leaving the recipient with only 55.77 BTC, approximately $2 million. This transaction fee sets a new record in Bitcoin's history.\n\nAccording to blockchain data from Bitinfocharts, the transaction was processed by Bitcoin miner AntPool in block 818087. While Bitcoin transactions can be expensive during busy periods, data from Bitinfocharts indicates that the average transaction fee on the Bitcoin network is currently $14.1.\n\nIn September, stablecoin issuer Paxos paid a $500,000 fee for processing a transaction worth just $2,000. Fortunately, Bitcoin miner F2Pool agreed to refund the excessive payment in that instance.\n\nWhile this is a costly mistake, Bitcoin transaction fees have been surging lately due to growing interest in Bitcoin Ordinals. Ordinals are digital assets inscribed on the smallest unit of Bitcoin, called a satoshi. The inclusion of Ordinals on the Bitcoin blockchain has increased network activity, resulting in higher transaction costs.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vY29pbmJhc2Utc2hhcmVzLWFkdmFuY2UtYWZ0ZXItYml0Y29pbi1oaXRzLXVzZDM4ay1iaW5hbmNlLXNldHRsZW1lbnQtODQwNjQ5NtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Coinbase Shares Advance After Bitcoin Hits $38K, Binance Settlement - Investopedia",
        "content": "Key Takeaways Coinbase shares took off along with the price of Bitcoin, and as the exchange benefited from a legal settlement by larger rival, Binance.\n\nBitcoin traded above $38,000 for a short period today, the highest its been this year.\n\nAnalysts have suggested the Binance settlement could speed up U.S. regulatory approval of a Bitcoin exchange-traded fund (ETF).\n\nCoinbase Global (COIN) shares jumped as biitcoin (BTCUSD) traded at a 2023 high, and it appeared the firm has benefited from the recent legal problems for the world’s largest crypto exchange, Binance.\n\nData analyzed by on-chain research firm CryptoQuant reported by Coindesk suggests that Coinbase’s reserves of bitcoin have jumped recently, while they’ve declined at Binance.\n\nEarlier this week, Binance pleaded guilty to federal charges of money laundering. The company agreed to pay $4.3 billion in penalties, and founder and CEO Changpeng Zhao, known as CZ, also pleaded guilty and said he would step down.\n\nAnalysts indicated that another potential benefit to Coinbase is that the Binance legal decision may help pave the way for U.S. regulators to approve a Bitcoin exchange-traded fund (ETF).\n\nBitcoin traded above $38,000 for a short period before giving up some ground. It remained in positive territory at midday.\n\nShares of Coinbase Global were at their highest level since April 2022.\n\n"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS9iaXRjb2luLXNtYXJ0LWNvbnRyYWN0cy1hbmQtYXBwcy1kby10aGV5LWV2ZW4tZXhpc3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Smart Contracts and Apps: Do They Even Exist? - Ledger",
        "content": "Bitcoin Smart Contracts and Apps: Do They Even Exist?\n\nBy Mohammad Musharraf\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — Bitcoin supports smart contracts through its native language ‘Script’, enabling multiple transaction types to take place.\n\n\n\n— Script is a purposefully non-Turing complete language and this makes smart contracts on Bitcoin limited in their functionality.\n\n\n\n— Layer-2 blockchains and solutions are present for Bitcoin to improve its smart contract offerings while keeping its security intact.\n\nBitcoin is the world’s first blockchain and cryptocurrency. Its primary use case is peer-to-peer payment transfers. Often Bitcoin is referred to as digital gold, with it offering a secure and decentralized way to store and manage value. This core value proposition is what led Bitcoin to become the most popular and widely used crypto network so far. And it’s these same core values that many other networks have taken inspiration from while creating new use cases and innovations.\n\nTo explain, while Bitcoin was created purely to store and manage value in a decentralized manner, other networks expanded into other territories, creating ways to host decentralized applications. Decentralized apps (DApps) have taken the world by storm, and as such, there has been a push to create these types of apps that work using the most popular network, Bitcoin. However, this was not the reason Bitcoin was created, thus it’s a bit more complex than many smart-contract-ready networks like Ethereum.\n\nSo how do Bitcoin’s versions of smart contracts work? And what kinds of functions are available using this method?\n\nLet’s explore the concept of Bitcoin smart contracts and dive into the different types of smart contracts on the Bitcoin network.\n\nDoes Bitcoin Have Smart Contracts?\n\nYes, the Bitcoin blockchain supports smart contracts. Developers can use Script, a scripting language, to write and deploy smart contracts on Bitcoin.\n\nSo, why is Bitcoin never the first thing people think when the topic of smart contracts pops up?\n\nOften, you’ll hear people say Bitcoin is not “Turing complete”. But in fact, that’s not quite true. Instead, it’s all to do with something called opcodes. Or more, Bitcoin’s lack of them.\n\nOpcodes are essentially small pieces of code that represent functions that can be executed on a specific network. On some blockchains, for example, Ethereum, some of these opcodes have the power to read and write the current “state” of the blockchain. Then from there, you can combine many of these opcodes to create complex automated tasks triggered by a blockchain transaction. These groups of opcodes are better known as smart contracts and are responsible for countless blockchain apps and platforms.\n\nHowever, Bitcoin script doesn’t contain these types of opcodes. That also means that Bitcoin doesn’t have a recorded current “state” at any given moment. Instead, it simply records who owns what, and allows people to send and receive coins via UTXOs, with a limited choice of conditions of how that value transfer executes.\n\nSo, now you know why Bitcoin smart contracts aren’t exactly what you might expect, so let’s see how they work.\n\nWhat are Bitcoin Smart Contracts and How Do They Work?\n\nBitcoin smart contracts, like their counterparts on other networks, are simply pieces of code that automatically execute when some predefined conditions are met. So, you can imagine, they work in a similar way.\n\nFirstly, it’s important to know that Bitcoin operates using its own computing language: Script. And script uses something like a lock and key system to execute smart contracts. The sender sets a condition or rule in order for the transaction to be processed — acting as the lock. To follow, the recipient must provide a matching “key” —also a piece of code in Script—that fulfills the condition set by the sender.\n\nNow, what kind of conditions can be set?\n\nLet’s find the answer to this by exploring the various types of smart contracts present on Bitcoin.\n\nTypes of Bitcoin Smart Contracts\n\nPay-to-public key hash scripts (P2PKH)\n\nThis is the most common type of transaction. The sender addresses Bitcoin to the receiver’s public key’s hash. To access the funds, the receiver must prove they own the corresponding private key.\n\nThis is like locking a box and giving the key to one person.\n\nMultisignature scripts (MultiSig)\n\nMultiSig requires more than one signature for a transaction to be valid. An example is a 2-of-3 MultiSig, which needs at least two signatures from a group of three to execute a transaction. This adds an extra layer of security and is often used by businesses.\n\nThis is like a safe that needs two or more keys turned at the same time.\n\nTime Locked Bitcoin Transactions (nLockTime and nSequence)\n\nThis allows a transaction to be created at any given time, but only be valid at a specified future date or block height. It’s a way to ‘postdate’ a Bitcoin transaction and is useful for various financial agreements. It’s a sort of timelock that pertains to transactions.\n\nTime-locked transactions were made possible with BIP-65 and BIP-112’s introduction of new opcodes concerning the ‘nLockTime’ and nSequence fields.\n\nEssentially, these opcodes allow an entry to specify the earliest time it can be added to a block—stopping the transaction from completing until a certain number of blocks, or amount of time has passed. In short, these time-locked opcodes are important, as without them the entire Lightning network could not exist!\n\nPay to Script Hash (P2SH – BIP16)\n\nInstead of locking outputs to a public key, P2SH locks them to a script’s hash. The spender needs to provide the script matching the hash and satisfy its conditions. This enables complex scripts without burdening the sender with their details. P2SH came into play with the BIP-16 upgrade.\n\nFor instance, you challenge a friend with a puzzle. If they solve it, they get the bitcoins.\n\nPay-to-taproot (P2TR – BIP341)\n\nP2TR is a privacy-preserving complex script that allows multiple parties to create a signature that looks like a single one, enhancing privacy and efficiency.\n\nIt is a combination of P2PKH and P2SH with a lot more privacy. This was part of the BIP-341 proposal, popularly known as the Taproot upgrade.\n\nMiniscript\n\nMiniscript was introduced to make the complex spending conditions (that Bitcoin was already capable of) much easier for developers to use and implement. In short, it’s a simple coding language that facilitates a number of functionalities. Essentially it allows your Bitcoin wallet to handle more advanced actions like requiring multiple keys for an account or having a wallet with some spending conditions that are only active after some amount of time.\n\nWhile this isn’t strictly a smart contract, this is one of the more flexible custody schemes miniscript offers.\n\nNow that you know about some advanced functions, let’s dig into something more tangible.\n\nWhat about NFTs on Bitcoin — do they even exist in the first place?\n\nTokens and NFTs on Bitcoin\n\nThe Ordinals protocol launched on Bitcoin in January 2023, enabling “Ordinal NFTs” by attaching data to individual Satoshis. Each Satoshi gets a unique number through an intuitive ordering system.\n\nOrdinal NFTs reside fully on the Bitcoin blockchain without the need for a separate token. However, that means, inscribed Satoshis now compete for block space on the network, resulting in a spike in network fees.\n\nBRC-20 — a token standard for Bitcoin Ordinals — uses JSON data to facilitate various token functions. At present, the BRC-20 token standard offers three primary functions:\n\nDeploy: This function allows users to create a new BRC-20 token contract.\n\nThis function allows users to create a new BRC-20 token contract. Mint: Users can use the mint function to generate a specific amount of BRC-20 tokens.\n\nUsers can use the mint function to generate a specific amount of BRC-20 tokens. Transfer: The transfer function enables users to send a certain amount of BRC-20 tokens to another address.\n\nThe BRC-20 token standard is relatively new and young. Hence, the functionalities are limited and not entirely user-friendly.\n\nBitcoin L2s or layer-2 solutions can help Bitcoin overcome this limitation.\n\nSmart Contracts on Bitcoin Layer 2s\n\nBitcoin smart contracts have limited functionalities. However, layer-2 blockchains on Bitcoin allow developers to code more complicated smart contracts.\n\nTo better understand how they work, let’s look at a few examples of Bitcoin layer 2 chains.\n\nLightning Network\n\nThe Lightning Network (LN) is a layer 2 scaling solution for Bitcoin, designed to facilitate fast and low-cost transactions by conducting most of the transactions off-chain. It operates using payment channels which are like private off-chain tunnels between users that facilitate payments.\n\nApart from instant payments and low fees, LN enables the creation of more complex smart contracts like Hashed Time-Locked Contracts (HTLCs) within “Lightning Apps” or “LApps.” These contracts are programmable, most often implemented for functions such as micropayments, instant swaps, and streaming payments.\n\nThe Lightning network is also home to Discreet Log Contracts (DLCs). To clarify these contracts allow two parties to engage in a bet, using a connection to an oracle to verify real-life events. While the oracle is crucial for the settlement of these bets, it is not directly involved in the transactions that create and settle the contract. These are directly negotiated among the parties making the bet.\n\nStacks\n\nStacks is a chain that works alongside Bitcoin. It enables developers to build smart contracts and decentralized applications (dApps) on top of Bitcoin.\n\nThey employ “Proof of Transfer” (PoX) — an approach to allowing the Stacks blockchain to process its transactions while leveraging Bitcoin’s security.\n\nSmart Contracts on Stacks\n\nUsing Stacks, developers can create a wide range of applications, from decentralized finance (DeFi) platforms to non-fungible tokens (NFTs) and decentralized social networks.\n\nIt acts as a more diverse and expansive ecosystem while maintaining the robustness and security of Bitcoin as the base layer.\n\nTwo applications of Stacks-based smart contracts on Bitcoin are:\n\nHiro Wallet: It is a non-custodial wallet enabling secure connections and transactions within the Stacks ecosystem. Bitcoin users can participate in Stacking, a reward system that distributes BTC to users for supporting the network and locking STX tokens for a specified period.\n\nBitcoin Naming Service (BNS): BNS, a decentralized name system for Bitcoin, similar to Ethereum’s ENS, saw a recent surge in registrations. To own a BTC name, users have to interact with the smart BNS contract on the Stacks chain.\n\nStart using smart contracts on Bitcoin\n\nUnderstanding how Bitcoin smart contracts work is imperative to participate safely in crypto and DeFi. It’s even better when a user can understand smart contract code to assess if a smart contract is safe to interact with.\n\nAnd as with using smart contracts on any blockchain, you should prioritize the security of your private keys. The best way to do that is to use Bitcoin applications through a hardware wallet like Ledger.\n\nLedger hardware wallets keep private keys offline at all times and also enable clear signing. This helps users clearly read the transaction details before they approve it.\n\nMoreover, Ledger hardware wallets offer support to Hiro Wallet by which users can pair them and start stacking STX and delegating them to trustworthy validators.\n\nNow you know everything about smart contracts on Bitcoin, you’re ready to dive in. So get yourself a Ledger, connect to Ledger Live, and start exploring the Bitcoin ecosystem. The time for education is now, and accessing Bitcoin from the Ledger ecosystem is secure and easy to understand."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI0L2FudG1pbmVyLWZvdW5kcnktYmF0dGxlLWluLWhhc2hyYXRlLXdhci1hcy1iaXRjb2luLWV0Zi1uZWFycy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yNC9hbnRtaW5lci1mb3VuZHJ5LWJhdHRsZS1pbi1oYXNocmF0ZS13YXItYXMtYml0Y29pbi1ldGYtbmVhcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's Hashrate War Between Antpool and Foundry Intensifies as BTC ETF Nears - CoinDesk",
        "content": "\"We expect miners would only sell just enough bitcoins to keep the business operating before any bitcoin ETFs are approved or just keep the coins and borrow to pay,\" Hu said. \"The halving event will double the production costs, so it is in the miner’s best interest to get the latest model of machine to lower the cost and earn more market share.\""
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY0NDgxL2JpdGNvaW4tdXNlci1vdmVycGF5cy0zLW1pbGxpb24taW4tZmVlcy1mb3ItYS1zaW5nbGUtdHJhbnNhY3Rpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin user overpays $3 million in fees for a single transaction - The Block",
        "content": "A Bitcoin BTC -2.26% user appears to have accidentally paid a transaction fee of over $3.1 million today, setting a new record in U.S. dollar terms for a single Bitcoin transaction, more than six times the previous record of a $500,000 fee paid in September.\n\nThe transaction was made at 9:59 a.m. UTC, paying 83.65 BTC ($3.1 million) to transfer 55.77 BTC ($2.1 million). The pre-transaction balance was 139.42 BTC ($5.2 million), with the user overpaying by 120,528 times, according to Bitcoin explorer Mempool.\n\nThe address used to make the payment was activated earlier today, making three Bitcoin transactions before a fourth incurred the record fee. The receiving address is also relatively new, dating back to October 16.\n\nThe transaction was mined by AntPool in block 818,087, according to the blockchain explorer Blockchair. AntPool has not yet publicly commented on the transaction and did not immediately return a request for comment from The Block.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nPaxos’ $500,000 fee was returned\n\nThe previous record $500,000 fee paid in September was subsequently identified as a “fat finger” overpayment by the crypto services provider Paxos. F2Pool, the miner facilitating that transaction, agreed to reimburse the fee to Paxos.\n\nThe entity behind this latest transaction fee remains unknown. It is also unclear whether AntPool would be willing to come to a similar agreement."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vbmV3cy55YWhvby5jb20vYml0Y29pbi1taW5pbmctcmF0ZS1oaXRzLXRpbWUtMTkyOTM2OTYwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin mining rate hits all-time high amid record-breaking prediction for 2024 - Yahoo News",
        "content": "Bitcoin is trading at its highest level in more than 18 months, with its price up more than 100 per cent since the start of 2023.\n\nThe rally has pushed bitcoin’s market cap above $700 billion and the overall crypto market close to $1.5 trillion. The figure is still a long way from its all-time high of around $3 trillion, which was reached at the end of 2021, however some crypto analysts believe the recent gains are the beginning of another record-breaking run.\n\nBitcoin’s hash rate – which denotes how much computing power is required to verify transactions and generate new units of the cryptocurrency through a process called mining – hit a record high this week, according to data from Blockchain.com.\n\nThis signals a resilient network, with hopes of future price gains attracting an increasing number of miners. Recent reports have revealed significant investment in cryptocurrency mining from both state-backed and commercial ventures.\n\nTether, the issuer of the stablecoin USDT is planning to invest $500 million in mining, while satellite imagery analysed by Forbes suggests Bhutan’s government is establishing a massive bitcoin mining operation in the foothills of the Himalayas.\n\nSeparate data reveals that miners have been profiting from cheap energy sources to reduce their average BTC production cost by 35 per cent from $21,100 to $13,800.\n\n“This data underscores a considerably stronger profitability in the mining sector compared to the challenges experienced throughout 2022 and part of 2023,” said research analyst Matteo Greco from the fintech investment firm Fineqia International.\n\nIn roughly six months, bitcoin will undergo an event known as a “halving”, which will see the amount of new bitcoins awarded to miners cut by half.\n\nThe event was hardcoded into bitcoin’s underlying blockchain by its pseudonymous creator Satoshi Nakamoto, who introduced it as an anti-inflationary measure when the cryptocurrency first launched in 2009.\n\nTaking place approximately every four years, the build up to the halvings have traditionally been the most profitable time for crypto investors.\n\n“Buy bitcoin six months before a halving and sell 18 months after a halving has historically beaten ‘buy and hold’ trading strategy,” Dutch crypto trader PlanB wrote earlier this year. “The next halving is April 2024... Will this strategy work again?”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIzL2JpdGNvaW4tc2VuZGVyLXN0cnVjay13aXRoLTMxbS10cmFuc2FjdGlvbi1mZWUtbGFyZ2VzdC1pbi1oaXN0b3J5L9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIzL2JpdGNvaW4tc2VuZGVyLXN0cnVjay13aXRoLTMxbS10cmFuc2FjdGlvbi1mZWUtbGFyZ2VzdC1pbi1oaXN0b3J5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Sender Struck With $3.1M Transaction Fee, Largest in History - CoinDesk",
        "content": "The sender's wallet was set up just minutes before the transfer, and the recipient received only 55.78 BTC of the original 139.42 BTC that was sent."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJsYWNrcm9jay1zZWMtZXRmLWJpZC0wOTEzNDI5MTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin rises after BlackRock meets SEC about ETF bid - Yahoo Finance",
        "content": "Bitcoin has risen by almost 3% in the past 24 hours. Photo: Getty (d3sign via Getty Images)\n\nBitcoin has broken back through the $37,000 (£29,561) mark, rising by almost 3% in the past 24 hours. The uptick comes after representatives from BlackRock (BLK) and the Nasdaq (^IXIC) met with the US Securities and Exchange Commission (SEC) to discuss the asset manager's spot bitcoin ETF filing.\n\nA spot bitcoin ETF is a financial product that investors hope will open the gateway for mainstream capital to flood the crypto market.\n\nRead more: Crypto live prices\n\nAfter the news of the BlackRock meeting, the world's largest cryptocurrency by market cap (BTC-USD) is now changing hands for $37,345, according to CoinGecko.\n\nBlackRock representatives meet with the SEC\n\nAccording to an SEC memorandum, BlackRock had a meeting with the financial regulatory body about their proposed spot bitcoin ETF product, called the iShares Bitcoin Trust.\n\nRead more: Spot bitcoin ETF approval unlikely this year, says analyst\n\nThe details of the meeting include a presentation on how BlackRock could use an in-kind or in-cash redemption model for its iShares Bitcoin Trust.\n\nThe memorandum from the SEC did not indicate how the regulator responded to BlackRock's proposed redemption models.\n\n\"Looks like BlackRock also met with SEC! There’s a couple slides in relation to in-kind vs cash creation. Based on this it looks like BlackRock prefers in-kind for their bitcoin ETF, makes sense as its probably cleanest structure for them and end investors,\" Bloomberg analyst James Seyffart posted on X.com.\n\nSEC also held ETF meeting with Grayscale\n\nSeyffart referred to another spot bitcoin ETF meeting that occurred this week between the SEC and another fund manager. SEC officials met with Grayscale representatives on Monday as part of the firm’s bid for listing a spot bitcoin ETF.\n\nAccording to that memorandum from the SEC, Grayscale CEO Michael Sonnenshein, legal chief Craig Salm and other executives met with the SEC’s division of trading and markets. The memo said discussions “concerned NYSE Arca, Inc.’s proposed rule change to list and trade shares of the Grayscale Bitcoin Trust (BTC) under NYSE Arca Rule 8.201-E.”\n\nStory continues\n\nRead more: Institutional investment brings new momentum to crypto\n\nThe meetings between the SEC and fund managers have been interpreted by analysts as signaling progress toward potential approval of a spot bitcoin ETF filing.\n\nIn late August of this year, Grayscale Investments won a key legal battle in its struggle to convert its Grayscale Bitcoin Trust (GBTC) into an exchange-traded fund (ETF).\n\nOn August 29, Judge Neomi Rao of the US District of Columbia Court of Appeals ruled that the SEC was incorrect in rejecting Grayscale’s application to convert the GBTC into a spot ETF. The SEC had initially rejected the application in June 2022, citing insufficient safe practices and fraud protection mechanisms.\n\nAdvantages of a spot bitcoin ETF\n\nThe approval of a spot bitcoin ETF could bestow several advantages on the cryptocurrency sector. Firstly, the regulatory oversight of such an ETF under the jurisdiction of the SEC would contribute to bitcoin's credibility.\n\nRead more: US crypto crackdown 'an opportunity for the UK'\n\nAdditionally, the accessibility of ETFs to the general public would facilitate more widespread bitcoin investment. The SEC's role in upholding rigorous standards is seen as a factor that enhances investor protection.\n\nAn approval of a spot Bitcoin ETF also holds the potential for substantial investments from pension and mutual funds, potentially directing billions into the cryptocurrency market and fostering institutional adoption.\n\nWatch: US crypto crackdown 'an opportunity for the UK' | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIzL2NyeXB0by1mb3ItYWR2aXNvcnMtaXMtYml0Y29pbi1mb3IteW91L9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIzL2NyeXB0by1mb3ItYWR2aXNvcnMtaXMtYml0Y29pbi1mb3IteW91L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Crypto for Advisors: Is Bitcoin for You? - CoinDesk",
        "content": "Building a diversified portfolio with compelling returns has gotten harder. The classic 60/40 portfolio of stocks and bonds will struggle to produce returns comparable to the last 40 years. We believe there is simply no room for valuations to expand: equity multiples are already high and the secular bull market in bonds is over (attributable to a bottoming in consumer price inflation). Stocks and bonds are also now more correlated, so investors get fewer diversification benefits from pairing them together. Opportunities in public markets are shrinking, too: compared to the 1990s, there are fewer IPOs and the number of listed firms has declined by around 30%."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjMvYmluYW5jZXMtYml0Y29pbi1yZXNlcnZlcy1kcm9wLWFzLXJldGFpbC1mbG93LW1vdmVzLXRvLWNvaW5iYXNlLWNyeXB0b3F1YW50L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjMvYmluYW5jZXMtYml0Y29pbi1yZXNlcnZlcy1kcm9wLWFzLXJldGFpbC1mbG93LW1vdmVzLXRvLWNvaW5iYXNlLWNyeXB0b3F1YW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Binance's Bitcoin Reserves Drop as Retail Flow Moves to Coinbase: CryptoQuant - CoinDesk",
        "content": "CryptoQuant data shows that exchange reserves of bitcoin have been steadily decreasing throughout the year, which is considered to be a bullish sign. However, some analysts say that since last year's collapse of FTX, trust in centralized exchanges has diminished and investors are keeping their holdings elsewhere."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi10b3VjaGVzLTM4ay1vbi1xdWlldC1ob2xpZGF5LXdlZWtlbmQv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8yNC9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLXRvdWNoZXMtMzhrLW9uLXF1aWV0LWhvbGlkYXktd2Vla2VuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Touches $38K on Quiet Holiday Weekend - CoinDesk",
        "content": "A significant number of Grayscale Bitcoin Trust (GBTC) shares have been bought in the secondary market this year at a deep discount to net asset value in anticipation the trust’s conversion to an exchange-traded fund (ETF) will be approved by the U.S. Securities and Exchange Commission (SEC), JPMorgan said in a research report Thursday. The bank estimates a net $2.5 billion has flowed into GBTC since the start of the year, increasing to $2.7 billion if adding the covering of short interest. “Assuming this buying flow was mostly speculative in anticipation of GBTC being converted to an ETF, then it is likely that this $2.7b would come out of GBTC as these investors take profit once GBTC gets converted,” analysts led by Nikolaos Panigirtzoglou wrote."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXN1cGVyY3ljbGUtMjAyNC1pbnZlc3RtZW50LXRyYWRpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin supercycle 2024: Is this the cycle to end them all? - Cointelegraph",
        "content": "The conventional wisdom of the cryptoverse is that there is a boom-and-bust cycle to the blockchain and cryptocurrency industry. This cycle is led by the “King of Cryptos,” Bitcoin.\n\nBitcoin (BTC) is programmatically set to have a halving cycle roughly every four years, which cuts the supply of new coins awarded to miners in half. The halving sends a supply shock to the market, and as seen in the past three cycles, this under- and overvaluation in the market is partially responsible for the dramatic ups and downs.\n\nOther factors also play critical roles in this cycle, including overall network adoption, expanded use cases for Bitcoin — like the Lightning Network for scalability and Ordinals for nonfungible tokens — and the ever-popular “institutional adoption.”\n\nIn 2020, Dan Held, a Bitcoin educator and marketing adviser for Trust Machines, predicted that Bitcoin would eventually see a “supercycle,” citing the increased value of the network as adoption grows (Metcalfe’s law), increased scarcity due to the halving and increased institutional adoption.\n\nThis supercycle will, theoretically, see Bitcoin run up to new all-time highs, from which there will be no further downside, as there will be enough adoption and institutional support to continue to prop up the price.\n\nCrypto winter sets in at the end of 2021\n\nThis support did not occur in the last cycle, and Bitcoin fell from its all-time high of $69,000 at the end of 2021, bringing the rest of the market down with it. All those factors of reduced supply, greater network growth, and more business and institutional support were not enough to support the meteoric rise.\n\nInstitutional support was growing so much during the last leg of the cycle that exchange-traded funds (ETFs) were approved around the world. The first physically-backed BTC ETF was launched in Canada in February 2021 by Purpose Investments.\n\nSince then, Canada has also approved the CI Galaxy Bitcoin ETF and Evolve Bitcoin ETF. In Germany, there is the ETC Group Physical Bitcoin ETF, while Brazil and Australia also launched spot Bitcoin ETFs in 2021 and 2022. Yet these products did not provide the institutional support many believe will come from ETFs.\n\nHowever, the various stock markets worldwide do not compare to the United States.\n\nThe European Union makes up 11.1% of global equity markets, while Australia and Canada make up 1.5% and 2.7%, respectively. All these markets combined are dwarfed by the United States, which comprises 42.5% of all global equity markets.\n\nThis does lend some weight to the idea that this cycle may hold the promise of Held’s “Bitcoin supercycle,” as the largest country in all global equity markets may soon allow spot Bitcoin ETFs to trade.\n\nBlackRock, one of the most prominent names in asset management and investment circles, applied for its own spot Bitcoin ETF in June 2023, providing a kind of green light for other institutions to start getting involved. However, institutions are only one factor here.\n\nAdoption may be an emerging market trend\n\nAccording to Chainalysis’ recent “2023 Geography of Cryptocurrency Report,” India, Nigeria and Vietnam were the top three countries for crypto adoption in 2023. The rankings were based on an index score that looked at centralized services, retail services, peer-to-peer (P2P) exchange trade volume, decentralized finance (DeFi) and retail DeFi value received.\n\nThe U.S. makes up North America’s largest percentage of transaction volume, and the country ranked fourth overall. As the chart below shows, North America had the largest percentage of large institutional transfers but some of the lowest amounts of small and large retail.\n\nRecent: Former Coinbase exec posits blockchain-driven vision of future societies\n\nThis differentiation is important, as the market value of a commodity is not derived from centralized entities but rather from decentralized independent actors perceiving value in the commodity. As the Chainalysis report and Cointelegraph Research’s recent “Investing in DeFi” report suggest, investing in Bitcoin and other cryptocurrencies is akin to emerging markets investing at this stage in the adoption cycle.\n\nParticipants, not institutions, bring value\n\nWhile institutional adoption will undoubtedly be an essential factor if and when the Bitcoin supercycle takes hold, Bitcoin itself needs to have perceived value from market participants, or it will not have the staying power. History is replete with examples of thriving industries that were superseded by a new technology the market found helpful and that toppled giants practically overnight.\n\nThe introduction of petroleum products completely overturned the whaling industry in the mid-1800s. There was a vast industry and institutions behind global whaling interests with boats, trade and infrastructure. Still, no matter how much money was behind it, the market saw better use with the new products.\n\nMore recently, and closer to the technological innovation led by the blockchain revolution, the dot-com bubble of the mid-1990s and early 2000s saw various companies overvalued. Part of the overvaluation was based on the assumption that adoption would be more rapid than what actually happened.\n\nSignals such as the internet browser Netscape seeing 3 million downloads in three months had investors excited about what the rest of the industry could do.\n\nIn 1995, Netscape had a successful initial public offering, backed by institutions like Morgan Stanley, which pushed the stock price from $14 to $28 — valuing the not-yet profitable 16-month-old company at over $1 billion.\n\nInvestors kept looking for the next Netscape among the slew of Silicon Valley companies, and money poured into the space. In economics, the very height of the boom cycle, where overvaluation is at its apex just before the bust, is called the “Minsky moment.”\n\nThe dot-com bubble’s Minsky moment came in 2002. There was a ton of investor sentiment and institutional money flowing around, but there was no underlying adoption of many of the companies that saw investments. Nothing was ultimately there to support these companies and their value.\n\nThe Nasdaq Stock Market rose dramatically between 1995 and 2000, peaking in March 2000 at 5,048.62 before falling 76.81% to 1,139.90 in October 2002. Without customers and the actual usage of these firms’ services in the market, there was nothing to keep the overvaluation afloat.\n\nWhat does this mean for Bitcoin?\n\nAccording to Chainalysis, “There’s no sugarcoating it: Worldwide grassroots crypto adoption is down.” However, as stated previously, lower-middle-income (LMI) countries — like India, Nigeria and Ukraine — have seen increased adoption.\n\n“LMI is the only category of countries whose total grassroots adoption remains above where it was in Q3 2020, just before the most recent bull market,” its report states.\n\nWhile the United States may be fourth in terms of crypto adoption, it’s not driven by P2P Bitcoin transactions, as the U.S. ranked 12th in that category.\n\nRather, stablecoin trading took the lion’s share of transactions, with Bitcoin generally trading less than altcoins. Bitcoin is not currently a widespread medium of exchange in America.\n\nThis is not due to Bitcoin’s lack of perceived value on the market but rather the lack of necessity for Americans to use it for payments.\n\nLMI countries are seeing greater adoption due to high inflationary monetary issues within their respective countries, and Bitcoin, as much as it fluctuates, can be a better alternative than holding domestic currency.\n\nAs the world continues with the trend of dedollarization, the flight to safety could be Bitcoin.\n\nCould this happen in the United States as well?\n\nThe three major credit rating firms — Standard and Poor’s (S&P), Moody’s Investors Service, and Fitch Ratings — have all downgraded the U.S.’ credit rating.\n\nIn August 2011, S&P lowered the U.S. credit rating from AAA to AA+. Fitch followed suit in August 2023. And on Nov. 10, 2023, Moody’s lowered its outlook on the U.S. credit rating from “stable” to “negative,” citing growing deficits and decreased ability to pay back the national debt.\n\nThe drops in credit ratings signal decreasing confidence in the U.S. and, by extension, the standing of the U.S. dollar being the central unit of account for global settlement.\n\nIf hyperinflation starts to rear its head in the U.S., it is possible that alternatives will be used instead of holding onto cash.\n\nChances are it’s super early in this cycle\n\nWhile Held introduced the idea of a Bitcoin supercycle, he has frequently said that people are still early in terms of getting into stacking sats. While increased institutional adoption may give Bitcoin a rise in fiat value and greater routes for investment, all the following elements must be in play for the supercycle to be in full swing:\n\nInstitutional demand: Assuming BlockRock and the other financial powerhouses are granted spot Bitcoin ETFs in the U.S., the amount of investment from institutions, family offices, sovereign wealth funds and high-net-worth individuals could give Bitcoin support in raising the fiat value to a certain level. Galaxy Digital, for example, predicts this will bring Bitcoin up to around the $59,000 level.\n\nSupply: The next Bitcoin halving event will occur around April 2024 at block height 840,000, and 96.9% of all the existing BTC will have been mined. This means the supply part of the supercycle equation is checked. Even if grassroots demand stays the same, this would indicate a higher fiat price. Still, as was seen in previous cycles, a price increase (“number-go-up” technology) will likely increase demand, at least in the short term, due to fear of missing out.\n\nAdoption: While some may buy Bitcoin for “number-go-up” reasons, its actual use will give it a long-term value proposition. It is yet unknown whether America’s economic and sociopolitical climate will nudge people to adopt Bitcoin as a medium of exchange, a store of wealth or a hedge against further dollar inflationary pressure.\n\nWhat are the probabilities of a 2024 Bitcoin supercycle?\n\nCointelegraph asked billionaire venture capitalist and serial blockchain investor Tim Draper what he thought the possibilities were for a 2024 Bitcoin supercycle. According to him, “I think it will be the following cycle, when we can run our businesses unimpeded by regulatory uncertainty, where we can buy our food, clothing, shelter and taxes all in Bitcoin.”\n\nJulian Liniger, CEO of Bitcoin-only exchange Relai, told Cointelegraph that the market “will see a drastic reduction in supply due to the upcoming halving, while Bitcoin ETFs and the generally increasing interest in the asset Bitcoin mean a significantly higher demand.”\n\nLiniger added that factors like a loss of confidence in fiat currencies, increased banking oversight and the collapse of exchanges like FTX “strengthen the Bitcoin narrative.”\n\nMagazine: This is your brain on crypto: Substance abuse grows among crypto traders\n\n“With BlackRock and other major players on board, I also think it’s not unlikely that we will see a radical 180-degree turn in the public perception of Bitcoin. Instead of a speculative asset that consumes as much electricity as entire countries, Bitcoin could soon be seen as a safe haven promoting the transition to renewable energies,” he said.\n\nBitget managing director Gracy Chen told Cointelegraph that in order for the supercycle to happen, “The market needs ample funds to counter negative sentiments. Firstly, reestablishing easy access channels between traditional finance and the crypto market, especially after the suppression of three crypto-friendly banks. Secondly, global governments, including the U.S., must officially recognize Bitcoin assets as equal to gold and stocks. This involves removing restrictions on the trading and holding of Bitcoin for the general public. Such integration with traditional finance provides the foundation for widespread Bitcoin adoption and creates favorable conditions for the Bitcoin superycle to materialize.”\n\nThe Bitcoin supercycle is likely not upon the world for this continued adoption cycle. There is simply too much speculation over adoption and daily usage happening globally for the asset to have no or just a soft correction to cushion the fall once the Minsky moment pops the bubble. 2028, on the other hand, may be a different story altogether.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjMvZmlyc3QtbW92ZXItYW1lcmljYXMtdW5pc3dhcHMtdW5pLXJhbGxpZXMtYW5kLWJpdGNvaW4taG9sZHMtMzdrL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjMvZmlyc3QtbW92ZXItYW1lcmljYXMtdW5pc3dhcHMtdW5pLXJhbGxpZXMtYW5kLWJpdGNvaW4taG9sZHMtMzdrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "First Mover Americas: Uniswap’s UNI Rallies and Bitcoin Holds $37K - CoinDesk",
        "content": "Uniswap, a decentralized exchange built on Ethereum, has seen its governance token, UNI, rally over the past 24 hours. UNI climbed over 15%, outperforming the rest of the crypto market. There's no clear reason for the jump, but it could have something to do with the proposal submitted by StableLab (a governance service provider) that seeks to delegate 10 million UNI from the DAO’s treasury to underrepresented delegates. The proposal is awaiting an on-chain vote. Other altcoins also rallied, including collapsed crypto exchange FTX’s FTT token, which gained 10% on the day. Bitcoin, the world’s largest cryptocurrency, added almost 3% and hovered around $37,400. “Technically speaking, dips have been exceptionally well supported and bitcoin looks to be readying for a push to fresh yearly highs and towards a test of next key resistance in the form of the $40k barrier,” said LMAX Digital in a morning note."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9pbmR1c3RyeS1uZXdzL25ld3MvYml0Y29pbi1idWxsLWNhdGhpZS13b29kcy1hcmstY3V0LWJhY2staG9sZGluZ3MtaW4tdG9wLXRydXN0LTI0NjIwMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin bull Cathie Wood's ARK cuts back holdings in top trust - InvestmentNews",
        "content": "While Cathie Wood has been touting her bullish stance on Bitcoin in recent months, her firm ARK Investment Management actually cut holdings in the Grayscale Bitcoin Trust.\n\nArk Next Generation Internet ETF has sold more than 700,000 shares of Bitcoin Trust since Oct. 23, according to the ETF provider’s daily trading data compiled by Bloomberg. It offloaded 36,168 shares on Wednesday. Bitcoin Trust enables investors to gain exposure to Bitcoin in the form of security.\n\nThe sales have taken place even as Bitcoin rose to its highest level since May 2022 earlier this month, rallying despite the uncertainty caused by policymakers taking action against crypto founders Changpeng “CZ” Zhao of Binance Holdings Ltd. and Sam Bankman-Fried of FTX. The cryptocurrency has more than doubled this year.\n\nArk’s officials didn’t respond to Bloomberg’s e-mailed queries. US markets were closed for a Thanksgiving holiday on Thursday.\n\nWood touted Grayscale Bitcoin Trust as her top pick at the Sohn Australia conference at the Sydney Opera House on Friday, according to the Australian Financial Review. Ark was the fourth largest holder of the trust with 5.6 million units as of Sept. 30, data compiled by Bloomberg show.\n\nThe daily trading updates from Ark show only active decisions by the management team and do not include creation or redemption activity caused by investor flows. Ark’s internet ETF is up 65% for the year compared with a 46% advance in the Nasdaq 100 Index."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXVzZXItcGF5cy0zLTFtLWluLXRyYW5zaXRpb24tZmVlLWZvci1vbmUtMTM5LWJ0Yy10cmFuc2ZlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin user pays $3.1M transaction fee for 139 BTC transfer - Cointelegraph",
        "content": "A Bitcoin user paid 83.7 Bitcoin (BTC), worth $3.1 million, in transaction fees for transferring 139.42 BTC. The transaction fee of $3.1 million is the eight-highest in Bitcoin’s 14-year history.\n\nThe BTC wallet address bc1qn3d…wekrnl tried transferring 139.42 BTC to bc1qyf…km36t4 on Nov. 23, only to pay more than half the actual value in the transaction fee. The destination address received only 55.77 BTC. The mining pool Antpool captured the absurdly high mining fee on block 818087.\n\nAntpool mining reward history. Source: Mempool\n\nUsers on social media suggested that the sender may have selected the high transaction fee, but the replace-by-fee (RBF) node policy and the sender’s unawareness also appear to have played a part. RBF allows an unconfirmed transaction in the mempool to be replaced with a different transaction that pays a higher transaction fee to get it cleared earlier. The mempool is where all BTC transactions are queued before approval and addition to the Bitcoin blockchain.\n\nA mempool developer who goes by mononaut on X (formerly Twitter) said the user behind the transfer probably didn’t know RBF orders cannot be canceled. The user might have repeatedly replaced the fees in hopes of canceling it. The RBF history indicates that the last replacement increased the fee by another 20%, adding 12.54824636 BTC in fees.\n\nRBF history of the 83.7 BTC transaction fee. Source: Mempool\n\nThis is not the first time a Bitcoin user accidentally sent an absurdly high transaction fee for a single Bitcoin transaction. In September, Bitcoin exchange platform Paxos accidentally sent a $500,000 transaction fee for a $2,000 BTC transfer. In that incident, the F2Pool miner who verified the transaction returned the $500,000 accidental transaction fee to Paxos.\n\nHowever, this is the largest Bitcoin transaction fee ever paid in dollar terms, knocking the September Paxos transfer of $500,000 off its unfortunate podium. The largest fee in Bitcoin terms was paid in 2016 when someone accidentally sent 291 BTC in transaction fees.\n\nRelated: Binance’s DOJ settlement offers a glimmer of hope for the crypto industry\n\nMononaut told Cointelegraph that although the current instance of an accidental transaction fee has similarities to the Paxos case, the possibility that Antpool would return the funds would depend on their own payout policies, ”which might have implications for what obligations they have to share transaction fees with their miners.”\n\nAntpool has yet to comment on the issue and has yet to respond to Cointelegraph’s requests for comments.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NyeXB0by1ldGYtdXBkYXRlcy10aGFua3NnaXZpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETFs might come up at Thanksgiving — here's what to say - Blockworks",
        "content": "“So I heard BlackRock launched a bitcoin ETF,” your uncle might say at the Thanksgiving table.\n\nHow will you respond?\n\nWell, first you can clarify that he (let’s call him Jim) means an ETF, or exchange-traded fund. And while the asset management giant indeed wants to bring such a product to market, it does not yet have approval.\n\n“Oh, I see,” Uncle Jim says as he collects another forkful of mashed potatoes. “I can’t say I know much about it beyond all the headlines.”\n\nHe’s right — the story has been the subject of numerous stories in recent months. Yet, misconceptions persist.\n\nBlackRock is not the only one pursuing a bitcoin ETF. About a dozen companies — including Ark Invest and 21Shares, as well as Fidelity, Invesco and Bitwise — have similar proposals before the US Securities and Exchange Commission.\n\nGrayscale Investments has said its Bitcoin Trust (GBTC) is ready to operate as an ETF upon receipt of necessary regulatory approvals.\n\nYour dad’s brother then asks: “So, do you think this whole bitcoin ETF thing will happen then? And what’s the big deal anyway?”\n\nRead more: To gauge impact of bitcoin spot ETF, analysts look to gold\n\nFeel free to opine on the topic if you wish. But here are some facts to have at the ready.\n\nFirst, the SEC has consistently blocked bitcoin ETFs from coming to market for a decade or so. These funds, if approved, would hold BTC directly and give investors exposure to the asset within an investment vehicle accessible via traditional brokerage accounts.\n\nETFs — which hold roughly $7 trillion in assets — are a tool used by retail investors and financial advisers alike.\n\nBloomberg Intelligence analysts say they think the chance of spot bitcoin ETF approval by Jan. 10 — the SEC’s deadline to rule on a bitcoin ETF proposal by Ark Invest and 21Shares — is 90%.\n\nLoading Tweet..\n\n“But what are they basing that on?” Uncle Jim asks. “Why would the SEC all of a sudden approve a bitcoin ETF?”\n\nThere are a few factors at play here, and you could explain — if he has the patience to listen, since Ol’ Jim’s eyes may have found the Lions game on the television behind you. Perhaps Jared Goff connected with Amon-Ra St. Brown for a go-ahead score. When did Detroit’s football team get good?\n\nBut back to bitcoin ETFs — what’s different now?\n\nBlackRock filing for a spot bitcoin ETF in June certainly turned heads. The company manages more than $9 trillion in assets and has only ever had one product proposal denied by the SEC in nearly 600 attempts, according to Bloomberg Intelligence data. BlackRock’s push spurred a new wave of bitcoin ETF proposals across the financial sector.\n\nElsewhere, Grayscale won a court case against the SEC in August — a ruling that limits the criteria on which it would be able to deny the conversion of the Grayscale Bitcoin Trust (GBTC) to an ETF, should it try to do so again.\n\nThe SEC had a chance to challenge the legal decision as late as last month, but opted not to.\n\nBeyond that, fund issuers have amended their bitcoin ETF proposals, signaling an ongoing dialogue with the SEC.\n\nLoading Tweet..\n\n21Shares president Ophelia Snyder said during a Monday interview on Bloomberg TV that there has been a “pattern break” as issuers have begun to offer more information on what these products would look like.\n\n“That’s really positive, because, very candidly, change in behavior might actually result in a change of outcome,” Snyder added.\n\nAs recently as Monday, members of the SEC’s division of trading and markets met with executives from BlackRock and Nasdaq about the proposed iShares Bitcoin Trust.\n\n“I guess only time will tell,” Uncle Jim concludes at the dinner table, seemingly ready to move on to dessert.\n\nRight he is.\n\nThe table topic indeed shifts. Your sister was asked about her love life. Someone just brought up the 2024 presidential election.\n\nIs it time for pie yet?\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzI0L2dyYXlzY2FsZS1iaXRjb2luLXRydXN0LWNvdWxkLXNlZS0yN2Itb2Ytb3V0Zmxvd3MtaWYtZXRmLWNvbnZlcnNpb24taXMtYXBwcm92ZWQtanBtb3JnYW4v0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvZ3JheXNjYWxlLWJpdGNvaW4tdHJ1c3QtY291bGQtc2VlLTI3Yi1vZi1vdXRmbG93cy1pZi1ldGYtY29udmVyc2lvbi1pcy1hcHByb3ZlZC1qcG1vcmdhbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Grayscale Bitcoin Trust Could See $2.7B of Outflows if ETF Conversion Is Approved: JPMorgan - CoinDesk",
        "content": "“If this $2.7b exits completely the bitcoin space then such an outflow would of course put severe downward pressure on bitcoin prices,” the authors wrote. “If instead most of this $2.7b shift into other bitcoin instruments such as the newly created spot bitcoin ETFs post SEC approval, which is our best guess, then any negative market impact would be more modest.”"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3NhY29ic2VydmVyLmNvbS8yMDIzLzExL29waW5pb24tYmxvY2tjaGFpbi10aGUtYmFja2JvbmUtb2YtYml0Y29pbi1oYXMtcG93ZXItdG8taW5jcmVhc2UtYWNjb3VudGFiaWxpdHktYW5kLXRyYW5zZm9ybS1pbmR1c3RyaWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Opinion: Blockchain, the Backbone of Bitcoin, Has Power to Increase Accountability and Transform Industries - Sacramento Observer",
        "content": "By Samuel Houston | Special to California Black Media Partners\n\n(WIB) – The rise of cryptocurrencies and blockchain technology has sparked a revolution that holds the promise of greater financial accountability. While many may view cryptocurrencies as nothing more than speculative assets, to better understand the transformative power they have, it is crucial to delve deeper into the underlying blockchain technology that supports them.\n\nBlockchain, the technology underpinning cryptocurrencies like Bitcoin and Ethereum, is essentially a decentralized ledger that records all transactions across a network of computers. This ledger is immutable and transparent, making it virtually tamper-proof. Transactions are grouped into “blocks,” and each block is linked to the previous one, forming a chain of blocks, hence the name “blockchain.”\n\nIt’s common to hear people talk about investing in cryptocurrencies without fully comprehending the intricacies of blockchain technology. While it’s not necessary for every user to be a blockchain expert, a basic understanding of how it works can help one appreciate the significance of this innovation.\n\nOne of the most compelling aspects of blockchain technology is its wide range of use cases. Beyond serving as the backbone of cryptocurrencies, blockchain has the potential to revolutionize various industries, including agriculture, entertainment, real estate, and retail.\n\nIn the agricultural industry, it enables the tracking of agricultural products from farm to table, recording information such as seed quality, crop growth, and the journey of a plant post-farm. This transparency ensures the authenticity of food products, reduces fraud, and enhances food safety. TE-FOOD has already revolutionized the tracing application\n\nof blockchain technology, providing over 150 million people access to farm-to-table foods across the globe.\n\nBlockchain-based platforms are revolutionizing the entertainment industry by ensuring fair compensation to artists and content creators through smart contracts, eliminating intermediaries. Artists and creators can receive fair compensation for their work through transparent and automatic royalty payments, eliminating intermediaries who often take a substantial cut. Companies like Hollywoodland and Decentralized Pictures are even leveraging crypto tokens and blockchain to identify emerging talent and finance projects.\n\nReal estate transactions frequently entail multiple intermediaries, leading to high fees and lengthy processes. However, blockchain technology can greatly simplify property transactions, rendering them more efficient, secure, and cost-effective. For instance, Docuwalk by ShelterZoom used blockchain to oversee every facet of the real estate offer and acceptance procedure. This secure online platform meticulously documents each step in the journey towards finalizing a real estate deal, thereby guaranteeing an immutable financial record, and enhancing consumer protection.\n\nConsumers are already reaping the rewards of blockchain technology within the retail sector. Starbucks has leveraged blockchain technology to enhance customer satisfaction through a loyalty program that enables customers to accumulate rewards points from every purchase made at their stores. These accumulated points can later be redeemed for valuable rewards. Similarly, Walmart has adopted blockchain technology to offer loyalty programs, granting reward points to all customers who make purchases at their stores.\n\nOne of the key features of cryptocurrency that often comes under scrutiny is its financial accountability. Critics argue that the decentralized nature of cryptocurrencies makes it challenging to hold individuals accountable for illicit activities. While it’s true that there is no centralized middleman, it’s essential to recognize that blockchain\n\ntechnology itself provides a level of accountability that traditional financial systems cannot match.\n\nEvery transaction on the blockchain is recorded and publicly accessible, making it possible to trace the flow of funds. This transparency can deter fraudulent activities and provide a level of financial accountability that is often lacking in traditional banking systems.\n\nCritics may contend that the absence of intermediaries means users must take responsibility for their financial transactions, which can be challenging for some. However, this very aspect empowers individuals to have greater control over their finances. With cryptocurrencies, you are your bank, and you can manage your assets directly, without reliance on third parties.\n\nCryptocurrencies and blockchain technology have ushered in a new era of financial accountability and empowerment. While it’s essential for users to educate themselves and exercise responsibility, the benefits of transparency, efficiency, and reduced reliance on intermediaries cannot be understated. Cryptocurrencies and blockchain are not merely speculative assets but represent a significant step towards a more accountable and decentralized financial future, ultimately putting power back in the hands of the people.\n\nAbout the Author\n\nSamuel Houston is a Fresno resident. He views cryptocurrency and blockchain technologies as a way for the Black community to take control of their finances and as another means to support his daughter."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qaW0tY3JhbWVyLWFkbWl0cy13cm9uZy1vbi1iaXRjb2luLW1hZGUtcHJvZml00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Jim Cramer admits he was wrong about Bitcoin — 'I was premature' - Cointelegraph",
        "content": "Markets commentator Jim Cramer has tacitly admitted he was wrong about Bitcoin (BTC), saying he was premature in calling for investors to sell the cryptocurrency.\n\nIn a Nov. 22 segment of his CNBC Mad Money show, Cramer responded to a caller who inquired about buying shares in Bitcoin miner CleanSpark, saying that anyone who likes Bitcoin should increase their exposure to it.\n\n“Look, if you like Bitcoin, buy Bitcoin. That has always been my view. And for a while, I liked it, and I decided that money had been made, but I was premature.”\n\nCramer added that despite not having made perfect calls on Bitcoin previously, he’d still “made a lot of money” from his investment in it.\n\nOn Dec. 5, 2022, when Bitcoin was trading for $17,150, Cramer urged investors to sell all their crypto investments no matter the cost, saying it was “never too late to sell an awful position.” The price of Bitcoin has rallied 118% since, with BTC currently changing hands for $37,390.\n\nCramers’ predictions, along with his on-again, off-again love-hate relationship with crypto, have become a popular meme throughout investing communities over the past few years, with many pointing out his uncanny ability to make incorrect calls at key moments.\n\nRelated: Bitcoin to $1M post-ETF approval? BTC price predictions diverge wildly\n\nIn August 2022, a crypto trader claimed to have doubled the size of his portfolio simply by trading in the opposite direction to what Cramer recommended.\n\nTwo months later, on Oct. 6, an investment fund filed for an “inverse Cramer ETF” — a financial instrument designed to return results on trades “that are approximately the opposite of, before fees and expenses, the results of the investments recommended by television personality Jim Cramer.”\n\nFinally happened: Cramer ETFs\n\n\n\nInverse Cramer ETF $SJIM\n\nLong Cramer ETF $LJIM\n\nEff Dec 19\n\n\n\n20-25 equal-weighted stocks/ETFs based on Cramer's Twitter & TV recommendations and market views. Positions exited if Cramer has no view & once profit targets met.https://t.co/ZvA5G2zoTX pic.twitter.com/tY9yBMt15s — ETF Hearsay by Henry Jim (@ETFhearsay) October 5, 2022\n\nMagazine: This is your brain on crypto — Substance abuse grows among crypto traders"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWxlaS1wcmVzaWRlbnRpYWwtZWxlY3Rpb24tYXJnZW50aW5hLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Milei presidential victory fuels optimism in Argentina's Bitcoin community - Cointelegraph",
        "content": "After a long and dramatic presidential race, libertarian candidate Javier Milei triumphed in Argentina’s presidential election on Nov. 19.\n\nMilei promises to abolish the country’s central bank, among a slew of other radical policy changes capturing the attention and imagination of the crypto community.\n\nWith 99% of the vote counted on Sunday, Nov. 19, Milei was declared the winner. The flamboyant politician secured the favor of 55% of the electorate, with three million more ballots to his name than rival Sergio Massa.\n\nFernando Nikolić, an Argentine Bitcoin (BTC) advocate and founder of media analyst firm Bitcoin Perception, told Cointelegraph that Milei “has spoken positively about Bitcoin when asked about it in interviews,” but also pointed out that enthusiasm should be tempered by the fact that “passing any sort of law that is considered ‘Bitcoin-friendly’ is not a part of his official program.”\n\nNikolić added that as an advocate for free market money, Milei is also unlikely to pass any laws that would harm Bitcoin.\n\nIván Paz, the CEO of crypto trading platform Trading Different, took a positive view of the election results. According to Paz, Milei’s free market policy agenda is likely to reinvigorate Argentina’s flagging economy.\n\n“Argentina will enter a cycle of accelerated economic recovery, driven by the confidence of local and foreign investors,” Paz told Cointelegraph. “The reduction of the tax burden and the legal guarantee will once again make Argentina an attractive country to project in the long term.”\n\nMany Argentinians now look forward to sweeping reforms. Camilo Jorajuría de León, vice-president of Bitcoin Argentina, reminded the incoming president to keep his electoral promises:\n\n“Bitcoin is for monetary freedom, and that was precisely one of the proposals of the president-elect. As Bitcoiners, we hope he fulfills his promise.”\n\nMilei’s first task in office will be taming the nation’s runaway inflation, which hit 143% in October. For comparison, United States inflation peaked at 9.1% in June 2022 and is now 3.2%. With the spending power of the Argentine peso in freefall, it’s little wonder that Argentinians voted for the candidate proposing to cut almost all public expenditure and big government.\n\nThe new politics of Argentina\n\nMilei promises to reinvent and reinvigorate Argentina’s economy with a completely new approach. The beliefs that underpin the policy agenda of the libertarian anarcho-capitalist are likely to resonate with many in the crypto community.\n\nHis headline policies include “blowing up” the central bank to prevent money printing, ditching the peso in favor of the U.S. dollar and scrapping almost every form of welfare in the country.\n\nRecent: Can blockchain supply the guardrails to keep AI on course?\n\nThe president-elect confirmed his future plan for government departments in a dramatic video circulating on social media.\n\n“Ministry of Sports and Tourism — out!” said Milei. “Ministry of Culture — out! Ministry of the Environment and Sustainable Development — out!”\n\nIn the video, Milei punctuates every cut by tearing the name of the department off a whiteboard and tossing it aside.\n\nArgentina's new president and Donald Trump fan Javier Milei has promised to radically change the country. Could he succeed? Read more https://t.co/nU9XYLTqBN pic.twitter.com/Z8gYllY4JV — TalkTV (@TalkTV) November 22, 2023\n\nMilei on Bitcoin\n\nWhile President-elect Milei may embody a maverick spirit that appeals to Bitcoiners and the ideological proclivities of the cryptosphere, that is not the same thing as actively supporting it.\n\nThe president-elect previously outlined why Bitcoin is useful as a monetary instrument free from state control. In a video posted to Reddit’s r/bitcoin 11 months ago, Milei states his position.\n\n“What is the point? The point is that the first thing we have to understand is that the central bank is a scam,” said Milei. “It is a mechanism by which politicians cheat the good people with inflationary tax. What Bitcoin is representing is the return of money to its original creator — the private sector.” Milei adds:\n\n“Bitcoin is the natural reaction against central banker scammers and to make the money private again.”\n\nThe new president may praise Bitcoin as a financial instrument, but that is somewhat different from what Bitcoin advocates may wish for. Undoubtedly, there are those who hope Argentina will adopt Bitcoin as legal tender.\n\nWhat Bitcoiners think of Melei\n\nCointelegraph asked Nikolić what the election of Milei means for cryptocurrency advocates.\n\n“I don’t believe this will drastically alter the current landscape,” Nikolić said. “Argentinians have been embracing Bitcoin and other cryptocurrencies for many years. My hope is that, in the long term, Argentina becomes more entrepreneur-friendly, prosperous and free, helping to mend the significant cracks in the country’s foundational structure.”\n\nNikolić added that the “widespread adoption of Bitcoin across the nation may be slow if 50% of its citizens live below the poverty line and lack an understanding of savings concepts.”\n\nThat’s not something that can change overnight. Milei’s policy broader economic policies will need time to bed in.\n\nAs for the million-dollar question: “Will Bitcoin become legal tender in Argentina?” Nikolić suggests that legal tender certification may be marginally less important than it seems.\n\n“I’m of the view that adoption is more robust when it emerges organically from the grassroots rather than being imposed top down. I’m hopeful that Bitcoin adoption in Argentina will continue to flourish, especially as the country progresses under Milei’s leadership and its people begin to experience improved living conditions.”\n\nThe economics of Argentina\n\nSoaring inflation is not the only problem facing Milei in government. When the president-elect takes office on Dec. 10, he will take the reigns of a country facing a laundry list of economic challenges.\n\nChief among them is the fact that Argentina is the International Monetary Fund’s (IMF) biggest borrower. The country owes the IMF a massive $31 billion.\n\nThe body gave the president a nod and a wink as early as Monday. Kristalina Georgieva, managing director of the IMF, was among those congratulating Milei on his electoral success.\n\n“We look forward to working closely with him,” she added.\n\nCongratulations to President-elect Javier Milei @JMilei. We look forward to working closely with him and his administration in the period ahead to develop and implement a strong plan to safeguard macroeconomic stability and strengthen inclusive growth for all Argentinians. — Kristalina Georgieva (@KGeorgieva) November 20, 2023\n\nEconomist Nicolás Litvinoff believes Milei will need to get the IMF monkey off his back as a matter of first priority.\n\n“I think the most important thing is to regain autonomy in terms of monetary policy. On the one hand, to accumulate reserves in the central bank that are practically non-existent now,” said Litvinoff before adding that Milei must “restore the purchasing power of wages to reactivate consumption and the economy[…] but for that, you need the International Monetary Fund out of the way.”\n\nWho is Javier Milei?\n\nMilei first came to prominence as an economist, author and political commentator.\n\nWestern media outlets compare Milei to former U.S. President Donald Trump, but the similarities drawn are often shallow. Both men are populists from outside the political mainstream. Both men rode a wave of public disaffection to electoral success. Both men have unconventional hair.\n\nSuch comparisons are just as likely to obfuscate as enlighten.\n\nMilei was born in 1970 in Argentina’s capital Buenos Aires. He was raised as a Catholic, which informs his politics to this day. While Milei is mostly socially liberal, he is opposed to both abortion and euthanasia. He supports freedom of choice on drugs, guns, prostitution and same-sex marriage.\n\nIn his youth, Milei sang in a Rolling Stones cover band. His presentation style owes much more to the rock world than to the political.\n\nDuring the campaign, Milei the showman brought a chainsaw to his rallies, frequently revving it up and raising it triumphantly above his head.\n\nRecent: Former Coinbase exec posits blockchain-driven vision of future societies\n\nFor supporters, Milei’s chainsaw was a metaphor for the drastic cuts his administration would take to curb government spending and reign in inflation. For opponents, the chainsaw represented something else: a dangerous and cavalier individual waving around a chainsaw in public.\n\nThey dubbed him “El loco” — the crazy one — or madman. That was little matter. Milei’s message and style resonated with voters sick of the status quo, no matter how crazy he seemed to the doubters.\n\nAs for his rival Sergio Massa, the chainsaw took on a final, more ominous meaning as Milei cut him down this weekend in a very public chainsaw massacre. Now that Milei has the keys to the president’s office, the clean-up of Argentina’s broken system must begin."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLTFtLXBvc3QtZXRmLWFwcHJvdmFsLWJ0Yy1wcmljZS1wcmVkaWN0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin to $1M post-ETF approval? BTC price predictions diverge wildly - Cointelegraph",
        "content": "Bitcoin (BTC) may not reclaim $40,000, despite increasing excitement over a spot exchange-traded fund (ETF).\n\nIn recent analyses, crypto market participants have started to reconsider just how bullish the ETF narrative really is for BTC price action.\n\nTrader: “Not sure” BTC price will reach $42,000\n\nThe dust continues to settle on the United States vs. Binance regulatory bombshell, which involves a $4.3 billion fine and the removal of Changpeng “CZ” Zhao as CEO.\n\nBitcoin sank to one-week lows on the news, but a swift rebound took it back to near 18-month highs within the following 24 hours.\n\nAt the same time, commentators began to suggest that the enforcement action was a timely move to pave the way for the first U.S. spot Bitcoin ETF.\n\nLong expected to be a watershed moment for crypto, an approval — while far from guaranteed — could come in early January 2024.\n\nNonetheless, not everyone sees an approval resulting in a snap BTC price parabolic reaction. Among them is popular trader Bitcoin Jack, who, in a recent X post, cast doubt on BTC/USD even hitting $42,000.\n\n“I said 42k. Not sure we get there anymore,” he summarized on Nov. 21.\n\nBitcoin Jack explained that the week’s Binance and ETF news had failed to reshape market dynamics.\n\n“Expected any rumour on a Binance vs US resolution to be more bullish than price reflects (reasons: positive for ETF, less uncertainty for investors if there is a resolution), on top of the generally bullish headlines last weeks (minus Kraken, though much of it is more of the same earlier crackdown language recycled),” he continued.\n\nIntroducing potential downside targets, he noted that while support levels are “clean,” $30,000 may yet come back into play.\n\n“Sometimes that what doesn’t happen is the tell,” he concluded.\n\n“HTF supports below are clean buy level if it comes. Potential top here or another leg to 42, support around 29-31.”\n\nOne spot Bitcoin ETF, $1 million BTC?\n\nAs Cointelegraph reported, other recent forecasts are maintaining the low $30,000s as a retracement zone, in part thanks to liquidity remaining there.\n\nRelated: Bitcoin ETF hype returns as ‘aggressive bid’ sends BTC price near $38K\n\nIn his most recent social media survey, Filbfilb, co-founder of trading suite DecenTrader, asked followers whether Bitcoin could hit $40,000 or $30,000 first. The result was a near 50/50 split.\n\nIts that time again:\n\n\n\nBTC at $37k now.. which is more likely to come first? — filbfilb (@filbfilb) November 22, 2023\n\nMeanwhile, at the opposite extreme of the ETF issue is Samson Mow, CEO of Bitcoin adoption firm Jan3.\n\nIn an X post on Nov. 23, he suggested that Bitcoin could not only hit $1,000,000 per coin as a result of the approval but that hodlers were mistaken in predicting any less.\n\n“It has come to my attention that there are some Bitcoiners that don’t think Bitcoin can reach $1,000,000 in a matter of days/weeks after ETF money starts to flow in,” he wrote.\n\n“They’re in for a pleasant surprise.”\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC/USD traded at $37,000 at the time of writing, per data from Cointelegraph Markets Pro and TradingView.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY0NTg1L3dhbGxldC1vZi1zYXRvc2hpLWJpdGNvaW4tbGlnaHRuaW5n0gFLaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY0NTg1L3dhbGxldC1vZi1zYXRvc2hpLWJpdGNvaW4tbGlnaHRuaW5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Major Bitcoin Lightning wallet provider quits US market - The Block",
        "content": "Bitcoin BTC -2.26% Lightning wallet provider Wallet of Satoshi has removed its app from the U.S. Apple and Google app stores, with the firm clarifying that it “will not serve U.S. customers going forward.”\n\nThe Wallet of Satoshi team did not specify any particular reasons for the decision, stating it understood the news was disappointing for U.S. customers. The app remains available for download in other countries.\n\nThe Bitcoin Lightning app sought to assure existing users in the U.S. that their funds were accessible and can be withdrawn and transferred to another wallet service.\n\nUsers earlier speculated that the app may been banned in the U.S. as a result of the regulatory environment surrounding the crypto industry in the country, especially given the recent legal action taken against Binance and its former CEO, Changpeng Zhao. The firm has come out saying it was its decision to remove the app.\n\n“Wallet of Satoshi needs to comply with local regulations or laws in ways that it cannot, or does not want to,” John Carvalho, CEO of Bitcoin software developer Synonym, said in response.\n\nThe firm remains hopeful of a return in the country with future developments. “We’re hopeful that future developments will allow us to revisit and possibly resume our operations in the U.S.,” it added\n\nOne million Lightning transactions and near record capacity\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nWallet of Satoshi is one of the most popular Bitcoin Lightning wallets and projected to process more than a record one million Lightning Network payments in November. Nonetheless, the firm has previously faced criticism for the custodial nature of its app, which retains control over users’ funds, unlike non-custodial solutions that allow users to maintain full control over their bitcoin.\n\nWallet of Satoshi's decision to exit the U.S. market coincides with the Lightning Network’s capacity rising back to all-time highs in both U.S. dollar and bitcoin terms, according to The Block’s data dashboard.\n\nU.S. dollar capacity has jumped 67% over the last two months to reach $207 million, just shy of the $215 million record set in November 2021 at the peak of the bull market. Bitcoin capacity rose 20% over the same period to hit 5,530 BTC, slightly below the previous 5,640 BTC record set in July.\n\nWallet of Satoshi did not immediately return a request for comment from The Block."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9ob3ctYml0Y29pbi1leHBvc3VyZS1yZWR1Y2VzLXJpc2tzLWluLXRyYWRpdGlvbmFsLXBvcnRmb2xpb3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "How Bitcoin exposure 'reduces risks' in traditional portfolios - DLNews",
        "content": "Allocating just 1% to Bitcoin in investment portfolios can drive outperformance and mitigate risk, K33 research suggests.\n\nThat blend outperforms conventional portfolios by 3.16% and withstands market volatility.\n\nBitcoin benefits investment portfolios through risk reduction despite long-held views in financial circles about the viability of cryptocurrencies in conservative investment strategies.\n\nIf investors allocate just 1% to Bitcoin in a traditional portfolio normally made up of 60% equities and 40% bonds, it can markedly improve its overall performance, according to a report from K33 Research on Tuesday.\n\nA 1% Bitcoin allocation would reduce equities and bonds allocation by 0.5%, respectively.\n\nThe findings suggest that such a blend not only withstands market volatility, but also surpasses the performance of the conventional model by 3.16%.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nThe report also cautions that while a modest Bitcoin investment can enhance a portfolio’s performance, significant exposure can introduce greater volatility and risk.\n\n“Size allocation is a matter of taste and risk appetite,” Vetle Lund, a research analyst at K33, told DL News.\n\n“Returns outpace excess volatility, but the enhanced volatility is a clear disincentivising feature for conservative savers,” Lund said, referring to the typical investor building a 60/40 portfolio.\n\nOther factors beyond volatility could affect investors’ decisions to allocate Bitcoin to portfolios.\n\nJoin the community to get our latest stories and updates\n\n“Liquidity plays a part, volatility plays another part, and so do correlation regimes,” Lund told DL News.\n\nLiquidity refers to the ability of market participants to execute buy or sell orders close to the prevailing market price.\n\nIn low liquidity markets price moves can be exacerbated by a smaller number of trades, which can make investments in these markets less desirable.\n\nBitcoin’s liquidity conditions have been slowly recovering after the collapse of crypto exchange FTX last year.\n\nChanging landscape\n\nBitcoin allocations to portfolios also boost diversification. While Bitcoin has gone through periods of extreme correlation with equities in the past, signs suggest that could be changing.\n\n“Bitcoin has [returned] to a somewhat unpredictable path, independent of macroeconomic factors,” K33′s report said.\n\n“This has implications as Bitcoin again shines as a powerful portfolio diversifier,” it added.\n\nThe previously observed correlations between traditional assets and Bitcoin dissipated as the cryptocurrency rode the wave over potential approval of spot Bitcoin-based Exchange-Traded Funds.\n\nBitcoin became negatively correlated with major US stock indices like the S&P 500 and the Nasdaq composite between mid-September and mid-November, according to data from The Block Research, as spot ETF approval looked increasingly likely.\n\nSpot Bitcoin ETFs are poised to appeal to conservative investors, offering a viable option to bolster the risk profile of their long-term savings portfolios.\n\nThe US Securities and Exchange Commission will start approving spot Bitcoin ETFs in the near future, Bloomberg Intelligence ETF analyst Eric Balchunas told DL News on Monday. He expects approvals by mid-January.\n\nETFs represent Wall Street’s gradual acceptance of crypto, Balchunas added.\n\n“These worlds have been trying to connect for 10 years. And they’re just getting so close, they’re like right there,” he told DL News.\n\nAs these two worlds collide and ETFs simplify access to Bitcoin exposure, K33 expects “diversification and risk-adjusted outperformance to be key go-to-market strategies” for asset managers.\n\nEntry point\n\nFidelity Digital Assets, the crypto arm of the $4.5 trillion asset manager, shared similar sentiment in an October report.\n\nFurthermore, Bitcoin offers a better risk versus return trade-off than other cryptocurrencies, Fidelity said. It should be considered an entry point for “traditional allocators.”\n\n“Bitcoin’s return profile is driven by two strong tailwinds,” Fidelity analysts wrote, namely the global growth of the digital asset space and the potential instability of traditional macroeconomic conditions.\n\n“These Bitcoin return tailwinds are likely to be captured in an easier way with less risk than via the majority of other digital assets,” the report said.\n\nOver two thirds of current institutional investors expect to increase allocations in cryptocurrencies in the next three years, a recent survey by Coinbase Institutional research found.\n\nAnother 45% of institutional investors surveyed without crypto allocations expect to allocate in the next three years.\n\nEkin Genç is a Managing Editor at DL News based in Oxford. Adam Morgan McCarthy is DL News’ London-based Markets Correspondent. Got a tip? Reach out at ekin@dlnews.com or adam@dlnews.com."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvYml0Y29pbnMtMy13ZWVrLWNvbnNvbGlkYXRpb24tdW5kZXItMzhrLWhhcy1idWxsaXNoLXVuZGVydG9uZS_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzI0L2JpdGNvaW5zLTMtd2Vlay1jb25zb2xpZGF0aW9uLXVuZGVyLTM4ay1oYXMtYnVsbGlzaC11bmRlcnRvbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's 3-Week Consolidation Under $38K Has Bullish Undertone - CoinDesk",
        "content": "\"Upward breakouts occur 77% of the time, and breakouts happen roughly 61% of the distance (time) from the base to the cradle,\" Kirkpatrick II and Dahlquist say in the book while warning of the potential for failed breakouts. A fake breakout happens when prices move beyond the resistance, only to fall back into the pattern quickly, trapping buyers on the wrong side of the market."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9qaW0tY3JhbWVyLWNvbW1lbnRzLW9uLWJpdGNvaW4taXMtdGhlLWJ0Yy1wcmljZS1pbi1kYW5nZXIv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2ppbS1jcmFtZXItY29tbWVudHMtb24tYml0Y29pbi1pcy10aGUtYnRjLXByaWNlLWluLWRhbmdlci8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Jim Cramer Comments on Bitcoin: Is the BTC Price in Danger? - CryptoPotato",
        "content": "TL;DR\n\nBitcoin (BTC) has seen a significant increase of over 120% since the start of the year, with Jim Cramer, host of CNBC’s “Mad Money,” recently suggesting that those interested in Bitcoin should consider buying more.\n\nCramer’s past advice on Bitcoin has been inconsistent; in December 2022, he recommended selling crypto positions, calling them “awful,” but BTC’s value has since doubled.\n\nEarlier in 2022, Cramer incorrectly assumed the market correction was over and advised increasing exposure to Bitcoin and other cryptocurrencies, not anticipating the severe market downturns, including the Terra crash and FTX meltdown.\n\nIs BTC Crash Inevitable?\n\nBitcoin (BTC) has made a remarkable comeback this year, with its price spiking over 120% since January 1. Despite its impressive performance lately and the anticipation of further gains in the near future, there is one advice that some cryptocurrency participants might find concerning.\n\nIt came from the well-known personality Jim Cramer – host of CNBC’s TV show “Mad Money.” He recently urged those like Bitcoin to increase their exposure to the primary digital asset:\n\n“Look, if you like Bitcoin, buy Bitcoin. That has always been my view. And for a while, I liked it, and I decided that money had been made, but I was premature, but I made a lot of money.”\n\nCramer has made countless comments and predictions involving the largest digital asset by market capitalization, and many times, those forecasts were far from spot on. This might be one reason why investors should be concerned of an inverse reaction and a potential BTC correction in the near future.\n\nWhen Was He Wrong?\n\nIn December last year, he advised individuals to sell their “awful” crypto positions, arguing it’s never too late to exit the ecosystem. Recall that BTC has exploded over 100% since that counsel.\n\nOn another occasion, at the start of 2022 Cramer assumed the market correction was over, suggesting people should increase their exposure to Bitcoin, Ether, and other digital currencies. However, 2022 was far from profitable for crypto investors, witnessing severe collapses such as the Terra crash and the FTX meltdown."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbmpveS1zdWItNDBrLWJpdGNvaW4tcGxhbi1iLTEwMGstYXZlcmFnZS1idGMtcHJpY2UtMjAyNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "'Enjoy sub-$40K Bitcoin' — PlanB stresses $100K average BTC price from 2024 - Cointelegraph",
        "content": "Bitcoin (BTC) buyers should enjoy the chance to add to their stack below $40,000, says one of the crypto industry’s household names.\n\nIn a post on X (formerly Twitter) on Nov. 24, PlanB, creator of the stock-to-flow family of BTC price models, hinted that current levels would not be around long.\n\nPlanB: Time is ticking on $40,000 resistance\n\nBitcoin is destined to go much higher than its recent 18-month highs, PlanB believes, and time is ticking to increase BTC exposure below $40,000.\n\nKnown for his optimistic takes on long-term BTC price growth, PlanB used realized price data to support the case for bulls.\n\nRealized price is Bitcoin’s realized cap — the sum total price at which all BTC last moved — divided by the current supply. It is currently at just below $21,000.\n\nBitcoin bear market bottoms are characterized by the spot price dipping below the realized price, while bull markets begin once the spot crosses the two-year and five-month realized price levels. These refer to the realized price of coins that last moved within the last two years or the last five months — “younger” coins.\n\nBTC/USD is now once again above all three realized price iterations.\n\n“Enjoy sub-$40k bitcoin ... while it lasts,” PlanB commented on an accompanying chart.\n\nBitcoin realized price chart. Source: PlanB/X\n\nAsked whether the market should expect lower levels from here, PlanB would not be drawn, saying that he simply expected an average BTC price of at least $100,000 between 2024 and 2028 — Bitcoin’s next halving cycle.\n\nBitcoin hodlers bet on six figures\n\nWhile PlanB has fielded criticism over stock-to-flow — and conceded that Bitcoin was not able to live up to his expectations during its 2021 bull market — six-figure predictions for the next cycle are increasingly common.\n\nRelated: Bitcoin to $1M post-ETF approval? BTC price predictions diverge wildly\n\nAs Cointelegraph reported, these are coalescing around an area with $130,000 as its focus for the end of 2025.\n\nThe halving itself, meanwhile, due in April 2024, should produce a return to around $46,000, further analysis says.\n\nEarlier this month, PlanB described Bitcoin as being in a “pre-bull market” phase, with the real launch yet to come.\n\nIMO bitcoin is currently in pre-bull market (yellow) and on track towards a full blown bull market (red, after halving unless earlier ETF approval).\n\n\n\nNote I changed colors and stage names again, to better align with S2F model:\n\npre-bull\n\nbull market\n\npre-bear\n\nbear market pic.twitter.com/tmayjteVWv — PlanB (@100trillionUSD) November 19, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8yMDczNTUvYml0Y29pbi1zdXJnZXMtYWJvdmUtMzgwMDAtYnRjLWV0aGVyZXVtLWhpdC0xOC1tb250aC1oaWdoc9IBWmh0dHBzOi8vZGVjcnlwdC5jby8yMDczNTUvYml0Y29pbi1zdXJnZXMtYWJvdmUtMzgwMDAtYnRjLWV0aGVyZXVtLWhpdC0xOC1tb250aC1oaWdocz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surges Above $38,000 as BTC and Ethereum Hit 18-Month Highs - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto markets may have sat still on Thanksgiving, but early price action on Friday is driving some of the top coins to levels unseen in a year and a half.\n\nBitcoin on Friday rocketed above the $38,000 mark, according to CoinGecko, rising to $38,390 at present. The last time BTC hit that level was back in May 2022. Over the past week, the asset has risen by nearly 7%, pushing its 30-day gains above 10%.\n\nCash has flooded back into the crypto markets, with big digital asset funds receiving most of the money as investors feel confident that a spot Bitcoin exchange-traded fund (ETF) will finally approved by U.S. regulators after 10 years.\n\nAD\n\nAD\n\nSuch a product would give traditional investors exposure to the crypto world in a safe and regulated way. In a Monday report, digital asset fund manager CoinShares said that crypto products received inflows of $176 million last week—the eighth consecutive week of inflows.\n\nMeanwhile, Ethereum also spiked to an 18-month high, per data from CoinGecko, reaching a peak of nearly $2,131 early Friday. It's currently trading at $2,121, and is up about 4% on the day.\n\nThe asset is up 17% over the past 30 days, and continues trending upward. Ethereum had been trading above $2,500 some 18 months ago in May 2022, before the markets got hit hard by the collapse of crypto mega project Terra.\n\nElsewhere, meme coin king Dogecoin is up over 3% in the past day, trading for $0.078. Its rival, Shiba Inu, put up a nearly 3% gain as well at a current price of $0.00000828.\n\nSolana, which experienced a lot of price action this month, was one of the sleepiest of the major coins and tokens, having only jumped by 2% over the past day to a current price above $58. Over the past week, Solana has risen by 3%.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yYWlmZmVpc2VubGFuZGVzYmFuay1iaXRjb2luLWxhdW5jaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Raiffeisenlandesbank to launch Bitcoin trading in early 2024 - Cointelegraph",
        "content": "The Austrian subsidiary of European lender Raiffeisen Bank is preparing to allow its clients to trade cryptocurrencies like Bitcoin (BTC) in the coming months.\n\nAfter initially announcing its crypto plans in April 2023, Raiffeisen Bank’s Raiffeisenlandesbank Niederösterreich-Wien (RLB NÖ-Wien) is moving forward with a crypto rollout in collaboration with the Austrian crypto firm Bitpanda.\n\nRLB NÖ-Wien expects to start rolling out crypto trading services in Vienna in the first quarter of 2024, a spokesperson for the bank told Cointelegraph.\n\n“Raiffeisenlandesbank NÖ-Wien has signed a cooperation agreement with Bitpanda. Via this cooperation, we plan to offer an attractive digital investment platform early in 2024,” the representative stated, adding:\n\n“We have seen the demand from customers for easy, intuitive, digital investment platforms. Our main intention to take customer-centric decisions has triggered these efforts, which we are excited about bringing to market.”\n\nWith the crypto rollout, RLB NÖ-Wien users will gain access to all cryptocurrencies provided by the bank’s partner Bitpanda, the spokesperson said.\n\nBitpanda Deputy CEO Lukas Enzersdorfer-Konrad previously told Cointelegraph that Raiffeisen’s crypto offering would support the full range of Bitpanda’s digital asset offerings, which feature more than 2,500 cryptocurrencies, including Bitcoin and Ether (ETH). The exec also said Raiffeisen was willing to make the crypto trading service available to all customer segments, including retail, private banking and corporate customers.\n\n“As we announced in April, the end goal is to make our offer available to all RLB NÖ-Wien customers. However, the rollout will begin with their customers in Vienna,” a spokesperson for Bitpanda noted.\n\nRelated: Top Swiss bank launches Bitcoin and Ether trading with SEBA\n\nRaiffeisen’s move into crypto is another sign of Bitcoin’s growing adoption, with companies like Ferrari starting to accept cryptocurrency as payment in October 2023. Raiffeisen Bank is one of the oldest banks in Europe, with the first Raiffeisen bank launching in Austria’s Mühldorf in 1886. As of 30 June 2023, the Raiffeisen Group had 247 billion Swiss francs ($280 billion) in assets under management and 219 billion CHF ($248 billion) in client loans.\n\nMagazine: 5,050 Bitcoin for $5 in 2009: Helsinki’s claim to crypto fame"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1eWVyLWJ0Yy1wcmljZS1wYXN0LTM4ay10cmFkZXJzLWtleS1icmVha291dNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin buyer pushes BTC price past $38K as traders demand key breakout - Cointelegraph",
        "content": "Bitcoin (BTC) bulls kept the pressure on 18-month highs on Nov. 24 as analysis eyed buyer interest spiking.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin fights for new 18-month high\n\nData from Cointelegraph Markets Pro and TradingView showed the BTC price trajectory heading upward into the Wall Street open.\n\nThe largest cryptocurrency saw increasing momentum during the Asia trading session, this nonetheless with its roots on derivatives markets.\n\nFollowing the action, popular trader Skew confirmed that a single entity was likely behind the latest charge on $38,000.\n\n“Some buyer probably single buyer is trying to push the market higher here ~ clear correlation between spot & perp CVDs / Delta,” he wrote in part of his latest post on X (formerly Twitter.)\n\n$BTC Update\n\nLooking like there's some direction buyer again here on binance - they're bidding spot & opening a long\n\n\n\nShorts on bybit perps continue to get hunted\n\n\n\nMarket CVDs & Delta\n\nSome buyer probably single buyer is trying to push the market higher here ~ clear correlation… https://t.co/Hu6FNp1Ltc pic.twitter.com/5KaODZC7Hv — Skew Δ (@52kskew) November 24, 2023\n\nSkew subsequently revealed the long BTC position had been closed, and with momentum flagging, a higher high (HH) was needed on lower timeframes — beyond the current $38,000 ceiling. At the time of writing, this was in progress.\n\n$BTC\n\nLooks like binance long has closed out, so they could have just engineered liquidity to get some asks filled\n\n\n\nLTF CVDs\n\nSo first thing here is CVDs are higher vs price so there's some momentum behind this move however, yet to be seen without another HH\n\n\n\nSecondly, spot… pic.twitter.com/regcjdj2tw — Skew Δ (@52kskew) November 24, 2023\n\nZooming out, others were still optimistic about resistance levels ultimately falling. For Michaël van de Poppe, founder and CEO of trading firm MN Trading, it was all about the $40,000 mark.\n\n“Still so far, so good on Bitcoin,” he told X subscribers on the day.\n\n“Slowly grinding upwards to a new resistance point and a break above $38K immediately means $40K is next.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/X\n\nFellow popular trader Daan Crypto Trades meanwhile described $38,000 as the line in the sand after which “easy mode” returns to Bitcoin trading. The corresponding level on Ether (ETH), he added, was $2,150.\n\nAbout turn at $40,000?\n\nSome market participants believe that a fresh BTC price retracement will enter following an initial foray into the area around $40,000.\n\nRelated: Bitcoin to $1M post-ETF approval? BTC price predictions diverge wildly\n\nAmong them is popular trader Crypto Tony, who, on the day, suggested that even $39,000 could prove a short-term turning point.\n\n$BTC / $USD - Update\n\n\n\nMy plan has not changed, pump us to $39,000 - $40,000 then drop please pic.twitter.com/AJkLRmD4U5 — Crypto Tony (@CryptoTony__) November 24, 2023\n\n$39,000, meanwhile, stands out for a variety of reasons, including the aggregate profitability of those who bought BTC during the 2021 bull market.\n\nElsewhere, encouraging signs from Bitcoin’s relative strength index (RSI) continued to provide bulls with fuel for further upside.\n\nBTC/USD 1-day chart with RSI. Source: TradingView\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8yMDcyNjMvYml0Y29pbi1zZW5kZXItb3ZlcnBheXMtcmVjb3JkLWJyZWFraW5nLTMtbWlsbGlvbi10cmFuc2FjdGlvbi1mZWXSAWFodHRwczovL2RlY3J5cHQuY28vMjA3MjYzL2JpdGNvaW4tc2VuZGVyLW92ZXJwYXlzLXJlY29yZC1icmVha2luZy0zLW1pbGxpb24tdHJhbnNhY3Rpb24tZmVlP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Sender Overpays Record-Breaking $3 Million Transaction Fee - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA luckless Bitcoin sender seemingly made a costly mistake, paying a record-breaking $3 million in transaction fees for a single transaction.\n\nBlockchain data shows that the Bitcoin sender intended to send 139.42 BTC (worth around $5.1 million), of which 83.64 BTC was gobbled up in transaction fees, leaving the recipient with just 55.77 BTC (around $2 million at today’s prices). The transaction fee is the largest such payment in the history of Bitcoin.\n\nIt’s likely that today’s payment was made by mistake: though making a Bitcoin transaction can be costly when the network is busy, fees are not supposed to exceed the amount being sent.\n\nAD\n\nAD\n\nBitcoin miner AntPool processed the transaction in block 818087, per blockchain data from Bitinfocharts.\n\nBitinfocharts shows that the current average price to make a transaction on the Bitcoin network stands at $10.51.\n\nThis isn’t the first time that someone has fat-fingered a Bitcoin transaction recently; in September crypto firm Paxos paid a $500,000 fee to process a transaction worth just $2,000, though Bitcoin miner F2Pool agreed to refund the overpayment.\n\nAlthough this incident appears to be a mistake on the part of the sender, Bitcoin transaction fees have shot up this month due to renewed hype surrounding Bitcoin Ordinals. Ordinals, similar to non-fungible tokens, are digital assets inscribed on a satoshi, the lowest denomination of a Bitcoin.\n\nInscribing Ordinals on the Bitcoin blockchain means more activity on the network, which means it’s busier and therefore more costly to make a transaction.\n\nAD\n\nAD\n\nThere are options for those not wanting to pay much when sending or receiving the biggest cryptocurrency—users are able to select lower fees before making a transaction. Though by doing so, they risk waiting around for hours as miners prioritize more lucrative transactions.\n\nAnd if the fee is too low, miners may completely ignore such transactions and it will never reach its destination."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8yMDczMDEvaGFzLW5heWliLWJ1a2VsZXMtYmlnLWJpdGNvaW4tYmV0LWJvcm5lLWZydWl00gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNzMwMS9oYXMtbmF5aWItYnVrZWxlcy1iaWctYml0Y29pbi1iZXQtYm9ybmUtZnJ1aXQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Has Nayib Bukele’s Big Bitcoin Bet Borne Fruit? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEl Salvador’s wildly popular president Nayib Bukele was a big backer of Bitcoin during the 2021 bull market. After his bull-run buying spree, the Salvadoran leader announced in November of last year that the country would add one Bitcoin a day to its fortress balance sheet. He’s since been slagged off for being reckless by everyone from university professors to U.S. lawmakers.\n\nBut how has the investment actually performed?\n\nAccording to the NayibTracker website—which has used the president’s tweets to record just how much Bitcoin he’s bought (it’s notoriously difficult to get figures from the government) and has done the dollar cost averaging—Bukele is down nearly 8% on his investment of 3,120 BTC.\n\nAD\n\nAD\n\nThe average price of BTC the eccentric ex-marketing executive has bought is now at $40,498 per coin, according to the data.\n\nAll in all, he spent over $126 million on the cryptocurrency; it’s now worth $116 million, meaning he’s down over $10 million—a nearly 8% dip.\n\nAll of the BTC he’s bought has been below the asset’s all-time November 2021 all-time high of $69,044, in fact, with the most expensive batch being 420 coins priced at $60,345.\n\nSo, he still has a while to go before he sees a profit. But it’s not all negative: El Salvador was expected to default on its massive national debts last year. The country’s bonds have since given investors handsome returns.\n\nBefore Bukele became president, tiny El Salvador was mostly known for its surfing, a devastating civil war, and gang violence. He has since tried to turn it into a tech hub and attract foreign—including Chinese—investment.\n\nAD\n\nAD\n\nWith a harsh crackdown on the country’s notorious gangbangers, the nation’s murder rate has plunged; Bukele hopes this will attract a vibrant expat community—and stop so many Salvadorans from making the journey north to the States.\n\nBut while Salvadorans seem to be happier with improved security in the country, Bitcoin has always been a bit of a sore point.\n\nIf Bukele’s bet ever gets back in the black, he might have to orange pill his citizens.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pcy1iaW5hbmNlLXNldHRsZW1lbnQtZ3JlZW5saWdodC10by1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Is Binance's $4B settlement the green light for spot Bitcoin ETFs? - Cointelegraph",
        "content": "Binance’s $4.3-billion settlement with the United States was the final hurdle before the country’s securities regulator approves spot Bitcoin (BTC) exchange-traded funds (ETFs), many industry watchers claim.\n\nThe settlement involved Binance agreeing to Justice Department and Treasury compliance monitors for up to five years, allowing the agencies sweeping powers to keep the exchange in line with Anti-Money Laundering and sanctions rules, among other things.\n\nThe U.S. Securities and Exchange Commission has cited market manipulation when denying spot Bitcoin ETFs, and Binance’s market dominance had to take a hit before BlackRock’s spot BTC ETF application would be approved, according to a June X (Twitter) post by Travis Kling, chief investment officer of Ikigai Asset Management.\n\n“There is no chance, and I mean zero, that this ETF is approved with Binance in its current position of market dominance,” Kling wrote. “If this ETF is approved, Binance is either gone entirely or their role in price discovery is massively diminished.”\n\nOk here we go. https://t.co/fJ7c3MpaTy — Travis Kling (@Travis_Kling) November 21, 2023\n\nKling’s prediction sparked others to consider how closely BlackRock works with the U.S. government to obtain a favorable position in the spot Bitcoin ETF market. YouTuber Colin Talks Crypto said it was suspect that Binance’s settlement happened “right before a Bitcoin ETF comes out.”\n\n“Is it a way for BlackRock to acquire a massive amounts [sic] of BTC for cheap?” he asked. “Is it a way to remove competition from U.S. markets right before the ETFs go live?”\n\nDoes it seem fishy to anyone else that #Binance is being found guilty of money laundering right before a #Bitcoin #ETF comes out?\n\n\n\nIs there any connection?\n\n\n\nFor example:\n\n• Is it a way for BlackRock to acquire a massive amounts of BTC for cheap/free?\n\n• Is it a way to remove… — Colin Talks Crypto (@ColinTCrypto) November 21, 2023\n\nOthers noted that BlackRock and its rival Vanguard together own 11.5% of Binance’s top competitor, Coinbase, and speculated that the action against Binance may have been planned.\n\nBlackRock met with the SEC on Nov. 20 and presented how it could use an in-kind or in-cash redemption model for its spot BTC ETF, the iShares Bitcoin Trust.\n\nBinance/DOJ settlement and SEC Spot #Bitcoin ETF approvals are mutuals. — Andrew (@AP_Abacus) November 20, 2023\n\nGrayscale also met with the securities regulator on the same day, discussing its bid to list a spot Bitcoin ETF. Fidelity, WisdomTree, Invesco Galaxy, Valkyrie, VanEck and Bitwise also await the SEC’s approval of their spot Bitcoin funds.\n\nRelated: Binance CEO CZ’s downfall is ‘the end of an era’ — Charles Hoskinson\n\nMike Novogratz, CEO of digital asset investment firm Galaxy Digital, said the Binance settlement is “super bullish” for the cryptocurrency industry.\n\nNot everyone sees the point in guessing if the Binance news will lead to spot BTC ETF approvals.\n\nIn a note to Cointelegraph, Piper Alderman partner Michael Bacina suggested it is best to let the speculation run its course.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vcHJvdG9zLmNvbS9iaW5hbmNlLWJpdGNvaW4tcmVzZXJ2ZXMtZHJvcC1hcy1jei1mYWNlcy11cy1kZXRhaW5tZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Binance bitcoin reserves drop as CZ faces US detainment - Protos",
        "content": "Binance’s bitcoin reserves have depleted by $200 million in the wake of the crypto exchange and its ex-chief Changpeng Zhao (CZ) pleading guilty to federal charges in the US — while CZ has paid bond, prosecutors are fighting for him to remain in the country until he can be sentenced.\n\nAccording to CryptoQuant, on-chain data shows that mass amounts of bitcoin is flowing from Binance to Coinbase. Binance’s bitcoin reserves have dropped by 5,000 BTC ($187 million). Meanwhile, Coinbase’s reserves are up by 12,000 BTC ($450 million).\n\nBinance has historically used its bitcoin reserves to prop up the price of its proprietary token, BNB, according to the Securities and Exchange Commission (SEC) and several crypto analysts. Both CZ and Binance vehemently deny the claims.\n\nSeven-day price chart of BNB.\n\nRead more: Does Binance chief CZ need the price of BNB to stay above $200?\n\nThe price of BNB took a -14% plunge following news of the settlement and CZ’s resignation, from $264 to $227. At press time, it sits at $233 — down 20% compared to this time last year.\n\nCZ controls a substantial percentage of BNB’s $35 billion market cap. His recent $4 billion deal settled several US agency charges Binance faced — but the SEC’s wash trading charges remain up in the air.\n\nProtos analysis has shown discrepencies in the amount of BNB held by Binance in its ‘proof-of-reserves,’ suggesting the crypto exchange has held far more than it cared to admit.\n\nCZ faces US detainment amid Binance bitcoin shedding\n\nUS prosecutors are pushing for CZ to be detained in the country, rather than allowing him to return to his home inn Dubai until his February sentencing. The former CEO is expected to face up to 18 months in prison for his role in failing to implement proper anti-money laundering checks.\n\nThe 46-year-old paid a $175 million release bond following his guilty plea. However, prosecutors argue that CZ poses an “unacceptable” flight risk — if he’s allowed to leave the US he may not return, and the government “would not be able to secure his return.” The US and the UAE do not have an extradition treaty.\n\nRead more: Binance and CZ plead guilty but SEC lawsuit remains\n\n“Zhao’s significant assets and strong ties to the UAE, as well as the government’s inability to extradite him from the UAE, favor a ruling from this court that he be required to remain in the United States until his sentencing on February 23, 2024,” prosecutors said.\n\nMoreover, the vast majority of CZ’s wealth is not in the US — providing CZ with little incentive to return. And the $175 million bond he paid is mostly inaccessible to the government, the motion argued.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8yMDczOTEvaW52ZXJzZS1jcmFtZXItYml0Y29pbi1kb29tZXItdHVybnMtYnVsbGlzaC1jcnlwdG8taGl0cy0zODAwMNIBXWh0dHBzOi8vZGVjcnlwdC5jby8yMDczOTEvaW52ZXJzZS1jcmFtZXItYml0Y29pbi1kb29tZXItdHVybnMtYnVsbGlzaC1jcnlwdG8taGl0cy0zODAwMD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Inverse Cramer? Bitcoin Doomer Turns Bullish as Crypto Hits $38,000 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFor the last year, CNBC’s Jim Cramer has emphatically urged all who would listen to get out of crypto—and specifically, away from Bitcoin.\n\nNow, the Mad Money host is—once again—changing his tune, right as Bitcoin surges to an 18-month high.\n\n“For a while I liked it, then I decided: You know what? The money had been made,” Cramer said of Bitcoin during a Mad Money segment earlier this week. “But I was premature.”\n\nAD\n\nAD\n\n“When you make a lot of money, let’s not look back,” he added.\n\nCramer’s newfound faith in Bitcoin comes during a major surge for the world’s top cryptocurrency. Earlier today, BTC rocketed above $38,000 for the first time in a year and a half. In the last month, the coin has steadily climbed 10%. And it’s not just Bitcoin that’s up: in the same period, Ethereum has spiked 17%, hitting its own 18-month peak earlier Friday.\n\nMuch of that momentum stems from industry-wide hope for the imminent approval of a spot Bitcoin ETF—which, if finally greenlit by the U.S. Securities and Exchange Commission (SEC) after 10 years of denials, would allow traditional financial institutions to gain exposure to BTC without holding any cryptocurrency.\n\nBlockchain analysts at CryptoQuant have previously said the product could lead to a $1 trillion boost for Bitcoin and other digital assets.\n\nAD\n\nAD\n\nCramer, despite having profited off BTC himself, appeared to permanently write off the coin and all other cryptocurrencies after the collapse of the crypto market in May 2022, and again after the shuttering of crypto exchange FTX rattled the industry last fall.\n\n“It’s never too late to sell an awful position, and that’s what you have if you own these so-called digital assets,” Cramer said last December.\n\nA year later, with Bitcoin back on the rise, Cramer’s now claiming he’s always supported those with long-term faith in the coin.\n\n“If you like Bitcoin, buy Bitcoin,” the television personality said Tuesday. “That has always been my view.”\n\nMany in the crypto and finance communities have long skewered Cramer’s ever-shifting stances on financial products, with some claiming that doing the inverse of whatever he advises can generally be considered very sound financial advice.\n\nLast year, the SEC received multiple applications for real-life “Inverse Cramer ETFs,” which would automatically invest user’s funds using the opposite of Cramer’s instructions as gospel.\n\nGiven such logic, some crypto investors have taken to social media to posit that Cramer’s revived confidence in BTC could spell doom for the ascendant cryptocurrency—and erase the encouraging gains of the last month.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi1hZ2dyZXNzaXZlLWJpZC1idGMtcHJpY2UtMzhr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETF hype returns as 'aggressive bid' sends BTC price near $38K - Cointelegraph",
        "content": "Bitcoin (BTC) took fresh aim at $38,000 into Nov. 23 as an “aggressive bid” dispelled cold feet over Binance’s $4.3 billion fine.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin analysis: “Something is cooking”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price strength making a striking comeback to top out at $37,870.\n\nA subsequent cooling off kept the market near $37,500, with the mood markedly different from just 24 hours prior.\n\nThen, concerns over United States legal action against the largest exchange, Binance, sparked a cascade of long liquidations, which only ended at one-week lows.\n\n#Bitcoin Almost back to the top of the range.\n\n\n\nThe $38K level remains my main level of interest. https://t.co/N0K3DHIV4w pic.twitter.com/J9ZTWbusu3 — Daan Crypto Trades (@DaanCrypto) November 23, 2023\n\nThe bounce ended up equally impressive, however, and appeared to catch some market participants by surprise with its intensity.\n\n“BTC — some thick buy walls over on the spot Binance market,” popular trader Ninja reacted on X (formerly Twitter).\n\n“Have not seen such an aggressive bid for a while. Something is cooking.”\n\nA popular narrative once again involved a potential U.S. go-ahead for a Bitcoin spot price exchange-traded fund (ETF), something that could be just less than 50 days away.\n\nEvents at Binance, as Cointelegraph reported, may have provided a timely backdrop for the first U.S. approval of the long-awaited institutional investment product.\n\nGrayscale updated their #Bitcoin ETF application!\n\n\n\nThere is definitely something going on. pic.twitter.com/WbWcv7iN8a — Mister Crypto (@misterrcrypto) November 23, 2023\n\nAnalyzing the situation, fellow trader Pentoshi likewise suggested that the stars might be aligning for BTC price upside thanks to ETF-induced demand.\n\nRegardless of price action, he added, the approval would mean “the beginning of substantial multi decades of tradfi allocation.”\n\nHere’s a simple thesis. Game theory\n\n\n\n49 days until etf\n\n\n\nMany Sidelined people\n\n\n\nEach passing day = more pressure to allocate as the clock ticks\n\n\n\nDips possible. But the window is closing\n\n\n\nWill it be a local top? Maybe. Will it be the beginning of substantial multi decades of… — Pentoshi euroPeng (@Pentosh1) November 22, 2023\n\nContinuing, Samson Mow, CEO of Bitcoin adoption firm Jan3, nonetheless brought back a $1 million Bitcoin unit price at the hands of the new institutional capital inflows.\n\n“It has come to my attention that there are some Bitcoiners that don’t think Bitcoin can reach $1,000,000 in a matter of days/weeks after ETF money starts to flow in. They’re in for a pleasant surprise,” he said.\n\nRSI “reset” boosts short-term bullish thesis\n\nEyeing the prospect of upside returning, social media commentator Cold Blooded Shiller was among those bullish on relative strength index (RSI) values.\n\nRelated: BTC price returns key profit mark to Bitcoin exchange users at $34.7K\n\nThese had been reset by the trip to weekly lows, he concluded, paving the way for another impulse higher.\n\nThis was the case not only for Bitcoin but also for Ether (ETH) and some other major altcoins.\n\n“The reason this is so important is that usually when the RSI is in this position it’s the basis for a fresh position,” he wrote in part of the accompanying commentary.\n\n“Strong trending markets tend to hold this level. Getting down towards that ‘cool off’ region indicates corrections are complete and trend resumes.”\n\nBTC/USD 1-day chart with RSI. Source: TradingView\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvLm5ld3MvZmFrZS1lbG9uLW11c2steW91dHViZS1zdHJlYW1zLWxlYWQtdG8tMTY1ay1jcnlwdG8tc2NhbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Fake Elon Musk YouTube streams lead to $165k crypto scam - crypto.news",
        "content": "In a joint effort, SpaceX and BitOK have revealed a fraudulent crypto giveaway orchestrated by scammers impersonating Elon Musk, who managed to raise $165,000 in donations.\n\nThe scheme was said to involve a deepfake version of Elon Musk in live YouTube streams, which have since been removed.\n\nThe report that was shared with crypto.news claims that the users were offered to access a website via the QR code featured in the broadcast.\n\nFake website promoting ‘SpaceX’ giveaway | Source: BitOk\n\nThe page stated that individuals participating in the giveaway should transmit cryptocurrency to specified contribution addresses and await transaction processing. Afterward, they are assured a crypto reimbursement to their wallets and a 200% bonus.\n\nThis was followed by fake giveaway broadcasts from SpaceX on YouTube, a channel that garnered 180,000 subscribers.\n\nYou might also like: Crypto market sees massive ‘pump and dump’ amid fake Bitcoin ETF news\n\nThe BTC address utilized by the individuals responsible for receiving donations was later found to be bc1qc4rwqqf0q75rn032knwkvxtrdm4vurkusr8s4k. Here, a total of 2.48 BTC, equivalent to approximately $91,566 at the current exchange rate, was collected. Subsequently, all funds were transferred to the address bc1q6yjkfe0edtyn4luwskx30gg35r7eclllfsp3jg.\n\nFrom the address bc1q6…sp3jg, a segment of the funds, 1.25 BTC, was dispatched to the deposit address of the KuCoin exchange 3NcPowGtnnUxsgFSeCUoiaXW2MtcHUjXF4. Simultaneously, the remaining balance was sent to the change address bc1qwyrv7wkuqh79gk9uu9zjhc2sutyw80ksk4qjug, and subsequently rerouted to the deposit address of the KuCoin exchange 3NcPowGtnnUxsgFSeCUoiaXW2MtcHUjXF4.\n\nCrypto scams in 2023\n\nThis exposed scam marks just one more in a chain of fraudulent activity.\n\nThe blockchain analysis firm CertiK reported that over $32.2 million was lost to crypto scams and security incidents in October, with vulnerabilities, exit scams, and flash loan manipulations deemed leading causes.\n\nIn November, the total amount stolen during hacks mounted to $290 million.\n\nFollow Us on Google News"
    }
]