[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3l1Z2EtbGFicy1uZnQtY29sbGVjdGlvbi1iaXRjb2luLW9yZGluYWxz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Yuga Labs Debuts First NFT Collection on Bitcoin - Blockworks",
        "content": "Parent company of the popular Bored Apes NFTs, Yuga Labs, has announced an experimental 300-piece generative art collection called TwelveFold, housed on the Bitcoin blockchain.\n\nTwelveFold is a mathematically-based art system that utilizes a 12×12 grid to represent data and comes amid the company’s debut launch on the Bitcoin blockchain.\n\nThe collection will be inscribed onto satoshis and will feature 3D and hand-drawn elements that pay tribute to the current practice of creating ordinal inscriptions by hand, according to a company blog post on Monday.\n\nThe use of a base 12 system explores the relationship between time, mathematics, and variability in what Yuga Labs describes as “a visual allegory for the cartography of data.”\n\nEach satoshi within the collection can be located by tracking when it was minted via the Ordinal Theory protocol — which continues to gain attention following its release to the Bitcoin mainnet last month.\n\nYuga Labs said its decision to pursue both the type of collection as well as its release on Bitcoin marked a departure from what’s expected from the company.\n\n“But, you know. F**k doing expected things,” the company wrote in its post. “Stepping into the Ordinals Discord a month ago felt like getting a glimpse of the 2017-era Ethereum NFT ecosystem.”\n\nIt comes as a team from Dubai launched 10,000 BTC BAYC NFTs featuring monkeys with Satoshi masks on Ordinals, earlier this month. The move raises potential copyright issues as they are not affiliated with Yuga Labs’ assets based on the Ethereum blockchain.\n\nWhile the infrastructure and tooling around inscriptions on Bitcoin are still nascent, the foundational principles of provenance, self-custody and ownership are present, Yuga Labs said.\n\nThe company expects the technology and ecosystem around inscriptions to evolve and become more sophisticated over time leading to further experimentation and releases down the road.\n\nFurther details about timing and auction mechanics are expected to be announced in the coming weeks, Yuga Labs said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvbXQtZ294LWJhbmtydXB0Y3ktcmVwYXltZW50cy11bmxpa2VseS10by1kZXN0YWJpbGl6ZS1iaXRjb2luLXVicy_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzAxL210LWdveC1iYW5rcnVwdGN5LXJlcGF5bWVudHMtdW5saWtlbHktdG8tZGVzdGFiaWxpemUtYml0Y29pbi11YnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Mt. Gox Bankruptcy Repayments Unlikely to Destabilize Bitcoin: UBS - CoinDesk",
        "content": "Still, the potential for the repayments to influence the price exists. That amount of bitcoin represents around 90% of average supply active within the last day and 28% in the last week. That’s significant because active supply increases are normally associated with weakness in the BTC price, the note said."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMjgvYml0Y29pbi1ldGhlci1vbi10cmFjay1mb3ItYS1wb3NpdGl2ZS1mZWJydWFyeS1kZXNwaXRlLWZhZGluZy0yMDIzLXJpc2stcmFsbHkuaHRtbNIBdmh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAyLzI4L2JpdGNvaW4tZXRoZXItb24tdHJhY2stZm9yLWEtcG9zaXRpdmUtZmVicnVhcnktZGVzcGl0ZS1mYWRpbmctMjAyMy1yaXNrLXJhbGx5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, ether on track for a positive February despite mid-month drop and fading 2023 risk rally - CNBC",
        "content": "Bitcoin and ether are on pace for a modest February win, even after suffering a big drop earlier in the month.\n\nBitcoin had eked out a 0.2% gain for the month by 4:15 p.m. ET, according to Coin Metrics. In January bitcoin posted a 38% rise and its best month since 2021. Meanwhile, ether had risen higher by 1.7%, following a January gain of 31%. Unlike traditional markets, the crypto market remains open 24 hours a day, even on weekends and public holidays.\n\nInvestors were spooked earlier in the month after what appeared to be the beginning of a potential regulatory crackdown on crypto businesses in the U.S. — including the Securities and Exchange Commission's enforcement action against Kraken, its Wells Notice of a future settlement against Paxos and the New York State Department of Financial Services' ordering Paxos to stop minting the Binance USD (BUSD) stablecoin.\n\nThat led to a brief sell-off in crypto assets that took bitcoin and ether down about 6% and 8.5%, respectively, in the three-day period ended Feb. 10. Although they quickly recovered those losses the following week, they've been in a bit of a lull since.\n\n\"It's pretty easy to say that the lows are behind us because there really isn't any disparate further selling, but in terms of what actually takes us higher – that's harder,\" said Jeff Dorman, chief investment officer at Arca.\n\n\"Most of the negative news right now is coming out of regulators, but it's just not really having any long-term effect on the market because everything in crypto has perfect substitutes,\" he added, meaning when certain crypto companies in the past have been hit by regulators, traders have always been able to move their activity somewhere else.\n\nWhile regulatory scrutiny is ramping in the U.S., reports that Hong Kong is planning to legalize retail crypto trading as part of a bigger push to become a global crypto hub surfaced this month, with a quiet backing from China. The move has been a positive catalyst for crypto.\n\nIn the U.S., however, investors are on Fed watch, said James Lavish, managing partner at the Bitcoin Opportunity Fund.\n\n\"Bitcoin has been the tip of the spear for risk assets for a long time,\" he said. \"It's what moves first typically when you're talking about either buying or selling risk assets as part of your portfolio allocation and when we do in fact have a Fed pivot I expect that bitcoin is going to sniff that out first. It's going to have a strong move.\""
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFydG5ld3MuY29tL2FydC1uZXdzL25ld3MveXVnYS1sYWJzLWJpdGNvaW4tYmxvY2tjaGFpbi10d2VsdmUtZm9sZC1vcmRpbmFscy0xMjM0NjU5MjY0L9IBZ2h0dHBzOi8vd3d3LmFydG5ld3MuY29tL2FydC1uZXdzL25ld3MveXVnYS1sYWJzLWJpdGNvaW4tYmxvY2tjaGFpbi10d2VsdmUtZm9sZC1vcmRpbmFscy0xMjM0NjU5MjY0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Yuga Labs Launches Collection on Bitcoin Blockchain, Signaling a Shift in the NFT World - ARTnews",
        "content": "Yuga Labs, the company that owns such popular NFT collections as Bored Ape Yacht Club and CryptoPunks, will launch a new NFT collection on the Bitcoin blockchain.\n\nMost NFTs, and all of Yuga Labs’s previous collections, are minted, stored, traded, and bought on the Ethereum blockchain. Until recently, the Bitcoin blockchain wasn’t used to make NFTs because Bitcoin had little infrastructure to support smart contracts, which essentially function as a digital receipt that assigns and tracks ownership of a digital artwork.\n\nSince 2014, outside developers have been trying to build out this gap and have been moderately successful. But the cost of pushing transactions on Bitcoin, the culture of the Bitcoin community, and the ease of use of creating tokens and nonfungible tokens on blockchains like Ethereum, Solana, and Tezos has pushed NFTs made on Bitcoin to the side.\n\n[Read an ARTnews refresher on how NFTs work.]\n\nNow, however, Yuga Labs is launching its new collection, TwelveFold, on Bitcoin, which may signal that times are changing, since the company is currently one of the biggest players in the NFT game.\n\nTwelveFold is a generative 300-piece collection. In a blog post, Greg Solano, a cofounder of Yuga Labs, described it as a collection that “explores the relationship between time, mathematics, and variability.” Each of the 300 pieces is built around a 12 by 12 grid. Each of the 144 points on the grid display a shiny ball of color in differing sizes, almost like a glob of paint.\n\nTwelveFold uses a new method of creating NFTs on Bitcoin. Instead of relying on smart contracts to create tokens and NFTs, a developer named Casey Rodarmor created “Ordinals” or “Ordinal Inscriptions.” These digital assets are “inscribed” on a satoshi, the smallest unit of Bitcoin possible (1/100,000,000th of a Bitcoin). This inscription allows for data to be connected to a satoshi and thus host metadata—the data that describes a digital asset.\n\nThis metadata can describe basic facts like the name of a digital artwork and its transaction history. Because generative art is made using lines of code, in the case of TwelveFold, the metadata inscribed on the satoshi probably includes this code.\n\nThe 300 works from the TwelveFold collection will be sold at auction on a dedicated website later this week, though no specific date has been given. Bids will be made in Bitcoin.\n\nResults from the auction could provide interesting data. In a flagging NFT market, will Ordinals be the next big thing?"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NlYy1jaGFpci1nZW5zbGVyLWNvbmZpcm1zLWV2ZXJ5dGhpbmctb3RoZXItdGhhbi1iaXRjb2luLWlzLWEtc2VjdXJpdHktaW1wbGljYXRpb25zLWFuZC1hbmFseXNpcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "SEC chair Gensler confirms \"everything other than Bitcoin\" is a security: Implications and analysis - CryptoSlate",
        "content": "The following is a guest post from Anndy Lian.\n\nSEC Chair Gary Gensler reiterated that Bitcoin is not a security but a commodity under the Commodity Futures Trading Commission (CFTC) purview. He also stated that “everything else other than bitcoin is a security,” which has significant implications for regulating cryptocurrencies and digital assets in the United States.\n\nGensler’s statement reflects the SEC’s long-held view that many cryptocurrencies and digital assets are securities under U.S. law. The SEC’s definition of a security is broad — it includes any investment contract in which an individual invests money in a common enterprise with the expectation of profits solely from the efforts of others. In other words, if an asset is sold as an investment with the expectation of profit based on the efforts of others, it is likely to be considered a security.\n\nGensler’s comments have sparked debate in the cryptocurrency community. Some argue that his view is overly broad and that many digital assets do not fit the SEC’s definition of a security. Others argue that the SEC’s approach is necessary to protect investors from fraudulent or manipulative activities in the cryptocurrency market.\n\nOne of the key implications of Gensler’s comments is that many digital assets may be subject to SEC regulation. This could include initial coin offerings (ICOs), a crowdfunding campaign where investors purchase digital tokens in exchange for cryptocurrencies like Bitcoin or Ethereum. Many ICOs have been criticized for their lack of transparency and accountability, and the SEC has taken enforcement action against several ICO issuers in recent years.\n\nAnother implication is that exchanges that trade digital assets may be subject to SEC oversight. Under U.S. law, exchanges facilitating securities trading must register with the SEC and comply with various regulations. If the SEC views many digital assets as securities, then exchanges that trade those assets may also be required to register with the SEC and comply with its regulations.\n\nHis comments suggest that the SEC may take a more aggressive approach to regulating the cryptocurrency market. This could include increased enforcement actions against issuers of digital assets considered securities and against exchanges that facilitate trading those assets. It could also lead to new regulations to increase transparency and accountability in the cryptocurrency market.\n\nThe SEC’s approach to regulating cryptocurrency has been debated for several years. Some argue that the SEC’s current approach is too cautious and stifling innovation in the cryptocurrency space. Others argue that increased regulation is necessary to protect investors from fraud and manipulation.\n\nGensler’s comments suggest that the SEC will likely take a more assertive approach to regulate the cryptocurrency market in the coming years. This could include increased enforcement actions, new regulations, and closer scrutiny of digital assets and exchanges that operates in the U.S.\n\nMaybe we can take a step back to look into a few things. Firstly, it’s important to understand the context of Gensler’s statement. As mentioned earlier, Gensler reiterated the SEC’s stance in an interview with CNBC in July 2022 that Bitcoin is not a security but a commodity that falls under the Commodity Futures Trading Commission’s jurisdiction. He did not label other digital assets, avoiding answering the question directly. However, in a tweet by Jake Chervinsky in February 2023, it was suggested that Gensler may have prejudged that every digital asset aside from Bitcoin is a security.\n\nThen my question is: What exactly is a security? In the US, the Securities Act of 1933 defines a security as any investment contract, note, stock, or any other type of investment in a common enterprise with the expectation of profits solely from the efforts of others. In simpler terms, it means an asset representing an ownership interest or a right to receive future profits or cash flows from a third party.\n\nSuppose we consider Gensler’s statement that everything other than Bitcoin is a security. In that case, it implies that most digital assets such as Ethereum, XRP, and other cryptocurrencies would be considered securities under US law. This means that they would be subject to SEC regulations and oversight. It’s worth noting that this is not a new position for the SEC. For years, the SEC has warned cryptocurrency companies that their tokens could be classified as securities if they meet certain criteria.\n\nThe implications of this classification are significant. If a digital asset is classified as a security, the issuer must comply with SEC regulations, including registration and disclosure requirements. It would also have to follow strict trading, reporting, and investor protection rules. Additionally, investors would be protected under federal securities laws, which could increase their confidence in the digital asset market. However, it could also lead to additional costs and regulatory burdens for the companies issuing digital assets.\n\nMy opinion on this matter is that while Gensler’s statement may have been perceived as a blanket statement, the SEC’s approach to regulating cryptocurrencies is nuanced and fact-specific. The SEC has been clear that it will evaluate each token on a case-by-case basis to determine whether it meets the legal definition of a security. In other words, just because a digital asset is not Bitcoin does not automatically mean it’s a security.\n\nFurthermore, regulatory oversight is necessary for the cryptocurrency market to mature and gain mainstream adoption. The lack of clear regulations has been a major roadblock for institutional investors, who are hesitant to invest in a market perceived as unregulated and risky. Clear regulations would also protect retail investors who may not have the knowledge or resources to navigate the complex world of cryptocurrencies.\n\nTo conclude, while Gensler’s statement that “everything other than Bitcoin” is a security may have caused some alarm in the cryptocurrency community, we believe that it’s important to view it in the context of the SEC’s broader approach to regulating digital assets. The SEC’s focus on investor protection and market integrity is crucial for the long-term success of the cryptocurrency market.\n\nAs the market continues to evolve, we expect that the SEC’s approach will continue to evolve, and we look forward to seeing how it develops. Meanwhile, I hope SEC can be more precise and take a more responsible stance when putting statements out in the market.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMDIvMjgvMTA2OTE5MC9ldGhlcmV1bS1tb3ZlZC10by1wcm9vZi1vZi1zdGFrZS13aHktY2FudC1iaXRjb2luL9IBamh0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMDIvMjgvMTA2OTE5MC9ldGhlcmV1bS1tb3ZlZC10by1wcm9vZi1vZi1zdGFrZS13aHktY2FudC1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum moved to proof of stake. Why can’t Bitcoin? - MIT Technology Review",
        "content": "Bitcoin mining, the computationally intensive process by which new coins are created and accounted for, has become a global concern. After China cracked down on the process in mid-2021, miners sought out other areas of the world where energy was cheap, but not always clean. In places like Kazakhstan, miners put pressure on the power grid, which relies heavily on carbon-intensive coal-fired power stations, causing localized blackouts and contributing to civil unrest. In upstate New York, where miners took over shuttered factories and empty warehouses, locals have complained of rising energy bills and the high-frequency whine of whirring data center fans—and worried about the environmental toll mining is taking. The US currently hosts 38% of all bitcoin mining operations.\n\nA single Bitcoin transaction uses the same amount of energy as a single US household does over the course of nearly a month. But does it have to be that way? The Bitcoin community has historically been fiercely resistant to change, but pressure from regulators and environmentalists fed up with Bitcoin’s massive carbon footprint may force them to rethink that stance.\n\nA variety of other countries, including Kazakhstan, Iran, and Singapore, have also set limits on crypto mining. In April 2023, the European Parliament is due to pass a landmark crypto bill called Markets in Crypto Assets (MiCA), which mandates environmental disclosures from crypto firms. The law is expected to go into force sometime in 2024.\n\nThat may be just the start for the EU: the European Central Bank has previously stated it cannot imagine a world where governments would ban gasoline-powered cars in favor of electric vehicles but not act on Bitcoin’s persistence in pumping out CO2. “Some members of the European Parliament are already wondering why Bitcoin is not following Ethereum,” Alex de Vries, the data scientist behind Digiconomist, a website that tracks cryptocurrency energy use, told MIT Technology Review.\n\nEfforts to crack down on Bitcoin’s waste are gaining steam in the US as well. In November, New York became the first state to enact a temporary ban on new cryptocurrency mining permits at fossil-fuel plants. The new law also requires New York to study crypto mining’s impact on the state’s efforts to reduce its greenhouse-gas emissions.\n\nSo what would it take to make a switch?\n\nProof of work vs. proof of stake\n\nCryptocurrencies have no central guardian, like a bank, to oversee their public ledgers—the shared digital record of every transaction on the blockchain. Instead, they rely on consensus mechanisms to agree on updates. In proof of work, the approach Bitcoin relies on, a worldwide network of computers—known as “miners”—spends electricity trying to win a lottery of sorts. Whoever wins gets to append the next block and collect new coins in the process. The chance of winning is in direct proportion to the number of computations a miner does. As a result, massive server farms have sprung up around the globe dedicated solely to winning this lottery.\n\nProof of stake, the approach Ethereum now uses, does away with this massive energy consumption. Instead of miners, proof-of-stake systems employ vast numbers of “validators.” To become a validator, you have to deposit, or “stake,” a set amount in coins—32 ether, in the case of Ethereum. Staking gives validators a chance to check new blocks of transactions and add them to the blockchain so they can earn rewards on top of their staked coins. The more coins you stake, the better your odds of getting picked to add the next block of transactions to the chain."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tcHVua3MtZXhjZWVkLTExNDUtZXRoLWRhaWx5LXRyYWRpbmctdm9sdW1lLWJpdGNvaW4tb3JkaW5hbHMtZ2Fpbi10cmFjdGlvbi_SAWtodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLXB1bmtzLWV4Y2VlZC0xMTQ1LWV0aC1kYWlseS10cmFkaW5nLXZvbHVtZS1iaXRjb2luLW9yZGluYWxzLWdhaW4tdHJhY3Rpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Punks exceed 1,145 ETH in daily trading volume as Bitcoin Ordinals gain traction - Forkast News",
        "content": "Bitcoin Punks, the Bitcoin-native spin-off of the popular CryptoPunks blue chip non-fungible token (NFT) collection, saw over 1,145 Ether worth of daily trading volume on Feb. 28, according to data from blockchain analytics firm Dune.\n\nBitcoin Punks is the first collection of 10,000 NFTs on Bitcoin, which were uploaded from the original Ethereum-native CryptoPunks collection via the Ordinals protocol. Bitcoin Punks are 10,000 of the first 34,400 Ordinal inscriptions on the network, which could make them more valuable for collectors.\n\nThe sales surge in Bitcoin Punks occurred on the same day that Yuga Labs, the U.S.-based company behind Bored Ape Yacht Club, announced plans to launch its first NFT collection on the Bitcoin network, TwelveFold.\n\nYuga’s announcement came a week after the Bitcoin network exceeded 154,000 inscriptions within a month of the launch of the Ordinals protocol. The network has over 228,000 inscriptions at the time of publication, according to Dune data.\n\n“BTC now has an extra use case other than just being a currency. BTC is now a place where NFTs or ‘digital artifacts’ can be created and stored on every single node on the Bitcoin network. The added benefit of having a rock-solid use case of NFTs added to BTC will impact miner fees to go up as demand for network resources go up. IE: Sats/kb will go up, unless new ways to reduce the cost go down,” wrote Yohann Calpu, chief marketing officer at NFT data aggregator CryptoSlam, to Forkast.\n\nJonas Betz, a crypto analyst based in Germany, agreed that Ordinals can benefit the Bitcoin network.\n\n“The usage of Ordinals comes with an increased transaction volume on Bitcoin, which increases the rewards for miners and can therefore help to make the network stronger and more decentralized. Secondly, Ordinals can also increase Bitcoin adoption by appealing to a wider audience that is interested in NFTs and the broader digital art market. This can help increase demand for Bitcoin and potentially drive up its price,” wrote Betz.\n\n“But there is also a flipside, as Ordinals are dividing the Bitcoin community. Many Bitcoin proponents are not in favor of a divergence from Bitcoin’s original use case as a store of value and a medium of transfer. Ordinals could also consume more Bitcoin block space, making Bitcoin transactions more expensive,” he added.\n\nKasper Vandeloock, chief executive officer of quantitative trading firm Musca Capital, said that Ordinals will be limited in utility.\n\n“There are a lot of Bitcoin believers that are not fans of Ordinals but I think it’s an amazing thing. The more utility it has the better, however, I am afraid that it will not have many use cases. Something interesting about NFTs is the DeFi part of it which is developing, like being able to use NFTs as collateral and getting loans,” wrote Vandeloock, adding that he is “not expecting it to be a big part of the Bitcoin network.”\n\nTexas-based Bitcoin core developer Jimmy Song said that Ordinals have a “unique” way of storing digital art. “The unique thing about these is that the entire jpeg or image is stored in the transaction instead of there being a pointer to an image like in other chains.”\n\nCryptoSlam’s Calpu agreed that Ordinals stand out from traditional NFTs.\n\n“The big deal about Ordinals is that there are no other ‘coins’ created for NFTs to be generated on BTC, unlike $XCP (Counterparty) and $STX (Stacks) which Bitcoin maximalists called “shitcoins” and were never fully accepted,” he wrote.\n\n“How it does this is by using the op_return field, and having data ‘inscribed’ within it (via Taproot upgrade) that allows for a single satoshi (smallest unit of BTC) to be utilized as the data carrying vessel,” Calpu added.\n\nSee related article: At least US$577 million of Blur-linked NFT sales are wash trades, CryptoSlam says"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjgvYml0Y29pbi1yaXNrcy1kZWVwZXItcHVsbGJhY2stdG93YXJkLTIway1jaGFydC1hbmFseXN0cy_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI4L2JpdGNvaW4tcmlza3MtZGVlcGVyLXB1bGxiYWNrLXRvd2FyZC0yMGstY2hhcnQtYW5hbHlzdHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin at Risk of Deeper Pullback Toward $20K: Chart Analysts - CoinDesk",
        "content": "\"Technically, bitcoin is selling off after touching its 200-week moving average. And due to the negative momentum at the end of the week, it has also fallen below the 50-week moving average. This dynamic may be a prologue to further declines, a predictable tug-of-war near trend levels,\" Kuptsikevich said in an email on Monday."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjgvY29udGludWVkLXRoaW5uaW5nLW9mLWxpcXVpZGl0eS1pbi1iaXRjb2luLWFuZC1ldGhlci1tYXJrZXQtd29ycmllcy10cmFkZXJzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjgvY29udGludWVkLXRoaW5uaW5nLW9mLWxpcXVpZGl0eS1pbi1iaXRjb2luLWFuZC1ldGhlci1tYXJrZXQtd29ycmllcy10cmFkZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto Traders Worried About Liquidity Thinning in Bitcoin and Ether - CoinDesk",
        "content": "Data from Paris-based crypto data provider Kaiko show bitcoin's 2% market depth for USDT pairs aggregated from 15 centralized exchanges has slipped to 6,800 BTC, the lowest since May 2022 when the Terra network collapsed and below the level that followed the demise of crypto exchange FTX. It's down significantly from the October highs of above 15,000 BTC. Ether's 2% market depth has more than halved to 57,000 ETH since October, led by Binance."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvY3J5cHRvLW9wdGlvbnMtZXhjaGFuZ2UtZGVyaWJpdC1hbm5vdW5jZXMtYml0Y29pbi12b2xhdGlsaXR5LWZ1dHVyZXMv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8wMS9jcnlwdG8tb3B0aW9ucy1leGNoYW5nZS1kZXJpYml0LWFubm91bmNlcy1iaXRjb2luLXZvbGF0aWxpdHktZnV0dXJlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Crypto Options Exchange Deribit to Offer Bitcoin Volatility Futures - CoinDesk",
        "content": "\"DVOL futures are an exciting new product that will allow traders to hedge their positions & general risk management, take advantage of market volatility, but also the alpha generation and portfolio diversification,\" Strijers said. \"This product is particularly useful for those who want exposure to BTC volatility but do not want to trade complex options strategies.\""
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvYml0Y29pbi1qdW1wcy00LWFzLXVwYmVhdC1jaGluYS1tYW51ZmFjdHVyaW5nLXBtaS1yZXZpdmVzLXJpc2stYXBwZXRpdGUv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8wMS9iaXRjb2luLWp1bXBzLTQtYXMtdXBiZWF0LWNoaW5hLW1hbnVmYWN0dXJpbmctcG1pLXJldml2ZXMtcmlzay1hcHBldGl0ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Jumps 4% as Upbeat China Manufacturing Data Improves Risk Appetite - CoinDesk",
        "content": "\"Liquidity continues to be a huge offset to the tightening in rates, predominantly coming from the East. China continues to pump cash to maintain adequate liquidity in the banking system and to spark economic growth post covid-zero,\" David Brickell, director of institutional sales at crypto liquidity network Paradigm, said in the Fed. 28 edition of Macro Pulse newsletter."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvYml0Y29pbi1ldGhlci1zZXR0bGUtaW50by1hLXJhbmdlLWFzLWluZGljYXRvcnMtcG9pbnQtbmV1dHJhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether Settle Into a Range as Indicators Point Neutral - CoinDesk",
        "content": "All told, crypto markets appear to be in a holding pattern, and a significant bullish catalyst is not currently appearing on the horizon. Crypto holders have been reluctant to take profits following the move higher. The result is an asset that has plateaued while looking for the next directional signal."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzAxL2NyeXB0by1tYXJrZXQtZmVicnVhcnktcm91bmR1cC1iaXRjb2luLWxheWVyLTItcHJvdG9jb2wtc3RhY2tzLWV0aGVyZXVtLXN0YWtpbmctZGVyaXZhdGl2ZS10b2tlbnMtc3VyZ2Uv0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvY3J5cHRvLW1hcmtldC1mZWJydWFyeS1yb3VuZHVwLWJpdGNvaW4tbGF5ZXItMi1wcm90b2NvbC1zdGFja3MtZXRoZXJldW0tc3Rha2luZy1kZXJpdmF0aXZlLXRva2Vucy1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market February Roundup: Bitcoin Layer 2 Protocol Stacks, Ethereum Staking Derivative Tokens Surge - CoinDesk",
        "content": "“Altcoin cycles tend to be short-lived, but this is beyond the norm and has all the hallmarks of a bored market chasing opportunities, in addition to no new capital inflows,” he wrote, adding: “Poor liquidity facilitates this erratic pattern, and you do not want to be the one holding the bag when the music ends.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMjgvcHJvcG9zZWQtYml0Y29pbi12YXVsdC1mZWF0dXJlLWNvdWxkLXRod2FydC1tYWxpY2lvdXMtaGFja2Vycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Proposed Bitcoin Vault Feature Could Thwart Malicious Hackers - CoinDesk",
        "content": "O’Beirne recommended Speedy Trial – the same process used to activate the 2021 Taproot upgrade – as the preferred method for activating op_vault. Speedy Trial allocates a three-month activation window for the Bitcoin network to reach a threshold of miners who signal support for a proposed upgrade. The upgrade is adopted only if that specific threshold is reached. The use of Speedy Trial isn’t without its detractors, some of whom believe it gives certain groups within the Bitcoin community too much influence."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vZGFpbHlicnVpbi5jb20vMjAyMy8wMy8wMS9iaXRjb2luLW1hcmtldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Market 71491 - Daily Bruin",
        "content": "Exploring the Possibility of a Bullish or Bearish Bitcoin Market in the Future\n\nWith Bitcoin’s price rising to unprecedented levels, it is no wonder that more and more people are asking themselves whether the digital currency is in for a bullish or bearish market in the future. While predicting the future of Bitcoin can be a tricky task, there are some factors that may help us determine what kind of market we could expect from the cryptocurrency.\n\nFirst, it is important to consider the current state of the global economy. If economic conditions remain stable and healthy, then BTC price will likely stay relatively high as investors continue to invest in it. On the other hand, if economic conditions worsen and uncertainty increases, then investors may start selling off their holdings and prices could drop significantly.\n\nThere are government regulations surrounding cryptocurrencies like Bitcoin. If governments impose strict regulations on them, then this could discourage potential investors from investing in them, and this would lead to lower prices for cryptocurrencies. On the other hand, if governments choose not to regulate them too heavily, then this could encourage people to invest in them which would lead to higher prices for the cryptocurrencies.\n\nOverall, while predicting whether we can expect a bullish or bearish market with regards to Bitcoin is difficult at best, taking these factors into account should help give us an idea as to what kind of market we might be able to see with Bitcoin and other cryptocurrencies in the near future.\n\nWhat are some key drivers of the price movements of Bitcoin?\n\nThe price movements of Bitcoin are driven by a variety of factors, including news and events related to the cryptocurrency, as well as market sentiments. News about Bitcoin such as when it is adopted by major companies or governments, typically influences its price. Market sentiments also play an important role in driving Bitcoin’s price movements. When investors become more optimistic about the future of Bitcoin, they tend to buy more of it, which drives up its price. On the other hand, when investors become pessimistic about the prospects of Bitcoin, they tend to sell off their holdings, and this causes its price to drop.\n\nRelated: https://dailybruin.com/2023/03/20/bitcoin-dominance/\n\nInvestigating the impact of global economic conditions on Bitcoin trading\n\nBitcoin trading is a complex and dynamic process that is heavily influenced by global economic conditions. Bitcoin is a decentralized digital currency that operates on a peer-to-peer network, meaning there are no central banks or governments controlling its value or supply. As such, its value can be highly volatile and subject to rapid changes in response to global economic events. For example, when news of an impending recession breaks out, investors may flock to Bitcoin as a safe haven asset due to its decentralized nature and lack of government control. On the other hand, if news of an economic boom emerges, investors may be more likely to invest in traditional assets such as stocks and bonds instead of Bitcoin due to their perceived stability and higher returns.\n\nIs Bitcoin expected to remain volatile in the long-term, or is it likely to stabilize over time?\n\nThe future of Bitcoin is uncertain, and its price may go one way or the other even in the long term. While some experts believe that Bitcoin will eventually stabilize over time, others think it will continue to be highly volatile due to its decentralized nature and lack of regulation. As more people become aware of Bitcoin and start investing in it, the demand for the cryptocurrency could increase significantly, which could lead to further volatility. Also, as governments around the world begin to regulate cryptocurrencies more strictly, this could have an impact on the price movement of Bitcoin. Ultimately, only time will tell whether or not Bitcoin will remain volatile in the long term or if it will eventually stabilize over time."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYmluYW5jZS1jb2luLWxvc2VzLTYtYmlsbGlvbi0yMDQxMTA3NTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Binance coin loses $6 billion in market cap, bitcoin holders hopeful on $30,000 by end of March - Yahoo Finance",
        "content": "Yahoo Finance crypto reporter David Hollerith joins the Live show with updates on Binance and bitcoin.\n\nVideo Transcript\n\n[AUDIO LOGO]\n\n- Investors piling out of Binance Coin, with more than $6 billion of outflows over the past month. David Hollerith here to discuss what is happening here, my man.\n\nDAVID HOLLERITH: Dave, so two weeks ago, the US-based crypto trust company Paxos, which creates an issues the Binance USD stablecoin, the stablecoin you're talking about, was ordered to stop creating new versions of the token by New York regulators. And since then, we've seen about $6 billion fall from the market cap of this coin. A little more than half of that total has flowed into two larger stablecoins, Tether and Circle's USDC. So prior to the regulatory crackdown, Binance USD was the third largest stablecoin. But this is the beginning of-- excuse me, not the beginning, this is the latest of what's been a series of kerfuffles and financial questions that have been thrown towards Binance in the wake of FTX's collapse.\n\nThere's also been this \"Forbes\" article that came out on Monday that drew attention to the fact that Binance may be moving assets in-- or, excuse me, the assets that support stablecoins linked to this stablecoin, which are also known as B tokens. They've been moving those outside of the exchange's wallets and to other parties, including trading firms, which also include Alameda Research. So there's a lot of questions about that transaction flow and what it could mean for customers' assets.\n\nAnd Binance has rebuked a lot of these charges. Their statements have been mixed. But more or less, they've said that the report has been a misunderstanding of blockchain data.\n\nNow, while it remains to be seen what is correct, the CSO of Binance or shortly after Paxos experienced this crackdown had said that regardless of how the exchange keeps cryptocurrency in wallets, it keeps a separate ledger for corporate transactions, for corporate money and customer money. But it's really not been made clear whether or not that's actually being divided in practice in how they keep the money in wallets. And if what Forbes is alleging is true in backing, I will say, with blockchain data, it would seem that at least for a period in late August, Binance did move funds that were supposed to back one of its-- a few of its stablecoins to trading firms, which would mean the company was lending and not necessarily backing its assets one for one, as they have said they've been doing. But, again, this is all something that we're going to continue to watch as it unfolds.\n\nStory continues\n\n- We certainly will. And, David, while we have you, Bitcoin. Let's talk about the price that we have seen, the rally that we have seen since the start of the year. You're looking at Bitcoin up just over 40% since January 1.\n\nWhat do you make of this massive rally that we've seen? And we're starting a new month today, the first day of March. Enough for that momentum to continue?\n\nDAVID HOLLERITH: Yeah, January was momentum fueled for cryptocurrencies. And through February, we actually saw the rally fizzle out. Cryptocurrencies in general ended yesterday, the end of February, flat. And while volatility has fizzled, traders are still piling into the crypto options market.\n\nAnd they have concentrated bets, according to the data, from platform Amber Data of Bitcoin hitting $30,000. And that's the highest concentration, although there's a lot of bets that have been placed between $25,000 and $30,000. And $25,000, of course, is the price that traders have been looking for Bitcoin to rally past. It did breach that price point in February briefly. But that's been the point of contention here.\n\nAnd the expiration date for options right now, the highest amount is set for March 31. So unless the price goes higher before then, we could expect a large liquidation. But, that being said, it looks like because there's little resistance in between $25,000 and $30,000, if the price does get a momentum rally this month above $26,000 or something like that, we could very easily see $30,000.\n\n- All right, David Hollerith, always great to have you there. It's certainly been incredible watching the price action as of late when it comes to crypto and Bitcoin more specifically."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRlcG90LWNvbnZlcnRzLWJ0Yy1hdG1zLXRvLXNvZnR3YXJlLXRvLXJlZHVjZS1vcGVyYXRpbmctY29zdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Depot converts BTC ATMs software to reduce operating costs - Cointelegraph",
        "content": "Disclaimer: The article has been updated to reflect that Bitcoin Depot converted the operating software of the Bitcoin ATMs.\n\nCrypto ATM installations have seen a steady decline across the world over the past several months. While some ATMs have been taken out of operation due to geopolitical tensions and revenue decline, providers like Bitcoin Depot have started converting the operating software of physical Bitcoin (BTC) ATMs to improve bottom lines.\n\nBitcoin Depot recently converted the operating software of all 7,000 crypto ATMs and kiosks to a software-based offering powered by BitAccess. The software conversion drive came after Bitcoin Depot acquired majority equity in Bitaccess in November 2022. Months before the deal, Bitcoin Depot had revealed plans to go public in 2023 via an $885 million deal with a special-purpose acquisition company.\n\nThe software conversion of the crypto ATMs, which vertically integrates Bitcoin Depot’s hardware and software, eliminates annual software licensing fees. The fees previously accounted for $3 million in annual operational costs.\n\nCrypto ATM growth by manufacturers. Source: Coin ATM Radar\n\nIn the first half of 2022, BitAccess became a market leader. However, since July 2022, the company has seen a consistent decline in total ATM installations, confirms data from Coin ATM Radar.\n\nAs shown in the above graph, BitAccess is currently down to third position after Genesis Bytes and Genesis Coin, both of whom have increased their market share in the same timeline. Explaining the motive behind the move, Bitcoin Depot’s vice president of BTM operations, Jason Sacco, stated:\n\n“By swapping out the existing hard drive with one preloaded with BitAccess software, we quickly completed the software conversion while avoiding certain technical issues that can happen in field conversion projects.”\n\nSacco also revealed that the first 6,000 of Bitcoin Depot’s Bitcoin ATMs were software converted in 10 weeks. The increase in crypto ATMs is directly proportional to the amount of crypto exposure for the general public.\n\nWhen El Salvador opted for Bitcoin as a legal tender, President Nayib Bukele announced the country would build a supporting infrastructure of 200 ATMs and 50 branches.\n\nRelated: Australia overtakes El Salvador to become 4th largest crypto ATM hub\n\nThe United Kingdom’s financial regulator, the Financial Conduct Authority (FCA), recently announced that all crypto ATMs operating in the U.K. are unregistered and illegal.\n\nAt the time, FCA’s executive director of enforcement Mark Steward shared the intention to disrupt unregistered crypto businesses in the country."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbGxpb25haXJlcy1pbmNyZWFzZWQtMTQwLWFzLWJ0Yy1wcmljZS1jcm9zc2VkLTIway1kYXRh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin 'millionaires' increased 140% as BTC price crossed $20K — data - Cointelegraph",
        "content": "Bitcoin (BTC) millionaires are made when the BTC price crosses $20,000, data reveals.\n\nAccording to on-chain analytics firm Glassnode, there are currently over 67,000 BTC wallets worth $1 million or more.\n\n$20,000 makes 50-BTC hodlers happy\n\nBitcoin is famous for its relationship with the $20,000 price tag.\n\nProminent since becoming the all-time high of Bitcoin’s previous halving cycle, $20,000 is more than just a technical and psychological line in the sand.\n\nAs Glassnode now shows, when BTC/USD crosses that price point, many hodlers either gain or lose U.S. dollar millionaire status.\n\nIn late 2022, for example, when Bitcoin fell below $20,000 in the wake of the FTX scandal, “millionaire” wallet numbers plummeted like a stone overnight.\n\nFast forward to January 2023, and the opposite can be observed — as soon as BTC/USD reclaimed the $20,000 mark, those wallets reappeared en masse.\n\nOn Jan. 13, with BTC/USD at just under $20,000, there were around 27,000 wallets with a balance worth $1 million or more.\n\nOn Jan. 14, that wallet cohort had increased to 65,000, while the price traded just $1,000 higher. Many wallets, it appears, contain exactly 50 BTC.\n\nFor reference, at the time of Bitcoin’s most recent all-time high in November 2021, wallets worth $1 million or more totaled almost 113,000.\n\nBitcoin wallets with a balance worth $1 million or more chart. Source: Glassnode\n\nNearly 1 million “wholecoiners”\n\nAs Cointelegraph reported, hodlers’ fortunes have increased dramatically in the first months of 2023.\n\nRelated: Bitcoin exchanges now own 16% less BTC than the oldest hodlers\n\nIt is not only millionaires who have regained crucial financial buoyancy lost during the 2022 bear market — both long-term and short-term holders are knuckling down and even refusing to cash out.\n\nMeanwhile, the number of so-called “wholecoiners” — wallets with a balance of at least 1 BTC — continues to track toward the 1 million mark for the first time in Bitcoin’s history.\n\nAs of Feb. 28, there are 982,726 such wallets, Glassnode shows.\n\nBitcoin wallets with a balance of 1 BTC or more chart. Source: Glassnode\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV4Y2hhbmdlcy1ub3ctb3duLTE2LWxlc3MtYnRjLXRoYW4tdGhlLW9sZGVzdC1ob2RsZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin exchanges now own 16% less BTC than the oldest hodlers - Cointelegraph",
        "content": "The latest data shows that Bitcoin (BTC) exchanges have less BTC to buy than at any time since early 2018.\n\nOn-chain analytics firm Glassnode confirms that as of February 2023, exchange reserves are at five-year lows.\n\n“Wild stat” shows Bitcoin supply maturation\n\nThe latest statistics reflect the determination of Bitcoin hodlers, as major exchanges’ BTC balances are in “down only” mode.\n\nAs of Feb. 27, the latest date for which data is available, the platforms tracked by Glassnode held a combined 2,272,798 BTC.\n\nIt was in March 2018 that the number was previously so low, with March 2020 representing the current all-time high of 3,202,326 BTC.\n\nAfter the COVID-19 cross-market crash, exchange reserves began to fall, accelerating through the 2022 bear market to stand 29% lower today.\n\nBitcoin exchange balance chart. Source: Glassnode\n\nThe impressive numbers, meanwhile, do not end there.\n\nAs noted by William Clemente, co-founder of Bitcoin-focused research firm Reflexivity, the exchange balance lows mean they now hold less BTC than the oldest hodler addresses.\n\n“There is now more Bitcoin that hasn’t moved in at least 10 years than there is on exchanges. Wild stat,” he commented on Feb. 28.\n\nGlassnode data also puts the total BTC dormant for ten years or more at 2,645,956 BTC — 16% more than the total exchange balance.\n\nBTC supply last active 10+ years ago chart. Source: William Clemente/ Twitter\n\nNo panic selling here\n\nAs Cointelegraph reported, hodlers have stepped up their resilience in 2023 after weathering a brutal bear market in the past year.\n\nRelated: BTC whale population shrinks to early 2020 levels — 5 things to know in Bitcoin this week\n\nEven as BTC price action headed higher, the hodling continued, with limited sales combined with increasing exposure.\n\nThat trend shows little sign of reversing at current levels, with hodlers’ combined net position change reaching four-month highs this weekend.\n\nBitcoin hodler net position change chart. Source: Glassnode/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTI4L2JpdGNvaW4tYnRjLXRyYWRlcnMtZXllLTMwLTAwMC1ldmVuLWFzLXZvbGF0aWxpdHktZHJvcHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Traders Eye $30,000 Even as Momentum Wanes - Bloomberg",
        "content": "Crypto investors are scooping up call options betting on a Bitcoin rebound to $30,000, even as momentum in the digital-asset market stalls.\n\nBitcoin options open interest rose in February to $9 billion, according to Bloomberg Intelligence’s Jamie Coutts , who cited Glassnode data. The last time it was at this level, the coin had been trading around $45,000, whereas it’s currently hovering around $23,700. It’s the largest 14-day rate of change in its history, and is a record high when measured as a percentage of market cap, he said."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdGFja3Mtc3R4LXN1cmdlcy1hcy1iaXRjb2luLW5mdC1oeXBlLWdyb3dzLWJ1dC1pdHMtYmxvY2tjaGFpbi1hY3Rpdml0eS1yYWlzZXMtY29uY2VybtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Stacks (STX) surges as Bitcoin NFT hype grows, but its blockchain activity raises concern - Cointelegraph",
        "content": "Stacks is one of the first blockchains to enable a way for minting Bitcoin (BTC) Ordinals, which puts it in an excellent position to benefit from the hype. However, Ordinals have invoked an issue from the past where Bitcoin maximalist ideologies will be tested if the NFTs lead to network congestion.\n\nOn top of that, Stacks has yet to deliver all the functionalities required to support an NFT trading ecosystem and it faces competition from projects in other blockchain ecosystems. The fundamental and technical analysis of the project suggests that the price surge might have reached overbought conditions and may correct in the near term.\n\nOrdinals development is unpredictable for now\n\nThe recent focus on inscribing NFTs on the Bitcoin network peaked in the last month after Casey Rodarmor inscribed an Ordinal on Jan. 29. While the trend took off to an overwhelming start, the minting is limited to technical users with a Bitcoin node and trading primarily takes place through OTC channels.\n\nIn comparison to Ethereum NFT marketplaces, the infrastructure for Bitcoin NFT trading remains significantly underdeveloped in regards to complex activities like decentralized trading. Many investors have expressed their belief that there needs to be a way to spin up marketplaces and NFT minting platforms for Ordinals.\n\nThe Bitcoin developer community has previously discouraged using the network for anything other than payments because it clogs the space and increases transaction fees. In the bull run of 2020 and 2021, many Ethereum users paid hundreds of dollars in fees per transaction as user activity on it exploded. On the other hand, Bitcoin’s fees stayed at optimum levels throughout the bull run, but the usage and earnings of the protocol lagged behind Ethereum.\n\nAccording to a CoinShare report, the adoption of Ordinals will again be subject to the social acceptance of the method to inscribe additional data on the Bitcoin blockchain, which is bound to present challenges such as network congestion and increased fees.\n\nThe report goes on to review previous failed attempts to use the Bitcoin blockchain for smart contract activity, saying that “similar projects of Bitcoin’s past have had little impact on investors and users alike.”\n\nThe number of Ordinals inscribed on Bitcoin surged significantly at the start of February as the instrument exploded. However, the trend slowed down due to a lack of trading infrastructure, with less than 10,000 NFTs inscribed on most days.\n\nStack blockchain’s native STX (STX) token jumped by 256% in February, thanks to hype around Bitcoin NFTs and an upcoming upgrade to the project.\n\nNumber of ordinals inscribed on Bitcoin daily. Source: Dune\n\nIt remains to be seen how the Bitcoin community reacts to an increase in network congestion and Bitcoin fees if the Ordinals hype grows.\n\nStacks price rises on speculation, while activity is low\n\nThe idea is that Stacks will make Bitcoin Ordinals more accessible to users by facilitating minting processes and hosting marketplaces.\n\nStacks Foundation, the team managing the blockchain, on Feb. 22 announced a new upgrade to the protocol, Stacks 2.1, which seeks to improve the blockchain by adding EVM compatibility and synthetic Bitcoin (sBTC) through a secure bridge to Bitcoin.\n\nOn top of that, the .BTC naming service lives on the Stacks network, which could generate a lot of trading activity if the demand for .BTC addresses increases. In its current state, a .BTC Stacks address is largely detached from the Bitcoin network. Meaning, users cannot send and receive Bitcoin at these addresses like its .ETH counterpart.\n\nAfter the 2.0 upgrade, Stacks will enable direct sending of Stacks assets to Bitcoin addresses. It will enable proxy access to the Bitcoin blockchain without creating a separate Stacks address. It remains to be seen if Bitcoin users find the feature attractive.\n\nWhile the upgrades sound promising, there’s still insufficient blockchain activity to justify the STX price surge. Only around 1,000 unique active wallets engaged with DApps on Stacks in February. The most striking part of Stack’s usage data was that the NFT marketplace Gamma also failed to attract considerable users to its platform, with less than 100 wallets trading daily on the marketplace.\n\nTop used dApps on Stacks between Jan. 28 and Feb. 27. Source: DappRadar\n\nGamma supports minting and sending Bitcoin ordinal NFTs via Stacks. However, many users have faced UX-related problems while using the feature, as it requires a separate address in a Stacks wallet that is Ordinal compatible. Many users have mistakenly sent their NFTs to wrong addresses. The wallet issue has also restricted the trading of Bitcoin NFTs.\n\nGamma NFT marketplace stats. Source: DappRadar\n\nDevelopers in the Stacks ecosystem, like the Xverse team, are working on a wallet to bring user-friendly Ordinals support. There's also an experiment with atomic swaps between Bitcoin NFTs and STX in the works. The aim is to develop this functionality into a complete marketplace.\n\nHowever, other ecosystems are also looking to bank on this trend. For instance, Ordinex is developing an Ordinals trading platform, which will be accessible for Ethereum users through Metamask. Some Ethereum native projects, like OnChainBirds and SappySeals, have also inscribed the NFTs on Bitcoin and enabled trading on OpenSea. However, the trading activity of these collections remains average, with little hype.\n\nBesides Stacks, many other ecosystems are trying to bank on the opportunity by facilitating Bitcoin NFTs. While Stacks enjoys a technical advantage over others, Ethereum has a loyal user base and adequate liquidity to outperform Stacks’ ecosystem if a feasible solution emerges. Moreover, in the end, it will depend on the response and demand of these NFTs from the Bitcoin community, which may not support euphoria around it.\n\nSTX/USD reaches key resistances zones\n\nThe STX token dilutes at the rate of 2.5% annually. The inflation will reduce after the Bitcoin halving, which is expected to occur in April 2024. The rate of supply increase of STX is low compared to other layer-1 blockchains like Solana and Cardano, which is encouraging. However, the network’s total fees or token economics do not balance the inflation, which needs to change soon.\n\nTechnically, the STX/USD pair is near the top of its two-year trading range at $1.02, which is a potential yellow flag for buyers. If bulls are able to overcome this level, STX can possibly take a shot at the all-time highs near $3.00. However, given that network activity doesn’t correlate to the price rise as of yet, there’s a chance of a pullback toward $0.68 and $0.24.\n\nSTX/USD daily price chart. Source: TradingView\n\nSimilarly, the STX/BTC pair is also near its all-time range of 0.00004350 BTC, which raises the possibility of a correction once those levels are tagged. The downside targets of STX are at 0.00002744 BTC and 0.00001233 BTC.\n\nSTX/USD weekly price chart. Source: TradingView\n\nBitcoin NFTs have a lot of potential, but it is still unclear if the Bitcoin community, which is usually against speculation and activities that clog the network, will allow the trend to prosper.\n\nCurrently, the most crucial aspect of NFT trading — an easily accessible marketplace and wallet — is still missing from the Ordinals ecosystem. As a Bitcoin sidechain, Stacks enjoys technical advantages with Bitcoin integration and it has a slight advantage over other blockchains in providing the tools to support an Ordinals craze.\n\nHowever, the applications to support Ordinals are still in development. Meanwhile, Stacks faces competition from other more liquid ecosystems, which could develop more feasible solutions to integrate Bitcoin NFTs on their chain.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWF0bS1kZWNsaW5lLW92ZXItNDAwLW1hY2hpbmVzLXdlbnQtb2ZmLXRoZS1ncmlkLXVuZGVyLTYwLWRheXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin ATM decline: Over 400 machines went off the grid in under 60 days - Cointelegraph",
        "content": "Crypto ATMs — one of the key infrastructure pillars for the mass adoption of cryptocurrencies — have seen a drastic reduction this year. In the first two months of 2023, the net cryptocurrency ATMs installed globally reduced by 412 machines.\n\nSince 2014, the total number of crypto ATMs has maintained a steady upward trajectory while catering to millions of users worldwide for seamless crypto-fiat conversions. For over a year, between December 2020 and January 2022, more than 1,000 crypto and Bitcoin (BTC) ATMs were being installed every month. However, the bear market had an immediate impact on its growth.\n\nNet crypto ATM installations worldwide. Source: Coin ATM Radar\n\nSeptember 2022 was the first time in history when total crypto ATMs saw a net decline. However, 2023 marked a new low by recording a decline in total crypto ATM installations for two consecutive months.\n\nIn January 2023, the global crypto ATM network shed 289 machines, further dropping by 123 machines in February. While the ongoing decline was initially purely attributed to geopolitical tensions, revenue losses and a prolonged bear market, service providers have been trying out cheaper alternatives for operations.\n\nRecently, crypto ATM provider Bitcoin Depot converted its 7,000 physical machines to BitAccess software. The move helped reduce operational costs related to software licensing fees, which cost $3 million annual.\n\nDo you have an ATM in your area and are unsure how to use it? Check out Cointelegraph’s beginner’s guide to learn everything about Bitcoin ATMs.\n\nRelated: UK-native stablecoin integrates into 18,000 ATMs nationwide\n\nOn the other hand, payments giant Mastercard partnered with Binance to launch a card for crypto payments in Latin America.\n\nOlá, Brasil! #Binance Card has just launched in Brazil - another step towards crypto adoption pic.twitter.com/UJRmpMhpbQ — Binance (@binance) January 30, 2023\n\nIn a press release shared with Cointelegraph, Guilherme Nazar, Binance Brazil’s general manager, stated:\n\n“Payments is one of the first and most obvious use cases for crypto, yet adoption has a lot of room to grow.”\n\nMoreover, at launch, the card offered up to 8% cash back in crypto on eligible purchases and zero fees on some ATM withdrawals."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXMtbGVhc3Qtdm9sYXRpbGUtbW9udGgtZXZlci1idGMtcHJpY2UtZW5kcy1mZWJydWFyeS11cC0wLTAz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin's least volatile month ever? BTC price ends February up 0.03% - Cointelegraph",
        "content": "Bitcoin (BTC) moved just 0.03% last month in United State dollar terms, making February 2023 likely its least volatile in history.\n\nData from Coinglass after the monthly close confirms that BTC/USD went practically nowhere for four weeks straight.\n\nBitcoin monthly candle barely leaves a trace\n\nTo say that Bitcoin is less volatile than it was is something of an understatement when it comes to February.\n\nDespite its ups and downs, mostly due to macroeconomic data, BTC price action finished the month almost exactly where it began at around $23,500.\n\nThat means that Bitcoin was stabler than a raft of mainstream assets, including stocks, commodities and, of course, major world currencies.\n\nThis is no mean feat for cryptocurrency, with Bitcoin often criticized as a poor store of value owing to its sometimes intense volatility.\n\nNonetheless, following January’s 40% gains, bulls held down the fort to preserve every last satoshi versus the start of the month.\n\nMore than that, according to the Coinglass figures, no month has come close to February 2023 in terms of stability, making it the least volatile month on record.\n\nBitcoin monthly returns chart (screenshot). Source: Coinglass\n\nFor the record, March has already changed the trend, with BTC/USD up around 2.9% at the time of writing, as per data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-month candle chart (Bitstamp). Source: TradingView\n\nBitcoin price volatility: All is not what it seems\n\nIn terms of intraday moves, meanwhile, the picture on Bitcoin currently looks decidedly different.\n\nRelated: BTC price needs to close February above 50-month trend line — Analysis\n\nAs Cointelegraph continues to report, exchange order books reveal a concerted effort to spark volatility from some of the largest BTC traders.\n\nOn Binance specifically, these “whales” have created a bid wall that has successfully guided spot price action in what monitoring resource Material Indicators calls “manipulated” markets.\n\n“Bitcoin managed to close February with a green Monthly candle, but IMO nothing for bulls to celebrate,” it wrote in one of several recent tweets on the topic.\n\nAn accompanying chart sought to explain how whales are attempting to influence price action.\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saXF1aWRpdHktaGFzLW1vc3QtYWZmZWN0ZWQtYml0Y29pbi1zLXByaWNlLWluLXRoZS1sYXN0LXllYXItYWNjb3JkaW5nLXRvLXRyYWRlci1icmlhbi1rcm9nc2dhcmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "'Liquidity' has most affected Bitcoin's price in the last year, according to trader Brian Krogsgard - Cointelegraph",
        "content": "Cointelegraph’s Crypto Trading Secrets podcast has published Episode 6, covering an array of content that should pique the interest of cryptocurrency traders. This episode’s guest is Brian Krogsgard, also known as Ledgerstatus on Twitter. Krogsgard is a trader and one of the co-founders of Flip.xyz, a nonfungible token (NFT) platform. He is also a podcaster in the crypto space.\n\nAmong the questions fielded during the Feb. 16 recording, host Benjamin Pirus asked Krogsgard to give his opinion on what he thinks has most impacted the price of Bitcoin (BTC) over the past year. “Liquidity,” he responded.\n\n“People just do not have spare liquidity for a multitude of reasons. They have counterparties that went bankrupt, and that might have forced them to lose money. They got coins stuck on places that went bankrupt. Lost access to them, lost in trading, lost because of taxes, whatever.”\n\n“Those are all challenges for liquidity, and you need liquidity for the healthiest of markets, and so that’s been a challenge,” he added. Amid the runaway train that was the 2022 crypto bear market, the space saw significant turmoil. Several cryptocurrency companies failed, including the likes of crypto exchange giant FTX.\n\n“I would actually say the problems go way before that with Bitcoin because we saw with FTX there was massive rehypothecation of Bitcoin,” Krogsgard continued. “Rehypothecation” is when entities use customers’ collateral for other activities, according to Investopedia. The collapse of FTX in November 2022 sparked numerous headlines, such as allegations of customer asset misuse by FTX and sister entity Alameda Research.\n\n“So, the Bitcoin people thought they had on FTX was not there, and FTX was selling it to do other things. And that rehypothecation was actually a burden to Bitcoin’s price even in a bull market. And now that we have liquidity issues, it’s just been a consistent kind of drag on price and presented challenges for a year and then some.”\n\nKrogsgard provided his thoughts and opinions on several other points during the episode and also chatted about his background.\n\nCheck out this and other episodes from Cointelegraph’s Crypto Trading Secrets podcast on Cointelegraph’s podcast page, Apple Podcasts, Spotify, Google Podcasts or TuneIn.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1taW5lLXNjaG9vbC1jcnlwdG8tZWxlY3RyaWNpdHktYjIyOTE4MzEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Secret bitcoin mine hidden under high school cost thousands of dollars - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nA man has been charged with stealing thousands of dollars worth of electricity after a secret bitcoin mining operation was discovered underneath a school in Massachusetts.\n\nNadeam Nahas, 39, is accused of setting up 11 machines in the crawl space beneath Cohasset Middle/ High School, which used the school’s electricity to mine cryptocurrency – the process of generating new units of digital currency through solving complex computational puzzles.\n\nThe setup was uncovered by the town’s facilities director, who spotted unusual electrical wiring and duct tape during a routine inspection of the school.\n\nMr Nahas, who served as Cohasset’s assistant facilities director, resigned from his post in early 2022 following a three-month investigation into the machines.\n\nHe initially denied any knowledge of the machines, though police say they found credit card receipts in his name for “coleman 48qt coolers, insulated flex ducts, extreme weather foil, insulation sleeves, and a water-based sealant tub, all items located in the crawl space and used to facilitate the mining operation”.\n\nMr Nahas, who denies the allegations, is due to appear in court on 17 May for a pretrial conference.\n\nProsecutors estimate that the mining operation cost the school around $17,500 (£14,500) in electricity during an eight month period in 2021.\n\nBitcoin’s energy consumption has proved controversial in recent years, with estimates suggesting that it is equivalent to that of a small country.\n\nOther leading cryptocurrencies have sought to address environmental concerns by switching from a proof-of-work system to proof-of-stake, which doesn’t require vast computational power in order to operate.\n\nEthereum managed to cut its energy consumption by 99.9 per cent in September 2022 after making the switch in an event known as the Merge."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTI4L2JpdGNvaW4tYnRjLXJhbGx5LWlzLW5lY2Vzc2FyeS1mb3ItY3J5cHRvLW1pbmVycy1wb3N0LTIwMjMtcTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Rally Is Necessary for Crypto Miners Post 2023 Q1 - Bloomberg",
        "content": "Bitcoin ’s new year rally is resuscitating many crypto-mining companies seeking to escape from near financial ruin after one of the most devastating quarters ever for the nascent industry. Whether they succeed in making a comeback remains in question.\n\nHigh electricity costs, a plunge in digital assets prices and persistent network competition in the fourth quarter slashed mining profit margins and made it difficult for miners to stay afloat. Core Scientific Inc., the largest public Bitcoin mining company by computing power, went bankrupt and multiple major miners warned of liquidity crunches. While struggling miners have garnered some relief from Bitcoin’s 40% rebound this year, they are still under financial pressure."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vbmV3cy5hcnRuZXQuY29tL21hcmtldC9iaXRjb2luLW5mdHMtb3JkaW5hbC1pbnNjcmlwdGlvbnMtZXhwbGFpbmVyLTIyNjI2OTLSAVtodHRwczovL25ld3MuYXJ0bmV0LmNvbS9tYXJrZXQvYml0Y29pbi1uZnRzLW9yZGluYWwtaW5zY3JpcHRpb25zLWV4cGxhaW5lci0yMjYyNjkyL2FtcC1wYWdl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "The Crypto Community Has Gone Nuts for Bitcoin NFTs. Here’s How the New Niche Collectibles Are Building Buzz and Value - artnet News",
        "content": "For a niche subset of the Bitcoin maximalist circles, Ordinal Inscriptions have surprisingly and swiftly developed an outsized footprint in the cryptocurrency community. As of February 28, more than 210,000 of these digital assets have been inscribed—from a copy of Doom to a CryptoPunks-inspired collection—and upwards of $1.31 million has been spent in mining fees.\n\nLike NFTs, which are typically linked to the Ethereum network, Ordinal Inscriptions are digital assets that are inscribed on a satoshi, which is the smallest denomination of Bitcoin.\n\nBut unlike NFTs, which can be purchased via platforms like OpenSea and Nifty Gateway, Ordinals are bought and sold on Telegram and Discord channels, as marketplaces or even dedicated wallets for Bitcoin Ordinals have yet to take off.\n\nSo what accounts for their popularity?\n\n5/ It feels like fun early-days alpha Swapping Ordinals in small Discord channels via trusted OTC in an awkward way is exactly what alpha tastes like. You have a passionate group of people who see something special even though the tooling is incredibly bad — dotta (@dotta) February 1, 2023\n\nDevelopers have been striving to integrate NFTs onto the top blockchain, Bitcoin, for almost a decade. This journey began in 2014 with Counterparty, which created the Rare Pepe NFT collection, and continued in 2017 with Stacks. The inscription process involves writing the content data into the witness, or authenticating signature, of the Bitcoin transaction.\n\nWhile Bitcoin’s blockchain can technically support the creation of NFTs, it was not designed with this specific use case in mind, but rather developed to provide a secure, immutable ledger of peer-to-peer transactions. Other blockchain networks, such as Ethereum, were designed with more flexible programming languages and smart contract capabilities that allowed for the creation and management of NFTs from the outset.\n\nDid you know that ordinals are not the first NFTs on Bitcoin? In fact, Bitcoin has had NFTs for nearly a decade! In 2015 Spells of Genesis tokenized the first gaming assets and in 2016 Rare Pepes gave birth to the cryptoart movement. pic.twitter.com/NibfcKxNRZ — Leonidas.og (@LeonidasNFT) February 15, 2023\n\nTechnical details aside, the ability to add inscriptions onto the Bitcoin blockchain has prompted some rather uncanny depictions.\n\nBlock 0, the genesis Ordinal block, pays tribute to the pseudonymous founder of Bitcoin, Satoshi Nakamoto, featuring an interlocking looped GIF of a 3D block, created with ASCII text, spinning against lines from Satoshi’s original white paper.\n\nThe second block of Ordinals paid homage to Hal Finney, the first person to receive a Bitcoin transaction from Nakamoto. Block 1 showcases the hash of the block containing Finney’s transaction and features abstract art that symbolizes the impact of ALS, a disease that had a debilitating effect on Finney’s health.\n\nThen, there were the Ordinal Punks, a set of 100 NFTs nodding to the original CryptoPunks, minted within the first 650 inscriptions on the Bitcoin chain. The 192×192-pixel generative PFP collection was created using an open-source algorithm by the pseudonymous Web3 creator, FlowStay.\n\nThe novelty and relative scarcity of Oridinal Punks have fueled their rise in value. According to a Google Sheet database of sales (again, there are no major marketplaces for Ordinals), the current lowest bid for an Ordinal Punk sits at 3.7 BTC, or 51.26 ETH (nearly $84,000), and the highest asking price is 50 BTC, or 692.66 ETH ($1,132,500).\n\nOn February 27, Yuga Labs announced that it would be launching an Ordinals collection of its own, a collection of 300 generative art NFTs.\n\nIntroducing TwelveFold. A limited edition collection of 300 generative pieces, inscribed on satoshis on the Bitcoin blockchain.https://t.co/aFWEIhzqcI pic.twitter.com/PjWABKKBr4 — Yuga Labs (@yugalabs) February 27, 2023\n\nIn line with Yuga Labs’s buy-in, a host of services have emerged over the past month to provide support for Ordinal transactions, not limited to Bitcoin wallets like Xverse and Hiro Wallet, and NFT marketplaces including Gamma and Oridalsbot.\n\nBut are Ordinals more than a fad?\n\nLike any niche collectible, including art, the market that develops around Ordinals is only as big as the bags of those willing to purchase it. But Bitcoin, with a current market cap of $449.21 billion, is by far the world’s largest cryptocurrency, far outstripping the $199.70 billion cap of Ethereum.\n\nAs it is, the momentum of Ordinals has yet to falter, being boosted by alphas in the space, burgeoning market interest, and, as with most things in the crypto sphere, no small amount of hype. Research firm Delphi Digital, for one, has dubbed the emergence of Ordinals “Bitcoin’s New Narrative,” calling them “the most interesting thing to happen to Bitcoin since El Salvador made it legal tender.”\n\nFor now, though, Ordinals remain closer to 4Chan than Hauser & Wirth. Whatever art that gets transcribed onto the Bitcoin network will likely not (yet) constitute some broader art historical turn or pivot, but rather something much simpler: A small, three or four MB file, tick-tock, next block.\n\nMore Trending Stories:\n\nResearchers in Vietnam Discovered That Two Deer Antlers Languishing in Museum Storage Are Actually 2,000-Year-Old Musical Instruments\n\nA Photographer Who Found Instagram Fame for His Striking Portraits Has Confessed His Images Were Actually A.I.-Generated\n\nArchaeologists on Easter Island Have Discovered a Previously Unknown Moai Statue Buried in a Dried-Out Lake Bed\n\nTwo Curators Tried to Find Out If Salvador Dalí Really Painted This Strange Seven-Foot Canvas. They Ended Up Solving an Even Bigger Mystery\n\nArt Industry News: A California Court Revives a Lawsuit Over a ‘Disrespectful’ Marilyn Monroe Statue + Other Stories\n\nThe Dutch Are Going Wild for a Reality TV Show Where Artists Compete to Paint Vermeer’s Lost Masterpieces\n\nWhat I Buy and Why: Filmmaker Ku-Ling Yurman on Her Mission to Collect Works by Women and Her Prized Jewelry Pieces\n\nSo-Called ‘Open Editions’ Are Suddenly Reigniting the Wintry NFT Market. Here’s Why They’ve Become So Popular With Collectors\n\nMarginalia Uncovered in Leonardo’s Famous Codex Arundel Suggests the Renaissance Polymath Theorized Gravity Before Galileo\n\nFollow Artnet News on Facebook:"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1saWdodG5pbmctbmV0d29yay1jcnlwdG8tY3VycmVuY3ktYjIyOTA5OTYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin adoption growing as Lightning Network hits all-time high - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThe amount of bitcoin stored on the Lightning Network payment protocol has hit an all-time high, suggesting that the cryptocurrency is increasingly being used as a form of currency.\n\nIn the 15 years since it was invented, bitcoin has filled many roles – from a source of speculation to a hedge against inflation – but has struggled to find a clear identity. Now there are growing signs it’s edging towards its intended purpose: payments.\n\n“The development in terms of building out crypto payments has continued apace, even if it’s gone somewhat unnoticed because of the volatility in the broader market,” said Richard Mico, US CEO of Banxa, a payment-and-compliance infrastructure provider.\n\nThe amount of bitcoin stored on the Lightning Network has jumped by two-thirds over the past year to hit an all-time high of 5,580 coin, according to crypto data firm The Block.\n\nCrypto payment specialists have also seen strong volumes. US-based BitPay said transaction volumes jumped 18 per cent last year versus 2021. CoinsPaid said volumes in the fourth quarter of 2022 rose 32 per cent compared with a year before.\n\nThe original vision of bitcoin’s pseudonymous inventor Satoshi Nakamoto, laid out in a 2008 white paper titled ‘Bitcoin: A Peer-to-Peer Electronic Cash System’, was for crypto to serve as an alternative form of payment resistant to inflation and central banks.\n\nPrice volatility, slow processing speeds and persistent regulatory uncertainty have been among the factors that have rendered cryptocurrencies unwieldy as a means of payment until now, with few merchants pricing goods or services in crypto.\n\nNonetheless, proponents say bitcoin offers lower transaction costs and quicker speeds than traditional cash, especially for cross-border transfers. The Lightning Network, which sits on top of bitcoin’s blockchain, has also revolutionised transaction speeds in recent years.\n\nAside from bitcoin, other cryptocurrencies including stablecoins, which are pegged to the value of traditional currencies, have emerged as popular options, particularly for cross-border payments, remittances, plus in emerging markets where the value of local currencies have been hit by inflation.\n\nStellar, a blockchain that enables cross-border payments, saw the number of trades on its platform increase to 103.4 million last month from 50.6 million in January 2022.\n\nVolumes for trades across exchanges between bitcoin and Turkey’s lira and Brazil’s real increased by 232 per cent and 72 per cent, respectively, CryptoCompare data showed.\n\nIt’s not all smooth sailing for the widespread adoption of crypto for payments; for one thing, there’s the question of whether blockchains are ready to handle the stress of processing thousands of transactions at a time, especially without a simultaneous jump in transaction fees.\n\nEfforts by some of the world’s largest economies, including Japan, China and India, to create their own digital currencies (CBDCs) could also choke crypto payments growth, say some market players. For others, though, growing interest in CBDCs is evidence that blockchain payments tech is here to stay.\n\nTraditional finance firms looking to embrace crypto payments have also shrugged off recent market volatility. Visa inked a deal this month with crypto firm WireX to directly issue crypto-enabled debit and prepaid cards.\n\n“Crypto is evolving into a viable alternative for more and more people around the world,” said Mr Mico at Banxa.\n\nDeveloping economies have shown particular interest in bitcoin in recent years, with El Salvador becoming the first country in the world to make the cryptocurrency a legal form of tender in 2021.\n\nAdditional reporting from agencies"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2luLWNvcmUtZGV2ZWxvcGVyLWx1a2UtZGFzaGpyLWNhbGxzLW91dC11bmF1dGhvcml6ZWQtb3JkaW5hbC1uZnQtd2l0aC1oaXMtbmFtZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Core Developer Luke Dashjr Calls Out Unauthorized Ordinal NFT With His Name - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmZhcnJlci5jby51ay9uZXdzLWFuZC1pbnNpZ2h0cy9vYmxpZ2F0aW9ucy1hcmd1YWJseS1vd2VkLWJ5LWJpdGNvaW4tZGV2ZWxvcGVycy10by1iaXRjb2luLW93bmVycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Obligations arguably owed by bitcoin developers to bitcoin owners - Farrer & Co",
        "content": "The English Court of Appeal has recently ruled that the developers who look after bitcoin networks may owe fiduciary duties and duties in tort to the owners of that cryptocurrency. The High Court had earlier decided that no such obligations could ever be owed. It is important to note that in overturning that decision, the Court of Appeal has not finally decided that such obligations are owed. Instead, it has remitted the case back to the High Court for it to be fully argued on the law and the facts. However, this case is important because it looks set to establish the nature of the relationship between the developers and the owners of bitcoin and because it could also have wider impacts in extending the law on fiduciary obligations.\n\nBackground\n\nIn Tulip Trading Limited -v- van der Laan and Others, the Claimant (Tulip) says that its access to a bitcoin wallet that contained (as at April 2021) US$4bn of bitcoin had been disabled as a result of a hacking incident by a third party. As such the bitcoin is at risk of being stolen by the hackers. Tulip claims that its access to that account could be easily restored by the Defendants, who are sixteen bitcoin software developers (the Developers) of the network on which the account sits, so that the bitcoin could be moved to a secure wallet. Fourteen of the Developers dispute that they owe any legal obligations to Tulip to assist it. They also raise factual disputes, pointing out that enabling Tulip’s access to the wallet will not be straightforward. Further they say that if they are required to re-establish that access it will potentially undermine the foundation on which bitcoin has been established (ie that such access is solely determined by who holds the private key to the wallet). The Court of Appeal said these factual disputes were not for determination at this stage and the High Court had fallen into error in taking some of them into account in reaching its decision. Instead, at this preliminary stage of determining whether there is a serious issue to be tried, the court should take the facts as alleged by Tulip to be true and decide whether, based on this, there can be any obligations owed to them by the Developers.\n\nDecision\n\nThe Court of Appeal said that it is arguable that the Developers owe Tulip fiduciary duties to act to protect Tulip’s interests if a court requires the Developers to do so. The Court of Appeal accepted that this would be a significant extension to the law in this area, but also noted that the law on fiduciary relationships could be developed to deal with new situations such as that created by the development of bitcoin.\n\nThe essence of the decision is that the Court of Appeal accepted that there is a realistic argument that the Developers control the bitcoin software and are able to make decisions about the bitcoin which has been placed under their care by the owners of it. These are classic features of a fiduciary relationship which arguably therefore impose fiduciary obligations on the Developers to owners of bitcoin like Tulip. The extent of those obligations includes an obligation on the Developers not to act in their own self-interests when making decisions and exercising the powers that they have, and may also extend to a positive obligation to act as Tulip are requesting by restoring its access to the wallet in which the bitcoin is held.\n\nImplications\n\nThe essence of this decision appears to be that if Tulip is right that bitcoin to the value of US$4bn is at risk because of the activity of hackers then why shouldn’t the law impose an obligation (whether fiduciary or tort based) on someone else to take steps to remove that risk, assuming that those required steps are not unduly onerous?\n\nThis illustrates that if High Court finds that the Developers do owe fiduciary duties to Tulip in the way that is being alleged, this could have far-reaching consequences in establishing obligations in a much wider range of situations, whether the parties intended this or not. For example, what if information is held in an email account of a deceased person which would be of great value to the beneficiaries of that person’s estate? Could a fiduciary or other obligation be placed on the controller of that account to allow access to it so that the information can be obtained?\n\nClearly, we will have to wait to see what the High Court decides when the case is fully argued, but the Court of Appeal has at least opened the door to the imposition of legal obligations on bitcoin developers to bitcoin owners.\n\nThe full judgment of the Court of Appeal can be found here.\n\nIf you require further information about anything covered in this briefing, please contact Jolyon Connell, Ian De Freitas or your usual contact at the firm on +44 (0)20 3375 7000.\n\nThis publication is a general summary of the law. It should not replace legal advice tailored to your specific circumstances.\n\n© Farrer & Co LLP, March 2023"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8va2VueWFud2FsbHN0cmVldC5jb20vYml0Y29pbi13aGF0LWl0LWlzLWFuZC1ob3ctaXQtd29ya3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin: What it is and How it Works - Kenyan Wallstreet",
        "content": "Bitcoin is the star of the cryptocurrency craze. It has generated a lot of buzz on the internet and many people want to invest in bitcoin because of its profitability. Despite its anonymous nature, bitcoin has a potential to change the way we bank, make transactions, and view money. The world is learning more about cryptocurrencies and bitcoin, and it is expected that bitcoin will be the first common currency to be employed in the entire world in the near future. Engaging with Casumo partners could offer insightful ways into the merging worlds of cryptocurrency and online gaming, showcasing the transformative power of bitcoin and other digital currencies.\n\nInvesting in bitcoin is quite easy, but most people are nervous to start. It makes sense to only want to invest in something you understand. Trading in bitcoin requires skill and expertise and bitcoin investors can either self trade or do it with the help of a professional broker. In this article we are going to look at what bitcoin is, how it works, how to start investing in bitcoin and the risks associated with investing in bitcoin.\n\n\n\nADVERTISEMENT\n\nWhat is Bitcoin?\n\nBitcoin, normally abbreviated as BTC, is a virtual currency controlled by a decentralised user base and is not controlled by the whims of Central Bank authority or National government. Bitcoin was introduced by one Sakoshi Nakamoto and is the most popular type of cryptocurrency for investment. Other cryptocurrencies available are often known as altcoins. When we say bitcoin is virtual, it means that it has no physical backing and can be sent electronically from one user to the next, anywhere in the world.\n\nBitcoin Mining\n\nThe value of bitcoin is known to fluctuate because of a finite number of coins available as a result of bitcoin mining. Bitcoin mining involves “digging up” of bitcoins and bringing them to light, a little at a time. There are bitcoin protocols that contain bitcoins which have not yet been brought out. Bitcoin protocol stipulates that a maximum of 21,000,000 million bitcoins will exist at one point, in the future.\n\nWhat bitcoin miners do is that they bring these bitcoin up a few at a time. Once the maximum number of bitcoins to be mined is reached, no more coins are mined. When the bitcoin protocol allows for a larger supply, bitcoin mining continues. Mining ensures fairness, stability and security of bitcoins. This is as a result of scarcity and the blockchain technology that bitcoin embraces. Bitcoin miners get paid in transaction fees for creating blocks of validated transactions and including them in blockchain.\n\nHow Does Bitcoin Work?\n\nWith a coin, you can buy products or services. However, bitcoin has no tangible attributes, but it operates almost in the same way as normal currency. Bitcoin has a decentralised structure, which means there is no interference from the government or the Central Bank and users are in complete control of their transactions.\n\nA bitcoin miner gets money after creating blocks and incorporating them into the blockchain through transaction fees. Once a bitcoin miner obtains bitcoins, he or she keeps them in a wallet before deciding to sell them to another investor at a price. You can buy either low quality or high quality bitcoins. Bitcoin can also be used as a payment method for the purchase of goods and services and is accepted by some merchants.\n\nHow to Start Investing in Bitcoin\n\nTo invest in bitcoin, you have to first buy them on bitcoin exchange. When you are buying bitcoins, it is good to buy high quality bitcoin, but you can opt for either according to how much you are willing to invest. When buying bitcoins, you have to consider the payment method,the bitcoin platform and where you want your bitcoins to go (wallet). You must also have a bank account, personal identification information and a good internet connection to trade.\n\nOne such exchange, eToro, allows investors to purchase and trade cryptocurrencies quickly and securely. Since it is a popular online trading platform that provides a secure and easy way to buy bitcoin with eToro and other cryptocurrencies such as Ethereum, Litecoin, etc., quickly and conveniently.\n\nHere are the simplified steps:\n\nJoin a bitcoin exchange. Bitcoin exchanges allow you to make purchases of bitcoins. Although there is no bitcoin company, there are many cryptocurrency exchanges that can help you get started in your bitcoin investment. Some of the most popular exchanges include Coinbase, Binance and Kraken.\n\nGet a bitcoin wallet. Once you have purchased your bitcoins, they have to be stored in a wallet. There are two types of bitcoin wallets: a hot wallet and a cold wallet. Your cryptocurrency exchange provider is responsible for operating your hot wallet, whereas you can operate your own cold wallet. Some of the best bitcoin wallets include Electrum and Mycelium.\n\nHave a bank account. A bank account is a necessary part of bitcoin investment because it allows you to connect your wallet. This makes the sale and purchase of bitcoins easier.\n\nPlace your bitcoin order. Here, you can either buy a whole bitcoin, which is quite costly, or a fraction of a single bitcoin.\n\nCheck on your bitcoin investment. Once you have bought your bitcoins, you have an option of holding them in your wallet until they appreciate in value, make online transactions or trade your coins with other bitcoin investors.\n\nRisks Associated With Bitcoin Investment\n\nBefore you decide to invest in bitcoin, it is necessary to be wary of these risks.\n\nSecurity risk. Bitcoin investment operates on a digital platform. If you do not have a wallet and you forget or misplace you key there is rarely a way to retrieve your coins. Hacking is also a serious risk, since there is no way to retrieve lost or stolen bitcoins.\n\nFraud risk. Hackers gain personal information and use that for transaction fraud, where they make purchases in your name and never refund the bitcoins. This is one of the biggest risks of bitcoin investments.\n\nMarket risk. The price of bitcoin is volatile. Because of this fluctuation, a bitcoin investor faces the risk of losing a lot of money once the bitcoin value goes down.\n\nInsurance risk. Bitcoin is not insured by the government, hence there will be no compensation in case of loss arising from risk.\n\nFinal Thoughts\n\nBitcoin is a viable investment for any average investor. Bitcoin has facilitated faster payment and transactions at significantly low fees in place of traditional banks and Many people believe that bitcoin has an ability to bring about a shift from a cash to a cashless society. However, before you start investing in bitcoins, it is important to understand the fundamentals of this financial market. For starters, make sure you do your research and learn as many important concepts as possible that will help you navigate this type of investment easily. Talk to experts and have someone to help you through this investment process.\n\nRelated:\n\nBrazil Approves Bill Regulating Use of Bitcoin as a Means of Payment\n\nTop Trading Trends of 2022: Oil, Bitcoin and More"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvYml0Y29pbi1kZWZpLWd1aWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "DeFi on Bitcoin Explained | How Does It Work? Beginner's Guide - Finbold - Finance in Bold",
        "content": "This guide will delve into DeFi on Bitcoin, explaining what DeFi is and how it has been applied to the Bitcoin network, as well as consider some challenges inherent within this nascent ecosystem. Additionally, we highlight notable projects within this space and consider their advantages over others created on rival blockchains.\n\nWhat is DeFi?\n\nDefinition Decentralized Finance, or DeFi for short, refers to financial tools and products designed to revolutionize and replace traditional forms of banking that dictate how one accesses services such as loans and savings. DeFi aims to make finance accessible to anyone and everyone without the help of intermediaries such as banks.\n\nDeFi is more dominant on the Ethereum (ETH) network, a leading smart contract platform and the second-largest blockchain by market capitalization. Ethereum has benefited from a first-mover advantage in this field, being the first public network to support decentralized apps (dApps) since 2015.\n\nHowever, it is increasingly facing stiff competition from newer blockchains, including Solana (SOL), Avalanche (AVAX), Cardano (ADA), and Polkadot (DOT). Often overlooked in this conversation is Bitcoin, the flagship blockchain network designed to enable peer-to-peer online transactions.\n\nRecently, however, developers on the Bitcoin network have found ways to expand its capabilities beyond payments, and it is now possible to launch DeFi applications native to the Bitcoin ecosystem.\n\nWhat is DeFi on Bitcoin?\n\nDeFi on Bitcoin is a feature that was introduced in November 2021 thanks to the successful implementation of the Taproot upgrade, which enabled greater functionality with regard to complex scripting. With Taproot, Bitcoin coud now support decentralized apps, making it a viable alternative to Ethereum for developers looking to launch dApps.\n\nBefore the launch of DeFi apps on the Bitcoin network, BTC holders were able to convert their holdings into wrapped versions on other blockchains. The most popular was the Wrapped BTC (wBTC) asset on the Ethereum network (ERC-20 token).\n\nwBTC enabled BTC holders to participate in Ethereum-based DeFi protocols by locking their assets in a smart contract and receiving an equal amount (i.e., 1:1 ratio) in the derivative asset, which could then be used to save, lend, and earn passive income through yield farming on these platforms.\n\nHowever, since the launch of the DeFi on Bitcoin, conversions to other assets become unnecessary, and BTC coins can be used natively on these Bitcoin-based DeFi platforms.\n\nHow DeFi on Bitcoin works\n\nThe most popular way DeFi works with Bitcoin is to use a wrapped version of BTC on a non-Bitcoin blockchain. With wBTC, an investor will send BTC coins to a custodian who stores these tokens and issues wBTC in return at the same ratio.\n\nFor instance, if you send 1 BTC, you receive 1 wBTC in return. The wrapped tokens can be used on Ethereum-based DeFi protocols such as Curve (CRV), Balancer (BAL), or AAVE (AAVE).\n\nTo redeem your BTC, you send back your wBTC tokens, and the custodian (smart contract) will refund your coins to you.\n\nWith the Bitcoin Taproot upgrade launch, DeFi is now possible on Bitcoin but with a caveat. The native Bitcoin blockchain, which still uses the limited Script programming language, does not support smart contracts. Taproot helped introduce the advanced capabilities which can only be realized on layer-2 scaling solutions and sidechains.\n\nThe side chains and layer-2 protocols host dApps in various markets, including DeFi, non-fungible tokens, and gamefi ecosystems, among others.\n\nWhy do we need DeFi on Bitcoin?\n\nSo far, the flagship cryptocurrency is used mainly as a store of value and, to some extent, as a payment method. By accommodating DeFi, Bitcoin increases its utility while becoming attractive to a wider audience of users.\n\nDecentralized finance, on the other hand, needs the security and assurance that Bitcoin enjoys and that most DeFi investors and users value. Every so often, a DeFi protocol loses user funds to hackers leading to a loss of trust.\n\nDeFi on Bitcoin solves these issues and increases the trustworthiness of various solutions, thereby making them more attractive to potential developers and investors.\n\nChallenges facing DeFi on Bitcoin\n\nDeFi on Bitcoin faces three main challenges, which are:\n\nScalability; Compatibility; Security.\n\nThese challenges might not be unique to Bitcoin, but here is how they affect it.\n\nScalability\n\nBlockchain scalability measures how many transactions a decentralized network can process in a specified period, typically one second. The higher the transaction count, the higher the throughput, and vice versa.\n\nBitcoin is one of the slowest blockchains currently in the market, as it’s able to process about seven transactions every second (7 TPS). In comparison, Ethereum can handle about 12-15 TPS, while Cardano and Polkadot can manage as many as 1,000 TPS.\n\nNote The TPS figures referred to above are used to show a network’s capacity. It does not necessarily mean that these networks have achieved these figures in actual daily usage (if ever). The figures are often based on test results to show the capability of a given protocol.\n\nScalability is a major consideration for developers looking for a host network for their DeFi platform, and Bitcoin’s figures do not stack up well against the competition.\n\nComposability\n\nComposability is a system design principle that defines the inter-relations between various modular components. A highly composable system means that its various components can be assembled in multiple combinations to form several different creations.\n\nIn its current implementation, Bitcoin is not very composable due to its use of a limited scripting language. This contrasts with its rivals, such as Ethereum, which are designed from the ground up to be composable.\n\nAs a result, DeFi developers have the propensity to lean toward Bitcoin’s rivals as their protocols of choice to launch their apps. It is much easier to develop on these protocols because they have access to a wide range of assets that are easily compatible, free to use, and comply with various internal coding standards.\n\nSecurity\n\nBitcoin is, arguably, the most secure blockchain in the market currently, and it has stood the test of time. However, it is worth considering how secure the sidechains and layer-2 chains are, given that they are so few with little history if any.\n\nEven though these second-layer blockchains rely on Bitcoin’s proven security infrastructure, they still pose a security risk similar to that other dApps, and dApp platforms face on Bitcoin’s rival networks. Smart contract vulnerability is a major risk that every investor and developer has to consider before interacting with one.\n\nMost of the DeFi platforms and apps on the Bitcoin network are relatively recent, meaning that they are yet to be thoroughly tested, iterated, and improved upon to ensure the security of assets under management.\n\n3 Innovative Bitcoin DeFi Solutions\n\nHere are three notable companies building DeFi on Bitcoin solutions for the masses:\n\nMintlayer; Stacks; Rootstock.\n\nLet’s consider each project in further detail.\n\n1. Mintlayer: Making DeFi with Bitcoin a Reality\n\nMintlayer is a Bitcoin layer-2 scalability solution with support for smart contracts, including DeFi, NFT, decentralized exchanges (DEXs), and more. Think of it as an Ethereum rival with Bitcoin’s security.\n\nMintlayer homepage\n\nCreated in 2019, Mintlayer is designed to offer a sustainable infrastructure to support DeFi development and deployment on both the Bitcoin and Lightning Networks. The latter is a layer-2 payment protocol looking to support micro-payments on the flagship blockchain.\n\nSimilar to Ethereum, Mintlayer is a platform on which developers can launch their dApps, thereby unlocking and extending Bitcoin’s full potential. This way, it solves all three challenges facing DeFi on Bitcoin.\n\nMintlayer seeks to empower blockchain developers through four key programs, which are:\n\nEcosystem fund – enabling project creators to access funding from VCs to create solutions within the Bitcoin ecosystem;\n\n– enabling project creators to access funding from VCs to create solutions within the Bitcoin ecosystem; Incubator program – designed to nurture early-stage teams and projects to increase their chances of achieving success;\n\n– designed to nurture early-stage teams and projects to increase their chances of achieving success; Accelerator program – targeting already established projects seeking to reach higher levels in terms of adoption by porting over from other platforms such as Ethereum to Mintlayer;\n\n– targeting already established projects seeking to reach higher levels in terms of adoption by porting over from other platforms such as Ethereum to Mintlayer; Grants – designed to offer compensation to open-source developers to create or incentivize the creation of Mintlayer solutions.\n\nMintlayer is not only looking to extend Bitcoin’s functionality, it is also paving the way for other developers to create and launch innovative solutions to enhance its utility further.\n\n2. Stacks.co\n\nStacks.co is an independent, smart contract blockchain linked to Bitcoin through a novel consensus mechanism dubbed Proof of Transfer (PoX). The PoX mechanism enables it to settle its transactions to the more secure Bitcoin blockchain. It is, therefore, not a layer-2 blockchain.\n\nStacks blockchain website\n\nAs a smart contract platform, Stacks offers the following features:\n\nBitcoin NFTs and their marketplaces with support for micropayments through the Lightning network;\n\nBlockchain naming system similar to Ethereum’s ENS;\n\nCommunity support through the accelerator and grant programs;\n\nA native token, STX, can be staked for passive income and fee payment.\n\nStacks is extending Bitcoin’s capabilities, but so far, to a lesser and limited extent compared to Mintlayer.\n\n3. RSK – Rootstock\n\nRootstock (RSK) is another independent Bitcoin sidechain with smart contract capability similar to Mintlayer and Stacks. It was created in 2017 to enhance Bitcoin’s feature set by enabling dApp support.\n\nRootstock homepage\n\nA unique feature of RSK is that it uses the same Proof of Work (PoW) consensus mechanism as Bitcoin with the same algorithm enabling community members to engage in merged mining.\n\nIn this kind of mining, one computer can be used to validate transactions in two different blockchains concurrently. As a result, RSK is theoretically as secure as Bitcoin since it shares the same hash rate.\n\nFeatures offered by the RSK blockchain include:\n\nCompatibility with Ethereum dApps;\n\nProvides a native token dubbed RBTC for fee payment, staking, and value transfer;\n\nFaster block generation times of sub-thirty seconds compared to Bitcoin’s ten minutes.\n\nSupport for DeFi dApps enabling users to borrow, lend, trade, and do more with their assets.\n\nFinal thoughts\n\nThere is a growing demand for DeFi on Bitcoin as more people appreciate the need for secure cryptocurrency investments over potential high yields. Bitcoin is not only the most secure open network but also one of the most well-known and trusted. As a result, it is becoming more attractive to DeFi developers and investors looking.\n\nInnovative projects such as Mintlayer, Stacks, and Rootstock provide further incentives for the right people to join and help create the next DeFi ecosystem. Not only that, but they are also helping extend the Bitcoin capability beyond its initial payments and store of value utility.\n\nHowever, as the Bitcoin DeFi space grows, whether it will be popular enough to displace Ethereum as the go-to dApp deployment platform remains to be seen.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing in crypto, your capital is at risk.\n\nFrequently Asked Questions about DeFi on Bitcoin\n\nWhat is DeFi on Bitcoin? DeFi is an umbrella term that refers to various financial tools and products available on decentralized networks (in this case, Bitcoin), enabling people to stake, borrow, lend, and earn passive income.\n\nWhat are some of the challenges facing Bitcoin DeFi? The three main challenges that DeFi on Bitcoin faces are scalability, composability, and security.\n\nWhy do we need DeFi on Bitcoin? Bitcoin and DeFi need each other. Bitcoin needs DeFi to attract more users and therefore gain further adoption. On the other hand, DeFi needs a more secure alternative to the current crop of smart contract platforms, thereby eliciting trust and attracting more investors."
    }
]