[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vYWJjbmV3cy5nby5jb20vQnVzaW5lc3MvYml0Y29pbi1jbGltYmVkLTY1LXllYXItZGVzcGl0ZS1jcnlwdG8td29lcy1leHBlcnRzL3N0b3J5P2lkPTk5MjUyOTIy0gFpaHR0cHM6Ly9hYmNuZXdzLmdvLmNvbS9hbXAvQnVzaW5lc3MvYml0Y29pbi1jbGltYmVkLTY1LXllYXItZGVzcGl0ZS1jcnlwdG8td29lcy1leHBlcnRzL3N0b3J5P2lkPTk5MjUyOTIy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin has climbed 65% this year despite crypto woes. Experts explain why. - ABC News",
        "content": "The digital currency benefited from a shift to well-known coins, experts said.\n\nBitcoin has climbed 65% this year despite crypto woes. Experts explain why.\n\nThe cryptocurrency industry, in recent months, has suffered some blows: high-profile bankruptcies, the arrest of wunderkind Sam Bankman-Fried and a regulator lawsuit against top crypto exchange Binance.\n\nDespite it all, the price of the largest cryptocurrency, bitcoin, has surged.\n\nBitcoin has climbed 65% this year, far surpassing the S &P 500, which has jumped 7%. Even the Nasdaq, a tech-heavy index, has delivered just a quarter of bitcoin's gains.\n\nIn fact, bitcoin has benefited from crises in the cryptocurrency arena, analysts said, since the unrest has pushed investors away from lesser-known coins and toward the sector's household name.\n\nPlus, the price has gained a boost from wider economic forces like trouble in the financial system and slowing interest rate hikes, they said.\n\nBut the coming months pose uncertainty, experts added, as a looming recession could test the performance of an asset less than 15 years old.\n\nThe blockbuster performance of bitcoin in 2023 comes after the digital currency's price plummeted last year. In all, the price of bitcoin fell 65% last year, exceeding the losses suffered by the S &P 500, which dropped about 20%.\n\nThe price struggles for bitcoin, which extended throughout much of the cryptocurrency sector, coincided with an aggressive series of interest rate hikes that put downward pressure on many assets, including the major stock indexes.\n\n\"There had been a big bubble,\" James Butterfill, head of research at digital asset management firm CoinShares, told ABC News. \"The bubble was pricked by the Fed.\"\n\nThe distress in cryptocurrency helped trigger a slew of failures. Last May, a major coin, Terra, collapsed along with its sister coin Luna. Meanwhile, several crypto lenders such as Block Fi, Celsius and Genesis filed for bankruptcy last year.\n\nIn dramatic fashion, crypto exchange FTX filed for bankruptcy in November after a collapse in a matter of days that was followed by the arrest of Bankman-Fried, the company's founder and former CEO. Bankman-Fried has pleaded not guilty to all 13 counts he faces, including fraud and conspiracy.\n\nThe unrest last year sent crypto investors toward well-known digital currencies, Callie Cox, an analyst at the investment company eToro who tracks cryptocurrencies, told ABC News.\n\n\"Bitcoin has been the beneficiary of a flight to quality within the crypto industry,\" Cox said. \"This is the crypto name that my mom and your family probably know.\"\n\nButterfill, of CoinShares, echoed the point: \"People are becoming a lot more discerning. There are 50,000 crypto coins out there and a lot of them are rubbish.\"\n\nFTX founder Sam Bankman-Fried leaves Manhattan federal court in New York, Feb. 16, 2023. John Minchillo/AP, FILE\n\nEthereum, the world's second-largest cryptocurrency, has surged 52% this year, benefiting as well from the rush toward prominent coins, Butterfill said.\n\nThe rise in the price of bitcoin has coincided with favorable developments across the wider economy, since the Federal Reserve has slowed its interest rate hikes and unrest in the traditional banking sector has pushed some investors to seek a digital alternative, experts said.\n\nSince March, three of the nation's 30-largest banks have collapsed. Shares of regional lender PacWest Bancorp plummeted on Thursday after the bank said it lost 9% of deposits last week, suggesting that financial instability persists.\n\n\"When the banking system faced threats, a lot of investors saw reason to doubt the financial system,\" said Cox, of eToro. \"They went looking for alternatives.\"\n\nThere is little data available that depositors pulled money out of banks and placed it in bitcoin, Butterfill noted, adding that he had heard anecdotes of bank customers transferring funds to crypto.\n\nIf the Fed halts its rate hikes, as many investors expect, bitcoin could continue its rise over the latter part of the year, experts said. However, they cautioned that a potential recession could bring volatility.\n\n\"There might be nervousness about bitcoin as we move closer to a recession,\" Cox said, pointing out that interest rates would remain elevated even after a pause. \"There are a lot of crosswinds for crypto right now.\"\n\nButterfill acknowledged uncertainty about the outlook of day-to-day performance for bitcoin, but remained optimistic about the remainder of 2023, even if it involves a recession.\n\n\"Economic data continues to deteriorate,\" Butterfill said. \"In that environment, bitcoin would be volatile and perform quite well.\""
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvYW1vbmctYml0Y29pbi1kZXZlbG9wZXJzLWRlYmF0ZS1pcy1yYWdpbmctb3Zlci13aGV0aGVyLXRvLWNlbnNvci1vcmRpbmFscy1icmMtMjBzL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvYW1vbmctYml0Y29pbi1kZXZlbG9wZXJzLWRlYmF0ZS1pcy1yYWdpbmctb3Zlci13aGV0aGVyLXRvLWNlbnNvci1vcmRpbmFscy1icmMtMjBzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Among Bitcoin Developers, Debate Is Raging Over Whether to Censor Ordinals BRC-20s - CoinDesk",
        "content": "The soaring fees have forced some bitcoin users in Africa to seek alternative payment options including stablecoins, while crypto exchange Binance said it’s in the process of integrating the “layer 2” scaling solution for Bitcoin known as Lightning Network. It’s been a windfall for Bitcoin miners but has presented an existential conflict for purists of a blockchain designed to be a peer-to-peer payments network but also free from censorship."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3ByaXNvbi10aW1lLWJ1eWluZy1jYXItd2l0aC1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Man Buys Ferrari With Bitcoin, Gets 18-month Prison Sentence - Blockworks",
        "content": "A 21-year-old French citizen who bought a Ferrari with bitcoin had his 18-month sentence and $3.7 million fine upheld by a Moroccan court.\n\nThe original sentence handed down by the Casablanca Court of Appeals in October 2022 against Thomas Clausi was upheld earlier this month, his lawyer, Mohamed Aghanaj, confirmed. Clausi was arrested for buying the luxury sports car in 2021.\n\nMorocco banned holding and trading cryptocurrencies in 2017.\n\nThe enforcement actions against Clausi began when a French woman living in Casablanca sold the Ferrari in question to Clausi for a bitcoin payment worth 400,000 euros ($436,600) at the time. She filed a complaint accusing him of “fraud.”\n\nA Moroccan citizen submitted a separate complaint against the Frenchman, alleging Clausi signed a fraudulent check with the name of another individual — which he obtained in exchange for bitcoin — in order to buy three of the Moroccan citizen’s watches.\n\nThe court ordered Clausi to repay the watch owner with 3,900 euros.\n\nWhile the full sentence was 18 months, Aghanaj said that Clausi will spend a little bit more than a month in jail to complete his sentence. With this decision against Clausi, the country appears to be sending a message to all those who have a desire to use digital assets.\n\nDespite Morocco’s hard stance on crypto, its citizens seem keen on digital assets. Morocco ranks 14th in the world on crypto adoption based on five different factors, according to a 2022 Global Crypto Adoption Index by Chainalysis.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNhbmFyeW1lZGlhLmNvbS9wb2RjYXN0cy9jYXRhbHlzdC13aXRoLXNoYXlsZS1rYW5uL3RoZS1ncmVhdC1iaXRjb2luLWVuZXJneS1kZWJhdGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "The great Bitcoin energy debate - Canary Media",
        "content": "On the Catalyst with Shayle Kann podcast this week:\n\nDepending on who you talk to, Bitcoin mines are either great for the grid or the worst thing that’s ever happened to it. These warehouses of computers essentially turn electricity into bitcoins. Proponents argue that mines can do a number of things for the grid, including:\n\n\n\nSupport grid reliability by reducing demand during peak hours.\n\nIncentivize new renewable generation by raising the prices that solar and wind farms receive.\n\nReduce methane emissions by capturing flare gas from fossil fuel wells and then using that gas to generate electricity for mine operations.\n\nMeanwhile, opponents argue that the mines raise emissions and electricity prices. So how do we make sense of the great Bitcoin energy debate?\n\nIn this episode, Shayle talks to Ben Hertz-Shargel, global head of grid edge at Wood Mackenzie. The New York Times recently reported on the role of Bitcoin mining on the grid, and Ben was part of a team that contributed to the report.\n\nShayle and Ben discuss:\n\n\n\nHow Bitcoin mines affect electricity prices for nearby consumers.\n\nWhether mines use only excess renewable generation or incentivize fossil-fuel generators to ramp up.\n\nWhat mines’ load profiles say about their flexibility and price sensitivity, especially during peak demand.\n\nThe evidence on whether mines are signing long-term power-purchase agreements, repowering mothballed projects or otherwise helping to incentivize new renewables construction.\n\nAlternative cryptocurrencies that don’t require so much electricity.\n\nRecommended resources:\n\n\n\nNYT: The Real-World Costs of the Digital Race for Bitcoin\n\nEarth Justice and The Sierra Club: The Energy Bomb: How Proof-of-Work Cryptocurrency Mining Worsens the Climate Crisis and Harms Communities Now\n\nCoinspeaker: Texas Senate Passes Bill to Limit Incentives for Crypto Miners Participating in Demand Response Programs\n\nCatalyst is a co-production of Post Script Media and Canary Media."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWzSAYMBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin briefly falls below $26,000, posts worst week since November - CNBC",
        "content": "In this article BTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nBitcoin. Nurphoto | Getty Images\n\nBitcoin traded at its lowest level since mid-March on Friday as volatility, driven by low liquidity, continued to hit cryptocurrency markets. Bitcoin ended the day lower by 2.58% at 26,181.46 after briefly hitting a low of 25,833.34 the lowest level since March 17, according to Coin Metrics. The biggest crypto asset by market cap posted a weekly loss of 11.25%, making it its worst week since Nov. 11. There are a number of issues facing crypto markets right now including low liquidity, a crackdown on the industry from regulators in the U.S. and macroeconomic worries.\n\nLiquidity issues\n\nBitcoin is up around 59% this year but prices have remained volatile, with low liquidity exacerbating moves higher and lower. Clara Medalie, director of research at Kaiko, said there has been a \"notable drop in market depth\" for bitcoin. Market depth refers to a market's ability to absorb relatively large buy and sell orders. When market depth is low, then relatively small orders can cause the price of an asset to move up or down in a substantial way. And the liquidity situation could be set to get worse after Bloomberg reported that Jane Street and Jump Crypto, two of the biggest crypto market makers, will take a step back from crypto trading in the U.S. as the country's regulators continue their crackdown on the nascent industry.\n\n\"While it is yet unclear the catalyst for today's sharp drop, the volatility is to be expected given the current state of liquidity, especially after larger market maker Jane Street and Jump Crypto revealed they were winding down their crypto exposure,\" Medalie said. Liquidity has been a big issue for crypto markets since the closure of Silvergate and Signature Bank — two key platforms that people used to buy into the crypto market.\n\nRegulatory scrutiny, congestion issues\n\nScrutiny from U.S. regulators on the digital currency industry has ramped up since the collapse of crypto exchange FTX last year. The U.S. Securities and Exchange Commission warned American crypto exchange Coinbase in March over potential securities law violations. Coinbase CEO Brian Armstrong said the company is preparing for a years-long court battle with the SEC. Meanwhile, the Commodity Futures and Trading Commission alleged in March that crypto exchange Binance violated trading rules.\n\nwatch now"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NyeXB0b3NsYXRlLXdtYXJrZXQtdXBkYXRlLWZhbHNlLXVzLWdvdmVybm1lbnQtYml0Y29pbi1zZWxsaW5nLXJ1bW9ycy10cmlnZ2VyLW1pbGQtc2VsbC1vZmYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "CryptoSlate wMarket Update: False US government Bitcoin selling rumors trigger mild sell-off - CryptoSlate",
        "content": "In the last 24 hours, the cryptocurrency market cap saw net outflows of around $10 billion and currently stands at $1.13 trillion — down 0.36% from $1.14 trillion.\n\nDuring the period, Bitcoin (BTC) and Ethereum’s (ETH) market cap fell 0.50% and 1.06% to $531.38 billion and $219.29 billion, respectively.\n\nAll top 10 crypto assets recorded losses in the last 24 hours — except Polkadot, BNB, and Cardano, which saw minimal gains.\n\nThe market cap of Tether (USDT) grew to $82.66 billion. In contrast, USD Coin (USDC) and Binance USD (BUSD) fell to $30.12 billion and $5.76 billion, respectively.\n\nBitcoin\n\nIn the last 24 hours, Bitcoin fell 0.51% to trade at $27,472 as of 07:00 ET. Its market dominance remained fell to 46.9% from 47%.\n\nDuring the reporting period, BTC’s price sharply descended to $26,883 after breaching the $28,000 level. The flagship asset sell-off was triggered by false rumors that the U.S. government was moving its holdings.\n\nEthereum\n\nOver the last 24 hours, Ethereum saw a declined 1.13% to trade at $1,823 as of 07:00 ET. Its market dominance fell to 19.3% from 19.5%.\n\nETH mirrored BTC’s price performance, bottoming at $1,795 before rebounding to its current levels.\n\nTop 5 Gainers\n\nANT is the day’s biggest gainer, growing 17.3% over the last 24 hours to $3.24027 as of press time. The token is up 12% in the previous seven days. Its market cap stood at $129.71 million.\n\nHEX rose 15.06% to $0.06680 as of press time. HEX founder Richard Heart says PulseChain is launching within seven days. Its market cap stood at $11.58 billion.\n\nLQTY gained 7.2% to trade at $1.27271 at the time of writing. The Ethereum-based token has shed 26% over the past week. Its market cap stood at $214.96 million.\n\nEDU jumped 6.8% to $1.12873 over the last 24 hours. The decentralized educational protocol onboarded Dalton Learning Lab earlier today. Its market cap stood at $163.8 million.\n\nELF grew 6.86% over the last 24 hours to $0.29884 as of press time. Its market cap stood at $117.05 million.\n\nTop 5 Losers\n\nPEPE is the day’s biggest loser, falling 14.64% to trade at $0.0000016307 at the time of writing. The high-flying meme coin’s market cap is down more than $1 billion in the last seven days. Its market cap stood at $640.64 million.\n\nTOMI dropped 8.23% to trade at $4.05133. Despite today’s drawdown, the token has increased more than 73% over the past month. Its market cap stood at $160.6 million.\n\nBSV plunged 7.78% to trade at $35.7792 as of press time. The controversial token rose by 33% on May 9. Its market cap stood at $689.32 million.\n\nXRD lost 6.41% to $0.07189 over the reporting period. The smart contract network is up 30% in the last 30 days. Its market cap stood at $730.97 million.\n\nBCH fell 5.13% to $114.177 over the reporting period. Its market cap stood at $2.21 billion.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTEvbG9uZy10ZXJtLWJpdGNvaW4taG9sZGVycy1ib29zdC10aGVpci1jb2luLXN0YXNoLWFzLXByaWNlcy1kZWNvdXBsZS1mcm9tLW5hc2RhcS_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8xMS9sb25nLXRlcm0tYml0Y29pbi1ob2xkZXJzLWJvb3N0LXRoZWlyLWNvaW4tc3Rhc2gtYXMtcHJpY2VzLWRlY291cGxlLWZyb20tbmFzZGFxL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Long-Term Bitcoin Holders Boost Their Stash as BTC Prices Decouple From Nasdaq - CoinDesk",
        "content": "Bitcoin crossed above $31,000 on April 14, hitting the highest since June 2022, per CoinDesk data. Since then, the cryptocurrency's price has dropped by 12% to $27,500, while Nasdaq has risen by over 2% since mid-April. The Nasdaq-to-S&P 500 ratio, which bitcoin has closely followed in the past, has also increased by over 2% during that time period."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTEvYml0Y29pbi1mYWxscy1iZWxvdy0yNzAwMC1hcy1jcnlwdG8tbWFya2V0LW1ha2Vycy1zdGVwLWJhY2stZnJvbS11cy10cmFkaW5nLmh0bWzSAXRodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8xMS9iaXRjb2luLWZhbGxzLWJlbG93LTI3MDAwLWFzLWNyeXB0by1tYXJrZXQtbWFrZXJzLXN0ZXAtYmFjay1mcm9tLXVzLXRyYWRpbmcuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin falls below $27,000 as U.S. regulatory crackdown pressures crypto's biggest market makers - CNBC",
        "content": "Crypto prices slid on Thursday as investors weighed a news report about two of the biggest institutional liquidity providers dialing back their crypto-trading businesses in the U.S.\n\nBitcoin fell nearly 3% to $26,937.29, according to Coin Metrics, while ether lost 3.1% to trade at $1,793.82. They're on pace to end the week down more than 8% and 9%, respectively.\n\nEarlier this week, Bloomberg reported that Jane Street and Jump Crypto, two of the biggest crypto market makers, will take a step back from crypto trading in the U.S. as the country's regulators continue their crackdown on the nascent industry. CNBC's \"Crypto World\" reached out to the firms. Jane Street declined to comment, and Jump did not respond.\n\n\"In general, we're going to see much larger swings in price both ways since so many large market makers have significantly reduced providing,\" said David Wells, CEO of Enclave Markets.\n\n\"Larger market makers create more stability in prices due to the liquidity they provide,\" he added. \"You'll see more frequent gaps up and down since order books are thinner in general.\""
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTEvYml0Y29pbi1lZGdlcy1iZWxvdy0yN2stYXMtbGF0ZXN0LWJhbmstY3Jpc2lzLWZhaWxzLXRvLXRyaWdnZXItcHJpY2UtaW5jcmVhc2Uv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8xMS9iaXRjb2luLWVkZ2VzLWJlbG93LTI3ay1hcy1sYXRlc3QtYmFuay1jcmlzaXMtZmFpbHMtdG8tdHJpZ2dlci1wcmljZS1pbmNyZWFzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin Edges Below $27K as Latest Bank Crisis Fails to Trigger Price Increase - CoinDesk",
        "content": "The largest cryptocurrency by market capitalization was recently trading at around $26,950, down over 3% in the past 24 hours. BTC had been hovering above $27,000 Thursday morning before dropping below the threshold around 1 p.m. ET. BTC has been trending downward for much of the past week as investors look for a new price catalyst. Bitcoin fell below $27,000 on Wednesday for the first time since March, regained the threshold before falling again."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTEvZmlyc3QtbW92ZXItYXNpYS1leHBlY3QtYml0Y29pbi10by1oaXQtMjUyay1zb29uLXN0cmF0ZWdpc3Qv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8xMS9maXJzdC1tb3Zlci1hc2lhLWV4cGVjdC1iaXRjb2luLXRvLWhpdC0yNTJrLXNvb24tc3RyYXRlZ2lzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "First Mover Asia: Expect Bitcoin to Hit $25.2K Soon: Strategist - CoinDesk",
        "content": "“It’s just building the right narrative. The next narrative needs to be a major innovation, like the Shanghai Shapella upgrade, or some sort of new L-2 (layer 2), or some major improvement to the bitcoin blockchain. And when we see those, we'll see more liquidity and action coming (into markets).”"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXJlZ2FpbnMtMjdrLWJ1dC1pbnZlc3RvcnMtc2VhcmNoLWZvci1hLWNhdGFseXN0L9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXJlZ2FpbnMtMjdrLWJ1dC1pbnZlc3RvcnMtc2VhcmNoLWZvci1hLWNhdGFseXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Regains $27K, but Investors Search for a Catalyst - CoinDesk",
        "content": "But he was sanguine about bitcoin's future. \"A lot of these things are sort of the natural growing pains,\" he said, adding: \"How could you not be bullish? It's such a it's a no brainer to go to this technology in the long term, but the route there is not going to be straight.\""
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzExL2JpdGNvaW5zLWhpZ2gtZmVlcy1icm91Z2h0LWJhY2stYnVsbC1tYXJrZXQtbGV2ZWwtbWluaW5nLXJldmVudWUtYnV0LW5vdC1mb3ItbG9uZy_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDUvMTEvYml0Y29pbnMtaGlnaC1mZWVzLWJyb3VnaHQtYmFjay1idWxsLW1hcmtldC1sZXZlbC1taW5pbmctcmV2ZW51ZS1idXQtbm90LWZvci1sb25nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin’s High Fees Brought Back Bull Market-Level Mining Revenue, But Not for Long - CoinDesk",
        "content": "FFPS pools, the method Foundry USA also uses for payouts, share the transaction fees with the miners according to how much hash rate they contribute, based on an estimated average transaction fee for a given time period. This means the pool should have to keep more bitcoin in reserve in case it gets unlucky and doesn't win enough blocks with enough revenue to meet user payouts, explained Colin Harper, head of content and research at Luxor."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzExL2JpdGNvaW4tbWluaW5nLWVhcm5pbmdzLXdyYXAtbWFyYXRob24tc2hhcmVzLXVuZGVycGVyZm9ybS1hZnRlci1uZXctc2VjLXN1YnBvZW5hL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNS8xMS9iaXRjb2luLW1pbmluZy1lYXJuaW5ncy13cmFwLW1hcmF0aG9uLXNoYXJlcy11bmRlcnBlcmZvcm0tYWZ0ZXItbmV3LXNlYy1zdWJwb2VuYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin Mining Earnings Wrap: Marathon Shares Underperform After New SEC Subpoena - CoinDesk",
        "content": "CleanSpark (CLSK) reported a net loss of $0.23 per share from continuing operations, better than the average analyst estimate loss of $0.32 according to FactSet data. The per share loss is roughly half of what it reported in the previous quarter, but worse than the $0.05 profit per share in the same period the year before. CleanSpark uses a fiscal year, so the three months ended March 31 were its second quarter for 2023."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xMi9hcy1iaXRjb2luLXNjYWxlcy13ZS1uZWVkLWJldHRlci1jdXN0b2RpYWwtc29sdXRpb25zL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xMi9hcy1iaXRjb2luLXNjYWxlcy13ZS1uZWVkLWJldHRlci1jdXN0b2RpYWwtc29sdXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "As Bitcoin Scales, We Need Better Custodial Solutions - CoinDesk",
        "content": "All you need is a little trust. Of course, this is exactly what bitcoin was created to avoid – as a purely peer-to-peer version of electronic cash that can be sent directly from one party to another without going through a financial institution. But it's true, custodial solutions might actually be the easiest way to use the Lightning Network."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYml0Y29pbi1sb3Nlcy0xMC1vbi10aGUtd2Vlay1hcy1tZW1lY29pbnMtdHVtYmxlL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYml0Y29pbi1sb3Nlcy0xMC1vbi10aGUtd2Vlay1hcy1tZW1lY29pbnMtdHVtYmxlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Loses 10% on the Week as Memecoins Tumble - CoinDesk",
        "content": "\"The hype of meme coins is usually exciting, but often followed by a market crash, similar to what we saw with DOGE and SHIB two years ago,” said Youwei Yang, chief economist at publicly traded bitcoin mining company, BTCM. “The market correction for memecoins this week is largely due to the calm down of the FOMO (fear of missing out) sentiment with these new memecoins.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8xMi9iaXRjb2luLW1pbmVyLXJpb3Qtc3Vlcy1wZWVyLXJob2RpdW0tZW50ZXJwcmlzZXMtZm9yLWFsbGVnZWQtMjZtLWluLXVucGFpZC1mZWVzL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8xMi9iaXRjb2luLW1pbmVyLXJpb3Qtc3Vlcy1wZWVyLXJob2RpdW0tZW50ZXJwcmlzZXMtZm9yLWFsbGVnZWQtMjZtLWluLXVucGFpZC1mZWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Riot Sues Peer Rhodium Enterprises for Alleged $26M in Unpaid Fees - CoinDesk",
        "content": "Separately, Riot claims that Rhodium's units were amassing power credits on their books for two years that it didn't have rights to. Riot also wants the court to declare that Riot doesn't owe Rhodium any power credits. Riot claims that those power credits could have had a legal basis from previous contracts, but those were superseded by the December 2020 agreements."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvZnJvZ3MtZmV2ZXJzLWFuZC1mZWVzLWJpdGNvaW5zLW5ldy1nb3Zlcm5hbmNlLWNoYWxsZW5nZS_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzEyL2Zyb2dzLWZldmVycy1hbmQtZmVlcy1iaXRjb2lucy1uZXctZ292ZXJuYW5jZS1jaGFsbGVuZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Frogs, Fevers and Fees: Bitcoin’s New Governance Challenge - CoinDesk",
        "content": "Still, the core problem here is not that Bitcoin is being used to represent frog images per se, but that its value as an efficient, intermediary-free settlement system for transferring value of all kinds is undermined by blockspace congestion. (As CoinDesk columnist David Z. Morris wrote this week, Bitcoin would be experiencing the same problems if, as its advocates hope, millions more people were using Bitcoin for monetary purposes.) That’s where the governance conversation needs to be focused."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vZmVhdHVyZXMvMjAyMy1jcnlwdG8td2ludGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Winter 2022 Cost Bitcoin ($BTC) Holders More Than Cash - Bloomberg",
        "content": "Tales From the Crypto Winter Some acolytes lost faith, others blamed devils—and some went even harder. An essay exploring what happens when the prophecy of blockchain fails.\n\nShare this article\n\n\n\n\n\n\n\n\n\nOne day in early 2021, my old friend George called. I always enjoyed our catch-ups. We’d usually talk about dating, movies and his screenwriting career. But this time he steered the conversation toward a new topic: Bitcoin.\n\nGeorge, whose surname I’m omitting to protect his privacy, seemed genuinely eager for me to learn about the cryptocurrency. He sent me podcasts featuring blockchain “experts” and chart-heavy newsletters about “on-chain analytics.” George was planning his financial future around Bitcoin, he told me, and didn’t want his friends to get left behind. For a while, I ignored his appeals—the whole thing seemed complicated and vaguely annoying. But as the price of Bitcoin rose, his messages became more insistent. I agreed to look into it, and after “doing my own research,” i.e., half-listening to a few podcasts set on 2x speed, I decided to buy some.\n\nA series of cascading implosions caused the value of crypto to plummet last year. After that, George and I had a very different conversation. “Let me issue a blanket apology here,” George said. “It was the blind leading the blind.” Indeed, since I’d bought it, Bitcoin had lost three-quarters of its value. We were deep in what the blockchain faithful are calling crypto winter—an extended downturn that has yet to thaw.\n\nFor George, apologizing to me wasn’t the hardest part. He’d persuaded his Chinese immigrant parents to refinance their mortgage and lend him $50,000 to invest in Bitcoin. He stored the funds on Celsius, a sort of crypto bank where they could accrue interest. The company collapsed into bankruptcy, and now the money was frozen, much of it likely lost. “I said, ‘I’m really sorry, I’m deeply ashamed, and I will commit ritual seppuku if you demand it,’ ” he says. They didn’t, but he said he plans to pay them back when he can.\n\nIt seemed that George, like a lot of us who got caught up in crypto, was experiencing not just a financial loss but a kind of financial grief—a tangle of guilt, second-guessing and that awful feeling of having fallen for something. Bitcoin’s price has bounced back some since we spoke, but that’s little comfort if you’ve had your money stuck on a janky platform such as Celsius, or lost funds on Sam Bankman-Fried’s allegedly fraudulent FTX exchange, or held one of the now-worthless “altcoins” that popped up like mushrooms in a big rain during the pandemic trading boom. For many, crypto had become an identity, a way to feel smart and subversive and on the cutting edge of a new technology. What happens to that self-image when its foundation erodes? When instead of being someone’s savvy son or daughter, you are the sheepish adult child who has to explain where the family savings went? (Disclosure: I haven’t sold the tokens—mostly Bitcoin and Ether—that I bought near the top of the bull market, making me the object of delicate inquiry and gleeful mockery at family gatherings.)\n\nIt’s complicated. George, despite the frauds, the constant hacks and the market’s collapse, says he still has faith. “I still believe blockchain is a revolutionary development,” he says. “In 10, 20, 50 years, I do believe—I want to believe, badly—that we’ll look back and say Bitcoin was an invention on the scale of the printing press or the internet.”\n\nIn their seminal 1956 social psychology study, When Prophecy Fails, Leon Festinger, Henry Riecken and Stanley Schachter described how followers of a doomsday cult responded when their prophet’s precise predictions of apocalypse turned out to be false: They just pushed the date back. Some became even stronger believers and proselytized more. They’d already committed too much, perhaps quitting their jobs or giving away money, to accept that there was nothing to it. The study became a classic example of the “cognitive dissonance” that occurs when evidence contradicts one’s model of the world.\n\nI was curious how people in crypto were handling the dissonance. In the summer of 2021, with blockchain fervor in full swing, I wrote an article about crypto communities and found it useful to divide them into factions based on their favorite investment. There were the Bitcoin maximalists, who thought the OG token was the one true way to resist the scourges of modern finance and government; Ethereum hobbyists who regarded blockchains as a nifty Lego set for building new widgets; DeFi (decentralized finance) day traders who just gambled for the buzz. Each group came with its own values and culture. Today it feels more apt to sort people by their narratives of what the hell happened to crypto and where it all goes from here.\n\nTHE DOUBLE-DOWNERS\n\nAt a dude-heavy meet-up at a Midtown bar in New York in January, a group stood in a circle debating what had gone wrong with crypto. One guy blamed the large amount of “fluff” in the market, because anyone could spin a token out of nothing. Another pointed to the lack of transparency in many crypto institutions. A trader named Boris Friedman said that while people are currently “fearful” of crypto because of FTX, he expects the market to rebound in the next three to five years. “Long term, there will be more adoption,” he said.\n\nNearby, Corey Wilson, wearing two necklaces—one featuring the Egyptian Eye of Ra, the other the logo for a blockchain called HEX—sipped a margarita. Wilson told me that after losing funds on the crypto scam BitConnect and then making it all back and more with HEX, he still buys tokens every day. “I see a higher upside now that we’re in the lows of the market,” he said. (HEX is down almost 90% from its peak.)\n\nWilson buys tokens every day. Photographer: Levi Mandel for Bloomberg Businessweek He sports a necklace with the logo of a favorite token. Photographer: Levi Mandel for Bloomberg Businessweek\n\nRich Etienne, an engineer in Florida who lost about $100,000 in the Celsius collapse, said in a phone interview that he has a good feeling about the market now. He says it’s a matter of watching for patterns in the charts—“little movements, fake-outs, certain people shilling.” It’s less science than art, he says: “You start to get the vibe that this is it.”\n\nA Dutch institutional investor-turned-Bitcoin analyst who goes by the handle “Plan B” is best known for his charts predicting that Bitcoin would pass $100,000 in 2021. When that didn’t happen, his reputation took a hit. “You see a lot of hate,” Plan B told me over Zoom. (Like many crypto influencers, he prefers to be identified by his handle out of concern for his safety.) He stands by his optimistic analysis, particularly his popular “stock-to-flow” model that predicts Bitcoin will continue trending upward as the issuance of new coins slows, as it was programmed to do by its pseudonymous creator, Satoshi Nakamoto. (The model assumes Bitcoin’s price is driven by scarcity, a logic familiar to gold bugs as well as Beanie Babies collectors.) Plan B now estimates that by 2028, Bitcoin will be worth $100,000 to $1 million, up from about $27,000 today. The date, in other words, moved back a few years. “For me it’s the long game,” he says. He adds that his bet on Bitcoin is all-or-nothing: “It’s either going to zero or it’s going to be the successor to the US dollar.”\n\nAcademics say this type of thinking—doubling down on one’s conviction, despite a crash—is consistent with the psychology of both trading and gambling. Investors are more apt to sell assets that have gained in value than to let go of ones that have dropped; it’s a phenomenon known as the disposition effect. There are different explanations for this, says Tobin Hanspal, assistant professor of finance at the Vienna University of Economics and Business. One is that traders with plunging assets become risk-loving because they feel they have nothing to lose. Another says they’re avoiding feelings of regret. People “do not want to admit defeat or face the realization that they made a mistake,” Hanspal says. (This is me.)\n\nBlec blames the collapse on “too much trust.” Photographer: Tamara Reynolds for Bloomberg Businessweek\n\nOthers keeping the faith describe the crash as a purge that proves crypto must return to its roots. The whole point of Bitcoin, according to Satoshi’s white paper, was to allow people to transact money directly with “no central authority” like a government or bank, or a company such as FTX or Celsius. This idea of decentralization has a totemic power for some, with a resonance that seems as much emotional as intellectual.\n\nChris Blec, who writes an online newsletter called the Blec Report, has made a career out of criticizing any crypto project that deviates from the original purpose of blockchain technology. Companies such as FTX were “abusing Satoshi’s invention,” he says. “They’re using it in ways it’s not intended to be used.” Blec argues that most of the projects that collapsed over the past year suffered from the same problem: “too much trust.” Any system that requires trusting human beings is inherently unstable, he says, and can create a bubble. “Every time it bursts,” he says, “more people understand that.”\n\nThose Who Knew\n\nFrances Coppola wasn’t always a crypto hater. “When Bitcoin first came out, I was quite keen on it,” she says. The UK-based writer on economics and banking had long seen a need for an alternative to the bank-based payment system, and cryptocurrencies seemed like a promising development. But by 2021 she’d turned skeptic. That summer she posted a Twitter thread explaining why even decentralized crypto systems run by code could be prone to catastrophic failure. She argued that they’d suffer digital bank runs if investors started to pull their money out quickly, which their algorithms wouldn’t be able to stop. “The algos are built on the assumption that humans never panic and stampede for the exit, ignoring the overwhelming evidence that they do,” she wrote.\n\nHer tweets caught the attention of Do Kwon, the creator of TerraUSD, a then-hot coin that used a decentralized algorithm to maintain a steady value of $1. TerraUSD was a popular substitute for US dollars among DeFi traders, and it could be reinvested to earn high yields. “I don’t debate the poor on Twitter,” Kwon tweeted in Coppola’s thread.\n\nCoppola foresaw the crypto panic. Photographer: Jack Kenyon for Bloomberg Businessweek\n\n“Schadenfreude is the right term”\n\n“That came back to haunt him,” Coppola says. “I ended up being cited in the court case.” She then bursts into a merry laugh. In May 2022, TerraUSD unraveled in exactly the type of bank run Coppola had described. Kwon is now being sued by investors and has been charged with fraud by US prosecutors; he’s denied wrongdoing. For Coppola, the crash, which TerraUSD’s fall partly triggered, has been bittersweet. She doesn’t want to take pleasure in it, given how many people have gotten hurt. And yet, “I did feel a bit, ‘So there,’ ” she says. “Schadenfreude is the right term.”\n\nCoppola belongs to a community of skeptics who have long pushed back against the narratives spread by crypto boosters. During the bull market, many of those boosters swamped the skeptics with derision. “We did take a lot of abuse from the ‘Have fun staying poor’ crowd,” she says. Since the crash, the skeptics have taken a victory lap. “I wouldn’t say people are opening bottles of Champagne,” says Amy Castor, another prominent crypto critic, who works as a freelance journalist and writes a reader-supported blog. But they’ve seen their ranks grow. “There were a handful of us before, screaming into the abyss,” she says. “Now there’s a lot more.”\n\nThe Blame-casters\n\nIn crypto, 2022 was the year of the “bad actor.” (As in malefactor, not Steven Seagal.) Bad actors were suddenly everywhere, tainting the purity of the otherwise unassailable technology. Instead of pointing to structural problems in crypto—the lack of investor protections, say, or the fundamental question of how to prevent a fully decentralized, largely anonymous currency from being used to fund terrorism—believers blamed individuals (or groups) for … acting badly.\n\nThe baddest actor of all, of course, is the man now known across the cryptosphere as “Scam Bankrupt-Fraud.” Molly White, a vocal crypto critic who runs the site Web3 Is Going Just Great, has argued that Bankman-Fried is a useful scapegoat for crypto fans. “It’s very convenient for them to say, ‘This isn’t our problem, this is just one guy,’ ” she said in a recent podcast interview. (Bankman-Fried, who’s facing criminal fraud charges, has denied wrongdoing.)\n\nOther scapegoats abound. On Fox News’ Tucker Carlson Tonight, guest host Tulsi Gabbard highlighted an unfounded theory that American politicians were channeling US taxpayer dollars to Ukraine, which was then investing in FTX, which was then funneling money back to Democrats. (Bankman-Fried was a major Democratic donor; his colleague Ryan Salame gave millions to Republicans.) Ukraine’s deputy minister of digital information tweeted that Ukraine “never invested any funds into FTX.”\n\nThe Communitarians\n\nPerhaps the only byword in the crypto lexicon as powerful as decentralization has been community. Across Twitter and Telegram and Discord, owners of the same asset gather to discuss the greatness of their asset, share memes about it and trash competing assets. This was particularly true of nonfungible tokens, or NFTs, those bits of digital art that in some cases traded for hundreds of thousands of dollars. Now, previously bustling Discord chatrooms lie quiet, and a few remaining fans wait for updates. “Devs, do something” is the pitiable refrain, the digital equivalent of poking a dead animal with a stick.\n\n“It’s very funny to look back and think, ‘Were we all just drunk or something?’ ”\n\nThe dissolution of these communities has left scars—some of them literal. In February 2022, Emma Crudgington was scrolling Twitter at her office in Brisbane, Australia, when she spotted a hot new NFT. It was called Tasty Bones, and the logo featured a cartoonish skull with an ice cream cone upended on it. The art was “cute,” she thought, and, more important, the project was getting lots of hype. Demand for access to the presale exceeded supply, and she needed a way to distinguish herself. “I was like, ‘What’s the most extreme thing I can do?’ ” she says. She got the logo tattooed on her arm. She posted a photo of it on the Tasty Bones community Discord chat, and the creators put her on the list to receive two NFTs. She ended up selling them a week later, netting around $12,000.\n\nCrudgington may lose her Tasty Bones tattoo. Photographer: Tammy Law for Bloomberg Businessweek\n\nNow that the project has disintegrated—a Tasty Bones currently sells for about $50—Crudgington is amused by the tattoo. “It’s a great story to tell people,” she says. “It’s very funny to look back and think, ‘Were we all just drunk or something?’ ” She expects she’ll have it removed or covered up. Crudgington is still involved in an NFT project called Sappy Seals. She spends hours every week talking to a subgroup of Seals owners called Sappy Sisters. “It’s like having a personal therapist,” she says. “We talk about the most random things, from physics to lip gloss.” Crudgington says the Sisters have transcended their origins. They’ve raised money for a dog charity, rallied support for a community member with cancer and discussed sexual harassment in the NFT space. She can be vague describing the nature of their bond (“the theme of the community is community”) but says the connection is authentic.\n\nConnection in crypto can be dicey. White has coined the term “predatory community” for the way it can foster bonds at the expense of its users, much like a multilevel marketing scheme. When emotions get tied up with money and a sense of belonging, it can be hard to see oneself and one’s peers clearly, especially in communities that tout virtuous causes. Such environments are ripe for manipulation. Countless projects have gotten “rugged,” or sold off by the creators, leaving investors with worthless tokens. Those that simply fizzle produce the same result.\n\nCrudgington says she recognizes such communities can be exploitative, but the Sappy Sisters are different. “There’s no monetization,” she says. “There’s no ulterior motive behind it.”\n\nThe Ones Who Step Away\n\nIn 2021, after working half a decade in traditional finance—TradFi is the dismissive crypto term—Jill took a job at a firm specializing in DeFi. (She requested I not use her full name so she can speak candidly about her work.) She was drawn to the idea of transaction without go-betweens, particularly in a world where governments can prohibit bank accounts from being used for, say, sex work or birth control. “For a while, I drank that Kool-Aid,” she says. “Then I realized no one had any idea about OFAC rules.” (The Office of Foreign Assets Control enforces sanctions against terrorist organizations.) The more she learned about the technical aspects of crypto, the less it seemed about financial freedom than “getting around capital controls.” She says she was also put off by its consumerist culture of boats and models: “I did not fit in.” She recently left that job and is looking for work in TradFi.\n\nThe idea of boats and models didn’t seem to bother another former crypto worker I spoke to, who asked not to be named at all. (People in this group are skittish about talking.) After making six figures in the 2021 bull run, he dropped out of college and took a job at a crypto venture capital firm. His thinking was simple, he says: School sucked, and he wanted to be free, make a ton of money and have a Lambo. The business model in the space was to find a project, promote it, wait for its tokens to rise and take profits. This didn’t seem sinister because everyone was making money. When he did think about the morality of his work, it wasn’t hard to justify; if anyone was getting rugged, it was rich people. In retrospect, he says it was callous not to think about what was going on under the hood.\n\nAfter the market began to slip, what had felt to him like a positive-sum game suddenly seemed zero-sum. He realized that if anyone was making outsize returns, that wasn’t happening for free. A lot of projects his firm had invested in had failed, and he found it hard to get excited about the new ones. I asked if his colleagues believed the projects had real value. They do, he says, and he thinks that’s delusional. Last fall he went back to school.\n\nIn early March, I told David, my normally laconic barber, that I was writing about crypto winter. He perked up and, taking long pauses between snips of hair while gesturing with his scissors, delivered an analysis of what he assured me is the next big thing: artificial intelligence tokens.\n\nIndeed, after the debut of ChatGPT in November, crypto tokens with some link to AI technology (the connection isn’t always clear) have rocketed in value. Multiple people I spoke with mentioned AI integration as a possible path forward for crypto. Perhaps chatbots will be able to spend cryptocurrency to accomplish their tasks. Maybe blockchain technology can help verify authenticity in a world saturated with deepfakes. The influential Twitter account @punk6529 recently posted, “AI will unveil what crypto’s true purpose is.” The tone of these conversations—hushed, commiserating, vaguely oracular, comically speculative—felt familiar. I told David I’d look into it. I have not.\n\nBeam is a freelance journalist. He made his first crypto purchase in April 2021; he hasn’t made a trade since April 2022."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTEvdGhyZXNob2xkLW5ldHdvcmstZ29lcy1saXZlLXdpdGgtd29ybWhvbGUtdG8tYnJpZGdlLWJpdGNvaW4tdG8tMjAtYmxvY2tjaGFpbnMv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8xMS90aHJlc2hvbGQtbmV0d29yay1nb2VzLWxpdmUtd2l0aC13b3JtaG9sZS10by1icmlkZ2UtYml0Y29pbi10by0yMC1ibG9ja2NoYWlucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Threshold Network Goes Live With Wormhole to Bridge Bitcoin to 20 Blockchains - CoinDesk",
        "content": "A canonical token – i.e. one that is native to an ecosystem rather than wrapped – will then be deployed for each new chain. This way, the tBTC supply remains intact and risk is corralled in local ecosystems."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2UtYW5hbHlzaXMtc3VwcG9ydC1tb21lbnR1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Price Analysts Eyeing $25K as Support Following Momentum Shift - Blockworks",
        "content": "Bitcoin (BTC) continues to flirt with valuations not seen in nearly two months, as price momentum nosedives.\n\nThe asset, which is down 2.5% on the day to $26,300, lost its footing above a support threshold along $27,000 sending it to its lowest point since March 14.\n\nBitcoin’s return to $25,000 looks like a very “real prospect” in the coming days, FxPro senior market analyst Alex Kuptsikevich told Blockworks in an email.\n\n“The bears will have their work cut out for them here, as some oversold conditions will have built up by then,” he said, highlighting the distorted equilibrium between buyers and sellers.\n\nFor a time, volatility was muted as prices remained relatively locked between $27,000 and $30,000. That was expected to persist throughout May, as declining interest across crypto derivatives effectively sapped long and short sellers.\n\nIt’s worth noting that as of May 8, bitcoin volatility was hovering at its lowest point since the beginning of January at 29% — down significantly from March 13’s peak of 63%, data from IntoTheBlock shows.\n\nHowever, volatility has been spiking on the daily time frame since May 8 and that uptick is poised to feed into medium-term price action.\n\nStill, the fact that the price has not yet breached $25,000 is significant when viewing this year’s performance, Kuptsikevich added.\n\n“Now it has every chance of becoming an equally reliable support,” he said.\n\nBut first, bitcoin would need to sort out its congestion issues, Rich Rosenblum CEO of market maker GSR told Blockworks.\n\nData reveals a significant increase in unconfirmed Bitcoin transactions, which currently stand at 284,369. This is a 440% rise compared to the figure of 52,600 observed nearly two months ago on March 17.\n\nThe current weight of the mempool, which refers to the total data size within it, is about 871 MB. This exceeds the default maximum mempool limit of 300MB set by Bitcoin Core, data shows.\n\nIt’s important to note that not every node operator sticks to the default 300MB limit. Some opt for higher thresholds to prevent discarding transactions with lower fees.\n\nWhen this occurs, transactions continue to be processed, they just might come with a higher cost, likely the result of a newly popular use case for the world’s oldest crypto.\n\nOver the past week, there has been a substantial increase in the number of Ordinals inscriptions on the Bitcoin network, which has almost doubled from 2.5 million to 4.78 million. This surge is largely attributed to the growing interest in the BRC-20 token.\n\n“Organic congestion due to excitement over BRC-20? Well, that’s probably bullish that we’re finally seeing enough adoption that it’s slowing the network,” Rosenblum said.\n\nIf, on the other hand, the network is deliberately flooded with a continuous cycle of small transactions in an attempt to profit from a bitcoin short position. “That’s bearish and hard to police in a decentralized world,” he added.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1kaXBzLTEzMTAzOTQ1NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin dips to US$26,166 as memecoins flood the blockchain - Yahoo Finance",
        "content": "Bitcoin fell 9.42% from May 5 to May 12 to trade at US$26,365 as of 7:30 p.m. on Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under US$30,000 since April 19. Ether fell 7.3% over the week to US$1,765, losing the key US$1,800 support level.\n\nimage 3\n\nThe U.S. Consumer Price Index (CPI) released this week showed slower headline inflation in April, boosting hopes for the Federal Reserve to pause rate hikes next month. U.S. annual inflation slowed to 4.9% last month, from 5% in March, but gained 0.4% on the month.\n\nBitcoin briefly topped US$28,300 following the release of U.S. inflation data, but has since been trading lower.\n\n“Bitcoin dropped to US$26,900 after rejecting from the ~US$28,200 area. The reaction from the ~US$26,900 area was quite strong,” tweeted pseudonymous crypto analyst Rekt Capital. “The US$28,200 resistance is the resistance to beat if the price is to enjoy bullish momentum,” he added.\n\nThe global crypto market capitalization stood at US$1.1 trillion on Friday at 07:30 p.m. in Hong Kong, down 8.33% from US$1.2 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$510 billion market cap accounted for 46.3% of the market, while Ether’s US$214 billion accounted for 19.4%.\n\nBitcoin stuck in traffic\n\nIn another milestone for the world’s first blockchain, the number of non-zero balance Bitcoin addresses reached an all-time high of 46.6 million on Thursday, boosted by the surging interest in Ordinals, a protocol that allows data to be inscribed in the smallest monetary unit of Bitcoin, according to on-chain data analytics firm Glassnode.\n\nAs a result, Bitcoin congestion issues worsened. The network faced a growing backlog of transactions exacerbated by the network surpassing 5 million Ordinals inscriptions, fueled by the arrival of memecoins in the form of BRC-20 tokens, a fungible token standard built on Ordinals protocol. BRC-20 tokens surpassed US$1 billion in market capitalization on Tuesday.\n\nStory continues\n\nAdding to the negative market sentiment, Binance temporarily halted Bitcoin withdrawals twice in 12 hours on Monday, due to a “large volume of pending transactions.” The world’s largest crypto exchange resumed Bitcoin withdrawals on the same day, while Bitcoin fell as low as US$27,419 on Monday.\n\n“[The correction] was highly due to that since Binance witnessed historically-high BTC outflows,” said Leena ElDeeb, a research associate at 21.co, the parent company of 21Shares, an issuer of crypto exchange-traded products.\n\nBitcoin supply on exchanges fell to a five-year low of 5.84% on Tuesday, according to crypto analytics firm Santiment, indicating that long-term holders are increasingly opting for self-custody solutions.\n\n“The downtrend was also influenced by misinformation on Twitter, calling the congestion a denial of service attack when, in fact, it was increased demand that led to that congestion and skyrocketing transactions only meant that people were willing to pay more money for faster settlements,” ElDeeb added.\n\nNilesh Verma, crypto market analyst and founder of Crypto Granth consultancy in India, pointed to a separate thread of inaccurate information dissemination surrounding the U.S. government and its Bitcoin holdings as a significant factor in the declining value of Bitcoin this week.\n\nMisinformation emerged on Wednesday, stating that the U.S. government started selling its Bitcoin holdings. According to a March 31 court filing, the U.S. government seized 51,351.89 Bitcoin (worth US$1.4 billion) from Ross Ulbricht, the creator of the darknet marketplace Silk Road. The government sold 9,861 Bitcoin (US$279 million) on March 14 and is planning to sell the remaining 41,490 Bitcoin (US$1.1 billion) in four batches this year.\n\n“Someone shared fake news that the U.S. government will sell Bitcoin by showing the wrong labeling on the Arkham Platform… same we saw on April 27, when Bitcoin dropped from US$29,000 to US$27,000 on a glitch in the Arkhram platform,” Verma said.\n\nMarket analysis\n\nCrypto Granth’s Verma said that Bitcoin has strong support around US$26,111. “Bitcoin has to hold this support for continued bullish momentum. As of now, we can see a retest of this area. We believe that we will see strong buying near US$25,000-26,000. Weekly closing below US$26,000 will make Bitcoin bearish,” wrote Verma.\n\nBut Dr. Jeff Ross, founder and chief executive officer of investment firm Vailshire Capital Management, said Bitcoin needs to dip lower before starting a new rally.\n\n“Short-term momentum indicators need one more flush lower, ideally to US$24,000, to complete the healthy reset and begin the next leg higher, starting in mid-to-late May,” wrote Ross on his verified Twitter account.\n\nBiggest gainers:\n\nKava, the governance token of a layer-1 blockchain of the same name, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. Kava rose 17% to US$0.9204, after the protocol announced that its mainnet launch is one week away.\n\nBitcoin SV (BSV) – a fork of Bitcoin Cash focused on scalability – was this week’s second biggest gainer, rising 8.47% to US$35.88. The token saw a surge of interest after congestion on the Bitcoin network caused transaction fees to rise .\n\nSee related article: Central Banks’ actions move Crypto; Standard Chartered eyes $100K Bitcoin\n\nNext week: All eyes on the U.S. debt ceiling\n\nNegotiations over raising the U.S. debt ceiling of US$31.4 trillion to keep the government solvent continued on Wednesday, with congressional Republicans demanding more budget cuts. President Biden’s meeting with top Congress leaders planned for Friday was postponed to next week, three sources familiar with the matter told NBC News.\n\nInvestors are also anticipating Europe’s Harmonised Indices of Consumer Prices report, scheduled for next Wednesday. Euro area annual inflation for April is expected to come in at 7% for April, up from 6.9% in March, according to flash estimates from Eurostat, the European Union’s statistical office.\n\nIn the crypto space, liquid Ether staking protocol Lido Finance is preparing for its V2 upgrade, enabling Ether and staked Ether (stETH) withdrawals directly on the protocol. The Lido DAO is set to vote for the V2 upgrade starting today, from 10 p.m. Hong Kong time. With the community’s approval, the upgrade is expected to go live next Monday.\n\nWeb 3.0 gaming protocol Gala Games is also preparing for a contract upgrade on Monday. The protocol will issue its new Gala V2 token in a 1:1 ratio for all Gala token holders, while support and utility for the initial token will cease simultaneously. While most major exchanges signaled their support for the new token, Coinbase stated that it will not be supporting Gala V2.\n\nSee related article: Crypto and NFT Market Update – May 11th"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JyYy0yMC1iaXRjb2luLW5ldHdvcmstdmljdGltLW93bi1zdWNjZXNzL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JyYy0yMC1iaXRjb2luLW5ldHdvcmstdmljdGltLW93bi1zdWNjZXNzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "BRC-20 makes Bitcoin network a victim of its own success - Forkast News",
        "content": "In this issue\n\nBitcoin network: Stress test Binance: Applying brakes China: Crypto in court\n\nFrom the editor’s desk Dear Reader, It seems the crypto conversation is migrating and fast. This week, I’m writing from the Middle East on the tails of the Dubai FinTech Summit and AIM (Annual Investment Meeting) in Abu Dhabi in the United Arab Emirates. I’ve been speaking with local firms and investors, along with regulators and regional leaders. And it’s hard to gloss over the disconnect between the shining ideals that are supposed to underpin the U.S. economic model and the dysfunctional reality that the crypto industry is grappling with. The U.S. Securities and Exchange Commission, in particular, is throwing its weight around and failing to support the emergence of an innovative industry. So it’s no surprise to see some significant industry leaders from America — such as Coinbase CEO Brian Armstrong — making appearances in the Middle East this week. Coinbase, the exchange giant that recently sued the SEC for more clarity on crypto regulation — a call that has echoed throughout the entire digital asset industry for longer than anyone cares to remember — may find that clarity abroad, as U.A.E. looks to entrench its position in the Web3 digital ecosystem. Earlier this year, Abu Dhabi launched a US$2 billion fund to support U.A.E.’s Digital Economy Strategy as part of its diversification efforts into non-oil sectors. That strategy is also in play in Asia as Hong Kong opens up its policy arms with a new regulatory framework for virtual asset service providers to pave the way for crypto trading for the retail market. Hong Kong, too, is looking at comprehensive ways to win back the exodus of talent and innovation that left a few years before as regulators clamped down. And these regions with shared strategies and interests are exploring ways to collaborate. A delegation of industry leaders from Hong Kong and across APAC came to learn how to build meaningful business bridges into the MENA region. Even China is providing more clarity on cryptocurrencies (albeit cautiously). China’s Supreme Court, it has been revealed, ruled back in January that cryptocurrencies possess certain attributes of virtual property. Meanwhile in the U.S., the SEC and the CFTC remain completely at loggerheads over whether cryptos are securities or commodities, an impasse in which no end is in sight, with far-reaching implications for the industry. Crypto policy intransigence from America’s “shining city on a hill” has us wondering if there will soon be geographical moves as the industry finds guiding light elsewhere. Until the next time, Angie Lau,\n\nFounder and Editor-in-Chief\n\nForkast\n\n1. Bitcoin network: Stress test\n\nThe Bitcoin network has typically attracted fewer memecoins than Ethereum, but its role in the segment has grown since the BRC-20 standards were launched. Image: Canva\n\nTwo months after the launch of BRC-20 standards, the Bitcoin blockchain has become a popular destination for memecoins, a cryptocurrency market niche previously dominated by Ethereum. The market capitalization of Bitcoin-based memecoins has surged from around US$130 million at the beginning of May to over US$588 million at press time, triggering congestion on the world’s oldest blockchain network.\n\nBRC-20 is an experimental token standard based on the Bitcoin blockchain, introduced on March 9 this year by pseudonymous blockchain enthusiast “Domo.” Inspired by the Ethereum blockchain’s ERC-20 standards, BRC-20 allows users to issue fungible tokens through Bitcoin’s Ordinals protocol. On the same day, Domo launched the first BRC-20 token, Ordi.\n\nMore than 14,300 BRC-20 tokens have been issued on the Bitcoin blockchain since the standard was launched, according to blockchain data tracker BRC-20.io. Memecoins including ORDI, PEPE Ordinals (not to be confused with the Ethereum-based PEPE memecoin), and MEME have taken the lead in terms of market capitalization, with ORDI’s market cap currently topping US$300 million, almost-two thirds that of all BRC-20 tokens combined.\n\nMemecoins are cryptocurrencies, such as Dogecoin and the Shiba Inu token, that started as a joke or meme. Memecoins typically have no underlying utility, but some have attained market caps in the billions of dollars. Memecoin prices are usually extremely volatile, and their popularity and values are driven mainly by fads and a herd mentality.\n\nThe prices of BRC-20 tokens have been on a roller coaster in the past several days, with their total market cap exceeding US$1 billion on Monday, plunging more than 28% to around US$689 million on Tuesday, and sliding some more to under US$580 million on Thursday evening in Hong Kong, according to BRC-20.io.\n\nThe BRC-20 memecoin surge has driven up transaction fees on the Bitcoin blockchain and put the network’s capabilities to the test. Transaction fees for minting tokens using the Bitcoin Ordinals protocol reached more than 151 BTC on May 9, an almost 40-fold increase from 4.30 BTC on March 9 when the BRC-20 standard was introduced, according to blockchain data analytics platform Dune Analytics.\n\nDriven by surging transactions and fees on the Bitcoin network, crypto exchange Binance suspended Bitcoin withdrawals twice ― once on May 7 and again on May 8 ― triggering a drop in cryptocurrency prices.\n\nTransactions made by Binance users could not get picked up by Bitcoin validators, as the withdrawals fees charged by the exchange were lower than those charged by the miners, according to a Bloomberg report that quoted Stefan von Haenisch, head of sales trading at digital asset brokerage OSL SG in Singapore.\n\nDriven by blockchain users seeking alternatives to high Bitcoin transaction fees, the Litecoin blockchain has logged record-high daily transactions this week. Transactions on Litecoin topped 525,000 on Monday, more than five times higher than the start of the month, according to blockchain data platform BitInfoCharts.\n\nBitcoin’s Ordinals protocol was introduced in January and allows data such as text and images to be inscribed on the Bitcoin blockchain, a function similar to that used in the minting of non-fungible tokens.\n\nForkast.Insights | What does it mean? Bitcoin’s embrace of memecoins helped the network achieve record-breaking transaction figures in the past week, but keen-eyed observers of the surge noticed that the dollar value of many transactions shrunk from US$1,000 to US$1. This downshift in value brings Bitcoin’s on-chain behavior into line with other chains able to host tokens. It’s a good sign for Bitcoin, but a terrible one for the environment. Bitcoin is notoriously slow at updating. Of all the nodes on the Bitcoin network that are reachable (some hide behind VPNs to avoid detection) currently only around 36% run the latest version of Bitcoin’s core software. That makes upgrading all nodes difficult and makes changes to Bitcoin’s core software a challenge. Introducing the BRC-20 token standard is a demonstration that change is possible on the network. But one change that hasn’t been considered is Bitcoin’s horrendous energy consumption. Bitcoin, now the only large blockchain running on a proof-of-work protocol, continues to tax energy grids across the world. The surge in transactions has increased the power needed to keep the network running. Although Bitcoin’s electricity consumption has fallen significantly below its usage from a year ago, it represents a problem for the long-term sustainability of the network and the planet. If the trend toward smaller transactions accelerates, expect Bitcoin to become a burden on energy grids once again, perhaps even forcing miners out of their adopted homes in such eco-unfriendly places with artificially low energy prices as Texas.\n\n2. Pause and reset\n\nBinance’s suspensions of Bitcoin withdrawals come amid surging transaction volumes that have strained the network’s capabilities. Image: Canva\n\nBinance, the world’s largest crypto exchange, suspended Bitcoin withdrawals twice within 12 hours on Sunday and Monday Hong Kong time, citing a “large volume of pending transactions” on the Bitcoin blockchain. The suspension came amid a surge in Bitcoin transaction fees, which has put the world’s oldest blockchain network under pressure.\n\nBinance tweeted on Monday: “Our set fees did not anticipate the recent surge in Bitcoin network gas fees” and the exchange said it was attempting to solve the issue by amending pending transactions with higher fees so they would be picked up by mining pools.\n\n“Pending transactions are being processed by replacing them with higher transaction fees,” Binance said after it resumed allowing Bitcoin withdrawals. “To prevent a similar recurrence in the future, our fees have been adjusted. We will continue to monitor on-chain activity and adjust accordingly if needed.”\n\nBinance also noted in the tweet it has been working to integrate the Bitcoin Lightning Network into its transaction services, which it said would help in such situations. The Lightning Network is a layer-2 protocol for the Bitcoin blockchain that aims to improve the network’s scalability.\n\nOn Sunday night Hong Kong time, Binance tweeted that it had encountered a “congestion issue” and had to halt Bitcoin withdrawals. About an hour and a half later, it said it had resumed withdrawals.\n\nData from CryptoQuant showed that Binance saw total outflows of around 188,281 BTC on Sunday alone, the largest daily volume CryptoQuant has recorded since it started tracking such data in May 2020.\n\nThe average transaction fee on the Bitcoin blockchain reached US$19.20 on Sunday, its highest level in almost two years, and soared to US$31.14 on Monday, according to data from blockchain information platform BitInfoCharts. Bitcoin’s average transaction fee was only US$2.88 at the beginning of May.\n\nForkast.Insights | What does it mean? The surge in activity on the Bitcoin network, and the subsequent suspension of BTC withdrawals by Binance, was interpreted by some as an example of how someone might attack the Bitcoin network in the future, choking it with transaction requests. Others, meanwhile, highlighted that to do so would require deep pockets, as one user had to pay more than 5 BTC (over US$170,000) to complete one transaction earlier this week. The congestion temporarily created a fork in the Bitcoin blockchain that meant nearly 10 BTC had been double-spent as it had been registered on both chains. The last time this happened was November 2020, highlighting how unusual congestion on the network has become. The rocketing fees, alongside record-breaking outflows, suggest Bitcoin may be entering a new phase in its evolution. The total number of Bitcoin-based digital assets is now more than 5 million, a figure that has doubled in less than a week. Although historically Bitcoin has been used as a store of value, and the demand on the network has therefore been manageable, the explosion of people taking advantage of the BRC-20 standard means the network and its off-ramps need to adapt.\n\n3. Small doses\n\nThe decision by China’s top court to allow settlement in crypto of cases involving small sums of debt marks a modest departure from Beijing’s ban on all crypto transactions. Image: Canva\n\nVirtual assets can be used legally in China to settle debts in certain cases involving transactions made as part of barter agreements or labor services, despite the nation’s blanket ban on cryptocurrency transactions, the Supreme People’s Court of China declared at a conference earlier this year.\n\nThe country’s top court said at the conference on financial cases in January that cryptocurrencies shared some attributes of virtual properties, and if parties in cases agreed to use small amounts of cryptocurrencies to settle their debts, those contracts should be regarded as valid by Chinese courts.\n\nIf cryptocurrency transactions could not be executed due to legal restrictions, courts would determine compensation based on the actual value of the agreed sum of crypto involved when contracts were signed.\n\nThe Supreme Court added that courts would not accept any complaints by users if their cryptocurrencies had been traded after Sept. 4, 2017 — the date that Beijing imposed a ban on initial coin offerings and crypto exchange services — and in cases in which trading platforms or token issuers failed to fulfill their liquidation obligations.\n\nCourt records further clarified that the use of cryptocurrencies as payment for fiat currencies or physical commodities under the guise of contracts would be treated as illegal.\n\nThe conference records align with the Chinese government’s stance on cryptocurrencies, which emphasizes that tokens such as Bitcoin, Ether and Tether do not have the same legal status as fiat money. China issued its comprehensive ban on cryptocurrency transactions in September 2021.\n\nOutside mainland China, Hong Kong’s push to develop itself as a crypto hub has received Beijing’s blessing, with Chinese state-owned banks now offering services to crypto firms in the territory."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmV1cm9uZXdzLmNvbS9idXNpbmVzcy8yMDIzLzEyLzA0L3RvZGF5cy1tYXJrZXRzLWJpdGNvaW4taXMtMTUwLXVwLWdvbGQtZmxpcnRzLXdpdGgtbmV3LXJlY29yZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Today's markets: Bitcoin is 150% up, gold flirts with new record - Euronews",
        "content": "Investors are eyeing good news from the US economy while concerns of a broader Israel-Hamas war temporarily pushed the price of gold to new levels.\n\nADVERTISEMENT\n\nBitcoin has reached $42,245 as it rides a wave of momentum on expectations about US interest rate cuts and as traders anticipate the imminent approval of US stock market-traded bitcoin funds.\n\nThe world's biggest cryptocurrency jumped more than 8% above $42,000 on Monday, its highest since April 2022.\n\nBitcoin is up by over 150% so far this year - with its price standing at $17,140 a year ago - though the current price is still more than 40% lower than its all-time high in 2021.\n\nMeanwhile, gold has been shining once again, as safe haven investments do in periods of geopolitical volatility.\n\nAn attack on an American warship and commercial vessels in the Red Sea on Sunday kept investors on their toes and inflamed fears that the Israel-Hamas war could widen into a broader conflict.\n\nThe precious metal reached a new record, amidst expectations that the US Federal Reserve (Fed) will cut interest rates next year, as well as tension in the Middle East and a weaker dollar. The price shortly visited $2,144 an ounce, an all-time high, before easing back around $2,090 in the Monday morning trade.\n\n\"The market is sensitive to any expansion of this conflict,\" said Quincy Krosby, chief global strategist at LPL Financial. \"I think active managers in any event are more likely to lock in their gains if this is a harbinger of a deeper military conflict that involves the US.\"\n\nOil prices are down\n\nDespite some expectations and the rising geopolitical tensions, oil prices went south, pressured by investor scepticism over the latest OPEC+ decision on supply cuts and uncertainty surrounding global fuel demand, though the risk of supply disruptions from the Middle East conflict limited losses.\n\nMonday's fall adds to a 2% decline last week after the supply cuts announced on Thursday by the Organization of the Petroleum Exporting Countries (OPEC) and allies including Russia, together known as OPEC+.\n\nBrent crude futures were hovering above $78 and WTI crude futures fell below $74 per barrel on Monday morning.\n\nHow did data from Europe set the mood Monday morning?\n\nThe main European stock indexes showed a mixed picture on Monday morning, with only the German DAX and the Spanish IBEX 35 showing slight gains, as a handful of data has been released to set a mood for investors.\n\nThe trade surplus in Germany increased to €17.8 billion in October 2023, as exports fell by 0.2% compared to the previous month to €126.4 billion. Imports however fell more spectacularly to €108.6 billion, down by 1.2% from the previous month and 16.3% from a year earlier, largely due to lower energy prices.\n\nMeanwhile, in Spain, the number of people registering as jobless fell by 24,573, or 0.9%, to 2.73 million in November 2023. Spain's unemployment rate was 11.84% in the third quarter of 2023.\n\nAnother positive development from the heart of Europe came in the form of Switzerland's inflation rate slowing to a two-year low. Prices rose 1.4% in November from a year earlier, according to the Federal Statistics Office.\n\nIt's the final reading ahead of the Swiss National Bank's (SNB) next interest rate decision on 14 December. The SNB's current policy interest rate is at 1.75%, while its inflation target range is 0% to 2%.\n\nThe European Central Bank (ECB) is also holding its monetary policy meeting on 14 December and investors are closely watching whether recent surprisingly good inflation data was good enough news for the Eurozone lender to relax its tight monetary policy.\n\nHowever, ECB Vice-President Luis de Guindos cautioned the markets of high uncertainty at a financial event on Monday, adding that \"it was too early to declare victory,\" writes Reuters.\n\nWhat could drive investors' hands this week?\n\nMarkets are hungrily watching signs of easing inflation and hope the Fed is done raising interest rates.\n\nADVERTISEMENT\n\nAsian stocks mainly fell on Monday amidst concerns over China’s economic health. Indian shares were the exception, as they rose fuelled by financial and energy stocks, while key wins for the ruling party in state elections lifted the domestic market.\n\nUS stocks closed at their highest level since March 2022 on Friday after comments from Fed chair Jay Powell fuelled hopes that the central bank is done raising interest rates and will start cutting rates sooner than expected.\n\nOn the wave of this, last Friday the S&P 500 (index tracking 500 of the largest companies listed on stock exchanges in the US) reached a new 2023 high.\n\nThis week, investors are going to closely watch oil inventories in the US and the various jobs reports from the country, as the world's biggest economy is expected to pull a fast recovery and avoid recession next year.\n\nAs new jobs are a leading indicator of economic health, Tuesday's JOLTs job openings, unemployment claims on Thursday, and Friday's unemployment rate are certainly going to drive investors' hands.\n\nADVERTISEMENT\n\nThe next Fed monetary policy meeting is on 12-13 December.\n\nIn Europe, the Eurozone GDP and employment data due for Thursday could give more details about the bloc's economy, which is feared to be facing recession."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvZmlyc3QtbW92ZXItYW1lcmljYXMtbWVtZWNvaW4tcGVwZS1oaXRzLTFiLW1hcmtldC1jYXAv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8xMi9maXJzdC1tb3Zlci1hbWVyaWNhcy1tZW1lY29pbi1wZXBlLWhpdHMtMWItbWFya2V0LWNhcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Falls to 2-Month Low - CoinDesk",
        "content": "Crypto miner Hive Blockchain is planning to sell up to $100 million in common shares through an at-the-market sale in order to fund the goal of doubling its computing power. Hive is aiming to increase its hashrate from 3 exahash/second (EH/s) to 6 EH/s, part of which it says it can achieve by the end of Q2 with machines already purchased. No further details have been offered on the timeline of the sale, for which Canadian investment firms Canaccord Genuity and Stifel are to act as agents. Following the turbulence of 2022, of which several miners did not live to tell the tale, firms are now taking advantage of a modest rebound in crypto prices so far this year to set new growth and operational targets."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYnRjLXNsaXBzLXRvLTItbW9udGgtbG93LWFzLWNvaW5kZXNrcy1iaXRjb2luLXRyZW5kLWluZGljYXRvci1zaGVkcy1idWxsaXNoLWJpYXMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTIvYnRjLXNsaXBzLXRvLTItbW9udGgtbG93LWFzLWNvaW5kZXNrcy1iaXRjb2luLXRyZW5kLWluZGljYXRvci1zaGVkcy1idWxsaXNoLWJpYXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Prices Slip to 2-Month Lows as CoinDesk’s Bitcoin Trend Indicator Turns Neutral From Bullish - CoinDesk",
        "content": "\"We could get an acceleration on the downside IF U.S. equities also start to roll over,\" Lo told CoinDesk. \"$25,200 is key support for BTC followed by $23,100 on potential downside acceleration.\""
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcmRpbmFscy1nb29kLW9yLWJhZC1mb3ItYml0Y29pbi1zdXBwb3J0ZXJzLWFuZC1vcHBvc2Vycy1yYWlzZS12b2ljZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ordinals good or bad for Bitcoin? Supporters and opposers raise voices - Cointelegraph",
        "content": "Bitcoin Ordinals, a technology that enables adding text, images and code on a satoshi — the smallest unit of Bitcoin (BTC) — continues to inspire debate among the Bitcoin community.\n\nSoon after the introduction of Bitcoin Ordinals in January 2023, the technology’s opponents began to raise concerns over its perceived flaws, citing issues like rising transaction costs and slower speeds.\n\nConversely, Ordinals supporters said that the tech provides more opportunities, improves decentralization and ensures freedom of speech.\n\nAs the number of Bitcoin Ordinals inscriptions doubled from 2.5 million to over 5 million in just eight days, Cointelegraph looks at the technology and the controversy surrounding it.\n\nCost, speed and security vulnerabilities\n\nThe undeniable and undesired impact of Ordinals on Bitcoin’s network capacity and scalability is one of the biggest arguments by Bitcoin purists, who believe that BTC is supposed to exclusively follow Satoshi Nakamoto’s prescribed peer-to-peer payment mission.\n\nThe ongoing rise in BRC-20 activity — which utilizes Ordinal inscriptions — has triggered a sharp increase in BTC transaction fees. The trading frenzy of BRC-20 memecoins like Pepe (PEPE) has driven Bitcoin transaction costs to the highest levels since 2021.\n\nAs users continue pouring BTC into minting new tokens settled via Ordinals inscriptions, the blockchain has also experienced massive congestion. On May 7, the Binance exchange temporarily closed BTC withdrawals due to 400,000 pending transactions clogging the mempool.\n\nGiven recent events, can we just agree to rename the mempool to memepool? pic.twitter.com/6jHQKvjPW2 — alfaleek (yo / uhh / hmm) (@alfaleek) May 3, 2023\n\nEnrico Rubboli, CEO of Bitcoin layer-2 sidechain Mintlayer, told Cointelegraph that the technology behind Ordinals is “heavily flawed” and doesn’t follow the “axioms of the core Bitcoin community.”\n\n“The developers of the standard and the tools are not affiliated with Bitcoin, they are anonymous, and their software has not been thoroughly tested in this application,” Rubboli said. The exec also believes that Ordinals could cause additional regulatory scrutiny for Bitcoin, as new BRC-20 tokens may be considered unregulated securities.\n\nRubboli further argued that, with Ordinals, the protocol is vulnerable to scams. “The entire ecosystem was set up to be confusing and misleading,” he said, arguing that BRC-20 was created to “leech off the popularity of Ethereum’s ERC-20 token.”\n\nHe further emphasized that the anonymous BRC-20 creator Domo warned users in the first place that the tokens were “worthless.” Before launching BRC-20, Domo took to Twitter to stress that the token is “simply a fun experiment.”\n\ngm. I'm glad that some people like the experiment. Some additional notes.\n\n1. These will be worthless. Please do not waste money mass minting.\n\n2. Due to how some inscription tools are set up, the 'balance' may be minted to the intermediary address used in https://t.co/mja39YGIow… — domo (@domodata) March 9, 2023\n\n“These will be worthless. Please do not waste money mass minting,” the BRC-20 creator wrote.\n\nArguments from Bitcoin Ordinals supporters\n\nBitcoin Ordinal’s capability to unlock new value on the Bitcoin blockchain is a significant counterargument by supporters of Ordinals. Some Ordinals defenders also believe that issues like higher transaction costs will fade with time.\n\n“Ordinals is a beneficial exploration for Bitcoin application and helps to unlock greater value in the Bitcoin network,” F2Pool chief marketing officer Li Qingfei told Cointelegraph, adding:\n\n“The network congestion it brings should be temporary, and there will be good solutions to solve the problem and reduce transaction costs, and increase transaction speeds, just like the Lightning Network.”\n\nLi claimed that the increase in transaction fees will encourage more miners to participate in maintaining the network after Bitcoin’s upcoming halving in 2024. As an active proponent of Ordinals, F2Pool launched a special nonfungible token series called “10² Islands” to celebrate its 10th anniversary.\n\nRoundtable21 co-founder Brandon Dallmann echoed Li’s remarks, stating that BRC-20 is currently being stress-tested against Ethereum’s ERC-20 protocol. “Since it is not complete yet, the Bitcoin network is unable to keep up with the demand and is getting congested,” he told Cointelegraph.\n\nDallmann also advised users to utilize multiple crypto platforms instead of keeping the entire stake on just one to prevent issues caused by congestion on the Bitcoin network.\n\nSome community members asked why one should hinder Bitcoin’s transformation from “magic internet money” to a more complex technology.\n\n“I see the backlash from many BTC purists, but I don’t think that anyone should use their platform to attempt to censor transactions and attempt to discern between what is a ‘valid’ and ‘invalid’ transaction on any network,” AngelBlock founder Alex Strzesniewski told Cointelegraph.\n\nMany Ordinals supporters have also noted the technology’s contribution to the freedom of speech. “I know everyone hates ordinals, but whether it’s text or images, the ability to publish uncensorable information on the Bitcoin time chain effectively makes speech uncensorable worldwide forever,” Bitcoin observer BitPaine wrote on Twitter.\n\nPerspective matters most\n\nDespite the clashing perspectives between Ordinals’ supporters and detractors, it’s important to note that much of the reasoning for or against them largely depends on perspective.\n\nFor example, for layer-2 tech builders, it is only natural to oppose Bitcoin’s base layer developments like Ordinals. In contrast, miners will likely not oppose something that could increase their revenues.\n\nBitcoin Ordinals are hardly changing anything for hodlers, who most likely won’t care much about transaction fees or the size of the mempool. However, they are causing many issues for traders and other market participants like crypto exchanges.\n\nWhether or not Ordinals are here to stay, the community has yet to see the technology’s full potential and its true consequences."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZGVjcnlwdC5jby8xMzk5NDQvYml0Y29pbi1zdXJmaW5nLXRvdXJpc3RzLWFyZS1mbG9ja2luZy10by1lbC1zYWx2YWRvci13aGF0cy10aGUtYmlnLWRlYWzSAWdodHRwczovL2RlY3J5cHQuY28vMTM5OTQ0L2JpdGNvaW4tc3VyZmluZy10b3VyaXN0cy1hcmUtZmxvY2tpbmctdG8tZWwtc2FsdmFkb3Itd2hhdHMtdGhlLWJpZy1kZWFsP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Surfing Tourists Are Flocking to El Salvador—What’s the Big Deal? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTourists are flocking to El Salvador in record numbers, according to the country’s tourism minister.\n\nThe announcement comes as the Central American country ramps up its PR campaign to show the world that it is no longer a tiny backwater plagued by hyper violent street gangs—but rather a Bitcoin and surf paradise.\n\nOn Thursday, President Nayib Bukele, the country’s social media savvy, millennial leader, posted a cinematic video on Twitter announcing that El Salvador had just gone 365 days without a single homicide.\n\nAD\n\nAD\n\nWe ended on May 10, 2023, with 0 homicides nationwide. With this, it's 365 days without homicides, a full year. pic.twitter.com/SlupO8vN6J — Nayib Bukele (@nayibbukele) May 12, 2023\n\n“El Salvador today is undisputedly the safest country in Latin America,” a dramatic voice narrates in the video.\n\nAFP reported that the figure was “the total number of days without murders since 2019” rather than consecutive days.\n\nTourism minister Morena Valdez added on Twitter that the country had received one million visitors so far this year.\n\nUntil recently, El Salvador was largely unpopular on the “gringo trail,” other than with hardcore surfers. That's because it repeatedly dropped in and out of the most violent nations on the planet lists.\n\nAD\n\nAD\n\nIn 2015, with at least 6,640 murders, it was ranked the most murderous country in the Western Hemisphere.\n\nBut El Salvador made headlines in 2021 when it became the first country in the world to make Bitcoin legal tender. Its eccentric leader has gone on Bitcoin-buying sprees and businesses now have to accept the cryptocurrency by law.\n\nPresident Bukele has turned things around in the country by launching a historic crackdown on El Salvador’s notorious criminal groups. He in turn hopes to transform the country into a tech hub.\n\nAnd Salvadorans seem pleased with the turnaround: Murders are down and Bukele regularly polls well.\n\nBut human rights groups have criticized his crime-tackling strategy and institutions like the World Bank and the IMF have slammed the Bitcoin idea.\n\nReal data is hard to get hold of, too: No one other than the Salvadoran government knows how much murders have really dropped by—or how much Bitcoin the government owns.\n\nStill, the impact of the Bitcoin and surf tourism campaign is undeniable. Travel guide giant Lonely Planet in November rated El Salvador as one of 11 top countries to visit in 2023.\n\nAD\n\nAD"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWZhbGwtbW9udGgtbG93cy0wMjUzMTU2NDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether fall to month lows; Polygon leads losers; U.S. equity futures up as inflation cools - Yahoo Finance",
        "content": "Bitcoin prices slid on Friday morning in Asia to below US$27,000 amid concerns about shrinking liquidity and congestion on the network that are driving up transaction costs. Ether fell below support at US$1,800 as all top 10 non-stablecoin cryptocurrencies retreated. Polygon’s Matic led the losers. U.S. equity futures edged up as economic data on Thursday indicated inflation is slowing, raising optimism the Federal Reserve may halt its interest rate hikes in June.\n\nSee related article: Bitcoin network buckles under weight of BRC-20’s runaway success\n\nBitcoin, Ether fall to monthly lows\n\nImage: Envato Elements\n\nBitcoin slid 2.13% to US$26,974 in the 24 hours to 08:30 a.m. in Hong Kong, according to CoinMarketCap data, losing 6.63% for the week. The world’s largest cryptocurrency fell to US$26,781 at one stage on Thursday, the lowest price since March 28.\n\nCongestion on the Bitcoin blockchain is fueling the slide, with a backlog of waiting transactions reaching almost 300,000 on Friday morning, over six times higher than the number on May 9. That was when the BRC-20 token standard was introduced to allow the minting of fungible tokens on the Bitcoin network and generated a surge in activity, according to data from blockchain researcher Jochen Hoenicke.\n\nThe jump in transaction volumes has raised concerns among Bitcoin developers. Luke Dashjr, a Bitcoin code contributor, emailed the Bitcoin developer community on Monday to suggest blocking the transactions of BRC-20 tokens, which “threaten the smooth and normal use of the Bitcoin network as a peer-to-peer digital currency.”\n\nBitcoin’s drop also comes amid rising concerns about liquidity. Jane Street Group and Jump Crypto, two of the world’s leading market makers, are reportedly quitting digital asset trading in the U.S., according to a Bloomberg report on Wednesday.\n\nEther fell 2.34% to US$1,795, posting a weekly loss of 4.45%. The token dropped to US$1,774 on early Friday, the lowest price since April 3.\n\nStory continues\n\nThe Beacon Chain of the Ethereum Network briefly stopped validating transactions on early Friday morning, with Ethereum developers tweeting later that the outage had been resolved and the cause still under investigation.\n\nAll other top 10 non-stablecoin cryptocurrencies traded lower. Polygon’s Matic token led the losers, dropping 3.75% to US$0.8406 and retreating 14.45% for the week. The token logged a low of US$0.8332 earlier today, the lowest price since January 8, 2023.\n\nThe total crypto market capitalization fell 2.11% in the past 24 hours to US$1.12 trillion. The total trading volume dropped 17.87% to US$37.67 billion.\n\nNFT index dips, Ethereum sales slide after Milady hype\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 1.42% to 3,394.50 in the 24 hours to 10:30 a.m. in Hong Kong, down 7.14% for the week.\n\nNFT sales on the Ethereum blockchain fell 47.62% in the past 24 hours to US$17.65 million, as the hype for Millady Maker NFT collection faded. Sales of Millady Maker dropped 86.53% to US$1.01 million, according to data from CryptoSlam.\n\nNFT trading is slowing due to the recent memecoin hype, with very few new users entering the space, according to Eric Dettman, NFT advisor at CryptoSlam. NFT buyers on the Ethereum blockchain totaled 45,298 in the past seven days, a drop of 72.97%.\n\nMemecoins are also losing steam. The price of Ordi, the memecoin that accounts for more than 60% of the total market cap of BRC-20 tokens, has slid 31.43% in the past 24 hours, according to blockchain data tracker BRC-20.io.\n\nEquity futures gain on slowing inflation data\n\nImage: Envato Elements\n\nU.S. stock futures rose as of 11:00 a.m. in Hong Kong. The Dow Jones Industrial Average futures edged up 0.07%. The S&P 500 futures gained 0.14%. And the Nasdaq Composite futures added 0.25%. The three U.S. indexes closed mixed in regular trading on Thursday on investor concerns about banking risks.\n\nThe U.S. producer price index (PPI) in April logged an annual increase of 2.3%, lower than predictions of 2.4% and the slowest pace since January 2021, according to Reuters on Thursday.\n\nU.S. initial jobless claims rose to 264,000 in the week ending May 6, beating expectations and reaching the highest level since October 2021, according to a Thursday Bloomberg report. Together with the PPI, the data points to a slowdown in the U.S. economy, which may prompt the Federal Reserve to leave interest rates unchanged in June.\n\nOn U.S. banks, PacWest Bancorp shares fell more than 20% on Thursday, after the California-based lender said its deposits declined approximately 9.5% in the week ending May 5, sparking new concerns about the banking industry after a series of failures at lenders this year.\n\nPresident Joe Biden and top lawmakers postponed Friday talks on raising the U.S. debt ceiling to early next week, according to CNN on Thursday, with the negotiations making little progress so far.\n\nThe Federal Reserve will decide on June 14 its next move on interest rates, which are now between 5 and 5.25%, the highest since 2006. The CME FedWatch Tool predicts a 87.1% chance the Fed will keep rates unchanged in June, and a 12.9% chance for another 25 basis-point rate hike, up from 3.9% on Thursday.\n\n(Updates with equity section.)\n\nSee related article: Japan looks to regain its place in the cryptocurrency world pecking order"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tY29uZ2VzdGlvbi1pc3N1ZXMtY29udGludWUtYnJjLTIwLW1lbWVjb2luLW9yZGluYWxzLXN1cmdlL9IBW2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tY29uZ2VzdGlvbi1pc3N1ZXMtY29udGludWUtYnJjLTIwLW1lbWVjb2luLW9yZGluYWxzLXN1cmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin congestion issues continue amid BRC-20 memecoin, Ordinals surge - Forkast News",
        "content": "The Bitcoin blockchain has been facing a growing backlog of transactions in recent days amid the arrival of memecoins on the network.\n\nThe market capitalization of BRC-20 tokens, a fungible tokens standard built on the Ordinals protocol that is fueling the memecoin surge on Bitcoin, surpassed US$1 billion on Tuesday, before retreating to US$588 million as of 6:00 p.m. in Hong Kong Thursday, according to data provider BRC-20.io.\n\nHeadlined by memecoin rising star Pepe, over 14,300 types of BRC-20 tokens are contributing to jamming up the blockchain thanks to Ordinals, a protocol that allows data to be inscribed in the smallest monetary unit of Bitcoin, satoshi. The inscription also brought a version of non-fungible tokens (NFT) to Bitcoin.\n\n“The primary driver of this congestion and the related surge in transaction fees are inscriptions that use the BRC-20 minting standard,” said Colin Harper, head of research and content at Bitcoin mining software and services firm Luxor Technologies, in an email.\n\nBitcoin’s network congestion can be measured by its memory pool size, or mempool, the queue of pending valid transactions waiting to be added to blocks. It is often measured in virtual bytes (vbytes), and a single Bitcoin block can theoretically hold up to a million vbytes.\n\nOver 298,312 transactions were waiting to be validated as of 6 p.m. on Thursday, which is equal to a near one-month high of 186.7 million vbytes. Bitcoin’s mempool size stood at 3.31 million vbytes on April 24, according to on-chain data from mempool.space.\n\nThe expanding mempool size caused Bitcoin transaction fees to rise to US$30.91 on Monday, the highest in two years. This dropped to US$14.05 as of 6 p.m. in Hong Kong, according to Chicago-based investment software company ycharts.\n\n“[BRC-20 inscriptions] use JavaScript Object Notation (JSON) file format which is relatively data heavy. Combine that heaviness with the ‘first-come, first-mint’ incentives that BRC-20 mints create and you have a recipe for transaction congestion,” wrote Harper,\n\nMiners profit from Bitcoin congestion\n\nWith the heating memecoin economy on the Bitcoin blockchain, the network surpassed 5 million Ordinals inscriptions on Tuesday, according to data from Dune Analytics.\n\nThe congestion may have lengthened waiting times for Bitcoin users, but Luxor Technologies’ Harper said that the BRC-20 standard essentially doubled miner revenue.\n\n“Surging fees will price out some transactions for sure, but I doubt that this BRC-20 minting mania will last too much longer. Fees may become elevated like this from time to time with different inscription mints or other demands for block space, but they will revert to the mean eventually,” wrote Harper.\n\nNazar Khan, the chief operating officer and chief technology officer of U.S.-based Bitcoin mining company TeraWulf, also expects transaction fees to return to normal in the short term.\n\n“While we expect transaction fees to return to lower levels in the next couple of weeks, we believe this episode highlights how varied the use case for the Bitcoin network can be over time. Whatever the short-term impacts of surging transaction fees may be today, Bitcoin is the most secure and robust network that exists and will continue to attract increasing levels of activity,” added Khan.\n\nEnough memes for Bitcoin?\n\nWhile miners welcomed the revenue surge, some Bitcoin developers are campaigning to phase out Ordinals and BRC-20 tokens from the network.\n\n“Action should have been taken months ago. Spam filtration has been a standard part of Bitcoin Core since day 1. It’s a mistake that the existing filters weren’t extended to Taproot transactions. We can address that, or try a more narrow approach like OP_RETURN (ie, what “Ordisrespector” does). Since this is a bugfix, it doesn’t really even need to wait for a major release,” said Bitcoin Core developer Luke Dashjr in an email dated May 8.\n\nNFT supporters, including Washington Sanchez, the NFT product lead at U.S.-based cryptocurrency exchange Kraken, brushed off Dashjr’s threat on social media.\n\n“Luke is waging a 1 man jihad against Ordinals, I doubt the other devs will take him seriously based on their precious comments that Bitcoin was working as expected if people are submitting valid transactions,” tweeted Sanchez.\n\nHowever, online discussions show that Dashjr has some support from the Bitcoin community.\n\n“[Bitcoin] was not originally intended to support tokens or smart contracts,” one user wrote on bitcointalk.org, an online cryptocurrency forum launched by pseudonymous Bitcoin founder Satoshi Nakamoto. “These changes are breaking the network and eroding the years of trust that Bitcoin has created.”\n\nSee related article: Bitcoin’s mempool congestion eases after millionth Ordinals inscription"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctd2lsbC1sb3dlci1pbnRlcmVzdC1yYXRlcy1iZW5lZml0LWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "How will lower interest rates benefit Bitcoin? - Cointelegraph",
        "content": "Macro Markets, hosted by crypto analyst Marcel Pechman, airs every Friday on the Cointelegraph Markets & Research YouTube channel and explains complex concepts in layperson’s terms, focusing on the cause and effect of traditional financial events on day-to-day crypto activity.\n\nToday’s show starts by discussing the economic crisis in Argentina, a Latin American country that is experiencing hyperinflation. After years of populist measures, its local currency, the peso, saw its value go down by 70% in two years. The government’s overspending caused another issue: a lack of United States dollars for the government and companies to pay for imports and remittances. But what does that mean for the U.S. dollar, Bitcoin (BTC) and gold?\n\nAccording to Pechman, gold poses serious problems, as there is no easy way to ensure whether or not the precious metal is fake, and it doesn’t actually work for remittances. Therefore, dollars and euros are the preferred means of savings and exchange for those facing a weak domestic currency.\n\nPechman proceeds to explain how fintechs’ costs and government control limit their potential in Argentina, and why stablecoins are the preferred vehicle for remittances. On the other hand, the analyst shows why cryptocurrencies fail to attract people in those fragile economies, including El Salvador.\n\nThe next segment of Macro Markets focuses on the Federal Deposit Insurance Corporation (FDIC). Reuters reported that the 113 biggest banks in the U.S. will have to cover the recent FDIC loss of $16 billion caused by saving failed financial institutions. Consequently, there’s a cascading effect as the remaining institutions are obligated to cover the losses. Pechman mentions how the Federal Reserve will eventually reduce interest rates and benefit risk-on assets, including Bitcoin.\n\nIf you are looking for exclusive and valuable content provided by leading crypto analysts and experts, make sure to subscribe to the Cointelegraph Markets & Research YouTube channel. Join us at Macro Markets every Friday."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmFiYzI3LmNvbS9wZW5uc3lsdmFuaWEvcGVubnN5bHZhbmlhLW1hbi1sb3Nlcy01MGstaW4tYml0Y29pbi1zY2FtL9IBUmh0dHBzOi8vd3d3LmFiYzI3LmNvbS9wZW5uc3lsdmFuaWEvcGVubnN5bHZhbmlhLW1hbi1sb3Nlcy01MGstaW4tYml0Y29pbi1zY2FtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Pennsylvania man loses $50K in Bitcoin scam - ABC27",
        "content": "(WJET/WFXP/YourErie.com) — A Forest County resident was the victim of a crypto ATM scam that lost him tens of thousands of dollars.\n\nAccording to a Pennsylvania State Police (PSP) report, a 67-year-old man, of Tionesta, Pa., was reportedly scammed out of $50,000 worth of Bitcoin from a Bitcoin ATM machine.\n\nA scammer reportedly had told the victim to purchase the amount from the crypto ATM machine, then to scan a QR code that was linked to the suspected scammer’s account.\n\nThe victim lost the entire $50,000 Bitcoin purchase once the transfer went through. Police continue to investigate the situation.\n\nPSP reminds the public to watch for Phishing scams and always to stop and think before clicking on any links sent by email or text.\n\nLearn more about crypto ATM and Phishing scams and how to report them on the Federal Trade Commission’s website."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRpdmUtbGlxdWlkYXRlcy0xMDBtLWJ0Yy1mdXR1cmVzLXRyYWRlcnMtYnVsbGlzaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin's dive under $27K liquidates $100M — So why aren't margin traders flipping bearish? - Cointelegraph",
        "content": "Bitcoin’s price (BTC) broke below its 55-day support at $27,000 on May 12. As a result, the two-day, 7% correction to $26,155 caused $100 million worth of long BTC futures contracts to be liquidated.\n\nHowever, Bitcoin margin and futures markets displayed strength during the down-move, fueling hope of a recovery toward $28,000.\n\nRegulatory pressure, stronger U.S. dollar bite\n\nRegulatory uncertainty in the United States significantly increased after Bitcoin miner Marathon Digital received another subpoena. The publicly traded mining company informed investors on May 10 that it received a subpoena from the U.S. Securities and Exchange Commission (SEC) concerning whether it may have violated federal securities laws, among other things, by using related-party transactions.\n\nFurthermore, there’s the additional risk of the 627,522 Bitcoin held by the Grayscale Bitcoin Trust, which has been trading at a steep discount for over a year as Grayscale’s holding company, Digital Currency Group (DCG), struggles with some failing subsidiaries. DCG’s crypto lending and trading firm, Genesis Capital, filed for Chapter 11 bankruptcy protection in January.\n\nDespite having separate corporate structures, Genesis had “intercompany obligations” with holding company DCG, so the consequences for the administration of the Grayscale funds are unknown. Additionally, the group reportedly owes Gemini’s clients about $900 million, and the U.S. SEC charged Genesis and Gemini in January.\n\nBitcoin’s 7.2% correction happened as the U.S. Dollar Strength Index (DXY), which measures the U.S. currency against a basket of foreign exchanges, displayed strength. The indicator reached 101 on May 8, nearing its 12-month low, a sign of low confidence in the government’s ability to curb inflation while simultaneously managing to increase the debt limit.\n\nHistorically, there has been an inverse correlation between the DXY index and risk-on assets such as Bitcoin, given that a weaker dollar tends to drive demand for alternative stores of value and scarce assets.\n\nLet’s look at derivatives metrics to better understand how professional traders are positioned in the current market environment.\n\nBitcoin margin market traders slightly less optimistic\n\nMargin markets provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.\n\nOKX, for instance, provides a margin lending indicator based on the stablecoin/BTC ratio. Traders can increase their exposure by borrowing stablecoins to buy Bitcoin. On the other hand, Bitcoin borrowers can only bet on the decline of the cryptocurrency’s price.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe above chart shows that OKX traders’ margin lending ratio decreased between May 8 and May 11. Still, that is not concerning, given that those traders remain favoring bullish strategies as the stablecoin (long) demand currently surpasses the BTC (short) demand by a factor of 18, which is healthy.\n\nRelated: Texas votes to add crypto to state’s Bill of Rights\n\nNo signs of panic selling after Bitcoin price crash\n\nTo exclude externalities that might have solely impacted the margin markets, traders should analyze the long-to-short metric. The metric gathers data from exchange clients’ positions on spot, perpetual, and quarterly futures contracts, thus offering better information on how pro traders are positioned.\n\nThere are occasional methodological discrepancies between different exchanges, so readers should monitor changes instead of absolute figures.\n\nExchanges’ top traders Bitcoin long-to-short ratio. Source: Coinglass\n\nEven though Bitcoin broke below the $28,000 support, professional traders have increased their leveraged long positions using futures, according to the long-to-short indicator.\n\nAt crypto exchange OKX, the long-to-short ratio increased from 0.92 on May 8 to 1.01 on May 12. Meanwhile, at Binance, the long-to-short ratio stabilized at 1.13, indicating there was no shift to a bearish position from whales and market makers.\n\nTherefore, despite the 12% price decline from a high of $29,865 on May 6, traders using margin and futures contracts did not abandon their bullish stance. The movement indicates confidence that Bitcoin is more likely to reclaim $28,000 than succumb to the next support level near $24,500.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kb24tdC1zaG9ydC13aGVuLWl0LXMtZGFyay1ncmVlbi1ob3ctdG8tdHJhZGUtdGhlLTIwMjQtYml0Y29pbi1oYWx2aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "'Don't short when it's dark green': How to trade the 2024 Bitcoin halving - Cointelegraph",
        "content": "Bitcoin (BTC) is entering prime “buy the dip” territory as the clock ticks down to the 2024 block subsidy halving.\n\nThat is the conclusion of several well-known market participants this month, with Bitcoin just one year away from its “very interesting” next halving.\n\nBitcoin vs. the halving: Time to buy?\n\nBitcoin halving cycles are known to follow patterns when it comes to price activity in a given period.\n\nThese four-year “epochs” have so far contained a macro high and macro low for BTC price, with those events likewise four years apart from one another.\n\nWhat’s more, in each cycle, the macro low has tended to occur a little over one year before the next halving. For longtime Bitcoin figures, including crypto media guru Pete Rizzo, there is thus little reason to believe that the future will be substantially different.\n\n“A small reminder the world’s most valuable money is only designed to get more scarce. Plan accordingly,” he wrote in part of a tweet on May 12.\n\nRizzo was celebrating the three-year anniversary of the 2020 halving, and an accompanying chart underscored BTC price behavior relative to how many months remained before a halving event.\n\nBTC/USD monthly chart with time to halvings marked. Source: Pete Rizzo/Twitter\n\nCommenting, investor and entrepreneur Alistair Milne went further, suggesting that for those looking to profit from BTC exposure, the time to buy is now, while the months before the halving are less beneficial entry points.\n\n“Don’t short when it’s dark green and be all in before it’s blue…,” he summarized the chart’s contents.\n\nPlanB: 2024 halving “not priced in”\n\nEarlier in the month, meanwhile, another popular yet controversial Bitcoin industry figure used the same halving narrative to insist that the price cycles were not a matter of chance.\n\nRelated: Bitcoin Halving: How it works and why it matters\n\nIn a post of his own, PlanB, the pseudonymous creator of the Stock-to-Flow (S2F) family of Bitcoin price forecasting models, claimed that half of market participants considered the relationship between halvings and price was random.\n\nHis comments came within the context of how halvings relate to S2F, a theory that itself continues to see widespread criticism as a result of missed price targets from 2021 onward.\n\nNevertheless, for PlanB, too, BTC/USD remains low, with the upcoming halving not yet given sufficient market appreciation.\n\n“Why is bitcoin S2F/halving not priced in? Because ~50% thinks the BTC price jumps after last 3 halvings (red) are a coincidence,” he wrote alongside an illustrative chart.\n\n“Halvings are key to S2F, but these critics focus on auto-correlation between halvings and conclude there is no relation between S2F/halvings and price. I disagree, obviously. 2024 halving will be very interesting!”\n\nBitcoin Stock-to-Flow chart. Source: PlanB/Twitter\n\nIn a subsequent discussion, PlanB called the idea of Bitcoin price increasing as halvings decrease available supply, or “flow,” a “no-brainer.”\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnJlYWx2aXNpb24uY29tL3Nob3dzL3Jhb3VsLXBhbC1hZHZlbnR1cmVzLWluLWNyeXB0by92aWRlb3MvYml0Y29pbi1hbmQtdGhlLWJhbmtpbmctY3Jpc2lzLXFwSzHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin and the Banking Crisis - Real Vision",
        "content": "Access Crypto Content\n\nThis content is reserved for the thousands of visionaries supporting the financial revolution. We'd love for you to join us. Interested?\n\nJoin Now\n\nAlready have an account? Log In"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZHJvcHMtbGlxdWlkaXR5LWNvbmNlcm5zLWV0aGVyLWRpcHMv0gFFaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1kcm9wcy1saXF1aWRpdHktY29uY2VybnMtZXRoZXItZGlwcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether drop on liquidity concerns, Polkadot gains - Forkast News",
        "content": "Bitcoin fell on Thursday morning in Asia to trade around the US$27,500 mark, after briefly breaching US$28,000 on Wednesday as U.S. inflation slowed. Liquidity is becoming a concern after major market makers Jane Street Group and Jump Crypto quit cryptocurrency trading in the U.S. citing unfavorable regulations. Ether led the losers in the top 10 non-stablecoin cryptocurrencies, while Pokadot led the winners. U.S. equity futures traded higher as inflation eased in April, adding to speculation the Federal Reserve may pause its interest rate hikes in June.\n\nSee related article: Hong Kong will have ‘tight’ crypto regulation, says HKMA chief Eddie Yue\n\nBitcoin, Ether lose ground\n\nImage: Envato Elements\n\nBitcoin dropped 0.60% to US$27,554 in the 24 hours to 08:30 a.m. in Hong Kong, according to CoinMarketCap data, logging a weekly loss of 5.24%.\n\nThe world’s largest cryptocurrency briefly breached the US$28,000 ceiling on Wednesday as crypto markets rallied on a slower U.S. inflation rate, but soon fell back amid concerns about network congestion and liquidity.\n\nJane Street Group and Jump Crypto, two leading market makers, will quit digital asset trading in the U.S. as regulators crack down on the industry, according to a Bloomberg report citing unnamed sources.\n\n“After the collapse of several crypto-friendly banks and FTX it seems like the SEC (regulator) is unsure what leg to stand on and for sure the stance has become more hostile to cryptos and the entire financial and technical ecosystem surrounding it,” Mikkel Morch, chairman and non-executive director at digital asset investment fund ARK36, said in an email.\n\nAs of 08:30 a.m. in Hong Kong, investors liquidated US$41.28 million of Bitcoin positions, almost 75% of which were long positions – or bets that the price of Bitcoin would rise, according to market data tracker CryptoMeter.io.\n\nEther fell 0.84% to US$1,837, down 3.49% for the week. The token neared US$1,900 on Wednesday before falling back to as low as US$1,795.\n\nOther top 10 non-stablecoin cryptocurrencies traded mixed, with Polkadot’s Dot token leading the winners with a gain of 1.91% to US$5.45. However, it’s down 5.43% for the week. Web3 Foundation, the organization behind the Polygon blockchain, testified before the U.S. Congress on Wednesday on digital asset regulations, calling for a clearer rules of the road.\n\nThe total crypto market capitalization dipped 0.30% in the past 24 hours to US$1.14 trillion. The total trading volume rose 43.61% to US$45.84 billion.\n\nNFT index dips\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.67% to 3,440.57 in the 24 hours to 10:00 a.m. in Hong Kong, losing 6.15% for the week.\n\nMilady Maker, an Ethereum-based NFT collection, topped the 24-hour sales across the market after Elon Musk, Chief Executive Officer of Twitter and Tesla, tweeted on Wednesday an image containing the NFT.\n\nMilady Maker’s sales totaled over US$9.54 million in the past 24 hours, a surge of over 3,700%, according to data by CryptoSlam, with its floor price jumping 38.4% to 4.69 ETH (US$8,609), according to CoinGecko.\n\nBoosted by the rise of Milady Maker, NFT sales on the Ethereum blockchain jumped 89.41% in the past 24 hours to US$34.25 million, according to CryptoSlam. The average transaction fees on Ethereum came in at US$19.70 on Wednesday, a drop from its 11-month peak of US$27.68 on Saturday, according to blockchain data platform BitInfoCharts.\n\nEquities futures rise as inflation slows\n\nImage: Envato Elements\n\nU.S. stock futures moved higher as of 11:00 a.m. in Hong Kong. The Dow Jones Industrial Average futures edged up 0.04%. The S&P 500 futures gained 0.19%. And the Nasdaq Composite futures added 0.16%.\n\nThe three U.S. indexes closed mixed in regular trading on Wednesday as investors digested the U.S. consumer price index report that showed annual inflation unexpectedly slowed to 4.9% in April from 5% in March, the slowest pace in the past two years. The moderate cooling of inflation indicates the Federal Reserve may take a pause in its more than year-long cycle of raising rates to slow inflation.\n\nOn talks to raise the U.S. debt ceiling to keep the government solvent, President Joe Biden warned on Wednesday that a federal government default could trigger a global recession, according to a Bloomberg report. Biden is set to continue talks to raise the debt ceiling on Friday, with congressional Republicans demanding more budget cuts in any agreement.\n\nOn other data releases, the U.S. producer price index and jobless claims come out Thursday to offer further insights into the health of the economy.\n\nThe Federal Reserve will meet on June 14 to decide its next move on interest rates, which are now between 5 and 5.25%, the highest since 2006. The CME FedWatch Tool predicts a 96.1% chance the Fed will keep rates unchanged in June, and a 3.9% chance for another 25 basis-point rate hike, down from 21.2% on Wednesday.\n\n(Updates with equity section.)\n\nSee related article: Goldman Sachs, Microsoft, Moody’s, others to join new financial industry blockchain"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYWJjbmV3cy5nby5jb20vQnVzaW5lc3MvdmlkZW8vYml0Y29pbi1wcmljZXMtc3VyZ2luZy05OTI2MjYyMdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Video Bitcoin prices surging - ABC News",
        "content": "2020’s DNC and RNC are different than any before"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LnVuaWxhZC5jb20vdGVjaG5vbG9neS9iaXRjb2luLXVzZXItcGxlYS0xNS1taWxsaW9uLXdyb25nLXdhbGxldC00NTUwNDctMjAyMzA1MTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "User puts out desperate plea after accidentally sending $1.5 million in Bitcoin to 'Jared from Subway' - UNILAD",
        "content": "With the cost of living crisis, it’s more important than ever to watch the pennies.\n\nHowever, one unlucky cryptocurrency user accidentally sent $1.5 million in Bitcoin to someone with the nickname ‘jaredfromsubway’ – in several transactions.\n\nIt seems the mistake has cost the user dearly, as they’ve now gone viral for their panicked message to ‘Jared’.\n\nAdvert 10\n\nThe bizarre Bitcoin story has gone viral online. Credit: Twitter/@0xCuteSocks\n\nIn an undisclosed Discord server, the user (known as ‘camper’) reached out and pleaded with the Bitcoin user to return the cryptocurrency.\n\nThey wrote: “Jared from Subway, if you are reading this please help. I sent you by mistake tokens for about $1.5 m. Is there any possibility to get them back?”\n\nThe lengthy post continued, with the user sounding like they were involved in some very shady business (eeek).\n\nAdvert 10\n\nIt read: “Or my investors would kill me. Please help, Jared! I want to live,” wrote the author of the mistake, before providing the details of the transactions.\n\nShockingly though, ‘Jared’ initially remained silent and seemingly pocketed the funds for himself.\n\nThis is according to Twitter user @0xCuteSocks, who first shared the strange post on social media.\n\nThe user's desperate plea was initially shared on Discord. Credit: Twitter/@0xCuteSocks\n\nAdvert 10\n\nDespite being originally posted on the private server, the request has now gone viral with it being seen over 1.3 million times on Twitter.\n\nThe internet is continuing to react to the unlucky Bitcoin user, with many arguing that this is why they avoid cryptocurrency altogether.\n\nOne shocked tweet read: “It's incredible how much trust people put in these decentralized systems, but it's also a reminder to always double-check the wallet address before sending large amounts of money!”\n\nHowever, they did have some empathy for the user, writing: “I hope the person who made the mistake is able to get their funds back.”\n\nAdvert 10\n\nAnother user agreed and vented their frustration, writing: “How do you make multiple accidental transactions to the wrong address? Like you should check after the first one?”\n\nJared hadn't pocketed the funds for himself, thankfully. Credit: Twitter/@0xCuteSocks\n\nHowever, it seems the Bitcoin user’s luck has finally turned around.\n\nIn a follow-up tweet, @0xCuteSocks revealed that ‘Jared’ had returned the eye-watering sum later on.\n\nAdvert 10\n\nThey shared a screenshot of the Discord server, which read: “My story finished with happy end. Jared is a very good person. All money were refund.”\n\nThe user also explained how the transactions had gone wrong, adding that they ‘misstyped’ the address where the tokens were being transferred to."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvdGV0aGVyLWhvbGRzLW1vcmUtZ29sZC10aGFuLWJpdGNvaW4tYXMtcTEtcHJvZml0LXN3ZWxscy10by0xNDhiL9IBc2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvdGV0aGVyLWhvbGRzLW1vcmUtZ29sZC10aGFuLWJpdGNvaW4tYXMtcTEtcHJvZml0LXN3ZWxscy10by0xNDhiL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Tether Holds More Gold than Bitcoin as Q1 Profit Swells to $1.48B - Finance Magnates",
        "content": "Tether, the largest issuer of stablecoins, closed the first quarter of 2023 with a net profit of $1.48 billion, which doubled from the $700 million it had generated in the previous quarter. The company confirmed that its token circulation also jumped 20 percent.\n\nTether Reveals Bitcoin and Gold Holdings\n\nAccording to the consolidated reserve report, signed by accounting firm BDO Italia, Tether’s total assets at the end of March stood at $81.8 billion, the majority of which are in US Treasury Bills.\n\nAdditionally, the stablecoin issuer holds $1.5 billion in Bitcoin Bitcoin While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that Read this Term and $3.4 billion in gold on its balance sheet, 2 percent and 4 percent of its total reserve, respectively. It is the first time Tether has revealed its Bitcoin and gold holdings.\n\n“We continue to monitor the risk-adjusted return on all assets within our portfolio on an ongoing basis and expect to make further changes as the overall economic environment changes and the market cycle progresses as a part of our normal, ongoing risk management processes,” said Paolo Ardoino, the CTO of Tether.\n\nKeep Reading Nigeria Presses Binance amid Economic Turmoil and Detains Executives\n\nTether discloses they’re trading bitcoin. Imagine a stablecoin that’s backed by highly volatile tokens which are manipulated by… tether.\n\n\n\nTether can inflate the price of bitcoin to cover up any shortfalls. pic.twitter.com/RX6EPpiEyP — Bitfinex’ed 🔥🐧 Κασσάνδρα 🏺 (@Bitfinexed) May 10, 2023\n\nThe Largest Stablecoin Issuer\n\nTether is known for its US dollar-pegged stablecoin Stablecoin Unlike other cryptocurrencies like Bitcoin and Ethereum, stablecoins are cryptocurrencies that have been designed to keep a stable value. Placing a greater emphasis on stability over volatility can be a huge draw for some investors. Many individuals can be turned off from large swings and uncertainty presented by cryptos relative to other traditional assets.Stablecoins control for this volatility by being pegged to another cryptocurrency, fiat money, or to exchange-traded commodities, including Unlike other cryptocurrencies like Bitcoin and Ethereum, stablecoins are cryptocurrencies that have been designed to keep a stable value. Placing a greater emphasis on stability over volatility can be a huge draw for some investors. Many individuals can be turned off from large swings and uncertainty presented by cryptos relative to other traditional assets.Stablecoins control for this volatility by being pegged to another cryptocurrency, fiat money, or to exchange-traded commodities, including Read this Term, USDT, which has more than $82.6 billion in market capitalization, according to Coinmarketcap. Moreover, the company issues cryptocurrencies pegged to other currencies and gold, but their market share is only a fraction of USDT.\n\nOn top of that, the company is continuously increasing its USDT circulation. In the three-month period from January and March, Tether held about $2.44 billion in excess reserves.\n\n“Looking ahead to Q2, we have an extremely positive outlook and remain committed to transparency, which is why we have introduced new categories in the reserves’ breakdown in our quarterly report to provide even greater transparency to our users,” Ardoino added.\n\nWith the consolidated reports, Tether is now ensuring transparency in its operations. However, the company faced criticism earlier with allegations of not maintaining appropriate reserves. In 2021, Tether and its affiliate crypto exchange, Bitfinex, settled allegations of misleading statements brought by the US Commodity Futures Trading Commission, paying $42.5 million.\n\nZenfinex, Trading 212 executives; IG's warning on TRY; read today's news nuggets."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTEvYml0Y29pbi1wcmljZXMtcmV0cmFjZS1hcy10cmFkZXJzLXdpdGgtdmFyeWluZy10aW1lLWhvcml6b25zLWpvY2tleS1mb3ItcG9zaXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin Prices Retrace as Traders With Varying Time Horizons Jockey for Position - CoinDesk",
        "content": "In the aggregate, whales are removing coins from exchanges. This trend suggests bullishness. However, among whales with at least 100,000 bitcoin, their overall supply increased 2.5% between March and May, but has been declining since May 1."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJlYXJzLW5lZWQtYnRjLXByaWNlLXRvLWdvLWJlbG93LTI3ay1haGVhZC1vZi1mcmlkYXktcy05MDBtLW9wdGlvbnMtZXhwaXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin bears need BTC price to go below $27K ahead of Friday's $900M options expiry - Cointelegraph",
        "content": "The $900 million Bitcoin weekly options expiry on May 12 might play a decisive role in determining whether the price will succumb to falling below $27,000.\n\nBitcoin price rejected again at $30,000\n\nBitcoin (BTC) bears will try to take advantage of macroeconomic headwinds, Silk Road coins' FUD — fear, uncertainty and doubt — and uncertainty caused by Bitcoin’s transaction fee spike to pull Bitcoin's price down in the next few days.\n\nBitcoin four-hour price movements during option expiries. Source: TradingView\n\nThe BTC/USD pair broke above $29,800 on May 6, but the tide quickly changed as the resistance proved stronger than anticipated.\n\nThe subsequent 8.2% two-day correction tested $27,400 support, favoring the thesis of sideways trading as investors evaluate the economic crisis dynamic and its potential impact on cryptocurrencies.\n\nMeanwhile, Berkshire Hathaway owner and billionaire investor Warren Buffett is no longer optimistic about U.S. economic growth. Such a pessimistic scenario for the global economy might explain why some Bitcoin traders decided to reduce exposure over the past week, greatly reducing the odds of breaking $30,000.\n\nBitcoin options: Bulls were excessively optimistic\n\nThe open interest for the May 12 options expiry is $900 million, but the actual figure will be lower since bears were expecting sub-$28,000 price levels.\n\nThese traders got excessively optimistic after Bitcoin’s price rallied 11.2% between April 9 and April 14, testing the $31,000 resistance.\n\nBitcoin options aggregate open interest for May 12. Source: CoinGlass\n\nThe 1.65 call-to-put ratio reflects the imbalance between the $560 million in call (buy) open interest and the $340 million in put (sell) options.\n\nBut if Bitcoin’s price remains near $27,500 at 8:00 am UTC on May 12, only $11 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $28,000 or $29,000 is useless if BTC trades below that level on expiry.\n\nBitcoin bulls aim for $28,000 to balance the scales\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on May 12 for call (bull) and put (bear) instruments varies depending on the expiry price.\n\nThe imbalance favoring each side constitutes the theoretical profit:\n\nBetween $25,000 and $27,000: 100 calls vs. 9,900 puts. Bears in total control, profiting $230 million.\n\n100 calls vs. 9,900 puts. Bears in total control, profiting $230 million. Between $27,000 and $28,000: 400 calls vs. 5,000 puts. The net result favors the put (sell) instruments by $120 million.\n\n400 calls vs. 5,000 puts. The net result favors the put (sell) instruments by $120 million. Between $28,000 and $29,000: 1,500 calls vs. 2,100 puts. The result is balanced between put and call options.\n\n1,500 calls vs. 2,100 puts. The result is balanced between put and call options. Between $29,000 and $30,000: 3,300 calls vs. 800 puts. The net result favors the call (bull) instruments by $70 million.\n\nThis crude estimate considers the call options used in bullish bets and the put options exclusively in neutral-to-bearish trades. Even so, this oversimplification disregards more complex investment strategies.\n\nFor instance, a trader could have sold a put option, effectively gaining positive exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nUltimately, after it became clear that the Bitcoin network was working as designed, the selling pressure dissipated, causing Bitcoin’s price to stabilize around $27,500. Nevertheless, traders should be cautious as the bears are still in a better position for Friday’s weekly options expiry, favoring negative price moves.\n\nRelated: PayPal’s crypto holdings increased by 56% in Q1 2023 to nearly $1B\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzExL2RldmVsb3BlcnMtZGVwbG95LXVuaXN3YXAtY29udHJhY3RzLW9uLWJpdGNvaW4tYXMtYnJjMjAtYmFzZWQtc2hpYi1wZXBlLWdhaW4tcG9wdWxhcml0eS_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8xMS9kZXZlbG9wZXJzLWRlcGxveS11bmlzd2FwLWNvbnRyYWN0cy1vbi1iaXRjb2luLWFzLWJyYzIwLWJhc2VkLXNoaWItcGVwZS1nYWluLXBvcHVsYXJpdHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Developers Deploy Uniswap Contracts on Bitcoin as BRC20-Based SHIB, PEPE Gain Popularity - CoinDesk",
        "content": "“We want to make Bitcoin as generalized as possible — usable for far more than just a currency,” said @punk3700, one of the developers at Trustless Market, in a Twitter message. “We started first with Art, then AI, and DeFi is the natural next area to add.”"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idXlpbmctYS1jYXItd2l0aC1iaXRjb2luLWdldHMtMy03bS1maW5lLXByaXNvbi10aW1lLWluLW1vcm9jY2_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Buying a car with Bitcoin gets $3.7M fine, prison time in Morocco - Cointelegraph",
        "content": "A crypto user who purchased a luxury car with Bitcoin (BTC) faces 18 months in prison and a $3.7 million fine in Morocco, which still considers the use of crypto as an illegal act.\n\nA recent report by Euronews stated the Casablanca Court of Appeal had upheld the conviction of Thomas Clausi, a 21-year-old French citizen, on charges of fraud and illegal use of cryptocurrency.\n\nAccording to Clausi’s lawyer, Mohamed Aghanaj, the court confirmed the verdict last week. This decision indicates that the Moroccan judicial system is taking a strong stance against cryptocurrency use in the country.\n\nUsing BTC to purchase a Ferrari resulted in Clausi’s arrest in 2021, as Moroccan customs deemed the use of cryptocurrency to be an unlawful transfer of funds. Clausi was imprisoned in December 2021 on charges of “fraud” and “use of foreign currency for payment within Moroccan borders,” with a prison sentence and a fine handed down in October of the same year.\n\n| Un français a été condamné par la Chambre criminelle du tribunal de Casablanca à une peine de 18 mois de prison assortie d’une amende de 3,4 millions d’euros.\n\nIl a été condamné pour escroquerie et d’usage illégal de crypto-monnaie.\n\nIl a vendu sa Ferrari en échange de pic.twitter.com/ubk3m1p9UJ — Moroccan History ۞ (@MoroccanSories) October 21, 2022\n\nThe legal case against Clausi began after a woman, who lived in Casablanca, accused him of “fraud” after exchanging the luxury car for a Bitcoin payment of around $437,000.\n\nAccording to Aghanaj, Clausi still has a month left to serve in prison.\n\nRelated: Porsche NFT trading volume nears $5M despite launch woes, minting halt\n\nDespite its illegal status in the country, Morocco was hailed as the number one in BTC trading across North Africa in 2021. According to Triple A, a Singaporean cryptocurrency provider and aggregator, about 900,000 individuals — approximately 2.4% of Morocco’s population — currently possess cryptocurrency.\n\nMore than a year later, the country has started to finalize a crypto regulatory framework that will legally define crypto within its market, according to its central bank.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin: The Silk Road hacker’s story"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2Utcmlza3MtMjdrLWxvc3MtYXMtYml0Y29pbi10cmVuZC1saW5lcy1icmV3LWJ1bGxpc2gtY3Jvc3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "BTC price risks $27K loss as Bitcoin trend lines brew 'bullish cross' - Cointelegraph",
        "content": "Bitcoin (BTC) headed toward $27,000 after the May 11 Wall Street open as bulls failed to show strength.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC price “rolls over” after brief recovery\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it risked a further loss of support.\n\nAfter a modest recovery from local lows seen the day prior, the pair remained weak, even as new United States macro data offered bullish cues.\n\n“Dump was retraced but then price quickly rolled over again,” popular trader Daan Crypto Trades summarized.\n\n“We’re still trading at the range lows and until broken I think shorts aren’t great R:R. Bulls need to show strength by retaking the daily open for me to consider a possible reversal scenario.”\n\nAs Cointelegraph reported earlier, market participants continued to prepare downside targets, with many focusing on the area around $25,000.\n\n“I remain short personally, but for anyone not in a short yet i would wait until we lose $27,000 then look to short this support zone loss,” fellow trader Crypto Tony continued.\n\n“For now we are holding it so no reason to short just yet.”\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nAmong the bullish voices on the day was trader and analyst Moustache, who in an optimistic analysis focused on longer-term price trends.\n\nSpecifically, two moving averages, the 20-week and 200-week, were about to stage a form of “golden cross,” wiping out their interplay from September 2022, months before Bitcoin’s latest cycle low.\n\n“In September 2022, there was a bearish cross of the SMA 20/200 line for the first time on record. This gave many people the opportunity to buy $BTC at ~15k,” Moustache explained.\n\n“And now? The SMA 20/200 is about to cross bullishly. Price above blue = Always bullish (see ‘15,‘19).”\n\nBTC/USD annotated chart. Source: Moustache/Twitter\n\nU.S. data joins CPI, dealing fresh blow to inflation\n\nOn macro, meanwhile, encouraging U.S. Producer Price Index (PPI) and unemployment data gave crypto investors cause for cautious celebration.\n\nRelated: Bitcoin trader eyes $63K BTC price for new Bollinger Bands ‘breakout’\n\nJobless claims were up on the day, while PPI conformed to expectations of inflation continuing to trail off.\n\nTogether with similar signals from the Consumer Price Index (CPI) the day prior, the odds were on for interest rates to stop rising in June, financial commentator Tedtalksmacro reacted.\n\n“US unemployment claims higher to +264k and PPI in-line with consensus on the headline + core prints. More data conducive to a pause in June,” he tweeted.\n\nA further post argued that “Today’s US PPI numbers reaffirm that the path of least resistance for CPI inflation is down.”\n\nFed target rate probabilities chart. Source: CME Group\n\nThe latest readings from CME Group’s FedWatch Tool showed market consensus for a June rate hike pause at over 96%.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXR0cmV4LWFwcHJvdmVkLXRvLWJvcnJvdy03LW1pbGxpb24tYmFua3J1cHRjeS1sb2FuLWluLWJpdGNvaW4vYXJ0aWNsZXNob3cvMTAwMTQ4NzAwLmNtc9IBkAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXR0cmV4LWFwcHJvdmVkLXRvLWJvcnJvdy03LW1pbGxpb24tYmFua3J1cHRjeS1sb2FuLWluLWJpdGNvaW4vYW1wX2FydGljbGVzaG93LzEwMDE0ODcwMC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bittrex approved to borrow $7 million bankruptcy loan in bitcoin - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvLm5ld3Mvb3JkaW5hbHMtZXhwbGFpbmVkLW5ldy1lcmEtb2YtbmZ0cy1vbi1iaXRjb2luLW5ldHdvcmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ordinals explained: New era of NFTs on Bitcoin network? - crypto.news",
        "content": "The Bitcoin (BTC) network is witnessing a paradigm shift as ordinals, an advanced breed of non-fungible tokens (NFTs), rapidly gain traction within the crypto sphere. April 2023 saw the daily ordinals inscriptions record smashed several times, illustrating the escalating curiosity surrounding these digital assets. While ordinals may create new opportunities for the Bitcoin network, skeptics raise concerns about potential negative consequences.\n\nOrdinals, a class of digital assets closely related to non-fungible tokens (NFTs), are inscribed onto satoshis, the smallest denomination of bitcoin. In April, ordinals experienced a surge in popularity, accounting for a significant portion of the network fees.\n\nhttps://twitter.com/CryptoNikyous/status/1656248837986746368?s=20\n\nIn May 2023, the cumulative fees paid for ordinals over time have reached an astounding $300 million, with the majority of this expenditure occurring between April and May.\n\nOrdinals fees paid over time (Source: Dune Analytics)\n\nOrdinals gained prominence after the Taproot upgrade, which facilitated improved transaction management, privacy, and reduced transactions costs.\n\nHow do ordinals work?\n\nTo truly understand ordinals, we need to talk about satoshis. Named after bitcoin’s founder, Satoshi Nakamoto, a satoshi is the smallest fraction of bitcoin – one hundred millionth of a bitcoin, to be precise.\n\nWhat’s interesting about satoshis is that each carries a unique number, determined by the order in which it was mined. This unique number, or “ordinal,” is what gives each satoshi its identity.\n\nThink of satoshis as tiny digital canvases, each with a unique identifying number. Now, when you “inscribe” these satoshis with data – text, images, audio, or more – they transform into unique digital assets, which can be used in numerous applications, from games to artworks.\n\nInscription is a process of storing information on the blockchain, reflecting ownership of digital objects. When a transaction is confirmed by bitcoin miners and added to the blockchain, it’s as good as etched in stone – it becomes immutable proof of ownership.\n\nWhen you inscribe data on the Bitcoin blockchain, it gets associated with a particular satoshi, much like marking a personal item with your name. This marked satoshi then allows the transfer and assignment of ownership of that on-chain data or inscription.\n\nSo, in a nutshell, ordinals are like digital stamps, unique and secured on the Bitcoin blockchain. Using an open, permissionless protocol, you can use ordinals to create your own digital assets, owning, selling, and transferring them as you wish.\n\nNFTs vs. Bitcoin ordinals\n\nThe primary distinction between conventional NFTs and Bitcoin ordinals stems from their foundational infrastructure.\n\nYou might also like: Over 225,000 bitcoin transactions are unconfirmed as Ordinals bloat mempool\n\nTraditional NFTs, often built on Ethereum (ETH) or alternative blockchains, operate on separate layers from their base networks and frequently employ smart contracts to enable creation and transfer.\n\nBoth NFTs and ordinals function as distinctive digital assets with provable scarcity. However, what sets ordinals apart is their direct integration with the Bitcoin network, which means they share bitcoin’s security and immutability.\n\nThat said, there’s a flip side to this coin. The integration of ordinals with Bitcoin might lead to network clogging and a spike in transaction costs.\n\nYou might also like: Ordinals and meme coins cripple Bitcoin network, core developer claims\n\nThis has ignited a debate over the long-term feasibility and impact of ordinals.\n\nhttps://twitter.com/avaxbuildr/status/1655129967586320385?s=20\n\nAdvocates argue that ordinals add value by creating new use cases for the network. Conversely, critics contend that ordinals consume precious block space and inflate network fees, contradicting Bitcoin’s fundamental principles.\n\nThere are so many people advocating for an increase of the #Bitcoin block size limit to fit Ordinals inscription data and lower transaction fees.\n\n\n\nThese people probably just haven't been here long enough to know that an increase in block size was already attempted in 2017. The… pic.twitter.com/X7I1MMmouQ — Mark Harvey (@thepowerfulHRV) May 8, 2023\n\nCreating ordinals: in-house and third-party approaches\n\nThere are two approaches to creating an ordinal on the Bitcoin network: establishing an ordinals wallet and following a specific procedure or utilizing a third-party Bitcoin NFT marketplace.\n\nThe first method involves downloading Bitcoin Core, syncing the node to the blockchain, and sending satoshis to an ordinals wallet. For an in-depth guide, users can consult the Inscriptions handbook provided by the creators of the first ordinal.\n\nAlternatively, a more straightforward method involves minting an ordinal via reputable Bitcoin NFT marketplaces like Gamma, which operate similarly to Ethereum-based NFT marketplaces such as OpenSea or Magic Eden.\n\nThe growth of ordinals and its implications\n\nThe ordinals ecosystem has experienced exponential growth since its inception, with over 5 million inscriptions recorded as of May 12, 2023, as per Dune Research data.\n\nOrdinals inscriptions over time (Source: Dune Analytics)\n\nThis surge is primarily attributed to the widespread adoption of the Taproot soft fork, which has reached new all-time highs in adoption and utilization.\n\nIf you're looking to make it:\n\n\n\n* Taproot adoption is at ATH\n\n* Taproot makes it simple to productize #BTC blockspace into any protocol\n\n* People will build on #BTC\n\n* We'll see massive demand for #BTC blockspace\n\n* This blockspace will have to be sold\n\n* BRC-20s like $VMPX will pump https://t.co/DrWumi9TGp pic.twitter.com/cUR2kNOPjo — Halloween 2008 (@HalloweenIn2008) May 8, 2023\n\nConsequently, average block size and network fees have increased lately, highlighting the potential and challenges posed by the burgeoning popularity of ordinals.\n\nBTC average block size (Source: YCharts)\n\nThe environmental impact of ordinals\n\nCryptocurrencies, particularly those using proof-of-work (PoW) consensus algorithms like bitcoin, have long been a subject of environmental contention.\n\nOrdinals have rekindled the debate surrounding the Bitcoin network’s energy consumption. With a rise in transactions and demand for block space, ordinals contribute to the network’s overall energy usage.\n\nCritics argue that the environmental impact of ordinals is an unnecessary burden, given that alternative blockchain networks, such as Ethereum, have transitioned to more energy-efficient consensus algorithms like proof-of-stake (PoS).\n\nHowever, ordinals’ supporters stress the importance of leveraging the robust security and decentralization provided by the Bitcoin network, which they infer outweighs environmental concerns.\n\nMICHAEL SAYLOR‼️ Ordinals are a catalyst for #Bitcoin adoption. pic.twitter.com/SgHYH23ZOr — Bitcoin Archive (@BTC_Archive) May 10, 2023\n\nLegal and regulatory challenges\n\nLike other digital assets, ordinals may face regulatory scrutiny. Governments worldwide have adopted varied approaches to regulating cryptocurrencies and NFTs, with similar expectations for ordinals.\n\nIn some jurisdictions, ordinals may be considered digital property subject to taxation, while in others, they may face stringent regulations and restrictions, only time will tell.\n\nAs the legal landscape surrounding digital assets evolves, it is crucial for ordinals creators and users to stay informed about changing regulations and ensure compliance with applicable laws.\n\nFuture of ordinals\n\nAs ordinals continue to gain popularity, their use cases and applications are likely to extend beyond digital art and collectibles.\n\nBitcoin Ordinals are not a \"fad.\"\n\n\n\nThey cleared the cupcake phase of attention for me. It was the right time to jump in and besides my trust in ZK’s insight, what the brand had to offer was more than just one person.\n\n\n\n▸Brand Alignment\n\n▸Marketing\n\n▸Community — Minh (@MINHxDYNASTY) May 3, 2023\n\nIndustries such as gaming, real estate, and intellectual property could benefit from the properties of ordinals, opening up new possibilities for the Bitcoin ecosystem.\n\nOngoing developments in the Bitcoin space, including Lightning Network upgrades and potential protocol enhancements, could alleviate some concerns surrounding network congestion and scalability. This, in turn, could pave the way for broader adoption and acceptance of ordinals in the future.\n\nFAQs\n\nWhat are ordinals? Ordinals are non-fungible tokens (NFTs) built on the Bitcoin network. They enable the creation, ownership, and transfer of unique digital assets, such as digital art, collectibles, and other forms of digital property. How are ordinals different from traditional NFTs? While the core concept of representing unique digital assets remains the same, ordinals are built on the Bitcoin network, leveraging its security and decentralized nature. Traditional NFTs, on the other hand, are predominantly built on Ethereum or other blockchain networks. What are the use cases for ordinals? Besides digital art and collectibles, ordinals have the potential to be utilized in various industries, including gaming, real estate, intellectual property, and even supply chain management, as a means of verifying authenticity and provenance. How do ordinals impact the Bitcoin network? As demand for ordinals increases, the competition for block space on the Bitcoin network can lead to higher transaction fees and longer confirmation times. However, ongoing developments like the Lightning Network and other protocol improvements may help address these issues in the future. Are ordinals environmentally friendly? The environmental impact of ordinals is a topic of debate, as they contribute to the overall energy consumption of the Bitcoin network, which uses the energy-intensive proof-of-work (PoW) consensus algorithm. Critics argue that more energy-efficient alternatives like proof-of-stake (PoS) should be pursued instead. However, proponents emphasize the security and decentralization benefits provided by the Bitcoin network. What is the future of ordinals? The future of ordinals is uncertain, with potential for growth in various industries and the possibility of technological advancements addressing current limitations. As the crypto ecosystem continues to evolve, the true potential of ordinals and their role in the world of digital assets will gradually become clearer.\n\nFollow Us on Google News"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctZXhjaGFuZ2VzLWFkanVzdC1iaXRjb2luLXdpdGhkcmF3YWwtZmVlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "'Memepool' full: Here's how exchanges adjust Bitcoin withdrawal fees - Cointelegraph",
        "content": "Amid the ongoing spike in Bitcoin (BTC) transaction fees, some cryptocurrency exchanges have moved to adjust the cost of withdrawing BTC from their platforms.\n\nThe United States-based exchange Kraken has increased Bitcoin withdrawal fees to match the current fees on-chain, the company’s customer support manager wrote on Reddit on May 10.\n\n“This helps ensure withdrawals are processed on-chain in a timely manner,” the support manager noted.\n\nKraken’s representative also referred to the company’s public list of cryptocurrency withdrawal fees and minimum withdrawal amounts. According to the data, Kraken charges 0.00035 BTC, roughly $10, for a Bitcoin withdrawal, with a minimum amount of 0.0005 BTC, roughly $13.\n\nKraken Support on increasing BTC fees. Source: Reddit\n\nThe minimum BTC withdrawal amount on the Lightning Network (LN) also significantly differs from non-Lightning BTC, starting from as low as 0.00001 BTC, less than $1.\n\nThe support manager also advised customers to consider using the Lightning Network as an alternative. Adopted by Kraken in March 2022, the LN option allows users to withdraw BTC from the platform free of charge.\n\nBitcoin withdrawal fees and minimum withdrawal amounts on Kraken. Source: Kraken\n\nKraken’s public withdrawal fees are significantly less than other major exchanges. Crypto exchange OKX charges between 0.00096 BTC ($26) and 0.00192 BTC ($53) for a BTC withdrawal, a spokesperson for OKX told Cointelegraph. The minimum withdrawal amount is 0.001 BTC, or $27.\n\nOKX declined to comment on whether the exchange will increase withdrawal fees due to skyrocketing Bitcoin transaction costs. The platform also implemented the LN in 2022.\n\nHowever, Kraken isn’t the only exchange that has adjusted BTC withdrawal fees amid the ongoing memecoin trading frenzy.\n\nCrypto exchange KuCoin uses dynamic adjustment for BTC withdrawal fees and minimum withdrawal amounts, a spokesperson for the firm told Cointelegraph on May 10. The adjustment is based on the amount of actual processing fees on the chain so that KuCoin is “compatible with the market situation,” the representative noted.\n\n“As of this moment, our withdrawal fee is between 0.00002 and 0.001 BTC, and the minimum withdrawal amount is 0.0005 BTC,” the spokesperson stated, adding:\n\n“With regard to implementation of Lightning Network, KuCoin has not yet deployed LN, however, we will actively monitor the market and make adjustments if needed.”\n\nKuCoin’s current Bitcoin withdrawal fees are similar to those implemented on other exchanges like Huobi or Binance.\n\nRelated: Coinbase calls Pepe a ‘hate symbol,’ prompting calls to boycott the exchange\n\n“On-chain withdrawal fees are increased due to BTC network congestion. The current withdrawal fee is 0.001 BTC,” a spokesperson for Huobi told Cointelegraph on May 11. Before the increase, the original BTC withdrawal fee was 0.0004 BTC ($11), the representative added. Huobi has also not implemented Lightning yet. “The Lightning Network is currently under discussion,” the Huobi spokesperson said.\n\nAccording to public information, Binance also charges 0.001 BTC ($27) as a BTC withdrawal fee, while the minimum withdrawal amount is 0.002 BTC, roughly $55.\n\nDespite relatively expensive BTC withdrawal fees, Binance has experienced major withdrawal issues amid the ongoing mempool congestion recently. On May 8, Binance was forced to halt withdrawals twice in 12 hours, with 400,000 transactions stuck in the Bitcoin mempool. The events have pushed Binance to seriously consider implementing the LN.\n\nMultiple exchanges, including Coinbase, Bybit and Crypto.com, didn’t respond to Cointelegraph’s request for comment.\n\nMagazine: Asia Express: Justin Sun’s SUI-farming sins, PEPE’s wild run, 3AC’s oyster philosophy"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLWRpZ2l0YWwtaGl0LXdpdGgtYW5vdGhlci1zZWMtc3VicG9lbmHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin miner Marathon Digital hit with another SEC subpoena - Cointelegraph",
        "content": "Bitcoin (BTC) miner Marathon Digital has disclosed that it received another subpoena from the United States Securities and Exchange Commission relating to its 100-megawatt data center in Hardin, Montana.\n\nAccording to Marathon’s quarterly report filed May 10, it received the subpoena on April 10 “relating to, among other things, transactions with related parties” that occurred while it was creating the facility in Montana, adding:\n\n“We understand that the SEC may be investigating whether or not there may have been any violations of the federal securities law. We are cooperating with the SEC.”\n\nThe subpoena is the second one received by Marathon regarding the facility. It also received one late in the third quarter of 2021 in which the SEC ordered the firm to produce a number of related documents and communications.\n\n@SECGov has issued another subpoena to Marathon Digital.\n\n\n\nMarathon Digital is a US based #Bitcoin mining firm.\n\n\n\nThe subpoena relates to ongoing investigation tied to Marathon Digital facility in Montana.\n\n\n\nMarathon stated that #SEC may be investigating whether or not there have… — CryptoSmind (@SmindCrypto) May 11, 2023\n\nA Marathon spokesperson declined to provide any additional comments.\n\nRelated: Bitcoin ‘under siege’ by BRC-20 coins as fees soar, claims analyst\n\nOn May 9, Marathon announced that it had partnered with digital assets infrastructure company Zero Two to create a large-scale immersion Bitcoin mining facility in Abu Dhabi.\n\nThe facility would consist of two mining mines with a combined 250-megawatt capacity, and Marathon noted that while mining in Abu Dhabi would normally be infeasible, its “custom-built immersion solution” would be sufficient to ensure the mining rigs remained cool.\n\nThe announcement came just two months after the Biden administration proposed a new tax for crypto miners operating in the U.S., which would require them to pay a tax equal to 30% of the cost of any electricity used while mining for crypto.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8xMzk4NzcvYml0Y29pbi1saXF1aWRpdHktYmluYW5jZS1oYXMtbW9yZS10aGFuLWhhbHZlZC1zaW5jZS1mZWJydWFyeS1rYWlrb9IBY2h0dHBzOi8vZGVjcnlwdC5jby8xMzk4NzcvYml0Y29pbi1saXF1aWRpdHktYmluYW5jZS1oYXMtbW9yZS10aGFuLWhhbHZlZC1zaW5jZS1mZWJydWFyeS1rYWlrbz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Liquidity on Binance Has More Than Halved Since February: Kaiko - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBinance trading volumes and liquidity have been steadily declining in the first quarter of 2023 amid the spate of U.S. banking failures and after ending its zero-fee promotion.\n\nThe result?\n\nIt’s led to even more chop for the price of Bitcoin, Kaiko analyst Dessislava Aubert told Decrypt.\n\nAD\n\nAD\n\nAubert said that \"Overall, Bitcoin liquidity on Binance has more than halved relative to the start of February from around $45 million to $16 million in early May.\"\n\nThe primary reason for the decline in liquidity was the removal of Binance’s 10-month zero-fee promotion for 13 different BTC pairs, which also caused market makers to leave the platform.\n\nSpecifically, monthly trading volumes for the exchange’s most-traded pair, BTC-USDT, volume fell from $16 billion in March to $2 billion in April, said the Kaiko analyst.\n\nAubert added that the drying liquidity “has been more pronounced” after the spate of banking failures earlier this year. The collapse of two key on-ramps for the industry in Silvergate and Silicon Valley Bank also hit specific firms, including Ripple, Circle, Yuga Labs, and many others.\n\nBitcoin market liquidity and trading volume on Binance. Source: Kaiko.\n\nThe 1% market depth, a measure of liquidity calculated using the bids and asks within 1% of the mid-price, on Binance declined significantly after the banking failures.\n\nAD\n\nAD\n\nLow Bitcoin liquidity — So what?\n\nThe result of reduced liquidity and volumes on Binance has been increased volatility.\n\nKaiko’s intraday volatility metric for the 10-minute interval surged considerably around the time liquidity began dropping on Binance.\n\nBitcoin intraday volatility at 10-minute intervals. Source: Kaiko.\n\nLow-liquidity conditions mean thin order books on exchanges which provide room for wild price swings from large orders.\n\n“We have seen this with BTC's recent sudden price move which did not have a clear catalyst,” said Aubert. “Volatility is unlikely to go away especially after some larger market makers (Jane Street and Jump Crypto) revealed they were reducing down their crypto exposure.”\n\nNotably, Bitcoin’s price dropped this week despite favorable conditions such as a positive CPI report and market expectations largely inclined toward an interest rate cut in the future by the U.S. Federal Reserve.\n\nA low-interest rate environment enables cheaper debt in the economy which fuels a rise in speculative assets like Bitcoin.\n\nHowever, the asset failed to stage an uptrend likely due to poor liquidity."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWVudGVycy0yNmstYmVhcmFkaXNlLWFzLWJ0Yy1wcmljZS1hcHByb2FjaGVzLTItbW9udGgtbG93c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin enters $26K 'bearadise' as BTC price approaches 2-month lows - Cointelegraph",
        "content": "Bitcoin (BTC) neared two-month lows on May 12 amid fears that a “head-and-shoulders” pattern would put bears ahead.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalysis of BTC price: “Welcome to bearadise”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching $26,100 on Bitstamp — its lowest since March 17.\n\nDespite encouraging macroeconomic conditions for risk assets, Bitcoin failed to capitalize on the potential for gains as bid liquidity headed lower.\n\n“Welcome to bearadise,” on-chain monitoring resource Material Indicators summarized.\n\nA chart uploaded to Twitter the day before showed principal buy support now around $25,750, with BTC/USD eating liquidity higher overnight.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nOn daily timeframes, concerns among market participants thus focused on whether the pair would now stay lower after three local tops.\n\nThis “head-and-shoulders pattern,” now clearly visible on the chart, would create a negative precedent should it confirm.\n\n“We simply cannot let the #Bitcoin head and shoulders crowd win,” financial commentator Tedtalksmacro insisted.\n\n“Back above $27k things will get very interesting…”\n\nBTC/USD annotated chart with \"head and shoulders\" pattern marked. Source: Tedtalksmacro/ Twitter\n\nTrader and analyst Moustache meanwhile showed that it was already time for the key 200-week moving average (WMA) to receive a retest.\n\nA “make or break level,” the 200 WMA has served as support since mid-March.\n\n#Bitcoin (W)$BTC is currently testing the MA 200 (W). This line marked the bottom in 2015,2019 and 2020.\n\n\n\nAt the same time, $BTC is testing the middle line in the Gaussian Channel.\n\n\n\nThis is really strong support and a make it or break it level imo. pic.twitter.com/auzL125G1W — ⓗ (@el_crypto_prof) May 12, 2023\n\nAs Cointelegraph reported, multiple traders were already looking for a deeper retracement to $25,000 or lower.\n\n#BTC repeating same path\n\n\n\n25k$ seems to be the logical level everyone tends to spam the BUY button\n\n\n\nAnticipating pic.twitter.com/QUyYpOFahM — Mikybull Crypto (@MikybullCrypto) May 12, 2023\n\nThese included nominally bullish Jelle, who conceded on the day that Bitcoin may make a “last stab” at the $25,000 mark before reversing.\n\nHe noted that relative strength index (RSI) readings were not serving sellers well on low timeframes.\n\n“Bitcoin nuked straight through support, next major zone of interest is around 24-25k,” he tweeted.\n\n“RSI is failing to push into the extremes, suggesting sellers are getting exhausted. One last stab into 25k that gets quickly bought up, would make sense.”\n\nBTC/USD annotated 4-hour chart with RSI. Source: Jelle/ Twitter\n\nLongs get bolder as BTC price sinks\n\nMore confident that the worst losses would soon be over was analyst Philip Swift, co-founder of trading suite DecenTrader and creator of data resource LookIntoBitcoin.\n\nRelated: Bitcoin price can ‘easily’ hit $20K in next 4 months — Philip Swift\n\nIn a tweet, he noted that while the price has been falling, the long/short ratio has diverged, with long positions now prevalent.\n\nIm not convinced we have a major correction coming on this Bitcoin move down.\n\n\n\nNear term though it is interesting to note that the long/short ratio has been climbing as price has trended down. pic.twitter.com/sefGEi39CD — Philip Swift (@PositiveCrypto) May 12, 2023\n\nAdditional data from Coinglass put the long/short ratio at 58.7% long at the time of writing on May 12.\n\nBTC long/short ratio chart. Source: Coinglass\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZGVjcnlwdC5jby8xMzk3NDcvYml0Y29pbi1hbmQtZXRoZXJldW0tZG93bi0zLXBlcmNlbnTSAUNodHRwczovL2RlY3J5cHQuY28vMTM5NzQ3L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWRvd24tMy1wZXJjZW50P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Down 3%, Top Altcoins Fall as Market Sees Red - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) is down 2.8% over the past 24 hours, falling from a high of $28,280 to its recent low of $27,058, and settling on $27,368 at the time of writing, according to data from Coingecko.\n\nThe past seven days have seen a clear downtrend for the top cryptocurrency by market cap, with a high of $29,724 on May 5th, losing 6% on the week, and wiping out $45 billion from its market cap. The BTC market cap is currently sitting at $530 billion.\n\nEthereum, the market’s second largest cryptocurrency has also seen negative price action, with its value dropping 3.3% in the last 24 hours, trading at $1,818 at the time of writing.\n\nAD\n\nAD\n\nThese drops come amid a wider crypto market selloff, with red candles hitting major and minor altcoins. Larger cryptocurrencies such as Cardano (ADA), Dogecoin (DOGE) and Polygon (MATIC) among others are seeing losses within the 2-5% range.\n\nLitecoin (LTC) and Monero (XMR), however, are among the few that have not seen drops in their prices.\n\nAlthough the majority of losses are under 5% for major BTC, ETH and major altcoins, the past week has seen larger drops, with several of the aforementioned cryptocurrencies reaching the double digits.\n\nAccording to Coingecko, the global cryptocurrency market cap today sits at $1.2 trillion, which marks a 2.5% drop over the past 24 hours.\n\nThe sudden drop in prices could be due to several reasons. On one hand, after a few days of sky high Bitcoin fees, that saw Binance pause withdrawals, fees have dropped prompting delayed selling from market participants.\n\nAD\n\nAD\n\nDespite a momentary push higher from Bitcoin and Ethereum after April’s inflation numbers came in lower than expected, the news might have also marked a precipitous sell off from investors.\n\nAs for the broader cryptocurrency market’s losses, the majority follows Bitcoin’s lead, mimicking its price action albeit with larger price swings due to their smaller market cap."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzEyL2JpbmFuY2UtYW5ub3VuY2VzLWV4aXQtZnJvbS1jYW5hZGEtY2l0aW5nLXJlZ3VsYXRvcnktdGVuc2lvbnMv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDUvMTIvYmluYW5jZS1hbm5vdW5jZXMtZXhpdC1mcm9tLWNhbmFkYS1jaXRpbmctcmVndWxhdG9yeS10ZW5zaW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Binance Announces Exit from Canada, Citing Regulatory Tensions - CoinDesk",
        "content": "Over the past year, Binance has received increased scrutiny from North American regulators, and appears to be ramping down operations in the region. Earlier this year, Binance said it was considering severing ties with its U.S. business partners."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8xMzk3MjIvc2VjLXNlcnZlcy1iaXRjb2luLW1pbmluZy1maXJtLW1hcmF0aG9uLWRpZ2l0YWwtc3VicG9lbmEtYWdhaW7SAV5odHRwczovL2RlY3J5cHQuY28vMTM5NzIyL3NlYy1zZXJ2ZXMtYml0Y29pbi1taW5pbmctZmlybS1tYXJhdGhvbi1kaWdpdGFsLXN1YnBvZW5hLWFnYWluP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "SEC Serves Bitcoin Mining Firm Marathon Digital With Subpoena, Again - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin mining firm Marathon Digital Holdings said it received a subpoena from the U.S. Securities and Exchange Commission (SEC) related to alleged violations of securities laws.\n\n“The Company received an additional subpoena from the SEC on April 10, 2023, relating to, among other things, transactions with related parties,” Marathon said in a filing Wednesday. “We understand that the SEC may be investigating whether or not there may have been any violations of the federal securities law.”\n\nMarathon said that it's “cooperating with the SEC” on the matter, which relates to its data center facility in Hardin, Montana.\n\nAD\n\nAD\n\nThe company first revealed that it had received a subpoena from the SEC in November 2021.\n\nMarathon has specified that its “disclosure controls and procedures were not effective at the reasonable assurance level as of March 31, 2023,” with discovered material weaknesses creating “a reasonable possibility that a material misstatement to our consolidated financial statements or disclosures would not be prevented or detected on a timely basis.”\n\nAccording to the company, those material weaknesses are related to “four specific accounting areas, including consolidation, impairment of digital assets, disposal of property and equipment, and principal versus agent considerations in revenue recognition.”\n\nMarathon declined to comment.\n\nMarathon’s Q1 2023 financial results\n\nAlong with the SEC filing, Marathon has also released its first-quarter financial results.\n\nAD\n\nAD\n\nThe company said it recorded a net loss of $7.2 million, or $0.05 per share, during the fiscal quarter ended March 31, 2023, an upshot compared to a net loss of $12.9 million, or $0.12 per share, in the prior-year period ended March 31, 2022.\n\nMarathon’s revenue was $51.1 million for the quarter, slightly below $51.7 million in the previous year, with the firm saying that the “increase in Bitcoin production was more than offset by lower Bitcoin prices in the current year period.”\n\nOverall, currently boasting a hash rate of 15.4 EH/s, Marathon produced a record 2,195 Bitcoin in Q1 2023, a 74% increase from 1,259 Bitcoin in the first quarter of 2022, while also reporting gains on the sale of Bitcoin of $17.6 million as a result of the program aimed at funding the firm’s operating costs.\n\n“After weathering a tumultuous 2022 that tested the resilience of our entire industry, this year is off to a strong start as we grew our hash rate, reduced our cost to mine, and improved our balance sheet during the first quarter,” Fred Thiel, Marathon’s chairman and CEO, said in a statement.\n\nThe company added that it “remains on track” to reach the 23 EH/s hash rate goal, hoping to reach it “near the middle of this year.”\n\nMarathon's stock (MARA) was up almost 9% at $10.22 at the closing bell Wednesday."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xMS90aGUtd2hpdGUtaG91c2VzLWJpdGNvaW4tbWluaW5nLXRheC11bmRlcm1pbmVzLWl0c2VsZi_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMTEvdGhlLXdoaXRlLWhvdXNlcy1iaXRjb2luLW1pbmluZy10YXgtdW5kZXJtaW5lcy1pdHNlbGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "The White House’s Bitcoin Mining Tax Undermines Itself - CoinDesk",
        "content": "The net effect of the presence of Bitcoin miners on a modern grid is to cut off the tails of the price distribution: they scoop up cheap (or even negatively priced power) when no one is buying it – helping utilities better monetize – and they turn off when power is expensive, giving power back to households during grid scarcity events. Miners actively participate in “demand response” or “controllable load” programs in grids that have them, helping stabilize grids as they have a unique ability to react quickly to changing grid conditions and dial up and down their consumption as needed. During the grid strain last winter and in summer 2022 in Texas, miners dialed down their consumption, so energy could flow back to ordinary households. It’s no wonder that Texas governor Greg Abbott has praised miners for their benevolent presence on the ERCOT grid."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xMzk3MTMvY2xlYW5zcGFyay1leWVzLWV4cGFuc2lvbi1wbGFucy1haGVhZC1iaXRjb2luLWhhbHZpbmfSAVVodHRwczovL2RlY3J5cHQuY28vMTM5NzEzL2NsZWFuc3BhcmstZXllcy1leHBhbnNpb24tcGxhbnMtYWhlYWQtYml0Y29pbi1oYWx2aW5nP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "CleanSpark Eyes Expansion Plans Ahead of Bitcoin Halving - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWith Bitcoin prices still slumped since this time last year, CleanSpark took time during its latest earnings call to assure investors of the firm's financial health.\n\nAccording to statements provided by CleanSpark Inc., the U.S.-based Bitcoin mining company doubled the number of Bitcoin mined last quarter compared with Q2 of last year, but its revenue increased only 14%.\n\nCleanSpark's CFO Gary A. Vecchiarelli said that the stunted revenue growth was largely a result of low Bitcoin prices.\n\nAD\n\nAD\n\n\"Our revenue per Bitcoin this quarter was approximately $22,700 whereas last year, our revenue per Bitcoin was over $41,000,\" Vecchiarelli said in a conference call.\n\nHe added that the company's improved hash rate makes it \"well positioned to take advantage of even the slightest increase in bitcoin prices.\"\n\nCEO Zach Bradford was quick to bring up the next halving event too.\n\nThe halving refers to the moment when miners’ block rewards will be cut from 6.25 to 3.125 bitcoin, which is expected to occur sometime next April.\n\n\"Only the most efficient miners will have the production capacity and balance sheets to capitalize on this historic event,\" Bradford said. He added that CleanSpark's current fleet averages 31 watts of electricity per Tera hash, which he expects to bring down as low as 26 watts by the end of the year.\n\nAD\n\nAD\n\nCleanSpark and the Bitcoin halving\n\nBradford suggested that for CleanSpark the next halving is the starting line of the race and that the company is \"driving energy into our operational muscles\" in preparation for the event.\n\nCleanSpark's training regimen appears to consist mostly of adding 65,000 more mining computers to their Georgia-based facilities, as well as maintaining low energy costs and building up its Bitcoin reserves.\n\nCleanSpark is reportedly in the process of adding another 20,000 more Bitmain s19 jPro+ miners to its facility in Washington, GA in the coming months, and an additional 45,000 Bitmain XP miners to another facility in Sandersville, GA, by the end of the year.\n\nAccording to Bradford, the added miners will boost the firm's total hash rate to 15.9 EH/s.\n\nWhile bolstering its fleet will certainly improve CleanSpark's ability to rapidly mine Bitcoin, the firm is also striving “to leave the planet better than we found it.”\n\nExecuting on this value is easier said than done, however.\n\nCleanSpark boasts that its mining is largely powered by a renewable energy mix, but also notes that it can't control the energy mix available at certain sites. To make up for some of the fossil fuel power used in its facilities, CleanSpark buys \"renewable energy credits\" through programs like \"Georgia's Simple Solar.\"\n\nEnergy credit programs have, however, been criticized for not truly amounting to a reduction in fossil fuel use.\n\nAD\n\nAD"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yNzYwMC1wb2xrYWRvdC1saXRlY29pbi1yaXNlLXVwLXRvLTIvYXJ0aWNsZXNob3cvMTAwMTU1Mjc2LmNtc9IBnAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yNzYwMC1wb2xrYWRvdC1saXRlY29pbi1yaXNlLXVwLXRvLTIvYW1wX2FydGljbGVzaG93LzEwMDE1NTI3Ni5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $27,600, Polkadot, Litecoin rise up to 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading mixed on Thursday after the consumer price inflation in April rose at a slower-than-expected pace. Cardano, Solana, and Polkadot were trading with gains, while Bitcoin, Ethereum, and Polygon were trading with cuts.Bitcoin (BTC) declined 0.37% to $27,537, whereas Ethereum (ETH) was below the $1,850 level. Meanwhile, BTC volume stood at approximately $20.82 billion, rising 53.29% in the last 24 hours.\"The crypto market remained almost flat as encouraging CPI data showed that inflation is cooling down and we can expect relaxation of monetary policies in the future,\" Shivam Thakral, CEO of BuyUcoin, said.“Historically, BTC volatility increases around the inflation data release and we can see some fluctuations later today or during the week,” Thakral added.The global cryptocurrency market cap was trading lower around $1.14 trillion, falling 0.20% in the last 24 hours.The total volume in DeFi is currently 3.33 billion, 7.23% of the total crypto market 24-hour volume. The volume of all stablecoins is now $41.56 billion, which is 90.13% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $533 billion. Bitcoin’s dominance is currently 46.92%, a decrease of 0.02% over the day, according to CoinMarketCap.\"The current trading range is $27,250 to $27,700. A break of the resistance can lead to $28,050 and even $28,650. Failure to do so may result in shortening with targets of $27,450 and $27,150,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, saidRajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 42, with a neutral outlook. The Stochastic %K (14, 3, 3) at 21 and the Average Directional Index (14) at 18 indicate a Neutral outlook as well.\"\"The MACD Level (12, 26), at −168, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 0 and William's Percentage is Neutral at −77 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 1.01 hours, IST on May 11, 2023)Bitcoin $27,537 -0.37%Ethereum $1,836 -0.25%Tether $1.00 0.02% BNB $311 -0.03% XRP $0.4274 -0.17%Cardano $0.3651 0.69% Dogecoin $0.07267 -0.47%Polygon $0.8646 -1.41%Solana $20.67 0.49%Polkadot $5.45 2.15%Tron $0.6949 0.21% Litecoin $80.66 1.61%Shiba Inu $0.00000888 -0.56%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hbGxpZWQtZW5lcmd5LWNvcnAtcHJvdmlkZXMtdGhpZWwtMTgzMDAwNzIxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Allied Energy Corp Provides Update on the Thiel Well Bitcoin Mining Project with Enerhash - Yahoo Finance",
        "content": "Carrollton, Texas, --News Direct-- Allied Energy Corporation\n\nAllied Energy Corp (OTC: AGYP), a producing oil and gas company focused on the leasing and reworking of oil and gas reserves in one of the most prolific hydrocarbon area in the United States, is pleased to provide a shareholder update regarding the Company's activities partnering with Enerhash USA at the Thiel Well site in an effort to begin flare gas bitcoin mining.\n\nOn April 26th, CEO George Monteith of Allied Energy received a revised field build out report distributed by Enerhash's personal.\n\nDue to circumstances beyond the Company's control, initial target dates for the Thiel site had to be adjusted. At this time the Company is confident that all challenges have been overcome regarding the initial delays. The Company is pleased with the revised timeline and is thankful to report that thus far everything is proceeding according to plan. To date the following work has been completed:\n\nOperating permits - completed\n\nSite survey - completed\n\nSite planning - completed\n\nElevation study - completed\n\nContractor proposal for site buildout - completed\n\nAllied will update their shareholders as further developments occur with press releases and media updates on Twitter.\n\nThe initial Thiel project, if all goes as planned, is expected to take 8-10 weeks to complete. The generators and data centers will be located 150 feet south of the wellhead. A meter run will be installed just north of the generator pad. The existing water tank will be reused for discharge from the separator. The elevated pad will be constructed of compacted engineered fill to support generator weights up to 60,000 lbs. per generator and 20,000 lbs. per data center. A reinforced concrete pad will be constructed on top of the compacted engineered fill to support the generator / generators. The contractor will provide two 3-inch electrical conduits with sweeping connections from the generators to each data center pad.\n\nStory continues\n\nAllied CEO George Monteith commented: \"The Thiel is the first location where Allied will establish a bitcoin mining footprint in partnership with Enerhash. At this time, we believe that the Thiel site will be a 3-megawatt center and power three containers of bitcoin mining equipment. As per our last release investors / current shareholders can see that we are laying a broader foundation of gas well resources through our new partnership with Sloan Petroleum. Ultimately, we are focused on completing the initial 20-megawatt project with Enerhash to then set our sights toward completion of the 100-megawatt project. I am appreciative of all the hard work my team has given, we have a detailed plan and the resources to make it happen, now it is time to make the push toward mining digital currency.\"\n\nAbout Enerhash:\n\nEnerhash is an energy technology and digital infrastructure development company founded by European energy experts in 2019. Enerhash has developed projects on three continents providing renewable energy optimization and grid balancing services including New Zealand, Sweden, Hungary and now they are entering into the USA.\n\nEnerhash USA will align with energy producers as a solution to help alleviate harmful methane emissions caused by production. These solutions will monetize wasted natural gas resources to reduce emissions by eliminating routine flaring to reach ESG goals and unlock the value from stranded resources. To discover more about Enerhash USA, visit their corporate website at www.enerhashusa.com.\n\nAbout AGYP:\n\nAllied Energy Corp. is an energy development and production company acquiring oil & gas reserves in some of the most prolific hydrocarbon bearing regions of the United States. The Company specializes in the business of reworking & re-completing 'existing' oil & gas wells located in the thousands of mature oil & gas producing fields across the United States. The Company applies its knowledge, experience, and effective well-remediation technologies to achieve higher production volumes, longer well life, and more efficient recovery of the proven and available oil and gas reserves in the fields/projects in which it has acquired an ownership interest. The Company will utilize updated technologies such as hydraulic fracturing (\"fracking\"), drilling of lateral (\"horizontal\") legs in productive zones, and utilizing new cased hole electric logging to locate bypassed pays, all to enhance daily rates and oil & gas recoveries. By acquiring interests in a growing number of selected projects in various regions, Allied Energy Corp. is diversifying its exposure and effectively minimizing risk as it pursues corporate growth, top line & bottom-line revenues to the benefit of all stakeholders. There are proven, recoverable reserves contained in the many aging oil & gas fields that have been bypassed by companies moving away from these fields in search of deeper, more plentiful, but more costly reserves. The Company plans to concentrate on bypassed oil and gas as there is less competition and, as mentioned above, the costs are considerably less. Additionally, the company will acquire interests in marginal wells that can be acquired at minimal cost, of which there are 420,000 wells in the U.S. Quoting Barry Russell, President of the Independent Petroleum Association of America (\"IPAA\") - \"With approximately 20 percent of American oil production and 10 percent of American natural gas production coming from marginal wells, they are America's true strategic petroleum reserve.\"\n\nSafe Harbor Statement:\n\nThis Press Release may contain certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. The Company has tried, whenever possible, to identify these forward-looking statements using words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"plans,\" \"intends,\" \"potential\" and similar expressions. These statements reflect the Company's current beliefs and are based upon information currently available to it. Accordingly, such forward-looking statements involve known and unknown risks, uncertainties and other factors which could cause the Company's actual results, performance or achievements to differ materially from those expressed in or implied by such statements. The Company undertakes no obligation to update or advise in the event of any change, addition or alteration to the information catered in this Press Release, including such forward-looking statements.\n\nContact:\n\nAllied Energy Corporation\n\nPhone: 972-632-2393\n\nEmail: info@alliedengycorp.com\n\nTwitter: https://twitter.com/AlliedEnergyCo1\n\nEnerhash USA LLC\n\nWebsite: www.enerhashusa.com\n\nEmail: info@enerhash.com\n\nTwitter: https://twitter.com/Enerhash1\n\nLinkedin: https://www.linkedin.com/company/enerhash/\n\nContact Details\n\nAllied Energy Corporation\n\n+1 972-632-2393\n\ninfo@alliedengycorp.com\n\nView source version on newsdirect.com: https://newsdirect.com/news/allied-energy-corp-provides-update-on-the-thiel-well-bitcoin-mining-project-with-enerhash-118586261"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvaC9oeXBlcmxlZGdlci5hc3DSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Hyperledger: Open-Source Blockchain Framework and Standards - Investopedia",
        "content": "What Is Hyperledger?\n\nHyperledger is a global enterprise blockchain project that offers the necessary framework, standards, guidelines, and tools to build open-source blockchains and related applications for use across various industries. Hyperledger's projects include a variety of enterprise-ready permissioned blockchain platforms, where network participants are known to one another and therefore have an intrinsic interest in participating in the consensus-making process.\n\nUsing the available components under the Hyperledger umbrella, a business can apply various modular blockchain solutions and services to significantly improve the performance of their operations and the efficiency of their business processes.\n\nKey Takeaways Hyperledger is an open-source community focused on developing a suite of stable frameworks, tools, and libraries for permissioned, enterprise-grade blockchain deployments.\n\nIt is a global collaboration, hosted by The Linux Foundation, and includes member organizations that are leaders in finance, banking, Internet of Things, supply chains, manufacturing, and technology.\n\nSeveral sub-projects exist, including Hyperledger Fabric, Sawtooth, Composer, and Cello.\n\nHyperledger varies from Bitcoin as it is not a cryptocurrency but instead used to develop frameworks and tools.\n\nHyperledger uses a consensus layer, smart contract layer, communication layer, and API.\n\nUnderstanding Hyperledger\n\nThe Hyperledger project was created in December 2015 by the San Francisco, California–based Linux Foundation. It started with 30 member firms and has grown to about 140 member companies today.\n\nHyperledger was set up with the aim of accelerating industry-wide collaboration for developing high-performance and reliable blockchain and distributed ledger-based technology framework that could be used across the various industry sectors to enhance the efficiency, performance, and transactions of the various business processes.\n\nHyperledger is a global collaboration that includes leading businesses from the fields of finance, banking, Internet of Things (IoT), supply chain management, manufacturing and production, and technology. They include big names like Bosch, IBM, Microsoft, Oracle, Deloitte, Hitachi, American Express, JP Morgan, and Visa, in addition to a host of blockchain-based startups like ConsenSys.\n\nThe Linux Foundation has launched over 70 open sourced organizations with Hyperledger being among the fastest growing.\n\nHyperledger's Organizational Structure\n\nEssentially, Hyperledger is not an organization, a cryptocurrency network, or a blockchain system. It does not support a cryptocurrency like bitcoin, but it works by providing the necessary infrastructure and standards for developing various blockchain-based systems and applications for industrial use. Think of Hyperledger as a hub, where various individual blockchain-based projects and tools that adhere to its defined design philosophy operate under its umbrella.\n\nThe various projects include the following:\n\nHyperledger Fabric is a platform for building various blockchain-based products, solutions, and applications for business use. A now-defunct layer called Hyperledger Composer has since been replaced with Fabric as well.\n\nA now-defunct layer called Hyperledger Composer has since been replaced with Fabric as well. Hyperledger Cello allows blockchain to be used through an on-demand “as-a-service” deployment model (Blockchain-as-a-Service).\n\nHyperledger Explorer is a dashboard utility that allows for the monitoring, searching, and maintenance of blockchain developments and related data.\n\nHyperledger Burrow is a permissioned Ethereum smart-contract blockchain node that handles transactions and executes smart contract code on the Ethereum Virtual Machine (EVM). It was discontinued in 2022.\n\nHyperledger Sawtooth is an enterprise-level, permissioned, modular blockchain platform that uses an innovative Proof of Elapsed Time consensus algorithm.\n\nHyperledger Caliper is a blockchain benchmark tool that is used to evaluate the performance of a specific blockchain implementation.\n\nAll such projects under the Hyperledger umbrella follow the design methodology that supports a modular and extensible approach, interoperability, and security features. The projects remain agnostic to a particular token or cryptocurrency, though a user can create one as required.\n\nHyperledger was founded in 2016 with 30 founding corporate members.\n\nHyperledger Technology Layers\n\nIn terms of the architecture, Hyperledger uses the following key business components:\n\nThe consensus layer takes care of creating an agreement on the order and confirming the correctness of the set of transactions that constitute a block.\n\nThe smart contract layer is responsible for processing transaction requests and authorizing only valid transactions.\n\nThe communication layer takes care of peer-to-peer message transport.\n\nThe identity management services are the necessary function for maintaining and validating the identities of users and systems and establishing trust on the blockchain.\n\nThe API, or application programming interface, enables external applications and clients to interface with the blockchain.\n\nHyperledger vs. Bitcoin\n\nAs mentioned earlier, Hyperledger is vastly different from Bitcoin in that it is not a cryptocurrency. The fundamental purpose and nature of the technology is to develop enterprise-grade blockchain frameworks and tools. While Bitcoin enables peer-to-peer transactions without the need for intermediaries, Hyperledger is more geared towards facilitating business processes.\n\nHyperledger frameworks are often private, permissioned blockchains meaning permission to the network is limited to a small number of trusted users. On the other hand, Bitcoin is a public blockchain meaning anyone can participate in the network. Each uses a different form of consensus mechanism as well, as Bitcoin transactions are substantiated using a proof-of-work consensus mechanism while Hyperledger supports Byzantine fault tolerance or other algorithms.\n\nAs hinted to in the previous paragraph, Bitcoin is decentralized. This means no single entity owns it, and the system relies on the collection of the network's participants. Alternatively, Hyperledger is governed by the Linux Foundation.\n\nLast, Bitcoin is not known for its smart contracts. It's primary use is to store value, not support complex programmability to facilitate agreements. Alternatively, Hyperledger offers greater smart contract capabilities. This allows businesses to engage in complex agreements relying heavily on logic to distribute assets on a blockchain network.\n\nIs Hyperledger Better Than Ethereum? Hyperledger provides a scalable, customizable, and permissioned blockchain solution for enterprise use cases with a focus on privacy and confidentiality. Should companies feel they need greater support with open development and innovation, Ethereum may be the more suitable option that offers a more robust platform with a larger developer community.\n\nIs Hyperledger a Cryptocurrency? Hyperledger isn't a cryptocurrency, though. The Linux Foundation is hosting a collaborative open-source project with the goal of creating enterprise-grade blockchain frameworks and tools. Hyperledger does not entail the development or use of a cryptocurrency and instead focuses on creating private, permissioned blockchain networks for corporate purposes.\n\nWhat Coin Does Hyperledger Use? There is no native coin for Hyperledger. It is a blockchain framework that puts the emphasis on creating enterprise-grade solutions rather than using or creating a particular coin or cryptocurrency.\n\nThe Bottom Line\n\nThe Linux Foundation is home to the Hyperledger open-source collaborative project which aims to provide business-grade blockchain frameworks and technologies. Businesses may build private, permissioned blockchain networks for a variety of use cases. Hyperledger uses include supply chain management and smart contracts, and Hyperledger is known for its modular and adaptable solutions.\n\n"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS93aGF0LWlzLWJpdGNvaW4tZnVuZGluZy1yYXRlLWFuZC13aHktZG9lcy1pdC1tYXR0ZXItMTY2Mzc2NTEuaHRt0gFsaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L3doYXQtaXMtYml0Y29pbi1mdW5kaW5nLXJhdGUtYW5kLXdoeS1kb2VzLWl0LW1hdHRlci0xNjYzNzY1MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "What is Bitcoin funding rate and why does it matter - CNBCTV18",
        "content": "Whether you are new to cryptocurrencies or a seasoned trader, you may come across headlines such as - \"Bitcoin funding rate plunges to new lows\" or \"Bitcoin prices will surge due to low funding rate”. But what exactly is the funding rate, and why is it important to understand in the grander scheme of things? To answer this, we first need to understand how a futures contract works.\n\nPrerequisites for Understanding Bitcoin funding rates\n\nA futures contract is an agreement to buy or sell an asset at a specified price and date in the future. However, these contracts have an expiration date, after which the settlement process begins. Unlike a traditional spot market, trades are not ‘settled’ instantly in the futures market. Instead, parties will trade a contract, that defines the settlement at a future date.\n\nAlso Read: A quick guide on how to make your own meme coin\n\nTraditional futures contracts generally settle on a monthly or quarterly basis. On the settlement date, the trade is made final and the buyer must pay the seller while the seller delivers the assets to the buyer. Settlement refers to the convergence of the contract price with the spot price and the expiration of all open positions. Meanwhile, the spot price represents the price at which a particular commodity can be bought on an exchange at a given time.\n\nPerpetual futures contracts are built on the same principles as traditional futures contracts. The key distinction is that crypto exchanges such as Binance and Bitfinex offer perpetual contracts, allowing traders to hold positions without an expiry date. This eliminates the need to worry about settling the contract on a specific date.\n\nSince perpetual futures contracts don’t have expiry dates, some exchanges employ a method to ensure that future prices and index prices converge at regular intervals. This method is known as the funding rate. Based on open positions, traders either pay or receive funding.\n\nWhat is Bitcoin funding rate?\n\nAs mentioned earlier, perpetual contracts have no expiration date or settlement, allowing traders to hold positions indefinitely. This makes them unique derivative offerings for Bitcoin and other cryptocurrencies.\n\nTraders opt for perpetual contracts to speculate on whether the price of Bitcoin will rise or fall in the future. Those who hold \"long\" positions expect the price to surge in the future, while those with \"short\" positions anticipate that the price will decrease in the future.\n\nIn this context, when traders take either long or short positions, they can influence the price of the perpetual contract, causing it to deviate from the spot price. The funding rate mechanism ensures that the perpetual contract price does not diverge significantly from the spot price.\n\nFor instance, if many traders open long positions and buy a bulk of Bitcoin perpetual contracts, the prices of these contracts can surpass the spot price of Bitcoin. If this happens, the traders who went long would pay the funding rate to those who went short, to keep their positions open.\n\nThe further the perpetual contract price deviates from the spot price, the higher the funding payments they have to make to the shorting traders. This incentivization system is designed to align traders' positions in a way that expects the perpetual contract price and spot price to converge or be relatively close to each other over time.\n\nBitcoin funding rate is made up of regular payments between traders and the same prevents a lasting divergence in the price of both perpetual contract markets and spot prices. Different exchanges readjust the funding rate several times a day. For example, Binance Futures calculate the funding rate of cryptocurrencies every eight hours.\n\nImportance of Bitcoin funding rate\n\nA positive Bitcoin funding rate indicates that more traders are taking long positions and expect Bitcoin’s price to rise in the future. Meanwhile, negative funding rates suggest that more traders are taking short positions and have a bearish outlook.\n\nIt is important to stay updated on this metric because a positive or negative funding rate often precedes Bitcoin’s price movements. In simple terms, if Bitcoin’s funding rate is negative, it means that most market participants expect Bitcoin’s price to fall in the future. The same could force others to dispose of their Bitcoin holdings, leading to a fall in Bitcoin’s price. Conversely, a positive funding rate could spur buying in the market, which could send Bitcoin’s price upwards on the chart. Another thing to note here is that extremely negative and positive funding rates can sometimes act as a precursor to market reversals.\n\nConclusion\n\nAs highlighted above, the Bitcoin funding rate can be a powerful metric to determine Bitcoin’s future price. However, it must be used in conjunction with other metrics to accurately predict market direction. Therefore, investors must it at their own discretion."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tdXNlLWEtY3J5cHRvLWhhcmR3YXJlLXdhbGxldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "How to use a crypto hardware wallet - Cointelegraph",
        "content": "Investing in cryptocurrencies is widely known to be associated with risk, given the crypto market’s volatility, regulatory dilemmas and high-profile incidents of hacks, scams and fraudulent activities. According to Chainalysis’ midyear report on cryptocurrency-related crimes in 2022, approximately $1.9 billion worth of cryptocurrency was stolen in various hacking incidents and fraudulent activities compared to under $1.2 billion at the same point in 2021.\n\nSafely storing and managing cryptocurrency assets has its own set of challenges, and traders must educate themselves on the best options. As a type of cold storage, a crypto hardware wallet is a physical device designed to securely store cryptocurrencies offline, providing additional layers of security for those who hold large amounts of crypto and want to keep their holdings safe for a long time.\n\nThis article will discuss what a hardware wallet is, how to use one and the benefits of hardware wallets vs. software wallets, and it will answer the lingering question: Should you keep your crypto coins in a hardware wallet? Additionally, there’s information on the available hardware wallets to store your crypto assets safely.\n\nRelated: How to mitigate the security risks associated with crypto payments\n\nWhat is a crypto hardware wallet\n\nCrypto wallets can be broadly classified into two categories: hot wallets and cold wallets. Hot wallets are software-based crypto wallets connected to the internet, while cold wallets are physical devices. Cold wallets are considered a more secure storage option than hot software wallets, as they are not connected to the internet and do not interact with potentially vulnerable software and web viruses. Among cold wallets, hardware crypto wallets are considered one of the safest options to store cryptocurrencies.\n\nA hardware wallet is a physical device typically resembling a USB drive or a small plugin device designed to securely store cryptocurrencies and other digital assets such as nonfungible tokens (NFTs). Hardware wallets do not actually store cryptocurrency; instead, they store the private keys that allow access to the stored digital assets.\n\nOne may check the price, model and specifications as per requirement. Bitcoin (BTC); Ether (ETH); stablecoins like Tether (USDT) and USD Coin (USDC); and other popular digital assets like Ripple’s XRP (XRP) and Litecoin (LTC) are supported by most hardware wallets.\n\nHardware wallet vs Software wallet\n\nWhile software wallets allow ease and convenience, hardware wallets are known for their secure storage. A good understanding of the differences among the two options, user requirements and the level of digital asset custody needed can help users make informed choices on their wallet preference.\n\nHow does a hardware wallet work\n\nBefore understanding how a hardware wallet works, it is essential to have some know-how into crypto wallet keys.\n\nPublic and private crypto wallet keys\n\nCryptocurrency data lives on the blockchain, and crypto wallets store this information. There is no hard money like fiat, and this data on the blockchain determines one’s ownership of the assets.\n\nEvery crypto wallet has a pair of keys to access it — a private key and a public key. The public key is akin to a bank account number and is free to access by anyone. The private key, however, is like an ATM pin code and must be secured by the user.\n\nPrivate keys give access to the cryptocurrency funds and need to be safeguarded by the owner and should not be shared with anyone. They are a unique combination of letters and numbers, functioning as digital signatures or a password that grants access to and control over the cryptocurrency holdings. Hardware crypto wallets typically store these private keys, which are required for signing transactions.\n\nHardware wallet self custody\n\nWhen users hold their cryptocurrencies on a centralized exchange (CEX), they essentially transfer custody and control of their private keys and digital assets to the exchange while themselves using login credentials provided by the CEX. This implies that users rely on the exchange to securely hold and manage their funds on their behalf, making them vulnerable to scams, hacks and other security threats in the event an exchange comes under attack.\n\nHardware wallets, on the other hand, empower users with full control and self-custody over their digital assets. Users hold their private keys and are not reliant on third-party custodians or exchanges. To engage in cryptocurrency transactions using hardware wallets, the transactions require the private key to be “signed.” This signing process takes place within the hardware wallet itself using a cryptocurrency bridge. A crypto bridge facilitates the connection between the hardware wallet and the blockchain.\n\nThe hardware wallet uploads the signed transaction to the bridge, which in turn broadcasts the signed transaction to the blockchain network. Importantly, at no point during the entire process does the user’s private key leave the hardware wallet, thereby ensuring safety and security.\n\nRelated: What is a Bitcoin Wallet? A beginner's guide to storing BTC\n\nHow to use a hardware crypto wallet\n\nThe exact steps and procedures may vary slightly depending on the specific hardware wallet. Users can refer to the manufacturer’s instructions and follow security practices to learn how to use a particular hardware wallet.\n\nThe following are some common steps to understand how hardware wallets can be used:\n\nStep 1: Purchase and install software\n\nObtain a crypto hardware wallet from known and reliable manufacturers such as Ledger, Trezor and Ngrave — and/or their authorized resellers. Ensure that it is sealed and tamper-free. Visit the official website of the hardware wallet manufacturer, then download and install the wallet software on desktop/mobile devices. Make sure to read the recommendations for the device specifications — operating system, processor, etc.\n\nStep 2: Connect the hardware wallet\n\nConnect the hardware wallet to a desktop/mobile device using the provided USB cable or the appropriate wireless connection (bluetooth or NFC). Follow the on-screen instructions to initialize the hardware wallet. This involves selecting a PIN or passphrase, creating a backup recovery seed phrase and securely storing the seed in multiple offline locations. The recovery seed is crucial for restoring access to funds if the hardware wallet is ever lost or damaged.\n\nStep 3: Add funds and transact\n\nWithin the wallet software, locate the option to receive or deposit cryptocurrencies. Copy the public address displayed or scan the QR code in order to add the desired amount of cryptocurrency to this public address from an exchange or another wallet.\n\nTo send cryptocurrencies from the hardware wallet, select the option to send or transfer funds, and enter the recipient’s address and the amount to send. Confirm the transaction details on the hardware wallet’s screen.\n\nStep 4: Confirm, sign and verify transactions\n\nUpon confirming the transaction details on the hardware wallet, one will be prompted to provide additional authorization by entering a PIN or passphrase. The hardware wallet will then sign the transaction with the private key stored within it, and the funds will be transacted. Track the progress of the transactions using blockchain explorers or within the wallet software. Verify that the transaction has been confirmed and added to the blockchain.\n\nIt is important to remember to securely disconnect the hardware wallet from the desktop/mobile device after completing the transaction and ensure safekeeping.\n\nPopular hardware wallets\n\nHardware cryptocurrency wallets have become increasingly sought after by crypto enthusiasts, investors and crypto whales. These include wallets such as Ledger and Trezor, which offer a secure and user-friendly solution for storing and managing digital assets. Other common names in the market include: Ellipal, CoolWallet, SafePal and Ngrave, among others. Furthermore, certain hardware wallets like Ledger offer staking and other earning opportunities through their Ledger Live app.\n\nThe superiority of hardware wallets in securing cryptocurrencies became even more apparent in 2022 due to the crypto exchange debacles of FTX, Celsius, BlockFi and Vault, which resulted in the loss of access to billions of dollars. As a result, hardware wallet providers like Ledger and Trezor experienced unprecedented sales as crypto holders rushed for storage safety and reliability.\n\nAre hardware crypto wallets secure\n\nFor anyone who has been in the crypto space long enough, there is a common saying: “Not your keys, not your crypto.” In essence, this phrase serves as a call to action for cryptocurrency users to take control of their own security and ensure the protection of their digital assets. It encourages the use of hardware wallets and other cold storage solutions to keep private keys offline and away from potential cyber threats.\n\nCrypto hardware wallets are widely recognized as secure solutions for storing, managing and taking custody of one’s digital assets and cryptocurrencies. Although no security measure can guarantee complete safety, hardware wallets provide additional layers of security and safeguards for storing cryptocurrencies."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTEvbWVldC1kZW5jdW4tZXRoZXJldW0tZGV2ZWxvcGVycy1hcmUtYWxyZWFkeS1wbGFubmluZy1uZXh0LWhhcmQtZm9yay_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzExL21lZXQtZGVuY3VuLWV0aGVyZXVtLWRldmVsb3BlcnMtYXJlLWFscmVhZHktcGxhbm5pbmctbmV4dC1oYXJkLWZvcmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Meet ‘Dencun.’ Ethereum Developers Are Already Planning Next Hard Fork - CoinDesk",
        "content": "Tim Beiko, the protocol support lead at the Ethereum Foundation, who conducts these bi-monthly meetings, opened the meeting with, “I'll assume that, by default, we sort of keep this scope for Cancun and if anybody wants to change it going forward, just put something in the agenda.” (Dencun doesn’t exactly roll off the tongue, and the developers themselves sometimes just say “Cancun.”)"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUxMTAwNTEyNi9lbi9TdXN0YWluYWJsZS1CaXRjb2luLVByb3RvY29sLVNCUC1hbmQtRGlnaXRhbC1Qb3dlci1PcHRpbWl6YXRpb24tRFBPLVBhcnRuZXItdG8tQWR2YW5jZS1CaXRjb2luLU1pbmluZy1hcy1hLUNsZWFuLUVuZXJneS1Tb2x1dGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Sustainable Bitcoin Protocol (SBP) and Digital Power Optimization (DPO) Partner to Advance Bitcoin Mining as a Clean ... - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--Sustainable Bitcoin Protocol (SBP) and Digital Power Optimization (DPO) have announced a new partnership aimed at advancing the profitability of using verified clean energy sources for bitcoin mining while accelerating the buildout of clean energy infrastructure. SBP will verify DPO's clean energy use through a third-party audit and then issue DPO and its clients one Sustainable Bitcoin Certificate (SBC) for each bitcoin it has produced with 100% sustainable energy sources. These SBCs make it more profitable to operate bitcoin data centers using clean energy.\n\nDPO builds flexible data centers that utilize on-location, behind-the-meter bitcoin mining computers to maximize the profitability of clean energy assets. DPO is currently running bitcoin mining deployments behind the meter on wind, solar and hydro facilities. One of DPO’s own hydroelectric sites is currently undergoing a FERC-mandated maintenance review and through bitcoin mining with SBCs, DPO is able to fund the necessary maintenance. Keeping this plant, which has been producing zero-carbon power since 1908, safe and operational aids the decarbonization of the grid. DPO also intends to partner with SBP to incentivize the development and repowering of additional wind and solar assets in North America.\n\nSBP is the most trusted solution in bitcoin sustainability for institutional investors and as the margins of bitcoin miners decrease, they are being seen as a key pathway for green bitcoin miners to maintain profitability. SBPs mission is to incentivize the use of verified clean energy through a market-based mechanism and mobilize institutional capital into clean energy development, creating a transparency layer for the sustainability of the bitcoin network.\n\n\"We are thrilled to add DPO to our growing list of clean energy miners,\" said Brad Van Voorhees, CEO and Cofounder of SBP. \"DPO’s model of partnering directly with clean energy producers to monetize excess generation and solve the daily challenges these companies face is well-aligned with our vision of how bitcoin mining can be a key energy transition technology.”\n\n\"DPO is excited to partner with SBP to further advance bitcoin mining as a solution for renewable energy companies\" said DPO’s CEO Andrew Webber. \"SBP’s innovative offering is an institutionally-appropriate way for our clean energy clients to out-earn bitcoin miners using dirty power and will help us accelerate the decarbonization of the bitcoin network and the US power grid.” This partnership with SBP will not only benefit DPO and its clients, but also contribute to a more sustainable future for all.\n\nAbout Sustainable Bitcoin Protocol\n\nSustainable Bitcoin Protocol (SBP) is on a mission to unlock Bitcoin’s potential as our planet’s most sustainable asset class and accelerate investment into the renewable energy sector. SBP has pioneered a market-driven solution to financially incentivize bitcoin miners to use verified clean energy sources and for the first time ever, enable investors to hold bitcoin in an auditably sustainable way. In creating a transparency layer for the Bitcoin mining ecosystem, SBP forms the missing link between climate-conscious investors and the world's most critical monetary technology. For more information about SBP or to become a partner, visit https://www.sustainablebtc.org.\n\nAbout Digital Power Optimization\n\nDigital Power Optimization is an energy services provider which builds flexible data centers on-site at clean energy assets to help asset owners maximize the value of their energy. DPO offers its solution as a service to the power plant owner, and helps its clients maximize their revenues. By aligning its interests with low-cost clean power companies, DPO believes that it creates the most competitive flexible data centers while making the construction of on-site flexible loads as attractive as possible for plant owners. For more information on DPO, please visit https://www.digitalpoweroptimization.com/."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9pcy10aGUtdXMtZ292ZXJubWVudC1pbnZvbHZlZC13aXRoLWJpdGNvaW5zLXJlY2VudC1wcmljZS1kcm9wLTE2NjQ2OTIxLmh0bdIBdmh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9pcy10aGUtdXMtZ292ZXJubWVudC1pbnZvbHZlZC13aXRoLWJpdGNvaW5zLXJlY2VudC1wcmljZS1kcm9wLTE2NjQ2OTIxLmh0bS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Is the US government involved with Bitcoin’s recent price drop? - CNBCTV18",
        "content": "On May 11, Bitcoin's price unexpectedly plummeted below $27,000, a support level it had maintained since March 17, amid reports that the US government was allegedly selling its Bitcoin assets. However, it was later reported the ‘fake’ news might have triggered fear, uncertainty, and doubt (FUD) amongst crypto investors, leading to a sporadic decline in Bitcoin’s price. Here’s a recap of the events that followed in the past few days.\n\nDid the U.S. government sell its BTC holdings?\n\nBitcoin's market had been choppy in recent weeks, moving between the upper and lower bands of $30,000 and $27,000, respectively. However, on May 11, Bitcoin dropped below this lower band and touched $26,723, its lowest point in nearly two months. The dip was mostly unexpected given that the announcement of US inflation statistics on May 10 was followed by a brief uptick in Bitcoin's price.\n\nAlso Read: A quick guide on how to verify your crypto transaction\n\nFollowing Bitcoin's dip, it was reported that news of the US government selling confiscated bitcoins may have caused an unanticipated drop in its price. It is currently unknown where the news came from, however, it is known that various social media accounts were fast to spread the story. During the same day, Coinglass, an analytical platform, revealed that $47 million in long positions were liquidated in less than an hour, the second-largest Bitcoin liquidations in 2023 so far.\n\nThe US government has amassed a sizable stockpile of Bitcoins over the years. The coins were obtained through seizures from the Silk Road marketplace, thefts on the crypto exchange Bitfinex, and James Zhong, who pleaded guilty in 2012 to manipulating the Silk Road transaction system in order to siphon Bitcoins. The government typically sells these Bitcoin confiscations in public auctions conducted by the U.S. Marshals Service. According to Glassnode, the US Government held 205,515 BTC as of 9 March. The same is valued at $5.42 billion based on Bitcoin’s current market price.\n\nWas this just a rumor?\n\nIn the aftermath of Bitcoin’s price drop, several social media accounts argued that recent news of the US government selling its BTC holdings was likely just a rumor which fueled market FUD.\n\nFor instance, social media user and on-chain analyst ZachXBT, searched blockchain addresses to demonstrate that addresses associated with US authorities had not engaged in any such transactions. Later that day, analytical platform CryptoQuant tweeted that several social media accounts spread unverified news without fact-checking, resulting in Bitcoin liquidations.\n\nThere was also a rumor which suggested that the problem was caused by a faulty feature on blockchain analytics platform, Arkham Intelligence. Some argued that user labels used to mark addresses on Arkham Intelligence were responsible for the trouble. The Arkham interface allows users to manually add or remove labels to modify data sets, which may have led some clients to misuse this feature. However, the platform later denied these rumors. It also confirmed that it had identified seven Bitcoin wallets associated with the US government, and none of them were involved in any BTC transactions of late.\n\nConclusion\n\nIt is difficult to ascertain whether the US government has sold any of its Bitcoin assets this week until an official statement is issued. However, according to some on-chain experts, the same remains a rumor for the time being. At the time of writing, Bitcoin’s price traded at $26,420, down by 3.5 percent over the last 24 hours and down by 9 percent over the last 7 days."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2JpdGNvaW4vd2hhdC1pcy1iaXRjb2luLXBpenphLWRheS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: A Slice of Crypto History - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvd2h5LWlzLWJpdGNvaW4tYW5kLXRoZS1jcnlwdG8tbWFya2V0LWRvd24tdG9kYXkv0gFRaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy93aHktaXMtYml0Y29pbi1hbmQtdGhlLWNyeXB0by1tYXJrZXQtZG93bi10b2RheS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Why Is Bitcoin And The Crypto Market Down Today? - NewsBTC",
        "content": "Bitcoin price continues to fall, dragging the broader crypto market down with it. BTC is down 4.52% in the last 24 hours, while ETH is down 4.10%. With a current price of $26,289, Bitcoin records its lowest value since March 14 this year, when the price dipped as low as $26,544.\n\nWhy Is Bitcoin And Crypto Down?\n\nAs always, the reasons for the deep pullback of the Bitcoin price are complex. Remarkably, there was actually good news on Wednesday, May 10, as the CPI continued to fall causing the Bitcoin price to rise as high as $28,317.\n\nHowever, then fake news about an alleged sale of 9,800 BTC by the U.S. government shook the market. The Bitcoin price flash crashed as a result and has seemingly not been able to recover since. But this narrative is only half the story.\n\nA variety of other factors are currently weighing on the crypto market: the dollar index (DXY) is currently experiencing a bounce and was recently able to hold above the historically important support, the liquidity issue intensified once again with the departure of US market makers Jump and Jane Street, BTC formed a (supposed) head and shoulders pattern in the 1-day chart, the congestion of the Bitcoin and Ethereum blockchains and last but not least a lot of FUD (US government selling, Binance US and Grayscale).\n\nNot surprisingly, uncertainty in the Bitcoin and crypto market is currently quite high. The Dollar Index (DXY) is currently hovering above historically crucial support at 101.8. Since early April, DXY has already been suspiciously close to support, but has so far been able to fend off any attack from the bears.\n\nAs Christopher Inks of Texas Wet Capital writes, the DXY saw another move higher yesterday (to 102.056) and is currently preventing a rally in risk assets:\n\nThe $DXY rally is making longs difficult this morning. So, if you’re trying to get long on risk-off assets it’s best to wait and watch for a bit.\n\nLiquidity Issues, A Bearish Chart Pattern And FUD\n\nAnother bitter blow to the crypto market on Tuesday was the news of Jump and Jane Street’s departure from the U.S. crypto market. The move by the two major market makers comes as a result of regulatory uncertainty in the US.\n\nAs NewsBTC reported, liquidity has been a huge problem before, which could now get worse. Due to low liquidity, higher volatility is likely as larger buy and sell orders move the market faster.\n\nIn addition, a (supposed) head and shoulders pattern on Bitcoin’s 1-day chart is currently causing fear among traders. The pattern may signal a crash to $25,000.\n\nRemember the bearish diamond pattern that everyone was shilling at 21-22k? It’s H&S now, just saying! https://t.co/2HlUIZ1XrJ pic.twitter.com/yyivuwcF82 — tedtalksmacro (@tedtalksmacro) May 12, 2023\n\nAdding to the uncertainty has certainly been the congestion of the Bitcoin blockchain by Ordinals and the controversial BRC-20 meme coins, which are seen as a DDoS attack by part of the community. Although 300,000 transactions are still waiting for confirmation in the mempool, the problem is slowly easing.\n\nThe popularity of Bitcoin Ordinals transactions is declining. Trading volume has dropped for three consecutive days after reaching an all-time high of $18.13 million on May 8. Yesterday, trading volume fell to $4.86 million. The number of transactions has also dropped from 17,000 to 6,000. UniSat’s market share has dropped from 80-90% to 50-60% currently.\n\n#Bitcoin block size war 2.0? 👀 According to Dune data, transactions through Unisat have grown exponentially since the beginning of May. 🚨 Unisat, the core wallet of BRC20, is developed by a Chinese development team of the BSV community. pic.twitter.com/DfW46mbhZb — Jake Simmons (@realJakeSimmons) May 11, 2023\n\nLast but not least, there are currently some unconfirmed rumors (FUD) circulating about Binance US and Grayscale. Binance US caused a stir in the last few days because the Bitcoin price showed a high price premium. The reasons have been the subject of much speculation.\n\nGrayscale is currently being hotly debated because DCG supposedly owes bankrupt crypto lender Genesis Trading about $575 million in May, with the loans coming due next week. The rumor says that Grayscale may be selling something on Coinbase to cover the capital needed to repay the loan.\n\nAt press time, the Bitcoin price stood at $26,289, initially receiving support from the 100-day EMA.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tZmVlcy10b28taGlnaC1oZXJlLWFyZS0xMC13YXlzLXRvLWxvd2VyLXRoZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin Fees Too High? Here are 10 Ways to Lower Them - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzEwLXBhc3Npb25hdGUtYml0Y29pbi1tYXN0ZXJzLXdoby1jYXRlci10by1pbnZlc3RvcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "10 Passionate Bitcoin Masters Who Cater to Investors - Analytics Insight",
        "content": "This article gathers the top 10 Bitcoin masters who cater to investors in identifying investment opportunities\n\nDon’t know how to start crypto investing? Don’t let that stop you. You can learn from Bitcoin investors who cater to your needs. Bitcoin masters can provide guidance and education to investors on how to invest in Bitcoin and other cryptocurrencies effectively. They can help investors understand the risks and rewards of investing in cryptocurrencies and teach them about the underlying technology and how to perform technical analysis. Bitcoin masters can also provide tips on identifying high-quality investment opportunities and avoiding scams within the crypto space. By working with a Bitcoin master, crypto investors can learn the skills and knowledge they need to make informed decisions and potentially maximize their returns in the crypto market. Many individuals within the cryptocurrency community can help investors master the art of investing in Bitcoin and other cryptocurrencies. This article gathers the top 10 Bitcoin masters who cater to investors.\n\nAndreas Antonopoulos: A Bitcoin educator, author, and speaker who teaches people about the technology and economics of Bitcoin. Michael Saylor: A bitcoin advocate, investor, and CEO of MicroStrategy, which holds over $5 billion worth of bitcoin on its balance sheet. Anthony Pompliano: A bitcoin investor, podcaster, and co-founder of Morgan Creek Digital, a hedge fund focusing on digital assets. Saifedean Ammous: A Bitcoin economist, author, and professor who wrote The Bitcoin Standard, a book that explains the history and principles of sound money. Elizabeth Stark: A bitcoin entrepreneur, developer, and co-founder of Lightning Labs, a company that builds the Lightning Network, a layer-2 solution for fast and cheap bitcoin transactions. Jack Dorsey: A Bitcoin supporter, innovator, and CEO of Twitter and Square, two companies that integrate and promote bitcoin on their platforms. Nick Szabo: A Bitcoin pioneer, cryptographer, and inventor of smart contracts and bit gold, a precursor to Bitcoin. Laura Shin: A bitcoin journalist, host, and producer of Unchained and Unconfirmed, two popular podcasts that cover the latest news and trends in the crypto space. Dan Held: A bitcoin growth lead, writer, and director of business development at Kraken, one of the largest and oldest crypto exchanges in the world. Max Keiser: A bitcoin influencer, broadcaster, and co-host of The Keiser Report, a financial show that covers global markets and bitcoin.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZm9jdXNvbmJ1c2luZXNzLmV1L2VuL25ld3MvYml0Y29pbi1yZWNvcmRzLWltcHJlc3NpdmUtNzItNC1xb3EtZ2FpbnMtZW1lcmdlcy1hcy10b3AtcGVyZm9ybWluZy1hc3NldC1pbi1xMS0yMDIzLzU0MzHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 11:59:19 GMT",
        "title": "Bitcoin Records Impressive 72.4% QoQ Gains, Emerges As Top-Performing Asset In Q1 2023 | News - FOCUS ON Business",
        "content": "Over the past few months, Bitcoin (BTC) has experienced a surge in value that has left all other major asset classes trailing. Per a BitcoinCasinos.com report, the premier cryptocurrency had an impressive 72.4% quarter-over-quarter gain in Q1 2023.\n\nComparatively, the NASDAQ index jumped 15.7%, while gold had an 8.4% increase. Buoyed by positive inflation data, the US Dollar Index (DXY) remained fairly unchanged. And while all major asset classes ended the quarter with positive returns, crude oil decreased by 6.1%.\n\nAccording to BitcoinCasinos financial expert Edith Reads, Bitcoin’s Q1 performance is a testament to its resilience and growth potential amidst a volatile and uncertain global market. Since its inception, BTC has been battling several hurdles, including regulatory crackdowns, hacking incidents, and market fluctuations.\n\nEdith explains,\n\n“Bitcoin’s impressive gains clearly indicate its resilience despite the volatile market conditions. With the increasing institutional adoption and global recognition, the asset class is proving to be a reliable store of value for investors and traders alike.”\n\nReasons For Bitcoin’s QoQ Surge\n\nSeveral factors have contributed to the coin’s impressive performance during this period. The first is the growing number of institutional investments, which have been pouring in since the end of last year. This influx of capital has helped to stabilize the market and create a better sense of security for investors, leading to increased market confidence.\n\nAdditionally, BTC’s value surge could have resulted from broader macroeconomic trends. These include inflationary pressures, rising interest rates, and geopolitical tensions, leading investors to seek alternative investment options.\n\nMoreover, recent developments in the regulatory environment have also played a significant role in boosting Bitcoin’s fortunes. With major countries such as the US and the UK regulating cryptocurrency, more investors feel comfortable jumping on board, further propelling its upward trajectory.\n\nFinally, the surge in the coin’s value is also driven by increased demand from retail investors looking to diversify their portfolios with alternative investments such as cryptocurrency. This demand is further fueled by the growing adoption of blockchain technology, easing crypto investments.\n\nIs BTC A Viable Longterm Investment?\n\nThe latest surge in Bitcoin’s value raises questions about whether it is a viable investment for the future. It is worth noting that while Bitcoin’s Q1 gains are remarkable, the cryptocurrency is still facing significant challenges.\n\nOf course, no investment is without risk, and Bitcoin’s unpredictability is still a cause for concern for some investors. However, with the cryptocurrency market as a whole stabilizing and BTC continuing to post impressive gains, it will likely remain a strong investment option for those looking for high returns.\n\nWould-be investors must remember that the cryptocurrency market is notoriously volatile, and longevity is uncertain.\n\nBitcoinCasinos"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzA1LzEyL2JpdGNvaW4taGl0cy10d28tbW9udGgtbG93LWFtaWQtd2Vhay1tYXJrZXQtbGlxdWlkaXR5LWFuZC1yZWd1bGF0b3J5LWF0dGFja3Mv0gF3aHR0cHM6Ly9uYWlyYW1ldHJpY3MuY29tLzIwMjMvMDUvMTIvYml0Y29pbi1oaXRzLXR3by1tb250aC1sb3ctYW1pZC13ZWFrLW1hcmtldC1saXF1aWRpdHktYW5kLXJlZ3VsYXRvcnktYXR0YWNrcy8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin slumps on low liquidity and regulatory pressure - Nairametrics",
        "content": "Article Summary\n\nBitcoin’s value has dropped by 10% this week, and liquidity is thin, even for large assets like Bitcoin, causing concern among investors.\n\nExperts believe that Bitcoin’s recent drop could lead to further declines towards $25,000, which is a significant support area, and a drop below this level could be disastrous for uptrend buyers.\n\nThe Securities and Exchange Commission (SEC) has subpoenaed Marathon Digital, a Bitcoin mining firm, for alleged violations of securities laws, as part of an ongoing investigation into a data center in Montana. Despite this, Bitcoin is considered to be the most decentralized and resilient of all cryptocurrencies.\n\nBitcoin fell below $26,200 on Friday as the market continued to react to falling risky asset prices. The flagship cryptocurrency lost a tenth of its value this week, trading at two-week lows.\n\nCurrently, liquidity appears to be “very thin,” even for large crypto assets like Bitcoin. Market indicators cannot pinpoint a direct reason for the weakness, but concerns that reduced participation by institutional market makers could lead to more price volatility have pushed mid-to-larger bids to stomp the market, making it fall.\n\nRecently, liquidity or market depth has deteriorated on major exchanges, including Binance, making it difficult for traders to fill large orders without impacting prices.\n\nExperts believe Bitcoin’s drop to two-month lows has confirmed a bearish head-and-shoulders reversal pattern on technical charts. This breakdown opens every door for further declines toward the support near $25,000.\n\nBackstory\n\nAfter a failed breakout in early April, the price is firming below the $30,000 resistance level. The downward pressure over the past few days has also pushed the 50-day moving average to break near $28,000.\n\nThe $25,000 support area could be the next target, followed by the next important 200-day moving average near $22,000. Both are significant, and a drop below these levels would be disastrous for uptrend buyers.\n\nOn the other hand, a further breakout above the 50-day moving average will likely thwart the downside scenario, which, in turn, will likely push the price above $30,000.\n\nAt the regulatory level, the Securities and Exchange Commission (SEC) has targeted prominent Bitcoin mining firm Marathon Digital for alleged violations of securities laws that further added pressure on the cryptocurrency market.\n\nBitcoin mining firm Marathon Digital Holdings has announced that it has been subpoenaed by the SEC for alleged securities law violations as part of an ongoing investigation into a data center in Montana.\n\nMarathon Digital, the second-largest listed Bitcoin miner in the United States, has been subpoenaed by the SEC to produce documents and information related to its operations. Marathon has announced its intention to cooperate fully with the SEC’s investigation.\n\nBut of all the crypto assets, Bitcoin is the most decentralized and resilient given what happened when China completely banned cryptocurrency trading. The mining business was just offshored, and now China’s bitcoin mining has resumed, producing the second-highest hash power in the world.\n\nWhat you should know and expect in the nearest future\n\nThe banking crisis won’t go away anytime soon, and it could get worse. The US economy could face a major collapse later this year and into 2024, and the war between Russia and Ukraine is still raging."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vdGVjaGNhYmFsLmNvbS8yMDIzLzA1LzExL2NyeXB0b3MtdGFsZS1vZi10d28tdG9rZW5zLWJpdGNvaW4tdnMtYmluYW5jZS1jb2luLWFuZC10aGUtcmlzZS1vZi1wYXQtd2Fycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Crypto's Tale of Two Tokens: Bitcoin vs. Binance Coin and the Rise of PAT WARS - TechCabal",
        "content": "Crypto has tumbled through a bumpy ride in the past few months, and institutional investors are looking at it warily due to its volatile nature. However, Cantor Fitzgerald’s Elliot Han suggests that institutional investors’ interest is still strong and is even maturing. In this article, we’ll compare and analyze the similarities and differences between two major projects in the same industry, Bitcoin (BTC) and Binance Coin (BNB), and discuss how they relate to investments, decentralized finance, governments, and digital assets. In addition, we will also be looking at PAT WARS (PAWS) , a new meme coin, and why it’s attracting the attention of institutional investors.\n\nBitcoin and Binance: Decentralization, Market Cap, and Regulatory Landscape\n\nBitcoin (BTC) and Binance Coin (BNB) are both digital assets that operate using blockchain technology. Bitcoin is decentralized, meaning that it is not controlled by any government or financial institution. The Binance Chain, started by Binance, has evolved into a decentralized blockchain ecosystem that is now community-led, open to all, and operates without requiring permission.\n\nOne of the main differences between Bitcoin and Binance is their market capitalization. As of May 2023, Bitcoin has a market cap of around $1.1 trillion, while BNB’s market cap is over $48 billion.\n\nBTC and BNB are two of the major players in the crypto market, and as such, have had to face many challenges. Governments have had mixed reactions to the DeFi nature of these coins, with some viewing them as a potential threat to their centralized financial systems while others have embraced them as digital assets.\n\nBitcoin vs Binance: Two Titans of Crypto Investing for Seasoned Traders\n\nBoth Bitcoin and Binance are popular choices for seasoned investors looking to expand their portfolios. Institutional investors have been slow to embrace cryptocurrencies, but their interest in the space is growing. JPMorgan and Goldman Sachs are two large banks that began experimenting with blockchain technology a few years ago and are still interested in the market, according to Han. However, Han warns that there is still a high level of volatility, uncertainty, and regulatory action that needs to be taken into account before investing in certain coins.\n\nPAWSitive Investment: How PATWARS is Winning Institutional Interest in DeFi\n\nWith institutional investors’ interest in Decentralized finance (DeFi) increasing, PAT WARS (PAWS) emerges as a promising new meme token in the DeFi space. PAWS’s brand message resonates with decentralization, prioritizing user governance in addition to community-driven decision-making. Through PATWARS DAO, users can vote on initiatives which promote community engagement and ensure the token’s long-term success and sustainability. The governance model’s transparency and adherence to DeFi principles are crucial for PAT WARS’s success.\n\nAs the crypto market matures, BTC and BNB remain two of the top players in the industry. While they have their differences, both offer unique opportunities for seasoned traders looking to invest in digital assets. As institutional investors show growing interest in the space, new tokens like PAT WARS are emerging in the DeFi sector, offering new and promising investment opportunities!\n\nClick the Links Below for More Information on PATWARS!\n\nWebsite: https://www.patwars.com\n\nTwitter: https://twitter.com/PATWARSOfficial\n\nTelegram: https://t.me/PATWARSOfficial\n\nShare this article"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1leGNoYW5nZS1yZXNlcnZlcy1mYWxsLXRvLWxvd2VzdC1sZXZlbC1pbi1vdmVyLTUteWVhcnMtd2hhdC1kb2VzLWl0LW1lYW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin exchange reserves fall to lowest level in over 5 years; What does it mean? - Finbold - Finance in Bold",
        "content": "As the majority of the cryptocurrency sector continues to trend sideways or downwards, its representative asset – Bitcoin (BTC) – has reached the lowest supply on crypto exchanges in more than five years, indicating that crypto traders and investors are increasingly turning to self-custody.\n\nSpecifically, the amount of Bitcoin on crypto exchanges has reached 5.84%, the first time since December 2017 that the flagship decentralized finance (DeFi) has dropped below 6%, the blockchain and social metrics platform Santiment said in a tweet on May 9.\n\nBitcoin supply on exchanges. Source: Santiment\n\nAccording to the information retrieved from aggregated derivative exchange data platform Coinglass, there was only 1.89 million BTC on all exchanges as of May 11, 2023, demonstrating a 14.87% decline over the year, as the balance on exchanges on May 11, 2022, stood at 2.22 million BTC.\n\nWhat does this mean?\n\nAs the platform explained, the trend of moving a digital asset off exchanges and into personal crypto wallets in such large amounts represented “a good sign of increased interest in self-custody for traders, and less potentially at risk” of selling back to exchange wallets.\n\nOn top of that, it demonstrates the growing need for investors to have full control over their cryptocurrency assets and provide assurance that they are safe in case history repeats itself and the FTX scenario, which has caused fear among many, happens again.\n\nBesides these signals, the decreasing amount of Bitcoin on crypto exchanges could be a bullish sign, indicating there is a substantial buying trend, as continued accumulation by hodlers could cause the price of the maiden cryptocurrency to rise.\n\nBitcoin price analysis\n\nMeanwhile, Bitcoin was at press time changing hands at the price of $27,450, down 0.40% in the last 24 hours, in addition to dropping 5.31% across the previous seven days and losing 7.45% to its value in the past month, as per data retrieved on May 11.\n\nBitcoin 30-day price chart. Source: Finbold\n\nNotably, the negative trend has continued despite Bitcoin briefly breaking through the $28,000 level after the latest consumer price index (CPI) report showed that the inflation in the United States had slowed down more than expected in April, as Finbold reported on May 10.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]