[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMy8wOC8xOC9pbnZlc3RpbmcvYml0Y29pbi1wcmljZS1kcm9wLXNwYWNlLXgtc2VsbG9mZi9pbmRleC5odG1s0gFaaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAyMy8wOC8xOC9pbnZlc3RpbmcvYml0Y29pbi1wcmljZS1kcm9wLXNwYWNlLXgtc2VsbG9mZi9pbmRleC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price on the skids as investors pull $1 billion from crypto - CNN",
        "content": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vd2h5LWlzLXRoZS1iaXRjb2luLXByaWNlLWRvd24tMTAtdGhpcy13ZWVrLTc2OTI5MDnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Why Did Bitcoin Drop 12% This Week? - Investopedia",
        "content": "The price of bitcoin dropped below $26,000 this week amid decreased activity in the market, the growing crisis in China's property sector, and a report that SpaceX has sold at least some of its bitcoin holdings.\n\nKEY TAKEAWAYS The bitcoin price has become susceptible to wilder price swings as trading volumes on exchanges have declined and large trades are able to have a greater impact.\n\nSpaceX, of which Elon Musk is CEO, reportedly sold at least part of its bitcoin holdings.\n\nConcerns over the issues with China’s property market leading to a greater economic decline indicate bitcoin may still be viewed as a risk-on asset.\n\nHeightened Price Volatility On Decreased Trading Volume\n\nReports from blockchain analytics firm Glassnode and crypto firm Coinshares point to a general lack of interest in the crypto market as a contributing factor to this week's bitcoin price decline. While bitcoin opened the week trading around the $29,400 level, it was down to roughly $25,697 by mid-Friday.\n\nTradingView\n\nNotably, the report from Glassnode covered the extreme level of apathy and exhaustion in the bitcoin market on Monday, three days before the majority of the price decline took place. The report also warned, “[O]n a shorter timeframe, it could be argued to be a slightly top heavy market, with many price sensitive investors at risk of falling into an unrealized loss.”\n\n\n\nIn the report from Coinshares, which was released on Friday, the connection between lower trading volumes on trusted exchanges and increased price volatility for bitcoin was explained.\n\n“In recent months, volatility has decreased, reaching levels comparable to the all-time lows observed at the start of the year,” wrote Coinshares head of research James Butterfill in the report. “Historically, such levels have often marked turning points for significant price swings, either upward or downward,\" he wrote.\n\n\n\nAdditionally, Coinshares indicated the sharpness of the decline in the bitcoin price on Thursday night was amplified by the unwinding of a large number of long positions in the bitcoin futures markets on various exchanges.\n\nAccording to Coinglass data, bitcoin traders liquidated about $1 billion in bets over the past 24 hours alone.\n\nDid Elon Musk Have Something To Do With Bitcoin's Drop?\n\nThere could have been another trigger—the perception that Elon Musk's space exploration company was getting out of bitcoin. On Thursday, The Wall Street Journal reported that SpaceX had marked down its bitcoin holdings to $373 million and sold the crypto asset.\n\nIn the past, the Tesla (TSLA) CEO's tweets have impacted prices of certain cryptocurrencies, especially meme coins such as Dogecoins.\n\nCoinshares also cautioned investors to keep an eye on Musk's moves as they tend to impact the bitcoin market.\n\n\n\nIs Bitcoin Still a Risk-on Asset?\n\nIn terms of specific events that may have led to increased downward pressure on the bitcoin price, some market commentators have pointed to China’s Evergrande Group filing for bankruptcy. “Unrelated risk-on assets such as Bitcoin and cryptocurrencies are feeling the impact [from the Evergrande fallout],” said crypto trading platform PrimeXBT.\n\n\n\nWhile bitcoin is commonly referred to as “digital gold” and an aspirational hedge against economic turmoil, the reality is the crypto asset often falls along with other risk-on assets at times of uncertainty, as was the case at the beginning of the COVID-19 pandemic.\n\nThat said, Coinshares views a potential full-blown economic crisis as a possible boon for bitcoin. “While we consider a full financial meltdown unlikely, should it transpire, it might bolster Bitcoin, especially if the repercussions permeate the broader financial sector,” wrote in its recent report.\n\n\n\nBut the week was not all rough. Coinbase’s regulatory approval for offering crypto futures trading in the U.S. was a bright spot for the crypto markets this week.\n\nCoinshares also stated that the market may be coming to terms with the fact that an approval of a spot bitcoin ETF, most notably from BlackRock (BLK), may not be arriving as quickly as the market originally anticipated."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMTcvYml0Y29pbi1hYnJ1cHRseS10dW1ibGVzLTlwZXJjZW50LXRvLWp1c3Qtb3Zlci0yNjAwMC1sYXRlLXRodXJzZGF5Lmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOC8xNy9iaXRjb2luLWFicnVwdGx5LXR1bWJsZXMtOXBlcmNlbnQtdG8tanVzdC1vdmVyLTI2MDAwLWxhdGUtdGh1cnNkYXkuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin abruptly tumbles as much as 9% to just over $26,000 late Thursday - CNBC",
        "content": "Bitcoin slipped sharply on Thursday evening, tumbling by as much as 9% to just over $26,000.\n\nThe cryptocurrency last traded at $26,593.68, reflecting a decline of more than 8%, according to Coin Metrics data.\n\nThe fall in bitcoin followed several hours after The Wall Street Journal reported that SpaceX, which is helmed by Elon Musk, wrote down the value of its bitcoin holdings by a total of $373 million in 2022 and 2021, and that the space travel company had sold the virtual currency.\n\n\"This is one of the most brutal minute-by-minute selloffs we've seen in the history of bitcoin,\" Ryan Rasmussen, a researcher at Bitwise Asset Management, told CNBC. \"The current speculation is it's an Elon Musk/SpaceX-driven selloff.\" He noted that this latest dramatic decline is \"short-sighted and largely retail-driven.\"\n\nIn 2022, Tesla, which Musk also leads as CEO, announced that it sold about 75% of its bitcoin holdings after investing $1.5 billion in the flagship cryptocurrency."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzA2MmFhYjlhLWMzMWQtNGU4Ny1iMDMyLWEwY2RkZTA4MTBkNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin shaken out of lull by SpaceX sale worries - Financial Times",
        "content": "Print this page\n\nBitcoin has been shaken out of its summer lull on fears that Elon Musk’s SpaceX had written down some of the value of its cryptocurrency holdings.\n\nThe flagship token was down 5.1 per cent on Friday, having fallen by nearly 8 per cent during an hour of frenzied trading late on Thursday, coinciding with a report in the Wall Street Journal that SpaceX had written down its bitcoin by $373mn in the past two years and had sold some coins.\n\nIts sudden reversal echoed declines in global stock and bond prices this week as investors are forced to adjust their expectations that US interest rates will stay high, even as the economy remains robust.\n\nThe Federal Reserve lifted its benchmark rate to its highest level in 22 years last month and left the door open to further increases this year. In spite of moves in other assets, the price of bitcoin has remained within a tight trading range over the past two months.\n\nMusk is regarded as one of the crypto market’s biggest cheerleaders and lifted the prices of alternative coins when he mentioned them on his X social media platform. His electric-car company Tesla briefly flirted with accepting payment in the cryptocurrency in 2021 and also ploughed $1.5bn of its own cash into the tokens.\n\nBut bitcoin registered a sharp reversal when Musk abandoned the plans three months later. Since then, the value of the carmaker’s own holdings has fluctuated. Tesla last year recorded $204mn in impairment losses related to its bitcoin holdings.\n\n“History shows that the market often reacts sharply to Elon Musk’s actions, implying that this latest revelation could further dampen investor sentiment,” said James Butterfill, head of research at Coinshares, an investment group.\n\nLow trading volumes and decreased volatility also had an impact, he said, as it “made the market susceptible to larger trades”.\n\nLiquidity and activity in crypto markets have dried up this year as US regulators have cracked down on illicit activity and charged some of the market’s biggest names, including Binance and Coinbase, with violating federal markets laws.\n\nIllustrating the thin liquidity, yesterday it would have taken the sale of 463 bitcoins — worth about $12mn — to push the price of the coin down by one per cent of its prevailing market value, according to CCData, an industry information provider.\n\n\n\nIn March, when crypto markets were convulsed by the collapse of Silicon Valley Bank, it would have taken the sale of 856 bitcoins, then roughly equivalent to $17mn, to move the price of the token by more than 1 per cent.\n\nIn June the SEC filed lawsuits against Binance and Coinbase, claiming they had broken the law by selling digital tokens to members of the public without filing the required registrations. The two companies have denied the allegations and vowed to defend themselves in court."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA4LzE3L2dyYXlzY2FsZS1pcy1vbi10aGUtY3VzcC1vZi13aW5uaW5nLWJpdGNvaW5zLWJpZ2dlc3QtcHJpemUtYnV0LXdhbGwtc3RyZWV0cy1iaWctZG9ncy1jb3VsZC1zbmF0Y2gtaXQtYXdheS_SAZQBaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wOC8xNy9ncmF5c2NhbGUtaXMtb24tdGhlLWN1c3Atb2Ytd2lubmluZy1iaXRjb2lucy1iaWdnZXN0LXByaXplLWJ1dC13YWxsLXN0cmVldHMtYmlnLWRvZ3MtY291bGQtc25hdGNoLWl0LWF3YXkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Grayscale is on the cusp of winning Bitcoin’s biggest prize—but Wall Street’s big dogs could snatch it away - Fortune",
        "content": "When Michael Sonnenshein became CEO of Grayscale in early 2021, his mission looked straightforward: The former banker was on a crusade to lead the company into a new era where customers could trade the cryptocurrency giant’s core product—stock backed by billions of dollars in Bitcoin—as an ETF. If all went well, it would be cheaper and easier than ever to buy Bitcoin, and crypto would take its place as part of mainstream finance with Sonnenshein as one of the industry’s leading figures.\n\nIt hasn’t worked out that way. Two-and-a-half years after Sonnenshein’s ascension, Grayscale still doesn’t have an ETF, and the company’s name is mud among many investors. Meanwhile, its parent company is mired in legal trouble with customers, rivals, and the Securities and Exchange Commission. Sonnenshein desperately needs to catch a break—and is poised to get one in the coming days if a federal court sides with Grayscale in a closely watched case.\n\nBut a new obstacle stands in the way of Grayscale’s dream: competition. Financial giants like BlackRock are swooping in to snatch up the Bitcoin ETF market, which one analyst says will gradually open the door to a $30 trillion capital pool that could funnel hundreds of billions of dollars into crypto.\n\nSonnenshein is putting on a brave face about these headwinds, telling Fortune: “I remain focused on Grayscale, and not getting distracted.” But with or without a court victory, there is a real risk the company could lose out—and become a footnote in the industry it helped create.\n\nGrayscale’s golden goose\n\nCrypto still carries some of the outlaw reputation from its early days, when the industry’s leading figures were radicals, weirdos, or outright criminals. Sonnenshein is none of those things. He is tall, likes to wear suits, and has the air of a banker from JPMorgan, where he worked before joining Grayscale as one of its first employees.\n\nThe crypto world is famously tribal, but if Sonnenshein has a tribe, it’s the world of Manhattan’s affluent Upper East Side, where he was raised and still lives, and where working on Wall Street is a proud tradition. This background made him a natural choice to lead Grayscale, a well-established crypto brand that needed an ambassador to regulators and the old guards of finance. At the same time, the fact that Sonnenshein has been part of Grayscale since it launched in 2014 gives him credibility with longtime crypto figures.\n\n“Being employee No. 1 prepared me for the role [of CEO] by doing a bit of what everyone here does,” he told Fortune in a recent interview.\n\nSonnenshein’s job was made easier by the fact Grayscale was milking a cash cow. The company has long produced a gusher of easy revenue thanks to the prescience of its founder, Barry Silbert, who had been the first to spot a lucrative trade that involved wrapping Bitcoin in the garb of traditional finance.\n\nIn 2013, Silbert ran Second Market, a company that offered rich investors access to rare items like fine wine or pre-IPO shares of Twitter and Facebook. In order to tap into the growing interest in crypto, Second Market created a novel product in the form of BIT, a trust built to hold Bitcoin, and then sold shares in that trust to accredited investors.\n\nBuying shares in what would become known as the Grayscale Bitcoin Trust (ticker: GBTC) has never made much sense for everyday crypto aficionados. If you want to own Bitcoin, the best way is to buy it directly through Coinbase, Kraken, or another broker. Doing so lets you use the Bitcoin for purchases or gifts, and, more important, it doesn’t cost anything after the initial transaction; holding GBTC, on the other hand, involves tying up funds while paying Grayscale a 2% annual management fee.\n\nFor Grayscale and accredited investors, though, the GBTC arrangement made plenty of sense. As the value of the assets in the trust swelled to billions of dollars, the company raked in fat fees, and the upscale investors who purchased GBTC shares from the company could unload them on the retail market 12 months later, typically for a handsome profit. It was a grand arbitrage opportunity—especially after Grayscale obtained a legal status in 2020 that shortened the period to flip shares to six months—and it went on for years.\n\nBetween 2014 and 2021, the Grayscale shares traded at a premium to the underlying Bitcoin that backed them. This premium was explained in part by millennial investors who liked the ease of buying crypto in stock form—in 2020, a survey found that GBTC was a top-five choice among those under age 30, along with big-name firms like Apple and Tesla—and by institutions that wanted exposure to Bitcoin but that, for legal or operational reasons, couldn’t hold it directly. And if the price of Bitcoin went up—which it has for the most part—GBTC’s share price followed. In this context, no one really minded paying a 2% cut.\n\nDreaming of a Bitcoin ETF\n\nGrayscale’s jerry-rigged system to sell Bitcoin in a trust was always supposed to be a temporary arrangement. Silbert, Grayscale’s founder, has said so himself. The long-term plan has been to wait for the U.S regulatory landscape to evolve, and then package Bitcoin as shares in an exchange-traded fund.\n\nSince the first one launched more than 30 years ago, ETFs have become hugely popular with investors of all stripes, offering a safe and convenient way to get exposure to everything from gold to stock indexes for fees as low as two basis points (0.02%), or two cents for every $100 invested. Many in finance, both inside and outside the crypto industry, believe the time is right for a Bitcoin ETF.\n\nThe first company to offer a Bitcoin ETF is poised to reap a handsome reward—most analysts believe deep-pocketed pension funds and other institutional investors will welcome the familiar legal structure of an ETF and jump into the crypto market for the first time. According to Bloomberg ETF analyst Eric Balchunas, these investors control $30 trillion of wealth, and could deploy 1% to 2% into crypto.\n\nGrayscale has been eyeing this opportunity for years, but the company was hardly the only one. Back in 2013, when Bitcoin opened the year trading around $900, the Winklevoss twins’ crypto firm Gemini applied to create the first one, only to be rejected by the Securities and Exchange Commission four years later. According to the SEC, the Bitcoin market was too small and thinly traded, which could open the door for someone to manipulate the price of the ETF shares. During this time, in 2017, Grayscale approached the SEC to convert GBTC shares into an ETF but voluntarily withdrew the application.\n\nMore than a year later, in 2018, the agency rejected a second Gemini bid. Even though the size of the Bitcoin market had expanded significantly—the currency was coming off a bull market that saw the price brush $20,000—officials remained concerned about price manipulation. Shortly after this second refusal, the SEC turned down nine other companies’ applications to create a Bitcoin ETF, always on the same grounds.\n\nThese rejections came as no surprise to Grayscale or anyone else. The 2017 bull market had vaulted crypto into the mainstream, but also given rise to outrageous scams and exposed many of the industry’s leading figures as two-bit hucksters—or worse. In response, Grayscale stuck to its plan to play the long game and wait for the right regulatory infrastructure to emerge.\n\nIt didn’t hurt, of course, that Grayscale could rake in even more cash while waiting for the SEC logjam to break. By 2018, in addition to the Grayscale Bitcoin Trust, which currently holds over 3% of the world’s Bitcoin, the company had created identical trusts to offer shares in other cryptocurrencies, such as Ethereum and Litecoin, for which it charged even higher fees—as much as 2.5% per year. At its peak, Grayscale would have more than $60 billion in assets under management, which generated $20 million a month in revenue.\n\nThe upshot was that, in early 2021, Grayscale was in a win-win situation—it was poised to be at the vanguard of a new Bitcoin ETF market when the SEC finally came around, and it could keep raking in fees from its trust products. But then everything changed, and Grayscale’s once-loved product became toxic in the eyes of many investors.\n\nThe grand plan fizzles\n\nGrayscale’s biggest trust had for years provided a handsome arbitrage opportunity. Then one day the easy money dried up.\n\nEver since a precursor to the Grayscale Bitcoin Trust launched in late 2013, shares had always traded at a premium to the so-called NAV—the net asset value of Bitcoins held in the trust. The GBTC premium was typically more than 10%, and sometimes as high as 40%. The shares couldn’t be exchanged for Bitcoin, but they remained hughely popular with institutional and retail investors all the same.\n\nIn March 2021, however, GBTC shares began trading at a slight discount to NAV, a gap that would soon widen significantly:\n\nThe discount occurred owing to a series of factors, including the approval of Bitcoin ETFs in Canada and Europe, and the fact that mainstream companies like PayPal and Robinhood had made it easier to buy Bitcoin directly.\n\nThe emergence of the discount didn’t sting much at first, since for much of 2021 the crypto market went on a spectacular bull run that saw the price of Bitcoin peak near $70,000. In this context, GBTC shares soared alongside Bitcoin, so everyone was in the green. It was during this time, in October 2021, that Grayscale finally pursued a full-blown effort to ask the SEC to let it convert GBTC into an ETF.\n\nThe mood among Grayscale investors turned sour, however, toward the end of that year as crypto’s latest bubble burst, and as the GBTC discount to NAV widened.\n\nGBTC owners stewed over the fact their money was tied up in a stock that now had little appeal to other buyers—and worse, that came with management fees of 2% a year or more. Institutional investors were caught flat-footed when the long-time arbitrage opportunity abruptly vanished.\n\n“It was a great carry trade that everyone suddenly got stuck in,” said a crypto executive who asked not to be named. The executive added that several crypto funds, including the since-failed Three Arrows Capital hedge fund (known as 3AC), got wiped out through holding large blocks of suddenly illiquid GBTC.\n\nThe implosion of 3AC in March 2022 accelerated a full-blown bear market. Then in June of that year, the SEC rejected Grayscale’s ETF. The company had expected such an outcome, and, in a sign of how urgent its business predicament had become, filed a lawsuit that same day asking a court to reject the SEC’s ruling.\n\nGBTC customers get restless\n\nThe lawsuit would prove to be a symbolic milestone for Grayscale and the crypto industry. But it did little to help GBTC owners, who could only grit their teeth as they paid 2% a year and watched the NAV gap turn into a chasm as the crypto market imploded in the wake of the massive FTX scandal. In response, disgruntled investors organized abusive Twitter campaigns against Silbert and Sonnenshein, and the hedge fund Fir Tree Partners sued Grayscale over alleged mismanagement.\n\nSome demanded Grayscale conduct a so-called Reg M redemption—an esoteric process that would entail getting permission from the SEC to let customers exchange their shares for the underlying Bitcoin. Such relief would both placate Grayscale’s noisiest critics, by letting them redeem their Bitcoin at market value, and help close the GBTC discount.\n\nGrayscale, however, has refused to offer such a redemption—a process that would shrink its asset base and its commissions—and at times has invoked legal pretexts, including a 2015 consent decree with the SEC, to declare that it can’t even do such a thing.\n\nIn interviews with Fortune, however, several lawyers said there is no serious legal barrier to conducting a redemption, and suggested Grayscale’s hesitancy is driven by business concerns. “Redemption opens the door for less AUM, therefore less fees,” said Fred Rispoli of Hodl Law.\n\nIn an attempt to pacify frustrated investors, Grayscale’s parent company bought up hundreds of millions of dollars’ worth of trust shares to defend the price of GBTC and its sister stocks. The effort did little to boost the share price or narrow the discount, and investors’ howls grew louder.\n\nAs for Sonnenshein, he’s declined to cut Grayscale’s fees or offer a redemption. Instead, one of his primary roles as CEO has been to undertake frequent media appearances, making the case over and over again that the best option for investors is to wait for the company to prevail in court and obtain its ETF—an event that would close the discount to NAV, and likely cause the price of Bitcoin to soar.\n\nGrayscale’s strategy to brush off investor frustration and stay the course could be vindicated when the U.S. Court of Appeals for the District of Columbia rules on the question of whether the SEC was “arbitrary and capricious” in denying the company’s ETF bid. A decision is expected any day, and analysts say Grayscale has a 70% chance to win—but even a victory may not be enough to rescue the firm.\n\nBlackRock and Fidelity wait in the wings\n\nBy the time Grayscale sued the SEC in June 2022, the agency’s chairman, Gary Gensler, had repeatedly taken a hard line against the crypto industry—to the point where even impartial observers began to question if he had stepped beyond the limits of his authority.\n\nThe SEC suffered a legal setback in July when a federal judge rejected its interpretation of securities law in a case involving the crypto company Ripple, and the D.C. appeals court has sent signals that it may deliver another one with Grayscale. During oral arguments in March, the three-judge panel repeatedly poked holes in the agency’s argument that spot market ETFs—like the one Grayscale seeks to offer—are different than ETFs for Bitcoin futures, which the SEC approved in 2021.\n\nThe situation means Grayscale could demolish a major legal obstacle blocking its path to a Bitcoin ETF. But this may not be enough. Since it first filed for the ETF, two major developments now threaten Sonnenshein’s dream of leading the crypto industry into a new era.\n\nThe first is trouble at Grayscale’s parent company. In January, another one of DCG’s main subsidiaries, Genesis, declared its lending unit insolvent, and froze the assets of hundreds of thousands of customers. The legal mess, which is ongoing, has also led to allegations of questionable accounting practices at DCG and its subsidiaries—notably a promissory note with a 1% interest rate that Genesis obtained from DCG in what critics say was a slippery attempt to plug a hole in the now-bankrupt subsidiary’s balance sheet.\n\nThe controversy led the SEC to sue Genesis in January, and, according to an unconfirmed Bloomberg report, has given rise to investigations by the agency and the Justice Department into intracompany loans at DCG. In interviews with Fortune, lawyers said it was hard to characterize the loans as arm’s-length transactions.\n\nFor now, no agency has publicly accused DCG of wrongdoing. The company insists its subsidiaries operate as stand-alone units, and that Genesis executives are responsible for the company’s problems. A DCG spokesperson told Fortune that it arranged the promissory note on the advice of reputable lawyers, and that there was nothing wrong or misleading about the transaction.\n\nIt’s not clear where the chips will land with Genesis and DCG, but, according to lawyers and industry watchers, the debacle may provide the SEC with a new reason to deny or slow-walk Grayscale’s Bitcoin ETF application.\n\n“After last year, there’s mistrust in crypto industry heads, including Barry Silbert, for acting in self-interested ways,” says Damien Scott, a crypto lawyer at Scoolidge, Peters, Russotti & Fox. “That could be weighing on the SEC—‘Do we really want to give it to these guys? A BlackRock or Fidelity is a safer bet.’”\n\nScott’s comment about the SEC awarding the first Bitcoin ETF to BlackRock is not hypothetical—and points to the other major development that could thwart Sonnenshein’s plans.\n\nIn June, the giant asset manager filed an ETF application of its own, a move that goosed crypto prices as analysts took the application as a signal BlackRock believed it would succeed with the SEC where others had failed. “They are about as good as it gets at reading the regulatory tea leaves,” said one. Soon after, Fidelity and other big names filed for Bitcoin ETFs of their own.\n\nThe upshot is that the SEC, whether it wins or loses the Grayscale case, is in a position to award the first Bitcoin ETF to BlackRock or to another familiar name from traditional finance, a move likely to have more political appeal both inside and outside the agency.\n\n“BlackRock is the Apple of the financial industry,” the ETF analyst Balchunas told Fortune. “The key thing people don’t know is advisors love them. It’s like in the ’80s with IBM stock—you can’t get fired buying it.”\n\nAll of this raises the very real question of whether Grayscale would be late to the party, or stuck on the sidelines entirely, as BlackRock and others reap the first fruits of Bitcoin ETFs. And what happens then to Grayscale and all of its customers paying 2% a year?\n\n‘A few big winners—and then you’ll have to be creative or lucky’\n\nIt’s hard to believe Grayscale isn’t worried about Wall Street behemoths muscling in to snatch its long-sought prize. But for now, Sonnenshein is taking the position that his company is the only one that has the operational chops to offer a Bitcoin ETF.\n\n“The filings you’re seeing now are ideas on paper, while Grayscale is a fund with billions of assets and 10 years of operational success,” Sonnenshein told Fortune, adding that the company has always envisioned a landscape with multiple Bitcoin ETFs.\n\nThe problem, however, is that new ETF categories have proved to be a winner-take-all market. That was the case with the first ETF for Bitcoin futures, operated by a firm called ProShares, which now controls over $1 billion in assets and 97% of trading volume. A similar ETF from rival Valkyrie, which launched only a few days after ProShares, controls only around $30 million, according to Balchunas.\n\nThe analyst added that the Bitcoin ETF market is likely to resemble the one for gold. That market featured a dominant early player, but in time grew to include a handful of other firms, which grabbed a slice of the market by offering niche variations or, in the case of BlackRock’s gold ETF, a big discount on price.\n\nIn the current jump-ball environment for a Bitcoin ETF, large and well-known firms have an advantage thanks to their huge marketing budgets and long-standing relationships with brokerages and financial advisors.\n\n“There is potential for a few big winners—and then you’ll have to be creative or lucky,” Balchunas said of the likely trajectory of Bitcoin ETFs.\n\nThere is also the question of how much the ETF issuers will be able to collect. Justin Young, CEO of Volatility Shares, which has created other types of exotic ETFs, told Fortune that the first Bitcoin products to market likely will be able to command a fee of over 1%, but that this will drop rapidly as competitors emerge.\n\nIt‘s unclear where Grayscale will fit into this world. If the company isn’t first to market, it’s likely BlackRock or another rival will vacuum up the vast majority of customers. And while Grayscale has the advantage of possessing millions of GBTC investors—who will automatically be converted to ETF owners under the company’s plan—many of them are resentful over the firm’s refusal to cut fees or issue redemptions. Many will likely bolt.\n\nSonnenshein says Grayscale customers are unlikely to flee to a rival, because doing so would trigger a taxable event if they sell their shares instead of keeping their money in the ETF it plans to create. He also made the case that customers will be well-served by sticking with a company with years of expertise in running crypto funds. And, on a more personal level, Sonnenshein said he believes Grayscale will achieve its destiny as leader of the crypto ETF market.\n\n“I’m very proud of coming through a time after the pandemic that saw different businesses shutting, during Crypto Winter,” he said. “We are built to survive all cycles.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9uZXctdm9sYXRpbGl0eS1mb3ItYml0Y29pbi1lbmRzLXN1bW1lci1zbHVtYmVyLWZvci1jcnlwdG8taW52ZXN0b3JzLTE2MDUzODkwOC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "New volatility for bitcoin ends summer slumber for crypto investors - Yahoo Finance",
        "content": "A new wave of volatility is rippling through the crypto world, ending a period of recent summer slumber for investors in digital currencies.\n\nThe price of bitcoin (BTC-USD) tumbled as much as 9% Thursday and briefly dropped below $26,000, the biggest one-day change in the world’s largest digital currency this year. It is down 8% over the last 24 hours as of 11:30 a.m. ET time Friday.\n\nInvestors sold $489 million in bitcoin futures over a 24-hour period, the largest single-day liquidation since June 2022, according to data provider Coinalyze.\n\nMarket watchers grasped at several theories for the sudden downward movement. Some pointed to news from The Wall Street Journal that Elon Musk's SpaceX had reportedly written down the value of its crypto holdings in 2021 and 2022 and sold those holdings.\n\nOthers pointed to fears of a worsening macroeconomic outlook that might dampen appetite for riskier assets, citing the bankruptcy filing of Chinese property developer Evergrande as well as the possibility that the Federal Reserve could hold interest rates higher for longer.\n\n\"The next week or two is going to be extremely important for this asset class,\" Matt Maley, chief market strategist with Miller Tabak + Co., said in a Friday note, pointing to both the \"higher-for-longer\" outlook at the Fed and \"forced selling\" in the crypto derivatives market as contributors to bitcoin’s sharp drop.\n\nBitcoin’s high point came in 2021 when it surged to $68,789 during an industry boom triggered by a period of low interest rates and fiscal stimulus that put excess savings in the pockets of investors. The market crashed in 2022 as the giant crypto exchange FTX collapsed, before making a surprise comeback during the early half of 2023.\n\nBitcoin surged to a record high in 2021 before crashing in 2022. It staged a comeback during the first half of the year and is now entering a new period of volatility. (STRF/STAR MAX/IPx) (STRF/STAR MAX/IPx)\n\nInvestors will be watching to see whether bitcoin can remain above its next key support level of $25,000. Such a move below that point would prove “bearish” for the crypto market and possibly \"something that could be signaling some more declines in other risk assets in the days and weeks ahead,\" Maley said.\n\nStory continues\n\nThe industry still faces legal and regulatory scrutiny that could also influence prices. Since the beginning of 2023, the Securities and Exchange Commission has charged 17 different crypto actors with violating securities laws, including several exchanges that allow investors to trade digital currencies as well as individual issuers of digital tokens.\n\nThe SEC’s core assertion in many of these cases is that cryptocurrencies are securities, and therefore should be registered with the agency.\n\nThe courts thus far have not been clear on how digital currencies should be treated.\n\nAnalisa Torres, a US judge in the Southern District of New York, said on July 13 that a digital token issued by Ripple Labs was a security only when it was sold to institutional investors, and not when it was purchased by the general public. The SEC had also sued Ripple for selling unregistered securities.\n\nThen July 31, US judge Jed Rakoff disagreed with that specific view in his case, in which the SEC has alleged stablecoin issuer Terraform Labs sold unregistered securities.\n\nThe SEC is expected to file its motion to appeal the ruling by Torres as early as today.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTcvY3J5cHRvLXRyYWRlcnMtc3VmZmVyLTFiLWxvc3Nlcy1pbi1saXF1aWRhdGlvbnMtaW4tc2hhcnAtc2VsbC1vZmYv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8xNy9jcnlwdG8tdHJhZGVycy1zdWZmZXItMWItbG9zc2VzLWluLWxpcXVpZGF0aW9ucy1pbi1zaGFycC1zZWxsLW9mZi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Crypto Traders Suffer $1B in Liquidations in Sharp Sell-Off for Bitcoin, Ether - CoinDesk",
        "content": "Liquidations happen when an exchange closes a leveraged trading position due to a partial or total loss of the trader’s initial money down or \"margin\" – if the trader fails to meet the margin requirements or doesn't have enough funds to keep the trade open. When asset prices nosedive, the dynamic can kickstart a cascade of liquidations, exacerbating losses and price declines."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hdWRpby8yMDIzLTA4LTE3L2JsYWNrcm9jay1zaGFrZXMtdXAtdGhlLWJpdGNvaW4tZXRmLXJhY2UtcG9kY2FzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "BlackRock Shakes Up the Bitcoin ETF Race - Bloomberg",
        "content": "Browse all episodes\n\nBlackRock Shakes Up the Bitcoin ETF Race\n\nCrypto fanatics have been pining for a Bitcoin exchange-traded fund for a decade now. But as the applications piled up, US regulators repeatedly declined to approve one, citing the risk of fraud and market manipulation in cryptocurrency markets. But with the entrance of BlackRock Inc. into the race, many market watchers are hopeful that one or more spot-Bitcoin ETFs will finally get the go-ahead. After all, the world’s largest asset manager has a strong track record of getting funds past regulatory roadblocks. On this week’s episode of the What Goes Up podcast, Eric Balchunas and James Seyffart from Bloomberg Intelligence join to discuss how BlackRock’s application dramatically changes the outlook for Bitcoin ETFs. “When they filed, it was a whole different ballgame in my opinion,” says Balchunas. “The fact is they generally like to bring a gun to a knife fight. This is a firm who doesn’t like to lose, who knows what they're doing, and they must see something.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNubi5jb20vdmlkZW9zL2J1c2luZXNzLzIwMjMvMDgvMTgvZXhwLWJpdGNvaW4tZmFsbC1zcGFjZXgtZHVmZnktbGl2ZS1mc3QtMDgxODA5c2VnMi1jbm5pLWJ1c2luZXNzLmNubtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin falls as SpaceX reportedly dumps the cryptocurrency - CNN",
        "content": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMTgvYml0Y29pbi1oZWFkcy1mb3ItaXRzLXdvcnN0LXdlZWstc2luY2UtbWF5LWFmdGVyLXNsaWRpbmctdG8tMjYwMDAuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA4LzE4L2JpdGNvaW4taGVhZHMtZm9yLWl0cy13b3JzdC13ZWVrLXNpbmNlLW1heS1hZnRlci1zbGlkaW5nLXRvLTI2MDAwLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin breaks below $26,000, posts worst week since May - CNBC",
        "content": "Cryptocurrency prices remained under pressure to end the week.\n\nBitcoin ended the day lower by about 6% at $26,038.41, according to Coin Metrics. It wavered over $26,000 throughout the day Friday, following a stunning fall that began late Thursday.\n\nThe move pulled the rest of the crypto market lower. Ether and Binance coin each fell about 4%, while Cardano's ada lost more than 3% Friday. Ripple's XRP slid 13% and the Solana token lost 7%.\n\nFor the week, bitcoin ended down 11.28% for its seventh weekly loss in the past eight and its worst week since November. Coin Metrics measures a week in crypto, which trades 24 hours a day, from the 4:00 p.m. ET stock market close one Friday to the next.\n\nCrypto was under pressure throughout Thursday but dropped sharply around 6 p.m. ET., following a report in The Wall Street Journal that Elon Musk's SpaceX wrote down the value of its bitcoin holdings by $373 million last year and in 2021, and sold the cryptocurrency."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vY291bGQtY2hpbmEtc2h1dC1kb3duLWJpdGNvaW4tMDcwMDQzNDMxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Could China shut-down the Bitcoin network? | The Crypto Mile - Yahoo Finance",
        "content": "On this week's episode of The Crypto Mile, our host Brian McGleenon spoke with Jameson Lopp, a Bitcoin expert and co-founder of the digital asset security firm, Casa. The conversation centred on the longstanding concerns about the concentration of Bitcoin's mining hashrate within China. The hashrate is a measure of the amount of computational power that Bitcoin miners are utilising to process transactions and safeguard the network. A higher hashrate value signifies more processor chips are being used to mine new bitcoin and verify transactions on the network. Lopp discussed the potential risk of a \"51% attack\" if China gained control of over half the global mining power. He discussed the possibility of the Chinese government launching such an attack, which could effectively shut-down the Bitcoin network.\n\nVideo Transcript\n\nBRIAN MCGLEENON: Today on \"The Crypto Mile,\" I am joined by Jameson Lopp, respected Bitcoin expert and co-founder of Bitcoin security firm, Casa. Today we're going to chat about the significant concentration of Bitcoin mining output within China, and the possibility of a 51% attack on the Bitcoin network emerging from the country. Imagine someone going into a bank and having the power to rewrite whatever figures they wanted in to everyone's bank account. Jameson, welcome to this week's episode of \"The Crypto Mile.\"\n\nJAMESON LOPP: Glad to be here.\n\nBRIAN MCGLEENON: So Jameson, can you explain to us the present situation for Bitcoin and crypto within China? I thought using Bitcoin and Bitcoin mining were both banned in the country, but that may not be so.\n\nJAMESON LOPP: The general sentiment and agreement seems to be that participating in exchange and trade activities around Bitcoin and crypto seems to be banned. Mining also seems to be banned. The last I heard and my understanding is that it is not outright illegal to actually own Bitcoin, but most of the activities around Bitcoin are considered to be illegal.\n\nStory continues\n\nBRIAN MCGLEENON: OK, so if we're talking about Bitcoin mining, that has a connection with the hash rate, and the hash rate is the amount of calculations that go into keeping the consensus mechanism of the blockchain intact. And if the hash power goes up that means more miners are mining to try and acquire new Bitcoin to put onto the network. What is the market share of hash rate that China has at this moment in time?\n\nJAMESON LOPP: Right. It's been all over the place. If I recall correctly, I think it peaked in 2019, and there was around 75% of global hash rate in China. Now, in 2021, that's when we saw the biggest crackdowns and I think the harshest proclamations by government entities basically saying, you know, you need to stop doing this.\n\nAnd 2021, that summer was actually very interesting because over the span of a few weeks, the total hash rate of the Bitcoin network actually got cut in half. And over the next 6 months, the latter half of 2021, we saw that hash rate come completely back online. And what it seemed to be happening was that a large portion of those miners that were operating in China basically turned off their machines, moved them to other more friendly jurisdictions, turned them back on.\n\nLast I checked at the moment, the United States seems to be doing pretty well. I think probably has around 40% of the global hash rate mainly as a result of our more friendly jurisdictions and having a lot of cheap energy in places like Texas and the Northwest with a lot of hydropower.\n\nBRIAN MCGLEENON: Should we be concerned that China has such-- has this kind of majority of the hash rate?\n\nJAMESON LOPP: Pretty much all of the silicon manufacturing, the actual chips that are used in miners are produced in China. So while, you know, China currently doesn't have an overwhelming hash rate, if something changes and it becomes, you know, slightly more friendly again for miners in China, it would not be at all difficult for the hash rate in China to reach new highs.\n\nAnd that's just because they have that direct supply. And when it comes to mining, time is money. If you have to ship your hardware to other countries, you know, every day those machines are in transit, you're essentially losing potential profit. Could China come back and be a dominant force? Sure. But I think for the same reasons that we haven't seen any aberrant activity on the network, even when China had a super majority of hash rate is the same reasons why we wouldn't have to worry about that in the future.\n\nAnd it really comes down to incentives. And that really is know why would miners attack the network? That would cause, you know, massive undermining of confidence in the network and it would probably greatly reduce the current value of the Bitcoin holdings of those miners who tend to hold a lot of Bitcoin and also, of course, effect the future potential profits of it.\n\nBRIAN MCGLEENON: It would be very difficult because of that decentralized nature that you spoke about for the Chinese government to kind of seize mining operators across the country. But let's dive into the potential of the 51% attack. Can you kind of explain the possibility and the severity of such an attack on the network, and what does a 51% attack mean?\n\nJAMESON LOPP: It basically means that if you have even slightest majority of global network hash rate, then you really get to decide which blocks are added to the blockchain. Now, you don't get to decide arbitrarily what the rules of the protocol are. You still have to follow the rules of the Bitcoin protocol. Otherwise, the tens of thousands of validating nodes around the world will simply reject whatever block that you put out on the network.\n\nBut it does mean that you can do a few things that would be extremely annoying. You could, you know, consider it like a denial of service attack. From an incentives perspective, if it was sort of a profit motivated 51% attack, then generally what you would want to do is re-spend your own money.\n\nYou know, you can't spend other people's money, you can't create money out of thin air that the protocol doesn't allow, but what you can do is you can send a transaction, get something in return, and then you can basically roll back that block. You can kind of undo the transaction history and make it as if that transaction never happened, therefore getting your money back into your wallet and then being able to spend it elsewhere.\n\nNow, the other thing that you could do is simply not allow any transactions to go through, or you could say only whitelisted transactions that I approve of can go through. And so you know, that's what you would probably expect from a more authoritarian nation state attack, where they probably are not as motivated from a profit perspective, but they just want to try to kill the network and make it unusable.\n\nBRIAN MCGLEENON: So like looking at Bitcoin at the moment, there's been a lot of institutional interest. We've got the different spot Bitcoin ETF filings. Do you see the institutional interest as a good thing or a bad thing when it comes to crypto and just decentralization, and I suppose the tenants of Satoshi's Whitepaper, in general?\n\nJAMESON LOPP: The vast majority of wealth in the traditional financial system is pretty concentrated, and it's generally in the hands of the institutions that seem to be making a play for these ETFs and trying to grab market share from this new financial industry. So you know, I would expect that the result of this, you know, sure, it will help, you know, mainstream this sector of the economy, but it will also result in the ownership wealth and potentially power dynamics becoming more centralized.\n\nSo this is something that I've been fighting against for the past eight years now. Trying to promote self-custody with individuals holding their own keys is that it's quite clear to me the convenience of letting a trusted third-party like a financial institution hold your money for you, for most people that outweighs the idea of being able to manage your own assets and, of course, all of the responsibility that comes along with that.\n\nSo I've just been-- I've been trying to increase the convenience factor for people to be able to hold their own keys, to be sovereign. You know, take advantage of the unique attributes of these systems that I expect most people will throw out the window, either because they just don't understand them or because it's not presented to them as an option because the incentives are not really there for these large financial institutions to promote people to hold their own money and to not use the institution itself.\n\nBRIAN MCGLEENON: I suppose we're conditioned to trust custodians to look after our wealth. Is there not a liquidity concern here if we're going to use Bitcoin as an equivalent to fiat currencies?\n\nJAMESON LOPP: Yeah, it's kind of the question of, you know, will Bitcoin ever get to the point where it's actually usable as a unit of account? And that's, you know, a big open question. You know, myself as a technologist, I've said for a long time that price stability or lack of volatility or whatever, that is not even a goal of the Bitcoin protocol. It has no knowledge of its own value. It is a, you know, fully self-contained system. And the value that we ascribe to it is, of course, happening on markets and in other places, where we're tying Bitcoin to other assets and trading them.\n\nSo I think a lot of people would say if it becomes big enough, it will become stable. There will never be any guarantee of stability, and the really tricky thing and I think what people-- some people are starting to realize over the past few years is there really is no such thing as stability. You know, every asset, every currency, the value of everything is relative to everything else. And there's so many different variables at play that I think even the idea that you can, quote-unquote, \"stabilize\" the value of anything is pretty ridiculous.\n\nBRIAN MCGLEENON: I suppose we have a precedent anyway we can go back to, and that was the gold standard. But looking at Bitcoin, is it truly decentralized or, you know, considering that the amount of hash power is controlled by such a small group of mining operators worldwide, can we really say that that's a decentralized network?\n\nJAMESON LOPP: Decentralization can be measured in many different ways. As I mentioned earlier, there are tens of thousands of nodes that are validating, essentially auditing the protocol, the blockchain, making sure that everybody is following the rules. They in a sense counterbalance the miners to make sure that the miners are following the rules.\n\nIt is distributing the power so that no one has control over the network. You know, this is the problem with the fiat system with a lot of traditional hierarchical-based systems is that power concentrates at the top. You know, we literally create these pyramid-type structures, but that just doesn't apply to Bitcoin. It's actually this system of anarchy, where there are rules, but there are no set rulers.\n\nAnd it's trying to understand the power balance and how things can change or, you know, who can stop who from doing what turns into a really lengthy discussion that we actually spent many years arguing about during the scaling wars. All that we really know is that Bitcoin seems to be decentralized enough for the current state of the world and the various powers that would like for it to cease to exist.\n\nAnd we can never really know for sure if it is decentralized enough to withstand the next level of attack. We should expect that attacks will continue to happen, especially, you know, if this ecosystem continues to go more mainstream and threatens more of the authorities around the world. And as those attacks come in, those of us like myself who are paying attention and who care and who want to protect the system will come together and discuss, you know, what needs to be done to try to fight against this attack.\n\nBRIAN MCGLEENON: Well, Jameson, thanks very much for coming on this week's episode of \"The Crypto Mile.\" It's been great talking to you.\n\nJAMESON LOPP: Thanks for having me.\n\n[MUSIC PLAYING]"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMTcvYml0Y29pbi1uZWFycy0yLW1vbnRoLWxvdy1hZnRlci1mZWQtbWludXRlcy1kaWFsLXVwLWluZmxhdGlvbi13b3JyeS5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDgvMTcvYml0Y29pbi1uZWFycy0yLW1vbnRoLWxvdy1hZnRlci1mZWQtbWludXRlcy1kaWFsLXVwLWluZmxhdGlvbi13b3JyeS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin falls to lowest level in nearly two months after Fed minutes dial up inflation concerns - CNBC",
        "content": "The minutes cautioned that Fed officials see \"upside risks\" to inflation that could potentially lead to more rate hikes. At that meeting, Fed raised its benchmark interest rate to the highest in more than 22 years . Markets have been betting the central bank wouldn't make any more moves on interest rates this year. In reaction, the stock market fell for a second straight day Wednesday and the 10-year U.S. Treasury yield hit its highest close since 2008.\n\nBitcoin was last lower by about 4% at $27,901.60, according to Coin Metrics. The slide began after the minutes of the Federal Reserve's July policy meeting were released Wednesday. Earlier Thursday, it fell to $27,858.94, its lowest level since June 20.\n\nCryptocurrencies were under pressure Thursday as investors grappled with renewed concerns about the U.S. economy.\n\nBitcoin's correlation with stocks is at its lowest level in two years, according to Coin Metrics, but in 2022 it shot to an all-time high in response to the Fed's rate-hiking campaign to tame inflation.\n\n\"Although inflation in itself could be an argument for growth in crypto assets, with inflation comes other aspects like risk off appetite from investors fearing a recession, and avoiding what bitcoin is deemed to be, riskier assets,\" said Sylvia Jablonski, chief investment officer at Defiance ETFs.\n\n\"My suspicion is that the higher beta equities and crypto are the victims of the end of summer lag, range-bound trading, no volume, which is typical in August — with the hawkish Fed as the cherry on top to keep investors to the side and prices in this tight range,\" Jablonski said.\n\nBitcoin and ether's 90-day volatility dropped to multiyear lows at 35% and 37% this week, respectively, according to Kaiko.\n\nNeedham's John Todaro added that bitcoin's move back to $30,000 in late June \"had been on light volume so that rally has not had a ton of strength.\" The eventual debut of a spot bitcoin ETF, one of crypto's biggest positive catalysts, also lost some steam this week, he added.\n\n\"With a U.S. [spot bitcoin] ETF likely not seeing a near term decision given the setback this week as well as expectations for higher rates for longer, bitcoin and crypto broadly are pulling back,\" he told CNBC. \"Remaining catalysts are Halving expectations in Q1-Q2 '24 and any on-going ETF related comments from the SEC.\"\n\nSeveral of the top crypto assets by market cap — including Binance's BNB coin , Ripple's XRP and the solana and polygon coins — were lower by more than 3% on Thursday. Ether fell 4%."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzE3L3RldGhlci1zdG9wcy1zdXBwb3J0LWZvci1iaXRjb2luLWxheWVyLW9tbmktY2l0aW5nLWxhY2stb2YtZGVtYW5kL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzE3L3RldGhlci1zdG9wcy1zdXBwb3J0LWZvci1iaXRjb2luLWxheWVyLW9tbmktY2l0aW5nLWxhY2stb2YtZGVtYW5kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Tether Stops Support for Bitcoin Layer Omni Citing Lack of Demand - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTE3L2JpdGNvaW4tdG91Y2hlcy1hbi1hbG1vc3QtMi1tb250aC1sb3ctYXMtcmF0ZS1jb25jZXJuLWxpbmdlcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Touches an Almost 2-Month Low as Rate Concern Lingers - Bloomberg",
        "content": "Bitcoin fell below $26,000 for the first time in two months as risk aversion weighs on the cryptocurrency market with global government bond yields climbing to the highest in about 15 years.\n\n“When you throw in what is happening in the bond market, it becomes easy for Bitcoin prices to soften,” Edward Moya, senior market analyst at Oanda, said in a note."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTE4L2JpdGNvaW4tcGx1bmdlLXNwdXJzLWxpcXVpZGF0aW9ucy1hcy1zcGFjZXgtcy10b2tlbi1zYWxlLXdlaWdoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Calm Shatters With Sudden Tumble, Mass Liquidations - Bloomberg",
        "content": "A period of unusual calm in crypto markets ended abruptly this week as the notion of higher-for-longer interest rates sparked a selloff in risk assets like Bitcoin, leading to mass liquidations of bullish bets.\n\nThe rout pushed Bitcoin from near $29,000 to as low as $25,314 in a 24-hour span. More than $1 billion of positions were unwound in the selloff, according to Coinglass data. The original cryptocurrency was down 5.7% to $26,057 as of 3:29 p.m. in New York."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wOC8xOC9lbC1zYWx2YWRvci1kaWFyeS1saWdodG5pbmctaXMta2V5LXRvLWJpdGNvaW4tYWRvcHRpb24v0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA4LzE4L2VsLXNhbHZhZG9yLWRpYXJ5LWxpZ2h0bmluZy1pcy1rZXktdG8tYml0Y29pbi1hZG9wdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "El Salvador Diary: Lightning Is Key to Bitcoin Adoption - CoinDesk",
        "content": "When I explored Presidente Plaza, one of the newest malls in the country that is not yet fully built, I tried to use my Wallet of Satoshi several times. The coffee shop did not have a functioning bitcoin PoS system, nor did the comic shop that I entered. I ended up paying using a credit card both times, and the vendors utilized hand-held BAC Credomatic scanners. These are very common in San Salvador and have the option for credit or debit. It was not immediately clear to me whether the vendors even owned bitcoin PoS devices."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDgvMTgvY3J5cHRvLWJpdGNvaW4tZG93bnRydW4teHJwLWxpdGVjb2luLWJpdGNvaW4tY2FzaC1kb3duL9IBYWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDgvMTgvY3J5cHRvLWJpdGNvaW4tZG93bnRydW4teHJwLWxpdGVjb2luLWJpdGNvaW4tY2FzaC1kb3duL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Crypto selloff intensifies, with XRP, Litecoin, and Bitcoin Cash among the hardest hit - Fortune",
        "content": "The world’s largest cryptocurrency by market capitalization came back into rare, volatile form on Thursday evening, dropping off a cliff—and pulling the rest of the crypto market with it.\n\nIn the past day, Bitcoin is down almost 8%, nose-diving from just above $29,000 to a low of approximately $25,400. At the time of publication, the cryptocurrency has partially rebounded, trading above $26,000.\n\nBitcoin, though, was not the hardest hit in the crypto selloff. Among the largest cryptocurrencies by market cap, XRP, Litecoin, and Bitcoin Cash stood out for even greater drops. XRP was down about 13%, Litecoin 13.6%, and Bitcoin about 10% over the past 24 hours.\n\nThe total cryptocurrency market has declined about 6.6%, more than either the Nasdaq or S&P 500, which are down 2.5% and 1.6%, respectively. Approximately $60 billion has evaporated from the total cryptocurrency market cap in the past 24 hours, according to CoinMarketCap.\n\nThe sudden floor falling out of the crypto market follows an unusual period of stability, as Bitcoin traded near $30,000 for more than a month after rallying in the wake of a flurry of applications for Bitcoin spot ETFs, most notably from BlackRock, in June.\n\nWhile the reasons for Bitcoin’s drop aren’t immediately apparent, the larger macroeconomic outlook has looked queasy in the past week, especially given recent concerns over the spiraling of China’s state-owned property developers. The selloff is not, per initial reports, the result of hundreds of millions in Bitcoin sales from Elon Musk’s SpaceX.\n\n“While the dip might appear sudden, it was precipitated by a combination of events that contributed to the decline,” James Butterfill, head of research at digital assets investment firm CoinShares, recently wrote. He pointed to a number of probable causes, including concern over China’s economic outlook, low Bitcoin trading volumes, and the continuing weight of regulatory actions on the market.\n\nDespite the recent downturn in the crypto market and Bitcoin, the world’s most popular cryptocurrency is still riding high after starting the year at less than $17,000. Even after its sudden dip, Bitcoin is still up more than 56% year to date."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vc3RvY2tzLXRvZGF5LWJpdGNvaW4tdHVtYmxlcy1vcHRpb25zLTE0MTYxMTM4Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Stocks today: Bitcoin tumbles, options expiration - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) is continuing to tumble following a selloff that started Thursday afternoon. Meanwhile, options expiration is adding some volatility to the trading day. Yahoo Finance Markets Reporter Jared Blikre breaks down the market action.\n\nVideo Transcript\n\n- Bitcoin has recovered slightly after briefly dipping below the $20,000 mark, following reports that Elon Musk's SpaceX had offloaded the cryptocurrency. Another event you need to keep your eye on today, a major options expiry. Yahoo Finance's Jared Blikre joins us from the floor of the New York Stock Exchange to really connect the two and break it all down for us. Jared.\n\nJARED BLIKRE: Yeah. I think the big question in crypto is is there a whale selling right now? It would appear so. Bitcoin has been relatively quiet recently. And let's go to the YFi Interactive and chart the recent price action. Here, we can see Bitcoin down 7.44% over the last 24 hours. And here is a three month chart. And I was standing here yesterday afternoon close to the close, just remarking how it had come down to the bottom of this channel.\n\nAnd we were looking for a potential rebound that did not happen. There was just a washout all the way down to about $25,000, which happens to be above the three-month low. Let's take a look at the year to date chart. We had what could be considered a bullish flag here, but that is out the window. We just have more choppiness inside this range. And there are a lot of expectations when Bitcoin first headed north of $30,000 and then again thinking, well, we're going to get some continuation to the upside.\n\nBut there's just huge overhead supply there. And apparently, it was too much for the market. I will show you the high coincided with this overhead supply-- this giant, giant top right here. So still got some things to work through. And now, the onus is on the bears to prove the case because the bulls apparently have given up a little bit. But one of the things I've been tracking this week, and in fact over the last two weeks, has been the fringier parts of the market, including Bitcoin.\n\nStory continues\n\nI'm going to go to my leaders page here on the YFi Interactive. You can see for the day, BITO, that's the Bitcoin ETF. That is down the most, followed by Chinese internet ETF, KWEB. But over the last five days, we've seen meme stocks and Bitcoin really be two of the big losers this week. Why is that? I think because August was expected to be and it has turned out to be a relatively bearish month. We're expecting this to go sideways for the next few months. We also have increasing volatility into September and October.\n\nSo given the gains that we've seen year to date, we were ripe for this situation. The big question is, what happens next? And that kind of leads me into the next topic you mentioned, which was options expiration. What's going on in the options market? Here, I have the S&P 500. You can see we're in the midst of this 5% correction right now. By the way, that's not even-- well that is more than half of the correction we saw due to the regional bank crisis. That was about 9% or so. And we're just looking at 5% right here.\n\nBut you take a look at the VIX. The VIX is picking up. And an analysis by Jefferies out today or yesterday said the pain trade now is decisively to the downside. We saw the Bank of America fund manager survey come out this week, where we saw the least amount of bearishness since February of last year. That was before the Fed kicked off its huge interest rate raising campaign.\n\nAnd so you put all this together, it looks like the bulls have something to prove in this market. And they really haven't for some time. It's been more or less a glide path on the way up. So for substantial correction in a while, we have OpEx this morning. Index options have expired on the open. And now we're waiting until after the close, those last prints of the day, for individual options to expire. There is a lot of put buying, a lot of protection buying coming into this.\n\nPut-to-call ratios, they soared this week. So so much for those zero days to expiration, that phenomenon, and so much for those calls that everybody was buying before. It's all about protection now, guys.\n\n- I'm sure that's what everyone is enthusiastically talking about behind you on the floor here this morning.\n\nJARED BLIKRE: I have no idea what's going on here but--\n\n- I don't know. People are glad it's Friday. I know I am. Maybe that's what's going on. Jared, thank you so much. Appreciate it."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTcvYml0Y29pbnMtMjAyMy1idWxsaXNoLXRyZW5kbGluZS1pbi1mb2N1cy1hcy10cmFkZXJzLXNlYXJjaC1mb3ItZGlyZWN0aW9uYWwtY2x1ZXMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTcvYml0Y29pbnMtMjAyMy1idWxsaXNoLXRyZW5kbGluZS1pbi1mb2N1cy1hcy10cmFkZXJzLXNlYXJjaC1mb3ItZGlyZWN0aW9uYWwtY2x1ZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin's 2023 Bullish Trendline in Focus as Traders Search for Directional Clues - CoinDesk",
        "content": "\"Prices might fall back and re-test the $25,000 support level associated with the Blackrock Bitcoin ETF filing [if the rising trendline is violated]. Investors are well advised to keep their crypto exposure to a minimum and use options,\" Thielen said in a note to clients on Thursday."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTgvbm8tc3BhY2V4LWlzbnQtdGhlLWNhdXNlLW9mLXRoaXMtbXVsdGktYmlsbGlvbi1kb2xsYXItYml0Y29pbi1ibG9vZGJhdGgv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8xOC9uby1zcGFjZXgtaXNudC10aGUtY2F1c2Utb2YtdGhpcy1tdWx0aS1iaWxsaW9uLWRvbGxhci1iaXRjb2luLWJsb29kYmF0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "No, Elon Musk's SpaceX Isn't the Cause of This Multi-Billion-Dollar Bitcoin Bloodbath - CoinDesk",
        "content": "A federal appeals court will publish its ruling on the ongoing Grayscale vs. SEC case that would determine if the U.S. Securities and Exchange Commission (SEC) was unreasonable in its repeated denial of Grayscale’s proposed bitcoin ETF. The ruling, in Grayscale’s favor, is expected to create a marketwide surge, while the opposite could jolt markets further."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvZXhwZXJ0cy1wcm9qZWN0aW5nLWJpZy1iaXRjb2luLXJhbGx5LWV0Zi1hcHByb3ZhbC_SAV9odHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2V4cGVydHMtcHJvamVjdGluZy1iaWctYml0Y29pbi1yYWxseS1ldGYtYXBwcm92YWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Experts Still Projecting Big Bitcoin Rally on ETF Approval - ETF Trends",
        "content": "Approval of a spot bitcoin exchange traded fund in the U.S. is one of the most widely anticipated and delayed events in the roughly three-decade history of the ETF industry.\n\nThose delays are popping up again. The Securities and Exchange Commission (SEC) recently put off decisions on some recent spot bitcoin ETF filings until next year. That’s not unusual – the commission has an established history of doing that. Nor does it mean those filings will be rejected. For now, however, there’s plenty of speculation and not much in the way of tangible results in terms of these ETFs coming to market in the U.S.\n\nOne thing that crypto bulls and market observers can agree on is that the price of bitcoin could surge in epic fashion if related spot ETFs are approved in the U.S. If that happens, established crypto-related ETFs such as the Invesco Alerian Galaxy Crypto Economy ETF (SATO) could generate noteworthy upside of their own.\n\nWhy SATO Is Relevant Here\n\nOn the spot bitcoin ETF approval front, SATO is relevant for multiple reasons. First, the bulk of the ETF’s 36 holdings are bitcoin miners – an asset class intimately correlated to the digital currency’s price action.\n\nSecond, SATO’s largest holding is the Grayscale Bitcoin Trust (GBTC) . That fund would likely rocket higher if a spot bitcoin ETF comes to life. In fact, Grayscale is attempting to convert GBTC to the ETF wrapper. GBTC accounts for 17.66% of SATO’s roster. The point is the approval of a spot bitcoin ETF has implications, most of them positive, for assets like SATO. Consider the following.\n\nIn a recent interview with CNBC, Fundstrat’s Tom Lee said a US-listed spot bitcoin ETF could lead to favorable supply/demand dynamics for the digital currency. That would potentially take its price to $150,000 and perhaps as high as $180,000. Those prices are more than five and six times where bitcoin resides at this writing.\n\nEven if the SEC doesn’t approve a spot bitcoin ETF, there are avenues for bitcoin to deliver 2024 upside. Though not likely to the tune of reaching six-figure territory. Lee mentions the 2024 halving and the possibility of a more accommodative monetary policy from the Fed as potential catalysts for the cryptocurrency next year.\n\n“Crypto is dependent on monetary policy. So, if inflation is cooling, then we can start to bet on forward financial conditions easing and central bank easing sooner,” Lee said in the CNBC interview. “That’s bullish for crypto or alternative assets.”"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1zaW5rcy1iZWxvdy0yOGstY3J5cHRvLTIwMjIwMTY5OC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin sinks below $28K as crypto-tied stocks fall into the red - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) prices fall below $28,000 after Coinbase (COIN) received regulatory approval to offer crypto futures. Yahoo Finance Markets Reporter Jared Blikre explores the price action surrounding the crypto space and how crypto-related stocks are faring ahead of Thursday's closing bell.\n\nVideo Transcript\n\nJARED BLIKRE: I haven't talked about crypto in a while. Let's take a look at the Wi-Fi interactive, where we are seeing some definite downside action, and not only Bitcoin but Ethereum. Each down about 4%. And here is a three-month chart of Bitcoin.\n\nAnd you can see, after reaching this local peak here in early July, it has just been a steady slog down for Bitcoin, now reaching the lowest levels in about two months and also having the worst day in a month. Just haven't seen much volatility lately. In fact, most days you see crypto doing practically nothing. So kind of in and of itself, something worth mentioning.\n\nA couple of things on the horizon here, we just got Coinbase, one of the biggest brokers in the world, also in exchange, got permission from the Commodity Futures Training Commission only yesterday to become a futures commission merchant. So this is going to mean that they can sell to their customers futures contracts in both Bitcoin and Ethereum, anything else that comes down the pike that's authorized by the CFTC. It doesn't really change the regulatory game that much.\n\nThey still have problems with the SEC, but it does kind of make the SEC look out of step. So let's get back to the charts here. Here's Bitcoin. I was showing you the last three months. But interesting thing that's happening over the last year, guess what?\n\nWe are now poking just below this lower trend line. So really, the bulls want to get above $28,000, $28,500 pretty soon here. Otherwise, it's going to start looking like a breakdown. Now, crypto is known for a lot of false breakdowns. I'm always on alert for one of those, and that usually happens over the course of a few days.\n\nStory continues\n\nSo we'll look to see what's happening here in the crypto universe. I can also take a look at some of the crypto stocks. This is just what's happened today. Some of these names like Riot Blockchain down 10%. But a lot of these names have simply been decimated.\n\nHere is a year to date look though. You can see huge, huge gains. Let's take Mara for instance, Marathon Digital Holdings. The local minimum was in January, had a big peak in July. But most of these assets have sold off in the general risk-off fever that we've had, and a lot of that simply has to do with interest rates.\n\nWe've had the long end of the curve. This is a 10-year T-note yield over the last three months. This has been absolutely screaming higher. That puts pressure on Bitcoin. Bitcoin does not offer a rate of return.\n\nSo the thinking goes, well, higher rates, missing out on something there. There is another alternative. So just in general, when we have these rates screaming higher, it's an easy excuse to sell Bitcoin, and perhaps that's what's happening here. But really want to see $28,500 in the near future for Bitcoin bulls. Guys.\n\n- All right. Jared with the levels for us to watch. Jared Blikre at the New York Stock Exchange. Thank you so much."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktZGlkLWJpdGNvaW4tcHJpY2Utc3VkZGVubHktZHJvcC1hbmFseXN0cy1leHBsYWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Why did Bitcoin drop? Analysts point to 5 potential reasons - Cointelegraph",
        "content": "Elon Musk’s SpaceX reportedly selling its Bitcoin (BTC) holdings, the bankruptcy of a Chinese property giant, and fears of interest rate hikes have been among the theories raised as to Bitcoin’s freak price dip.\n\nOn Aug. 18 around 9:35 pm UTC, the price of Bitcoin suddenly plummeted over 8% in a span of 10 minutes, taking with it the wider cryptocurrency market, leaving many in the crypto community scratching their heads.\n\nthe fuck was that? pic.twitter.com/Lh2zGXv29n — Molly White (@molly0xFFF) August 17, 2023\n\nWhile there appears to be no consensus as to why the markets suddenly dropped, several crypto market analysts have shared their initial theories with Cointelegraph.\n\nSpaceX offloads Bitcoin, interest rate fears\n\nEToro market analyst Josh Gilbert pinned the drop on a report that SpaceX may have offloaded some or all of its $373 million in Bitcoin holdings, which came from an Aug. 17 article from The Wall Street Journal.\n\n“Whenever you have a big name in the industry selling Bitcoin, especially someone as influential as Elon Musk, it will put the price under pressure.”\n\nThis would put the sudden price drop around 2.5 hours after the report was published online.\n\nNews: Somebody somewhere sold their Bitcoin at an unspecified time in the past...\n\n\n\nMarket reaction pic.twitter.com/3yb0Rssdsa — Lark Davis (@TheCryptoLark) August 18, 2023\n\nGilbert said another theory could be the rapid shift in sentiment, due to the broader markets’ expectations of future interest rate hikes from the U.S. Federal Reserve.\n\n“If we also consider some of the weaknesses we’ve seen across global markets — particularly risk assets — over the last few weeks with the expectation that rates will likely stay higher for longer, it was a recipe for a pullback,” Gilbert explained.\n\n“Bitcoin has struggled for a leg higher in the last month, trading in a tight range of between $29k and $30k with little ‘good news’ to push the asset higher, which has only exuberated this sell-off,” he added.\n\nGovernment bond yields\n\nTina Teng, a market analyst from CMC Markets, shared a different opinion, looking to the recent rise in government bond yields as the root cause behind the sell-off.\n\nTeng explained that increasing bond yields typically shows a reduction in liquidity for the broader market.\n\n“This could be the primary reason that cryptocurrencies sank,” she said.\n\nAdditionally, Teng said that while the Evergrande crisis could have an indirect cause on the price of Bitcoin she didn’t believe that it was among the root causes of the decline. “This has more of an impact on sentiment toward the Chinese economy and investors,” she explained.\n\nno clear trigger\n\n\n\ndef not Evergrande, tradfi barely moved on the news — Alex Krüger (@krugermacro) August 17, 2023\n\nChinese Yuan still a risk to Bitcoin\n\nHowever, while Teng disregarded the Evergrande crisis as a major reason for Bitcoin’s price swing, Matrixport Head of Research Markus Thielen claimed the risk of a Chinese Yuan devaluation may have played a significant role in the sell-off.\n\n“The biggest macro risk is a potential devaluation of the Chinese Yuan, which is trading at the weakest level since 2007.”\n\n“In August 2015, when China devalued the Yuan for the last time, Bitcoin prices declined by -23% during the two weeks following the devaluation. Before a more meaningful rally started, Bitcoin finished the year +59% from the level of the devaluation,” explained Thielen.\n\nWhale's selling big\n\nWhile there were many other news events that could bear responsibility, pseudonymous derivatives trader TheFlowHorse told Cointelegraph that the sudden move down could have resulted from a single large actor making a big sell, which then resulted in further pressure on derivatives.\n\n“It was not just a natural cascade. Someone big bailed for a purpose and set it in motion. Spot volume barely compared to perps.”\n\nAccording to data from the crypto analytics platform Coinglass, more than $427 million in Bitcoin long positions were liquidated in the four hours to time of publication. Over the course of the last 24 hours, there had been more than $822 million in liquidations for traders with open long positions — a bet that the price of crypto assets would move upwards.\n\nMore than $427 million worth of Bitcoin long positions have been liquidated in the last 24 hours. Source: Coinglass\n\nDescribing much of the explanations for the decline as “pure speculation,” Horse suggested that since the reports of the SEC hinting its approval of an Ethereum Futures ETF came moments after the dump — a large fund may have offloaded their Bitcoin position to “trigger a cascade to buy ETH.”\n\nRelated: Bitcoin price briefly dips below $26K, falling to two-month lows\n\nBitcoin had recovered slightly since the crash, gaining 1.2% in two hours, according to data from TradingView. At the time of publication, Bitcoin was changing hands for $26,619.\n\nIts price seems to have been buoyed by news that the SEC may look to approve an Ethereum Futures ETF product as soon as October.\n\nDeposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTE3L2NyeXB0by1idWxscy1zdG9rZWQtYnktYml0Y29pbi1idGMtZXRmLWh5cGUtc2hydWctb2ZmLWV0aGVyLWV0aC1mdW5kLXB1c2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Crypto Enthusiasts Stoked by Bitcoin-ETF Hype Shrug Off Ether-Fund Push - Bloomberg",
        "content": "Ether-futures ETFs could be coming to the US soon, but the cryptocurrency market doesn’t seem to care.\n\nEight companies — including Bitwise, Volatility Shares and ProShares — have in recent days filed applications for exchange-traded funds based on futures for the second-largest digital token , according to a Bloomberg Intelligence tally. Some of the filings even propose to list more exotic versions of the product, such as Bitcoin-Ether-futures medleys."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vbWFya2V0cHVsc2UuY29tL2NyeXB0by9idGMtdXNkLWJpdGNvaW4tY3Jhc2gtdHJpZ2dlcnMtbWFzc2l2ZS1saXF1aWRhdGlvbnMvZW1veWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "BTC/USD: Bitcoin crash triggers massive liquidations - MarketPulse",
        "content": "Bitcoin fell to a two-month low as $1billion of losses occurred over past 24 hours\n\nElon Musk’s SpaceX reportedly sold all its Bitcoin, after writing down holdings in 2021 and 2022\n\nBitcoin under pressure as global risk aversion leads to de-risking moment\n\nBitcoin’s plunge stemmed from nervousness about the looming US Bitcoin ETF decisions and on concerns that China’s property crisis could lead to further downward pressure for risky assets. Now that Bitcoin fell below the key trading range of $28,500 to $30,500, all eyes will be on the $25,000 level.\n\nBitcoin ETF rulings will start to happen and some traders are nervous that might not go so well. Grayscale might get a ruling next week, but expectations are for more rulings to happen in September. The bullish case for Bitcoin is that positive developments with an US Bitcoin ETF breakthrough could help prices make a run back towards the $30,000 region. Bitcoin’s current downtrend however could get uglier if some of these rulings suggest a US ETF still remains distant or if the bond market selloff continues.\n\nBitcoin is once again acting like a risky asset and next week should be critical for Bitcoin. If monetary conditions continue to crush risky assets, Bitcoin selling could target the $21,500 region.\n\nContent is for general information purposes only. It is not investment advice or a solution to buy or sell securities. Opinions are the authors; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. If you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please access the RSS feed or contact us at info@marketpulse.com. Visit https://www.marketpulse.com/ to find out more about the beat of the global markets. © 2023 OANDA Business Information & Services Inc."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLXBsdW5nZS1lbG9uLW11c2tzLXNwYWNleC1zb2xkLTM3My1taWxsaW9uLXN0YWtlLTIwMjMtONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Price Plunges After Elon Musk's SpaceX Reportedly Sold the Crypto - Markets Insider",
        "content": "Bitcoin plunged about 10% after it was revealed that SpaceX sold the cryptocurrency.\n\nThe Wall Street Journal reported that SpaceX wrote down the value of bitcoin it owns by $373 million.\n\nThe recent jump in bond yields to 16-year highs has weighed on risk assets overall, including crypto.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe price of bitcoin plunged about 10% hours after it was revealed that Elon Musk's SpaceX sold the cryptocurrency.\n\nThe Wall Street Journal reported on Thursday that SpaceX, which first purchased bitcoin in 2021, wrote down the value of its bitcoin holdings by a total of $373 million in 2021 and 2022 and has sold the crypto.\n\nThe write-down coincides with a steep drop in bitcoin's price, which crashed in late 2021, setting off a \"crypto winter\" that extended through most of 2022.\n\nMeanwhile, Musk's electric vehicle company Tesla made similar moves with bitcoin. Last year, the company disclosed that it sold most of its bitcoin holdings after acquiring it in 2021.\n\nAdvertisement\n\nFollowing the WSJ report, which cited SpaceX financial documents, the price of bitcoin plunged about 8% to about $26,500, and has since further decline to about $26,200. The price of bitcoin is down 11% over the past week, trading at levels last seen in mid-June.\n\nThe jump in bond yields has also been weighing on risk assets overall, including crypto. On Thursday, the 10-year Treasury yield hit the highest level since 2007 amid indications the Federal Reserve remains hawkish on rates.\n\nPrior to the recent slide, bitcoin had been trading in a sideways range for months as investors held out hope for the potential SEC approval of a spot bitcoin ETF, with applications from big-name financial institutions like BlackRock.\n\nFundstrat's Tom Lee has argued that a potential bitcoin ETF approval could send the cryptocurrency to new highs above the $100,000 level.\n\nAdvertisement\n\nBut the SEC has yet to show any indication that an approval is imminent, and more recently has delayed action on several bitcoin ETF applications."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGluYS1zaHV0LWRvd24tYml0Y29pbi1uZXR3b3JrLWNyeXB0by1wcmljZS1jcnlwdG9jdXJyZW5jeS0wOTI2MzMyMzkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Could China shut down the bitcoin network? | The Crypto Mile - Yahoo Finance UK",
        "content": "Watch: Could China shut down the Bitcoin network? | The Crypto Mile\n\nChina-based cryptocurrency miners have the potential to regain dominance over the bitcoin network. Yahoo Finance talked to an expert about the risks this would present for the world's largest digital asset.\n\nOn this week's episode of The Crypto Mile, Yahoo Finance UK spoke with Jameson Lopp, bitcoin expert and co-founder of digital asset security firm Casa. The conversation centred on the longstanding concerns about the concentration of bitcoin's (BTC-USD) mining hash-rate within China.\n\n\"An authoritarian nation-state, like China, could conduct an attack that would kill the bitcoin network and make it temporarily unusable,\" Lopp told Yahoo Finance.\n\nADVERTISEMENT\n\nRead more: Sovereign agents: Your own personal AI assistant? | The Crypto Mile\n\nSuch an attack would manifest as a \"51% attack\", where a single entity gains control of over more than half of the bitcoin hashrate, enabling them to control the verification of transactions and the mining of new bitcoins.\n\n\"An authoritarian style 51% attack on the bitcoin network, from say the Chinese government, could come in the form of not allowing any transactions to happen on the network, or only allowing white-listed transactions to go through,\" Lopp added.\n\nThe bitcoin hashrate\n\nThe hashrate is a measure of the amount of computational power that bitcoin miners are utilising to process transactions and safeguard the network. A higher hashrate signifies more processing chips are being used to mine new bitcoin and verify transactions on the network.\n\nChina recently dominated the world's share of the bitcoin hashrate. And, according to Jameson Lopp, this dominance is something they could quickly regain.\n\nRead more: Institutional investment brings new momentum to crypto\n\n\"In 2019, about 75% of global hash-rate was coming out of China. But, 2021 saw the Chinese government's biggest crackdown on bitcoin mining. The hashrate was cut in half, and many miners went to friendlier jurisdictions,\" Lopp said.\n\nStory continues\n\nHe added that despite the Chinese government ban, there are still many miners spread across the vast country. According to recent data from Statistica, Chinese miners still control 21% of current bitcoin mining output. The US maintains the largest share, at 35.4%.\n\nCould China regain mining dominance?\n\nThere are still concerns over China's ability to regain its former dominant position. \"Nearly all of the silicon chips used in bitcoin mining are produced in China,\" Lopp said. Re-routing this supply to domestic miners would deny those overseas access to new hardware, giving Chinese miners a competitive advantage.\n\nRead more: Bitcoin rallies to $30,000 after BlackRock's ETF filing\n\nThese silicon chips are called ASICs, and are tailored for a single, specific task. In the case of bitcoin mining, this is solving the cryptographic puzzles required to mine the digital asset and verify transactions.\n\n\"While China doesn't have an overwhelming hashrate, if something changes and it becomes a slightly more friendly place again for miners, China could dominate the network,\" Lopp said.\n\n\"If regulations ease in China, they have the tools at hand to quickly reach new zeniths in mining,\" he added.\n\nWatch: Institutional investment brings new momentum to the crypto-space | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wOC8xNy9iaXRjb2luLXNwb3QtZXRmLWNyeXB0by1kZW1hbmQv0gFFaHR0cHM6Ly90ZWNoY3J1bmNoLmNvbS8yMDIzLzA4LzE3L2JpdGNvaW4tc3BvdC1ldGYtY3J5cHRvLWRlbWFuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "A bitcoin spot ETF could open the floodgates for wider crypto demand - TechCrunch",
        "content": "Years after it got initial approval, Jacobi Asset Management’s bitcoin spot exchange traded fund (ETF) went live this week, making the product the first of its kind in Europe.\n\nThis is only the latest sign that Europe is making steady progress toward integrating crypto assets inside traditional financial instruments. Meanwhile, the U.S. Securities and Exchange Commission (SEC) is dragging its feet by delaying deadlines for similar applications.\n\nThat’s not to say there hasn’t been any progress stateside. According to Eric Balchunas, senior ETF analyst at Bloomberg, bitcoin futures ETFs do exist in the United States, but they account for only about $1 billion in total assets under management (AUM), “So that does exist, but the spot is the holy grail. The spot bitcoin ETF [will be] major,” he said on TechCrunch’s Chain Reaction podcast.\n\nThe difference between a spot ETF and a futures ETF is that the former actually purchases and holds the underlying assets. It’s a more popular approach than futures-related ETFs. According to Balchunas, spot gold ETFs, for example, have consumed the majority of gold ETF activity, and bitcoin could be traded similarly if it gets regulatory approval.\n\nFor an advisor, a bitcoin spot ETF wouldn’t be the main part of their portfolio; it would be like hot sauce — a small bit on top. Eric Balchunas, senior ETF analyst, Bloomberg\n\nLots of money is potentially up for grabs. “The stakes are high” for the various entities working to bring a spot bitcoin ETF to the American market, Balchunas argued. About 10 firms are competing to get the first bitcoin spot ETF approved in the U.S., and BlackRock, which has more than $9 trillion in assets under management, filed for its own offering in June.\n\nBlackRock also partnered with Coinbase in 2022 to provide its institutional clients with access to cryptocurrency, and later launched its own spot bitcoin private trust for U.S. institutional clients.\n\n“The question is, will [the SEC] approve [a bitcoin spot ETF], when will they approve it and how many they’ll approve at once,” Balchunas said. Right now, he and other Bloomberg analysts estimate 65% odds that the regulator will approve one or more by the end of the year. The odds are even higher for next year.\n\n“Everything is evolving towards that,” Balchunas added. “I don’t think it’s going to completely change the face of crypto. I think what it does is offer a portal for a big lump of money that largely would not probably deal with bitcoin, [but] might now. That would be the $30 trillion that financial advisors manage in America.”\n\nIn other words, a bitcoin spot ETF could be considered the bridge that connects trillions of dollars to crypto. “Not everyone is going to cross that bridge, but you’ll certainly find some traffic there,” Balchunas said.\n\nWhy do we care about bitcoin ETFs?\n\nWhy does an ETF matter, since we have so many exchanges around the world that allow consumers and institutions alike to purchase crypto-related assets and securities? Well, because ETFs could allow folks in the traditional financial world to buy into the crypto market using their existing investing services — companies like Fidelity and Vanguard that may hold retirement assets, for example.\n\nBringing bitcoin to the TradFi market in a manner that is already well-understood from an operational, trading, and fee perspective, could unlock lots of demand for the cryptocurrency in the near-term. Such interest could lead to the ETF in question buying more total bitcoin to meet demand, shifting crypto’s supply equation. More demand with flat supply would send the price up, in other words.\n\nThere is nuance to the BlackRock ETF that warrants attention. While Balchunas did hazard a guess where fees for such a product could land, that’s not the fee schedule we are interested in. Instead, the cost for trading the ETF will be de minimis, around 1 basis point.\n\nIf that is the case, and the ETF does a good job tracking the price of bitcoin and it is incredibly liquid, then there’s no reason for regular folks to buy bitcoin how they do today. As we all know, you have to jump through a slew of hoops before you can actually say you own any crypto.\n\nA bitcoin spot ETF could also lead to lower demand for the trading services on crypto exchanges, which have so far powered leading players in the ecosystem. Until recently, Coinbase made its daily bread on trading fees, not interest derived from its holdings, after all.\n\n“For an advisor, [a bitcoin spot ETF] wouldn’t be the main part of their portfolio; it would be like hot sauce — a small [bit] on top,” Balchunas said. “In ETF land, advisors would pay more for hot sauce,” especially for something that could go up in a hurry, he added.\n\nStill, with Coinbase partnering with BlackRock for its potential ETF, the crypto exchange could find itself eating on both sides of the plate. It can continue earning fees for its crypto asset trading services while milking TradFi demand by helping power BlackRock’s ETF effort.\n\nIt will be simpler to get your parents up and running with an ETF than onboarding them to, say, Binance. So perhaps the two demographics — crypto novice and crypto native — are sufficiently differentiated that they won’t eat into one another.\n\nThere has been a lot of noise over the years about institutional money pouring into crypto and the impact of such an influx of cash. Institutional money managers are coming to crypto, potentially unlocking more small-ball demand for crypto, and crypto’s current gatekeepers will find their roles changing, then, to more facilitating this shift than actually helping generate demand as the category begins opening up to the wider world.\n\nMore to come when we get a damn bitcoin spot ETF approval over the line and can truly vet market demand for the product. That’d finally let us more clearly see its impact on other parts of the larger web3 world.\n\nThis story was inspired by an episode of TechCrunch’s podcast Chain Reaction. Subscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to hear more stories and tips from the entrepreneurs building today’s most innovative companies.\n\nConnect with us:"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZm9ya2FzdC5uZXdzLzEtYmlsbGlvbi1jcnlwdG8tbGlxdWlkYXRpb25zLWJpdGNvaW4tMi1tb250aC1sb3cv0gFLaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvMS1iaWxsaW9uLWNyeXB0by1saXF1aWRhdGlvbnMtYml0Y29pbi0yLW1vbnRoLWxvdy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Over $1 billion in crypto market liquidations as Bitcoin hits 2-month low - Forkast News",
        "content": "After bottoming out at a two-month low of around US$25,400, Bitcoin recovered some losses on Friday morning in Asia to trade around US$26,800. Ether also fell dramatically to a low of around US$1,550 before rebounding to just under the US$1,700 line. All other top 10 non-stablecoin cryptos logged losses as macroeconomic factors — including the depreciation of the Chinese yuan and the bankruptcy of Chinese property giant Evergrande — hit investor sentiment. Overall, investors liquidated US$1 billion in cryptocurrencies, driving the total market capitalization to the edge of the psychologically important US$1 trillion threshold.\n\nXRP led the losers, after a U.S. judge granted the U.S. Securities and Exchange Commission (SEC) approval to file a motion to appeal the recent favorable ruling for Ripple Labs regarding retail sales of token XRP. Meanwhile, the Forkast 500 NFT index dropped but a rise in transactions continued. U.S. stock futures steadied after Wall Street closed lower on Thursday. The release of minutes from the Federal Reserve’s July meeting continues to fuel concerns of more monetary tightening ahead\n\nBitcoin, Ether slide after giving up key support levels\n\nBitcoin slid 7.02% in the last 24 hours to US$26,819.27 as of 07:20 a.m. in Hong Kong, logging a weekly loss of 8.88%, according to CoinMarketCap data. The world’s leading cryptocurrency hit a two-month low of US$25,409.11 on early Friday morning.\n\n“During late US / early Asia trading volumes, Bitcoin prices broke the critical support level at US$28,000. We knew a crash (or sharp decline) could be coming,” Markus Thielen, head of crypto research at digital asset service platform Matrixport, wrote in an emailed note.\n\n“Realized volatility had hit 18%; the last time volatility was this low, in November 2018, Bitcoin’s 30-day realized volatility spiked to over 100% as prices crashed by 46%. In Bitcoin, sharp price declines have often followed low volatility periods. We are not predicting such a significant decline but expected, at least, a -13% decline (so far, prices are down -10%).”\n\nThere is also the looming shadow of macro risks to consider, added Thielen.\n\n“The biggest is a potential devaluation of the Chinese Yuan, trading at the weakest level since 2007. In August 2015, when China devalued the Yuan for the last time, Bitcoin prices declined by -23% during the two weeks following the devaluation,” he said.\n\nAdding to the bearish sentiment in Bitcoin, a Friday report by The Wall Street Journal showed Elon Musk-founded rocket company SpaceX wrote down the value of its Bitcoin holdings by a total of US$373 million in the past two years.\n\n“This is really a past event (but) it is still news and investors understandably saw this as a bearish catalysis on top of macro moves,” said Justin d’Anethan, head of APAC business development at Belgium-based crypto market maker Keyrock.\n\nAlong with Bitcoin, Ether dropped 5.64% to US$1,706.22 and lost 7.80% for the past seven days, after reaching a five-month low of US$1,551.71 on early Friday morning.\n\nOther top 10 non-stablecoin cryptocurrencies all traded lower.\n\nCryptocurrencies saw a total liquidation of US$1 billion over the past 12 hours, with US$812.67 million of long positions — positions where investors bet the cryptocurrency price will rise — wiped out, according to data from crypto information platform CoinGlass.\n\nRipple’s XRP token led the losers, plunging 12.52% to US$0.5136 for a weekly loss of 18.85%.\n\nIn the on-going legal battle between Ripple Labs and the SEC, Judge Analisa Torres on Thursday granted the SEC’s request to appeal an earlier summary judgement in favor of Ripple.\n\nIn June, Torres ruled that Ripple’s programmatic sales of XRP did not violate securities laws, while its sales to institutional investors did. The ruling was seen as a partial victory notched by Ripple. The SEC first sued the company in December 2020 for offering unregistered digital asset securities — an allegation Ripple denies.\n\n“The request for appeal (even if granted) doesn’t change the fact that XRP is not a security. That’s not up for debate / trial,” said Ripple Chief Executive Officer Brad Garlinghouse in a tweet on Wednesday.\n\nReminder – the request for appeal (even if granted) doesn’t change the fact that XRP is not a security. That’s not up for debate / trial. But the SEC continues to claim that Chris and I acted recklessly in believing that XRP is not a security. That’s utter nonsense. 1/2 https://t.co/pG7z0jsjlt — Brad Garlinghouse (@bgarlinghouse) August 16, 2023\n\nAccording to Thursday’s court filing, the SEC will file a motion for appeal on Friday, and Ripple has until September 1 to file its opposition papers.\n\nThe total crypto market capitalization dropped 5.69% in the past 24 hours to US$1.07 trillion — close to the psychologically important US$1 trillion threshold — while trading volume surged 78.91% to US$60.58 billion.\n\nA bad day for NFTs despite all time transactions high\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index dropped 0.37% in the past 24 hours to 2,445.03 as of 10:00 a.m. in Hong Kong, and fell 2.28% for the week. Forkast’s Ethereum and Solana NFT indexes logged gains, while the indexes for Polygon and Cardano dropped.\n\nWreck League, an NFT video game backed by Hong Kong-based gaming company Animoca Brands, launched its NFT mint on early Friday in Asia. But the collection has unperformed, struggling to sell more than a third of its offerings so far.\n\n“It’s not a good day for NFTs,” said Yehudah Petscher, NFT strategist at Forkast Labs. “If anyone is wondering if traders are out of liquidity or conviction in the space, this just might be the answer.”\n\nThe collection’s struggles will impact on the wider market, Petscher added, as traders will look at Wreck League and lose confidence in other collections’ ability to sell.\n\nDespite Wreck League’s struggles, total NFT trading volume rose 30.97% in the past 24 hours to over US$18.69 million, according to data from CryptoSlam. Volumes on the Ethereum and BNB Chain rose, while Solana, Polygon, and Cardano blockchains posted declines.\n\nDaily NFT transactions on Thursday surpassed Wednesday’s record to hit another all-time-high of over 649,000. Those totals eclipsed the previous high of 595,000 logged on Feb. 25, 2022.\n\nMeanwhile, the average NFT sales price stood at US$26.26, about one tenth of the average price for NFTs on Feb. 25, 2022. That crop signals “a major change in the NFT ecosystem,” according to Petscher.\n\n“The NFT space is in the midst of having a shift in its identity, moving to high volume, low dollar sales, and this is exactly what will eventually lead NFTs to mass adoption,” said Petscher.\n\n“Will this be enough to start attracting mainstream attention though? I think not quite yet, but we’re getting much closer to that with realistic prices and recognizable brands,” he added.\n\nDespite the rise in transactions, NFT sellers lost over US$1.91 million in Thursday trading, the biggest loss since July 20.\n\nAs NFTs attract more institutional interest, McDonald’s Corporation’s Singapore branch has teamed up with local entertainment company Bandwagon Labs for an NFT project based on the fast food chain’s Grimace character.\n\nAnd it's live! #GRIMACE, a classic McDonaldland character brought into the modern world of digital collectibles. Minted within the @McDonalds app which millions call their happy place. Powered by Bandwagon Labs with artwork from @TheHiddenWalls. Stay tuned for the mint! ⚡️ pic.twitter.com/Z5U5T2sE8Z — Bandwagon Labs (@BandwagonLabs) August 17, 2023\n\nThe mint of 2,000 Grimace-themed NFTs will go live on August 21. The NFTs are free to claim using the McDonald’s mobile app in Singapore, but cannot then be transferred to other wallets.\n\nAmong NFT collections, Ethereum-based Bored Ape Yacht Club saw the largest 24-hour sales volume. The collection surged 367.71% to over US$2.22 million as its floor price dropped 11% in the past seven days.\n\nEthereum-based DeGods and Mythos Chain-based DMarket took the second and third places in terms of daily sales volumes.\n\nUS rate hike murmurs as China strife deepens\n\nImage: Envato Elements\n\nU.S. stock futures traded mixed as of 2:00 p.m. in Hong Kong with the Dow up and the S&P 500 and Nasdaq logging gains. All three major U.S. indexes closed lower at close of trading on Thursday.\n\nIn Asia, the main stock indexes moved down on Friday morning. China’s Shanghai Composite, Hong Kong’s Hang Seng, South Korea’s Kospi and Japan’s Nikkei all logged losses.\n\nIn the U.S., jobless claims fell 4.4% to 239,000 for the week ending August 12. The weekly figure is lower than economist expectations, pointing to a consistently tight labor market. That could open the door to further interest rate hikes.\n\n“The labor markets are not imploding,” Christopher Rupkey, chief economist at financial market research firm FWDBONDS, told Reuters. “The economy may be heating up instead of cooling down as the monetary medicine of higher 5.5% interest rates is not slowing aggregate demand like the economics textbooks say it should.”\n\nThe hot labor market data arrived after the U.S. Federal Reserve released its July meeting minutes on Wednesday.\n\nThe minutes show that “most participants continued to see significant upside risks to inflation, which could require further tightening of monetary policy.” Two participants indicated they “favored leaving the target range for the federal funds rate unchanged or that they could have supported such a proposal.”\n\nThe Fed meets on Sep. 19 to make its next move on interest rates, which are now between 5.25% to 5.50%, the highest level in the past 22 years. Analysts at the CME FedWatch Tool predict a 88.5% chance there will be no interest rate hike in September, and a 11.5% chance for another 25-basis-point increase.\n\nMeanwhile, China Evergrande Group filed for Chapter 15 bankruptcy in a U.S. bankruptcy court on Thursday. The Chinese real estate developer first defaulted on U.S. dollar bond repayments in December 2021 amid China’s property debt crisis.\n\nBeyond the ailing property industry, Chinese authorities reportedly told state-owned banks to ramp up currency market intervention this week. That followed a slide in the value of offshore Chinese yuan to below 7.30 per U.S. dollar on Wednesday — the lowest level since November 2022.\n\n“We have a lot of uncertainty about the Chinese economy,” Hebe Chen, analyst at London-based online trading provider IG Markets, told Bloomberg. “The market is now standing at a crossroads about whether or not we can continue to talk about the Chinese recovery story or should we shift the narrative to China slowing down or even entering a recession.”\n\n(Updates with equities section.)"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLWZhbGxzLWJlbG93LXVzMjYwMDAtZXZlcmdyYW5kZXMtYmFua3J1cHRjeS_SAV9odHRwczovL2Zvcmthc3QubmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1mYWxscy1iZWxvdy11czI2MDAwLWV2ZXJncmFuZGVzLWJhbmtydXB0Y3kvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin falls below US$26,000 following Evergrande’s bankruptcy - Forkast News",
        "content": "Bitcoin fell 10.44% from Aug. 11 to Aug. 18 to US$26,324 as of 9:00 p.m. Friday in Hong Kong, according to CoinMarketCap data. The world’s largest cryptocurrency by market capitalization has been trading below US$30,000 since last Wednesday. Ether fell 9.16% over the week to US$1,678.\n\nBitcoin dipped to US$25,409 on Friday, its lowest price in two months, after Evergrande, a Chinese property developer with over US$340 billion in liabilities, filed for bankruptcy protection in the U.S., as part of its prolonged restructuring agreement with international creditors. Evergrande defaulted on its dollar-denominated debts in 2021.\n\nAdrian Fritz, a senior research associate at 21.co, the parent company of 21Shares, an issuer of crypto exchange-traded products, said that Evergrande’s bankruptcy contributed to Bitcoin’s price fall, along with the usual “summer trading lull.”\n\n“Bitcoin’s first key support level was the 200-day moving average at US$27,200, which it wasn’t able to hold. The next major support level to watch would be around US$25,000,” said Fritz, in an email response to Forkast.\n\nCoinbase, the largest crypto exchange in the U.S., announced on Wednesday that it obtained regulatory approval to offer crypto futures trading services to eligible clients in the country.\n\nThe Shiba Inu (SHIB) token launched its layer-2 scaling solution, Shibarium, on the Ethereum blockchain on Thursday, but US$1.7 million worth of ETH was stuck on the Shibarium bridge, according to on-chain intelligence firm PeckShield, leading an over 7% drop in SHIB’s price.\n\nAdding to the negative investor sentiment, Binance announced the shutdown of its crypto payment service, Binance Connect, on Wednesday. Previously known as “Bifinity,” Binance Connect was a fiat-to-crypto payment ramp for the exchange, allowing users to buy cryptocurrencies through Mastercard and Visa.\n\nBinance’s announcement came a day after Europe’s first Spot Bitcoin exchange-traded fund (ETF) was listed on Euronext Amsterdam, nearly two years after it was first approved.\n\nLucas Kiely, the chief investment officer of digital asset platform Yield App, said that the ETF listing could inspire other European countries to follow suit and pressure the U.S. Securities and Exchange Commission to hasten its approval process for pending ETFs.\n\n“If Europe demonstrates that such products can operate safely within existing regulatory frameworks, it may force the SEC to reevaluate its cautious approach towards cryptocurrency-related investment vehicles,” wrote Kiely, adding that the surging demand may also move Bitcoin prices higher.\n\nHowever, Jonas Betz, crypto market analyst and founder of consultancy firm Betz Crypto, doesn’t expect the European ETF to significantly boost Bitcoin prices or accelerate the SEC’s decision-making process.\n\n“The SEC will likely maintain its independent pace and judgment, regardless of the actions of its European counterparts,” Betz told Forkast.\n\nNotable Movers: LTC & XRP\n\nSome of the world’s most popular cryptocurrencies were put on the spotlight in the loss column this week.\n\nXRP, the fifth largest cryptocurrency by market capitalization, dropped 20.09% to US$0.505 after the SEC was granted the request to file an interlocutory appeal in its lawsuit against Ripple Labs.\n\nLitecoin, the world’s 15th largest cryptocurrency by market capitalization, fell 21.65% to US$65.12, as part of a broader downward movement in the crypto market. The global crypto market capitalization stood at US$1.06 trillion on Friday at 9:00 p.m. in Hong Kong, down by more than US$100 billion over the past week, CoinMarketCap data shows.\n\nNext Week: Can Bitcoin close the week above US$27,000?\n\nOn Tuesday, investors will be anticipating speeches from Federal Reserve Bank of Chicago President Austan Goolsbee and U.S. Federal Open Market Committee Member Michelle W. Bowman.\n\nDespite Bitcoin falling to a two-month low on Thursday, Yield App’s Kiely said that it’s not all doom and gloom.\n\n“With Europe’s first spot Bitcoin ETF now finally approved, if Bitcoin closed the week around US$27,000 it would be well within the range to regain momentum,” Kiely said.\n\nSee related article: Hackers hit Curve, China announces blockchain link & is FTX back?"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzA4LzE4L2NyeXB0by1wcmljZXMtcGx1bmdlLW9uLXJlcG9ydC10aGF0LXNwYWNleC1oYXMtc29sZC1pdHMtYml0Y29pbi_SAWJodHRwczovL255cG9zdC5jb20vMjAyMy8wOC8xOC9jcnlwdG8tcHJpY2VzLXBsdW5nZS1vbi1yZXBvcnQtdGhhdC1zcGFjZXgtaGFzLXNvbGQtaXRzLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Crypto prices dramatically plunge on report that Elon Musk's SpaceX has sold its bitcoin - New York Post",
        "content": "Cryptocurrency prices plunged as investors liquidated more than $1 billion worth of digital coins on Thursday after it was reported that Elon Musk’s SpaceX sold off its bitcoin holdings.\n\nOn Thursday, bitcoin fell 7.2% in its biggest one-day drop since November 2022 when top exchange FTX collapsed. Bitcoin then slipped to a two-month low of $26,172 during Asian trading hours on Friday, its lowest since June 1.\n\nAnalysts said cryptocurrencies also appeared to be getting hit as rising interest rates slammed riskier assets across the board including stocks. By early Friday Eastern time, bitcoin was changing hands at $26,441, down 0.8% on the day.\n\nEther, the second-biggest cryptocurrency, was steady at $1,685.20, having also dropped sharply on Thursday.\n\nSpaceX, which is owned by crypto enthusiast Musk, wrote down the value of its bitcoin holdings by $373 million in the past two years before selling them off, according to the Wall Street Journal, which cited internal financial documents from the privately owned rocket-launching company.\n\nMusk’s electric car maker, Tesla, sold 75% of its bitcoin holdings last year — another move perceived as a vote of no confidence from the tech mogul who in years past has touted the meme coin dogecoin.\n\n3 Crypto investors sold off $1 billion worth of digital assets such as bitcoin and ethereum on Thursday. REUTERS\n\nThe SpaceX report was the “immediate catalyst” for bitcoin’s sell-off, Ben Laidler, global markets strategist at eToro, told Reuters.\n\n“The broader driver is that crypto assets are not immune to the deepening risk-off selling pressure seen across all asset classes,” Laidler said.\n\nJoseph Edwards, head of research at Enigma Securities, attributed the bitcoin price move to low volatility and a lack of enthusiasm from retail investors.\n\nAfter a pandemic era boom that saw the value of bitcoin skyrocket past $60,000, cryptocurrency has been mired in a slump.\n\n3 The sell-off came on the heels of a report that Elon Musk’s SpaceX sold off its bitcoin holdings. AP\n\nAt its height, the cumulative worth of digital coins reached nearly $3 trillion in November 2021.\n\nAs of Friday, the total market capitalization of all crypto assets including stable coins and tokens was hovering just over $1 trillion.\n\n3 Tesla, the electric car maker run by crypto enthusiast Musk, sold off most of its bitcoin portfolio last year. AFP via Getty Images\n\nThe crypto community has been hit with a series of legal and regulatory setbacks that have spooked investors.\n\nFTX, which at one point was the second-largest cryptocurrency exchange in the world with an estimated market capitalization of $32 billion, was thrown into bankruptcy after its founder, Sam Bankman-Fried, was alleged to have used customer deposits to cover risky bets made by his hedge fund, Alameda Research.\n\nBankman-Fried, who is in jail awaiting trial on fraud and money laundering charges, has pleaded not guilty.\n\nCoinbase, the largest crypto exchange platform in the US, has been sued by the Securities and Exchange Commission for operating illegally because it failed to first register with the regulator.\n\nThe SEC has also targeted the world’s largest crypto exchange, Binance, for allegedly operating a “web of deception.”\n\nWith Post wires"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tMjg1MDAtY29pbmJhc2UtY3J5cHRvLWZ1dHVyZXMv0gE_aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi0yODUwMC1jb2luYmFzZS1jcnlwdG8tZnV0dXJlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin dives to $28,500; Coinbase gets US futures approval - Forkast News",
        "content": "Bitcoin and Ether fell on Thursday morning in Asia, along with other top 10 non-stablecoin cryptos. Bitcoin briefly dipped below $28,500, while Ether’s losses took it below the psychologically important $1,800 threshold. Smaller altcoins such as Dogecoin, Solana and Ripple suffered the biggest drops. In more bullish news, Coinbase Global received approval to offer crypto futures to U.S. retail investors. The Forkast 500 NFT Index was down, although market sentiment remains positive amid a prolonged increase in global transactions. U.S. equity futures traded mixed after another day of losses Wednesday. The release of the minutes for July’s Federal Reserve meeting on interest rates has cast a shadow over equities, the mood music now suggesting a prolonged period of elevated rates or even another hike.\n\nAnother down day for crypto\n\nBitcoin fell 0.95% in the last 24 hours to US$28,551.83 as of 9:00 a.m. in Hong Kong, after briefly falling below the $28,500 threshold earlier in the morning. The largest crypto by market capitalization logged a weekly loss of 3.51%, according to CoinMarketCap data.\n\nEther also lost 1.80% to US$1,794.91 — below the psychologically important $1,800 level — for a 3.28% drop in the past seven days.\n\nAll other top 10 non-stablecoin cryptocurrencies were down. Dogecoin was the biggest loser among the top 10, dropping 5.01% to US$0.06731 for a weekly loss of 10.07%. Solana followed in terms of losses, dipping 4.25% to US$22.83. The token fell 5.98% in the past week.\n\n“Larger currencies have seen less pressure than smaller altcoins,” wrote Alex Kuptsikevich, senior market analyst at London-based online brokerage FxPro, in an emailed statement.\n\n“Rising U.S. Treasury yields put pressure on riskier assets,” Kuptsikevich explained.\n\nThe losses arrive in the midst of more positive news for the crypto market.\n\nOn Wednesday, Coinbase Global — the largest cryptocurrency exchange in the U.S. — announced that it has received approval from the National Futures Association to offer crypto futures to U.S. retail investors. Previously, only institutional customers could trade crypto futures on the platform.\n\nCoinbase called it a “watershed moment,” celebrating the win despite facing securities violation charges from the U.S. Securities and Exchange Commission (SEC).\n\nMajor moment for crypto regulatory clarity in the U.S.\n\n\n\nThis has been a multi-year process toward approval, and we're excited to finally be launching federally regulated crypto derivatives with margin to our U.S. customers.\n\n\n\nWhen there is a clear path to register, we do. https://t.co/TxSOAIpoPj — Brian Armstrong 🛡️ (@brian_armstrong) August 16, 2023\n\n“They now have an approved, compliant [Futures Commission Merchant status] and they understand the nuances of crypto markets,” wrote Chris Perkins, president and managing partner at New York-based investment advisor CoinFund.\n\n“It’s an important step forward in cultivating deep, liquid derivative markets — which are very much needed. This should be very good for Coinbase, and excellent for crypto markets,” Perkins added.\n\nRipple’s XRP token also lost 3.66% to US$0.5862, posting a weekly loss of 8.08%. On July 13, Ripple appeared to score a victory in its ongoing legal battle with the SEC. A New York court ruled that the sale of XRP on public exchanges does not violate securities laws.\n\nHowever, that aspect of the case is again under scrutiny as, on Aug. 9, the SEC asked for a review of the ruling — contributing to the downward pressure on XRP’s price.\n\nThe total crypto market capitalization moved down 1.47% in the past 24 hours to US$1.14 trillion, while trading volume rose 13.64% to US$33.76 billion.\n\nDaily NFT transactions hit historic levels\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index fell 0.76% in the past 24 hours to 2457.08 as of 08:45 a.m. in Hong Kong. The index shows a 1.23% loss for the week.\n\nForkast’s Ethereum, Solana and Cardano NFT indexes logged losses, while the index for Polygon gained.\n\nTotal NFT trading volume dipped 7.72% in the past 24 hours to US$15.01 million, according to data from CryptoSlam. Volumes on the Ethereum, Polygon and ImmutableX blockchains logged losses, while volume on Solana and Mythos gained.\n\nOn Wednesday, the total number of global NFT transactions reached a new milestone, marking an all-time high of 617,619, up from 595,209 on Tuesday.\n\n“The NFT market is maturing right in front of us and we’re hitting historic levels on a daily basis,” said Yehudah Petscher, NFT strategist at Forkast Labs.\n\n“Sales volume isn’t my measure for how healthy the NFT ecosystem is, it’s the buyers, sellers and it’s transactions,” said Petscher. “I am so bullish on NFTs right now.”\n\nMuch of that optimism, Petscher said, is based on a decline in NFT prices, with the average price of a single NFT now US$22.08, down from US37.85 a week earlier.\n\n“Average sale prices, I want to point out again they continue to decline and that’s a very, very good thing. We want to bring in the masses. We want our friends and families to come into NFTs,” Petscher added.\n\nDMarket, a collection linked to Mythos network-based blockchain games, topped the NFT collections chart by trade volume on CryptoSlam, adding 0.45% to US$970,811.\n\nEthereum-based DeGods came in second despite a 38.75% slump to US$922,882. The collection recently launched its “Season 3” collection update on Sunday. New-entry The Heist, an NFT collection based on the strategy game of the same name, placed third with a trade volume of US$756,980.\n\nFed minutes signpost potential hikes ahead\n\nU.S. Federal Reserve Board Chairman Jerome Powell | Image: Getty Images\n\nU.S. stock futures traded mixed as of 10:45 a.m. in Hong Kong following a decline across all three major indexes during regular trading Wednesday.\n\nWednesday’s release of the minutes from the U.S. Federal Reserve’s July meeting has put a dampener on investor sentiment. The discussion revealed concerns among Fed members that additional interest rate hikes may be needed to control inflation.\n\nThe minutes stated that “with inflation still well above the Committee’s longer-run goal and the labor market remaining tight, most participants continued to see significant upside risks to inflation, which could require further tightening of monetary policy.”\n\nFollowing the release of the meeting minutes, analysts at the CME FedWatch Tool gave a 13.5% chance that the Federal Reserve will raise interest rates in September, up from 9.5% on Wednesday. The Fed meets on Sep. 19 to make its next move on interest rates, which are now between 5.25% to 5.50%, the highest level since January 2001.\n\nThe main stock indexes in Asia — China’s Shanghai Composite, Hong Kong’s Hang Seng, Japan’s Nikkei 225 and South Korea’s Kospi — all posted losses on Thursday morning, echoing bearish sentiment in the U.S.\n\nThe Shanghai Composite fell 0.15% to around 3,145, its lowest level since early January. That reading combined with weak economic data and the nation’s ongoing property sector debt crisis points to a downturn in the Chinese economy.\n\n“Prolonged weakness in property construction will add to destocking pressures in the industrial space and depress consumption demand as well,” said Tao Wang, economist at UBS Investment Bank, according to Reuters.\n\n“In such a case, economic momentum may stay subdued in the rest of the year and China may miss this year’s growth target of around 5%,” Wang added.\n\nChina has also stopped releasing youth unemployment data after the figure hit a record high of 21.3% in June. The suspension follows a string of downbeat economic reports in China, including retail sales and industrial output, raising fears about a slide into recession.\n\nMeanwhile, U.S. retail giant Target reported a slump in quarterly revenue. The US$24.77 billion in Q2 was lower than the estimated US$25.16 billion. However, Target shares still added 2.96% on Wednesday.\n\nMajor U.S. retailer Walmart is set to release its quarterly results on Thursday.\n\n(Updates with equities section.)"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcGFjZXgtc29sZC1iaXRjb2luLWFjcXVpcmVkLTIwMjEtMjAyMi1yZXBvcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "SpaceX wrote down $373M worth of Bitcoin back in 2021-2022: Report - Cointelegraph",
        "content": "Aerospace technology firm SpaceX reportedly wrote down the value of Bitcoin it owns by a total of $373 million last year and the year before and may have sold all of its holdings.\n\nAccording to an Aug. 17 report in The Wall Street Journal, SpaceX recorded $373 million worth of Bitcoin (BTC) holdings on its balance sheet in 2021 and 2022 and has reportedly sold the cryptocurrency.\n\nIt hasn't been confirmed whether the entire $373 million stash was sold.\n\n\"SpaceX wrote down the value of bitcoin it owns by a total of $373 million last year and in 2021 and has sold the cryptocurrency,\" reported the WSJ.\n\nThe news outlet reportedly viewed documents on the firm’s financials showing roughly $5.2 billion in total expenses for 2022, and $5.4 billion in 2021 and 2022 for acquiring property and equipment in addition to research and development costs.\n\nSpaceX CEO Elon Musk publicly announced in 2021 that the firm had acquired a certain amount of Bitcoin. This followed a U.S. Securities and Exchange Commission filing showing Tesla — another company co-founded by Musk — planned to purchase $1.5 billion worth of the crypto asset. The announcement likely contributed to BTC hitting a then-all-time-high price of more than $43,000.\n\nAccording to Tesla's second-quarter 2023 earnings report, the firm had sold all but $184 million worth of its Bitcoin holdings. Tesla reported it had liquidated more than 30,000 BTC in the second quarter of 2022 for $936 million — roughly 75% of its original $1.5 billion BTC holdings.\n\nRelated: Elon’s ‘not afraid of blowing things up’ — ex-Twitter exec on working under Musk\n\nMusk, one of the richest people in the world, has often taken to social media to comment on certain cryptocurrencies, including Dogecoin (DOGE) and Bitcoin, even briefly changing Twitter's then-blue bird logo to the DOGE shiba inu. Since his $44 billion purchase of Twitter — later rebranded to X — in October 2022, he has suggested the platform could offer an ”entire financial world,” including banking and payment services.\n\nThe timing of SpaceX’s reported Bitcoin sale is unclear, but the crypto market experienced a significant crash in 2022 amid the collapse of major firms, including Terraform Labs. Many technology firms and financial institutions continue to hold Bitcoin and other cryptocurrencies.\n\nMagazine: Simon Dixon on bankruptcies, Celsius and Elon Musk: Crypto Twitter Hall of Flame\n\nUpdate (Aug. 17, 11:03 pm UTC): This article has been updated to reflect that it hasn't been confirmed whether SpaceX's entire Bitcoin holdings were sold, or only partially."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTcvY3J5cHRvLWxvbmctdHJhZGVzLWFjY291bnQtZm9yLTkwLW9mLXRvdGFsLWxpcXVpZGF0aW9ucy1hcy1iaXRjb2luLWV0aGVyLXNsdW1wL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTcvY3J5cHRvLWxvbmctdHJhZGVzLWFjY291bnQtZm9yLTkwLW9mLXRvdGFsLWxpcXVpZGF0aW9ucy1hcy1iaXRjb2luLWV0aGVyLXNsdW1wL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Crypto Long Trades Account for 90% of Total Liquidations as Bitcoin, Ether Slump - CoinDesk",
        "content": "Meanwhile, trading firm QCP Capital said in a Telegram broadcast earlier this week that it expected prices to gradually fall lower in the immediate absence of market catalysts. It added that price levels of between $24,000 to $26,000 for bitcoin could be expected in the coming months.”"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLW5vdy1sZXNzLXZvbGF0aWxlLTAzMTgxMTk4OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Now Less Volatile Than Oil: Report - Yahoo Finance",
        "content": "Bitcoin and Ethereum Now Less Volatile Than Oil: Report\n\nBitcoin and Ethereum Appear To Be Experiencing A Period Of Reduced Volatility\n\nBitcoin and Ethereum, well-known for their erratic price fluctuations, appear to be experiencing a period of reduced volatility.\n\nSurprisingly, oil currently has more volatility than these digital currencies. The 90-day volatility indexes for Bitcoin and Ethereum have fallen to multi-year lows, falling by 35% and 37%, respectively, according to latest Open in a new tab from Kaiko research. As a result, compared to oil, which has a 41% volatility rate, these top cryptocurrencies are now less volatile.\n\nThe frequency and magnitude of price movements over time are indicated by market volatility. In the past, cryptocurrencies have been more volatile than oil, as seen by their bigger and more frequent price fluctuations.\n\nDespite the fact that oil currently dominates the Nasdaq and gold in terms of volatility, it has actually fallen from a volatility rate of 63% in July 2022. Increased geopolitical tensions and China's underwhelming economic rebound following the relaxation of Covid-19 limitations may be to blame for this drop in oil's volatility.\n\nKaiko's research also highlights that both Bitcoin and Ethereum are currently experiencing multi-year lows in terms of liquidity and trade volume, which could contribute to their decreased volatility.\n\nThe anticipated launch of an exchange-traded fund (ETF) for Bitcoin may stir up market volatility once again. This gained credibility in the wake of BlackRock's unexpected ETF application, given the firm's track record of successful applications and the subsequent actions of other applicants."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2luLXByaWNlLXNsaWRlcy1iZWxvdy1kb2xsYXIyOWstdG91Y2hlcy1sb3dlc3QtbGV2ZWwtc2luY2UtanVuZS0yMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Price Slides Below $29K, Touches Lowest Level Since June 21 - CoinDesk",
        "content": "Lawrence, we are going to be talking about your most recent newsletter with the tie and some of the data that you unpacked in that. So leverage funds, the CF DC label for hedge funds, commodity trading advisors and the like are getting increasingly bearish when it comes to Bitcoin futures. You have some charts for us, talk to me about what's happening. Yeah. Uh we're, we're seeing right now is, is kind of, it's interesting we're seeing the leverage funds are basically hedge funds um and hedge funds CTAs uh things like that. There, there's, there's been an increase in the amount of say short contracts relative to long contracts that they have outstanding uh in the futures markets. Uh We're seeing that that spread wide and it's the widest it's been in over a year. Uh interesting also to note that asset managers on the other hand, are taking the opposite side. Those are kind of the long term people, et cetera, those guys are mostly long. Um And that that's been spiked up uh since about uh the, you know, the 22 or so, it's late 21 early 22. Um But again, it it, it's just sort of, you know, we're looking at this and saying, ok, well, uh, you know, how are hedge funds doing it and why part of the thing could be that they are looking at it, um, uh, potentially as a hedge if they, if they have any, um, if they have any long positions as a, you know, kind of to offset it. But really, they could also just be super short. Um, so, you know, again, it's something to, to keep in mind, uh, that there could be a bit of short interest right now, uh, in the, in the hedge fund community. When it comes to Bitcoin, they are involved in it but not in a good way. Uh, and we're also seeing just a slight uptick in, in open interest in general. But, uh, again, it's, uh, you know, it still very quiet market. All right, let's, let's take a look at this. Uh, next chart here, Wednesday was a big day with nearly every sector in crypto suffering a sell off. What was going on there? Could this be, um, in anticipation of the Fed's new policies? That's a great question. Uh, you know, this, of course, is something that, um, you know, we, we're seeing some issues whether or not the fed is going to raise rates and, and we know that the, that the fed has, um, the, the, the market's been betting that the fed is doing one and done but recently the notes, the minutes, the fed minutes came out. And I said, well, you know, there might be some room for an extra rate hike or so another 25 basis points. And in general, for the market, we're seeing this sort of nervousness skittishness. We're seeing if you were to look at, uh, the yield curve right now, it just bumped up a little bit. Um, you know, I, everything's kind of rates have gone up in the past couple of days. People are saying, wait, hold on, this could actually be real. And of course, when you raise rates, uh that creates AAA disincentive to take on a risk because you now have a slightly higher, higher hurdle rate, a slightly higher borrowing costs to take leverage positions, etcetera. Uh Even though people say, well, that doesn't necessarily affect crypto. Yes, it does. So, um you have this uh a little bit of nervousness in, in taking on those risks and some of the, some of the sectors that the more um the more adventurous sectors such as uh gaming and uh you know, metaverse stock, uh metaverse, not stocks, although Gary would say that they're secure securities, but tokens are taking a hit again, that the, the, you know, the more risk involved, uh the, the least, the least likely people are to want to hold them compared to other things. All right. On that note, let's talk about the D sector at the beginning of the show. We saw that coin desks D I index is down, we spoke to the Shebaa Metaverse Advisor. The ship Token is down this morning but not all D five Tokens are down. There was one big major um performer talk to us about that. Yeah, thank you. That's a fantastic question. And I, I really, I'm surprised you asked about this. Um So uh we, we have this, uh of course, this is, you know, 11 thing that didn't go up, I should say is, um, is, is, uh, is curve and you, you would have thought curve would have gone up because somebody, I, the, the thieves are, I don't wanna say thieves, I it's such a, the hackers that plundered curve, uh, gave most of their, their curve token back and you think, OK, everything's fine that, you know, that should calm things down. Nope, it did not. But that, that upward to the right thing that you see there, that's store chain that's room. Uh, so there was a lot of hype with this one involving a, a new lending product that they're gonna launch and, oh, it's gonna be great and no fees and this and that. And then, yeah, Wednesday came and unfortunately for them, it looks like, um, they might have some problems here, uh, with some of the coding issues, uh, in Thor Chain, uh, that led to some suspension of some of the services involved there. So, what we could have is that's not going to be that, that this chart won't look the same, let's just say next week because, um, you know, it, it, that might just puncture a hole if you will in Thor Chain, it might make people a little bit nervous. So, while Thor Chain was the big talk of, of uh D I this past week, um, it might be this coming week, but for other reasons, we'll see, we'll see how that goes. We'll see uh what, what comes out of this. But uh you know, again, this is it, you have to remember. This is a relatively small, uh a, a small market when it comes to uh defy tokens and it's relatively small even even in crypto, uh even when it compared to say Bitcoin and E um so you get a lot more volatility, you get a lot more uh ups and downs and, and you get a lot more excitement and buzz. But, you know, one little thing like we saw with curve can blow things up uh in, in a bad way. So, uh buyer beware. So basically, don't go put all your bets on Thor chain just I bet that's it."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXByaWNlLXNsdW1wLWNyeXB0by1ibG9vZGJhdGgtMS1iLWxpcXVpZGF0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether price slump leads to crypto bloodbath with $1B in liquidations - Cointelegraph",
        "content": "The Bitcoin (BTC) and Ether (ETH) price slump on Aug. 18 saw the top two cryptocurrencies fall to a two-month low and triggered a series of liquidations for thousands of derivative traders.\n\nThe crypto bloodbath led to billions of dollars worth of hedged positions being liquidated and several traders lost millions of dollars in a single trade.\n\nAccording to CoinGlass data, a total of 176,752 traders got liquidated over the past 24 hours. 90% of these liquidations took place within the last 12 hours, indicating a rapid rise in price volatility just days after BTC and ETH recorded their lowest daily volatility in several years.\n\nCrypto market liquidation data. Source: CoinGlass\n\nAmong the sea of traders who lost a significant chunk of their derivative positions, two particular liquidations caught the crypto community’s eye for the sheer scale of it. During the price slump, an investor on Binance’s ETHBUSD contract was liquidated at $1,434.37 losing $55.9211 million, making it the largest liquidation for the day. Another Binance trader on the BTCUSDT contract lost nearly $10 million in liquidations.\n\nRelated: Bitcoin speculators now own the least BTC since $69K all-time highs\n\nThe billion-dollar liquidation is the biggest liquidation event in crypto in the past eight months, after the last such event during the FTX collapse.\n\nBiggest liquidation event of 2023. Source: TradingView\n\nThe price function in the crypto market was attributed to several factors, including the SpaceX Bitcoin write-down and the macroeconomics, where BTC and ETH have been trading in a range for the past couple of months.\n\nBTC held onto the key $28,000 support for a couple of months, while ETH held the $1,500 support before giving in on Aug. 17. The liquidity in the crypto market has been on the lower side, and prominent crypto exchanges, such as Coinbase, had seen a significant decline in their trading volume.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDgvMTgvYml0Y29pbi1oaXRzLWZyZXNoLXR3by1tb250aC1sb3ctYW1pZC1hLWJyb2FkLW1hcmtldC1zZWxsLW9mZi1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin plummets to fresh two-month low amid broad crypto sell-off - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin plummets to fresh two-month low amid broad crypto sell-off: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Crypto World explores a growing movement called regenerative finance, or ReFi, which is focused on the intersection of climate action and web3. ReFi aims to solve systemic problems, like climate change."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhbGxzLWJlbG93LTI2ay1pbi10d28tbW9udGgtbG93cy1mb3ItYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price briefly dips below $26K, falling to two-month lows - Cointelegraph",
        "content": "The price of Bitcoin (BTC) fell around 8% in a span of 10 minutes, causing the cryptocurrency to dip well under $26,000 before partially recovering.\n\nBTC was hovering around $27,677 on Aug. 17 at 9:30 pm UTC time before tumbling just over 8% to $25,409, according to Coinmarketcap.\n\nBitcoin fell to a low of $25,409. Source: Coinmarketcap\n\nThe price of Bitcoin was even lower on the crypto exchange Bitfinex, hitting a low of $24,715 before making a partial recovery back above $26,000.\n\nInitial reactions from the X (Twitter) community have pegged the price drop to reports that SpaceX wrote down the value of BTC it previously acquired by $373 million and sold the cryptocurrency, while others have pointed to China’s Evergrande Group filing for Chapter 11 bankruptcy in New York.\n\nThe fall has taken Bitcoin's market cap below $500 billion for the first time since June 16 and hit lows not seen since June 20.\n\nRelated: Bitcoin bulls risk trading range loss as BTC price nears 2-month lows\n\nCryptocurrency analyst Will Clemente noted that Bitcoin saw the largest single-day increase in BTC implied volatility this year.\n\nBiggest single-day increase in Bitcoin implied volatility of the entire year\n\n\n\nIs the volatility drought finally over? pic.twitter.com/tDfU5qMCwY — Will Clemente (@WClementeIII) August 17, 2023\n\nDespite the dip, BTC is still up 60% since it entered 2023 at about $16,550.\n\nMagazine: Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWZhbGwtd2lwZXMtNDRibi1vZmYtbWFya2V0LWNhcC1hcy12b2xhdGlsaXR5LXN0cmlrZXMtY3J5cHRvLW1hcmtldC0wOTA0MzAyMTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin fall wipes $44bn off market cap as volatility strikes crypto market - Yahoo Finance UK",
        "content": "Bitcoin was trading as low as $25,409 on Friday. Photo: Omar Marques/SOPA Images/LightRocket via Getty Images (SOPA Images via Getty Images)\n\nBitcoin (BTC-USD) crashed to trade as low as $25,409 on Friday, wiping about $44bn off its market cap and leading a market-wide crypto fall.\n\nThe downward pressure came as news hit that Elon Musk's SpaceX had reportedly written down the value of its crypto holdings.\n\nThe company wrote down the value by $373m according to a report by The Wall Street Journal, citing internal financial documents. SpaceX also sold bitcoin at some stage in the last two years, according to the report. It didn't say how much was sold or when the sale occurred.\n\nSpaceX is a private company therefore its financials are not readily available, although Musk said it had bitcoin on its balance sheet in 2021.\n\nADVERTISEMENT\n\nSome traders put the move down to market structure and liquidations as the price dropped below $28,500, amid a relatively illiquid market.\n\nAs prices dropped, long traders sold their positions in order to avoid being liquidated.\n\nThe move wiped around $44bn off the volatile cryptocurrency's market cap, before recovering somewhat to trade at around $26,400 by Friday morning European time, according to data from CoinMarketCap.\n\nRead more: LIVE: FTSE and pound pull back amid lacklustre retail sales data\n\nThe moves come amid a torrid time in regulation for crypto. In recent months the US's top financial regulator has moved to investigate crypto exchanges Binance.US and Coinbase, two of the largest companies in the space. The businesses face claims that they sold unregistered securities to the public.\n\nCrypto is also sensitive to macroeconomic changes. With high inflation and interest rate rises on the slate around the world, traders have taken money off the table.\n\nWatch: Could China shut-down the Bitcoin network? | The Crypto Mile"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhpdHMtcmVjb3JkLWhpZ2hzLWluLWFyZ2VudGluYS1hcy1qYXZpZXItbWlsZWktd2lucy1wcmltYXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin soars in Argentina as Javier Milei wins presidential primary - Cointelegraph",
        "content": "The price of Bitcoin (BTC) has jumped to a fresh high in Argentina since the news that Bitcoin-friendly presidential candidate Javier Milei won a primary election on Aug. 13, with 1 BTC reaching a value of 10 million Argentine pesos (ARS) on Aug. 14, according to data from CoinGecko.\n\nIn Argentina, Bitcoin has seen a sharp climb this week, with BTC rallying 21% from 8.4 million ARS to 10.2 million ARS in less than one hour on Monday.\n\nWhile the 10 million pesos mark is widely seen as the “official” Bitcoin’s value, the Argentine parallel market, sometimes referred to as the “real value” market, is even higher than that.\n\nAccording to the local cryptocurrency data source CoinMonitor Argentina, the price of Bitcoin surged to as high as 20.3 million ARS per coin on Aug. 16. At the time of writing, Bitcoin is trading at the average of 19.3 million ARS, according to CoinMonitor data, while CoinGecko suggests that its “official” value is just 9.2 million ARS.\n\nBitcoin versus the Argentine peso seven-day price chart. Source: CoinGecko\n\nThe latest Bitcoin price gains in Argentina build on significant previous growth versus the Argentine peso amid the ongoing massive inflation and devaluation of the local fiat currency.\n\nThe monthly inflation rate in Argentina surged to 6.3% in July, while Argentina's central bank devalued ARS by to about 18% in the aftermath of Sunday's primaries. According to local sources, the central bank devalued ARS’ official exchange rate by as much as 22% and plans to keep the rate fixed at $350 until presidential elections in October.\n\nAmid the prolonged inflation and currency devaluation, Bitcoin has been steadily gaining value against ARS since late 2022. According to CoinGecko, Bitcoin has surged more than 210% versus the Argentine peso since Aug. 17, 2022.\n\nThe most recent Bitcoin rally in Argentina came amid the presidential primary win by pro-Bitcoin presidential candidate Milei. After winning the primary with more than 30% of votes, Milei is now the front-runner in Argentina’s general election in October.\n\nRelated: Robert F. Kennedy Jr. vows to back US dollar with Bitcoin if elected president\n\nAs previously reported, Milei wants to abolish the central bank and adopt the United States dollar as Argentina’s currency. The presidential candidate also believes that Bitcoin is a reaction against “central bank scammers,” while fiat currency allows politicians to scam Argentines with inflation.\n\nArgentine pro-Bitcoin presidential candidate Javier Milei. Source: El País\n\nWhile Bitcoin has been at its record highs in Argentina recently, the cryptocurrency has been on the decline in global markets.\n\nSince Aug. 14, Bitcoin has lost 3.7% of its value versus the U.S. dollar, dropping below the psychological mark of $29,000 on Aug. 16, according to CoinGecko. The cryptocurrency has been gradually tumbling over the past 30 days, dropping nearly 5% over the period at the time of writing.\n\nBitcoin versus USD seven-day price chart. Source: CoinGecko\n\nArgentina is not the only country that has seen Bitcoin’s price at its highest historic levels amid massive inflation recently. Bitcoin has also been trading near all-time high levels in countries such as Turkey, which reportedly saw its inflation rate rising to nearly 50% in July 2023.\n\nIn July, Bitcoin climbed to the highest level versus the Turkish lira, reaching a value of 819,000 TRY per 1 BTC, according to data from CoinGecko.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Big Questions: Did the NSA create Bitcoin?"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtMjZrLXdhcm5pbmctYml0Y29pbi1zZWxsLXByZXNzdXJlLWRvdWJsZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "BTC price nears $26K amid warning Bitcoin sell pressure can 'double' - Cointelegraph",
        "content": "Bitcoin (BTC) stayed near two-month lows at the Aug. 18 Wall Street open as markets came to terms with extreme liquidations.\n\n“Drying liquidity” costs BTC price key support\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action tracking sideways after a single daily candle spawned 8% losses.\n\nThe largest cryptocurrency saw a cascade of liquidations across derivatives markets, with these accounting for an “outsized” majority amid relatively slack spot selling.\n\n“In Deribit it is likely that a large account got wiped, considering the immense short liquidation that occured together,” trading firm QCP Capital wrote in a market update sent to Telegram channel subscribers on Aug. 18.\n\nBitcoin liquidations composite chart. Source: QCP Capital\n\nQCP, like others, noted that the market reaction to the alleged trigger — a write-down of SpaceX’s $373 million BTC holdings — appeared exaggerated.\n\n“This brought back the 2021 and 2022 ghosts of Elon-driven tops and bottoms, and we certainly hope the market will not revert back to those times again,” it continued, referring to previous Bitcoin sales and accompanying comments from Elon Musk, joint CEO of SpaceX and Tesla.\n\nTotal liquidations challenged those seen in the immediate aftermath of the FTX exchange meltdown — the event that resulted in BTC/USD dipping to two-year lows of $15,600 in November 2022.\n\n“This feels like yet another sign of the drying liquidity markets have seen over the last few weeks,” financial commentary resource The Kobeissi Letter added in part of its own reaction.\n\nAnalyst: Spot sell volume still 50% below 2023 high\n\nAs BTC’s price drifted slowly toward $26,000, market participants diverged over the true nature of the situation and its future implications.\n\nRelated: How low can the Bitcoin price go?\n\nFor popular trader and analyst Rekt Capital, the picture was bleak — a double-top formation for BTC/USD in 2023, and a complete lack of support from trend lines and moving averages during the breakdown.\n\n“BTC formed its Higher High at ~$31000 on inclining volume. But price formed the second half of its Double Top on declining volume,” he wrote in part of multiple posts on X (formerly known as Twitter).\n\nAn accompanying chart showed trading volume on daily timeframes, as Rekt Capital warned that capitulation had likely not yet matched previous sell-offs.\n\n“Though there was a small breakout in seller volume on this crash… It’s still nowhere near the Seller Exhaustion volume levels (green box) of previous BTC reversals (yellow circles),” he explained.\n\n“In fact, current Seller Volume would need to probably double to reach those Seller Exhaustion volume levels that prompted price reversals in early & late March as well as mid-June.”\n\nBTC/USD annotated chart. Source: Rekt Capital/X\n\nOthers were more optimistic, including trader CryptoCon, who identified key two completed tasks common to successful BTC price rebounds during bull market retracements.\n\nThese involved relative strength index (RSI) values bouncing at the 0.382 Fibonacci retracement level.\n\n“Every cycle, the Weekly Bitcoin RSI experiences a fake out of the bull market start line, some lasting longer than others,” he explained.\n\n“And every one of them makes a revisit to the .382 Fibonacci retrace of the move. With the latest drop, both of those things are now complete.”\n\nBTC/USD annotated chart with weekly RSI. Source: CryptoCon/X\n\nRekt Capital noted that daily RSI was now at its most “oversold” since June 2022, with only two episodes in Bitcoin’s history, both in bear markets, beating it.\n\nLooking ahead, QCP meanwhile flagged next week’s commentary from Jerome Powell, chair of the United States Federal Reserve, as the next potential source of volatility.\n\n“We believe that a lot now rests on Powell's speech at Jackson Hle next week,” it concluded.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should we ban ransomware payments? It’s an attractive but dangerous idea\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJyZWFrcy1iZWxvdy0yOGstYW5kLW9wdGlvbnMtdGlsdC10b3dhcmQtYmVhcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price breaks from range with drop below $28K, and options tilt toward BTC bears - Cointelegraph",
        "content": "On Aug. 16, Bitcoin closed below $29,000 for the first time in 56 days. Analysts quickly pointed to this week’s Federal Open Market Committee minutes, which expressed concerns about inflation and the need to increase interest rates, as the likely cause.\n\nDespite the immediate reasons for the drop, the upcoming $580 million Bitcoin (BTC) options expiry on Friday favors the bears. They could potentially make a $140 million profit on Aug. 18, adding to the downward pressure on Bitcoin and complicating BTC’s search for a bottom.\n\nFederal Reserve minutes did not impact traditional markets\n\nOn Aug. 16, Federal Reserve Chair Jerome Powell emphasized the 2% inflation target. This pushed the U.S. 10-year Treasury yield to its highest level since October 2007, prompting investors to shift away from riskier assets like cryptocurrencies in favor of cash positions and companies that are well prepared for such a scenario.\n\nNotably, Bitcoin had already fallen to $29,000, its lowest point in nine days, prior to the release of the Fed minutes. The impact of the minutes was limited, especially considering the 10-year yield had been rising, indicating skepticism about the Fed’s ability to control inflation.\n\nAdditionally, on Aug. 17, S&P 500 index futures only dropped by 0.6% compared to their pre-event level on Aug. 16. During the same time, WTI crude oil gained 1.7%, while gold traded down 0.3%.\n\nConcerns about China’s economy might have also contributed to the decline. The country reported lower-than-expected retail sales growth and fixed asset investment, potentially affecting the demand for cryptocurrencies.\n\nAlthough the exact causes of the price drop remain uncertain, there’s a possibility that Bitcoin could reverse its trend after the weekly options expiry on Aug. 18.\n\nBitcoin bulls cast the wrong bet\n\nBetween Aug. 8 and Aug. 9, the price of Bitcoin briefly crossed the $29,700 mark, sparking optimism among traders using options contracts.\n\nDeribit Bitcoin options aggregate open interest for Aug. 18. Source: Deribit\n\nThe 0.57 put-to-call ratio reflects the difference in open interest between the $365 million call (buy) options and the $205 million put (sell) options. However, the outcome will be lower than the $570 million total open interest since the bulls were caught by surprise with the latest price drop below $29,000.\n\nFor example, if Bitcoin’s price trades at $28,400 at 8:00 am UTC on Aug. 18, only $3 million worth of call options will be accounted for. This distinction arises from the fact that the right to purchase Bitcoin at $27,000 or $28,000 becomes invalid if BTC trades below those levels upon expiration.\n\nBelow are the three most likely scenarios based on the current price action. The number of options contracts available on Aug. 18 for call (buy) and put (sell) instruments varies depending on the expiration price. The imbalance favoring each side constitutes the theoretical profit:\n\nBetween $26,000 and $28,000: 100 calls vs. 5,300 puts. The net result favors the put (sell) instruments by $140 million.\n\n100 calls vs. 5,300 puts. The net result favors the put (sell) instruments by $140 million. Between $28,000 and $28,500: 100 calls vs. 3,900 puts. The net result favors the put (sell) instruments by $60 million.\n\n100 calls vs. 3,900 puts. The net result favors the put (sell) instruments by $60 million. Between $28,500 and $29,500: 600 calls vs. 1,300 puts. The net result favors the put (sell) instruments by $20 million.\n\nGiven the growing concern among investors about an upcoming economic slowdown due to actions taken by central banks to control inflation, it’s likely that Bitcoin bears will maintain their advantage. This trend isn't limited to the upcoming Friday expiry and is expected to continue, especially since the chances of the BTC bulls’ primary short-term goal — the approval of a spot exchange-traded fund — are quite slim.\n\nAs a result, those on the bullish side find themselves in a tough spot. The success of their call (buy) options relies on Bitcoin’s expiry price going above $28,500. The most likely scenario, where bears could walk away with a favorable outcome of $140 million, suggests the potential for a further correction in Bitcoin’s price.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS92aWRlby82MzM0MDM4NjI3MTEy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF trading launch in Amsterdam is ‘holy grail’ for US issuers: Sean O’Hara - Fox Business",
        "content": "Log in to comment on videos and join in on the fun."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1yZXNlYXJjaGVycy1jbGFpbS1uZXctdGVjaC11cHMtd2lubmluZy1oYXNoLWNoYW5jZS1ieS0yNjDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin mining researchers claim new tech ups winning hash chance by 260% - Cointelegraph",
        "content": "Quantum Blockchain Technologies (QBT) — a research company based in the United Kingdom — has developed artificial intelligence (AI)-powered algorithms that could significantly increase the mining winning probability of certain ASIC Bitcoin (BTC) miners, its CEO Francesco Gardin said in an interview with Cointelegraph.\n\nGardin unpacked how QBT has incorporated AI to enable the smart search of winning hashes as an alternative to conventional random searches.\n\nIn two years, the company has developed several different patented methods by tapping into the expertise of some twenty experts from quantum computing, machine learning, cryptography, ASIC chip design and algorithm optimization theory.\n\nRelated: Bitcoin miners still bullish despite toughest bear market yet — Hut8, Foundry, Braiins\n\nQBT’s machine learning teams have developed two different algorithmic search methods, which reportedly improve the performance of ASIC miners by increasing efficiency and winning result probabilities.\n\n“Method A” is said to improve miner efficiency by 10% while “Method B” is set to improve the probability of a miner finding a winning has by 260%.\n\nGardin said that the company is looking to explore three specific areas, starting with a short-term target of increasing the mining performance of existing commercial ASIC chips by adding a software AI component running on a mining rig.\n\nThe team is also designing a new architecture for ASIC mining chips to optimize Bitcoin mining, which it detailed in a recent patent application.\n\nMeanwhile, QBT has a long-term goal of using quantum computers to mine Bitcoin using an in-development SHA-256 computation method that can operate on quantum computing systems.\n\nQBT announced a patent application in July 2023 for the latter, outlining its architectural change to Bitcoin mining ASIC chips, which it claims pre-processes data used by future blocks on the Bitcoin blockchain.\n\nGardin said the QBT Message Scheduling for Cryptographic Hashing ASIC (MSFCA) is able to perform pre-calculations of future BTC blocks before the current block is closed. The “anticipatory resource efficiency algorithm” reduces the logic gates of SHA-256 ASIC architecture.\n\nLogic gates are software or hardware devices that carry out logical operations. According to Gardin, MSFCA allows miners to use fewer logic gates, lowering energy costs and improving the efficiency of ASIC mining hardware.\n\nRelated: Tether’s game plan in El Salvador: Why invest in Volcano Energy?\n\nThe firm estimates that miners could free up to 8% of logic gates of SHA-256 ASIC chips by pre-processing data used by future blocks on the Bitcoin blockchain, which would make certain logic gates involved in the computation of that data no longer necessary on the ASIC chip.\n\nGardin also weighed in on the potential for these new methods to influence the Bitcoin mining industry. He said that BTC mining is highly dependent on hardware configurations and hashing power of miners, as well as expending considerable amounts of energy.\n\nGardin added that the probability of finding the winning hash increases with the number and halving speed of a miners’ fleet or an entire pool, as well as the corresponding energy cost while conducting a “completely random search.”\n\n“There are no methods, intelligence or strategy in current BTC mining, but simply brute force and luck.”\n\nAlthough just a handful of ASIC manufacturers dominate the mining rigs market, Gardin believes there are minimal differences, features or distinct advances between hardware, aside from differences in hash rates and power consumption.\n\nHe added that QBT’s technology, which was mainly developed using Intel’s Blockscale ASIC chips — which were recently pulled from production — would provide advantages to any mining rig.\n\nThe firm’s technologies are being touted to give an “uncatchable advantage” using AI and SHA-256 optimization, and while QBT does not plan to open source its patented methods, Gardin said QBT is considering different options to take its solutions to the Bitcoin mining market.\n\nThis could include subscription, licensing, forming a joint venture, or outright purchasing the company and its associated technologies.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLXJpc2stdHJhZGluZy1idGMtcHJpY2UtbmVhcnMtMi1tb250aC1sb3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin bulls risk trading range loss as BTC price nears 2-month lows - Cointelegraph",
        "content": "Bitcoin (BTC) targeted two-month lows on Aug. 17 as United States inflation returned to spook cryptocurrency markets.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price teases exit from months-long corridor\n\nData from Cointelegraph Markets Pro and TradingView confirmed the lowest BTC price levels since June 21 as BTC/USD wicked to $28,300.\n\nThe downside came after the U.S. Federal Reserve published the minutes of its July meeting to discuss future monetary policy.\n\nMembers of the Federal Open Market Committee (FOMC) revealed concerns that inflation might remain elevated without further interest rate hikes — something risk assets did not wish to see going forward.\n\n“Participants discussed several risk-management considerations that could bear on future policy decisions,” the minutes read.\n\n“With inflation still well above the Committee's longer-run goal and the labor market remaining tight, most participants continued to see significant upside risks to inflation, which could require further tightening of monetary policy.”\n\nWhile the Fed equally voiced “uncertainty” over the effects of existing monetary tightening, Bitcoin and altcoin traders reacted bearishly to its language, sending BTC/USD through multiple recent support levels.\n\nThese included the 21-week and 100-day simple moving averages (SMAs) at $28,600 and $28,570, respectively.\n\nBTC/USD 1-day chart with 21-week, 100-day SMA. Source: TradingView\n\nBitcoin also challenged the lower boundary of the multimonth trading range, previously highlighted by popular traders Daan Crypto Trades and Crypto Tony.\n\nBTC/USD annotated chart. Source: Daan Crypto Trades/X\n\n“$28,800 has now been lost on Bitcoin so i will be looking to short this down now while we remain below $28,800,” the latter told X subscribers on the day, adding that $28,000 was his first target.\n\nBTC/USD annotated chart. Source: Crypto Tony/X\n\nMarkets retain rate hike pause bets\n\nMeanwhile, not everyone appeared convinced that the next FOMC meeting in September would yield higher rates.\n\nRelated: Bitcoin speculators now own the least BTC since $69K all-time highs\n\nAccording to CME Group’s FedWatch Tool, the odds of the Fed keeping the current rate intact remained at nearly 90% after the release.\n\nFed target rate probabilities chart. Source: CME Group\n\nAnalysts themselves were also far from unanimous. In a forecast last week, Caleb Franzen, senior analyst at Cubic Analytics, said that it was disinflation rather than inflation, which was exhibiting “sticky” behavior.\n\n“Disinflation + stronger earnings + stronger economic data + nearing the end of the rate hike cycle has been a perfect recipe for market returns and the development of an uptrend,” he argued.\n\n“While these conditions could change in the future, I don’t see any evidence that it’s changed yet.“\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvc2hvcnQtdGVybS1ob2xkZXJzLW5vdC1zZWxsaW5nLWJpdGNvaW4taG9sZC0yODAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Short-Term Holders Aren't Selling - Is Bitcoin going to hold above $28000? - CCN.com",
        "content": "Key Takeaways\n\nBitcoin struggling to maintain an uptrend\n\nShort-term holders aren’t interested in selling\n\nChart analysis points out that $28,000 is likely to hold\n\nThe price of Bitcoin has been on a slight decline since mid-July but is actually been in a horizontal range from mid-April when looking at a broader picture. This period of low volatility some might call apathy has caused many guessing, have we seen the end of the uptrend?\n\nEven though the price decrease was seen, overall it is still in an uptrend. But this lack of interest may be making some investors nervous. That isn’t the case with short-term holders. As per Glassnode video report , short-term holders aren’t interested in selling their Bitcoin.\n\nSince the one cohort we could expect to see some immediate action is being inactive, does that mean Bitcoin will maintain trading above $28,000?\n\nShort-Term Holders Aren’t Selling\n\nSell-side Risk Ration for Short-term holders is a metric that describes spot market value (realized profit + realized loss) divided by the realized cap, or in other words, how much the value changed versus the size of the asset, in this case, Bitcoin among short-term holders (less than five months).\n\nA high value indicates an increase in value change – usually seen in profit-taking or capitulation events. Low values mean that the value change is small and usually happens right before a large move.\n\nAs this metric fell to its all-time low, it means that short-term holders are sitting around the breakeven price – the price they bought Bitcoin, and aren’t willing to sell. This can be interpreted as a sign that they are offering the price its needed support around the current levels of $28,400.\n\nShort-term holders are considered an active cohort, more sensitive to smaller price changes. The chart above shows that they are not considering selling their Bitcoin just yet, even though the previous uptrend has been extinguished.\n\nThe conclusion here can be drawn that they are sitting on the sidelines and waiting for the price to exit the range on either side to take measures – sell at a loss or sell at a profit.\n\nBitcoin Struggles Above $28,000\n\nAs stated at the beginning of the article, Bitcoin’s price reached a similar high level in July as it did in April – $31,000. We have seen a pullback, but according to the chart analysis, there are reasons to believe that it will stay above $28,000.\n\nFirst, we see that the price currently interacts with the intersection between two support – the horizontal one and the ascending one. In particular, the ascending one is the more reliable one, dating from January 1, and was respected on two more occasions.\n\nSecond, the RSI on the daily chart shows that Bitcoin is close to the oversold zone, currently sitting at 34.5%. In comparison, it was on the same levels as on June 15 when the previous rise started.\n\nThird, the Elliott Wave count points out that the price hasn’t finished its five-wave impulse and that another higher high is to be expected. It is still unclear where this high can end, but the next significant resistance zone is at $37,500, where our first expected stopping point\n\nConclusion\n\nEven though the price of Bitcoin has been struggling to keep up its bullish momentum, short-term holders aren’t selling just yet. Chart analysis shows that the price is likely to hold above $28,000 which is its current significant support point.\n\nIf the price breaks the level and short-term holders start selling at a loss, the price could go into a higher degree downtrend and spark an even large descending move.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8xNTI4NzIvYml0Y29pbi1ldGhlcmV1bS1mbGFzaC1jcmFzaC10cmlnZ2Vycy04MDAtbWlsbGlvbi1saXF1aWRhdGlvbnPSAV5odHRwczovL2RlY3J5cHQuY28vMTUyODcyL2JpdGNvaW4tZXRoZXJldW0tZmxhc2gtY3Jhc2gtdHJpZ2dlcnMtODAwLW1pbGxpb24tbGlxdWlkYXRpb25zP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Flash Crash Triggers $800 Million in Liquidations - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin continued its crash Thursday afternoon, shedding 7% of its value in 20 minutes and briefly dipping below $26,000 in the process. And as Bitcoin went, so too did other leading cryptocurrencies, including Ethereum—with a cascade of liquidations topping $800 million to follow.\n\nThe largest cryptocurrency by market cap is trading for $26,314 as of this writing, according to CoinGecko—a nearly 10% dive for Bitcoin over the last 24 hours. It fell as low as $25,649 this afternoon, but has rebounded slightly since then. The price of Bitcoin hasn't been this low since the start of June.\n\nBitcoin's dive Thursday followed word of China's sizable Evergrande Group property developer filing for Chapter 15 bankruptcy protection in New York. Around the same time, word began to spread about a Wall Street Journal report noting that Elon Musk's SpaceX wrote down the value of its Bitcoin holdings by $373 million and sold an unspecified amount.\n\nAD\n\nAD\n\nThe rest of the crypto market was in the red Thursday afternoon Eastern Time, too. Ethereum, the second largest digital asset by market cap, is down nearly 10% in the last day, trading hands for $1,640 as of this writing. It fell as low as $1,576 on Thursday afternoon, per CoinGecko.\n\nOther cryptocurrencies like Ripple (XRP), Shiba Inu (SHIB), and Litecoin (LTC) are all down at least 14% over the past day. All three had seen significant upward price movement in recent weeks.\n\nAccording to data from Coinglass, the crashing prices across the board triggered a cascade of liquidations for overleveraged positions, with $801 million worth of liquidations tallied in the hour after the price started dropping.\n\nBitcoin had recently been on a run after a surge of interest from institutional investors—including an application from BlackRock for a spot crypto exchange-traded fund (ETF)—helped propel the biggest and oldest digital asset to a yearly high above $31,000 per coin.\n\nBut interest may be waning as the U.S. Securities and Exchange Commission (SEC) does not appear to be in a hurry to approve the long list of high-profile applications. Investors appear eager for a Bitcoin ETF, but regulators have been slow to approve one. Such an investment vehicle does not yet exist in the U.S.\n\nAD\n\nAD"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS92aWRlby82MzM0MzYwNjg2MTEy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin always moves into stronger hands: Natalie Brunell - Fox Business",
        "content": "Log in to comment on videos and join in on the fun."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbG9uLW11c2stc3BhY2V4LWJpdGNvaW4td3JpdGUtZG93bi1iaXRjb2luZXJzLWVsb24tbXVza9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "SpaceX Bitcoin write-down sparks confusion, Bitcoiners quiz Elon Musk - Cointelegraph",
        "content": "SpaceX’s Bitcoin write-down report on Aug. 18 sparked confusion among the crypto community. The report published in The Wall Street Journal puzzled many, who questioned whether SpaceX held $373 million worth of Bitcoin (BTC) and sold it in 2021–2022 or whether they only reduced their Bitcoin exposure by the same amount.\n\nSeveral social media outlets reported that SpaceX had sold its entire BTC holdings, while others expressed uncertainty, claiming they were unable to confirm the amount based on the wording of the report.\n\nI actually read the WSJ report. I think @BitcoinMagazine is wrong here\n\n\n\nYes, the report claims that SpaceX marked down the value of their bitcoin by 373m (btw, that doesn't mean they SOLD 373m) and sold *some*, but selling some doesn't necessarily mean they have no bitcoin left https://t.co/rLgwA0N8Zi pic.twitter.com/GSrOio7zku — Pledditor (@Pledditor) August 17, 2023\n\nElon Musk revealed in 2021 that SpaceX holds Bitcoin, as does Tesla, on its balance sheet. While Tesla’s Bitcoin holdings were made public, there were no estimations around SpaceX’s BTC holdings, which has been key to the ongoing confusion. Tesla once held $1.5 billion worth of BTC purchased during the bull market but revealed it had sold 72% of its holdings in Q2 2022.\n\nThe SpaceX write-off claims were also believed to be one of the key catalysts behind the $2,000 BTC price drop, although several others denied it being a cause. Musk hasn’t addressed the issue yet, but the market FUD made him a target of Bitcoin proponents who questioned his strategy of buying high and selling low, while a few others called it market FUD.\n\nBuy High & Sell Low - Elon Musk's #Bitcoin strategy for Dummies https://t.co/yBKsPdg59B — Matt C⚡️ (@mithcoons) August 17, 2023\n\nOne Reddit user wrote that Musk is running out of cash across all his companies, suggesting that Musk might sell “all of his Bitcoin and doge within the next 6 months.”\n\nRelated: Elon’s ‘not afraid of blowing things up’ — Ex-Twitter exec on working under Musk\n\nUsers on X (formerly known as Twitter) also called out Musk for his “paper hands,” a term used for those who sell their BTC holdings prematurely. Others linked the BTC write-down to X’s ambition of becoming a payment giant.\n\nMusk appears to be going to toe-to-toe against #Bitcoin with his X empire.\n\n\n\nI wish him well, although I don't think this is wise. https://t.co/WFmOdVBh1E — Dr. Jeff Ross (@VailshireCap) August 17, 2023\n\nWhile the dilemma around SpaceX’s BTC holdings continues, Bitcoin proponents advocated traders to hodl BTC and not fall for market FUD.\n\n@SpaceX didn't sell its Bitcoin, and neither did@ElonMusk. Now sit back and relax, just some intelligent guys getting 700+ million in longs. Don't leverage, be patient and just #HODL. — Lodewyck Berghuijs (@LodewyckBTC) August 18, 2023\n\nBitcoin’s price was trading at $26,433 at the time of writing, having overcome the $26,000 resistance level. BTC’s price decline of 9% last night also led to a sharp downturn in the altcoin market where top altcoins recorded a double-digit decline.\n\nMagazine: Simon Dixon on bankruptcies, Celsius and Elon Musk: Crypto Twitter Hall of Flame"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvYml0Y29pbi1hbmQtY3J5cHRvLW1hcmtldC1pbi1mcmVlZmFsbC13aGVyZS13aWxsLWl0LXN0b3Av0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin and Crypto Market in Freefall: Where Will it Stop? - CCN.com",
        "content": "Key Takeaways\n\nBitcoin declined by 13% at its lowest wick from yesterday, August 17\n\nThe crash was caused by a long squeeze\n\nA bounce to $28,000 is expected shortly\n\nThe cryptocurrency market has been in the red today, August 18, with a major crash happening across the crypto space. Bitcoin’s price came down by 8.8% from its August 17th open and reached $25,244 on its lowest wick, according to Coinbase data.\n\nMany have speculated as to why the market started crashing suddenly, and there are some factors that stand out. In this analysis, we are going to cover these reasons but also point out where the market could be headed next.\n\nReasons Behind The Crash\n\nJames Butterfill, the head of research at CoinShares , has taken it to Twitter to discuss his reasoning behind the crash.\n\nOur thoughts on what’s behind the recent Bitcoin price crash: – Prompted by the market realising that the SEC approval of a Bitcoin ETF in the US isn’t imminent. – Fears over the economic downturn in China gathering pace as deflation sets in, although this could ultimately… — James Butterfill (@jbutterfill) August 18, 2023\n\nHe highlighted the market’s adjusted expectations regarding the SEC’s approval of a Bitcoin ETF, indicating that approval wasn’t immediately expected. He also pointed to concerns over China’s economic downturn and its potential deflationary effects.\n\nAdditionally, Bitcoin’s trading volume has reduced significantly, making the market more reactive to larger trades. Historical data also suggests Bitcoin’s low volatility often precedes sharp price changes.\n\nThough SpaceX’s recent BTC financial move played a part, other factors, such as rising 30-year rates, may indicate an impending broader asset class crash. In essence, Bitcoin’s price is influenced by various global and market factors, not just headline-grabbing events.\n\nLooking at some key on-chain metrics, we can say that the real reason behind this crash comes from the derivatives market, namely a large leverage flush and long position liquidations – long squeeze.\n\nFirst, looking at the Bitcoin balance held on major exchanges, we can see that there wasn’t any significant inflow to exchanges. This means that on-chain holders haven’t put back their BTC on exchanges in order to sell, so the selling pressure hasn’t come from this side.\n\nBut looking at the open interest chart, we can see a different picture. Open interest stands for the number of open positions (both long and short positions) currently on a derivative exchange’s trading pairs.\n\nA sharp decline occurred here, meaning that many traders have closed their positions. The closed positions are definitely the vast majority of longs.\n\nThis event marked the highest long liquidation we have seen this year, with 5694 long positions closed yesterday. The last time we saw this high of a number was November 9, when this number was even slightly higher, and the price of Bitcoin crashed by 27%.\n\nIn comparison, the number of short positions closed was insignificant, as seen in the chart above. From these charts, we can conclude that long-position traders were stopped out, forcing them to sell, which caused a cascading effect known as the long squeeze.\n\nPrice Analysis\n\nThere are two scenarios on a macro level ahead, but both point to the same near-term price action.\n\nAs we have seen the completion of the five-wave impulse from November 21, now we are either seeing the first major bull market ABC correction, or the larger five-wave move that is going to lead the price of Bitcoin into its final bear market low.\n\nIn the short term, a recovery will be expected starting at the current level, and most likely back to $28,000. This recovery would be either a B wave in a bullish scenario or wave 2 in a bearish scenario. With the RSI signaling extreme oversold conditions on the daily chart, we could expect this recovery to start anytime soon.\n\nNext, we would be expecting the third descending move from which we can further validate which scenario would be the primary one. If the bullish one is in play, then the price is headed toward 0.618 Fibonacci retracement level at $21,500.\n\nAlternatively, if the price goes below the 0.618 Fibonacci level it could indicate that we are seeing wave 3 from the five-wave pattern and the ultimate target for the completion of this pattern could be at the next most significant support zone around $11,000.\n\nConclusion\n\nThe whole market has been in a freefall since August 17, but as the sharp decline was made, a bounce would be expected shortly. However, this bounce can only take the price so far as the market structure implies the starting downtrend.\n\nThe first optimal target for the completion of this decline would be $21,500 in a bullish case, but the next one is much lower, at the $11,000 zone, in a bearish case.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTgvYml0Y29pbi1idGMtZXRoLXhycC1tYXRpYy1kb2dlLXNoaWItcHJpY2UtbmV3cy_SAV9odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzE4L2JpdGNvaW4tYnRjLWV0aC14cnAtbWF0aWMtZG9nZS1zaGliLXByaWNlLW5ld3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Plunged 11% in Worst Week Since FTX’s Collapse. What’s Next for BTC’s Price? - CoinDesk",
        "content": "“We believe that a lot now rests on [U.S. Federal Reserve Chair Jerome] Powell's speech at Jackson Hole next week, but having held the very key 24-25k zone on this move, our wave count calls for an end to the corrective Wave A here, a bounce in Wave B to retest the bottom of the wedge,” the firm explained in a market update sent via Telegram. “This ends off with the final Wave to end the quarter.”"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDgvMTgvZWxvbi1tdXNrLWJpdGNvaW4tc2VsbC1vZmYtc3BhY2UteC10b2tlbi1zYWxlL9IBWGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDgvMTgvZWxvbi1tdXNrLWJpdGNvaW4tc2VsbC1vZmYtc3BhY2UteC10b2tlbi1zYWxlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "No, Elon Musk didn’t spark the Bitcoin selloff - Fortune",
        "content": "Volatility is back. After months of relative calm in the crypto markets—so much so that some were declaring Bitcoin to be downright boring—prices plunged on Thursday with the flagship currency falling nearly 10%, to about $25,000, before recovering slightly. Ethereum, XRP, and other big currencies likewise buckled.\n\nThe cause for the sudden tumult is hard to pinpoint, but for now, it’s possible to say what didn’t cause Bitcoin to crash. Namely, contrary to a flurry of excited tweets and headlines, Elon Musk is not to blame.\n\nThe theory got traction yesterday after the Wall Street Journal published a scoop about the finances of Musk’s privately held rocket company, SpaceX. While the piece focused on the company’s revenues and research costs, it included this line at the end: “The documents also show SpaceX wrote down the value of Bitcoin it owns by a total of $373 million last year and in 2021 and has sold the cryptocurrency.”\n\nThe story coincided with a broad selloff of Bitcoin, leading some to conclude that SpaceX was the catalyst. Even the normally reliable Bloomberg published a headline (since changed) that read, “Bitcoin Plunge Spurs Liquidations as SpaceX’s Token Sale Weighs.”\n\nThere are a number of problems with this assessment beyond the basic one that correlation doesn’t always equate to causation. The biggest one lies with the quirky accounting rules surrounding crypto that require companies to record losses (“impairments” in accounting speak) when token prices fall, but that don’t let them record gains if tokens rise. So if a firm holds one Bitcoin and the price drops from $30,000 to $25,000 on Monday but then climbs to $35,000 on Tuesday, it must show a $5,000 loss on its balance sheet.\n\nWhile the Journal’s report says SpaceX sold cryptocurrency, we don’t know if the company sold all of it or if the sale occurred as one or multiple transactions. In any case, Bitcoin’s market cap is over $500 billion, so it’s unlikely that SpaceX selling all or part of its holdings would be enough to trigger a drop like the one we saw on Thursday.\n\nSo what did cause Bitcoin to plunge? There are a few likely explanations, most notably yesterday’s news that U.S. interest rates could keep climbing. While crypto price patterns can still be unpredictable, it’s become accepted in the past two years that investors regard Bitcoin as a “risk-on” asset to buy in bullish conditions—and that they will rapidly dump it in the face of macroeconomic headwinds. Right now, those headwinds also include the witches’ brew that is China’s economy at the moment as well as painful real estate conditions.\n\nAt the same time, as CoinDesk notes, the crypto market is prone to cascading selloffs when prices shift and brokerages liquidate positions held on margin—which is what happened yesterday. The bottom line here is that, when crypto prices crash, it is almost never the result of a single factor. As for what happens next, it’s hard to say—other than that, all of a sudden, crypto markets are no longer boring.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe SEC is reportedly set to approve several ETFs for Ethereum futures as soon as October. (Bloomberg)\n\nThe judge presiding over SEC v. Ripple granted the agency permission to file an interlocutory appeal of her decision that XRP is not a security. (Fortune)\n\nIn a closely watched lawsuit over decentralized ETH-mixing service Tornado Cash, a judge rejected the crypto industry’s argument that the DOJ failed to designate an entity to sue. (CoinDesk)\n\nCrypto hacks are down this year, but North Korean cybercriminals have nonetheless managed to steal $200 million, according to TRM Labs. (Fortune)\n\nJoseph Yam, a crypto critic and advocate for the yuan, is poised to become the next “czar” of Hong Kong’s financial markets. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nBiggest bear market signal yet?"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vbmV3cy5ibG9vbWJlcmdsYXcuY29tL3VzLWxhdy13ZWVrL3F1YW50dW0tY29tcHV0aW5nLWNvdWxkLXRocmVhdGVuLWJsb2NrY2hhaW4tY3J5cHRv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Quantum Computing Could Threaten Blockchain, Crypto - Bloomberg Law",
        "content": "Quantum computers have the potential to break the most advanced cryptographic protocols—including those used for blockchain protocols—in operation today. This is because quantum computers, which rely on principles of quantum mechanics, can in theory complete certain computationally intensive operations that would take today’s classical computers an extraordinary amount of time.\n\nA quantum computer works by using quantum bits, or qubits. In contrast to traditional binary bits, which can only be either 0 or 1, qubits can be a combination of 0 and 1 at the same time. This property of qubits, known as superposition, enables quantum computers to perform multiple calculations in parallel. Additionally, a phenomenon known as entanglement allows two qubits to be linked in such a manner that the state of one qubit affects the state of the other, regardless of the physical distance between them. This effect, combined with superposition, allows quantum computers to perform certain calculations even faster.\n\nBut today’s quantum computers are finicky and of limited utility. They’re susceptible to the slightest environmental interference—such as the Earth’s magnetic field, local radiation, and even cosmic rays—which make calculations performed by current quantum computers error-prone. Because of these technical and operational challenges, quantum computers are currently accessible to only a small handful of companies and researchers, and it may take a decade or more for quantum computers to impact current cryptographic protocols.\n\nHowever, recent research suggests that this inflection point may come sooner than anticipated. A June 2023 paper by IBM and UC Berkeley researchers demonstrated that even noisy, error-prone quantum computers can provide utility beyond what’s capable of today’s classical computers.\n\nThis potentially accelerated timeline could have far-reaching consequences, including for many cryptocurrencies and their underlying blockchain protocols, as the cryptographic functions and encryption standards they rely on could soon be vulnerable to quantum attacks.\n\nFor example, cryptocurrency miners using quantum computers may be able to mine cryptocurrency much faster than other miners. This could threaten the decentralization of many mining-based blockchain protocols. Quantum computers could also decrypt the private key from a public key, enabling bad actors to control, and ultimately steal, others’ cryptocurrencies.\n\nQuantum computers thus could pose a significant threat to cryptocurrencies and blockchain technology. In response, some developers are already working to future-proof their blockchain protocol by exploring ways to transition the cryptography currently securing the protocol to quantum-resistant cryptography.\n\nInvestors, users, and regulators must carefully consider the potential risks quantum computers pose to cryptocurrencies and blockchain technology more generally.\n\nDisruption of Cryptocurrency Mining\n\nMany of the world’s most popular and widely used cryptocurrencies, including Bitcoin, rely on proof-of-workmining to secure the underlying blockchain protocol. A PoW blockchain protocol requires network participants known as miners to compete with each other to be the first to solve complex mathematical puzzles to validate new transactions on the blockchain. The winner of the mining competition is rewarded with cryptocurrency—known as block rewards.\n\nA quantum computer eventually could solve mining puzzles much faster than current-generation mining devices, allowing those with access to quantum computers to amass mining rewards and control the transaction validation process by taking over a majority of the network’s computing power. This is known as a 51% attack. Researchers have suggested that 51% attacks on bitcoin by quantum computers may not be possible until 2028 at the earliest though,recent evidence indicates it could happen sooner.\n\nDecryption and Theft of Private Keys\n\nQuantum computers capable of breaking modern cryptography may also enable bad actors to control and steal other people’s cryptocurrency. Specifically, future quantum computers in the future could ascertain cryptocurrency private keys from their corresponding public addresses, as private keys are encrypted using what are known as digital signature schemes based on modern cryptographic protocols. This would be akin to a hacker gaining access to a victim’s email password based on the publicly available username or email address.\n\nResearchers generally believe that this type of security threat to public blockchain protocols is more likely to be technologically feasible than a quantum attack on the cryptocurrency mining process due to fundamental differences in the algorithms that would be used to carry out the attacks.\n\nRisks and Potential Consequences\n\nThe global cryptocurrency market capitalization stands at over $1.15 trillion. Cryptocurrencies are an ever-growing and integral part of investment portfolios of both retail and institutional investors across the globe. Although not an immediate threat, quantum computers could soon pose significant and material risks to this burgeoning and resilient asset class.\n\nAs such, there may be certain circumstances where various entities, including asset managers and public companies, may want to consider publicly disclosing the impact quantum computers could have on cryptocurrency investments or investment strategies involving cryptocurrencies.\n\nThis article does not necessarily reflect the opinion of Bloomberg Industry Group, Inc., the publisher of Bloomberg Law and Bloomberg Tax, or its owners.\n\nAuthor Information\n\nDaniel Davis is partner and co-chair in Katten’s financial markets and regulation practice.\n\nAlexander Kim is an associate in Katten’s financial markets and regulation practice.\n\nWrite for Us: Author Guidelines"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1ldGhlci1ldGgtbGVzcy12b2xhdGlsZS10aGFuLW9pbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin and Ether now less volatile than oil: Report - Cointelegraph",
        "content": "The Bitcoin (BTC) and Ether (ETH) 90-day price volatility hit a new multi-year low in August as the top two cryptocurrencies continue to trade under their key resistance of $30,000 and $2,000, respectively.\n\nAccording to data shared by crypto analytic firm Kaiko, the 90-day volatility of BTC and ETH hit 35% and 37%, respectively, making it less volatile than oil, with volatility of 41%. Such a decline in the price momentum of the top two crypto assets was last seen in 2016.\n\n90-day price volatility of Bitcoin, Ether and oil. Source: Kaiko\n\nThe chart above indicates that BTC’s and ETH’s price volatility is more than half than at the same time last year. While August is considered a bullish month for the crypto ecosystem, the declining price fluctuation is considered bullish by many.\n\nApart from the 90-day volatility at its lowest in seven years, the daily Bitcoin volatility is also at a five-year low.\n\nBitcoin daily volatility reaches 5-year low. Source: TradingView\n\nA Bitcoin technical analyst who goes by the social media name of “CryptoCon” took to the X platform to share observations about Bitcoin’s price volatility decline and what actually follows the period of low volatility.\n\nRelated: Bitcoin speculators now own the least BTC since $69K all-time highs\n\nThe technical analyst noted that Bitcoin’s price went through a similar cycle of low price volatility in 2020 before the bull market picked up; however, they warned against the sideways movement of the top cryptocurrency.\n\n#Bitcoin volatility continues to decrease, which I've shown is bullish\n\n\n\nBut the burning question is, when does the sideways grind end?\n\n\n\nUpon thinking about I was reminded of a time very similar to now… pic.twitter.com/psO50vxUWD — CryptoCon (@CryptoCon_) August 16, 2023\n\nThe analyst noted that despite the Black Swan event of 2020, when BTC’s price fell over 50% in a day below $5,000, Bitcoin made a recovery the very next month. However, when BTC’s price neared the $10,000 mark, the momentum vanished, again recording very low volatility. After three months of low volatility, the price of BTC broke out and created new highs before running into resistance again and seeing a sideways movement.\n\nHistorical BTC price momentum after low volatility. Source: X\n\nThe analyst concluded that Bitcoin’s price leaps out of lows after a period of low volatility to form a first high, followed by another second high, while a third one is made against the key resistance. CryptoCon concluded that every major low volatility period for BTC is followed by a big move.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1wcmljZS0xNTBrLWFmdGVyLWhhbHZpbmctMjAyNC1wcmVkaWN0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price will surge past $150K if spot ETFs are approved: Analyst - Cointelegraph",
        "content": "The price of Bitcoin (BTC) will surge past an eye-watering $150,000 by the end of 2024, as long as the current slew of United States spot-Bitcoin exchange-traded funds (ETFs) are approved, according to investment research boutique Fundstrat.\n\nIn an Aug. 16 interview on CNBC’s Squawk Box, Fundstrat’s managing partner and head of research, Tom Lee, predicted that a bundle of successful Bitcoin spot ETF applications would shift Bitcoin’s supply-demand dynamics towards considerable price appreciation.\n\nWhen asked what the price of Bitcoin could be by the end of next year, Lee didn’t hold back:\n\n“If the spot Bitcoin (ETF) gets approved, I think the demand will be greater than the daily supply of Bitcoin, so the clearing price [...] is over $150,000, it could even be like $180,000.”\n\nLee clarified that this could be the case so long as it is a United States-approved spot Bitcoin ETF, as there are already spot Bitcoin ETFs in Europe.\n\n“If the Spot #Bitcoin ETF gets approved … the clearing price of $BTC is above $150,000.” – Tom Lee @fundstrat pic.twitter.com/ILQZqdjsZA — Michael Saylor⚡️ (@saylor) August 16, 2023\n\nThe United States currently makes up 97.7% of the global trading volume for crypto-related ETFs, according to Bloomberg senior ETF analyst Eric Balchunas. Once spot Bitcoin ETFs are approved, this could go to 99.5%, he said.\n\nHowever, even if the spot ETF applications are rejected, Lee still predicts a considerable price push to come from Bitcoin’s next halving event, expected to take place in April 2024.\n\n“You will have a drop in supply again, so the clearing price has to increase. But it won’t be six figures.”\n\nIn June, Wall Street heavyweights Fidelity, Invesco, Wisdom Tree and Valkyrie followed the world’s largest asset manager BlackRock in applying for a Bitcoin spot ETF with the SEC.\n\nHowever, some of these firms may not learn their fate until sometime in 2024 as the SEC has up to 240 days to make a final decision on an application after commencing the review process.\n\nThe outcome of Grayscale’s appeal to convert its GBTC trust product into a Bitcoin spot ETF is however expected to come sooner rather than later.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart recently estimated that there’s a 65% chance of these Bitcoin spot ETFs being approved by the securities regulator — a significant increase from before BlackRock’s application.\n\nRelated: $160K at next halving? Model counts down to new Bitcoin all-time high\n\nOther have tipped that a $100,000 Bitcoin price could come much sooner than expected, with Blockstream CEO Adam Back recently wagering that Bitcoin will notch the new price milestone the month before the halving event.\n\nHowever, not everyone is inclined to agree. Jesse Myer, the co-founder of Bitcoin investment firm Onramp, explained on Aug. 15 that the market would only price in the changed reality 12-18 months post-halving.\n\n“Bitcoin won’t surge to $100k before the next halving,” he said.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRyb3BzLXRvLWEtdHdvLW1vbnRoLWxvdy1kaWQtcHJvLXRyYWRlcnMtYmVuZWZpdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price drops to a two-month low — Did pro traders benefit? - Cointelegraph",
        "content": "The price of Bitcoin fell by 11.5% from Aug. 16 to Aug. 18, resulting in $900 million worth of long positions being liquidated and causing the price to hit a two-month low. Before the drop, many traders expected a breakout in volatility that would push the price upward, but that was obviously not the case. With the substantial liquidations, it’s important to address whether professional traders gained from the price crash.\n\nBitcoin just saw one of its largest daily liquidations by volume in history.\n\n\n\nStarting at 4:30 PM yesterday, #Bitcoin fell 7.5% in 20 MINUTES, erasing $42 billion in market cap.\n\n\n\nThis mass-liquidation event involved more outflows in 1 day than during the FTX collapse in November… pic.twitter.com/KmVNkXoOLw — The Kobeissi Letter (@KobeissiLetter) August 18, 2023\n\nThere’s a common belief among cryptocurrency traders that whales and market makers have an edge in predicting significant price shifts and that this allows them to gain the upper hand over retail traders. This notion holds some truth, as advanced quantitative trading software and strategically positioned servers come into play. However, this doesn’t make professional traders immune to substantial financial losses when the market gets shaky.\n\nFor larger-sized and professional traders, a majority of their positions may be fully hedged. Comparing these positions with previous trading days allows for estimations on whether recent movements anticipated a widespread correction in the cryptocurrency market.\n\nMargin longs at Bitfinex and OKX were relatively high\n\nMargin trading lets investors magnify their positions by borrowing stablecoins and using the funds to acquire more cryptocurrency. Conversely, traders who borrow Bitcoin (BTC) employ the coins as collateral for short positions, indicating a bet on price decline.\n\nBitfinex margin traders are known for swiftly establishing position contracts of 10,000 BTC or greater, underscoring the involvement of whales and substantial arbitrage desks.\n\nAs depicted in the chart below, the Bitfinex margin long position on Aug. 15 stood at 94,240 BTC, nearing its highest point in four months. This suggests that professional traders were entirely caught off guard by the abrupt BTC price crash.\n\nBitfinex margin BTC longs, measured in BTC. Source: TradingView\n\nUnlike futures contracts, the equilibrium between margin longs and shorts isn’t inherently balanced. A high margin lending ratio signifies a bullish market, while a low ratio suggests a bearish sentiment.\n\nOKX USDT/BTC margin lending ratio. Source: OKX\n\nThe chart above shows the OKX BTC margin lending ratio, which approached 35 times in favor of long positions on Aug. 16. More importantly, this level aligned with the preceding seven-day average. This implies that even if external factors skewed the metric previously, it can be deduced that whales and market makers maintained their position on margin markets before the Bitcoin price collapse on Aug. 16 and Aug. 17. This information supports the argument that professional traders were unprepared for any form of negative price movement.\n\nFutures long-to-short data proves traders were unprepared\n\nThe net long-to-short ratio of the top traders excludes external factors that may have exclusively influenced the margin markets. By consolidating positions across perpetual and quarterly futures contracts, a clearer insight can be gained into whether professional traders are leaning toward a bullish or bearish stance.\n\nOccasional methodological disparities among different exchanges exist, prompting viewers to track changes rather than fixate on absolute values.\n\nExchanges’ top traders' Bitcoin long-to-short ratio. Source: CoinGlass\n\nPrior to the release of the Federal Reserve's Federal Open Market Committee minutes on Aug. 16, prominent BTC traders on Binance exhibited a long-to-short ratio of 1.37, aligning with the peak levels observed in the previous four days. A similar pattern emerged on OKX, where the long-to-short indicator for Bitcoin’s leading traders reached 1.45 moments before the BTC price correction commenced.\n\nRelated: Why did Bitcoin drop? Analysts point to 5 potential reasons\n\nIrrespective of whether those whales and market makers augmented or diminished their positions post the initiation of the crash, data stemming from BTC futures further substantiates the lack of readiness in terms of reducing exposure prior to Aug. 16, be it in futures or margin markets. Consequently, a reasonable assumption can be made that professional traders were taken by surprise and did not profit from the price crash.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xNTMwMjQvYml0Y29pbi1kb3duLWJhZC1hZ2Fpbi13aHktd2hhdC1jb21lcy1uZXh00gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MzAyNC9iaXRjb2luLWRvd24tYmFkLWFnYWluLXdoeS13aGF0LWNvbWVzLW5leHQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Is Down Bad Again—Here's Why and What Comes Next - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin had been sitting relatively still for weeks until yesterday, when it quickly dropped to lows not seen in two months.\n\nThe largest cryptocurrency by market cap at the time of writing was trading for $26,060 per coin, CoinGecko data shows, marking an over 11% dip in the past seven days.\n\nIt’s still up from the lowest point it touched on Thursday, $25,649, but still well below the highs above $31,000 it hit in June.\n\nAD\n\nAD\n\nSo, after a period of little volatility from mid-June into August, what caused the flash crash yesterday?\n\nA lot of it has to do with the wider economy—including American regulation and institutional investors being unsure—as well as low liquidity, experts told Decrypt.\n\nAccording to data firm Kaiko, liquidity in the Bitcoin market has been dropping for some time now on major exchanges like Binance and Coinbase. This means that when big holders want to shift their holdings, the rest of the market will feel it. And feel it they did: at one point yesterday, Bitcoin shed 7% of its value in 20 minutes.\n\n“We don’t know who dumped Bitcoin and triggered this cascade liquidation, but it's less likely OG miners or U.S. investors,” CryptoQuant CEO Ki Young Ju said.\n\nThe “cascade liquidation” of over $1 billion was caused by spooked investors—major ones too—wanting to shift risk following the news that China’s Evergrande Group property developer filed for Chapter 15 bankruptcy protection in New York.\n\nAD\n\nAD\n\n“Massive property developers' movements and problems in real estate could move into other parts of the economy,” Bob Bodily, CEO of Ordinals marketplace Bioniq, said.\n\nHe noted that “market illiquidity, and prices moving sideways for a while” also contributed to the flash crash. Meanwhile, he categorized a Wall Street Journal report that Elon Musk’s SpaceX wrote down the value of its Bitcoin holdings as a rumor—\"but pretty soon everybody was talking about it.\" He said that it may have helped contribute to the drop in prices.\n\nBlackRock, the world’s biggest asset manager, helped spur a June market bull run when it submitted an application for a spot Bitcoin crypto exchange-traded fund (ETF) to the U.S. Securities and Exchange Commission.\n\nInvestors were optimistic. But the SEC doesn’t appear to be in a rush to approve any of the firms applying to it for such a product.\n\nCoinShares Head of Research James Butterfill said “markets are now coming to terms with the realization that an immediate SEC approval for a Bitcoin ETF in the U.S. is unlikely,” and so investors are more likely to want to shift their crypto holdings.\n\nHe added that this, combined with China’s woes and investors being “highly attuned to regulatory decisions,” impacted the price of the biggest digital asset. Bodily, meanwhile, suggested that \"high volatility\" for Bitcoin will continue amid the \"fairly shaky\" macro environment.\n\nIn other words, despite a relatively sleepy summer of late, Bitcoin's wild price swings may be here to stay in the short term."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTctYXVndXN0LTIwMjMvYXJ0aWNsZXNob3cvMTAyNzk1NzI2LmNtc9IBwAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTctYXVndXN0LTIwMjMvYW1wX2FydGljbGVzaG93LzEwMjc5NTcyNi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tanks below $28,700, Shiba Inu, Dogecoin fall up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading in the red in Thursday's trade. Bitcoin (BTC) fell 1.62% to $28,629, whereas Ethereum (ETH) was below the 1,800 level.Meanwhile, the global cryptocurrency market cap was trading lower, around $1.14 trillion, falling 1.61% in the last 24 hours.\"Bitcoin has dropped 3% overnight and is fighting to hold $28,600 as support (which is in line with its 100-day moving average). This comes as global stock indices, including S&P 500, continue to be in the red - losing gains achieved over the past few months. Any further drop in Bitcoin will push the asset to retest $26,000 over the coming weeks,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Other top crypto tokens, BNB Dogecoin , Solana, Shiba Inu, Polygon and Litecoin were also trading lower on Thursday.The market cap of Bitcoin, the world's largest cryptocurrency, was around $557 billion. Bitcoin's dominance is currently 49%, according to CoinMarketCap.BTC volume stood at approximately $16.49 billion, rising 24.8% in the last 24 hours.\"The BTC/USDT pair remains below the 20-day EMA, and the Relative Strength Index (RSI) is in negative territory. This suggests a minor advantage to the bears. Bitcoin remains confined within a tight range, showing no definite indications of breaking free. The recent market update from QCP Capital, a trading platform, suggests that Bitcoin, which is currently valued at $28,596, could potentially maintain this subdued state for several weeks before showing significant movement around September,\" said ZebPay Trade desk.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point to a Buy sentiment. The Relative Strength Index (14) sits at 36, with a neutral outlook. The Stochastic %K (14, 3, 3) at 16 and the Average Directional Index (14) at 13 indicate a Neutral outlook.\"\"The MACD Level (12, 26), at -171, indicates 'Buy'. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 7 and William's Percentage indicates a Buy sentiment at -86,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 11.47 hours, IST on August 17, 2023)Bitcoin $28,629 -1.62%Ethereum $1,798 -1.27%Tether $0.9987 -0.01%BNB $231 -1.48%XRP $0.59 -2.67%Cardano $0.2769 -0.84%Dogecoin $0.06799 -3.78%Solana $23.25 -0.71%Polygon $0.6217 -1.42%Litecoin $75.46 -3.80%Polkadot $4.76 -0.57%Tron $0.07455 -2.42%Shiba Inu $0.000009269 -6.73%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXRoZXItY3RvLXBhb2xvLWFyZG9pbm8tc2F5cy1iaXRjb2luLW1pbmluZy1uZWVkcy1iZXR0ZXItYW5hbHl0aWNhbC10b29sc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Tether CTO Paolo Ardoino says Bitcoin mining needs better analytical tools - Cointelegraph",
        "content": "Stablecoin issuer Tether (USDT) is building specialized software to optimize Bitcoin mining and renewable energy operations using data analyticsfollowing recent investment endeavors into both categories.\n\nIn conversation with Cointelegraph, Tether Chief Technology Officer Paolo Ardoino expanded upon details of its in-development mining software, which aims to deliver improved analytics and performance of mining sites.\n\nRelated: Tether’s game plan in El Salvador: Why invest in Volcano Energy?\n\nMoria, named after the dwarven mining kingdom from The Lord of the Rings trilogy, is being built by Ardoino and a team of developers. The Tether technology chief had previously shared details of the software in a recent social media post.\n\nTether is investing in renewable energy production (with excess reserves / profits) and sustainable #bitcoin mining.\n\nWhile there are ton of cloud-based bitcoin mining trackers, everything I've seen so far is not really customizable and lacks of deep-level orchestration… — Paolo Ardoino (@paoloardoino) August 15, 2023\n\nArdoino says that while the ecosystem has a number of cloud-based Bitcoin mining trackers, these lack a high degree of customizability and “deep-level orchestration capabilities” that has left a gap in the market for a solution that analyzes real-time data to optimize mining and energy outputs.\n\n“So far most software that mining companies use are basic cloud solutions that have a simplified interface that provides an overview of the current status of the bitcoin mining site.”\n\nArdoino said that having access to deep data sources of an energy production site or a mining site requires complex and efficient analytical tools in order to understand the performance of a site and its surrounding environment.\n\n“If energy used by the mining site is wind or solar, there are optimization parameters, like predicted speed of wind for a specific day or a specific hour of the day, that could be used to overclock some of the miners and boost the production.”\n\nTether has been actively investing in energy production and Bitcoin mining using a portion of excess reserves of USDT. Ardoino said that ensuring data produced by a variety of devices including miners, containers and electric transformers is recorded, monitored and analyzed in real time is imperative to streamlining operations.\n\nHis recent X post extrapolated the value to be derived from a Bitcoin mining site made up of thousands of physical mining units stored in multiple containers connected to thousands more devices. The technology executive likened a mining site to an Internet of Things project that produces millions of data points.\n\nArdoino added that the development focus of Moria is currently on its Bitcoin analytical tools, before the software is extended to cover energy production.\n\n“There as well you have solar panels, wind mills etc that provide an incredible amount of information.”\n\nArdoino describes Moria’s software as a Holepunch-based scalable and modular architecture that is able to collect, aggregate and analyze data from a variety of devices to optimize Bitcoin mining.\n\nTether recently announced that it would invest $1 billion into El Salvador’s volcano energy project, directing shareholder profits into energy infrastructure and Bitcoin mining operations. In another extensive interview with Cointelegraph, Ardoino outlined Tether’s reasoning behind the move.\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LnNwbGNlbnRlci5vcmcvaGF0ZXdhdGNoLzIwMjMvMDgvMTcvaG9zdGluZy1jb21wYW55LXVzZWQtZXh0cmVtaXN0cy1yZWNlaXZlZC0zLW1pbGxpb24tYml0Y29pbi1hZnRlci0yMDIxLWhhY2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Hosting Company Used by Extremists Received $3 Million in Bitcoin After 2021 Hack - Southern Poverty Law Center",
        "content": "An unknown person or group transferred 62.5322 bitcoins, then worth $2,922,069, to a wallet associated with Epik on Sept. 14, 2021, at 10:08 p.m. Coordinated Universal Time (UTC). The transfer took place less than 36 hours after members of the hacker collective Anonymous announced that they had gained access to Epik’s backend servers and exfiltrated over 150 gigabytes of the company’s operations and customer records, including domain purchases, payment histories and account information.\n\nTwo days after receiving the nearly $3 million in bitcoin, the person in control of Epik’s wallet transferred the funds, along with an additional six bitcoins, to another wallet. The recipient of nearly 70 bitcoins appears to be Arsyan Ismail, a Malaysian businessman and programmer who, according to social media posts and Malaysian news reports, was accused by his prior employer of being involved in a get-rich-quick scam that authorities in that country estimate defrauded half a million people between 2013 and 2017.\n\nThe Data Lab confirmed that the address that received the 62 bitcoins was part of a cluster of addresses belonging to Epik through our comparison of the wallet’s activity on the blockchain and hacked-and-leaked sales records. However, we were unable to determine who owned the wallet that transferred the funds to Epik. The Data Lab identified the proprietor of the wallet that received the 70 bitcoins on Sept. 16 as Ismail through his use of custom wallet addresses containing his first name and the name of one of his companies, as well as a 2014 post that he shared in a bitcoin-focused Facebook group that contained one wallet address.\n\nEpik began accepting bitcoin as a payment type for its services in fall 2016, according to a press release from that time. In a question-and-answer session following the 2021 hack, Epik founder Rob Monster described his company as “one of the first registrars to accept crypto.” Nevertheless, the Epik-controlled wallet, which was active between March 2020 and September 2022, only received a total of roughly 85 bitcoins. As a result, the Sept. 14, 2021, transfer accounts for 74% of the wallet’s total transactions during its lifetime.\n\nEpik is a web services company founded in 2009 by Monster, a businessman based in Sammamish, Washington. Though Monster has denied holding any sympathies for white nationalism, Epik became the web company of choice for the radical right in late 2018.\n\nHatewatch reached out to Monster over email and through a contact form on the website for his company, Kingdom Ventures. Hatewatch reached out to Ismail over an email on his personal website. Neither of the two men responded.\n\nA who’s who of the global far right\n\nProminent far-right extremist sites began turning to Epik after Epik’s services helped Twitter knockoff Gab get back online in 2018. Gab had been banned by its prior domain registrar after an October 2018 white supremacist terror attack in Pittsburgh, Pennsylvania.\n\nSince then, Epik has become a haven for websites with ties to right-wing extremism, with its client list representing a veritable “who’s who” of the global far-right movement. Among those who relied on Epik’s services are 8chan, an online message board that has hosted manifestos and livestreams from multiple white supremacist terrorists; Parler, a social media site popular among rioters at the Jan. 6, 2021, insurrection at the U.S. Capitol; and Stormfront, a once-popular online forum founded by Don Black, a former Klansman who was arrested in 1981 for attempting to invade a Caribbean island. Conspiracy theorist Alex Jones, whose junk-news site Infowars helped jump-start the 2021 Capitol insurrection, credited Epik with keeping his network of junk-news channels online.\n\n“We wouldn’t be around if it weren’t for Epik. … They have all the services you need, and they are expanding,” Jones said during an April 2021 broadcast of his show.\n\nThe 2021 hack resulted in years of purchase records, company emails and customer accounts – including from Epik’s privacy service, Anonymize, which allowed customers to conceal their identity – being made available to the public. In addition to some 15 million unique email addresses, the customer data exposed by the hack included IP addresses, phone numbers, passwords and mailing addresses. The material allowed activists, journalists and researchers, including from the Southern Poverty Law Center, to identify the once-anonymous owners of numerous websites, including sites with ties to terrorist organizations.\n\nOn Sept. 2, 2022, Monster stepped down as Epik’s chief executive officer. Brian Royce, the former executive vice president of operations, replaced him. Monster, meanwhile, assumed a role as chairman of the company’s board of directors. A September 2022 press release announcing the decision presented the company under Monster’s leadership as “a defender of civil liberty.”\n\nFollowing a March lawsuit leveled against Epik by one of its clients, the company publicly blamed Monster for a scandal involving its proprietary financial product Masterbucks. Launched in 2022, Masterbucks was intended to compete with online money-transferring platforms like PayPal or CashApp, though it was quickly embroiled in controversy after reports of users being unable to withdraw funds. The complaint from the March lawsuit accused Royce and Monster of mishandling and embezzling funds. According to the complaint, Epik owed a client $327,000 after failing to transfer a domain the client had purchased for that amount.\n\nIn April, less than a month after the lawsuit was first filed, a series of tweets from Epik’s Twitter blamed Monster for the company’s financial woes and scandals. In one April 14 post, Epik blamed Monster for Masterbucks’ failure, saying that it continued to struggle “to manage debt from his company-wide oversights.” Two days later, on April 16, Epik’s Twitter account stated that the company “requested his resignation from the board over apparent conflicts” with creditors.\n\nEpik issued a press release on June 8 stating that the core domain name registration portion of the company had been sold to a new entity, Epik LLC, which retained Royce as CEO. Monster returned as CEO of Epik Holdings Inc., where he retained ownership of some of the lesser-known products, including Masterbucks. Monster rebranded his share of the operation into a new company called Kingdom Ventures.\n\nPhoto illustration of Epik founder Rob Monster (left) and current Epik CEO Brian Royce by SPLC"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wOC8xNy9iaXRjb2luLXNwb3QtZXRmcy1oZWF0LXVwLXNiZnMtYmFpbC1yZXZva2VkLWFuZC13ZWIzLWdhbWluZy1hZG9wdGlvbi1ncm93cy1pbi1hc2lhL9IBeWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wOC8xNy9iaXRjb2luLXNwb3QtZXRmcy1oZWF0LXVwLXNiZnMtYmFpbC1yZXZva2VkLWFuZC13ZWIzLWdhbWluZy1hZG9wdGlvbi1ncm93cy1pbi1hc2lhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin spot ETFs heat up, SBF’s bail revoked and web3 gaming adoption grows in Asia - TechCrunch",
        "content": "Welcome back to Chain Reaction.\n\nTo get a roundup of TechCrunch’s biggest and most important crypto stories delivered to your inbox every Thursday at 12 p.m. PT, subscribe here.\n\nThe digital asset space is still trucking along, while there were some big headlines, the week was arguably a little less chaotic (for now). Check out what caught our attention below.\n\nThis week in web3\n\nThe latest pod\n\nFor this week’s episode, Jacquelyn talks with Eric Balchunas, senior ETF analyst at Bloomberg, alongside TechCrunch+ editor-in-chief Alex Wilhelm.\n\nBalchunas is the author of “The Institutional ETF Toolbox” and “The Bogle Effect.” He also co-hosts Bloomberg’s Trillions podcast and ETF IQ show.\n\nSpot bitcoin exchange traded funds, or ETFs, have been a hot topic in the crypto community for many years, but have recently gotten more attention due to Jacobi Asset Management listing Europe’s first bitcoin spot ETF almost two years after its initial approval. Meanwhile, the U.S. Securities and Exchange Commission recently delayed deadlines for bitcoin spot ETF applications.\n\nWe dive into what’s going on with the bitcoin spot ETFs in the U.S., why it matters and the odds of the SEC approving one in the near future. We also talk about Europe’s first bitcoin spot ETF, how these investment vehicles in general could impact crypto exchanges’ trading volumes and what else is in store for them.\n\nSubscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to keep up with the latest episodes, and please leave us a review if you like what you hear!\n\nFollow the money\n\nBitGo raised $100 million in its Series C round at $1.75 billion valuation Chain-agnostic platform ZetaChain raised $27 million to improve cross-chain interoperability Web3 virtual world platform ZTX raised $13 million in round led by Jump Crypto Decentralized stock trading platform Dinari raised $7.5 million in a seed round Advertisement-focused web3 startup HypeLab raised $4 million\n\nThis list was compiled with information from Messari as well as TechCrunch’s own reporting.\n\nWhat else we’re writing\n\nWant to branch out from the world of web3? Here are some articles on TechCrunch that caught our attention this week.\n\nFollow me on Twitter @Jacqmelinek for breaking crypto news, memes and more."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwODE3ODQwMDgxL2VuL1VTLUJpdGNvaW4tQ29ycC1Bbm5vdW5jZXMtSnVseS0yMDIzLVByb2R1Y3Rpb24tYW5kLU9wZXJhdGlvbnMtVXBkYXRlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "US Bitcoin Corp Announces July 2023 Production and Operations Updates - Business Wire",
        "content": "MIAMI--(BUSINESS WIRE)--U.S. Data Mining Group, Inc. dba US Bitcoin Corp (“USBTC” or “the Company”), a leading operator of large-scale data centers for new-age workloads such as digital asset mining, today shared production and operations updates for July 2023. The Company generates revenue from self-mining, hosting, and property management services. Below are certain key production and operational metrics for July 2023, including illustrative data if the Celsius Transaction had been completed on July 1, 2023.\n\nOperational Metrics1 Month-End Miners Under Management 189,349 Month-End Hashrate Under Management 18.99 EH/s Estimated Pro Forma Operational Metrics Assuming Consummation of the Celsius Transaction2 Miners Under Management 311,349 Hashrate Under Management 31.19 EH/s\n\nSelf-Mining Metrics3 Month-End Miners Installed 48,255 Month-End Hashrate Installed 4.9 EH/s\n\nEnergy Metrics Month-End Megawatts Under Management1 730 MW Energy Volume Supplied for Grid Relief and Ancillary Services4 33,580 MWh Energy Sold From Echo Wind Farm into ERCOT 3,071 MWh\n\nCommentary\n\n“ USBTC reached a major milestone this month in its pursuit of building a resilient, diversified revenue base,” said Asher Genoot, President of USBTC. “As we continue to scale, self-mining no longer represents the primary driver of the company’s revenue stream. Hosting and property management revenues have grown significantly, creating strong revenue visibility and downside protection. At the same time, we continue to maintain significant upside potential should bitcoin run by optimizing our self-mining operations and building profit share structures into our hosting and property management agreements. In July, self-mining contributed 286 bitcoins to our portfolio.”\n\nCelsius Mining Operations\n\nOn May 25, 2023, the Company, as part of the Fahrenheit LLC coalition, won a bankruptcy auction to manage and operate the assets owned by Celsius Network LLC (“Celsius”), which includes a lending portfolio, digital assets, and approximately 122,000 mining machines, subject to the approval of the bankruptcy court. In addition, the Company, acting separately through its USMIO business, won the right to enter into one or more operating and services agreements with the restructured company, which is also subject to the approval of the bankruptcy court.\n\nThe Company previously announced that it secured hosting agreements for approximately 150,000 bitcoin miners. These companies include Teslawatt, Marathon Digital, Foundry USA, Sphere 3D, and Decimal Group. In aggregate, the Company expects to manage a fleet of more than 310,000 bitcoin miners across Celsius and hosted assets.\n\nMerger with Hut 8\n\nOn February 7, 2023, the Company announced an all-stock merger of equals (the “Transaction”) with Hut 8 Mining Corp. (Nasdaq, TSX: HUT), one of North America’s largest, innovation-focused digital asset mining pioneers and high performance computing infrastructure providers. The combined company will be named “Hut 8 Corp.” (“New Hut”) and will be a U.S.-domiciled entity. The Transaction is expected to establish New Hut as a large-scale, publicly traded Bitcoin miner focused on economical mining, highly diversified revenue streams, and industry leading environmental, social, and governance (ESG) practices.\n\nAbout US Bitcoin Corp\n\nFounded by a team of visionary entrepreneurs and experienced executives, USBTC is an efficient, eco-friendly, and large-scale North American mining company. Through cutting-edge technology and a relentless commitment to operational excellence, USBTC seeks to set the standard for what is possible in its industry.\n\nWith campuses in New York, Nebraska, and Texas, USBTC aims to monetize electrons at scale, operating hundreds of megawatts of Bitcoin mining infrastructure both independently and on behalf of clients. USBTC prides itself on deploying next-generation software and hardware innovations to deliver results across its self-mining, hosting, and site management verticals. To learn more, visit https://usbitcoin.com/ or contact Matt Prusak at info@usbitcoin.com\n\nCautionary note regarding Forward–Looking Information\n\nThis press release includes “forward-looking information” and “forward-looking statements” within the meaning of Canadian securities laws and United States securities laws, respectively (collectively, “forward looking information”). All information, other USBTC or Hut 8 Mining Corp. (“Hut 8”) expects or anticipates will or may occur in the future, including such things as future business strategy, competitive strengths, goals, expansion and growth of each company’s businesses, operations, plans and other such matters is forward-looking information. Forward looking information is often identified by the words “may”, “would”, “could”, “should”, “will”, “intend”, “plan”, “anticipate”, “allow”, “believe”, “estimate”, “expect”, “predict”, “can”, “might”, “potential”, “predict”, “is designed to”, “likely” or similar expressions. In addition, any statements in this communication that refer to expectations, projections or other characterizations of future events or circumstances contain forward-looking information and include, among others, statements with respect to: (i) the expected outcomes of the transaction, including New Hut’s assets and financial position; (ii) the ability of Hut 8 and USBTC to complete the transaction on the terms described herein, or at all, including, receipt of required regulatory approvals, shareholder approvals, court approvals, stock exchange approvals and satisfaction of other closing customary conditions; (iii) expectations related to the Celsius transaction, including the closing thereof and any required legal approvals and the expected impact on our business and miners and hashrate under management (iv) the expected synergies related to the transaction in respect of strategy, operations and other matters; (v) projections related to expansion; (vi) expectations related to New Hut’s hashrate and self-mining capacity; (vii) acceleration of ESG efforts and commitments; and (viii) the ability of New Hut to execute on future opportunities, among others.\n\nStatements containing forward-looking information are not historical facts, but instead represent management’s expectations, estimates and projections regarding future events based on certain material factors and assumptions at the time the statement was made. While considered reasonable by USBTC and Hut 8 as of the date of this communication, such statements are subject to known and unknown risks, uncertainties, assumptions and other factors that may cause the actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information, including but not limited to: the ability to obtain requisite shareholder approvals and the satisfaction of other conditions to the consummation of the transaction on the proposed terms or at all; the ability to obtain necessary stock exchange, regulatory, governmental or other approvals in the time assumed or at all; the anticipated timeline for the completion of the transaction; the ability to realize the anticipated benefits of the transaction or implementing the business plan for New Hut, including as a result of a delay in completing the transaction or difficulty in integrating the businesses of the companies involved (including the retention of key employees); the ability to realize synergies and cost savings at the times, and to the extent, anticipated; the potential impact on mining activities; the potential impact of the announcement or consummation of the transaction on relationships, including with regulatory bodies, employees, suppliers, customers, competitors and other key stakeholders; security and cybersecurity threats and hacks; malicious actors or botnet obtaining control of processing power on the Bitcoin network; further development and acceptance of the Bitcoin network; changes to Bitcoin mining difficulty; loss or destruction of private keys; increases in fees for recording transactions in the Blockchain; internet and power disruptions; geopolitical events; uncertainty in the development of cryptographic and algorithmic protocols; uncertainty about the acceptance or widespread use of digital assets; failure to anticipate technology innovations; climate change; currency risk; lending risk and recovery of potential losses; litigation risk; business integration risk; changes in market demand; changes in network and infrastructure; system interruption; changes in leasing arrangements; failure to achieve intended benefits of power purchase agreements; potential for interrupted delivery, or suspension of the delivery, of energy to New Hut’s mining sites; failure of the Celsius transaction to receive the necessary legal approvals or failure of the Celsius transaction to otherwise close; and failure to achieve the intended benefits of the Celsius Transaction and expected impact on USBTC’s business and miners and hashrate under management."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10dW1ibGVzLWJlbG93LTI2NTAwLXhycC1saXRlY29pbi1jcmFzaC11cC10by0xNi9hcnRpY2xlc2hvdy8xMDI4MjgzNjQuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXR1bWJsZXMtYmVsb3ctMjY1MDAteHJwLWxpdGVjb2luLWNyYXNoLXVwLXRvLTE2L2FtcF9hcnRpY2xlc2hvdy8xMDI4MjgzNjQuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tumbles to 2-month low, slips below $26,500; XRP, Litecoin crash up to 16% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading in the deep red in Friday's trade as FOMC expressed concerns about inflation and the need to increase interest rates, and concerns around China’s economy.Bitcoin dropped nearly 8% to slip below $26,500, its two-month low. Its largest peer, Ethereum, declined 7% to $1,680. Other top crypto tokens, BNB (6.4%), XRP (16.3%), Dogecoin (9.3%), Solana (6%), Shiba Inu (12%),Polygon (7.7%) and Litecoin (14.4%) were also trading lower on Friday.Meanwhile, the global cryptocurrency market cap plunged 7.25% to around $1.05 trillion.Bitcoin (BTC) and Ethereum (ETH) both neared a two-month low, with market participants closely monitoring their movements in response to the recent release of the Federal Open Market Committee (FOMC) minutes. Bearish sentiment increased following the latest FOMC minutes, where the Federal Reserve hinted at further rate hikes, said CoinDCX Research Team.The market cap of Bitcoin, the world's largest cryptocurrency, declined to $514 billion. Bitcoin's dominance is currently 48.57%, according to CoinMarketCap. BTC volume in the last 24 hours shot up 97.36% to $32.96 billion.\"The crypto market has continued to sharply fall for the second consecutive day. The mass sell-off in the crypto market has led to a plunge in the crypto fear and greed index, which is down 13 points and has entered the fear zone after over 5 months, with a score of 37/100,\" Parth Chaturvedi, Investments Lead at CoinSwitch Venture, said.\"According to market data, investors have registered $1 billion in losses in liquidations in the last 24 hours. BTC is trading around $26.5k after it broke below its critical support level of $28k, its lowest since June. XRP led the losers after a US judge granted approval to the SEC to file a motion to appeal the recent ruling which favored Ripple Labs regarding retail sales of XRP,\" he said.Parth further added, there has been a potential devaluation of the Chinese Yuan, which is trading at the weakest level since 2007. Historically, when China devalued the Yuan last time in August 2015, BTC prices witnessed a plunge.Tech view by Sathvik Vishwanath, Co-Founder & CEO, UnocoinBTC is hovering around $26,400. Bitcoin's recent drop below $27,000 indicates a bearish move with the potential for further declines to $26,000. A break at $26,000 could lead to a deeper decline towards $24,840. Conversely, a positive rally above $30,000 could push the price of Bitcoin to $31,700.Payments giant PayPal will stop allowing UK customers to buy cryptocurrencies through its platform from October as it works to comply with new rules on crypto promotions.Britain's financial regulator is due to bring in tougher rules to limit how crypto is advertised to British consumers, including requiring crypto firms to carry warnings about the risk and scrapping \"refer a friend\" bonuses.PayPal will \"temporarily pause\" the ability for customers to buy crypto on its platform from Oct. 1 as it works to satisfy the new regulations, which come into effect on Oct. 8, it said in an email to customers on Tuesday. It said it expects to re-start in \"early 2024\"."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDgvMTcvYml0Y29pbi1jcnlwdG8taW52ZXN0b3JzLWxvd2VzdC12b2xhdGlsaXR5LXNpbmNlLTIwMTYv0gFgaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wOC8xNy9iaXRjb2luLWNyeXB0by1pbnZlc3RvcnMtbG93ZXN0LXZvbGF0aWxpdHktc2luY2UtMjAxNi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Are investors bored of Bitcoin? Its 90-day volatility is now the lowest since 2016 - Fortune",
        "content": "Crypto is known for volatile swings—turning a $1000 investment into double or triple that in a day if not hours—and for many investors that was the appeal.\n\nBut since June—some could argue since March—top dog Bitcoin has been kind of a bore. The cryptocurrency, which makes up just under half of the overall market, has been stalled around the $30,000 mark for months. On Thursday, at time of publication, the coin had dropped about 2.5% over 24 hours, settling near $28,400.\n\nThe most popular cryptocurrency’s 90-day volatility is at its lowest since 2016, Bloomberg reported, and with no end in sight to the stability, investors are getting tired of it, according to a report by blockchain data company Glassnode.\n\n“With this low volatility comes apathy and exhaustion, which often entails a relatively weak influx of demand,” Glassnode wrote.\n\nHistorically, crypto could generate double-digit returns in the short term, but recently staid TradFi markets have outpaced the top digital currency. From June 20, when Bitcoin became range-bound around $30,000, it has returned 0.3%, meanwhile the S&P 500 has increased 0.6%. (Over the same period, Ether, the second-most-popular cryptocurrency, is down 0.5%.) Elsewhere, global government bond yields are at their highest in 15 years, according to Bloomberg.\n\nBut while active traders may be looking elsewhere for alpha—the supply of Bitcoin held by short-term investors is at a multiyear low—some long-term investors are still snapping it up, which could be a positive, according to the Glassnode report.\n\n“This suggests that conviction of Bitcoin investors does remain impressively high, and very few are willing to liquidate their holdings,” the report read.\n\nA “fresh cycle” for crypto could be fueled, among other things, by new stablecoin supply, according to analysts at Bernstein, led by the managing director and senior analyst of its global digital assets division, Gautam Chhugani.\n\nIn a Monday report, the analysts wrote that Bernstein expects $2.8 trillion of new stablecoins to be allocated toward digital assets over the next five years as the market becomes more regulated. The overall market cap of stablecoins is currently $124 billion, which is about 10.5% of the total crypto market cap, according to CoinGecko.\n\nThe report singles out PayPal’s newly launched stablecoin as evidence that cryptocurrencies have room to grow, including as a tool for cross-border remittances, potentially adding immense value for corporations worldwide. That is, if Congress gives the coins a boost with new legislation, the analysts added.\n\n“The new proposed stablecoin act is being progressed relatively fast, and in the midst of a global digital currency race, this will become a national priority in the U.S to extend the dollar’s dominance in the digital economy,” the report read.\n\nAnother possible boon for crypto is the impending decision on Grayscale’s lawsuit against the Securities and Exchange Commission over whether it should be allowed to create a spot Bitcoin ETF. Any judgment in favor of Grayscale has the potential to supercharge crypto prices, as it would open a new avenue for investors to put money into the world’s most popular cryptocurrency.\n\nFor its part, Grayscale appears optimistic. On Thursday, the company tweeted out a link to an open position in its ETF department."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmxlZGdlci5jb20vc3RhY2tzLXN0eC1qb2lucy1sZWRnZXItbGl2ZS10by11bmxvY2stbmV3LWJpdGNvaW4tY2FwYWJpbGl0aWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Stacks (STX) Joins Ledger Live: Unlock Bitcoin Capabilities Securely - Ledger",
        "content": "\n\nThings to know:\n\n\n\n– You can now create a Stacks (STX) account in Ledger Live Desktop and Mobile and send and receive your STX from this account, with your private keys securely stored in your Ledger device.\n\n\n\n– Stacks is a popular layer-2 layer that aims to enhance the Bitcoin blockchain by facilitating DApps and smart contracts on the Bitcoin protocol.\n\n\n\n– Everyone is welcome to build on Ledger Live, bring their coins and make them accessible to Ledger communities. You’ll find all the resources you need here if you’re a developer.\n\n\n\n\n\nStacks (STX) is an open-source protocol that aims to unlock the potential of the Bitcoin blockchain by bringing smart contracts and DApps to the Bitcoin ecosystem. Stacks works with ‘Proof of Transfer,’ a consensus mechanism that spans both chains, enabling Stacks to leverage Bitcoin’s security and Stacks apps to use Bitcoin’s state.\n\nAccording to the protocol’s website: “Stacks extends Bitcoin with new functionality. Bitcoin is Stacks’ secure and robust base layer where all transactions are settled, and Stacks adds complex apps and smart contracts.” While this goal might be similar to that of Bitcoin sidechains, drivechains, or second-layer solutions, Stacks has its own nodes, network, miners, and coin.\n\nSTX, Stacks’ native token, is the cryptocurrency of the Stacks network, used to fuel smart contracts for Bitcoin, reward miners on the open Stacks network, and enable holders to earn bitcoin by stacking. Contrary to different Bitcoin sidechains, STX is not pegged to on-chain BTC.\n\nManage & secure your STX coins through your Ledger Live app\n\nThe Stacks app is already available on your Ledger Nano S Plus & Nano X, which means you can secure your STX coins with your hardware device. In addition, managing your STX tokens through Ledger Live is easy:\n\nOpen your Ledger Live app. Navigate into the accounts tab in Ledger Live and create a Stacks account. Verify and confirm the address to deposit your tokens.\n\nIt’s as simple as that. Your STX coins are yours, tightly secured in your hardware wallet. Learn more on how to send and receive your STX tokens with our Help Center article.\n\nExplore the Internet of Value securely with Ledger\n\nLedger Live, with over 1.5 million active users, allows you to buy, sell, swap, stake, and lend your digital assets and explore the Internet of Value with ownership and security. With the Ledger Live app, you can also access an ever-expanding list of dApps in the Discover section, with your private keys automatically safeguarded on your Ledger device.\n\nIf you don’t have a Ledger device yet, check this article out to see which Ledger device suits your needs, or view our comparison page for a side-by-side comparison. You can also stay updated on our latest announcements and thought leadership publications through our blog."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzE4L2JpdGNvaW4tcGVycGV0dWFsLWZ1bmRpbmctcmF0ZXMtY3Jhc2gtYXMtcHJpY2Utc2xpZGUtcHV0cy1zaG9ydC12b2xhdGlsaXR5LWJldHMtYXQtcmlzay_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8xOC9iaXRjb2luLXBlcnBldHVhbC1mdW5kaW5nLXJhdGVzLWNyYXNoLWFzLXByaWNlLXNsaWRlLXB1dHMtc2hvcnQtdm9sYXRpbGl0eS1iZXRzLWF0LXJpc2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Perpetual Funding Rates Crash as Price Slide Puts Short Volatility Bets at Risk - CoinDesk",
        "content": "\"Previously, Deribit only auto-liquidated options positions using perpetual/futures when possible, which was a form of Delta hedging as the first step to manage risk. Since early August, directly closing options positions has been a part of the liquidation algorithm as well. That logic has been changed to liquidate with whichever instrument is causing the issue and, therefore, more effective,\" Strijers told CoinDesk."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXRoZXItZGlzY29udGludWVzLWJpdGNvaW4tc3RhYmxlY29pbi1jaXRpbmctbGFjay1vZi11c2FnZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Tether discontinues Bitcoin stablecoin, citing lack of usage - Cointelegraph",
        "content": "The issuer of stablecoin Tether will discontinue its Bitcoin Omni Layer version, citing a lack of interest from users. This Bitcoin version of Tether (USDT) was one of the first stablecoins ever created. The Bitcoin Cash (BCH) and Kusama (KSM) versions will also be discontinued, according to an Aug. 17 announcement from the team.\n\nToday #Tether announces the ending of the support of 3 blockchains $USDt: OmniLayer, BCH-SLP and Kusama.\n\nCustomers will be able to continue to redeem and swap $USDt tokens (to another of the many supported blockchains), but Tether won't issue any new additional $USDt on those 3… https://t.co/aghLgqtSuO — Paolo Ardoino (@paoloardoino) August 17, 2023\n\nAccording to the announcement, no new Tether tokens will be issued on the Bitcoin Omni Layer, Kusama or Bitcoin Cash going forward. Redemptions will remain available for at least a year, and the company will issue further announcements before the year passes as to how it will handle redemptions after that point.\n\nThe Bitcoin Omni Layer is a smart contract system built on top of the Bitcoin (BTC) blockchain. Originally called “Mastercoin,” it was released in July 2013, a full two years before Ethereum. Omni Layer Tether became the first stablecoin to be released on the system in October 2014. It quickly grew to be the highest market cap stablecoin, surpassing earlier stablecoins such as BitUSD and NuBits.\n\nIn its Aug. 17 announcement, Tether sought to acknowledge the important historical role that Omni Layer Tether played in crypto history, stating:\n\n“We understand the significance of this decision, particularly for Omni, as it was the first transport layer that Tether used in 2014. The Omni Layer, built on top of Bitcoin, played a crucial role in Tether’s early journey, and we acknowledge the contributions and innovations the team has made to the crypto landscape.”\n\nRelated: PayPal’s stablecoin opens door for crypto adoption in traditional finance\n\nHowever, the team stated that the Omni Layer “faced challenges due to the lack of popular tokens and the availability of USDT on other blockchains.” This led exchanges to use other transport layers instead of Omni, which in turn led to a decline in USDT Omni usage and forced the company to end its issuance.\n\nTether claimed that it would consider reissuing the Omni Layer version if usage of Omni picks up. The company also stated that it is working on a new Bitcoin smart contract system called “RGB” and that it plans to reissue Tether in an RGB version once it is completed, bringing Tether back to the Bitcoin blockchain.\n\nCompetition between stablecoins has been heating up in 2023, challenging Tether’s dominance. PayPal released its PayPal USD (PYUSD) on Aug. 7, and Binance listed First Digital USD (FDUSD) on July 26."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvZmVkLXJhdGUtaGlrZXMtYml0Y29pbi1ldGhlcmV1bS1zbGlwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Fed July Records Hint At More Rate Hikes While Bitcoin and Ethereum Slip: Is There Direct Correlation - CCN.com",
        "content": "Key Takeaways\n\nFed minutes release for July\n\nCrypto market slipped by 3%, could it be based on hints of Fed hike?\n\nFurther rate hikes of 0.25% are likely\n\nThe minutes from the Federal Reserve’s two-day July meeting came out yesterday, August 16 . They underscore the central bank’s growing concerns about persistent inflation. Despite a recent quarter percentage point rate hike, which brought the federal funds rate to its highest level in over 22 years, the inflation battle is seen as ongoing by most FOMC members.\n\nThe minutes reveal significant worries about inflation staying above the Committee’s desired range, with tight labor market conditions further complicating the outlook.\n\nAlthough some members expressed doubt about the necessity of additional hikes, the consensus leans towards caution, emphasizing the importance of a restrictive monetary policy to steer inflation back to the 2% target.\n\nWhile the future direction remains uncertain, with indications that inflation pressures might be easing, the minutes highlight a collective sentiment of vigilance, suggesting a heightened likelihood that the Federal Reserve might raise interest rates again in the near future if current conditions persist.\n\nBitcoin and Ethereum Slip\n\nMeanwhile, Bitcoin and Ethereum have slipped from their sideways range in a single percentage decrease of around 3%. Has there been a correlation between the negative sentiment toward the future economic outlook with this decrease in the cryptocurrency market?\n\nThe Fed minutes were released on the official website at 2:00 p.m. EDT yesterday.\n\nAlthough the news outlets started reporting soon after due to writing and publishing, the news lagged a bit behind until it caught on. Nevertheless, BTC and ETH prices have already been in a slight downtrend, which only propelled it further.\n\nAt the exact time of the Fed minutes release, the price of BTC and ETH started falling with higher momentum and picked up the pace overnight. The price of Bitcoin was trading at $29,195 and fell to $28,300 at its daily low. Ethereum fell from $1827 to its daily low of $1,777, which is a decrease of 2.69%.\n\nAs seen on the chart above, there is a direct correlation between this news release and the price decline. This is because all markets are currently sensitive to the overall economic sentiment, and crypto is still viewed as the riskiest asset class in particular.\n\nFed Meeting in September\n\nThe next Federal Open Market Committee (FOMC) meeting will be held on September 19 – 20, 2023. The consensus among financial analysts and other experts on the matter is mixed.\n\nSome expect that the monetary policy-making body of the Federal Reserve System will most likely make another interest rate hike by another 25-basis-point to moderate inflation to the targeted 2%.\n\nOthers say that it might pause for now as it did in June and evaluate the situation as it fears the economy will get too tight and limit consumer spending.\n\nConclusion\n\nFederal Reserve is the most important entity in the global economy since its decisions can impact the value of the US dollar, which is still the global reserve currency. This is why investors and traders all across the world are following their announcements.\n\nWhat the Fed does next still remains unclear, but considering that it only made a small blow to inflation and definitely not a win, further action will be required, thus we would be primarily expecting an increase in interest rates.\n\nWith the cryptocurrency market standing on shaky legs since April, this might be a catalyst for a larger decline.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMTgvYml0Y29pbi1pcy1naXZpbmctYS1iZWFyaXNoLXNpZ25hbC1oZXJlcy13aGF0LWNoYXJ0LWFuYWx5c3RzLXNheS1oYXBwZW5zLW5leHQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin is giving a bearish signal. Here's what chart analysts say happens next - CNBC",
        "content": "Bitcoin tumbled to finish the week after many weeks of stillness in the market, and chart analysts say it's possible this could be just the beginning. The cryptocurrency breached the $26,000 level on Friday, hitting a two-month low and dipping to $25,533.70 at one point. The big drop, which began Thursday evening, appeared to be set off by speculation around Elon Musk's SpaceX writing down the value of and selling its bitcoin. However, the virtual currency was already under pressure from rising rates and a stronger dollar – and chart analysts it could have further to fall still. Bitcoin also broke its 200-day moving average of $27,300, which could signal an impending downtrend. \"Unfortunately, the setup for bitcoin still looks pretty ominous to me,\" as do most risk assets, Wolfe Research's technical analyst Rob Ginsberg told CNBC. \"You never know what the impetus will be, but as we discussed in our note earlier this week , deteriorating trend and momentum were both suggesting a significant break lower for bitcoin.\" BTC.CM= 5D mountain Bitcoin lost as much as 9% Thursday night and continued falling Friday. \"Now oversold, with key support in the $24,750 to $25,000 area, we're close to finding some relief. [We] might need one more flush first,\" he added. \"Looking out, following a dead cat bounce, I wouldn't be surprised if it tested $20,000 before year end.\" A range emerges between $25,000 and $30,000 Bitcoin has been here before. The $25,000 level was a key resistance threshold from last summer through March of this year after bitcoin briefly touched $30,000 in its banking crisis-fueled rally. That $25,000 threshold was in focus again in June and July as bitcoin made another attempt to sustain $30,000 — this time it was fueled by speculation around the BlackRock bitcoin ETF filing. All this price action is now establishing a clear trading range between $25,000 and $30,000, said Julius de Kempenaer, a technical analyst at StockCharts.com. \"These levels are fairly rough as bitcoin tends to over or undershoot easily by $1,000 or more, but the range on the chart is clear,\" he said. \"This also means that we can get fairly reliable follow up signals when bitcoin leaves this range.\" Should bitcoin extend its losses, de Kempenaer said to watch its March 2023 low of $19,500 as the next target. If it rises, however, the March 2022 high of $48,000 is within the realm of possibility. \"With the upper and lower boundary getting more and more defined, the most likely scenario in the near term is for BTC to keep bouncing between 25k and 30k,\" he said. Ari Wald, head of technical analysis at Oppenheimer, said similarly that the drop is \"indicative of a trend changing from an uptrend to a sideways range.\" He's looking at $24,770 as his next support level to watch. His upside target is the 200-day moving average of $27,300. Fairlead Strategies' Katie Stockton puts the next downside target a little higher at $25,200, with a secondary target level of $20,600. \"Our short- and intermediate-term gauges point lower, whereas long-term indicators remain improved (but, not positive),\" Stockton said. \"The setup supports a breach of $25,200, which would further increase downside risk for bitcoin.\""
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9iaXRjb2luLWJ0Yy1hLTE1MGstdW5lLXNldWxlLWNvbmRpdGlvbi1hLXJlbXBsaXItMi0yLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) at $150,000: Only one condition to meet! - Cointribune EN",
        "content": "Fri 18 Aug 2023 ▪ 3 min of reading ▪ by Fitah\n\nFundstrat co-founder Tom Lee has predicted that the price of Bitcoin (BTC) could explode to $150k under certain conditions. If the U.S. SEC approves Bitcoin ETFs, the parent cryptocurrency could see its price cross the $150k mark. Among other key factors favoring this trend, he also states the interaction of cryptos with the general monetary climate.\n\nApproval of Bitcoin ETFs (BTC): the main catalyst\n\nTom Lee, co-founder of Fundstrat, set out a potential direction for the bitcoin price on CNBC’s “Squawk Box”. He stated that Bitcoin could break the $150k barrier, explaining the key factors that could guide this trajectory. The most notable factor is the possibility of the U.S. SEC approving Bitcoin ETFs. According to Tom Lee, such a decision could tip the balance in favor of Bitcoin reaching $150k to $180k.\n\nThis potential trajectory depends, however, on SEC approval. Indeed, while Bitcoin ETFs have found their place internationally, this is not yet the case in the USA. US SEC approval is thus a cornerstone for the crypto industry. Some believe that only a Republican victory in the 2024 presidential election could lead to the approval of the Bitcoin ETF (BTC).\n\nFundstrat co-founder Tom Lee predicted that if the US SEC approves the spot bitcoin ETF, it may push the price of bitcoin to break through $150,000, or even close to $180,000. One view is that a Republican victory in the 2024 presidential election would lead to ETF approval.… — Wu Blockchain (@WuBlockchain) August 17, 2023\n\nThe undeniable interaction between crypto and inflation\n\nTom Lee also highlighted the interaction between cryptos and the general monetary climate. Indeed, stabilizing inflation rates could lead to an easing of financial conditions. This would encourage central banks to loosen their grip, creating a favorable environment for cryptos, particularly bitcoin (BTC).\n\nThe Fundstrat co-founder added that current core inflation of 0.16% is anchored by robust real estate figures. However, he expects inflation to soften and fall below 2% by the middle of next year. In an environment favorable to cryptos, Bitcoin (BTC) could finally take off after its consolidation at the $30k level.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTE4L3doYXQtcy1uZXh0LWZvci1iaXRjb2luLXByaWNlcy1jcnlwdG8tbWFya2V0LWFmdGVyLXNlbGxvZmYtYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "What’s Next for Bitcoin Prices, Crypto Market After Selloff? (BTC) - Bloomberg",
        "content": "Bitcoin has had a sleepy summer. This week, it was shaken awake.\n\nFor the past several months, the hallmark volatility that previously attracted hordes of investors to the world’s largest cryptocurrency has been absent, with the rate of its swings reaching its lowest point since 2016."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xNTI3NjcvYml0Y29pbi1ldGhlcmV1bS1kaXAtYWZ0ZXItZmVkLWhpbnRzLW1vcmUtcmF0ZS1oaWtlc9IBVGh0dHBzOi8vZGVjcnlwdC5jby8xNTI3NjcvYml0Y29pbi1ldGhlcmV1bS1kaXAtYWZ0ZXItZmVkLWhpbnRzLW1vcmUtcmF0ZS1oaWtlcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Dip After Fed Hints at More Rate Hikes - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin slipped below $29,000 early Thursday alongside stocks after the U.S. Federal Reserve suggested maintaining its hawkish stance in the meeting minutes released on August 16.\n\nBitcoin dropped by 2% overnight and is now trading at $28,549.\n\nThe downturn dragged the broader crypto market down with it, as the total market capitalization dropped by 1.7% overnight, or nearly $20 billion, per CoinGecko.\n\nAD\n\nAD\n\nEthereum price is also struggling to hold on to the $1,800 support level, last trading at $1,795 after dropping 1.5% in the last 24 hours.\n\nIn the equities market, the S&P 500 index continued its downturn from Tuesday, dropping 0.76%.\n\nThe dollar index (DXY) against other major currencies gained 0.54% this week from Fed’s rate expectations, hitting a one-month high yesterday.\n\nInflation fight far from over, says Fed\n\nDuring the Fed policy rate meeting last month, it increased the benchmark interest rate to a 22-year high, bringing the interest rate to 5.25%-5.50%.\n\nMany expected that the rate hike would be one of its last after an aggressive increase from zero percent in March 2022 in its attempt to stomp out rampant inflation.\n\nAD\n\nAD\n\nThe central bank's rate hikes have been one of the most significant factors limiting the rise of risk assets such as stocks and cryptocurrencies.\n\nThe higher borrowing costs stifle growth and expansion and attract investors to safer bets like Treasury bonds. It’s also one of the key tools the Fed has in its arsenal to cool rising consumer costs.\n\nHowever, the latest meeting minutes show that the Fed’s decision-making committee “remains highly attentive to inflation risks.”\n\nThe document also stated that the job sector outlook was positive, with “robust” job gains and a low unemployment rate.\n\nThe market’s expectation of a rate hike has increased after the release of the minutes.\n\nCME’s FEDWatch tool shows that traders increased their rate hike expectations from 10% to 13.5% after the release.\n\nCME FedWatch Tool. Source: CME Group .\n\nThe press release added that the Fed might consider enacting policies “that may be appropriate to return inflation to two percent over time.”\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWV0Zi1hcHByb3ZhbC1jb3VsZC10YWtlLWJ0Yy1hcy1oaWdoLWFzLTE4MGstYW5hbHlzdC_SAVZodHRwczovL2FtYmNyeXB0by5jb20vYml0Y29pbi1ldGYtYXBwcm92YWwtY291bGQtdGFrZS1idGMtYXMtaGlnaC1hcy0xODBrLWFuYWx5c3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin ETF approval could take BTC ‘as high as $180k’: Analyst - AMBCrypto News",
        "content": "Hedge fund founder Tom Lee opined that BTC would cross its ATH shortly after the ETF approval.\n\nAnother big player in the market predicted a surge in liquidity.\n\nThe anticipation surrounding a potential Bitcoin [BTC] spot Exchange-Traded Fund (ETF) approval has been a major topic of discussion within the cryptocurrency community lately. For many investors, regulatory acceptance would impact the BTC price positively.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nHowever, a few skeptics do not believe that a go-ahead by a centralized entity would do anything great for the price action. One notable individual that has commented on the matter is Tom Lee.\n\n$150,000 or nothing\n\nLee, who has been repeatedly bullish on BTC, said he was not surprised that August has been a weak month for the coin. In his interview with CNBC, he based his opinion on BTC’s historical performance. He noted that historically, a strong July for BTC equals an unimpressive August.\n\nOn the ETF application, the founder of Fundstrat Global Advisors, a market research firm, said,\n\n“If the Bitcoin spot ETF gets approved, I think the demand would outweigh the daily supply. And the clear price could be as high as $150,000 or $180,000.”\n\nBut Lee also clarified that the spot ETF has to be approved in the U.S. for the price to hit that high. Although on 14 August, CNBC reported that the U.S. SEC has delayed the approvals of ARKInvest and 21Shares.\n\nAlso, the regulatory agency pushed the deadline to early 2024. However, AMBCrypto had a short conversation with Ruslan Lienkha on the matter.\n\nMore ETFs, more liquidity\n\nLienkha, who is the Chief Markets Officer at YouHolder, opined that the ETF approval could trigger a global adoption of crypto assets. He also mentioned that more firms would want a share of the market.\n\nFurthermore, Lienkha admitted that Jacobi’s ETF approval in Europe did not have a significant impact on BTC. But it is not enough reason to assume that approval in the U.S. would not lead to an uptrend.\n\nIn explaining this, Lienkha used the BTC regional Year-on-Year (YoY) supply as a rationale for the opinion. From the chart shared below, decisions from the U.S. and Asia have had more impact on BTC as Europe was still a neutral ground.\n\nHow much are 1,10,100 BTCs worth today?\n\nIn conclusion, Lienkha said that a Bitcoin spot ETF approval in the U.S. would bring in more liquidity for the market and encourage diversification. He said,\n\n“Basically, more ETFs will bring more liquidity to the crypto market and will stimulate market growth. Also, crypto will be better integrated into the financial system.”\n\nMeanwhile, the U.S. SEC may still approve the Bitcoin spot ETFs this year considering recent developments. Lately, Coinbase disclosed that the CTFC approved its application for a Bitcoin and Ethereum [ETH] futures ETF. Therefore, all hope may not be lost for the former."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZ2xpbmVhLmNvbS9lbmdsaXNoL2JyYXppbHMtbWVyY2Fkby1iaXRjb2luLWN1dHMtOC1vZi1zdGFmZi1zaGlmdHMtZm9jdXMtdG8taGlnaC1pbXBhY3QtYnVzaW5lc3Nlcy_SAYUBaHR0cHM6Ly93d3cuYmxvb21iZXJnbGluZWEuY29tL2VuZ2xpc2gvYnJhemlscy1tZXJjYWRvLWJpdGNvaW4tY3V0cy04LW9mLXN0YWZmLXNoaWZ0cy1mb2N1cy10by1oaWdoLWltcGFjdC1idXNpbmVzc2VzLz9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Brazil’s Mercado Bitcoin Cuts 8% of Staff, Shifts Focus to ‘High-Impact’ Businesses - Bloomberg Línea English",
        "content": "Mercado Bitcoin Cuts 8% of Staff, Plans to Focus on ‘High-Impact’ Businesses.Reinaldo Rabelo, CEO of Mercado Bitcoin, during the Web Summit Rio 2023 (Photographer: Eóin Noonan/Web Summit Rio via Sportsfile)(Sportsfile/Eóin Noonan / Web Summit Rio / Sportsfile)\n\nBrazil’s largest cryptocurrency exchange has laid off 45 people, but said it is still hiring for its development and product teams\n\nBloomberg Línea — Mercado Bitcoin, the cryptocurrency broker owned by Brazilian holding company 2TM and financed by SoftBank, laid off 45 people this week, defining the decision as a “consolidation of operations” after having received licenses and adjusted the team to focus on growing the business.\n\nVIEW + Mercado Bitcoin Plans To Expand Into Latin America Through Acquisitions Reinaldo Rabelo, CEO of Mercado Bitcoin, said the company is expected to enter Mexico, Argentina, Peru, Chile, and Colombia later this year through M&As\n\nCurrently, Mercado Bitcoin has more than 300 employees around the world, which means that the cut was equivalent to around 15% of the workforce. But the company said that the actual reduction will be smaller.\n\nQuestioned by Bloomberg Línea, Mercado Bitcoin said that the cut will be equivalent to 8% of its workforce, as the development and product team continues to hire at the same time as the company is “rebalancing priorities and some competencies”.\n\nLast year, the company laid off 190 employees.\n\nPUBLICIDAD\n\nIn June, the company received authorization from Brazil’s central bank to become a payment institution and launched the digital bank MB Pay.\n\nIn Portugal, the company received authorization to transact and manage crypto assets.\n\n“These advances occurred in the middle of the crypto winter, which shows the robustness of Mercado Bitcoin’s operations and that it accredits the ecosystem to lead the development of the tokenized economy in the country,” the company said in a note sent to Bloomberg Línea.\n\nPUBLICIDAD\n\n“As such, Mercado Bitcoin is reorganizing its operations to address these challenges and focus on high-impact business initiatives.”\n\nThe adjustment has resulted in the layoff of 45 employees and the prioritization of business growth avenues, according to the company.\n\nIn an interview with Bloomberg Línea in May, Mercado Bitcoin’s CEO Reinaldo Rabelo said that, “with the economic crisis in the innovation and venture capital market, we have made adjustments to our structure and can withstand up to three years of a less heated market,” which meant that the company would be able to wait up to three years without new fundraising."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1ydXNoLXByaWNlLWNyeXB0b2N1cnJlbmN5LWNyYXNoLWIyMzk1OTQ1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price dramatically crashes amid market worries - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nBitcoin’s price has crashed dramatically, amid what seems to be a broader worry in the financial markets.\n\nThe world’s biggest cryptocurrency has fallen more than 7 per cent over the last 24 hours, and almost 12 per cent in the last week.\n\nOther large digital currencies saw similar falls, though not as stark. Ethereum, the second biggest cryptocurrency by market cap, has lost around 10 per cent of its value in the last week.\n\nThe troubles mean that the crypto market as a whole is down 5.7 per cent over the last 24 hours, according to tracking website Coinmarketcap. Trading volumes increased sharply, too, and were up almost 80 per cent over the last 24 hours.\n\nThursday’s drop in the price of the cryptocurrency was the biggest one day fall since November 2022. That happened when large exchange FTX collapsed, sending shockwaves through the crypto markets and leading to widespread fears.\n\nThis time around, there was no obvious connection to events in the cryptocurrency market. Instead, investors seemed concern about the economy more generally, and more traditional assets were also hit by falls in recent days.\n\nWall Street’s main indexes fell on Friday, extending declines to the fourth session on a drag from megacap growth stocks, as evidence of a resilient U.S. economy fanned fears of interest rates staying higher for longer.\n\nThe three main US stock indexes are on track for sharp weekly losses as a spate of strong economic data, including a fall in weekly jobless claims, caused investors to dial back expectations of rate cuts and drove up government bond yields.\n\nThe yield on the 10-year Treasury note hit a ten-month high of 4.328 per cent in the previous session and came within a whisker of its highest level since 2007.\n\n“The drivers really have been of late the rising Treasury yields and that is signaling a more risk-off investor sentiment,” said Art Hogan, chief market strategist at B Riley Wealth.\n\n“Investors are looking at (better-than-expected economic data) and saying the Fed likely isn’t restrictive enough yet.”\n\nTraders see a nearly 91% chance of the Fed holding rates at current levels at its September meeting, according to the CME Group’s FedWatch tool.\n\nOn Friday, rate-sensitive big technology and growth stocks such as Apple, Microsoft, Tesla and Nvidia slipped between 0.7% and 2.8% even as Treasury yields took a breather.\n\nThe communication services and technology sectors housing major growth stocks fell 1.6% and 1.0% respectively.\n\nThe tech-heavy Nasdaq hit an over two-month low and is set to post the biggest weekly declines of the three major indices, down 3 per cent so far.\n\nThe CBOE volatility index hit its highest in nearly three months, reflecting rising investor anxiety.\n\nAdditional reporting by Reuters"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xNTI4MDkvYml0Y29pbi1wbHVuZ2VzLWJlbG93LTI4MDAwLWZpcnN0LXRpbWUtdHdvLW1vbnRoc9IBUWh0dHBzOi8vZGVjcnlwdC5jby8xNTI4MDkvYml0Y29pbi1wbHVuZ2VzLWJlbG93LTI4MDAwLWZpcnN0LXRpbWUtdHdvLW1vbnRocz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Plunges Below $28,000 for First Time in Two Months - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of leading cryptocurrency Bitcoin today sank below $28,000 per coin for the first time in nearly two months.\n\nThe largest cryptocurrency by market cap is trading for $27,765 as of this writing, according to CoinGecko, a 24-hour drop of more than 4%.\n\nBitcoin had soared to $31,000 in June, a run triggered by the world's biggest asset manager BlackRock filing an application to the U.S. Securities and Exchange Commission (SEC) for a spot Bitcoin exchange-traded fund (ETF).\n\nAD\n\nAD\n\nBut the price largely sat still throughout July and then today dipped sharply—with some analysts attributing the sell-off to Wall Street's biggest regulator taking its time to approve the long list of spot Bitcoin ETF applications.\n\nSell-side research firm Wolfe Research said in a report that it was likely Bitcoin's price would continue to dip before shooting higher again if regulators say yes to a Bitcoin ETF, CNBC reported Thursday.\n\nThe SEC is currently reviewing a number of high-profile Bitcoin ETF applications and analysts are betting that it's likely the regulator could say yes to one.\n\nThe rest of the market also dropped—as it usually does when there is a Bitcoin sell-off—on Thursday.\n\nEthereum, the second biggest cryptocurrency, shed 4.5% of its value in 24 hours and was trading for $1,735 by midday Eastern Time, CoinGecko data showed. Meanwhile Dogecoin, a \"meme coin\" favored by the Tesla CEO and Twitter owner Elon Musk, dropped by over 5% to $0.06.\n\nAD\n\nAD\n\nAnother meme coin, Shiba Inu, was the worst hit by the sell-off on Thursday, dropping by over 10% in a day to $0.00000859.\n\nThe token had jumped in value after its creators earlier this month announced the a Self-Sovereign Identity (SSI) protocol."
    }
]