[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vbmV3cy9iaXRjb2luLXBpenphLWRheS1jZWxlYnJhdGluZy0yMC1taWxsaW9uLXBpenphLW9yZGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Pizza Day: Celebrating the $250 Million Pizza Order - Investopedia",
        "content": "Each year, May 22 marks the anniversary of when a Florida man paid for two pizzas in the first Bitcoin transaction. The day has become legendary, less because it was the first commercial use of bitcoins, but because of Bitcoin’s worth in the following years. For the two pizzas, the man in question paid 10,000 bitcoins, which, as of Sept. 11, 2023, is worth over $250 million.\n\nOn May 22, 2010, now known as “Bitcoin Pizza Day,” Laszlo Hanyecz, the Florida man, agreed to pay 10,000 bitcoins for the delivery of two Papa John’s pizzas. On the Bitcoin Talk forum, Hanyecz reached out for help. “I’ll pay 10,000 bitcoins for a couple of pizzas … like maybe 2 large ones so I have some left over for the next day,” Hanyecz wrote.\n\n“I like having left over pizza to nibble on later. You can make the pizza yourself and bring it to my house or order it for me from a delivery place, but what I’m aiming for is getting food delivered in exchange for bitcoins where I don’t have to order or prepare it myself, kind of like ordering a ‘breakfast platter’ at a hotel or something, they just bring you something to eat and you’re happy!”\n\nA British man took up Hanyecz’s offer and bought the two pizzas for him in exchange for 10,000 bitcoins. Even then, the recipient of the bitcoins got a bargain, paying $25 for the pizzas, while 10,000 bitcoins were then worth around $41.\n\nSince that purchase, Hanyeczs’ pizzas have become far more costly. Nine months after the purchase, Bitcoin reached parity with the U.S. dollar, making the two pizzas worth $10,000. In 2015, the fifth anniversary of Bitcoin Pizza Day, the two pizzas were valued at $2.4 million. On May 22, 2023, Bitcoin was at just over $26,850, making the pizzas worth … you get the point.\n\nDespite the massive rise in the price of Bitcoin, Hanyecz says he is not phased about his deal. “It wasn’t like bitcoins had any value back then, so the idea of trading them for a pizza was incredibly cool,” Hanyecz has said.\n\nWhat Was Bitcoin's Highest Price? As of September 2023, Bitcoin reached its all-time peak in November 2021, exceeding $65,000 per bitcoin.\n\nWhat Type of Transaction Is Bitcoin Mostly Used for? Bitcoin is primarily used for digital transactions. This includes ecommerce purchases, peer-to-peer transfers, and cross-border payments. Moreover, it's used for international transactions and, increasingly, for banking by those who don't have access to traditional financial institutions. Among these transactions, though, are those linked with illicit activities, such as darknet trades.\n\nWhat Is the Average Number of Bitcoin Transactions Daily? As of 2023, there are an average of almost 500,000 Bitcoin transactions within the blockchain per day, a significant increase from previous years. This surge reflects the growing adoption and use of Bitcoin for digital transactions across the globe.\n\nThe Bottom Line\n\nBitcoin's value has gone up significantly since the first Bitcoin Pizza Day, illustrating the cryptocurrency's impressive growth since its early days, when its worth was fungible for not more than a couple of pizzas. The rise in Bitcoin's value is a testament to its increasing acceptance and use in digital transactions worldwide. However, Bitcoin has been highly volatile. Its price can fluctuate rapidly, potentially leading to momentous gains and significant losses. Thus, while the growth trajectory of Bitcoin attracts investors, caution and informed decision-making are paramount when investing in this cryptocurrency because of its elevated risk."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOS0yNy9iaXRjb2luLWJ0Yy1yZWZ1Z2UtYXBwZWFsLWlzLWJlaW5nLXRvdXRlZC1hZ2Fpbi1hcy11cy1zaHV0ZG93bi1wcm9zcGVjdHMtcmlzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Appeal Touted Again as US Government Shutdown Prospects Increase - Bloomberg",
        "content": "The increasing prospects of a US federal government shutdown has some Bitcoin advocates predicting a rally similar to one that happened in response to the regional bank crisis earlier this year.\n\n“We actually saw Bitcoin rally as a sort of safety-hedge against further banking unrest,” said Stephane Ouellette , co-founder and CEO of FRNT Financial. “It will be very interesting to see if the market going to buy Bitcoin during all different types of periods of US-economic/financial uncertainty or just in a banking crisis context as we saw earlier in the year.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjgvdHJhZGVyLXNheXMtYml0Y29pbi1hbmQtY3J5cHRvLW1hcmtldHMtbmVlZC1jaGFvcy1mb3ItcHJpY2UtZ3Jvd3RoL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjgvdHJhZGVyLXNheXMtYml0Y29pbi1hbmQtY3J5cHRvLW1hcmtldHMtbmVlZC1jaGFvcy1mb3ItcHJpY2UtZ3Jvd3RoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Trader Says Bitcoin and Crypto Markets Need ‘Chaos’ for Price Growth - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDkvMjgvY29pbmJhc2UtYmVybXVkYS1iaXRjb2luLWV0aGVyZXVtLXBlcnBldHVhbC1mdXR1cmVzLXJldGFpbC10cmFkZXJzLWN1c3RvbWVycy_SAXdodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA5LzI4L2NvaW5iYXNlLWJlcm11ZGEtYml0Y29pbi1ldGhlcmV1bS1wZXJwZXR1YWwtZnV0dXJlcy1yZXRhaWwtdHJhZGVycy1jdXN0b21lcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Coinbase to let retail users outside the U.S. trade Bitcoin and Ethereum futures on its Bermuda exchange - Fortune",
        "content": "The largest crypto exchange in the United States announced on Thursday that Bermuda’s financial regulator has given it the green light to let retail traders outside the U.S. buy and sell perpetual futures.\n\nAs of Thursday, small-time investors, as opposed to only deep-pocketed institutional traders, will be able to apply to trade the risky financial products, which allow investors to speculate on the future price of an asset. Trading will begin in the coming weeks, Coinbase said in a blog post announcing the Bermuda news.\n\n“We chose to build our business and become a public company in the U.S. believing that the U.S. should be at the forefront of efforts to update our financial system,” wrote the exchange.\n\nCoinbase’s move to open up its international exchange to small investors is the latest in the company’s ongoing efforts to expand its footprint beyond the U.S. where it has faced growing regulatory scrutiny.\n\nFollowing the collapse of competing exchange FTX and the arrest of its now-disgraced CEO Sam Bankman-Fried, the Securities and Exchange Commission soon cracked down on a slew of high-profile crypto companies and founders, including Genesis, Gemini, Justin Sun, the crypto celebrity behind TRON, and Do Kwon, creator of the so-called stablecoin TerraUSD.\n\nIn March, Coinbase, which has long styled itself as the white knight of the crypto industry, revealed that it has also become the target of impending SEC litigation after it received a so-called Wells Notice, which informs companies that they are the targets of soon-to-be litigation.\n\nShortly after, the U.S.-based exchange, headed by CEO Brian Armstrong, announced that it had received regulatory approval in Bermuda to operate an offshore exchange, and in May, the publicly traded company unveiled Coinbase International Exchange for the use of institutional investors.\n\nThe SEC eventually filed an outright lawsuit against Coinbase in June, but that hasn’t stopped billions of dollars of crypto from flowing through both its domestic and offshore entities. Its Bermuda outpost has seen $5.5 billion in trading volume—strictly from institutional investors—as of the second quarter of 2023. (By comparison, Coinbase reported $92 billion in total trading volume in the same period.)"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2UtY2hhcnRzLXZhbHVl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Don't lose sleep over bitcoin price charts - Blockworks",
        "content": "When I tell people I work in Bitcoin, the first thing I’m asked is what went wrong.\n\nOnce I have the privilege of explaining the fraud of Mr. Bankman-Fried and that it had nothing to do with Bitcoin — and represents, in fact, the antithesis of the ethos of decentralization that Bitcoin introduced — I’m then asked about the price, when I “got in,” and if we’ll ever see all-time highs again.\n\nIt’s not their fault. Mainstream media is focused on headlines that drive clicks — the overnight millionaires, the rapid price appreciation and crashes, missing the forest for the trees.\n\nBitcoin is a financial revolution\n\nI unequivocally believe Bitcoin will go down as one of the most pivotal innovations in history.\n\nIn the US, Bitcoin attracts a certain cross section of people, usually consisting of those angered by the 2008 global financial crisis: Libertarians, technologists and grizzled former legacy finance professionals. They are people who are fighting for a cause, motivated because they see and understand the cracks in the existing financial system.\n\nBut around the world, those who truly need Bitcoin are finding it. As non-sovereign money, Bitcoin represents an escape hatch — a transfer of power away from government back to the people when control of the financial system is abused by those in power. Citizens are given the off-ramp to save their money in a currency that their government does not have the ability to produce more of and is more difficult to seize, a harder money.\n\nA money’s hardness represents our ability to produce more of it. The harder money is, the better chance it has of holding value over time. Gold is a particularly hard money, as it is very difficult and costly to extract more of it than annual global production dictates. For centuries, the world transacted either in gold or in fiat currencies backed by gold.\n\nToday, the majority of economies transact in central bank-backed fiat currencies, where the cost of production is nothing more than either the paper that it is printed on or adding a row in a database.\n\nIn the United States, the expansion of the money supply is decided by the Federal Reserve, behind closed doors by unelected officials. When the money supply is inflated to allow the government to spend more, the buying power of existing dollars is devalued. Nobel Prize winner Milton Friedman once said: “Inflation is the only form of taxation that can be levied without any legislation”\n\nThe money supply has steadily increased for decades, but the pace has accelerated since 2008. Then in 2020, the Covid emergency provided an immense expansion of the money supply. This liquidity injection into markets resulted in the largest monetary expansion in US history.\n\nWe are witnessing what happens when money is not hard, as the US dollar has rapidly lost purchasing power, and costs of everyday goods and services are on the rise. Inflation dominates not just headlines, but decisions made in the grocery store.\n\nThis puts citizens in an environment where they’re forced to outpace inflation. A dollar tomorrow is worth less than a dollar today. This compels Americans to be capital allocators and make “their dollar work for them.” They invest and reach further out on the risk curve, risking their savings in effort to maintain or even increase their buying power. Keeping up a side hustle of investing detracts from their ability to perform their primary job to the best of their abilities, therefore devaluing their contribution to the economy and society.\n\nEven worse, inflation gives incentives for high time preference and spending in the present. With your dollar worth most in the present, it makes sense to spend rather than save, leading to the consumption-based culture we live in today. With consumers saving a lower percentage of their income each year, we spend more time worrying about the future and how we’ll one day be able to retire.\n\nBitcoin fixes this\n\nCompare the fiat system with Bitcoin’s hardcoded monetary policy. Due to the economic incentives placed on actors in the Bitcoin ecosystem, there will never be more than 21 million bitcoin issued. New coins are created by the network every 10 minutes as miners confirm transactions. The issuance of coins is cut in half every four years and currently 6.25 BTC is issued every block.\n\nThe beauty of Bitcoin’s supply issuance is its relationship with network effects. As Bitcoin adoption grows over time, the demand for BTC increases exponentially with a growing number of users looking to acquire it. At the same time, the supply issuance decreases every four years. This supply/demand mismatch brings an increase in bitcoin’s price over time, giving the incentive to save rather than spend. This brings higher time preference among adopters, buying only what is needed today, knowing your savings will be worth more in the future. No more second job as a capital allocator trying to outpace inflation, as people save more and spend less time worrying about retirement.\n\nRead more from our opinion section: Raise your hand if you fully trust your bank\n\nWhile the mainstream headlines speak of doom and gloom, Bitcoin is working. This last month saw all-time-highs in both mining hash rate and unique addresses being used. The network is becoming more secure and adoption is increasing despite Bitcoin’s price in USD, as more people are coming into the ecosystem.\n\nThe people who need Bitcoin most are still finding it, as adoption continues to grow exponentially in the Global South, particularly in countries like Turkey and Argentina where inflation has spiraled out of control due to government mismanagement of currency. While we’re far away from bull market highs of bitcoin priced in USD, Bitcoin continues to make all-time highs month after month when priced in Turkish liras and Argentinian pesos. The escape latch is working as designed for those who need it most, giving people the ability to protect savings and transact freely when the financial infrastructure around them is crumbling.\n\nI can think of no more worthy way to spend my career than playing my role in pushing the adoption of this world-altering technology. Every day I’m inspired on the front lines, helping the innovators in this space. The rails and infrastructure are being set in place for the next billion adopters, and it’s a privilege to be a part of it. Block after block, Bitcoin is working.\n\nMitch Kochman is Director of Platform Sales at BitGo, where he manages BitGo’s premier client relationships with exchanges, miners and payments platforms. He is predominantly focused and passionate about the Bitcoin-only ecosystem. Mitch has been with BitGo since 2022 and previously spent 11 years at IBM as a sales executive leading global software strategy at several major banks, the last of which being J.P. Morgan Chase. Mitch graduated from University of Maryland with a B.S. in Information Systems and Accounting.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY2FuLWJpdGNvaW4tc3Vydml2ZS10aGUtbmV4dC1yZWNlc3Npb24v0gFaaHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9jYW4tYml0Y29pbi1zdXJ2aXZlLXRoZS1uZXh0LXJlY2Vzc2lvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Can Bitcoin Survive the Next Recession? - Finance Magnates",
        "content": "Bitcoin, often known as digital gold, has acquired popularity as a speculative asset as well as a potential store of wealth and hedge against economic downturns. As speculation about an approaching recession grows, concerns about Bitcoin's resiliency and ability to withstand economic storms emerge. Lets examine the dynamics of Bitcoin in the face of a possible recession and seek advice from industry professionals.\n\nBitcoin's So Far Journey\n\nBitcoin, which was created over a decade ago by the pseudonymous Satoshi Nakamoto, was regarded with suspicion and uncertainty at first. It has, however, defied expectations by obtaining widespread acceptability and drawing an increasing number of investors, institutions, and organizations.\n\nOne of Bitcoin's distinguishing features is its decentralized nature. It runs on a blockchain network managed by a distributed network of nodes rather than a central authority. This decentralization, paired with a limited number of 21 million coins, has established Bitcoin as a digital alternative to traditional fiat currencies, which are susceptible to inflationary pressures.\n\nBitcoin's Spot Trading Volume Hits Five-Year Low Amid Recession Fears\n\nBitcoin's spot exchange trading volumes have plummeted to their lowest levels in nearly five years, reflecting heightened macroeconomic uncertainty that has made investors cautious. A recent report from CryptoQuant, an on-chain analytics platform, highlights the decline in daily BTC volumes on spot exchanges, which have not seen a significant rebound.\n\nThe report attributes this decline to two primary factors: the U.S. government's crackdown on the cryptocurrency industry and growing fears of an impending recession. These concerns have led investors to adopt a cautious approach, with daily Bitcoin transactions showing no signs of resurgence.\n\nChallenges for Short-Term Holders\n\nConversely, the past few months have posed challenges for short-term Bitcoin holders (STHs). While long-term holders continue to accumulate Bitcoin, holding nearly 75% of the entire supply, the supply held by short-term holders hit a multi-year low of 2.56 million BTC last month.\n\nDespite the challenging market conditions, Bitcoin's fundamental market indicators remain robust. The hash rate has surged by an impressive 661% in the last two years. Additionally, with the next Bitcoin halving on the horizon, data analysis suggests that investors may need to exercise patience for the next bullish phase.\n\nBitcoin as a Recession Hedging Tool\n\nOne of the key justifications for Bitcoin's longevity during a recession is its ability to act as a hedge. Historically, traditional hedges such as gold and government bonds have been sought desired during economic downturns. Bitcoin is frequently compared to gold owing to its rarity and ability to store value.\n\nBitcoin supporters believe that its restricted quantity and position as \"digital gold\" make it an appealing option for investors seeking refuge from economic turmoil. During times of uncertainty and currency depreciation, some people resort to Bitcoin to retain money and protect their assets from the loss of purchasing power.\n\nConsiderations and Obstacles\n\nWhile Bitcoin's potential as a hedge is enticing, investors and regulators must examine the following obstacles and considerations:\n\nPrice Volatility: Bitcoin's price has historically been quite volatile. While volatility might provide opportunities for traders, it can also turn off risk-averse investors. Regulatory Framework: The regulatory framework for cryptocurrencies is continually evolving. Government actions and regulations have the potential to have a significant impact on the bitcoin market. Market Sentiment: Market sentiment, news, and social media trends can all have an impact on Bitcoin's price. This can result in dramatic price changes. Adoption and Liquidity: The usefulness of Bitcoin as a hedge is dependent on its adoption and liquidity. Bitcoin's position as a store of wealth may strengthen as acceptance expands. Diversification: A key risk management method is to diversify one's financial portfolio. Bitcoin should be viewed as a component of a diversified portfolio, not as the single buffer against recession.\n\nConclusion\n\nThe topic of whether Bitcoin will survive the next economic downturn is complicated and multidimensional. While Bitcoin has showed promise as an economic hedge, it is not without danger. Bitcoin's performance is influenced by price volatility, regulatory uncertainty, and market sentiment.\n\nAs the global economic environment evolves, Bitcoin's status as a digital asset and potential store of value will almost certainly be called into question. Investors must perform extensive research, determine their risk tolerance, and select a diversified investing strategy that corresponds with their financial objectives.\n\nFinally, whether Bitcoin can weather the storms of a recession is unknown. However, its resiliency and growing acceptability in mainstream finance indicate that it will continue to pique the curiosity and debate of investors, economists, and policymakers in the coming years."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3doYXRpcy9mZWF0dXJlL0EtdGltZWxpbmUtYW5kLWhpc3Rvcnktb2YtYmxvY2tjaGFpbi10ZWNobm9sb2d50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "A Timeline and History of Blockchain Technology - TechTarget",
        "content": "Blockchain was officially introduced in 2009 with the release of its first application -- the Bitcoin cryptocurrency -- but its roots reach back several decades. Many of the technologies that form the basis for blockchain today were in the works long before the emergence of Bitcoin.\n\nStill, blockchain most identifies with Bitcoin -- for better or worse. In the wild and raucous years that followed Bitcoin's debut, blockchain earned a reputation akin to the Wild West. Its decentralized, peer-to-peer (P2P) architecture allowed just about anyone to participate in the process, making it seem too risky for business use. That started to change in 2016 when a burgeoning open source community began developing complete enterprise platforms.\n\nSince then, the technology has taken on a life of its own, with interest coming from many quarters, despite the sometimes scary cryptocurrency headlines of late. Governments, businesses and other organizations are researching and deploying blockchain technology to meet needs that have nothing to do with digital currency. In the face of proliferating cyberthreats and government data privacy regulations, blockchain offers security, immutability, traceability and transparency across a distributed network, making it well suited for use cases that have become difficult to support and protect with traditional infrastructures.\n\nWhat is blockchain? Blockchain is a type of database that's a public ledger for recording transactions without the need for a third party to validate each activity. It's distributed across a P2P network and consists of data blocks linked together to form a continuous chain of immutable records. Each computer in the network maintains a copy of the ledger to avoid a single point of failure. Blocks are added in sequential order, and they're permanent and tamperproof. This article is part of Blockchain for businesses: The ultimate enterprise guide Which also includes:\n\nTop 10 benefits of blockchain for business\n\nTop 10 benefits of blockchain for business What are the 4 different types of blockchain technology?\n\nWhat are the 4 different types of blockchain technology? 7 must-have blockchain developer skills Download 1 Download this entire guide for FREE now! A blockchain starts with an initial block -- often referred to as the Genesis block -- that records the first transactions. The block is also assigned an alphanumeric string called a hash, which is based on the block's timestamp. Blocks are added to the chain sequentially. Each block uses the hash from the previous block to create its own hash, thus linking the blocks together. Blockchain also uses a computational process called consensus to validate a block's authenticity before it can be added to the chain. As part of this process, most of the nodes on the blockchain network must agree that the new block's hash has been calculated correctly. Consensus ensures that all copies of the distributed ledger are in the same state. Initially, blockchain provided a distributed public ledger to support Bitcoin, so transactions could be recorded without the need for a central authority to establish trust in a trustless environment. Not only were transactions more efficient, but also the costs typically associated with third-party verification were eliminated. Blockchain also provided greater transparency, traceability and security than conventional approaches to handling distributed transactions.\n\nBlockchain's historical building blocks Although blockchain as an entity has a relatively short history, its influence today is widespread and its applications wide-ranging and growing. Through the decades, blockchain's development and evolution include some of the following notable developments: Pioneers like Merkle and his tree, Chaum and digital cash, Haber and timestamping, Dwork and proof of work (PoW), Black and hashcash, Finney and reusable PoW dotted the early years of the pre-blockchain landscape.\n\nThe presumed pseudonym Satoshi Nakamoto was created to introduce the concept of cryptocurrency and blockchain. Shortly thereafter, cryptocurrency was launched and Nakamoto conducted the first bitcoin transaction, a bitcoin exchange was established and a programmer paid 10,000 bitcoin for two pizzas.\n\nBitcoin's price soared from pennies to tens of thousands of dollars, all the while draped in controversies, shutdowns, crackdowns, bankruptcies, scams, scandals and arrests.\n\nBlockchain started to somewhat divorce itself from Bitcoin when the decentralized blockchain platform Ethereum eventually became one of the biggest applications of blockchain technology and opened the door to numerous business applications beyond cryptocurrencies.\n\nAnd buoyed by AI, IoT, non-fungible tokens (NFTs), decentralized finance (DeFi) and smart contracts, as well as initiatives by the likes of Walmart and Amazon, blockchain has gained legitimacy as a safe, viable alternative to traditional methods of conducting business and individual transactions. Block-by-block description of blockchain's inner workings.\n\n1979 One of the early pre-blockchain technologies is the Merkle tree, named after computer scientist and mathematician Ralph Merkle. He described an approach to public key distribution and digital signatures called tree authentication in his Ph.D. thesis for Stanford University. Merkle eventually patented this idea as a method for providing digital signatures. The Merkle tree provides a data structure for verifying individual records.\n\n1982 In his Ph.D. dissertation for the University of California, Berkeley, David Chaum described a vault system for establishing, maintaining and trusting computer systems among mutually suspicious groups. The system embodied many of the elements that comprise a blockchain. Chaum is also credited with inventing digital cash, and in 1989, he founded the company DigiCash.\n\n1991 Stuart Haber and W. Scott Stornetta published an article describing how to timestamp digital documents to prevent users from backdating or forward-dating electronic documents. The goal was to maintain the document's complete privacy without requiring record-keeping by a timestamping service. Haber and Stornetta updated the design to incorporate Merkle trees, which enabled multiple document certificates to live on a single block.\n\n1993 The beginnings of the PoW concept were published in a paper by Cynthia Dwork and Moni Naor to provide \"a computational technique for combatting junk mail, in particular, and controlling access to a shared resource, in general.\"\n\n1997 Adam Black introduced hashcash, a PoW algorithm that provided denial-of-service countermeasures.\n\n1999 Markus Jakobsson and Ari Juels published the term proof of work. Also, the P2P network was popularized by the now defunct peer-to-peer file sharing application Napster. Some argued that Napster was not a true P2P network because it used a centralized server. But the service still helped breathe life into the P2P network, making it possible to build a distributed system that could benefit from the compute power and storage capacity of thousands of computers.\n\n2000 Stefan Konst introduced the concept of cryptographically secured chains in his paper \"Secure Log Files Based on Cryptographically Concatenated Entries.\" His model, which showed that entries in the chain can be traced back from the Genesis block to prove authenticity, was the basis for today's blockchain models.\n\n2004 Hal Finney introduced reusable PoW, a mechanism for receiving a non-exchangeable -- or non-fungible -- hashcash token in return for an RSA-signed token. The PoW approach today plays a vital role in Bitcoin mining. Cryptocurrencies like Bitcoin and Litecoin use PoW, and Ethereum shifted to the proof-of-stake protocol to secure a network using a fraction of the energy that PoW uses.\n\n2008 Satoshi Nakamoto, thought to be a pseudonym used by an individual -- or group of individuals -- published a white paper introducing the concept of cryptocurrency and blockchain and helped develop the first Bitcoin software. Blockchain infrastructure, according to the white paper, would support secure, P2P transactions without the need for trusted third parties such as banks or governments. Nakamoto's real identity remains a mystery, but there has been no shortage of theories. The Bitcoin/blockchain architecture was introduced and built on technologies and concepts from the previous three decades. Nakamoto's design also presented the concept of a \"chain of blocks,\" making it possible to add blocks without requiring them to be signed by a trusted third party. Nakamoto defined an electronic coin as a \"chain of digital signatures,\" in which each owner transfers the coin to the next owner by \"digitally signing a hash of the previous transaction and the public key of the next owner and adding these to the end of the coin.\"\n\n2009 Cryptocurrency was launched during the Great Recession, when the government pumped large amounts of money into the economy. Bitcoin was worth less than a penny then. Nakamoto mined the first Bitcoin block, validating the blockchain concept. The block contained 50 bitcoin and was known as the Genesis block -- aka block 0. Nakamoto released Bitcoin v0.1 to the web service SourceForge as open source software. Bitcoin is now on GitHub. The first Bitcoin transaction took place when Nakamoto sent Hal Finney 10 bitcoin in block 170. The Bitcoin-dev channel was created on the text-based instant messaging system Internet Relay Chat for Bitcoin developers. The first Bitcoin exchange -- Bitcoin Market -- was established, enabling people to exchange paper money for bitcoin. Nakamoto launched the Bitcoin Talk forum to share Bitcoin-related news and information. In the spirit of cryptocurrency as money with fixed supply, Nakamoto set up a system to ensure the number of bitcoin mined won't ever exceed 21 million. Blockchain's evolution through the years has been intimately tied to cryptocurrencies, namely Bitcoin.\n\n2010 On May 22, Bitcoin made history when a programmer Laszlo Hanyecz paid 10,000 bitcoin for two delivered Papa John's pizzas. The two pizzas back then were valued at about $40, a transaction that would balloon to a value of more than $260 million at today's bitcoin price level. A short time later that year, programmer Jed McCaleb launched Mt. Gox, a Tokyo-based Bitcoin exchange. Mt. Gox was short for Magic: The Gathering Online eXchange -- a carryover from a fantasy card game. At its peak, Mt. Gox handled more than 70% of all Bitcoin transactions. But in August, a hacker exploited a bug in the blockchain code and created more than 184 billion bitcoin in block 74,638, tarnishing Bitcoin's reputation. Nakamoto published a new version of the Bitcoin software, but by the end of the year, he disappeared from the Bitcoin scene completely.\n\n2011 One-fourth of the 21 million bitcoin had been mined. By early February, the value of a bitcoin was equal to the U.S. dollar. Shortly thereafter, McCaleb sold Mt. Gox to Mark Karpelès. And soon after that, the bitcoin reached parity with the euro and British pound sterling. WikiLeaks started accepting bitcoin donations. However, Mt. Gox was hacked and bitcoin were stolen, causing an artificial drop in value and resulting in suspension of trading. Litecoin was released in October, representing one of the earlier Bitcoin spinoffs and considered the first alternative cryptocurrency.\n\n2012 The interest in cryptocurrencies solidified. Bitcoin's price hovered around $5 for most of the year with several fluctuations. Early that year, Mihai Alisie and Ethereum creator Vitalik Buterin launched Bitcoin Magazine and published their first issue in May. A few months later, the Bitcoin Foundation was established to promote Bitcoin and restore public perceptions of cryptocurrency after several scandals. McCaleb and Chris Larsen founded OpenCoin, which led to the development of the Ripple transaction protocol for currency transactions and real-time payments. Coinbase raised more than $600,000 in its crowd-funded seed round on its way to becoming one of the top Bitcoin exchanges.\n\n2013 Bitcoin's upward trajectory continued. In February, Coinbase reported selling $1 million worth of bitcoin in a single month at more than $22 each. By the end of March, with 11 million bitcoin in circulation, the currency's total value exceeded $1 billion. And in October, the first reported bitcoin ATM launched in a Vancouver, B.C., coffee shop. But it wasn't all good news for digital currency. Both Thailand and China banned cryptocurrencies. The U.S. Federal Court seized Mt. Gox's funds in the U.S. for transmitting money without a license. And the FBI shut down the dark web marketplace Silk Road, confiscating about 144,000 bitcoin worth more than $1 billion and resulting in a life prison sentence for the owner Ross Ulbricht for a litany of crimes, including drug trafficking, computer hacking and money laundering.\n\n2014 Despite setbacks, one of the more important milestones in blockchain's history occurred when Bitcoin Magazine co-founder Buterin published a white paper proposing a decentralized application platform, leading to the creation of Ethereum and the Ethereum Foundation. Ethereum paved the way for blockchain technology to be used for applications other than cryptocurrency. It introduced smart contracts and provided developers with a platform for building decentralized applications. Financial institutions and other industries began to recognize and explore blockchain's potential, shifting their focus from digital currency to the development of blockchain technologies. But Bitcoin stayed in the spotlight -- for better and worse. The Mt. Gox Bitcoin exchange filed for bankruptcy. The Bitcoin Foundation vice chairperson was arrested for money laundering. And the U.K. tax authority classified bitcoin as private money. Yet several companies accepted bitcoin by year's end, including the Chicago Sun-Times, Overstock.com, Microsoft, PayPal and Expedia. Bitcoin's acceptance only added fuel to blockchain's fire.\n\n2015 The Ethereum Frontier network launched, enabling developers to write smart contracts and decentralized apps that could be deployed to a live network. Ethereum was on its way to becoming one of the biggest applications of blockchain technology. It drew in an active developer community that continues to this day. In addition, Nasdaq initiated a blockchain trial. The Linux Foundation launched the Hyperledger project. And nine major investment banks joined forces to form the R3 consortium, exploring how blockchain could benefit their operations. Within six months, the consortium grew to more than 40 financial institutions.\n\n2016 The term blockchain gained acceptance as a single word, rather than being treated as two concepts, as they were in Nakamoto's original paper. The Chamber of Digital Commerce and the Hyperledger project announced a partnership to strengthen industry advocacy and education. A bug in the Ethereum decentralized autonomous organization code was exploited, resulting in a \"hard fork\" in the Ethereum network. The Bitfinex cryptocurrency exchange was hacked and nearly 120,000 bitcoin were stolen -- a bounty worth about $66 million.\n\n2017 Bitcoin hit a record high of nearly $20,000. Japan recognized bitcoin as legal currency. Seven European banks formed the Digital Trade Chain Consortium to develop a trade finance platform based on blockchain. The Block.one software company introduced the EOS blockchain operating system, based on the EOS cryptocurrency and designed to support commercial decentralized applications. About 15% of global banks used blockchain technology in some capacity.\n\n2018 Entering its 10th year, bitcoin's value continued to drop, ending the year at about $3,800. The online payment firm Stripe stopped accepting bitcoin payments. Google, Twitter and Facebook banned cryptocurrency advertising. South Korea banned anonymous cryptocurrency trading but announced it would invest millions in blockchain initiatives. The European Commission launched the Blockchain Observatory and Forum to accelerate the development of blockchain. Baidu introduced its blockchain-as-a-service platform.\n\n2019 Walmart launched a supply chain system based on the Hyperledger platform. Amazon announced the general availability of its Amazon Managed Blockchain service on AWS to help users build resilient Web 3.0 applications on public and private blockchains. Ethereum network transactions exceeded one million per day. Blockchain research and development took center stage as organizations embraced blockchain technology and decentralized applications for a variety of use cases.\n\n2020 A Deloitte survey revealed that nearly 40% of respondents incorporated blockchain into production, and 55% viewed blockchain as a top strategic priority. Ethereum launched the Beacon Chain in preparation for Ethereum 2.0. Stablecoins, whose value is tied to another asset class, rose significantly because they promised more stability than traditional cybercurrencies. Interest increased in combining blockchain with AI to optimize business processes.\n\n2021 Bitcoin reached an all-time high of $68,789.63 on Nov. 10, 2021. During its bull run, the bitcoin market cap surpassed $3 trillion. Coinbase went public and was acknowledged as the seventh biggest new listing of all time on the U.S. stock exchange. The DeFi market offering services through smart contracts on blockchain grew a whopping 600% from the previous year, reaching a value of $200 billion. And NFT artwork made headlines, selling for more than $69 million in Ethereum at the auction house Christie's. Well-known entrepreneurs and athletes attempted to capture the meteoric rise in bitcoin's value, including Elon Musk initially accepting cryptocurrency as payment on new Tesla vehicles and Aaron Rogers taking a portion of his multimillion-dollar NFL salary in bitcoin. Interest in using blockchain for applications other than cryptocurrency continued as governments and enterprises considered blockchain for a variety of use cases, including voting, real estate, fitness tracking, intellectual rights, IoT and vaccine distribution in the midst of the COVID-19 pandemic. Moreover, multiple cloud providers now offered blockchain as a service, and the demand for qualified blockchain developers was greater than ever. The global blockchain technology market was valued at nearly $6 billion in 2021 and seen surpassing a trillion dollars by 2030, according to market researcher Statista. Blockchain's business applications spread far and wide beyond cryptos.\n\n2022 NFTs continued their ascent, eco-friendly blockchain networks emerged and blockchain applications increased among companies. Bitcoin mining crept closer to Nakamoto's 21 million coin limit, reaching 19 million and leaving less than 10% of bitcoin to be mined. All-time high prices for bitcoin and other cryptocurrencies plummeted in the spring due to investor concerns about inflation and the new COVID-19 Omicron variant. Some cryptocurrency exchanges went bankrupt. The collapse of the FTX exchange and arrest of its CEO Sam Bankman-Fried amplified fears about cryptocurrency's riskiness. The open source blockchain platform Terra also collapsed. Speculation of new U.S. government regulation of cryptocurrency added to the uncertainty but at the same time was thought to help legitimize the industry. Globally, Danish shipping company Maersk announced the shutdown of the blockchain-based TradeLens digital ledger it co-developed with IBM because of a lack of player participation. And the Australian Stock Exchange scrapped a seven-year plan to move its trading platform to blockchain. More than 100 countries were involved in the creation of their own central bank digital currencies, according to Statista. CBDCs are digital versions of real-world fiat money to eventually help speed cross-border retail transactions on blockchain in contrast to the slower speeds and price volatility of cryptocurrency. Blockchain's vaunted claims of imperviousness came under attack -- and not just figuratively. Blockchain analysis firm Chainalysis identified nearly 200 cryptocurrency or blockchain hacks, resulting in losses of $3.8 billion. The most noteworthy incident occurred when the video game blockchain Ronin Network reported the theft of $625 million worth of Ether and USDC stablecoins. The U.S. Treasury Department blamed a North Korean hacker collective for the attack.\n\n2023 The bad news for cryptocurrency continued as the SEC indicted executives at the Coinbase and Binance exchanges and filed charges against crypto-asset entrepreneur Justin Sun and three of his wholly owned companies for the unregistered offer and sale of crypto-asset securities. Businesses are still moving ahead with blockchain, but they're proceeding with greater caution. While blockchain technology has been mostly applicable to finance services and banking, other viable applications include gaming, media and entertainment, real estate, healthcare, cybersecurity, smart contracts, NFTs, IoT, transportation, supply chain management and the government. But the latest iteration of the internet, Web 3.0, with its offer of decentralization and data security, may well be the greatest driver of blockchain technology. Bitcoin for now has found some relatively solid footing in the $25,000 to $30,000 range. Bitcoin mining should reach Nakamoto's 21 million limit sometime around 2140."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNy9zZWNzLWdlbnNsZXItdGhyb3dzLW1vcmUtY3J5cHRvLXB1bmNoZXMtaW4tY29uZ3Jlc3Npb25hbC1oZWFyaW5nL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNy9zZWNzLWdlbnNsZXItdGhyb3dzLW1vcmUtY3J5cHRvLXB1bmNoZXMtaW4tY29uZ3Jlc3Npb25hbC1oZWFyaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "SEC’s Gensler Throws More Crypto Punches in Congressional Hearing - CoinDesk",
        "content": "A judge in the D.C. Circuit Court of Appeals told the SEC in August to rethink its view on these applications for bitcoin ETFs. Circuit Judge Neomi Rao wrote that the agency’s rejection in the Grayscale Investments case had been \"arbitrary and capricious.\" Gensler’s testimony didn’t reveal what the agency will do next, or when it will act."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjcvYml0Y29pbi1zbGlkZXMtYmFjay10b3dhcmRzLTI2ay1hcy1zdXJnaW5nLWludGVyZXN0LXJhdGVzLXRyaWdnZXItbWFjcm8taml0dGVycy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8yNy9iaXRjb2luLXNsaWRlcy1iYWNrLXRvd2FyZHMtMjZrLWFzLXN1cmdpbmctaW50ZXJlc3QtcmF0ZXMtdHJpZ2dlci1tYWNyby1qaXR0ZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Slides Back Towards $26K as Surging Interest Rates Trigger Macro Jitters - CoinDesk",
        "content": "Although interest rates are continuing to trend upwards, which in theory should put pressure on the price of bitcoin, some have argued that the typical relationship between interest rates and bitcoin is breaking down, while others believe there's a bullish argument to be made about bitcoin based on its technical aspects."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjgvYml0Y29pbi10b3BzLTI3ay1hcy1yYXRlcy1hbmQtb2lsLXJldHJlYXQtZXRoZXItb3V0cGVyZm9ybXMtb24tZXRmLWhvcGVzL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjgvYml0Y29pbi10b3BzLTI3ay1hcy1yYXRlcy1hbmQtb2lsLXJldHJlYXQtZXRoZXItb3V0cGVyZm9ybXMtb24tZXRmLWhvcGVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Tops $27K as Rates and Oil Retreat; Ether Outperforms on ETF Hopes - CoinDesk",
        "content": "“My baseline scenario is bitcoin to move higher and eventually move past that $31,000-$32,000 barrier,” Kampenaer said. But it has to happen in the next 6-8 weeks, he added, otherwise the level could put a lid on BTC’s price for a longer time. “If it remains suppressed and under that barrier, it becomes stronger and more difficult to break.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA5LzI4L3ZhbGt5cmllLWdldHMtYXBwcm92YWwtdG8tc3RhcnQtYnV5aW5nLWV0aC1mdXR1cmVzLWZvci1pdHMtZXhpc3RpbmctYml0Y29pbi1ldGYv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA5LzI4L3ZhbGt5cmllLWdldHMtYXBwcm92YWwtdG8tc3RhcnQtYnV5aW5nLWV0aC1mdXR1cmVzLWZvci1pdHMtZXhpc3RpbmctYml0Y29pbi1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Valkyrie Gets Approval to Start Buying ETH Futures for Its Existing Bitcoin ETF - CoinDesk",
        "content": "The fund's new strategy to combine both ETH and BTC futures contract into one ETF will be formally effective on Oct. 3 and the name will be updated to Valkyrie Bitcoin and Ether Strategy ETF, while the ticker will remain BTF."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZmluYWxpc3RzLWZvci0kMS1taWxsaW9uLWluLXNlZWQtZnVuZGluZy1ieS1zYW1hcmEtYml0Y29pbi1tYWdhemluZS1wcm8tYW5ub3VuY2Vk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Finalists for $1 Million in Seed Funding by Samara Bitcoin Magazine PRO, Announced - Nasdaq",
        "content": "Three finalists have been selected for the Bitcoin Alpha Competition, a crowd-sourced campaign to find the next top Bitcoin fund manager. The manager with the most promising approach for generating alpha in the bitcoin market will be awarded $1 million USD in seed capital and announced on the Main Stage of the Bitcoin Amsterdam Conference on Friday, October 13th by Samara Alpha Management.\n\n\n\nSamara Alpha Management and Bitcoin Magazine PRO reviewed more than 150 applications from traditional finance and digital asset fund managers, and have selected the following finalists: Andrey Aakelyan (Theta Digital), Jaron Abbott (Armor Strategy), and Maximilian Pace (Animus Technologies). Of these three, one winner will walk away with one million dollars in seed funding – as well as all the necessary operational infrastructure to launch and run their fund strategy – thanks to the generous support of Samara Alpha Management and their signature seeding platform.\n\n\n\nBelow are insights into each of the finalists’ fund strategies:\n\n\n\nAndrey Arakelyan - Theta Digital\n\nTheta Digital is focused on taking discretionary Long or Short positions in Bitcoin Futures at varying timescales to achieve incremental alpha denominated in BTC preserved by systematic risk management.\n\nJaron Abbott - Armor Strategies\n\nThe Armor Strategy utilizes a portfolio of indicators to quantitatively describe and measure the psychological behavior of panic selling in its early stages. Signals are aggregated and translated to predict and extract alpha from impending price moves.\n\nMaximilian Pace - Animus Technologies\n\nAnimus Technologies is an AI-platform designed to develop data-driven trading strategies for cryptocurrencies. The result, developed over the past 6 years, is a systematic solution to reducing market volatility and enhancing investor returns over market cycles.\n\n\n\nBitcoin Magazine spoke with Roy Tse, Chief Risk Officer at Samara Alpha Management, for his thoughts on the competition and why Samara Alpha Management has made such a decisive move into the Bitcoin ecosystem:\n\n“We have a belief that we can find interesting managers that are really adding accretive value to the Bitcoin space. At Samara, a lot of us believe in the power of Bitcoin and what it can do for the world.\n\nEvery day, we hear tons of great investment ideas and strategies. Given the current regulatory environment, and the disjointed-ness of the exchanges and markets, that is why many of these market opportunities emerge, similar to the early days of other traditional finance businesses that we’ve seen such as mortgage-backed trading and CLOs. Any time there is a new industry, there is a chance for novel financial strategies to succeed. But, to capitalize on that, the difficulty lies in the environment to set up the required infrastructure in such a new market, like Bitcoin and digital assets.\n\nWe are Bitcoin maximalists, we want to increase adoption. If folks can’t enter the market because of things like setting up their fund, or not knowing who to call – those are the pressure points we want to alleviate.\n\nBecause of that, we created the Samara seeding platform, which is essentially a fund in a box. We provide the ability for a manager to come in with a great idea and subscribe to a technology platform complete with all of the different disciplines needed to set up a Bitcoin investment management company. You have fund administrator connectivity with data coming through from the exchanges, pre-existing exchange partners and accounts, risk management functions complete with analytics, calculations and customization, liquidity management functions etc.\n\nThe million dollar prize for the Bitcoin Alpha Competition is very exciting for us, but the true excitement we have is for the seeding platform — being able to provide this functionality to fund managers with great strategies and helping them bring their ideas to life at the push of a button.”\n\n\n\n\n\nWith the crowning of the Bitcoin Alpha Competition winner at Bitcoin Amsterdam fast approaching, stay tuned for the announcement on Friday, October 13th for who will take home the $1 million prize as well as full access to Samara’s fund management platform.\n\n\n\nFor media inquiries and additional information on the competition, please contact: kristyna.mazankova@btcmedia.org\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjgvY3J5cHRvLW9ic2VydmVycy13YXJuLW9mLXJpc2stYXZlcnNpb24tYXMtb2lsLXByaWNlcy10b3AtOTMv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8yOC9jcnlwdG8tb2JzZXJ2ZXJzLXdhcm4tb2Ytcmlzay1hdmVyc2lvbi1hcy1vaWwtcHJpY2VzLXRvcC05My9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Crypto Observers Warn of Risk Aversion as Oil Prices Top $93 - CoinDesk",
        "content": "\"One thing to keep closely on the radar is oil - which we believe has taken over as the leader of macro markets, and where a break of $100 will likely kick off the overall risk sell-off in earnest,\" QCP's market insights team said in an update published early this month."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pcy1iaXRjb2luLXByaWNlLWdvaW5nLXRvLWNyYXNoLWFnYWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Is Bitcoin price going to crash again? - Cointelegraph",
        "content": "Bitcoin (BTC) is still in a bullish reversal when looking at this year’s price chart. The BTC price has gained 70% after bottoming out at around $16,800 in November 2022, defying rate hike fears while riding on growing exchange-traded fund approval optimism.\n\nHowever, in recent months, Bitcoin bulls have failed to sustain the BTC price above $30,000. Therefore, with the “bullish” halving still over 200 days away, many traders wonder if the Bitcoin price will crash again in the coming months.\n\nCointelegraph looks at the possible scenarios as Q3 draws to a close.\n\nFibonacci fractal hints at Bitcoin crash to $21,500\n\nFrom a technical standpoint, the Bitcoin price has stabilized around the 0.236 Fib line of its Fibonacci retracement graph drawn from the $69,000 swing high (the market top) to the $15,900 swing low (the local market bottom).\n\nThis flat BTC price action looks very similar to the one witnessed during the 2018 BTC price correction.\n\nBTC/USD weekly price chart. Source: TradingView\n\nIn 2018, the BTC/USD pair stabilized around its 0.236 Fib line at around $6,790 for months before dropping toward $3,000 in December. The $3,000 level coincided with what is now multiyear ascending trendline support (marked as bear market support in the chart above).\n\nBitcoin is now halfway repeating 2018 already with price flatlining at the 0.236 Fib line. A breakdown from this level means BTC price will see $21,500 as the next major support level, down 17.75% from current levels.\n\nStrong dollar adds to Bitcoin’s downside risks\n\nMeanwhile, the U.S. Dollar Index (DXY), which measures the greenback’s strength against a pool of top foreign currencies, has reached its highest level since November 2022.\n\nThe index has been negatively correlated with Bitcoin throughout 2023, as shown below.\n\nBTC/USD vs. DXY weekly price chart. Source: TradingView\n\nThe dollar’s advance has accelerated after the United States Federal Reserve’s rate decision on Sept. 20, and the DXY is currently painting its 11th consecutive green weekly candle.\n\nDXY weekly performance chart. Source: TradingView\n\nIn other words, Bitcoin’s upside prospects could be limited if the dollar continues to climb following the DXY golden cross.\n\n“Old” Bitcoin being sold?\n\nBitcoin’s on-chain metrics are painting a mixed outlook.\n\nBitcoin’s coin days destroyed (CDD) metric, measuring long-term investors’ actions, spiked on Sept. 19, indicating that some long-term BTC holders moved their coins, suggesting possible profit-taking or repositioning.\n\nTraders should take caution here as most CDD spikes have historically preceded price declines.\n\nBitcoin coin days destroyed. Source: CryptoQuant\n\nOn the other hand, Bitcoin reserves across all crypto exchanges continue declining, which hints at increasing hodling behavior among investors.\n\nBitcoin exchanges’ BTC reserves. Source: CryptoQuant\n\nWhat Bitcoin trading analysts are saying\n\nBitcoin analysts are also divided over where BTC price may be headed in the months ahead.\n\nPopular trader Skew argues that the BTC price can hit $30,000 by October, citing thin ask liquidity near $27,000, possibly leading to a breakout.\n\nRelated: Bitcoin fails to recoup post-Fed losses as $20K BTC price returns to radar\n\nFellow analyst Rekt Capital, however, doesn’t rule out a price correction toward $18,000 based on a pre-halving fractal shown below.\n\nBTC/USD weekly price chart. Source: TradingView/Rekt Capital\n\n“History suggests that the next 140 days will be crucial for dollar-cost-averaging in preparation for the Post-Halving parabolic rally,” said Rekt Capital, adding:\n\n“If Bitcoin is going to retrace from [the current price levels], it will most likely be during this current 140 day period.“\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzI4L3doeS1jcnlwdG9jdXJyZW5jaWVzLWxpa2UtYml0Y29pbi1hbmQtZXRoZXJldW0tc3VyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Why Cryptocurrencies Like Bitcoin and Ethereum Surged Today - The Motley Fool",
        "content": "What happened\n\nThursday was a fine day for cryptocurrencies nearly across the board, with the sector's leaders driving the rally. No. 1 and No. 2 -- respectively, Bitcoin (BTC -1.43%) and Ethereum (ETH -2.09%) -- were trading around 3% higher over the 24 hours preceding late afternoon.\n\nAs the top dogs go, the remaining pack typically follows, so a host of other coins, tokens, and related assets also moved higher, albeit at different paces. Fellow crypto Aave (AAVE -2.42%) was enjoying a nearly 9% surge, while miner Riot Platforms (RIOT -6.39%) was defying gravity at a nearly 5% clip.\n\nSo what\n\nThe trajectory of cryptocurrencies (and stocks closely tied to them, like Riot Platforms) frequently depends on the performance of low-risk assets. When the latter start to weaken, this emboldens certain investors to stack up on the riskier goodies, and coins and tokens are still considered to be model high-risk plays.\n\nOn Thursday, those safe havens weren't looking infallible. The yield on the benchmark 10-year U.S. Treasury bond, considered by many to be the most secure investment on the scene, weakened from a 16-year high on Thursday.\n\nMeanwhile, everybody's favorite fossil fuel investment, crude oil, also saw a price retreat (in its case, from year-to-date highs). Finally, the reserve currency of this planet (the U.S. dollar) lost a bit of its value too.\n\nThese weren't the only factors driving Bitcoin, Ethereum, and their many relatives higher on the day.\n\nIn a post on X (formerly Twitter) late Wednesday, Bloomberg reporter Eric Balchunas wrote that the Securities and Exchange Commission (SEC) is making moves to accelerate the rollout of certain Ethereum exchange-traded funds (ETFs). Specifically, according to Balchunas, the SEC has requested ETF filers to update their applications in an effort to get those instruments up and running for trading next week.\n\nWhile this apparently only concerns Ethereum ETFs, it's easy to imagine that if the regulator is ready to turn on the light for that crypto, it's ready to do so for a host of other coins and tokens. There still is much crypto resistance in official corners -- particularly at the SEC, ahem -- but at least to some degree, it seems to be melting a bit.\n\nNow what\n\nOther factors playing in the background are also contributing to the current crypto bullishness. The equity market continues to be generally frothy, which not only fuels optimism for riskier assets but also gets investors to consider non-stock plays like cryptocurrencies. Interest rates remain relatively high and look set to stay that way for some time or even rise. So, we likely haven't seen the last good day for coins and tokens."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWJpdGNvaW4tbWluZXJzLWFyZS1zZWxsaW5nLWJ0Yy1hbmQtd2h5LWl0LXMtbm90LWNhcGl0dWxhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "3 reasons why Bitcoin miners are selling BTC — and why it's not capitulation - Cointelegraph",
        "content": "Crypto analysts, traders and anonymous influencer Bitcoin pundits on X (formerly known as Twitter) frequently interpret what Bitcoin miners do with their block rewards as a sentiment gauge for where Bitcoin's price might go.\n\nAccording to the theory, Bitcoin (BTC) miners sending rewards to exchanges foreshadows pending sell pressure on the asset’s price and possibly reflects distress among miners.\n\nSeveral publicly listed Bitcoin miners challenged aspects of this methodology at last week’s Bitmain World Digital Mining Summit (WDMS) in Hong Kong at a panel hosted by Cointelegraph’s head of markets, Ray Salmond.\n\nBitmain WDMS panel on Bitcoin mining and renewable energy. Source: Cointelegraph\n\nAccording to Jeff Pratt, Core Scientific’s senior vice president of growth and partnerships, “Core Scientific might be the poster child for the hodl strategy. We built a 10,000 Bitcoin hoard, and we rode it up to the top, and then it led to some financial struggles that we are trying to emerge from now. So, what we’re doing today, we sell our Bitcoin production each day.”\n\n“I think it goes back to those three things: How and where can you drive costs out, how and where do you drive efficiency up, and what are the new financial innovations that you can bring to your treasury or to your power programs to basically stabilize your overall companies’ profitability.”\n\nPanelists Taylor Monnig of CleanSpark and Will Roberts of Iris Energy agreed with Pratt, mentioning that their respective companies also sell a majority of their mined BTC.\n\n“CleanSpark’s strategy was wildly different, right? So we were very conservative during the bull market, and we got a lot of grief for that,” Monnig said. “We sold Bitcoin all the way at the top at $60K, and we got a lot of grief for that as well. But, I think everybody has kinda seen our strategy pay off this year with the expansion that we’ve taken to 9.5 exahashes, and now we’re starting to increase our hold, as you guys have probably seen over the last couple of months now that Bitcoin price is at a much lower rate.\" Monnig added:\n\n“We took a lot more conservative approach in the bull market. Building in the bear has been the motto inside our company, and I think we will continue to expand on that. I think people learned a lot over the last market cycle, and I think the CleanSpark strategy will be adopted by a lot of the other miners moving forward.”\n\nRoberts shared, ”We’ve sold all our Bitcoin daily since we started mining. I mean, our view of this is mining Bitcoin and operating data centers is a very different business model to investing in an asset like Bitcoin. We’re in the business of generating shareholder value. What we’re good at is operating data centers, generating cash flows for investors.” Roberts added:\n\n“Our view is that we can actually generate more value by selling a Bitcoin today and earning that Bitcoin, plus some back in the future, and we’ve got the opportunity and the expansion capabilities to do that, or at some stage in the future potentially paying out a dividend, whether it’s cash or Bitcoin.”\n\nAccording to TeraWulf co-founder Nazar Khan, “The last bull market seems like two lifetimes ago. So any approaches that we had then I think are long gone, and we’ve kinda tweaked and modified where we’re at.” Khan added:\n\n“Similar to some of the other folks here, we’ve been selling every Bitcoin that we produce, and fundamentally we at TeraWulf think we’re a converter. We’re taking a kilowatt hour of power, running it through the wonderful ASICs that Bitmain makes and producing hash on the back end. Every single day, how we judge this is how efficient we are in that conversion process. We tell our investors that we’re converters and measure us on how efficient we are in that conversion process and that means we monetize every Bitcoin we sell on a daily basis.”\n\nRelated: Bitcoin miners double down on efficiency and renewable energy at the World Digital Mining Summit\n\nSo, are Bitcoin analysts doing it all wrong?\n\nWhen questioned on the accuracy and methodology of on-chain metrics like Charles Edward’s hash ribbons indicator, Khan quipped, “I think that the business of being an analyst is an extremely difficult one because, by definition, you’re probably wrong. Besides that, I think that historically, that might have been a good measure. Historically, when we were recognizing margins of 80%-plus, there wasn’t a need to sell. You didn’t need to monetize every Bitcoin that was produced.”\n\n“I think as we look at most of the companies today, given our growth plans that we have, the only source of income that we have is the margins that we have by mining Bitcoin or raising incremental capital, and the capital markets we use to grow our businesses have been tight the last couple of years,” Khan added.\n\n“Therefore, I think, at least for the publicly listed miners, looking at their Bitcoin selling strategies is not necessarily a direct indicator of capitulation or distress — it’s more of how does that fit into where they sit today and where their growth plans are for tomorrow and how does that meet their capital needs.”\n\nStatements from Foundry vice president Kevin Zhong also aligned with the perspectives of the publicly listed miners at the WDMS.\n\nFoundry senior vice president Kevin Zhang speaks about the Bitcoin halving. Source: Cointelegraph\n\n“The ideal scenario is to rely on our hopium that Bitcoin does go up and that our woes go away on their own, it's not guaranteed. The economic incentives of Bitcoin going alone may not be there or may come 6 months or 12 months after the halving. In that scenario, you’ve got to get really creative. What do we do with block space, how do we drive fees up. What other ways are there to subsidize ourselves and subsidize miners. You also have to be very critical and strategic with what you do with the Bitcoin that you mine. Are you hedging it out, are you doing covered calls? What are your treasury plans? If you have a bullish outlook on Bitcoin are you going to be liquidating all of it or holding on to some of it. It requires a lot of stratification and models, endless models.”\n\nTo hear the full conversation on Bitcoin miners’ pivot to renewable energy, the growing synergy between energy producers and BTC miners and miners' views on the upcoming halving check out the WDMS panel here.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvY29tbWVudGFyeS8yMDIzLzA5LzI3L3dvcmxkL2FpLWJpdGNvaW4tZW5lcmd5LWNhcmJvbi1mb290cHJpbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin's power-hungry history offers lessons for AI's future - The Japan Times",
        "content": "Surging interest in artificial intelligence systems will add further strain to global electricity grids with the potential to rival the massive energy consumption of bitcoin. Thankfully, the premier cryptocurrency has shown us a way to mitigate the impact.\n\nA doubling of data center revenue at Nvidia last quarter shows that demand for generative applications like ChatGPT hasn’t yet hit its peak. The U.S. chipmaker is the key provider of shovels in this AI goldrush, but those processors are neither cheap nor lean. Its latest flagship, the GH200 Grace Hopper Superchip, which is the size of a postcard, draws up to 1,000 watts — equivalent to a portable heater.\n\nThough most customers will be opting for something less fancy than the Superchip, they do buy processors in bulk to connect together into a massive AI server and that is where the hunger for electricity really kicks in. One study published last year looked at the energy consumption required to train a single large language model used to output text in multiple languages."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWxlZ2FsbHktcmVjb2duaXNlZC1pbi1zaGFuZ2hhaS1wYXZlcy13YXktZm9yLWNyeXB0by1leHBhbnNpb24taW4tY2hpbmEvODg1NzcvMdIBjQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYW1wL2FydGljbGUvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1sZWdhbGx5LXJlY29nbmlzZWQtaW4tc2hhbmdoYWktcGF2ZXMtd2F5LWZvci1jcnlwdG8tZXhwYW5zaW9uLWluLWNoaW5hLzg4NTc3LzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin legally recognised in Shanghai, paves way for crypto expansion in China - Forbes India",
        "content": "\n\n\n\nShanghai has recognised Bitcoin as a unique and non-replicable digital asset. They have acknowledged its scarcity and inherent value. This recognition comes despite China's official stance against crypto. The development was even shared by Tron Network founder Justin Sun on his social media.\n\n\n\nOn September 25, the Chinese court published a report outlining the advancements in internet technology. In the report, they emphasised that with the development of internet technology, digital currencies, particularly Bitcoin, stand out for being unique and non-replicable from other digital assets.\n\nThe report also highlights Bitcoin's distinct characteristics, which include its scarcity and widespread acceptance. It underscores that Bitcoin exhibits essential currency traits like scalability, ease of circulation, storage, and transaction usability. Despite being decentralised and lacking central authority oversight, Bitcoin retains key currency functions, serving as a medium of exchange, store of value, and widely accepted means of payment globally.\n\n\n\n\n\nThe report highlights that Bitcoin can be acquired through mining, inheritance, or buying and selling. This legal perspective strengthens the legitimacy of Bitcoin and other digital currencies within China. It indicates that courts may be more open to recognising crypto as personal property.\n\n\n\n\n\nIn 2021, China imposed a blanket ban on all crypto activities, including Bitcoin mining, and barred foreign exchanges from serving its mainland customers. However, this latest recognition from one of the key courts in China provides a new perspective for the crypto realm in China.\n\n\n\n\n\nSeveral other Chinese courts have recognised Bitcoin and other digital assets as legal properties protected by law. In May 2022, a Shanghai court recognised Bitcoin as a virtual property. In September 2022, a lawyer argued that Chinese law could protect crypto holders in theft or breach cases despite the national crypto ban.\n\n\n\n\n\nThe Chinese Government has taken no official stand with respect to lifting the ban on conducting crypto activities in the country. The recognition of Bitcoin by some Chinese Courts as a unique digital currency gives hope that China could lift the ban on crypto in the future.\n\n\n\n\n\nThe global crypto community has welcomed this news, as it legitimises Bitcoin and sets a precedent for future legal recognition of cryptos in other jurisdictions as well. Cryptocurrencies are slowly gaining acceptance in mainstream finance, reinforcing their legitimacy.\n\n\n\n\n\nThe writer is the founder at yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtZGVsYXlzLXNwb3QtYml0Y29pbi1ldGZzLWJsYWNrcm9jay1iaXR3aXNlLXZhbGt5cmllLWludmVzY2_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "SEC delays spot Bitcoin ETF decision for BlackRock, Invesco and Bitwise - Cointelegraph",
        "content": "The United States Securities and Exchange Commission has delayed its decision on several proposals for spot Bitcoin (BTC) exchange-traded funds (ETFs), including BlackRock, ahead of an anticipated government shutdown.\n\nThe spot Bitcoin ETF applications of Invesco, Bitwise and Valkyrie were also delayed by the SEC, according to separate Sept. 28 filings, while Bloomberg ETF analyst James Seyffart is expecting the applications from Fidelity, VanEck and WidsomTree to also be pushed back by the securities regulator.\n\nThe latest delays came two weeks earlier than the scheduled second deadline date for many applicants, who had been expecting to hear from the securities regulator by Oct. 16–19.\n\nSeyffart said the timing of the delays is related to the expected U.S. government “shutdown” potentially taking place on Oct. 1, which will disrupt the country's financial regulators and other federal agencies.\n\nBoth chambers of Congress — the House and Senate — haven’t agreed on various funding bills to finance government operations and Congress needs to pass 12 separate full-year funding bills by Oct. 1 to avoid a shutdown.\n\nThe SEC delayed a bundle of spot Bitcoin ETF applicants in late August when the first deadline was approaching.\n\nMeanwhile, the third set of deadlines for the seven firms is around mid-January, and they could also be delayed. The SEC will have to make a final decision by mid-March at the very latest.\n\nRelated: Bitcoin ETFs or not, don’t expect a ‘sexy’ crypto bull run — Concordium founder\n\nIn late August, Bloomberg ETF analyst Eric Balchunas estimated that the probability of a spot Bitcoin ETF being approved by the end of 2023 had increased to 75% (from an earlier 65%).\n\nHe cited the unanimity and decisiveness at which the U.S. Court of Appeals Circuit reached its decision in Grayscale’s court win over the SEC as the main reason behind the odds increasing.\n\nBalchunas further raised those odds to 95% by the end of 2024.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1hcmUtYml0Y29pbi1mdXR1cmVzLWhvdy1kby10aGV5LXdvcmvSAUxodHRwczovL2RlY3J5cHQuY28vcmVzb3VyY2VzL3doYXQtYXJlLWJpdGNvaW4tZnV0dXJlcy1ob3ctZG8tdGhleS13b3JrP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "What Are Crypto Futures, Coinbase's Latest Offering? - Decrypt",
        "content": "In brief A futures contract is an agreement that obligates a trader to buy or sell an asset at a specific time, quantity and price.\n\nBitcoin futures help to bring in additional liquidity to the market and also provide opportunities for arbitrage.\n\nAs the trading value of Bitcoin varies, so too will the value of different Bitcoin futures contracts.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCoinbase announced on September 28, 2023 that it plans to launch its regulated perpetual futures contracts on its Coinbase Advanced platform (initially for non-US customers). Why futures? Partly because they offer investors a way of potentially taking advantage of the high volatility of most crypto. Let's use Bitcoin as an example.\n\nSpot trading—the practice of buying and selling Bitcoin—forces traders to exchange cryptocurrencies at their current prices. But what if there was a way to lock in that price of $4,000, picking up the Bitcoin a couple of months later? So even if Bitcoin’s price hit $12,000, the counterparty would have to deliver the Bitcoin purchase with $4,000.\n\nAD\n\nAD\n\nThere is! It’s called a futures contract. A futures contract is an agreement between two traders that obligates a trader to buy or sell an asset at a specific time, quantity and price. For example, you might enter an agreement in mid-March to buy one Bitcoin for $4,000 for August 30. You could also be on the other side of the deal, agreeing to selling a Bitcoin for a fixed price. If you’re a buyer, you want the trading price of Bitcoin to go up, as you will be able to buy the cryptocurrency at below market value, while sellers want the opposite, profiting if Bitcoin were to decrease in price.\n\nFutures contracts and the evolution of asset classes\n\n\"Futures are an important part of the evolution of asset classes,\" Nick Cowan, CEO of the GSX Group, told Decrypt. \"They provide a benchmark—a Fair Value, or FV—of what the future value is, allowing arbitrage and liquidity to enter the market.\"\n\nDid you know? Futures contracts originated with 17th-century Japanese samurai, who were paid in rice but were out most of the year doing whatever it is that 17th-century samurai do. But they wanted to ensure that the rice they were paid in, say, February held its value until August, so they traded contracts that obliged the signee to pay out the equivalent amount of rice in August, regardless of its current value.\n\nThe reason why you might trade Bitcoin futures as opposed to just, say, buying lots of Bitcoin worth $4,000 at the time, is that you don’t have to hold them yourself. (Our Japanese samurai analogy is helpful here—the Japanese samurai traded futures contracts so they wouldn’t have to store the rice themselves).\n\nSome crypto exchanges, such as OKEx, have lower trading fees for futures contracts, which means that traders can squeeze a bit more out of their accounts by using futures.\n\nHow a trader exits their futures position\n\nNick Cowan, CEO of the GSX Group, told Decrypt: “BTC futures are a great way to bring in additional liquidity to the market and also provide great crypto arbitrage opportunities.” That’s because futures contracts are generally not held until their expiration date. Instead, they are traded like other assets. As the trading value of Bitcoin varies, so too will the value of different Bitcoin futures contracts.\n\nWhen entering a futures contract, there are three ways a trader can exit their position: offsetting, rollovers and expiry. Offsetting is the most common, and occurs when a trader creates another futures contract with an equal value and size, making their effective obligations zero as they balance out. Rolling over is done by offsetting a position, but with an expiry date that is further into the future. Expiry is what you’d expect: it’s when a contract reaches its end date and the parties who hold the contract buy or sell at the agreed price.\n\nAD\n\nAD\n\nFutures contracts and hedging\n\nAnother trading method for futures is hedging. Hedging is a way to reduce risk, which is useful for traders dealing with the volatility of cryptocurrencies.\n\nConsider a trader who just bought three Bitcoin at a $10,000 a pop:\n\n📈 She believes that the price of Bitcoin will rise by the end of the month, but wants to protect her position in case it goes down.\n\n📅 To protect her position, she can enter a futures contract to sell one Bitcoin for $10,000 at the end of the month.\n\n💰 At the end of the month, if Bitcoin has gone up, she will make a profit by selling the remaining two Bitcoin.\n\n📉 If it goes down, she will lose money, but this will be limited as she can still sell one Bitcoin for $10,000.\n\nHedging reduces a trader’s overall risk, although it does also limit their potential profits.\n\nThe pros and cons of Bitcoin futures\n\nFirst things first: Bitcoin futures are—by their very definition—speculative investments. In its decade-plus year history, Bitcoin has proven that the only constant is price volatility, and while the famed cryptocurrency might be on a bull run now, there’s no telling what tomorrow might bring for Bitcoin. If you speculate at the wrong time, you could be left stranded with a future asset that just isn’t worth it.\n\nThere’s also something to be said for being an experienced investor. To successfully utilize futures, an investor needs to understand market behavior, have enough knowledge to pay attention to reasonable market predictions, and enough sense to discard unfounded claims. Ultimately, Bitcoin futures are speculative, but it is possible to leverage good information on a best effort basis. Doing that, however, is not exactly easy, so one might argue that Bitcoin futures are not very accessible for the average person.\n\nThe inverse of this is that Bitcoin futures are a great way of getting ahead of a positive market price. If an investor times it right, there could, at least hypothetically, be major profit to be had by leveraging the Bitcoin Futures market.\n\nBitcoin futures also—counterintuitively—don't involve holding any Bitcoin whatsoever. Instead, it simply involves trading Bitcoin at a future, pre-agreed upon date, whatever the price at that time may be. Understanding the market might not be the most accessible task, but you don’t even need an ounce of technology to get involved, not even a Bitcoin wallet.\n\nCash settlements\n\nBitcoin futures are settled with cash. Because no active Bitcoin trading takes place in a futures market, agreements are satisfied by trading at future, pre-agreed prices. Another oft-cited advantage of the Bitcoin futures market is that the possibility of settling in cash means that no complex software or technological expertise is really necessary in order to get involved in this arena.\n\nAD\n\nAD\n\nMargin trading\n\nOne aspect of Bitcoin futures is margin trading, which essentially means that an investor only requires a percentage of a contract’s total in order to participate.\n\nLeveraging 10-20% of a Bitcoin future means that an investment has both a high potential for profit, but also for a loss.\n\nBitcoin futures: a note of caution\n\nThe world of Bitcoin futures isn’t all fun and games. Taking on a contract is a serious obligation, and if it reaches its expiry date, the trader has a legal obligation to fulfill it.\n\nFutures could lose you a lot of money, as you could be forced to buy Bitcoin way above its current trading price. Cryptocurrencies are one of the most volatile asset classes available; as with all cryptocurrencies, trading Bitcoin is very risky.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhvbGRzLXN0ZWFkeS1hcy1zLXAtNTAwLXBsdW5nZXMtdG8tMTEwLWRheS1sb3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price holds steady as S&P 500 plunges to 110-day low - Cointelegraph",
        "content": "On Sept. 20, the United States Federal Reserve delivered a message that reverberated through financial markets: Interest rates are expected to remain at their highest level in over two decades, possibly for longer than most market participants’ expectations. This attitude comes against the backdrop of stubbornly high inflation — with the core inflation rate hovering at 4.2%, well above the central bank’s 2% target — and unemployment at record lows.\n\nAs investors grapple with this new reality, a pressing question arises: Will the S&P 500 and Bitcoin (BTC) continue to underperform in the face of a tighter monetary policy?\n\nThe impact of the Fed’s decision was swift and severe. The S&P 500 plunged to its lowest level in 110 days, signaling growing unease among investors.\n\nS&P 500 index (blue, right) vs. U.S. 10-year Treasury yield (orange, left)\n\nNotably, the 10-year Treasury yield surged to levels not seen since October 2007. This movement reflects the market’s belief that rates will continue to climb or, at the very least, that inflation will eventually catch up with the current 4.55% yield. In either case, anxiety is mounting over the Fed’s ability to sustain these elevated interest rates without destabilizing the economy.\n\nBitcoin does not necessarily follow traditional markets\n\nOne intriguing development amid this financial turbulence is the apparent disconnect between the S&P 500 and cryptocurrencies, particularly Bitcoin. Over the past five months, the 30-day correlation between the two assets presented no clear trend.\n\n30-day rolling correlation: S&P 500 futures vs. Bitcoin/USD. Source: TradingView\n\nSuch divergence suggests that either Bitcoin has anticipated the stock market correction or external factors are at play. One plausible explanation for this decoupling is the hype surrounding the possible introduction of a spot Bitcoin exchange-traded fund and regulatory concerns that have hindered the upside potential of cryptocurrencies. Meanwhile, the S&P 500 has benefited from robust second-quarter earnings reports, though it’s essential to remember that those numbers reflect the situation from three months prior.\n\nAs the Fed holds firm on its commitment to high interest rates, the financial landscape is entering uncharted territory. While some may interpret the central bank’s stance as necessary to combat inflationary pressures, others worry that keeping rates elevated could burden families and businesses, particularly as existing loans come due and must be refinanced at significantly higher rates.\n\nA decoupling could favor Bitcoin price\n\nSeveral factors could lead to cryptocurrencies decoupling from traditional markets such as the S&P 500. If the government encounters difficulties in issuing longer-term debt, it can raise concerns. The failure to issue long-term bonds may indicate fiscal instability, which incentivizes investors to seek hedges against potential economic downturns. In such cases, alternative assets like gold and Bitcoin might become attractive options.\n\nRelated: Will Bitcoin price hold $26K ahead of monthly $3B BTC options expiry?\n\nEven with a strong dollar, inflation can force the U.S. Treasury to raise the debt limit, which leads to currency devaluation over time. This risk remains relevant as investors seek to safeguard their wealth in assets less susceptible to inflation.\n\nFurthermore, the state of the housing market plays a pivotal role. Should the housing market continue to deteriorate, it could negatively impact the broader economy and the S&P 500. The housing market’s interconnectedness with the banking sector and the potential for consumer credit deterioration could trigger a flight to assets with scarcity and hedging capabilities.\n\nThere’s also the potential for political instability, globally or even during the U.S. elections in 2024. This could introduce uncertainty and impact financial markets. In some countries, there is a growing fear of capital controls, and historical instances of international economic embargoes highlight the risk of governments imposing such controls, further driving investors toward cryptocurrencies.\n\nUltimately, unlike traditional stocks and bonds, cryptocurrencies are not tethered to corporate earnings, growth or yield above inflation. Instead, they march to their own drumbeat, influenced by factors like regulatory changes, resilience to attacks and predictable monetary policy. Thus, Bitcoin could vastly outperform the S&P 500 without needing any of the scenarios discussed above.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzI3L2JpdGNvaW5zLWVjby1mcmllbmRseS1ldm9sdXRpb24tYS13aW4td2luLWZvci10aGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin's Eco-Friendly Evolution: A Win-Win for the Environment and Investors - The Motley Fool",
        "content": "There's no denying that the process of mining Bitcoin (BTC -1.19%) consumes a significant amount of energy. If the cryptocurrency were a country, it would consume the 32nd most electricity in the world -- ahead of large countries like Argentina, The Netherlands, and other highly developed nations with populations in the tens of millions.\n\nEnvironmentalists often use statistics like these to portray Bitcoin as a gluttonous and unnecessary nuisance that generates huge amounts of carbon emissions and exacerbates global climate change. Yet these comparisons fail to paint the complete picture of Bitcoin's energy consumption.\n\nLike many industries, Bitcoin mining is working to reduce its carbon footprint, and its miners increasingly utilize renewable energy sources. Based on the current trajectory, Bitcoin has the potential to reach net-zero emissions and eventually even take on a more proactive approach by combating climate change.\n\nBut don't just take my word for it.\n\nBitcoin goes green\n\nIn a recently published report, the Massachusetts Institute of Technology highlighted how new energy strategies among Bitcoin mining companies are turning the narrative of Bitcoin's negative impact on the environment on its head.\n\nThe report describes how Bitcoin miners are constantly searching for the cheapest and most readily available forms of energy to power their machines and minimize their expenses, a dynamic that underpins Bitcoin's evolution toward becoming more environmentally friendly.\n\nThe MIT researchers note that as costs associated with electricity produced from fossil fuels continue to rise, miners have begun shifting toward renewable energy sources such as wind and solar to power their operations, since electricity from those sources is becoming cheaper and more accessible. Today, more than 50% of the Bitcoin mining sector is estimated to run off renewable energy sources.\n\nPutting unused energy to work\n\nArguably, the most interesting topic discussed in MIT's report was Bitcoin's potential role in cleaning up emissions from notorious polluters in the natural gas and oil industries.\n\nDue to a lack of appropriate distribution infrastructure, oil and natural gas companies are frequently forced to burn or \"flare\" off excess natural gas that they are unable to transport from wellheads to markets. While clearly wasteful, this practice also creates an additional problem. The flaring of natural gas also releases methane into the atmosphere -- and methane's impacts as a greenhouse gas are over 80 times more potent than carbon dioxide's in terms of warming effects.\n\nThis previously unused natural gas can be an ideal and cost-effective energy source to power Bitcoin mining operations. The energy producers have come to recognize this, and now companies like ExxonMobil are setting up systems to capture that natural gas at the source and generators to burn it on-site, with the electricity generated powering Bitcoin mining equipment that is also on-site, producing additional revenue.\n\nMIT researchers suggest a similar strategy could be employed at the millions of abandoned and orphaned oil and natural gas wells around America that are still leaking methane into the atmosphere. By constructing operations at these locations, Bitcoin miners could have convenient access to inexpensive energy, reduce greenhouse gas emissions, and even fund well-sealing efforts.\n\nAppealing to institutional investors\n\nSo, Bitcoin is becoming greener and can help climate change by utilizing previously wasted energy. This is obviously beneficial, but how does it help Bitcoin's value appreciate?\n\nWell, the answer lies in a similar report published by KPMG, one of the Big Four international accounting firms. In its analysis, KPMG analysts describe how Bitcoin positively contributes to the three pillars of the increasingly popular ESG investing framework as it heads toward net-zero emissions.\n\nShort for environmental, social, and governance, ESG ratings measure a company's or asset's sustainability and ethical impact. ESG-compliant investment strategies have gained significant traction in recent years, particularly among institutional investors.\n\nIn line with MIT's report, KPMG found that Bitcoin's ability to recycle unused energy and clean up emissions helps it meet the standard of a positively rated ESG asset. Should Bitcoin solidify an ESG-friendly reputation, it could become a more attractive investment option for institutional investors.\n\nClosing thoughts\n\nAlthough the improvements to Bitcoin's carbon footprint and its potential to contribute to climate change mitigation have attracted less coverage than the earlier discussions about its negative environmental impact received, circumstances are slowly changing. With two prominent organizations acknowledging that Bitcoin is no longer as much the electricity-hungry climate detriment it is often portrayed as, the cryptocurrency might be turning over a new leaf.\n\nAs the conversation around Bitcoin's environmental sustainability gains momentum, another barrier hindering widespread adoption will likely begin to dissipate. Most importantly, though, investors stand to benefit as this could lead to more demand for the crypto, resulting in even higher prices."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzI4L2JlZm9yZS15b3UtaW52ZXN0LWluLWJpdGNvaW4tbWluaW5nLXN0b2Nrcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Want to Buy a Bitcoin Mining Stock? Read This Before You Invest. - The Motley Fool",
        "content": "Bitcoin (BTC -1.43%) mining companies are some of the best-performing stocks of the year. Top Bitcoin miner Riot Platforms (RIOT -6.39%) is up a dizzying 172% year to date. Marathon Digital Holdings has gained 153%. And shares of eco-friendly Bitcoin miner CleanSpark is up by a head-turning 92%. So it's no surprise that investors are scooping up these mining stocks as a way to pump up their portfolio returns.\n\nBut there might be a better way to get access to the Bitcoin mining sector, and that's through an exchange-traded fund (ETF). The one ETF that I have in mind is the Valkyrie Bitcoin Miners ETF (WGMI -6.83%). This specialized fund invests 80% of its net assets in companies that derive at least one-half of their revenue or profits from Bitcoin mining, or that provide specialized chips, hardware, software, and services to Bitcoin mining companies.\n\nDiversification benefits\n\nInstead of trying to choose a winner in the hyper-competitive Bitcoin mining sector, it could make sense to invest in an ETF that covers the broader Bitcoin mining market. That way, you get access to a wide range of Bitcoin miners without being overexposed to any particular stock. Moreover, you can gain access to the companies that are selling the \"picks and shovels\" to the Bitcoin miners without having to invest in them directly.\n\nAs of Sept. 22, the Valkyrie Bitcoin Miners ETF held stakes in 21 companies. The largest holdings include several pure-play Bitcoin mining stocks: Riot Platforms (10.6%), CleanSpark (10.2%), and Marathon Digital Holdings (9.8%). In addition, the ETF holds smaller stakes in several other Bitcoin mining stocks, including Hut 8 Mining (4.7%), HIVE Technologies (4.8%), and Terawulf (5%). Thus, approximately one-half of the ETF's holdings are in the largest Bitcoin mining stocks.\n\nBut what's most interesting is what else the fund holds. For example, it holds a 10.5% position in Iris Energy, which builds, owns, and operates data centers and infrastructure for the mining of Bitcoin. And it holds a 9.4% stake in Cipher Mining, a company dedicated to expanding and strengthening Bitcoin's critical infrastructure in the U.S. The fund also holds much smaller positions in top tech names such as Nvidia (4.8%), AMD (1.2%), Samsung (1.2%), and Taiwan Semiconductor Manufacturing (1.2%).\n\nPotential trade-offs\n\nThe trade-off for diversification, though, is returns well below the hottest single stocks. While the Valkyrie Bitcoin Miners ETF is now the top-performing ETF through the first nine months of the year, its performance doesn't come anywhere close to that of star performer Riot Platforms. The Valkyrie Bitcoin Miners ETF is up 110% for the year, but Riot is up by 172%. Thus, you are definitely sacrificing some return on your investment in exchange for all of the diversification benefits you are getting.\n\nIn addition, it needs to be pointed out that with an ETF, you are paying a management fee for the portfolio rebalancing that needs to occur on a regular basis. Currently, the expense ratio for the Valkyrie Bitcoin Miners ETF is 0.75%, which is generally considered to be a good ETF expense ratio. However, every dollar paid out in management fees is a dollar whose value is not compounded over the long haul.\n\nFrom my perspective, though, the trade-off between diversification and returns is one worth taking. For one, it makes my job as an investor much easier. Instead of having to compare each Bitcoin mining stock against the other in order to find the \"winner,\" I can simply buy one fund and let it do all the heavy lifting. All I have to do is find a fund that invests in several of the top Bitcoin mining stocks.\n\nMoreover, the broad diversification of an ETF that holds 20 different companies means that I am much more protected from the downside of a crypto bear market. In 2022, for example, Bitcoin lost 65% of its value and Bitcoin mining stocks went along for the ride. So you definitely want some downside protection in order to smooth out your annual returns. Because the ETF holds tech companies that are only tangentially related to Bitcoin mining, you are basically getting insurance that you won't lose as much as if you were holding just a single Bitcoin mining stock.\n\nDiversification reduces risk\n\nIf you are new to crypto investing, diversification could be a great way to reduce your risk. By holding a basket of Bitcoin miners, instead of just the \"best\" Bitcoin miner, you get access to more diversification as well as protection against a crypto downturn. You lose some upside, but you're not forced into picking a winner.\n\nSo the next time you are thinking about investing in a Bitcoin mining stock, consider the alternatives. If you are risk-averse, new to crypto, or unwilling to manage your portfolio actively, a fund like the Valkyrie Bitcoin Miners ETF could be a great option."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhhbHZpbmctZWZmaWNpZW50LWJ0Yy1taW5pbmctY29zdHMtMzBr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin halving to raise 'efficient' BTC mining costs to $30K - Cointelegraph",
        "content": "Bitcoin (BTC) Ordinals are boosting miner profits, but “income stress” is looming, new research warns.\n\nIn the latest edition of its weekly newsletter, “The Week On-Chain,” analytics firm Glassnode predicted fresh problems for miners after Bitcoin’s next block subsidy halving.\n\nBitcoin halving impact on miners could be “severe”\n\nBitcoin miner competition is exploding, with hash rate — the estimated combined processing power deployed to the blockchain — at record highs.\n\nFor Glassnode, this indicates unprecedented conditions for miners trying to eke out a living at current BTC price levels.\n\nOrdinal inscriptions are helping, with these acting as “packing-filler” which turns empty blockspace into a source of revenue for miners.\n\n“Naturally, as blockspace demand increases, miner revenues will be positively affected,” it wrote.\n\nBitcoin Mean Hash Rate (7-day moving average) chart (screenshot). Source: Glassnode\n\nThe proportion of income received from fees has increased between 1% and 4% compared to lows seen during Bitcoin bear markets, but by historical standards remains modest.\n\n“Meanwhile, the amount of hashrate competing for these rewards has increased by 50% since February, as more miners, and newer ASIC rigs are established and come online,” “The Week On-Chain” notes.\n\nThis hash rate spike is laying the foundation for an upcoming showdown. In April 2024, miner rewards per block will drop 50%, doubling the so-called “production cost” per BTC. Currently around $15,000, this will pass $30,000 — above the current spot price.\n\nGlassnode presented two models for estimating the price at which miners, on aggregate, fall into the red, with the above comparing issuance to mining difficulty.\n\n“By this model, we estimate that the most efficient miners on the network have an acquisition price of around $15.1k,” researchers explained.\n\n“However, the purple curve shows the post-halving ‘doubling’ of this level to $30.2k, which would likely put the majority of the mining market into severe income stress.”\n\nBitcoin Difficulty per Issuance Pricing Model (screenshot). Source: Glassnode\n\nA previous model put the average miner acquisition price at $24,300 per Bitcoin — around 8% below spot as of Sept. 28.\n\nBitcoin Difficulty Regression model (screenshot). Source: Glassnode\n\nBTC price incentives\n\nOthers are more optimistic about how miners will handle the build-up to the halving.\n\nRelated: Bitcoin exchange volume tracks 5-year lows as Fed inspires BTC hodling\n\nIn an interview with Cointelegraph this month, analyst Filbfilb, co-founder of trading suite DecenTrader, reiterated that miners would up BTC accumulation in advance of the event.\n\n“Miners are incentivized to ensure that prices are well above marginal cost prior to the halving,” he wrote in an X (formerly Twitter) thread in August.\n\n“Whether they collude consciously, or not they are collectively incentivized to send prices higher before their marginal revenue is effectively halved.”\n\nBTC/USD chart with miner accumulation data. Source: Filbfilb/X\n\nAssisting BTC supply dynamics will be what Filbfilb calls smart money “buying the rumor” over the halving and its own impact on the amount of BTC being minted.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXhhcy1ob21lLW5lYXJseS0zMC1wZXJjZW50LWJpdGNvaW4taGFzaC1yYXRlLWZvdW5kcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Texas is home to nearly 30% of all Bitcoin hash rate — Foundry - Cointelegraph",
        "content": "The U.S. state of Texas accounts for over 28% of all Bitcoin (BTC) hashing power in the United States, according to the latest Hashrate Map by crypto mining service provider Foundry USA.\n\nThe newly updated map shows Texas with 28.5% of all the country’s Bitcoin hash rate, followed by Georgia claiming 9.64% of the hash rate, New York with 8.75% and New Hampshire accounting for 5.33%. Bitcoin’s hash rate represents how fast a mining machine operates when trying to calculate a valid block hash.\n\nA snapshot of Foundry’s pool in December 2021 shows a different picture. Texas controlled 8.43% of the country’s hash rate at the time, while Georgia had 34.17%. Meanwhile, Kentucky stood at 12.40%, and New York held 9.53%. Compared with 2021, more U.S. states are mining Bitcoin in 2023.\n\nOverall, by July 2023, the Bitcoin global hash rate had reached 400 exahashes per second (EH/s), nearly twice as high as at the end of 2021, when it stood at 174 EH/s, said Foundry.\n\nHash rate map in July 2023. Source: Foundry USA\n\nThe data was pulled between July 21–27, 2023, when Texas faced power curtailment. According to the report, the data captured during curtailments means that the Texas hash rate may be “higher than what’s reported on the map.”\n\nDuring power curtailment, Bitcoin miners lower their production to balance energy supply and demand in the grid. Essentially, it is a way to balance energy consumption during peak times. In Texas, a program grants large energy consumers, such as Bitcoin miners, incentives for being flexible with energy use.\n\nRiot Platforms is one Bitcoin miner participating in Texas’ curtailment program. In August, the company mined fewer Bitcoin than in July but received over $31 million in power credits from the state.\n\nTexas has been evolving as a hub for crypto mining thanks to its cheaper energy and welcoming regulatory framework. According to data from the Energy Information Administration, the state’s electricity prices are below the U.S. average.\n\nAs of January 2023, Texas’ average residential electricity tariff was $0.14 per kilowatt-hour (kWh), an 8.3% discount compared with the national average of $0.15 per kWh. The costs are even lower for large consumers like crypto miners.\n\nThe state became a hotbed for large mining operations following China’s crackdown on crypto mining in 2021.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdGhlLWxpZ2h0bmluZy1uZXR3b3JrLW1ha2VzLWJpdGNvaW4tdW5zdG9wcGFibGU6LWJpdGNvaW4tYmFja3N0YWdlLXdpdGgtZGF2aWQtbWFyY3Vz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "The Lightning Network Makes Bitcoin Unstoppable: Bitcoin Backstage with David Marcus - Nasdaq",
        "content": "One of the biggest challenges Bitcoin faces is scalability. Transactions can be slow and costly, making mainchain settlement less efficient for everyday transactional use. Enter the Lightning Network, an innovative solution that has the potential to make Bitcoin unstoppable. In the latest episode of Bitcoin Backstage, we explore the concept behind the Lightning Network, its role in Bitcoin's growth, the involvement of David Marcus with LightSpark, and the unstoppable nature of Bitcoin itself.\n\nUnderstanding the Lightning Network\n\nBefore we delve into the incredible impact the Lightning Network has had on Bitcoin, it is essential to understand how it works. The Lightning Network is a second-layer, off-chain scaling solution built on top of the Bitcoin blockchain. It addresses the scalability issue by enabling faster and cheaper transactions. The Lightning Network has revolutionized the way Bitcoin transactions are conducted.\n\nThe Concept Behind the Lightning Network\n\nThe Lightning Network operates by creating payment channels between two parties, allowing them to transact without broadcasting every transaction to the blockchain. These channels are then connected to form a vast network, enabling payments to be routed through multiple nodes securely and efficiently.\n\nHow the Lightning Network Enhances Bitcoin\n\nThe Lightning Network enhances Bitcoin by significantly reducing transaction fees and speeding up settlment times. With the Lightning Network, users can make near-instantaneous transactions, making it ideal for micropayments and everyday transactions. This scalability solution opens up new possibilities for Bitcoin to be used as a medium of exchange, similar to traditional currencies.\n\nBefore the Lightning Network, Bitcoin faced challenges in terms of scalability. As the number of users increased, the Bitcoin blockchain became congested, resulting in high transaction fees and slower confirmation times. This made it impractical for small-value transactions and hindered Bitcoin's potential as a widely accepted form of payment.\n\nHowever, with the Lightning Network, these limitations are overcome. By conducting transactions off-chain, the Lightning Network relieves the majority of the burden on the main blockchain, allowing for faster and cheaper transactions. This scalability solution has made Bitcoin more accessible and practical for everyday use.\n\nThe Lightning Network has also sparked innovation in the Bitcoin ecosystem. Developers are now creating applications and services that leverage the Lightning Network's capabilities, such as instant payment processors, decentralized exchanges, and microtransaction platforms. These developments are expanding the use cases of Bitcoin and driving its adoption.\n\nThe Lightning Network has revolutionized the Bitcoin landscape by providing a scalable and efficient solution for transactions. Its concept of payment channels and off-chain transactions has opened up new possibilities for Bitcoin to be used as a medium of exchange. As the Lightning Network continues to evolve, we can expect even more exciting developments in the world of Bitcoin.\n\nDavid Marcus: A Key Player in Bitcoin's Evolution\n\nLet's take a closer look at David Marcus's role in the Bitcoin ecosystem and his vision for its future.\n\nMarcus's Vision for the Future of Bitcoin\n\nAs a prominent figure in the financial technology world and the Co-Founder and CEO of LightSpark, David Marcus has been vocal about his optimism for Bitcoin and its underlying technology. He believes that the Lightning Network has the potential to unlock new possibilities for Bitcoin, making it more accessible and efficient for global transactions. Marcus envisions a future where Bitcoin becomes a mainstream medium of exchange, providing financial inclusion to the unbanked and revolutionizing cross-border payments.\n\nThe Unstoppable Nature of Bitcoin\n\nFactors Making Bitcoin Unstoppable\n\nBitcoin's decentralized nature, robust blockchain technology, and scarce supply all contribute to its resilience and immutability. These factors make it highly resistant to censorship and external control, making it a truly people-centric currency.\n\nThe Role of the Lightning Network in Bitcoin's Unstoppability\n\nThe Lightning Network strengthens Bitcoin's unstoppable nature by introducing a layer of trustless, decentralized payment channels. By utilizing these channels, Bitcoin transactions occur off-chain, making them less susceptible to network congestion, censorship, and high fees. The Lightning Network ensures that Bitcoin retains its unstoppable nature on a global scale.\n\nLooking Ahead: The Future of Bitcoin and the Lightning Network\n\nThe Lightning Network's Potential Impact on Cryptocurrency\n\nThe Lightning Network sets a precedent for scalability solutions on Bitcoin. Its success demonstrates the feasibility of off-chain payment channels, inspiring innovation and development within the Bitcoin ecosystem.\n\nThe Lightning Network has emerged as a game-changer for Bitcoin, addressing its scalability challenges and propelling it towards mainstream adoption. With its potential to make transactions faster, cheaper, and more efficient, the Lightning Network is instrumental in making Bitcoin unstoppable. Combined with visionaries like David Marcus, Bitcoin's future looks bright, with the unstoppable nature of this revolutionary cryptocurrency set to transform the way we transact and interact with money.\n\nNews Recap of the Week (9/22/2023)\n\nAnti CBDC Bill\n\nThe First Anti-CBDC [Central Bank Digital Currency] Bill in the USA was passed out of the Financial Services Committee. The Bill was brought up by whip Tom Emmer. This bill prevents the Federal Reserve from issuing a CBDC directly or indirectly to individuals or maintaining accounts on behalf of individuals. This is to thwart the ever expanding digital surveillance state that has been plaguing the world.\n\nFree Julian Assange\n\nThis week a cross-party delegation of Australian Politicians met with US officials, members of congress, and civil rights groups to urge the US government to abandon efforts to prosecute Wikileaks' Founder Julian Assange who is being accused of leaking classified US military documents. He is facing up to 175 in an American high security prison. What happened to freedom of press?\n\nNigeria is Bullish on Bitcoin\n\nCryptocurrency usage is growing as the country of Nigeria grapples with a weakening currency and soaring inflation. Nigeria’s volume of crypto transitions has grown 9% year-over-year to over 56.7 billion dollars between July 2022 and July 2023.\n\nEurope tightens its grip on Crypto\n\nEurope plans to tighten its grip on crypto in 2026. European Union's eighth version of the directive on administrative cooperation or the DAC8 law will come into full force. This law is designed to help EU tax authorities track digital asset transactions and any efforts made trying to reduce potential tax fraud and evasion.\n\nStanford University returns money\n\nStanford University will return the $5.5M in donations from Sam Bankman-Fried’s FTX. This donation was done directly by Joe Bankman, Sam’s father and a long time faculty member at Stanford. The same man who was unhappy with his compensation at FTX, triggering an email to SBF asking for more money, pulling the ‘I am telling your mother’ while CC’d Sam’s mom Barbara.\n\nUS hits new milestone\n\nThe US has officially hit a new milestone of gross national debt just passed $33 Trillion dollars meaning it has spiked $1.58 Trillion since the debt ceiling was lifted in June.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTI2ay1tb250aGx5LTMtYmlsbGlvbi1idGMtb3B0aW9ucy1leHBpcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Will Bitcoin price hold $26K ahead of monthly $3B BTC options expiry? - Cointelegraph",
        "content": "The upcoming $3 billion in Bitcoin (BTC) monthly options expiration on Sept. 29 could prove pivotal for the $26,000 support level.\n\nBTC price faces serious headwinds\n\nOn one side, Bitcoin’s recognition in China appears to be strengthening, following a judicial report from a Shanghai Court that acknowledged digital currencies as unique and non-replicable.\n\nConversely, Bitcoin’s spot exchange trading volumes have dwindled to a five-year low, according to on-chain analytics firm CryptoQuant. Analyst Cauê Oliveira pointed out that a significant factor behind this decline in trading activity is the growing fear surrounding the macroeconomic outlook.\n\nDespite the increase in long-term holders, the reduced trading volume poses a risk in terms of unexpected volatility. This means that price swings resulting from liquidations in derivative contracts could potentially cause structural market damage if there aren’t enough active participants.\n\nFurthermore, there is growing unease among traditional financial institutions when it comes to handling crypto-related payments.\n\nJPMorgan Chase, the largest bank in North America, is reportedly prohibiting transfers “related to crypto assets” within its retail division, Chase. The stated rationale is to protect against potential involvement in fraudulent or scam activities.\n\nLastly, Bitcoin holders are feeling apprehensive as the Dollar Strength Index (DXY), a measure of the dollar’s strength against other currencies, reached 106 on Sept. 26, its highest level in 10 months.\n\nHistorically, this index exhibits an inverse correlation with risk-on assets, tending to rise when investors seek safety in cash positions.\n\nBitcoin bulls too optimistic?\n\nThe open interest for the Sep. 29 options expiration currently stands at $3 billion. However, it is expected that the final amount will be lower due to bullish expectations of Bitcoin’s price reaching $27,000 or higher.\n\nThe unsuccessful attempt to break above $27,200 on Sept. 19 may have contributed to overconfidence among Bitcoin investors.\n\nThe 0.58 put-to-call ratio reflects the imbalance between the $1.9 billion in call (buy) open interest and the $1.1 billion in put (sell) options.\n\nHowever, if Bitcoin’s price remains near $26,300 at 8:00 am UTC on Aug. 25, only $120 million worth of the call (buy) options will be available. This difference happens because the right to buy Bitcoin at $27,000 or $28,000 is useless if BTC’s price is below this level on expiry.\n\nBitcoin bears eye sub-$26,000 for max profit potential\n\nBelow are the four likeliest scenarios based on the current price action. The number of options contracts available on Sept. 29 for call (buy) and put (sell) instruments varies depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit.\n\nThis crude estimate disregards more complex investment strategies. For instance, a trader could have sold a call option, effectively gaining negative exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nBetween $25,000 and $26,000: 1,400 calls vs. 19,300 puts. The net result favors the put instruments by $430 million.\n\n1,400 calls vs. 19,300 puts. The net result favors the put instruments by $430 million. Between $26,000 and $27,000: 6,200 calls vs. 12,600 puts. The net result favors the put instruments by $170 million.\n\n6,200 calls vs. 12,600 puts. The net result favors the put instruments by $170 million. Between $27,000 and $27,500: 9,900 calls vs. 10,100 puts. The net result is balanced between call and put options.\n\n9,900 calls vs. 10,100 puts. The net result is balanced between call and put options. Between $27,500 and $28,000: 12,000 calls vs. 8,900 puts. The net result favors the call instruments by $85 million.\n\nIt’s worth noting that for the bulls to level the playing field ahead of the monthly expiration, they need to achieve a 3.2% price increase from $26,200. In contrast, the bears only need a modest 1% correction below $26,000 to gain a $430-million advantage on Sept. 29.\n\nRelated: Crypto bills could be delayed as many prepare for US gov’t shutdown\n\nGiven that Bitcoin traded below the $26,000 support level between Sept. 1 and Sept. 11, it wouldn’t be surprising if this level were breached again as the options expiration approaches. Moreover, investor sentiment is becoming increasingly risk-averse, as evidenced by the S&P 500 dropping to its lowest level since June.\n\nConsequently, unless there is significant news or an event that strongly favors Bitcoin bulls, the likelihood of BTC’s price breaking below $26,000 by Sept. 29 remains high.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA5LzI3L2JpdGNvaW4tbWluZXItbWFyYXRob24tcmVwb3J0ZWRseS1taW5lcy1pbnZhbGlkLWJ0Yy1ibG9jay_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOS8yNy9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLXJlcG9ydGVkbHktbWluZXMtaW52YWxpZC1idGMtYmxvY2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Marathon Confirms Mining Invalid BTC Block Due to a Bug - CoinDesk",
        "content": "The miner confirmed the mining of the invalid block on social media platform X (formerly Twitter), citing a bug during an experiment. \"We utilize a small portion of our hash rate to experiment with our development pool and research potential methods to optimize our operations,\" Marathon said. \"The error was the result of an unanticipated bug that came from one of our experiments,\" the company added."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvbWluZWNyYWZ0LWJhbnMtYml0Y29pbi1wbGF5LWVhcm4taXBob25lLTE1LWNyeXB0by1nYW1pbmctZm9ybXVsYWUtcHJldmlldy13ZWIzLWdhbWVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Minecraft bans Bitcoin P2E, iPhone 15 & crypto gaming, Formula E: Web3 Gamer - Cointelegraph",
        "content": "Pull your sats out of Minecraft now\n\nBack in our July edition, we announced Satlantis, an independent Minecraft server run by the game’s fans, enabled players to earn Bitcoin by completing in-game quests using play-to-earn functionalities. We noted Minecraft developer Mojang’s previous NFT ban and concluded, “Time will show how this integration fairs against the ban.”\n\nTime has shown, as Microsoft subsidiary Mojang has asked Satlantis to remove the play-to-earn features, according to a Discord post by server founder David Dineno. The server accepted the request and removed the feature two days after the Discord post.\n\nThe Satlantis founder stood behind the play-to-earn model and expressed his annoyance with the situation, stating:\n\n“The Game That Shares its Profits with Players’ works. And it works well. All of the time, money, and energy that we put into this game together will not be forsaken by a few dinosaurs at some conglomerate.”\n\nDespite the setback, the Satlantis community can take solace in the fact that the team is actively exploring alternative platforms that “encourage innovation instead of stifling it.”\n\nThe community of Satlantis backed their platform and shared their disappointment in Mojang (and Microsoft, indirectly) through social media platforms:\n\n@Microsoft Since yesterday I hate Microsoft for not allowing play to earn on the minecraft server satlantis. This was the first time small money making was fun in a way that wasn't exploitative.\n\nI love the very helpful satlantis community. The best ones out there! @PlaySatlantis — 2Maique (@2Maique) September 24, 2023\n\nDineno advised players to withdraw their satoshi, emphasizing they will be diligently processed. Satlantis developers pledged to honor all in-game assets, including sats, prize pools, ASICs, players’ premium battle pass status and all other transferable data. The Minecraft server will remain operational, albeit without its play-to-earn features, as the team aims for a seamless transition to the next gaming frontier.\n\nHow can blockchain build upon eSports?\n\nBlockchain-based online gaming hub Ultra co-CEO and co-founder Nicolas Gilot says that eSports are struggling to generate profits, and a change of direction is needed.\n\n“In my view, it can create a better, more sustainable product for viewers and sponsors by broadening participation beyond the elite level,” he told Web3 Gamer.\n\nWeb3 gaming arguably needs a solid eSports foundation to reach the mainstream audience.\n\nThe Ultra team recently attended the major gaming conference Gamescom, where Gilot reports that interest from game developers and publishers, eSports organizations and investors was high as the video game industry seeks new ways to stay afloat during challenging times.\n\nBlockchain can act as the glue that binds all parties together, Gilot says. Without it, smaller teams, events and sponsorships won’t be as viable.\n\nSmart contracts can remove much of the admin burden, distribute prizes and earnings, and give confidence to publishers, brands and influencers to get involved at all levels.”\n\nUltra’s eSports hub, Ultra Arena, is designed to help more gamers attract sponsors earlier and move up the ranks as they grow and improve, Gilot noted. “The Ultra blockchain also helps by building a player persona across all areas — not just competitive gaming but how they buy games and digital collectibles and interact with others in-game.”\n\nWeb3 Gamer: Mainstream eSports has shiny stages and massive marketing budgets. There are commentators, pre-game shows, and physical places and streams for the fans to watch the games live. How do you compete?\n\nGilot: We don’t want to! We want to see players who level up through Ultra Arena take the stage at those massive LAN events, which will be a proud moment for all of us.\n\nWhat we do want is to feed into those experiences, helping grow the existing scene by opening it up to many more players, brands and publishers. For teams and brands, Ultra Arena will nurture more esports fans and provide more ways to activate fans pre and post-event with the help of blockchain technology. This could be unlocking access to an exclusive in-game digital collectible through attending the event itself or sponsor-branded skin being airdropped to you for watching on Twitch. Extending fan engagement will ultimately add value for all key stakeholders and support the journey to sustainable profitability.\n\nWeb 3 Gamer: Is there enough traction and interest on Web3 for a competitive stage that can make mainstream players willing to spend money?\n\nFor us, it’s not about how to make esports out of Web3 games, it’s more about how Web3 technology can be used to improve the existing esports model. It’s the game, not the tech, that should be front and center.\n\nThe current eSports model is probably overly reliant on sponsorship and advertising. To improve it, there needs to be a focus on cross-industry value creation, directly involving publishers, brands, esports teams and competitive players. Within Ultra Arena, we want to drive mutual growth by opening up the existing model to many more stakeholders, with grassroots competitive players turning pro, smaller brands gaining traction and startup teams becoming massive eSports powerhouses.\n\nApple iPhone 15: What does it offer for Web3 gaming?\n\nWhen technology companies run out of innovation juice, the first instinct is to hop on the gaming train. Apple made no exception when it unveiled the brand-new iPhone 15 and iPhone 15 Pro. The devices are pretty much the same as their 14th-generation counterparts, with an A17 Pro chip, the usual camera enhancements and a coat of new paint … but there is one significant difference.\n\nApple iPhone 15 Pro will be available with four new color options. (Apple)\n\nThe iPhone 15 Pro can run demanding game titles such as Resident Evil 4 (2023), Resident Evil Village, Death Stranding and the soon-to-come Assassin’s Creed Mirage natively, meaning the games run directly on the device’s system without any external layers.\n\nThe new pro model features hardware-accelerated ray tracing, which enables games to present dynamic lighting effects. Thanks to Apple’s scaling solution MetalFX, the iPhone 15 Pro can offer better graphics with little performance loss.\n\nThe new smartphone, which will act as a handheld gaming device, will be able to display games on 4K monitors through upscaling and support third-party gamepads such as PlayStation’s DualSense controller, which is already being sold at Apple Stores. The possibilities are endless with the addition of Apple’s upcoming VR headset.\n\nAll in all, it’s clear that the newly introduced Apple iPhone 15 Pro line will become a gaming powerhouse more than anything. The real question is how Web3 game developers can benefit from such advantages.\n\nDevelopers can utilize the mighty system of the device to make mobile games with better graphics and more comprehensive gameplay. Web3 games on PC will also be easier to port over as features and graphics won’t have to be excised for better performance on mobile platforms.\n\nHardware is one thing, but economics is another. Currently, Apple has stringent rules for NFT apps that practically force users to go through in-app purchases subject to Apple’s 30% commission, while apps are not permitted to support crypto payments.\n\nIt’ll be interesting to see what Web3 gaming companies come up with on the new monster iPhone. The tools are there for developers to leverage; let’s hope they fully utilize them to give us great Web3 experiences.\n\nOh, I nearly forgot the most revolutionary addition: The models come with USB-C.\n\nFormula’s second swing in Web3\n\nFormula’s first attempt at Web3 gaming didn’t work out as F1 Delta Time, a pioneering racing game and one of the first licensed titles utilizing NFTs and crypto technology, ceased operations in March 2022. After warming up in the formation lap with its first Web3 game, Formula is ready to return to the blockchain circuits with Formula E: High Voltage.\n\nFormula E: High Voltage promotional artwork. (Formula E: High Voltage)\n\nDeveloped by Animoca Brands, the new Formula game focuses on Formula E, a motorsport championship with fully electric-powered race cars, instead of Formula 1’s models. Players are put in the shoes of a team principal responsible for their Formula E team’s strategic decisions and management with the ambition to become champions.\n\nVarious factors will determine your team’s performance, such as racetrack distance, difficulty, weather and temperature. Official Formula E racetracks in Berlin, New York, Rome, London, Jakarta, Seoul, Cape Town and Diriyah will be included, with more to be added later.\n\nRace cars and drivers are available as nonfungible tokens, with each driver possessing distinctive abilities from a pool of over 200 unique skills.\n\n🏁🎮⚡️EARLY ACCESS IS NOW OPEN!⚡️🎮🏁\n\n\n\nGo to https://t.co/HoSlvc0xSP to create your account and register below! 400,000 pool of @REVV_Token available for winners! 👀\n\n\n\n📢REGISTER HERE: https://t.co/hIWA3lHi1T\n\n\n\nNew wallets added every 24 H – 10AM UTC! (registration closes 9AM UTC) pic.twitter.com/eFlA2LfufG — Formula E: High Voltage (@FormulaE_HV) September 19, 2023\n\nFormula E: High Voltage is available on early access until Oct. 2. Will Formula E: High Voltage take pole position among Web3 racing games? We’ll have to wait and see.\n\nGods Unchained Launches New Mode\n\nThe free-to-play Web3 trading card game Gods Unchained has launched a new permanent game mode called Sealed Mode, where players will build a deck from a randomized pool of cards to triumph over each other. The idea is similar to that of FIFA Ultimate Team’s Draft mode.\n\n⚜️ 𝗦𝗘𝗔𝗟𝗘𝗗 𝗠𝗢𝗗𝗘 𝗜𝗦 𝗟𝗜𝗩𝗘! ⚜️\n\n\n\nDiscover a brand-new way to play Gods Unchained! ✨\n\n\n\n🎴 Build your best deck from a random card pool\n\n⚔️ Compete in a challenging gauntlet run\n\n🏆 Win exclusive Sealed Mode rewards!\n\n\n\n🎮 Play Sealed Mode Now: https://t.co/oEkOFXw6vn pic.twitter.com/lUz5ktbyE0 — Gods Unchained (@GodsUnchained) September 14, 2023\n\nCommon card games are played with two players who have their own decks of cards that represent creatures and spells. Players take turns to strategically deploy their cards using resources. In order to win, players must reduce their opponent’s health to zero while protecting their own.\n\nSealed Mode begins as players pick one of the three Gods that represent the players, just like Heroes from Hearthstone. Once players pick their Gods, they receive a randomized pool of 60 cards. The goal is to craft a deck with at least 30 cards from these 60 while trying to combine cards that work well together to defeat other players.\n\nPlayers are given a pool of randomized cards in Sealed Mode. (Gods Unchained)\n\nOnce players finalize their decks, they take on other players in a series of games until they win seven times or lose three times. Winning more games earns players better rewards, like cards and cool cosmetic items. The rewards get better the more they win.\n\nSealed Mode rewards players when they win. (Gods Unchained)\n\nThe card collection in Sealed Mode includes cards from past Gods Unchained sets, including Welcome, Core, Genesis, Etherbots, Mortal Judgement, Winter Wanderlands and Band of the Wolf. Players who wish to play Sealed Mode are required to pay a fee of 15 GODS tokens, worth roughly $2.5.\n\nMore from Web3 gaming space:\n\n– PUBG developer Krafton introduces its upcoming metaverse project Overdare, previously known as Project Migaloo.\n\n— Leaked internal documents from May 2022 show that Microsoft’s Xbox roadmap included support for crypto wallets.\n\n– South Korean gaming conglomerate NHN Corporation ventures into the Web3 space in a partnership with Mysten Labs’ Layer 1 blockchain, Sui.\n\n– Proof of Play, an NFT gaming studio founded by the co-creators of FarmVille, completes a seed funding round with $33 million in investment.\n\n– Free-to-play battle royale game My Pet Hooligan launches in early access on the Epic Games Store.\n\n– My Pet Hooligan developer AMGI Studios signs a 12-month deal with Amazon Prime Gaming.\n\n– Star Atlas launches browser-based gaming metaverse SAGE Labs.\n\n– Aavegotchi announces its Gotchi-themed game center."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWhhdmUtbm90LWRpc3BsYWNlZC1tb25leS10cmFuc2ZlcnMtYmxvY2tzcGFjZS1nbGFzc25vZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals haven't wrestled blockspace from money TXs: Glassnode - Cointelegraph",
        "content": "Despite concerns that Bitcoin Ordinals are clogging the network, there is little evidence to suggest inscriptions are taking blockspace away from higher-value Bitcoin (BTC) monetary transfers.\n\n“There is minimal evidence that inscriptions are displacing monetary transfers,” on-chain analytics firm Glassnode explained its Sept. 25 “The Week On-chain” report.\n\nThe firm explained that this is likely because inscription users tend to set low fee rates, expressing a willingness to wait longer periods of time for confirmation.\n\n“Inscriptions appear to be buying and consuming the cheapest available blockspace, and are readily displaced by more urgent monetary transfers.”\n\nBitcoin Ordinals were introduced in February 2023 and have since accounted for the lion’s share of network activity when it comes to daily transaction count.\n\nHowever, this hasn’t necessarily been reflected in its share of mining fees, with inscriptions only attributing to about 20% of Bitcoin transaction fees, Glassnode noted.\n\nInscription fee share between images, text, audio, video and other data types on Bitcoin. Source: Glassnode\n\nMore inscriptions means more revenue — but there’s a catch\n\nWhile inscriptions have strengthened the base-load demand for blockspace and increased fees for miners, Glassnode says Bitcoin’s hash rate has also increased 50% since February.\n\nThis has resulted in tougher competition for miners looking to swoop in on revenue fees, says Glassnode:\n\n“With extreme miner competition in play, and the halving event looming, it is likely that miners are on the edge of income stress, with their profitability to be tested unless BTC prices increase in the near term.”\n\nBitcoin is currently priced at $26,216, but many industry pundits expect some degree of price appreciation in the lead-up to Bitcoin’s halving event scheduled for April 2024.\n\nRelated: Bitcoin Ordinals creator Casey Rodarmor pitches BRC-20 alternative ‘Runes’\n\nCurrently, most inscriptions come as a result of BRC-20 tokens, which were introduced one month after Casey Rodarmor launched the Ordinals protocol on Bitcoin in February.\n\nOn Sept. 25, Rodarmor pitched “Runes” as a potential alternative to BRC-20s, suggesting that an unspent transaction output-based fungible token protocol wouldn’t leave as many “junk” unspent transaction outputs on the Bitcoin network.\n\nMagazine: Blockchain games aren’t really decentralized… but that’s about to change"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1maXJtLW1hcmF0aG9uLW1pbmVzLWludmFsaWQtYmxvY2stYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin miner Marathon mines invalid block in failed 'experiment' - Cointelegraph",
        "content": "Bitcoin (BTC) mining firm Marathon Digital has confirmed it mined an invalid Bitcoin block during an “experiment” aimed at optimizing the firm’s operations.\n\nIn a Sept. 27 X post, Marathon said it utilizes a small percentage of the firm’s hash rate toward these experiments and stressed they weren’t trying to alter the network in any way.\n\n“In no way was this experiment an attempt to alter Bitcoin Core in any way,” Marathon said, emphasizing that they corrected the error as soon as they noticed the invalid block.\n\nWe can confirm that Marathon did mine an invalid block. We utilize a small portion of our hash rate to experiment with our development pool and research potential methods to optimize our operations. The error was the result of an unanticipated bug that came from one of our… — Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) September 27, 2023\n\nMarathon said the bug, which emanated from the firm’s internal development environment, wasn’t related to Marathon’s Bitcoin production pool or Bitcoin Core, the leading software used to connect to the Bitcoin network and run a node.\n\nThe incident occurred on Sept. 26 at 9:42 pm UTC on block 809,478, according to Mempool.space.\n\nSeveral Bitcoin developers, along with BitMEX Research, attributed the invalid block to a “transaction ordering issue.” Bitcoin developer “mononaut” believes Marathon mistake came from re-sorting the transactions in order of ascending absolute fees.\n\nThis is what MARA's invalid block at 809478 looks like:\n\n\n\n- pink transactions no longer exist in the main chain\n\n- blue transactions are invalid due to ordering (they spend an output from a transaction included later in the block) https://t.co/SJI1azOB5Z pic.twitter.com/5gY9TRA2eG — mononaut (@mononautical) September 27, 2023\n\nBitcoin analyst Dylan LeClair suggested that Marathon should have conducted this experiment on a testnet before attempting it on Bitcoin’s mainnet.\n\nIn reflection, Marathon said Bitcoin “functioned exactly as designed” by excluding the invalid block:\n\n“This incident, while unintended, underscores the robust security of the Bitcoin network, which rejected and rectified the anomaly.”\n\nRelated: Marathon Digital Q2 results miss revenue and earnings forecasts\n\nCointelegraph reached out to Marathon for comment but did not receive an immediate response.\n\nMarathon’s (MARA) share price fell 2.91% to $8.01 during opening hours on Sept. 27, according to Google Finance.\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDkyNzg2NDA4MC9lbi9Pc3VyYS1hLVByZW1pZXItTWFya2V0cGxhY2UtZm9yLXRoZS1CaXRjb2luLU5GVC1Hb2xkLVJ1c2gtTGF1bmNoZXMtd2l0aC1Bc3ByZXktQnVnYXR0aS1FZ2ctQ29sbGVjdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Osura, a Premier Marketplace for the Bitcoin NFT Gold Rush, Launches with Asprey Bugatti Egg Collection - Business Wire",
        "content": "REDMOND, Wash.--(BUSINESS WIRE)--Metagood launches Osura.com, the premier marketplace curated for high-end Bitcoin Ordinal collections.\n\nSince early 2023, Ordinals saw a meteoric rise, with over 33 million inscriptions as of earlier this month. Ordinals are quite different and offer many benefits compared to NFTs stored on Ethereum. NFTs on Ethereum are designed around digital certificates, or pointers to data and images stored off-chain on services like AWS (Amazon Web Services) or IPFS (InterPlanetary File System). In contrast, Bitcoin NFTs are designed as digital artifacts that are immutable, uncensorable, self-sovereign, permissionless, and stored fully on-chain (all data lives on Bitcoin).\n\nThese properties have led to a community of early adopters who believe Bitcoin is now the natural home for high-end NFTs. With the NFT market showing impressive adoption for both Ethereum and Solana during the last crypto bull run, the Osura team believes Ordinals on Bitcoin will see rapid adoption over the next year.\n\nWhen obtaining digital assets, users need to trust that they get the highest quality product when transacting. Osura is a destination for true digital art connoisseurs. It offers collectors a curated marketplace and enables them to collect, buy and sell digital artifacts. With a strategy to curate only the highest-quality digital assets, Osura debuts with two exceptional Bitcoin Ordinals NFT collections: OnChainMonkey (OCM) Dimensions 300 and the Asprey Bugatti Egg Collection by Asprey Studio, Bugatti, and Metagood. Both collections are 3D, interactive, and use recursion. Metagood co-founder Danny Yang developed new technology to create 3D animated and interactive art for the OCM Dimensions collection on Bitcoin.\n\nOCM Dimensions 300 is arguably the most innovative art collection on Bitcoin. Inscribed in February 2023, OCM Dimensions stands out among Bitcoin collections. It is a high-resolution, 3D art collection that pioneered recursion, one of the most significant aspects of Bitcoin Ordinals. The animated art scales with display size, presenting pixel-perfect clarity even on 8K screens. Remarkably, this quality is achieved with a file size of less than 1 kilobyte per inscription. These are some of the many things Dimensions achieved that were thought impossible on Bitcoin.\n\nFollowing the OCM Dimensions 300 innovation is the Asprey Bugatti Egg Collection. The Asprey Bugatti Egg is a cutting-edge 3D digital artifact. Working with Asprey Studio, Metagood crafted the generative code to encapsulate the essence of nature’s perfection. Only 111 in the whole collection, all eggs have a different motion of lighting that is unique to each of them. This exclusive collection is inscribed on uncommon satoshis (sats), with one of these sats being the oldest inscribed uncommon sat to date.\n\n“​​I’ve spent the last decade building on Bitcoin and the last few years focusing on creating high-end digital artifacts on Ethereum and now on Bitcoin. Now is a truly exciting time in NFTs - the Bitcoin Ordinals protocol just launched a few months ago. With our background creating digital artifacts, we understood the significance immediately and focused on Bitcoin Ordinals early on,” Danny Yang, co-founder and CEO of Metagood, said.\n\n“Bitcoin is the largest, most decentralized, and secure blockchain, and now Ordinals will see the most significant and high-end NFTs being stored on Bitcoin, too. At Osura, our focus is to foster and shepherd this new market and curate the best works in a trusted manner,” Amanda Terry, co-founder and COO of Metagood, said.\n\n\"Metagood played an instrumental role in delivering the technical backing for our Asprey Bugatti Egg Collection,\" Ali Walker, Chief Creative Officer at Asprey Studio, said. \"Their deep expertise and knowledge of Bitcoin technology set them at the forefront of putting digital assets on chain. The Osura marketplace will set a new standard for luxury Bitcoin NFT collections.”\n\nWhat sets the Osura marketplace apart is the curated art, the cutting-edge technology, the experienced and reputable team, and the seamless and secure product.\n\nAs a trusted pioneering authority in shaping the future of digital assets, Metagood built Osura to continue to launch collections for renowned brands and esteemed creators. The Osura team also plans to put together an Osura Curation Board for Digital Artifacts (with names to be announced shortly) as a new asset class that includes creators, collectors, historians, and technologists.\n\nOCM Dimensions and the Asprey Bugatti Egg Collection NFTs will be displayed in Asprey Studio’s Mayfair Gallery during their London Frieze event “Digital Muses” on October 10. Metagood COO Amanda Terry will speak at “The Art of Ordinals” Asprey Studio event in Paris on October 11, where the NFTs will also be displayed.\n\nAbout Osura\n\nOsura Bitcoin NFT Marketplace will host only the highest quality high-end digital assets. The team behind Osura, Metagood, has been building on the Bitcoin blockchain for over a decade. Their expertise allowed them to develop pioneering technology such as recursion, parent-child collection provenance, and launch the first on-chain randomization and reveal for an NFT collection on Bitcoin.\n\nMetagood proved its tech expertise by inscribing the first 10,000 image art collection of NFTs in one transaction on Ethereum in 2021 and on Bitcoin in 2023. It also launched the first 3D art collection fully on-chain on Bitcoin in June 2023. Osura enables renowned brands and creators to inscribe their high-end digital art on the Bitcoin blockchain. The platform caters to both seasoned and budding collectors, ensuring they discover unique and valuable Bitcoin NFT art of the highest quality.\n\nAbout OnChainMonkey\n\nOnChainMonkey, by Metagood, is a pioneering digital art collection. It is the first 10,000-image art collection created on-chain in a single transaction on Ethereum in 2021. In 2023, OnChainMonkey made history again, becoming the first 10,000-image collection inscribed on Bitcoin, and all done in a single inscription (#20219).\n\nThe collection is led by an experienced team: Danny Yang, who founded Taiwan’s largest cryptocurrency exchange, Maicoin; Amanda Terry, who served as a digital media business development executive at Twitter and NBC; and Bill Tai, a legendary VC and the first investor in Zoom and early investor in Canva, Dapper Labs and over 20 companies that have become publicly listed. The OnChainMonkey community is building businesses in Web3 and making real-world impact.\n\nAbout Metagood\n\nMetagood is a leader in blockchain technology and digital assets, setting a new standard for innovation in the crypto industry that blends technology, art, and community. Metagood was recognized in Fast Company’s 2022 Best World Changing Ideas Awards for Impact Investing.\n\nMetagood strives to build a better future for Web3. Through its innovative NFT collection OnChainMonkey (OCM), Metagood has created value and contributed to important causes, such as funding the successful evacuation of Sharbat Gula (known as “Afghan Girl” from the iconic 1984 National Geographic cover) and her family from Afghanistan, donating to humanitarian aid in Ukraine, Coral Reef conservation, and more.\n\nMetagood was founded by veterans with decades of business experience. Its chairman, Bill Tai, a legendary venture capitalist, has been at the forefront of the crypto space since 2010. Danny Yang, the CEO, founded both Maicoin, Taiwan's largest cryptocurrency exchange, and Blockseer, a blockchain technology company providing services to customers like the FBI, US Secret Service, and the DHS. He also founded the Stanford Bitcoin Meetup in 2013. Amanda Terry, the COO, is a former business development executive at Twitter, NBC, and the co-founder and managing partner of ACTAI Ventures.\n\nAbout Asprey Studio (aspreystudio.com)\n\nAsprey Studio was founded in 2022, part of the 242-year-old luxury house, Asprey. Asprey Studio creates unique artworks that make use of innovative and groundbreaking production techniques. The Asprey Studio Gallery is a multi-purpose gallery space that will host exhibitions and showcase Asprey Studio creations. Located on the second floor of the Asprey London flagship store in Mayfair, the Gallery’s primary focus will be on creating a new way to exhibit, release, and purchase artworks.\n\nIn a recent pioneering collaboration with Bugatti, the Studio designed one hundred and eleven precious metal eggs linked to generative art in Bitcoin. The release showcases not only the art of coding but also creates a new form of art expression that bridges physical and digital creations."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9kb3VibGUtZGlnaXQtYnJlYWtvdXQtYml0Y29pbi1wcmljZS_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvZG91YmxlLWRpZ2l0LWJyZWFrb3V0LWJpdGNvaW4tcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Crypto Analyst Predicts Huge Double-Digit Breakout For Bitcoin Price - NewsBTC",
        "content": "The Bitcoin price has been trading sideways for a while now but this will not always be the case. While there is a chance that the price could end up swinging downward and crashing, a crypto analyst has predicted that a surge in the cryptocurrency’s price is on the horizon.\n\nBitcoin Price Breakout Is Coming\n\nA crypto analyst who has grown to prominence on the TradingView site has put forward a bullish prediction for the Bitcoin price. The analyst who goes by the pseudonym Tolberti mapped out a yellow trend line which he believes points toward the next bull rally for the coin.\n\nThe trend line sits just above the $26,000 level which means that the cryptocurrency is currently close to it. The analyst explains that the BTC price remains bullish despite recent performance, especially as the month of October draws close.\n\nUsing the Fibonacci retracement which sat at 0.618, Tolberti points out the next significant resistance for Bitcoin. From here, he puts it at $29,167, which after beating, the analyst expects the Bitcoin price to surge above $30,000. A surge of this magnitude would mean that the Bitcoin price rises at least 15% from its current level.\n\nTolberti's chart outlining the forecast | Source: Tradingview.com\n\nHowever, it is not all easy sailing from here as the bears will not give up the fight easily. Speaking about the yellow trend line, the analyst said it is “a gateway to the ultra-huge bull market. Once it breaks, I expect a massive uptrend.” But he cautioned traders to “be aware of a possible retest first. Your stop-loss needs to be safe!”\n\nHow High Can BTC Price Go?\n\nTolberti’s bullish profile for the Bitcoin price also runs through to the long term. Just like a lot of other analysts, Tolberti expects the cryptocurrency to trade in the six digits in the next bull market. For his long-term prediction, he puts Bitcoin at a price of $125,000. According to a previous analyst, he believes that the Bitcoin price will reach this level sometime in the second quarter of 2025.\n\nInterestingly, Bitcoin is not the only cryptocurrency the analyst is bullish on. Altcoins were not left out of the post with the likes of Ethereum (ETH), Dogecoin (DOGE), and XRP making an appearance as other bullish tokens.\n\nGiven this forecast, Tolberti believes that the current price of Bitcoin is a good price for investors to buy. “26k is still a good price for Bitcoin to buy in the long term because I expect 120k in 2025,” the post read.\n\nBitcoin is currently showing strength because it continues to hold above $26,000 after the SEC delayed the 21Shares Spot Bitcoin ETF decision. It is currently trending at $26,275, although it’s down 3% in the last week.\n\nBTC price shows strength above $26,000 | Source: BTCUSD on Tradingview.com\n\nFeatured image from Breet, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzI3L2Nhbi1iaXRjb2luLWpvaW4tdHJpbGxpb24tZG9sbGFyLWNsdWItaW4tNS15ZWFycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Can Bitcoin Join the Trillion-Dollar Club in 5 Years? - The Motley Fool",
        "content": "Bitcoin's (BTC -1.30%) undoubtedly one of the best financial assets to have owned in the past decade, as its price has shot up about 20,000% since September 2013. That translates to a ridiculous compound annual growth rate (CAGR) of 70%, which trounces what investors in the stock market would have been able to achieve.\n\nBut what does the future hold? Can the world's most valuable cryptocurrency join the trillion-dollar club in the next five years? Here are some reasons why I believe Bitcoin's market cap essentially doubling by 2028 is a very real possibility.\n\nAttracting institutional capital\n\nWhat's unique about Bitcoin is that its early adoption was solely by individuals, primarily by computer scientists who were intrigued by this new internet money. Only in the past few years has it started to draw greater interest from institutions.\n\nNowadays, there are even publicly traded mining companies, a huge step of progress from Bitcoin's start when even a regular laptop could process transactions to the network. Governments own Bitcoin, and so do major corporations.\n\nThe latest news that has caught investors' attention is the potential approval of Bitcoin spot exchange-traded funds (ETFs). Applications have been filed by well-known asset managers, like BlackRock and Fidelity, among others, that would boost the accessibility and convenience of gaining exposure to the digital asset. If ETFs come to market, they would certainly help support the idea that Bitcoin is a legitimate financial asset.\n\nNeeding regulatory clarity\n\nGary Gensler, chair of the Securities and Exchange Commission, has previously stated that he views every other crypto besides Bitcoin as a security, which requires a ton of regulatory oversight. By labeling Bitcoin as a commodity, the argument can be made that its creation and existence hasn't violated any laws, mainly because there's evidence that it isn't controlled by a single entity.\n\nThere has been increased interest in finding ways to better regulate the industry, especially after the high-profile blowup of FTX and others last year. Perhaps this is still a key reason that some investors remain on the sidelines.\n\nShould those spot ETFs get approved, and a clearer regulatory framework come about, the risk of owning Bitcoin will definitely be reduced.\n\nMore likely than not\n\nFor Bitcoin's market cap to double in the next five years, its price would need to rise at a roughly 15% CAGR. Based on the cryptocurrency's past performance, this is an extremely conservative outlook, but it is still a forecast that will most likely outperform the stock market.\n\nI think there's a greater than 50% chance that Bitcoin will reach the trillion-dollar club by 2028. The arguments I've outlined above are two of the most important developments that I believe will work in Bitcoin's favor in the near term. Investors should pay attention to any updates in this regard.\n\nAdditionally, I have confidence that Bitcoin isn't going anywhere. It has been around for almost 14 years and has never been hacked. The Lindy effect says that the life expectancy of a new technology increases with every passing year that it remains relevant. The longer Bitcoin stays around, the less likely it is to cease to exist.\n\nBitcoin also has the greatest brand recognition in the world of cryptocurrencies. Plus, there is an exhaustive list of financial services and products that are built to support its adoption. This bodes well for its future.\n\nNonetheless, there's a lot of uncertainty surrounding this outlook, so investors should size their positions according to how much risk they are willing to accept. As part of a well-diversified portfolio, a 1% stake in Bitcoin makes perfect sense. Should the asset continue its long-term trend of skyrocketing in value, it can have a meaningful effect on one's portfolio. On the flip side, if Bitcoin becomes irrelevant and its price declines, losing a 1% position won't be a big deal.\n\nIt's also critical to accept that there will continue to be a lot of volatility. Bitcoin has experienced multiple drawdowns of greater than 50% throughout its history, something that likely won't change going forward."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTMway1vY3RvYmVyLWFuYWx5c3QtYnRjLWNsaW1ic9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price to $30K in October, says analyst as BTC price climbs 2% - Cointelegraph",
        "content": "Bitcoin (BTC) broke higher into the Sept. 27 Wall Street open as one analyst predicted a return to $30,000 in October.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price reaches for $27,000 in fresh uptick\n\nData from Cointelegraph Markets Pro and TradingView followed BTC price action as bulls gathered steam to reach $26,823 on Bitstamp.\n\nThe 2% jump to near-weekly highs came as market commentators already eyed thin overhead resistance, with a breakout on the cards should it not be replenished.\n\n“Ask liquidity is pretty wide and thin here again so likely a move higher is going to come from perps,” popular trader Skew explained, continuing the topic.\n\nSkew added that “this can create some good opportunities with inefficiencies & potential premiums later.”\n\n$BTC Binance Spot / Binance Perp\n\nPretty clear predatory move in the making pic.twitter.com/qJI2WFvizx — Skew Δ (@52kskew) September 27, 2023\n\nOn-chain monitoring resource Material Indicators revealed an uptick in activity from one specific class of whales well known for its impact on BTC price action (PA).\n\nMaterial Indicators further noted that the move above $26,500 had invalidated a warning signal that came on the back of a daily chart “death cross” at the start of the week.\n\n“Purple buys dips and sells rips. I’m happy to swim in their wake,” co-founder Keith Alan confirmed.\n\n#FireCharts integrates a CVD chart binned by order class which shows that historically, the Purple Class of Whales with order sizes in the $100k - $1M range have had the most influence over #Bitcoin PA. pic.twitter.com/gWPefQya05 — Material Indicators (@MI_Algos) September 27, 2023\n\n“There we go, Bitcoin is up and breaks above crucial areas,” analyst Michaël van de Poppe told X subscribers in part of the day’s coverage.\n\n“I’d prefer to see $26,500 and, if we do, we’re likely to see $30,000 in October.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/X\n\nCrypto traders dodge mass liquidations\n\nData from monitoring resource CoinGlass meanwhile confirmed that short liquidations remained modest.\n\nRelated: Bitcoin exchange volume tracks 5-year lows as Fed inspires BTC hodling\n\nAround $13 million in BTC shorts had been liquidated for the day at the time of writing, with the cross-crypto tally at $39 million.\n\nCrypto liquidations chart (screenshot). Source: CoinGlass\n\nBTC/USD traded at around $26,700 at the time of writing, as volatility remained.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3VzLWRvbGxhci1pbmRleC1oaXRzLWEtdGVuLW1vbnRoLWhpZ2gtaXMtYml0Y29pbi1wcmljZS1wcmVwYXJpbmctZm9yLWEtY3Jhc2gtMjAyMzA5MjgwMDMz0gGMAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3VzLWRvbGxhci1pbmRleC1oaXRzLWEtdGVuLW1vbnRoLWhpZ2gtaXMtYml0Y29pbi1wcmljZS1wcmVwYXJpbmctZm9yLWEtY3Jhc2gtMjAyMzA5MjgwMDMz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "US Dollar Index hits a ten-month high - Is Bitcoin price preparing for a crash? - FXStreet",
        "content": "The US Dollar Index is presently at its highest point since November 2022.\n\nDXY rising has been a bearish signal for SPX and Bitcoin price in the past two years.\n\nBTC has been standing strong and sharing a negative correlation with the S&P 500 Index might prevent a decline.\n\nBitcoin price has always been affected by macroeconomic developments along with other major indices such as the S&P 500 Index, NASDAQ 100, and even Gold. However, this time around, the situation might differ slightly as, unlike the rest of the investment options, the cryptocurrency has held its own.\n\nBitcoin price avoids a steep fall\n\nThe US Dollar Index is known to impact Bitcoin price along with the stock market and precious metals’ value. Since 2021, the rise in the DXY has resulted in a drawdown in the SPX, Gold and BTC. Following this pattern, the S&P 500 index, along with Gold, noted a decline in their market value over the past couple of days.\n\nBitcoin price was expected to do the same, however, the cryptocurrency managed to surprise the market as it has stood firm above $26,000. The DXY hitting a ten-month high of 106.65 seems to bear no impact on BTC. What this means for the world’s largest crypto asset is that a rally might not be too far away.\n\nUS Dollar Index 1-day chart\n\nThe DXY is presently overheated, as noted on the Relative Strength Index, sitting in the overbought zone above 70.0 and is probably looking at some correction or sideways movement until the market cools off.\n\nThis would be just the opportunity needed by Bitcoin price to make a move. The development, according to market analysis platform Santiment, suggests that a breakout might be in store as BTC has managed to stay afloat above $26,000.\n\nWhat moves to expect from BTC price\n\nThe optimism in the crypto market is building up as investors are looking for Bitcoin price to recover and post new year-to-date highs. Trading at $26,317, BTC would need a minor push to flip its 50- and 200-day Exponential Moving Averages (EMA) into a support line. This is crucial in bringing about a recovery in the value of the digital asset.\n\nBTC/USD 1-day chart\n\nThe reason why it has managed not to fall considerably akin to SPX while the US Dollar Index rallied is that it shares a negative correlation of -0.2 at the moment. This has kept the digital asset safe from noting a drop in value over the past few weeks.\n\nBitcoin correlation with SPX\n\nThe next major target for Bitcoin price now stands at $30,000 and is likely to reach there provided no sudden bearish development in the crypto market occurs. However, in the event that a decline does take place, it would be crucial for BTC not to fall through the support line at $24,986. This would invalidate the bullish thesis and potentially send the cryptocurrency towards $21,468.\n\nRead more - This short-term Bitcoin holder indicator forecasts another rally for BTC"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMivwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjctc2VwdGVtYmVyLTIwMjMvYXJ0aWNsZXNob3cvMTAzOTgzMjUzLmNtc9IBwwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjctc2VwdGVtYmVyLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMzk4MzI1My5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $26,200; Toncoin, Polygon fall up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe major cryptocurrencies were trading in the red on Wednesday amid worries about the impact of higher-for-longer interest rates. The global cryptocurrency market cap was trading at around $1.05 trillion, falling 0.25% in the last 24 hours.Bitcoin was down 0.25% at $26,229 as of 11:55 a.m., while Ethereum was flat at $1,590.\"The crypto market remained flat during the last 24 hours as traders await the Fed chief’s speech on Thursday, which will give us a clear picture of future rate hikes,\" said Shivam Thakral, CEO of BuyUcoin.Meanwhile, Edul Patel, Co-Founder & CEO of Mudrex, said, \"Bitcoin’s price has consolidated above the $26100 level. This could be because of the US 10-year Treasury yield moving up to 4.55%, matching its highest level in about 16 years.\"Barring BNB and Tron, all major crypto tokens were trading lower on Wednesday. Toncoin , Solana and Polygon fell up to 3%. Meanwhile, Litecoin , Polkadot, and Dogecoin declined by 1-2%.The total volume in DeFi is currently $2.25 billion, 11.4% of the total crypto market 24-hour volume. The volume of all stablecoins is now $19.04 billion, which is 96.46% of the total crypto market 24-hour volume.Bitcoin's dominance is currently 48.95%, according to CoinMarketCap. Meanwhile, BTC volume in the last 24 hours stood at approximately $7.29 billion, falling 30.35% in the last 24 hours.Notably, this Friday, a substantial number of BTC and ETH options contracts are set to expire on Deribit, with 117,000 BTC options and 1.1 million ETH options reaching their expiration. This event has the potential to increase volatility in the prices of these cryptocurrencies, said CoinDCX Research Team.Bitcoin's recent price action has been characterized by sideways trading, falling below the key support level of $26,500. This trend suggests a possible downside, potentially breaking the important $26,000 barrier.Despite numerous attempts, the primary cryptocurrency struggled to clear the $27,500 resistance, leading to a remarkable pullback. Bitcoin's downward trajectory pushed it below the vital $27,000 and $26,500 support levels, signalling bearish sentiment.While it briefly dipped below the key $26,200 level and is nearing $26,000, it recently stabilized around $26,026, showing some signs of easing losses. Currently, Bitcoin faces resistance at $26,350 and $26,500, with the potential to rise if it breaks above $26,700, or fall to $25,400 or even $25,000 if it doesn't."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLXVwd2FyZC1wb3RlbnRpYWwtdW5kZXItdGhyZWF0LTIwMjMwOTI3MjAzONIBkAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLWJ0Yy11cHdhcmQtcG90ZW50aWFsLXVuZGVyLXRocmVhdC0yMDIzMDkyNzIwMzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction: Bitcoin, Ethereum, Ripple: BTC, ETH, XRP at catch 22 moment - FXStreet",
        "content": "Bitcoin price could make a 5% climb to $27,771 if it overcomes resistance confluence between 50- and 200-EMA at 26,948.\n\nEthereum price could breach the $1,648 barricade if rising momentum activates the pending bullish call.\n\nRipple price’s recovery rally threatened by massive seller accumulation within the $0.5145 and $0.5536 order block.\n\nBitcoin (BTC) price is trying to lead the rest of the market i nto recovery. However, it faces a key obstacle, same case for Ethereum (ETH) and Ripple (XRP) positioning the top three cryptocurrencies in a muddle.\n\nAlso Read: This short-term Bitcoin holder indicator forecasts another rally for BTC\n\nBitcoin price tests key confluence hurdle\n\nBitcoin (BTC) price is working out a recovery, but the upside potential remains limited by a descending trend line from a big picture point of view. More closely, the king of crypto is trapped under the foothold of the three Exponential Moving Averages (EMA), making it a Catch-22 moment or complication for investors.\n\nIn today’s trading session, Bitcoin price climbed almost 3%, escaping above the trendline before a strong rejection from the resistance confluence presented by the 50- and 200-day EMA at $26,948.\n\nThe overall outlook of the Relative Strength Index (RSI) shows that while momentum appears to be rising, it remains rather weak. The red histogram bars of the Awesome Oscillator paint the same picture, moving narrowly above the midline. This increases the odds for Bitcoin price falling.\n\nHowever, bulls still have a chance to push north, considering the RSI is tipping up and the AO is positive. The onus, therefore, is on bulls to increase their buying pressure, with a break and close above the 100-day EMA at $27,330 confirming the breakout.\n\nIn a highly bullish case, Bitcoin price could extend above the $27,771 resistance level, last tested in late August.\n\nBTC/USDT 1-day chart\n\nConversely, traders are likely to start cashing in after Bitcoin price’s failed attempt at a breakout. The ensuing selling pressure could send BTC below the $26,000 psychological level to test the demand zone at around $25,856. A break and close below its mean threshold at $25,527 will confirm the downtrend, likely leading BTC to the September 11 lows at $24,899. This would constitute a 5% slump from current levels.\n\nAlso Read: Bitcoin Ordinals creator proposes “Runes”, a replacement for BRC-20 standard\n\nEthereum price has a pending bullish call that needs activation\n\nEthereum (ETH) price is in an upwards spiral, with the current move, if sustained, likely to send ETH past the $1,648 resistance level. This roadblock has been in play since the onset of the month. If bulls activate the pending bullish call indicated by the RSI attempting to cross above the signal line (yellow band), the Proof-of-Stake (PoS) token could finally break through. A solid move above the 50-day EMA at $1,666 would confirm the breakout.\n\nThe green shade of the AO supports this outlook as it points to bullish dominance over the bears.\n\nETH/USDT 1-day chart\n\nOn the other hand, a rejection from the $1,648 resistance level could send Ethereum price south, potentially tagging the support floor at $1,551. In the dire case, the losses could extrapolate for a quick liquidity sweep, with the daily chart showing a bit of sell-side liquidity residing underneath.\n\nAlso Read: Ethereum Restaking - The next big thing after liquid staking?\n\nRipple price faces massive seller accumulation\n\nRipple (XRP) price recovery could be overpowered by seller momentum from the supply zone between $0.5536 and $0.5145. This order block is populated by strong sellers, with the 100-, 200, and 50-day EMAs at $0.5376, $0.5193, and $0.5278 all converging within it. As such, it is likely that XRP could fall, potentially going as low as the $0.4622 support level. In the dire case, the fall could extend to the support floor at $0.4191, with the move denoting a 15% fall from current levels.\n\nThe RSI is inclined south, suggesting falling momentum, invigorated by the red histogram bars of the AO. This tips the odds further in favor of the bears.\n\nXRP/USDT 1-day chart\n\nOn the flipside, sidelined investors could inspire a move north, sending Ripple price into the supply zone. A break and close above the midline of this order block, coinciding with the 50-day EMA at $0.5278 would confirm the climb. In a highly bullish case, XRP could shatter the upper boundary of the order block at $0.5536, clearing the path for a continuation to the $0.6098 level. Such a move would denote 20% ascension.\n\nAlso Read: Ripple and Coinbase lead the big fight as US crypto firms advocate for regulatory overhaul"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLXJlY292ZXJ5LTI2ay_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvYml0Y29pbi1wcmljZS1yZWNvdmVyeS0yNmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price Could See Recovery If It Holds This Key Support - NewsBTC",
        "content": "Bitcoin price is consolidating above the $26,000 support. BTC could start a recovery wave if it clears the $26,500 resistance zone in the near term.\n\nBitcoin is still consolidating above the $26,000 support zone.\n\nThe price is trading below $26,400 and the 100 hourly Simple moving average.\n\nThere is a major bearish trend line forming with resistance near $26,300 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could start a decent recovery wave unless there is a clear move below $26,000.\n\nBitcoin Price Eyes Recovery\n\nBitcoin price remained stable above the $26,000 support zone. BTC seems to be forming a short-term support base above the $26,000 level and is currently consolidating.\n\nRecently, the price made a recovery wave attempt above the $26,200 level. However, the bears remained active below the $26,500 level. They rejected the 50% Fib retracement level of the downward move from the $26,712 swing high to the $26,026 low.\n\nBitcoin is now trading below $26,400 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $26,300 level. There is also a major bearish trend line forming with resistance near $26,300 on the hourly chart of the BTC/USD pair.\n\nThe next key resistance could be near the $26,350 level or the 100 hourly Simple moving average, above which the price could revisit the $26,500 resistance or the 76.4% Fib retracement level of the downward move from the $26,712 swing high to the $26,026 low.\n\nSource: BTCUSD on TradingView.com\n\nTo start a recovery wave, the price must settle above $26,500. In the stated case, the price could climb toward the $27,000 resistance. Any more gains might call for a move toward the $27,500 level.\n\nMore Losses In BTC?\n\nIf Bitcoin fails to start a fresh increase above the $26,300 resistance, it could continue to move down. Immediate support on the downside is near the $26,050 level.\n\nThe next major support is near the $26,000 level. A downside break and close below the $26,000 level might start another major decline. The next support sits at $25,400. Any more losses might call for a test of $25,000.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level.\n\nMajor Support Levels – $26,050, followed by $26,000.\n\nMajor Resistance Levels – $26,300, $26,500, and $27,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9hbmFseXN0LXVuY292ZXJzLWJsYWNrcm9jay1sb25nLWludGVyZXN0LWluLWJpdGNvaW4tbWluaW5nLWRldGFpbHMv0gFsaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYml0Y29pbi1uZXdzL2FuYWx5c3QtdW5jb3ZlcnMtYmxhY2tyb2NrLWxvbmctaW50ZXJlc3QtaW4tYml0Y29pbi1taW5pbmctZGV0YWlscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Analyst Uncovers BlackRock Long Interest In Bitcoin Mining – Details - NewsBTC",
        "content": "Based on a recent report by Bloomberg analyst Jamie Coutts, asset managers’ interest in Bitcoin stretches beyond exchange-traded funds (ETF) into the mining sector. In particular, Coutts speaks about BlackRock, describing the asset manager’s application with the US Securities and Exchange Commission (SEC) to offer a Bitcoin spot ETF as “unsurprising.”\n\nThe analyst stated that BlackRock and other prominent global asset managers, namely Vanguard and State Street, have been involved in the Bitcoin mining industry for over three years.\n\nIn hindsight, #BlackRock's massive #Bitcoin spot ETF play shouldn't have been that surprising. Along with other behemoths (Vanguard, StateStreet) who espouse #ESG-driven investing principles, they started scooping up public mining stock back in 2020 ESG, Institutionalization🧵 pic.twitter.com/VcKX8TrgZ2 — Jamie Coutts CMT (@Jamie1Coutts) September 26, 2023\n\nBlackRock And Other ESG-Driven Companies Investing In Bitcoin Mining, Analyst Says\n\nJames Coutts stated that BlackRock began its venture into Bitcoin mining in 2020 by investing in Marathon Digital, the second-largest publicly traded mining company.\n\nNotably, this development occurred when the Bitcoin mining industry faced high criticism, likely due to the substantial reliance on fossil fuels.\n\nOver the last three years, Coutts reports that BlackRock, Vanguard, and State Street have increased their respective investments in Bitcoin mining companies, regardless of the market cycle.\n\nInterestingly, all three asset managers are known to promote Environmental, Social, and Governance (ESG) investment principles, part of which is limiting fossil fuel use. However, it appears that investing in Bitcoin mining may not damage the ESG credentials of these companies.\n\nAccording to a report by Daniel Batten, co-founder of CH4 Capital, James Coutt notes that Bitcoin mining currently derives 50% of its energy from sustainable sources. And this percentage is likely to increase as Bitcoin mining has the unique ability to monetize stranded energy and stabilize energy grids.\n\nPotential Effect Of Bitcoin Mining Institutionalization\n\nBased on James Coutts’s report, BlackRock and the two other asset managers in the discussion are currently the top investors in the three largest publicly traded mining companies, namely Marathon Digital, Riot Platforms, and Cleanspark.\n\nTogether, these mining companies collectively own 8.9% of the global hash rate, which is significant as public miners only account for 15% of the global hash power.\n\nSource: Bloomberg Intelligence\n\nFor now, James Coutts believes that the involvement of these asset managers in Bitcoin mining poses little challenge to the network’s decentralization.\n\nHowever, the analyst notes that there may be a future clash of network and ESG values, especially given the activist tendencies of BlackRock, Vanguard, and State Street.\n\nHowever, this would not prevent the Bitcoin network from operating as expected. But it may lead other miners whose operations still rely on fossil fuels to start processing “censored transactions.”\n\nAt the time of writing, Bitcoin trades at $26,198.48, with a 0.57% gain in the last month, according to data from Tradingview.\n\nBTC trading at $26,198.48 on the hourly chart | Source: BTCUSDT chart on Tradingview.com\n\nFeatured image from The New Yorker, chart from Tradingview\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8xOTg4OTUvZm9ybWVyLW5iYS1jaGFtcGlvbi1tYXR0aGV3LWRlbGxhdmVkb3ZhLWpvaW5zLXN3YW4tYml0Y29pbtIBWmh0dHBzOi8vZGVjcnlwdC5jby8xOTg4OTUvZm9ybWVyLW5iYS1jaGFtcGlvbi1tYXR0aGV3LWRlbGxhdmVkb3ZhLWpvaW5zLXN3YW4tYml0Y29pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Former NBA Champion Matthew Dellavedova Joins Swan Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin financial services company Swan has hired former NBA champion Matthew “Delly” Dellavedova as its vice president of business development. The move looks to capitalize on the professional athlete’s successful sporting career, bridging the gap between the crypto and sports.\n\nDellavedova’s new position will be part-time to begin with, due to his current contract to play with Melbourne United. But in the meantime, he wants to leverage his access to Australian firms.\n\n“I will be looking to work with Australian super funds,” he told Decrypt, explaining that the idea is to get these massive money managers to allocate a percentage of assets to Bitcoin.\n\nAD\n\nAD\n\nThe term “super” refers to Australian superannuation funds, which is a retirement savings system that workers must contribute to—similar to the U.S.’ 401K. As of 2022, the industry collectively manages roughly $2.1 trillion, a whopping sum Swan and Dellavedova look to tap into.\n\nThe former NBA champion with the Cleveland Cavaliers will also be harnessing the new Name, Image and Likeness (NIL) rule implemented in college sports. Barring certain restrictions, the NIL rule allows university athletes to endorse companies and receive compensation for doing so.\n\n“It’s really great that college athletes are able to earn an income,” he said. “Delly” wants to push Bitcoin onto their radar, “throwing enough little hooks that people want to get interested.” This goes not only for the athletes, he said, but also their money managers and the colleges themselves.\n\nWhen asked about where Bitcoin stands inside locker rooms, he ballparked a high number. “I’d say around 20% of players hold Bitcoin or other crypto,” he told Decrypt, but there’s a caveat. “Some of them don’t even have 1% of their portfolio in it.”\n\nThe hiring isn’t Swan’s first foray into the sporting world. The company partnered with Amateur Athletic Union (AAU) team Compton Magic to create the first Bitcoin Basketball program back in March this year.\n\nAD\n\nAD\n\nDellavedova shared some interesting stories to expand on his encounters with the Bitcoin space.\n\nWhile playing for the Sacramento Kings last year, he was on the road and messaged Bitcoiners that he wanted to attend last year's Pacific Bitcoin conference organized by Swan. “It was really awesome to meet real Bitcoiners,” he said, explaining that the occasion helped to foster relationships with several of Swan’s top executives–who later offered him the VP role.\n\nDellavedova is a seasoned investor, and hasn’t held back from putting his money in several other Bitcoin startups. He counts microtask marketplace Stakwork, global payment app Strike, payment processor OpenNode, some Bitcoin mining companies, Bitcoin rewards app Fold, and Orange Pill app, a platform for Bitcoiners to meet up.\n\nOrange Pill app, in fact, has helped make some long lasting Bitcoin and basketball memories. “When I didn’t have friends or family in a city I was playing in, I would message randoms on the app to see if they wanted tickets,” he told Decrypt.\n\nAlthough Dellavedova said he managed to “meet some really cool people,” it wasn’t always easy. Imagine a pro basketball player messages you that he has two free tickets for a game. “Some people thought I was scamming them,” he said."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2JpdGNvaW4tYW5kLWNyeXB0by1ndWlkZS9hLXJldmlldy1vZi1wcml2YWN5LXBvb2xzLWFuLWltcHJvdmVkLXRvcm5hZG8tY2FzaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Sep 2023 07:00:00 GMT",
        "title": "A Review of Privacy Pools, an Improved Tornado Cash? - Altcoin Buzz",
        "content": "This privacy paper is basically covering the app, or I guess the concept of the app, that Amin came up with called ‘privacy pools’ earlier this year in March.\n\nLet’s discover how Privacy Tools works.\n\nWhat is Privacy Pools?\n\nPrivacy Pools is a project aimed to “fix” the popular open-source solution for anonymizing Ethereum transactions in order to make it regulator-friendly. It’s basically the concept of making Tornado Cash or at least forking Tornado Cash, and making it regulatory-compliant.\n\nThis clip gives a good idea of what @VitalikButerin is thinking with Privacy Pools. He thinks that \"guilt\" & \"innocence\" are antiquated terms. According to Vitalik, there should be no expectation of being treated as \"innocent until proven guilty\" when using Ethereum. pic.twitter.com/XNK7mfsy3F — Chris Blec (@ChrisBlec) September 19, 2023\n\nThe way they do this is by splitting the pools into isolated pools, where you can prove to a regulator that your funds didn’t co-mingle with bad actor funds while still preserving your privacy. This idea is interesting in theory, but it will be interesting to see how it plays out in practice. There are some concerns, such as normalizing censorship and financial surveillance on blockchains. However, when building practical privacy tools, you have to consider the trade-offs.\n\nWe can say Privacy Tools operates similarly to Tornado Cash by mixing multiple user transactions to obscure their true origins. However, when users choose to withdraw funds, they have the option to generate a zero-knowledge proof. The zero-knowledge proof confirms that they are not utilizing a criminal blockchain address while safeguarding their identity.\n\nMore About Privacy Tools\n\nIf we build privacy tools without the ability to prove to authorities that funds didn’t co-mingle with bad actors, they are likely to get sanctioned. Sanctioning may not kill the tools but can have a chilling effect on their usability, locking out users from certain countries. There’s a practical trade-off between providing privacy and satisfying regulatory needs.\n\nThere’s also the possibility that governments around the world may need to understand the practical challenges of enforcing regulations on a global scale. If different countries start sanctioning different privacy protocols, the network could become fragmented.\n\n1/ New privacy paper with @VitalikButerin, Jacob Illum (@chainalysis), @mat_nadler, @fschaer!https://t.co/ovH1iYXXY6 We explored new compliance opportunities made possible by https://t.co/Nt4b2Tgx1D, where users can provably dissociate from illicit funds. story below 🧵👇 pic.twitter.com/Tq0zYfbwlL — Ameen Soleimani (@ameensol) September 6, 2023\n\nSoleimani commented on the paper that they did their best to explain: “how Privacy Pools tech can serve as neutral infrastructure for bringing public blockchains into regulatory compliance—across jurisdictions.”\n\nRegulatory Compliant Privacy\n\nIn order to ensure regulatory compliance, privacy pools can use “association sets” to represent a group of wallets that are connected via zero-knowledge proofs. Association set providers (ASPs) are responsible for generating association sets. These ASPs can be entirely constructed on-chain, requiring no human or AI intervention. Alternatively, ASPs can independently generate association sets and publish them on-chain.\n\nCentralization Concerns\n\nThe researchers also address centralization concerns in pool management. They propose a system where pool managers are selected in a decentralized manner and their actions are auditable.\n\nAn excerpt from the paper states that “In some instances, ASPs- association set providers, tasked with generating association sets can be entirely constructed on-chain, requiring no human (or AI) intervention. Alternatively, ASPs may independently generate association sets and subsequently publish them on-chain.\n\n.@Chainalysis chief scientist Jacob Illum sheds light on how user privacy would be safeguarded in the proposed privacy pools, helping in filtering good deposits from the bad. Listen to @Unchained_pod on @CoinDeskPodcast: https://t.co/oXGsytXDBG\n\nSpotify 🎧 https://t.co/PNS2eQZ91x pic.twitter.com/ADq8YHSfSd — CoinDesk (@CoinDesk) September 10, 2023\n\nLegal Compliance\n\nThe authors have sought insights from legal experts to assist in tailoring the protocol and its surrounding ecosystem to “ensure compliance across various legal jurisdictions.\n\nOur Remarks\n\nWe entirely agree with the paper’s authors that there are some challenges that need a solution. It is important to ensure that privacy pools are designed and implemented in a way that minimizes the risk of censorship and financial surveillance. It is also important to educate regulators and authorities about the benefits and challenges of privacy pools so that they can develop sound policies.\n\nEducating regulators and authorities about these challenges may be the only way to make them consider alternative approaches. However, this is challenging, and it’s an ongoing battle.\n\nIn any case, you can check out the paper for more details. It presents an interesting approach to achieving privacy while navigating regulatory complexities.\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment, and informational purposes only. Any information or strategies are thoughts and opinions relevant to the accepted levels of risk tolerance of the writer/reviewers and their risk tolerance may be different than yours. We are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments so please do your due diligence. Copyright Altcoin Buzz Pte Ltd."
    }
]