[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTgvbWlhbWktYml0Y29pbi1jb25mZXJlbmNlLWZsYWdzLWF0dGVuZGFuY2UtZG93bi1ieS1oYWxmLWFzLWNyeXB0by13aW50ZXItZHJhZ3Mtb24v0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8xOC9taWFtaS1iaXRjb2luLWNvbmZlcmVuY2UtZmxhZ3MtYXR0ZW5kYW5jZS1kb3duLWJ5LWhhbGYtYXMtY3J5cHRvLXdpbnRlci1kcmFncy1vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Attendance at World's Largest Bitcoin Conference Down by Half as 'Crypto Winter' Drags On - CoinDesk",
        "content": "The price of bitcoin (BTC) has risen to about $28,000 from around $15,000 in November, but it’s still well off the all-time high around $69,000 reached in late 2021."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL2RhaWx5cHJvZ3Jlc3MuY29tL2JyYW5kYXZlc3R1ZGlvcy9leHBsb3JpbmctdGhlLWJlbmVmaXRzLW9mLWhvbGRpbmctYml0Y29pbi1mb3ItbG9uZy10ZXJtLWludmVzdG1lbnQvYXJ0aWNsZV81NDA2N2I4NS0xYTkyLTU4NjMtYTY1NS05MTQ0NmU2YmNkZmIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Exploring the benefits of holding Bitcoin for long-term investment - The Daily Progress",
        "content": "In today's fast-paced and ever-changing world, achieving financial freedom is a dream that many aspire to. With the rise of digital currencies, such as Bitcoin, a new investment strategy has emerged: holding Bitcoin for the long term. This article will explore why holding Bitcoin can be the key to financial freedom and how it can revolutionize your approach to wealth-building.\n\nUnderstanding Bitcoin\n\nBitcoin, often referred to as a digital or cryptocurrency, is a decentralized form of currency that operates on a peer-to-peer network. In 2009, it was created by an unknown individual or group using the pseudonym Satoshi Nakamoto. Based on blockchain technology, it aims to ensure transparency, security and immutability of transactions.\n\nOver the years, Bitcoin has gained widespread adoption and has shown significant growth in value. As of this article, Bitcoin has reached an all-time high in terms of its market capitalization, surpassing traditional financial institutions and gaining recognition from major companies and investors.\n\nConcept of holding Bitcoin\n\nOnce you buy Bitcoin with a credit card, there are various approaches, including short-term trading, day trading or long-term holding. While short-term trading can be lucrative for some, it requires constant monitoring, technical analysis and a high tolerance for risk. On the other hand, holding Bitcoin for the long term can offer a more passive and strategic approach to building wealth.\n\nHolding Bitcoin involves purchasing Bitcoin with the intention of keeping it for an extended period, typically years, rather than frequently buying and selling based on short-term market fluctuations. This strategy is based on the belief that Bitcoin has the potential for long-term appreciation in value, driven by its scarcity, utility and growing acceptance worldwide.\n\nWhy holding Bitcoin can offer potential benefits for long-term investment and wealth-building strategies\n\nOne of the main reasons why holding Bitcoin can be the key to financial freedom is its unique characteristics as a store of value. Unlike traditional fiat currencies, such as the U.S. dollar or the Euro, which can be subject to inflation and depreciation, Bitcoin's limited supply may offer protection against inflation and depreciation of fiat currencies. With a limited supply of 21 million Bitcoins, its scarcity and mathematical scarcity make it an attractive option for hedging against inflation and preserving wealth.\n\nWhile short-term trading can be lucrative for some, it requires constant monitoring, technical analysis and a high tolerance for risk. On the other hand, holding Bitcoin for the long term can offer a more passive and strategic approach to building wealth. Bitcoin may offer potential benefits as part of a diversified investment portfolio, but investors should also consider the potential risks and uncertainties associated with this emerging asset class. These risks may include market volatility, regulatory uncertainty and potential security breaches, among others.\n\nIn addition, holding Bitcoin can offer diversification benefits to an investment portfolio. Traditional investment assets, such as stocks, bonds or real estate, are subject to market fluctuations and risks that can affect the overall performance of a portfolio. By adding Bitcoin to a diversified investment portfolio, investors can reduce the risk of over-reliance on traditional assets and potentially enhance their overall returns.\n\nOvercoming common misconceptions about Bitcoin\n\nDespite its growing popularity, Bitcoin still faces misconceptions and skepticism from some individuals. Concerns about its volatility, risks and legitimacy are often cited as reasons to avoid holding Bitcoin. However, it's important to note that Bitcoin has come a long way since its early days and has gained significant mainstream acceptance.\n\nWhile it's true that Bitcoin can experience short-term price volatility, especially in an emerging and relatively unregulated market, its long-term trajectory has been positive. Many experts argue that the risks associated with Bitcoin can be mitigated through careful planning, education and risk management strategies. At the same time, it is important for investors to acknowledge that Bitcoin has faced criticism and concerns from some investors and regulators. It is crucial for investors to educate themselves about the potential risks and uncertainties of investing in this asset class. Some concerns may include its volatile price movements, the potential for fraud or market manipulation and the lack of a clear regulatory framework in some jurisdictions.\n\nConclusion\n\nHolding Bitcoin can be the key to financial freedom, offering the potential for wealth accumulation, diversification and a hedge against inflation. Despite misconceptions and risks associated with Bitcoin, its growing acceptance, increasing institutional adoption and historical price appreciation make it a compelling investment option for those looking to achieve financial freedom. By educating yourself, developing a strategic plan, practicing risk management and taking a long-term investment approach, you can unlock the potential of holding Bitcoin and embark on a path toward financial freedom.\n\nThis content is for informational purposes only and should not be construed as financial advice. This content is for educational purposes only. Your situation is unique and the products and services discussed here may or may not be right for your individual situation. This is not an offer of financial advice, or financial services. Performance information may change. Past performance is not indicative of future results. All investing includes the risk of loss. The opinions expressed here are that of the advertiser alone.\n\nLee Enterprises newsroom and editorial were not involved in the creation of this content."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50Lzg2MTI0YzBlLTFjMzEtNDVlNy04NmY0LTExOGE3ZTc2YjQwYtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Grayscale aims for possible loophole with new bitcoin ETF filing - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nGrayscale, manager of the world’s largest cryptocurrency fund, has long been stymied by regulators in its bid to convert its flagship vehicle into an exchange traded fund.\n\nHowever, it may have found a ruse to partially circumvent the restrictions imposed by the US Securities and Exchange commission.\n\nGrayscale has filed to launch a US-listed ETF that would partly invest in so-called “spot” bitcoin exchange traded products already up and running in other countries.\n\nThese ETPs invest directly in “physical” bitcoin, or track the cryptocurrency’s price synthetically — structures the SEC has so far not permitted.\n\nInstead, the SEC has only allowed bitcoin ETFs that trade in futures contracts listed on the Chicago Mercantile Exchange, which is a regulated venue.\n\nThis stance has prompted Grayscale to sue the SEC for its refusal to allow the $16.9bn Grayscale Bitcoin Trust (GBTC), a private spot bitcoin trust, to convert to an ETF. A ruling is due by the end of the third quarter.\n\nIn the interim, though, Grayscale has filed to launch a Global Bitcoin Composite ETF, which would invest 40 per cent of its assets in spot bitcoin ETPs listed on “major non-US exchanges”, such as in Canada or Europe.\n\nWhile there is no guarantee that the application will be approved, analysts believe it has a chance given that the overseas ETPs Grayscale is proposing to invest in are regulated securities — precisely the type of asset that the SEC has insisted crypto ETFs hold.\n\n“Grayscale’s filing seems intended to push the envelope with the SEC by using the SEC’s own words against it to launch crypto ETFs,” said Bryan Armour, director of passive strategies research, North America at Morningstar.\n\n“This seems like Grayscale is directly challenging the SEC’s past decision to allow bitcoin futures ETFs on one hand and on the other hand reject spot bitcoin ETFs,” he added.\n\nTodd Rosenbluth, head of research at VettaFi, a consultancy, described the filing “as a creative way of Grayscale trying to offer US-listed product with some spot bitcoin exposure”.\n\n“I think there is greater likelihood of Grayscale getting approval for this ETF than it getting the SEC to voluntarily approve a US-listed spot bitcoin only ETF, which is what Grayscale wants,” he added.\n\nRosenbluth believed the filing was an “acceptance of the reality that the SEC is not going to give [Grayscale] the green light”, to convert GBTC.\n\nOne point in Grayscale’s favour in its latest filing is that vast numbers of US-listed ETFs already hold regulated, non-US securities, mostly in the form of equities and bonds.\n\nIndeed, at least one US ETF already holds foreign-listed spot bitcoin ETFs, appearing to set something of a precedent for the structure.\n\nThe $447mn Amplify Transformational Data Sharing ETF (BLOK) has positions in four Toronto-listed spot bitcoin ETFs, although they currently account for just 4.3 per cent of its portfolio, with the balance in stocks of companies involved in blockchain technology.\n\nGrayscale is proposing that its 40 per cent exposure to spot bitcoin ETFs would be weighted equally between five underlying funds.\n\nRosenbluth also noted the “added irony” of Cathie Wood’s Ark Next Generation Internet ETF (ARKW) having a 6.8 per cent exposure to Grayscale’s GBTC trust, even though the SEC deems GBTC’s structure to be unsuitable for an ETF. The SEC declined to comment.\n\nEven if Grayscale was to get approval for the Global Bitcoin Composite ETF, it is far from certain there would be a huge appetite for the fund, however.\n\nIt is proposing that the remaining 60 per cent of the portfolio would be invested in the equity of bitcoin mining companies. Armour was unconvinced there was much demand for such a structure.\n\n“I don’t think investors benefit from access to a 60/40 portfolio of bitcoin miners and a global spot bitcoin fund of funds sleeve,” he said.\n\n“The portfolio is confusing and will do a worse job tracking the spot bitcoin price than a bitcoin futures ETF, so I’m not sure this type of product adds any value aside from parsing out the SEC’s strategy for approving bitcoin-related ETFs.”\n\nRosenbluth agreed demand might be lacking, saying “combining bitcoin with other investments is not novel but has had limited interest”.\n\nAs evidence he cited the Global X Blockchain & Bitcoin Strategy ETF (BITS), which invests in the Global X Blockchain ETF (BKCH) and bitcoin futures, but which holds just $11mn.\n\nRosenbluth noted that despite a strong bounce for bitcoin and crypto-related companies after last year’s sharp losses, with the currency itself up 61 per cent so far this year, “demand for ETFs exposed to bitcoin has been limited”.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\n“Investors seem sceptical the rally can persist and remember the challenges of 2022,” he added.\n\nFor instance, although the $1bn ProShares Bitcoin Strategy ETF (BITO), the largest bitcoin futures ETF, was up 57 per cent year to date as of May 12, it had only seen net inflows of $95mn, according to VettaFI’s data. This was not far ahead of the $75mn attracted by the $120mn ProShares Short Bitcoin ETF Strategy (BITI), which takes the opposite bet and is down 44 per cent year to date.\n\nBKCH has returned 69 per cent so far this year but has seen net outflows of $2mn. Likewise the Invesco Alerian Galaxy Crypto Economy ETF (SATO) is up 68 per cent “and has seen no investor interest either”, Rosenbluth added.\n\nMichael Sonnenshein, chief executive of Grayscale, was more bullish, however, arguing that “there is no question, coming out of the crypto winter, that investors’ appetite for crypto remains healthy. It has certainly not gone unnoticed by the crypto community that crypto has achieved some of the highest returns in 2023 to date.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE5L2JpdGNvaW4tMjAyMy1idGMtYmFzaC1pbi1taWFtaS1pcy1zdWJkdWVkLWFmdGVyLTIwMjItY3J5cHRvLWxvc3Nlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Crypto's Bitcoin 2023 (BTC) Bash in Miami Is Subdued After 2022 Losses - Bloomberg",
        "content": "It turns out that the Bitcoin faithful still like to party even after the annus horribilis that shook the digital-asset world in 2022. They’re just a little more subdued this year.\n\nDevotees of the largest digital token gathered in Miami Beach this week for the Bitcoin 2023 conference — to commiserate, but also to celebrate getting past last year’s string of calamities, including the blowup of the FTX exchange. Though that period was painful, crypto prices have managed to recover this year, with Bitcoin adding 60% to trade around $26,800, from $16,600 at the start of 2023 — a development that was hard to miss at the conference’s expo floor, where the price of Bitcoin was plastered everywhere. Absent were reminders that it traded at almost $69,000 in late 2021."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDUvMTkvc3RyaWtlLWV4cGFuZHMtYml0Y29pbi1wYXltZW50cy10by02NS1jb3VudHJpZXMtbW92ZXMtZ2xvYmFsLWhlYWRxdWFydGVycy10by1lbC1zYWx2YWRvci_SAYMBaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wNS8xOS9zdHJpa2UtZXhwYW5kcy1iaXRjb2luLXBheW1lbnRzLXRvLTY1LWNvdW50cmllcy1tb3Zlcy1nbG9iYWwtaGVhZHF1YXJ0ZXJzLXRvLWVsLXNhbHZhZG9yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Strike expands Bitcoin payments to 65 countries, moves global headquarters to El Salvador - Fortune",
        "content": "Since starting in 2019, the Bitcoin-powered payments app Strike has aimed to become a global crypto-powered equivalent to Venmo or Cash App. On Friday, the company—led by 29-year-old entrepreneur Jack Mallers—announced that it was expanding to a total of 65 global markets, in addition to the U.S., El Salvador, and Argentina, where it already operates.\n\nIn an interview with Fortune in Miami, Mallers touted Strike’s consumer-facing app, which offers Bitcoin and Tether transfers, through what he described as a “frictionless onboarding.”\n\n“We think there are billions of people that want a money app with those characteristics and capabilities contrasted to a clouded world of crypto exchanges and hidden, unregistered licensing regimes and 1,000 different coins,” he said.\n\nAt a time when the U.S. crypto industry is confronting regulatory uncertainty, and as the Securities and Exchange Commission is suing firms for offering unregistered securities, Mallers said this is a validation of Strike’s Bitcoin-first approach.\n\n“I think Bitcoin stands alone, and just how obvious it is that it is owned by nobody,” Mallers told Fortune. “Every other instrument in this industry has a founding team, a foundation, and they issued some [tokens] privately and handed them out in auctions before they went live—and that sounds a lot more like a security.”\n\nSEC Chair Gary Gensler has publicly stated that he views Bitcoin as a commodity not a security.\n\nMallers notes Strike has taken a regulation-first approach in the U.S., including in New York, where Strike is currently not available but in the process of applying for a so-called BitLicense.\n\nMallers added that Strike’s expansion into other global markets came about partly as result of moving its global headquarters to El Salvador, which passed a digital assets law earlier this year establishing a regulatory framework for crypto. According to Mallers, Strike received one of the first licenses under the new regime, along with Bitfinex.\n\nMallers has ties to El Salvador and its president, Nayib Bukele, who established Bitcoin as legal tender in 2021. Mallers introduced Bukele at the Bitcoin Miami conference in 2021, where the president made the announcement by video.\n\nAlthough Strike was initially tapped to help develop El Salvador’s Bitcoin experiment, it later retreated from the project, which suffered from early bugs and slow adoption.\n\nDespite reports that businesses and residents of El Salvador are not using Bitcoin, Mallers cited other metrics, like increased tourism. “I do think that El Salvador found hope in Bitcoin,” he said, arguing that merchant adoption “wasn’t what was defining success.”\n\nThe next challenge for Strike will be to expand its ties to banking services that let customers exchange Bitcoin for fiat currency. Currently, customers in Strike’s new markets will only be able to receive Bitcoin from other users, although Mallers said that he aims to launch new features, including a debit card, later this year. Another challenge comes in the form of network congestion and higher fees on Bitcoin transactions due to recent demand for new products like ordinals and BRC-20 tokens. Mallers argued that “Bitcoin is working as intended.”\n\n“The claims that [congestion] is hurting the third world, and it invalidates how emerging markets are using this technology is ridiculous,” he said.\n\nMallers also pointed to another Strike feature—Send Globally—which allows users to transfer between USD and other currencies over Strike using Bitcoin as an intermediary, although it is limited to twelve countries in Africa, Central America, and Southeast Asia.\n\nCurrently, dollar balances in Strike are held in Tether, a dollar-pegged stablecoin that has drawn criticism for its shadowy accounting. Mallers said that the company decided to go with Tether, as opposed to other options like Circle and Coinbase’s USD Coin, because of demand from users in the Global South.\n\n“They don’t trust Circle,” he said. “If I’m being totally honest, Circle is built for American institutions.”\n\nAs advocates make the case that the Lightning network can actually transform Bitcoin into a payments service, Strike’s expansion represents the first attempt to build an app that allows people across the world to transact with each other.\n\nMike Brock is the CEO of TBD, a Bitcoin-focused division of Jack Dorsey’s financial technology company Block. Even as Block plots a global expansion for its payment platform Cash App, Brock was supportive of Strike’s effort.\n\n“If your mission is to advance any decentralized ecosystem, then you better hope that there’s actually a pretty competitive marketplace of different companies vying for solutions within that system,” he told Fortune.\n\nTwo years after Mallers introduced Bukele at Bitcoin Miami, he reflected on the changing circumstances, wearing a hat emblazoned with the El Salvador flag.\n\n“Two years ago, people would have made fun of me [for our] headquarters in El Salvador to launch product for three billion people, but now Coinbase is fighting with Gary Gensler,” he said. “Who’s laughing now?”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmZpbnRlY2huZXh1cy5jb20vd2h5LWRvLWludmVzdG9ycy1iZWxpZXZlLWJpdGNvaW4taXMtcmVhZHlpbmctZm9yLWEtY29tZWJhY2sv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Why do investors believe bitcoin is readying for a comeback? - Fintech Nexus",
        "content": "The following is a guest post by Dmytro Spilka, Head Wizard at Solvid.\n\nFollowing a solid start to 2023, investors are beginning to grow in confidence that a prosperous period for bitcoin is on the horizon.\n\nHowever, with many market commentators anticipating rallies beyond $100k over the coming years, what has made everyone so bullish on bitcoin again?\n\n“Professional investors are forecasting a strong year ahead for bitcoin and are confident about its long-term valuation,” reported a recent Nickel Digital Asset Management survey. “Nearly nine out of 10 professional investors predict bitcoin price rise this year. Two out of three agree $100,000 valuation is possible but only for long-term investors.”\n\nThe report suggested that bitcoin’s price is expected to rise exponentially within the next three-to-five years. As much as 65% of institutional investors surveyed agree that bitcoin could hit a value of $100k in the long term, with 58% suggesting a three-to-five-year time frame, while 25% said it would take longer than five years.\n\nHowever, expectations for 2023 appear to be lower, with 23% of investors anticipating that bitcoin will exceed $30,000 by the end of the year.\n\nWith CoinGecko data showing that bitcoin’s price has already accelerated from $16,450 towards $28,000 by the end of Q1 2023, it could yet be seen that Nickel’s survey results for 2023 expectations end up being a little more conservative than reality.\n\nBut what about expectations for exceeding $100k over the coming years? Could BTC really rally towards six-figure valuations? Let’s take a deeper look into why investors are so confident that a bitcoin comeback is on the way:\n\nGreat expectations for bitcoin’s halving\n\nThe key reason behind the optimism for bitcoin’s future price rallies revolves around the asset’s cyclical halving events. Approximately every four years, bitcoin is programmed to halve the rewards it distributes to miners by 50%.\n\nThis mechanism helps control BTC’s inflation rate and emulates the asset’s scarcity in line with precious metals like gold.\n\nWith bitcoin’s current halving reward at 6.25 BTC distributed per block, the next halving event will decrease rewards to 3.125 BTC per block mined. This actively creates a deflationary environment for bitcoin and has the power to increase its scarcity–provided sufficient demand still exists actively.\n\nCrucially for investors, bitcoin’s previous halving events in 2012, 2016, and 2020 have all preceded seismic market-wide bull runs that culminated in a new all-time high value for the cryptocurrency.\n\nOne of bitcoin’s most heavily-used visualizations when anticipating the coin’s halving cycles is the coin’s stock-to-flow model. This assesses how BTC has performed with its halving events, with each event drawn into the chart.\n\nIn the wake of bitcoin’s 2016 halving, the asset climbed to a new all-time high value of $19,783.21 in December 2017. Following the coin’s 2020 halving event, an eventual all-time high of $69,044.77 was reached in November 2021.\n\nWith bitcoin’s next halving event likely to occur in April 2024, much of the cryptocurrency market will be firmly braced for action throughout 2025 in anticipation of a similar all-time high-breaking bull run.\n\nAnticipating regulations\n\nEven bitcoin’s most avid supporters will likely agree that the regulatory landscape will play a key role in deciding the scale of any future rally.\n\nThe recent collapse of FTX has caused more key players to call for stronger cryptocurrency market regulations to protect investors. While this can be difficult for cryptocurrency investors who believe in the power of genuinely decentralized assets that operate independently of external influences and regulators, the move may positively affect the market.\n\n“The industry is steadily moving towards regulations globally. Country-specific laws are being drafted to protect investors from market uncertainties, obliterate security risks, and prevent any impact on the monetary system should the crypto industry go through a rough period,” says Rajagopal Menon, vice president of cryptocurrency WazirX.\n\nWhile the demise of FTX has hurt many investors, a new regulatory environment could be a reliable means of whittling out the industry’s less sustainable players.\n\nHowever, the cryptocurrency landscape could benefit from innovating its way to greater stability alongside implementing calming regulatory measures.\n\nOne such solution is SKARB, an institutionally-focused trading terminal that enables widespread change in how institutions navigate the cryptocurrency ecosystem.\n\nSKARB helps mitigate the prospect of institutions facing future events like FTX by unifying multiple exchanges and market makers within one UX.\n\nThis unified approach comes with vast benefits and helps institutions to avoid the risks associated with liquidity issues among cryptocurrency exchanges. This will actively aid institutions by minimizing the dangers of counterparty risk by allowing you to diversify your exposure across multiple counterparties while keeping your trade workflow unified.\n\nRelated:\n\nSKARB’s unified platform allows institutions to trade effectively across multiple venues while consolidating their trading and reporting experience and establishing a more effective trade monitoring, compliance, and overall trade workflow.\n\nThis tool carries significant ramifications for the crypto regulatory landscape because it can provide far greater levels of institutional trust, which can help to ensure that organizations are better prepared against the prospect of troubled exchanges.\n\nDealing with unpredictability of economic landscape\n\nPerhaps bitcoin’s biggest challenge relates to the ongoing difficult economic conditions throughout global economies. Although the coin’s halving cycles can generate plenty of momentum, it’s worth acknowledging that the path to bitcoin’s most recent all-time high in November 2021 coincided with a significant growth period for global tech stocks, particularly those on Wall Street.\n\nThese links with traditional financial markets historically follow bitcoin, meaning that the risk of recessions in 2023 could negatively impact BTC and the broader crypto market.\n\n“If concerns about growth intensify, then crypto assets might struggle to sustain this recovery,” said Fawad Razaqzada, market analyst at City Index, in an interview with Markets Insider.\n\nHowever, Nasdaq has reported that bitcoin has begun to show a negative correlation in comparison to the S&P 500 Index in recent weeks for the first time since the FTX collapse, indicating that these market links may be weakening.\n\nWhile it’s undoubtedly worth exercising caution when investing in cryptocurrencies, signs of growing market sentiment towards bitcoin ahead of next year’s halving event seem familiar when remembering the events of 2020 and 2021.\n\nAlthough the relationship between BTC and the S&P 500 could be gradually decoupling, it’s worth assessing how the cryptocurrency markets respond to upcoming economic challenges in traditional finance.\n\nWhether investors are right to be optimistic about bitcoin reaching $100,000 remains to be seen. Still, in a market where unpredictability reigns supreme, it’s always safe to brace for the unexpected."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvZ29wLXByZXNpZGVudGlhbC1jYW5kaWRhdGUtdml2ZWstcmFtYXN3YW15LWJldHMtYmlnLW9uLWJpdGNvaW4taW4tMjAyNC1yYWNlL9IBbWh0dHBzOi8vd3d3LmNic25ld3MuY29tL2FtcC9uZXdzL2dvcC1wcmVzaWRlbnRpYWwtY2FuZGlkYXRlLXZpdmVrLXJhbWFzd2FteS1iZXRzLWJpZy1vbi1iaXRjb2luLWluLTIwMjQtcmFjZS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "GOP presidential candidate Vivek Ramaswamy bets big on Bitcoin in 2024 race - CBS News",
        "content": "Republican presidential candidate Vivek Ramaswamy is betting big on digital currency Bitcoin for campaign donations, and he's also unveiling a new proposal to roll back tax restrictions on mining the currency in the U.S.\n\n\"The thriving Bitcoin universe should actually better empower me to do what I want to do as the U.S. president, which is to stabilize the U.S. dollar as a unit of measurement and put the Federal Reserve back in its place with that as its single mandate,\" Ramaswamy said in an exclusive interview with CBS News. (He would dispense with the Fed's dual mandate of stabilizing currency and maximum employment to have it focus on the former.)\n\nRamaswamy plans to debut his new Bitcoin policy this Saturday at the annual Bitcoin 2023 conference in Miami.\n\nThe business entrepreneur won't be the first presidential candidate to allow digital currency for donations to his campaign. That distinction belongs to Sen. Rand Paul, who accepted Bitcoin donations in his 2016 White House campaign.\n\nPresident Biden, Senator Tim Scott, former U.N. Ambassador and South Carolina Governor Nikki Haley and Former President Donald Trump are not accepting cryptocurrency donations. However, Trump, who is leading in Republican primary polls, did issue non-fungible tokens — commonly known as NFTs — last fall and reportedly personally earned up to $1 million from selling the unique digital assets.\n\nRamaswamy has no plans to unveil his own NFTs for personal profit or his campaign.\n\n\"Right now, I'm more focused on policy. It also just gives people the choice to donate to the campaign in Bitcoin and signal that we're not threatened by it,\" he said.\n\nA core tenet of Ramaswamy's proposal would be the freedom to mine Bitcoin in the U.S.\n\nHarvesting the digital currency is a costly, energy-draining process. The U.S. recently eclipsed China as the premier location for harvesting the digital coin after Beijing in 2021 pushed out companies mining the digital currency to cut energy consumption.\n\nThe Biden administration recently proposed a 30% tax on electricity used by cryptocurrency mining operations in its budget for the fiscal year of 2024.\n\n\"I think that it's wrong and unfair and is not an appropriate use of federal power,\" Ramaswamy said. But there is little chance that Congress would pass a new tax on electricity consumed by cryptocurrency mining, especially since the House is controlled by Republicans.\n\nThe entrepreneur said the freedom to mine would be the \"base principle that it is unfair and counterproductive to target Bitcoin miners as different from any other consumer of energy, period.\"\n\n\"We'll put that into the rules and preserve freedom to mine by rescinding and committing against any special taxes for the utilization of energy for purposes of mining,\" he said.\n\nRamaswamy's proposal would also codify that Bitcoin and similar coins would not be treated as a security, which he says would allow it to be \"a parallel currency.\" Bitcoin has skyrocketed in value within the last decade, but remains highly volatile due to uncertainty in the cryptocurrency markets and government regulation.\n\nNonetheless, he argues cryptocurrency can provide an alternative to Americans wary about the strength of the U.S. dollar.\n\n\"The insecurities that the defenders of fiat money have with respect to the rise of Bitcoin is similar to the insecurities that I see amongst public schools and the teachers unions and the administrators of public schools with respect to school choice,\" Ramaswamy said. \"I will be the opposite of what public schools are to school choice.\"\n\nThe state of cryptocurrency in the U.S.\n\nWashington is pushing for greater regulation and oversight of cryptocurrencies after the collapse of FTX, a cryptocurrency hedge fund and crypto-exchange site, in November 2022. Shortly after, FTX founder Sam Bankman-Fried was arrested and charged with securities fraud, money laundering and campaign finance violations.\n\nThe cryptocurrency company lost about $9 billion of customer funds. A string of other industry players have declared bankruptcy over the last year, including BlockFi, Celsius Network, Genesis Global Capital, Three Arrows Capital and Voyager Digital.\n\nGary Gensler, the chair of the U.S. Securities and Exchange Commission, testified before Congress in April about the state of the cryptocurrency market and clashed with Republicans over a proposed requirement that companies disclose information related to climate-related risks and greenhouse gas emissions.\n\nThe cryptocurrency market has fluctuated wildly in recent years, but is currently a $1.7 trillion industry. Bitcoin has the largest share of that market, with about $518 billion in securities."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmpvdXJuYWwtbmV3cy5jb20vbmV3cy9iaXRjb2luLXNjYW0tY29zdHMtbG9jYWwtd29tYW4tMzBrL1c2UkxYQ1BPUjVGV0hQWk5CNlJIVFJEN0VFL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin scam costs local woman $30K - Hamilton Journal News",
        "content": "A short time later, she said she was contacted by another man claiming to be from the non-existent Federal Government Fraud Department. He told the woman that her bank account had two fraudulent deposits of $15,000 and $23,000, which he advised needed to be taken to the nearest Bitcoin Depot ATM, a machine that takes cash deposits and purchases the popular cryptocurrency Bitcoin before transferring it, untraceably, to an anonymous “digital wallet.”\n\nThe woman withdrew $15,000 from her bank and deposited it at the Bitcoin Depot ATM at the Circle K at 11 N. College Ave. in Oxford.\n\nThe fake agent called her again the next day, advising her to take $23,000 out of her account this time and deposit it into the Bitcoin Depot ATM for safekeeping. The woman’s unspecified bank only allowed her to withdraw another $15,000. The woman told police that she felt uncomfortable with making the ATM deposit, so she took it to her home. But, as time wore on, she decided to make the deposit again.\n\nIn total, the woman deposited $30,000 into the Bitcoin Depot ATM after being advised under false pretenses. She’s working with her bank to see what options are available to her.\n\nThe Journal-News spoke with a customer service representative at Bitcoin Depot who said there’s no way to trace where the purchased Bitcoin went. Though the representative had no knowledge of this exact case, she said the only action the company can take in cases of fraud is to deactivate the victim’s account and flag the digital wallet of the recipient to make sure no more Bitcoin can be transferred to that wallet. They can, however, return the ATM fee to the victim.\n\nBitcoin Depot has more than 7,000 ATMs across the country, including 11 in Butler County. The customer service representative said fraud occurs daily."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzE4L3VzLWJpdGNvaW4tY29ycC10by1ob3N0LTE1MGstY3J5cHRvLW1pbmluZy1yaWdzL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzE4L3VzLWJpdGNvaW4tY29ycC10by1ob3N0LTE1MGstY3J5cHRvLW1pbmluZy1yaWdzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "U.S. Bitcoin Corp to Host 150K Crypto Mining Rigs - CoinDesk",
        "content": "While USBTC has seen positive developments in its operations, as it also reached an agreement with the city of Niagara Falls to continue operating its bitcoin mine there, Hut 8 has been facing operational difficulties."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA1LTE4L3RldGhlci1ib3VnaHQtc29tZS1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Tether Bought Some Bitcoin - Bloomberg",
        "content": "Programming note: Money Stuff will be off tomorrow, back on Monday.\n\nThere is a view that crypto was a low-interest-rates phenomenon, but stablecoins are really a low-interest-rates phenomenon. The idea of the most popular (“fully backed,” non-algorithmic) stablecoins is:"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTkvamFjay1kb3JzZXktYmFja2VkLXRiZC1sYXVuY2hlcy1uZXctd2ViNS10b29sa2l0LXRvLWRlY2VudHJhbGl6ZS10aGUtaW50ZXJuZXQv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8xOS9qYWNrLWRvcnNleS1iYWNrZWQtdGJkLWxhdW5jaGVzLW5ldy13ZWI1LXRvb2xraXQtdG8tZGVjZW50cmFsaXplLXRoZS1pbnRlcm5ldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Jack Dorsey-backed TBD Launches New Web5 Toolkit to Decentralize the Internet - CoinDesk",
        "content": "One of the first applications TBD will launch on their Web5 platform will be a remittance app for Africa and Mexico that uses bitcoin (BTC) and stablecoins as payment rails. The app will be based on another TBD open source project called TBDex – a protocol for discovering liquidity and exchanging assets."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTkvYml0Y29pbi1wYXltZW50cy1hcHAtc3RyaWtlLWV4cGFuZHMtdG8tNjUtY291bnRyaWVzLWZyb20tdGhyZWUv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8xOS9iaXRjb2luLXBheW1lbnRzLWFwcC1zdHJpa2UtZXhwYW5kcy10by02NS1jb3VudHJpZXMtZnJvbS10aHJlZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin Payments App Strike Expands to More Than 65 Countries From Three - CoinDesk",
        "content": "“If you are in the United States the apps are gorgeous; there's a really high bar for design,” Rios explained. “Unfortunately that's not the case when you download apps abroad.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vcmVmcmVzaG1pYW1pLmNvbS9kaWFtb25kLWhhbmRlZC1jcnlwdG8tZW50aHVzaWFzdHMtdGFrZS10aGUtYnVsbC1ieS10aGUtaG9ybnMtYXQtYml0Y29pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Diamond-handed crypto enthusiasts take the bull by the horns at Bitcoin 2023 - Refresh Miami",
        "content": "The most prominent cryptocurrency shows its resilience at this year’s conference in Miami Beach\n\nBy Riley Kaminer\n\nIt wasn’t just those riding the mechanical bull installed in the Miami Beach Convention Center today that were taking the bull by the horns. Rather, the optimism about Bitcoin was universal amongst all the attendees Refresh Miami interacted with at this year’s edition of the cryptocurrency’s flagship conference.\n\nOrganizers told us that the Bitcoin 2023 conference expects a total of 13,000 to 15,000 attendees – about half the attendance of Bitcoin 2022 – across the three-day event. The conference started today with an ‘industry’ day focused on the Bitcoin business community. The goals: to network, learn, and build together.\n\nThe crowd included a large swathe of the Bitcoin ‘maximalists’ or ‘maxis,’ as its die-hard supporters are known – focused on the cultural elements surrounding Bitcoin. Another major subset of the crowd was clearly focused on the technical side of the industry. But we also spoke to some newcomers who were interested in diving deeper into the ecosystem. Clearly, the allure remains, albeit to a lesser extent than last year.\n\nMaking sense of the banking bust\n\nFor Bitcoin fans, the recent collapse of traditional banks SVB and First Republic act as a point in Bitcoin’s favor.\n\nJan van Eck, CEO of asset manager Van Eck, which has $70 billion of assets under management, drew parallels between gold and Bitcoin as a way to hedge the risk of government monetary policy.\n\n“The world can change really fast, and Bitcoin is a great thing to look at in people’s portfolios,” he said.\n\nIn a separate conversation, Wall Street veteran turned Bitcoin influencer Caitlin Long – one of the conference’s main draws – also noted that recent episodes have been “a gigantic advertisement for Bitcoin.”\n\nL-R: Dylan LeClair, Caitlin Long, Mark Connors, and Ram Ahluwalia\n\n“It’s not a shock that Bitcoin is up, in light of what’s happened in the traditional banking system.”\n\nMark Connors, the Head of Research for digital asset investor 3iQ, echoed these sentiments. He noted that the government had consolidated banks, which then overleveraged themselves – causing the global financial crisis.\n\n“It’s continuing,” Connors asserted. “In March, the Fed absorbed more banks, making this a multi-decade rollup.” It is in this context that the decentralized nature of Bitcoin might provide a competitive advantage.\n\nAnxiety over regulation\n\nIf there were one main theme from today’s talks, it was that regulation poses an unknown threat to the Bitcoin community. There were different philosophies on how exactly to manage this lack of regulation. For instance, van Eck signaled that his firm plans to double down on its European presence, since legislators there seem more keen on providing regulatory guidance.\n\nExperts were in consensus that regulators should act quickly. “We need action sooner, we need policy that’s not prohibitive, and we need education for the policymakers that are going to build the guidelines that are going to last for the sustainable future of Bitcoin,” asserted Mina Khattak, the senior director of crypto and web3 at Worldpay from FIS.\n\nFor Perianne Boring, founder of trade organization The Chamber of Digital Commerce, digital asset regulation proposed by Massachusetts Senator Elizabeth Warren “jeopardizes our American values.”\n\nBoring believes that Bitcoin and blockchain technology can advance US national security, economic security, and energy security. And broadly, she is optimistic that the Bitcoin crowd will prevail. “The pro-crypto army is bigger, more organized, and more sophisticated than any anti-crypto army I’ve seen on the ground in Washington, D.C.,” Boring asserted.\n\nBuilders continue to build\n\nA buzzing expo floor showcased a wide range of professionals doubling down on Bitcoin – from nonprofits to lawyers to blockchain infrastructure providers and more. One row was devoted to a “Bitcoin Bazaar,” with small vendors selling wares as diverse as Bitcoin-themed children’s books and ‘shitcoin’ themed toilet wipes. And another section displayed Bitcoin artwork, much of it was available for purchase (in BTC, of course).\n\nBut startups played a protagonistic role at the conference. An international set of companies took part in ‘pitch day,’ or a continual series of pitch competitions across different verticals.\n\nMiami startup Moon Mortgage was also in attendance. Brickell-based co-founder and CEO Aaron Nevin expressed his excitement about participating in the conference now as an exhibitor, after having attended for the last five years.\n\n“It’s like a big family reunion,” he told us. “This is the center of the crypto universe. It’s incredible to be here at Bitcoin 2023 – and to be in the crypto space.”\n\nIn April, Moon Mortgage announced a new product that enables users to borrow against the value of their crypto, in addition to a real estate mortgage product. Nevin said that we should expect more to come from this nine-person company as they continue to scale in the US.\n\nThe conference continues tomorrow and Saturday with keynotes from presidential candidate Robert F. Kennedy Jr. and Vivek Ramaswamy and best-selling author Michael Lewis, as well as sessions about Bitcoin payments, self-custody, Bitcoin in the Global South, and more.\n\nMORE SCENES FROM THE BITCOIN 2023 CONFERENCE\n\nREAD MORE ON REFRESH MIAMI:"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xOC9zaG91bGQtd2Utd29ycnktYWJvdXQtdGV0aGVycy1iaXRjb2luLWJ1eWluZy1wbGFuL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xOC9zaG91bGQtd2Utd29ycnktYWJvdXQtdGV0aGVycy1iaXRjb2luLWJ1eWluZy1wbGFuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Should We Worry About Tether’s Bitcoin-Buying Plan? - CoinDesk",
        "content": "But, in a real way, buying bitcoin with surplus cash likely won’t affect USDT users (though it might even benefit BTC holders). For the trade to go sideways, so much else has to go wrong. It never really made sense to me when Do Kwon would bash the U.S. dollar, claiming that his “decentralized money” (which was pegged to fiat!) would outcompete the world’s reserve currency. Likewise, Tether’s support of bitcoin as a hedge is an implicit acknowledgement of the risk of its own main product. There’s really no amount of bitcoin that would save the firm if the buck breaks. But until that happens, Tether just has to take in funds and pay out withdrawals – and it can invest the spread wherever it wants."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE5L2JpdGNvaW4tcy1idGMtdmFsdWUtY29ycmVsYXRpb24tdG8tYmlnLXRlY2gtbmR4LW5lYXItbG93ZXN0LXNpbmNlLTIwMjHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin's Correlation to Big Tech Near Lowest Since 2021 - Bloomberg",
        "content": "Bitcoin has been moving less in tandem with tech stocks as sentiment around equities and cryptocurrencies diverges.\n\nThe world’s largest cryptocurrency has been stuck below the $27,000 level this week, while the tech-heavy Nasdaq 100 has climbed 3.5%."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTgvZmlyc3QtbW92ZXItYW1lcmljYXMtYXhpZS1pbmZpbml0eS1yYWxsaWVzLWFmdGVyLWFwcGxlLWFwcC1zdG9yZS1kZWJ1dC_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzE4L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWF4aWUtaW5maW5pdHktcmFsbGllcy1hZnRlci1hcHBsZS1hcHAtc3RvcmUtZGVidXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Rebounds Amid Optimism on Debt-Ceiling - CoinDesk",
        "content": "Bitcoin Frogs, the newly-launched non-fungible token (NFT) fashioned after frogs, has become the most-traded collection in the past 24 hours, surpassing even prominent collections such as Bored Apes. Bitcoin Frogs, which launched in late February on Bitcoin Ordinals, reached a trading volume of over $2.2 million, data from CryptoSlam show. The collection describes itself as “10,000 unique frog collectibles minted directly on the Bitcoin Blockchain.” At the time of writing, each NFT was selling for 0.12 bitcoin (BTC), or more than $3,200. Buyers and sellers are paying trading fees ranging from $50 to over $1,200 as of Thursday."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTkvbmZ0LW1hcmtldHBsYWNlLWRpYmEtZ29lcy1saXZlLW9uLXJlYWxseS1nb29kLWZvci1iaXRjb2luLXNtYXJ0LWNvbnRyYWN0cy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzE5L25mdC1tYXJrZXRwbGFjZS1kaWJhLWdvZXMtbGl2ZS1vbi1yZWFsbHktZ29vZC1mb3ItYml0Y29pbi1zbWFydC1jb250cmFjdHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "NFT Marketplace DIBA Goes Live on ‘Really Good for Bitcoin’ Smart Contracts - CoinDesk",
        "content": "“The bull case for Bitcoin assets is in the ballpark of $10bn market cap over the next couple of years,” Draper said in a prepared statement. “What Gideon and the team at DIBA have built is a testament to the potential NFTs on Bitcoin.”"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTkvYml0Y29pbi1ob3ZlcnMtYmVsb3ctMjdrLWFzLWZlZC1jaGFpci1wb3dlbGwtbWFrZXMtbW9kZXN0bHktZG92aXNoLWNvbW1lbnRzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTkvYml0Y29pbi1ob3ZlcnMtYmVsb3ctMjdrLWFzLWZlZC1jaGFpci1wb3dlbGwtbWFrZXMtbW9kZXN0bHktZG92aXNoLWNvbW1lbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin Hovers Below $27K as Fed Chair Powell Makes Modestly Dovish Comments - CoinDesk",
        "content": "Most top assets in the crypto market turned green in the afternoon. Ether (ETH), the second-largest cryptocurrency by market capitalization, was hovering around $1,809 on Friday afternoon, up 0.8%. Decentralized smart contracts platform Injective Protocol's INJ jumped 10% for the day to trade at $7.07. Layer 2 blockchain Optimism's OP was one of the laggards on Friday, dropping by 3% to $1.66."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluaW5nLWRpZmZpY3VsdHktcmlzZXMtdG8tYS1uZXctYWxsLXRpbWUtaGlnaC_SAVBodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LXJpc2VzLXRvLWEtbmV3LWFsbC10aW1lLWhpZ2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin mining difficulty rises to a new all-time high - Forkast News",
        "content": "Bitcoin’s mining difficulty level rose 3.22% on Thursday, hitting an all-time high, as the network’s hashrate also increased to a record high. The difficulty changes roughly every two weeks and measures how hard a miner would have to work to verify transactions on a block. A higher difficulty reading indicates that it is more competitive to mine Bitcoin.\n\nSee related article: Could Bitcoin mining make renewable energy more profitable?\n\nFast facts\n\nThe mining difficulty reading came in at 49.55 trillion at block height 790,272 in Thursday’s adjustment, rebounding from a 1.45% decline in the previous adjustment on May 4, according to data from BTC.com.\n\nThe difficulty of mining Bitcoin typically rises when more miners go online, which raises competition. Miners are rewarded Bitcoin for validating transactions on the network. Their profitability is highly dependent on Bitcoin spot price and mining difficulty.\n\nMining difficulty adjustments have been highly correlated to changes in hashrate, the level of computing power used for mining.\n\nBitcoin’s hashrate, a measure of computational power used for mining, was at around 368.5 exahashes per second on Wednesday, up from 350.8 exahashes on May 4, data from Blockchain.com shows.\n\nBitcoin’s price edged up 1% over the last 24 hours to trade at US$27,276 at 1:40 p.m. in Hong Kong, and slid 0.72% over the past seven days, according to data from CoinMarketCap. The largest coin by market capitalization traded at around US$29,000 on May 4, up about 64% this year.\n\nSee related article: Biden administration pushes for 30% electricity tax in swipe at crypto miners"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9icmVha2luZy1yb2JlcnQtZi1rZW5uZWR5LWpyLXRvLWFjY2VwdC1jYW1wYWlnbi1kb25hdGlvbnMtaW4tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Breaking: Robert F. Kennedy Jr. to accept campaign donations in Bitcoin - Cointelegraph",
        "content": "Robert F. Kennedy Jr. will be the first presidential candidate in United States history to accept campaign donations in Bitcoin, he announced during his first appearance as a presidential candidate at the Bitcoin 2023 conference. He praised the cryptocurrency as a “symbol of democracy and freedom” during the event.\n\n“Today, we show the world the power and the durability and the flexibility of Bitcoin. [...] Almost everyone in this room is aware of the link between Bitcoin and democracy and freedom. [...] They’re passionate because of the deep representation of a deep need that we have for liberty and democracy and the promise that this innovation has to guarantee those virtues.\"\n\nRFK Jr. making the Bitcoin donation acceptance announcement at Bitcoin 2023 in Miami. Source: Sam Bourgi via Cointelegraph\n\nThe candidate — who is challenging President Joe Biden — has been sharing his libertarian views about cryptocurrencies on Twitter. In a post on May 3, RFK Jr. stated that “crypto technologies are a major innovation engine,\" adding that the U.S. is hobbling the industry and driving “innovation elsewhere.\"\n\nKennedy Jr. is the nephew of 35th President of the U.S. John F. Kennedy.\n\nBy attending the Bitcoin event, RFK Jr. is not only targeting voters but also a potential source of millions of dollars in donations. During last year’s midterm elections, Sam Bankman-Fried, former CEO of now-bankrupted crypto exchange FTX, donated $40 million in support of candidates. Crypto exchange Coinbase has also been actively lobbying for legislation regulating the crypto space in the country.\n\nRFK Jr.’s increased commitment to cryptocurrencies coincides with a tight regulatory environment in the U.S., spreading uncertainty among players and harming an already battered industry.\n\nThe candidate believes the U.S. economy could be more resilient if it has a diverse ecosystem of currencies:\n\n“Just as a biodiverse ecosystem is a resilient ecosystem, so too will our economy be more resilient if it has a diverse ecology of currencies, not just a single, centrally controlled one. We are seeing today how fragile our over-centralized system is.\""
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8xOC9wYWtpc3Rhbi1hbm5vdW5jZXMtZnJlc2gtYmFuLW9uLWNyeXB0by1idXQtYWRvcHRpb24tYXMtYS1oZWRnZS1yZW1haW5zLXBvcHVsYXIv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA1LzE4L3Bha2lzdGFuLWFubm91bmNlcy1mcmVzaC1iYW4tb24tY3J5cHRvLWJ1dC1hZG9wdGlvbi1hcy1hLWhlZGdlLXJlbWFpbnMtcG9wdWxhci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Pakistan Announces Fresh Ban on Crypto, but Adoption as a Hedge Remains Popular - CoinDesk",
        "content": "The minister said that the Financial Action Task Force (FATF) had set a condition that cryptocurrency will not be legalized to keep it off the international finance watchdog's so-called \"Grey List,\" according to one local news outlet, and another said Pakistan's stated position is because it goes against the conditions set by the FATF."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE4L3ZhbmVjay1zYXlzLWJpdGNvaW4tc3BvdC1ldGYtbm90LWxpa2VseS1pbi10aGUtdXMtaW4tbmVhci1mdXR1cmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "A Bitcoin-Spot ETF Is Unlikely in US in the Near Future, VanEck CEO Says - Bloomberg",
        "content": "Investors aren’t likely to see a Bitcoin-spot exchange-traded fund offered in the US anytime soon, according to VanEck Chief Executive Officer Jan Van Eck .\n\n“No chance,” Van Eck said as part of a panel at the Bitcoin 2023 conference in Miami Beach on Thursday. “Even if the SEC loses the Grayscale litigation, they’ll just drag their feet. So I just don’t see that in the next year and a half.” Van Eck was referring to asset-manager Grayscale Investments’s ongoing lawsuit against the US Securities and Exchange Commission in which it’s attempting to convert its Bitcoin trust into an ETF."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2RvcnNleS1mdW5kaW5nLWJpdGNvaW4tdm91Y2hlci1zZXJ2aWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Twitter Co-founder Dorsey Leads $6M Investment in Bitcoin Voucher Service - Blockworks",
        "content": "Jack Dorsey has led a $6 million funding round for Azteco, a provider of bitcoin (BTC) vouchers, highlighting the Twitter co-founder and Block CEO’s continued commitment to driving advancements in the cryptocurrency landscape.\n\nAzteco, established in 2014, says it uncovered a significant disparity in global banking access, with over 2 billion smartphone users lacking regular financial services.\n\nTo address this, Azteco says it devised a practical solution by harnessing the potential of bitcoin as a cost-effective and secure alternative. Through its technology, the company says it enables the unbanked population to store value, engage in transactions and access credit without requiring a traditional bank account.\n\nAzteco likes to refer to its vendor sites as “ATM-less ATMs.”\n\nThe company claims to make buying bitcoin as easy as purchasing mobile phone credits. Here’s how it works: You can visit an Azteco outlet with cash or a credit card. At the outlet, you can buy an Azteco voucher. You then go to their website and redeem your voucher.\n\nDuring the redemption process, you must provide the bitcoin address where you want the bitcoin to be sent. Azteco takes care of the rest, ensuring your bitcoin is delivered to the specified address.\n\nHaving initially launched as a test site in Shoreditch, East London, Azteco quickly expanded its reach. Today, the availability of Azteco vouchers extends to an extensive network of retail locations spanning 195 countries.\n\nNotably, Azteco stated in 2019, it did not require Know Your Customer verification checks, simplifing the process for users seeking to enter the world of digital currencies. Blockworks has reached out to the firm for comment on whether this remains the case.\n\nDorsey said a profound admiration for their mission drove his contribution to Azteco.\n\n“The unbanked population is immense. We have the technology and resources to close this gap, but until now, no one has taken that important next step,” Dorsey said in a statement on May 18.\n\n“Azteco is providing so much more than just access to a secure financial system; it is building an ecosystem of financial self-determination that is secure and supported by local communities. I am honored to support them,” he said.\n\nAzteco’s co-founder Paul Ferguson said the funding received will serve as a catalyst for the company’s market activation and product refinement endeavors. This boost will empower Azteco to effectively reach and engage with consumers with a particular focus on Latin America and Europe, amplifying their impact in the industry, he said.\n\nOther investors in the round included Lightning Ventures, Hivemind Ventures, Ride Wave Ventures, ALeka Capital and Visary Capital.\n\nDorsey, known for his active involvement in the crypto realm, continues to make waves in the industry. His payments firm, Block, recently made headlines by embarking on a mission to revolutionize the bitcoin mining landscape.\n\nBy developing its own specialized silicon for mining hardware, Block aims to disrupt the status quo and bring forth innovative advancements to cryptocurrency mining.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93ZS1hc2tlZC1jaGF0Z3B0LWlmLWV0aGVyZXVtcy1wcmljZS1jYW4tZmxpcC1iaXRjb2luLWluLXRoZS1uZXh0LTUteWVhcnMtaGVyZXMtdGhlLWFuc3dlci_SAXdodHRwczovL2NyeXB0b3BvdGF0by5jb20vd2UtYXNrZWQtY2hhdGdwdC1pZi1ldGhlcmV1bXMtcHJpY2UtY2FuLWZsaXAtYml0Y29pbi1pbi10aGUtbmV4dC01LXllYXJzLWhlcmVzLXRoZS1hbnN3ZXIvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "We Asked ChatGPT If Ethereum’s Price Can Flip Bitcoin in the Next 5 Years, Here’s the Answer - CryptoPotato",
        "content": "A topic as old as time, if time was a few years old – will Ethereum flip Bitcoin in terms of total market cap? Will ETH overtake BTC?\n\nThis has been the “to be or not to be” in the cryptocurrency industry, and it pins communities against each other like no other. It’s true that BTC has been the predominant market leader ever since it has been created, but a few years ago, who would have thought that another cryptocurrency would have a market cap worth over 40% of Bitcoin’s? Well, that’s the case for Ethereum today.\n\nSo, we decided to do what any sane person in 2023 would do – ask an AI language model what it (?) thinks. ChatGPT is all the rage in 2023, so who better to ask?\n\nCan Ethereum Flip Bitcoin?\n\nFirst things first, we prompted ChatGPT with this exact question: “Do you think Ethereum’s price can flip Bitcoin’s price in the next 5 years?”\n\nThe AI came back to us, explaining that this is an outcome that’s “uncertain and depends on various factors.”\n\nThese include:\n\nAdoption Rates\n\nAccording to ChatGPT, Ethereum’s robust ecosystem and use cases, such as DeFi, NFTs, and whatnot, could help it flip Bitcoin.\n\nEthereum’s broader use cases, such as DeFi (Decentralized Finance), NFTs (Non-Fungible Tokens), and smart contracts, could potentially drive wider adoption and thus increase its value relative to Bitcoin.\n\nHere’s where it got kind of interesting. You see, ChatGPT’s most recent knowledge cut-off on this topic was in September 2021. This means that it was before Ethereum transitioned to Proof-of-Stake.\n\nThat said, the second factor, according to the AI, is:\n\nNetwork Upgrades\n\nChatGPT argues that “the successful completion of Ethereum’s planned upgrades, such as Ethereum 2.0, could significantly affect its price. This upgrade plans to improve the scalability, security, and sustainability of Ethereum, which could increase its attractiveness to investors and users.”\n\nWell, Ethereum’s transition to proof-of-stake, otherwise known as “The Merge,” is already a fact in our timeline, and so far, it hasn’t really helped it get there.\n\nWhat Else Could Help ETH Flip BTC?\n\nThe flippening can also take place under a few more conditions, according to ChatGPT. Regulation, for once, is among the factors.\n\nChanges in cryptocurrency regulation could impact prices. More restrictive regulations could lower prices, while more accommodating ones could raise them.\n\nWhile it does sound like an answer from Captain Obvious, it is true. Favorable regulation could push ETH’s price, but so far, the US government has taken a predatory approach, calling many of the projects built on Ethereum securities.\n\nGoing forward, the AI believes that market sentiment is also important. If enough investors believe Ethereum to be the better form of investment, it would inevitably lead to the flippening.\n\nLast but not least, the broader economic factors, including inflation, economic growth, and overall changes in the financial sector, could also have an impact.\n\nIn conclusion, ChatGPT took a more cautious position and didn’t provide a straightforward yes or no answer. This was somewhat expected, but it what arguments would an AI use to structure a response to a question of this kind.\n\nOf course, none of the above should be construed as financial advice. The content is solely for educational and entertaining purposes, and we do hope you had fun with it."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJpc2stdXMtZGVidC1kZWFsLXRvLXRyaWdnZXItMXQtbGlxdWlkaXR5LWNydW5jaC1hbmFseXN0LXdhcm5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin price risk? US debt deal to trigger $1T liquidity crunch, analyst warns - Cointelegraph",
        "content": "Bitcoin (BTC) stares at potential losses heading into the third quarter of 2023 after United States lawmakers will likely reach an agreement on raising the debt ceiling.\n\nA $1 trillion liquidity hole ahead\n\nRaising the debt ceiling means the U.S. Treasury could issue new bonds to raise cash to meet its previous obligations.\n\nAs a result, the cash pile at the Treasury General Account could increase from $95 billion in May to $550 billion by June and to $600 billion in the three months afterward, according to the department's recent estimates.\n\nU.S. debt limit increases over the years. Source: Bloomberg\n\nAri Bergmann, the founder of risk management firm Penso Advisors, estimates that the Treasury will cross $1 trillion by the end of Q3, 2023.\n\n“My bigger concern is that when the debt-limit gets resolved — and I think it will — you are going to have a very, very deep and sudden drain of liquidity,” said Bergmann, adding:\n\n“This is not something that’s very obvious, but it’s something that’s very real. And we’ve seen before that such a drop in liquidity really does negatively affect risk markets, such as equities and credit.”\n\nIn other words, the cash available to buy riskier assets like stocks, Bitcoin and cryptocurrencies will all likely experience downward price pressure at some point after the debt ceiling is raised.\n\nBloomberg adds:\n\n“Estimated at well over $1 trillion by the end of the third quarter, the supply burst would quickly drain liquidity from the banking sector, raise short-term funding rates and tighten the screws on the US economy just as it’s on the cusp of recession. By Bank of America Corp.’s estimate it would have the same economic impact as a quarter-point interest-rate hike.”\n\nWill Bitcoin price remain rangebound?\n\nSuch macroeconomic hurdles could prevent Bitcoin from reclaiming its yearly highs of over $30,000 in the coming months, says independent market analyst Income Sharks.\n\n\"We most likely range between 20k to 30k and even get an altseason,\" the analyst noted, adding:\n\n“New money isn’t coming in; it’s all just rotating [...] Unless we get a new narrative or Stocks to find a way to rally, it’s looking more likely that the U.S. elections in 2024 will be the next big catalyst.”\n\nBTC price chart technicals meanwhile show BTC/USD consolidating below its 50-day exponential moving average (50-day EMA; the red wave), near $27,650.\n\nBTC/USD daily price chart. Source: TradingView\n\nFailure to decisively breakout above this important resistance area will increase the chances of a pullback.\n\nTraders should then watch for a possible correction toward the 200-day EMA near $25,000 — the next major support area, particularly if the Fed hikes by 25 basis points in June.\n\nRelated: Bitcoin, gold and the debt ceiling — Does something have to give?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oeXBlcmJpdGNvaW5pemF0aW9uLWNvbWluZy1zYXlzLWJpdGNvaW4tb2ctYXMtd2hvbGVjb2luZXJzLWhpdC0xLW1pbGxpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Hyperbitcoinization coming, says Bitcoin OG as 'wholecoiners' hit 1M - Cointelegraph",
        "content": "Bitcoin (BTC) has crossed a significant threshold this month — and while it does not involve price, it does involve “millions.”\n\nData from on-chain analytics firm Glassnode confirms that as of May 18, there are over 1 million addresses that hold at least 1 BTC.\n\nBack: Adoption trend lays path to “hyperbitcoinization”\n\nIt was a long time coming and received much attention on social media, and the time is finally here — there are 1 million entities that own a whole Bitcoin.\n\nThese “wholecoiners” have been steadily accruing since mid-2021, Glassnode shows, and the upward trend in 1-BTC wallets has seen almost no reversal since.\n\nIn 2022, however, the trend accelerated, having started the year with 814,000 wholesalers and finishing it with 978,000 — an increase of 20%.\n\nReacting, Adam Back, CEO and co-founder of Bitcoin firm Blockstream, made a case for “hyperbitcoinization” soon to come.\n\nShould the existing trend continue, he argued, BTC price growth would soon make buying it not only a luxury but something unattainable altogether.\n\nThis would happen, he tweeted, “because 10mil people trying to buy 1 BTC over a few years would push the price out of reach.”\n\n“And many current hodlers are not selling,” he continued.\n\n“Eg very few of the recent whole coiners would re-sell, probably moving up to their next target for extra bitcoin, most are trying to buy more!”\n\nBitcoin: Number of addresses with a balance ≥ 1 chart. Source: Glassnode\n\nAs Cointelegraph reported, existing Bitcoin investors who are long-term market participants have broadly resisted the urge to sell through the recent bear market and subsequent price recovery.\n\nAt the same time, an uptick in short-term holders, or speculators, in 2023 has got some excited about the birth of a new Bitcoin bull market.\n\nWhale numbers halt 2022 decline\n\nGlassnode data, meanwhile, shows that at the other end of the spectrum, whale wallets have become stagnant.\n\nRelated: Sink or swim at $27K? 5 things to know in Bitcoin this week\n\nEntities with between 1,000 BTC and 9,999 BTC are now showing signs of recovery after falling from mid-2022 onward.\n\n10,000+ BTC entities, on the other hand, remain in a range entered following the FTX collapse last November. There are currently 117 such entities.\n\nBitcoin: Number of addresses with balance ≥ 1K chart. Source: Glassnode\n\nObservers, such as monitoring resource Material Indicators, often note that the largest classes of whales still exert the most influence over BTC price action thanks to their trading activities.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LndoYXRiaXRjb2luZGlkLmNvbS9wb2RjYXN0L2lzLWJpdGNvaW4td2FyZmFyZdIBRGh0dHBzOi8vd3d3LndoYXRiaXRjb2luZGlkLmNvbS9wb2RjYXN0L2lzLWJpdGNvaW4td2FyZmFyZT9mb3JtYXQ9YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Is Bitcoin Warfare? With Jason Lowery - What Bitcoin Did",
        "content": "Jason Lowery is a Major in the US Space Force and the author of Softwar: A Novel Theory on Power Projection and the National Strategic Significance of Bitcoin. In this interview, we discuss how he is building the case within the US Department of Defence that Bitcoin represents a new form of digital warfare that the US government needs to embrace to secure its power projection in cyberspace.\n\n- - - -\n\nJason Lowery burst onto the Bitcoin scene in August 2021. When a senior member of the US Space Force enters the Bitcoin debate, it tends to turn heads! But, it was his novel projections of what value Bitcoin presents to society that generated interest and controversy. Bitcoiners have long espoused Bitcoin as a peaceful revolution. Jason thinks Bitcoin can be used as a tool of warfare.\n\nIn Softwar, Jason’s recently released book on the national strategic significance of Bitcoin, he explains the background of modern warfare, tracing its roots back to the struggle for survival in all forms of life. From single-cell organisms upwards, all of life is involved in a fight for control over resources and territory. Competition has resulted in an ecological arms race manifested through evolutionary cycles of improvements in physical power and the projection of that power.\n\nSoftwar explains that humans are just another life form involved in this competition for survival. Humans, however, have become increasingly efficient at power projection techniques, from wielding fire to using nuclear weapons. Now, as we accelerate through the digital age, humans need to develop and harness new and innovative methods to maintain their advantages over adversaries.\n\nIn his role within Space Force, which is developing the means to project power beyond our planet, Jason has been contemplating what other tools will be required as another arena for the competition opens up: cyberspace. Jason argues that Bitcoin has the potential to be a revolutionary cybersecurity system. Proof of Work is an innovation that moves the fight to the enemy, imposing a cost on those wishing to undertake an attack.\n\nSoftwar is a call to action for the US Department of Defence to adopt Bitcoin as a tool of warfare in the new cyberspace battlefield. Whilst designed to secure money, PoW can, in theory, be used to secure other forms of data. Whether you agree with this assertion or not, Jason is making progress within the DoD in arguing Bitcoin’s utility makes it too important for the Department of Treasury and Federal Reserve jurisdiction. And who would bet against the DoD in a fight!"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vbW9uZXkuY29tL2Jlc3QtYml0Y29pbi1taW5pbmctc29mdHdhcmUv0gE4aHR0cHM6Ly9tb25leS5jb20vYmVzdC1iaXRjb2luLW1pbmluZy1zb2Z0d2FyZS8_YW1wPXRydWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "9 Best Bitcoin Mining Software - Money",
        "content": "The best bitcoin mining software makes it easy to earn a passive income through crypto by lending your hardware’s processing power to the Bitcoin network. Choosing the appropriate software for your machine is just as important as finding high-quality components for it.\n\nThere are dozens of Bitcoin mining software to choose from, each with different features and intended for specific use cases. To assist in your decision-making process, we have identified the top mining software options and provided a breakdown of their features, how they work and who could benefit from them. Keep reading to learn more about the best bitcoin mining software of 2023.\n\nDisclaimer: Bitcoin mining is an energy-intensive process that is now considered a burden on the environment, and there are discussions on a global level on how to further regulate the industry. See more below.\n\nOur Top Picks for the Best Bitcoin Mining Software of 2023\n\nAds by Money. We may be compensated if you click this ad. Ad Build your ultimate crypto portfolio Public provides investors, from beginners to experts, with a comprehensive crypto trading experience, on a powerful yet user-friendly platform. Start investing today by clicking on your state! Hawaii Alaska Florida South Carolina Georgia Alabama North Carolina Tennessee RI Rhode Island CT Connecticut MA Massachusetts Maine NH New Hampshire VT Vermont New York NJ New Jersey DE Delaware MD Maryland West Virginia Ohio Michigan Arizona Nevada Utah Colorado New Mexico South Dakota Iowa Indiana Illinois Minnesota Wisconsin Missouri Louisiana Virginia DC Washington DC Idaho California North Dakota Washington Oregon Montana Wyoming Nebraska Kansas Oklahoma Pennsylvania Kentucky Mississippi Arkansas Texas Download App Offer valid for U.S. residents 18+ and subject to account approval. There may be other fees associated with trading. See Public.com/disclosures.\n\nBest Bitcoin Mining Software Reviews\n\nBest for Experienced Miners: CGMiner Start Mining\n\nPros Open-source\n\nSupports multiple operating systems\n\nCompatible with multiple types of hardware\n\nMine multiple cryptocurrencies at once Cons Command-line interface only\n\nNot for beginners\n\nSome compatibility issues with Windows 10\n\nHIGHLIGHTS Platform Windows, Mac, Linux Fees None Complexity High\n\nWhy we chose it: CGMiner is one of the original Bitcoin mining software on the market, offering an open-source mining program that is cross-compatible with multiple operating systems and mining hardware configurations. Open-source software allows you to modify the software as you wish and there are no licensing restrictions with how it is used. Founded in 2011, CGMiner has been kept up-to-date since, and is a great option for single miners or mining pools.\n\nCGMiner offers several options for customization, allowing users to control fan speeds, overclock their processors and set up remote control of their unit. CGMiner can also scale with your hardware setup and needs, supporting Field-Programmable Gate Array (FPGA), Graphics Processing Unit (GPU), and Control Processing Unit (CPU) mining, as well as Application-Specific Integrated Circuit (ASIC) hardware.\n\nCGMiner utilizes a command-line interface that only allows for text-based commands (similar to using Command Prompt in Windows), which may be too complicated for beginners to set up. The software is compatible with Mac, Windows and Linux computers, though Windows Defender on Windows 10 may cause issues with getting the software working.CGMiner supports several cryptocurrencies as well, including Bitcoin, Litecoin and Dogecoin. The software is available for free on GitHub.\n\nBest for Beginners: NiceHash Miner Start Mining\n\nPros Simple user interface\n\nSetup takes only a few minutes\n\nMobile app available Cons QuickMiner only works with NVIDIA cards\n\nCan only mine Bitcoin\n\n2% fee assessed on payments\n\nHIGHLIGHTS Platform Windows, Mac, Linux Fees 2% fee for payments Complexity Low\n\nWhy we chose it: NiceHash is an easy-to-use Bitcoin mining software with a simple interface that allows users to choose their hardware type and download the appropriate software. Once set up (which only takes a few clicks), NiceHash will optimize the mining operations for your software and hardware setup, without the need to tweak settings.\n\nNiceHash offers two software versions: the NiceHash QuickMiner software, which is suitable for beginners, and the NiceHash Miner software, which is open to more hardware types. Both software versions automatically detect the hardware you are using and will configure your mining to the optimal settings; simply hit “start mining” to begin. There is also a mobile app with a well-designed interface that's perfect for beginners who want to get started right away.\n\nNiceHash Miner supports Bitcoin mining only, but it does offer a crypto wallet that supports multiple cryptocurrencies. Just be aware that it charges a 2% payment fee when depositing Bitcoin into your wallet.\n\nBest for Different Cryptos: Cudo Miner Start Mining\n\nPros Supports 9 cryptos from five algorithms\n\nAuto-detects the most profitable coin to mine\n\nSupports GPU, CPU and ASIC miners Cons High fees for miners (up to 6.5%)\n\nNo built-in crypto wallet\n\nHIGHLIGHTS Platform Windows, Mac, Linux Fees 1.5% - 6.5% Complexity Low\n\nWhy we chose it: Cudo Miner is a well-designed and versatile cryptocurrency mining software that supports nine crypto on five different algorithms. Cudo also uses artificial intelligence to automatically detect the best performing coin and switch over to that coin for you, enhancing your mining profitability.\n\nBesides having nine coins for mining, Cudo also offers four different cryptocurrency payout options: bitcoin, CUDOS, Ethereum, Monero and Alogrand. It supports GPU, CPU and ASIC mining as well as Windows, Mac and Linux devices.\n\nCudo Miner is free to download and set up, but it charges a fee based on the amount of cryptocurrency mined over a 30-day period. While top miners that produce over 10 BTC are only charged a 1.5% mining service fee, users that mine less than 0.005 BTC over a 30-day period are charged 6.5%, which is high.\n\nPros Utilizes BFGMiner mining engine\n\nGraphical interface for ease-of-use\n\nOpen-source code available on GitHub Cons Not natively compatible with Mac or Linux\n\nDoesn't have many advanced settings\n\nHIGHLIGHTS Platform Windows (Mac and Linux requires additional software) Fees None Complexity Medium\n\nWhy we chose it: MultiMiner is an open-source Bitcoin mining software available on GitHub with no licensing requirements. This means that users can modify the software as needed to fit their own mining needs. MultiMiner was developed by the founder of BFGMiner, and actually utilizes the same mining engine as BFGMiner.\n\nMultiMiner is popular with beginners, as it utilizes a graphical user interface that makes it easy to choose your settings and set up mining rigs. It has built-in hardware detection and gives you the supported parameters based on your hardware setup.\n\nMultiMiner also allows you to mine multiple cryptocurrencies and supports ASIC, GPU and CPU mining hardware. And while the software supports Windows, Mac and Linux operating systems, you need additional software to achieve full compatibility with Mac and Linux.\n\nMultiMiner is beginner-friendly, but also allows customization and access to an API. Overall, it's a great open-source Bitcoin mining software that's available for free.\n\nBest for Automation: Kryptex Miner Start Mining\n\nPros Can run in your computer's background\n\nSupports mining several cryptocurrencies\n\nAutomated coin switching for maximum profit\n\nMultiple payout methods (BTC or cash) Cons Charges high withdrawal fees\n\nDoesn't work well on basic hardware\n\nHIGHLIGHTS Platform Windows Fees 0.00005 BTC (or 3%) Complexity Low\n\nWhy we chose it: Kryptex Miner is a cryptocurrency mining software that uses your computer power to mine Bitcoin and other cryptocurrencies in the background. The software is only available for Windows, and registered users can download it for free.\n\nKryptex Miner will switch between several cryptocurrencies to mine the most profitable coin available, and payouts are made in BTC or your local currency (such as the U.S. Dollars).\n\nSince the software can mine while you’re using the computer for other purposes (using “lite mode”) Kryptex is a great way to automate your Bitcoin mining. Nevertheless, it charges a withdrawal fee of 0.00005 BTC on all Bitcoin withdrawals, which may be a large fee if withdrawing small amounts of BTC. Cashing out in fiat money comes with high fees as well (usually about 3%).\n\nKryptex Miner does not support Mac or Linux operating systems, and while you can install it on any Windows machine, don’t expect to earn much unless you have a powerful computer. Still, Kryptex Miner is a great way to automate crypto mining using hardware you may already have.\n\nBest Cloud-Based Platform: Ecos Cloud Mining Start Mining\n\nPros No hardware requirements\n\nRent processing and electricity from Ecos\n\nCompletely cloud-based Cons Profit depends on future price of BTC\n\nProfit calculator may be misleading\n\nHIGHLIGHTS Platform Cloud-based Fees Starting at $49 Complexity Low\n\nWhy we chose it: Ecos is a cryptocurrency cloud mining platform that allows you to purchase cloud mining contracts and rent power and equipment to mine Bitcoin. There are no hardware or utility requirements, as Ecos manages both, and the built-in profitability calculator can help estimate your earnings.\n\nEcos has you pick a Bitcoin (future) price prediction and contract duration, as well as the amount you want to spend on processing power. This will help you see an estimated profit percentage using the platform. You can then purchase your contract by paying an up-front fee to begin mining.\n\nEcos offers daily payouts into your Bitcoin wallet, and even has a mobile app to check in on your progress. But be aware that the calculator is not 100% accurate, and you may be able to achieve more Bitcoin profit by mining on your own.\n\nIf you want a hands-off approach to Bitcoin mining, Ecos is one of the best options on the market.\n\nBest for Centralized Management: Awesome Miner Start Mining\n\nPros Manage multiple miners in one place\n\nSupports 50 mining engines\n\nSupports multiple types of hardware\n\nRemote access available via browser Cons Monthly subscription required for all features\n\nMac OS not supported\n\nHIGHLIGHTS Platform Windows, Linux Fees $2/month per miner Complexity Medium\n\nWhy we chose it: Awesome Miner is a powerful Bitcoin mining software that offers centralized management of your cryptocurrency mining farm or mining pool. It integrates with over 50 mining engines and works with all of the most popular algorithms.\n\nAwesome Miner is designed for large-scale crypto miners. It supports several cryptocurrencies and has a well-designed user interface that allows you to see all of your mining hardware activity in one place.\n\nBesides granting you remote access from almost any device, it also allows you to:\n\nAutomatically switch between mining algorithms\n\nEnable the mining pools of your choice\n\nAutomatically mine the most profitable coins\n\nIntegrate the system with your own custom mining software\n\nAwesome Miner supports multiple hardware configurations (FPGA, ASIC, GPU, CPU), and is supported on both Windows and Linux devices. Mac OS is not supported, though you can access the Awesome Miner dashboard from any web browser (including Safari).\n\nAwesome Miner has a free version available, but it has limited features. Subscriptions start at $2 per miner per month, with discounts available to annual subscribers.\n\nBest for Fast Setup: EasyMiner Start Mining\n\nPros Mine Bitcoin, Litecoin and other crypto\n\nAutomatically starts mining upon activation\n\nEasy-to-use interface Cons Only supports CPU and GPU mining\n\nForces Litecoin mining\n\nWebsite is very dated\n\nHIGHLIGHTS Platform Windows Fees None Complexity Low\n\nWhy we chose it: Easy Miner is not a misnomer. As an open-source software that's free to download, it allows users to quickly start mining Bitcoin and Litecoin with just a few clicks. Easy Miner is also designed to detect your mining hardware and optimize the settings for profitability.\n\nEasy Miner offers a graphical user interface that is great for both beginners and advanced users who want to quickly configure their mining setup. The software is designed to mine both Bitcoin and Litecoin simultaneously. Upon activation, Easy Miner will automatically create a Litecoin wallet, begin mining using your CPU and give you Litecoin reward.\n\nThe Easy Miner interface lets you quickly switch between mining pools, update your network settings and check the details of your crypto wallets. But Easy Miner does not support FPGA or ASIC mining, relying instead on slower mining hardware (CPU and GPU) only.\n\nIf you’re a beginner, or simply want to ramp up your mining operation very quickly, Easy Miner is a good option.\n\nAds by Money. We may be compensated if you click this ad. Ad Take your Cryptocurrency potential to the next level Crypto Wallets make life on the blockchain simple and secure. Take control of your investment by downloading your wallet today. Download App\n\nOther companies we considered\n\nPros Allows you to mine Bitcoin from your iPhone Cons Only for ARM64 iOS Devices\n\nAdvanced setup process\n\nWhy it didn’t make the cut: MobileMiner is an CPU miner for ARM64 iOS Devices. It will use your iPhone’s spare processing power to mine Bitcoin. While the concept is interesting, it’s specifically ARM64 devices. Plus, you can’t get it on the App Store, and the set up process can be advanced for average users.\n\nPros Free Bitcoin cloud mining\n\nUse funds to save on trading fees Cons Must create a StormGain account\n\nDoesn't allow you to withdraw funds\n\nWhy it didn’t make the cut: StormGain is a cryptocurrency exchange that offers Bitcoin cloud mining for free, once you create a StormGain account. The Bitcoin is stored in a StormGain wallet but the funds can only be used to save on trading fees, you can’t withdraw them.\n\nBitcoin Mining Software Guide\n\nIt’s easy to see the appeal of crypto mining: spin up a rig, connect to a mining pool and earn Bitcoin while you sleep. But to do this, you’ll need the right software to complement your hardware setup.\n\nBitcoin mining software are specialized tools that use your machine’s processing power to generate new coins and introduce components to the Bitcoin blockchain.\n\nHow does Bitcoin mining software work?\n\nBitcoin mining software makes use of your hardware’s processing power to solve complex mathematical computations in search of a hash, an alphanumeric code that represents data — mostly transactions — on the Bitcoin blockchain or network. The hash contains the information for the next block in the network as well as the previous block, which ensures the data is accurate and in order. The computer that solves for the hash is allowed to mine the next block on the Bitcoin blockchain and collect a block reward (6.25 BTC per block as of May 9, 2023).\n\nBitcoin mining software takes as many guesses at the hash as possible in the shortest amount of time, increasing the device's odds of earning a block reward and giving miners a competitive advantage. However, the advanced computing power required for Bitcoin mining software uses a substantial amount of electricity, which can have a considerable environmental impact.\n\nBitcoin mining software pros and cons\n\nDespite its straightforward appearance, crypto mining is a complex activity with some considerable caveats that neither crypto trading nor staking share. We recommend anyone who is seriously considering bitcoin mining as a source of income to review its benefits and drawbacks before they start investing.\n\nPros of Bitcoin Mining Cons of Bitcoin Mining Contributes to Bitcoin’s growth and stability . Becoming a miner, be it alone or as part of a group, helps ensure the longevity of the Bitcoin blockchain. For Bitcoin enthusiasts, this promotes the financial inclusion, innovation and democratization the coin espouses. Consumes a large amount of energy. Crypto mining in general requires a large amount of electricity to power the machines that solve hashes for miners. Bitcoin mining, however, is especially wasteful due to how competitive mining is for this digital asset. Hands-off investment . Once you have the necessary hardware and software, you only need to worry about upkeep and minor upgrades to your machine. Compare this to crypto trading, which is a more involved process that demands constant attention in order to see any profits. Expensive up front . Solo miners require high-end hardware to even have a chance at competing with others. Even those in mining pools or farms will have to invest plenty in their mining rig to get anything out of these arrangements. No interference from third parties. Bitcoin mining offers financial freedoms that other ventures do not. For example, miners can freeze their resources at any time and are not as exposed to data fraud issues from banks or centralized crypto exchanges. Can’t afford going offline. In order to have an efficient bitcoin mining operation, miners have to be online all the time. Going offline does not completely stop the mining process, but having a strong, uniform and continuous internet connection is crucial nonetheless.\n\nWhat are the average fees of Bitcoin mining software?\n\nMost Bitcoin mining software is free to download, and many of the most popular software on the market don’t charge any mining fees.\n\nThat being said, there are a few mining software companies that charge a monthly fee for using their software (usually just a few dollars per mining rig). Some software charges service fees (typically 1% to 6.5%) that are deducted from your total mining profits.\n\nBest for… Available Platforms Fees CGMiner Experienced Miners Windows, Mac, Linux None NiceHash Miner Beginners Windows, Mac, Linux 2% fee for payments Cudo Miner Different Cryptos Windows, Mac, Linux 1.5% - 6.5% MultiMiner Open-Source Software Windows (Mac and Linux requires additional software) None Kryptex Miner Automation Windows 0.00005 BTC (or 3%) Ecos Cloud Mining Cloud-Based Cloud-based Service contracts starting at $150 Awesome Miner Centralized Management Windows, Linux $2/month per miner EasyMiner Fast Setup Windows None\n\nHow to choose a Bitcoin mining software\n\nWhen looking for a quality Bitcoin mining software for your mining rig, you’ll want to review the following details:\n\nPrice\n\nMost Bitcoin mining software is free to download. However, some software charge fees on a regular basis or offer additional features behind a paywall. Others still may require both an up-front cost and ongoing expenses, like cloud-based mining services.\n\nMake sure to understand all of the costs associated with a Bitcoin mining software before purchasing or downloading it. Find out if it requires a one-time payment or charges monthly service fees, and consider how much that could eat into your crypto mining profits. Also, check whether the software puts all your bitcoin into its own wallet and charges withdrawal fees.\n\nSupported hardware\n\nSome mining software only support certain graphics cards, while others are designed for newer hardware, such as ASICs (Application-Specific Integrated Circuit) units. Make sure your hardware is supported before you settle on a Bitcoin mining software.\n\nSupported operating system(s)\n\nWhile most Bitcoin mining software supports Windows, Mac and Linux operating systems, some don't. Make sure your operating system is supported before attempting to download the mining software.\n\nUser Interface\n\nNot all mining software is designed with beginners in mind. If you’re uncomfortable with a command-line interface, make sure the Bitcoin mining software has a graphical user interface or a web-based interface. These types of interface make navigating the software much easier.\n\nHow long does it take to mine a bitcoin?\n\nHow long it takes to mine a bitcoin will vary widely depending on your hardware and chosen bitcoin mining software. Estimates from various sources say that solo miners can mine one bitcoin in about ten minutes, but this is only with an ideal (i.e. expensive) setup. Realistically speaking, most miners will be able to mine a bitcoin in around 30 days.\n\nMoreover, while it's possible to determine how much time it would take to mine a single bitcoin, it’s technically impossible to do as much — at least as a solo miner. This is because bitcoin mining is a binary game: You either win the network’s current block reward for solving a hash or lose against other miners in the race. That is to say, you either earn 6.25 BTC or you don’t.\n\nThis “rule” doesn’t apply for mining pools or farms since miners in those groups share the block rewards between themselves. With this type of arrangement, it’s possible to accumulate fractions of a bitcoin, which may eventually add up to a single bitcoin.\n\nBitcoin Mining Software FAQs What is bitcoin mining? chevron-down chevron-up Bitcoin mining is the process of solving complicated mathematical equations in order to verify and record new bitcoin transactions. Miners receive bitcoin for processing these transactions, which is how new bitcoins enter into circulation. Mining helps maintain the Bitcoin blockchain's history but is highly competitive, requires specialized hardware and can have a markedly negative impact on the environment. How to mine bitcoin? chevron-down chevron-up Technically, all you need to start mining bitcoin is your choice of bitcoin mining software and a specialized or high-end computer. The choice of hardware comes down to either an ASIC miner, which is a computer exclusively designed for mining specific coins, or a PC with a powerful GPU (graphics card) or CPU (processor). Once you have both of these elements, you can begin the mining process and earn some bitcoin. Because companies have turned bitcoin mining into a large-scale commercial affair by using data centers with purpose-built servers, most individual miners are at a disadvantage. This is why many prospective miners choose to join a mining pool when starting out — especially if they don't have a powerful machine. Because companies have turned bitcoin mining into a large-scale commercial affair by using data centers with purpose-built servers, most individual miners are at a disadvantage. This is why many prospective miners choose to join a mining pool when starting out — especially if they don't have a powerful machine. Can I run multiple Bitcoin mining software on one computer? chevron-down chevron-up You can run multiple Bitcoin mining software on your computer, but that may not be advisable. If you do this, make sure one software is focused on your CPU and the other on GPU so they aren't trying to pilfer processing power from each other. You may also be able to set up multiple mining software to connect to different mining pools. This allows you to automatically switch to the backup software if one goes down, minimizing downtime. But most Bitcoin mining software offers automatic switching these days and are designed to run only one instance. You may also be able to set up multiple mining software to connect to different mining pools. This allows you to automatically switch to the backup software if one goes down, minimizing downtime. But most Bitcoin mining software offers automatic switching these days and are designed to run only one instance. Is Bitcoin mining software eco-friendly? chevron-down chevron-up Bitcoin mining is not eco-friendly. It used to consume only a small amount of processing power when the network was relatively small and mining difficulty was low. As the Bitcoin network has grown over the past decade, however, mining has become extremely difficult and now requires a great amount of processing power to compete for block rewards. This has made Bitcoin a very consumptive technology. In fact the Bitcoin Energy Consumption Index reports that global Bitcoin mining operations utilize more power than all of The Netherlands. This problem has spurred discussions at a global level on how to regulate Bitcoin mining to reduce its impact on the environment. This has made Bitcoin a very consumptive technology. In fact the Bitcoin Energy Consumption Index reports that global Bitcoin mining operations utilize more power than all of The Netherlands. This problem has spurred discussions at a global level on how to regulate Bitcoin mining to reduce its impact on the environment.\n\nHow We Chose the Best Bitcoin Mining Software\n\nWe researched over 15 Bitcoin mining software options and evaluated them based on price, security, functionality and ease-of-use. Since there are several ways to mine Bitcoin, we tried to include a variety of mining software choices, including support for multiple platforms and types of hardware.\n\nThe Bitcoin mining software included in our list scored high in the following categories:\n\nSecurity\n\nWhen downloading open-source software from the internet, security is of utmost importance. The mining software we've chosen typically uses SSL and encryption to ensure your computer is safe.\n\nFeatures\n\nWhether they offer one-click mining or complete customization, our top picks have some of the best and most sought-after features for various mining needs.\n\nCost\n\nMost of the mining software we've included on this list are free or only charge reasonable fees. This can help you keep more of your crypto mining profits. One exception is cloud-based mining, which has an up-front cost and ongoing expenses for renting the equipment to mine.\n\nSummary of the Best Bitcoin Mining Software of 2023"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luYmFzZS5jb20vaW5zdGl0dXRpb25hbC9yZXNlYXJjaC1pbnNpZ2h0cy9yZXNlYXJjaC93ZWVrbHktbWFya2V0LWNvbW1lbnRhcnkvd2Vla2x5LXdob3MtYnV5aW5nLXNlbGxpbmctYml0Y29pbi1tYXktMTktMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Who's buying and selling bitcoin - Coinbase",
        "content": "Market view\n\nThere are several important technical supply vs demand factors that may influence bitcoin performance in the next few months, ahead of the rewards halving event in April 2024:\n\nMt. Gox (141,686 BTC). One of the most well telegraphed sources of pressure in the months ahead may be the bitcoin that’s due to be distributed to creditors as part of the Mt. Gox rehabilitation plan. Disbursements are supposed to be made by October 31 (though the deadline may be extended), but bitcoin selling could take place before that to raise the cash needed for settlements. The general framework is that the first JPY200k (~US$1440) of each creditor’s claim will be paid in cash followed by a mix of around 70%/30% token vs cash for the remaining balance – unless a creditor has explicitly requested a different split (e.g. 100% bitcoin or 100% cash). Incidentally, the two largest creditors representing around 20% of all Mt. Gox claims have also elected to be paid in mostly bitcoin. Note that we do not know the current number of available creditors as an unspecified number have sold their claims to third parties, but the Mt. Gox collapse had initially affected around 24,000 creditors. That puts the potential upper limit of forced bitcoin selling near an estimate of 35k BTC. Currently, the Mt. Gox trustee is sitting on 137,891 BTC, a balance that has remained constant since May 2018.\n\nUala. The Central Bank of Argentina (BCRA) issued a regulatory decree on May 4 that prevents payment service providers (that offer payment accounts) in its country from carrying out crypto related operations for their clients. This is forcing around 250-300k customers of one fintech firm – Uala – to liquidate their crypto asset holdings (mainly BTC and ETH) within 30 days. Note that digital assets will have to be sold (to be settled in ARS) as the company doesn’t allow their digital wallets to transfer crypto off the platform – ruling out the possibility of self-custody. Their platform had required a minimum investment of ARS250 (~$1.08) per user. We do not know the total amount of bitcoin that has been or may need to be sold.\n\nTether. Stablecoin Tether (USDT) announced that it would start accumulating bitcoin in its reserves on a monthly basis using 15% of its net realized operating profits from investments (i.e. not including asset appreciation). Given that Tether increased its net profit by $1.5B in the first quarter, this would presumably translate into $222.3M in bitcoin purchases (equivalent to 8,234 BTC) in the first tranche of buying, based on the data from its 1Q23 Assurance Report . The attestation also indicates that bitcoin comprised $1.5B or 1.8% of its consolidated reserves as of March 31, contributing to excess reserves of $2.4B or a 3.1% capital ratio on its $79.4B outstanding liabilities. This is up from a capital ratio of 1.5% in 4Q22.\n\nPlease be aware that the list provided above is not exhaustive, and there could be additional factors or sources that may contribute to bitcoin market activity through year-end."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNjbi5jb20vd2FsbC1zdHJlZXQtYW5hbHlzdC1nYXJ5LXNoaWxsaW5nLWRvbnQtdW5kZXJzdGFuZC1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Wall Street Analyst Gary Shilling: I Don't Understand Bitcoin - CCN.com",
        "content": "Gary Shilling, a prominent and highly regarded Wall Street financial analyst, recently said in an interview that he doesn’t understand Bitcoin and do not intend to invest in “things that are not transparent.”\n\nWhile his statement was factually inaccurate, as Bitcoin is the most transparent financial network in existence due to its decentralized blockchain network, it is optimistic to see investors acknowledge their lack of knowledge in Bitcoin, rather than simply calling out Bitcoin as a “bubble” or a “fraud,” as figures such as JPMorgan CEO Jamie Dimon did in the past.\n\nShilling Doesn’t Want to Invest in Bitcoin Because he Doesn’t Understand It\n\nOver the past 12 months, the viewpoints of analysts and billionaire investors such as Mark Cuban, Peter Schiff, and Gary Shilling have changed drastically. Cuban, who had consistently described Bitcoin as a bubble, inevitably invested in Bitcoin through a Swedish Bitcoin exchange-traded note (ETN) known as XBT provider. SchiffGold, the company of Peter Schiff that is overseen by GoldMoney, integrated Bitcoin for its clients.\n\nIn a recent interview with Business Insider, Shilling admitted that he does not understand the technical intricacies and the fundamental concept of Bitcoin. Shilling said:\n\n“I recently met a friend of mine, a West Coast venture capitalist. He was very early on this [Bitcoin]. He’s made a lot of money on this and so on. I cornered him at a cocktail party and I said ‘Now listen, I want you to explain to me what this really is.’ I’m just very suspicious of things that are not transparent. If i can’t understand it, I don’t want to invest in it.”\n\nShilling’s investment method is praiseworthy and should recommended to casual investors. It is definitely not intelligent for investors to invest in assets and currencies that they do not have solid knowledge of. As Hacked.com reported, Bitcoin and security expert Andreas Antonopoulos advised investors to only invest an amount of money in Bitcoin that is proportional to their knowledge in the cryptocurrency. He said:\n\n“My small savings that I do have are invested in bitcoin. 100 percent [of it]. I actually have a tiny debt in US dollars that I’m still trying to pay off so it is more than 100 percent in bitcoin. Now, I’d like to emphasize again, that is not a recommendation to invest. Because I haven’t invested by money in bitcoin, I invested my career, my intellectual capacity, my creativity energy, my passion, and my work in bitcoin. The money is the least of the investment that I have made in bitcoin and I could lose everything of it and I’d still have everything else.”\n\nLandscape is Changing, More People are Starting to Understand Bitcoin\n\nIf investors do not understand Bitcoin and its concept of a peer-to-peer decentralized financial network, they should not invest in it. For investors like Shilling who has been exposed to the centralized monetary system of fiat currency for many decades, it is significantly more difficult to grasp the concept of decentralized networks and peer-to-peer financial systems.\n\nBut, more investors are starting to understand it. As Shilling noted, many venture capitalists, institutional investors, and large-scale retail traders have started to invest in Bitcoin. Most notably, Fidelity and Mike Novogratz have been strong advocates of Bitcoin.\n\nMost recently, George Kikvadze, the vice president at Bitfury, one of the largest blockchain development and Bitcoin mining firms, stated:\n\n“Great to finish up dinner with one of world’s’ largest wealth funds and convince them to invest in both Bitcoin and Litecoin.”\n\nFeatured image from YouTube/Business Insider ."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMTgvZWxpemFiZXRoLXdhcnJlbnMtYmlsbC13b250LXN0b3AtbW9uZXktbGF1bmRlcmluZy1idXQtaXQtY291bGQtYmFuLWNyeXB0by_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA1LzE4L2VsaXphYmV0aC13YXJyZW5zLWJpbGwtd29udC1zdG9wLW1vbmV5LWxhdW5kZXJpbmctYnV0LWl0LWNvdWxkLWJhbi1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Elizabeth Warren’s Bill Won’t Stop Money Laundering, but It Could Ban Crypto - CoinDesk",
        "content": "If the Warren-Marshall legislation fails the necessary test, does it do more harm than good? After all, money laundering is terrible. Shouldn’t the legislation be passed even if it only helps on the margins? Here is where the harms of the legislation, namely requiring those that develop software and validate transactions on a blockchain to register as financial institutions, are so problematic. The problem is these individuals can’t practically register as a financial institution. The authors of this legislation know this and further know that requiring software developers and validators to engage in the same kind of multi-million dollar compliance regime that banks do would collapse the crypto economy, which, after all, is the point."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tYWRvcHRpb24taXMtYm9vbWluZy1idXQtbm90LWluLXRoZS11cy1vci1ldXJvcGUtYml0Y29pbi1idWlsZGVycy0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Crypto adoption is booming, but not in the US or Europe — Bitcoin Builders 2023 - Cointelegraph",
        "content": "Mass crypto adoption is already taking place around the world, but not in the United States or Europe, nor does it have Bitcoin as a flagship asset for mainstream acceptance. According to Daniel Fogg of IOV Labs, the foundation that supports smart contract platform Rootstock among other projects, the increase in adoption is instead ongoing in emerging markets, where cryptocurrencies are offering solutions to people’s everyday problems.\n\nIn an interview with Cointelegraph’s Joe Hall at the Bitcoin Builders Conference in Miami, Fogg spoke about Bitcoin pragmatism, adoption worldwide and how emerging economies are shaping the future of the crypto space.\n\nJoe Hall and Daniel Fogg at the Bitcoin Builders Conference 2023. Source: Cointelegraph\n\nAccording to Fogg, emerging markets are leading the way in crypto adoption for one major reason — countries that have significant macroeconomic challenges. In his view, many people’s first meaningful digital banking experience will be happening in emerging markets on crypto rails in the coming years.\n\n“People on the streets have a pressing need to protect their income, to get access to U.S. dollars to get a loan. [...] We’re seeing these massive shifts. For me, if you want to look at the future of what I hope crypto will become, it exists today in Turkey, Colombia, Nigeria, Argentina. It doesn’t exist today in the United States or the U.K.\"\n\nFogg believes the crypto space is evolving through two major crypto use cases. One is centered around decentralized finance (DeFi) solutions for people seeking outsized returns and alternative investment opportunities. Another use case involves people acquiring stablecoins pegged to the U.S. dollar for savings and daily payments in economies dealing with inflation, devaluation and other monetary problems.\n\n“I think there’s a kind of bifurcation in what DeFi could become, advanced DeFi, which is a lot of what I think the usage in America and Europe will be [...], and then everyday DeFi, which is what you’re going to see in emerging markets every day.\"\n\nEmerging markets offer “scale opportunity” to retail finance, said Fogg, adding that developing DeFi products for these areas is a key strategy for Rootstock and its sister company, IOV Labs. Speaking about Bitcoin pragmatism, Fogg highlighted that although Bitcoin is a remarkable innovation, Bitcoin alone is simply not enough. As told by Fogg, the crypto space doesn’t yet have an established use case for billions of users, and it may take years to achieve that:\n\n“In many cases, we think they’re paying, saving, borrowing, lending, retail finance, etc. But there are many other use cases as well. We have to experiment our way there. And if we are held back by a traditional conservative mindset around what Bitcoin could be, I think that’s to the world’s detriment.\"\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?\n\nUpdate (5/19/2023 22:00 UTC): This article has been updated to clarify that Daniel Fogg works for IOV Labs only and that IOV Labs is a foundation that supports the development of Rootstock, among other projects."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXRyYWRlcy1iZWxvdy11czI3MDAwLXUtcy1kZWJ0LWNlaWxpbmctbmVnb3RpYXRpb25zL9IBZ2h0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXRyYWRlcy1iZWxvdy11czI3MDAwLXUtcy1kZWJ0LWNlaWxpbmctbmVnb3RpYXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin trades below US$27,000 amid U.S. debt ceiling negotiations - Forkast News",
        "content": "Bitcoin rose 1.78% from May 12 to May 19 to trade at US$26,846 as of 7:30 p.m. on Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under US$30,000 since April 19. Ether rose 2.44% over the week to US$1,808 after falling below US$1,800 multiple times this week.\n\n“Looking at the charts, Bitcoin is currently demonstrating a new bear flag pattern, indicating a potential downward trend after weeks caught in a range below US$30,500, which has remained a price ceiling for numerous weeks now,” said Tim Frost, the chief executive officer of digital wealth platform Yield App. “The bear flag is presently targeting a price decline to approximately US$24,000,”\n\n“An opportunity to go long could arise around US$23,000. If the Bitcoin market were to flush out to this level, there would likely then be a bounce,” he added.\n\nThe prospect of a governmental default in the U.S. weighed down market sentiment this week after the U.S. Treasury Department reiterated on Monday that it expects to default by June 1 without a debt limit increase. President Joe Biden and House Speaker Kevin McCarthy signaled on Wednesday that they’re committed to reaching an agreement on raising the government’s US$31.4 trillion debt ceiling.\n\nOver in Europe, inflation accelerated to 7.0% in April from 6.9% a month earlier, mainly driven by rising services and energy costs. Core inflation, which excludes food and fuel, slowed to 7.3% from 7.5%, according to Eurostat. Further interest rate hikes can be expected, as inflation is still above the European Central Bank’s 2% target.\n\nLiquid Ether staking protocol Lido Finance passed the community vote to execute the Lido V2 upgrade, which went live on Monday, enabling Ether and staked Ether (stETH) withdrawals directly on the protocol. Following the upgrade, Lido’s stETH supply fell by over 437,000 stETH on Wednesday, according to Dune Analytics data.\n\nThe rate of Ordinals inscriptions, a version of non-fungible tokens on the Bitcoin blockchain, slowed down this week after the network passed a new milestone of 7 million inscriptions on Sunday, Dune Analytics data shows. However, Bitcoin network congestion remained high this week, with over 263,548 transactions waiting to be validated at 7:30 p.m. in Hong Kong on Friday.\n\nThe heightened demand for block space was mainly driven by the growth of BRC-20 tokens, the fungible tokens standard built on the Ordinals protocol. The number of different types of BRC-20s grew from 14,300 tokens on May 11 to 24,677 on Friday, according to data provider BRC-20.io.\n\nA new security concern emerged after crypto wallet firm Ledger announced the launch of Ledger Recover, an optional recovery service for users’ seed phrases — causing widespread community distress about Ledger’s potential backdoor into users’ seed phrases. Ledger Chief Technology Officer Charles Guillemet attempted to quell the fire by saying, “There is no backdoor for anyone, neither us, a provider or even a very gifted hacker to access it.”\n\nThe global crypto market capitalization stood at US$1.12 trillion on Friday at 7:30 p.m. in Hong Kong, up 1.8% from US$1.1 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$520 billion market cap accounted for 46.3% of the market, while Ether’s US$217 billion accounted for 19.4%.\n\nSee related article: Crypto and NFT Market Updates – May 18th\n\nBiggest gainers: Render and Mask\n\nThe Render Network’s native cryptocurrency was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap, rallying 39.72% to US$2.42. The token started picking up momentum on Wednesday, gaining increased interest thanks to a new toy line promo video of the Ethereum-based NFT collection, Pudgy Penguin, which was animated using the Render network.\n\nThe Render Network allows idle graphics processing units to be used for the digital rendering needed in fields like 3D modeling, gaming imagery, and virtual reality.\n\nMask Network’s governance token was this week’s second biggest gainer in the top 100, rising 25.23% to US$4.53. The token started rallying on Tuesday, after Mask announced its investment in The Open Network, to further develop its decentralized social network.\n\nMask Network is a mobile app and browser extension that aims to bridge Web 2.0 with Web 3.0.\n\nNext week: All eyes on U.S. debt ceiling negotiations\n\nAll eyes will be on the ongoing negotiations over raising the U.S. debt ceiling of US$31.4 trillion. House Speaker Kevin McCarthy suggested on Wednesday that a potential deal could come as soon as next week.\n\nInvestors will be looking forward to the release of the minutes of the U.S. Federal Open Market Committee on Wednesday, for clues about the health of the world’s largest economy. Investors will also be anticipating speeches from U.S. Treasury Secretary Janet Yellen and speeches from numerous key members of the Commodity Futures Trading Commission.\n\nFans of Didit, a digital identity and metaverse solution, are gearing up for the launch of the project’s protocol on Tuesday.\n\nSee related article: It’s a fight for the future of money in the US, says Christopher Giancarlo"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xNDA1OTUvYml0Y29pbi0yMDIzLWluLW1pYW1pLWJlYXItbWFya2V0LWxvd2VyLWF0dGVuZGFuY2XSAVJodHRwczovL2RlY3J5cHQuY28vMTQwNTk1L2JpdGNvaW4tMjAyMy1pbi1taWFtaS1iZWFyLW1hcmtldC1sb3dlci1hdHRlbmRhbmNlP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin 2023 Attendees in Miami Blame Bear Market Vibes for Lower Attendance - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThousands of people flocked to Miami Beach this week to partake in Bitcoin 2023 and talk shop about crypto’s top coin, but some attendees said the iconic conference feels different on its first day than in years past—with less hype and more empty chairs.\n\nThe conference devoted to crypto’s most dominant coin attracted around 35,000 people last year, according to the event’s website, featuring speakers like the NFL quarterback Aaron Rodgers and the tennis legend Serena Williams.\n\nBut a steep decline in digital asset prices and a wave of crypto-native blowups has dampened attendance. The conference organizers expect to see 15,000 attendees at what they call “the world’s largest Bitcoin gathering.”\n\nAD\n\nAD\n\n“It's not wall-to-wall packed like it normally is,” said Andre Hicks, a traveling nurse based in upstate New York, who’s attended the Miami-based Bitcoin conference for the past two years. “I've never ever been to one where it was just like a dead bear market like it is now.”\n\nBitcoin 2023 attendee Andre Hicks. Source: André Begansk/Decrypt\n\nHe attributed the lack of people present to a decline in disposable income for the average person, pointing to factors like high inflation. He also said most people would prefer to attend a conference where Bitcoin was rising as opposed to one where its price is depressed.\n\n“Everybody wants to win,” Hicks said. “But nobody wants to go through the stacking phase, actually teaching yourself about cryptocurrency.”\n\nGeneral admission tickets to Bitcoin 2023 cost nearly $1,000, but the cheapest option among tickets only grants attendees access to two of the conferences three days. Conference goers who spent an extra $1,300 got access to an Industry Pass, which granted them access to events set aside for Bitcoin-related businesses yesterday.\n\nBitcoin 2023 attendee Sam Miyakawa. Source: André Beganski/Decrypt\n\n“They'll get a lot more people here tomorrow,” said Sam Miyakawa, an open-source developer who’s interested in decentralized social media and contributes to Snort Social, a nostr-based project. “I didn't expect that many people to be here.”\n\nAD\n\nAD\n\nCompared to Bitcoin 2022, which Miyakawa also attended, it only makes sense that fewer people would attend this year, he said. He noted that when Bitcoin 2022 took place last April, crypto was just coming off a bull market.\n\nBitcoin 2023 attendee Will Laurent. Source: André Beganski/Decrypt\n\nIn the conference’s press room, where speakers mingled with influencers and reporters, Will Laurent, a contract worker for DFINITY, said it felt like a ghost town compared to last year.\n\nDuring Bitcoin 2022, the press room was packed, Laurent said, as people clamored to interview speakers like the Canadian entrepreneur and “Shark Tank” star Kevin O’Leary or the Bitcoin Foundation’s Chairman, Brock Pierce.\n\n“They still might come in,” Laurent said, referring to the two former speakers. “But where are all the other people?”"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc3RyaWtlLWV4cGFuZHMtZ2xvYmFsLXJlYWNoLWludHJvZHVjZXMtdXNkdC1zdXBwb3J0LWFuZC11bnZlaWxzLWVuaGFuY2VkLWFwcC1hdC1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Strike Expands Global Reach, Introduces USDT Support And Unveils Enhanced App At Bitcoin 2023 Conference - Nasdaq",
        "content": "At Bitcoin 2023 in Miami Beach, global bitcoin payments service Strike announced that their service is now available in 65 more countries spread across six continents. This coincides with the introduction of the ability to receive funds in U.S. dollar equivalents, namely USDT. In addition, the app received a major facelift and overhaul that has made the UI cleaner, the UX friendlier and also includes a new logo.\n\nMany of the countries that have been requested by users of Bitcoin Twitter are now able to instantly send and receive money utilizing the Lightning Network. In an interview with Strike’s VP of Product, Manuela Rios, she explained that the app now has an effective reach of 3 billion people.\n\n“With Send Globally, the value prop is that you send dollars and receive as a local currency directly in a bank account on the other side … this one’s different — what we found through user research that people on the other side in jurisdictions with weak currencies would say ‘Hey this experience is amazing, but can I have a dollar equivalent?’”\n\nIn regards to purchasing Bitcoin, Rios said that “globally, you don’t see a seamless experience.” So the new Strike app also functions as a Lightning wallet where you can buy and sell bitcoin via dollar equivalent rails.\n\nAt his speech at Bitcoin 2023, Strike CEO Jack Mallers explained the wider vision of the updates, saying \"We’re delivering a cash balance that the global south can rely on, and an awesome beautiful punk unconventional black and white brand, as the Fed is driving our own banks insolvent.\"\n\nHe also highlighted the company’s response to feedback, displaying a set of tweets asking for LNURL support, shortly after announcing that the new app has LNURL support — all usernames@strike.me function as a LNURL as of the launch.\n\n“We made a lot of product changes to support what we hope to become an amazing global money app,” Mallers said. “As a company, we know what we’re fighting for, we know who we are, we changed the way we looked, but we never changed the way we felt.”\n\nIn addition to the new features and access, the app includes a simplified sign-up process in order to make signing up easier. “The end goal for us is to serve 7-8 billion people, and we’ll be stepping our way to make it to the countries that didn’t make it in this MVP,” Rios explained.\n\nRios explained the impact of the launch and additional features, saying that “For the Bitcoiners, you can expect a beautiful Lightning wallet and a cost effective way to buy bitcoin, and for the people not yet so familiar with bitcoin, but are familiar with 109% inflation, giving them access to a U.S. dollar equivalent stablecoin is massive — now you can save in something that won’t be so quickly devalued.”\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTkvYml0Y29pbi1hbmQtYnJvYWRlci1jcnlwdG8tcHJpY2VzLWxpdHRsZS1jaGFuZ2VkLWluLWV2ZW50ZnVsLW5ld3Mtd2Vlay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Broader Crypto Prices Little-Changed in Eventful News Week - CoinDesk",
        "content": "Alongside the negative impact of stalled debt negotiations was optimism on softer monetary policy following Federal Reserve Chair Jerome Powell’s comments that interest rates may not need to rise as much as previously expected. The CME Fedwatch tool is currently assigning a 79% probability to interest rates being unchanged at the next (June 14) FOMC meeting, down from 84% a week ago."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL3hycC1yaXBwbGUtY2JkYy1kZWJ0LWNlaWxpbmctYml0Y29pbi1vcmRpbmFscy_SAUdodHRwczovL2Zvcmthc3QubmV3cy94cnAtcmlwcGxlLWNiZGMtZGVidC1jZWlsaW5nLWJpdGNvaW4tb3JkaW5hbHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "XRP gains; Bitcoin Ordinals bump NFT sales; US investor sentiment up on positive default talks - Forkast News",
        "content": "Bitcoin and Ether prices fell on Friday morning in Asia. After a bullish run, Litecoin joined most other top 10 non-stablecoin cryptocurrencies in recording losses. XRP was the sole winner. It recorded gains following the launch of its new central bank digital currency (CBDC) platform by its issuer Ripple. U.S. equity futures moved higher after a strong rally in regular trading Thursday. Positive earnings reports, debt ceiling talks both played a role.\n\nSee related article: Is Tether unmoored — or just dandy?\n\nXRP makes standout gain\n\nBitcoin fell 1.97% to US$26,852.75 in the 24 hours to 7:45 a.m. Friday in Hong Kong, down 0.67% over the last seven days according to CoinMarketCap data.\n\nThe dip back below the $27,000 threshold indicated a return to a bearish trend following gains Thursday. That trend should be short lived, however, said financial analyst Tone Vays during an interview.\n\n“I do believe that we have bottomed. We are now in a halving cycle which tends to have Bitcoin go up with less than one year to the halving event.”\n\nHalving refers to a pre-programmed reduction of the rate at which new tokens are created, which reduces supply and can drive prices higher.\n\n“We have had an extended bear market and it’s just time for Bitcoin to rise again,” Vays added.\n\nLike Bitcoin, Ether fell 0.92% to US$1,804.6. However, it posted gains of 0.29% for the week.\n\nXRP was the sole gainer among the top 10 non-stablecoin cryptocurrencies. It gained 2.68% to US$0.4607 while adding 9.13% in the last seven days.\n\nThose gains followed an announcement Thursday by Ripple Labs. The payment protocol and exchange network said it is launching a platform for a CBDC as part of Hong Kong’s inaugural e-HKD (electronic Hong Kong dollar) pilot program.\n\nThe Ripple platform will offer a “frictionless end-to-end solution for central banks, governments, and financial institutions to issue their own central bank digital currency,” according to a company press release.\n\nRipple will partner with Taiwan-based Fubon Bank on the project.\n\nThe announcement followed further Ripple-related news earlier this week. On Wednesday, a U.S. federal judge denied a motion filed by the Securities and Exchange Commission (SEC) to prevent public access to the so-called Hinman document.\n\nThese internal documents relate to former SEC director William Hinman’s comments that Bitcoin and Ether are not financial securities. The decision is considered a win for Ripple Labs in its ongoing legal dispute with the SEC. The regulator accuses them of providing unregistered securities.\n\nElsewhere, most other top 10 non-stablecoin cryptocurrencies traded lower. Solana led the losers. It fell 3.4% to US$20.36, but was up 0.37% over the past seven days.\n\nLitecoin lost ground after a bullish week. It was down 3.37% to US$90.77.\n\nThe Bitcoin-like cryptocurrency had seen a surge in recent interest. This was mainly due to congestion and higher transaction fees on the Bitcoin network associated with the current popularity of ordinals. The Litecoin network has also now seen its own surge in ordinal inscriptions.\n\nOn the recent popularity of ordinals on the Bitcoin network in particular, Vays identified a solution to the operational issues it raises.\n\n“The Bitcoin main chain was not really designed for this kind of purpose,” he said. “Yes, the Bitcoin blockchain can be used for these kinds of projects. I just wish they were done on the Liquid sidechain.”\n\nThe layer 2 solution Liquid offers ways to incorporate ordinals and other initiatives on the Bitcoin blockchain without raising transactions fees, he added.\n\nThe total crypto market capitalization fell 1.44% in the past 24 hours to US$1.12 trillion. Total trading volume lost 6.46% to US$32.07 billion.\n\nSpace Pepe NFTs soar 28270%\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token market, the Forkast 500 NFT index rose 0.1% to 3,387.40 points in the 24 hours to 9:30 a.m. in Hong Kong. It was up 0.1% over the last seven days.\n\nDaily NFT sales on Ethereum, the leading blockchain for NFTs, fell 17.31% to US$14.4 million. Sales on the Bitcoin blockchain also lost 11.45% according to CryptoSlam! data to US$6.9 million.\n\nSpace Pepes, a Bitcoin NFT collection based on the Pepe the Frog meme, skyrocketed 28270% to US$7.3 million in the last 24 hours leading up to 11:30 a.m. in Hong Kong. The collection topped Cryptoslam’s NFT collection ranking by sales volume.\n\nUncategorized Ordinals — Cryptoslam’s category of Bitcoin Ordinals that are not part of one established collection — rose 140.12% to US$1.9 million over the past 24 hours.\n\nThe Mythos blockchain-based DMarket NFT collection ranked second. DMarket consists of online gaming NFTs traded on the game-item marketplace of the same name. It was acquired by blockchain game maker Mythical Games in January this year.\n\nIn individual NFT sales, Bored Ape Yacht Club’s #5042 registered the highest price. It sold for US$172,135.\n\nU.S. equities rally; hawkish noises from the Fed\n\nFederal Reserve Chairman Jerome Powell | Image: Getty Images\n\nU.S. stock futures traded higher as of 10:45 a.m. in Hong Kong, adding momentum to Thursday’s rally. The Dow Jones Industrial Average futures edged up 0.074%, while the S&P 500 futures gained 0.17%. The Nasdaq Composite futures added 0.28% after it gained 1.51% during market trading on Thursday.\n\nThe three Wall Street stock indexes rose after U.S. House of Representatives Speaker Kevin McCarthy said a bill to raise the country’s debt ceiling could be put to a vote next week. The comments followed positive talks with U.S. President Joe Biden, easing investor concerns that the U.S. could default on its debt.\n\nThat scenario, which would have major repercussions for U.S. and global markets, can be avoided if the White House and congress can agree to raise the debt ceiling.\n\nBiden and McCarthy have been actively discussing a solution to the ongoing standoff throughout this week.Biden too has expressed optimism that an agreement can be reached.\n\nDemocratic negotiators informed the president Friday that they are making “steady progress” on debt ceiling talks ahead of his attendance in Japan for the weekend’s Group of Seven summit.\n\nTreasury Secretary Janet Yellen warned earlier this month that the U.S. will start to fail to make its debt payments as early as June 1. Yellen called for fast action on raising the debt ceiling, as she said a debt default would devastate jobs and businesses in the country.\n\nOn the relationship between the crisis and crypto markets, Clara Medalie, Head of Research at crypto market data provider Kaiko, told Forkast via email that there was so far little sign of any impact based on recent price movements.This is “in large part because the event hasn’t yet played out and there remains hope that a deal will be reached before June 1,” she added.\n\nElsewhere, U.S. investors saw positive Q1 earnings results from major U.S. companies.\n\nWalmart, the world’s largest company by revenue, reported 7.6% total revenue growth for the quarter. “We had a strong quarter. Comp sales were strong globally with eCommerce up 26%. We leveraged expenses, expanded operating margin, and grew profit ahead of sales,” said Walmart President Doug McMillion in the company’s earnings report.\n\nCalifornia-based tech manufacturer Nvidia stocks jumped nearly 5% on Thursday after the company announced that it partnered with another California-based cloud software company ServiceNow to build AI for enterprises.\n\nOn interest rates, Federal Reserve Chair Jerome Powell is due to speak publicly on Friday. He is expected to signpost the central bank’s latest policy views on inflation and rates.\n\nOther members of the Fed made hawkish comments Thursday. Fed governor Philip Jefferson said the U.S. should wait to assess the full effect of higher interest rates on inflation so far before deciding to rule out further hikes.\n\nDallas Fed President Lorie Logan also said that it is not yet time to pause interest rate hikes.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006. The Fed meets again on June 14 to decide if another rate hike is necessary. Inflation was at 4.9% in April, lower than expected but still ahead of the Fed’s 2% target.\n\nThe CME FedWatch Tool predicts a 66.7% chance the Fed will leave rates unchanged in June, down from 76.2% a day prior. It predicts a 33.3% chance for another 25 basis-point rate increase."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJldGVzdHMta2V5LXN1cHBvcnQtYXMtZmVkLXJhdGUtaGlrZS1mZWFycy1zdGVhbC0yN2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin price retests key support as Fed rate hike fears steal $27K - Cointelegraph",
        "content": "Bitcoin (BTC) traded back below $27,000 on May 19 as analysis flagged large-volume trades pressuring price.\n\nBTC/USD 1-day candle chart on Bitstamp. Source: TradingView\n\nInflation specter haunts crypto markets\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting lows of $26,380 on Bitstamp.\n\nA modest recovery then took the pair to a range familiar from several days prior, this still in focus prior to the week’s final Wall Street open.\n\nDownside overnight came courtesy of increasing market expectations of an interest rate hike by the United States Federal Reserve in June.\n\nThese came thanks to low jobless claims data for the week, with Fed officials adding a hawkish tone.\n\n“On the one hand, inflation is too high, and we have not yet made sufficient progress on reducing it,” a speech by board member Philip Jefferson at the 2023 International Insurance Forum in Washington, D.C., stated.\n\n\"On the other hand, GDP has slowed considerably this year, and even though the effect has been muted in the labor market so far, demand clearly has begun to feel the effects of interest rates that are 5 percentage points higher than they were a little over a year ago.\"\n\nAccording to CME Group’s FedWatch Tool, the odds of the Fed pausing its hiking cycle next month, at one point over 95%, stood at just 62% on the day.\n\nFed target rate probabilities chart. Source: CME Group\n\nIn a detailed breakdown of the events, monitoring resource Material Indicators showed owners of bid and ask liquidity placing trades to manipulate BTC price behavior on short timeframes.\n\n“After chopping sideways, markets began to price in potential for another rate hike as the morning's Jobless Report and #FED speakers set the tone for that conversation ahead of #JPow's appearance, scheduled for Friday,” part of theTwitter commentary summarized.\n\n“As price began to drop, a ladder of bids was rugged and price moved to prior support ~$26.5k, but a sell wall was quickly placed to suppress price.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nMaterial Indicators noted that BTC/USD performed a retest of the 100-day moving average (MA) — its third in the past seven days.\n\n“After about 90 mins and a few nibbles at the sell wall, the roof was pulled. Shortly after that a new $36M block of bids was placed below local support and the melt up began,” it added.\n\nIn addition to the 100-day MA, the 200-week MA at $26,100, the analysis concluded, could also form a downside support zone next.\n\nBTC/USD 1-hour candle chart (Bitstamp) with 100-day, 200-week MA. Source: TradingView\n\nMaterial Indicators referenced the May 19 appearance by Fed Chair Jerome Powell, with the implication that further hawkish language on inflation would add to risk asset price pressure.\n\nTraders in \"wait and see\" mode\n\nTraders thus maintained potential bearish targets, focusing on a broad area around $25,000.\n\nRelated: Hyperbitcoinization coming, says Bitcoin OG as ‘wholecoiners’ hit 1 million\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, was among them, identifying $27,000 as the key support level now absent from the chart.\n\nWanted #Bitcoin to hold above $27,000-27,200.\n\n\n\nDidn’t happen, stopped out on my longs and in the waiting game now.\n\n\n\nReclaim that range, we’ll try again, or now we’ll be waiting for $26,400 sweep and/or $25,000. — Michaël van de Poppe (@CryptoMichNL) May 18, 2023\n\n“I am looking for a long if we can break above $27,500, or a short if we close below $26,600. No trade in between this tight range,” popular trader Crypto Tony tweeted.\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nTrading suite Decentrader meanwhile flagged uninspiring numbers when it came to shorts versus longs, arguing that a shift was required for price to have a shot at reclaiming higher levels.\n\n“Long/Short ratio is currently above 2 which is very high. This typically needs to resolved and move lower before things start looking bullish,” it acknowledged.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91LXMtZGVidC1jZWlsaW5nLWNyaXNpcy1idWxsaXNoLW9yLWJlYXJpc2gtZm9yLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "US debt ceiling crisis: Bullish or bearish for Bitcoin? - Cointelegraph",
        "content": "The United States has hit its $31.4 trillion debt ceiling and is running out of money.\n\nAs Treasury Secretary Janet Yellen pointed out, the debt ceiling needs to be lifted before June 1. Otherwise, the country risks missing its debt obligations due to Treasury bondholders, thereby defaulting on its sovereign debt.\n\nBipartisan negotiations are underway to lift the debt ceiling, but no agreements are in sight. While Democrats want the ceiling to be raised without any preconditions, Republicans are demanding several cuts in government spending as contingencies for lifting the ceiling.\n\nMost experts agree that a U.S. government default would be catastrophic for the U.S. economy and the global financial system: the stock markets could crash, millions of jobs could be lost, and the economy would likely fall into a recession.\n\nBut what are the chances of the U.S. government defaulting on its debt? And what are the impacts of the debt ceiling crisis on crypto and the broader market? We answer these questions in the latest Cointelegraph Report."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzE5L2NoYXRncHQtZm91bmRlci1zYW0tYWx0bWFuLWlzLWxhdW5jaGluZy1hLW5ldy1jcnlwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "ChatGPT Founder Sam Altman Is Launching a New Crypto. What Does It Mean for Bitcoin? - The Motley Fool",
        "content": "Sam Altman, the chief executive officer of OpenAI (the creator of ChatGPT), is introducing a cryptocurrency called Worldcoin. He has reportedly lined up $100 million from high-profile venture-capital investors, and he has already released a World App crypto wallet that can be downloaded to your mobile phone. Altman has big plans for Worldcoin as the first-ever cryptocurrency to be held by every person on the planet.\n\nSo what would this new crypto mean for Bitcoin (CRYPTO: BTC), currently the world's most popular digital currency? After all, in more than a decade, Bitcoin has never fulfilled some of its earliest ambitions -- such as replacing fiat currency or becoming a ubiquitous form of online payment. Could the rise of a new competitor force investors to rethink Bitcoin's valuation?\n\nWhat is Worldcoin?\n\nWorldcoin is an ERC-20 token for the Ethereum (CRYPTO: ETH) blockchain. What this means in practical terms is that Worldcoin will look (and trade) much like the cryptocurrencies that investors are already familiar with. Some of the biggest cryptocurrencies by market cap are ERC-20 tokens, including Shiba Inu (CRYPTO: SHIB) and Uniswap (CRYPTO: UNI). So in this regard, Worldcoin is not breaking any new ground.\n\nWhat makes Worldcoin stand out is the fact that it has aspirations to be both a cryptocurrency and a global identification system. With a tag line of \"the global economy belongs to everyone,\" Sam Altman plans to distribute Worldcoin tokens to every single human on planet Earth.\n\nAnd this is where things get a little bit, well, creepy. To pick up your free Worldcoin crypto token and sign up for a Worldcoin ID, you will need to give Sam Altman a scan of your eyeballs. That's right -- Worldcoin has created a proprietary iris-scanning tool known as the Orb. Once you've had your eyeballs scanned with the Orb, you're good to go. According to Altman, this step is necessary to verify that you are a real human and is not meant to be an invasion of your privacy. He won't even ask you for your name.\n\nHowever, it's easy to see how some people on YouTube are going to have a field day with Worldcoin. The launch of this cryptocurrency sounds like the plot of a dystopian sci-fi film: The creator of the world's most powerful AI system has created a digital ID tracking system for all humans on earth and is now requiring that digital ID to invest in crypto. Already, one Ethereum developer has called Worldcoin \"unrealistic and scary.\"\n\nWorldcoin vs. Bitcoin\n\nThat said, Worldcoin has at least two advantages over Bitcoin. One, of course, is superior technology. Bitcoin is still using proof-of-work blockchain technology from 2009 that requires mining and energy-hungry computer-driven mining systems. Worldcoin, on the other hand, uses the latest proof-of-stake technology from Ethereum, as well as technology from different Layer 2 scaling solutions for Ethereum. According to Worldcoin, \"gas-free\" transactions -- meaning free -- will become the norm. In layman's terms, there will be no transaction fees of any kind when you move around your Worldcoin.\n\nWorldcoin also seems poised for much faster uptake than Bitcoin. More than 1.7 million people around the globe, for example, have already registered with Worldcoin. Contrast that with Bitcoin, which took nearly 14 years to get to 1 million unique wallet addresses holding 1 bitcoin or more.\n\nAnd don't forget that Sam Altman has some ChatGPT magic dust he can sprinkle on top of Worldcoin. ChatGPT skyrocketed to 1 million users in just five days, which could explain why investors are willing to give Sam Altman $100 million for this new crypto project. He knows how to scale quickly. Just imagine the cross-promotion opportunities! What if every time you used ChatGPT, you saw a friendly reminder to sign up for Worldcoin? Or if the only way to pay for a premium ChatGPT subscription was via Worldcoin?\n\nHow to value Bitcoin?\n\nAt the end of the day, though, Worldcoin's plans for global expansion seem a bit too grandiose. Altman, for example, wants to get to 1 billion users in two years. But the Earth's population is 8 billion people now, so the ultimate goal of getting Worldcoin into the hands of every single person on Earth seems impractical at best. So I really don't think Bitcoin has anything to worry about for now.\n\nHowever, if Worldcoin does gain early traction, that's when we will need to have a serious discussion about Bitcoin's future valuation. Many of the most optimistic price predictions for Bitcoin -- such as $1 million per coin -- are based on the fundamental notion that Bitcoin will continue to chip away at the world's financial system. From my perspective, Worldcoin (by virtue of being free) has the best chance of any altcoin to replace Bitcoin in poor and developing markets.\n\nFor now, I'm putting Worldcoin on my watchlist. The crypto is a fascinating project from the founder of ChatGPT, so it can't be dismissed entirely. But that doesn't mean I'm selling my Bitcoin. I can't think of any other crypto I'd rather be holding, even if the AI overlords eventually take over."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNTE3MDA1Nzk4L2VuL1VTLUJpdGNvaW4tQ29ycC1TZWN1cmVzLUhpZ2gtUHJvZmlsZS1Ib3N0aW5nLUNvbnRyYWN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "US Bitcoin Corp Secures High-Profile Hosting Contracts - Business Wire",
        "content": "MIAMI--(BUSINESS WIRE)--US Data Mining Group, Inc. dba US Bitcoin Corp (“USBTC”), a leading industrial-scale operator of bitcoin mining sites for both self-mining and hosted machines, today announced that it has finalized hosting contracts for an aggregate of approximately 150,000 machines with major mining companies, including Marathon Digital, Foundry USA, Sphere 3D, Decimal Group, and TeslaWatt.\n\nUSBTC will host these machines at its Charlie, Delta, and Echo sites, which the company operates under its US Mining Infrastructure Operations (“USMIO”) subsidiary. USMIO provides site owners with an industry-first, turnkey site management solution covering all aspects of site operations, including accounting, curtailment, and customer relations.\n\n“Our most recent partnerships with major hosting customers showcase our commitment to collaborative growth and innovation,” said Asher Genoot, President of USBTC. “We continue to expand operations across sites both fully owned by USBTC and operated in partnership with pioneering site owners like Generate Capital and NextEra Energy. We are committed to driving the future of sustainable and efficient Bitcoin mining infrastructure and our ability to secure major hosting contracts at these sites is a testament to this vision and our operating capabilities.”\n\nUSBTC’s Charlie and Delta sites are located in Kearney, Nebraska, and Granbury, Texas, respectively. USBTC operates these sites in partnership with Generate Capital, a leading financier and operator of sustainable infrastructure.\n\nUSBTC’s Echo site is located in Upton County, Texas, and co-located with a wind farm. USBTC operates the site under a joint venture with NextEra Energy, one of the world's largest energy companies. USBTC entered the joint venture with NextEra Energy in December 2022, when it acquired the 50% membership interest formerly held by Compute North Holdings, Inc. in the joint venture.\n\nAbout US Bitcoin Corp (USBTC)\n\nUSBTC is a leading industrial-scale operator of bitcoin mining sites, specializing in the design, construction, and management of sites with access to low-cost and sustainable sources of energy. The company operates four sites across the United States with a total capacity of more than 730 MW of electricity and generates revenue through self-mining, hosting, managed infrastructure operations, and equipment sales.\n\nUSBTC announced an all-stock merger of equals with Hut 8 Mining Corp. on February 7, 2023, which is subject to customary closing conditions. The combined company will be named Hut 8 Corp. and will be a U.S.-domiciled entity.\n\nFor more information, visit www.usbitcoin.com or contact info@usbitcoin.com\n\nDisclaimer\n\nThis press release incorporates \"future-oriented information\" and \"forward-looking statements\" as per United States securities laws. All data, apart from statements of historical facts, included in this press release that address actions, events, or developments that USBTC anticipates or expects will or might take place in the future, including aspects such as future business strategy, competitive strengths, objectives, expansion and growth of USBTC's businesses, operations, plans, and other similar matters, constitute future-oriented information. Forward-looking information is often indicated by terms such as \"may\", \"would\", \"could\", \"should\", \"will\", \"intend\", \"plan\", \"anticipate\", \"allow\", \"believe\", \"estimate\", \"expect\", \"predict\", \"can\", \"might\", \"potential\", \"predict\", \"is designed to\", \"likely\", or similar expressions. Furthermore, any statements in this press release referring to expectations, projections, or other descriptions of future events or circumstances contain forward-looking information.\n\nStatements containing forward-looking information are not historical facts; instead, they signify management's expectations, estimates, and projections about future events based on certain significant factors and assumptions at the time the statement was made. While US Data Mining Group Inc. dba US Bitcoin Corp (“USBTC”) deems these statements reasonable as of the press release's date, such statements are subject to recognized and unknown risks, uncertainties, assumptions, and other factors that may result in the actual results, activity level, performance, or achievements being materially different from those conveyed or implied by such future-oriented information.\n\nThe forward-looking statements included in this press release are provided as of the press release's date, and USBTC expressly disclaims any duty to update or modify statements containing any future-oriented information, or the factors or assumptions underlying them, whether due to new data, future events, or otherwise, except as mandated by law. Except where otherwise specified herein, the information provided herein is based on matters as they exist as of the date of preparation and not as of any future date and will not be updated or otherwise revised to reflect information that subsequently becomes available, or circumstances existing or changes occurring after the date of preparation."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vZGVjcnlwdC5jby8xNDA2NzAvbWljcm9zdHJhdGVneS1sb29raW5nLWF0LWJpdGNvaW4tb3JkaW5hbHMtZm9yLWFwcC1kZXZlbG9wbWVudC1zYXlzLW1pY2hhZWwtc2F5bG9y0gFxaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MDY3MC9taWNyb3N0cmF0ZWd5LWxvb2tpbmctYXQtYml0Y29pbi1vcmRpbmFscy1mb3ItYXBwLWRldmVsb3BtZW50LXNheXMtbWljaGFlbC1zYXlsb3I_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "MicroStrategy Looking at Bitcoin Ordinals for App Development, Says Michael Saylor - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMicroStrategy co-founder and Executive Chairman Michael Saylor said the company isn’t just aware of Ordinals, it’s interested in how the protocol that’s set Bitcoin’s community abuzz could lead to software innovation.\n\nIn an interview at Bitcoin 2023 in Miami, Saylor exclusively told Decrypt that the software firm is looking at Ordinals and assessing its potential in terms of application development.\n\nOften used to create NFT-like assets on top of Bitcoin, Ordinals launched in January, and the protocol—while not embraced entirely by the Bitcoin community—has created a new wave of experimentation with crypto’s oldest coin.\n\nAD\n\nAD\n\nOne recent innovation in the space leveraging Ordinals is an experimental framework for building tokens on top of Bitcoin. It was pioneered by the pseudonymous on-chain data enthusiast Domo in early March. And since then, thousands of other so-called BRC-20 tokens have been created.\n\nAll those transactions have been partly—or entirely, depending on who you ask—responsible for elevated transaction fees on Bitcoin. That’s been a boon for Bitcoin miners, who collect transaction fees for their role in securing the network. But lots of members of the community have complained that high fees make it harder for regular people to use BTC as the peer-to-peer electronic cash system that Satoshi Nakamoto, the pseudonymous creator of Bitcoin, intended it to be.\n\nThe discussion surrounding Ordinals is important, Saylor said, because “Bitcoin miners have to be successful over the long term.” He added that the development of applications building on Bitcoin’s functionality could also bolster the coin’s overall adoption, among individuals, firms, and governments.\n\nSaylor didn’t specifically say what use cases MicroStrategy could be looking into that tap Ordinals, but he noted the ability to commit data to Bitcoin’s blockchain that isn’t solely related to transactions has many potential applications.\n\n“The whole idea of burning a piece of data on the blockchain opens the door to the possibility that I might burn a digital signature, or I might burn a registration, or I might burn a hash of a document,” Saylor said.\n\nAD\n\nAD\n\nTouching on corporate security, Saylor mentioned DocuSign, which lets businesses and individuals send and sign agreements securely using the firm’s electronic signature product. But that makes mega corporations reliant on a proprietary database, Saylor noted.\n\n“Right now, enterprises have weak security compared to Bitcoin,” Saylor said, adding that innovations using the world's largest cryptocurrency could possibly “introduce a new level of security” available to firms “that doesn't exist right now.”\n\nSaylor’s comments come just a week after he described Ordinals as a “catalyst” for Bitcoin adoption on the PBD Podcast. Still, he acknowledges that Ordinals have been used for plenty of silly reasons.\n\n\"The general consensus is criticize stuff that we think is silly, but don't censor it,\" he said on Thursday in Miami.\n\nSaylor didn't want to predict \"which protocol will win,” but he said altering Bitcoin so that it censors certain uses would be wrong. It was a nod to the effort by a group of core Bitcoin developers, including Luke Dashjr, to treat Ordinals as \"spam\" and filter them out of transactions.\n\n“If somebody wants to change the protocol, in order to censor someone else from using Bitcoin, I don't think that's consistent with the values of the community,” Saylor said. “I do believe in rules without rulers.”"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRlZmVuc2UtbGF3eWVyLXNheXMtY3JhaWctd3JpZ2h0LWxhd3N1aXQtY291bGQtaGFybS1vcGVuLXNvdXJjZS1zb2Z0d2FyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin defense lawyer says Craig Wright lawsuit could harm open source software - Cointelegraph",
        "content": "Jessica Jonas, chief legal officer of the nonprofit Bitcoin Legal Defense Fund, discussed the potential legal ramifications of a high profile lawsuit against Bitcoin core developers during the Bitcoin 2023 event in Miami on May 18.\n\nThe case in question is a U.K. legal action filed by Craig Wright, the owner/operator of Tulip Trading. Wright’s perhaps most well-known for his assertion that he is Bitcoin creator Satoshi Nakamoto — a claim driving another unrelated lawsuit.\n\nI would just want to say a quick reminder for BTC Core and Roger Inc.\n\n\n\nYou are under litigation hold. Those telegram groups, the signal groups, the others that you think I don't know about are all discoverable evidence and spoliation is a criminal offence. pic.twitter.com/vtjFmeGrRd — Dr Craig S Wright (@Dr_CSWright) February 3, 2023\n\nIn the case between Tulip Trading and 14 named individuals allegedly involved in the open source development of Bitcoin Core, in addition to others, Wright alleges that the said developers owe him a fiduciary duty. Jonas described the case as being about “an allegation that Tulip Trading owned, allegedly, 111,000 Bitcoin and was hacked, allegedly, and lost that 111,000 Bitcoin in some very Ocean’s 11 style hack.”\n\nIn order to obtain compensation for the alleged loss, Wright is demanding, per Jonas, that Bitcoin developers “create a backdoor into the Bitcoin core blockchain such that Tulip Trading can recover the funds it allegedly lost,” a remedy Jonas asserts can’t be implemented:\n\n“They are asking the court to order that this group of software developers write a patch into the software that diverts funds. That’s not how Bitcoin works. It’s impossible.”\n\nJonas explained that implementing such a change would require hard forking the Bitcoin blockchain and then expecting everyone in the world to shift to the new fork instead of continuing to use the existing core chain. Describing the area of law surrounding fiduciary duty as “complicated,” Jonas went on to describe the lawsuit as extraordinarily dangerous for reasons beyond technical limitations.\n\n“This case has actually already gone through an appeal and the appellate court found that the question of whether open source developers should owe a fiduciary duty to people who use their code is an important one,” claimed Jonas. Furthermore, Jonas described the potential threat to the open source community as “existential.” “Open source software makes up 97% of the world's software,\" she said.\n\nRelated: 7 people who could be (or not) Bitcoin creator Satoshi Nakamoto\n\nJonas also framed the case as a matter of free speech. Despite the fact that many of the defendants named in the suit are U.S. citizens operating in the U.S., the case is being tried in the U.K. per the appellate court’s decision that it held jurisdiction due to the potential outcome being in the public interest in that country.\n\nAccording to Jonas, software development is considered free speech in the U.S. and, per her assessment, “Tulip Trading is acting in a U.K. court in a civil action to compel many Americans to speak.” While the U.K. court can’t necessarily enforce free speech laws in the U.S., Jonas pushed back against the idea that it would be far-fetched for the court to rule in Wright’s favor.\n\nBitcoin open-source development is under the Massachusetts Institute of Technology's (MIT's) open-source license. Because open-source software is generally available to anyone, anywhere, assigning fiduciary duty to developers could lead to a situation where someone in one country is liable for damages to someone in another simply because they contributed to an open-source project. Current law, explained Jonas, is meant to protect open-source developers from being sued by strangers:\n\n“They are volunteering their time to work on public infrastructure. They’re doing it for free. They’re doing it under MIT license, which is supposed to protect them from things like this.”\n\nMagazine: Coinbase screws up, Florida bans CBDCs, and Ordinals face controversy"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGFpbHljb2luLmNvbS9yb2JlcnQtZi1rZW5uZWR5LWpyLWJpdGNvaW4taXMtZXhlcmNpc2UtaW4tZGVtb2NyYWN5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Robert F. Kennedy Jr.: 'Bitcoin is an Exercise in Democracy' - DailyCoin",
        "content": "Bitcoin is receiving increased attention in U.S. politics.\n\nKennedy has again reiterated his support for Bitcoin.\n\nThe presidential hopeful is set to kick off his campaign at Bitcoin Miami.\n\nFor better or worse, cryptocurrencies are getting increased attention in United States politics, further driven by the unlikely support of some presidential hopefuls.\n\nOne such candidate, Robert F. Kennedy Jr., recently reiterated his support for Bitcoin, the #1 crypto by market cap.\n\nKennedy Likens Bitcoin to a Democratic Exercise\n\nKennedy has recently reiterated his support for Bitcoin, in a speech at Bitcoin Miami on Thursday, May 18, that has made the rounds on crypto Twitter. According to the Democratic presidential candidate, Bitcoin is more than a currency.\n\n“Everybody is so passionate about Bitcoin, not just because it’s a currency but because it’s an exercise in democracy,” Kennedy asserted.\n\nThe presidential hopeful further promised that if elected, Bitcoin users would not have to worry about the government seeking to monitor how their Bitcoin is spent.\n\n\"Nobody's going to be taxing your electricity 30%,\" he added in a subliminal jab at President Joe Biden's proposed crypto mining tax.\n\nKennedy suggested that he wants the crypto space to grow in America, something industry leaders are pessimistic about, given the current regulatory landscape.\n\nKennedy’s statements against central bank digital currencies (CBDCs) and in defense of Bitcoin against Biden’s proposed 30% tax on crypto mining have endeared him to the crypto community. Still, doubt remains whether his vocal support for Bitcoin is a ploy to achieve his political goals.\n\nThe presidential hopeful is nonetheless scheduled to make his campaign debut with a keynote speech at the Bitcoin Miami Conference on Friday, May 19.\n\nOn the Flipside\n\nKennedy’s views on cryptocurrency oppose those of several of his party members but align with Republican presidential hopeful Ron DeSantis.\n\nWhy This Matters\n\nEven if they turn out to be insincere, Kennedy’s statements highlight the crypto community’s growing influence as politicians now feel the need to pander to them.\n\nRead this to learn more about Kennedy’s vocal support for Bitcoin:\n\n“Bad Idea”: Biden’s Crypto Tax Bashed by Presidential Candidate\n\nLearn about what is fueling the discussion on Ledger:\n\nLedger Trends as Deleted Tweet Fuels Crypto Wallet Fears"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vZGVkb2xsYXJpemF0aW9uLXVzZC1ncmVlbmJhY2stZ29sZC15dWFuLWV1cm8tYml0Y29pbi1icmljcy1hbHRlcm5hdGUtMjAyMy010gFvaHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS9kZWRvbGxhcml6YXRpb24tdXNkLWdyZWVuYmFjay1nb2xkLXl1YW4tZXVyby1iaXRjb2luLWJyaWNzLWFsdGVybmF0ZS0yMDIzLTU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "De-dollarization: Alternative assets that are trying to replace USD - Business Insider",
        "content": "The dollar isn't going away, but other assets classes are slowly chipping away at its dominance.\n\nThe US dollar is the world's top reserve currency — by far. CFOTO/Future Publishing via Getty Images\n\nThe US dollar has been the world's reserve currency since the second world war, playing a crucial role in the world's trade.\n\nBut countries globally are now lining up backup currencies for trade, as sanctions against Russia over its invasion of Ukraine have led to some prominent world leaders and business figures sounding a warning over the power Washington — and the US dollar — wields.\n\nSanctioned countries like Russia and emerging nations like Argentina have recently started using the Chinese yuan for trade, primarily with China.\n\nEven so, there's no indication the dollar's dominance could fade in the foreseeable future, simply because the currency is such an integral part of the world economy, Insider's Jennifer Sor reported on May 6.\n\nThe dollar is by far the world's most dominant reserve currency — meaning a large quantity of a foreign currency held by central banks and major financial institutes for their use from investments to payments.\n\nIn 1999, over 70% of the world's foreign exchange reserves were held in the US dollar.\n\nBut that percentage has been dropping — the dollar's share in global foreign exchange reserves fell to under 60% in the fourth quarter of 2021, the International Monetary Fund, or IMF, said in a June 2022 blog post.\n\nAnd despite accounting for the lion's share, or 54%, of global foreign exchange reserves in the fourth quarter of 2022, there has been a decline in the dollar's share of the total foreign reserve pie, per IMF data.\n\nBut this doesn't mean America's strategic competitors — like China — wouldn't stop challenging American hegemony. Even alternative currencies like the Swedish krona, the South Korean won, and the Australian and Canadian dollars have been chipping away at the greenback's share.\n\nRead further for five assets that are trying to topple the dollar's dominance."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90d2l0dGVyLWV0b3JvLXNvY2lhbC10cmFkaW5nLWJpdGNvaW4tbWlhbWktaW50ZXJ2aWV30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Twitter partnership created a 'symbiosis,' says eToro US CEO | Bitcoin Miami 2023 - Cointelegraph",
        "content": "Update (5/19/2023 18:50 UTC): This article has been updated to reflect that Lule Demmissie is the CEO of eToro US, the U.S. subsidiary of cryptocurrency exchange eToro. Previously, Demmissie was erroneously stated as the CEO of eToro instead of eToro US. The CEO of eToro is Yoni Assia. Cointelegraph regrets this error.\n\nThe financial service provider eToro and Twitter recently announced a partnership that allows users on the social network platform to trade cryptocurrencies and stocks.\n\nThis development follows a statement made by former Twitter CEO Elon Musk, who said he wants to make Twitter “the biggest financial institution in the world.”\n\nCointelegraph sat down with Lule Demmissie, the CEO of eToro’s U.S. branch, eToro US, at Bitcoin 2023 in Miami to understand what a social network and social trading platform integration can mean for the future of digital finance.\n\nCointelegraph reporter Joe Hall with eToro US CEO Lule Demmissie at Bitcoin 2023 in Miami. Source: Cointelegraph\n\nDemmissie said it “made sense” that one of the world’s largest social network platforms would partner with a social trading platform. Now, when users obtain financial news and updates on securities, ETFs or other assets, they can choose to “practice, engage or trade.”\n\n“The symbiosis is really sort of like converse, learn, practice, invest.”\n\nAlready, Twitter’s “cashtags,” which allow users to view real-time trading data, have garnered half a billion search hits on the platform.\n\nRelated: Paraspace NFT protocol co-founder resigns after failing to overthrow CEO\n\nThe eToro US CEO said the company has a “holistic” approach to the crypto ecosystem, not favoring one type of asset class over another. She said that diversification is important both “at the instrument level as well as the asset-class level.”\n\nDemmissie also highlighted that digital assets can be “transformative” in nature if they are “allowed into our lives.”\n\n“What’s fascinating about digital assets is that you become both the beneficiary and the product. It’s a really transformative way of thinking about justice and capital formation — benefiting from the same thing that you feed.”\n\nHowever, she also pointed out that as digital assets become more available, the need to have better self-regulation practices increases. Particularly, she said to take from the “lessons of the last two years,” and not “misdiagnose” those lessons.\n\nMagazine: Bitcoin glory on Chinese TikTok, 30M mainland users, Justin Sun saga"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL29wLWVkLXdoeS1vcmRpbmFscy1icmMtMjAtaXMtYmFkLWZvci1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Op-ed: Why Ordinals, BRC-20 is bad for Bitcoin - CryptoSlate",
        "content": "The emergence of the Ordinals protocol has transformed Bitcoin from a somewhat stale single-asset chain into something much more exciting.\n\nHowever, this newfound excitement has sparked pushback from laser-eyed purists, who argue that BTC was not intended for non-monetary transactions – some going as far as calling the protocol a spam attack on the network.\n\nBrushing aside the protests, Ordinals Capitalists say a permissionless system also includes the liberty to utilize Bitcoin in any manner one chooses. They accuse purists of attempting to spoil their fun.\n\nThe divergent viewpoints have set the stage for a potential chain split – which ultimately serves no one’s best interest.\n\nTaproot opened Pandora’s box\n\nThe Taproot soft fork was rolled out in November 2021. At the time, it was primarily regarded as an upgrade to improve network security, efficiency, and scalability. However, it also enabled executable commands and the implementation of certain scripts – thus laying the foundation for Ethereum-like functionality such as smart contracts and dApps.\n\nIn January, the impact of this additional Ethereum-like functionality began to take shape as developer Casey Rodarmor released Ordinals. This protocol allows for each of the 100,000,000 satoshis in a Bitcoin to be inscribed with additional metadata, including text, images, video, and code.\n\nBy February, the Ordinals protocol was used to write a wizard jpeg into the blockchain, opening the door to a Bitcoin NFT market. But as a “square peg, round hole” use of the technology, acquiring and trading Bitcoin NFTs was a cumbersome and technically challenging feat, requiring knowledge of node synching and trusting a third party to release the NFT upon payment.\n\nRecently, supporting wallets, including Ordinals Wallet, Xverse, and Hiro Wallet, have rolled out to address these pain points, making the process more like the standard experience NFT buyers are used to.\n\nBefore Ordinals NFTs went live, the average block size was hovering around 1.2 MB, but since its rollout, subsequent blocks have more than doubled on average – negatively affecting speed and scalability. Additionally, higher transaction fees and chain bloat, through a backlog of unconfirmed transactions, have added to useability problems.\n\nHere come the BRC-20 tokens\n\nThings stepped up in March when anonymous developer “Domo” launched BRC-20 tokens – bringing a fungible token standard to Bitcoin. By attaching a JavaScript Object Notation (JSON) to satoshis, details of the BRC-20 token’s characteristics, including its minting and distribution values, are preserved in the network.\n\nSpurred by meme coin season, BRC-20 tokens saw a peak market cap valuation of $1 billion on May 8. However, wider market uncertainty and the prevalence of meme coin rugs have since seen a significant drawdown – falling to $574 million at the time of press.\n\nPer KuCoin, the booming popularity of BRC-20 has worsened the problems seen with NFTs, causing significant network delays, with some users reporting 4-hour confirmation times. In addition, BRC-20 tokens have further contributed to rising transaction fees.\n\nDespite useability issues, miners are reaping the benefits with on-chain metrics, including Miner Hash Price, which measures miners’ income relative to network contribution, and Miner Percent Mined Supply Spent, which looks at the rate miners sell mined coins, pointing to a reinvigoration of the Bitcoin mining space.\n\nCryptoSlate’s analysis concluded that if the momentum continues at its current pace, miners will experience boosted profitability and a greater sense of confidence in the network, leading to a preference to hold onto mined coins.\n\nCommunity split on Ordinals\n\nProminent members of the Bitcoin community have voiced their support of Ordinals. For example, MicroStrategy Chair Michael Saylor said the protocol was responsible for flipping sentiment bullish – adding that if he was a miner, he would be ecstatic.\n\nMoreover, he pointed out that the technology will lead to many new applications in the long term, some of which could solve critical societal issues – giving the example of inscribing a will on the blockchain.\n\n“I could also inscribe my last will and testament, and if my last will and testament is moving a billion dollars from me to you, how much is it worth to you to have that burned onto the blockchain and cryptographically verified?”\n\nMeanwhile, Willy Woo expressed a more pragmatic view, saying there are good and bad points to consider. While additional transaction fees provide strong incentives for miners, which will become more critical in the future as block rewards dwindle with each halving, this comes at the cost of more centralization due to fewer people being willing to run higher bandwidth nodes.\n\nFor now, given that decentralization is not “anchored” in, Woo said Ordinals, and the associated boon for miners, arrived too soon for his liking.\n\n“I would have preferred the impact of ordinals to have been a lot later when the security budget becomes more pressing, it would be at a time when decentralisation is already anchored.“\n\nJan3 co-founder Samson Mow played down the significance of Ordinals. He said congestion and high fees are nothing to worry about, as paying massive fees to miners is unsustainable over the long term.\n\n“It’s a question mark on how long they can do that for. Maybe it’s a few more days. Maybe it’s a week. But definately it’s not a sustainable model to throw money away.”\n\nClarifying his position, Mow explained that Ordinals is a largely hype-driven market fueled by short-term money grabs. What’s more, he predicts the sector will disappear once the token issuers have made enough money.\n\n“They exist to get some gullible people to pay attention to them by doing some crazy antics… But like most projects that are in the blockchain space, they fade away in relevance once the issuers of the tokens have made their money.”\n\nWhat would Satoshi think?\n\nSatoshi Nakamoto cannot express an opinion on whether Ordinals are good or bad for Bitcoin. But people have turned to his Bitcointalk forum posts to try and work out his perspective on the matter.\n\nIn a December 2010 post, Nakamoto supported the idea of keeping the blockchain lean and free from bloat with a view to maximizing scalability.\n\n“Piling every proof-of-work quorum system in the world into one dataset doesn’t scale.”\n\nNakamoto spoke of segregating non-monetary transactions onto a separate chain called BitDNS – which was conceived as a sidechain or layer 2 using the Domain Name System internet protocol. Later, this project became an altogether separate alt chain, rebranding to Namecoin.\n\n“Bitcoin and BitDNS can be used separately. Users shouldn’t have to download all of both to use one or the other. BitDNS users may not want to download everything the next several unrelated networks decide to pile in either.”\n\nBased on this, it seems Nakamoto wanted to keep the mainchain exclusively for monetary transactions and for a sidechain/layer 2 to handle large data features.\n\nThe Bitcoin core devs also seem to have adopted the purist’s stance, as indicated by @frankdegods, who publicized dev plans to extend Taproot spam filters to remove Ordinals altogether.\n\nBitcoin civil war\n\nIn a throwback to 2017 and the Bitcoin Cash hard fork, the question of whether Bitcoin should increase its block size to accommodate Ordinals has ignited debate within the community.\n\nGiven the lack of consensus on the best path forward, the possibility of a further chain split looms increasingly likely. But, of the 105 BTC forks to date, it’s worth noting that all have faded into obscurity.\n\nThe most successful fork, Bitcoin Cash, is down 98.9% against Bitcoin from its 0.43 peak in November 2017. This suggests that an Ordinals fork would likely face significant challenges, making a split futile.\n\nThere is no shortage of alternative layer 1s offering tokenization with the added benefit of more sophisticated features, such as event logic handling. Moreover, these alternative layer 1s can operate at a larger scale and lower cost than Bitcoin – making Ordinals something of a dinosaur in comparison.\n\nYes, Ordinals has breathed new life into Bitcoin, particularly from a novelty and mining sustainability point of view. But other chains are better at tokenization.\n\nMoreover, to date, the protocol’s primary use case is meme coin investing, which lacks utility, has no collective benefit, and does not contribute to the goal of doing away with the corrupt fiat money system.\n\nOrdinals are bad for Bitcoin because it impedes the objective of revolutionizing money.\n\nMentioned in this article"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlci1wcmVkaWN0cy1lbmQtb2YtZGlwLXdpdGhpbi13ZWVrcy1hcy1idGMtcHJpY2UtYWRkcy0zLTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin trader predicts end of dip within weeks as BTC price adds 3.5% - Cointelegraph",
        "content": "Bitcoin (BTC) held a snap rebound on May 18 as analysts hoped that further upside would come next.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nBTC price sustains knee-jerk move higher\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it circled $27,400 on Bitstamp.\n\nThe pair had made swift gains toward the prior day’s Wall Street open, these topping out at 3.5% versus the day’s lows.\n\nAmid changing signals on exchange order books, popular trader Skew was hopeful for continuation.\n\n“Price swept the pre-emptive swing low, which was enough liquidity to push up higher,” he summarized in part of a Twitter analysis.\n\nSkew added that while macro conditions were overall causing friction for BTC price performance, the largest stablecoin Tether pledging regular BTC buys should be a “positive headwind.”\n\nBitcoin cumulative volume delta (CVD) data annotated chart. Source: Skew/ Twitter\n\nMeanwhile, cumulative volume delta (CVD) showed increasing momentum, further indicating that Bitcoin price might sustain its newfound strength.\n\n“Looking for sustained buying momentum by spot else scalp short,” Skew added.\n\nOn-chain monitoring resource Material Indicators tracked the action on the Binance order book, with the price uptick coinciding with an increase in volume from the largest class of Bitcoin whales.\n\nIf you've been following for more than a minute, you've seen me say that Purple whales have historically had the most influence over Bitcoin PA. Here's a text book illustration of that on the W chart.\n\n\n\nLearn more about FireCharts here https://t.co/cLxkExkPmX pic.twitter.com/1I5JKGstCt — Material Indicators (@MI_Algos) May 17, 2023\n\nAs ever, not everyone was convinced about the uptick’s longevity. Among them was the popular trading account TraderSZ, which began the day closing out a long BTC position.\n\n“Think the bounce is done,” part of the accompanying commentary stated, anticipating a return to the downside.\n\nBTC/USD annotated chart. Source: TraderSZ/ Twitter\n\nAs Cointelegraph reported, shorter-term and longer-term downside targets currently extend to around $25,000 and $24,000, respectively.\n\nBottom “might be in” for Bitcoin price correction\n\nZooming out, meanwhile, fellow trader Credible Crypto revealed a belief that a more pronounced return to the upside could come within the next month.\n\nRelated: ‘One of the greatest’ Bitcoin metrics says BTC price bull run is here\n\n“How much longer till expansion and is the bottom in? 25k’s tested, liq below us taken, bottom for this correction MIGHT be in but need to see how PA develops over the coming days. While we can’t rule out a flush lower yet, developing PA will give us some clues to work with,” part of a tweet on the day explained.\n\nCredible Crypto uploaded two charts with trend lines worth noting, adding that the upper one should hold as support, with BTC/USD then going higher.\n\n“I expect that blue dotted trendline on the right to hold which would mean less than 30 days for this sideways phase to complete and the next move up to begin,” he continued, describing the move’s character as “absolutely explosive.”\n\nBTC/USD annotated chart with trend lines. Source: Credible Crypto/ Twitter\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kb2dlbWl5YWdpLWJpdGNvaW4tcmlwcGxlLWV4cGxvcmluZy1zZWNyZXRzLTA3MTEzMzA1Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "DogeMiyagi, Bitcoin and Ripple: Exploring the Secrets Behind Top Crypto Supply Strategies - Yahoo Finance",
        "content": "In the exciting landscape of crypto, each token takes a different approach. Bitcoin (BTC), Ripple (XRP) and a new meme coin, DogeMiyagi (MIYAGI), have captured the attention of investors with their unique supply strategies. They each take a distinctive approach to fueling excitement and potential growth.\n\nBitcoin: The Scarcity-Driven Model\n\nBitcoin kickstarted the entire crypto revolution, introducing a completely new financial system. Built on the belief that scarcity breeds value, Bitcoin’s total supply is strictly capped at 21 million tokens. This digital gold relies on miners to confirm transactions and earn Bitcoin for securing the network.\n\nBitcoin’s supply is regulated through a halving process which happens every four years and reduces the reward for mining Bitcoin by 50%. As demand surges and the token becomes rarer, the price tends to skyrocket. The last halving occurred in 2020 and boosted Bitcoin’s price by 19% compared to the year before. The next halving event is scheduled for April 2024, and crypto enthusiasts anticipate an even bigger price surge.\n\nRipple: The Controlled Supply\n\nXRP, Ripple’s digital asset, was designed to create faster and cheaper transactions. Unlike Bitcoin, XRP was not designed to be mined. Instead, the token’s maximum supply is capped at 100 billion, 80 billion of which was gifted to Ripple by its founders.\n\n55 billion tokens were then placed in an escrow account for controlled release. Ripple periodically sells XRP to fund operations and promote its technology, growth and stability. This structure also allows XRP to complete more transactions at a faster and cheaper rate.\n\nDogeMiyagi: The Transparency-Driven Supply Strategy\n\nDogeMiyagi is a new meme coin with a focus on both entertainment and utility, and while meme coins often come and go in the market, this one is here to stay. With a total supply of 96,192,515,112,011 tokens, this project has divided its allocation wisely. DogeMiyagi has garnered attention for its focus on community involvement and its commitment to transparency.\n\nStory continues\n\nThe majority (60%) is dedicated to the presale, allowing the community to join in on the action early and benefit from the project’s continued growth. 24% will then be saved for exchanges, 6% for the referral program, 5% for the team, which is locked for 2 years and 5% for marketing which is locked for one year.\n\nDogeMiyagi has also orchestrated a burn schedule for each stage of the presale. There will be 6 burn events in total, each representing one of the Karate Kid films. In a fitting tribute, just before launch, the largest token burn will take place, representing the death of the beloved Mr Miyagi at the age of 86 years and 5 months, burning 86,050,000,000,000.00 tokens.\n\nCryptocurrencies all have different approaches to their supply strategies, and Bitcoin and Ripple have been some of the most successful so far, driving scarcity and prolonged growth. DogeMiyagi is strategically balancing meme coin culture, community and utility, providing a fresh take on crypto meme coins. The project’s supply model is designed to propagate growth for the coin and benefit every community member.\n\nFor more about DogeMiyagi:\n\nWebsite: https://dogemiyagi.com\n\nTwitter: https://twitter.com/_Dogemiyagi_\n\nTelegram: https://t.me/dogemiyagi"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS93aG8tYXJlLXRoZS1iaWdnZXN0LWJpdGNvaW4td2hhbGVzLWluLXRoZS13b3JsZGNoZWNrLWhlcmUtMTY3MDMxMDEuaHRt0gFyaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L3doby1hcmUtdGhlLWJpZ2dlc3QtYml0Y29pbi13aGFsZXMtaW4tdGhlLXdvcmxkY2hlY2staGVyZS0xNjcwMzEwMS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Who are the biggest Bitcoin whales in the world - CNBCTV18",
        "content": "Several factors can affect the price of cryptocurrencies, including Bitcoin. For instance, Bitcoin whales play a pivotal role in influencing the market to a large extent. Whenever these whales buy or sell assets, it often creates a market stir, which is closely observed by other players. At times, whale purchases can push Bitcoin’s price to higher levels, while whale offloading can do the opposite.\n\nIn simple terms, Bitcoin whales refer to individuals, governments, exchanges, companies, and institutions that hold a significant number of bitcoins. Some of these Bitcoin whales have now become influencers, and people often seek their expertise to understand market sentiment. Let's take a look at some of the biggest Bitcoin whales currently in existence.\n\nIndividual Bitcoin Whales\n\nThe pseudonymous founder of Bitcoin, Satoshi Nakamoto, currently has 1 million BTCs in his kitty (worth around $27 billion at present), making him one of the biggest Bitcoin whales in the world. Surprisingly, he hasn't moved a single penny since he first mined these bitcoins. If he/she ever decides to move this massive stash of Bitcoin, it’s likely that the market would respond to the event.\n\nThe founder and CEO of Digital Currency Group (DCG), Barry Silbert, was an early Bitcoin adopter. In an interview with Reuters in 2017, he said that he had about $175,000 worth of bitcoin in 2012 and that he paid about $11 a bitcoin. Considering how much the market has evolved, he surely made a lucrative deal.\n\nHe founded the DCG group in 2013, which consists of five crypto-focused companies that invest in crypto startups. Over the years, the companies have accumulated around $28 billion worth of cryptocurrencies, including Bitcoin and Ethereum.\n\nThe Federal Bureau of Investigation (FBI) also holds large amounts of Bitcoin, obtained from seized properties. They auction the seized bitcoin to interested buyers, and Barry Silbert happens to be among them. He bought 48,000 bitcoins from the FBI in 2013.\n\nRoger Ver is another well-known Bitcoin whale. Popularly known as ‘Bitcoin Jesus”, Ver owns around 335,000 bitcoins. He has invested in various crypto projects, including Ripple, bitcoinstore.com, Kraken, and more, over the course of many years. The multi-millionaire Bitcoin proponent has been interested in the king coin since early 2011, and has even called it one of the most important inventions in the history of humankind.\n\nCorporates’ Largest Bitcoin wallets\n\nOne of the largest centralized crypto exchanges, Coinbase, holds around 2 million bitcoin worth $53 billion as of May 18, 2023. Meanwhile, Brian Armstrong, CEO of Coinbase, owns a 19 percent stake in Coinbase, which technically makes him a big Bitcoin whale as well.\n\nBinance, the world’s largest crypto exchange by volume, is also one of the biggest Bitcoin whales in the market. The Binance wallet holds 248,597 bitcoins, worth over $6 billion at current prices. The same represents almost 1.3 percent of Bitcoin’s circulating supply.\n\nAnalytics software company Microstrategy reportedly holds 140,000 bitcoins, and its CEO Michael J. Saylor, who is also a crypto influencer, revealed in 2021 that he privately held 17,732 bitcoins. The company's Q1 2023 report disclosed a net income of $94 million and additional purchases of 7,500 Bitcoins. The 140,000 Bitcoins it owns were collectively acquired at an average cost of roughly $29,800, as per the Q1 2023 report. Based on current market prices, Microstrategy’s Bitcoin holdings are valued at $3.7 billion.\n\nGovernment Bitcoin Holdings\n\nReportedly, the European country of Bulgaria holds 213,000 bitcoins, which were seized by local authorities from a criminal group in 2017. At the time of the seizure, the value of the bitcoins was around $500. The same is now it is worth over $5 billion. However, what remains unclear is what the country plans on doing with its BTC holdings.\n\nAs of March 25, 2023, the US government held 205,515 confiscated bitcoins worth $5.6 billion, which is about 1.06 percent of the coin’s circulating supply. Glassnode on-chain data revealed that on March 9, about 9,860 bitcoins were sent to Coinbase addresses. The US government’s bitcoin stockpile accumulated through various seizures, including the Silk Road bitcoin seizure in 2020, the Bitfinex hack, and the James Zhong case related to illicit Silk Road transactions.\n\nCentral American country, El Salvador, made history in September 2021 by becoming the first country in the world to adopt Bitcoin as legal tender. The country has known to purchase Bitcoin at regular intervals, even during market dips. As of June 2022, El Salvador's President Nayib Bukele announced via a tweet that the country currently holds around 2,301 bitcoins. At current market prices, these BTC’s are worth around $61.6 million.\n\nConclusion\n\nWhile the US government’s confiscated bitcoin holding may not of much importance here since it is auctioned away, the accumulation of massive amounts of bitcoins by individuals and companies demonstrates the growing popularity of the digital asset.\n\nHowever, it is important to note that when bitcoin is concentrated in one address and crypto whales continue to increase, it can create disparity in the market. Critics argue that these large crypto wallets control other players, giving them a disproportionate amount of influence and leaving other participants with less control over the market.\n\nUntil a comprehensive assessment is released, whether Bitcoin whales are a blessing or a burden to the industry is essentially a matter of personal choice."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZGVjcnlwdC5jby8xNDA3MzAvb2xkLWdhbWUtYm95LWNvdWxkLW5leHQtYml0Y29pbi1ldGhlcmV1bS13YWxsZXTSAU9odHRwczovL2RlY3J5cHQuY28vMTQwNzMwL29sZC1nYW1lLWJveS1jb3VsZC1uZXh0LWJpdGNvaW4tZXRoZXJldW0td2FsbGV0P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Your Old Game Boy Can Now Be Turned Into a Bitcoin and Ethereum Hardware Wallet - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCraving both '90s nostalgia and ice-cold crypto storage? A small team of developers at crypto startup Keyp is revamping original Nintendo Game Boy handheld consoles and optimizing them to store cryptocurrency offline, transforming the popular handheld of yore into a crypto hardware wallet called the Game Wallet.\n\nBut the Game Wallet isn’t just a newfangled hardware wallet with a Game Boy console cover. In fact, the Game Wallet is far from a gimmick—it’s a brand new Game Boy game cartridge that actually uses gamification to generate users’ seed phrases through random quests and interactions with non-playable characters (NPCs).\n\nOnce set up, the Game Wallet will be able to store any cryptocurrency that uses BIP-32 seed phrases, which means it can store coins like Bitcoin and Ethereum at launch. Its software will also be open source and available for anyone to create their own implementation, if desired.\n\nAD\n\nAD\n\nAnnouncing Game Wallet 👾 Turn any GameBoy into a secure offline cold wallet. Sign up to be notified when sales start:https://t.co/t53Ee5Dcn0 pic.twitter.com/DjqqNI9R1T — JOSΞPH 🍩 (@CupOJoseph) May 19, 2023\n\nKeyp founder Joseph Schiarizzi told Decrypt that the wallet’s game experience will be “Pokémon-like.”\n\n“Our primary focus at Keyp is making Web3 accessible and safe for everyone with tools like social logins and extra security layers for wallets,\" Schiarizzi said. \"Game Wallet is a fun project [and] extension of that.\"\n\nGameboy cold wallet demo: seed phrase is generated by talking to an NPC using a hash of your previous 500 button presses as you walk around and do quests. pic.twitter.com/91sBtBE6uw — JOSΞPH 🍩 (@CupOJoseph) January 21, 2023\n\nWhile the Game Wallet has been in development since January, Keyp's nine-person team believes the recent controversy surrounding Ledger’s new “recovery” service means a truly offline storage solution is needed. Game Wallet is marketing itself as an offline storage option that promises no firmware updates—ever.\n\nAD\n\nAD\n\n“With all the drama around the recent Ledger hardware wallet update, we realized the need for truly offline cold storage that minimizes trust,” Keyp co-founder Sascha Mombartz wrote on a Game Wallet product page.\n\n“What started as a fun idea now seems to be a really important product,\" Mombartz added. \"Trusting the supply chain for new security devices can be scary because we don’t know who has messed with a device, but I know exactly where the Game Boy on my shelf has been for the last 20 years.\"\n\nThe Game Wallet doesn’t yet have an official release date, but Schiarizzi told Decrypt that the company plans to open pre-orders soon and is targeting a summer rollout, barring supply chain and/or technical hurdles.\n\nThis isn’t the first time crypto enthusiasts have “cryptified” the Game Boy, however. Two years ago, a pseudonymous IT security researcher turned the handheld into a Bitcoin mining device—albeit a very slow one."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xNDA2NTcvamFjay1kb3JzZXktbGVhZHMtNi1taWxsaW9uLXJhaXNlLWJpdGNvaW4tcGF5bWVudHMtY29tcGFueS1henRlY2_SAWFodHRwczovL2RlY3J5cHQuY28vMTQwNjU3L2phY2stZG9yc2V5LWxlYWRzLTYtbWlsbGlvbi1yYWlzZS1iaXRjb2luLXBheW1lbnRzLWNvbXBhbnktYXp0ZWNvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Jack Dorsey Leads $6 Million Raise for Bitcoin Payments Company Azteco - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlock co-founder and CEO Jack Dorsey—also co-founder and former CEO of Twitter—led a $6 million seed funding round for Bitcoin payments firm Azteco, the startup announced today.\n\nAzteco offers a unique way to buy Bitcoin worldwide with a focus on making it easier for unbanked populations to use the digital money. Users either buy an Azteco voucher online or at a local, brick-and-mortar store, which they can then redeem for Bitcoin. The model works similar to buying a gift card or a mobile phone top-up.\n\nSince users don't have to go through an exchange to purchase Bitcoin in their native currency, this method provides users more flexibility and has come to be known in Bitcoin circles as a project with the potential to help bank the unbanked.\n\nAD\n\nAD\n\nDay 17 of redeeming Bitcoin through @Azteco_ for 21 days straight! R1 gets you Bitcoin worth around 178 sats. Successfully redeemed for Bitcoin through the https://t.co/P6FF2gz36Z USSD code. https://t.co/VboqSc6ywu pic.twitter.com/iYBe8tEs3x — kgothatso@8333.mobi (@440UrPp) April 24, 2023\n\nIn a statement, noted Bitcoin investor and enthusiast Dorsey said that he was “honored to support” Azteco as it attempts to help unbanked individuals enter the financial system.\n\n\"The unbanked population is immense. We have the technology and resources to close this gap, but until now, no one has taken that important next step,” Dorsey said. “Azteco is providing so much more than just access to a secure financial system; it is building an ecosystem of financial self-determination that is secure and supported by local communities.”\n\nAlong with Dorsey, investors include Lightning Ventures, Hivemind Ventures, Ride Wave Ventures, Aleka Capital, Visary Capital, Gaingels, and serial entrepreneur Sunil Rajaraman.\n\n\"More than two billion people worldwide lack access to any financial services, facing significant challenges managing, storing, and transferring money and accessing credit,” Azteco founder and CEO Alexander \"Akin\" Fernandez told Decrypt. “These individuals, many living in countries with untrustworthy and volatile economies, need alternative, independent solutions that provide financial inclusion and long-term stability.”\n\nAD\n\nAD\n\nUsers can purchase vouchers in 195 countries. Azteco plans to use the fresh funding to flesh out its product and expand its offerings in Latin America and Europe.\n\nSome users have also described the potential of \"no KYC\" Bitcoin, where users don't have to provide identifying “know your customer” information in order to buy Bitcoin. Since only small amounts of Bitcoin can be purchased with Azteco, governmental KYC laws do not apply in those jurisdictions that the company operates in.\n\n“Azteco is bringing vouchers for small amounts of Bitcoin to the masses who need it most,” Fernandez said. “As an alternative to traditional currencies and bank accounts, Bitcoin enables financial self-determination, putting people in control of their finances with privacy and security.”\n\nEditor's Note: This story has been updated to correct the attribution of Azteco founder and CEO Alexander \"Akin\" Fernandez's comments."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS93aHktaXMtYml0Y29pbi1zdHVjay1iZWxvdy0zMDAwMC1hLWxvb2stYXQtdGhyZWUtcG9zc2libGUtcmVhc29ucy0xNjcxNDAxMS5odG3SAXpodHRwczovL3d3dy5jbmJjdHYxOC5jb20vY3J5cHRvY3VycmVuY3kvd2h5LWlzLWJpdGNvaW4tc3R1Y2stYmVsb3ctMzAwMDAtYS1sb29rLWF0LXRocmVlLXBvc3NpYmxlLXJlYXNvbnMtMTY3MTQwMTEuaHRtL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Why is Bitcoin stuck below $30,000? A look at three possible reasons - CNBCTV18",
        "content": "Bitcoin’s price has been choppy recently, trading between the $28,000 level and $26,000 over the past week and a half. Several analysts believe that the next key threshold is $30,000, which would provide Bitcoin with a much-needed psychological lift.\n\nKeeping external developments in mind, such as the US banking crisis, and worries of a global recession, it is tough to predict how much Bitcoin's value will rise this year. However, a look at certain on-chain data could provide us with some explanations about Bitcoin's previous price performance and why it is stuck below the $30,000 mark.\n\nUnique addresses interacting with Bitcoin slip to new lows\n\nAlthough P/E ratios and profit and revenue statistics are not available for digital assets, there are other fundamentals to consider in order to determine a cryptocurrency's health.\n\nOne common way to assess the same is by looking at the activity of unique addresses within a network. In the Bitcoin ecosystem, unique addresses refer to payment addresses that have a non-zero balance. In theory, growth in unique addresses is a positive development as it signals increased demand for a cryptocurrency. A drop in unique addresses, on the other hand, indicates that demand has slowed.\n\nAnalytical platform Santiment recently highlighted that the unique Bitcoin addresses that interact with the network slipped to a 22-month low. As per Santiment, a little less than 80,000 hourly active addresses are transacting on the Bitcoin network at the moment, a far cry from the hourly active addresses that once soared above 1.1 million. Furthermore, the drastic drop in the metric was comparable to June 2021 levels, during which Bitcoin’s price slipped to $28,600, its lowest point in nearly 5 months at the time.\n\nIn simpler words, the data shows that Bitcoin holders have been less keen to interact with their coins amidst an uncertain environment, and the low volatility could be keeping Bitcoin restricted below $30,000.\n\nSupply on exchanges hit new lows\n\nHistorically, supply held on exchanges can signal bullish or bearish market sentiment. A rudimentary explanation of this phenomenon is as follows.\n\nWhen the supply of particular cryptocurrencies on exchanges increases, it indicates that traders are not interested in retaining the digital assets and are likely selling to exchanges in expectation of a price drop. Conversely, a low amount of supply on exchanges indicates that traders are comfortable retaining assets and anticipate a price increase in the near future. In Bitcoin’s case, the supply on exchanges slipped to its lowest in five years during the second week of May 2023. Santiment showed that the supply has continued to slip on exchanges since then as well. But isn’t that a positive development? Not if you throw a wrench in the works.\n\nYou may be aware that, following the infamous collapse of FTX, centralized exchanges have been under intense scrutiny. Many exchanges have been compelled to limit the products or services they offer in top crypto countries, like the United States, due to regulatory pressure. In the face of this regulatory uncertainty, several companies, such as Coinbase, are considering relocating their headquarters.\n\nTherefore, a lower supply of Bitcoins on exchanges could be interpreted as investors hoarding digital assets amidst regulatory uncertainty. In other words, it means that no money is flowing into Bitcoin. Recently, CoinDesk argued that a dwindling stablecoin balance on exchanges suggested that the rotation of money out of stablecoins and into BTC has been the major driver of the cryptocurrency's 70 percent rally this year, and not new institutional inflows.\n\nProfit-Taking\n\nThe interaction between traders at certain price levels helps understand the position of market bulls and bears. On that front, data platform CryptoQuant revealed that a possible explanation for Bitcoin’s price being stuck below the $30,000 mark is due to the presence of profit-taking investors who bought Bitcoin at $28,600.\n\nThe data was compiled by analysing Bitcoin’s Sum Coin Age Distribution chart, which reflects the distribution of coin holders by their holding duration. The chart noted a sharp decline after May 2, 2023, suggesting that a large number of traders were liquidating their Bitcoins to realize profits. CryptoQuant explained that the data is a typical reaction to a market reaching a probable local peak. It said that due to an increase in market sales volume, there's downward pressure on Bitcoin, which is hindering its growth.\n\nConclusion\n\nAside from macroeconomic concerns, various internal variables may be hindering Bitcoin's price rebound over the $30,000 threshold. However, this does not guarantee that Bitcoin's price would climb if these measures begin to indicate favourable results.\n\nInstead, these indicators aid in understanding historical price performance, whereas future performance is determined by a number of varying factors. At the time of writing, Bitcoin was trading at $26,931, down by 1.25 percent over the last 24 hours."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLW5ldHdvcmstdXNhZ2UtZHJvcHMtYnV0LXRoYXQtbWF5LW5vdC1iZS1hLWJhZC10aGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin Network Usage Drops, But That May Not Be a Bad Thing - DailyCoin",
        "content": "Daily unique transactions on the Bitcoin network have seen a significant drop.\n\nDespite this fall, the reduction could provide an impetus for development.\n\nThe Lightning Network promises to solve Bitcoin’s scaling problems.\n\nScalability issues remain the bane of most major blockchain networks, most recently, Bitcoin. The biggest crypto has seen a drop in network usage as it continues to struggle with network congestion.\n\nOn Thursday, May 18, the number of unique addresses performing transactions daily dropped to less than 800k. This marks a 22-month low for Bitcoin, the lowest level since July 2022.\n\nHowever, this drop might not necessarily signal the decline of Bitcoin’s utility. As scaling solutions increase in popularity, Bitcoin’s Network could naturally see a drop in activity.\n\nLightning Could Ease Bitcoin’s Congestion Issues\n\nThe drop in unique daily transactions doesn’t account for transactions via the Lightning Network, Bitcoin’s Layer-2. For some, this scaling solution holds the keys to making Bitcoin transactions faster and cheaper.\n\nWith the growing popularity of scaling solutions, Bitcoin’s congestion issues could be relieved. This would, however, likely result in a natural decrease in the base layer’s transaction activity as more users migrate to second-layer solutions.\n\nStill, the recent drop in transactions on the Bitcoin network has not been accompanied by a corresponding activity on the Lightning Network. This indicates that, despite its advantages, Lightning Network still has hurdles before it can reach mass adoption.\n\nFor instance, technical challenges, such as routing issues and channel capacity constraints, have been a sticking point for some users. Furthermore, setting up a Lightning node can be daunting for non-technical users, posing another barrier to widespread adoption.\n\nBitcoin Struggling With Ordinals\n\nThis sudden decrease in unique transactions is likely due to the rise of ordinals. These inscriptions, Bitcoin’s answer to Non-Fungible Tokens (NFTs), are becoming increasingly popular. However, their popularity comes at a price, helping escalate the network’s gas fees.\n\nAs gas prices continue to climb, more and more users start avoiding transactions that are not necessary. This is likely the reason behind the noticeable reduction in overall network activity.\n\nOn the Flipside\n\nIn May, Litecoin hit a record amount of transactions thanks to rising fees and congestion on the Bitcoin network.\n\nThe Bitcoin community is not in agreement with how to deal with ordinals. In May, one core developer’s suggestion to ban ordinals started a civil war in the community.\n\nWhy This Matters\n\nBitcoin’s scaling issues could significantly impact the dominant crypto in the future. As the community tackles the scaling issues, it is crucial to understand how they impact the network.\n\nRead more about how Lightning can tackle the ordinals issue:\n\nHow Lightning Network’s Taproot Upgrade Solves BRC-20 Issues\n\nRead about the latest trends in the retail use of DeFi:\n\nUniswap Survey Uncovers DeFi Barriers, but Users Keen to Experiment"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmZpbmV3cy5jb20vbmV3cy9lbmdsaXNoLW5ld3MvNTczOTYtYml0Y29pbi1zdWlzc2UtY2hhaXItbHV6aXVzLW1laXNzZXItY3JlZGl0LXN1aXNzZS10cmFkaXRpb25hbC1iYW5raW5nLWZhaWx1cmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin Suisse Chair: Credit Suisse Shows Failure of Traditional Banking - finews.com",
        "content": "The rise in the value of Bitcoin signals the start of the crypto spring and is not necessarily linked to this year’s banking crisis, the chair of Bitcoin Suisse said in an interview with finews.com.\n\n«People are too fast to connect recent events to general movements,» Bitcoin Suisse chair Luzius Meisser said, adding that Bitcoin’s gain in value since the beginning of the year corresponds to the four-year cyclicality of the crypto industry.\n\nFor Meisser the recent downfall of one of Switzerland’s systemically relevant banks, Credit Suisse, shows the shortcomings of a centralized banking system trying to tackle risks that usually appear bottom-up.\n\nBesides the ongoing trend of tokenized finance, Luzius sees potential for decentralized collateralized stablecoins which have «the potential to build banks without banks.»\n\nThis allows money creation to be «decentralized and fully transparent,» he said."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmxjeC5jb20vYml0Y29pbi1yZXdhcmRzLWFuZC1uZnRzLXJlZGVmaW5pbmctYmxvY2tjaGFpbi10ZWNobm9sb2d5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin rewards and NFTs: Redefining Blockchain Technology - LCX",
        "content": "Globally, blockchain technology is transforming businesses, and its growth and innovation possibilities seem to be infinite. Bitcoin rewards and NFTs are illustrations of the expansion of blockchain technology and its future impact on various industries. Blockchain, the public, decentralized system that verifies crypto transactions and records ownership of non-fungible tokens, takes a vast amount of computational power as well as electricity.\n\nWhat Are Bitcoin Rewards?\n\nEven after the bitcoin network has mined 210,000 blocks, or approximately once every four years, the block reward provided to Bitcoin miners for processing payments is reduced by half. This event is referred to as a “halving” since it halves the rate at which new bitcoins enter circulation.\n\nThis rewards scheme will continue until the intended limit of 21 million coins is reached in around 2140. At that time, miners will be compensated with transaction fees, which network users will pay. These fees ensure that miners remain motivated to participate and maintain the network’s functionality.\n\nOne bitcoin app rewards users and allows them to earn bitcoin or cash back when they spend at over 10,000 establishments, including McDonald’s, Starbucks, Dunkin’ Donuts, CVS, Costco, etc.\n\nIn 2009, the reward for each chain block mined was fifty bitcoins. As of April 2023, there were around 19.3 million bitcoins in circulation, leaving 1.68 million to be released as mining incentives.\n\nThe influence of bitcoin rewards and NFTs on various industries is enormous. Here are some potential future contributions they could make to blockchain technology:\n\nGreater Adoption: As more individuals mine bitcoin and create NFTs, the technology becomes more available and widespread. This could lead to increased adoption of blockchain technology across businesses.\n\nImproved Security: Bitcoin rewards promote bitcoin mining, which strengthens the security of the network. This enhanced security may make blockchain technology more appealing to industries requiring high levels of security, such as finance and healthcare.\n\nEfficient Transactions: NFTs permit more efficient asset purchases and sales, as well as fractional ownership. This could result in more cost-effective and efficient transactions across industries, thereby decreasing expenses and increasing productivity.\n\nNew Business Models: Bitcoin rewards and NFTs enable the creation of historically inconceivable new company models. This could result in the formation of new businesses and sectors, encouraging job creation and economic expansion.\n\nNonetheless, the expansion of blockchain technology through bitcoin rewards and NFTs,presents a number of possible obstacles. One difficulty is regulatory oversight. Governments will need to control the technology to guarantee that it is utilized in a legal and ethical manner as it expands.\n\nAnother difficulty is scalability. As more individuals mine bitcoin and create NFTs, the blockchain network becomes congested, resulting in slower transaction times and increased transaction fees. This could restrict the future expansion of blockchain technology.\n\nProof of Stake (POS) Over Proof of Work (POW) Mechanism\n\nMany of the most popular cryptocurrencies rely on “Proof of Work” methods, which consume more energy. In POW systems, miners compete to see who can solve problems the quickest in exchange for cryptocurrency incentives. Such POW systems require a great deal of energy.\n\n“Proof of Stake” systems, on the contrary, depend on market incentives, and “validators” make a deposit (a stake) in exchange for the privilege of adding blocks to the blockchain. Reducing rivalries in the system by using Proof of Stake (POS) is said to cut carbon dioxide emissions by 99.9 percent compared to Proof of Work. Ethereum, the second-largest blockchain, has just effectively migrated from a POW system to a POS system.\n\nThe use of sustainable energy sources like mining with solar power and other green energy sources is an obvious method to make blockchain more sustainable.\n\nGenesis Mining, which is headquartered in Iceland, is one of the world’s largest miners, uses only renewable energy, and enables cloud-based Bitcoin and Ethereum mining.\n\nAlthough it can be challenging to store renewable energy, several nations enjoy a distinct advantage. For example, practically 100% of Paraguay’s energy comes from hydroelectric sources. Bitcoin mined in this nation will have a smaller carbon footprint than Bitcoin mined in countries that rely on fossil fuels.\n\nConclusion\n\nBitcoin rewards and non-fungible tokens have the potential to change various industries and accelerate the development of blockchain technology. While there are obstacles associated with this growth, the advantages of blockchain technology are too great to disregard. As we look to the future, it is certain that blockchain technology will have a significant impact on the world in which we live."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vd2VhbHRoL2ludmVzdC90dWctb2Ytd2FyLWRvZ2VtaXlhZ2ktYml0Y29pbi1hbmQtZXRoZXJldW0tYmF0dGxlLWZvci10aGUtdGl0bGUtb2YtdGhlLW1vc3QtY2FwdGl2YXRpbmctY29tbXVuaXR5L2FydGljbGVzaG93LzEwMDM1NjI5My5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL3dlYWx0aC9pbnZlc3QvdHVnLW9mLXdhci1kb2dlbWl5YWdpLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWJhdHRsZS1mb3ItdGhlLXRpdGxlLW9mLXRoZS1tb3N0LWNhcHRpdmF0aW5nLWNvbW11bml0eS9hbXBfYXJ0aWNsZXNob3cvMTAwMzU2MjkzLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Tug-of-war: DogeMiyagi, Bitcoin, and Ethereum battle for the title of the most captivating community - The Economic Times",
        "content": "Spotlight Wire\n\nSpotlight Wire\n\nIn the world of cryptocurrencies, the communities that grow around them are critical to their success. Here, we delve into the distinct communities surrounding DogeMiyagi (MIYAGI), Bitcoin (BTC), and Ethereum (ETH), illuminating how DogeMiyagi distinguishes itself by fostering an interactive community culture through an engaging, humour-driven ecosystem.While respecting the dynamic communities of Bitcoin and Ethereum, DogeMiyagi’s (MIYAGI) approach grabs the interest of seasoned investors eager to extend their portfolio and financial enthusiasts seeking intelligent and insightful information on crypto. So, let us dig into the exciting realm of DogeMiyagi and its analogues.DogeMiyagi is a cryptocurrency that has acquired popularity among enthusiasts due to its casual, lighthearted attitude and meme coin status. The developers of DogeMiyagi recognised the potential of humour and community-driven efforts, which has resulted in a sizable fan base. To their credit, DogeMiyagi enjoys support and involvement from its community members, who are part of its growing fandom.The DogeMiyagi community actively participates in conversations, meme sharing, and mutual encouragement, leading to a vibrant and dynamic atmosphere where seasoned investors and newbies are likely to get vital insights into the cryptocurrency market and also be a part of this shared camaraderie . DogeMiyagi's comic or absurdist tone lends a touch of familiarity and warmth to the conversations, while delivering considerable instructional substance.Aiming to establish an environment that values and benefits all members, DogeMiyagi understands the importance of leveraging the power of community involvementBitcoin, the first cryptocurrency, has built a strong and durable community. The Bitcoin community is primarily made up of early adopters and tech-savvy individuals that have a strong interest in decentralised money. The Bitcoin community has played a critical role in shaping the crypto environment and boosting cryptocurrency acceptance.The Bitcoin community is recognised for its solid ideological position on decentralisation and financial autonomy. Discussions within the Bitcoin community frequently concentrate on technical features, policy consequences, and the future of decentralised currencies. This community set the groundwork for other cryptocurrencies, notably DogeMiyagi , by proving the possibilities of blockchain technology.Ethereum, a popular cryptocurrency and a decentralised platform, has a vast and active community. The Ethereum community comprises developers, entrepreneurs, and anyone interested in using blockchain rather than traditional banking. This community has played an essential role in developing decentralised apps (dApps) and smart contracts.The Ethereum community encourages creativity and cooperation, with members actively discussing potential use cases and Ethereum ecosystem enhancements. The Ethereum community also supports the notion of decentralised finance (DeFi), which has transformed our perception of traditional financial institutions. Ethereum has spurred a new wave of innovation and discovery in the crypto sector by offering a platform for developers to design and deploy dApps.While the Bitcoin community values decentralisation and financial sovereignty, the Ethereum community values innovation and collaboration in dApps and smart contracts; DogeMiyagi’s district, on the other hand, distinguishes itself through its supportive and engaging character. DogeMiyagi has established a dynamic and inclusive platform that appeals to seasoned investors and finance professionals by blending humour, community-driven activities, and instructional information. This amusing and instructive approach has made DogeMiyagi a popular choice for individuals looking for pleasure and valuable insights into cryptocurrency."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZW4taW4vbmV3cy1hbmQtdHJlbmRzL2JpdGNvaW4tYmxvY2tjaGFpbnMtYXZlcmFnZS10cmFuc2FjdGlvbi1mZWVzLXN1cmdlZC05MDAvNDUyNTAy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin Blockchain's Average Transaction Fees Surged 900% To Stand At $15.65 - Entrepreneur",
        "content": "The primary reason behind this drastic increase is said to be the introduction of Ordinals onto the Bitcoin Network\n\nOpinions expressed by Entrepreneur contributors are their own.\n\nYou're reading Entrepreneur India, an international franchise of Entrepreneur Media.\n\nOver the past three months, average Bitcoin transaction fees have skyrocketed by 900%. According to a Bankless Times.com report, the average BTC transaction fees were around $1.5 on February 10, 2023. But these had jumped to $15.56 on May 10, 2023. Reportedly, the primary reason behind this drastic increase is the introduction of Ordinals onto the Bitcoin Network. Ordinals are a new integration into Bitcoin's blockchain, supporting the creation of non-fungible tokens (NFTs) and BRC-20 tokens.\n\n\"Ordinals are driving up demand for transactions and pushing up prices on the Bitcoin network. And while that's great news for miners, it isn't so for small-scale transactors. The rise in NFTs and BRC-20 is straining the blockchain due to its limited block size and scalability issues,\" said Jonathan Merry, CEO, Bankless Times.\n\nThe report stated that if this trend continues, it could lead to serious implications such as centralization of mining power due to higher profits from larger block rewards or even a decrease in overall usage of Bitcoin due to its expensive nature compared with other blockchains like Ethereum or Litecoin.\n\n\"Lowering transaction fees would improve Bitcoin's reputation and increase its use case and appeal,\" said Merry.\n\nFurthermore, the report finds that high transaction fees can put small transactors in a challenging spot since they'd be less inclined to use Bitcoin for smaller exchanges. Currently, Lightning Network works as an alternative option popular among users. Built on top of the Bitcoin blockchain, the Lightning Network operates as a second layer for the Bitcoin network that allows users to process transactions more quickly and for a significantly lower fee."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2FtaWQtYml0Y29pbi1vcmRpbmFscy1oeXBlLWJpdGNvaW4tZnJvZ3MtYmVjb21lLW1vc3QtdHJhZGVkLW5mdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Amid Bitcoin Ordinals Hype, Bitcoin Frogs Become Most Traded NFT - Analytics Insight",
        "content": "Pepe-themed Bitcoin frogs have become the most traded NFT after the Bitcoin Ordinals hype\n\nThe recently released non-fungible token (NFT) named Bitcoin Frogs, which is modeled after Frogs, has surpassed even well-known collections like Bored Apes in terms of volume traded in the last day.\n\nAccording to data from CryptoSlam, the late-February introduction of Bitcoin Frogs on Bitcoin Ordinals saw trade volume exceed US$2.2 million. 10,000 unique frog collectibles are what the collection calls itself; they were minted directly on the Bitcoin Blockchain.\n\nEach NFT was trading for 0.12 bitcoins (BTC), or more than US$3,200, at the time of writing. As of Thursday, trade commissions for buyers and sellers ranged from US$50 to more than US$1,200.\n\nThe data reveals that the trading volume of Bitcoin Frog was split over 627 distinct transactions. Bored Apes, in contrast, only logged a little more than 11 transactions, but at a far greater cost of approximately US$83,000 per NFT.\n\nSince the debut of the Ordinals Protocol earlier this year, NFTs that are issued directly on Bitcoin have become more popular. By including references to digital art in minor Bitcoin-based transactions, the Ordinals Protocol enables users to embed data onto the Bitcoin blockchain; earlier this month, the number of such Ordinals “inscriptions” surpassed 3 million.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LnRla2VkaWEuY29tL2hvdy1iaXRjb2luLXBpenphLWNhbWUtaW50by1leGlzdGVuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "How Bitcoin Pizza Came into Existence - Tekedia",
        "content": "Bitcoin is a revolutionary digital currency that has changed the way people transact and store value. But do you know how it all started? One of the most iconic events in Bitcoin’s history is the Bitcoin Pizza Day, which marks the first time someone used Bitcoin to buy a real-world good.\n\nBitcoin Pizza Day is a reminder of how far Bitcoin has come from its humble beginnings to its current status as a global phenomenon. It is also a celebration of the innovation and creativity of the Bitcoin community, which continues to push the boundaries of what is possible with this technology.\n\nThe story goes back to May 22, 2010, when a Florida programmer named Laszlo Hanyecz posted on a Bitcoin forum that he was willing to pay 10,000 bitcoins for two pizzas delivered to his house. He wrote: “I’ll pay 10,000 bitcoins for a couple of pizzas… like maybe 2 large ones so I have some left over for the next day. I like having left over pizza to nibble on later.”\n\nAt that time, Bitcoin was still a new and obscure technology, with no established market value or widespread adoption. Hanyecz had mined some bitcoins on his computer, but he had no idea what to do with them. He thought it would be cool to exchange them for something tangible, like food.\n\nLuckily, someone took up his offer and agreed to order two pizzas from Papa John’s and deliver them to Hanyecz in exchange for 10,000 bitcoins. The pizzas cost about $30, which means Hanyecz paid around $0.003 per bitcoin. The person who accepted the deal was a British man named Jeremy Sturdivant, who went by the nickname “jercos” on the forum.\n\nThe transaction was completed and Hanyecz posted a picture of the pizzas on the forum, confirming that he had received them. He wrote: “I just want to report that I successfully traded 10,000 bitcoins for pizza. Thanks jercos!”\n\nThe event was recorded on the Bitcoin blockchain as transaction hash ID a1075db55d416d3ca199f55b6084e2115b9345e16c5cf302fc80e9d5fbf5d48d.\n\nLittle did Hanyecz know that his pizza order would go down in history as the first documented case of Bitcoin being used to purchase a physical good. The day of the transaction, May 22, is now celebrated as Bitcoin Pizza Day by the Bitcoin community around the world.\n\nThe significance of Bitcoin Pizza Day is not only that it demonstrated the potential of Bitcoin as a medium of exchange, but also that it showed how much Bitcoin has appreciated in value over time. The 10,000 bitcoins that Hanyecz spent on the pizzas are now worth over $200 million at the current market price of around $20,000 per bitcoin.\n\nThe value of the 10,000 bitcoins used in the transaction has also skyrocketed over time, reaching hundreds of millions of dollars at current prices. This makes the pizzas arguably the most expensive ones ever bought in history. However, Hanyecz does not regret his decision and has said that he enjoyed the pizzas and was happy to be part of the early days of bitcoin.\n\nThat means Hanyecz paid about $10 million per pizza, making them the most expensive pizzas ever bought. Of course, Hanyecz did not regret his decision, as he later said: “It wasn’t like Bitcoins had any value back then, so the idea of trading them for a pizza was incredibly cool.”\n\nThe bitcoin pizza transaction has become part of the folklore of cryptocurrency and is celebrated every year on May 22 as Bitcoin Pizza Day. On this day, bitcoin enthusiasts around the world commemorate the event by buying goods (often pizza) with bitcoin or other cryptocurrencies. Some also use the occasion to reflect on how far bitcoin has come since its inception and how much potential it still has.\n\nThe bitcoin pizza transaction may seem trivial today, but it was a milestone in the history of cryptocurrency. It demonstrated that bitcoin could be used as a medium of exchange for goods and services, not just as a store of value or a speculative asset. It also showed that bitcoin could facilitate cross-border transactions without intermediaries or fees. Moreover, it inspired other people to experiment with using bitcoin for everyday purchases and created a sense of community among early adopters.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC13aGF0LXdpbGwtYmUtYml0Y29pbi1wcmljZS1lbmQtb2YtMjAyMy1oZXJlLWlzLXdoYXQtaXQtc2FpZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "We asked ChatGPT what will be Bitcoin price end of 2023; Here's what it said - Finbold - Finance in Bold",
        "content": "Generative artificial intelligence (AI) sensation ChatGPT has garnered recognition for its versatile capabilities in accurately tackling various tasks. Among many other things, this powerful tool also has the potential to be utilized in the field of trading by providing insights into potential price movements for diverse assets within the market.\n\nHaving said that, Finbold asked ChatGPT to share its predictions for Bitcoin’s (BTC) potential price by the end of 2023, based on metrics such as technical analysis (TA), historical price action, and other popular metrics.\n\nWhile the chatbot stressed that predicting BTC’s future price is “inherently uncertain” due to it being influenced by a number of factors, it also outlined why the leading cryptocurrency could appreciate in value in the coming years.\n\nNotably, OpenAI’s chatbot tool listed “increased adoption, institutional involvement, halving events,” and “market sentiment and speculation” as key drivers that could propel BTC by the end of 2023.\n\n“As Bitcoin continues to gain acceptance and adoption among individuals, institutions, and even governments, it may result in increased demand and potentially drive the price higher.” – ChatGPT said.\n\nAI BTC price prediction\n\nMeanwhile, CoinPriceForecast, a widely-used price prediction tool, was quite bullish on Bitcoin’s price in the coming years. The forecast website predicts BTC to hit $35,085 by the end of 2023, implying a potential upside of more than 30%. Notably, this is over $2,000 more than the price prediction retrieved back in February.\n\nBitcoin price forecast. Source: CoinPriceForecast\n\nFor 2024 and 2025 year-end, the tool estimates Bitcoin to reach $40,290 and $44,766, respectively.\n\nBitcoin price analysis\n\nAt press time on Friday, May 19, Bitcoin was trading at $26,845, down 1.95% on the day. Over the past week, the world’s biggest crypto coin advanced around 1.88%. Still, BTC’s gains since the start of 2023 remain significantly high, up more than 61%.\n\nBTC 1-day price chart. Source: Finbold\n\nEarlier this week, crypto analyst Michaël van de Poppe pointed out a certain must-hold support zone that Bitcoin to prevent a notable price crash.\n\nSpecifically, the expert said that BTC has to remain in the range between $26,800 and $27,000, as failure to do so could push the cryptocurrency below $26,000 “for a potential bullish divergence.”\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi12b2xhdGlsaXR5LXJlYWNoZXMtaGlzdG9yaWNhbGx5LXNpZ25pZmljYW50LWxvd3MtbWFzc2l2ZS1yYWxseS1pbi1zdG9yZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Bitcoin volatility reaches historically significant lows; Massive rally in store? - Finbold - Finance in Bold",
        "content": "Although Bitcoin (BTC) continues to struggle with overcoming the critical psychological level at $28,000, its volatility has dropped to a historically significant range, and previous chart patterns indicate a price increase could follow, although caution is necessary as this has not always been the case.\n\nAs it happens, the 60-day volatility levels of the flagship decentralized finance (DeFi) asset as of May 18 was below 40%, which is the eighth time this has happened in the last five years, according to the data shared by the cryptocurrency analytics platform IntoTheBlock in a tweet on May 18.\n\nBitcoin volatility versus price. Source: IntoTheBlock\n\nWhat this means\n\nAs per the analysis, Bitcoin volatility typically “remains below this level for 5 weeks and results in a 46% price gain.” Having said that, the platform’s team noted that there were still three crashes of around 50% that have “followed similar conditions.”\n\nIn other words, these historical patterns and their timing suggest that Bitcoin has a greater chance of getting to the price range of $39,290 in the near future than it does of dropping to as low as $13,500 – although the latter is still a possibility.\n\nBitcoin price analysis\n\nAs things stand, Bitcoin was at the time of publication changing hands at the price of $26,912, which represents a decrease of 1.25% in the last 24 hours and 7.95% over the previous 30 days but still a 1.86% positive change across the past week, as per data retrieved on May 19.\n\nBitcoin 7-day price chart. Source: Finbold\n\nWhether its low volatility pattern leads toward a bullish rally or bearish slump will depend on factors other than its historical behavior on charts, including further mainstream adoption, and perceived capability to act as a hedge against financial crisis.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]