[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMjQvYml0Y29pbi1yaXNlcy10by1uZXctaGlnaC1mb3ItdGhlLXllYXItZnJpZGF5LWFib3ZlLTM4MDAwLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8yNC9iaXRjb2luLXJpc2VzLXRvLW5ldy1oaWdoLWZvci10aGUteWVhci1mcmlkYXktYWJvdmUtMzgwMDAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin rises to new high for the year Friday above $38,000 - CNBC",
        "content": "Crypto prices have recovered from a big dip earlier in the week, with bitcoin hitting a new high for 2023 on Friday.\n\nBitcoin was last higher by 1.42% at $37,862.76 for the first time since May 2022, according to Coin Metrics. It's on pace to end the week higher by 3.9%. Coin Metrics measures a week in crypto, which trades 24 hours a day, from 4:00 p.m. ET on a given Friday to the same time the following Friday.\n\nMeanwhile, ether has moved back above the key psychological level of $2,000, last trading 1.8% higher at $2,104.14. The second-largest token by market cap is outperforming the crypto market this week, on pace to end up more than 8%.\n\nSolana , the big outperformer on the year — up more than 476% compared to bitcoin's 130% — trailed the major tokens this week. It's hovering just under the flat line for the week."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmtpcGxpbmdlci5jb20vaW52ZXN0aW5nL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tMjAyMy1oaWdoLXByaWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Tops $38000 For First Time This Year In Hectic Crypto Week - Kiplinger's Personal Finance",
        "content": "Bitcoin hit a 2023 high at the end of a week that saw chaos at other cryptocurrencies.\n\nThe price of Bitcoin briefly went over $38,000 on Friday, the first time it's done so this year. This is the first time the cryptocurrency saw those numbers since last summer, and it's been rallying since a dip in the back half of 2022.\n\nCoinbase, too, reached a 2023 high at the end of the week, at its highest level since spring 2022. But while it's a promising time for some investors, the crypto world has had shakeups this week.\n\nSubscribe to Kiplinger’s Personal Finance Be a smarter, better informed investor. Save up to 74% Sign up for Kiplinger’s Free E-Newsletters Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. Sign up\n\nTwo cryptocurrency platforms were hacked, according to CNBC, with a possible $115 million stolen. The affected platforms are the HTX digital currency exchange, which used to be known as Huobi, and the blockchain bridge Heco Chain. Both are linked to entrepreneur Justin Sun.\n\nHTX and Heco Cross-Chain Bridge Undergo Hacker Attack. HTX Will Fully Compensate for HTX's hot wallet Losses. Deposits and Withdrawals Temporarily Suspended. All Funds in HTX Are Secure, and the Community Can Rest Assured. We are investigating the specific reasons for the hacker…November 22, 2023 See more\n\nHTX said it would \"fully compensate for any losses incurred due to the hot wallet attack,\" according to CNBC, and is working on finding the source of the hack.\n\nMeanwhile, Binance and its CEO, Changpeng Zhao (CZ), pleaded guilty to federal charges related to money laundering, the Department of Justice announced Tuesday. The plea came with an agreement to pay more than $4 billion.\n\n\"Binance became the world’s largest cryptocurrency exchange in part because of the crimes it committed – now it is paying one of the largest corporate penalties in U.S. history,\" Attorney General Merrick Garland said in a statement.\n\nThe DOJ's statement also included apparent warnings to other crypto platforms, highlighting the work the department has done to crack down on the industry.\n\n\"The message here should be clear: using new technology to break the law does not make you a disruptor, it makes you a criminal,\" Garland continued.\n\n\"Any institution, wherever located, that wants to reap the benefits of the U.S. financial system must also play by the rules that keep us all safe from terrorists, foreign adversaries, and crime or face the consequences,\" Secretary of the Treasury Janet L. Yellen said in the same announcement.\n\nBinance users pulled over $1 billion off the exchange since the news came out, CNBC reported.\n\nOf course, this all comes in the wake of FTX founder Sam Bankman-Fried being found guilty of fraud earlier this month, making it a largely chaotic month for the crypto world."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzI1L2JpdGNvaW4tYnV5LXRoZS1kaXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin: Buy the Dip? - The Motley Fool",
        "content": "The stock market and the overall cryptocurrency market have had great years thus far, rewarding investors with strong gains. In this type of bullish environment, it's no surprise that Bitcoin (BTC -2.83%) has soared 125% (as of Nov. 21).\n\nDespite the renewed sense of optimism surrounding the world's most valuable cryptocurrency, its current price of roughly $37,000 is 47% below the peak price from about two years ago. There's still a lot of room before Bitcoin can get back to its all-time high.\n\nIs it a smart move for investors to buy this digital asset on the dip? Let's take a closer look.\n\nA favorable setup\n\nNow might be one of the best times to buy Bitcoin because of an event known as a halving. Miners, or those who expend computing power and electricity to approve transactions, are rewarded with new coins. Happening about every four years, a halving is when Bitcoin's inflation rate of new supply gets cut in half. It's set to happen in April next year.\n\nOver time, as rising demand has taken hold, coupled with less supply hitting the market, Bitcoin's price has trended higher. And looking at history, in the several months leading up to a halving, and in the months after, the price has generally been in bull market territory.\n\nThere's also anticipation that the Securities and Exchange Commission (SEC) is poised to finally approve spot Bitcoin exchange-traded funds. Some of the largest asset managers in the world, in charge of trillions of dollars, have applied for this financial product to come to market.\n\nIt's hard to know what the SEC will decide, but there's anticipation it will be positive. And this could open up the floodgates of fresh capital being directed to Bitcoin, which can help support a higher price.\n\nI'm no macroeconomic expert, but there's another potential catalyst for Bitcoin on the horizon, and it involves what the Federal Reserve does. With inflation showing signs of cooling, the central bank might decide to start cutting interest rates in 2024. Moreover, if the U.S. economy ends up entering a recession, the Fed will also have no choice but to reduce rates. This scenario can benefit risky assets like Bitcoin.\n\nA unique financial asset\n\nBesides the possibility of three catalysts for Bitcoin's price in the near term, there are some other reasons investors might be interested in owning this asset.\n\nJust look at what has happened in 2023: Bitcoin, often viewed as extremely risky to own, has crushed the performance of Treasuries and gold, both of which are seen as two of the safest assets to own. It's encouraging to see Bitcoin's price skyrocket this year amid economic and geopolitical uncertainty.\n\nSome investors might view Bitcoin as a much more attractive asset in light of what's going on in the traditional financial system, thanks to its decentralized nature where no single entity is in charge.\n\nFinancial mismanagement by the government has seemed to cause rising costs for everything. Plus, budget deficits, increasing debt balances, underfunded entitlements, and the continuous threat of government shutdowns are likely only going to get worse. This situation makes buying Bitcoin, an asset completely outside of this fiat architecture, look incredibly smart.\n\nTo be clear, this is still a very volatile asset, which might be hard for most investors to stomach. So it's a good idea to allocate a tiny percentage of your overall portfolio to Bitcoin. As you learn more and gain greater conviction, it makes sense to increase that allocation."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvYml0Y29pbi1leWVzLTQway1hZnRlci1icmVhY2hpbmctMzhrLWZvci1maXJzdC10aW1lLXNpbmNlLW1heS0yMDIyL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvYml0Y29pbi1leWVzLTQway1hZnRlci1icmVhY2hpbmctMzhrLWZvci1maXJzdC10aW1lLXNpbmNlLW1heS0yMDIyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Eyes $40K After Breaching $38K for First Time Since May 2022 - CoinDesk",
        "content": "\"When approved, the volatility of BTC will be significant during these periods which create additional risks for investors but as well opportunities for those arbitraging. Would not be surprised if we see 40K being broken this weekend,\" Kssis said."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vY29pbmJhc2Utc2hhcmVzLWFkdmFuY2UtYWZ0ZXItYml0Y29pbi1oaXRzLXVzZDM4ay1iaW5hbmNlLXNldHRsZW1lbnQtODQwNjQ5NtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Coinbase Shares Advance After Bitcoin Hits $38K, Binance Settlement - Investopedia",
        "content": "Key Takeaways Coinbase shares took off along with the price of Bitcoin, and as the exchange benefited from a legal settlement by larger rival, Binance.\n\nBitcoin traded above $38,000 for a short period today, the highest its been this year.\n\nAnalysts have suggested the Binance settlement could speed up U.S. regulatory approval of a Bitcoin exchange-traded fund (ETF).\n\nCoinbase Global (COIN) shares jumped as biitcoin (BTCUSD) traded at a 2023 high, and it appeared the firm has benefited from the recent legal problems for the world’s largest crypto exchange, Binance.\n\nData analyzed by on-chain research firm CryptoQuant reported by Coindesk suggests that Coinbase’s reserves of bitcoin have jumped recently, while they’ve declined at Binance.\n\nEarlier this week, Binance pleaded guilty to federal charges of money laundering. The company agreed to pay $4.3 billion in penalties, and founder and CEO Changpeng Zhao, known as CZ, also pleaded guilty and said he would step down.\n\nAnalysts indicated that another potential benefit to Coinbase is that the Binance legal decision may help pave the way for U.S. regulators to approve a Bitcoin exchange-traded fund (ETF).\n\nBitcoin traded above $38,000 for a short period before giving up some ground. It remained in positive territory at midday.\n\nShares of Coinbase Global were at their highest level since April 2022.\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vYmh1dGFuLXJ1bm5pbmctc2VjcmV0LXN0YXRlLW93bmVkLWJpdGNvaW4tbWluaW5nLWZhY2lsaXRpZXMtaW4taGltYWxheWFzLTIwMjMtMTHSAXRodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuY29tL2JodXRhbi1ydW5uaW5nLXNlY3JldC1zdGF0ZS1vd25lZC1iaXRjb2luLW1pbmluZy1mYWNpbGl0aWVzLWluLWhpbWFsYXlhcy0yMDIzLTExP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Bhutan running secret, state-owned Bitcoin mining facilities in Himalayas - Business Insider",
        "content": "Forbes said it had identified the sites of four secret, state-owned Bitcoin mining facilities in Bhutan.\n\nThe publication used satellite imagery to identify the sites.\n\nEl Salvador is the only other country known to operate state-owned Bitcoin mining facilities.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe Kingdom of Bhutan has secretly developed a series of bitcoin mining facilities, a Forbes investigation has revealed.\n\nUsing satellite imagery from Planet Labs, Satellite Vu, and Google Earth, as well as sources with knowledge of Bhutan's crypto investments, the publication said it found the sites of what appear to be four crypto-mining facilities that have never been publicly disclosed.\n\nThe satellite images reveal long, rectangular mining units and data center cooling systems hidden amongst dense forests and mountainous terrain across the Himalayan country. Other images also show high-capacity power lines and transformers running from Bhutan's hydroelectric plants to the mining sites, Forbes reported.\n\nRelated stories\n\nOne site was located near Dochula Pass, a sacred area that has 108 memorial shrines, while the others were identified in Trongsa, a mountainous town in the center of the country, Dagana in the south, and an area called \"Education City,\" a failed $1 billion government project to revive the economy.\n\nAdvertisement\n\nBy tracking earth-moving and building construction, Forbes said that work at the sites likely began in 2020.\n\nThe Dochula Pass is a Bhutanese mountain pass located on the road from Thimphu to Punakha, near where one of the mining facilities has been discovered. VW Pics / Getty\n\nBitcoin mining is an energy-intensive process that consumes around 91 terawatt-hours of electricity annually — more than many countries, and Bhutan's crypto-mining operations have seen the country's energy imports and usage soar in recent years. The kingdom, which has historically sold its surplus of hydropower to India, purchased $20.7 million worth of electricity in 2023.\n\nBhutan's monarch, King Jigme Khesar Namgyel Wangchuck, has long held a fascination with the cryptocurrency, and he hopes that it will help prevent the remote, bio-diverse mountain nation of less than 800,000 people from falling into an economic crisis.\n\nBhutan – which has been dubbed the \"The Last Shangri-la\" - suffered from declining tourism during the COVID-19 pandemic, while it also faces rising youth unemployment and a brain drain triggered by surging rates of emigration.\n\nAdvertisement\n\nEl Salvador is currently the only country in the world known to run state-owned crypto mines."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9pbmR1c3RyeS1uZXdzL25ld3MvYml0Y29pbi1idWxsLWNhdGhpZS13b29kcy1hcmstY3V0LWJhY2staG9sZGluZ3MtaW4tdG9wLXRydXN0LTI0NjIwMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin bull Cathie Wood's ARK cuts back holdings in top trust - InvestmentNews",
        "content": "While Cathie Wood has been touting her bullish stance on Bitcoin in recent months, her firm ARK Investment Management actually cut holdings in the Grayscale Bitcoin Trust.\n\nArk Next Generation Internet ETF has sold more than 700,000 shares of Bitcoin Trust since Oct. 23, according to the ETF provider’s daily trading data compiled by Bloomberg. It offloaded 36,168 shares on Wednesday. Bitcoin Trust enables investors to gain exposure to Bitcoin in the form of security.\n\nThe sales have taken place even as Bitcoin rose to its highest level since May 2022 earlier this month, rallying despite the uncertainty caused by policymakers taking action against crypto founders Changpeng “CZ” Zhao of Binance Holdings Ltd. and Sam Bankman-Fried of FTX. The cryptocurrency has more than doubled this year.\n\nArk’s officials didn’t respond to Bloomberg’s e-mailed queries. US markets were closed for a Thanksgiving holiday on Thursday.\n\nWood touted Grayscale Bitcoin Trust as her top pick at the Sohn Australia conference at the Sydney Opera House on Friday, according to the Australian Financial Review. Ark was the fourth largest holder of the trust with 5.6 million units as of Sept. 30, data compiled by Bloomberg show.\n\nThe daily trading updates from Ark show only active decisions by the management team and do not include creation or redemption activity caused by investor flows. Ark’s internet ETF is up 65% for the year compared with a 46% advance in the Nasdaq 100 Index."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3NhY29ic2VydmVyLmNvbS8yMDIzLzExL29waW5pb24tYmxvY2tjaGFpbi10aGUtYmFja2JvbmUtb2YtYml0Y29pbi1oYXMtcG93ZXItdG8taW5jcmVhc2UtYWNjb3VudGFiaWxpdHktYW5kLXRyYW5zZm9ybS1pbmR1c3RyaWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Opinion: Blockchain, the Backbone of Bitcoin, Has Power to Increase Accountability and Transform Industries - Sacramento Observer",
        "content": "By Samuel Houston | Special to California Black Media Partners\n\n(WIB) – The rise of cryptocurrencies and blockchain technology has sparked a revolution that holds the promise of greater financial accountability. While many may view cryptocurrencies as nothing more than speculative assets, to better understand the transformative power they have, it is crucial to delve deeper into the underlying blockchain technology that supports them.\n\nBlockchain, the technology underpinning cryptocurrencies like Bitcoin and Ethereum, is essentially a decentralized ledger that records all transactions across a network of computers. This ledger is immutable and transparent, making it virtually tamper-proof. Transactions are grouped into “blocks,” and each block is linked to the previous one, forming a chain of blocks, hence the name “blockchain.”\n\nIt’s common to hear people talk about investing in cryptocurrencies without fully comprehending the intricacies of blockchain technology. While it’s not necessary for every user to be a blockchain expert, a basic understanding of how it works can help one appreciate the significance of this innovation.\n\nOne of the most compelling aspects of blockchain technology is its wide range of use cases. Beyond serving as the backbone of cryptocurrencies, blockchain has the potential to revolutionize various industries, including agriculture, entertainment, real estate, and retail.\n\nIn the agricultural industry, it enables the tracking of agricultural products from farm to table, recording information such as seed quality, crop growth, and the journey of a plant post-farm. This transparency ensures the authenticity of food products, reduces fraud, and enhances food safety. TE-FOOD has already revolutionized the tracing application\n\nof blockchain technology, providing over 150 million people access to farm-to-table foods across the globe.\n\nBlockchain-based platforms are revolutionizing the entertainment industry by ensuring fair compensation to artists and content creators through smart contracts, eliminating intermediaries. Artists and creators can receive fair compensation for their work through transparent and automatic royalty payments, eliminating intermediaries who often take a substantial cut. Companies like Hollywoodland and Decentralized Pictures are even leveraging crypto tokens and blockchain to identify emerging talent and finance projects.\n\nReal estate transactions frequently entail multiple intermediaries, leading to high fees and lengthy processes. However, blockchain technology can greatly simplify property transactions, rendering them more efficient, secure, and cost-effective. For instance, Docuwalk by ShelterZoom used blockchain to oversee every facet of the real estate offer and acceptance procedure. This secure online platform meticulously documents each step in the journey towards finalizing a real estate deal, thereby guaranteeing an immutable financial record, and enhancing consumer protection.\n\nConsumers are already reaping the rewards of blockchain technology within the retail sector. Starbucks has leveraged blockchain technology to enhance customer satisfaction through a loyalty program that enables customers to accumulate rewards points from every purchase made at their stores. These accumulated points can later be redeemed for valuable rewards. Similarly, Walmart has adopted blockchain technology to offer loyalty programs, granting reward points to all customers who make purchases at their stores.\n\nOne of the key features of cryptocurrency that often comes under scrutiny is its financial accountability. Critics argue that the decentralized nature of cryptocurrencies makes it challenging to hold individuals accountable for illicit activities. While it’s true that there is no centralized middleman, it’s essential to recognize that blockchain\n\ntechnology itself provides a level of accountability that traditional financial systems cannot match.\n\nEvery transaction on the blockchain is recorded and publicly accessible, making it possible to trace the flow of funds. This transparency can deter fraudulent activities and provide a level of financial accountability that is often lacking in traditional banking systems.\n\nCritics may contend that the absence of intermediaries means users must take responsibility for their financial transactions, which can be challenging for some. However, this very aspect empowers individuals to have greater control over their finances. With cryptocurrencies, you are your bank, and you can manage your assets directly, without reliance on third parties.\n\nCryptocurrencies and blockchain technology have ushered in a new era of financial accountability and empowerment. While it’s essential for users to educate themselves and exercise responsibility, the benefits of transparency, efficiency, and reduced reliance on intermediaries cannot be understated. Cryptocurrencies and blockchain are not merely speculative assets but represent a significant step towards a more accountable and decentralized financial future, ultimately putting power back in the hands of the people.\n\nAbout the Author\n\nSamuel Houston is a Fresno resident. He views cryptocurrency and blockchain technologies as a way for the Black community to take control of their finances and as another means to support his daughter."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qaW0tY3JhbWVyLWFkbWl0cy13cm9uZy1vbi1iaXRjb2luLW1hZGUtcHJvZml00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Jim Cramer admits he was wrong about Bitcoin — 'I was premature' - Cointelegraph",
        "content": "Markets commentator Jim Cramer has tacitly admitted he was wrong about Bitcoin (BTC), saying he was premature in calling for investors to sell the cryptocurrency.\n\nIn a Nov. 22 segment of his CNBC Mad Money show, Cramer responded to a caller who inquired about buying shares in Bitcoin miner CleanSpark, saying that anyone who likes Bitcoin should increase their exposure to it.\n\n“Look, if you like Bitcoin, buy Bitcoin. That has always been my view. And for a while, I liked it, and I decided that money had been made, but I was premature.”\n\nCramer added that despite not having made perfect calls on Bitcoin previously, he’d still “made a lot of money” from his investment in it.\n\nOn Dec. 5, 2022, when Bitcoin was trading for $17,150, Cramer urged investors to sell all their crypto investments no matter the cost, saying it was “never too late to sell an awful position.” The price of Bitcoin has rallied 118% since, with BTC currently changing hands for $37,390.\n\nCramers’ predictions, along with his on-again, off-again love-hate relationship with crypto, have become a popular meme throughout investing communities over the past few years, with many pointing out his uncanny ability to make incorrect calls at key moments.\n\nRelated: Bitcoin to $1M post-ETF approval? BTC price predictions diverge wildly\n\nIn August 2022, a crypto trader claimed to have doubled the size of his portfolio simply by trading in the opposite direction to what Cramer recommended.\n\nTwo months later, on Oct. 6, an investment fund filed for an “inverse Cramer ETF” — a financial instrument designed to return results on trades “that are approximately the opposite of, before fees and expenses, the results of the investments recommended by television personality Jim Cramer.”\n\nFinally happened: Cramer ETFs\n\n\n\nInverse Cramer ETF $SJIM\n\nLong Cramer ETF $LJIM\n\nEff Dec 19\n\n\n\n20-25 equal-weighted stocks/ETFs based on Cramer's Twitter & TV recommendations and market views. Positions exited if Cramer has no view & once profit targets met.https://t.co/ZvA5G2zoTX pic.twitter.com/tY9yBMt15s — ETF Hearsay by Henry Jim (@ETFhearsay) October 5, 2022\n\nMagazine: This is your brain on crypto — Substance abuse grows among crypto traders"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY0NTg1L3dhbGxldC1vZi1zYXRvc2hpLWJpdGNvaW4tbGlnaHRuaW5n0gFLaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY0NTg1L3dhbGxldC1vZi1zYXRvc2hpLWJpdGNvaW4tbGlnaHRuaW5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Major Bitcoin Lightning wallet provider quits US market - The Block",
        "content": "Bitcoin BTC -2.26% Lightning wallet provider Wallet of Satoshi has removed its app from the U.S. Apple and Google app stores, with the firm clarifying that it “will not serve U.S. customers going forward.”\n\nThe Wallet of Satoshi team did not specify any particular reasons for the decision, stating it understood the news was disappointing for U.S. customers. The app remains available for download in other countries.\n\nThe Bitcoin Lightning app sought to assure existing users in the U.S. that their funds were accessible and can be withdrawn and transferred to another wallet service.\n\nUsers earlier speculated that the app may been banned in the U.S. as a result of the regulatory environment surrounding the crypto industry in the country, especially given the recent legal action taken against Binance and its former CEO, Changpeng Zhao. The firm has come out saying it was its decision to remove the app.\n\n“Wallet of Satoshi needs to comply with local regulations or laws in ways that it cannot, or does not want to,” John Carvalho, CEO of Bitcoin software developer Synonym, said in response.\n\nThe firm remains hopeful of a return in the country with future developments. “We’re hopeful that future developments will allow us to revisit and possibly resume our operations in the U.S.,” it added\n\nOne million Lightning transactions and near record capacity\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nWallet of Satoshi is one of the most popular Bitcoin Lightning wallets and projected to process more than a record one million Lightning Network payments in November. Nonetheless, the firm has previously faced criticism for the custodial nature of its app, which retains control over users’ funds, unlike non-custodial solutions that allow users to maintain full control over their bitcoin.\n\nWallet of Satoshi's decision to exit the U.S. market coincides with the Lightning Network’s capacity rising back to all-time highs in both U.S. dollar and bitcoin terms, according to The Block’s data dashboard.\n\nU.S. dollar capacity has jumped 67% over the last two months to reach $207 million, just shy of the $215 million record set in November 2021 at the peak of the bull market. Bitcoin capacity rose 20% over the same period to hit 5,530 BTC, slightly below the previous 5,640 BTC record set in July.\n\nWallet of Satoshi did not immediately return a request for comment from The Block."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI0L2FudG1pbmVyLWZvdW5kcnktYmF0dGxlLWluLWhhc2hyYXRlLXdhci1hcy1iaXRjb2luLWV0Zi1uZWFycy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yNC9hbnRtaW5lci1mb3VuZHJ5LWJhdHRsZS1pbi1oYXNocmF0ZS13YXItYXMtYml0Y29pbi1ldGYtbmVhcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's Hashrate War Between Antpool and Foundry Intensifies as BTC ETF Nears - CoinDesk",
        "content": "\"We expect miners would only sell just enough bitcoins to keep the business operating before any bitcoin ETFs are approved or just keep the coins and borrow to pay,\" Hu said. \"The halving event will double the production costs, so it is in the miner’s best interest to get the latest model of machine to lower the cost and earn more market share.\""
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi10b3VjaGVzLTM4ay1vbi1xdWlldC1ob2xpZGF5LXdlZWtlbmQv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8yNC9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLXRvdWNoZXMtMzhrLW9uLXF1aWV0LWhvbGlkYXktd2Vla2VuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Touches $38K on Quiet Holiday Weekend - CoinDesk",
        "content": "A significant number of Grayscale Bitcoin Trust (GBTC) shares have been bought in the secondary market this year at a deep discount to net asset value in anticipation the trust’s conversion to an exchange-traded fund (ETF) will be approved by the U.S. Securities and Exchange Commission (SEC), JPMorgan said in a research report Thursday. The bank estimates a net $2.5 billion has flowed into GBTC since the start of the year, increasing to $2.7 billion if adding the covering of short interest. “Assuming this buying flow was mostly speculative in anticipation of GBTC being converted to an ETF, then it is likely that this $2.7b would come out of GBTC as these investors take profit once GBTC gets converted,” analysts led by Nikolaos Panigirtzoglou wrote."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzI0L2dyYXlzY2FsZS1iaXRjb2luLXRydXN0LWNvdWxkLXNlZS0yN2Itb2Ytb3V0Zmxvd3MtaWYtZXRmLWNvbnZlcnNpb24taXMtYXBwcm92ZWQtanBtb3JnYW4v0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvZ3JheXNjYWxlLWJpdGNvaW4tdHJ1c3QtY291bGQtc2VlLTI3Yi1vZi1vdXRmbG93cy1pZi1ldGYtY29udmVyc2lvbi1pcy1hcHByb3ZlZC1qcG1vcmdhbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Grayscale Bitcoin Trust Could See $2.7B of Outflows if ETF Conversion Is Approved: JPMorgan - CoinDesk",
        "content": "“If this $2.7b exits completely the bitcoin space then such an outflow would of course put severe downward pressure on bitcoin prices,” the authors wrote. “If instead most of this $2.7b shift into other bitcoin instruments such as the newly created spot bitcoin ETFs post SEC approval, which is our best guess, then any negative market impact would be more modest.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjQvYml0Y29pbnMtMy13ZWVrLWNvbnNvbGlkYXRpb24tdW5kZXItMzhrLWhhcy1idWxsaXNoLXVuZGVydG9uZS_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzI0L2JpdGNvaW5zLTMtd2Vlay1jb25zb2xpZGF0aW9uLXVuZGVyLTM4ay1oYXMtYnVsbGlzaC11bmRlcnRvbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's 3-Week Consolidation Under $38K Has Bullish Undertone - CoinDesk",
        "content": "\"Upward breakouts occur 77% of the time, and breakouts happen roughly 61% of the distance (time) from the base to the cradle,\" Kirkpatrick II and Dahlquist say in the book while warning of the potential for failed breakouts. A fake breakout happens when prices move beyond the resistance, only to fall back into the pattern quickly, trapping buyers on the wrong side of the market."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzExLzI1L3JlZ3VsYXRpb24taXMtdGhlLW1haW4tc3RpY2tpbmctcG9pbnQtZm9yLWNyeXB0by1hcy1iaXRjb2luLWluY2hlcy10by1hbm90aGVyLW5ldy0yMDIzLWhpZ2guaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Regulation is the main sticking point for crypto as bitcoin inches to another new 2023 high - CNBC",
        "content": "Bitcoin rallied to start the week, touched a new 2023 high to end it and suffered a brief drop in between, weighed down by the trouble at Binance. Bitcoin ended the week higher by about 4% after touching a new 2023 high on Friday above $38,000. Meanwhile, ether advanced 8%. Coin Metrics measures a week in crypto, which trades 24 hours a day, from 4:00 p.m. ET on a given Friday to the same time the following Friday. There was an array of events driving the price this week – from the election in Argentina , the minutes of the latest Fed meeting and updates to bitcoin ETF applications, to the Binance settlement and the leadership coup at OpenAI . These things not only highlighted the nuance in bitcoin's purpose and identity, it also put the crypto industry's long-standing regulatory woes back in focus for investors. \"The thing I'd be focused on over the short term is what kind of news we have on the regulatory front versus what is already discounted by traders,\" Zach Pandl, managing director of research at Grayscale Investments, told CNBC. \"Are we going to see news that's positive enough that gives us new price highs given the way people are already positioned?\" BTC.CM= 1Y mountain Bitcoin, 1 year For the year, bitcoin is up about 130% even after remaining stuck in a tight range for most of it. Optimism about the likely approval of a spot bitcoin ETF has been building for the past couple months, serving as the biggest catalyst for the cryptocurrency. Pandl (whose company is a key player in the push to get an ETF off the ground with its popular GBTC product) said he thinks the market will continue to get good news on the ETF front. Moreover, as the industry recovers from the black eye FTX dealt it this time last year, regulators are learning how to separate different market participants. \"Regulators are very clearly segregating a variety of issues – on one hand, bad actors and parts of the business [of crypto] that we don't want to see continue, versus the asset management community [and] ETF community, which is just providing a product to the public,\" he said. The challenge is that active crypto trader positioning appears long, he added, based on activity in crypto futures, options, open interest and funding rates. \"While we may hear more positive news about the prospect of an ETF approval, some of that is priced in so things need to happen sooner or more smoothly for them to incrementally move a price,\" he said. Meanwhile, Michael Rinko, a research analyst at Delphi Digital, said this week's Binance settlement is one piece of evidence of a new narrative forming in crypto regulation, one in which the Biden administration could be starting to view crypto through a similar lens to which they see technology fields like artificial intelligence and semiconductors. It may be a long while before crypto reaches the level of priority as AI, he added, but the latest Binance development is part of an emerging narrative. \"Increasingly, the view in from the U.S. government's perspective is that they're viewing more and more technology through the lens of national security,\" he said. Rinko highlighted examples such as semiconductors and the CHIPS act and increasing engagement with AI leading to restrictions on some of Nvidia's higher-end chips, and said a similar path could be coming for crypto. Already underway is a sort of regulatory attack on the crypto players the U.S. deems unacceptable, he said, adding it will likely fracture the crypto world into two spheres. \"There will be the Western sphere of influence where there's Coinbase , Kraken and exchanges that have relationships and ties to the so-called West, and then there will be Eastern exchanges that operate outside the influence and control of the U.S. and its allies and are persona non grata from a U.S. perspective,\" he said."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbmpveS1zdWItNDBrLWJpdGNvaW4tcGxhbi1iLTEwMGstYXZlcmFnZS1idGMtcHJpY2UtMjAyNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "'Enjoy sub-$40K Bitcoin' — PlanB stresses $100K average BTC price from 2024 - Cointelegraph",
        "content": "Bitcoin (BTC) buyers should enjoy the chance to add to their stack below $40,000, says one of the crypto industry’s household names.\n\nIn a post on X (formerly Twitter) on Nov. 24, PlanB, creator of the stock-to-flow family of BTC price models, hinted that current levels would not be around long.\n\nPlanB: Time is ticking on $40,000 resistance\n\nBitcoin is destined to go much higher than its recent 18-month highs, PlanB believes, and time is ticking to increase BTC exposure below $40,000.\n\nKnown for his optimistic takes on long-term BTC price growth, PlanB used realized price data to support the case for bulls.\n\nRealized price is Bitcoin’s realized cap — the sum total price at which all BTC last moved — divided by the current supply. It is currently at just below $21,000.\n\nBitcoin bear market bottoms are characterized by the spot price dipping below the realized price, while bull markets begin once the spot crosses the two-year and five-month realized price levels. These refer to the realized price of coins that last moved within the last two years or the last five months — “younger” coins.\n\nBTC/USD is now once again above all three realized price iterations.\n\n“Enjoy sub-$40k bitcoin ... while it lasts,” PlanB commented on an accompanying chart.\n\nBitcoin realized price chart. Source: PlanB/X\n\nAsked whether the market should expect lower levels from here, PlanB would not be drawn, saying that he simply expected an average BTC price of at least $100,000 between 2024 and 2028 — Bitcoin’s next halving cycle.\n\nBitcoin hodlers bet on six figures\n\nWhile PlanB has fielded criticism over stock-to-flow — and conceded that Bitcoin was not able to live up to his expectations during its 2021 bull market — six-figure predictions for the next cycle are increasingly common.\n\nRelated: Bitcoin to $1M post-ETF approval? BTC price predictions diverge wildly\n\nAs Cointelegraph reported, these are coalescing around an area with $130,000 as its focus for the end of 2025.\n\nThe halving itself, meanwhile, due in April 2024, should produce a return to around $46,000, further analysis says.\n\nEarlier this month, PlanB described Bitcoin as being in a “pre-bull market” phase, with the real launch yet to come.\n\nIMO bitcoin is currently in pre-bull market (yellow) and on track towards a full blown bull market (red, after halving unless earlier ETF approval).\n\n\n\nNote I changed colors and stage names again, to better align with S2F model:\n\npre-bull\n\nbull market\n\npre-bear\n\nbear market pic.twitter.com/tmayjteVWv — PlanB (@100trillionUSD) November 19, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRtZXgtY28tZm91bmRlci1wcmVkaWN0cy1iaXRjb2luLXN1cmdlLWFtaWQtZG9sbGFyLWxpcXVpZGl0eS1yaXNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "BitMEX co-founder predicts Bitcoin surge amid dollar liquidity rise - Cointelegraph",
        "content": "BitMEX co-founder Arthur Hayes is bullish on Bitcoin (BTC). Hayes shared his thoughts on X Alongside a chart depicting net reverse repurchase agreement (RRP) and treasury general account (TGA) balance changes, Hayes referred to United States Treasury Secretary Janet Yellen as “Bad Gurl Yellen.”\n\nIn the X post, Hayes encouraged fellow Bitcoin enthusiasts to stay focused, highlighting a significant uptick in U.S. dollar liquidity. He suggested BTC will likely mirror the rise in dollar liquidity, leading to an increase in its price.\n\nThe accompanying chart illustrates the net variations in RRP and TGA balances, indicating a possible link between heightened dollar liquidity and the BTC price.\n\nGetting my feet did and observing how Bad Gurl Yellen is busy pumping financial assets. Don’t get distracted, $ liquidity is increasing and $BTC will go up as well. This is the chart of net RRP and TGA balance changes. pic.twitter.com/l2US0FzlAX — Arthur Hayes (@CryptoHayes) November 25, 2023\n\nMeanwhile, crypto analyst dharmafi shared more specific figures on X. The post emphasized an RRP of $65 billion and a TGA balance of $35 billion, with a significant net liquidity surge of $106 billion since Nov. 21.\n\nAs highlighted by Hayes, the rise in liquidity shows the changing dynamics in financial markets. Investors and Bitcoin enthusiasts observing liquidity injections can anticipate potential effects on the cryptocurrency market.\n\nWhile the BitMEX co-founder highlighted the connection between dollar liquidity and the Bitcoin price, dharmafi’s data reinforces the impact of the liquidity surge. The $106 billion rise in net liquidity since Nov. 21 has raised questions about potential effects on diverse asset classes, including cryptocurrencies.\n\nRelated: CoinFLEX creditors dissatisfied with restructuring to OPNX: Report\n\nMeanwhile, Yellen, a skeptic of Bitcoin, recently cautioned cryptocurrency exchanges to abide by the law when speaking with Reuters at a meeting of G20 finance ministers and central bank governors.\n\nYellen stressed the significance of compliance in the digital currency industry, underscoring the need to follow regulations to operate within the U.S. financial system.\n\nMagazine: Big Questions: What’s with all the crypto deaths?"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8yMDczNTUvYml0Y29pbi1zdXJnZXMtYWJvdmUtMzgwMDAtYnRjLWV0aGVyZXVtLWhpdC0xOC1tb250aC1oaWdoc9IBWmh0dHBzOi8vZGVjcnlwdC5jby8yMDczNTUvYml0Y29pbi1zdXJnZXMtYWJvdmUtMzgwMDAtYnRjLWV0aGVyZXVtLWhpdC0xOC1tb250aC1oaWdocz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surges Above $38,000 as BTC and Ethereum Hit 18-Month Highs - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto markets may have sat still on Thanksgiving, but early price action on Friday is driving some of the top coins to levels unseen in a year and a half.\n\nBitcoin on Friday rocketed above the $38,000 mark, according to CoinGecko, rising to $38,390 at present. The last time BTC hit that level was back in May 2022. Over the past week, the asset has risen by nearly 7%, pushing its 30-day gains above 10%.\n\nCash has flooded back into the crypto markets, with big digital asset funds receiving most of the money as investors feel confident that a spot Bitcoin exchange-traded fund (ETF) will finally approved by U.S. regulators after 10 years.\n\nAD\n\nAD\n\nSuch a product would give traditional investors exposure to the crypto world in a safe and regulated way. In a Monday report, digital asset fund manager CoinShares said that crypto products received inflows of $176 million last week—the eighth consecutive week of inflows.\n\nMeanwhile, Ethereum also spiked to an 18-month high, per data from CoinGecko, reaching a peak of nearly $2,131 early Friday. It's currently trading at $2,121, and is up about 4% on the day.\n\nThe asset is up 17% over the past 30 days, and continues trending upward. Ethereum had been trading above $2,500 some 18 months ago in May 2022, before the markets got hit hard by the collapse of crypto mega project Terra.\n\nElsewhere, meme coin king Dogecoin is up over 3% in the past day, trading for $0.078. Its rival, Shiba Inu, put up a nearly 3% gain as well at a current price of $0.00000828.\n\nSolana, which experienced a lot of price action this month, was one of the sleepiest of the major coins and tokens, having only jumped by 2% over the past day to a current price above $58. Over the past week, Solana has risen by 3%.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yYWlmZmVpc2VubGFuZGVzYmFuay1iaXRjb2luLWxhdW5jaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Raiffeisenlandesbank to launch Bitcoin trading in early 2024 - Cointelegraph",
        "content": "The Austrian subsidiary of European lender Raiffeisen Bank is preparing to allow its clients to trade cryptocurrencies like Bitcoin (BTC) in the coming months.\n\nAfter initially announcing its crypto plans in April 2023, Raiffeisen Bank’s Raiffeisenlandesbank Niederösterreich-Wien (RLB NÖ-Wien) is moving forward with a crypto rollout in collaboration with the Austrian crypto firm Bitpanda.\n\nRLB NÖ-Wien expects to start rolling out crypto trading services in Vienna in the first quarter of 2024, a spokesperson for the bank told Cointelegraph.\n\n“Raiffeisenlandesbank NÖ-Wien has signed a cooperation agreement with Bitpanda. Via this cooperation, we plan to offer an attractive digital investment platform early in 2024,” the representative stated, adding:\n\n“We have seen the demand from customers for easy, intuitive, digital investment platforms. Our main intention to take customer-centric decisions has triggered these efforts, which we are excited about bringing to market.”\n\nWith the crypto rollout, RLB NÖ-Wien users will gain access to all cryptocurrencies provided by the bank’s partner Bitpanda, the spokesperson said.\n\nBitpanda Deputy CEO Lukas Enzersdorfer-Konrad previously told Cointelegraph that Raiffeisen’s crypto offering would support the full range of Bitpanda’s digital asset offerings, which feature more than 2,500 cryptocurrencies, including Bitcoin and Ether (ETH). The exec also said Raiffeisen was willing to make the crypto trading service available to all customer segments, including retail, private banking and corporate customers.\n\n“As we announced in April, the end goal is to make our offer available to all RLB NÖ-Wien customers. However, the rollout will begin with their customers in Vienna,” a spokesperson for Bitpanda noted.\n\nRelated: Top Swiss bank launches Bitcoin and Ether trading with SEBA\n\nRaiffeisen’s move into crypto is another sign of Bitcoin’s growing adoption, with companies like Ferrari starting to accept cryptocurrency as payment in October 2023. Raiffeisen Bank is one of the oldest banks in Europe, with the first Raiffeisen bank launching in Austria’s Mühldorf in 1886. As of 30 June 2023, the Raiffeisen Group had 247 billion Swiss francs ($280 billion) in assets under management and 219 billion CHF ($248 billion) in client loans.\n\nMagazine: 5,050 Bitcoin for $5 in 2009: Helsinki’s claim to crypto fame"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1eWVyLWJ0Yy1wcmljZS1wYXN0LTM4ay10cmFkZXJzLWtleS1icmVha291dNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin buyer pushes BTC price past $38K as traders demand key breakout - Cointelegraph",
        "content": "Bitcoin (BTC) bulls kept the pressure on 18-month highs on Nov. 24 as analysis eyed buyer interest spiking.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin fights for new 18-month high\n\nData from Cointelegraph Markets Pro and TradingView showed the BTC price trajectory heading upward into the Wall Street open.\n\nThe largest cryptocurrency saw increasing momentum during the Asia trading session, this nonetheless with its roots on derivatives markets.\n\nFollowing the action, popular trader Skew confirmed that a single entity was likely behind the latest charge on $38,000.\n\n“Some buyer probably single buyer is trying to push the market higher here ~ clear correlation between spot & perp CVDs / Delta,” he wrote in part of his latest post on X (formerly Twitter.)\n\n$BTC Update\n\nLooking like there's some direction buyer again here on binance - they're bidding spot & opening a long\n\n\n\nShorts on bybit perps continue to get hunted\n\n\n\nMarket CVDs & Delta\n\nSome buyer probably single buyer is trying to push the market higher here ~ clear correlation… https://t.co/Hu6FNp1Ltc pic.twitter.com/5KaODZC7Hv — Skew Δ (@52kskew) November 24, 2023\n\nSkew subsequently revealed the long BTC position had been closed, and with momentum flagging, a higher high (HH) was needed on lower timeframes — beyond the current $38,000 ceiling. At the time of writing, this was in progress.\n\n$BTC\n\nLooks like binance long has closed out, so they could have just engineered liquidity to get some asks filled\n\n\n\nLTF CVDs\n\nSo first thing here is CVDs are higher vs price so there's some momentum behind this move however, yet to be seen without another HH\n\n\n\nSecondly, spot… pic.twitter.com/regcjdj2tw — Skew Δ (@52kskew) November 24, 2023\n\nZooming out, others were still optimistic about resistance levels ultimately falling. For Michaël van de Poppe, founder and CEO of trading firm MN Trading, it was all about the $40,000 mark.\n\n“Still so far, so good on Bitcoin,” he told X subscribers on the day.\n\n“Slowly grinding upwards to a new resistance point and a break above $38K immediately means $40K is next.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/X\n\nFellow popular trader Daan Crypto Trades meanwhile described $38,000 as the line in the sand after which “easy mode” returns to Bitcoin trading. The corresponding level on Ether (ETH), he added, was $2,150.\n\nAbout turn at $40,000?\n\nSome market participants believe that a fresh BTC price retracement will enter following an initial foray into the area around $40,000.\n\nRelated: Bitcoin to $1M post-ETF approval? BTC price predictions diverge wildly\n\nAmong them is popular trader Crypto Tony, who, on the day, suggested that even $39,000 could prove a short-term turning point.\n\n$BTC / $USD - Update\n\n\n\nMy plan has not changed, pump us to $39,000 - $40,000 then drop please pic.twitter.com/AJkLRmD4U5 — Crypto Tony (@CryptoTony__) November 24, 2023\n\n$39,000, meanwhile, stands out for a variety of reasons, including the aggregate profitability of those who bought BTC during the 2021 bull market.\n\nElsewhere, encouraging signs from Bitcoin’s relative strength index (RSI) continued to provide bulls with fuel for further upside.\n\nBTC/USD 1-day chart with RSI. Source: TradingView\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8yMDczOTEvaW52ZXJzZS1jcmFtZXItYml0Y29pbi1kb29tZXItdHVybnMtYnVsbGlzaC1jcnlwdG8taGl0cy0zODAwMNIBXWh0dHBzOi8vZGVjcnlwdC5jby8yMDczOTEvaW52ZXJzZS1jcmFtZXItYml0Y29pbi1kb29tZXItdHVybnMtYnVsbGlzaC1jcnlwdG8taGl0cy0zODAwMD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Inverse Cramer? Bitcoin Doomer Turns Bullish as Crypto Hits $38,000 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFor the last year, CNBC’s Jim Cramer has emphatically urged all who would listen to get out of crypto—and specifically, away from Bitcoin.\n\nNow, the Mad Money host is—once again—changing his tune, right as Bitcoin surges to an 18-month high.\n\n“For a while I liked it, then I decided: You know what? The money had been made,” Cramer said of Bitcoin during a Mad Money segment earlier this week. “But I was premature.”\n\nAD\n\nAD\n\n“When you make a lot of money, let’s not look back,” he added.\n\nCramer’s newfound faith in Bitcoin comes during a major surge for the world’s top cryptocurrency. Earlier today, BTC rocketed above $38,000 for the first time in a year and a half. In the last month, the coin has steadily climbed 10%. And it’s not just Bitcoin that’s up: in the same period, Ethereum has spiked 17%, hitting its own 18-month peak earlier Friday.\n\nMuch of that momentum stems from industry-wide hope for the imminent approval of a spot Bitcoin ETF—which, if finally greenlit by the U.S. Securities and Exchange Commission (SEC) after 10 years of denials, would allow traditional financial institutions to gain exposure to BTC without holding any cryptocurrency.\n\nBlockchain analysts at CryptoQuant have previously said the product could lead to a $1 trillion boost for Bitcoin and other digital assets.\n\nAD\n\nAD\n\nCramer, despite having profited off BTC himself, appeared to permanently write off the coin and all other cryptocurrencies after the collapse of the crypto market in May 2022, and again after the shuttering of crypto exchange FTX rattled the industry last fall.\n\n“It’s never too late to sell an awful position, and that’s what you have if you own these so-called digital assets,” Cramer said last December.\n\nA year later, with Bitcoin back on the rise, Cramer’s now claiming he’s always supported those with long-term faith in the coin.\n\n“If you like Bitcoin, buy Bitcoin,” the television personality said Tuesday. “That has always been my view.”\n\nMany in the crypto and finance communities have long skewered Cramer’s ever-shifting stances on financial products, with some claiming that doing the inverse of whatever he advises can generally be considered very sound financial advice.\n\nLast year, the SEC received multiple applications for real-life “Inverse Cramer ETFs,” which would automatically invest user’s funds using the opposite of Cramer’s instructions as gospel.\n\nGiven such logic, some crypto investors have taken to social media to posit that Cramer’s revived confidence in BTC could spell doom for the ascendant cryptocurrency—and erase the encouraging gains of the last month.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8td2Vlay1hdC1nbGFuY2UtYml0Y29pbi10cmFkZXMtc2lkZXdheXMtYW1pZC1zZWNzLWV0Zi1hcHByb3ZhbC1kZWxheS9hcnRpY2xlc2hvdy8xMDU0ODg5NjguY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by13ZWVrLWF0LWdsYW5jZS1iaXRjb2luLXRyYWRlcy1zaWRld2F5cy1hbWlkLXNlY3MtZXRmLWFwcHJvdmFsLWRlbGF5L2FtcF9hcnRpY2xlc2hvdy8xMDU0ODg5NjguY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Crypto Week at Glance: Bitcoin trades sideways amid SEC's ETF approval delay - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe past week has witnessed stability in Bitcoin , as it traded within the range of US$37,000 to US$37,600. The market's equilibrium during this period can be attributed to the prevailing regulatory uncertainty in the United States. Investors are digesting the fallout from regulatory actions taken against some players in the industry.Amidst this, optimism lies in the anticipation of the approval of a spot Bitcoin exchange-traded fund ( ETF ). However, recent indications suggest that the U.S. Securities and Exchange Commission (SEC) might defer this decision until 2024.Currently, Bitcoin is trading at the US$37,400 level, reflecting a 3% increase on the weekly chart, a 7% gain month-to-date, and an impressive 125% surge year-to-date. The cryptocurrency is consolidating its position and may initiate another rally if it successfully surpasses the US$38,000 resistance zone. If not, it could trigger a fresh decline, with immediate support situated at the US$37,200 level.Meanwhile, Ethereum is currently positioned above the US$2,000 level, consolidating gains and eyeing potential advancement toward the US$2,150 level.In an interesting development, Alchemy Pay, a crypto-fiat payment service provider, has revealed its expansion into the U.S. following the acquisition of a money services license in the state of Iowa. The company is also in the process of pursuing license applications in the United Kingdom and Hong Kong.The Bitcoin hash rate has reached an all-time high, underscoring the robustness of the network. According to data from Blockchain.com, the total Blockchain hash rate reached 491 exahashes per second, signifying the colossal computational efforts securing the Bitcoin network. The upcoming Bitcoin halving, scheduled for April, is going to be optimistic within the market as a bullish indicator.Shifting focus to regulatory developments, the Monetary Authority of Singapore (MAS) has released the final tranche of responses to feedback on its proposed regulations for crypto service providers. Notably, Singapore's Central Bank is adopting measures to discourage crypto speculation while simultaneously easing investment qualifications, showcasing a responsive approach to industry feedback.In a positive stride towards digital currency adoption, the Bank of Korea (BoK) has unveiled plans to invite 100,000 Korean citizens to participate in a central bank digital currency (CBDC) pilot. The testing, slated for September to October 2024, will enable citizens to make purchases with deposit tokens. Furthermore, the BoK will collaborate with the Korea Exchange to integrate its new digital currency into a simulation system for carbon emissions trading, testing the feasibility of delivery versus payment transactions.Coming to the price action, among the top 100 cryptos by market cap, here are the best and worst-performing cryptos over the past week:As per prices on Friday.1. Blur is up by 82%2. FTX Token is up by 32%3. KuCoin Token is up by 26%4. Klaytn is up by 24%5. Mina is up by 21%1. Celestia is down by 16%2. Fantom is down by 13%3. Axie Infinity is down by 9%4. Cosmos is down by 9%5. Polygon is down by 8%"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTEvMjQvYml0Y29pbi1zdXJnZS1ibGFja3JvY2tzLWNvaW5iYXNlLWNvbm5lY3Rpb24tc3BhcmtzLXNwZWN1bGF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surge: BlackRock's Coinbase Connection Sparks Speculation - Crypto Times",
        "content": "Bitcoin’s recent surge in buying pressure has raised questions about its source, with speculation pointing to BlackRock’s involvement through its custodial partner, Coinbase. Every significant move in the market sparks curiosity and debate, as Bitcoin has recently experienced a notable increase in buying pressure.\n\nBLACKROCK IS PUMPING #BITCOIN!!!\n\n\n\nA lot of Bitcoin buying pressure seems coming from Coinbase!\n\n\n\nSince Coinbase is the custodial partner of BlackRock, could this be BlackRock? pic.twitter.com/cYyoaWlMSg — Crypto Rover (@rovercrc) November 24, 2023\n\nBlackRock’s Custodial Partnership with Coinbase\n\nCoinbase has been focused due to its custodial partnership with BlackRock, the world’s largest asset manager. The collaboration has led some to speculate that BlackRock may be a key player in the recent Bitcoin bullish pressure.\n\nWhile no concrete evidence confirms BlackRock’s direct involvement, the correlation between the asset manager’s partnership with Coinbase and the increased buying pressure on Bitcoin raises questions.\n\nAs the cryptocurrency market evolves, institutional investors like BlackRock’s role becomes increasingly significant. The influence of major players on Bitcoin’s price and market dynamics highlights the growing integration of digital assets into the traditional financial landscape.\n\nThe recent surge in Bitcoin buying pressure, linked to BlackRock’s partnership with Coinbase, underscores the dynamic nature of the cryptocurrency market. Only time will reveal the true drivers behind these market movements as Investors remain vigilant in navigating the ever-changing crypto landscape."
    }
]