[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjMvYml0Y29pbi1leWVzLTMxay1hcy1nb2xkLW9mZmVycy1idWxsaXNoLWN1ZXMv0gFdaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8yMy9iaXRjb2luLWV5ZXMtMzFrLWFzLWdvbGQtb2ZmZXJzLWJ1bGxpc2gtY3Vlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Eyes $31K as Gold Offers Bullish Cues - CoinDesk",
        "content": "“Options market makers in bitcoin are increasingly short gamma as BTC spot price moves up. When you’re short gamma and spot px rises, you need to buy back spot to stay delta neutral. This should amplify the explosiveness of any short-term upward move in the near term,” Thorn said on X."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcmljaC1kYWQtcG9vci1kYWQtYXV0aG9yLXJvYmVydC1raXlvc2FraS1wcmVkaWN0cy1uZXh0LXN0b3AtZm9yLWJpdGNvaW4taXMtJTI0MTM1ayUzQS13YWtlLXVw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "'Rich Dad Poor Dad' Author Robert Kiyosaki Predicts 'Next Stop' For Bitcoin Is $135K: 'Wake Up' - Nasdaq",
        "content": "Amid growing expectations of a spot Bitcoin ETF approval, Robert Kiyosaki, the renowned author of “Rich Dad Poor Dad,” forecasted the potential for Bitcoin’s (CRYPTO: BTC) price to surge to $135,000.\n\nWhat Happened: On Friday, Kiyosaki took to X (formerly Twitter) to share his latest thoughts on the financial markets, sparking a buzz in the cryptocurrency community.\n\nThe renowned author began by drawing attention to the precious metal market, specifically Gold, stating that it is on the cusp of a significant breakthrough as its price edges closer to the $2,100 mark.\n\nHe stated that Gold could continue its upward trajectory, eventually reaching a remarkable value of $3,700, making it an appealing prospect for investors.\n\nSee Also: Bitcoin ETF Approval Would Have Limited Impact To Coinbase’s P&L: Barclay’s Analyst\n\nHowever, Kiyosaki’s enthusiasm extends beyond traditional assets.\n\nDespite Bitcoin’s recent price volatility, he expressed his unwavering confidence in the leading cryptocurrency. He boldly proclaimed that the next major milestone for Bitcoin is an astonishing $135,000.\n\nGold will soon break through $2,100 and then take off. You will wish you had bought gold below $2,000. Next stop gold $3,700. Bitcoin testing $30,000. Next stop Bitcoin $135,000. Silver from $23 to $68 an ounce. Savers of fake dollars F'd. Please tell your friends to \"Wake up.\"…\n\n— Robert Kiyosaki (@theRealKiyosaki) October 20, 2023\n\nThis prediction marks one of his most ambitious forecasts to date, eclipsing his earlier estimate from July when he envisioned the possibility of Bitcoin hitting $120,000 in the near future.\n\nAt the time of his post, Bitcoin was trading at approximately $29,519.70, displaying a 3.43% increase in the past 24 hours, and he noted the potential for it to soon reach the $30,000 milestone, according to Coingape.\n\nWhy It’s Important: Kiyosaki’s predictions have sparked discussions within the cryptocurrency community, with some market experts drawing parallels to Standard Chartered Bank’s forecasts for Bitcoin’s future.\n\nThe bank had previously predicted that Bitcoin could reach $50,000 by the end of this year and potentially touch $120,000 by the conclusion of 2024.\n\nNotably, Bitcoin experienced a recent price surge this week, rising by 4% and briefly surpassing the $30,000 threshold.\n\nThis achievement marked the first time Bitcoin had reached this level since August 2023, adding weight to Kiyosaki’s predictions.\n\nAdditionally, a report from Matrixport hinted at the potential for Bitcoin to rally to $56,000 should Blackrock’s Bitcoin ETF gain approval.\n\nPrice Action: At the time of writing, Bitcoin was trading at $29,547.90, according to data from Benzinga Pro.\n\nRead Next: Crypto Analyst Foretells Dramatic Shifts For Bitcoin, Rollbit, Expect These Targets Soon\n\nJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions, and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nImage via Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvcGVvcGxlLWN1bHR1cmUvYmxhY2tyb2NrLWxhcnJ5LWZpbmstdGltZWxpbmUtY3J5cHRvLXNjZXB0aWMtdG8tYml0Y29pbi1mYW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "How Larry Fink learned to love Bitcoin — a timeline of BlackRock's crypto evolution - DLNews",
        "content": "This week Larry Fink, the CEO of BlackRock, the world’s biggest asset management firm, embraced Bitcoin… again. Here’s how the once crypto-sceptical Fink came to be a believer, and how he’s supported a push to make the most valuable cryptocurrency a new mainstream asset class:\n\n2017\n\nOctober 3: Fink tells Bloomberg TV that he’s “a big believer” in cryptocurrency, but that the market is rampant with speculation. Two months later, the market crashed and crypto entered a bear market dubbed “Crypto Winter.”\n\nthat he’s “a big believer” in cryptocurrency, but that the market is rampant with speculation. Two months later, the market crashed and crypto entered a bear market dubbed “Crypto Winter.” October 13: In a CNBC interview, Fink says Bitcoin is “an index of money laundering,” and compares hype around the cryptocurrency to the Dutch tulip bulb craze of the 1600s.\n\n2018\n\nJuly 16: Fink says BlackRock’s clients aren’t looking to buy crypto, and downplays BlackRock’s interest in the sector until it shows legitimacy and transparency.\n\n2019\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nApril 3: BlackRock hires Robbie Mitchnick, a former marketing exec at Ripple. Mitchnick is now the firm’s head of digital assets.\n\nJuly 19: Fink highlights the need for a better system for cross-border payments, months into BlackRock’s exploration of the viability of Bitcoin and other cryptocurrencies. “I don’t believe we need a new international currency,” Fink tells CNBC, alluding to Bitcoin, “but there is a huge need to bring down the fees” of cross-currency transactions.\n\n2020\n\nNovember 20: In a CNBC interview, BlackRock’s Rick Rieder, chief investment officer of fixed income, says crypto is “here to stay,” adding that digital currencies could take the place of gold as a store of value.\n\ninterview, BlackRock’s Rick Rieder, chief investment officer of fixed income, says crypto is “here to stay,” adding that digital currencies could take the place of gold as a store of value. December 1: Following a rise in Bitcoin’s price, Fink warns investors that Bitcoin could render the dollar less relevant. He said during an event hosted by the Council on Foreign Relations: “Bitcoin has caught the attention and the imagination of many people. Can it evolve into a global market? Possibly.”\n\n2021\n\nJanuary 27: When asked in an interview with Bloomberg Live about the potential for Bitcoin, Fink says, “We’re watching it; we’re enjoying the conversation. But it has not been proven yet.”\n\nabout the potential for Bitcoin, Fink says, “We’re watching it; we’re enjoying the conversation. But it has not been proven yet.” October 13: Fink tells CNBC that he is “more in the Jamie Dimon camp,” referring to the JPMorgan CEO’s bearish stance on Bitcoin’s value. In an interview the day before, Dimon called Bitcoin “worthless.” Fink reiterates his excitement for a potential “huge role” digital currency may play for consumers.\n\n2022\n\nFeb 9: CoinDesk reports that BlackRock plans to allow cryptocurrency trading on its internal Aladdin investment platform.\n\nreports that BlackRock plans to allow cryptocurrency trading on its internal Aladdin investment platform. April 7: In a speech at Miami’s Bitcoin 2022 conference, billionaire Peter Thiel lumps Fink in with Dimon and Berkshire Hathaway’s Warren Buffett as “enemies of Bitcoin,” and accuses them of suppressing the asset’s price.\n\nApril 12: BlackRock becomes an investor in a $400 million funding round for Circle, which issues the stablecoin USDC.\n\nApril 13: Fink confirms that BlackRock is researching cryptocurrencies and is becoming the primary holder of Circle’s cash reserves. “We are increasingly seeing interest [in crypto] from our clients,” Fink says.\n\nMarch 24: Fink says in a letter to investors that Russia’s invasion of Ukraine could accelerate the adoption of digital currencies, by prompting nations to “re-evaluate their currency dependencies.”\n\nAugust 4: Crypto exchange Coinbase announces a partnership with BlackRock to offer crypto trading services to investors on BlackRock’s Aladdin platform.\n\nAugust 11: BlackRock announces the creation of a spot Bitcoin trust for institutional investors.\n\nNovember 30: Fink reveals that BlackRock invested $24 million in FTX, the failed crypto exchange, and says at an event hosted by the New York Times Dealbook that “it looks like there were misbehaviors of major consequences.”\n\nthat “it looks like there were misbehaviors of major consequences.” November 30: Fink says at the same event that “the next generation for markets … will be tokenisation of securities.”\n\n2023\n\nJoin the community to get our latest stories and updates"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmZyYW5jZTI0LmNvbS9lbi9taWRkbGUtZWFzdC8yMDIzMTAyMi1pcy1jcnlwdG9jdXJyZW5jeS1oZWxwaW5nLWhhbWFzLWZ1bmQtdGVycm9yaXNt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Is cryptocurrency helping Hamas fund terrorism? - FRANCE 24 English",
        "content": "Financing 2.0\n\nThe US and Israel have stepped up their efforts to limit cryptocurrency transfers to Hamas since the group’s brutal October 7 attacks on Israel. Bitcoin, Dogecoin and Ethereum are increasingly blamed as conduits of funding for Islamist groups, but to what extent is this justified?\n\nVirtual wallets containing tens of millions of dollars in cryptocurrency suspected of funding Hamas have been seized by Israel.\n\nAdvertising Read more\n\nIn the wake of Hamas’s attacks on Israeli territory on October 7 that were unprecedented in scale, the role of digital currencies like Bitcoin and Dogecoin and crypto exchange platforms in financing the radical Islamist movement are increasingly under scrutiny.\n\nOn October 19, the US Treasury Department’s Financial Crimes Enforcement Network (FinCEN) proposed new regulations identifying “Convertible Virtual Currency Mixing (CVC mixing) as a class of transactions of primary money laundering concern … to combat its use by malicious actors including Hamas [and] Palestinian Islamic Jihad”.\n\nThese online services, known more casually as “mixers” or “tumblers”, mix cryptocurrency of illicit origin with other cryptocurrency funds. As such, “the risk of employing crypto mixers to launder money or conceal earnings is pretty considerable”, acknowledges crypto industry news site Cointelegraph.\n\nAppeals for Bitcoin via Facebook, Instagram and Telegram\n\nIn the wake of the October 7 assault, the Israeli defence ministry claimed it had seized virtual wallets linked to Hamas that had received $41 million (€39 million) between 2019 and 2023. The Palestinian Islamic Jihad group, for its part, has raised $94 million (€89 million) in cryptocurrency in recent years, according to Elliptic, a British firm that analyses virtual currency transactions.\n\nAnd that's not all. Washington also decided on October 18 to sanction \"Buy Cash\", a Gaza-based company accused of \"facilitating\" cryptocurrency transfers to Hamas and Palestinian Islamic Jihad.\n\n\"Hamas’s use of crypto first came to light in January 2019,\" writes David Carlisle, co-founder of Elliptic, in a blog post published on October 11. The al-Qassam Brigades, Hamas’s armed wing, was caught red-handed while organising a call for Bitcoin donations via Facebook and Instagram.\n\nAt first, these \"funding 2.0\" initiatives only raised a few thousand dollars, but Hamas has increasingly used social networks as funding channels ever since. And the Palestinian group formally listed as a terrorist organisation by the EU and the US is not alone in its actions. \"Using crypto in conjunction with social media platforms – Facebook, Instagram, and I've seen Telegram mentioned recently – has become quite popular,\" says Nicholas Ryder, a professor of law and specialist in terrorist financing networks at Cardiff University.\n\nThe recent attention paid to funds transferred to Hamas in Bitcoin and other cryptocurrencies may give the impression that without this windfall, the Islamist movement would be bankrupt or would, at least, have had a much harder time financing its attacks on Israel.\n\nSecondary means\n\n\"There is a degree of hyperbole about this topic. It’s relatively new, has cachet and is unknown by many people, so of course it attracts attention. You cannot ignore it, but if you think about the pros and cons of [using it for] raising or moving funds, crypto is not the best,\" says Tom Keatinge, director of the Centre for Financial Crime Research and Security Studies at the Royal United Service Institute, one of the UK's leading think tanks on security issues.\n\nFor example, Hamas, which Forbes magazine ranked in 2014 as \"one of the richest terrorist groups in the world\", has an estimated annual budget of nearly $1 billion. Most of the money comes from \"expatriates or private donors in the Gulf region\", points out German news channel Deutsche Welle.\n\nIn this respect, the $41 million in cryptocurrencies seized by the Israeli authorities may seem like a drop in the bucket for Hamas. What’s more, these amounts should be taken with a grain of salt: it can be very difficult to separate funds intended to finance terrorist activities from others in a virtual wallet, Chainalysis, an American blockchain analysis company, notes in a blog post.\n\n\"[It’s] impossible to quantify how much money is transferred via crypto, but it has become a more and more prominent funding method,\" says Ryder.\n\nThe rise of Bitcoin, Ethereum and Dogecoin in the world of terrorism can be explained first and foremost by the simplicity of making a transaction, notes Keatinge: \"It's easy, and I can make a donation from my couch at home.\" It's also much quicker than having to open a bank account and find intermediaries willing to transfer the fund. \"You just need a smartphone and/or a laptop,\" adds Ryder.\n\nInternational authorities are also putting more effort into countering traditional terrorist financing channels, so these groups are trying to compensate with new ways of raising money. “The more we put pressure on traditional ways of financing, the more they’ll find alternative ways like crypto. And we are becoming better at fighting against the traditional means of financing. It's like a balloon: when you squeeze one part, the other gets bigger,\" says Keatinge.\n\nNot so anonymous\n\nHamas, al Qaeda and Hezbollah don't hesitate to combine the best of both worlds, either. For example, there can now be a cryptocurrency dimension to the use of fake NGOs, a classic means of funding for terrorist groups. \"They can cut the top 10 to 15 percent and convert it into crypto, and then transfer it in order to make it more difficult to trace,\" explains Ryder.\n\nHowever, these movements' interest in such new funding methods is not as strong as current media noise might suggest, because they are not ultimately as anonymous as we’ve been led to believe. \"It may seem as though crypto is some kind of secret way to channel funds, but it has vulnerability. As soon as you start blockchain transactions, they are traceable. They’re not as secretive as many people think,\" says Keatinge.\n\nIndeed, all Bitcoin transactions pass through the blockchain, which is the digital equivalent of a ledger that is accessible to all. Admittedly, the names of those transferring or receiving the funds do not appear, but it is possible to track every movement of funds, and companies such as Chainalysis and Elliptic have become masters in the art of tracing their origin.\n\nOf course, there are ways of making these transactions more anonymous, but they come at the expense of ease and speed – the main advantages of the use of cryptocurrencies for terrorists and other criminals. In the end, it’s still easier and more anonymous to hand-deliver suitcases full of cash.\n\nThis article is a translation of the original in French.\n\nDaily newsletterReceive essential international news every morning Subscribe"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL21vcmdhbi1zdGFubGV5LWJlbGlldmVzLWNyeXB0by13aW50ZXItaXMtb3Zlci1oYWx2aW5nLXdpbGwta2ljay1vZmYtbmV3LWJ1bGwtcnVuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Morgan Stanley believes crypto winter is over, Bitcoin halving will kick off new bull run - CryptoSlate",
        "content": "Wall Street giant Morgan Stanley believes that crypto winter is over, and Bitcoin’s next halving will kick off a new bull run as it has in the past.\n\nIn a recent report titled “Will Crypto Spring Ever Come?” the bank’s wealth management division delved into the four-year cryptocurrency cycle and the significance of Bitcoin’s halving events on market cycles in shaping the crypto landscape.\n\nMorgan Stanley analyst Denny Galindo — author of the report — wrote:\n\n“Signs indicate that ‘crypto winter’ — bitcoin’s cyclical bear-market decline — may be in the past.”\n\nThe Four Seasons of Crypto\n\nGalindobegan by drawing a parallel between the four-year cryptocurrency cycle and the year’s four seasons. He detailed the four distinct phases of the cryptocurrency cycle, with each phase bearing a resemblance to a season:\n\nAccording to the report, the summer phase commences with the highly anticipated halving event, where the rate of new Bitcoin creation is slashed in half.\n\nHistorically, this phase has been marked by substantial price increases in Bitcoin, as scarcity drives demand. It typically culminates when Bitcoin surpasses its previous all-time high, sparking euphoria in the market.\n\nAfter reaching a new high, Bitcoin garners media attention, attracts new investors, and piques the interest of businesses. This phase is reminiscent of summer, turning into fall as the crypto market basks in the warmth of renewed interest. It spans the period between surpassing the old high and establishing a new peak, marking the climax of the bull market.\n\nPost-peak, the market enters a bearish phase, similar to the onset of winter. The market cools down as investors lock in profits and divest from Bitcoin.\n\nThis phase has historically persisted for around 13 months, with prices experiencing significant declines from their highs. It is a time of consolidation, correction, and introspection for the crypto community.\n\nPreceding each halving event, Bitcoin’s price generally rebounds from its lowest point. However, investor enthusiasm tends to remain relatively subdued, much like the cautious optimism of early spring.\n\nThis is the period when the crypto market finds its footing again, preparing for the next halving event and the subsequent bull run. Galindo highlighted that there have been three crypto winters since 2011, each spanning roughly 13 months. He also noted that Bitcoin’s halving event plays a significant role in driving the value of the flagship crypto.\n\nAccording to Galindo:\n\n“Historically, most of bitcoin’s gains come directly after a ‘halving’ event that occurs every four years.”\n\nThis observation lends credence to the notion that a crypto spring may be on the horizon.\n\nSigns of Spring\n\nThe report said there are several key factors to consider in determining whether crypto spring has arrived. Historical patterns reveal that the trough of Bitcoin in previous crypto winters typically surfaces about 12 to 14 months after the peak, offering a timeline for market cycles.\n\nAnother crucial factor is gauging the decline in Bitcoin’s value from its all-time high. Bitcoin prices have plummeted by approximately 83% from their previous highs in past crypto winters.\n\nMiner capitulation is also a noteworthy indicator, as many miners cease operations due to financial losses when Bitcoin approaches the trough of past cycles. Miner behavior is monitored through “bitcoin difficulty,” a metric gauging mining ease. Decreasing difficulty signifies proximity to the trough.\n\nThe “Bitcoin Price-to-Thermocap Multiple” is another critical metric. “Thermocap” measures the total investment in Bitcoin since its inception. A lower price-to-thermocap ratio indicates a trough, while a higher ratio suggests a peak in the market’s trajectory.\n\nThe report added that price action can also signify the end or beginning of a new cycle. A substantial 50% increase in Bitcoin’s price from its lowest point typically indicates a trough.\n\nHowever, there have been instances where significant price declines followed such gains."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1vdXRsb29rLWdvdmVybm1lbnQtY3J5cHRvY3VycmVuY3ktc2VpenVyZXMtY3J5cHRvLWludmVzdGluZy1hbmFseXNpcy0yMXNoYXJlcy0yMDIzLTEw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "Crypto Prices: Why the US Government Owns $5.5B Worth of Bitcoin - Markets Insider",
        "content": "The US government has seized at least $5.5 billion worth of bitcoin since 2020, according to analysts.\n\nIts stake makes it one of the world's largest crypto \"whales\".\n\nWhether it holds or sells its bitcoin stash could have a huge impact on the token's price.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe US government owns billions of dollars worth of bitcoin – and whether it decides to hold or sell could have a big impact on the cryptocurrency's price.\n\nPublic filings show Washington has seized over 200,000 tokens from cybercriminals since 2020, according to crypto firm 21.co.\n\nIts holdings are worth $5.5 billion in total, analysts estimated – making the US one of the world's largest bitcoin \"whales\", a term that digital-asset enthusiasts use to refer to individuals or groups that own large amounts of the crypto.\n\nTokens seized from the online black market Silk Road, its founder James Zhong, and criminals who hacked the Bitfinex exchange back in 2016 make up a large amount of the government's bitcoin stash, per 21.co's data.\n\nAdvertisement\n\nIn the past, the government has tended to dump its stakes via auction after relevant legal proceedings have been completed, and then use the money to reimburse victims.\n\nFor example, Washington sold 9,861 previously-seized bitcoins via Coinbase in March and gave $300,000 worth of compensation to Bitfinex in July, according to the Wall Street Journal.\n\nThe government's sales could conceivably swing the price of the world's largest token by total market capitalization, with digital-asset trading volumes grinding to a halt over the past year.\n\nIn 2022, crypto prices cratered as the Federal Reserve's aggressive interest-rate hikes and the collapse of high-profile companies like FTX weighed on investors' enthusiasm for the sector.\n\nAdvertisement\n\nBitcoin crashed below $20,000 and has barely recovered despite a rally for risk assets this year, with the token trading in a narrow range between $26,000 and $31,000 since mid-March.\n\nLower volatility means that whales can drive big swings all by themselves – so what the government decides to do with its $5.5 billion stash could have a major impact on bitcoin's price.\n\nRead more: From Sam Bankman-Fried's arrest to bitcoin plunging below $20,000, here are the 9 craziest crypto stories of 2022"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMjIvYml0Y29pbi1pcy1yaXNpbmctYWdhaW4td2h5LXdhcnJlbi1idWZmZXR0LXJlbWFpbnMtYS1jcnlwdG8taGF0ZXIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin is on the rise again. Here's why Warren Buffett remains a crypto hater - CNBC",
        "content": "Cryptocurrencies are on the rise again, helped by optimism surrounding the possible introduction of a spot bitcoin ETF. But no matter how strong this rally gets, it won't convince one of the industry's biggest critics — Warren Buffett. Bitcoin surged 10% over the past week, at one point briefly topping $30,000, as hopes grew that a spot bitcoin ETF will soon be approved. The idea among boosters is that such a vehicle would further legitimize the digital token and attract a wave of investment dollars, pushing the price of bitcoin even higher. But whether a bitcoin ETF soon becomes reality or not, it won't alter the Oracle of Omaha's thesis on cryptocurrencies, which is that they are highly speculative, non-productive assets. Buffett, who once famously called bitcoin \"probably rat poison squared,\" has compared the bitcoin phenomenon to the tulip bulb mania in the Netherlands in the early 1600s . \"All you're counting on is whether the next person is going to pay you more because they're even more excited about another next person coming along. But the asset itself is creating nothing,\" Buffett said in a 2018 CNBC interview. \"It's been a very speculative, kind of Buck Rogers type thing, and people buy and sell them because they hope they go up or down just like they did with tulip bulbs a long time ago,\" said Buffett, Berkshire Halthaway's CEO. \"If you just look at something and say that's magic, you can do it with shark teeth or seashells, or anything.\" Berkshire Vice Chairman Charlie Munger is an even a more vocal crypto hater, once saying digital currencies are a malicious combination of fraud and delusion, \"good for kidnappers.\" Munger supports a ban of cryptocurrencies in the U.S. Wouldn’t buy ‘all of the bitcoin in the world’ for $25 Buffett believes that the digital token has no value because it doesn't deliver anything. Unlike farms, which produce food, and real estate, which produces rent, cryptocurrencies rely on market sentiment and supply-demand dynamics. \"If you said … for a 1% interest in all the farmland in the United States, pay our group $25 billion, I'll write you a check this afternoon,\" Buffett said at Berkshire's 2022 annual meeting. \"[For] $25 billion I now own 1% of the farmland. [If] you offer me 1% of all the apartment houses in the country and you want another $25 billion, I'll write you a check, it's very simple.\" \"Now if you told me you own all of the bitcoin in the world and you offered it to me for $25 I wouldn't take it because what would I do with it? I'd have to sell it back to you one way or another. It isn't going to do anything,\" he added. 'Not a currency' The legendary, 93-year-old investor also said that bitcoin failed to meet the definition of a currency as its price fluctuates with the dollar. Crypto bulls tend to think bitcoin is a superior means of payment given its underlying, decentralized technology. \"It is not a durable means of exchange. It's not a store of value,\" Buffett said in a 2014 CNBC interview. \"People say 'well I'll sell you goods in bitcoins,' but they change the price of those every time the price of the dollar changes.... they are pricing off the dollar.\" BTC.CM= YTD mountain Bitcoin in 2023."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vZnV0dXJpc20uY29tL2JpdGNvaW4tdGhpZWYtc2FkLWxpZmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "Guy Who Stole Billions in Bitcoin Lived a Sad Life - Futurism",
        "content": "A Bitcoin \"original gangster\" who stole cryptocurrency from the original Silk Road a decade ago spent lavishly — but lived what sounds like a sad and lonely life before he was caught.\n\nAs CNBC reports, Bitcoin thief Jimmy Zhong not only helped write the original code of the cryptocurrency and early blockchain tech, but he also pilfered a bunch of it off the Silk Road in 2012, when its worth was a small fraction of what it became by the time he was busted in 2019.\n\nHe was also something of a rich nerd stereotype in Athens, Georgia, where he lived — a hard-partying local who dropped thousands to fly his friends cross-country on a private jet to attend a football game and had a stripper pole in his house \"for the girls,\" all of which masked how shallow those connections really were.\n\nZhong's fall from crypto grace began in March 2019, when he called the local police department in a panic because someone had stolen hundreds of thousands of dollars worth of crypto from his house near the University of Georgia's campus — which is pretty ironic considering that the Bitcoin stolen from him was itself stolen.\n\n\"I’m having a panic attack,\" the then-28-year-old computer scientist told the Athens-Clarke County Police dispatcher, per transcripts reviewed by CNBC.\n\nThough he tried to explain to the cops the significance of someone stealing 150 bitcoins from his house, calling it \"kind of an online thing,\" the local authorities were far out of their depth. To try to get to the bottom of the case, he hired Robin Martinelli, a private investigator in a nearby town.\n\nHerself far from a crypto expert, Martinelli said that as she learned more about bitcoin and about Zhong's case, she warmed to him — and felt the exact opposite way of the people he kept around him, whom she surveilled in attempts to see which of them had broken in and stolen whatever the crypto was physically stored on.\n\nZong's friends, Martinelli said, were \"very, very casual, plastic, not really caring, maybe using Jimmy a little bit.\" But he didn't respond well to her suspicions, seemingly clinging to the idea that his social circle was drawn by something other than a meal ticket.\n\n\"He would get upset,\" the PI said, \"when I would kind of mention somebody would had to have known where this cash was.\"\n\n\"Jimmy wanted to be loved,\" she added. \"Jimmy wanted friends.\"\n\nUltimately, that desire to be loved may have led to his downfall. As CNBC reports, that 2019 theft — which remains unsolved — brought government attention to Zhong, who, as it turns out, had been involved in the earliest days of crypto.\n\nBody camera footage reviewed by the news outlet showed how the young man's desire to be liked was turned against him when Zhong invited authorities into his house, where they were able to successfully ascertain that he had at least one Bitcoin wallet with tens of millions of dollars worth of crypto in it.\n\nThey then served him with a search warrant and tore his house apart until they found the computer that contained the rest of the 2012 Silk Road theft that netted Zhong 50,000 bitcoins, which ended up being worth a whopping $3 billion. It was the Justice Department's largest crypto seizure to date, and because nobody came forward to claim it, all of the proceeds went into government coffers.\n\nThough he was far from the first nerd to get rich and try to buy relationships — there was even an entire arc in \"30 Rock\" about such a man, the very year of the Silk Road theft — Zhong's painfully obvious loneliness adds a tragic new dimension to one the largest and earliest crypto crimes.\n\nNow 33, Zhong reported to a minimum-security federal prison camp in Alabama earlier this year and will only be there for 366 days, CNBC reports, which seems much more like a white-collar wrist slap than a book-throwing, and constitutes yet another all-too-familiar aspect of this saga.\n\nMore on crypto crime: You Have Got To See This Unhinged SBF Memo"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNyYWNrcy0zMC1rLWNsZWFyaW5nLXBhdGgtZm9yLXNvbC1saW5rLWFhdmUtc3R40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price cracks $30K, possibly clearing a path for SOL, LINK, AAVE and STX - Cointelegraph",
        "content": "Bitcoin (BTC) had a good week, with prices rising about 10% to reach the psychologically important level of $30,000. After the rally, the question troubling investors is whether the uptrend will continue or if a reversal will happen.\n\nTrading team Stockmoney Lizards recently said that Bitcoin may soon break above its overhead resistance and start a sharp rally. They believe the approval of a spot exchange-traded fund would drive mass adoption and trigger a rally before the halving due in April 2024.\n\nCrypto market data daily view. Source: Coin360\n\nA positive development this week was that Bitcoin’s strength rubbed off to several altcoins, which surged above their respective overhead resistance levels. This suggests that the sentiment is gradually turning positive and that it may be time to consider buying selectively.\n\nTypically, the coins that lead the markets higher are the ones that tend to do well. Laggards are generally the last to perform, hence could be avoided initially.\n\nLet’s look at the charts of the top five cryptocurrencies that may outperform in the near term.\n\nBitcoin price analysis\n\nBitcoin (BTC) is witnessing a tough battle between the bulls and the bears near the $30,000 mark, but a positive sign is that the buyers have not given up much ground.\n\nBTC/USDT daily chart. Source: TradingView\n\nA consolidation near the current level suggests that the bulls are in no hurry to book profits, as they anticipate another leg higher. That could catapult the price to the overhead resistance zone between $31,000 and $32,400.\n\nContrarily, if the price turns down from $31,000, the BTC/USDT pair could drop to the 20-day exponential moving average (EMA) ($28,160). If the price snaps back from this level, the bulls will again try to clear the overhead hurdle.\n\nThe positive sentiment will be negated on a break below the 20-day EMA. That could keep the pair stuck inside the $31,000–$24,800 range for some more time.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe pair is in an uptrend, as seen on the four-hour chart. Normally, during an ascent, traders buy the dip to the 20-EMA. If that happens, it will signal that the sentiment remains bullish and every minor dip is being purchased. The pair may then continue its journey toward $32,400.\n\nConversely, if the price skids below the 20-EMA, it will indicate that the traders may be closing their positions in a hurry. That could open the gates for a further decline to the important support at $28,143.\n\nSolana price analysis\n\nSolana’s SOL (SOL) broke out of the neckline on Oct. 19, completing a bullish inverse head-and-shoulders pattern. This setup has a target objective of $32.81.\n\nSOL/USDT daily chart. Source: TradingView\n\nThe overbought levels on the relative strength index (RSI) suggest that a correction is possible. The important support to watch on the downside is $27.12. A strong bounce off this level will indicate that the bulls have flipped the level into support. That will improve the prospects of the continuation of the uptrend. Above $32.81, the rally could hit $39.\n\nTime is running out for the bears. If they want to halt the up-move, they will have to drag the price back below $27.12. The SOL/USDT pair may then tumble to the neckline. This remains the key level to keep an eye on because a drop below it will suggest that the break above $27.12 may have been a fake-out.\n\nSOL/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls are facing stiff resistance near $30. This may start a pullback that could reach the breakout level of $27.12. Buyers are expected to defend this level with vigor. A solid bounce off this level may suggest the resumption of the up-move.\n\nOn the contrary, if the price turns down and breaks below $27.12, it will signal that the bears are aggressively selling at higher levels. The pair may then dive to the neckline near $24.50. This level may again witness strong buying by the bulls.\n\nChainlink price analysis\n\nChainlink’s LINK (LINK) has been trading inside a tight range between $5.50 and $9.50 since May 2022, indicating a balance between supply and demand.\n\nLINK/USDT daily chart. Source: TradingView\n\nThe bulls tried to resolve the uncertainty to the upside with a break above the range on Oct. 22, but the long wick on the candlestick shows that the bears are not willing to relent. If the bulls do not give up much ground from the current levels, it will enhance the prospects of a rally above $9.50.\n\nThe LINK/USDT pair could then start a move toward the pattern target of $13.50. Typically, a breakout from a long consolidation results in a sharp rally. In this case, the uptrend may stretch to $15 and thereafter to $18.\n\nThe first support on the downside is at $8.50. If bears tug the price below this level, it will suggest that the range-bound action may continue for a while longer.\n\nLINK/USDT 4-hour chart. Source: TradingView\n\nThe pair witnessed a sharp rally from $7.50, which propelled the RSI deep into the overbought territory on the four-hour chart. This suggests that the rally is overextended in the near term and could result in a pullback or consolidation.\n\nThe solid support on the downside is $8.75 and then $8.50. A strong bounce off this zone will suggest that the sentiment remains positive and traders are buying on dips. That will increase the possibility of a retest of $9.75.\n\nOn the contrary, a break below the 20-EMA will indicate that the bears are back in the game. The pair may then sump to $7.\n\nRelated: Lightning Network faces criticism from pro-XRP lawyer John Deaton\n\nAave price analysis\n\nAave (AAVE) rose above the downtrend line on Oct. 21, invalidating the bearish descending triangle setup. Generally, the failure of a negative setup starts a bullish move.\n\nAAVE/USDT daily chart. Source: TradingView\n\nBoth moving averages have started to turn up and the RSI is in the overbought territory, indicating that bulls are at an advantage. If the price maintains above the downtrend line, the AAVE/USDT pair may first surge to $88 and then to $95.\n\nIf bears want to prevent this up-move, they will have to quickly pull the price back below the downtrend line. That may catch a few aggressive bulls on the wrong foot and start a correction to the moving averages. A slide below the 50-day simple moving average (SMA) ($62) will put the bears back in the driver’s seat.\n\nAAVE/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears tried to stall the relief rally at the downtrend line, but the bulls did not give up much ground. The momentum picked up, and the pair is on its way higher toward $88.\n\nA minor concern in the short term is that the RSI soared into the overbought territory, indicating that a consolidation or correction is possible. On the way down, the first support is at $72. The bears will have to yank the price below the downtrend line to trap the bulls.\n\nStacks price analysis\n\nStacks’ STX (STX) rose sharply in the past few days, indicating that the bulls are trying to start a new uptrend.\n\nSTX/USDT daily chart. Source: TradingView\n\nThe bullish crossover on the moving averages suggests that the bulls have an edge. In the short term, the overbought levels on the RSI indicate that a minor correction or consolidation is possible. The first support on the downside is the 20-day EMA ($0.54).\n\nIf the price rebounds off this level, it will signal a change in sentiment from selling on rallies to buying on dips. That will increase the likelihood of the continuation of the up-move. The STX/USDT pair could first rise to $0.80 and subsequently to $0.90.\n\nThis positive view will be invalidated in the near term if the price turns down and plummets below the 20-day EMA.\n\nSTX/USDT 4-hour chart. Source: TradingView\n\nThe price has been consolidating in a tight range between $0.61 and $0.65, as seen on the four-hour chart. This is a positive sign, as it shows the bulls are not rushing to the exit because they anticipate another leg higher. If buyers drive the price above $0.65, the pair will attempt a rally to $0.68 and then to $0.75.\n\nContrary to this assumption, if the price turns down and breaks below the 20-EMA, it will signal profit-booking by short-term traders. The pair may then plunge to the 50-SMA.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY3J5cHRvLWFuYWx5c3Qtc291bmRzLWFsYXJtLW9uLWJpdGNvaW5zLXJhbGx5LXdhcm5zLXRyYWRlcnMtbm90LXRvLWdvLWNyYXp5LWFzLWNyeXB0b9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Crypto Analyst Sounds Alarm On Bitcoin's Rally, Warns Traders Not To 'Go Crazy' As Crypto Soars By 10% - Nasdaq",
        "content": "Crypto analyst Tone Vays recently shared his perspective on the recent trends. While Bitcoin (CRYPTO: BTC) has seen a notable uptick this week, Vays is urging traders to tread cautiously.\n\nWhat Happened: Bitcoin experienced a 10% increase in value last week. However, Vays expressed reservations about its potential to sustain this momentum and hit the $32,000 mark.\n\nIn a YouTube video last week, he said, “Let’s not go crazy here. I still think there’ll be a pullback sometime in November. I don’t think this is rallying to $32,000.”\n\nVays predicted that Bitcoin would fall to around $28,000 before taking out the top of the range at $31,000 and rallying above $34,000.\n\nAt the time of writing, Bitcoin was trading at $29,923.75, up 11 percent in the last seven days.\n\nTurning his attention to Ethereum (CRYPTO: ETH), Vays pointed out a potential double-bottom pattern forming against Bitcoin.\n\nAlso Read: Crypto Analyst Confident About Bitcoin's Surge, But There's A Catch\n\nHe predicted that Ethereum could face challenges ahead.\n\nHe stated, “Ethereum is making new lows against Bitcoin. This is not surprising. Ethereum is in a very critical support area… On a monthly scale, Ethereum still has significantly more downside. This is a very nasty double bottom. This is very bad for Ethereum. This sets up Ethereum to go significantly lower.”\n\nAt present, the ETH stands at 0.0543 BTC, equivalent to $1,608.\n\nSpeaking of Litecoin (CRYPTO: LTC), Vays anticipated a continued decline in its value relative to Bitcoin. Drawing from historical data post-LTC halving events, he said, \"Litecoin is on its way to an 80% destruction. I’ve made this very clear many times. Every time Litecoin halves, the price of Litecoin goes down 80%. This happened after the Litecoin halving in 2015, after the Litecoin halving in 2019, and likely after the Litecoin halving in 2023. We’re down 30%. We need to go 80%.”\n\nAt the time of writing, LTC was trading at $64.16.\n\nNow Read: Crypto Analyst Says Bitcoin Bull Market Is On The Horizon: 'This Is The Beginning'\n\nJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions, and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nPhoto: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNvcmUtZGV2ZWxvcGVyLWFudG9pbmUtcmlhcmQtc3RlcHMtYmFjay1saWdodG5pbmctbmV0d29yay1kaWxlbW1h0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin core developer steps back from Lightning Network over 'hard dilemma' - Cointelegraph",
        "content": "Security researcher and developer Antoine Riard is stepping down from the Lightning Network’s development team, citing security issues and fundamental challenges to the Bitcoin ecosystem.\n\nAccording to a thread on the Linux Foundation’s public mailing list, Riard believes the Bitcoin community faces a “hard dilemma” as a new class of replacement cycling attacks puts Lightning in a “perilous position.“\n\nHow does a lightning replacement cycling attack work?\n\n\n\nThere's a lot of discussion about this newly discovered vulnerability on the mailing lists, but the actual mechanism is a bit hard to follow.\n\n\n\nSo here's an illustrated primer...\n\n\n\n1/n pic.twitter.com/mvvS8bEc5f — mononaut (@mononautical) October 21, 2023\n\nThe Lightning Network is the second-layer solution built over the Bitcoin blockchain. It is designed to improve the scalability and efficiency of Bitcoin (BTC) transactions by enabling off-chain, peer-to-peer transactions.\n\nThrough the Lightning Network, users can open payment channels, conduct multiple transactions off-chain and settle the final result on the Bitcoin blockchain. The replacement cycling attack targets these payment channels. It is a new type of attack that allows the attacker to steal funds from a channel participant by exploiting inconsistencies between individual mempools. According to Riard:\n\n“I think this new class of replacement cycling attacks puts lightning in a very perilous position, where only a sustainable fix can happen at the base-layer, e.g adding a memory-intensive history of all-seen transactions or some consensus upgrade. Deployed mitigations are worth something in face of simple attacks, though I don’t think they’re stopping advanced attackers as said in the first full disclosure mail.“\n\nRiard also noted that addressing the new type of attack may require changes to the underlying Bitcoin network:\n\n“Those types of changes are the ones necessitating the utmost transparency and buy-in of the community as a whole, as we’re altering the full-nodes processing requirements or the security architecture of the decentralized bitcoin ecosystem in its integrality.“\n\nLightning developers grapple with challenges, including criticisms surrounding the network’s complexity and the demands placed on user experience. Since its inception in 2018, the layer-2 network has gained popularity, with a total value locked reaching $159.5 million at the time of writing, according to data from DefiLlama. However, this figure is still very modest when compared to Bitcoin’s $587 billion market capitalization.\n\nRiard plans to focus now on Bitcoin core development, but warned about upcoming challenges for the major cryptocurrency ecosystem:\n\n“On the other hand fully explaining why such changes would be warranted for the sake of lightning and for designing them well, we might need to lay out in complete state practical and critical attacks on a ~5 355 public BTC ecosystem. Hard dilemma. There might be a lesson in terms of bitcoin protocol deployment [...]”\n\nMagazine: Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jZ21kLW1pbmVyLXBhdmluZy13YXlzLW5ld2VyLTE5MDAyMzE2NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "CGMD Miner: Paving Ways For Newer Trends in Bitcoin Mining - Yahoo Finance",
        "content": "This Bitcoin Mining Project Redefines Autopilot Mode For Cloud Mining\n\nLondon, United Kingdom --News Direct-- Prodigy Press Wire\n\nCGMD Miner: Paving Ways For Newer Trends in Bitcoin Mining\n\nA transformative shift in cryptocurrency mining is indeed on the horizon. However, only some individuals can afford and manage the hefty mining hardware due to various reasons. Technical challenges also come into the picture, making it even more inaccessible for the average person.\n\nCloud mining is the solution, eliminating the need for upfront hardware costs and troubles. Anyone with an internet connection can rent mining equipment in remote data centers to participate in the mining process. Notably, crypto mining platform CGMD Miner blazes a trail in simplifying cloud mining and allowing users to diversify their passive income streams. The platform is revolutionizing the way users can passively earn cryptocurrencies with its innovative autopilot mode.\n\nKey Features of CGMD Miner's Autopilot Mode\n\nHere's a brief overview of how users can benefit from CGMD Miner's autopilot mode and other features:\n\n1. Simplified Registration Process: Signing up for CGMD Miner takes less than 3 minutes and is completely free. Users only need to provide their email address to create an account, and as a bonus, they receive an instant bonus of $10 upon registration.\n\n2. User-Friendly Interface: The platform's interface is designed so that every user can access it easily. Users can easily track and manage potential future earnings, making it straightforward to plan for passive income.\n\n3. Referral Commissions: Users can earn up to $3000 in referral commissions by promoting the platform to others. CGMD Miner's multi-level affiliate program aids users in maximizing their earnings.\n\n4. Autopilot Option: The autopilot feature allows users to grow their passive income through a cost-effective and time-saving way. A seasoned trader or a novice investor can opt for growing their crypto wealth without additional investments. Moreover, CGMD Miner guarantees the principal and returns on investment.\n\nStory continues\n\n5. Mining Contract Options: CGMD Miner offers a variety of mining contracts at different price points, ranging from $10 to $3,000. These contracts cater to diverse levels of passive income.\n\nAbout CGMD Miner\n\nCGMD Miner is a reputable mining service platform that also provides free cloud mining services. With over 380,000 members spread across more than 200 countries, CGMD Miner has established itself as a dependable player in the cryptocurrency mining industry. The platform prioritizes user experience and accessibility, making it possible for individuals with no technical expertise or substantial financial resources to earn cryptocurrencies as passive income.\n\nFurthermore, CGMD Miner provides features like daily profit withdrawals, earnings monitoring, and round-the-clock technical support, ensuring 100% uptime and platform security.\n\nTo learn more about CGMD Miner, please visit the official website: https://www.365miner.com/\n\nMedia Contact\n\nName: Jordana Leonidas\n\nEmail: info@cgmdminer.com\n\nLocation: 65 Compton Street, London, United Kingdom, EC1V 0BN\n\nDisclaimer: This press release is for informational purposes only and does not constitute financial advice. Readers should exercise caution and consult with qualified financial professionals or experts before making any financial decisions or investments\n\nRelease ID: 760014\n\nView source version on newsdirect.com: https://newsdirect.com/news/cgmd-miner-paving-ways-for-newer-trends-in-bitcoin-mining-668926502"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LnVuaWxhZC5jb20vdGVjaG5vbG9neS9uZXdzL2JpbGwtZ2F0ZXMtaXNzdWVkLWJpdGNvaW4td2FybmluZy1hZnRlci1lbG9uLW11c2staW52ZXN0bWVudHMtNzQ2OTUxLTIwMjMxMDIx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "Bill Gates issues stark warning about Bitcoin after Elon Musk's Tesla bought $1.5 billion of cryptocurrency - UNILAD",
        "content": "While Elon Musk is a huge bitcoin advocate, Bill Gates is much less enthusiastic about the cryptocurrency.\n\nMusk has long voiced his love of cryptocurrencies - Dogecoin in particular.\n\nThe multi-billionaire has tweeted about Dogecoin on several occasions, ultimately causing the price to go up almost 6,000 percent over two years.\n\nAdvert 10\n\nElon Musk invested a lot of money into Bitcoin. Credits: Chesnot/Getty Images\n\nIt's continued to fall ever since, and Musk is now being sued for insider trading.\n\nInvestors believe the 52-year-old used tactics such as Twitter posts and paying online influencers to boost Dogecoin's price.\n\nWith the Bitcoin market being so agile, Gates urged people to 'watch out' if they planned on investing their hard-earned cash in cryptocurrency.\n\nAdvert 10\n\nBill Gates urged people to be wary of buying Bitcoin. Credits: Bennett Raglin/Getty Images for The New York Times\n\nPreviously speaking to Bloomberg Technology, the 67-year-old Microsoft founder said: \"Elon has tons of money and he's very sophisticated so I don't worry that his Bitcoin will randomly go up or down.\n\n\"I do think people get brought into these manias who may not have as much money to spare so I'm not bullish on Bitcoin.\n\n\"My general thought would be if you have less money than Elon, watch out.\"\n\nAdvert 10\n\nWhile Gates had his concerns about bitcoin, he did note that digital money is 'a super positive thing'.\n\nAnother thing he touched upon was Bitcoin transactions being irreversible - something which left one cryptocurrency user in a spot of bother earlier this year after they accidentally sent $1.5 million to the wrong person.\n\nThe unnamed person, who sent the cash to someone named ‘jaredfromsubway’, took to Discord to plead that it was sent back to them.\n\nAdvert 10\n\n\n\n\n\n\"Jared from Subway, if you are reading this please help. I sent you by mistake tokens for about $1.5 m. Is there any possibility to get them back?” they penned.\n\nBut things took a dark turn.\n\n\"Or my investors would kill me,\" the person went on.\n\nAdvert 10\n\n\"Please help, Jared! I want to live.\"\n\nThe request later went viral on X, sparking people to take a leaf out of Gates' book and urge others to stay clear of Bitcoin.\n\nOne person said at the time: \"It's incredible how much trust people put in these decentralized systems, but it's also a reminder to always double-check the wallet address before sending large amounts of money!\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXdoeS1hLW1vdmUtdG8tMzBrLWlzLW1vcmUtcGxhdXNpYmxlLXRoYW4tYS1mYWxsLWJlbG93LTI5ay_SAVxodHRwczovL2FtYmNyeXB0by5jb20vYml0Y29pbi13aHktYS1tb3ZlLXRvLTMway1pcy1tb3JlLXBsYXVzaWJsZS10aGFuLWEtZmFsbC1iZWxvdy0yOWsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin: Why a move to $30k is more plausible than a fall below $29k - AMBCrypto News",
        "content": "For Bitcoin to beat the resistance around $30,000, the volume around the previous buying pressure needs to be higher.\n\nBTC accumulation is increasing and could be followed by a rise in volatility.\n\nAfter blasting past $29,000, optimism in the market has started to rise again, with many opining that Bitcoin’s [BTC] journey to $30,000 was a question of when not if. However, according to IntoTheBlock’s data, it may not be an easy ride to the said price. This is because of a potential resistance around the $30,000 mark.\n\nIs your portfolio green? Check the BTC Profit Calculator\n\nBitcoin is in a critical position\n\nIn spite of the fact that 73% of Bitcoin holders were now in profit, the blockchain insight platform noted that the resistance may occur because of the over 1.4 million addresses that accumulated in the region.\n\nAs Bitcoin is inching closer to $30k, we find that the most significant potential resistance is also around that $30k mark, where 1.49M addresses acquired Bitcoin. At the same time, 73% of Bitcoin addresses are currently in profit. This level has proven to be a significant… pic.twitter.com/OymqUOQ4Hw — IntoTheBlock (@intotheblock) October 20, 2023\n\nOne reason why this region was also important was due to the historical demand BTC had at this level. For instance, institutional investors like Michael Saylor’s Microstrategy, and Elon Musk’s Tesla purchased high volumes of BTC around these prices.\n\nIt was also the same case with a number of retail participants. Therefore, it is likely that some market players might try to break even at these points. This could, in turn, draw back the upward movement experienced lately.\n\nA smooth sail may be coming\n\nTo avoid such an occurrence, a lot of accumulation has to take place, and it may need to be more than 496 BTC stockpiled previously at the $29,796 to $30,673 region. Well, data from Glasssnode showed that Bitcoin’s accumulation trend score was 0.72 at press time.\n\nAs a value ranging from zero to one, the accumulation trend score is an indicator that reflects the relative size of entities that are actively accumulating coins on-chain in terms of their BTC holdings.\n\nWhenever the value of the metric is closer to zero, it means that the market is in distribution mode. Thus, the value mentioned above means that there has been more accumulation than distribution.\n\nHence, the chances of Bitcoin hitting $30,000 is much higher than a fall below $29,000.\n\nAs Bitcoin tries to move higher than the price at press time, it is also likely to see a surge in volatility. This was the opinion of Korean on-chain analyst Mignolet. Mignolet, who made his opinion known on CryptoQuant, noted that 3-6 months Spent Output Age Bands (SOAB) was proof of the hike in price fluctuations.\n\nHow much are 1,10,100 BTCs worth today?\n\nThe SOAB is a bundle of all spent outputs that were created within a specified age band. The metric is responsible for revealing the behavior of holders in a certain market atmosphere. Regarding the recent movement, the analyst explained that,"
    }
]