[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMTYvd2h5LWlzLWJpdGNvaW4tYnRjLXJhbGx5aW5nLWluLWphbnVhcnkuaHRtbNIBT2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAxLzE2L3doeS1pcy1iaXRjb2luLWJ0Yy1yYWxseWluZy1pbi1qYW51YXJ5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "New Year, new rally: Why bitcoin is up 28% this month after a tumultuous 2022 - CNBC",
        "content": "In this article BTC.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nA number of factors are behind bitcoin's New Year rise, according to analysts, including an increased probability of interest rates being lowered and purchases by large buyers known as \"whales.\" Filip Radwanski | Sopa Images | Lightrocket | Getty Images\n\nBitcoin has begun 2023 on a positive note, with the price of the world's largest digital token up roughly 28% since the start of January. On Saturday, bitcoin's price rose above $21,000 per coin for the first time since Nov. 7. It's still a far cry from the $68,990 record high bitcoin notched in Nov. 2021. But it has given market players cause for some optimism. The month-to-date rally follows a grim 2022, which saw major insolvencies and scandals in the crypto industry, including the collapse of FTX, and a sharp pullback in the broader market linked to central bank actions. Analysts say that a number of factors are behind bitcoin's New Year rise, including an increased probability of interest rates being lowered, as well as purchases by large buyers known as \"whales.\"\n\nNew Year, new monetary policy?\n\nInflation is cooling down, and economic indicators suggest slowing U.S. economic activity. That's made traders optimistic the Federal Reserve could reverse, or at least soften, its rate hiking strategy.\n\nwatch now\n\nLast week, fresh U.S. inflation data showed a modest retreat, with the consumer price index decreasing 0.1% in December on a monthly basis, in line with Dow Jones estimates. \"Bitcoin looks to have recoupled with macro data as investors shrug off the FTX collapse,\" James Butterfill, head of research at digital asset management firm CoinShares, told CNBC by email. \"The most important macro data investors are focussing on is the weak services PMI and the trending down of employment and wage data. This coupled with downwards trend in inflation has led to improving confidence, while it comes at a time when valuations for Bitcoin ... are close to all time lows. The prospect of looser monetary policy off the back of weaker macro data and low valuations is what has led this rally.\" The Fed lifted borrowing rates seven times in 2022, forcing risky assets such as stocks — and tech stocks, in particular — into a tailspin. In December, the bank's benchmark funds rate increased to 4.25%-4.50%, reaching its highest level since 2007. Bitcoin has been caught up in the market drama around lending rates, as it is increasingly viewed by investors as a risky asset. Backers previously talked up bitcoin's potential as a \"hedge\" to buy in times of high inflation. But bitcoin failed to achieve that aim in 2022, instead slipping more than 60% as the U.S. and other major economies grappled with higher rates and living costs. Yuya Hasegawa, crypto market analyst at Japanese crypto exchange Bitbank, said in a Jan. 13 note that this was \"brewing a hope amongst market participants that the Fed will further slow down on the pace of rate hikes.\"\n\nThe Fed is likely to keep interest rates high for the time being. However, some market players are hopeful that central banks will start easing the pace of rate rises, or even slash rates. Some economists predict a Fed rate cut could happen as soon as this year. That's as the risk of a recession is also playing on central bankers' minds. Some two-thirds of chief economists surveyed by the World Economic Forum believe a global recession is likely in 2023, according to research released by the Davos organizer on Monday. The U.S. dollar has also sagged, with the greenback down 9% against a basket of currencies used by U.S. trade partners in the last three months. The majority of bitcoin trades against USD, making a weaker dollar better for bitcoin. \"We are seeing the dollar put in a top, inflation easing, interest rate hikes slowing down - all pointing to markets getting more risk-on over the next few months,\" Vijay Ayyar, vice president of corporate development and international at crypto exchange Luno, told CNBC.\n\n'Whales' buying BTC\n\nLarger purchasers of digital coins known as \"whales\" may be leading the latest rally in bitcoin, according to Kaiko. The crypto data firm said in a series of tweets Monday that trade sizes had climbed from an average of $700 on Jan. 8 to $1,100 today on the crypto exchange Binance, indicating renewed confidence in the market by whales.\n\nwatch now\n\nWhales are investors who've hoarded large piles of bitcoin. Some are individuals, like MicroStrategy CEO Michael Saylor and Silicon Valley investor Tim Draper. Others are entities such as market makers, which act as the middlemen in trades between buyers and sellers. Skeptics of digital currencies say this makes the market prone to manipulation by a select few investors with large piles of tokens. The wealthiest 97 bitcoin wallet addresses account for 14.15% of the total supply, according to fintech firm River Financial. In December, Carol Alexander, a professor at the University of Sussex, told CNBC that bitcoin could see a \"managed bull market\" in 2023 in which bitcoin travels north of $30,000 in the first quarter, and to $50,000 in the second half. Her reasoning was that with trading volumes evaporating, and the level of fear in the market extremely high, whales would then step in to prop up the market.\n\nBitcoin mining difficulty rising\n\nThere are other factors at play, as well. Several bitcoin miners have been flushed out by the drop in prices. Bitcoin miners, who use power-intensive machines to verify transactions and mint new tokens, have been squeezed by the slump in prices and rising energy costs. That's historically a good sign for bitcoin, according to Ayyar.\n\nwatch now\n\nThese actors accumulate massive piles of digital currency, making them some of the biggest sellers in the market. With miners offloading their holdings to pay off debts, that removes much of the remaining selling pressure on bitcoin. More recently, however, bitcoin's network \"difficulty\" has been increasing, meaning more computing power is being deployed to unleash new tokens into circulation. Mining difficulty reached a record 37.6 trillion on Sunday, according to BTC.com data, meaning that, on average, it would take 37.6 trillion hashes, or attempts, to find a valid bitcoin block and add it to the blockchain. \"Bitcoin mining difficulty is a measure of how difficult it is to create the next block of transactions,\" said Marcus Sotiriou, market analyst at digital asset broker GlobalBlock, in a note Monday. \"Bitcoin mining difficulty fell 3.6% before the last update, after a winter storm led some miners to shut down. However, now miners appear to have come back online, with new and more efficient machines.\"\n\n2024 'halving'"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9tYXJrZXRzL2JpdGNvaW4tcm9sbC1zdGFydC1uZXcteWVhctIBQ2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9tYXJrZXRzL2JpdGNvaW4tcm9sbC1zdGFydC1uZXcteWVhci5hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin on a roll to start the new year - Fox Business",
        "content": "The new year has pumped new life into Bitcoin and other cryptocurrencies.\n\nAfter a dismal 2022, Bitcoin has come roaring out of the starting gate in the first two weeks of the year gaining in 13 of the last 15 days.\n\nThe cryptocurrency rising more than 24% during that stretch to $20,728. That compares to the last 52 weeks in which bitcoin lost more than 54%.\n\nBitcoin was above $45,000 to start 2022, as the crypto industry started making inroads with politicians and mainstream financial institutions.\n\nHOUSE REPUBLICANS LAUNCHING DIGITAL ASSET SUBCOMMITTEE AFTER TROUBLED YEAR FOR CRYPTOCURRENCY INDUSTRY\n\nThe year ended with bitcoin below $17,000.\n\nKeep in mind, bitcoin's all-time high was $67,802.30, reached in November 2021.\n\nA steady industry decline started in May with the collapse of Terra, a so-called stablecoin.\n\nInvestors lost tens of billions of dollars and a number of crypto companies faced financial ruin.\n\nSAM BANKMAN-FRIED DEFENDS HIMSELF IN ONLINE POST: 'I DIDN’T STEAL FUNDS'\n\nMore companies have declared bankruptcy since, the biggest of all being the collapse of FTX and the arrest of the company's founder Sam Bankman-Fried.\n\nTraditional markets have also been doing well with stocks finishing last week with the best weekly performance in two months as earnings season got underway and inflation numbers moved lower.\n\nCLICK HERE FOR FOX BUSINESS' REAL-TIME CRYPTOCURRENCY PRICING DATA\n\nYear-to-date, the S&P is up 4% and the Nasdaq gained nearly 6%.\n\nEther, the coin linked to the ethereum blockchain network, is at $1,583, a gain of nearly 23% in the past week.\n\nEven the smaller dogecoin has rallied more than 20% in the past week to 8 cents.\n\nThe Associated Press contributed to this report."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTYvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXN1cmdlcy1vbi1pbmZsYXRpb24tdGFpbHdpbmRzLWhvdmVycy1uZWFyLTIxay_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzE2L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1zdXJnZXMtb24taW5mbGF0aW9uLXRhaWx3aW5kcy1ob3ZlcnMtbmVhci0yMWsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Surges on Inflation Tailwinds, Hovers Near $21K - CoinDesk",
        "content": "The market has shown that demand is still there for blockchain and crypto. If anything, the turbulence of 2022 was an exercise in shaking out bad actors and reinforcing the positions of good ones. Let’s just make sure that we don’t miss out on what the good ones are doing with this “wall of worry” in front of us."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTE2L2ZvbW8tc3RpcnMtYWdhaW4taW4tYml0Y29pbi1zLWJlc3Qtc3RhcnQtc2luY2UtYmVmb3JlLXBhbmRlbWlj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "FOMO Stirs Again in Bitcoin's Best Start Since Before Pandemic - Bloomberg",
        "content": "Bitcoin has bolted out of January’s starting gates with a climb of more than 26%, turning up the heat on bears who anticipated more challenges for riskier investments after sharp selloffs in 2022.\n\nThe token’s advance so far is the best for the opening month of a year since a 31% rally in 2020 before the pandemic hit. The surge has helped to lift the overall value of digital assets past $1 trillion, a level that gave way in November when the FTX exchange imploded, CoinGecko data shows."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vbmUtb2YtdGhlLWxhcmdlc3QtdXMtY29sbGVnZXMtaGFzLWJlZ3VuLXRlYWNoaW5nLXN0dWRlbnRzLWFib3V0LWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "One of the largest US colleges has begun teaching students about Bitcoin - Cointelegraph",
        "content": "Classroom adoption of Bitcoin and cryptocurrency courses continue to skyrocket, with Texas A&M now being the latest United State College to offer a Bitcoin course to some of its 74,000+ students.\n\nThe news was announced on Jan. 13 by Associate Professor Korok Ray of Mays Business School at Texas A&M, who will be teaching the “Bitcoin Protocol” course to students in the College of Engineering and Mays Business School when the Spring Semester starts on Jan. 17.\n\nI will be teaching the first ever Bitcoin class at Texas A&M this spring! — Korok Ray (@KorokRay) January 12, 2023\n\nRay stated in the 4-part Twitter thread that “Programming Bitcoin” will follow Bitcoin Protocol, where students will learn to “build a Bitcoin library from scratch.”\n\nThe professor added that it was no easy feat to receive approval from the school’s relevant curriculum committee body, which came on the back of “months” of hard work.\n\nIt took months to get this class approved, but we made it! Getting Bitcoin into the curriculum is important for the long game. — Korok Ray (@KorokRay) January 12, 2023\n\nA lack of high-quality crypto education has been dubbed as a key roadblock in taking adoption to the next level, according to crypto researcher Josh Cowell, who suggested that it can improve upon one’s financial literacy if done correctly.\n\nCointelegraph reached out to Ray to ask how many students signed up to the class but did not receive an immediate response.\n\nRelated: University of Cincinnati turning crypto craze into educational curriculum\n\nLegal and regulatory implications of blockchain technology and cryptocurrencies are now being taught at U.S. colleges too.\n\nAdjunct Professor Thomas Hook of Boston University Law School — who is also the U.S. chief compliance officer at crypto exchange Bitstamp — recently told Cointelegraph that the law school now offers a “Crypto Regulation” course for students interested in learning how crypto-versed lawyers can help companies navigate through regulatory uncertainties as they look to take their products and services to market:\n\n“It’s meant to expose future lawyers on the potential issues they may see and the myriad of approaches and regulations that exist as it pertains to crypto [and] the different [issues] that crypto companies may face across the globe.”\n\nOther universities now offering cryptocurrency courses include Harvard University, Massachusetts Institute of Technology, Oxford University, National University of Singapore, Cornell University and the University of California Berkeley."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL2NyeXB0by1lZHVjYXRpb24va3Jha2VuLTEwMS10aGUtYmVnaW5uZXJzLWd1aWRlLXRvLWJpdGNvaW4tYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Crypto 101: The Beginner's Guide to Bitcoin (BTC) - Kraken Blog",
        "content": "Bitcoin is an invention that, for the first time in history, enabled a group of software users to create and manage a digital money supply outside the control of any government or bank.\n\nIt helps to think of Bitcoin as a software protocol like those you interact with everyday – think SMTP (which helps route your emails) and HTTP (which ensures the web content you request from your browser is delivered to you by servers). These technologies are protocols – sets of rules that dictate how computers transfer data.\n\nWithout protocols, the network we call the Web would be chaos.\n\nThe Bitcoin protocol enables computers running its software to manage a data set (the blockchain) and enforce a set of rules that make this data (bitcoins) scarce and potentially valuable.\n\nAs its essential building blocks, the Bitcoin protocol uses:\n\nThe Bitcoin blockchain is a full record of the network’s history validated by individuals running the Bitcoin software (nodes). This ensures that unlike most digital data, which can be freely copied and modified, bitcoins cannot be.\n\nWho Created Bitcoin?\n\nWhile Bitcoin can safely claim to have created the world’s first successful cryptocurrency, its technology is built on decades of ideas for how cryptography could help create digital money.\n\nIn 2006, “Satoshi Nakamoto,” a still pseudonymous person or group, began writing the code for a new digital cash system called “Bitcoin.”\n\nWant to learn even more about the origin and early days of bitcoin? You can check out our article What is the Bitcoin white paper?\n\nHow Does Bitcoin Work?\n\nThere are two main concepts to understand if you are interested in truly understanding how the Bitcoin protocol operates.\n\nLuckily, we have detailed articles that break down both of these topics!\n\nCryptocurrencies use cryptography to help the network track information in a less data intensive yet extremely secure way. You can learn all about this in our article How do cryptocurrencies use cryptography?\n\nNext, a process known as mining helps to make sure information is actually recorded on the blockchain. Once again, you can learn all about the mining process, as well as the role cryptography plays in the process with our article What is Bitcoin Mining?\n\nWhat Gives BTC Value?\n\nBitcoin shares many of the characteristics that give traditional commodities and government monies value. Some of these factors include:\n\nScarcity\n\nDurability\n\nPortability\n\nDivisibility\n\nFungibility\n\nAcceptability\n\nWant to learn more about each of these? Still have more questions about the world’s first cryptocurrency?\n\nHead over to the Kraken Learn Center and check out our article What is Bitcoin? to get even more information about the Bitcoin protocol.\n\nRemember that can also buy and sell BTC for other cryptocurrencies at exchanges like Kraken, which are online 24/7, 365 days a year. Check out the real time price of bitcoin by going to our bitcoin price page or keep learning about bitcoin with our Learn Center article below.\n\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, or hold any digital asset or to engage in any specific trading strategy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXByaWNlLXN1cmdlcy1jcnlwdG8tcmV0YWtlcy0xLXRyaWxsaW9uLW1hcmtldC1jYXAtMTAwMTAwNTY3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price surges 24% as crypto retakes $1tn market cap - Yahoo Finance UK",
        "content": "Only one week ago bitcoin was still hovering around the $17,000 mark. Photo: Getty (Adrian Vidal via Getty Images)\n\nBitcoin (BTC-USD) broke through the $21,000 mark in early Monday trading, a considerable price movement from a low of $16,000 at the beginning of the year.\n\nThe world's largest digital asset by market capitalisation surged almost 25% in a week to $21,069. Only one week ago bitcoin was still hovering around the $17,000 mark.\n\nThe price hike was echoed by other cryptocurrencies, with ethereum (ETH-USD) up 20% in a week to $1,564, hitting a two month high over the weekend.\n\nCheck: Crypto live prices\n\nSolana (SOL-USD) made the biggest gains with a 62% rise in the week, to $23.31.\n\nOn Monday, the cryptocurrency market capitalisation stood at $1.02tn (£980bn), a rise of around 1.2% in 24 hours, according to data from Coingecko.\n\nADVERTISEMENT\n\nThe capital inflow into the cryptocurrency sector comes amid renewed investor confidence that the US Federal Reserve is taming inflation without casting the economy into recession.\n\nSuccessive rate hikes by the central bank led to fears that the drying up of liquidity would result in a stagnated economy and a retraction of economic output.\n\nBut there have been recent signs of a reversal, with consumer prices in the US rising by only 6.5% in December, compared to a year before.\n\nThe rate of inflation fell in the last six months of 2022, since reaching a peak of 9.1% in June.\n\nWatch: Web3 sectors to watch in 2023 | The Crypto Mile\n\nRead more: How crypto fell to earth in 2022: Eight charts that tell the story of a cruel crash\n\nThe crypto market is hoping for less hawkish monetary policy from the Fed in coming months, with the potential for a reduction in hikes and the end of the reduction in money supply.\n\nHowever, despite the slowdown in price increases, inflation continues to hover near a 40-year high and the World Bank remains pessimistic about the consequences of successive monetary policy tightening around the world.\n\nIn a report released last week, the World Bank said: \"Although this tightening has been necessary for price stability, it has contributed to a significant worsening of global financial conditions, which is exerting a substantial drag on activity.\""
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZW4uYXMuY29tL2xhdGVzdF9uZXdzL3doeS1pcy1iaXRjb2luLWdvaW5nLXVwLWNyeXB0by1wcmljZXMtcmFsbHktYWZ0ZXItdG91Z2gtMjAyMi1uL9IBbGh0dHBzOi8vZW4uYXMuY29tL2xhdGVzdF9uZXdzL3doeS1pcy1iaXRjb2luLWdvaW5nLXVwLWNyeXB0by1wcmljZXMtcmFsbHktYWZ0ZXItdG91Z2gtMjAyMi1uLz9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Why is Bitcoin going up? Crypto prices rally after tough 2022 - AS USA",
        "content": "Cryptocurrency markets have started the year on the front foot after plunging during 2022. The price of Bitcoin, the most widely-used digital token, has risen by around 26% since the turn of the year and hit $21,000 for the first time since 7 November.\n\nThis rise could be a sign that confidence is returning to the market after a tumultuous year beset with interest rate hikes and cryptocurrency scandals.\n\nThe Federal Reserve implemented seven interest rate hikes during 2022 which sent stock prices and cryptocurrency assets into a tailspin. In December the central bank upped the borrowing rate to 4.50%, the highest level seen since 2007.\n\nBut after signs that inflation is slowing there is renewed hope that the Fed may be able to lower interest rates later this year. This would likely bring a solid stream of new investment into the industry and serve to push up prices across the board. However any hopes of a return to the 2021 peak, when Bitcoin was trading above $64,000, still seem a long way off.\n\nMarkets begin to bounce back after FTX aftershocks\n\nWhile central bank policy had an undeniable effect on markets last year, the cryptocurrency market was hit by a major scandal that shook investors’ faith. The collapse of FTX, one of the largest digital exchanges, saw billions of dollars in value lost in a matter of days and investors blocked from withdrawing funds.\n\nThe company’s CEO and founder Sam Bankman-Fried has been charged with multiple counts of fraud and criminal conspiracy as a result. The affair highlighted many of the concerns that investors typically have when it comes to the largely unregulated crypto markets and values plummeted.\n\nIn early November, as rumours about an impending collapse were circulating online, the price of Bitcoin slumped from around $21,000 to less than $16,000 in a matter of days. The January rise could be seen as little more than a bounce-back from the FTX scandal that rocked the industry.\n\nAnthony Scaramucci predicts positive year for Bitcoin\n\nIn recent days the rising price of Bitcoin – usually a barometer for crypto markets more generally – has sparked hope among investors that 2023 could see sustained gains made across the board. The market’s total value has once again climbed above $1 trillion and some investors are considering a return to the tempestuous waters of cryptocurrency.\n\nAnthony Scaramucci, briefly the White House communications director during the Trump administration and now chief executive of SkyBridge Capital, believes that 2023 can be a “recovery year” for Bitcoin.\n\n“You are taking on risk but you’re also believing in [bitcoin] adoption,” he told CNBC during a crypto conference last week. “So if we get the adoption right, and I believe we will, [Bitcoin] could easily be a $50,000 to $100,000 asset over the next two to three years.”\n\nIt should be noted that FTX bought a 30% stake in SkyBridge Capital last September. Scaramucci claims that this deal was based on fraudulent information and that SkyBridge stands to buy back that stake once the bankruptcy court has issued a ruling on FTX’s obligations. However the link between the companies does give reason for Scaramucci to hope that confidence returns to the markets."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluZXJzLXdpbnRlci1kaWZmaWN1bHR5LWFsbC10aW1lL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluZXJzLXdpbnRlci1kaWZmaWN1bHR5LWFsbC10aW1lL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin miners return from winter storms, difficulty at an all-time high - Forkast News",
        "content": "The Bitcoin mining difficulty level jumped 10.26% on Monday morning in Hong Kong, hitting an all-time high reading of 37.59 trillion, as several U.S-based miners came back online from recent winter storms that forced them to unplug, according to data from BTC.com.\n\nSee related article: Bitcoin hashrate drops nearly 40% as deadly U.S. storm unplugs miners\n\nFast facts\n\nBitcoin’s difficulty reading this time last year was at 26.64 trillion, almost 30% lower than the latest adjustment. Bitcoin’s value at that time was more than double its price today.\n\nBitcoin was up 2.1% to US$21,146 in the 24 hours to 1 p.m. in Hong Kong on Monday.\n\nBitcoin mining difficulty started to fall in late December as miners across the U.S. were forced to shut down their operations due to deadly blizzards that claimed the lives of at least 60 people.\n\nBitcoin mining difficulty, which determines how much computing power is required to verify blocks on the blockchain, changes roughly every two weeks.\n\nThe rising mining difficulty and low Bitcoin prices have damaged the profitability of mining businesses. U.S.-based miners Compute North Holdings Inc. and Core Scientific Inc. both filed for bankruptcy late last year.\n\nSee related article: Bitcoin mining difficulty drops more than 7% as cash crunch hits miners"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMTYvYml0Y29pbi1wcmljZS1wcmVkaWN0aW9uLTIwMjMtaW52ZXN0b3JzLXNlZS0xMjAwMC10by0zMDAwMC5odG1s0gFjaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDEvMTYvYml0Y29pbi1wcmljZS1wcmVkaWN0aW9uLTIwMjMtaW52ZXN0b3JzLXNlZS0xMjAwMC10by0zMDAwMC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Scaramucci sees bitcoin at $50,000 to $100,000 in 2-3 years as market hopes for bull run - CNBC",
        "content": "After a tumultuous 2022, crypto investors are trying to figure out when the next bitcoin bull run could be.\n\nLast week, at a crypto conference in St. Moritz, Switzerland, CNBC spoke to industry insiders who painted a picture of 2023 as year of caution. Bitcoin is expected to trade within a range, be sensitive to the macroeconomic situation such as interest rate rises and continue to be volatile. A new bull run is unlikely in 2023.\n\nHowever, experts are looking to next year and beyond with optimism.\n\nIn 2022, the entire cryptocurrency market lost about $1.4 trillion in value with the industry facing liquidity issues and bankruptcies topped off by the collapse of exchange FTX. Contagion spread across the industry.\n\nWhile bitcoin has gotten a small bump at the start of the year, in line with risk assets like stocks, experts say bitcoin is unlikely to retest its all-time high of just under $69,000 but it may have bottomed.\n\n\"I think there's a little bit more downside, but I don't think there's going to be a lot,\" Bill Tai, a venture capitalist and crypto veteran told CNBC last week.\n\n\"There's a chance that [bitcoin] kind of has bottomed here,\" adding that it could fall as low as $12,000 before jumping back up.\n\nMeltem Demirors, chief strategy officer at CoinShares, said bitcoin is likely to be rangebound trading at the lower end between $15,000 and $20,000 and on the upper end between $25,000 to $30,000.\n\nShe said a lot of the \"forced selling\" that happened in 2022 as a result of collapses in the market is now over, but there isn't much new money coming into bitcoin.\n\n\"I don't think there's a lot of forced selling remaining, which is optimistic,\" Demirors told CNBC Friday. \"But again, I think the upside is quite limited, because we also don't see a lot of new inflows coming in.\"\n\nInvestors are also keeping one eye on the macroeconomic situation. Bitcoin has proved to be closely correlated to risk assets such as stocks, and in particular, the tech-heavy Nasdaq . These assets are affected by changes in interest rates from the Federal Reserve and other macroeconomic moves. Last year, the Fed embarked on an aggressive interest rate hike path to try to tame inflation, which hurt risk assets along with bitcoin.\n\nIndustry insiders said a change in the macro situation could help bitcoin."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTYvYml0Y29pbi1zdXJnZS1jYXVzZXMtb3Zlci01MDBtLWluLWxpcXVpZGF0aW9ucy1oaWdoZXN0LWluLTMtbW9udGhzL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTYvYml0Y29pbi1zdXJnZS1jYXVzZXMtb3Zlci01MDBtLWluLWxpcXVpZGF0aW9ucy1oaWdoZXN0LWluLTMtbW9udGhzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Surge Causes Over $500M in Liquidations, Highest in 3 Months - CoinDesk",
        "content": "Strong transactional activity on Cardano and Solana may have contributed to a surge in their native ADA and SOL tokens, respectively, over the past week. Elsewhere, the upcoming Shanghai upgrade for ether has added to its fundamentals, while Polygon is scheduled for a hard fork – a term for a network upgrade – this week, triggering a 22% rise in MATIC over the past week."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy81LWFsdGNvaW5zLXRoYXQtY291bGQtYnJlYWtvdXQtaWYtYml0Y29pbi1wcmljZS1zdGF5cy1idWxsaXNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "5 altcoins that could breakout if Bitcoin price stays bullish - Cointelegraph",
        "content": "The cryptocurrency markets have made a strong comeback in the past few days. That drove the total crypto market capitalization to $995 billion on Jan. 14, according to CoinMarketCap data. Bitcoin (BTC) led the recovery from the front, skyrocketing above $21,000 on Jan. 14.\n\nAfter the sharp rally, the big question is whether the recovery is a dead cat bounce that is a selling opportunity, or the start of a new uptrend. It is difficult to predict with certainty if a macro bottom has been made but the charts suggest that a bottoming process has begun.\n\nCrypto market data daily view. Source: Coin360\n\nIndependent market analyst HornHairs highlighted that the 2017 to 2018 bear market lasted for 364 days and that from 2021 to the current market low, the duration is again 364 days. Another interesting similarity is that the 2015 to 2017 bull market and the 2018 to 2021 bull phase both lasted for 1,064 days. If history repeats itself, then Bitcoin may make the next top in roughly 1,000 days.\n\nBitcoin’s short-term price action has been exciting for bulls but are there altcoins that are showing similar strength in the near term?\n\nLet’s study the charts to find out.\n\nBTC/USDT\n\nBitcoin shot up to $21,258 on Jan. 13 and that propelled the relative strength index (RSI) above 89, signaling that the rally was overheated in the short term. The bears are expected to mount a strong defense at $21,500.\n\nBTC/USDT daily chart. Source: TradingView\n\nSometimes, when a trend change happens, the RSI may remain in the overbought territory for a long time. If the BTC/USDT pair does not give up much ground from the current level, it will suggest that traders are in no hurry to book profits as they anticipate another leg higher.\n\nIf buyers kick the price above $21,500, the pair could climb to $22,800. This level may again act as a major roadblock.\n\nOn the way down, the bears will have to drag the price below the psychological level of $20,000 to make a dent in the bullish momentum. The pair could then slump to the breakout level of $18,388.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are guarding the $21,250 level but a positive sign is that the bulls have not allowed the price to slide back below $20,000. Buyers may again attempt to clear the overhead hurdle at $21,258 and resume the uptrend.\n\nOn the contrary, if the price once again turns down from $21,250, it may tempt short-term traders to book profits. That could sink the pair below the 20-day exponential moving average (EMA). The bears may try to capitalize on this situation and pull the pair to $18,388.\n\nLTC/USDT\n\nLitecoin (LTC) broke above the overhead resistance at $85 on Jan. 12, indicating the start of a new uptrend. There is no major hurdle until the price reaches $107.\n\nLTC/USDT daily chart. Source: TradingView\n\nOn the downside, the bulls will try to fiercely defend the zone between $85 and the 20-day EMA ($79). If the price springs back from this zone, the LTC/USDT pair could continue its uptrend and reach $107.\n\nThe upsloping moving averages signal advantage to bulls but the RSI above 77 suggests that a minor pullback or consolidation is likely.\n\nIf bears want to gain the upper hand, they will have to pull the price below the breakout level of $75. That could make way for a collapse to $61.\n\nLTC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows the pair is in an uptrend and the bulls are fiercely protecting the 20-EMA. If buyers drive the price above $92, the pair could pick up momentum and rally toward the psychological level of $100.\n\nConversely, if the price turns down and dives below the 20-EMA, it will suggest that short-term traders may be booking profits. That could pull the price to the 50-day simple moving average (SMA). This is an important level for the bulls to defend because a break below it could heighten the risk of a drop to $80 and then $75.\n\nOKB/USDT\n\nWhile several cryptocurrencies are attempting to bottom out, OKB (OKB) has started a new uptrend. Usually, it is a good strategy to buy the dips in an uptrend by keeping a suitable stop loss.\n\nOKB/USDT daily chart. Source: TradingView\n\nThe upsloping moving averages and the RSI in the overbought territory indicate that bulls are in command but a short-term consolidation or correction can't be ruled out. The OKB/USDT pair could slip to the 20-day EMA ($27.64), which is likely to act as strong support.\n\nIf the price rebounds off this level, the pair could touch the strong overhead barrier at $34.18. Crossing this level may be a difficult task but if the bulls manage to achieve it, the pair could skyrocket to $42.\n\nIf bears want to stall the up-move, they will have to yank the price below the 20-day EMA. If they succeed, the pair could plummet to the 50-day SMA ($24.05).\n\nOKB/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the uptrend met with strong selling near $33 and the pair could correct to the 20-EMA. If the price rebounds off this support, it will suggest that bulls are buying on every minor dip. That could drive the price to $34.18.\n\nContrarily, if the price plunges below the 20-EMA, the correction could deepen to the 50-SMA. If the price rebounds off this level, the bulls will again try to resume the up-move but may face resistance at $31 and again near $33.\n\nRelated: Bitcoin fails to convince that bottom is in with $12K 'still likely'\n\nBIT/USDT\n\nBitDAO (BIT) rallied sharply from $0.26 on Dec. 27 to $0.53 on Jan. 14, indicating a strong bullish momentum. In addition, the shallow pullback on Jan. 15 suggests that traders are not exiting their positions in a hurry as they anticipate the up-move to continue.\n\nBIT/USDT daily chart. Source: TradingView\n\nIf bulls thrust the price above the overhead resistance at $0.54, the BIT/USDT pair could resume its up-move. The next resistance on the upside is at $0.68. The bears may pose a strong challenge at this level because a break and close above it could open the doors for a possible rally to $0.80.\n\nOn the downside, the first support is at $0.46 and then the 20-day EMA ($0.42). A strong bounce off either support will suggest that traders are buying on declines. That could result in a retest of $0.54. The bears may take control if they sink the price below the 20-day EMA.\n\nBIT/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the pair is facing resistance near $0.54 but the bulls are likely to defend the drop to the 20-EMA. A strong rebound off this level will suggest that bulls are buying on shallow declines. That could improve the prospects of a break above $0.54.\n\nAlternatively, if the price turns down and breaks below the 20-EMA, several short-term traders may book profits. That could pull the pair to the 50-SMA. If this level also cracks, the pair could tumble to $0.41.\n\nFTM/USDT\n\nFantom (FTM) broke above the downtrend line on Jan. 9, indicating a potential trend change. The breakout was followed by a sharp rally which pushed the RSI into deeply overbought levels.\n\nFTM/USDT daily chart. Source: TradingView\n\nVertical rallies are unsustainable, hence a pullback was to be expected. The FTM/USDT pair could dip to the 38.2% Fibonacci retracement level of $0.30 and then to the 50% retracement level of $0.28.\n\nIf the price turns up from this zone, it will suggest a change in sentiment from selling on rallies to buying on dips. The bulls will then try to resume the recovery and drive the pair above $0.36. If they do that, the pair could surge to $0.42.\n\nContrarily, a break and close below $0.28 could pull the pair down to the 61.8% retracement level of $0.26. A deeper fall could break the bullish momentum and increase the possibility of a range formation.\n\nFTM/USDT 4-hour chart. Source: TradingView\n\nBoth moving averages are sloping up and the RSI is in the positive territory, indicating an advantage to buyers. The pair could slide to the 20-EMA, which is likely to act as a strong support. If the price rebounds off this level, the bulls will try to resume the up-move.\n\nOn the contrary, if the price breaks below the 20-EMA, it will suggest that traders are aggressively booking profits after the recent rally. The pair could then extend its correction to the 50-SMA.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItc29sYW5hLWJvbmstcG9seWdvbi1zaGliYWludS_SAURodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLXNvbGFuYS1ib25rLXBvbHlnb24tc2hpYmFpbnUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ether rises; Solana is biggest gainer in top 10 - Forkast News",
        "content": "Bitcoin and Ether gained in Monday afternoon trading in Asia, along with all other top 10 non-stablecoin cryptocurrencies. Solana posted the biggest gain among the top 10, followed by Polygon and Shiba Inu.\n\nSee related article: Bitcoin miners return from winter storms, difficulty at an all-time high\n\nFast facts\n\nBitcoin traded 1.87% higher to US$21,121 in the past 24 hours to 4 p.m. in Hong Kong, a 22.72% rise over the past calendar week, according to CoinMarketCap data. Bitcoin briefly rose to US$21,345 in the morning. Ether gained 2.52% to US$1,566, up 19.46% over the past seven days.\n\nSolana rose 8% to US$24.27, with a 48% week-to-date gain. Solana has surged over 140% since the new year following the launch of Bonk, a Solana-focused dog-themed memecoin. Bonk aims to support the Solana community to rebound from its involvement with FTX and Alameda Research, Bybit explained.\n\nPolygon’s MATIC traded 4.91% higher to US$1.02, strengthening 18.46% over the past week.\n\nOn Jan. 6, it was reported that Polygon had paid popular non-fungible token (NFT) projects Y00ts and DeGods to migrate to the Polygon blockchain from Solana. The same day, Polygon announced that Mastercard is launching a new program on Polygon that will help musical artists utilize blockchain technology.\n\nShiba Inu also traded 5.95% higher, in a week-long price growth of 21.87%.\n\nAsia equity markets were mixed on Monday. Hong Kong’s Hang Seng Index closed 0.11% lower, and the Shanghai Composite Index added 1.01%. Japan’s Nikkei 225 went down by 1.14%.\n\nThe December CPI reading in the U.S. fell from November’s 7.1% and marked the smallest annual increase since October 2021. While the key inflation indicator points to easing of U.S. inflation, Fed Chair Jerome Powell has warned of more rate increases in 2023, with the next Federal Reserve meeting to be held from Jan. 31 to Feb. 1.\n\nChina’s exports fell by 9.9% in December from a year ago, while imports fell by 7.5%, with both data coming in slightly better than Reuters’ poll, according to the country’s customs data released Friday.\n\nSee related article: U.S. House of Representatives forms new cryptocurrency subcommittee"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNvdWxkLXNlZS0yNWstYnktbWFyY2gtMjAyMy1hcy11LXMtZG9sbGFyLXByaW50cy1kZWF0aC1jcm9zcy1hbmFseXNpc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin could see $25K by March 2023 as US dollar prints 'death cross' — Analysis - Cointelegraph",
        "content": "Bitcoin (BTC) shows the potential of stretching its ongoing price recovery to $25,000 by March, based on a mix of bullish technical and macro indicators.\n\nBitcoin price exits descending channel range\n\nFirst, Bitcoin's potential to hit $25,000 comes from its exit from a prevailing descending channel range.\n\nA bull run or bull trap? — Cointelegraph (@Cointelegraph) January 16, 2023\n\nNotably, BTC’s price broke out of the range late last week, accompanying a rise in its trading volumes. The cryptocurrency’s move upside also pushed the price above its resistance confluence, comprising a psychological price ceiling of $20,000 and its 20-week exponential moving average (20-week EMA; the green wave) near $19,500, as shown below.\n\nBTC/USD 1-week candle chart (Coinbase). Source: TradingView.com\n\nBreaking three resistance levels with strong volumes shows traders’ conviction about an extended price rally. Should it happen, Bitcoin’s next upside target appears at its 200-week EMA (the yellow wave) at around $25,000 — a 20% rise from current price levels.\n\nDollar forms a “death cross”\n\nBitcoin’s bullish technical outlook appears against the backdrop of a relatively weaker U.S. dollar, which is down due to expectations that the Federal Reserve will stop raising interest rates as a result of lowering inflation.\n\nThe two assets have mostly moved inversely to each another since March 2020. As of Jan. 16, the daily correlation coefficient between Bitcoin and the U.S. Dollar Index (DXY), a barometer to gauge the greenback’s strength versus top rivaling currencies, was -0.83, according to TradingView.\n\nBTC/USD and DXY correlation coefficient. Source: TradingView\n\nA traditional technical setup sees more losses for the dollar ahead.\n\nDubbed a “death cross,” the setup appears when an asset’s 50-period moving average crosses below its 200-period moving average. For the dollar, the death cross shows its weakening momentum, meaning its short-term trend has been underperforming its long-term direction.\n\nDXY daily price chart. Source: TradingView\n\n“Expecting more downside in the mid to long term,” independent market analyst Crypto Ed said about the dollar, adding:\n\n“Risk on assets should bounce more on that. Or better said: I expect BTC to break its bearish cycle as the big run in DXY is finito.”\n\nNot a long-term Bitcoin price rally\n\nBitcoin has risen 30% above $20,000 in 2023 so far, but on-chain data shows that the buying trend lacks support from institutional investors.\n\nRelated: Bitcoin gained 300% in year before last halving — Is 2023 different?\n\nFor instance, the total amount of Bitcoin held by digital assets holdings such as trusts, exchange-traded funds and other funds has been declining during the coin’s price increase in recent months, according to CryptoQuant’s Fund Holdings index.\n\nBitcoin fund holdings. Source: CryptoQuant\n\nIn addition, no unusual transactions occurred on-chain but on crypto exchanges, per the comparisons made between CryptoQuant’s Token Transferred and Fund Flow Ratio metrics.\n\nBTC/USD versus Token Transferred (orange) and Fund Flow Ratio (blue). Source: CryptoQuant\n\nThe Token Transferred metric shows the number of coins transferred in a specific timeframe, while the Fund Flow Ratio represents the ratio of coin transfers involving the exchange to the overall coin transfers networkwide.\n\n“Usually at the bottom, institutional investors want to buy quietly through OTC trading,” noted market analyst MAC_D, adding:\n\n“This trading was simply actively traded only on the exchange, and no unusual transactions occurred on the on-chain. [...] The current institutional investors have remained calm and just watching. OTC trading will be brisk when they expect a full-fledged uptrend turn.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZhaWxzLXRvLWNvbnZpbmNlLXRoYXQtYm90dG9tLWlzLWluLXdpdGgtMTJrLXN0aWxsLWxpa2VsedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin fails to convince that bottom is in with $12K 'still likely' - Cointelegraph",
        "content": "Bitcoin (BTC) may be circling its highest levels in months, but few are convinced that the bull market is back.\n\nAhead of a key weekly close, BTC/USD remains near $21,000, data from Cointelegraph Markets Pro and TradingView shows, with analysts nervous about the good times ending all too soon.\n\nBitcoin to see new “depression” before bull run resumes\n\nBitcoin is dividing opinion after its week of brisk gains. Warnings over a potential pullback abound, while others are already commiserating bears ahead of time.\n\n“Now bears will be caught in the vicious cycle of praying for pullbacks to go lower, not realizing the tides have shifted for a time and we’re going higher,” Chris Burniske, former head of crypto at ARK Invest, summarized.\n\nEven more optimistic takes such as that of Burniske, however, do not foresee the upside continuing uninterrupted in a definitive end to Bitcoin’s latest bear market.\n\nUploading the classic “Wall Street Cheat Sheet” graphic over the weekend, popular commentator Lemon predicted that BTC/USD would still fall further.\n\n“Sorry, I have to be true to my thoughts, I think we are here,” he told Twitter followers, pointing to Bitcoin sentiment — and price — heading toward macro lows.\n\n“Wall Street Cheat Sheet” annotated chart. Source: Lemon/ Twitter\n\nSuch a theory ties in with the more dismissive reactions to the latest BTC price rebound, such as those from fellow commentator Il Capo of Crypto, who in recent days described it as “one of the biggest bull traps I’ve ever seen.”\n\n“Despite the recent bounce, the bearish scenario hasn't been invalidated,” he wrote in part of a follow-up Twitter thread on Jan. 14:\n\n“If you have made profits during these days, my sincere congratulations, but remember that it's not a bad time to protect these profits.”\n\nHe concluded that a $12,000 macro low on BTC/USD was “still likely.”\n\nBTC/USD annotated chart. Source: Il Capo of Crypto/ Twitter\n\nFunding rates spook the mood\n\nTurning to data, Maartunn, a contributor to on-chain analytics platform CryptoQuant, warned that the BTC price correction could come sooner rather than later.\n\nRelated: Bitcoin gained 300% in year before last halving — Is 2023 different?\n\nFunding rates on derivatives platforms, he wrote in a blog post on Jan. 14, were reaching unsustainable levels.\n\n“Funding Rates for Bitcoin hits a 14-months high,” he noted.\n\nWith positive rates, those longing BTC are effectively paying to do so, indicating a popular belief that prices will continue to rise. This can in turn cause major upheaval should price react the opposite to consensus, causing a cascade of liquidations if support is broken.\n\n“It’s clear that traders are betting on higher prices. How-ever, analyzing the Funding Rates chart suggests that might not be the case,” Maartunn concluded.\n\n“In the previous occasions where Funding Rates were as high as today, Bitcoin had a pullback.”\n\nBitcoin funding rates annotated chart. Source: CryptoQuant\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9iaW5hbmNlLWNlby10cm9sbHMtamltLWNyYW1lci1hcy1iaXRjb2luLWJ0Yy1oaXRzLTIxNTAw0gFLaHR0cHM6Ly91LnRvZGF5L2JpbmFuY2UtY2VvLXRyb2xscy1qaW0tY3JhbWVyLWFzLWJpdGNvaW4tYnRjLWhpdHMtMjE1MDA_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Binance CEO Trolls Jim Cramer as Bitcoin (BTC) Hits $21,500 - U.Today",
        "content": "The head of major cryptocurrency exchange Binance, Changpeng Zhao, also known as CZ, has commented on the recent success of the Bitcoin (BTC) price. In addition to the entrepreneur's statement that BTC is \"still here,\" he also ironically noted the accuracy of the predictions of famed cryptocurrency critic and host of CNBC's Mad Money show, Jim Cramer.\n\nAdvertisement\n\nWhat did Jim Cramer say this time?\n\nIt's about Cramer's tweet from Tuesday, Jan. 9, in which he noted a good opportunity to withdraw investments from cryptocurrencies, which as the presenter says \"can't be trusted.\" The irony is that since then, in less than a week, Bitcoin has risen in value by more than 20% and has come to where it was before the crisis caused by the fall of FTX.\n\nGood chance AGAIN to get out of crypto and scale out of Chinese stocks as neither can be trusted — Jim Cramer (@jimcramer) January 9, 2023\n\nThe Binance chief asked Cramer to keep on spreading fear, uncertainty and doubt about cryptocurrencies so that the market will continue to rise. Recall that the presenter has been known for the inverse \"accuracy\" of his predictions since 2008, when he publicly stated that global investment bank Bear Stearns would not be able to collapse. It is easy to guess what happened next.\n\nCramer did not respond to the jabs from CZ or other members of the crypto community, but earlier, four days after his initial tweet, he called the ongoing growth a short squeeze and drew attention to the story with Genesis and Gemini, whose investigations have been initiated by the SEC."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNubi5jb20vMjAyMy8wMS8xNS9vcGluaW9ucy9jcnlwdG8tbWlhbWktc2FtLWJhbmttYW4tZnJpZWQtY2xpbmUtY3RycC9pbmRleC5odG1s0gFgaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAyMy8wMS8xNS9vcGluaW9ucy9jcnlwdG8tbWlhbWktc2FtLWJhbmttYW4tZnJpZWQtY2xpbmUtY3RycC9pbmRleC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Opinion: Miami is one step closer to the implosion of its crypto dreams - CNN",
        "content": "Editor’s Note: Jake Cline is a writer and editor in Miami whose work has appeared in The Washington Post, The Atlantic and other national outlets. He was a member of the team that won the 2019 Pulitzer Prize in Public Service for the South Florida Sun Sentinel’s coverage of the mass shooting at Marjory Stoneman Douglas High School. The opinions expressed here are his own. Read more opinion on CNN.\n\nCNN —\n\nThanks in large part to bitcoin evangelism by top officials in Miami, the city has spent the past couple of years in full-blown cryptomania.\n\nIn the vision of Mayor Francis Suarez – the city’s chief cheerleader for digital currency – Miami will one day become the national capital for cryptocurrency.\n\nJake Cline Courtesy Jake Cline\n\nTwo years ago, Miami published its “Bitcoin White Paper” – a blueprint for its transformation into a 21st century city. Around the same time, prominent crypto figures began relocating to the city, and Miami began hawking its own digital currency, MiamiCoin.\n\nAs the fever quickened, cryptocurrency exchanges began advertising on Miami billboards. Bitcoin ATMs were installed at neighborhood gas stations and convenience stores.\n\nAnd perhaps the most visible symbol allowing Miami to flex its crypto bragging rights was the announcement in March of 2021 by Miami-Dade County that it had sold naming rights for its main sports arena – home of the beloved Miami Heat NBA franchise – to FTX, the now bankrupt cryptocurrency exchange founded by disgraced crypto entrepreneur Sam Bankman-Fried.\n\nThat partnership, which is not even two years old, came to an unhappy end last week. On Wednesday, the beleaguered company and Miami’s local government finalized an agreement to terminate the deal and remove the now tarnished FTX logo from the sports venue.\n\nOver the past few months, as the scale of Bankman-Fried’s alleged fraud became clear, some city elders and the business community scrambled to unwind what many of us had suspected from the start was a simply terrible business deal. Bankman-Fried, who has maintained his innocence, pleaded not guilty to federal fraud charges during a court appearance in New York earlier this month.\n\nWe now know just what a fiasco Miami’s love affair with crypto has been. The financial costs of last year’s crypto crash have been enormous for the many thousands of investors who invested – and then lost funds they could ill afford to forgo.\n\nBut my own reservations were not rooted in certain knowledge that crypto would crumble, although its collapse was far swifter and more spectacular than even most skeptics anticipated.\n\nMy opposition to crypto is based on its deleterious effects on the environment. The fact that Miami, considered “the most vulnerable major coastal city in the world,” would go all in for a currency created by a climate-wrecking technology always seemed to me to be a particular kind of madness.\n\nMany people don’t understand how a currency that exists largely in the digital space can have real-life destructive impacts on our environment. Bitcoin mining uses vast amounts of resources. As the New Yorker’s Elizabeth Kolbert wrote in an April 2021 article, “bitcoin-mining operations worldwide now use … about the annual electricity consumption of the entire nation of Sweden.”\n\nCiting data scientist Alex de Vries’ Digiconomist website, Kolbert reported that “a single bitcoin transaction uses the same amount of power that the average American household consumes in a month.” Similar reporting could be found at The New York Times, The Washington Post and CNN.\n\nBitcoin mining hardware has ramped up as the cryptocurrency’s popularity has increased. Between January 1, 2016, and June 30, 2018, the mining operations for four major cryptocurrencies released an estimated three to 15 million metric tons of carbon dioxide, according to a study in the research journal Nature Sustainability.\n\nEven China, the world’s largest polluter, banned bitcoin mining in 2021, citing its high carbon emissions. Now we are in what has been called “crypto winter” after enthusiasm has plummeted for cryptocurrencies worldwide. Nevertheless, the carbon footprint of bitcoin, still the world’s most valuable digital currency, continues to be enormous.\n\nThis past September, a report from the White House Office of Science and Technology Policy found that crypto mining in the United States emits as much greenhouse gas as the nation’s railroads and cautioned that “depending on the energy intensity of the technology used, crypto-assets could hinder broader efforts to achieve net-zero carbon pollution consistent with U.S. climate commitments and goals.”\n\nBut despite all that data, Suarez remains convinced that it’s possible to produce bitcoin in an environmentally friendly way.\n\n“I’d love to sort of dispel some of the, I think, myths — I call them myths — of [crypto] mining as a not-environmentally-friendly activity,” the mayor said during his Crypto Conference, a live-streamed event held in June 2021.\n\nAnd because there are renewable-energy sources in South Florida, his argument goes, crypto miners could eventually be incentivized to stop contributing to the destruction of our planet. He has argued, in effect, that because renewable energy sources exist, miners might just in the future opt to use them. It’s an extraordinarily weak argument. It would be a wonderful outcome, if only we could interest bitcoin miners in abandoning their pursuit of cheap and dirty energy sources.\n\nBut he’s not wrong – it is entirely possible to mine bitcoin responsibly, as bitcoin’s leading competitor, ethereum, proved last year. A decentralized global network used for verifying billions of dollars of cryptocurrency transactions, ethereum in September completed a system-wide transformation known as the Merge.\n\nEssentially, ethereum moved to a mining process, known as proof of stake, that requires significantly less computing power than bitcoiners’ preferred process, proof of work. In doing so, ethereum appears to have reduced its worldwide energy consumption by more than 99%.\n\nWhile some bitcoin miners say they want their industry to go green, the majority resist calls to adopt the proof of stake system over fears it would eat into their profits. Meanwhile, residents of Miami seem torn on environmental matters. According to a survey conducted by Yale University, as well as George Mason University, they believe that local officials, and state officials, including the governor “should do more to address global warming.”\n\nBut Miami voters helped to propel a “red wave” that installed Republican supermajorities in both chambers of the Florida legislature — a body that under GOP control allows fossil-fuel companies to write its bills.\n\nResidents of Miami-Dade County this past November also voted to reelect Gov. Ron DeSantis, who has said that while he doesn’t consider himself a “climate change denier” he hopes never to be mistaken for a “climate change believer.”\n\nAnd despite everything that has happened with the digital currency’s plummeting value, Suarez, who is also president of the United States Conference of Mayors, remains a bitcoin believer.\n\nGet our free weekly newsletter Sign up for CNN Opinion’s newsletter. Join us on Twitter and Facebook\n\nMiami-Dade County will once again play host later this year to Bitcoin 2023, the next installment of the annual conference. And Suarez told a Miami TV station that he continues to receive his government salary in bitcoin, as he has since November 2021.\n\nSome dreams, it would seem, die hard."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vZGFpbHljb2luLmNvbS82LWNyeXB0by1jb25zcGlyYWN5LXRoZW9yaWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "6 Biggest Conspiracy Theories About Crypto - DailyCoin",
        "content": "In the beginning, Bitcoin was one whole protocol and wasn’t divided in any way. But as the network expanded and demand from the market piled on it, the Bitcoin development team began to notice certain things.\n\nThe first thing that the community noticed was that Bitcoin went through transactions slowly. The network cannot process more than five to seven transactions per second. While that wasn’t a massive issue in the earlier days, it soon became a huge problem.\n\nThere was no way Bitcoin would compete with the likes of Visa and MasterCard if it took days for transactions on the network to be approved.\n\nThe solution proposed by some to solve this problem was to create a hard fork. This meant that the protocols running the Bitcoin network would change, and a fundamentally different network would be created. This new network would be quicker and faster than the regular Bitcoin, making adoption easier.\n\nHowever, this proposal created a huge rift in the crypto ecosystem. A group of developers, Bitcoin activists, and Chinese miners supported Bitcoin, while others preferred a smaller block limit for Bitcoin, keeping it roughly at the same speed.\n\nThis disagreement turned into a hard fork on the Bitcoin network. The new chain arriving from the fork was Bitcoin Cash, and the two communities separated. Since then, the value of Bitcoin Cash has fallen drastically while the value of Bitcoin has risen dramatically.\n\nAccording to a few people, Blockstream, one of the biggest companies in the crypto ecosystem, was behind the failed fork. These theorists claim that Blockstream put its weight behind the original Bitcoin network because it didn’t want to create a scalable Bitcoin protocol. The theorists claim that Blockstream did this because it wanted to retain control over Bitcoin and stop it from going mainstream."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1zdXJnZS1zb2xhbmEteHJwL9IBQGh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1zdXJnZS1zb2xhbmEteHJwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ether little changed after weekend surge; Solana, XRP give back some gains - Forkast News",
        "content": "Bitcoin and Ether prices were little changed in Monday morning trading in Asia. Several of the top 10 non-stablecoin cryptocurrencies took a breather after strong gains over the weekend on the back of signs inflation may have peaked in the U.S., leading investors to bet the Federal Reserve may begin to ease back on increases in interest rates.\n\nSee related article: Bitcoin price rebounds as U.S. inflation cools\n\nFast facts\n\nBitcoin dipped 0.4% to US$20,882 in the 24 hours to 8 a.m. in Hong Kong but is up 22% over the past calendar week. The world’s largest cryptocurrency also breached US$21,000 for the first time since the collapse of the FTX crypto exchange in early November, reaching as high as US$21,075 on Saturday. Ether added 0.2% to US$1,552 for a 20.5% gain on the week, according to CoinMarketCap.\n\nSolana fell 5.6% to change hands at US$22.89, posting the biggest loss on CoinMarketCap’s top 10 list by capitalization. Still, Solana is the best-performer on the list for 2023 so far, up 58.2% over the week. The token has bounced back after it was sold off by FTX brokerage arm Alameda Research to try and raise funds to stave off the collapse of the companies.\n\nXRP fell 2.7% to trade at US$0.38, but is up 11.5% for the week. XRP saw more modest gains than most other major cryptos as the court case between the U.S. Securities and Exchange Commission and Ripple Labs Inc., which uses XRP in its payment network, clouds the token’s prospects.\n\nThe total crypto market capitalization over the 24 hours fell 0.13% to US$979.6 billion, while trading volume slid 43.1% to US$47.1 billion.\n\nU.S. equities rose on Friday. The Dow Jones Industrial Average added 0.3%, the S&P 500 Index gained 0.4% and the Nasdaq Composite Index finished the day 0.7% higher. U.S. markets are closed today for the Martin Luther King public holiday\n\nDecember’s U.S. Consumer Price Index (CPI) released last week showed that inflation rose 6.5% year-on-year, in line with expectations and lower than the 7.1% recorded in November. The drop was the biggest monthly decline since April 2020.\n\nLast month, the Fed raised interest rates by 50-basis points to between 4.25% and 4.5%, the highest in 15 years. It had raised rates by 75 basis-points for the prior four consecutive meetings to curb inflation. Fed Chair Jerome Powell has warned of more rate increases in 2023.\n\nThe next Fed meeting will be held from Jan. 31 to Feb. 1, with anlysts at the CME Group predicting a 94.2% chance of an increase of 25 basis points given the most recent CPI data.\n\nSee related article:Alameda liquidators get liquidated while consolidating funds on DeFi lending platform Aave"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtY2FuY2Vscy1mdHgtbG9zc2VzLTUtdGhpbmdzLXRvLWtub3ctaW4tYml0Y29pbi10aGlzLXdlZWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "BTC price cancels FTX losses — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a new week at new 2023 highs, but still divides opinion after a blistering price rally.\n\nIn what is shaping up to be the antidote to last year’s slow bleed to lower prices, January has delivered the volatility Bitcoin bulls were hoping for — but can they sustain it?\n\nThis is the key question for market participants going into the third week of the month.\n\nOpinion remains divided on Bitcoin’s fundamental strength; some believe outright that the march to two-month highs is a “sucker’s rally,” while others are hoping that the good times will continue — at least for the time being.\n\nBeyond market dynamics, there is no shortage of potential catalysts waiting to assert themselves on sentiment.\n\nUnited States economic data will keep coming, while corporate earnings could deliver some fresh volatility to stock markets this week.\n\nCointelegraph takes a look at five potential BTC price movers as all eyes focus on new support levels and the fate of the Bitcoin bear market.\n\nBTC price due consolidation, analysts agree\n\nBitcoin has faced increasing skepticism after passing some key resistance levels throughout the past week.\n\nAs Cointelegraph reported, the consensus remains skewed to the bearish side long term, with few believing that current momentum will end up any more than a bear market rally.\n\nWith warnings of new macro lows of $12,000 still in force, analysts are watching for signs of a comedown. So far, however, this has not materialized.\n\nThe weekly close tied with those from just before the FTX collapse, with BTC/USD still above $20,000 at the time of writing, having hit new local highs of $21,411 overnight, data from Cointelegraph Markets Pro and TradingView showed.\n\nVolatility remained in action, with moves of several hundred dollars commonplace on hourly timeframes. A flash dip below the $21,000 mark was described by commentator Tedtalksmacro as a “liquidity hunt.”\n\nAnalyzing levels to hold in the event of a broader retracement, on-chain analytics resource, Material Indicators identified the 21-week moving average (MA) at $18,600.\n\n“Another $11M bid wall placed to defend the Bitcoin 2017 Top,” it noted alongside an additional chart of the Binance order book.\n\n“Holding above that level is symbolic and increases the probability of extending the rally, but IMO holding the 21-Week MA is critical for a sustained rally. TradFi is closed Monday for MLK Day. Volatility continues.”\n\nBTC/USD 1-day candle chart (Bitstamp) with 21-week MA. Source: TradingView\n\nA previous post added that whale activity was indeed helping to buoy the market on exchanges.\n\nEyeing the reversal of FTX losses, meanwhile, trading account Stockmoney Lizards called for “a little (sideways) consolidation” at current levels.\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, said that Bitcoin might indeed consolidate due to changes in flagging United States dollar strength.\n\nThe U.S. Dollar Index still traded near its lowest levels since early June 2022 on the day, having hit 107.77.\n\nU.S. Dollar Index (DXY) 1-day candle chart. Source: TradingView\n\nFocus shifts to earnings as stocks catalyst\n\nThis week will get off to a brisk start in terms of macro data, with producer price inflation data coming on Jan. 18.\n\nThis will come amid various speeches from Federal Reserve officials, while stocks will likely be swayed by another phenomenon in the form of corporate earnings reporting throughout the week.\n\nAs noted by Bank of America strategists in a note last week, the S&P 500 has become particularly sensitive to earnings reports, with their impact overtaking classic data releases such as the Consumer Price Index.\n\n“We see this as a narrative shift in the market from the Fed and inflation to earnings: reactions to earnings have been increasing, while reactions to inflation data and FOMC meetings have been getting smaller,” they wrote, quoted by media outlets including CNBC.\n\nThe strategists referred to the Federal Open Market Committee (FOMC) meeting on Feb. 1 to decide on interest rate hikes.\n\nThe rate hike is currently expected to be lower than any since early 2022, with sentiment favoring a 0.25% increase, according to CME Group’s FedWatch Tool.\n\nFed target rate probabilities chart. Source: CME Group\n\n“The lower the Fed Funds, the more liquidity there is in the system,” Ram Ahluwalia, CEO of digital asset investment advisor Lumida Wealth Management, wrote last week.\n\nAn accompanying chart showed what Ahluwalia suggested was a beneficial relationship between lower Fed funds rates and Bitcoin liquidity.\n\nHe continued by referencing an appearance on mainstream media by veteran economist Larry Summers on Jan. 13, in which the latter made positive noises about inflation abating.\n\n“Larry made a statement saying the Fed’s fight against inflation is ‘much, much closer to being done.’ This is a ‘positive surprise’ to risk assets and supports the Fed pivot camp,” he argued.\n\n“BTC benefits from QE Hypothesis: One of the big macro desks listened and went long bitcoin.”\n\nBitcoin vs. Fed funds rate chart. Source: Ram Ahluwalia/ Twitter\n\nGBTC winning streak continues\n\nOn the topic of institutional interest recovery, another chart retracing the entirety of its FTX losses is the largest Bitcoin institutional investment vehicle, the Grayscale Bitcoin Trust (GBTC).\n\nData from Coinglass shows that as of Jan. 13, the latest date for which data is available, GBTC shares traded at a discount to the net asset value of 36.26%.\n\nThis discount, formerly positive and known as the “GBTC premium,” has been ticking higher since the end of December 2022 and is now higher than at any point since the FTX meltdown.\n\nIts largest-ever reading came just before that, when it hit 48.62%, with GBTC suffering as part of parent company Digital Currency Group’s own FTX troubles.\n\nThat controversy continues to rage, often publicly, but GBTC is delivering its most encouraging results in months.\n\nBehind the scenes, Grayscale continues to battle U.S. regulators over their refusal to allow it to convert GBTC to an exchange-traded fund (ETF) based on the Bitcoin spot price.\n\nIn an extensive Twitter update on Jan. 13, Craig Salm, Grayscale’s chief legal officer, referenced the firm’s “commitment” to win its case and bring the first spot Bitcoin ETF to the market in the U.S.\n\n“To reiterate, converting GBTC to a spot Bitcoin ETF is the best long-term way for it to track the value of its BTC,” he summarized.\n\n“Our case is moving forward swiftly, we have strong, common sense and compelling legal arguments and we’re optimistic that the Court should rule in our favor.”\n\nGBTC premium vs. asset holdings vs. BTC/USD chart. Source: Coinglass\n\nDifficulty hits new all-time high\n\nIf Bitcoin’s price recovery were not enough to get bulls excited, its network fundamentals tell a similarly encouraging story.\n\nRoughly in step with the weekly close, network mining difficulty increased by over 10%, marking its biggest uptick since October 2022.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\nThe move has obvious implications for Bitcoin miners and suggests that the ecosystem already benefits from higher prices.\n\nAs Cointelegraph reported, miners had already been slowing the pace of their BTC reserve sales in recent weeks. At the same time, the difficulty increase reflects competition for block subsidies returning to the sector.\n\nOver the past week, however, miner balances have decreased in response to Bitcoin’s rapid price rise. They stood at 1,823,097 BTC as of Jan. 16, data from on-chain analytics firm Glassnode shows, marking one-month lows.\n\nBitcoin miner BTC balance chart. Source: Glassnode\n\nDespite this, miner difficulty has now erased its FTX reactions and set a new all-time high in the process.\n\n“Bitcoin is in the process of retesting the estimated average cost of production price for Miners,” Glassnode additionally noted last week before most of the gains came.\n\nIt added that “breaking above this level like offers much needed relief to miner incomes.”\n\nAn accompanying chart showed its proprietary “difficulty regression model,” which it describes as “an estimated all-in-sustaining cost of production for Bitcoin.”\n\nBitcoin difficulty regression model chart. Source: Glassnode\n\nSentiment exits \"fear\" as whales buy big\n\nIt is no secret that the average Bitcoin hodler is experiencing some much-needed relief this month, but is it a case of unchecked euphoria?\n\nRelated: 5 altcoins that could breakout if Bitcoin price stays bullish\n\nAccording to the time-honored yardstick, the Crypto Fear & Greed Index, it could be “too much, too soon” regarding changes in the mood over Bitcoin price strength.\n\nOn Jan. 15, the Index hit its highest level since April 2022. While not “greedy” yet, the move marks a significant change from just weeks prior.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nThe crypto market spent a large swathe of 2022 in its lowest “extreme fear” bracket.\n\nNow, it is scoring above 50/100, dropping slightly into the new week to remain in “neutral” territory.\n\nFor research firm Santiment, which specializes in gauging the atmosphere around crypto markets, there is one overriding factor influencing Bitcoin’s newfound strength.\n\nThe answer, it wrote in a Twitter post at the weekend, lies firmly in whale activity.\n\nOver the ten days to Jan. 15, big and small whales added to their positions, sparking a supply and demand chain reaction. In total, over that period, they purchased 209,700 BTC.\n\nSantiment called the data “a definitive explanation on why crypto prices have bounced.”\n\nBTC accumulation annotated chart. Source: Santiment/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaG93LWktaW50cm9kdWNlZC1teS15b3VuZ2VyLXNpc3Rlci10by1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "How I Introduced My Younger Sister To Bitcoin - Nasdaq",
        "content": "For my sister’s eighteenth birthday, I gave her the gift of bitcoin and some lessons on becoming a sovereign individual.\n\nThis is an opinion editorial by Santiago Varela, a bitcoin miner and writer from Mexico City.\n\nMy sister turned 18 years old in the beginning of 2023 and I gave her a very unusual gift during this holiday season. Because I love her, I truly believe that the best gift I can give her is the orange pill.\n\nIt all started with a letter that I wrote for her explaining the gift I was about to give her. Then, I handed her a copy of “The Bitcoin Standard” by Saifedean Ammous and a hardware wallet. However, that was just the beginning of a long process that we had to go through together if I really wanted to orange pill her.\n\nOf course, I was well aware that her first reaction to my surprise wasn't going to include the typical face of an 18-year-old girl opening her presents on a joyful Christmas morning. At first, she seemed more confused than excited. I have no doubt that she was expecting some nice pair of shoes or a cool gadget. I'm sorry sis, but that's how we maximalists roll.\n\nIn the birthday/holiday letter, I pointed out three reasons why I was giving her this specific gift:\n\nI want to set her on the path to financial freedom I want her to be a sovereign woman in a fiat world where dishonest relationships have been normalized As a high school senior who doesn't know what she wants to study in college, she could benefit from Bitcoin which might give her some ideas for what she wants to do\n\nThe long process of orange pilling my sister began with a quote from the prologue of “The Bitcoin Standard,” which I consider the perfect starting point. I asked her to read this quote over and over again before beginning the orange-pilling journey:\n\n“This book does not offerinvestment advice but aims at helping elucidate the economic properties of the network and its operation, to provide readers an informed understanding of bitcoin before deciding whether they want to use it. Only with such an understanding, and only after extensive and thorough research into the practical operational aspects of owning and storing bitcoins, should anyone consider holding value in bitcoin. While bitcoin´s rise in market value may make it appear like a no-brainer as an investment, a closer look at the myriad hacks, attacks, scams, and security failures that have cost people their bitcoins provides a sobering warning to anyone who thinks that owning bitcoins provides a guaranteed profit. Should you come out of reading this book thinking that the bitcoin currency is something worth owning, your first investment should not be in buying bitcoins, but in time spent understanding how to buy, store, and own bitcoins securely. It is the inherent nature of bitcoin that such knowledge cannot be delegated or outsourced. There is no alternative to personal responsibility for anyone interested in using this network, and that is the real investment that needs to be made to get into bitcoin.”\n\nIn the letter, I told her that I would help her set up the hardware wallet and I would send her a little bit of bitcoin. To begin, I sent her $10 worth of bitcoin. But then, to make sure that she invested time into acquiring the basic, necessary knowledge and to make her understand the proof-of-work philosophy, I promised that I would send her $100 worth of bitcoin for every chapter of the book that she read. Therefore, I prepared a quiz for each chapter to verify that she really read carefully.\n\nHowever, as someone who is deep down the Bitcoin rabbit hole, I knew that making her read the book to stack sats on her hardware wallet wasn't enough. That was nothing, we were just getting started. So, what was next in the orange-pilling journey? Every time that I crossed by any opportunity, I tried to convert that moment into a little Bitcoin lesson.\n\nFor example, there was such an opportunity after my sister was assigned a project in her high school philosophy class. Knowing that I am a big fan of philosophy, she came to ask me for help. The project consisted of having a conversation with one of your family members but using the famous Socratic method for the conversation. If you don't know what that is, the Socratic method (named after Socrates) is “a form of cooperative argumentative dialogue between individuals, based on asking and answering questions to stimulate critical thinking and to draw out ideas and underlying presuppositions.”\n\nObviously, we had a dialogue about Bitcoin and money using the Socratic method.\n\nAnother thing I did in this orange-pilling journey was to show her a rabbit hole inside of the Bitcoin rabbit hole: bitcoin mining and energy. I love bitcoin mining and the energy aspects of Bitcoin. In fact, I love it so much that we have an ASIC in our garage. It wasn't really hard to make her grasp how passionate I am about home mining. Believe it or not, she had never even seen my ASIC (she had only heard the “brrrrrr”). Consequently, I took her to the garage and she got some hands-on experience. I also have my Bitcoin and Lightning nodes in the garage. That was a lot of fun because with tools like Mempool.Space and LnVisualizer I was able to help her see the tangible side of Bitcoin. This is when I really felt that it all began to come together.\n\nAs you all likely know, knowledge about Bitcoin can’t be delegated or outsourced. When it comes to Bitcoin, there is no alternative to personal responsibility. Although I’ve told her that I’d love to help her with anything, I can’t guide her down the rabbit hole forever. You have to go down the Bitcoin rabbit hole by yourself. I guided her for a long time but the moment for her to embark on the journey for herself is here. Like Oscar Wilde once said: “Education is an admirable thing. But it is well to remember from time to time that nothing that is worth knowing can be taught.”\n\nSo, I began treating her like any other Bitcoin pleb out there and let her go down the rabbit hole by herself. The only thing I did was to send her a bunch of resources (articles, podcasts, videos, books, etc.) and let her go her own way. At the same time, I realized that I could do this with other kids that are about the same age as my sister. Even better, I realized that my sister could help me with this and introduce her digital-native friends to Bitcoin because, if you care about Bitcoin, you should onboard people individually.\n\nAccordingly, I’ve decided to turn our garage into a little Bitcoin academy. Although my sister was the guinea pig for this experiment (and, as I am writing, she is the only student that has attended Bitcoin academy), I have to give a big shout out to other Bitcoiners around the world who have shared educational content for anyone to use. For example, Mi Primer Bitcoin (from El Salvador) has an amazing Bitcoin diploma workbook that anyone can download for free. I have no doubt that initiatives like theirs or like Escuelita Bitcoin in Uruguay are what we need if we want a future with sovereign individuals. We need to teach the young.\n\nHopefully, this inspires other Bitcoiners around the world to introduce their younger siblings to Bitcoin. I was inspired by initiatives like the ones mentioned above and by stories like the Denver middle schoolers who became Bitcoin entrepreneurs. With a little bit of luck, the next time I write an article for Bitcoin Magazine, it’ll be about Mexico City middle schoolers who became Bitcoin entrepreneurs. For now, stay humble and stack sats my friends.\n\nThis is a guest post by Santiago Varela. Opinions expressed are entirely their own and do not necessarily reflect those of BTC Inc or Bitcoin Magazine.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXZzLWV0aGVyZXVtLWNvbW11bml0eS1zcGxpdC1iZXR3ZWVuLWNhcHBlZC1zdXBwbHktYW5kLWRlZmxhdGlvbmFyeS1tb2RlbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum: Community split between capped supply and deflationary model - Cointelegraph",
        "content": "Bitcoin (BTC) and Ether (ETH), the top two cryptocurrencies by market capitalization, have always been pitted against each other. With the start of the new year, the first debate has surfaced comparing BTC’s capped supply of 21 million to ETH’s deflationary supply, with disagreement over which of the two qualifies as sound money.\n\nAn Ethereum-focused Twitter user called ‘ultra sound money’ compared the supply issuance of both cryptocurrencies and suggested that “if capped-supply BTC is sound then decreasing-supply ETH is ultrasound.”\n\nif capped-supply BTC is sound\n\n\n\ndecreasing-supply ETH is ultra sound pic.twitter.com/L2tsFzPQ7q — ultra sound money (@ultrasoundmoney) January 15, 2023\n\nThe comparison between the two didn’t sit well with BTC proponents, who quickly pointed out that soundness comes from the credibility of the monetary policy and not an ever-changing one. Dan Held, a famous Bitcoin proponent, pointed out the flaw in the argument and noted that a constantly changing one has less credibility. He said:\n\n“Time builds trust with humans, it’s not all about code. According to your logic, if we spun up another crypto with more deflation, that would be “sounder.”\n\nAnother Bitcoin proponent questioned the credibility of Ethereum’s monetary policy, reminding that the same monetary policy has “changed a least 11 times in its seven years of existence.” On the other hand, Bitcoin has not changed its monetary policy once.\n\nEther's historical projected issuance rate. Source: ethhub.io\n\nEther became deflationary in August 2021 with the introduction of Ethereum improvement proposal-1559 (EIP-1559). The upgrade introduced a burn mechanism that automatically burns a portion of the transaction fee, decreasing the overall circulating supply of ETH.\n\nIn response to Alex Gladstein’s argument that “admins” can arbitrarily change Ethereum’s monetary policy, independent Ethereum educator Anthony Sassano claimed that every change on the Ethereum network had been approved by the thousands of node operators run by community members.\n\nThe term \"admins\" implies that there is a small group with superuser powers that can change things on Ethereum which is completely false and has been proven false many times.\n\n\n\nYou can believe what you want about the sound money vs ultra sound money debate. — sassal.eth (@sassal0x) January 16, 2023\n\nLeo Glisic, the founder of the Maitri network, said that ETH had become sound money now, but BTC won’t hit its cap until the year 2140.\n\nBitcoin has faced similar monetary changes and tweaking of the original code in the past. The most notable one came during 2017 when there was a growing demand for increasing the Bitcoin block size to accommodate more transactions per block and make it more scalable.\n\nRelated: Bitcoin steps out of 'fear' for the first time in nine months\n\nThe majority of the Bitcoin community remained against making any changes to the original code of Satoshi Nakamoto. As a result, the Bitcoin network experienced a hard fork in 2017, leading to the formation of Bitcoin Cash (BCH), a cryptocurrency with a block size of 8 MB against BTC’s 1 MB. However, today, BCH has had very little on-chain development and is currently trading at a 97% price drop from its all-time high."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmludGVjaG1hZ2F6aW5lLmNvbS9jcnlwdG8vd2VmLWdyZWF0LXJlc2V0LWNvdWxkLWZhaWwtaWYtY3J5cHRvLXJlbWFpbnMtcmVndWxhdGVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "WEF Great Reset could fail if crypto remains unregulated - FinTech Magazine",
        "content": "The World Economic Forum's (WEF) Great Reset agenda will be under threat - and could “spectacularly fail”, if cryptocurrency markets are not reigned in through government regulatory frameworks, warned Nigel Green, of the deVere Group.\n\nThe WEF's 2023 annual meetup at Davos (which starts today in Switzerland) will not succeed unless it advances cryptocurrency regulation, said Green, who is the CEO and founder of one of the world’s largest financial advisory, asset management, and fintech organisations.\n\nThe WEF is returning to its traditional timeslot and conference location of Davos for the four-day event, following two years of disruption as a result of the COVID-19 pandemic.\n\nDavos is US delegate-dominated\n\nAccording to market reports, the in-person conference, which will see global leaders and heads of industry meet at the Swiss mountain resort, also coincides with Bitcoin, the world’s biggest crypto by market capitalisation, recording a staggering 28% jump in value since the beginning of January.\n\nRecords show that 2,658 attendees are registered for the event, and they include heads of state, business royalty, actual royalty, media honchos, and academics from more than 100 countries.\n\nRepresentatives from the US form the largest portion of the delegates with 27%, while two-thirds of the attendees are from 10 of the ‘more than 100’ included nations.\n\nUS crypto regulation to play a major role in Great Reset strategy\n\nThis means that regulations applied in the US will likely have the greatest impact on the success of the Great Reset strategy which aims to homogenise the global financial markets as part of its wider plans to create a one-world order, as set out by the WEF’s public Great Reset statement.\n\nOutlining its plans for a global, one-world order, it says: “The inconsistencies, inadequacies, and contradictions of multiple systems - from health and finance to energy and education, are more exposed than ever before amidst a global context of concern for lives, livelihoods, and the planet\n\n“... As we enter a unique window of opportunity to shape the recovery, this initiative will offer insights to help inform all those determining the future of state global relations, the direction of national economies the priorities of societies, the nature of business models, and the management of global commons.”\n\nMore action, less talk on crypto regulation, says deVere CEO\n\nSpeaking about the opportunities Davos presents, Green said governments must take action, rather than continue to discuss the possibility of regulation in the crypto sphere. “The leaders assembled in Davos at the WEF must next week return home to their governments who then need to insist that their financial regulators must stop ‘talking the talk’ and begin to up the ante on regulating the cryptocurrency market.\n\n“The time for endless platitudes on greater regulatory scrutiny is over. Action is required.\n\n“Should those in attendance at the WEF not advance the agenda of crypto regulation as a result of the 2023 summit, they will have spectacularly failed.”\n\nGreen also cited three reasons why crypto needs further regulations, saying institutional adoption of crypto can only be successful if there is greater trust in the space, and it is less volatile. He also called for crypto be, “brought into the regulatory tent and held to the same standards as the rest of the system.”\n\nThe second reason Green gave related to incidents of fraud. “After a year of significant crypto firm collapses, accusations of top-level fraud, and prison sentences for insider trading, there’s no denying that greater scrutiny would help protect investors.”\n\nAnd finally, he mentioned that regulation would provide a; “potential long-term, a sustainable economic boost to those countries which introduce it as crypto is widely regarded as the future of finance.”\n\nWhat is needed now, says Nigel Green, is a workable internationally agreed and recognised regulatory framework that “is sensible and doesn’t hamper innovation or compromise the inherent nature of the digital assets and market.”\n\nHe concluded: “Cryptocurrencies are here to stay and the market is only set to grow exponentially.\n\n"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL3dvcmxkL3Bob3Rvcy1taXNzLXVuaXZlcnNlLWNvbnRlc3RhbnQtZG9ucy1nb2xkZW4tYml0Y29pbi1vdXRmaXQtMTE2NzM3NTc3MTQ2NjguaHRtbNIBdmh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL3dvcmxkL3Bob3Rvcy1taXNzLXVuaXZlcnNlLWNvbnRlc3RhbnQtZG9ucy1nb2xkZW4tYml0Y29pbi1vdXRmaXQvYW1wLTExNjczNzU3NzE0NjY4Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Photos | Miss Universe contestant dons golden ‘bitcoin outfit’ | Mint - Mint",
        "content": "Miss Universe Alejandra Guajardo's blingy golden dress has caught the attention of the online Bitcoin community.\n\nThe actress and model donned an outfit that feature bitcoin cryptocurrency as she strutted onto the stage at a beauty pageant.\n\nGuajardo, the Salvadoran beauty queen was seen in a bitcoin-inspired gold bodysuit, a glittering tribute to her country becoming the world's first to adopt the cryptocurrency as legal tender two years ago.\n\nIn her Instagram post, the Miss Universe wrote her homeland as \"a country with a true vision of positive change for the future\" while pointing to the government's much-criticized decision to adopt bitcoin as legal currency in 2021 alongside the US dollar.\n\nHer blingy dress is designed by Francisco Guerrero. Guajardo wore this dress during the 71st Miss Universe National Costume Show at the Ernst N. Morial Convention Center in New Orleans, Louisiana, US.\n\nView Full Image Alejandra Guajardo, Miss Universe El Salvador 2022 (via REUTERS)\n\nThe currency-themed outfit includes a staff topped with a golden bitcoin and a huge colon coin strapped to her back ringed by cacao beans.\n\nThe colon was the local currency for about a century ending in 2021 when the US dollar was adopted; in ancient times cacao was used as money across mesoamerica.\n\nView Full Image Alejandra Guajardo, Miss Universe El Salvador 2022 poses on stage in an outfit inspired by the country's use of Bitcoin (via REUTERS)\n\nRecently, El Salvador's legislative assembly approved a digital assets law aimed at legally protecting transfers or debt issues with cryptocurrencies.\n\nEl Salvador was the first country to adopt bitcoin as a legal currency in September 2021, using it along with the US dollar, which it adopted as its currency in 2001.\n\nThe new law paves the way for the acquisition of $1 billion in \"crypto bonds\" or \"volcano bonds.\"\n\nBitcoin surged over $21,000 on Saturday amid optimism that it may have bottomed and inflation has peaked.\n\nThe largest cryptocurrency rose as much as 7.5% to $21,299, before paring gains as the day progressed. It hadn’t been above $20,000 since 8 November 2022.\n\nSecond-largest token Ether surged as much as 9.7%, and others such as Cardano and Dogecoin also notched gains. Solana soared as much as 35%.\n\nThe overall market cap of the crypto universe rose above $1 trillion for the first time since early November, according to data from CoinGecko.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tbWluaW5nLWRpZmZpY3VsdHktcm9zZS0xMC1oaXRzLW5ldy1hdGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining difficulty rose 10%, hits new ATH - CryptoSlate",
        "content": "Bitcoin (BTC) mining difficulty rose 10% to a new all-time high of 37.59 T from 34.09 T on Jan. 15\n\nThe difficulty increase is the largest seen since October 2022, according to Bitrawr data.\n\nThe significant rise on Jan. 15 exceeded almost all of the network’s difficulty increases in 2022 — only surpassed in October 2022 when mining difficulty jumped 13.55%.\n\nMining difficulty describes how difficult it gets to solve the cryptographic puzzle necessary to create a block on the Bitcoin network and adjusts every two weeks (2,016 blocks).\n\nSince the blockchain’s last difficulty adjustment on Jan. 3, BTC’s price surged 27% to trade above $21,000 for the first time since FTX collapsed in early November 2022. Several analysts suggested that the uptick meant bullish momentum was returning to the flagship digital asset after the record low it traded in 2022.\n\nThe next mining difficulty change is expected to occur between Jan. 27 and Jan. 29 and will likely rise by as much as 25%, according to Bitrawr.\n\nMentioned in this article"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vcHJvdG9zLmNvbS9leHBsYWluZWQtZWwtc2FsdmFkb3JzLWNvbnRlbnRpb3VzLWJpdGNvaW4tYmFja2VkLXZvbGNhbm8tYm9uZHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Explained: El Salvador's contentious bitcoin-backed Volcano Bonds - Protos",
        "content": "Listen to this article.\n\nLast week, El Salvador moved one step closer to issuing its contentious bitcoin-backed ‘Volcano Bonds.’ The country’s Legislative Assembly passed a legal framework for issuing blockchain-based digital securities, including provisions that allow businesses to deal in digital assets other than bitcoin.\n\n62 of its members voted in favor of this new Digital Assets Issuance Law on January 11. However, El Salvadoran president Nayib Bukele initially planned to issue the bonds as early as March 2022.\n\nBukele’s regime has postponed the bonds’ issuance several times, partly due to last year’s poor digital asset markets, but also because of more pressing issues, such as a nationwide crackdown on gangs — by September, mass arrests had incarcerated a staggering 2% of all adult males residing in the country.\n\nSince the president made bitcoin legal tender in 2021, he’s struggled to prove the move makes any kind of sense for the country — El Salvador has sparred with major international players in the financial industry, like the International Monetary Fund.\n\nMiss El Salvador wearing #bitcoin at Miss Universe pageant pic.twitter.com/zDnQwhJQTq — Documenting ₿itcoin 📄 (@DocumentingBTC) January 12, 2023 Bukele has found a new outlet for shilling bitcoin in the Miss Universe pageant, which El Salvador will host next year.\n\nIndeed, the country holds 2,300 bitcoin and is significantly underwater on its average purchase price. In November, Bukele was estimated to have lost $65 million on bitcoin purchases — a loss of 61%. That same month, he announced a plan to buy one bitcoin a day for an indeterminate amount of time.\n\nWith the passage of the country’s new Digital Assets Issuance Law, El Salvador is one step closer toward finally being ready to sell its Volcano Bonds for some bitcoin and USD — but especially, Tether.\n\nHere’s what you need to know.\n\nVolcano Bonds are coming, whether Salvadorans want them or not\n\nBukele has a way of getting what he wants. He unilaterally altered the constitution so that he could remain president longer than was previously legal. The military has been deployed by Bukele to force legislators to pass his laws.\n\nEl Salvador didn’t have a solid legal framework for issuing debt with digital assets until the legislative branch introduced a bill in November. It passed earlier this week.\n\nThe bill adds a National Digital Assets Commission to Bukele’s previously established National Bitcoin Office, in order to manage regulation of private participants in the digital asset industry. It also creates a Bitcoin Fund Management Agency to manage funds raised through El Salvador’s public offerings of digital assets.\n\n#Plenaria90✍🏻 Con 62 votos a favor, creamos la Ley de Emisión de Activos Digitales. pic.twitter.com/g1poXwLoH3 — Asamblea Legislativa 🇸🇻 (@AsambleaSV) January 11, 2023 El Salvador’s regime-controlled, overwhelmingly one-sided legislature ‘passes’ a new law.\n\nBukele plans to raise up to $1 billion with the Volcano Bond. He says his administration will use the proceeds to pay down sovereign debt, invest in bitcoin mining infrastructure, buy bitcoin, and build ‘Bitcoin City.’\n\nRead more: El Salvador may be broke but it’s still throwing $200M at Bitcoin Beach\n\nBitcoin City: Waypoint along China’s Belt and Road\n\nIf ever realized, Bitcoin City will reside on the Gulf of Fonseca on the southern coast of El Salvador. The entire project is a recycled version of a Chinese ZEDES project. The city will feature a friendly regulatory and tax regime for digital asset businesses interested in doing business in El Salvador.\n\nRenderings for Bitcoin City were carelessly plagiarized without attribution. They were redrawn over maps of Central City from the manga series Fullmetal Alchemist.\n\nThe Bukele administration plans to use the nearby Conchagua volcano to power bitcoin mining with geothermal energy. Proceeds from the volcanic mining will back the new bonds, hence the name, ‘Volcano Bonds.’\n\nPlans for El Salvador’s ‘Bitcoin City’ shown on the left; Fullmetal Alchemist’s Central City on the right.\n\nThat said, geothermal experts have expressed doubt regarding the economic viability of the Conchagua volcano for geothermal power production. Despite years of the volcano’s existence with every opportunity for power infrastructure development, as of December 2019, El Salvador still imported one-fifth of its electricity.\n\nMoreover, industrial electricity in El Salvador is still prohibitively expensive for bitcoin mining, averaging 13-15 cents per kWh. For years, China and Kazakhstan sold industrial electricity contracts for bitcoin mining below 5 cents per kWh.\n\nBitfinex ensures that Tether will be accepted as a funding source\n\nIn Bitfinex’s statement on the Digital Assets Issuance Law, it expected the use of renewable geothermal energy to attract investors interested in Environmental, Social, and Governance (ESG) investing. Environmentalists have frequently criticized Bitcoin’s energy usage despite a report indicating that more than half the energy used for bitcoin mining comes from sustainable sources.\n\nRead more: Opinion: Bitfinex goes full fascist\n\nControversial digital asset exchange Bitfinex will provide infrastructure services for the Volcano Bond. It refers to the bond as a ‘Volcano Token,’ indicating that it expects the bond to exist as a digital token on a blockchain. Volcano Bonds will accept funding denominations in bitcoin, USD, and — critically — Tether.\n\nIt looks as if El Salvador’s Volcano Bonds will be a great way to whitewash Tethers by swapping them for a government-approved debt issuance.\n\nFor more informed news, follow us on Twitter and Google News or listen to our investigative podcast Innovated: Blockchain City."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJyZWFrb3V0LW9yLWJ1bGwtdHJhcC01ay10d2l0dGVyLXVzZXJzLXdlaWdoLWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price breakout or bull trap? 5K Twitter users weigh in - Cointelegraph",
        "content": "Bitcoin (BTC) is trading at its highest levels in over two months, but the phrase on every trader’s lips is “bull trap.”\n\nAfter delivering 25% returns in a single week, BTC/USD remains under suspicion among Bitcoin bear market survivors.\n\nBitcoin bull trap fails to convince\n\nIt has been called the “biggest bull trap” ever seen, and despite holding above $20,000, BTC price action is fooling no one.\n\nThis week, with Wall Street closed until Jan. 17, out-of-hours trading continues to support higher levels, but faith in these staying around for long is hard to find.\n\nFor those who observed drop after drop throughout 2022, culminating in the FTX scandal, it appears simply too good to be true that Bitcoin will now flip bullish.\n\nThat is the current result of Cointelegraph’s dedicated Twitter survey asking market participants and other Twitter users whether the latest bull run has legs.\n\nAt the time of writing, only 38.6% of over 5,000 respondents believe it does, with the majority agreeing that $21,000 BTC/USD is a “bull trap.”\n\nA bull run or bull trap? — Cointelegraph (@Cointelegraph) January 16, 2023\n\nThey are far from alone.\n\n“The moment they realize this pump is just a short squeeze and not real buying, it will be too late already. Once again, the biggest bull trap I’ve ever seen,” popular account Il Capo of Crypto wrote in a debate over the weekend.\n\nSimilarly skeptical was analyst Toni Ghinea, who likewise agreed with the “bull trap” description.\n\n“People are bullish. You know what happens next,” he added, having also predicted that BTC/USD would fall to $14,000 at some point in 2023.\n\n“The very epitome of disbelief”\n\nOthers, meanwhile, are less categorical in their market appraisals but will not be drawn on the odds of the rally enduring.\n\nRelated: BTC price cancels FTX losses — 5 things to know in Bitcoin this week\n\nFellow trader Pentoshi forecasted “a decent amount of volatility and sharp moves each way imo short term” last week, while Jeff Ross, founder and CEO of Vailshire Capital Management, said that “only time will tell.”\n\n“Regime change or bull trap?” he queried as BTC/USD approached its first weekly close above the 200-day moving average in months.\n\nInvestor and entrepreneur Alistair Milne, a veteran of Bitcoin markets, nonetheless had a message for those still on the fence.\n\n“Seeing a lot of ‘I don’t trust this rally’ or ‘this is a bull trap’ or ‘why does this make me uncomfortable’ in my feed,” he tweeted at the weekend.\n\n“This is the very epitome of the ‘disbelief’ stage of a market cycle. Bitcoin bear markets end with face-melting rallies (typically a 2x from lows).”\n\nAn accompanying graphic showed the ever-popular “Wall Street Cheat Sheet,” with Milne arguing that Bitcoin was at the start of a new bull run. As Cointelegraph reported, not everyone agrees, even on this.\n\nAt the time of writing, BTC/USD traded at $20,800 on Bitstamp, data from Cointelegraph Markets Pro and TradingView showed.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9zdG9ja3MvbmV3cy9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTYtamFudWFyeS0yMDIzL2FydGljbGVzaG93Lzk3MDIwODMxLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9zdG9ja3MvbmV3cy9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTYtamFudWFyeS0yMDIzL2FtcF9hcnRpY2xlc2hvdy85NzAyMDgzMS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin above $21,000; crypto market cap nears $1 trillion - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency market was trading in the green on Monday. Bitcoin (BTC) gained 2% to trade above $21,000, whereas Ethereum (ETH) rose nearly 3% to trade above the $1500 level.BTC volume in the last 24 hours stood at approximately $21.6 billion, which is a jump of 26.86% in the last 24 hours.\"Bitcoin reached a new high of $21,000, as investors are optimistic that it may have reached its lowest point and that inflation may have peaked. This marks the first time that Bitcoin has been above $20,000 in over two months. The cryptocurrency has also seen a 26.4% increase from its low of $16,496 on January 1. Ether, the coin associated with the Ethereum blockchain network, also saw a 5.91% increase,\" Edul Patel, CEO and Co-Founder of Mudrex said.Other top crypto tokens were also trading higher on Thursday. Shiba Inu rose 6.3%. Polygon, Dogecoin, Cardano and XRP were also trading with gains.\"The crypto market cap has crossed the $1 trillion mark, thanks to an over 20% jump in Bitcoin and Ether prices in just seven days. This is a strong sign that bulls are returning to the market with US central banks successfully bringing down the inflation and saving the economy from slipping into recession. The current market momentum is expected to continue if the macroeconomic factors remain favourable,\" Shivam Thakral, CEO of BuyUcoin said.The global cryptocurrency market cap was trading higher around $993.26 billion, increasing 1.99% in the last 24 hours.The total volume in DeFi is currently $4.84 billion, 10.05% of the total crypto market 24-hour volume. The volume of all stablecoins is now $42.53 billion, which is 88.35% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, hovered around $407.4 billion, with a dominance of about 40.98%, a decrease of 0.05% over the day, according to CoinMarketCap.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 10.25 hours, IST on January 16, 2023)Bitcoin $21,150 2.13%Ethereum $1,572 3.02%Tether $1 0.02%USD Coin $1 0.01%BNB $305 2.24%XRP $0.4024 3.37%Dogecoin 0.08674 2.22%Cardano $0.3598 3.89%Polygon $1.02 5.57%Polkadot $5.98 1.48%Tron $0.05653 2.81%Litecoin $87.82 0.94%Shiba Inu $0.00001078 6.53%Solana $23.26 1.58%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tbW92ZXMtdG93YXJkLW5ldXRyYWwtc2VudGltZW50LW9uLWZlYXItZ3JlZWQtaW5kZXgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin moves toward neutral sentiment on Fear & Greed index - CryptoSlate",
        "content": "For the first time since April 2022, the Bitcoin Fear & Greed Index (FGI) has moved out of the ‘fear’ zone and into ‘neutral.’\n\nOver the weekend, Bitcoin reached a score of 52 on the index as Bitcoin pushed over $21,000.\n\nAs of press time, the score has retraced slightly to the bottom end of the ‘fear’ scale at a rating of 45. The index started the year in the ‘extreme fear’ zone, indicating that bearish sentiment had control of the market at the start of January.\n\nHowever, as Bitcoin rallied from the $15,600 to $17,200 range held throughout November and December, the FGI moved away from extreme fear.\n\nBitcoin went into free fall following the collapse of FTX. However, it appears to have recovered to pre-FTX-collapse levels within the past week. The top cryptocurrency by market cap was range bound for roughly 63 days before breaking resistance to break back above $20,000.\n\nFurthermore, while the FGI may have moved away from ‘fear,’ other global metrics have not shown a similar bullish trend. For example, Google search traffic for the term ‘Bitcoin’ is still at its lowest since December 2020.\n\nInterest by region shows El Salvador as the most interested in Bitcoin by some margin, with Nigeria following behind before a large gap before European countries such as Netherlands, Switzerland, and Austria.\n\nBitcoin is legal tender in El Salvador, while Nigeria utilizes BTC for peer-to-peer payments.\n\nNigeria recently recognized crypto as an asset class alongside its CBDC, the e-Naira. However, Paxful CEO Ray Youssef attributed the rise in Bitcoin’s popularity to Nigeria’s youth culture by stating:\n\n“Nigeria is different, the youth were all about it, they were like bring in the Bitcoin, screw everything else let’s do this.”\n\nAside from these outlier nations, interest in Bitcoin has undoubtedly waned during the bear market, and the recent rally has not led to a considerable increase in Bitcoin searches globally.\n\nAdditionally, a review of sentiment analysis for popular videos, news, and blogs related to Bitcoin showed a peak in positive sentiment on Jan. 15. However, there has been no apparent increase in either positive or negative views over the past 30 days.\n\nLooking at the historical FGI data, it is clear that Bitcoin has broken the downward trendline which started in November 2021. However, other breakouts were supported by increased interest in Bitcoin, which is not evident as of press time.\n\nPotential negative catalysts remain at the forefront of investors’ minds as Digital Currency Group has failed to publicly sure up its business. As a result, the risk of further pain in the market remains high, with many pointing to the recent price action as indicative of a bull trap.\n\nHowever, Alistair Milne, chief investment officer at Altana Digital Currency, shared a popular graph that depicts the typical investor mentality at each stage of a price cycle. In the image shown below, the final stage of a bear market is described as ‘disbelief.’\n\nFollowing the ‘disbelief’ phase, the market moves back into the bull territory.\n\nSuch images are far from 100% accurate as there is no crystal ball to predict Bitcoin’s price. However, with falling inflation and little over one year until the next Bitcoin halving, there is finally some reason to hold out hope of a faster-than-expected return to the bull cycle."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tcHJpY2UtbW92aW5nLXRvLTY1ay1oZXJlcy13aGF0LW9uLWNoYWluLWRhdGEtYW5kLWFuYWx5c3RzLXN1Z2dlc3Qv0gFjaHR0cHM6Ly9jb2luZ2FwZS5jb20vYml0Y29pbi1wcmljZS1tb3ZpbmctdG8tNjVrLWhlcmVzLXdoYXQtb24tY2hhaW4tZGF0YS1hbmQtYW5hbHlzdHMtc3VnZ2VzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Price Moving To $65K? Here’s What On-Chain Data And Analysts Suggest - CoinGape",
        "content": "Bitcoin price records a massive rally last week due to a technical breakout, as reported earlier by CoinGape. The BTC price trend was able to build momentum and surpassed the psychological level of $20K.\n\nIn the last 24 hours, the BTC price has been trading sideways after hitting a high of $21,345. However, on-chain data and analysts suggest more upside for Bitcoin. Can the BTC price rise above $65K by mid-2023?\n\nadvertisement\n\nBitcoin (BTC) Price Turns Bullish\n\nBitcoin price is trading strongly above the psychological level of $20K. However, the BTC price may witness some pullback due to the possibility of profit booking by investors.\n\nIn the daily timeframe, a breakout of the Bollinger Bands Squeeze in the last few days caused a massive rally in the Bitcoin price. As the bands are still diverging amid a rise in volatility, the BTC price will continue to move higher. However, RSI indicates a high possibility of a pullback as it hit almost 90 in the overbought zone.\n\nMoreover, a crossover of 20-EMA over 50-EMA shows a continuation of the bullish trend. Finally, bulls have taken over bears and brought a recovery across the crypto market.\n\nCrypto analysts Michael van de Poppe and Credible Crypto remain bullish on Bitcoin price. Michael van de Poppe believes the BTC price will pullback below $21K amid the bounce in the U.S. dollar index (DXY), which is currently over 102.50.\n\n“If you thought the run to 60k we had was aggressive wait till you see this 5th wave,” said Credible Crypto.\n\nMeanwhile, veteran trader Peter Brandt shared two charts, a weekly and a monthly, predicting a Bitcoin price rally to $65K in mid-2023. As per Brandt, the BTC price will hit $25K and witness a correction to $18K. Thereafter, a rally to at least $65K can be witnessed. However, he also believes that it’s difficult to predict prices in the current market conditions.\n\nOn-Chain Analysis of Bitcoin\n\nAccording to Glassnode data, Bitcoin price is following its historical pattern despite experts remaining uncertain whether historical chart patterns apply to the current cycle.\n\nBitcoin traded below the 200-daily moving average (DMA) for 386 days in the 2018-19 bear market. Considering the last week’s rally, the BTC price is back above 200-DMA after 381 days.\n\nThus, there is a high possibility that Bitcoin has bottomed out and the next cycle has started. However, investors need to consider other factors before deciding to invest in the current market conditions.\n\nAlso Read: Shibarium Beta Is About To Be Launched, Confirms Shiba Inu Team"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmZvcmJlc2luZGlhLmNvbS9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW5zLXVwdHJlbmQtcHV0cy1saWZlcy1pbnRvLW1hbnktbmVhcmRlYWQtY3J5cHRvcy84MjU4My8x0gF1aHR0cHM6Ly93d3cuZm9yYmVzaW5kaWEuY29tL2FtcC9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW5zLXVwdHJlbmQtcHV0cy1saWZlcy1pbnRvLW1hbnktbmVhcmRlYWQtY3J5cHRvcy84MjU4My8x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin's uptrend puts life into many near-dead cryptos - Forbes India",
        "content": "Image: Shutterstock\n\nThe crypto market has experienced a major decline in 2022, with most stocks losing 70-90 percent or more in value. However, due to a slight increase in the value of Bitcoin, the overall sector has seen larger gains recently. Bitcoin, currently trading at $20,800, has risen about 20 percent this week, reaching its highest point in over two months since the collapse of the FTX crypto exchange.This week, there were several stocks that experienced notable gains, with Coinbase (COIN) experiencing a 49 percent increase. Despite facing sell-side downgrades, price target cuts and a credit rating downgrade, Coinbase saw an investment from Cathie Wood's ARK Investment, which purchased $7.5 million worth of Coinbase stock this week and around $28.5 million in the last month.Coming into 2023, Bitcoin miners were looking forward to a difficult situation due to a combination of factors, including a low Bitcoin price, increasing electricity costs, high debt levels, and limited access to capital. These factors also led to financial struggles for some miners, with Core Scientific filing for bankruptcy and Argo Blockchain narrowly avoiding it after receiving financial aid from Galaxy Digital.The situation for crypto miners had become so dire that one of the major players in the industry, Riot Blockchain, decided to distance itself from the industry by changing its name to Riot Platforms in order to avoid association with crypto.Due to this ongoing situation, the recent uptrend in the price of Bitcoin means the shares of companies in the Bitcoin mining sector have seen significant increases.For example, Marathon Digital has seen a 79 percent increase in its stock this week, Hut 8 Mining has risen by 49 percent, Bit Digital has gone up 41 percent, and Riot has gained 27 percent."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vb3Zlci03MC1iaWxsaW9uLXB1bXBlZC1pbnRvLWJpdGNvaW4tdGhpcy13ZWVrLW1vcmUtYnV5aW5nLXBvd2VyLWFoZWFkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Over $70 billion pumped into Bitcoin this week; More buying power ahead? - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) has kicked off 2023 with a blast attaining several key support levels that investors will be hoping can build the base for the maiden cryptocurrency to rally further. The bullish momentum has come with investors capitalizing on the positive macroeconomic news to pump more capital into the asset.\n\nIn this line, Bitcoin has witnessed an inflow of over $73 billion within seven days amid sustained buying pressure. By the time of publishing on January 15, Bitcoin controlled a market cap of $399.1 billion, representing an increase of about 22% from $326.1 billion registered on January 8.\n\nBitcoin seven-day market cap chart. Source: CoinMarketCap\n\nIndeed, the value of Bitcoin is benefiting from the increased capital inflow, with the asset trading at $20.886, having rallied over 22% in seven days. On the weekly chart, BTC peaked above $21,000 on January 14. Notably, Bitcoin’s momentum has translated to one of the extended winning streaks for the asset in almost two years.\n\nBitcoin seven-day price chart. Source: Finbold\n\nCPI data triggers Bitcoin capital inflow\n\nBitcoin’s sustained capital inflows highlight the boost in crypto markets after the United States’ latest consumer price index (CPI) for December, which hit 6.5% on an annual basis.\n\nThe reporting has been interpreted as a sign that the Federal Reserve is winning the battle to slow down inflation. This factor translates to the possibility of risky assets like Bitcoin not facing further effects of a stiff monetary-policy tightening pressure.\n\nWith Bitcoin having witnessed bullish momentum recently and reversing the general effects of the FTX crash, investors are still wondering where the asset’s price could head next. Indeed, the main point of concern is whether the bear market is over or not.\n\nCan Bitcoin sustain recent gains?\n\nInvestors still need to observe caution, considering Bitcoin is still facing bearish sentiments that could reverse the current gains. For example, cryptocurrency entities are yet to recover from the effects of the macroeconomic environment, announcing a series of layoffs alongside the possibility of the U.S. forming a House sub-committee on cryptocurrencies.\n\nFurthermore, based on the general market mood tracked by the Fear and Greed Index, the crypto sector appears to be moving towards optimism. The index aligns with the ‘neutral’ sentiment barely a day after languishing in the ‘fear’ zone.\n\nCrypto Fear and Greed Index. Source: Alternative.me\n\nAt the same time, crypto trading expert and analyst Michaël van de Poppe pointed out that Bitcoin is still facing key events likely to impact the current rally. In a YouTube video posted on January 13, he said investors should look out for data that affect general economic health, such as retail sales.\n\nHe further warned that despite the inflation data slowing down, the Fed can still hike rates if the overall economic health is low, an element that could affect the buying power.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYmluYW5jZS1jZW8tdHJvbGxzLWNuYmNzLWNyYW1lci13aGVuLWJpdGNvaW4tcGFzc2VkLTIxa9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Binance CEO Trolls CNBC's Cramer When Bitcoin Passed $21k - BSC NEWS",
        "content": "Disclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: The content in the above article is a press release, provided by a third party. Readers should do their own research before interacting or engaging with the mentioned companies and/or any related services. BSC News is neither directly nor indirectly responsible for any damage or loss caused or alleged to be caused by or in connection with the use of any content, goods or services mentioned in the above article.\n\nDisclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: This is a paid Ask Me Anything (AMA), BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement AMA for $2000 Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the AMA.\n\nDisclaimer: This article is exclusive BSC News Premium Content. Premium content is viewable without a membership for a limited time. After the limited time period expires, readers will need to either subscribe or hold a BSC News NFT to view Premium Content. Visit the BSC News NFT website, Discord, and Twitter to learn more about becoming a Premium member.\n\nDisclaimer: The content of this piece is the opinion of the writer. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research.\n\nDisclaimer: Disclaimer: This article is written by a visiting author. Opinions herein are those of the visiting author. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm9jY3JwLm9yZy9lbi9kYWlseS8xNzI0NC1sb2NrYml0LWdhbmctdXNpbmctbXVzay1zLWludGVybmV0LXNlcnZpY2VzLWxhdW5kZXJpbmctYml0Y29pbi1pbi1ob25nLWtvbmctY2hpbmHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "LockBit Gang Using Musk's Internet Services, Laundering BitCoin in Hong Kong, China - OCCRP",
        "content": "A security strategist who spent months undercover on the darkweb published a report on Monday that offers insight into one of the world’s most notorious ransomware groups, claiming its members are using internet services owned by billionaire Elon Musk and laundering money through Hong Kong and China.\n\nLockBit’s PR stunts online have included encouraging followers on the dark web to get tattoos of the syndicate’s logo. (Photo: courtesy of Jon DiMaggio, Analyst1)Jon DiMaggio, Chief Security Strategist at threat intelligence platform Analyst1 released his findings about LockBit in a report called Ransomware Diaries: Volume 1. He said he used fake personas to communicate with members of the cybercriminal syndicate and learn more about their operations.\n\n“LockBit is, right now, by far the worst among all the ransomware gangs,” DiMaggio told OCCRP. “They have by far the highest volume of attacks, and that’s a fact. They’re running the ransomware scene.”\n\nHe explained that until now, relatively little effort has been put into profiling the actors behind such cybercriminal syndicates. “I believe this is the first publicly-available, in-depth profile of any ransomware group,” he said.\n\n“We need to get more people doing this, collecting data from the dark web, from these private channels, from the press releases on their websites. All this low-hanging fruit, it helps us better understand the adversary,” the expert said.\n\nAccording to his report, LockBit’s leadership has been interacting with the wider cybercriminal community via dark web forums and private channels under the pseudonym LockBitSupp. This persona claims the group accesses its back-end infrastructure via Starlink, a U.S. satellite internet service owned by Musk’s SpaceX, and that they primarily rely on Bitcoin exchanges located in Hong Kong and China to launder proceeds from their ransomware campaigns.\n\nThe report also reveals LockBit’s close association with several other high-profile ransomware gangs. Though these relationships remain largely adversarial, due to the increasingly competitive nature of the global market for cybercriminal services, LockBit’s leadership appear to maintain a direct line of communication with multiple other criminal syndicates – including BlackCat, Hive, REvil, and DarkSide/BlackMatter, widely believed to have been responsible for the 2021 U.S. Colonial Pipeline cyberattack.\n\n“Most of these relationships – not all, but most – started off well enough. But criminals have no ethics, so it’s usually just a matter of time before they step on each other’s toes and start pissing each other off,” DiMaggio said. “But at the end of the day, you’ve still got a lot of people who all know each other, who all run in the same circles, and who remain in communication with one another.”\n\nLockBit also has ties to the ransomware group Blackbasta, formerly Conti, who were behind a series of large-scale cyber attacks that effectively paralyzed the Costa Rican government last year. According to LockBitSupp, DiMaggio says, Blackbasta are working for the Russian government, providing direct technical support to the FSB.\n\nOCCRP previously reported how Moscow is likely to turn to cybercriminal proxies in launching future attacks against critical infrastructure in the West. In part because of the sheer scale and sophistication of Russia’s market for cybercriminal services, but also because of the “plausible deniability” afforded by such tactics.\n\nBeyond this, experts have also expressed alarm over the growing diversification of services and operational models within the cybercriminal community in recent years. The competition across this increasingly reputation-driven criminal sector is fierce, and has also created opportunities for accomplished hackers to effectively work as freelancers for multiple groups. It’s a trend keenly reflected by LockBit’s operations over the past few months, during which the group’s leadership has engaged in multiple smear campaigns against rival ransomware gangs, as well as launching several PR-stunts to promote their services and attract new blood.\n\nThe latter has included a “summer paper contest”, in which applicants were encouraged to submit academic-style papers on different hacking techniques, with the winner awarded a monetary prize. According to DiMaggio, this speaks to LockBit’s “outside-the-box” approach to raising awareness of their operations among prospective clients, as well as identifying and recruiting smart and upcoming cybercriminals, though their leaders’ showmanship has apparently attracted censure from other members of the cybercriminal community.\n\n“At the end of the day, this is a very successful person, but who’s also very arrogant and insecure,” DiMaggio says. “They play a good chess game, but there’s a growing negative sentiment among other criminals who’re tired of the ego and constant chest pounding.”"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2NyeXB0b2N1cnJlbmN5L3N0b3J5L3VzLWNvbGxlZ2Utc3RhcnRzLXRlYWNoaW5nLXN0dWRlbnRzLWFib3V0LWJpdGNvaW4tYW5kLWJsb2NrY2hhaW4taW4tY29sbGVnZXMtMjMyMjI0NS0yMDIzLTAxLTE20gGSAWh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vYW1wL2NyeXB0b2N1cnJlbmN5L3N0b3J5L3VzLWNvbGxlZ2Utc3RhcnRzLXRlYWNoaW5nLXN0dWRlbnRzLWFib3V0LWJpdGNvaW4tYW5kLWJsb2NrY2hhaW4taW4tY29sbGVnZXMtMjMyMjI0NS0yMDIzLTAxLTE2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "The US has started teaching students about Bitcoin & blockchain in colleges - India Today",
        "content": "As the global adoption of cryptocurrency rises, educational institutions have also started to incorporate crypto into their\n\ncurriculum as one of the top colleges in the US has begun teaching its students about the functioning of Bitcoin.\n\nAs per a report in Cointelegraph, Texan A&M is offering a Bitcoin course to many of its students. The announcement was made by\n\nAssociate Professor Korok Ray of Mays Business School, who will be teaching the \"Bitcoin Protocol\" course to students in the\n\nCollege of Engineering and Mays Business School.\n\nI will be teaching the first ever Bitcoin class at Texas A&M this spring! — Korok Ray (@KorokRay) January 12, 2023\n\nadvertisement\n\nRay spoke about the curriculum in a 4 part tweet thread stating that the \"Programming Bitcoin\" series will follow the Bitcoin Protocol where students will be taught how to \"build a Bitcoin library from scratch.\"\n\nWas not easy convincing committee\n\nThe professor added that it was not easy convincing the college to add the Bitcoin course to the curriculum and he had to wait for months to get the programme approved by the college's curriculum committee body. However, it is not yet certain how many students have enrolled for this course.\n\nIt has been observed that the lack of crypto knowledge is one of the biggest reasons that the public is wary of Bitcoin and other cryptocurrencies. In order for people to take crypto to the next level, high-quality crypto education needs to be incorporated into school and college curriculums. Josh Cowell, who is a crypto researcher, also believes that the introduction of such courses can improve one's financial literacy.\n\nIt is also necessary that students be taught about the legal and regulatory implications of cryptocurrencies and blockchain technologies which play a pivotal role in the understanding of the crypto industry.\n\nCrypto education in India?\n\nAruna Sharma, who is a Practioner Development Economist and Ex-Secretary General, GoI believes that \"crypto has attained a 'Ponzi' phenomenon among people who do not have exposure to what adds value to it and how it contributes to the strengthening and expansion of blockchain. Correct unbiased knowledge is the need of the day and those entrepreneurs who understand well will be able\n\nto use it effectively.\"\n\nAt the moment, there has been no push for crypto or blockchain education in India as the anti-crypto sentiment still prevails.\n\nWith the RBI also pushing for a crypto ban, will India ever get its own blockchain education programme?"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9pbmNyZWFzZWQtYml0Y29pbi13aGFsZS1hY2N1bXVsYXRpb24tY291bGQtaGF2ZS10aGlzLWltcGFjdC1vbi1idGMtaW4tcTEtMjAyMy_SAWhodHRwczovL2FtYmNyeXB0by5jb20vaW5jcmVhc2VkLWJpdGNvaW4td2hhbGUtYWNjdW11bGF0aW9uLWNvdWxkLWhhdmUtdGhpcy1pbXBhY3Qtb24tYnRjLWluLXExLTIwMjMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Increased Bitcoin whale accumulation could have this impact on BTC in Q1 2023 - AMBCrypto News",
        "content": "BTC whales intensified accumulation in the last eight weeks.\n\nOpen Interest and Funding Rates revealed that investors harbored bullish sentiments.\n\nIncreased whale activity since the commencement of the new trading year has led to a 26% growth in the price of Bitcoin [BTC], as per a 14 January tweet from Santiment.\n\n? Amongst many of the foreshadowing metrics for this 2023 breakout was the rapidly growing amount of addresses holding 100 to 1,000 $BTC. Price pumps generally occur marketwide when whales accumulate #Bitcoin. The #1 asset in #crypto is +26% in two weeks. https://t.co/JMh83m3mIu pic.twitter.com/FiRTLIc3LB — Santiment (@santimentfeed) January 14, 2023\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nBitcoin whales show their strength\n\nAccording to the on-chain data provider, the count of BTC whales holding 100 – 1,000 BTCs rallied by over 3% in the last two months. At press time, the count of this cohort stood at 14,110 whale addresses.\n\nWhen whales intensified the accumulation of a crypto asset, it often created a positive sentiment among other investors. This leads to an increase in demand for the asset, which can, in turn, drive up its prices.\n\nFurther, BTC’s Open Interest has been rallying since the year started. Per data from Coinglass, the king coin’s Open Interest has grown by 13% since 1 January 2023.\n\nOpen interest refers to the number of outstanding contracts, or positions, that have not yet been settled. An increase in open interest suggested that more traders and investors were entering trading positions on the asset. This is often regarded as a sign of increased demand for the asset, which precedes a price rally.\n\nLikewise, funding rates on the BTC network since 2023 have been positive, data from CryptoQuant showed.\n\nFor example, despite the FTX debacle in November 2022 and the consequential decline in BTC’s value, traders were undeterred and continued to take long positions.\n\nKeep this at the back of your mind\n\nCryptoQuant analyst Inspocrypto found that BTC logged the highest spot inflow on 13 January, which showed that holders of 1000 to 10,000 BTC had resumed sending their holdings to exchanges.\n\nRealistic or not, here’s BTC market cap in ETH’s terms\n\nWhile the increase in an asset’s exchange inflow is often regarded as a bearish sign, it could also mean that the asset is becoming more liquid and easier to trade, which can be positive for the market.\n\nOn where BTC’s price might go next, Inspocrypto opined,\n\n“For bulls, the range between 19k – 19.2k is key. If they break that range and maintain above, we can go further, heading 23k – 24k. Otherwise, we will retest 15.6k and trade lower levels below 15k.”\n\nFurther, on what BTC holders should expect, another CryptoQuant analyst, TariqDabil, while assessing BTC’s Adjusted Spent Output Profit Ratio (aSOPR) said,"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL3VrLWVuZ2xhbmQtbGFuY2FzaGlyZS02NDI3NDQzNdIBPWh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL3VrLWVuZ2xhbmQtbGFuY2FzaGlyZS02NDI3NDQzNS5hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin: Four jailed for Blackpool £21m cryptocurrency fraud - BBC",
        "content": "Boys, 59, from Accrington, was found guilty of converting and transferring criminal property and jailed for six years, while Caton, 45, from Blackpool, and Robinson, 24, from Fleetwood, both received sentences of four years six months in prison after being convicted of fraud, converting and acquiring criminal property."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvY3VycmVuY2llcy10by13YXRjaC1mb3ItdGhlLXdlZWstb2YtamFudWFyeS0xNi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Cryptocurrencies to watch for the week of January 16, 2023 - Finbold - Finance in Bold",
        "content": "The crypto market continues to witness a significant uptick, with Bitcoin (BTC) leading the charge after months of sideways trading. The rally is the result of a combination of positive macroeconomic news and possible easing regulatory concerns in China. However, despite the ongoing market surge, it’s important to note that the crypto space is still operating in the shadow of the massive bull run that occurred in 2021.\n\nAlthough most cryptocurrencies are trading in the green zone, specific assets remain worth monitoring due to their potential, the narrative they drive, and their potential to influence the general cryptocurrency market. Finbold has therefore reviewed the cryptocurrencies to watch for the week of January 16, 2023.\n\nGALA (GALA)\n\nThe GALA (GALA) token has benefited from the general crypto market rally and the increasing interest in blockchain games. Indeed, GALA has sustained a bullish price momentum that moved independently during periods of broad market consolidation.\n\nNotably, GALA’s rally was also aided by increased whale activity, with data from crypto analysis platform Santiment indicating that transactions helped push the token beyond resistance at $0.048. Furthermore, GALA has also recorded an influx of investors accumulating the asset with notable network partnerships.\n\nGALA is among the leading entities for a mini-altcoin rally as investors allocate more capital to the non-fungible tokens (NFT) gaming and metaverse space. At some point, GALA gained 100% in seven days leading the top 100 cryptocurrencies by market capitalization. Consequently, GALA is a cryptocurrency to watch for the next price action in the wake of significant futures liquidation.\n\nBy press time, GALA was trading at $0.05 with a daily correction of over 3%. On the weekly chart, GALA is up over 90%.\n\nGALA seven-day price chart. Source: Finbold\n\nFrom a technical analysis perspective, GALA’s daily gauges on TradingView are bullish. A summary of the gauges is for ‘buy’ at 13 while ‘moving averages‘ are 12.\n\nGALA technical analysis. Source: TradingView\n\nFetch.ai (FET)\n\nFetch.ai (FET) is an interchain protocol built on the Cosmos (ATOM) software development kit (SDK) and artificial intelligence (AI) blockchain environment. Users can create networks of autonomous economic agents within a single ledger through the protocol. Notably, FET has recorded increased interest aligning with the general market sentiment.\n\nHowever, FET has received a boost from the potential the network holds with the ongoing buzz around AI-related concepts following the initial success of ChatGPT. Indeed, interest saw FET gain by over 20% within 24 hours as the market rallied.\n\nElsewhere, the buzz around FET is partially due to the impact of network activity where the token emerged as the top gainer in Cosmos (ATOM) inter-blockchain communication (IBC) networks as of January 13.\n\nThe focus is now on whether FET will manage its momentum and continue rallying in the coming week. In this line, the possibility of rallying will partly depend on network development activity.\n\nBy the time of publishing, FET was trading at $0.23, having corrected by almost 6% in the last 24 hours.\n\nFET seven-day price chart. Source: Finbold\n\nAt the same time, the sentiment around FET offers mixed signals, with the 1-day gauges in the ‘buy’ zone at 15, while oscillators are for ‘sell’ at 4. Elsewhere, moving averages suggest a ‘strong buy’ at 13.\n\nFET technical analysis. Source: TradingView\n\nBitcoin (BTC)\n\nAfter appearing to stagnate below the $17,000 level for several weeks, Bitcoin (BTC) has embarked on a winning streak that has culminated in the maiden cryptocurrency briefly reclaiming the $21,000 level. As reported by Finbold, the ongoing BTC rally is among the longest since the 2020 pandemic period.\n\nThe rally in Bitcoin has been aided by broader optimism and an encouraging economic outlook. Initial signs of a rally emerged following encouraging signs in the United States jobs market and positive consumer-price index (CPI) data. The outcome has resulted in hopes that inflation is cooling, allowing the Federal Reserve to ease on its aggressive interest-rate hikes. Notably, the steady rally has helped Bitcoin put behind the effects of the FTX crypto exchange collapse.\n\nDespite Bitcoin having experienced long-term consolidation, new data per a Finbold report indicated that based on BTC holdings as of January 13, it could be equated to 0.5% of the global population.\n\nOverall, Bitcoin remains an asset to watch since it will be of interest to monitor if investors can consistently continue pumping money into the crypto. Indeed, the buying and selling pressure will be crucial to Bitcoin’s ability to sustain gains above $20,0000.\n\nFurthermore, the market will be watching where Bitcoin’s price moves next, with the asset still facing several headwinds. For instance, the industry is witnessing massive exchange layoffs, Gemini and Genesis legal issues, and the possible establishment of a House crypto-focused subcommittee in the United States.\n\nBy press time, Bitcoin was trading at $20,697 with daily losses of about 1.3%. On the weekly chart, BTC is up over 22%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nElsewhere, Bitcoin’s technical analysis is mainly bullish. A summary of the daily gauges on TradingView aligns with the ‘buy’ sentiment at 14, while moving averages are for the ‘strong buy’ gauge at 12. Oscillators are bearish, recommending ‘sell’ at 4.\n\nBitcoin technical analysis. Source: TradingView\n\nShiba Inu (SHIB)\n\nShiba Inu (SHIB) coin has posted an impressive performance for the past few days. At some point, the dog-themed asset reclaimed the top trending spot among cryptocurrencies. Although the meme coin is benefitting from the general market rally, the gains have been aided by sustained network development and partnerships that aim to offer SHIB more utility.\n\nFor instance, the social network Twitter recently enabled a feature allowing SHIB users to keep track of the crypto asset’s prices alongside Bitcoin, Ethereum (ETH), and Dogecoin (DOGE). At the same time, the Shiboshi Club and Bugatti Group recently revealed a collaboration focusing on an NFT mint collection.\n\nAdditionally, the SHIB community is still awaiting the release of the Shibarium layer-2 solution. Overall, SHIB remains an asset to watch if it can lead meme coins to a new rally alongside any impact if investors start taking out profits.\n\nBy press time, Shiba Inu was trading at $0.000009985 with daily losses of about 0.3%, while on the weekly chart, SHIB is up over 18%.\n\nSHIB seven-day price chart. Source: Finbold\n\nFrom a technical analysis perspective, a summary of SHIB gauges is for a ‘buy’ at 12, while moving averages align with a ‘strong buy’ at 11. Oscillators are for ‘sell’ at 3.\n\nSHIB technical analysis. Source: TradingView\n\nAvalanche (AVAX)\n\nThe layer one blockchain has seen bulls attempt to take charge in a bid to elevate the asset to previous highs. After weeks of correcting, AVAX has opened the year with a bang, drawing inspiration from the general sector sentiments.\n\nAmid the ongoing rally, the Avalanche ecosystem has recently accelerated partnerships with established entities. Some of the network development saw Avalanche partner with Amazon Web Services. Under the deal, AWS will use the Avalanche network to develop enterprise blockchain solutions for businesses and governments.\n\nIndeed, the partnership will increase Avalanche’s utility among enterprises which, in turn, could boost demand for AVAX tokens. Furthermore, as reported by Finbold, BLRD, a Japanese gaming giant GREE subsidiary, partnered with Avalanche to launch its first Web3 game in 2023.\n\nAVAX is worth monitoring for the following week based on the ability to sustain the gains and implications of the network partnerships.\n\nCurrently, AVAX is trading at $16.33, having gained by almost 40% in the last seven days. However, the token faces correction on the daily chart by over 4%.\n\nAVAX seven-day price chart. Source: Finbold\n\nFurthermore, daily sentiments for AVAX offer mixed signals. The summary of the gauges stands for ‘buy’ at 12, with moving averages recommending ‘strong buy’ at 11. Only oscillators are for ‘sell’ at 3.\n\nAVAX technical analysis. Source: TradingView\n\nIn conclusion, as the cryptocurrency market attempts to sustain the ongoing rally, the highlighted assets are worth monitoring as they will likely dictate the trajectory of different digital assets. However, the market is still facing headwinds considering the effects of macroeconomic factors are still lingering.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1hYm92ZS0yMTAwMC1ldGhlcmV1bS1zb2xhbmEteHJwLXVwLTIzMjIwNDctMjAyMy0wMS0xNtIBhAFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2FtcC9jcnlwdG9jdXJyZW5jeS9zdG9yeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tYWJvdmUtMjEwMDAtZXRoZXJldW0tc29sYW5hLXhycC11cC0yMzIyMDQ3LTIwMjMtMDEtMTY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Crypto prices today: Bitcoin above $21,000, Ethereum, Solana & XRP up - India Today",
        "content": "The prices of the top cryptocurrencies on 16 January traded in the green. The value of Bitcoin traded at $21,123.39, with an increase of 1.86 percent in the last 24 hours, with overall gains of 24 percent in the last seven days. Indeed, the value of the world's largest coin in terms of trading volume, after struggling between $16,000 to $18,000, has risen. This gain is further witnessed in Ethereum with a 2.87 percent increase to trade at $1,571.01, as per the last 24 hours.\n\nadvertisement\n\nAt the time of writing this article, the value of Polygon and Dash increased by 5.33 percent to $1.03 and 1.12 percent to $51.91, respectively. As of (1000 IST), XRP advanced by 3.48 percent to $0.403276. The value of Avalanche increased by 2.47 percent to $16.92. However, Monero's value fell by 0.04 percent to $175.54.\n\nThe value of Cardano gained 3.22 percent to $0.357985. Additionally, Solana also noticed a rise in the value by 1.20 percent to $23.21.\n\nThe global crypto market cap on Monday rose by 2.09 percent to $993.92B. On the other hand, the total crypto market volume registered a loss of 28 percent to $47.85B from the previous day.\n\nThe top gainers today were Frax Share, Decentraland, Convex Finance, and Celo. Contrastingly, Lido Dao, eCash, Zcash, and Cronos were the top losers.\n\nMeme coins garner profits\n\nAs the market traded in the green over the last 24 hours, the price of top meme coins such as Shiba Inu and Dogecoin increased. The value of the former rose by 6.17 percent to $0.000011 and the latter observed growth at 1.88 percent to $0.086430 .\n\nMetaverse tokens observe gains\n\nThe price of Decentraland marked gains of 21.66 percent to $0.694036. Similarly, The Sandbox and Axie Infinity both improved by 10.58 percent to $0.711079 and 3.33 percent to trade at $9.36, respectively."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS92aWRlb3MvdG9pLW9yaWdpbmFsL2V4cGxhaW5lZC1ob3ctc2FmZS1pcy15b3VyLWJpdGNvaW4tb24tYmluYW5jZS1hbmQtd2F6aXJ4LWFmdGVyLWZ0eC1jb2xsYXBzZS92aWRlb3Nob3cvOTcwMTI0MTEuY21z0gGeAWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL3ZpZGVvcy90b2ktb3JpZ2luYWwvZXhwbGFpbmVkLWhvdy1zYWZlLWlzLXlvdXItYml0Y29pbi1vbi1iaW5hbmNlLWFuZC13YXppcngtYWZ0ZXItZnR4LWNvbGxhcHNlL2FtcF92aWRlb3Nob3cvOTcwMTI0MTEuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Explained: How safe is your Bitcoin on Binance and WazirX after FTX collapse - The Times of India",
        "content": "Nagen Singh\n\nJan 16, 2023, 12:04AM IST\n\nSource: TOI.in\n\nWith the wave of bankruptcies in the cryptocurrency industry and Bitcoin’s unending bearish move, traders and investors have raised concerns about the future of digital assets in general, and whether the industry will make it through this market crash. To date, FTX and several others have paused customer withdrawals or filed for bankruptcy after being unable to continue operations. Will Bitcoin ever recover or was the entire crypto market a bubble? Here is everything that you need to know."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tcmFsbHktdG8tcG90ZW50aWFsLTIyNTAwLXNvb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Rally to Potential $22,500 Soon - Analytics Insight",
        "content": "BTC/USDT 1-Hour Chart (Source: TradingView)\n\nIn continuation of the previous day’s bullish trend in the crypto market, BTC bulls have accelerated their rally in recent hours. The bulls are pulling the price up, and BTC is now hovering at $21,156.88 with a 24-hour increase of 2.08%.\n\nThe RSI of BTC in the 1-hour chart of BTC/USDT is currently 62.20. Sooner it can reach an RSI value above 70, indicating that the crypto king is overbought and the bears will soon gain power, forcing the price into a downtrend. If the price cannot close above the $22,000 level, this might trigger another drop in the near future.\n\nThe above 1-hour chart states that after rising up from the order block between $18848.54 and $18778.32, Bitcoin rose up to the $21,000 price level and now forming higher highs and higher lows inside a rising wedge. A rising wedge is believed to signal an imminent breakout to the downside. Like other wedges, the pattern begins wide towards the bottom and contracts as the price moves higher and the trading range narrows. If Bitcoin follows the nature of the rising wedge, we can expect a price dump back to its previous order block soon.\n\nHowever, there is also another possibility that if more traders are betting on higher prices and accumulating more Bitcoins, the upper trendline of the rising wedge can be broken. In that case, Bitcoin price might trade above $22,500\n\nOverall, the Bollinger Bands are now contracting to mean that the market is in a low liquidity environment. In order to determine whether Bitcoin is now back in a bull market, risk-averse traders may want to keep a watch out for rising trading volume at higher prices.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmF0bW1hcmtldHBsYWNlLmNvbS9uZXdzL2xxd2QtZmludGVjaC11cGRhdGVzLWJpdGNvaW4tbGlnaHRuaW5nLW5ldHdvcmstcGxhdGZvcm0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Lqwd Fintech updates Bitcoin Lightning Network platform - ATM Marketplace",
        "content": "Lqwd Fintech Corp. has released an update to lqwd.tech, its Bitcoin Lightning Network software-as-a-service platform. With this platform, users can integrate the Lightning Network, which enables millions of Bitcoin transactions per second, according to a press release.\n\nUsers can also create and manage Lightning Network nodes, create channels for routing and request and manage liquidity.\n\n\"We are very excited for the release of the updated version of our Lightning Network platform, lqwd.tech,\" Shone Anstey, CEO, Lqwd, said in the release. \"We have learned a lot and made vast improvements to the platform and Lqwd as a company has become a key player on the Lightning Network through its global routing nodes and our easy-to-use platform.\""
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzAxLzE2L3doeS1iaXRjb2luLXByaWNlcy1ibGV3LXBhc3QtMjBrL9IBS2h0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzAxLzE2L3doeS1iaXRjb2luLXByaWNlcy1ibGV3LXBhc3QtMjBrLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Why Bitcoin price is rising again - Nairametrics",
        "content": "Bitcoin reached a high of $20.9k on Saturday, leaving short sellers who bet against its ascent in the red.\n\nThe flagship Cryptocurrency has been on the rise all week as recent positive macroeconomic reports breathe life into a largely depressed market.\n\nData from CoinGecko shows that the price of bitcoin hasn’t been this high since early November, just before the stunning collapse of FTX.\n\nThe overall market capitalization of the cryptocurrency sector currently stands at $990 billion, a rise of more than 4% over the previous day, indicating that the market is also showing signs of life.\n\nIn the previous day, cryptocurrency transactions totaled more than $80 billion.\n\nTraditional markets also saw gains for the week, with the S&P 500 rising more than 2% as Q4 earnings season got underway and U.S. inflation numbers—while still elevated—kept falling. The first monthly inflation reduction in 2.5 years as well as more substantial annual declines in both the headline and core readings have added to the optimism.\n\nWhy the rise: Bitcoin prices began its surge earlier in the week in anticipation of the release of the Federal Reserve’s December Consumer Price Index report.\n\nMonday marked the beginning of the week’s trading for bitcoin, which has since continued to rise. The CPI report confirmed that inflation in the US economy is really dropping while also meeting market expectations.\n\nBut, none of this ensures that this year will be favorable for risk assets, but it does indicate that things will appear much more normal than they did last year.\n\nEven though the macroeconomic environment may have improved, the outlook for bitcoin businesses is bleak.\n\nMetropolitan Commercial Bank (MCB), a New York-based institution, said on January 9 that it would shut down its crypto-assets sector, citing recent market losses and changes in the legal environment as reasons. 6% of the bank’s total deposits came from customers who were involved in the crypto industry.\n\nWith Bitcoin up 16% since the beginning of 2023, derivatives analytics show little indication of demand from leveraged short sales or defensive put options.\n\nBears are still patiently waiting for an entry point for their short positions, despite the fact that bulls can rejoice that the $900 billion total market capitalization resistance faced no opposition.\n\nStill, Crypto Bulls’ major hope is still a good macroeconomic environment, which is mostly dependent on how U.S retail sales statistics come out next week given the market’s unfavorable newsflow.\n\nMeanwhile, About 12,621 traders were liquidated on that day, totaling $650.99 million in liquidations. The greatest single liquidation order, worth $6.84 million, was placed on Huobi.\n\nWhy Shortsell? The goal of shorting bitcoin is to borrow the asset when the price is high and then sell subsequently.\n\nThey then buy back if the asset falls and return to who they borrowed from.\n\nThe spread is then pocketed as profit by the short seller.\n\nThe U.S. Securities and Exchange Commission (SEC) accused Gemini and cryptocurrency exchange Genesis Global Capital of selling unregistered securities through Gemini’s “Earn” program on January 12.\n\nA new round of staff layoffs announced by Crypto.com on January 13 that resulted in a 20% reduction in the global workforce was the final blow. Kraken, Coinbase, and Huobi are a few other cryptocurrency exchanges that just announced employment losses within the past month."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1lbmpveXMtMTItY29uc2VjdXRpdmUtZGF5cy1vZi1wb3NpdGl2ZS1ncm93dGgtZm9yLW9ubHktc2Vjb25kLXRpbWUtaW4tY3J5cHRvLWhpc3Rvcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin enjoys 12 consecutive days of positive growth for only second time in crypto history - CityAM - City A.M.",
        "content": "Bitcoin enjoys 12 consecutive days of positive growth for only second time in crypto history\n\nThe price of Bitcoin this morning sits at $20,815, marking a 20.65% increase in the last week. Ethereum has broken through $1,542 and is trading at $1,542, in the positive by 17% over seven days.\n\nMost of crypto has rallied on news of last week’s softer inflation numbers, which analysts say could mean a gentler Fed approach in future interest rate hikes. Historically, low interest rates led to increased investor interest in riskier assets such as cryptocurrencies and stocks, which have also been basking in the glow of returned optimism, however long it may last.\n\nBitcoin clocked its longest run of consecutive days of growth in November 2013, ending the rally at 15 days. The latest rally of 12 days is the second-longest ever recorded. Will it continue?\n\nWant to learn more about what’s going on in our global financial system and how Bitcoin fits in to it? Come to my next free webinar on January 18 at 6pm to find out, ask any questions, and grab some free Bitcoin*. Click here to register. (*18+, UK resident, new Luno users only)\n\nFriday’s Crypto AM Daily in association with Luno\n\nIn the markets\n\nThe Bitcoin economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\nThe total capitalisation of the entire cryptocurrency market at time of writing is currently $976.116 billion.\n\nWhat Bitcoin did yesterday\n\nWe closed yesterday, January 15, at a price of $20,880. The daily high yesterday was $20,993, and the daily low was $20,606.\n\nBitcoin market capitalisation\n\nBitcoin’s market capitalisation at time of writing is $399.96 billion. To put it into context, the market cap of gold is $12.639 trillion and Tesla is $386.5 billion.\n\nBitcoin volume\n\nThe total spot trading volume reported by all exchanges over the last 24 hours was $23.360 billion. High volumes can indicate that a significant price movement has stronger support and is more likely to be sustained.\n\nVolatility\n\nThe price volatility of Bitcoin over the last 30 days is 31.77%.\n\nFear and Greed Index\n\nMarket sentiment today is 45, in Fear.\n\nBitcoin’s market dominance\n\nBitcoin’s market dominance today is 42.93. Its lowest ever recorded dominance was 37.09 on January 1 2018.\n\nRelative Strength Index (RSI)\n\nThe daily RSI is currently 86.88. Values of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price – an RSI reading of 30 or below indicates an oversold or undervalued condition.\n\nConvince your Nan: Soundbite of the day\n\n“Bitcoin mining is helping balance our grid and is driving more renewables into our system” Brad Jones, Former CEO of the Electric Reliability Council of Texas\n\nWhat they said yesterday\n\nGreat start to the week…\n\n₿REAKING: #Bitcoin price has increased 12 days in row — The second longest streak in history! pic.twitter.com/fETwqQ3Vzz — Documenting ₿itcoin 📄 (@DocumentingBTC) January 16, 2023\n\nGermany gets it…\n\nGERMANY 🇩🇪:#Bitcoin can stabilise the grid with renewable energy. ☘️🍃☘️\n\n\n\npic.twitter.com/6t2WSnNAVE — Bitcoin Archive (@BTC_Archive) January 15, 2023\n\nThe importance of leading by example…\n\n✨ Hal Finney on #Bitcoin at $0.40, 12 years ago pic.twitter.com/f4MsSmCzv2 — RIZZO (@pete_rizzo_) January 15, 2023\n\nWould you like to help spread the adoption and education of Bitcoin in the UK and even stack some Sats while you’re doing it? Well, now you can!\n\nThe Bitcoin Pioneers community, backed by Barry Silbert’s Digital Currency Group, was created to introduce Bitcoin to a mainstream audience in a meaningful way and now has members right across the UK.\n\nWe share tips, stories and ideas on how to encourage others to try Bitcoin for the first time. And, thanks to support from Luno, each Pioneer gets £500 of Bitcoin a month to share with beginners, helping them get started.\n\nSo, if you’re passionate about Bitcoin, why not join today? Click here to find out more!\n\nAll feedback on Crypto AM Daily in association with Luno is welcome via email to James.Bowater@cityam.com 🙏🏻\n\nCrypto AM: Editor’s picks\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nErica’s ‘Crypto Wars’ handed honours in Business Book Awards\n\n‘Let people invest’: Matt Hancock makes case for liberal crypto rules\n\nExplained: Why the Treasury is so sold on stablecoins\n\nFears crypto is used to avoid sanctions ‘misplaced,’ says Matt Hancock\n\nThe cryptocurrency fundraisers behind Ukraine’s military effort\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCrypto AM: Events\n\nFor those of you who missed the Crypto AM DeFi & Digital Inclusion online summit 2021 – you can now watch the event in two parts via YouTube\n\nPart One\n\nhttps://www.youtube.com/watch?v=dvqNMNZTIDE\n\nPart Two\n\nhttps://www.youtube.com/watch?v=WXhX_-Tr5j0\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency.\n\nAll information is correct as of 08:00 BST"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmxhbmNhc2hpcmV0ZWxlZ3JhcGguY28udWsvbmV3cy8yMzI1MzgzOC5mb3VyLWphaWxlZC1mb2xsb3dpbmctaW52ZXN0aWdhdGlvbi0yMG0tYml0Y29pbi1mcmF1ZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Four jailed following investigation into £20m Bitcoin fraud - Lancashire Telegraph",
        "content": "The fraud began in 2017 when James Parker from Blackpool discovered a glitch in an Australian cryptocurrency trading website which allowed him to steal money.\n\nHe and his co-conspirators then siphoned off more than £20m worth of credits over a three-month period.\n\nThe cash and Bitcoin (Image: Lancs Police)\n\nParker’s corrupt financial adviser, Stephen Boys, who earned the nickname ‘Rodney’ due to his likeness to the character from ‘Only Fools and Horses’, helped launder the stolen funds.\n\nThe scam made so much money that £5,000 gift cards were handed out to people in the street and cars were bought for people Parker met in the pub.\n\nDuring the trial Boys told the court how he took £1,000,000 cash in a suitcase to buy a villa from Russians he met in the back office of an estate agent and spent £60,000 to pay off corrupt officials so he could carry on laundering money.\n\nStephen Boys (Image: Lancs Police)\n\nDuring the investigation police recovered 445 Bitcoin, then worth £22m, along with luxury watches, houses, cars and designer goods, including a £600 wine cooler, along with more than £1m in bank accounts. The assets will be returned to the victim.\n\nLancashire Police worked closely with international law enforcement, including in Australia and Finland, and the Crown Prosecution Service to bring the gang to justice.\n\nKelly Caton (Image: Lancs Police)\n\nDet Sgt David Wainwright, of Lancashire Police’s Fraud Unit, said: “The scale of the fraud in this case is absolutely staggering and led to the suspects literally having more money than they could spend.\n\n“I would like to pay tribute to all the agencies who worked closely together to bring these people to justice.”\n\nJordan Robinson (Image: Lancs Police)\n\nJames Parker died in 2021 before he could be prosecuted but the other fraudsters were convicted last year and sentenced on Friday (January 13)\n\nThose sentenced are:"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC13aGF0LXdpbGwtYmUtYml0Y29pbi1wcmljZS1pbi0yMDMwLWhlcmVzLXdoYXQtaXQtc2FpZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "We asked ChatGPT what will be Bitcoin price in 2030; Here's what it said - Finbold - Finance in Bold",
        "content": "Text-based artificial intelligence platform ChatGPT has gained prominence for its ability to handle a wide range of tasks with high accuracy. One area where the tool can be leveraged is in trading by offering possible price movements of different assets in the market.\n\nIn this regard, Finbold asked ChatGPT to share Bitcoin’s (BTC) possible price by 2030 based on various metrics, such as traditional price movement, technical analysis, and other relevant metrics.\n\nInterestingly, the tool acknowledged that it is challenging to predict the price of Bitcoin in the long run, citing the high market volatility and regulations. However, the AI-powered platform notes that there remains room for Bitcoin to rise in the coming years, citing the maturing markets and increased adoption.\n\n“It is impossible to predict the price of Bitcoin in 2030 with any degree of accuracy. The price of Bitcoin is highly volatile and is subject to many external factors, such as government regulations, economic conditions, and technological advancements. <…> As the cryptocurrency market matures and more people become aware of the potential of digital currencies, Bitcoin will likely become more widely accepted, and its value will continue to rise,” said ChatGPT.\n\nNotably, the projection by ChatGPT aligns with a prediction of Bitcoin proponents who believe that the asset is on its way to mainstream adoption.\n\nChatGPT’s potential\n\nAlthough the tool remains in its experimental stages, initial projections indicate that it could be leveraged to automate repetitive tasks such as monitoring prices and trading on specific conditions, among others. Furthermore, ChatGPT can help traders make informed decisions by being trained to generate reports on market trends, prices, and other relevant data.\n\nIt is worth noting that ChatGPT’s current knowledge is limited as it needs more information on global happenings beyond 2021.\n\nBitcoin price analysis\n\nBitcoin is currently trading at $20,925, having recorded gains of about 0.3% in the last 24 hours. Over the past week, Bitcoin has rallied over 20%, with a market capitalization of over $402 billion.\n\nBitcoin seven-day chart. Source: Finbold.\n\nFrom a technical analysis perspective, one-day gauges on TradingView are dominated by bullishness, with a summary recommending a ‘buy’ at 14 while moving averages are for a ‘strong sell’ at 12. The oscillator gauges are bearish for a ‘sell’ at 5.\n\nBitcoin technical analysis. Source: TradingView\n\nIt is worth mentioning that Bitcoin is experiencing one of its extended runs since the 2020 coronavirus pandemic.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]