[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTIvMjcvYml0Y29pbi0yMDIzLXJhbGx5LXB1bXBlZC11cC1tYXJhdGhvbi1jb2luYmFzZS1taWNyb3N0cmF0ZWd5LWdidGMuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzEyLzI3L2JpdGNvaW4tMjAyMy1yYWxseS1wdW1wZWQtdXAtbWFyYXRob24tY29pbmJhc2UtbWljcm9zdHJhdGVneS1nYnRjLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin's 2023 rally drove some of the stock market's biggest gains this year - CNBC",
        "content": "In this article COIN\n\nMSTR\n\nGBTC\n\nMARA Follow your favorite stocks CREATE FREE ACCOUNT\n\nMonitors display Coinbase signage during the company's initial public offering at the Nasdaq MarketSite in New York on April 14, 2021. Michael Nagle | Bloomberg | Getty Images\n\nFor crypto bulls, the most lucrative bets in 2023 were in the stock market. While bitcoin rallied over 150% for the year, shares of Coinbase , MicroStrategy and the Grayscale Bitcoin Trust , which are all tied closely to the digital currency, did substantially better, rising more than 300% in value. Bitcoin miner Marathon Digital soared 688%. Not only have those stocks outperformed the primary cryptocurrency, but they've been among the biggest gainers across the whole U.S. market. In the universe of publicly traded U.S. businesses with a market value of at least $5 billion, the four bitcoin-tied stocks were among the eight best performers, according to FactSet. The crypto boom represents a major bounce back from 2022, when coin prices plummeted, taking related equities down with them. A year highlighted by hedge fund collapses, crypto lender failures and crippling losses at miners was punctuated in November 2022, when crypto exchange FTX spiraled into bankruptcy, leading to the arrest of founder Sam Bankman-Fried on fraud charges. Last month, a jury in New York convicted Bankman-Fried on seven criminal counts, setting the 31-year-old former billionaire up for a possible life behind bars. Weeks later, Changpeng Zhao, founder of crypto exchange Binance, pleaded guilty and stepped down as the company's CEO as part of a $4.3 billion settlement with the Department of Justice. He faces a possible prison sentence of 18 months or longer. By the time of Bankman-Fried's conviction and Zhao's plea deal, the damage to the broader crypto market had mostly been realized, and investors were looking to the future. One of the biggest drivers for bitcoin this year was an easing of the Federal Reserve's interest rate hikes, which created a more attractive case for riskier assets. Prices were also bolstered by the upcoming bitcoin halving, which takes place every four years and is scheduled for May 2024. In the halving process, the reward for mining is cut in half, capping the supply of bitcoin. Additional buying was sparked by the potential for a flurry of bitcoin exchange-traded funds popping up in the new year. \"It's just more fuel for a fire,\" said Galaxy Digital CEO Michael Novogratz, in an interview on CNBC's \"Squawk Box\" last week. \"Crypto stocks are trading almost like a mania.\"\n\nwatch now\n\nBitcoin has climbed to $42,683 as of Tuesday, a massive win for investors who got in at the beginning of the year, when the price was around $16,500. But the leading cryptocurrency is still 38% below its record high of nearly $69,000 in November 2021. Among companies closely tied to bitcoin and valued at $5 billion or more, the best-performing stock this year was Marathon, a mining firm that just eclipsed that market cap level last week thanks to a 125% surge in December as of Tuesday's close. On Wednesday, the shares surged another 15%. Last year at this time, Marathon was hanging on by a thread. The company was in the midst of a quarter that ended with a loss of almost $400 million on sales of just $28.4 million because of tumbling bitcoin prices, a power outage at its facility in Montana and Marathon's financial exposure to bankrupt miner Compute North. \"It was pretty dire times,\" Marathon CEO Fred Thiel said in an interview last week. Bitcoin mining is an expensive operation because of the high energy costs required to operate the supercomputers. A drop in bitcoin prices means a sharp reduction in the money producers make selling the coins they mine, even as their energy bills get little relief. Thiel said the company was able to sell equity and was in the fortunate position of not having debt other than a convertible note. The picture has brightened dramatically in 2023. Last month, Marathon reported third-quarter net income of $64.1 million, as revenue jumped from a year earlier to $97.8 million. Now the company is in expansion mode, and last week announced the purchase of its first two fully owned bitcoin mining sites — one in Texas and one in Nebraska — for $178.6 million. The acquisitions increased the size of Marathon's mining portfolio by 56% to 910 megawatts of capacity. \"By vertically integrating, we take the profit margin for the third party out and we can run the site the way we want to run it,\" Thiel said. Much of the technology Marathon has been developing, he said, is focused on increased efficiency, \"which in an up market people will ignore\" because high prices lead to high margins. Thiel is trying to make sure the company is on sound financial footing the next time there's a downturn in bitcoin prices. That means bringing down production costs and creating more ways to sell energy back to the grid. He's also optimistic that through energy harvesting — taking methane gas and converting it to sellable electricity — Marathon will eventually have much more diverse revenue streams. One of the company's goals by 2028, Thiel said, is to bring bitcoin mining down to 50% of revenue.\n\nBrian Armstrong, co-founder and chief executive officer of Coinbase Inc., speaks during the Singapore Fintech Festival, in Singapore, Nov. 4, 2022. Bryan van der Beek | Bloomberg | Getty Images\n\n'Multiple sources of revenue'\n\nOutside of the mining universe, the best-performing crypto stock in the U.S. this year is Coinbase, which has soared 386% as of Tuesday's close. It rose 7.7% on Wednesday. As the only major publicly traded crypto exchange in the U.S., Coinbase has long been a popular way to buy and trade cryptocurrencies in its home market. But with the struggles at Binance, the largest exchange in the world, Coinbase picked up market share during non-U.S. trading hours, according to a report from research firm Kaiko in late November. Shortly after Zhao's plea deal, Coinbase CEO Brian Armstrong told CNBC that the news amounted to \"a vindication of the long-term strategy that we've taken to focus on compliance, make sure we were building a trusted company.\" Coinbase's revenue and stock price are still way below where they were during the heyday of crypto trading in 2021, when retail investors were jumping into the market to buy all sorts of digital currencies, including gimmicks like Dogecoin. But the business has stabilized following drastic cost-cutting measures starting last year and extending into early 2023. Coinbase also offers investors a bit of diversity outside of bitcoin. In the third quarter, bitcoin accounted for only 37% of transaction revenue at Coinbase, while ethereum made up 18% and other crypto assets amounted to 46%. Additionally, the combination of interest income and stablecoin revenue (earned through USDC reserves) more than doubled in the latest quarter to $212 million due to higher interest rates. Transaction revenue now accounts for less than half of Coinbase's net revenue, down from 96% at the time of the company's public market debut in 2021. \"We made a big effort around the time we went public to start diversifying our revenue,\" Armstrong said in an interview last week with CNBC. \"Now we have multiple sources of revenue, some of them in a high interest rate environment go up, some of them in a low interest environment go up. That means revenue has started to become more predictable.\"\n\nwatch now\n\nThe other top stock performers in crypto are much more closely tied to bitcoin. The Grayscale Bitcoin Trust is up 330% this year. GBTC hit the over-the-counter market in 2015 as the first publicly traded bitcoin fund in the U.S., offering investors a way to passively own bitcoin. The challenge for investors in the past has been that GBTC is a closed-end fund, which makes it less liquid than an ETF. Late last year, in the darkest days of crypto, GBTC's discount to its net asset value approached 50%, meaning its market cap was about half the value of the bitcoin it owned. As of Dec. 22, that discount had narrowed to 5.6%, the lowest since early 2021. The fund currently owns about $26.6 billion worth of bitcoin and has a market cap of $24.7 billion. In addition to the rally in bitcoin this year, GBTC is getting a boost from the prospects that it will get regulatory clearance next year to convert to an ETF, a move that would allow it to trade through a traditional stock exchange and gain liquidity measures that would bring its market value more in alignment with its NAV. Grayscale said in a regulatory filing Tuesday that Barry Silbert, CEO of parent company Digital Currency Group, is resigning as chairman of Grayscale Investments and exiting the board, effective Jan. 1. No reason for his departure was provided. He's being succeeded as chairman by Mark Shifke, DCG's finance chief.\n\nBig investors join the party\n\nThe Securities and Exchange Commission met with Grayscale in November and has been formally engaging with other asset managers about the issuance of bitcoin ETFs. Those meetings began after an appeals court sided in August with Grayscale in a lawsuit against the regulator, which had opposed the firm's efforts on concern that investors would lack sufficient protections. Other large money managers, such as BlackRock , Fidelity Investments and Invesco, have taken steps to create their own funds. Grayscale CEO Michael Sonnenshein told CNBC's \"Squawk Box\" last week that the \"hopeful approval\" for ETFs will bring in new participants, most notably investment advisors who oversee roughly $30 trillion in the U.S. but have restrictions on what they can buy. \"When my team had our court victory, I think that certainly unlocked a lot of optimism amongst investors about GBTC and the prospects for it to uplist as a spot bitcoin ETF,\" Sonnenshein said. \"As we turn the corner into the new year, I know there's a lot of focus on that from the investment community.\"\n\nwatch now\n\nIn the absence of an accessible ETF to date, many investors have flocked to MicroStrategy as a way to buy bitcoin. Founded in 1989 as a business intelligence software company, MicroStrategy now gets the vast majority of its value from the 174,530 bitcoins it owned as of the end of November, currently worth $7.4 billion. The stock's 327% jump this year has lifted the company's market cap to $8.3 billion. Its software and services business generated about $130 million in sales in the third quarter. The company said in a regulatory filing on Wednesday that it purchased an addition 14,620 bitcoins from Nov. 30 to Dec. 26 for $615.7 million, bringing its total to 189,150 bitcoins. The stock jumped 11%. MicroStrategy announced its plan to invest in bitcoin in mid-2020, disclosing in an earnings call that it would commit $250 million over the next 12 months to \"one or more alternative assets,\" which could include digital currencies like bitcoin. At the time, the company's market cap was about $1.1 billion. In the third quarter of 2020, MicroStrategy acquired 38,250 bitcoins for a total of $425 million. Phong Le, who was elevated to CEO from CFO last year, said on the October 2020 earnings call that MicroStrategy's investment in bitcoin allowed it to \"tap into the passion of the broader crypto market,\" adding that, \"We've seen a notable and unexpected benefit from our investment in bitcoin in elevating the profile of the company.\" Since then, MicroStrategy has come to be known as a bitcoin proxy. Co-founder and ex-CEO Michael Saylor is one of the cryptocurrency's principal evangelists, even co-authoring a book on the subject last year called \"What is Money?\" \"The one thing that we can count on is that bitcoin goes forward in the year 2024 and a strategy built around bitcoin is generally a pretty safe one for institutions,\" Saylor said in an interview Dec. 18 on CNBC's \"Closing Bell.\" \"Education makes a difference. Institutional adoption makes a difference. The spot ETF news is good news. Loosening of monetary policy is good news.\"\n\nwatch now\n\nSaylor is also optimistic about a mark-to-market accounting rule set to go into effect in 2025 (though companies can choose to adopt it earlier) that changes how companies record crypto assets. Instead of being classified as intangible assets that have to be marked down if the value drops below the purchase price, crypto will be in a separate category and companies will mark it up or down based on where it's trading. Saylor says the new measure provides an incentive for companies with billions of dollars of cash sitting on their balance sheets to put some of that money to work in bitcoin. As good of a year as it's been for the bitcoin bulls, it's been equally painful for the bears. Short sellers, or investors who bet on a drop in stock prices, have lost a combined $6.3 billion on their positions against Coinbase, MicroStrategy and Marathon, according to data supplied by S3 Partners last week. In the first three quarters of the year, crypto shorts spent $2.19 billion buying the stocks to reduce their exposure, the firm said. There's still a hefty dose of skepticism. More than 23% of Marathon's shares available for trading are sold short, while MicroStrategy's short interest-to-float ratio is about 21% and Coinbase's sits at 14%. The average among U.S. stocks is 5%, according to S3.\n\nDimon vs. the evangelists\n\nBut risk remains for the bitcoin believers. While enthusiasts like Saylor are betting on the long-term appreciation of the asset as a hedge against inflation and as a store of value, new investors are jumping into a historically volatile market. When bitcoin fell by more than 60% in 2022, Coinbase, GBTC and MicroStrategy each dropped by at least 74%. Marathon lost 90% of its value and some of its peers went out of business. Even with a more stable environment in 2023, crypto still has high-profile detractors like JPMorgan Chase CEO Jamie Dimon, who told the Senate Banking Committee earlier this month that, \"The only true use case for it is criminals, drug traffickers … money laundering, tax avoidance.\" \"If I was the government, I'd close it down,\" he said. But that prospect is looking less likely than ever as more institutional money flows into bitcoin as an investment vehicle. In mid-December, analysts at BTIG lifted their price target on MicroStrategy to $690 from $560, citing improving sentiment and the approaching bitcoin halving. \"Our expectation is that the approval of a spot BTC ETF would increase regulatory clarity around bitcoin, which should give large institutional investors, such as insurance companies, greater comfort investing in bitcoin,\" the analysts wrote. Galaxy Digital's Novogratz says that \"broadly we're still in bull market phase,\" noting that there's a constant and inherent scarcity of bitcoin supply. Novogratz expects bitcoin to eclipse its record high next year, and says that among respected investors, \"I can give you 50 of them on the other side of the table from Jamie Dimon.\" In the near term, Novogratz cautions that with so much momentum coming from crypto traders, the tide could turn and cause a correction. \"I'm a little nervous because it feels so good,\" he said. — CNBC's MacKenzie Sigalos contributed to this report WATCH: The crypto market is going to 'rally further, research firm says"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI3L21pY3Jvc3RyYXRlZ3ktbXN0ci1iaXRjb2luLWhvbGRpbmdzLXRvcC04LWJpbGxpb24td2l0aC1sYXRlc3QtcHVyY2hhc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy (MSTR) Bitcoin Holdings Top $8 Billion With Latest Purchase - Bloomberg",
        "content": "MicroStrategy Inc., the enterprise software maker which has made buying Bitcoin as part of its corporate strategy, increased its total holdings of the cryptocurrency to more than $8 billion through additional purchases this month.\n\nThe Tysons Corner, Virginia-based company run by Bitcoin advocate Michael Saylor acquired 14,620 Bitcoin for $616 million in cash from Nov. 30 to Dec. 26, according to a filing with the US Securities and Exchange Commission on Wednesday. That brings its total holding to 189,150 Bitcoin, or to almost 1% of the 19.58 million Bitcoin outstanding."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjcvd2hhdC10by1leHBlY3QtZnJvbS1iaXRjb2luLWluLTIwMjQv0gFUaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8yNy93aGF0LXRvLWV4cGVjdC1mcm9tLWJpdGNvaW4taW4tMjAyNC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "What to Expect From Bitcoin in 2024 - CoinDesk",
        "content": "The ETF approval is sufficiently baked into bitcoin prices such that positive momentum from the announcement may be offset by traders taking profits off the table. This suggests a possible reversion to the mean in the days after the announcement. Thereafter, the market will likely recalibrate its focus to the halving in April ."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY5MzEzL2JpdGNvaW4tZmFjZXMtc2hvcnQtdGVybS1wcmljZS1jb3JyZWN0aW9uLXJpc2tzLXNheXMtYml0ZmluZXgtYW5hbHlzdNIBbWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2OTMxMy9iaXRjb2luLWZhY2VzLXNob3J0LXRlcm0tcHJpY2UtY29ycmVjdGlvbi1yaXNrcy1zYXlzLWJpdGZpbmV4LWFuYWx5c3Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin faces short-term price correction risks, says Bitfinex analyst - The Block",
        "content": "Bitcoin BTC -5.48% continues to face price correction risks due to sell pressure from short-term holders and the illiquid market environment during the holiday season, an analyst said.\n\n\"We expect more drawdown if short-term holders and retail leverage continues to play a dominant role in the market and cause a continued pullback on a relatively illiquid holiday season market environment,\" Bitfinex Head of Derivatives Jag Kooner told The Block.\n\nBitcoin price correction risks\n\nAccording to Kooner, bitcoin is at risk of a price correction above the $44,000 mark. The analyst said that this level serves as a profit realization point for medium-term holders — individuals who have maintained their bitcoin holdings between 18 and 24 months.\n\nThe Bitfinex analyst added that profit-taking by the short-term holder cohort was a major cause of the recent retracement in the bitcoin price. \"Short-term holder profits got overheated, which resulted in our current slump,\" Kooner said.\n\nRELATED INDICES See crypto indices\n\nHowever, according to a recent Bitfinex report, there have been 67 consistent days of bitcoin net realized profitability for all bitcoin holder cohorts. \"This is the longest streak of realized profits since the period from October 2020 to February 2021, such streaks usually lead to market corrections in bull markets,\" said multiple Bitfinex analysts in the report.\n\nIn the report, the analysts added that based on historical market behavior, the entire cryptocurrency market could see pullbacks before climbing to a high of $3.2 trillion by the end of 2024. \"Current bitcoin valuations imply that the market environment is analogous to the period around June 2019 and July 2016, which saw initial dips in price before sustained recoveries. We expected a pullback to occur post bitcoin tagging the $44,000-$45,000 zone and why we expect prices to range further at these prices or pullback instead of an immediate move upwards,\" they added.\n\nThe world's largest cryptocurrency by market capitalization traded flat over the past 24 hours to change hands at $42,898 at 8:00 a.m. ET, according to The Block's Price Page."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbWljaGFlbC1zYXlsb3JzLW1pY3Jvc3RyYXRlZ3ktYnV5cy0xNDYyMC1iaXRjb2luLWZvci0lMjQ2MTUtbWlsbGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy Buys 14620 Bitcoin For $615 Million - Nasdaq",
        "content": "MicroStrategy, a leading business intelligence and software company, has continued its steadfast commitment to Bitcoin by purchasing an additional 14,620 BTC at a total cost of $615.7 million, Founder & Chairman Michael Saylor announced today. The purchase came as Bitcoin's price has been experiencing upward momentum, reaching highs of over $42,000.\n\nThe company initially entered the Bitcoin market in August 2020, making a significant initial investment of $250 million into BTC. Since then, they have consistently added to their Bitcoin holdings, creating a treasury reserve strategy that has garnered over 189,150 bitcoin worth more than $8.11 billion at the time of writing.\n\n“On December 27, 2023, MicroStrategy Incorporated (“MicroStrategy”) announced that, during the period between November 30, 2023 and December 26, 2023, MicroStrategy, together with its subsidiaries, acquired approximately 14,620 bitcoins for approximately $615.7 million in cash, at an average price of approximately $42,110 per bitcoin, inclusive of fees and expenses,” MicroStrategy stated. “As of December 26, 2023, MicroStrategy, together with its subsidiaries, held an aggregate of approximately 189,150 bitcoins, which were acquired at an aggregate purchase price of approximately $5.895 billion and an average purchase price of approximately $31,168 per bitcoin, inclusive of fees and expenses.”\n\nAs the fourth Bitcoin halving quickly approaches and the first spot Bitcoin ETF in the United States may be approved early into the new year, MicroStrategy continues its aggressive bitcoin investment strategy with no signs of slowing down.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1hbHJlYWR5LXByaWNlZC1zcG90LWV0Zi0xNTQ4MDYxMTUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin has already priced in spot ETF approval: Expert - Yahoo Finance",
        "content": "Crypto investors of all sorts are patiently waiting on spot bitcoin ETF approval from the Securities and Exchange Commission, with the price of bitcoin (BTC-USD) soaring in anticipation of the potential sign off. Dinara Co-Founder & CEO Laurence Latimer joins Yahoo Finance to discuss what would happen both immediately, and down the line, if the ETF is approved and how other cryptocurrencies can benefit from it.\n\nLatimer believes \"it would be a massive event for the industry\" and that it would be a \"great support for the institutionalization of digital assets and the mainstreaming of digital assets, widespread adoption.\" However, he also believes that \"much of the price movement has largely been priced in\" and that there is some \"frothiness\" in bitcoin prices.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\nJARED BLIKRE: As the markets price in rate cuts into the new year, those in crypto are betting big money on a spot Bitcoin ETF and it becoming a reality as the SEC gives companies a new deadline of December 29 to make final changes to their applications. The new deadline has led many industry watchers to predict a wave of approvals come January, but not necessarily news there. Bitcoin is now trading above $42,000, reaching levels this month we haven't seen since April of 2022.\n\nAnd for his take on what is coming next for crypto, let's bring in Laurence Latimer, the co-founder and CEO of Dinara, a crypto-trading platform. Laurence, thank you for coming in here today. So what is the importance of this spot Bitcoin ETF? I've been tracking this for months. I've been seeing the enthusiasm. But I guess the big question is when we get this finally maybe on January 10, is it a sell-the-news event?\n\nLAURENCE LATIMER: Yeah, and I thank you for having me. First of all, as we come down to thinking about what's happening for the Bitcoin approvals-- Bitcoin ETF approvals, the reality is much of the enthusiasm, as you just said, much of the attention has-- and much of the price movement has largely been priced in. That's what we think here at Dinara, and that's certainly what we believe.\n\nStory continues\n\nIt's going to be a massive event for the industry. The work that's gone into that from some of the largest firms in the industry has been happening over two-- some of them over two years. So it is a really massive event. It's a great sort of support for the institutionalization of digital assets and the mainstreaming of digital assets, widespread adoption. But we do think there's maybe a little bit of frothiness there and that the kind of price movement that many are expecting to see may already be mostly priced in.\n\nBRAD SMITH: And so with that in mind, do you think about the perhaps tail, the longer tail of it? We'll see a jump, perhaps, early on in inflows into some of these ETFs, but then what after that? What is perhaps a good baseline for us to consider looking at the amount of flows that actually make their way into one of the riskier parts of the asset classes out there?\n\nLAURENCE LATIMER: Yeah, well, you know, we made some predictions for 2024, and so this sort of falls firmly in the space there. We think that there's going to be some real meaningful appreciation across the whole industry. In October, the overall market cap for digital assets sat at around $1 trillion. It's now about $1.6 trillion. We think by the end of 2025, you'll be sitting at about $2.5 trillion in overall market cap. So if you kind of averaged that across the industry, we think there's another 50% or so upside built into the, you know, pricing of all assets. We think Bitcoin's among them.\n\nWhat we'll see is that ETF demand that's created there will put a nice floor and support for price movement. We also think there's some optimism around the legislative front. We hope to see some thoughtful legislative action at some point in 2024 as well. That will, again, put some upward pressure.\n\nAnd then you have Bitcoin halving, which is a technical piece that's happening, I believe, in April. And that traditionally has also put some upward pressure on the price of the asset."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTIvMjYvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1tYXktYmUtY29taW5nLWluLWphbnVhcnktMjAyNC5odG1s0gFgaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMTIvMjYvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1tYXktYmUtY29taW5nLWluLWphbnVhcnktMjAyNC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Spot bitcoin ETF approval may be coming in January, experts say. Here's what it means for investors - CNBC",
        "content": "Marco Bello | Reuters\n\nThe price of bitcoin has surged in 2023 as investors await approval for the first U.S. spot bitcoin exchange-traded fund, which would be a milestone for cryptocurrency investors, experts say. In early December, the digital currency topped $44,000 for the first time since April 2022, and year-to-date gains were above 160%, as of Dec. 21, mostly fueled by optimism for a spot bitcoin ETF. Meanwhile, discussions between the Securities and Exchange Commission and asset managers hoping to list bitcoin ETFs have advanced to technical details, signaling to some experts that an approval could be imminent. More than a dozen firms — including BlackRock , WisdomTree, Valkyrie and others — are waiting for the green light from the SEC, which could come in early January.\n\n\"For ETF investors, this would be the best product on the market,\" said Bryan Armour, director of passive strategies research for North America at Morningstar. \"All the other options right now have flaws to varying degrees.\" Currently, U.S. investors can buy bitcoin futures ETFs, which own bitcoin futures contracts, or agreements to buy or sell the asset later for an agreed-upon price. The long-awaited bitcoin spot ETF would invest in the digital asset directly.\n\nLoading chart...\n\nIf the SEC signs off on a spot bitcoin ETF, Armour anticipates a \"batch approval,\" with multiple ETF listings on the same day. \"I would expect them to rule on spot ETFs holistically because most issuers are taking similar approaches\" with applications, he said. \"There are a lot of good signs that the SEC is taking the most recent batch of filings more seriously,\" Armour said. \"I'm more optimistic about a bitcoin ETF than ever before.\" Some crypto investors expect a bitcoin rally upon approval, but it's also possible the price will dip as investors sell to collect profits, Armour said.\n\nCryptocurrency remains an 'extremely volatile' asset\n\nWhile SEC approval of a spot bitcoin ETF may make the asset class more accessible to the masses, experts urge investors to consider their risk tolerance and goals before piling in. \"I think it depends on the investor,\" said certified financial planner Ben Smith, founder of Cove Financial Planning in Milwaukee. If you're a more aggressive investor with an appetite for higher risk, a spot bitcoin ETF could fit into a diversified portfolio, he said.\n\nwatch now"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY5MjUxL2JpdGNvaW4tcHJpY2UtZGlwcy1iZWxvdy00MjAwMC1hcy1zZWxsLXByZXNzdXJlLW1vdW50c9IBXmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2OTI1MS9iaXRjb2luLXByaWNlLWRpcHMtYmVsb3ctNDIwMDAtYXMtc2VsbC1wcmVzc3VyZS1tb3VudHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin price dips below $42,000 as sell pressure mounts - The Block",
        "content": "The price of bitcoin has slipped lower over the past 24 hours, pulling back below the $42,000 mark as sell pressure increases. The world's largest cryptocurrency by market capitalization fell 3% over the past 24 hours to $41,998 at 1:00 p.m. ET, according to The Block data.\n\nBitcoin BTC -5.48% 's retracement follows a rise in factors contributing to sell pressure on the digital asset, particularly among the short-term holder cohort.\n\nAccording to CryptoQuant data, more than 25,000 bitcoins have been transferred from cold wallets to exchanges in the last 24 hours. The movement contributes to the liquid supply of the asset, thereby influencing price dynamics.\n\nBitcoin's circulating supply in profit has moved closer to a yearly high of just over 90%, with the current measure according the The Block's Data Dashboard at 89.4%. Also, data from The Block shows an uptick in transaction activity among the short-term holder cohort, those who have held the digital asset for 90 days or less.\n\nBitcoin network transactions spike\n\nTransactions on the bitcoin network, meanwhile, have reached an all-time high. According to data from The Block, the number of transactions on the bitcoin network reached an all-time high of 633,000. Daily trading volume on the bitcoin network now stands at over $28 billion.\n\nRELATED INDICES See crypto indices\n\nThis is a retracement from a mid-December yearly high of over $38 billion, but still almost twice the trading volume seen throughout November and October of this year.\n\nThe recent volatility in the bitcoin market has caused the liquidation of over $44 million in leveraged positions. According to data from Coinglass, the vast majority of these liquidations have been shorts, with over $38 million wiped out in the past 24 hours, compared to only around $6 million in long positions.\n\nApproval of spot bitcoin ETFs\n\nYear-to-date gains for bitcoin are currently above 155%. The digital asset's gains have been mostly fueled by optimism that the Securities Exchange Commission is getting ready to approve one or more of the spot bitcoin ETF applications that have been filed with the regulatory body. More than a dozen firms including BlackRock, WisdomTree and Valkyrie are waiting for the green light from the SEC.\n\nAnalysts anticipate spot bitcoin ETFs being approved in the first quarter of 2024. However, ETC Group Head of Research André Dragosch believes \"the approvals will only lead to a short-term price spike at first.\"\n\n\"However, the capital entering bitcoin gradually, over time will double the price of the digital asset in 2024,\" Dragosch added."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzI2L210LWdveC1hcHBlYXJzLXRvLWhhdmUtc3RhcnRlZC1wYXlwYWwtcmVwYXltZW50cy10aWVkLXRvLTIwMTQtYml0Y29pbi1oYWNrL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzI2L210LWdveC1hcHBlYXJzLXRvLWhhdmUtc3RhcnRlZC1wYXlwYWwtcmVwYXltZW50cy10aWVkLXRvLTIwMTQtYml0Y29pbi1oYWNrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Mt. Gox Appears to Have Started PayPal Repayments Tied to 2014 Bitcoin Hack - CoinDesk",
        "content": "The exchange, launched in 2010, was the world's biggest when it was hacked in 2014. It was ultimately able to recover about 20% of the stolen funds. Earlier this year, it extended the deadline for repayments by 12 months until October 2024."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI2L2JpdGNvaW4tYnRjLWRpcHMtYmVsb3ctNDItMDAwLW1lbWVjb2luLXJhbGx5LXNob3dzLXNpZ25zLW9mLXN0YWxsaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Dips Below $42000 While Memecoin Rally Shows Signs of Stalling - Bloomberg",
        "content": "Bitcoin dropped below $42,000 for the first time in a week and the recent rally in memecoins has started to show signs of stalling.\n\nThe largest cryptocurrency by market value dropped as much as 4.3% to $41,656 on Tuesday in New York. Smaller, less known tokens that have rallied in recent weeks such as Solana and Avalanche fell more, declining more than 10% each."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTIvMjYvbWljcm9zdHJhdGVneXMtYml0Y29pbi1iZXQtcHJvZHVjZXMtMzAwcGVyY2VudC1nYWluLWZvci1pbnZlc3RvcnMtaW4tMjAyMy5odG1s0gFyaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMTIvMjYvbWljcm9zdHJhdGVneXMtYml0Y29pbi1iZXQtcHJvZHVjZXMtMzAwcGVyY2VudC1nYWluLWZvci1pbnZlc3RvcnMtaW4tMjAyMy5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy's bitcoin bet produces over 300% gain for investors in 2023 - CNBC",
        "content": "In this article MSTR Follow your favorite stocks CREATE FREE ACCOUNT\n\nMicroStrategy CEO Michael Saylor speaks at the Bitcoin 2021 Convention, a crypto-currency conference held at the Mana Convention Center in Wynwood on June 04, 2021 in Miami, Florida. Joe Raedle | Getty Images\n\nMicroStrategy was founded almost 35 years ago and existed for most of its history as a little-known software company focused on business intelligence. But in 2023, the stock has soared 337%, making it one of the biggest gainers in the U.S. among companies valued at $5 billion or more, topping Nvidia's 234% rally and Meta's 194% surge. Unlike its tech peers, which rely on revenue growth and market share gains to fuel their stock prices, MicroStrategy's investor appeal is almost exclusively due to bitcoin . The company began buying the cryptocurrency in mid-2020 and has since amassed roughly 174,530 bitcoins, worth about $7.65 billion as of late Friday. Wall Street is so enamored by the story that the stock has about doubled bitcoin's gain this year. \"It's really bitcoin,\" said Joseph Vafi, an analyst at Canaccord Genuity who has a buy recommendation on the stock. \"All the other stuff is healthy and doing a good job, they're not neglecting it. It's doing well, it's leading software in its sector. But it's basically something we don't have to worry about.\" MicroStrategy's market cap is $8.5 billion, meaning 90% of its valued is tied directly to its bitcoin holdings. When bitcoin plummets or soars, so does MicroStrategy. In 2022, bitcoin's 64% drop pushed MicroStrategy down 74%. Even after its huge pop this year, MicroStrategy shares are still below where they were trading at their high in 2021, during peak crypto. The bitcoin strategy dates back to July 2020, when the company said it would start putting some of its cash towards alternative assets, including digital currencies. At the time, MicroStrategy had a market cap of roughly $1.1 billion, built on a software business that had been shrinking since 2015. Annual revenue was just under $500 million, and profit was minimal.\n\nAt the halfway point of 2020, MicroStrategy had just over $530 million in cash and short-term investments on its balance sheet. Co-founder Michael Saylor, who was CEO at the time, saw that money sitting virtually idle on the sidelines due to low interest rates and wanted to put it to work. From there, he had to decide whether equities, precious metals or bitcoin would be the best use of funds. \"The reason we decided to buy bitcoin is because bitcoin represents a form of digital gold,\" Saylor said on the first earnings call after the company announced its strategy. \"It's harder than gold. It's smarter, it's stronger, it's faster than gold.\" Saylor's decision created a way for investors to have stake in bitcoin through routine purchases of stock, rather than having to buy the coins directly. Saylor, who stepped down as CEO last year and assumed the role of executive chairman, told CNBC's Morgan Brennan last week that he expects the bull market in bitcoin to continue next year. He said 99.9% of the capital in the world is invested in real estate, stocks, bonds and commodities, with only 0.1% allocated toward bitcoin. \"People, as they get educated on digital assets, are realizing that they ought to be allocating more and more of their capital to this digital asset and so they're moving from .1 to .2%,\" said Saylor, who co-authored a book about bitcoin last year titled \"What is Money?\"\n\nwatch now\n\nNovel use of cash\n\nMicroStrategy isn't the first company to put some of its cash pile into alternative investments, and it's not the last to look for ways to generate outsized returns on that money. Earlier this month, GameStop gave CEO Ryan Cohen, who gained minor celebrity status as an investor, permission to use company cash to purchase stock. But MicroStrategy is unique in that it's become viewed almost exclusively as a bitcoin holding company. \"Michael Saylor's kind of a visionary,\" said Vafi. \"He saw this as an opportunity to really exploit the fact that they had a lot of cash and a pristine balance sheet and start this bitcoin treasury experiment. And it's worked out well and so they're continuing down that path.\" In analyzing why MicroStrategy's stock has so dramatically outperformed bitcoin this year, Vafi described it as a \"scarcity premium,\" because there are limited ways for equity investors to tap the market. That's potentially changing in the new year, as investors gear up for a flurry of bitcoin exchange-traded funds (ETFs). Currently, there are bitcoin futures ETFs, which are comprised of contracts to buy and sell bitcoin but not of the cryptocurrency itself. And investors can buy into the Grayscale Bitcoin Trust , a fund that owns bitcoin and trades over the counter rather than on a major exchange. Grayscale sued the SEC last year after the regulator denied its application to create a spot bitcoin ETF on concerns about investor protections. In August of this year, an appeals court ruled in favor of Grayscale, a decision than many in the industry viewed as paving the way for a new crop of ETFs. Asset managers, including BlackRock, Fidelity and Invesco, have filed with the SEC for their own products. Vafi said the prospect of competition poses little threat to MicroStrategy. \"I call it right now a very high-class problem to a certain degree,\" he said. \"If a bitcoin ETF gets approved, the price of bitcoin is probably headed higher and potentially materially higher.\" MicroStrategy also presents more than just a bet on the direction of bitcoin. While ETFs are passively managed, MicroStrategy has the option to put its bitcoin holdings to work, using them, for example, as collateral to create more business opportunities. \"MicroStrategy is encouraged by the continuing maturity of the regulatory environment around bitcoin as well as the increased institutional demand that we are seeing today,\" Shirish Jajodia, the company's vice president of treasury and investor relations, told CNBC in an email. \"We do believe it will have a positive impact on the adoption of bitcoin by mainstream investors as well as corporations.\" MicroStrategy's software business is a big plus too, Saylor said on the company's most recent earnings call. It's a proven cash flow generator, enabling the company to buy more bitcoin, he said. For the many investors betting against MicroStrategy, it's been a tough year. As of early December, crypto stock short sellers were down $6.1 billion for the year, with the rally in Coinbase hurting them the most, according to S3 Partners. In the first three quarters of the year, short sellers spent $2.19 billion covering their bets, the firm said, with the majority of the buying in Coinbase and MicroStrategy. Short sellers this year have lost $4 billion on Coinbase and $1.4 billion on MicroStrategy, according to data provided by S3 last week. Some 23% of MicroStrategy's shares available to the public are shorted, S3 said, which is second highest among crypto companies, behind only bitcoin miner Marathon Digital . The average for U.S. stocks is 5%. MicroStrategy shows no signs of slowing down when it comes to snapping pu bitcoin. The company said it purchased roughly 16,130 bitcoins in November for over $593 million, even with the price continuing to rise. That's more bitcoin than it's bought in any full quarter since the first three months of 2021. — CNBC's Kate Dore contributed to this report WATCH: Bitcoin bounces back above $43,000"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjcvc21hcnQtbW9uZXktaXMtcmVjb3JkLWxvbmctb24tYnRjLWFoZWFkLW9mLWV4cGVjdGVkLWJpdGNvaW4tZXRmL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjcvc21hcnQtbW9uZXktaXMtcmVjb3JkLWxvbmctb24tYnRjLWFoZWFkLW9mLWV4cGVjdGVkLWJpdGNvaW4tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "'Smart Money' Is Record Long on BTC Ahead of Expected Bitcoin ETF - CoinDesk",
        "content": "\"As we finally approach the launch, we need to point out that it is likely that the actual demand for the BTC Spot ETF at the start will fall short of market expectations. This sets up a classic 'sell the news' scenario in the 2nd week of Jan,\" Singapore-based QCP Capital's market insights team said in an update published last week."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzEyLzI3L21pY3Jvc3RyYXRlZ3ktYnV5cy1tb3JlLWJpdGNvaW4tcHVzaGluZy1ob2xkaW5ncy10by1uZWFybHktNi1iaWxsaW9uLWNuYmMtY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy buys more bitcoin, pushing holdings to nearly $6 billion - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nMicroStrategy buys more bitcoin, pushing holdings to nearly $6 billion: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, industry experts take a look back at U.S. regulatory advancements in digital assets over the past year and discuss what can be expected in 2024."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5saXZlbWludC5jb20vbWFya2V0L2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tanVtcHMtMTU1LWluLTIwMjMtYW1pZC1yb2xsZXItY29hc3Rlci1yaWRlLXdoYXQtbGllcy1haGVhZC1mb3ItY3J5cHRvY3VycmVuY2llcy0xMTcwMzU2ODUwMDM0My5odG1s0gGeAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tYXJrZXQvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1qdW1wcy0xNTUtaW4tMjAyMy1hbWlkLXJvbGxlci1jb2FzdGVyLXJpZGUtd2hhdC1saWVzLWFoZWFkLWZvci1jcnlwdG9jdXJyZW5jaWVzL2FtcC0xMTcwMzU2ODUwMDM0My5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin jumps 160% in 2023 amid roller coaster ride; What lies ahead for cryptocurrencies? | Mint - Mint",
        "content": "Investors of virtual digital currencies, popularly known as cryptocurrencies, have experienced a roller coaster ride in the year 2023. However, cryptocurrencies have given profitable returns this year. The grand old cryptocurrency, Bitcoin price has jumped over 160% this year, which is second best to over 350% generated during 2020.\n\nThis year, the crypto space has witnessed a myriad of regulatory onslaught that tested investors’ nerves. But, this hard to categorise asset class has literally dwarfed any other asset category when compared with returns it has generated and rewarded investors in minting money.\n\nAt the beginning of this year, the sector was plagued with many obstacles. Be it FTX, TerraLuma debacle, inviting regulatory ire, suits filed against many leading exchanges, several countries shutting the doors fearing the consequences - losing or rather handing over economic power into the hands of private currencies, etc.\n\nAlso Read: Bitcoin’s 160% rebound in 2023 is a gamble on ETF ‘Demand Shock’\n\nThese concerns filled the air of negativity in market pricing. It is this situation that caught the eye of savvy investors - the large asset backed institutional investors.\n\nBlackRock, Fidelity, Valkyrie, many others jumped in with spot bitcoin exchange traded funds (ETF), clearly indicating the huge institutional appetite waiting to grab their share.\n\nAccording to a private surveyor, it is expected that approximately $60.6 billion could flow into Bitcoin from the combined stock and bond ETFs, and about $9.9 billion from the gold market, totalling around $70.5 billion in potential new capital influx.\n\nCurrently, the total market capitalisation of cryptocurrencies stands at $1.66 trillion.\n\nYear 2024 holds many promises for crypto assets. Artificial intelligence or AI is set to go on stream which will create immense potential for the blockchain ecosystem. The decentralised ledger technology (DLT) will play a crucial role in the financial sector. Hence, building a suitable regulatory environment will be a top priority.\n\n(Exciting news! Mint is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest financial insights! Click here!)\n\n“Looking ahead to 2024, there is considerable excitement within the crypto community regarding the upcoming Bitcoin halving event and several innovations taking place in the Defi space. The approvals of Spot ETF applications filed by various institutional investors is also another key event the industry is looking forward to,\" said Rahul Pagidipati, CEO of ZebPay.\n\nThese are some of the areas that were dwelled into during 2023 and are slowly and surely getting addressed.\n\nIn fact, the deliberations over several key issues during the World Economic Forum held in India and across the globe helped alleviate some concerns. There is consensus over building a global framework to regulate cryptocurrencies.\n\n“The industry’s success in the coming year will hinge on fostering a sense of security among consumers. Transparency, strong ethics, and values will be the guiding principles for businesses to thrive amidst the dynamic crypto landscape,\" Pagidipati said.\n\nAlso Read: Bitcoin rose on rumors in 2023. How to predict what comes next?\n\nMeanwhile, the bitcoin mining company Micrastrategy’s CEO Michael Saylor continued to accumulate bitcoins and he is now believed to be sitting on profits. Saylor began buying the crypto more than three years ago and at last check held more than 158,000 bitcoins, worth approximately $4.7 billion.\n\nHis firm has so far sold only once - A 708 bitcoin sale in December 2022, worth $11 million at the time.\n\nThere are a few reasons behind Saylor accumulating bitcoin. ETF approval by Securities Exchanges Commission (SEC) and bitcoin halving in April.\n\nAccording to Saylor, mainstream investors have lacked a “high bandwidth\" compliant channel for investing in Bitcoin, a gap that the spot Bitcoin ETF is poised to fill.\n\nFollowing spot bitcoin ETF approval, the next important event is a supply shock during April’s halving, reducing daily Bitcoin production from 900 to 450.\n\nCryptocurrencies are still in nascent stages of growth. There are issues that need to be tackled on an immediate basis such as investor security, while certain others, mainly fixing the final responsibility in case of the protocol or the private virtual currency goes burst.\n\nRead all Cryptocurrency market-related news here\n\nDisclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEyLzI3L25leHQtc3RvcC1mb3ItYml0Y29pbi0xMDAwMDAtcHJpY2UtaW4tMjAyNC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Next Stop for Bitcoin: A $100,000 Token Price in 2024? - The Motley Fool",
        "content": "As 2024 approaches, investors should take a step back and assess their portfolio allocations. Ask yourself which of your positions may be primed for profit-taking and which may be worth doubling down on.\n\nAmong the variables that could move the markets in 2024 are possible interest rate cuts from the Federal Reserve, whether the U.S. is headed toward recession, and the volatility that tends to occur during election years. During otherwise cloudy macroeconomic conditions, investors may want to consider allocating a portion of their portfolio to alternative assets.\n\nTypically, alternative investments can include commodities such as gold, physical assets like real estate, or even artwork. However, during the past several years a new asset class has garnered both attention and significant capital investment: cryptocurrency.\n\nAlthough crypto is still fairly new as an asset class, opening a small position in Bitcoin (BTC -6.13%) may prove to be a savvy move for long-term investors. Trading at a price of roughly $42,000 per token, Bitcoin may not appear cheap. However, several catalysts could help push it much higher in 2024.\n\nWhat is Bitcoin?\n\nAt its core, Bitcoin is digital currency -- a form of payment that is not governed or regulated by traditional banks. Although Bitcoin is little used as a medium of exchange, there is a case for it as a store of value. For this reason, some people refer to Bitcoin as digital gold.\n\nInvesting in Bitcoin is quite different from purchasing stock in a company. The cryptocurrency does not have earnings, a management team, or any real securities guidelines that it must obey. Similar to other alternative assets, the value of Bitcoin largely stems from perception driven by supply and demand. For this reason, Bitcoin's price fluctuates frequently.\n\nNonetheless, the price of Bitcoin has seen some new life over the past year, surging nearly 160%. And with 2024 carrying a lot of question marks, the cryptocurrency could be poised for further market-beating returns.\n\nIs Bitcoin recession-proof?\n\nFor the past several quarters, economists have been sounding the alarm for a recession in 2024. However, economic indicators such as job growth, unemployment, and inflation continue to suggest that a recession may not materialize next year.\n\nThe chart below shows the real gross domestic product (GDP) growth rate for the U.S. during the past decade. Investors can see that in the latest quarter the annualized growth rate of 4.9% was well above the long-term average, and represents a slight uptick from the prior quarter. So while the economy may not fall into a recession, there are still many reasons to consider Bitcoin in 2024.\n\nWhere is Bitcoin headed in 2024?\n\nOne of the most obvious investment themes for 2024 is the fact that it is an election year. Although it is too early to know which candidates will land on the ballot and who will head to (or stay in) Washington in 2025, the likelihood of a volatile stock market next year could be pretty high. As candidates lobby for various legislative moves during campaign events and debates, it is natural for certain market sectors to experience more pronounced trading activity. For this reason, unless you have built a well-diversified portfolio, chances are you could experience some significant volatility next year, which leads to my second point.\n\nSome industries have handily outperformed the broader market this year. For example, technology stocks ripped in 2023, fueled by bullish outlooks on artificial intelligence (AI). Even if you did not directly own any of the \"Magnificent Seven\" stocks, tech-heavy index funds like Invesco QQQ were up by more than 50% year to date -- more than double the S&P 500's gains.\n\nAlthough the secular demand trends of AI could very well pour over into 2024, it's highly likely that some tech stocks are overbought right now. Investors should consider trimming certain positions and allocating some capital to asset classes that might see some renewed interest in 2024. Cryptocurrency fits this description and represents an opportunity for investors who can accept some level of speculation.\n\nPerhaps the biggest catalyst for Bitcoin heading into 2024 is the possibility that one or more spot Bitcoin exchange-traded funds (ETFs) will launch next year. Approval of a spot ETF by the Securities and Exchange Commission (SEC) would represent an important validation of cryptocurrencies and could spark a bull run.\n\nThe last thing that could send the token's price surging next year is the looming Bitcoin halving. Following past Bitcoin halvings, in which the reward miners receive for adding to the blockchain is cut in half, the cryptocurrency has witnessed renewed buying activity and eclipsed past highs.\n\nThe combination of election-driven volatility, coupled with potential momentum from regulators and the possibility of a Bitcoin halving cycle make me bullish on the token's prospects for next year. Despite its surge in 2023, I would not be surprised if Bitcoin eclipses its record high of about $69,000 next year and moves toward six-figure territory. For these reasons, investors might want to consider a small position in Bitcoin now."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vYml0Y29pbi1taW5lLXRleGFzLWxhd3N1aXQtbGlua3MtdG8tY2hpbmVzZS1pbnZlc3RvcnMtMjAyMy0xMtIBYWh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vYml0Y29pbi1taW5lLXRleGFzLWxhd3N1aXQtbGlua3MtdG8tY2hpbmVzZS1pbnZlc3RvcnMtMjAyMy0xMj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Lawsuit filed against a bitcoin mine in Texas shows links to China: NYT - Business Insider",
        "content": "Texas and other US states have welcomed cryptocurrency miners.\n\nIn 2021, China banned crypto miners, and some seem to have moved to the US.\n\nA New York Times report shows the difficulties of tracking international investment in the industry.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nAfter China banned all crypto transactions and mining in September 2021, bitcoin-mining companies increasingly turned to places like rural parts of Nebraska, Wyoming, and especially Texas.\n\nRecent reporting by The New York Times suggests these crypto mines are leading to some worrying socioeconomic implications.\n\nA bitcoin mine in the 281-person town of Channing, Texas, is facing a lawsuit over accusations it did not pay workers in full. BitRush, also known as BytesRush, is owned by Jerry Yu, a 23-year-old New York University student who's a Chinese citizen and a US resident.\n\nCrypton Mining Solutions, another Texas-based crypto-mining company, is also suing BitRush, claiming the company failed to pay for services rendered.\n\nAdvertisement\n\nThe lawsuits have unearthed documents showing that Chinese investors have flocked to the US, spending hundreds of millions of dollars to build and run crypto mines, the Times reported.\n\nThanks to its cheap energy and crypto-friendly legislation, Texas has become a hub for cryptocurrency-mining facilities: large warehouses full of computers \"mining\" digital currency like bitcoin around the clock.\n\nChinese investors who set up operations in the US can use these mines to generate crypto and then exchange it for dollars online.\n\nRelated stories\n\nThe mines and equipment are often purchased using cryptocurrency, making the origins of these funds impossible to trace, according to the Times. That lack of visibility allows investors to bypass oversight by US regulators and restrictions on money leaving China.\n\nAdvertisement\n\nIn the lawsuit, Crypton Mining Solutions accused BitRush investors of being \"not only Chinese citizens, but citizens in highly political and influential business positions,\" the Times reported.\n\nYu's lawyer, Gavin Clarkson, told the Times via email that the claims against Yu were \"baseless.\"\n\nHowever, further investigation by the newspaper showed that individuals who signed the mortgage on Yu's Manhattan apartment matched the names of a married couple who own shares in Chinese companies worth more than $100 million.\n\nDocuments procured by the Times suggest that the pair, Yu Hao and Sun Xiaoying, potentially Yu's parents, could also be investors in and directors at BitRush.\n\nAdvertisement\n\nYu's lawyer would not confirm to the Times Yu's relationship with the individuals or the identities of shareholders.\n\nThis is not the first time a crypto-mining company has come under scrutiny for its connection to China and potential security risks.\n\nPentagon officials began monitoring a bitcoin operation in Wyoming in October. The mine's owners' ties to China pose a national security threat, The New York Times reported.\n\nThe mine is located across from a Microsoft data center and a nearby military base.\n\nAdvertisement\n\nIn September 2022, the White House released a statement saying the US now had the largest bitcoin-mining industry in the world and was responsible for 38% of global bitcoin activity, a 34.5% increase from 2020."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21pY3Jvc3RyYXRlZ3ktYnV5cy1tb3JlLWJpdGNvaW4tMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy buys more bitcoin ahead of bitcoin ETF deadline - Blockworks",
        "content": "MicroStrategy continues to load up on bitcoin with a purchase of 14,620 bitcoin.\n\nThe company shelled out $615 million for its most recent purchase, meaning that it’s spent nearly $1.2 billion on bitcoin since November. Previous disclosures, filed at the end of November, showed that the company bought roughly 16,000 bitcoin for nearly $600 million.\n\nMicroStrategy Chairman and former CEO Michael Saylor posted on X that the company acquired its bitcoin at an average price of $31,168. In total, it’s spent roughly $5.9 billion for its 189,150 bitcoin.\n\nRead more: MicroStrategy bought nearly $600M bitcoin in less than 1 month\n\nThe 14,620 bitcoin acquired as of Dec. 27 were acquired at an average price of $42,110. Bitcoin (BTC) is hovering around $42,900 at the time of publication.\n\nMicroStrategy kicked off its spending spree in June with a purchase of 12,000 bitcoin for around $340 million. The purchase, at the time, marked the largest buy the software platform company had made in two years.\n\nSaylor, in the company’s November earnings call, said that the potential approval of spot bitcoin ETFs would be a “catalytic event” benefiting companies with bitcoin exposure.\n\n“I think we’ll see more and more analyst coverage from traditional Wall Street banks as these ETPs make bitcoin exposure available,” he said on the earnings call. “More coverage means more education, means more awareness, and that results in more interest.”\n\nRead more: A look at crypto ETF milestones in 2023 — and where spot bitcoin funds stand\n\nHe’s not worried about the potential launch of any bitcoin ETFs either. In a Dec. 19 interview with Bloomberg, Saylor said that the ETFs charge a fee. MicroStrategy, on the other hand, gives investors exposure without a fee.\n\n“We offer a high-performance vehicle for people that are Bitcoin long investors,” he said.\n\nBloomberg Intelligence Analysts James Seyffart and Eric Balchunas have speculated that there’s a possibility that the US Securities and Exchange Commission approves some of the bitcoin ETF proposals by Jan. 10.\n\nBlackRock, Ark, 21Shares and Franklin Templeton are just a few of the 13 potential proposals aiming to get funds launched.\n\nMicroStrategy’s stock is up over 337% in the past year, and is currently floating near its 52-week high of $622 in pre-market trading.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL3N0b2Nrcy9taWNyb3N0cmF0ZWd5LXN0b2NrLWJpdGNvaW4tY3J5cHRvLW52aWRpYS1tZXRhLW1pY2hhZWwtc2F5bG9yLWJldC1pbnZlc3RvcnMtMjAyMy0xMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy Stock Has Crushed Nvidia, Meta and Even Bitcoin This Year - Markets Insider",
        "content": "MicroStrategy's stock has soared over 300% this year, outperforming tech giants like Nvidia and Meta.\n\nThose gains outpace even those of bitcoin, which has soared 152% this year.\n\nMicroStrategy now owns over $7 billion worth of bitcoin, or over 174,000 tokens, worth 90% of their market cap.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nMicroStrategy stock has outperformed high-flying tech giants this year and even bitcoin as the company's big crypto bet has paid off.\n\nSince 2020, MicroStrategy has accumulated 174,530 bitcoins, according to CNBC, with the stockpile currently worth about $7.4 billion.\n\nThat's as the price of bitcoin has soared about 152% this year on hopes of a spot ETF approval, an upcoming halving event, and broad market optimism.\n\nMeanwhile, MicroStrategy stock has more than doubled bitcoin's gain, surging 319% this year and outperforming tech giants like Nvidia, which is up 244%, and Meta, which is up 185%. In fact, its gains outpace almost all US companies valued at $5 billion or more, CNBC reported.\n\nAdvertisement\n\nMicroStrategy's market cap is now $8.4 billion, meaning that roughly 90% of its value is anchored to bitcoin.\n\nWhile the software company has been around for 35 years, MicroStrategy has become known for its bullish stance on bitcoin. That has been led by co-founder and chairman Michael Saylor who has said he wanted to acquire as much bitcoin as he possibly could.\n\nAnd he has been. In November alone, MicroStrategy bought $593 million worth of bitcoin (roughly 16,130 tokens), its largest purchase since February 2021 when it splurged on $1 billion worth of the currency.\n\n\"Bitcoin is not going to zero, it's going to a million,\" Saylor said in a CNBC interview last week.\n\nAdvertisement\n\nThe crypto spring has fueled rallies across the sector. Crypto stocks like Coinbase and Marathon Digital have also been on a tear, also notching triple-digit rallies.\n\nWall Street is also bullish on bitcoin, with Standard Chartered saying last month that it's still set to more than double again to $100,000 by late next year. And in October, analysts at Bernstein predicted that bitcoin could hit $150,000 by mid-2025."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vYnVzaW5lc3MvdXNiYXNlZC1jaGluZXNlLXN0dWRlbnQtdW5kZXItdGhlLWxlbnMtb3Zlci1vd25lcnNoaXAtb2YtNi1taWxsaW9uLWJpdGNvaW4tbWluZS0xMDE3MDM1OTE2NTc5NzIuaHRtbNIBkAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vYnVzaW5lc3MvdXNiYXNlZC1jaGluZXNlLXN0dWRlbnQtdW5kZXItdGhlLWxlbnMtb3Zlci1vd25lcnNoaXAtb2YtNi1taWxsaW9uLWJpdGNvaW4tbWluZS0xMDE3MDM1OTE2NTc5NzItYW1wLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Chinese student under the lens over ownership of $6 million Bitcoin mine in US - Hindustan Times",
        "content": "A $6 million Bitcoin mine in Texas' Channing is under the lens due to its links with China. A 23-year-old Chinese student named Jerry Yu, is the majority owner of the facility. The mine comprises of several dozen buildings designed to hold 6,000 specialized computers, reported The New York Times. The specialised computers in the Channing mine, can function day and night trying to guess the right sequence of numbers that earn new Bitcoins. Interestingly, the facility which is a large computing center, was bought with cryptocurrency. A $6 million Bitcoin mine in Texas' Channing is under the lens due to its links with China. (REUTERS file photo)\n\nYu has come under the lens due to alleged Chinese investment to build or run crypto mines in the United States. Through the mines, Chinese investors generate cryptocurrency like Bitcoin, which they can encash in US dollars on exchanges. Chinese ownership of the mine, is being seen with a focus on national security.\n\nHindustan Times - your fastest source for breaking news! Read now.\n\nALSO READ| Top 10 most ‘unsafe’ cities in the US during holiday season : Report\n\nYu's activities, have emerged after his company BitRush Inc., also known as BytesRush, got into legal trouble after contractors who worked on his Channing mine alleged they weren't fully paid for their work.\n\nThe report highlights that the source of the funds for the mine, has not been found out as investors have routed the money through Binance’s offshore exchange and used a cryptocurrency called Tether .\n\nThe report also notes that Chinese investors may use the Channing mine to avoid the US banking system and federal regulations. It highglights that under a traditional transaction, banks are aware of the source of funds and can report any suspicious money transfers to the US Treasury.\n\nIn one of the lawsuits involving Yu, Texas-based Crypton Mining Solutions has labelled allegations that investors in the Channing mine “are not only Chinese citizens, but citizens in highly political and influential business positions.”"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2FuYWx5c3RzLXdlaWdoLXBvdGVudGlhbC1iaXRjb2luLWV0Zi1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "As bitcoin ETF saga hits possible homestretch, here's what to watch for - Blockworks",
        "content": "As industry watchers eye the potential approval of spot bitcoin ETFs, one analyst says specific application updates in the coming days could be the difference between firms being able to launch such products, and not.\n\nThe US Securities and Exchange Commission is set to rule on a spot bitcoin ETF proposal by Ark Invest and 21Shares by Jan. 10. Some segment observers have said they expect the regulator to rule on other similar planned products at that time.\n\nThe regulator set a Dec. 29 deadline for fund groups to submit final updates to their bitcoin ETF filings, Reuters reported last week, citing unnamed firm executives.\n\nWould-be issuers of these funds have met with the SEC in recent weeks and continue to update their applications. But fund groups are likely to add more details in the coming days, according to Bloomberg Intelligence analyst Eric Balchunas.\n\n“The SEC is ready to approve spot bitcoin ETFs, but only if they have clear language around cash-only creations and have a signed agreement with an authorized participant — which many don’t yet,” Balchunas wrote in a Wednesday research note.\n\nAuthorized participants are entities allowed to create and redeem shares of an ETF. Such organizations can either exchange ETF shares for a corresponding basket of securities that reflects the ETF’s holdings, or exchange them for cash.\n\nRead more: The SEC continues meeting with bitcoin ETF hopefuls. Here’s what they’re discussing\n\nThough Grayscale Investments appeared to argue in meetings with the SEC that in-kind transactions are more efficient, it noted in a Tuesday filing that its proposed spot bitcoin ETF would only be able to accept cash orders.\n\n“However, and in common with other spot bitcoin exchange-traded products, the trust is not at this time able to create and redeem shares via in-kind transactions with authorized participants, and there has yet to be definitive regulatory guidance on whether and how registered broker-dealers can hold and deal in bitcoin in compliance with the federal securities laws,” the document states.\n\nBlackRock‘s proposed spot bitcoin ETF would also feature cash creations and redemptions — a change the SEC seems to have pushed for based on various proposal amendments.\n\nWhile some firms have agreed to “bend the knee” to the SEC on the cash transactions issue, Balchunas said, securing an agreement with an authorized participant could be trickier.\n\n“A lot will unfold in the next 48 hours; you hope they all can get it done and have the AP named in the S-1 as of Friday,” he told Blockworks.\n\n“When I see a prospectus with the AP named…I’m basically assuming that is a horse at the starting gate ready for approval, but that is up in the air,” Balchunas added. “Making it to the starting gate is half the battle at this point, so there’s a race before the race.”\n\nBalchunas said in the Wednesday research note that Bitwise and BlackRock have authorized participant agreements in place, though they have not revealed them in filings. Spokespeople for the two companies did not immediately return a request for comment.\n\nGrayscale all set?\n\nGrayscale was reportedly set to work with authorized participants Jane Street and Virtu Financial if its Grayscale Bitcoin Trust (GBTC) was allowed to convert to an ETF — a report a Grayscale spokesperson confirmed at the time.\n\nThe firm did not name these companies as authorized participants in its latest S-3 filing, and a Grayscale representative did not comment further.\n\n“Even with all the crucial boxes checked, it’s possible the SEC still holds [Grayscale] back from the starting gate in the name of keeping a level playing field,” Balchunas wrote.\n\nGBTC launched in 2013, and eligible shares of the trust are quoted on the OTC Markets Group. It has roughly $26 billion in assets under management and regularly sees roughly $150 million in daily volume, the Bloomberg Intelligence analyst said in his latest note.\n\n“That’s a huge advantage for GBTC and makes it a clear favorite, even with the likes of BlackRock and Fidelity in the race,” Balchunas added. “This puts the SEC in a conundrum and risks it becoming a kingmaker.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLWFuZC1iZWFycy1wcmVwYXJlLWZvci1lbmQtb2YteWVhci0xMGItYnRjLW9wdGlvbnMtZXhwaXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin bulls and bears prepare for end-of-year $10B BTC options expiry - Cointelegraph",
        "content": "Bitcoin's (BTC) market is preparing for a $10.1 billion options expiry, a significant event set to occur on Dec. 29 at 8:00 am ET. The latest data indicates that call (buy) options hold a clear advantage, but bears could significantly limit their losses by pushing Bitcoin's price below $42,000.\n\nBoth sides have incentives to influence Bitcoin's spot price, but as the deadline approaches, one can gauge the outcome based on the expiry price. The options market leader, Deribit, boasts an impressive $7.7 billion open interest, but the surprise comes from the runner-up, the Chicago Mercantile Exchange (CME), with $1.38 billion. The CME’s open interest is more than double that of OKX, which is in third place with $630 million.\n\nSpot Bitcoin ETF expectations gave bullish options an edge\n\nThe impending approval of a spot Bitcoin exchange-traded fund (ETF) in January has a substantial impact on the December options expiry. The Securities and Exchange Commission (SEC) has notably changed its approach in how it engages with ETF proponents. Instead of outright rejections, the SEC has been actively engaging in dialogue with ETF creators. This shift in approach is a positive signal and raises expectations of potential ETF approval in January. This alone explains why bears are unlikely to succeed in suppressing Bitcoin's price below $40,000 ahead of the year-end BTC options expiry.\n\nIn another significant development, Binance's recent plea deal with the U.S. Department of Justice and regulators signifies the evolving cryptocurrency landscape toward compliance and Anti-Money Laundering practices. This development indicates the increasing integration into the mainstream financial ecosystem, which also bolsters the odds of spot ETF approval, especially after changes on the Grayscale Investments’ board and the subsequent refiling of its request to convert the Grayscale GBTC Trust.\n\nThe aggregate open interest for the December options expiry stands at $10.1 billion. However, it's projected that the final amount will be much less, as the recent rally above $40,000 caught bearish investors off guard, as evident from the Deribit Bitcoin options interest chart.\n\nDeribit Bitcoin Options Open Interest for Dec. 29. Source: Deribit\n\nThe combined open interest of Deribit and CME options is $9 billion, although put (sell) options are underrepresented by 32%, reflecting the imbalance compared to the $5.4 billion in call (buy) open interest. Still, with Bitcoin gaining 25% since November, the majority of put (sell) options are likely to expire worthless.\n\nIf Bitcoin's price remains near $43,100 at 8:00 am UTC on Dec. 29, only $185 million worth of these put (sell) options will be available. This difference occurs because the right to sell Bitcoin at $40,000 or $43,000 is useless if BTC trades above that level on expiry.\n\nBitcoin bears will want BTC price under$42,000 to minimize losses\n\nHere are the four most likely scenarios based on the current price action. The imbalance favoring each side determines the theoretical profit. This crude estimate disregards more complex investment strategies, as there's no straightforward way to estimate this effect.\n\nBetween $39,000 and $40,000: 3,000 calls vs. 17,700 puts. The net result favors the put (sell) instruments by $575 million.\n\n3,000 calls vs. 17,700 puts. The net result favors the put (sell) instruments by $575 million. Between $40,000 and $42,000: 13,800 calls vs. 11,600 puts. The net result favors the call instruments by $90 million.\n\n13,800 calls vs. 11,600 puts. The net result favors the call instruments by $90 million. Between $42,000 and $44,000: 24,200 calls vs. 7,200 puts. The net result favors the call instruments by $730 million.\n\n24,200 calls vs. 7,200 puts. The net result favors the call instruments by $730 million. Between $44,000 and $45,000: 27,900 calls vs. 1,800 puts. The net result favors the call instruments by $1.15 billion.\n\nFor the bears to level the playing field before the monthly expiry, they must achieve a modest 3% price decrease down to $41,900. In contrast, the bulls require a pump above $44,000 to secure a $1.15 billion advantage on Dec. 29. Still, the potential windfall for call option holders could become a catalyst for further price gains ahead of the ETF decision in January.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhhc2gtcmF0ZS1oaXRzLW5ldy1wZWFrLWJ1dC1wcm9maXRhYmlsaXR5LXR1bWJsZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin hash rate hits new peak, but profitability tumbles - Cointelegraph",
        "content": "Bitcoin network computing power — or mining hash rate — reached a new all-time high on Christmas day, but has put putting more pressure on miners amid a slump in profitability.\n\nOn Dec. 25, Bitcoin’s hash rate reached an all-time high of 544 exahashes per second (EH/s), according to Blockchain.com. The data was confirmed by Bitinfocharts, which reported an average hash rate peak over the weekend.\n\nIt comes as network hash rates have more than doubled this year, climbing 130% since January.\n\nA chart depicting Bitcoin’s hash rate over the course of 2023. Source: Blockchain.com\n\nOver the same period that BTC hash rates have increased, the asset’s price has virtually mirrored the chart, climbing more than 150% since Jan. 1, 2023.\n\nReflexivity Research co-founder Will Clemente looked at the hash rate on a logarithmic scale commenting, \"The summer 2021 China mining ban is barely a blip,\" said Clemente. \"Imagine fading the most secure decentralized open-source monetary network on the planet, couldn't be me.\"\n\nA high hash rate may be nice for theoretical price models such as implied hash-adjusted price, but it is not good news for miners who must work harder to secure the next block.\n\nHash price, a measure of profitability, has fallen over the past week as the BRC-20 ordinal inscription craze cooled. Hash price is currently $0.09 per terahashes per second per day, according to HashrateIndex.\n\nRelated: Bitcoin revenue per terahash nears record lows as hash rate soars\n\nProfitability has fallen 34% since its 2023 high of $0.136/TH/s/day on Dec. 17. Hash price often spikes during elevated demand, causing high transaction fees, such as during the recent inscriptions frenzy.\n\n“We’re approaching almost an entire year without fully clearing Bitcoin mempools, having sustained elevated fee pressure since Feb,” observed Glassnode analyst “Checkmatey.”\n\nBitcoin hash price ($/TH/s/day) 1 month. Source: Hashrateindex\n\nNetwork hash rates first passed the milestone 500 EH/s figure in late November, as reported by Cointelegraph.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLW1pbGxpb25zLXVuYmFja2VkLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETF could result in 'millions of unbacked BTC,' analyst says - Cointelegraph",
        "content": "Potential approval of a spot Bitcoin (BTC) exchange-traded fund (ETF) in the United States will trigger fundamental problems related to the original vision of Bitcoin by the anonymous creator Satoshi Nakamoto, according to one analyst.\n\nThe concept of a spot Bitcoin ETF — an investment product that tracks the price of BTC by holding Bitcoin — conflicts with the idea of self-custody, according to Josef Tětek, a Bitcoin analyst at the hardware crypto wallet firm Trezor.\n\nUnlike a Bitcoin ETF, self-custodial crypto storage solutions allow users to own Bitcoin by taking full responsibility for holding the private key — or the actual assets.\n\n“In principle, spot Bitcoin ETFs take people further from self-custody and potentially introduce a systemic risk, as ETFs will be safer on the surface than exchanges,” Tětek said in an interview with Cointelegraph.\n\nOne possible consequence of spot Bitcoin ETF approval could be that large quantities of BTC would be stored in central locations where the government could seize them, the analyst said, referring to a scenario seen with the confiscation of gold in the United States in the 1930s. Tětek added:\n\n“And while a spot Bitcoin ETF would make exposure to Bitcoin price movements more accessible to individuals and institutions alike, simply buying Bitcoin through conventional means would offer the same exposure. Do we really need ETFs for this?”\n\nAnother significant issue with a spot Bitcoin ETF is that ETF holders will not have the option to withdraw the underlying asset. Instead, these assets are held in aggregate by the ETF itself, which raises the possibility of the unchecked issuance of “paper Bitcoin,” not supported by actual Bitcoin, the supply of which is capped at 21 million coins, Tětek noted. The analyst stated:\n\n“The result could be the creation of millions of unbacked Bitcoin, which would distort genuine markets and depress the value of real Bitcoin — all while handing greater agency to the giants of centralized, traditional finance. The very antithesis of Satoshi’s original vision.”\n\nTětek’s remarks on self-custody versus spot Bitcoin ETFs flag a potential downside amid the growing optimism on the market, with various firms and analysts expecting U.S. securities regulators to approve a spot BTC ETF in January 2024.\n\nRelated: ARK’s Cathie Wood sees short-term effect of spot Bitcoin ETF as ‘sell on news’\n\nNot everyone has been optimistic about spot BTC ETFs, though. Arthur Hayes, co-founder of crypto exchange BitMEX, believes that spot BTC ETFs could “completely destroy” Bitcoin if they are too successful. If not Bitcoin, such ETFs will likely compete with centralized crypto exchanges like Coinbase, as ETF fees are expected to be lower than those on exchanges, according to some Bloomberg analysts.\n\nAccording to Quantum Economics founder Mati Greenspan, there is no direct conflict between self-custody and spot Bitcoin ETFs because retail users will stick to self-custody.\n\n“Personally speaking, I would never buy any sort of paper IOU forms of Bitcoin, but that’s because I have the option of self-custody,” Greenspan told Cointelegraph. “Most institutions don’t have that option,” he added.\n\n“There are zero advantages and plenty of disadvantages for retail investors to hold Bitcoin ETFs. Way better to just hold Bitcoin,” Greenspan stated.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2V0Zi9jYXRoaWUtd29vZC1zLWFyay1pbnZlc3QtYnV5cy1vdmVyLTkybS13b3J0aC1vZi1wcm9zaGFyZXMtYml0Y29pbi1ldGYtc2VsbHMtY29pbmJhc2UtYmxvY2stYW5kLXBhbGFudGlyLXNoYXJlcy0xMDMyOTI5MDU00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood's Ark Invest Buys Over $92M Worth Of ProShares Bitcoin ETF, Sells Coinbase, Block And Palantir Shares - Markets Insider",
        "content": "On Wednesday, Cathie Wood-led Ark Invest made a significant move in the cryptocurrency space, purchasing over $92 million worth of ProShares Bitcoin Strategy ETF (NYSE:BITO). This trade comes amidst a dynamic period in the crypto market, aligning with Ark Invest’s strategic adjustments in response to evolving market conditions.\n\nThe ProShares Bitcoin Strategy ETF Trade\n\nArk purchased 4,320,928 units of BITO through ARK Next Generation Internet ETF (NYSE:ARKW) on Wednesday. For the day, BITCO closed 3.2% higher at $21.31. The transaction was valued at $92.08 million.\n\nArk Invest’s acquisition of the ProShares Bitcoin Strategy ETF represents a substantial investment in the cryptocurrency sector. This move follows Wood’s recent comments on the potential impact of Bitcoin ETF approvals on the market. The investment aligns with her belief in the long-term value of Bitcoin (CRYPTO: BTC) and its related financial products.\n\nArk’s decision to invest heavily in BITO, highlights the firm’s confidence in the future of cryptocurrency, despite the recent divestment from other crypto-related assets like the Grayscale Bitcoin Trust (OTC:GBTC).\n\nSee Also: Cathie Wood Outlines Role Of Bitcoin Post-ETF Approval, Praises 21Shares: ‘The Plumbing Works’\n\nThe Coinbase Global Inc. Trade\n\nIn a contrasting move, Ark Invest also sold a significant portion of its holdings in Coinbase Global Inc (NASDAQ:COIN). This decision, involving the sale of 148,885 shares through ARKW, comes amid a period of heightened volatility in the cryptocurrency market. The transaction was valued at $27.58 million. Coinbase shares closed 7.67% higher at $185.24 on Wednesday.\n\nArk has dumped Coin shares in recent days amid increased volatility in the cryptocurrency arena. Two of the largest cryptocurrencies, Bitcoin and Ethereum (CRYPTO: ETH), have risen 162.4% and 101.8% respectively so far this year.\n\nThe Palantir Technologies Inc. Trade\n\nAnother notable trade by Ark Invest was the sale of 101,921 shares of Palantir Technologies Inc (NYSE:PLTR) through ARKW. The transaction held a value of $1.8 million, calculated at the Wednesday closing price of $17.47 for the company co-founded by Peter Thiel. Previously, Ark doubled down on Palantir amid market corrections. Even so, Palantir shares have gained 172.12% since 2023 began.\n\nThe Block Inc. Trade\n\nArk Invest also adjusted its position in Block Inc (NYSE:SQ), selling 231,102 shares through ARKW. The transaction was valued at $18.4 million. On Wednesday, Block shares closed 1.82% higher at $79.60. Cathie Wood has in the past publicly defended Block against a short report by Hindenburg Research. As outlined in a Benzinga article, Wood criticized the report as “wildly misleading.” More recently, in December, Wood had been buying shares of the Jack Dorsey-led company.\n\nOther Key Trades:\n\nSold 56,175 shares of Stratasys Ltd (NASDAQ:SSYS) through ARK Autonomous Technology & Robotics ETF (BATS:ARKQ) and ARK Space Exploration & Innovation ETF (BATS:ARKX), reducing exposure in the 3D printing sector.\n\n(NASDAQ:SSYS) through (BATS:ARKQ) and (BATS:ARKX), reducing exposure in the 3D printing sector. Sold 15,440 shares of Advanced Micro Devices (NASDAQ:AMD), adjusting its stake in the semiconductor industry through ARKW.\n\n(NASDAQ:AMD), adjusting its stake in the semiconductor industry through ARKW. Sold 66,223 shares of Twilio Inc (NYSE:TWLO), as part of its portfolio rebalancing in the cloud communications field through ARKW.\n\n(NYSE:TWLO), as part of its portfolio rebalancing in the cloud communications field through ARKW. Sold 26,124 shares of Veracyte Inc (NASDAQ:VCYT) via ARKW, indicating a shift in its biotechnology investments.\n\nRead Next: Cathie Wood Predicts Deflation In 2024, More AI And Tech Optimism, And Rate Cuts"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNwb3QtZXRmcy1hbmQtYS1idWxsLW1hcmtldC13aHktZXRoLXNvbC1va2ItYW5kLWluai1jb3VsZC10aHJpdmUtaW4tMjAyNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, spot ETFs and a bull market — Why ETH, SOL, OKB and INJ could thrive in 2024 - Cointelegraph",
        "content": "The cryptocurrency markets have made a strong comeback in 2023. Bitcoin (BTC) and most altcoins have risen sharply from their 52-week lows, but are still languishing well below their respective all-time highs. This suggests the start of a bullish move, which still has a long way to go.\n\nOne of the most important triggers for the crypto bull market in 2024 is the approval for a spot Bitcoin exchange-traded fund by the United States Securities and Exchange Commission. If one or more Bitcoin ETFs get greenlighted in January, then it is bound to boost sentiment and set the stage for the start of a bull move.\n\nIn a bullish environment, market participants do not pay much attention to the negative news, but every positive development is cheered by pushing the price higher. Additionally, the bullish sentiment is likely to spread to altcoins as well. Hence, if Bitcoin rises, several altcoins are likely to march higher.\n\nCrypto market data daily view. Source: Coin360\n\nIt is always tricky to predict which coins will outperform in the next bull phase because every bull market has its own set of leaders. However, it is sometimes seen that coins leading the markets out of the bear phase and holding on to their gains are the ones that are likely to do well.\n\nThe tokens chosen have risen sharply from their 52-week lows, indicating solid demand from the bulls. Let’s look at their possible target objectives on the upside and the critical support levels on the downside.\n\nBitcoin price analysis\n\nBitcoin has risen sharply from its November 2022 low of $15,460, signaling the start of a new uptrend. The momentum picked up after buyers propelled the price above $32,000.\n\nBTC/USD weekly chart. Source: TradingView\n\nBoth moving averages are sloping up, and the relative strength index (RSI) is in the overbought zone, indicating that the bulls remain in command. Buyers will try to push the price to $48,000 and then to $52,100. This zone is likely to act as a formidable resistance in the near term, but if the bulls do not allow the price to dip below the 20-week exponential moving average ($34,000), the uptrend may continue.\n\nA rally above $52,100 will complete a rounding bottom pattern. This setup has a target objective of $88,740. However, before the BTC/USD pair reaches this level, the bears will mount a vigorous defense at the current all-time high of $69,000.\n\nOn the downside, the 20-week EMA is the vital support to watch out for. If this level gives way, the pair may drop to the 50-week simple moving average ($28,566).\n\nBTC/USD daily chart. Source: TradingView\n\nBoth moving averages are sloping up, and the RSI is in the positive territory, indicating that bulls are in the driver’s seat. Buyers will try to drive the price above $45,000 and start the next leg of the up-move. If they do that, the pair may climb to $48,000 and then to $52,100.\n\nInstead, if the price turns down and breaks below the 20-day EMA ($41,306), it will suggest the start of a pullback. The pair may drop to the 50-day SMA ($38,079) and later to the crucial support at $32,000. The deeper the retreat, the greater the time needed to start the next leg of the uptrend.\n\nEther price analysis\n\nEther (ETH) has been gradually trying to recover after the sharp fall during the last bear market. The price has risen sharply from the June 2022 low of $880, indicating that bulls are making a comeback.\n\nETH/USD weekly chart. Source: TradingView\n\nThe price action of the past few days has formed an ascending triangle pattern, which completed when bulls pushed the price above the overhead resistance at $2,143. The pattern target of this bullish setup is $3,406. Sellers may fiercely protect the zone between $3,406 and $3,582, but if the bulls prevail, the ETH/USD pair could rise to $4,000 and later to $4,868.\n\nThe first sign of weakness will be a break below the moving averages. That will indicate aggressive selling by the bears at higher levels. The trend will favor the bears if the pair plunges below the uptrend line of the triangle. The failure of a bullish pattern is a negative sign and may result in further downside.\n\nETH/USD daily chart. Source: TradingView\n\nThe rebound off the breakout level of $2,143 shows the bulls are trying to flip the level into support. A break and close above $2,403 will signal the resumption of the uptrend. The pair may then climb to $3,000.\n\nMeanwhile, sellers are likely to have other plans. They will try to yank the price back below $2,143. If that happens, it will suggest that higher levels are being viewed as a selling opportunity. The pair may then plummet to the strong support at $1,900. That may keep the pair stuck inside the triangle for some more time.\n\nSolana price analysis\n\nSolana (SOL) has been a huge outperformer in the past few months. It has skyrocketed from its low of $8 in December 2022 to the current levels.\n\nSOL/USD weekly chart. Source: TradingView\n\nThe 20-week EMA ($43) has started to turn up, and the RSI is in the overbought territory, indicating a potential trend change. Although the risk of a fall to the 20-week EMA remains high, the dips are likely to be purchased.\n\nThe SOL/USD pair has a minor resistance at $95, but if this level is crossed, the next stop is likely to be $143. This level could attract strong selling by the bears because if bulls overcome the $143 resistance, the rally may extend to $200.\n\nIf bears want to prevent the upside, they will have to drag the price below the 20-week EMA. That may start a range-bound action for some time.\n\nSOL/USD daily chart. Source: TradingView\n\nThe pair has been rising steadily for the past few days, and the pullbacks are finding support at the 20-day EMA ($66). This suggests a positive sentiment where the traders view the dips as a buying opportunity.\n\nA minor risk to the continuation of the rally in the near term is that the RSI is showing a negative divergence, suggesting weakening momentum.\n\nIf the price turns down and breaks below the 20-day EMA, it will indicate that the bulls are losing their grip. The pair may dip to the 50-day SMA ($55) and later to the psychologically important level at $50.\n\nRelated: AI deepfake nude services skyrocket in popularity: Research\n\nOKB price analysis\n\nOKB (OKB) is one of the few tokens that has broken above its 2021 highs, indicating that the coin is in a long-term uptrend.\n\nOKB/USDT weekly chart. Source: TradingView\n\nThe bulls are trying to propel the price above the resistance of the $59 to $38 range. If they manage to do that, the OKB/USDT pair is likely to start the next leg of the up move. The pair could rise to $80 and subsequently to $100. The upsloping moving averages and the RSI near the overbought zone indicate that bulls remain in command.\n\nSellers are likely to have other plans. They will try to pull the price below $54 and keep the pair stuck inside the range for some more time. A break below $38 will signal that the bears are back in the game.\n\nOKB/USDT daily chart. Source: TradingView\n\nThe bulls and the bears are witnessing a tough battle at the $59 level. If bears come out on top and sink the price below $54, the pair could gradually dip toward the support at $38. That could keep the pair range-bound for a while longer.\n\nHowever, the 20-day EMA ($58) is sloping up, and the RSI is in the positive territory. This suggests that the path of least resistance is to the upside. If buyers overcome the obstacle at $65, the pair may start the next leg of the uptrend.\n\nInjective price analysis\n\nInjective (INJ) broke above the April 2021 high of $25.30, indicating the resumption of the uptrend. The breakout of a previous major high signals strength and attracts buyers.\n\nINJ/USDT weekly chart. Source: TradingView\n\nThe up-move of the past few weeks has pushed the RSI into deeply overbought territory, indicating that the rally may be getting over-extended in the near term. That could start a corrective phase or a consolidation.\n\nThe first strong support on the downside is at $25.30. If buyers flip this level into support, it will signal the start of the next leg of the uptrend. The INJ/USDT pair could surge to $43 and thereafter to the psychological level of $50.\n\nAlternatively, if the price dips and sustains below $25.30, it will suggest aggressive profit booking by the bulls. That may sink the price to the 20-week EMA ($14).\n\nINJ/USDT daily chart. Source: TradingView\n\nThe long wick on the Dec. 12 candlestick shows that the bulls tried to halt the rally at $25.30, but the bulls persisted. They continued their purchase on Dec. 13 and pushed the price higher. That has sent the RSI into deeply overbought levels, warning of an impending correction in the near term.\n\nThe pair is likely to retest the breakout level of $25.30. If this level holds, it will increase the likelihood of the resumption of the uptrend. On the contrary, if bears tug the price below $25,30, the pair could drop to the 20-day EMA ($22). This remains the key level for the bulls to defend because a break below it may start the decline to $14.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy81LXJlYXNvbnMtd2h5LWEtc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1jb3VsZC1zZW5kLWJ0Yy1wcmljZS1hYm92ZS0xMDBr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "5 reasons why a spot Bitcoin ETF approval could send BTC price above $100K - Cointelegraph",
        "content": "There has been extensive debate about whether the launch of a spot Bitcoin (BTC) exchange-traded fund (ETF) will lead to a price correction after the initial excitement from investors subsides. While some arguments hold merit, they overlook the broader perspective. The approval of a spot Bitcoin ETF will be a game-changer in various aspects, including volatility, correlation with traditional finance assets and market liquidity.\n\nSpot Bitcoin ETF prospects. Source: Eric Balchunas/Bloomberg\n\nArbitrage desks and the ETF providers have likely created a buffer to support the initial demand and prevent market front-running. Nevertheless, whether it takes a few hours or several months, this buffer will eventually deplete. When examining a longer time frame—months instead of days—the price of Bitcoin is determined by the balance between immediate demand and the supply of coins at a specific price level.\n\nBitcoin is validated, boomers enter the market, and issuers compete for dominance\n\nThe initial question to consider is why someone would wait until Bitcoin's price surpasses its all-time high to start investing. Most individuals are either lazy or cautious, meaning they are hesitant to open an exchange account or invest in anything that hasn't received their broker's endorsement. Even if Grayscale offers Bitcoin-backed trust funds, there is little incentive for traditional investment brokers to offer such products.\n\nIt's important to note that the median retirement savings for North Americans under 34 is $17,600, while those between 35 and 64 have accumulated a substantial $142,100, according to Vanguard. This data suggests that millennials and Generation Z are not the ones who will propel Bitcoin's price to $100,000 and beyond. In essence, the first reason the spot Bitcoin ETF is crucial lies in the minimal effort required for baby boomers to invest.\n\nMore significantly, by offering products where the asset manager retains the management fee, the incentives for providing the product increase significantly. This means that sales teams at BlackRock, Fidelity, Ark Invest, Bitwise, VanEck, and other issuers will be fully engaged in attracting both internal and external clients. Other funds managed by these multi-trillion-dollar asset managers may also be encouraged to invest in Bitcoin's newly launched ETF.\n\nHistorically, the ETF industry has witnessed a concentration of assets among the top two issuers. For example, SPDR Gold Trust (GLD) and iShares Gold Trust (IAU) represent over 85% of the industry's assets under management. Additionally, the market leader State Street's GLD has an expense ratio of 0.4%, which is considerably higher than most competitors. This data underscores the importance of gaining an early advantage in terms of ETF holdings.\n\nBitcoin receives regulatory clearance and the spot ETF eases concerns for investment advisors\n\nRegarding regulation, there has never been a definitive statement from the U.S. Securities and Exchange Commission (SEC) regarding the legitimacy of Bitcoin, let alone from legislators. In fact, U.S. Senator Elizabeth Warren announced on Dec. 11 that five more Senators have agreed to cosponsor one of her bills aimed at cracking down on the illicit use of cryptocurrencies for money laundering and terrorism financing. In this regard, the support of BlackRock and Fidelity legitimizes the asset class.\n\nRelated: Crypto users to reach almost one billion in 2024, analysts predict\n\nWhile the SEC's decision to limit spot Bitcoin ETFs to cash-only creation and redemption may not be the ideal tax solution for investors, it dismisses regulatory concerns, as every Bitcoin held by these funds must be acquired from intermediaries pre-approved by the SEC. Essentially, the approval of the spot ETF significantly reduces regulatory risk.\n\nThis difference also benefits investment advisers, as it spares potential investors from dealing with Bitcoin transactions. Investors themselves often prefer instruments that do not require specific tax regulations, making the ETF a much simpler option compared to direct cryptocurrency investment.\n\nThese changes may initially appear uneventful, with the impact of a Bitcoin spot ETF approval not necessarily occurring in the first few hours or days. However, when these five favorable trends gain full momentum, it’s not likely that Bitcoin will trade below $100,000 again—it’s only a matter of time.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI3L2NyeXB0by1oZWRnZS1mdW5kcy1wYW50ZXJhLXNlZS0yMDI0LWJvb3N0LW9uLWJpdGNvaW4tYnRjLXJhbGx5LXRva2VuLW1hbmlh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Crypto Hedge Funds, Pantera, See 2024 Boost on Bitcoin (BTC) Rally, Token Mania - Bloomberg",
        "content": "Crypto hedge funds that survived a bruising 2022 are recovering, and many are thriving. Some are even expecting a banner 2024.\n\nTake Dan Morehead ’s Pantera Capital, one of the industry’s oldest and biggest funds. The firm’s liquid-token fund was up nearly 80% this year as of mid-December, after falling 80% in 2022, according to a person familiar with the performance. Chainview Capital, the crypto hedge fund run by 31-year-old Dan Slavin , has doubled after an 18% decline last year, Slavin said."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LTE0NjIwLWJpdGNvaW5zLWRlY2VtYmVyLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy bags 14,620 Bitcoin ahead of potential ETF approval - Cointelegraph",
        "content": "Business intelligence firm MicroStrategy keeps stacking Bitcoin (BTC) amid growing anticipation of the potential approval of a spot BTC exchange-traded fund (ETF) in the United States.\n\nMicroStrategy and its subsidiaries purchased another 14,620 BTC for $615.7 million in cash between Nov. 20, 2023, and Dec. 26, 2023, the firm officially announced in its 8-K filing with the U.S. Securities and Exchange Commission. The latest Bitcoin stash cost MicroStrategy roughly $42,110 per BTC, including fees and other expenses, according to the filing notes.\n\nThe purchase brings MicroStrategy and its subsidiaries’ aggregate Bitcoin holdings to 189,150 BTC, putting them at an aggregate purchase price of approximately $5.9 billion and an average purchase price per BTC of roughly $31,168.\n\nMicroStrategy’s latest BTC purchase follows another massive purchase of 16,130 Bitcoin in November 2023, which the firm acquired at the price of $36,785 per Bitcoin. The company previously bought 6,067 BTC in September and October 2023 and 12,333 BTC in June.\n\nThe acquisition is more evidence of MicroStrategy’s commitment to Bitcoin investment, coming in line with the vision of its co-founder and major Bitcoin bull Michael Saylor. The announcement comes just a few weeks before Jan. 10 — the day when the community is widely anticipating to see a spot Bitcoin ETF or several such ETFs approved by the SEC.\n\nAccording to Saylor, a spot Bitcoin ETF may be the “biggest development on Wall Street in 30 years” because such a product would open the door to mainstream retail and institutional investors that previously hadn’t been able to access BTC.\n\nRelated: 2 risks around Bitcoin ETF launch that no one’s talking about\n\nNot everyone is optimistic about the implications of a spot Bitcoin ETF coming to the market in the United States.\n\nAccording to Trezor Bitcoin analyst Josef Tětek, a spot Bitcoin ETF may take people further from self-custody and potentially create “millions of unbacked Bitcoin.” Among other risks, spot Bitcoin ETFs could “completely destroy” Bitcoin if they are too successful, according to skeptics like BitMEX co-founder Arthur Hayes.\n\nMagazine: Lawmakers’ fear and doubt drives proposed crypto regulations in US"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9iYXJyeS1zaWxiZXJ0LXF1aXRzLWdyYXlzY2FsZS1ib2FyZC1iZWZvcmUtc2VjLWJpdGNvaW4tZXRmLW5vZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Grayscale board resignations a show of 'best behaviour' before Bitcoin ETF nod - DLNews",
        "content": "Grayscale Bitcoin Trust’s Barry Silbert and Mark Murphy resigned from the trust’s parent company, Grayscale Investments.\n\nThat’s according to a Tuesday SEC filing, which named Mark Shifke, Digital Currency Group’ chief financial officer, as Silbert’s successor as chair.\n\nThe departures come as the US Securities and Exchange Commission is poised to approve of a wave of more than a dozen applications for spot Bitcoin ETFs, including Grayscale’s own offering.\n\nSilbert, founder and CEO of Grayscale parent Digital Currency Group, has faced lawsuits from New York Attorney General Letitia James for $1 billion in investor losses related to its Genesis subsidiary.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nMark Murphy has been DCG’s president since November 2022.\n\nSilbert and Murphy submitted their resignations today, and will step down on January 1, the filing said.\n\nDenied Application\n\nThe Grayscale Trust is a closed-end fund, but the company applied to convert it to an ETF back in 2021.\n\nThe SEC denied the application, alongside several other spot offerings from crypto-focused firms.\n\nJoin the community to get our latest stories and updates\n\nThen, in September, a court ruled that the SEC had made an error in its rejection, and ordered the agency to reappraise Grayscale’s application.\n\nShifke, who has been at the company since 2021, has almost four decades of financial and fintech experience, according to the filing. and more than eight years of CFO experience leading two publicly-traded companies.\n\nBeing a ‘good boy’\n\n“This is Grayscale trying to show [the] SEC it is being a good boy and worthy of making [its] first tranche of launches,” said Bloomberg Intelligence analyst Eric Balchunas on X. “This is best behavior-type stuff.”\n\nIf and when the SEC greenlights the Bitcoin ETFs, Grayscale will suddenly find itself competing against heavyweights including Fidelity, BlackRock, and Ark Invest.\n\nThat means Grayscale’s position as the world’s largest institutional Bitcoin manager may be under threat.\n\nBalchunas’ colleague, James Seyffart, wondered on X if the resignations may signal an eventual Grayscale sale."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9tb25leS9pbnZlc3RpbmcvYml0Y29pbi13aHktaW52ZXN0LWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "'I made £1bn from Bitcoin – here's why you should not invest in it' - The Telegraph",
        "content": "“The bottom line is that demand for Bitcoin is permanent,” Morris says. “There was liquidity – people were able to sell – through the various bear markets Bitcoin has already experienced, whereas it disappeared in other parts of the cryptocurrency market. Will demand grow? Until more professional investors own it in their portfolios, until other investors do, there is the scope for growth.”\n\nThe rise of artificial intelligence is also a positive development for Bitcoin, according to Morris. He says AI will soon be initiating transactions by itself, without human involvement, and when that happens “there will be no room for normal banks because there will have to be better technology – we’ll need a form of money that’s able to deal with computers”.\n\nBitcoin is the obvious solution.\n\nMorris says the current cycle should see the price of Bitcoin averaging $100,000, compared with $30,000 over the previous cycle.\n\n“Bitcoin tends to do well in the year before a halving and in the year after one,” he says.\n\nFalling interest rates should also be positive for the cryptocurrency because investors have less to lose in interest if they choose Bitcoin instead of cash savings.\n\nThe creation of “exchange-traded funds” or ETFs that can hold Bitcoin directly, is also expected soon after the objections of American regulators were overruled. This too suggests there is good reason to be bullish.\n\n“Bitcoin always comes back stronger,” Morris says. “The bear market is over, the cycle has turned. Bitcoin is the king of crypto and is going to be a bigger part of portfolios.”\n\nThe case against Bitcoin\n\nDuncan MacInnes can hardly be accused of being a dyed-in-the-wool Bitcoin sceptic. It was he who persuaded his colleagues at Ruffer, the investment manager, to invest 2pc of their portfolios in the digital coin in 2021, an investment that yielded a rapid profit of more than £1bn, one of the most spectacular coups in the recent history of fund management.\n\nSo his belief now that Bitcoin’s moment is in the past, and its absence from both his own personal portfolio and those run by Ruffer, are worthy of our attention.\n\n“I was a Bitcoin zealot,” he tells Questor. “I have never believed in anything so much. We invested during the pandemic and it was the perfect asset for that moment. Trust in institutions was failing, interest rates were zero and everyone was at home [looking for investment opportunities on their computers].”\n\nNow, 15 years after its invention, he says he is “not sure what Bitcoin is for”.\n\n“It’s not suitable as a payment tool, it has failed as a hedge against the recent bout of inflation and the context has changed so much,” he says. “Money printing via quantitative easing has gone into reverse and the market is less obsessed with technology across the board.”\n\nHe adds: “So much money was poured into cryptocurrency by venture capitalists and so many intelligent people got involved yet it’s hard to point to any concrete results of all that money and effort and now there are new things to be excited about such as AI.\n\n“At about the time Ruffer invested people were talking about a wall of institutional money going into Bitcoin, but it didn’t happen. If a true Bitcoin ETF had been launched then, it would have attracted huge amounts of money. But now I don’t think anyone cares, I don’t think there is pent-up demand. And I think I can prove that.”\n\nHe draws attention to the Grayscale Bitcoin Trust, a quoted American investment fund that owns Bitcoin and whose managers were instrumental in overturning the refusal of American regulators to authorise Bitcoin ETFs. As a quoted fund Grayscale can, just like a British investment trust, trade at a premium or a discount to the value of its assets.\n\n“In 2020 Grayscale was trading at a premium of 20pc but that discount gave way to a double-digit discount. Why would you invest in an ETF and by doing so pay the full price for the Bitcoin it holds if you can buy it at a discount via Grayscale? That discount showed that there wasn’t demand.”\n\nAnother development that he expected to improve sentiment towards cryptocurrencies at the time Ruffer invested has also not come to pass, MacInnes says.\n\nIn a reference to the numerous frauds to have taken place at crypto exchanges, he says: “People thought that the arrival of institutions such as ourselves as crypto investors would force out the bad actors but it didn’t work out that way – we still saw good money going to back Sam Bankman-Fried [the convicted fraudster who ran the crypto exchange FTX]. That’s a real problem.”"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRpcHMtNDItMi1rLXNvbGFuYS0yMC1tb250aC1oaWdoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin price dips to $42.2K as Solana comes off 20-month highs - Cointelegraph",
        "content": "Bitcoin (BTC) took a fresh step down on Dec. 26 as analysis blamed seasonal trends for BTC price weakness.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price struggles after 2% drop\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting $42,200, down 2% on the day — its lowest in almost a week.\n\nNeither a “Santa rally” nor a holiday surprise greeted Bitcoin bulls over Christmas, and ahead of the Wall Street return, crypto markets continued to struggle.\n\nCommenting on recent BTC price moves, trading resource Material Indicators argued that the final days of 2023 were bound to create problems.\n\n“Year end profit taking and tax loss harvesting are going to strengthen the headwind for BTC bulls,” a post on X (formerly Twitter) read.\n\n“Watching to see if they can reclaim the 21-Day MA before tonight’s D candle close.”\n\nBTC/USD 1-day chart with 21MA. Source: TradingView\n\nMaterial Indicators referenced Bitcoin’s 21-day simple moving average, which at the time of writing stood at $43,115 — around $400 above the spot price.\n\nEarlier, co-founder Keith Alan stressed the significance of the 21-day trendline as support in recent months.\n\nWoke up to sub $43k #Bitcoin!\n\n\n\nThe 21-Day Moving Average has served as Technical Support for #BTC since mid October. It's worth noting that we saw this key level breeched on December 17th (IYKYK). Bulls need to reclaim it to keep the rally going. pic.twitter.com/FXhUyMrO4G — Keith Alan (@KAProductions) December 26, 2023\n\nA printout of BTC/USDT order book liquidity on the largest global exchange, Binance, meanwhile, did little to lift the mood, this showing bids at $37,000 and lower increasing through the second half of December.\n\nBTC/USDT order book liquidity data. Source: Material Indicators/X\n\nContinuing on order book trends, popular trader Skew likewise suggested that market participants were preparing for further downside.\n\n“Looks more like shorts positioning for a break lower, in which these shorts will want to see continued spot selling else they will be forced to cover around $43K,” part of an X post explained on the day.\n\n$BTC Binance / Bybit Open Interest & Delta\n\nlol open interest has already been stacked back on here with tight price compression\n\n~ often leads to volatility\n\n\n\nlooks more like shorts positioning for a break lower, in which these shorts will want to see continued spot selling else… pic.twitter.com/CSueEXEUU3 — Skew Δ (@52kskew) December 26, 2023\n\nSolana retains lion’s share of major gains\n\nNot all major cryptocurrencies fared as badly into the yearly close.\n\nRelated: BTC price up 160% in 2023 — 5 things to know in Bitcoin this week\n\nIn contrast to Bitcoin and largest altcoin Ether (ETH), both Binance’s BNB (BNB) and Solana’s SOL (SOL) continued to put in impressive weekly performances.\n\nBNB/USD and SOL/USD were up 19.5% and 56.8% over the past seven days, respectively, at the time of writing, while ETH/USD was just 1.6% higher.\n\nAs Cointelegraph reported, Solana had benefited from a combination of increased gas fees and airdrops, hitting nearly $126 on Christmas Day — its highest since April 2022.\n\nSOL/USD 1-week chart. Source: TradingView\n\nPreviously, traders had eyed a chance for altcoins to shine as first-mover Bitcoin lost momentum.\n\nFor Michaël van de Poppe, founder and CEO of trading firm MN Trading, proof lay in a noticeable trend change for the overall altcoin market cap.\n\nTotal market capitalization for Altcoins is finally breaking out of a range of 500+ days,” he told X subscribers on Christmas Eve.\n\n“Retest took place and found sufficient amount of support, which means that Q1 is likely bringing a 2x on the Altcoin market capitalization.”\n\nTotal altcoin market cap annotated chart. Source: Michaël van de Poppe/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWluZmxvd3MtZHdhcmYtMTUwLWNyeXB0by1ldHAtdG9kYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETF inflows could dwarf all 163 crypto ETPs today - Cointelegraph",
        "content": "United States-approved spot Bitcoin exchange-traded funds (ETFs) could end up dwarfing the entire $50 billion crypto-related ETF market today.\n\nAccording to new data from BitMEX research, the current global market for crypto exchange-traded products (ETPs) includes approximately 163 products totaling $50.6 billion in assets under management.\n\nNew products have been added to the list.\n\n\n\n163 crypto related ETPs have now been identifiedhttps://t.co/jbOPeNgxUg https://t.co/yooaO48iKR — BitMEX Research (@BitMEXResearch) December 26, 2023\n\nThe list includes spot and futures funds, and typically track the performance of Bitcoin and Ethereum. The largest ETP on the list is Grayscale’s Bitcoin Trust — which is currently attempting to be converted into a spot ETF product.\n\nMarket commentators believe the approval of a spot Bitcoin ETF — widely pegged to be approved by the SEC as early as Jan. 10 — could eventually double the amount of money invested in crypto ETPs.\n\nOn Dec. 14, crypto investment fund Bitwise predicted that spot Bitcoin ETFs would be the most successful ETF product ever launched, expecting them to capture some $72 billion in assets under management within the next five years — more than doubling the current market.\n\nOffering a more sober outlook, global fund manager Van Eck estimated that roughly $2.4 billion would flow into a spot Bitcoin products in the first quarter of 2024.\n\nWhile a spot Bitcoin ETF has never been approved in the U.S., such a product is far from a brand-new development in a global context. Several countries including Canada, Australia, and Germany, already allow investors to buy shares in spot Bitcoin ETFs.\n\nRelated: 2 risks around Bitcoin ETF launch that no one’s talking about\n\nThe optimism around spot Bitcoin ETF reflects a wider trend of institutional investment in crypto investmen products over the past few months.\n\nA Dec. 21 report from ETF research firm ETFGI revealed that crypto ETFs listed across the globe had attracted year-to-date net inflows of $1.6 billion, with $1.31 billion of that sum being added in November alone. This total investment is nearly double the $750 million net inflows into crypto ETPs in 2022.\n\n$1.3 billion was added to crypto ETFs in November alone. Source: ETFGI\n\nOf the 163 crypto funds, the top 20 ETFs attracted the largest volume of investment, with a total of $1.3 billion flowing into them over the course of 2023.\n\nThe ProShares Bitcoin Strategy ETF (BITO) — launched during a crypto bull market in October 2021 — witnessed the largest individual inflows, capturing an additional $278.7 million in 2023.\n\nUpdate (Dec. 27, 10:11 pm): This article has been updated to include updated crypto ETP figures from Bitmex Research.\n\nMagazine: DeFi’s billion-dollar secret: The insiders responsible for hacks"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ncmF5c2NhbGUtYml0Y29pbi1ldGYtYXBwbGljYXRpb24tYmFycnktc2lsYmVydC1kZXBhcnR1cmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Grayscale refiles Bitcoin ETF application as Barry Silbert departs - Cointelegraph",
        "content": "Crypto asset manager Grayscale lodged an amended S-3 filing with the United States securities regulator on the same day Barry Silbert — the CEO of its parent company Digital Currency Group — announced his resignation from Grayscale’s board of directors.\n\nSome crypto market commentators speculate that Silbert’s departure could significantly increase the odds that Grayscale will successfully convert its Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF, currently awaiting a decision from the Securities and Exchange Commission.\n\nBarry's resignation was @Sonnenshein's X-Mas gift.\n\n\n\nWhat to make of @bsilbert resigning from Grayscale?\n\n\n\nGrayscale has had 9 meetings with the SEC per the table below (h/t @JSeyff)\n\n\n\nToday, there are only allegations against DCG which have not been resolved in a court of law.… https://t.co/d7tZFFAOoU pic.twitter.com/NjjdWq0F3a — Ram Ahluwalia CFA, Lumida (@ramahluwalia) December 26, 2023\n\nLumida Wealth CEO Ramah Luwalia speculates that Silbert’s resignation was likely of his own accord to improve the odds of the ETF approval — due in large part to the SEC’s ongoing investigation into Silbert and DCG.\n\nAdam Cochran, a partner at crypto venture capital firm Cinneamhain Ventures, speculates Silbert’s decision to step down was “for sure an agreement” made between Grayscale and the SEC ahead of the conversion request being approved.\n\nAnd there it is, this step down is for sure an agreement for Barry to be out for Grayscale to join the ETF ranks.\n\n\n\nGlad I loaded up on GBTC and ETHE with the higher discount today. https://t.co/89G2QVOAEJ — Adam Cochran (adamscochran.eth) (@adamscochran) December 26, 2023\n\nSilbert’s departure was noted in an 8-K filing to the SEC filed on Dec. 26, with the firm announcing that DCG’s chief financial officer, Mark Shifke would succeed Silbert as chairman of the board at Grayscale.\n\nOutside of Silbert stepping down, the most notable element of the amended S-3 filing was that Grayscale had “finally surrendered” to a cash creation model, according to senior Bloomberg ETF analyst Eric Balchunas.\n\nGrayscale finally surrendering to cash-only creations, was a big holdout. Pretty sure they have an AP agreement (a crucial last step) so that would check all the boxes. That said, still a mystery whether they will be allowed to go on day one of the Cointucky Derby https://t.co/Wm7TfD3zkP — Eric Balchunas (@EricBalchunas) December 26, 2023\n\nCash vs. in-kind creations have been an ongoing point of conflict between asset managers looking to launch a spot Bitcoin ETF and the SEC.\n\nRelated: Spot Bitcoin ETF inflows could dwarf all 163 crypto ETPs today\n\nWhile most stock and commodity-based ETFs run on an in-kind model — which allows fund market participants to directly handle the asset in the fund — a cash-creation model means that new shares in a spot Bitcoin ETF could only be created or redeemed through cash transactions.\n\nThe SEC’s move to prevent broker-dealers from dealing directly with Bitcoin has been viewed as an attempt to better track the Bitcoin moving from exchanges and mitigating any potential risks associated with anti-money laundering or Know Your Customer compliance.\n\nScott Johnsson, general partner at VB Capital, noted that while the SEC purports to stand for investor protection, the cash creation model could pose a greater risk to investors looking to gain exposure to Bitcoin through a spot ETF.\n\nGrayscale's amended S-3 gives a nice little background on the key sticking point for in-kind creation/redemption. The SEC promulgated rulemaking for digital asset safekeeping. Despite the fact that BDs and exchanges apparently believe they could comply with the rule and offer… pic.twitter.com/SdudYdsgoR — Scott Johnsson (@SGJohnsson) December 27, 2023\n\n“Despite all other spot commodity ETFs operating with in-kind models, this must be done in a novel way via cash and who knows if that will work,” wrote Johnsson.\n\nMagazine: DeFi’s billion-dollar secret: The insiders responsible for hacks"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGVzZS0zLWJpdGNvaW4tbWV0cmljcy1mcmVzaC1idGMtcHJpY2UtbW92ZS1pbW1pbmVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "These 3 Bitcoin metrics say a fresh BTC price move is 'imminent' - Cointelegraph",
        "content": "Bitcoin (BTC) is showing classic signs that fresh BTC price gains are near, one longtime market participant says.\n\nIn a post on X (formerly Twitter) on Dec. 27, trader and popular social media commentator Matthew Hyland predicted “imminent” bullish moves.\n\nTrader on BTC price: “Seems like a move is imminent”\n\nBitcoin may have flagged over Christmas, dipping to lows of $41,650, per data from Cointelegraph Markets Pro and TradingView — but the tide could soon change.\n\nFor Hyland, two key BTC price indicators point the way to a short-term reversal.\n\nComing in the form of Bollinger Bands and the relative strength index (RSI), these have provided advance notice of upside in recent months.\n\n“Daily Bollinger Bands are back to squeezing to the level that triggered the last two moves up through $30k and $40k. With the Daily RSI at 2-month lows, & the 3-Day MACD currently crossing down with less than 3 days to negate,” he wrote.\n\n“It seems like a move is imminent here.”\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBollinger Bands constrict\n\nBollinger Bands are a popular volatility indicator that closely tracks BTC price action and suggests when volatility could break out.\n\nCurrently, the daily-timeframe bands are narrowing after a period of expansion — something which, while not necessarily straightaway, precedes a new round of volatility.\n\nEarlier this year, the bands collapsed to an extremely narrow position, Cointelegraph reported, in the run-up to the recovery above $30,000.\n\nHyland posted an accompanying chart showing how comparatively tight the bands currently are.\n\nBTC/USD chart with Bollinger bands data. Source: Matthew Hyland/X\n\nRSI flushes out “oversold” levels\n\nThe relative strength index (RSI) has proven a faithful tool for Bitcoin traders during the Q4 bullish comeback.\n\nThe classic momentum oscillator, which offers an insight into how overbought or oversold BTC/USD is at a given price, has seen something of a reset on daily timeframes in the second half of December.\n\nBTC/USD 1-day chart with RSI. Source: TradingView\n\nNow at 53, RSI is firmly below the “overbought” 70 line — and even further below its month-to-date peak of 76.\n\nLonger timeframes are just as promising, as noted last week by veteran trader Peter Brandt.\n\nSome analysts claim that Bitcoin is terribly overbought.\n\nIn fact, the monthly RSI is currently at the sweet spot where previous bull markets have greatly accelerated their advances. Not predicting this -- just pointing it out. #bitcoin $BTC $BTCUSD pic.twitter.com/XBrDYMKaMc — Peter Brandt (@PeterLBrandt) December 21, 2023\n\n“Daily RSI currently at lowest levels in over two months; when price was below $27k,” Hyland, meanwhile, added in a separate X post.\n\nMACD counts down for bears\n\nOne other indicator, however, may yet throw a spanner in the works when it comes to a happy new year for Bitcoin bulls.\n\nRelated: BTC price up 160% in 2023 — 5 things to know in Bitcoin this week\n\nBTC/USD 3-day chart with MACD. Source: TradingView\n\nThis is moving average convergence divergence (MACD), which on three-day timeframes is threatening a bearish trend flip.\n\nHyland noted that several days remain in order for the signal to “negate” itself thanks to price action.\n\n“Cross was 100% accurate the whole year leading to lower and higher prices after,” part of further commentary on Dec. 27 read.\n\n#Bitcoin 3-Day MACD currently crossing down\n\n\n\nNext 3-Day candle closes in 3 days so 3 days to negate based on priced action\n\n\n\nCross was 100% accurate the whole year leading to lower and higher prices after\n\n\n\nThe last bull cross up occured around $27k which we updated at time https://t.co/wffcBEa2Y9 — Matthew Hyland (@MatthewHyland_) December 27, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmJubmJsb29tYmVyZy5jYS9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLWxlYWRzLWNyeXB0by1zdG9jay1zdXJnZS0xLjIwMTU5MTnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Marathon Leads Crypto Stock Surge - BNN Bloomberg",
        "content": "(Bloomberg) -- Maybe now more so than ever, the investment strategy of loading up on pick-and-shovel makers during the middle of a gold rush is playing out in the cryptocurrency world.\n\nShares of Bitcoin miners such as Marathon Digital Holdings and Riot Platforms are significantly outperforming the largest digital currency, posting gains this year of more than 800% and 400%, respectively. Meanwhile, the US crypto exchange Coinbase Global and Bitcoin proxy MicroStrategy have each jumped more than 350% during the same time period. Bitcoin is up around 160% in 2023.\n\nBitcoin mining is an energy-intensive process in which miners use specialized computers to validate transactions on the Bitcoin blockchain and earn rewards in the token.\n\nThe surge in the stocks comes as digital-asset mining companies expand operations to increase Bitcoin production with expectations that demand for the cryptocurrency will jump if US regulators allow exchange traded funds to hold it directly. In the next two weeks, Bloomberg Intelligence analysts forecast that the Securities and Exchange Commission will approve a spot Bitcoin ETF.\n\nRiot Platforms recently announced large purchases of mining machines. Marathon, the largest miner by computing power, acquired new facilities to increase its mining efficiency, a notable shift from its long-held strategy as an asset-light mining company.\n\n“Marathon Digital’s announcement of acquiring new sites last week could lead to stronger mining efficiency metrics,” said Brian Dobson, managing director of equity research at investment bank Chardan. “That’s what the investors are focused on.”\n\nMarathon has gained for 11 consecutive trading sessions, more than doubling over that period to $31.07. The stock traded at more than $80 when Bitcoin reached its record high in November 2021.\n\nThe mining stocks may see more buying pressure and a short squeeze if the rally continues, pushing the prices even higher, according to Ihor Dusaniwsky, managing director of predictive analytics at S3.\n\nLike the majority of cryptocurrencies, most crypto stocks began 2023 at the lowest price levels of the year after a series of industry scandals and bankruptcies such as the collapse of the FTX exchange, making them a popular target to bet against.\n\n“The price move was not due to short covering from a short squeeze but from long buying pressure,” Dusaniwsky said. “MARA has a 100/100 squeeze score and if its stock price continues its recent trend, we should see more short covering and a definite short squeeze.”\n\nThe CoinShares Blockchain Global Equity Index is up 29% in December, on pace for its best month on record.\n\n©2023 Bloomberg L.P."
    }
]