[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzA2LzMwL2JpdGNvaW4tc2xpcHMtYWZ0ZXItc2VjLXJlcG9ydGVkbHktY2FsbHMtZXRmLWZpbGluZ3MtaW5hZGVxdWF0ZS1idXQtaXMtaGVhZGluZy1mb3ItYS13aW5uaW5nLW1vbnRoLmh0bWzSAYsBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDYvMzAvYml0Y29pbi1zbGlwcy1hZnRlci1zZWMtcmVwb3J0ZWRseS1jYWxscy1ldGYtZmlsaW5ncy1pbmFkZXF1YXRlLWJ1dC1pcy1oZWFkaW5nLWZvci1hLXdpbm5pbmctbW9udGguaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin briefly falls after SEC reportedly calls ETF filings inadequate, but posts a winning month - CNBC",
        "content": "The price of bitcoin fell Friday following a report that recent bitcoin filings from big names such as BlackRock and Fidelity have been deemed inadequate in the eyes of the U.S. Securities and Exchange Commission.\n\nBitcoin finished the day below the flat line at $30,398.43, according to Coin Metrics. Earlier, it briefly fell under the $30,000 level, after rising as high as $31,260.52.\n\nBitcoin ended the week down 1.5%. Nevertheless, it finished the month up 12.3%, following a down month in May, which was the cryptocurrency's first losing month of the year and worst month since November 2022. June's positive performance brought its year-to-date gains to 83%.\n\nThe move came after The Wall Street Journal reported Friday that the SEC told Nasdaq and Cboe Global Markets, both of which filed bitcoin exchange-traded funds applications on behalf of various institutions this month, that the filings aren't sufficiently clear or comprehensive.\n\nSpecifically, the SEC said it returned the filings because they didn't name the spot bitcoin exchange that the Nasdaq and Cboe would have a \"surveillance-sharing agreement\" with or provide enough detail about the arrangement, according to the report.\n\nThe filings can be resubmitted. A Cboe spokesperson told CNBC that the exchange plans to update and refile."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMzAvYml0Y29pbi1zbHVtcC0zMDAwMC1zZWMtc3BvdC1ldGYtYXBwbGljYXRpb25zLWluYWRlcXVhdGUtbmFzZGFxLWNib2UtYmxhY2tyb2NrL9IBeWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMzAvYml0Y29pbi1zbHVtcC0zMDAwMC1zZWMtc3BvdC1ldGYtYXBwbGljYXRpb25zLWluYWRlcXVhdGUtbmFzZGFxLWNib2UtYmxhY2tyb2NrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin slumps below $30,000 after SEC says new ETF filings by BlackRock and others are ‘inadequate’ - Fortune",
        "content": "The price of the world’s largest cryptocurrency by market capitalization slumped on Friday morning from above $31,000 to briefly below $30,000, dropping approximately 3% in a matter of minutes.\n\nThe sudden dip in Bitcoin follows a report from the Wall Street Journal that the U.S. Securities and Exchange Commission told securities exchanges Nasdaq and Cboe their applications for a Bitcoin spot exchange-traded fund, which they submitted on behalf of asset managers like BlackRock, were “inadequate.”\n\nNasdaq and Cboe weren’t specific enough in their filings, the U.S. regulatory agency said, pointing out that their ETF applications did not outline the nature of surveillance-sharing agreements—key provisions to allay the SEC’s concern over market manipulation—that BlackRock, Fidelity, and other asset managers had touted. It also said the exchanges did not name the Bitcoin spot exchanges the asset managers planned to partner with in these agreements.\n\nThe SEC’s reported comments may just be a temporary setback, however, as Bloomberg ETF analyst Eric Balchunas pointed to a section of the Journal’s report in which the agency said the exchanges can update their applications and refile. Balchunas added the report is “arguably good news.”\n\nThe drop in Bitcoin’s price follows a weeks-long rally that saw the cryptocurrency reach its highest price in more than a year amid a flurry of ETF applications from big institutions.\n\nIn mid-June, BlackRock, the U.S.’s largest asset manager, filed an application for a Bitcoin spot ETF. As of yet, no asset manager has successfully received the SEC’s approval for such an ETF, which would expose Bitcoin to trillions in dollars from brokerage accounts and pension funds. (The SEC has approved, however, a Bitcoin futures ETF.)\n\nThe crypto market rallied on news of BlackRock’s filing, optimistic that a firm of its stature would be the first to successfully pass the federal agency’s muster and prove that, through a surveillance-sharing agreement with Nasdaq, it can weed out market manipulation, a reason the SEC has repeatedly cited in its denials of Bitcoin spot ETF applications.\n\nOther large asset managers, including WisdomTree, Invesco, Bitwise, ARK Invest, and Fidelity, followed BlackRock’s lead, and either resubmitted or updated existing ETF applications with their own surveillance-sharing agreements.\n\nBitcoin responded accordingly and has consistently traded above $30,000 in the latter half of June, an almost 100% increase in price since January."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNi0zMC9iaXRjb2luLWJ0Yy1zZXQtZm9yLXNlY29uZC1xdWFydGVybHktZ2Fpbi1hcy1zbWFsbGVyLXRva2Vucy1sYWctbW9zdC1zaW5jZS0yMDIw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Set for Second Quarterly Gain as Smaller Tokens Lag by the Most Since 2020 - Bloomberg",
        "content": "Bitcoin registered a second straight quarterly gain, tightening its grip on crypto markets as smaller tokens nurse losses.\n\nThe largest digital asset rose 7% in April through June, aided by optimism about increasing demand if BlackRock Inc., Fidelity Investments and others succeed in their efforts to start spot Bitcoin exchange-traded funds in the US."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vY2JvZS1maWxlcy10by1saXN0LWJpdGNvaW4tc3BvdC1ldGYtZnJvbS1maWRlbGl0eS03NTU1NDg00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Renews Push For Spot Bitcoin ETF Listed on CBOE - Investopedia",
        "content": "Fidelity Investments, which has $11 trillion in assets under management, has renewed its push to launch a spot bitcoin exchange traded fund (ETF) listed on the CBOE, according to a new CBOE filing with the U.S. Securities and Exchange Commission (SEC).\n\nKey Takeaways Cboe has filed to list a new bitcoin spot ETF managed by Fidelity Investments.\n\nFidelity had previously had their Wise Origin Bitcoin Trust application rejected by the SEC.\n\nMany traditional financial institutions have recently entered the race to launch the first bitcoin spot ETF in the U.S. following an application from BlackRock earlier this month.\n\nFidelity Mirrors Traditional Finance's Push For Crypto\n\nFidelity's Wise Origin Bitcoin Trust was previously rejected by the SEC, but this new filing from Cboe indicates Fidelity is making another attempt at getting regulatory approval for their bitcoin spot ETF.\n\nThe move comes after BlackRock (BLK) filed an application for a spot ETF and follows in the footsteps of other traditional financial institutions such as Invesco (IVZ) and Wisdomtree (WT) that revived their previously rejected applications.\n\nMarket-watchers have taken note of these developments, viewing them as significant due to BlackRock's reputation and confidence in obtaining regulatory approval. Investors too, have taken the cue, driving bitcoin prices to fresh highs.\n\nThere have been dozens of attempts to launch a spot-bitcoin product in the past, but many have faced opposition from regulators citing market concerns and investor protection.\n\nOne of the reasons commentators have been bullish on the prospect of BlackRock's bitcoin spot ETF approval is that it includes a surveillance sharing agreement with an unnamed bitcoin exchange based in the U.S., and this sort of arrangement is also mentioned in Cboe's recent filing.\n\n\n\nOther issuers, which include Valkyrie, Bitwise, VanEck, and ARK Investment Management, remain hopeful of securing regulatory approval this time around. Notably, this isn't the only area of crypto where traditional financial powerhouses are getting involved, as a new crypto asset exchange backed by Charles Schwab (SCHW), Fidelity, and others also recently launched.\n\nThis new interest from traditional financial institutions has clearly breathed new life into the crypto market after the industry had been shaken by SEC lawsuits against crypto exchange giants Binance and Coinbase (COIN)."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzI5L2Fzc2V0LW1hbmFnZXItZmlkZWxpdHktZmlsZXMtZm9yLXNwb3QtYml0Y29pbi1leGNoYW5nZS10cmFkZWQtZnVuZC_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yOS9hc3NldC1tYW5hZ2VyLWZpZGVsaXR5LWZpbGVzLWZvci1zcG90LWJpdGNvaW4tZXhjaGFuZ2UtdHJhZGVkLWZ1bmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Refiles for Spot Bitcoin ETF - CoinDesk",
        "content": "So far, the SEC has not made a decision regarding any of the new applications. While many seem optimistic about the application from BlackRock – which has received a green light for all of its previous 575 ETF applications, except one – some remain skeptical."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS90b3BpY3MvYmxvY2tjaGFpbi93aGF0LWlzLWEtYml0Y29pbi1taXhlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "What Is a Bitcoin Mixer? - Ledger",
        "content": "What Is a Bitcoin Mixer?\n\nBy Lipsa Das\n\nRead 6 min Medium\n\nSHARE\n\nKEY TAKEAWAYS: — Bitcoin mixers are software or third-party services that mix up your Bitcoin funds with other users’ funds to reduce the tracing of transactions.\n\n\n\n— There are two types of mixers: centralized mixers and decentralized mixers. Centralized mixers use a third party, while decentralized mixers use open-source protocols to mix transactions.\n\n\n\n— Crypto mixers offer users anonymity which can be integral to those living under oppressive regimes, but it can also open the door for criminal activity.\n\n\n\n— There are many potential risks of using mixers, such as violating local laws, receiving wallet flags, platform bans and more.\n\nFirst introduced in 2009, Bitcoin allows users to transact and trust each other across borders without needing banks 24/7. If that seems unfamiliar to you, make sure to read the guide on what Bitcoin is. However, for the purposes of this article, it’s important to understand that these benefits come with a trade-off.\n\nOne of the core concepts of what blockchain is offering — transparency — is not exactly privacy-friendly. To explain, the blockchain is freely available to everyone, and you can read every transaction on sites like block explorers. With this information and additional external data, you can link an arbitrary Bitcoin address to its owner. So, what do you do when you’d prefer not to share this information?\n\nMost people will never need to hide their blockchain transactions. However, for those living under oppressive regimes and require the freedom of moving their assets where they like, tools to protect users’ identities become imperative. But unfortunately, the very same tools that help such people survive also encourage bad actors.\n\nSpecifically, these tools are named crypto tumblers, or mixers and let you make anonymous transactions on the blockchain.\n\nBut what is a Bitcoin mixer exactly; how do they work, and are they even legal?\n\nLet’s dive in.\n\nWhat Is a Bitcoin Mixer?\n\nBitcoin mixers, also known as tumblers, are services that receive cryptocurrencies from users, pool them together, and then send the amounts to their corresponding recipient addresses. This is an effort to obfuscate the transaction trail.\n\nTo explain, if you’re using a mixer, the mixer’s address becomes the recipient of any outgoing transactions from your wallet instead of a specific Bitcoin address. Similarly, in the case of a recipient’s address, the address is again that of the Bitcoin mixer. If you want to see this in action, here’s how to read blockchain transactions.\n\nMixing funds hides the original sources, making it difficult for external observers to identify the specific senders or recipients.\n\nDepending on the mixer, service fees are generally quite low, ranging from 0.5% to 7% of the transaction.\n\nWhat Is a Bitcoin Mixer For?\n\nBitcoin mixers make crypto transactions harder to trace, thus preserving privacy and hiding the sender’s identity. Essentially, they serve as a way to anonymize crypto transactions.\n\nSo why would you want to use a crypto mixer?\n\nFirstly, many people using mixers live in countries with oppressive regimes. Not every country gives its citizens the same rights, meaning outspoken journalists, members of opposition parties, or even normal civilians may be in danger for expressing opposing views or beliefs. If citizens of such countries use a transparent transaction on the blockchain, they could be putting themselves at risk.\n\nSecondly, whistleblowers and investigative journalists can also benefit from this tool. Using a crypto mixer means they can pay and get paid for information across borders, but without revealing their sources.\n\nOf course, ‘anonymity’ also encourages bad actors to exist. Scammers often want to hide their identities, and crypto mixers are their tools of choice.\n\nFor instance, Bitcoin tumblers have a long history of money laundering and scams, with the first notable case in December 2013. Just four years after Bitcoin’s launch, the mixer Bitcoin Fog was used to launder 96000 BTC from a marketplace. These incidents continued well into 2021, with Bitcoin Fog allegedly funneling over $1.3 million BTC. US authorities finally arrested the founder of this tumbler, Roman Sterlingov, in 2021.\n\nSince then, US authorities have sanctioned many high-profile mixers, namely Blender.io and Tornado Cash. Similarly, German authorities also took down the infamous Chipmixer, and seized over $46 million in cryptocurrency.\n\nHow Do Crypto Mixers Work?\n\nCrypto mixers collect Bitcoin from their users, merge their transactions, and redistribute it.\n\nTo better understand this concept, let us take the example of a charity receiving donations anonymously. Instead of directly donating, multiple donors could pool their funds together and designate a third party to complete the actual transaction. As a result, the charity receives the donation without knowing the specific source.\n\nReplace this third party with a smart contract, and that’s essentially the foundation of a Bitcoin mixer. Usually, mixers also incorporate a slight delay in sending the Bitcoin to the destination address to avoid further detection.\n\nBitcoin mixers are of two types: centralized mixers and decentralized mixers.\n\nCentralized Mixers vs. Decentralized Mixers\n\nCentralized mixers are operated by private third-party services that users trust to mix their Bitcoin, while decentralized mixers are peer-to-peer protocols with an automatic mixing process.\n\nUsing centralized mixers, users send their funds to wallet addresses owned by these mixers, pay a service fee and mention where they want to send it. Once the mixer receives these funds, they combine them with other users’ funds in a pool and redistribute them. Good examples of centralized mixers include Yo!Mix and Mixtura.\n\nCentralized mixers, particularly, carry the additional risk of trusting a third party. You could potentially lose your funds if the network or the company shuts down. Since these mixers handle a large amount of money, they become attractive targets for hackers and pose risks of potential malicious intent from the company itself. Some centralized mixers might also save your info privately and tie you back to these transactions—and that defeats their whole purpose.\n\nOn the other hand, decentralized mixers use an open-source protocol, such as CoinJoin, to create an automatic permissionless mixing process. Essentially, they bank on multiple users using the protocol. Then, they consolidate their funds to a single large transaction, and route different Bitcoins to the destination addresses. The more people that use a decentralized mixer, the more efficient they become. That’s because an increased number of users reduces the odds of detection. A good example of a decentralized crypto mixer that uses CoinJoin includes JoinMarket.\n\nThe Wider Risks of Crypto Mixers\n\nWhile crypto mixers offer a degree of anonymity, it’s important to note that it’s not impossible to find out who sends and receives funds in this manner. Unfortunately, some crypto mixers aren’t as anonymous as they claim, and some are subject to local laws and regulations.\n\nFor example, Law enforcement agencies (such as the FBI) have sophisticated tools to trace the origin of funds sent through crypto mixers. This is easier to discover on mixers with limited users, or when tracking large sums of value.\n\nIn the case of fewer people participating in the service, tracing funds is simple. Since it’s less likely another user sent a similar amount of Bitcoin as yours, working out the source is entirely plausible. This can be particularly useful when trying to catch bad actors, but it also leaves people living under oppressive regimes vulnerable.\n\nFurther, some exchanges actively block these “mixed” tokens and coins due to security and compliance concerns. Thus, if using a crypto mixer, you might face similar issues across major exchanges, limiting how you can use crypto assets. So, while there are countless legitimate reasons to obfuscate your transactions, it’s often simply not that easy.\n\nBitcoin Mixers: Are They Illegal?\n\nWhile Bitcoin mixers are not illegal everywhere, many countries do limit their use, or even ban them entirely. Plus, since these mixing services can lend themselves to money laundering, they often attract increased scrutiny from regulators. Regulatory authorities often view mixers with suspicion, as they can hinder law enforcement efforts to track and trace suspicious transactions.\n\nTo combat this, countries like the US have placed restrictions on crypto mixers since they deal with money transfers. The US financial law enforcement agency, FinCEN, requires all mixers to register under the Bank Secrecy Act.\n\nFurther, in 2022, the US placed sanctions on major crypto mixers like Tornado Cash and Blender.io. The US Treasury held that Tornado Cash had been used for laundering over 7 billion dollars since its creation. Similarly, Blender.io helped a North Korean hacker group launder money.\n\nThese sanctions prohibit U.S. persons from doing business with both these services and freeze any assets they may have in the United States.\n\nSince many countries handle crypto mixers differently, consult your local crypto laws before using them.\n\nCan I Use a Crypto Mixer?\n\nSo, crypto mixers offer a novel way to benefit from the security and accessibility of the blockchain, without the burden of revealing your identity. For those under oppressive regimes or with political difficulties, this may be the only option. However, if you decide to use a crypto or Bitcoin mixer, it’s important to understand the risk involved. Before using any service that may obfuscate the origin of a specific set of funds, make sure you check your local laws and abide by them. You don’t want to use a crypto mixer and pay the price for it later.\n\nIf you want to keep your anonymity in crypto though, using a crypto mixer can be an interesting option. Only you know if using a crypto mixer is right for you. Now you know about how they work, you can navigate the market and decide whether that’s the right choice—because that’s the whole point of self-custody."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTMwL2ZpZGVsaXR5LWxlYWRzLWZsdXJyeS1vZi1iaXRjb2luLWJ0Yy1ldGYtcmVmaWxpbmdzLXRvLWFuc3dlci1zZWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Crypto Spot Bitcoin ETFs Re-Filed After SEC Expresses Caution (BTC, COIN) - Bloomberg",
        "content": "In a flurry of Friday afternoon activity, Fidelity Investments led a handful of firms that filed a fresh set of applications for a spot-Bitcoin exchange-traded fund to add new details after the US Securities and Exchange Commission indicated that the initial filings were insufficient.\n\nThe companies — which also include Invesco, VanEck, 21Shares and WisdomTree — are among eight that are seeking to launch what would be an initial crop of US spot Bitcoin ETFs. BlackRock Inc. set off the wave with its surprise filing for such a fund in mid-June."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMzAvYml0Y29pbi10dW1ibGVzLW9uLXJlcG9ydC1vZi1zZWMtc2F5aW5nLXNwb3QtYnRjLWV0Zi1maWxpbmdzLWluYWRlcXVhdGUv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8zMC9iaXRjb2luLXR1bWJsZXMtb24tcmVwb3J0LW9mLXNlYy1zYXlpbmctc3BvdC1idGMtZXRmLWZpbGluZ3MtaW5hZGVxdWF0ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Tumbles on Report of SEC Saying Spot BTC ETF Filings Inadequate - CoinDesk",
        "content": "BlackRock's spot ETF filing in mid-June had been the impetus for a strong run higher in the price of bitcoin since, sending the crypto from below $26,000 to one-year highs above $31,000. The BlackRock application also set off a host of filings from several other asset managers, including fellow asset management giants Invesco (IVZ) and Fidelity, both of which refiled for approval of their previously rejected spot bitcoin ETFs."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjkvZmlkZWxpdHktam9pbnMtdGhlLXJ1c2gtZm9yLWEtYml0Y29pbi1ldGYtZm9sbG93aW5nLWJsYWNrcm9jay1hcmstaW52ZXN0LWFuZC1vdGhlcnMuaHRtbNIBfGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA2LzI5L2ZpZGVsaXR5LWpvaW5zLXRoZS1ydXNoLWZvci1hLWJpdGNvaW4tZXRmLWZvbGxvd2luZy1ibGFja3JvY2stYXJrLWludmVzdC1hbmQtb3RoZXJzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity joins the rush for a bitcoin ETF, following BlackRock, Ark Invest and others - CNBC",
        "content": "Asset management giant Fidelity Investments is again trying to launch a spot bitcoin exchange-traded fund, according to a Thursday filing.\n\nThe move comes two weeks after BlackRock filed for a spot bitcoin ETF, which has long been opposed by the U.S. Securities and Exchange Commission.\n\nOther firms appear to have taken BlackRock's filing as a sign that the SEC's stance could soon change. Since then, WisdomTree, VanEck and Invesco have taken the initial steps toward their own funds. Cathie Wood's Ark Invest filed for changes to its proposed bitcoin fund Wednesday that brought it closer in line with BlackRock's application.\n\nThursday's filing is a proposed rule from the Cboe BZX Exchange to list the Wise Origin Bitcoin Trust, the name of Fidelity's previously proposed bitcoin ETF that was denied by the SEC. The exchange has made similar filings for other firms over the past two weeks.\n\nThe SEC has so far rejected every spot bitcoin fund application on which it has made a decision. The commission is in a legal battle with Grayscale about its decision to block the conversion of the Grayscale Bitcoin Trust into an ETF. A decision in that case is expected later this year.\n\nOne of the SEC's key concerns about a spot bitcoin product is transparency in the market and the potential for manipulation. The BlackRock filing includes a proposed surveillance-sharing agreement that could alleviate those concerns. The subsequent filings have similar proposals.\n\nThe SEC has already allowed the creation of ETFs that track bitcoin futures contracts, including the ProShares Bitcoin Strategy ETF (BITO) that has more than $1 billion in assets. The first leveraged bitcoin futures fund hit the market Tuesday.\n\nThe new rush for ETFs appears to have buoyed prices for bitcoin. The digital currency was trading near $30,500 Thursday afternoon, up from below $26,000 prior to the BlackRock filing."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTMwL3NlYy1xdWVzdGlvbnMtZmlkZWxpdHktYmxhY2tyb2NrLW9uLXNwb3QtYml0Y29pbi1ldGYtZmlsaW5nc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "SEC Pushes Back Against Fidelity, BlackRock Spot Bitcoin ETF Filings - Bloomberg",
        "content": "The US Securities and Exchange Commission is pushing back against a wave of filings by asset managers to launch the first US exchange-traded fund that invests directly in Bitcoin, saying the applications lack clarity and further information is needed before they’re considered for approval.\n\nThe agency told exchanges including Nasdaq and Cboe Global Markets, which filed the applications on behalf of BlackRock and Fidelity Investments, that their filings are insufficient, according to people familiar with the matter. A Cboe spokesperson confirmed that it will refile on the behalf of Fidelity. Nasdaq is working to answer questions and give updates for its next iteration of the filing."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjkvdXMtaW52ZXN0b3JzLWFyZS1kcml2aW5nLWJpdGNvaW5zLXByaWNlLXN1cmdlLWFzLWluc3RpdHV0aW9uYWwtZGVtYW5kLXJpc2VzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjkvdXMtaW52ZXN0b3JzLWFyZS1kcml2aW5nLWJpdGNvaW5zLXByaWNlLXN1cmdlLWFzLWluc3RpdHV0aW9uYWwtZGVtYW5kLXJpc2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "U.S. Investors Are Driving Bitcoin’s Price Surge as Institutional Demand Rises - CoinDesk",
        "content": "\"The current institutional interest we are witnessing is far from the opportunistic FOMO [fear of missing out] we have seen in the past that can push prices up in the short term,\" Kerbage wrote. \"These institutions move slowly and deliberately and invest for the long term—once they are in, they are in.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTI5L2ZpZGVsaXR5LWp1bXBzLWludG8tc3BvdC1iaXRjb2luLWV0Zi1yYWNlLXdpdGgtZnJlc2gtc2VjLWZpbGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Files for Spot-Bitcoin ETF, Joining BlackRock in Crypto Race - Bloomberg",
        "content": "Fidelity Investments is the latest financial services heavyweight to throw its name into the race to offer the first US exchange-traded fund investing directly in Bitcoin.\n\nThe Boston-based asset manager, which has about $11 trillion in assets under administration and has tens of millions of customers, re-filed for the Wise Origin Bitcoin Trust, according to a document submitted Thursday with the US Securities and Exchange Commission. Similar to previous US spot Bitcoin ETF filings in the past few weeks, the updated application says that Fidelity expects to enter into a surveillance-sharing agreement with a US cryptocurrency exchange."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy51YWxycHVibGljcmFkaW8ub3JnL2xvY2FsLXJlZ2lvbmFsLW5ld3MvMjAyMy0wNi0yOS9ydXJhbC1hcmthbnNhcy1jcnlwdG8tbWluZXMtcHJvbXB0LW5vaXNlLWNvbXBsYWludHMtZnJvbS1yZXNpZGVudHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Rural Arkansas 'crypto mines' prompt noise complaints from residents - KUAR",
        "content": "Last month, Gladys Anderson, who lives in the Bono community in Greenbrier, started hearing a loud, unbearable sound.\n\nA constant high-pitched hum, ranging from 60 to 70 decibels, is coming from a cryptocurrency mine built less than a half-mile away from her house.\n\n“You can hear it, especially at night,” she said, gesturing at the corner of her house where the bedrooms are located.\n\nCrypto mines are large collections of computers built to harvest cryptocurrency, a completely digital form of money not reliant on any central authority. The computers in Greenbrier are surrounded by a tall, opaque orange fence and signs that say “no trespassing.”\n\nThe mines are loud because of the fans needed to keep their hardware cool. In Greenbrier they generally run 24/7, staying on even at night.\n\nAnderson says she hears the ringing fan noise in every part of her large house, from the outdoor pool to the garage, to the guest house where her mother lives. When she isn't home, she says the sound is still \"burned into her brain.\"\n\nCarol Goforth is a professor of law at the University of Arkansas, Fayetteville, and has been studying the rise of cryptocurrency.\n\n“There's no coin behind Bitcoin,” she said. “There’s bits of data. There is nothing tangible, nothing physical. It's just alphanumeric sequences stored on computers.”\n\nWhen it comes to owning Bitcoin, the most popular cryptocurrency, Goforth says its value only comes from a belief in its worth by people who own it.\n\n“If I stop being willing to pay for it, it has no value.”\n\nIn some sense that's true of any form of currency. Dollars and cents only have value because society has agreed to give money value. Crypto is entirely electronic, as are most transactions done with actual currency. But with dollars, you can buy almost everything. Goforth says with Bitcoin, you can buy very little and it can be difficult to exchange it for actual currency.\n\nA new state law, Act 851, opened the door for more crypto mines to be built in Arkansas. Rep. Rick McClure, R-Malvern, presented the bill in committee on April 3 and it was signed into law about a week later.\n\n“As long as a data center is operating within the zoning laws, they shouldn't be singled out if they are in compliance with the ordinances that are already there,” McClure said in a legislative committee meeting.\n\nThe law prevents any kind of zoning or sound ordinance laws designed to “discriminate” against crypto mines and data centers. No one spoke for or against the bill, and only two lawmakers voted against it.\n\nA company called Green Digital LLC is drafting plans to build a crypto mine in the small town of Vilonia. According to a city councilman, the site would mimic the one in Greenbrier. Company representatives did not respond to requests for comment.\n\nAccording to an administrator in Faulkner County, the mines in Greenbrier are owned by an LLC called New Rays. When asked for comment on this story, CEO Ethan Wang said journalists are “fake news” and voiced his disappointment in the coverage he has seen so far.\n\nAt a Vilonia city council meeting last week, an ordinance was passed to cap noise in the town at 60 decibels, about the sound of a conversation.\n\nMellissa Blackwell, who lives just outside the Vilonia city limits, voiced her concern about the potential health effects on humans and wildlife in the area.\n\n“When living things are exposed to noise, it changes us,” she said.\n\nCity Councilman Steven Craig said he was indifferent about the mine.\n\n“I am open for any type of business coming to town, as long as you abide by zoning regulations. And that's where I see it might become an issue,” he said.\n\nA big argument for the mines is that they create jobs. Craig said the mine will create at most five new positions, which will probably be outsourced from Little Rock.\n\n“I am all for entrepreneurship and starting a business. If it creates one job, great. If it creates 100 jobs, even better,\" he said. \"Do I think those jobs are going to be coming from citizens within Vilonia? Probably not.”\n\nIn addition to noise complaints, law professor Carol Goforth says crypto mines use too much energy and are bad for the environment.\n\n“Bitcoin mines consume on an annual basis about the total energy consumption Ukraine had before the war.”\n\nBack in Greenbrier, Gladys Anderson says her family is struggling. Her son has autism and is nonverbal. She says he struggles to cope with the noise, but that it would be too much of an ordeal to move.\n\n“Even if I had the funds to do that, my kids have buried pets here. We have planted baby trees,” she said. “And why should I have to move? I was here first, and I'm not disturbing anybody in the community.”\n\nRepublican state Sen. Bryan King told Fayetteville station KUAF he’s considering drafting legislation to stop crypto mining in Arkansas. The north Arkansas city of Harrison has already put its plans for a crypto mine on hold.\n\nIn Vilonia, members of the city’s planning committee will meet Thursday to talk about the next steps of whether to approve plans for a new crypto mine."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5pbnZlc3RtZW50bmV3cy5jb20vaW5kdXN0cnktbmV3cy9uZXdzL3NlY3MtcmVqZWN0aW9uLW9mLWJsYWNrcm9jay1iaXRjb2luLWV0Zi11bmxpa2VseS10by1kZXJhaWwtZXZlbnR1YWwtYXBwcm92YWwtMjM5Mzk30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "SEC's rejection of BlackRock bitcoin ETF unlikely to derail eventual approval - InvestmentNews",
        "content": "Though the Securities and Exchange Commission has reportedly rejected filings for a spot bitcoin exchange-traded fund from BlackRock, Fidelity and a handful of other asset managers, crypto-enthusiasts are optimistic that the product will soon achieve approval.\n\nThe regulator informed exchanges that the filings weren’t sufficiently clear or comprehensive, the Wall Street Journal reported Friday, citing unnamed sources. While there are already ETFs on the market tracking bitcoin futures or companies that work in the cryptocurrency space, the SEC has rejected around 30 applications for an ETF that tracks the actual price of bitcoin since 2017.\n\nCrypto-enthusiasts believe these products will increase participation in bitcoin investing by allowing investors and financial advisors to buy and sell using traditional brokerage accounts. Many hoped the backing of BlackRock, the world’s largest asset manager and provider of ETFs, represented the best chance yet for a product to reach approval.\n\nThe fact that the SEC rejected the applications in just two weeks, rather than use more of the 45-day window it has to make a decision, is actually a good sign that the agency is ready to approve the product, said Steve Sanduski, a certified financial planner who coaches and trains advisors.\n\nPast products were rejected for worries about fraud and market manipulation, while this latest round was rejected for not providing enough information about the plans for “surveillance-sharing agreements” with a bitcoin exchange, according to the WSJ.\n\n“By telling the exchanges exactly what was missing in their filings, the applicants will simply answer those questions and resubmit their application,” Sanduski said in an email. “This practically screams, ‘We’re ready to approve.’”\n\nThe SEC has cracked down on cryptocurrency players recently, including a lawsuit against Coinbase filed on June 8. By hammering rule-breakers in the space, the SEC is clearing the way for firms who operate within the law, Sanduski said.\n\n“Once the SEC gets comfortable that most market manipulation can be rooted out, and any remaining manipulation can be tracked and prosecuted, I think we’ll see the ETFs get approved,” he said.\n\nThe price of bitcoin has surged 20% since BlackRock announced its application. Shares of Coinbase, which is listed as the custodian for BlackRock’s holdings, have climbed 30%.\n\nIn addition to Fidelity, Cathie Wood’s Ark Investment Management, Invesco, WisdomTree, Bitwise Asset Management and Valkyrie have refiled or amended their own applications for a spot bitcoin ETF, according to the WSJ.\n\nIt remains to be seen how much a product will encourage more financial advisors to recommend the asset to clients. Some view the risk of allocating to bitcoin as outweighing the reward — in terms of market volatility and client backlash — while there are also traditionalists who will never change their mind about cryptocurrencies, Sanduski said.\n\n“Over time, as bitcoin continues to prove its resilience, I expect most advisors will get comfortable with it and it will become a rather common allocation,” he said."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTMwL2NpdGFkZWwtYmFja2VkLWV4Y2hhbmdlLXNwYXJrcy1mcmVuenktaW4tYml0Y29pbi1jYXNoLWJjaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Citadel-Backed Exchange Sparks Frenzy in Bitcoin Cash (BTC) - Bloomberg",
        "content": "The opening of a new crypto exchange backed by Citadel Securities has unleashed a speculative mania in Bitcoin Cash, an offshoot of the original digital token, with interest especially high among traders in South Korea.\n\nBitcoin Cash soared as much as 32% to $324 on Friday, taking gains in June to around 170%. The coin is among just four — including bellwethers Bitcoin and Ether — selected to trade on EDX Markets, the institutional-only platform that went live this month."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmdyZWVucGVhY2Uub3JnL3VzYS9uZXdzL2JsYWNrcm9jay1nYW1ibGluZy1vdXItcGxhbmV0LXdpdGgtaXRzLXByb3Bvc2VkLWJpdGNvaW4tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "BlackRock Gambling Our Planet With Its Proposed Bitcoin ETF - greenpeace.org",
        "content": "BlackRock Gambling Our Planet With Its Proposed Bitcoin ETF\n\nWashington, DC (June 30, 2023) – In response to BlackRock’s proposed Bitcoin exchange-traded fund (ETF), Joshua Archer, Greenpeace USA’s Bitcoin Project Lead, stated, “With its proposed Bitcoin ETF, BlackRock is fanning the flames of climate crisis. At this moment, with heat waves covering the southwest and wildfire smoke filling skies across the country, the need for urgent climate action is clear. Given Bitcoin’s destructive climate record, BlackRock and its peers should engage in efforts to clean up the cryptocurrency. Instead, BlackRock is looking the other direction and actively promoting Bitcoin as a mainstream investment. This is accelerating the clock on the Bitcoin carbon time bomb by driving up its exchange value.”\n\nGreenpeace USA’s forthcoming analysis of major banks and asset managers reveals BlackRock as one of Bitcoin’s biggest backers in the financial services industry. The asset manager is a leading investor in the Bitcoin mining industry and promotes Bitcoin adoption through its investment products and services. The energy-intensive nature of Bitcoin mining, coupled with BlackRock’s investments in the sector, raises serious concerns about the company’s contributions to environmental degradation, carbon emissions, and community impacts. Greenpeace USA continues to call on BlackRock to take meaningful action, including a meeting to address Bitcoin’s climate impacts.\n\n###\n\nContact: Gigi Singh, Senior Communications Specialist at Greenpeace USA (+1) 631-404-9977, [email protected]\n\nGreenpeace USA is part of a global network of independent campaigning organizations that use peaceful protest and creative communication to expose global environmental problems and promote solutions that are essential to a green and peaceful future. Greenpeace USA is committed to transforming the country’s unjust social, environmental, and economic systems from the ground up to address the climate crisis, advance racial justice, and build an economy that puts people first. Learn more at www.greenpeace.org/usa."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vbW9uZXkuY29tL3doeS1iaXRjb2lucy1wcmljZS1pcy1yYWxseWluZy1qdW5lLTIwMjMv0gFEaHR0cHM6Ly9tb25leS5jb20vd2h5LWJpdGNvaW5zLXByaWNlLWlzLXJhbGx5aW5nLWp1bmUtMjAyMy8_YW1wPXRydWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Why Bitcoin’s Price Has Rallied to More Than $30,000 - Money",
        "content": "This year has been a litmus test for the crypto market as it determines whether it can bounce back from a dismal 2022.\n\nIn June, bitcoin's price hit its highest point of the year thus far, topping out at around $31,200 per coin. But on Friday, bitcoin's price dipped below $30,000 once again before recovering some of the losses.\n\nMuch of the volatility is being attributed by market watchers to news that more traditional financial firms are looking for ways to be involved in the crypto market. Investment companies BlackRock and Fidelity both filed for spot bitcoin exchange-traded funds (ETFs) this month, coinciding with the start of a bitcoin rally that brought the coin’s price up by over $6,000 per coin.\n\nBut on Friday, The Wall Street Journal reported that the Securities and Exchange Commission (SEC) says those filings may not be adequate. Here's what investors need to know.\n\nWhat is a spot bitcoin ETF?\n\nBitcoin futures ETFs are already on the market, so you may be wondering what the difference is between a bitcoin futures ETF and a spot bitcoin ETF. Most simply, the difference is that a spot bitcoin ETF would directly follow the price of bitcoin, while bitcoin futures ETFs track the price of bitcoin futures contracts.\n\nAs Omid Malekan, adjunct professor at Columbia Business School explains, futures ETFs operate less efficiently than spot ETFs because they expire, and companies must roll their positions from contract to contract. This creates price friction and added costs that can be avoided by spot ETFs.\n\nMalekan says a spot ETF is likely what many bitcoin investors are really craving. Plenty of companies have tried to receive approval for spot bitcoin ETFs from the SEC. Asset manager Grayscale filed for one last year and, upon rejection, began a still-ongoing lawsuit against the agency for its ambiguity regarding the demands of a crypto spot fund.\n\nWhy has bitcoin's price been rallying?\n\nBlackRock's status makes its filing seem different from those previous in investors' eyes, Malekan says.\n\n\"It's the biggest asset manager, and it has a successful track record in getting ETFs approved,\" he says. \"There's a general perception that a company like BlackRock would not be doing this if they didn't think the regulatory environment in the U.S. was going to improve going forward.\"\n\nThere's also the fact that the crypto industry dealt with a lot of uncertainty in the industry last year, stemming from events like the implosion of the major crypto exchange FTX or the collapse of TerraUSD, a \"stablecoin.\"\n\nMalekan says that uncertainty could be cooling down, which is helping bitcoin's price.\n\n\"People have been expecting the worst about a lot of things including the regulatory crackdown, which is happening,\" Malekan says, referencing a recent lawsuit against Coinbase by the SEC as an example. \"Coinbase stock actually is now significantly higher than when the SEC revealed its lawsuit, and I think it's a case of the actual news being less bad than what was anticipated.\"\n\nWhy did bitcoin's price dip Friday?\n\nInvestors who were confident in the near-term potential of a bitcoin spot ETF should probably hold their confidence, though. Just two weeks after BlackRock's filing, a Friday report by the Wall Street Journal said that the SEC has already decided that recent ETF filings — including BlackRock, Fidelity and others — remain inadequate for approval. Specifically, the Journal reports that the agency says that filings are not clear nor comprehensive enough — a complaint it has made in many of its rejections of spot bitcoin ETFs over the years.\n\nOn Friday morning, bitcoin prices dropped by more than $1,200 following the report before recovering some of the losses.\n\nMore from Money:\n\nBitcoin Is Less Than a Year Away From a Much-Hyped Event That Has Historically Seen Its Price Soar\n\nInvestors Are Building up Their Cash Reserves — Millennials Especially\n\nHere’s Where Investors Plan to Put More Money in the Early Days of the Bull Market"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDYvMzAvY29pbmJhc2Utd2lsbC1iZS1maWRlbGl0eXMtc3VydmVpbGxhbmNlLXBhcnRuZXItZm9yLWJpdGNvaW4tZXRmLXJlZmlsZWQtYXBwbGljYXRpb24tc2F5cy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA2LzMwL2NvaW5iYXNlLXdpbGwtYmUtZmlkZWxpdHlzLXN1cnZlaWxsYW5jZS1wYXJ0bmVyLWZvci1iaXRjb2luLWV0Zi1yZWZpbGVkLWFwcGxpY2F0aW9uLXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Coinbase Will Be Surveillance Partner for Fidelity, Other Bitcoin ETFs, Refiled Applications Say - CoinDesk",
        "content": "Complicating the SEC's calculus may be the fact that it sued Coinbase earlier this month on allegations of operating an unregistered securities exchange, broker and clearinghouse – though the SEC is not alleging that Bitcoin itself is a security, and SEC Chair Gary Gensler has often referred to it as an example of a digital asset that is not a security."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMzAvYml0Y29pbi1jYXNoLXRvcHMtMzAwLWFtaWQtc3VyZ2UtaW4tdHJhZGluZy12b2x1bWVzLWluLXNvdXRoLWtvcmVhL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMzAvYml0Y29pbi1jYXNoLXRvcHMtMzAwLWFtaWQtc3VyZ2UtaW4tdHJhZGluZy12b2x1bWVzLWluLXNvdXRoLWtvcmVhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Cash Tops $300 as South Korean Trading Volumes Surge - CoinDesk",
        "content": "\"Nazarali explained that they felt confident that litecoin and bitcoin cash, as derivatives of bitcoin, were not securities. While there is some interest, it is not substantial,\" Lawrence Lewitinn, The Tie Director of Content and host said in Wednesday's edition of the newsletter."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTI5L2JpdGNvaW4tdHVybnMtcmFuZ2UtYm91bmQtd2hpbGUtZXRmLWluc3BpcmVkLWV1cGhvcmlhLWRpc3NpcGF0ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Price (BTC) Is Range-Bound After BlackRock ETF Excitement Fades - Bloomberg",
        "content": "Bitcoin has quickly settled into a narrow trading range after reaching a fresh one-year high, leaving reinvigorated enthusiasts wondering whether last week’s momentum will last.\n\nThe largest digital currency, which accounts for about half of the crypto sector’s $1.2 trillion market value, was about 1.7% higher to $30,600 on Thursday, even after Fidelity joined the list of firms to file for a Bitcoin ETF. The token has traded in a range of around $1,500 since hitting $31,410 last Friday."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvYml0Y29pbi1jYXNo0gEvaHR0cHM6Ly9kZWNyeXB0LmNvL3Jlc291cmNlcy9iaXRjb2luLWNhc2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "What is Bitcoin Cash? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin was designed so that no one group or person could control it. Bitcoin’s decentralized design has many advantages, but things can get tricky when there are disagreements with the community about the best way forward.\n\nSuch disagreements have led to more than 100 Bitcoin forks.\n\nNot all of those forks have led to new networks, but of those that have, Bitcoin Cash is probably the best known.\n\nAD\n\nAD\n\nWhat is Bitcoin Cash?\n\nBitcoin Cash is a modified version of Bitcoin that runs on its own blockchain network. It works in almost the same way as Bitcoin, but there are several key differences.\n\nThe largest difference is block size, or how much transaction information a single block on each chain can handle.\n\nOn the Bitcoin network, each block is 1 MB in size. Immediately after the Bitcoin Cash fork, the Bitcoin Cash block size was 8 MB, eight times bigger than on the Bitcoin network. In May 2018, Bitcoin increased its block size again, this time to 32 MB.\n\nThis means that Bitcoin Cash can now process 32 times as much information per block as Bitcoin can. As a result, Bitcoin Cash transactions tend to be faster and have lower fees. Security may be lower on the Bitcoin Cash network, though, as less mining power goes into mining each Bitcoin Cash block.\n\nDid you know? Bitcoin Cash is sometimes abbreviated to Bcash.\n\nWho invented it?\n\nThe idea for Bitcoin Cash was put forward by a group of Bitcoin developers. However, the person most directly connected to the currency today is Roger Ver, an early Bitcoin adopter and investor.\n\nAD\n\nAD\n\nA brief history\n\nJune 2017 - A group of developers and miners on Bitcoin put forward a proposal called Bitcoin ABC, which wanted to increase the block size.\n\n- A group of developers and miners on Bitcoin put forward a proposal called Bitcoin ABC, which wanted to increase the block size. July 2017 - Not everyone agreed on the proposed change.\n\n- Not everyone agreed on the proposed change. August 2017 - Bitcoin hard forks, leading to the creation of Bitcoin and Bitcoin Cash.\n\n- Bitcoin hard forks, leading to the creation of Bitcoin and Bitcoin Cash. March 2018 - Bitcoin Cash payments accepted on BitPay.\n\n- Bitcoin Cash payments accepted on BitPay. May 2018 - Bitcoin Cash increased block size from 8 MB to 32 MB.\n\n- Bitcoin Cash increased block size from 8 MB to 32 MB. November 2018 - Bitcoin Cash went through another hard fork, to create Bitcoin Cash and Bitcoin SV.\n\n- Bitcoin Cash went through another hard fork, to create Bitcoin Cash and Bitcoin SV. November 2020 - Bitcoin Cash forked a third time, this time to Bitcoin Cash Node (BCHN) and Bitcoin Cash ABC (BCHA), and Bitcoin Cash Node went on to be called Bitcoin Cash (BCH).\n\n- Bitcoin Cash forked a third time, this time to Bitcoin Cash Node (BCHN) and Bitcoin Cash ABC (BCHA), and Bitcoin Cash Node went on to be called Bitcoin Cash (BCH). June 2021 - SmartBCH, a Bitcoin Cash sidechain, was launched.\n\n- SmartBCH, a Bitcoin Cash sidechain, was launched. May 2023 - Integration of Cashtokens, Allow Transactions to be smaller, P2SH32, Restrict Transaction Versions.\n\n- Integration of Cashtokens, Allow Transactions to be smaller, P2SH32, Restrict Transaction Versions. June 2023: EDX, the digital asset exchange backed by Wall Street giants Fidelity, Citadel and Charles Schwab, announces it will list BCH\n\nWhat’s so special about it?\n\nBitcoin Cash shares many of the same features as Bitcoin, but has faster transaction times and lower fees. Though Bitcoin might be better known, Bitcoin Cash has supporters who believe that Bitcoin Cash is closer to the original purpose and vision of the Bitcoin project.\n\nDid you know? Bitcoin Cash was the first successful fork in Bitcoin, and it remains the one with the highest market cap except for Bitcoin itself.\n\nHow is Bitcoin Cash produced?\n\nBitcoin Cash, because it shares the same background as Bitcoin, is produced in the same way. Miners compete to solve complex mathematical puzzles through a proof-of-work process.\n\nHow does it work?\n\nIt operates in much the same way as Bitcoin—the only differences for users are that the Bitcoin Cash network can verify transactions more quickly than Bitcoin, and it typically charges lower fees.\n\nYou need a Bitcoin Cash wallet to send and receive the currency, and it can be used to pay for a variety of goods and services."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTMwL2ZpZGVsaXR5LW90aGVyLWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9ucy1yZWZpbGVkLWJ5LWNib2UtdG8tc2Vj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Fidelity, Other Bitcoin ETF Applications Refiled by Cboe to SEC - Bloomberg",
        "content": "Cboe Global Markets Inc. on Friday filed proposals with the US Securities and Exchange Commission for Bitcoin exchange-traded funds to be offered by Fidelity Investments, VanEck, WisdomTree and Invesco.\n\nThe filings followed earlier comments from the SEC that previous applications were not going to be considered sufficient."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NtZS1hZGRzLWV0aGVyLWJpdGNvaW4tcmF0aW8tZnV0dXJlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "CME Group to add ether/bitcoin ratio futures in July pending regulatory approval - Blockworks",
        "content": "CME Group announced plans to launch ether and bitcoin ratio futures on July 31, so long as they get regulatory approval.\n\n“Historically, ether and bitcoin have been highly correlated; however, as the two assets have grown over time, market dynamics may affect the performance of one more than the other, creating relative value trading opportunities,” said Giovanni Vicioso, CME Group’s global head of cryptocurrency products, said in a press release.\n\nThe futures will be cash-settled to the final settlement price of the CME’s ether futures and divided by the final settlement price of its bitcoin futures.\n\nThe listing cycle will be the same as CME’s bitcoin and ether futures contracts.\n\nAccording to Vicioso, this means that “investors will be able to capture ether and bitcoin exposure in a single trade, without needing to take a directional view.”\n\nXBTO’s Paul Eisma, head of options, said that “the launch of ether/bitcoin ratio futures completes the currency triangle allowing market makers such as XBTO the ability to arbitrage synthetically, for the first time, all three futures legs: the BTC/USD and ETH/USD dollar legs, and the ETH/BTC cross.”\n\nCME has expanded its crypto offerings this year, announcing in April that it would be expanding expiries for options on both bitcoin and ether futures contracts, making them available Monday through Friday.\n\nIt announced that it would be adding bitcoin futures to its event contracts earlier this year, though it first listed bitcoin futures back in 2017.\n\nIn 2022, CME added ether options contracts, an add-on to its ether contracts which were first listed in 2021. It listed bitcoin futures way back in 2017.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1icmVhY2hlcy0xMzQ4NTMzNjguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin breaches US$31,195 following Fidelity's spot Bitcoin ETF application - Yahoo Finance",
        "content": "Bitcoin rose 2.36% from June 23 to June 30 to US$30,802 at 7:30 p.m. Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading above US$30,000 since June 23. Ether rose 0.55% over the week to US$1,890.\n\ndOuePXPwA z4ORRoAMae66YAl51jC5\n\nThe growth of institutional interest in cryptocurrencies continued. After weeks of rumors and reports, asset management giant Fidelity submitted its spot Bitcoin ETF application, following the likes of BlackRock, Valkyrie Investments and WisdomTree.\n\nBitcoin, the world’s largest cryptocurrency, briefly rose to US$31,173 in the 24 hours following Fidelity’s application.\n\n“Bitcoin’s recent positive momentum can be attributed to the buzz around institutional players preparing to set up traditional financial instruments such as exchange-traded funds for cryptocurrencies,” Jonas Betz, crypto market analyst and founder of consultancy firm Betz Crypto, told Forkast.\n\n“This could potentially lead to increased buying pressure as new investors, previously wary of cryptocurrencies due to a lack of knowledge about how to facilitate direct crypto exposure, can easily enter these vehicles to gain exposure to crypto.”\n\nMax Breus, the co-founder and chief executive officer of Ubix Network, a protocol that connects blockchains with different consensus mechanisms, said that the Securities and Exchange Commission (SEC) accepting a spot Bitcoin ETF application would bring significant upside for Bitcoin.\n\n“Each new request to the SEC increases the chances of getting a positive decision… This will allow crypto to integrate deeper into global financial markets,” said Breus in a statement shared with Forkast.\n\nBinance’s troubles extended in Europe this week as the world’s largest crypto exchange announced on Wednesday that it will be changing its euro banking partner from Sept. 25, after Paysafe Payment Solutions said it will stop offering euro payment support for the exchange. This came two weeks after reports surfaced of Binance France being investigated for money laundering and the illegal provision of digital asset services.\n\nStory continues\n\nThe global crypto market capitalization stood at US$1.2 trillion on Friday at 7:00 p.m. in Hong Kong, up 2.56% from US$ 1.17 trillion a week ago, according to CoinMarketCap data. With a market cap of US$597 billion, Bitcoin represented 50% of the market while Ether, valued at US$227 billion, accounted for 19%.\n\nBitcoin’s 50% dominance is its highest mark in over two years. Bitcoin last accounted for more than half of the crypto market on April 25, 2021, when it traded above US$53,000.\n\n“MicroStrategy Inc. bought US$347 million of Bitcoin in the second quarter. Perhaps this explains the growing dominance of Bitcoin,” said Breus.\n\nU.S. Federal Reserve Chair Jerome Powell’s hawkish remarks signaled two or more interest rate hikes towards the end of the year. Powell also warned that the U.S. banking turmoil may not be over, citing funding vulnerabilities.\n\nNotable Movers: BCH & COMP\n\nBitcoin Cash was this week’s biggest gainer among the top 100 coins. Bitcoin Cash rose 115.15% to US$306.75, starting its uptrend after June 20, when EDX Markets, a crypto exchange backed by Citadel, Fidelity and Charles Schwab, listed the coin.\n\nAlgorithmic yield generator Compound’s governance token, COMP, was this week’s second biggest gainer in the top 100. The token rose 89.44% to US$57.14, picking up significant momentum on Thursday, a day after Compound CEO Robert Leshner announced the founding of a new company focused on creating regulated financial products bridging traditional markets and blockchain.\n\nAccording to on-chain intelligence firm Lookonchain, a whale wallet withdrew US$5.53 million worth of Comp tokens from Binance on Thursday, contributing to the token’s price surge.\n\nSee related article: Why the US is waging war on Binance, Coinbase\n\nNext week: Can Bitcoin remain above US$30,500?\n\nNext week, investors will be looking for the release of the minutes of the Federal Open Market Committee’s (FOMC) meeting, for hints on the Fed’s future monetary policy. The minutes of the meeting are set to release on Wednesday, shortly before a speech from FOMC Member John Williams, followed by a speech from Federal Reserve Bank of Dallas CEO Lorie K. Logan on Thursday.\n\nThe U.S. non-farm payroll report for June is scheduled for next Friday. The report is used by investors to gauge the health of the labor market and offer indications on the Fed’s upcoming interest rate decisions.\n\nMeanwhile, investors will be eagerly watching the SEC’s response to the mounting spot Bitcoin ETF applications. According to Lucas Kiely, the chief investment officer of digital asset platform Yield App, a positive response could breathe life into the crypto market and attract more institutional investors.\n\n“If Bitcoin manages to remain above US$30,500 for numerous closes and maintains that support level, there is a significantly increased likelihood of a bullish trend continuing. Conversely, if Bitcoin fails to remain above this level or experiences a significant drop below US$25,000, it could signal a bearish trend,” said Kiely.\n\nSee related article: Crypto firms eye Hong Kong amid tough US regulations, says fintech association chair"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMzAvZmlyc3QtbW92ZXItYW1lcmljYXMtZmlkZWxpdHktam9pbnMtdGhlLXJ1c2gtZm9yLXNwb3QtYml0Y29pbi1ldGYv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8zMC9maXJzdC1tb3Zlci1hbWVyaWNhcy1maWRlbGl0eS1qb2lucy10aGUtcnVzaC1mb3Itc3BvdC1iaXRjb2luLWV0Zi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "First Mover Americas: Fidelity Joins the Rush for Spot Bitcoin ETF - CoinDesk",
        "content": "Binance, the world’s largest cryptocurrency exchange by market value, said its institutional clients are optimistic on the outlook of crypto for the next year and beyond, according to a survey it conducted between March and May 2023. The study – undertaken by Binance Research and the Binance VIP & Institutional team – surveyed 208 clients, nearly a quarter of whom had assets under management (AUM) above $100 million and just over half of whom had AUM less than $25 million. Just shy of two-thirds of respondents (63.5%) said they are positive on the outlook of crypto for the next year and 88% said they are optimistic for the next decade, according to the report."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZ2FpbnMtd2l0aC1hbGwtdG9wLTEwLWNyeXB0by1maWRlbGl0eS1jb25maXJtcy1iaXRjb2luLWV0Zi1iaWQtdS1zLWVjb25vbXktcmVib3VuZHMv0gF1aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1nYWlucy13aXRoLWFsbC10b3AtMTAtY3J5cHRvLWZpZGVsaXR5LWNvbmZpcm1zLWJpdGNvaW4tZXRmLWJpZC11LXMtZWNvbm9teS1yZWJvdW5kcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin gains with all top 10 crypto, Fidelity confirms Bitcoin ETF bid, U.S. economy rebounds - Forkast News",
        "content": "Bitcoin gained along with all other top 10 non-stablecoin cryptocurrencies on Friday morning in Asia after data this week showed the U.S. economy expanded even in the face of repeated interest rate hikes. U.S. GDP grew faster than expected in the first quarter and initial jobless claims came in at less than expected. Also, asset manager Fidelity Investments on Thursday filed to offer a spot Bitcoin exchange-traded fund (ETF).\n\nAll top 10 cryptos rise\n\nBitcoin climbed 1.05% to US$30,453 over the last 24 hours to 6:40 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization is up 1.43% over the past seven days.\n\nEther rose 1.28% to US$1,853, but is down 1.4% for the week.\n\nAll top 10 non-stablecoin cryptocurrencies traded higher. Solana led the gains on a 12.35% jump and a 7.56% weekly gain. This despite the Thursday announcement from Cardinal, a Solana non-fungible token (NFT) protocol, that it will be winding down operations due to what it called a challenging macroeconomic environment.\n\nCardinal tweeted on Thursday that the team will disable new deposit instructions on July 19 and cease operations on features including staking and new NFT rentals.\n\nElsewhere, Fidelity has refiled an application for a spot Bitcoin ETF. The Thursday filing with the Securities and Exchange Commission (SEC) shows that the COBE exchange has proposed to list and trade shares of the Wise Origin Bitcoin Trust. The SEC rejected a Bitcoin ETF application from Fidelity in 2021.\n\nFidelity’s move follows a wave of U.S. spot Bitcoin ETF applications submitted by asset managers this month, including BlackRock, WisdomTree, Invesco and Bitwise, indicating institutions are confident in the profit potential of digital assets and demand.\n\n“To this point, the lack of a spot Bitcoin ETP exposes U.S. investor assets to significant risk because investors that would otherwise seek crypto asset exposure through a spot Bitcoin ETP are forced to find alternative exposure through generally riskier means,” the Fidelity filing said.\n\nOn Wednesday, investment management fund ARK Invest also filed an amendment to its April application for a spot Bitcoin ETF.\n\nThe total cryptocurrency market cap rose 1.24% to US$1.17 trillion, with trading volume dropping 12.22% to US$29.96 billion, according to CoinMarketCap data.\n\nLong-term Azuki collectors sell out\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the NFT market, the Forkast 500 NFT index dipped 0.79% to 2,852.82 in the 24 hours to 10:00 a.m. in Hong Kong. The index is down 1.79% for the week.\n\nNFT trading volume on Ethereum dropped 19.79% to US$20.87 million over the past 24 hours, while volume on the Bitcoin network rose 357.82% to US$13.38 million, according to CryptoSlam data.\n\nSales of Uncategorized Ordinals — CryptoSlam’s category of Bitcoin Ordinals that are not part of one established collection — rose 7.22% to US$9.25 million, making it the most-sold collection in the past day.\n\nSolana-based SMB Barrel Raffle, which started public minting on Thursday, saw the second-largest daily volume of US$5.1 million.\n\nTrading volume of Azuki Elementals dropped 46.5% to US$2.95 million, and the original Azuki collection saw a 7.76% drop to US$2.79 million.\n\nWhile the new Azuki Elementals sold out its 20,000 NFTs within 15 minutes when it began minting on Tuesday, collectors were “angry” as the new NFTs looked almost identical to the original Azuki collection, according to Yehudah Petscher, NFT strategist at Forkast Labs, the parent company of Forkast.News. That could potentially devalue the NFT collection as a whole, he said.\n\n“Tonight [on Thursday] the founder of Azuki, Zagabond, is meeting with the community to discuss the week’s mint, and likely address concerns,” Petscher said.\n\nAccording to data analytics firm Nansen on Twitter on Thursday: “Azuki and Beanz collectors that have held for over 1 year have been selling their NFTs post-Elementals mint.”\n\nMeanwhile, art auction house Sotheby’s plans to launch a new generative art program, or work generated from algorithms. That will be in partnership with Art Blocks, which powers generative minting technology to brands and artists, according to a Wednesday statement shared with Forkast via email.\n\n“This will allow generative art long form collections to be minted right on Sotheby’s own platform,” Petscher said. “Generative art is really beginning to spread its wings following the sale of ‘The Goose’ — The Ringers #879 — for US$5.4 million (US$6.2 million with fees) on June 15.”\n\nChina’s economy contracts for third month\n\nA steel factory oin Nantong, Jiangsu Province of China. Image: Getty Images\n\nAsia equity markets were mixed on the last day of the quarter as investors assessed fresh economic data from the U.S. and China.\n\nU.S. stock futures edged higher as of 11:00 a.m. in Hong Kong. Dow Jones Industrial Average futures edged up 0.01%, S&P 500 futures climbed 0.08%, and Nasdaq Futures added 0.19%.\n\nU.S. economic growth expanded faster than estimated in the first quarter, according to official data released Thursday. In the first quarter, the country’s gross domestic product (GDP) rose by an annualized rate of 2%, up from the previously estimated 1.3%.\n\nThe amount of initial jobless claims in the U.S. dropped by 26,000 to 239,000 for the week ended June 24, the largest decrease since October 2021.\n\nThe robust economic showing in the U.S. wasn’t repeated in China, where the country’s manufacturing activity contracted in June for the third month, the National Bureau of Statistics said Friday. The official manufacturing purchasing managers’ index came in at 49.0 for the month, compared to 48.8 in May. A reading below 50 indicates contraction.\n\nChinese Premier Li Qiang said on Tuesday that China was still on track to meet its 5% annual growth target.\n\nInvestors, however, still need to contend with more interest rate hikes this year in the world’s biggest economy. U.S. Fed Chair Jerome Powell has repeatedly said the Fed may raise rates at the next two meetings and repeated that message at a central bank gathering in Portugal this week.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006. The CME FedWatch Tool predicts an 86.8% chance for a 25-basis-point rate hike at the Fed’s next meeting on July 26. It predicts a 13.2% chance the Fed will leave rates unchanged.\n\n(Updates to add equities section.)"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzMwL2ZpcnN0LW1vdmVyLWFzaWEtbGFyZ2UtYml0Y29pbi1ob2xkZXJzLWNvbnRlbnQtdG8taG9sZC1sb25nLXBvc2l0aW9ucy1hbWlkLXJlZ3VsYXRvcnktdHVybW9pbC_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8zMC9maXJzdC1tb3Zlci1hc2lhLWxhcmdlLWJpdGNvaW4taG9sZGVycy1jb250ZW50LXRvLWhvbGQtbG9uZy1wb3NpdGlvbnMtYW1pZC1yZWd1bGF0b3J5LXR1cm1vaWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Large Bitcoin Holders Content to Hold Long Positions Amid Regulatory Turmoil - CoinDesk",
        "content": "“Nonetheless, inflation pressures continue to run high, and the process of getting inflation back down to 2 percent has a long way to go,” Powell said, adding: “We see the effects of our policy tightening on demand in the most interest rate–sensitive sectors of the economy, particularly housing and investment. It will take time, however, for the full effects of monetary restraint to be realized, especially on inflation.”"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmNhbGNhbGlzdGVjaC5jb20vY3RlY2huZXdzL2FydGljbGUvc3l0NXFycTAwbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Can BlackRock finally break down the SEC's objection to a bitcoin ETF? - CTech",
        "content": "Earlier this month, BlackRock, the largest asset manager in the world, with approximately $10 trillion under management, applied to launch an ETF (Exchange-Traded Fund) that tracks Bitcoin. If the request is approved, it will allow institutional investors to gain exposure to the cryptocurrency without actually purchasing it.\n\nOver the past six years, the U.S. Securities and Exchange Commission (SEC) has repeatedly denied such requests, even from large and well-known institutional players like Kathy Wood's technology-focused hedge fund firm Ark. Grayscale, a major player in the crypto market, even sued the SEC last October for refusing to approve a similar product. While it is still unclear whether BlackRock will receive the long-awaited approval, the mere possibility of institutional entities investing in the asset caused the price of bitcoin to increase by about 15% to a one-and-a-half-year high, surpassing $30,000. However, the current price is still about 53% lower than the currency's all-time high of over $65,000 in November 2021.\n\n1 View gallery Larry Fink, BlackRock CEO. ( Photo: AP )\n\nAccording to the application submitted to the SEC, BlackRock's iShares Bitcoin Trust fund will utilize the platform of the American trading exchange Coinbase and its Coinbase Custody services. If approved, the ETF is expected to be traded on the Nasdaq. BlackRock, whose founder and CEO Larry Fink once referred to bitcoin as an \"index for money laundering\" and claimed that the company's clients had no interest in the field, took a different approach in the summer of 2022. BlackRock established a connection with Coinbase to allow its private clients access to the crypto market, citing growing customer interest in the field in a letter to investors.\n\nBlackRock is an investment house that manages money for the general public worldwide. In Israel, operations are managed by Anath Levin, former deputy CEO of Bank Hapoalim and a senior executive at Clal Insurance and Migdal Insurance. BlackRock offers investors a wide variety of products, including many passive ones like ETFs. Additionally, it manages hedge funds, private equity funds, and debt funds.\n\nBlackRock has made its move at a time when the crypto market is trying to recover from months of distress. Last summer, several companies in the industry went bankrupt, leaving investors without access to their funds. Furthermore, BlackRock's ETF application comes after the SEC's recent enforcement actions against Binance and Coinbase for various securities law violations and, in some cases, defrauding investors.\n\nInterestingly, the man who once mocked bitcoin, Larry Fink, has now become the darling of the community, or at least significant parts of it. Galaxy Digital CEO Michael Novogratz, a long-time crypto investor, expressed that the launch of BlackRock's ETF \"will be the best thing that could happen to bitcoin.\"\n\nAn ETF on bitcoin would provide exposure to the currency without actual ownership. Instead of cumbersome purchases or using dubious platforms, investors would be able to buy shares that track the asset's price. For the past six years, the SEC has rejected requests to create such funds, except for those related to futures contracts. The SEC's rejections are based on various reasons, but a consistent and central concern is the potential for price manipulation on unsupervised platforms. The SEC has cited evidence of fake trading (wash trading) in the market and the ability of large players to manipulate bitcoin's price for personal gain. The lack of supervision and transparency in the crypto market makes it challenging for the SEC to monitor and detect fraud. Approving the requested ETF would raise concerns about investor protection.\n\n\n\n\n\nBlackRock addresses the SEC's concerns through a \"surveillance-sharing agreement\" between different exchanges, which is a first-of-its-kind effort in the crypto field. This, combined with BlackRock's positive track record of gaining SEC approval for similar products, leads some commentators to believe that BlackRock has a higher chance of success compared to previous applicants.\n\nBlackRock's move aligns with a trend of increasing institutional involvement in the crypto market. Last week, hedge fund Citadel, financial giant Fidelity, and investment bank Charles Schwab launched EDX Markets, a new crypto exchange targeting established players seeking distance from regulatory enforcement issues. Unlike traditional crypto exchanges, EDX does not offer custodial services, meaning it does not hold cryptographic assets itself. Instead, it serves as a platform where parties agree on prices and close transactions. Compared to existing exchanges, which have been associated with frauds and scams, EDX aims to reduce risk by trading only four cryptocurrencies that the SEC has not classified as securities."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzMwL3doeS1ldGhlcmV1bS1zaGliYS1pbnUtYW5kLWJpdGNvaW4tY2FzaC1hcmUtcmlzaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Why Ethereum, Shiba Inu, and Bitcoin Cash Are Rising Today - The Motley Fool",
        "content": "What happened\n\nMost cryptocurrencies moved higher today, as more mainstream financial institutions filed to launch spot Bitcoin exchange-traded funds (ETFs) and as altcoins gained steam.\n\nSince late afternoon yesterday, the price of the world's second-largest cryptocurrency, Ethereum (ETH -1.59%), traded 3.4% higher as of 10:35 a.m. ET today. Meanwhile, the price of the meme token Shiba Inu (SHIB 2.48%) traded 4.5% higher, while the price of Bitcoin Cash (BCH -1.17%) had jumped nearly 26%.\n\nSo what\n\nEver since the world's largest asset manager, BlackRock, filed with the U.S. Securities and Exchange Commission (SEC) to launch a spot Bitcoin ETF, cryptocurrencies have been rallying on the belief that more interest in the sector from mainstream financial giants will ultimately increase exposure.\n\nWhile other spot Bitcoin ETFs have been rejected by the SEC, BlackRock's filing seemed to change the game because it proposed a surveillance-sharing agreement with the Nasdaq, where it intends to list the ETF. This agreement would share information about trading activity and the identity of customers, which the SEC believes is necessary to prevent market manipulation.\n\nFollowing BlackRock, a swarm of other players have proposed Bitcoin ETFs with the SEC and the latest is Fidelity, which has also proposed to have a surveillance-sharing agreement. These ETFs would ultimately make it easier for investors to gain access to Bitcoin without having to buy the cryptocurrency itself.\n\nIn other news, Bitcoin Cash has been exploding higher all week, most recently on a ton of trading volume out of investors in South Korea. The excitement continues to be fueled by the news that Bitcoin Cash is one of four cryptocurrencies being listed by a new exchange called EDX Markets, which is backed by Fidelity, Charles Schwab, and Citadel.\n\nInterestingly, the exchange decided to list Bitcoin Cash because it believes regulators are likely to determine that the cryptocurrency is a commodity and not a security. Whether or not cryptocurrencies are commodities or securities is a big point of contention in the crypto ecosystem right now. Commodities would be regulated by the Commodity Futures Trading Commission, while securities would be overseen by what is presumed to be the much stricter SEC.\n\nIn more regulatory news today, a new bill that formally recognizes cryptocurrencies as a regulated financial instrument and investment was officially made a law today in the United Kingdom. Many believe that regulatory clarity is a necessity for crypto to be able to move forward.\n\nNow what\n\nNews regarding spot Bitcoin ETFs has been the biggest driver of cryptocurrencies in recent weeks, so it makes sense that the news regarding Fidelity continued to fuel the sector today.\n\nBut the fact that investors are pouring into Bitcoin Cash because they think the token is likely to be deemed a commodity instead of a security is interesting and could represent a newer trend in the industry.\n\nWith the SEC seemingly getting more aggressive in its attempts to bring more cryptocurrencies under its purview, investors may start to favor those that they view as commodities. While I still like Ethereum the best in this group of cryptocurrencies, this is certainly a trend that bears watching."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9tZWRpYS1yb29tL3ByZXNzLXJlbGVhc2VzLzIwMjMvNi8yOS9jbWVfZ3JvdXBfdG9fbGF1bmNoZXRoZXJiaXRjb2lucmF0aW9mdXR1cmVzb25qdWx5MzEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "CME Group to Launch Ether/Bitcoin Ratio Futures on July 31 - CME Group",
        "content": "CHICAGO, June 29, 2023 /PRNewswire/ -- CME Group , the world's leading derivatives marketplace, today announced plans to launch Ether/Bitcoin Ratio futures on July 31, pending regulatory review.\n\n\"Historically, ether and bitcoin have been highly correlated; however, as the two assets have grown over time, market dynamics may affect the performance of one more than the other, creating relative value trading opportunities,\" said Giovanni Vicioso, CME Group Global Head of Cryptocurrency Products. \"With the addition of Ether/Bitcoin Ratio futures, investors will be able to capture ether and bitcoin exposure in a single trade, without needing to take a directional view. This new contract will help create opportunities for a broad array of clients looking to hedge positions or execute other trading strategies, all in an efficient, cost-effective manner.\"\n\nThe Ether/Bitcoin Ratio futures will be cash-settled to the value of CME Group Ether futures final settlement price, divided by the corresponding CME Group Bitcoin futures final settlement price. The new contract will follow the same listing cycle as CME Group Bitcoin futures and Ether futures contracts.\n\n\"The launch of CME Group Ether/Bitcoin Ratio futures further expands the marketplace for institutions and sophisticated investors who want digital asset exposure in a regulated environment,\" said Jason Urban, Global Head of Trading at Galaxy. \"We're excited to support this product, which will appeal to investors looking to take advantage of changes between the two biggest digital assets by market capitalization. We commend CME Group's ongoing commitment to developing innovative offerings essential to building an enduring ecosystem for this asset class.\"\n\n\"The launch of Ether/Bitcoin Ratio futures completes the currency triangle allowing market makers such as XBTO the ability to arbitrage synthetically, for the first time, all three futures legs: the BTC/USD and ETH/USD dollar legs, and the ETH/BTC cross,\" said Paul Eisma, Head of Options Trading at XBTO. \"CME Group's innovative, regulated product will help increase volumes, reduce spreads, and give institutional crypto market participants a vehicle to express relative value between BTC and ETH.\"\n\n\"This new ETH/BTC cross-cryptocurrency contract from CME Group should allow investors more flexibility when hedging positions in non-dollar offshore markets,\" said Brooks Dudley of Marex Capital Markets, Inc. \"This marks another important advancement for CFTC-regulated cryptocurrency derivatives.\"\n\nFor more information on cryptocurrency options, please visit: www.cmegroup.com/ebr.\n\nAs the world's leading derivatives marketplace, CME Group (www.cmegroup.com) enables clients to trade futures, options, cash and OTC markets, optimize portfolios, and analyze data – empowering market participants worldwide to efficiently manage risk and capture opportunities. CME Group exchanges offer the widest range of global benchmark products across all major asset classes based on interest rates, equity indexes, foreign exchange, energy, agricultural products and metals. The company offers futures and options on futures trading through the CME Globex® platform, fixed income trading via BrokerTec and foreign exchange trading on the EBS platform. In addition, it operates one of the world's leading central counterparty clearing providers, CME Clearing.\n\nCME Group, the Globe logo, CME, Chicago Mercantile Exchange, Globex, and, E-mini are trademarks of Chicago Mercantile Exchange Inc. CBOT and Chicago Board of Trade are trademarks of Board of Trade of the City of Chicago, Inc. NYMEX, New York Mercantile Exchange and ClearPort are trademarks of New York Mercantile Exchange, Inc. COMEX is a trademark of Commodity Exchange, Inc. BrokerTec and EBS are trademarks of BrokerTec Europe LTD and EBS Group LTD, respectively. The S&P 500 Index is a product of S&P Dow Jones Indices LLC (\"S&P DJI\"). \"S&P®\", \"S&P 500®\", \"SPY®\", \"SPX®\", US 500 and The 500 are trademarks of Standard & Poor's Financial Services LLC; Dow Jones®, DJIA® and Dow Jones Industrial Average are service and/or trademarks of Dow Jones Trademark Holdings LLC. These trademarks have been licensed for use by Chicago Mercantile Exchange Inc. Futures contracts based on the S&P 500 Index are not sponsored, endorsed, marketed, or promoted by S&P DJI, and S&P DJI makes no representation regarding the advisability of investing in such products. All other trademarks are the property of their respective owners.\n\nCME-G\n\nSOURCE CME Group"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9ya2FzdC5uZXdzL3NlYy1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbnMtaW5hZGVxdWF0ZS_SAUFodHRwczovL2Zvcmthc3QubmV3cy9zZWMtYml0Y29pbi1ldGYtYXBwbGljYXRpb25zLWluYWRlcXVhdGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "US SEC says Bitcoin ETF applications inadequate: WSJ - Forkast News",
        "content": "The U.S. Securities and Exchange Commission (SEC) said the recent series of spot Bitcoin exchange-traded fund (ETF) applications by asset managers were inadequate and not sufficiently clear, according to a report by the Wall Street Journal on Friday.\n\nSee related article: SEC’s Gary Gensler dodges question on whether Ethereum is a security\n\nFast facts\n\nThe SEC has informed exchanges Nasdaq and Cboe Global Markets, which filed the applications on behalf of the asset managers, that the applications are not clear and comprehensive, according to the WSJ report, which cited people familiar with the matter.\n\nBitcoin prices have surged since asset managers, including BlackRock, WisdomTree and Fidelity, filed an application for a spot Bitcoin ETF in June.\n\nBitcoin fell below US$30,000 for the first time in a week shortly after the WSJ report was published. It quickly bounced back to US$30,113 as of 11 p.m. in Hong Kong.\n\nThe SEC has filed lawsuits against cryptocurrency exchanges Binance.US and Coinbase for alleged violation of securities laws, while stating that a number of altcoins like Solana, Cardano, Polygon and BNB are securities and therefore requiring appropriate registration.\n\nEarlier this month, SEC Chair Gary Gensler, said in a speech, “There’s nothing about the crypto securities markets that suggests that investors and issuers are less deserving of the protections of our securities laws.”\n\nSee related article: SEC Chair Gary Gensler offered to advise Binance in 2019: CNBC"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzMwL3N1ZGRlbi1jcnlwdG8tdm9sYXRpbGl0eS1zcHVycy0yMTZtLWluLWxvc3Nlcy1saXF1aWRhdGluZy1ib3RoLWxvbmctYW5kLXNob3J0LXBvc2l0aW9ucy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8zMC9zdWRkZW4tY3J5cHRvLXZvbGF0aWxpdHktc3B1cnMtMjE2bS1pbi1sb3NzZXMtbGlxdWlkYXRpbmctYm90aC1sb25nLWFuZC1zaG9ydC1wb3NpdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Sudden Crypto Volatility Spurs $216M in Losses, Liquidating Both Long and Short Positions - CoinDesk",
        "content": "Bitcoin cash (BCH), was responsible for $22 million of liquidations. The token almost tripled its price in June and experienced a resurgence in trading activity after being one of the four assets listed on EDX Markets, a new crypto exchange backed by traditional finance heavyweights Citadel, Fidelity and Schwab."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFjay1yb2NrLWV0Zi1iaXRjb2luLXByaWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Will BlackRock's ETF slingshot Bitcoin's price skyward? - Cointelegraph",
        "content": "Traditional financial firms finally believe that digital assets are here to stay. Or so one might conclude from the slew of announcements last week from some of the world’s premiere financial players.\n\nAmong them is BlackRock — the world’s largest asset manager with $9 trillion in assets under management (AUM) — filed for permission to build a “spot market” Bitcoin-based exchange-traded fund (ETF) — something the United States Securities and Exchange Commission has resolutely resisted.\n\nOthers include Fidelity Investments, Charles Schwab and Citadel launching EDX, a new cryptocurrency exchange. In Germany, Deutsche Bank — boasting $1.4 trillion in balance sheet assets — applied for a license to custody crypto. There were others too.\n\nCollectively, these developments boosted crypto trading markets. Bitcoin (BTC) gained 20% in the week, surpassing the $30,000 mark for the first time since April. If allowed, a BlackRock Bitcoin ETF listing on the Nasdaq stock exchange would arguably make Bitcoin more accessible to a larger investing public.\n\nSome even anticipated a stampede to Bitcoin due to the BlackRock filing, as others followed with their own, including Invesco and WisdomTree. Fidelity Investments filed for a spot Bitcoin ETF on June 29.\n\n“The Great Accumulation has begun,” declared Cameron Winklevoss on Twitter, while MicroStrategy’s Michael Saylor added, “The window to front-run institutional demand for #Bitcoin is closing.”\n\nThe Great Accumulation of bitcoin has begun. Anyone watching the flurry of ETF filings understands the window to purchase pre-IPO bitcoin before ETFs go live and open the floodgates is closing fast. If bitcoin was the most obvious and best investment of the previous decade, this… — Cameron Winklevoss (@cameron) June 21, 2023\n\nOthers professed little shock about these developments, however, even after a year of crypto-related scandals, bankruptcies, lawsuits and regulatory uncertainty in the United States. By this view, the institutions were just bowing to the inevitable.\n\n“I’m not surprised, since from a fundamental point of view, the movement of digital value is the next obvious evolution of the internet,” Jim Kyung-Soo Liew, associate professor of finance at Johns Hopkins Carey Business School, told Cointelegraph. “What is surprising is how the U.S. hasn’t embraced it.”\n\nLast week’s events raise some questions: How enduring are Bitcoin’s most recent price gains? There have been institutional investor sightings before. Will this time be different, or will Bitcoin and other cryptocurrencies resume their sideways market activity?\n\nOn the other hand, a firm the size of BlackRock really could transform the BTC market, some believe.\n\nBitcoin has a fixed supply limit of 21 million BTC and its existing inventory is relatively illiquid. Sixty-eight percent of BTC in circulation hasn’t moved at all in the past year, according to Glassnode. There isn’t a lot of stock on the shelves for BlackRock and others to snap up, in other words. If demand exceeds supply, doesn’t that inevitably mean price gains for BTC?\n\nMagazine: How smart people invest in dumb memecoins: 3-point plan for success\n\nAlso, where do retail investors fit in among the new institutional arrivals? Maybe ordinary crypto users are also needed to stabilize the price of Bitcoin.\n\nFinally, assuming the so-called Great Accumulation really is happening, how far can it go? The cryptoverse has a market capitalization of about $1 trillion today, roughly half of which is in Bitcoin. Could the crypto market cap reach a 10-fold increase of $10 trillion in five years?\n\nHas the “great accumulation” begun?\n\n“Anyone watching the flurry of ETF filings understands the window to purchase pre-IPO bitcoin before ETFs go live and open the floodgates is closing fast,” declared Winklevoss, adding: “If bitcoin was the most obvious and best investment of the previous decade, this [spot Bitcoin ETF] will likely be the most obvious and best trade of this decade.”\n\nIs the co-founder of the Gemini cryptocurrency exchange right?\n\n“Clearly, there is significant investor demand for Bitcoin access through regulated investment funds from a broad spectrum of U.S. investors,” Sui Chung, CEO of CF Benchmarks, told Cointelegraph, “Otherwise, BlackRock, Fidelity, Invesco and other major asset managers would not have filed S-1s for Bitcoin ETFs.”\n\nThe entry of BlackRock and other investment managers into this new asset class isn’t so unexpected, either. “We’ve long known that BlackRock is enabling BTC investments for clients through their Aladdin platform and Bitcoin private fund,” Doug Schwenk, CEO of Digital Asset Research, told Cointelegraph.\n\nThe recent negative news stories swirling around Binance and Coinbase “are not related to Bitcoin and may be seen as an opportune time for a better-known, more regulated brand to provide alternatives that end-buyers can trust. A BTC ETF is a natural step.”\n\nWinklevoss, Saylor and others warn that retail investors had better buy Bitcoin now to get its ostensibly cheaper “pre-IPO” price before BTC’s price skyrockets. Are they correct?\n\n“There is some truth to that given the finite supply of Bitcoin and increasingly low rate of supply growth,” added Chung. “However, plenty of investors bought in the $50k to $69k range and they are still underwater; on top of that, cash earns 5%+ at the moment. To me, trying to time the market, especially one as volatile as crypto, is a fool’s errand.”\n\nMoreover, the Winklevoss scenario “depends on how certain one is that institutions are truly coming and that the ETFs and other infrastructure plays by large institutions will play out,” Justin d’Anethan, head of business development for the Asia-Pacific region at Keyrock — a Europe-based digital asset market maker — told Cointelegraph.\n\n“Forward-looking investors will probably try to front-run that move and buy before any of this is truly released. I’m personally a bit less certain about how soon this will happen, though,” d’Anethan added.\n\nAssuming BlackRock succeeds in its ETF quest and other institutional investors follow, would that stabilize the price of Bitcoin at a substantially higher level than the current $30,000? Or does long-term price stability also require broad retail participation?\n\n“It all depends how much AUM they can gather if they are approved,” answered Chung. “If it’s a substantial amount, then it stands to reason that it would lift the price substantially given the finite supply. Bitcoin and its price is agnostic as to who buys Bitcoin and through what means. Buying demand just has to outstrip selling demand and the price will appreciate.”\n\nCarol Alexander, professor of finance at the University of Sussex Business School, told Cointelegraph that a slew of spot Bitcoin ETFs could actually make BTC less stable and more volatile. “If there’s too many ETFs, all these market makers trying to hedge their positions could be selling at the same time or buying at the same time. It could increase volatility… I disagree with what Winklevoss said.”\n\nAlexander has her own BTC price scenario, which assigns retail investors a key role. In March, when BTC was trading around $20,000, she predicted the coin would rise to $30,000 by June and move sideways through the summer. That has largely come to pass. “So the question is, what’s going to be happening in September?” she asked.\n\n“I’m not saying it will — but it could go up to around $50,000. That’s because people come back after the summer, and there’s more liquidity in the markets.”\n\nBut it’s also because retail investors are no longer scared after the long string of crypto drawdowns, scandals, bankruptcies and regulatory actions of the past year. The growing investment in the digital asset market by large financial institutions like Fidelity Investments and JPMorgan Chase has arguably had a calming effect on retail investors.\n\n“I think we’re going to be seeing much more acceptance from really ordinary people starting in September as you get some more regulatory clarity about things. That extra volume of trades could bring the price back up to — I’m not saying $68,000 where it was, that would be too high [...] — but there’s that sweet area around the $50,000 mark, which I think will be the next long-term resistance level.”\n\nIn a June 19 global survey by Nomura Laser Digital, 90% of professional investors said it was “important” that any digital-asset funds or investments have the backing of a large traditional financial institution — at least before considering putting their clients’ money into it. Maybe this past week’s announcements by BlackRock, Fidelity, Deutsche Bank, et al. are the signal they were waiting for.\n\n“Perhaps,” Schwenk said. “Only time will tell. It’s hard to pick when the tipping point will be. We have had participation from other large traditional firms — BNY Mellon, State Street, Standard Chartered, Franklin Templeton, etc. That hasn’t been enough to satisfy the respondents in the survey yet, but eventually, they will see enough momentum.”\n\nTen-fold growth over five years?\n\nIn the medium term, how high could things go? With the active participation of large TradFi firms like BlackRock, Fidelity and Deutsche Bank, could crypto market capitalization grow from $1 trillion to $10 trillion or more over the next five years, for instance?\n\n“Five years ago, the entire market cap of liquid crypto, as measured by the CF Large Cap Index, was around $250 billion and hit a high of around $2.6 trillion in late 2021,” said Chung. “So 10X would seem to be within the realms of possibility.”\n\nMajor institutions putting their distribution networks to work to support further adoption would also provide “a significant tailwind,” he added. “However, interest rates were not 5% in that previous five-year period — they are now. What impact that might have is impossible to know.”\n\nRecent: Open source: Buzzword or real security for crypto wallets?\n\nAlexander was less bullish. “A Bitcoin ETF — I don’t even see that it’s needed.” Most ETFs are a basket of equities or a basket of currencies. An ETF with a basket of cryptocurrencies like Bitcoin, Ether (ETH) and Solana (SOL) “would make a lot more sense,” in her view.\n\n‘Exciting times’ for Bitcoin?\n\nSightings of institutional investors just outside the boundaries of the cryptoverse have been reported before, but they have never quite entered en masse. Why might this time be different?\n\n“Institutional investors are very slow and thoughtful in their due diligence process,” Johns Hopkins’ Liew said, but “they have finally come to see the Bitcoin light. It’s just too exciting to pass up and their customers are pushing them for products.” From an empirical perspective, some crypto exposure is a good means of diversifying an investment portfolio, he noted, summarizing:\n\n“If institutional investors enter the party, their demand would certainly drive prices higher. It would definitely be exciting times for BTC.”\n\n“The involvement of large financial institutions, whether it be for ETF applications or the new EDX exchanges, represent a significant shift and a decisive moment for crypto markets, in the U.S. and globally,” concluded d’Anethan."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMzAvYml0Y29pbi1jYXNoLWZ0eHMtZnR0LXRva2VuLWFuZC1jb21wLWxlZC1jcnlwdG8tbWFya2V0LWdhaW5zLWluLWp1bmUv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8zMC9iaXRjb2luLWNhc2gtZnR4cy1mdHQtdG9rZW4tYW5kLWNvbXAtbGVkLWNyeXB0by1tYXJrZXQtZ2FpbnMtaW4tanVuZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Cash, FTX’s FTT Token and COMP Led Crypto Market Gains in June - CoinDesk",
        "content": "“While we’ve seen varying degrees of institutional participation over the years, no one has had the trillion-dollar gravitas of BlackRock, who clearly seem to be the driver of BTC gains this past month.”"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjkvYml0Y29pbi1ob3ZlcnMtb3Zlci0zMDNrLWRlc3BpdGUtcmVuZXdlZC1pbmZsYXRpb24td29ycmllcy_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI5L2JpdGNvaW4taG92ZXJzLW92ZXItMzAzay1kZXNwaXRlLXJlbmV3ZWQtaW5mbGF0aW9uLXdvcnJpZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Hovers Over $30.3K Despite Renewed Inflation Worries - CoinDesk",
        "content": "“Nonetheless, inflation pressures continue to run high, and the process of getting inflation back down to 2 percent has a long way to go,” Powell said, adding: “We see the effects of our policy tightening on demand in the most interest rate–sensitive sectors of the economy, particularly housing and investment. It will take time, however, for the full effects of monetary restraint to be realized, especially on inflation.”"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0Zi13aHktZG9lcy1ldmVyeW9uZS0wOTE2MDM0NDkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "What Is a Bitcoin ETF, and Why Does Everyone from Blackrock to Fidelity Want One? - Yahoo Finance",
        "content": "With more mainstream popularity than ever, many new people are interested in acquiring some Bitcoin. But many of the crypto-curious still view buying Bitcoin from a crypto exchange as an intimidating and opaque process. The technical aspects of holding Bitcoin—such as crypto wallets, Bitcoin addresses and private keys—are confusing to newcomers, and scare some investors away.\n\nAll of this has intensified the appeal of a Bitcoin ETF, or exchange-traded fund. Major financial institutions like Blackrock, Fidelity, and Invesco have applied with the U.S. Securities and Exchange Commission (SEC) to launch ETFs.\n\nWhat is an ETF?\n\n💸 An ETF is an investment vehicle that is publicly traded, like a stock, but tracks the performance of an underlying asset or index, rather than one company.\n\n🛢️ An ETF is a way for investors to get exposure to the value of its underlying asset, like gold or oil.\n\n📈 ETFs trade on a traditional stock exchange, and their value should rise when the asset increases in price, and fall when it decreases.\n\nSEC Approves First Leveraged Bitcoin Futures ETF\n\nThe first ETF launched in 1993, and they became popular as a way for retail investors to invest in a basket of assets at once. If you wanted to invest in 500 of the largest companies in America at once, you could buy shares in a S&P 500 ETF.\n\nA Bitcoin ETF works in much the same way as any other ETF. Investors buy shares in the ETF through whatever brokerage they buy stocks, and can trade them the same way they'd trade shares in Apple or Tesla.\n\nThe 2x bitcoin ETF $BITX has become effective, scheduled to launch Tuesday. I was doubtful it would happen but looks like it’s official. Could this be early sign of SEC lightening up? After $BITO launch I believe they made earlier 2x filers withdraw pic.twitter.com/XXxSt9xypu — Eric Balchunas (@EricBalchunas) June 23, 2023\n\nBitcoin ETFs track the current price of Bitcoin, and should act in lockstep with Bitcoin's price swings.\n\nStory continues\n\nWhy the need for a Bitcoin ETF?\n\nSo, why wouldn’t investors just buy Bitcoin?\n\nFor most regular retail investors, Bitcoin and cryptocurrencies in general still look risky.\n\nBesides having unclear regulations around them, owning Bitcoin requires keeping a Bitcoin wallet and trusting crypto exchanges, which are still uncharted territory for people unfamiliar with the space and require a certain level of self-education.\n\nHolding Bitcoin places the burden of security squarely on you, making you responsible for keeping your own private keys safe (unless you want to entrust them to the exchange). This may mean buying a hardware wallet to protect purchased Bitcoin, or storing private keys in a secure manner. You’d also have to work out how to file taxes for sales of Bitcoin that resulted in capital gains.\n\nHow To File Your Crypto Taxes In The U.S.\n\nWith a Bitcoin ETF, investors need not worry about private keys, storage, or security. They own shares in the ETF just like their shares of stock, and can gain exposure to the cryptocurrency market without having to go through the hoops of purchasing and holding crypto.\n\nAnd to put it plainly, that is an extremely appealing proposition for many regular folks—as well as sophisticated institutional investors.\n\nThat's why so many hedge funds and other investment firms have filed applications with the U.S. Securities and Exchange Commission (SEC) for Bitcoin ETFs. Gemini founders Cameron and Tyler Winklevoss were first out of the gate with an application for the Winklevoss Bitcoin Trust in 2013. In 2018, the U.S. Patent and Trademark Office awarded the Winklevoss brothers a patent for “exchange-traded products.\" But the SEC still hasn't approved their ETF—or any others.\n\nHow does a Bitcoin ETF work?\n\nA Bitcoin ETF is managed by a firm that buys and holds the actual Bitcoin; the price is pegged to the Bitcoin held in the fund. The firm lists the ETF on a traditional stock exchange, and you, the investor, trade the ETF just as you would any other stock. Bitcoin ETFs also offer new types of trading opportunities, including short-selling, where investors can bet against Bitcoin.\n\nBut there are also some key differences between a Bitcoin ETF and other ETFs.\n\nFirst, some ETFs, like those that track the S&P 500, represent equity shares, so you get a cut of the dividends that any company in the ETF pay to their shareholders. When Tesla pays a dividend and you have shares in an ETF that includes Tesla, you get a (smaller) dividend. Bitcoin is decentralized, so that won't happen with a Bitcoin ETF.\n\nSecond, just like with other ETFs, you have to pay fees to the company offering the ETF. But with a Bitcoin ETF, some portion of your fees would go to paying the custody and management fees for the purchase and storage of the Bitcoin that underlies the ETF.\n\nA brief history of Bitcoin ETF progress\n\nWhat’s so special about a Bitcoin ETF?\n\nA Bitcoin ETF in the U.S. is expected to bring a new level of mainstream trustworthiness and acceptance to Bitcoin investing. In 2020 and 2021, big publicly traded companies including Square and Tesla bought Bitcoin as an investment for their balance sheets, which spurred new adoption—but the cryptocurrency is still seen by many conservative investors as a risky bet or even a gimmick.\n\nThe approval of a Bitcoin ETF by the SEC would mean that institutional investors can more easily speculate on the price of Bitcoin. It would functionally bring Bitcoin to Wall Street, with the Bitcoin ETF traded through the same places as Tesla stock, bonds, gold, oil, or any other traditional assets.\n\nAnd it would likely be a huge boost to the price of Bitcoin.\n\nCannabis ETFs have become popular for many of the same reasons that Bitcoin ETFs have. Just like crypto, the marijuana industry is viewed as risky and uncertain by traditional investors who still want the opportunity to profit from it.\n\nBitcoin Price Stable Despite BitMEX Arrests and Trump's COVID Diagnosis"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2V0Zi91cy1pbnZlc3RvcnMtZnVlbC1iaXRjb2luLXMtbWV0ZW9yaWMtcmlzZS1hbWlkLWluc3RpdHV0aW9uYWwtYnV5aW5nLWZyZW56eS0xMDMyNDIxMzQ00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "US Investors Fuel Bitcoin's Meteoric Rise Amid Institutional Buying Frenzy - Markets Insider",
        "content": "American investors are increasingly flocking to Bitcoin (CRYPTO: BTC) as major financial institutions ramp up their engagement, bolstering the cryptocurrency's recent surge.\n\nThis information was highlighted by K33 Research, a cryptocurrency analytics firm, in one of their reports, Coindesk reported.\n\nBitcoin witnessed a remarkable 85% surge this year, outshining the majority of the cryptocurrency market.\n\nThis positive trend is attributed to the growing involvement of financial giants such as BlackRock Inc (NYSE:BLK), Fidelity and Citadel, which has been a catalyst in boosting investor confidence.\n\nOn the other hand, alternative cryptocurrencies have faced difficulties in the wake of heightened regulatory investigations, particularly concerning their status as unregistered securities.\n\nConsequently, trading platforms have exercised caution and limited the availability of popular tokens in order to circumvent potential risks.\n\nThe report also shed light on Bitcoin's appreciable gains during U.S. market hours, amassing approximately 30% in cumulative gains since plummeting to around $16,000.\n\nInterestingly, the U.S. market outperformed its Asian and European counterparts.\n\nThe activity in the U.S. witnessed a significant spike after BlackRock, the world-renowned asset management firm, submitted an application for a Bitcoin spot exchange-traded fund on June 14.\n\nThe SEC rejected the application today (June 30) as being inadequate. BlackRock can resubmit if it wishes.\n\nAlso Read: The Tax Tides Turn As Slovakia Becomes A Crypto Dreamland\n\nBitcoin has also lately shown signs of disassociation from the U.S. stock markets, including the S&P 500 and Nasdaq.\n\nAccording to K33, Bitcoin's 30-day correlation with these markets turned negative last week, marking the first such instance since January 2021.\n\nVetle Lunde, a senior analyst at K33, mentioned that \"This illustrates that U.S. traders are allocating in BTC due to idiosyncratic reasons\" and suggested that this could be a move towards portfolio diversification.\n\nBlackRock's proactive steps have played a significant role in reinvigorating institutional participation in the Bitcoin market.\n\nThe Chicago Mercantile Exchange (CME), which is popular among seasoned investment companies, witnessed open interest approaching its peak, as indicated by K33's data.\n\nAdditionally, digital asset funds reported inflows of $199 million last week, the highest in nearly a year, with Bitcoin-focused funds accounting for 94% of these inflows.\n\nThis was revealed in a separate report by asset management company CoinShares.\n\nRead Next: Binance's Expansion Thwarted: German Regulator Denies Crypto Exchange License\n\nJoin Benzinga's Future of Crypto in New York City on Nov. 14, 2023, to stay updated on trends like AI, regulations, SEC actions & institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nPhoto: Shutterstock"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ub3J0aC1jYXJvbGluYS1ob3VzZS1wYXNzZXMtYmlsbC10by1zdHVkeS1iaXRjb2luLWhvZGxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "North Carolina House passes bill to commission study on holding Bitcoin - Cointelegraph",
        "content": "A bill that would see North Carolina’s Department of State Treasurer study the feasibility and benefits of the state holding Bitcoin (BTC) has passed the lower house of the General Assembly.\n\nOn June 28, the North Carolina House of Representatives passed the bill which would commission a $50,000 study to examine “acquiring, securely storing, insuring, and liquidating” both gold bullion and “virtual currency [...] such as Bitcoin.”\n\nThe study would investigate what impact gold and cryptocurrency holdings would have if North Carolina held part of its funds in crypto and gold.\n\nSpecifically, it would research if such holdings would hedge against inflation and “systemic credit risks,” and if gold and crypto could reduce volatility, increasing the state’s portfolio returns.\n\nThe bill mulls potentially creating a state-administered depository for crypto that would see North Carolina as the custodian of its digital asset holdings.\n\nThe study would, however, examine the costs and benefits of using a “privately managed depository or another state’s depository.”\n\nThe 120-member House passed the bill, with 73 voting in favor, 40 against and seven absent.\n\nThe bill must pass the Senate before it’s either signed into law or vetoed by Governor Roy Cooper.\n\nRelated: Yes, the Secret Service has an NFT collection, and no, it’s not for sale\n\nOn May 3, North Carolina’s House unanimously passed a bill that would prohibit payments to the state using a central bank digital currency (CBDC).\n\nThe bill stipulated the United States Federal Reserve would also be barred from using North Carolina to test any future pilot CBDC.\n\nThe day before, on May 2, a one-year moratorium on crypto mining was passed by the Board of Commissioners for Buncombe County in North Carolina.\n\nOpinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDYvMzAvYmFua3J1cHQtY2Vsc2l1cy1jYW4tY29udmVydC1hbHRjb2lucy10by1idGMtZXRoLXN0YXJ0aW5nLWp1bHktMS1mb2xsb3dpbmctc2VjLXRhbGtzL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDYvMzAvYmFua3J1cHQtY2Vsc2l1cy1jYW4tY29udmVydC1hbHRjb2lucy10by1idGMtZXRoLXN0YXJ0aW5nLWp1bHktMS1mb2xsb3dpbmctc2VjLXRhbGtzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bankrupt Celsius Can Convert Altcoins to BTC, ETH Starting July 1 Following SEC Talks - CoinDesk",
        "content": "The company has “been in regular dialogue with the Securities and Exchange Commission (the “SEC”) and certain state regulatory agencies regarding the proposed distribution of cryptocurrency under the Plan to ensure that all such distributions are in full compliance with applicable federal and state laws and regulations,” the filing added."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1zZWMtc2F5cy1zcG90LWV0Zi1hcHBsaWNhdGlvbnMtYmxhY2tyb2NrLWZpZGVsaXR5LWluYWRlcXVhdGUtMjAyMy020gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Dips After SEC Says Recent ETF Applications Are Inadequate - Markets Insider",
        "content": "Bitcoin fell 2% on Friday after the SEC reportedly said recent ETF applications are inadequate.\n\nBlackRock and Fidelity recently filed for bitcoin spot ETFs, boosting hope that an approval was near.\n\nApplicants can revise their filings and resubmit with the SEC's feedback, according to The Wall Street Journal.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin coin prices fell as much as 5% on Friday after the Securities and Exchange Commission said recent ETF applications from BlackRock and Fidelity were inadequate, according to a report from The Wall Street Journal.\n\nBlackRock, Fidelity, WisdomTree and other traditional asset managers filed applications with the SEC to launch a spot bitcoin ETF, ginning up hope among investors that an approval could finally be near.\n\nBut Friday's report suggested that approval of a spot bitcoin ETF still faces some hurdles, even after the regulatory agency approved a 2x leveraged bitcoin futures ETF.\n\nThe SEC told the CBOE and Nasdaq, which filed the bitcoin ETF applications on behalf of BlackRock and Fidelity, that they weren't \"sufficiently clear and comprehensive,\" according to the report, which cited people familiar with the matter.\n\nAdvertisement\n\nBut the SEC would also welcome revisions and updates from the asset managers and an eventual refiling of their applications, taking into account the agency's feedback.\n\nThe price of bitcoin had surged above the $30,000 level earlier this month after the BlackRock and Fidelity filings reignited the race for the first spot bitcoin ETF.\n\nOn Friday, bitcoin had briefly dipped below $30,000 before rebounding, falling less than 2% and holding onto the $30,000 level, at $30,278.\n\nThe crypto industry has for years longed for a US bitcoin ETF, which would directly track the price of bitcoin and allow investors to gain exposure to the asset class without buying bitcoin on a crypto exchange and storing them, taking out a lot of the hassle for everyday investors.\n\nAdvertisement\n\nSince at least 2017, the SEC has been rejecting bitcoin ETF applications for various reasons, including the fear that they were vulnerable to fraud and market manipulation. However, the SEC has approved various ETFs that own bitcoin futures, not the underlying coin itself.\n\nPart of the SEC's concern with the latest bitcoin ETF applications was that they didn't provide enough information about the \"surveillance-sharing agreement\" they would implement to ensure that the ETF was not susceptible to fraud.\n\nThe CBOE said it plans to revise and resubmit its bitcoin ETF filing, which would push back a potential approval by at least another week after the SEC receives the application, according to the WSJ report."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9wdGlvbnMtZXhwaXJ5LTMway1yZXNpc3RhbmNlLWFuZC1wcmljZS1pbXBhY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin options: How will Friday's $4.7B expiry impact BTC price? - Cointelegraph",
        "content": "The $4.7 billion Bitcoin (BTC) monthly options expiry on June 30 might play a decisive role in determining whether the $30,000 price will consolidate as long-term support and open room for further bullish momentum.\n\nWhy is Bitcoin breaking yearly highs?\n\nMany analysts consider Bitcoin’s recent breakout above $27,000 to be a bet on the multiple spot Bitcoin exchange-traded fund (ETF) applications, including those of BlackRock and ARK Invest.\n\nThe news also fueled expectations for Grayscale to be able to convert its Grayscale Bitcoin Trust to a Bitcoin ETF.\n\n$31,000 caps Bitcoin price gains for now\n\nOn the other hand, Bitcoin bears will try to take advantage of macroeconomic and regulatory headwinds, including exchanges implementing mandatory Know Your Customer (KYC) procedures.\n\nOn June 28, KuCoin announced an upcoming KYC system upgrade in a move to increase compliance with global Anti-Money Laundering regulations.\n\nMoreover, there’s increasing concern over the impact of miners’ sell pressure, with the network hash rate reaching 400 exahashes per second. Analytics firm Glassnode noted that miners sent an all-time high percentage of their BTC revenue to exchanges over the past week, totaling $128 million. Curiously, the movement mimics spikes seen during the 2021 bull run as miners took profits.\n\nAdditionally, during the European Central Bank Forum on Central Banking in Portugal, Federal Reserve Chair Jerome Powell warned that most policymakers expect two more rate hikes this year. According to the CME's FedWatch Tool, investors are pricing in 82% odds of a 25-basis-point interest rate increase on July 26.\n\nBitcoin 4-hour price movements during option expiries. Source: TradingView\n\nBitcoin price last flirted with the $31,000 level on June 27, but the resistance proved stronger than anticipated. The subsequent correction to $30,000 supports the thesis of sideways trading in the short term as investors evaluate the impacts of additional interest rate increases by the Fed.\n\nSuch a restrictive scenario for the global economy might explain why some Bitcoin traders decided to take profits, which limited the price upside.\n\n$4.7 billion out of reach — bulls were too optimistic\n\nThe open interest for the June 30 options expiry is $4.7 billion, but the actual figure will be lower since bulls were expecting price levels of $32,000 or higher. These traders got excessively optimistic after Bitcoin’s price rallied 25.5% between June 15 and June 23, testing the $31,000 resistance.\n\nDeribit Bitcoin options aggregate open interest for June 30. Source: Deribit\n\nThe 0.56 put-to-call ratio reflects the imbalance between the $3.1 million in call (buy) open interest and the $1.7 million in put (sell) options.\n\nBut if Bitcoin’s price remains near $30,500 at 8:00 am UTC on June 30, only $630 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $31,000 or $32,000 is useless if BTC trades below that level on expiry.\n\nBitcoin bears aim for sub-$30,000 to balance the scales\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on June 30 for call (bull) and put (bear) instruments varies depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit.\n\nBetween $28,000 and $29,000: 7,200 calls vs. 16,200 puts. Bears are in control, profiting $250 million.\n\n7,200 calls vs. 16,200 puts. Bears are in control, profiting $250 million. Between $29,000 and $30,000: 13,000 calls vs. 12,600 puts. The result is balanced between put and call options.\n\n13,000 calls vs. 12,600 puts. The result is balanced between put and call options. Between $30,000 and $31,000: 1,500 calls vs. 2,100 puts. The net result favors the call instruments by $440 million.\n\n1,500 calls vs. 2,100 puts. The net result favors the call instruments by $440 million. Between $31,000 and $32,000: 3,300 calls vs. 800 puts. The net result favors the call instruments by $670 million.\n\nThis crude estimate considers the call options used in bullish bets and the put options exclusively in neutral-to-bearish trades. Even so, this oversimplification disregards more complex investment strategies.\n\nFor instance, a trader could have sold a put option, effectively gaining positive exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nRelated: Will $30K be a new springboard for Bitcoin bulls?\n\nConsequently, it will come down to whether BTC price bears are willing to risk exposure while a potential spot Bitcoin ETF approval is being analyzed by the SEC.\n\nAlthough it is impossible to estimate the potential inflow or the timing of such an event, it paves the way for bulls to secure a $440 million profit by keeping Bitcoin price above $30,000 in the short term.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tYXRtLWZpcm0tYml0Y29pbi1kZXBvdC13aWxsLWdvLXB1YmxpYy1vbi1uYXNkYXEtc3RhcnRpbmctanVseS0z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Crypto ATM firm Bitcoin Depot will go public on Nasdaq starting July 3 - Cointelegraph",
        "content": "Bitcoin Depot, one of the largest cryptocurrency ATM firms in the United States, has announced the closing of a merger deal allowing the company to go public.\n\nIn a June 30 announcement, fintech firm GSR II Meteora Acquisition Corporation said its stockholders had approved the merger for the firm to act as a special purpose acquisition company for Bitcoin Depot. The deal, first reported in August 2022, cost $885 million and is expected to allow investors exposure to Bitcoin Depot on the Nasdaq starting July 3.\n\n$GSRM & Bitcoin Depot deal closing PR. Will trade as $BTM on Monday, July 3.https://t.co/tlimnZdQqF — SPAC Track (@SPACtrack) June 30, 2023\n\nAccording to Bitcoin Depot founder and CEO Brandon Mintz, the merger deal was aimed at supporting “numerous growth opportunities” and promoting the adoption of Bitcoin (BTC) in North America. Investors will be able to find shares of Bitcoin Depot under the ticker symbols BTM and BTMWW for its common stock and public warrants, respectively.\n\nRelated: Net Bitcoin ATMs record an increase after 4 months of global downtrend\n\nThe announcement came amid regulatory scrutiny of firms in the U.S. offering crypto products or services. The Securities and Exchange Commission filed lawsuits against exchanges Binance and Coinbase for alleged unregistered securities offerings. However, investment vehicles with exposure to crypto also seem to be on the rise following BlackRock filing an application in June to list a spot Bitcoin exchange-traded fund.\n\nFounded in 2016, Bitcoin Depot is one of the biggest crypto ATM firms in North America, with more than 9,130 locations, according to its website. In May, fellow ATM provider Bitcoin of America announced it would shutter operations in Connecticut following the state’s Department of Banking saying the firm didn’t have the proper licensing.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stZXRmLWlzbnQtYnVsbGlzaC1mb3ItYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Don't be naive — BlackRock's ETF won't be bullish for Bitcoin - Cointelegraph",
        "content": "There is no doubt that BlackRock’s spot Bitcoin exchange-traded fund (ETF) application — and the flood of contenders that followed — has buoyed the bulls. It could signal the winds of change in the regulatory sphere, they say. It could bring Bitcoin exposure to the masses, they holler.\n\nWhile there might be some truth in these statements, we need to take a step back and look at the bigger picture. We should not be in a world where the mere possibility of a spot Bitcoin ETF coming to fruition in the United States sends markets into overdrive. BlackRock’s potentially oversized impact on Bitcoin’s (BTC) price trajectory should give everyone in the Bitcoin community pause for thought rather than be a cause of celebration.\n\nA spot Bitcoin ETF would clearly be a simple way for U.S. retirement funds to gain exposure to Bitcoin’s upside, and it’s very possible that an approved ETF in the U.S. would drive significant price appreciation in the years that follow. But what will it do to further Bitcoin’s cause — to decentralize finance, empower the unbanked and revolutionize how we interact with money globally? Very little, if anything.\n\nThe TradFi invasion\n\nBlackRock’s application and the discussions around it have certainly served as a reminder of the distrust that exists between some parts of the crypto community and the traditional finance world.\n\nRelated: Ripple verdict could spark a new bull market — or more malaise\n\nThe timing of BlackRock’s foray into Bitcoin ETFs is particularly intriguing and has sent conspiracists wild. Given the Securities and Exchange Commission’s lawsuits against Binance and Coinbase, some believe the agency is disarming crypto-native firms to pave the way for the likes of BlackRock to take over the crypto mantle.\n\nOf course, such claims are unsubstantiated speculation. However, they demonstrate how the more deeply involved traditional finance (TradFi) entities become in the digital assets space, the more we risk Bitcoin becoming just another asset class and losing sight of its intended purpose and true value proposition.\n\nThese are the key dates and timeline for the BlackRock Spot Bitcoin ETF\n\n\n\nThis is how I'm positioning over the coming weeks... pic.twitter.com/V1Kwvbh8Rc — Ξ huf (@hufhaus9) June 26, 2023\n\nWhen you delve further into the details of BlackRock’s filing, the alarm bells start ringing louder. The filing makes a provision that in the event of a hard fork, BlackRock can “use its discretion to determine which network should be considered the appropriate network for the Trust’s purposes.” This could potentially be significant, enabling BlackRock to attempt to weigh in on Bitcoin’s direction — or at least steer institutional allocations and mainstream uptake.\n\nOversized influence on what is intended to be a decentralized monetary system is clearly a cause for concern in and of itself, but the broader issue with ETFs is that investors cannot withdraw the underlying Bitcoin. It’s in the ownership of Bitcoin that the true benefits lie.\n\nUpholding Bitcoin’s ethos\n\nLet’s not forget that Bitcoin was created as a direct response to the bailouts and quantitative easing that followed the 2008 financial crisis. Unlike traditional currencies, Bitcoin has a limited supply, is genuinely scarce and operates with decentralized governance.\n\nFifteen years on from the crash, central banks around the world can still not break the habit of printing money, using it as a “get out of jail free” card. Except it is nothing but free. Ordinary, hard-working individuals the world over are paying the price as their currencies are debased, which is now exacerbated by soaring nontransitory inflation.\n\nRelated: Gary Gensler is hurting the little guys for Wall Street\n\nWhile central banks play Russian roulette with public finances, Bitcoin’s ethos is to empower individuals by providing a censorship-resistant, borderless form of money. As an open-source monetary network, Bitcoin has the power to transform the way we interact with money. It could significantly reduce the importance of centralized institutions — perhaps even render them obsolete — which the conspiracists would say TradFi knows only too well.\n\nBitcoin ETFs seem at odds with this empowerment ethos. El Salvador — with its radical approach to Bitcoin adoption — is arguably more aligned with Bitcoin’s core aims than any ETF could ever be. While El Salvador seeks to empower the unbanked through actively promoting Bitcoin ownership, Bitcoin ETF investors will be left without any of the benefits of Bitcoin while lining the pockets of — and cementing the status of — TradFi institutions.\n\nOwnership over price speculation\n\nBitcoin spot ETFs are likely to establish a stronger presence within the cryptocurrency ecosystem in the years to come and appeal to a certain class of investors, yet their role should not overshadow the trajectory of Bitcoin’s future. If we only focus on giving people exposure to price movements without actual ownership, then we will have totally missed the point of what could be a revolutionary monetary system. And no, if a rule is ever proposed that demands retail can only invest via ETFs rather than through direct ownership, this is not “consumer protection.” It spells their disempowerment.\n\nOur industry should maintain a cautious stance, understanding that the increasing involvement of ETFs and traditional finance in the cryptosphere could pose risks to the underlying purpose of Bitcoin. Being alert to these risks means not getting blinded by the hype, but remaining committed to the original ethos of Bitcoin — a tool to transform the world’s financial systems, not merely an asset for speculation.\n\nBen Caselin is vice president and chief strategy officer at MaskEX, a digital assets trading platform headquartered in Dubai, UAE. Focused on driving the mass adoption of Bitcoin and digital assets, he is responsible for MaskEX’s global expansion efforts across business development, marketing and communications. Prior to joining MaskEX, he held various senior executive roles at AAX. He holds a BSc degree in cultural anthropology and development sociology from Utrecht University and an MSc in global migration studies from UCL.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi1hcHByb3ZhbC1iaWxsaW9uLWRvbGxhci1zZWxsLXByZXNzdXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Why approving a Bitcoin ETF might unleash $18B in sell-pressure - Cointelegraph",
        "content": "The introduction of a spot-based Bitcoin (BTC) exchange-traded fund (ETF) would make the asset more accessible to individual investors and mutual funds. What’s more, unlike a futures-based Bitcoin ETF, a spot-based ETF involves actually buying BTC.\n\nSo, will the approval of the first Bitcoin ETF be a bullish event? Not necessarily.\n\nGBTC ‘discount’ remains in the double digits\n\nOver the years, the United States Securities and Exchange Commission (SEC) has rejected every Bitcoin ETF applicant, with the latest denial issued to the VanEck Bitcoin Trust on March 10, 2023.\n\nThe SEC concluded that the offer did not have a “comprehensive surveillance-sharing agreement with a regulated market of significant size related to spot Bitcoin.“ Regulators are hesitant to release what many believe would be a more equitable and transparent Bitcoin product.\n\nInvestors now question whether the latest bids from ARK Invest and BlackRock to launch spot Bitcoin ETFs might be the solution to Grayscale’s Bitcoin Trust (GBTC), an investment vehicle with shares traded on the stock exchange.\n\nInterestingly, the GBTC “premium” jumped to its best levels in months after BlackRock announced its ETF filing.\n\nGrayscale GBTC premium/discount to net assets. Source: CoinGlass\n\nBut while the potential approval of a spot Bitcoin ETF might seem bullish initially, its consequences for the BTC price can be negative, at least in the short term.\n\nWhat’s an ETF?\n\nFirst, an ETF is a form of security that holds diverse underlying investments, such as commodities, stocks and bonds. The ETF may resemble a mutual fund because its issuer pools and manages the given assets.\n\nThe most well-known example of this instrument is the SPDR S&P 500 ETF Trust, which tracks the S&P 500 index. State Street manages the mutual fund’s $436 billion worth of assets.\n\nRelated: Bitcoin ETF race gets hotter as ARK Invest adds surveillance agreement to application\n\nBuying an ETF grants the investor direct ownership of the fund’s contents, resulting in different tax consequences than holding futures contracts or leveraged positions. While Bitcoin spot ETFs continue to be rejected, identical products have been available for decades for bonds, global currencies, gold, Chinese equities, real estate and oil.\n\n30% GBTC discount is likely justified\n\nThe Grayscale Bitcoin Trust — an investment fund with $18.4 billion of assets under management — is currently trading at a -30% discount versus its Bitcoin holdings. This gap between their 626,778 Bitcoin at market value and the GBTC shares trading on regular stock exchanges reached as low as -49% in December 2022.\n\nConsequently, this discount is likely justified as the instrument lacks the tools to allow arbitrage. Grayscale’s GBTC is the undisputed leader in the cryptocurrency market, despite being classified as a closed-end fund, which means that the number of available shares is limited.\n\nShares of GBTC are not freely created, nor do they have a redemption plan. Due to this inefficiency, there are large price differences when compared to the fund’s actual Bitcoin holdings. In contrast, an ETF gives the market maker the ability to issue and redeem shares, ensuring that the premium or discount is typically small.\n\nGBTC charges a set 2% annual administrative fee; therefore, the discount may be acceptable given that the SEC continues to reject appeals and requests from all fund managers.\n\nOn the other hand, ETFs typically trade at par with net assets, as opposed to GBTC. For example, the Purpose Bitcoin ETF (BTCC.U) held a $5.63 net asset value per share on June 27, and the shares closed at $5.65 on the Toronto Stock Exchange.\n\nSimilarly, the U.S. derivatives ProShares Bitcoin Strategy ETF underlying price was $16.89 on June 28, while its shares traded at $16.89.\n\nSpot Bitcoin ETF approval might initially pressure BTC\n\nEssentially, an investment trust product is considerably less desirable than an ETF, and Grayscale has done little to mitigate the impact on GBTC investors thus far. However, market sentiment improved modestly after the world’s largest asset manager, BlackRock, filed to launch a Bitcoin spot price ETF.\n\nThe share price discount versus its contents will eventually trend to zero as redemptions and arbitrage opportunities arise if the SEC grants the asset manager Grayscale permission to convert its GBTC Trust to a bonafide Bitcoin ETF.\n\nIn this scenario, the odds are that a considerable amount of BTC could enter the market as investors will finally be able to exit their position at par.\n\nThe only question is: how much of that $18 billion will flow into other Bitcoin-related instruments or get sold on exchanges?\n\nIn any case, there’s a good chance that a spot Bitcoin ETF approval will produce significant sell-pressure from Grayscale’s GBTC conversion as BTC that’s been locked for three to eight years reenters the market.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1zZWMtZGVlbXMtc3BvdC1iaXRjb2luLWV0ZnMtZmlsaW5ncy1hcy1pbmFkZXF1YXRlLXJlcG9ydNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "US SEC deems spot Bitcoin ETFs filings as inadequate: Report - Cointelegraph",
        "content": "There may be a longer wait for a spot Bitcoin (BTC) exchange-traded fund (ETF) in the United States, as the Securities and Exchange Commission labeled investment managers’ recent applications inadequate.\n\nAccording to The Wall Street Journal, the securities regulator told the Nasdaq and the Chicago Board Options Exchange (Cboe) that their filings are not “sufficiently clear and comprehensive.” These exchanges represent asset managers in the filing of the financial product.\n\nIn the eyes of the SEC, the exchanges should have named the spot Bitcoin exchange with which they would have a \"surveillance-sharing agreement\" or provided sufficient information about the details of those surveillance arrangements. However, asset managers can resubmit the filings after clarifying the information.\n\nA flurry of applications has been filed over the past few weeks since BlackRock joined the list of companies seeking to debut the first spot Bitcoin ETF of Wall Street. BlackRock’s application introduced a “surveillance sharing agreement,” under which information about market trading and clearing activities are shared between entities to avoid the possibility of market manipulation.\n\nBlackRock’s application led ARK Invest and 21Shares to amend their third application for a spot BTC ETF to include a similar surveillance agreement. Other asset managers that refiled or amended their applications in the past days include Invesco, WisdomTree, Valkyrie and Fidelity. ARK Invest, however, is reportedly a front-runner in this race.\n\nETFs track a specific index and are generally traded on exchanges. In the cryptocurrency market, a fund that tracks the price of one or multiple digital tokens and consists of various cryptocurrencies is called a cryptocurrency ETF.\n\nSpot Bitcoin ETFs have been denied since 2017 by the SEC. In Canada, however, the financial product is already available. Three significant funds — Purpose Bitcoin, 3iQ CoinShares and CI Galaxy Bitcoin — are all directly invested in spot Bitcoin.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9pbmR1c3RyeS1uZXdzL25ld3MvZmlkZWxpdHktam9pbnMtcmFjZS1mb3Itc3BvdC1iaXRjb2luLWV0Zi13aXRoLXNlYy1maWxpbmctMjM5MzY50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Fidelity joins race for spot-bitcoin ETF with SEC filing - InvestmentNews",
        "content": "Fidelity Investments is the latest financial services heavyweight to throw its name into the race to offer the first U.S. exchange-traded fund investing directly in bitcoin.\n\nThe Boston-based asset manager, which has about $11 trillion in assets under administration and tens of millions of customers, refiled for the Wise Origin Bitcoin Trust, according to a document submitted Thursday with the Securities and Exchange Commission. Similar to previous U.S. spot bitcoin ETF filings in the past few weeks, the updated application says that Fidelity expects to enter into a surveillance-sharing agreement with a cryptocurrency exchange.\n\nIt’s the latest high-profile traditional finance firm to join the race, after BlackRock Inc. made a splash with its June 15 application for a spot ETF, which opened the floodgates for others to try their hand at it, as well. For crypto fans, it’s been a significant string of developments given BlackRock’s reputation on Wall Street, and the view held by some market-watchers that the asset manager wouldn’t be making an attempt were it not confident it could get regulatory approval.\n\nThere have been about 30 tries for a spot-bitcoin product, according to a tally from Bloomberg Intelligence. But applications have faced opposition by regulators, who have in the past cited market concerns and a lack of investor protections, among other things. Fidelity originally filed for the Wise Origin Bitcoin Trust in 2021, which was denied by the SEC in January 2022, according to a Fidelity spokesperson.\n\nEven so, BlackRock’s move spurred a number of similar filings from other issuers, including by Invesco Ltd., WisdomTree, Valkyrie and Bitwise. Meanwhile, Cathie Wood’s ARK Investment Management has said that it believes it could be first in line to get any potential regulatory approval. ARK had in April, in conjunction with crypto-issuer 21Shares, refiled its application for one.\n\nTo be sure, this isn’t the first hype cycle over a potential launch. Crypto fans, who have been yearning for a spot-bitcoin ETF for years, have been through periods of excitement before, only for regulators to ultimately rebuff all attempts.\n\nWhile BlackRock’s filing was credited by observers for helping to push the price of bitcoin to a one-year high last week, the market reaction to the Fidelity refiling was fairly muted. Bitcoin was up about 1.5% to $30,500 as of 2:25 p.m. Thursday in New York, though off the highest level of the day.\n\n[More: Crypto exchange backed by Citadel Securities, Fidelity, Schwab starts up]"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmNjbi5jb20vYml0Y29pbi1jYXNoLWRvdWJsZS12YWx1ZS1pbnN0aXR1dGlvbmFsLWludGVyZXN0LWJjaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Cash has Doubled in Value This Week. Can We Expected Institutional Interest in BCH? - CCN.com",
        "content": "Key Takeaways\n\nBitcoin Cash price reaches a 14-month high following an international trading rally\n\nThe ‘next big’ crypto exchange endorses Bitcoin Cash\n\nUS officials support BCH as a viable payment option\n\nBitcoin Cash (BCH) continues to rise in value following the news of surging activity in the Bitcoin cash-Korean won (BCH/KRW) pair on Upbit, a South Korean cryptocurrency exchange.\n\nThe Bitcoin fork was already performing splendidly due to the news of EDX Markets, a new exchange backed by Fidelity, Citadel Security, and Charles Schwab, allowing the trade of the cryptocurrency on its platform.\n\nBCH Surges\n\nOn June 20th, EDX Markets, a new exchange backed by a few of the wealthiest financial institutions in the US, announced its launch. EDXM will only allow the trade of Bitcoin, Bitcoin Cash, LiteCoin, and Ethereum. These tokens are ones excluded from the war the SEC is waging against crypto.\n\nNaturally, the news caused Bitcoin Cash to witness a surge in its price, increasing by 24% overnight.\n\nNow, Upbit, a Korean crypto exchange, reports an increase in Bitcoin Cash trading volumes reaching $557.63 million in the past 24 hours. The sudden increase shows an almost 350% increase in the token’s activity on Upbit.\n\nBCH now trades for ~$320, the highest price Bitcoin Cash has reached in over a year.\n\nLawrence Lewitinn, Director of Content for The Tie, a crypto data company, stated that “the BCH rally can be seen as a combination of hope and a touch of greed, two of the ingredients that often fuel market movements in the cryptocurrency space, regardless of underlying fundamentals,”\n\nHowever, Lewitinn failed to mention one more key factor that may have influenced the support for Bitcoin Cash, governmental support.\n\nBitcoin Cash’s SEC Clearance\n\nIt’s no secret at this point that the US Securities and Exchange Commission is waging a serious war against crypto. The regulating body is battling against the world’s biggest exchanges, including Binance, Coinbase, and Ripple.\n\nThe crux of the SEC’s argument in each case is that these exchanges are trading in what the SEC recognizes as “unregistered securities”. However, these cases never include any mention of four specific tokens: Bitcoin, Bitcoin Cash, LiteCoin, and Ethereum.\n\nGensler himself admitted, way before he became the SEC Chair, that these coins are “not securities”, effectively recognizing them as “commodities”. And, with that in mind, these tokens are immune to SEC attacks on the matter.\n\nFor that very reason, EDXM took the smart decision to only allow trading using those tokens. On top of that, asset management firms such as BlackRock and Fidelity are filing spot ETFs that only concern Bitcoin.\n\nIf Lewitinn is right, then BCH and Co should be on a steady trajectory towards much higher prices by the end of the year as they gain more and more interest from institutional investors."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wNi8zMC8yNjk4MDc5LzAvZW4vQml0Y29pbi1EZXBvdC1hbmQtR1NSLUlJLU1ldGVvcmEtQWNxdWlzaXRpb24tQ29ycC1Bbm5vdW5jZS1DbG9zaW5nLW9mLUJ1c2luZXNzLUNvbWJpbmF0aW9uLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Depot and GSR II Meteora Acquisition Corp. Announce Closing of Business Combination - GlobeNewswire",
        "content": "ATLANTA and NEW YORK, June 30, 2023 (GLOBE NEWSWIRE) -- Lux Vending, LLC dba Bitcoin Depot (“Bitcoin Depot” or the “Company”), a U.S.-based Bitcoin ATM operator and leading fintech company, and GSR II Meteora Acquisition Corp. (NASDAQ: GSRM) (“GSRM”), a special purpose acquisition company, today announced the successful closing of their previously announced business combination (the “Business Combination”). The Business Combination was approved at a special meeting of GSRM stockholders on June 28, 2023 and closed on June 30, 2023.\n\n\n\nThe combined company will be renamed Bitcoin Depot Inc. and will be led by its existing management team. Bitcoin Depot’s common stock and public warrants are expected to begin trading on July 3, 2023 on the Nasdaq under the ticker symbols “BTM” and “BTMWW”, respectively.\n\n“The closing of the transaction and our listing on Nasdaq is an important milestone and an incredibly proud moment for the entire Bitcoin Depot team,” said Brandon Mintz, CEO and Founder of Bitcoin Depot. “Bitcoin Depot is well positioned with the largest market share in North America and the additional capital from this transaction will help support our numerous growth opportunities while advancing our mission to safely, securely, bring Bitcoin to the masses.”\n\nGus Garcia, Co-CEO and Director of GSRM, commented, “We are excited to complete our business combination with Bitcoin Depot and help support its growth strategy. Bitcoin Depot has a significant market share and continues to expand its footprint to provide greater access to the broader digital financial system. We believe Bitcoin Depot is poised to continue its momentum to take advantage of the highly fragmented Bitcoin ATM market both domestically and overseas.”\n\nLewis Silberman, Co-CEO and Director of GSRM, commented, “Bitcoin Depot has a proven track record of growth and profitability and its transaction volumes have remained strong despite the price volatility of Bitcoin. It’s been an honor to support the Bitcoin Depot team on their path to becoming a publicly traded company where it can further scale its business model and leverage its unique position in the expanding Bitcoin ecosystem.”\n\nAdvisors\n\nB.Riley Securities served as capital markets advisor to GSRM. Latham & Watkins LLP acted as legal advisor to GSRM. Kirkland & Ellis LLP served as legal advisor to Bitcoin Depot.\n\nAbout Bitcoin Depot\n\nBitcoin Depot was founded in 2016 with the mission to connect those who prefer to use cash to the broader, digital financial system. Bitcoin Depot provides its users with simple, efficient and intuitive means of converting cash into Bitcoin, which users can deploy in the payments, spending and investing space. Users can convert cash to Bitcoin at Bitcoin Depot’s kiosks and at thousands of name-brand retail locations through its BDCheckout product. The Company has the largest market share in North America with approximately 6,440 kiosk locations as of March 31, 2023. Learn more at www.bitcoindepot.com.\n\nAbout GSR II Meteora Acquisition Corporation\n\nGSR II Meteora Acquisition Corporation (NASDAQ: GSRM) is blank check company formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. GSRM’s management team is led by co-CEOs Gus Garcia and Lewis Silberman, President Anantha Ramamurti and CFO Joseph Tonnos. GSRM was formed in partnership with Meteora Capital, an investment adviser specializing in SPAC-related investments. For additional information, please visit www.gsrmet.com.\n\nForward-Looking Statements\n\nThe information in this press release and in any oral statements made in connection herewith include “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “estimate,” “plan,” “project,” “forecast,” “intend,” “will,” “expect,” “anticipate,” “believe,” “seek,” “target” or other similar expressions that predict or indicate future events or trends or that are not statements of historical matters, although not all forward-looking statements contain such identifying words. These forward-looking statements include, but are not limited to, statements regarding estimates and forecasts of financial and performance metrics and expectations and timing related to potential benefits of the Business Combination. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Bitcoin Depot’s and GSRM’s management and are not predictions of actual performance. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied on by any investor as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. Many actual events and circumstances are beyond the control of Bitcoin Depot and GSRM. These forward-looking statements are subject to a number of risks and uncertainties, including changes in domestic and foreign business, market, financial, political and legal conditions; failure to realize the anticipated benefits of the Business Combination; risks relating to the uncertainty of the projected financial information with respect to Bitcoin Depot; future global, regional or local economic and market conditions; the development, effects and enforcement of laws and regulations; Bitcoin Depot’s ability to manage future growth; Bitcoin Depot’s ability to develop new products and services, bring them to market in a timely manner and make enhancements to its platform; the effects of competition on Bitcoin Depot’s future business; the ability of Bitcoin Depot to issue equity or equity-linked securities in the future; the outcome of any potential litigation, government and regulatory proceedings, investigations and inquiries; and those factors described or referenced in GSRM’s final initial public offering prospectus dated February 24, 2022, its most recent Annual Report on Form 10-K for the year ended December 31, 2022, and the Proxy Statement, in each case, under the heading “Risk Factors,” and other documents of GSRM or Bitcoin Depot filed, or to be filed, from time to time with the SEC. If any of these risks materialize or GSRM’s and Bitcoin Depot’s assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that neither Bitcoin Depot nor GSRM presently know or that Bitcoin Depot and GSRM currently believe are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. In addition, forward-looking statements reflect Bitcoin Depot’s and GSRM’s expectations, plans or forecasts of future events and views as of the date of this press release. Bitcoin Depot and GSRM anticipate that subsequent events and developments will cause Bitcoin Depot’s and GSRM’s assessments to change. However, while Bitcoin Depot and GSRM may elect to update these forward-looking statements at some point in the future, Bitcoin Depot and GSRM specifically disclaim any obligation to do so except as otherwise required by applicable law. These forward-looking statements should not be relied upon as representing Bitcoin Depot’s and GSRM’s assessments as of any date subsequent to the date of this press release. Accordingly, undue reliance should not be placed upon the forward-looking statements.\n\nContacts:\n\nInvestors\n\nCody Slach, Alex Kovtun\n\nGateway Group, Inc.\n\n949-574-3860\n\nGSRM@gateway-grp.com\n\nMedia\n\nZach Kadletz, Brenlyn Motlagh, Ryan Deloney\n\nGateway Group, Inc.\n\n949-574-3860\n\nGSRM@gateway-grp.com"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90di9maXJzdC1tb3Zlci9jb2luYmFzZS1yZXNwb25kcy10by10aGUtc2Vjcy1sYXdzdWl0LXVucGFja2luZy10aGUtYml0Y29pbi1jYXNoLXJhbGx5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Coinbase Responds to the SEC's Lawsuit; Unpacking the Bitcoin Cash Rally - CoinDesk",
        "content": "Emily Parker was CoinDesk's executive director of global content. Previously, Emily was a member of the Policy Planning staff at the U.S. State Department, where she advised on Internet freedom and digital diplomacy. Emily was a writer/editor at The Wall Street Journal and an editor at The New York Times. She is the co-founder of LongHash, a blockchain startup that focuses on Asian markets. She is the author of \"Now I Know Who My Comrades Are: Voices From the Internet Underground\" (Farrar, Straus & Giroux). The book tells the stories of Internet activists in China, Cuba and Russia. Mario Vargas Llosa, winner of the Nobel Prize for Literature, called it \"a rigorously researched and reported account that reads like a thriller.\" She was chief strategy officer at Silicon Valley social media startup Parlio, which was acquired by Quora. She has done public speaking all over the world, and is currently represented by the Leigh Bureau. She has been interviewed on CNN, MSNBC, NPR, BBC and many other television and radio shows. Her book has been assigned at Harvard, Yale, Columbia, Tufts, UCSD and other schools. Emily speaks Chinese, Japanese, French and Spanish. She graduated with Honors from Brown University and has a Masters from Harvard in East Asian Studies. She holds Bitcoin, Ether and smaller amounts of other cryptocurrencies."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZGVjcnlwdC5jby8xNDY2NDIvd2h5LWRpZC1jaXRhZGVsLWJhY2tlZC1lZHgtbGlzdC1iaXRjb2luLWV0aGVyZXVtLWxpdGVjb2luLWFuZC1iaXRjb2luLWNhc2jSAWpodHRwczovL2RlY3J5cHQuY28vMTQ2NjQyL3doeS1kaWQtY2l0YWRlbC1iYWNrZWQtZWR4LWxpc3QtYml0Y29pbi1ldGhlcmV1bS1saXRlY29pbi1hbmQtYml0Y29pbi1jYXNoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Why Did Citadel-Backed EDX List Bitcoin, Ethereum, Litecoin, and Bitcoin Cash? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin Cash, a spin-off from the oldest digital asset, has struggled to find a market since launching in 2017. But it’s been on a roll this month: since the start of June, Bitcoin Cash (BCH) is up 98%, jumping from $113 to $224.\n\nThe slightly obscure digital asset—one of many cryptocurrency “forks”—is following Bitcoin, like many other coins and tokens which have surged in price since the biggest digital asset experienced a run. But BCH is doing by far the best.\n\nAD\n\nAD\n\nWhy? The coin is one of the lucky four chosen for EDX Markets, a new crypto exchange backed by major Wall Street players Charles Schwab, Citadel Securities, and Fidelity Digital Assets.\n\nEDX, which launched last week, decided to let its traders—institutional investors only—start off with Bitcoin, Ethereum, Litecoin, and Bitcoin Cash.\n\nThe reason is simple: regulatory clarity.\n\n“These specific cryptocurrencies are generally perceived as commodities by regulatory bodies, which significantly mitigates potential legal challenges,” Sei Labs co-founder Jeff Feng told Decrypt.\n\nYouwei Yang, Chief Economist at BTCM, added that the four assets are “widely regarded as digital commodities, making them relatively safe” from the U.S. Securities and Exchange Commission because they are made with electricity—a commodity.\n\nIn perhaps its toughest regulatory crackdown yet, the SEC has gone after a number of major crypto brands for allegedly flogging unregistered securities. Earlier this month, it went after Coinbase for allegedly offering and selling unregistered securities via its staking service. It also targeted Binance, the world’s biggest exchange, with a massive lawsuit for allegedly “operating as a fking [sic] unlicensed securities exchange in the U.S.A. bro,” according to the SEC.\n\nAD\n\nAD\n\nIn February, it hit Kraken with a $30 million fine for allegedly failing to register the offer and sale of its crypto asset staking-as-a-service program.\n\nThese regulatory enforcements are all because SEC Chairman Gary Gensler thinks—and has said for years—that most cryptocurrencies are unregistered securities.\n\nBut he has made it clear that Bitcoin is a commodity. He has been less clear on Ethereum, but the Commodities and Futures Trading Commission (CTFC) has said the asset is a commodity.\n\nAnd Bitcoin Cash and Litecoin are both Bitcoin forks—new cryptocurrencies that emerged from the asset’s original code—meaning they are likely to have the same status in the eyes of regulators.\n\nGreg Moritz, Co-Founder at the crypto hedge fund AltTab Capital, said that “none have been listed by the SEC as unregistered securities,” adding that all four assets are established and have history, “key factors in the decision-making process of EDX’s backers.”\n\nEDX Markets CEO Jamil Nazarali also said that he felt “very comfortable” that the four assets weren’t securities.\n\nFor now, these four “old school” cryptocurrencies will give “old school” investors a taste of the crypto world. But things could change, Feng noted. “As regulations evolve and the understanding of different cryptocurrencies becomes more nuanced, we could anticipate exchanges like EDX broadening their offerings,” he added.\n\nAD\n\nAD"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vZGVjcnlwdC5jby8xNDY4NTEvYml0Y29pbi1jYXNoLWJjaC1zdXJnZXMtMzMtOS1pbi0yNC1ob3Vycy1mb2xsb3dpbmctZWR4LWxpc3Rpbmctcy1rb3JlYW4tc2hvcnQtc3F1ZWV6ZdIBdWh0dHBzOi8vZGVjcnlwdC5jby8xNDY4NTEvYml0Y29pbi1jYXNoLWJjaC1zdXJnZXMtMzMtOS1pbi0yNC1ob3Vycy1mb2xsb3dpbmctZWR4LWxpc3Rpbmctcy1rb3JlYW4tc2hvcnQtc3F1ZWV6ZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Cash (BCH) Surges 33.9% in 24 Hours on EDX Listing, S. Korean Trading Spike - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin Cash (BCH) continues its uptrend that started after its listing on Citadel Securities, Fidelity Digital Assets, and Charles Schwab Corp.,-backed EDX Markets on June 20.\n\nThe BCH token is the highest weekly gainer in the top 300 tokens by market capitalization on CoinGecko, with 114.3% gains.\n\nIn comparison, Bitcoin (BTC) recorded 2.4% gains in the same period, while Ethereum (ETH) traded at par with last week’s price.\n\nAD\n\nAD\n\nThe latest 33.9% gain in BCH’s price in the last 24 hours appears to be driven by excess negative bets in the derivatives market fueling an uptrend and heightened trading interest on a South Korean exchange.\n\nA vertical rise\n\nThe EDX Markets exchange listing is considered by some to be a good proxy for the state of BCH's regulatory clearance. Jamil Nazarali, CEO of EDX Markets, deemed that the four crypto tokens listed on EDX Markets (Bitcoin, Ether, Bitcoin Cash, and Litecoin) were safe bets in terms of compliance with the United States Securities and Exchange Commission.\n\nBCH’s price was heavily suppressed for the calendar year, ranging between $100 and $150. Nevertheless, it has risen vertically after its listing on EDX Markets. BCH was last trading at $308.72, levels last seen 14 months ago in May 2022.\n\nCrypto research outlet The Tie found that BCH trading volumes on Binance reached levels not seen in two years as trading interest returned toward BCH after EDX Markets listing.\n\nEDX is still new, and its trading volume is relatively small compared to major exchanges like Binance, however this new enthusiasm for $BCH is evident in trading volume on Binance as well. $BCH trading volume on Binance has reached levels unseen in the past two years. pic.twitter.com/TS4kkdpsQG — The Tie (@TheTieIO) June 29, 2023\n\nAD\n\nAD\n\nWhile the increase in trading volume after a positive catalyst is a sign of strong market participation and interest in the asset, the uptrend is partly driven by a short squeeze and a surprising volume spike on the South Korean exchange, Upbit.\n\nA short squeeze is a phenomenon that occurs when an asset's price rises, as most traders who had bet against its price are forced to buy at a loss or experience forced liquidation.\n\nThe price volatility took out $19 million in liquidations in the last 24 hours, with short orders accounting for 77% of the total amount, representing the highest liquidation levels in June 2023, per Coinglass data.\n\nBCH liquidations over the past 30 days. Source: Coinglass BCH liquidations over the past 30 days. Source: Coinglass\n\nThe token also witnessed a surge in trading on the South Korean exchange Upbit. CoinGecko data shows that the 24-hour trading volume of the BCH/KRW pair on Upbit at $685 million is twice that of BCH trading volumes on Binance.\n\nIn fact, the BCH/KRW trading volume of Upbit was comparable to the BTC/USD pair trading volume of $508 million on Coinbase, the largest U.S.-based exchange."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNlbmQtMzVrLWJ0Yy1leGNoYW5nZXMtbmV3LWVsYXRpb24taW5mbG930gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin speculators send 35K BTC to exchanges in new 'elation inflow' - Cointelegraph",
        "content": "Bitcoin (BTC) short-term holders are feeling the need to sell BTC at $30,000, data shows.\n\nIn research released on June 28, on-chain analytics firm Glassnode flagged tens of thousands of coins being sent to exchanges.\n\nBitcoin speculative exchange moves “intensifying”\n\nBTC price action stalling at $30,000 is prompting a rethink when it comes to buyers who have turned a profit this month.\n\nIn particular, short-term holders (STHs) — those entities hodling funds for 155 days or less — are becoming increasingly keen sellers.\n\nMonitoring inflows to exchange wallets, Glassnode revealed a clear spike in funds being put up for trade originating from STHs, which correspond to Bitcoin’s more speculative investor cohorts.\n\n“The recent elation in Bitcoin price action has enticed an increase in Short-Term Holder interaction with exchanges,” it commented.\n\n“Currently, STH exchange inflows are intensifying, with a significant 1.28% (+35.4K BTC) of the STH Supply sent to exchanges.”\n\nAn accompanying chart makes a distinction between current inflows and those seen during the 2022 bear market.\n\nSTHs, it shows, are more inclined to sell en masse during periods of BTC price suppression to limit losses. Profit-taking, on the other hand — as seen now and in March, when BTC/USD first returned to the $30,000 mark — has resulted in overall lower exchange volumes.\n\nBitcoin percent short-term holder (STH) balance sent to exchanges annotated chart. Source: Glassnode/Twitter\n\nRealizing 10% gains\n\nThe figures indicate that speculative interest in Bitcoin remains fickle and highly sensitive to even smaller price movements.\n\nRelated: Bitcoin price clings to $30K as Fed’s Powell stresses more rate hikes\n\nNonetheless, STHs have become an important market force in 2023.\n\nAs Glassnode and Cointelegraph previously noted, their aggregate cost basis — around $26,500 earlier this month — has remained intact as a support level.\n\nMeanwhile, on-chain analysis has predicted that should BTC price upside return, the urge to take profit could quickly become overpowering.\n\nHistorical data has shown that once STH profitability reaches an aggregate 20%, selling begins, and against their current $26,500 breakeven point, anything much above $33,000 could spark a significant shift in hodler composition.\n\nCurrent data shows STH profitability at around 10%, with their realized price — the price at which STH coins last moved — now above $27,000.\n\nBitcoin short-term holder (STH) data. Source: Glassnode\n\nMagazine: How smart people invest in dumb memecoins: 3-point plan for success\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJrLWludmVzdC1qb2lucy1ibGFja3JvY2stYW5kLWZpZGVsaXR5LWluLXJhY2UtZm9yLWJpdGNvaW4tZXRmL9IBc2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJrLWludmVzdC1qb2lucy1ibGFja3JvY2stYW5kLWZpZGVsaXR5LWluLXJhY2UtZm9yLWJpdGNvaW4tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "ARK Invest Joins BlackRock and Fidelity in Race for Bitcoin ETF - Finance Magnates",
        "content": "When the world's largest fund manager, BlackRock, decided to apply for the creation of a spot Bitcoin (BTC) exchange-traded fund (ETF Exchange-Traded Fund (ETF) An exchange-traded fund (ETF) is a collection of a mixture assets, i.e. stocks, commodities, bonds, or cryptocurrencies that tracks an index or underlying portfolio of investments.Of note, an ETF functions an arbitrage mechanism that is designed to keep it trading close to its net asset value. Most tradable ETFs track a specific index. This most commonly mirrors a stock or bond index. The popularity of ETFs has grown in recent years and are seen as an attractive investment due to its low cost, e An exchange-traded fund (ETF) is a collection of a mixture assets, i.e. stocks, commodities, bonds, or cryptocurrencies that tracks an index or underlying portfolio of investments.Of note, an ETF functions an arbitrage mechanism that is designed to keep it trading close to its net asset value. Most tradable ETFs track a specific index. This most commonly mirrors a stock or bond index. The popularity of ETFs has grown in recent years and are seen as an attractive investment due to its low cost, e Read this Term) two weeks ago, nobody expected it to trigger a new fever in the cryptocurrency market.\n\nThe BTC price reached new highs for the year, and other Wall Street giants began to join BlackRock. Among them were Invesco, WisdomTree, Fidelity, and ARK Investment Management (ARK Invest), owned by popular investor Cathie Wood.\n\nARK Invest Updates its Bitcoin ETF Application\n\nAlthough BlackRock sparked a wave of new applications to register a Bitcoin ETF, ARK Invest was the first to submit such an application this year. Cathie Wood's firm already filed an application in April to create an instrument that tracks the price of 'physical' cryptocurrency.\n\nAs the topic has become a hot item in the media and is elevating the prices of major digital assets, ARK has decided to refresh its application. As can be seen from the amendment filed with the Securities and Exchange Commission (SEC) yesterday (Wednesday), the company made changes in its original application to make it similar to the one filed by BlackRock.\n\nKeep Reading South Africa Navigates Crypto Regulations: To License 60 Firms This Month\n\nThe most important updates include a contract to share oversight with the futures market run by the Chicago Mercantile Exchange (CME) and a cryptocurrency exchange. This is most likely going to be Coinbase.\n\nJUST IN: ARK has amended their 19b-4 for spot bitcoin ETF to include a surveillance sharing agreement bt CBOE and a crypto exchange (likely Coinbase), which makes their's like BlackRock's filing now, and puts them in pole position to be approved first bc they filed first. pic.twitter.com/P8PCmPdhln — Eric Balchunas (@EricBalchunas) June 28, 2023\n\nThe decision on the cryptocurrency ETF from ARK Invest, which it applied for with 21Shares, is first in line with the SEC. According to the current schedule, this should be decided by 13 August.\n\nBitcoin Prices Soar amid ETF Fever\n\nAt the time of BlackRock's announcement about applying for the creation of a spot Bitcoin ETF, one BTC cost less than $25,000. The cryptocurrency price was then testing at a three-month low.\n\nWall Street giants' interest in the market caused a dynamic increase in the crypto price. It rose by over 26% in a week and tested the $31,000 level, setting new highs for the year.\n\nBitcoin price. Source: CoinMarketCap\n\nHowever, the on-chain data suggest that the upward movements were not due to greater network activity, but pure speculation and an influx of more cash into regulated cryptocurrency instruments. Although a spot Bitcoin Bitcoin While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that Read this Term ETF is not yet available, investors can take advantage of ETFs tracking the prices of BTC futures contracts, options or futures themselves."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL2ZpZGVsaXR5cy1jcnlwdG8tYml0Y29pbi1ldGYtYXp1a2kv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvZmlkZWxpdHlzLWNyeXB0by1iaXRjb2luLWV0Zi1henVraS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Reports of Fidelity's imminent Bitcoin spot ETF filing boosts crypto - Forkast News",
        "content": "In this issue\n\nFidelity: Close to filing its own Bitcoin ETF Forkast 500 NFT Index: Azuki disappoints Asset tokenization in Singapore: One step closer\n\nFrom the Editor’s Desk Dear Reader, There’s a saying in gambling circles that the house always wins. It’s not an unreasonable supposition, given the fact that if casino operators didn’t bring in more cash than they paid out, they’d be forced to shut up shop. Some in the crypto community might be applying that same saying to the bastions of traditional finance this week as Wall Street appears to be putting another move on cryptocurrencies in which the ultimate winner seems set to be itself. Fidelity, one of the world’s biggest asset managers, is reportedly preparing to file an application to establish a spot Bitcoin exchange-traded fund. That would be a big bet on crypto — or at least on the coin that started it all. Almost by definition, it would also be a bet against the hostility to crypto shown by the U.S. Securities and Exchange Commission since the collapse of the FTX exchange last year. The regulator’s apparent distaste for crypto has made casualties of many companies in the sector that have bet against it in recent times. Binance, Coinbase, Kraken, Genesis and Gemini have all been on the receiving end of enforcement action, and the commission has set its sights on cryptocurrencies. Traditional finance firms have also bet against the SEC and lost, although only in terms of commercial opportunities that have gone untapped rather than actual penalties, losses and business closures. As we note in this week’s edition of The Current Forkast, Fidelity’s application for a spot Bitcoin ETF isn’t the company’s first. Indeed, the SEC has turned down every application for such a fund to date. But traditional finance sector players such as Fidelity and BlackRock, which lodged a spot Bitcoin ETF application a fortnight ago, are now showing increased confidence about their prospects of gaining the regulator’s favor. Perhaps it’s because they’re buoyed by judicial skepticism about the SEC’s reasoning in denying a spot Bitcoin ETF license to crypto asset manager Grayscale. Perhaps it’s also because they sense the pendulum might have swung too far against crypto and that the regulator may be minded to offer the industry a concession in the form of a vanilla financial product. Overall, the house needs to win to keep the tables open. Yet the original question posed by crypto was: Who runs the house? Given that the SEC appears unilaterally to have made up its mind, it feels like high time others started asking that question once again. Until the next time, Angie Lau,\n\nFounder and Editor-in-Chief\n\nForkast.News\n\n1. Bull run\n\nFidelity joins a list of financial institutions that in June submitted or updated their applications to issue spot Bitcoin ETFs, including BlackRock, WisdomTree, Invesco, Valkyrie and Bitwise. Image: Fidelity Investments/Canva\n\nCryptocurrencies are receiving a significant push as Fidelity Investments is reportedly nearing the filing of its own spot Bitcoin exchange-traded fund (ETF), the Block reported Tuesday, citing people familiar with the matter.\n\nThe move would not be Fidelity’s first attempt to file for a Bitcoin-backed ETF. In March 2021, the Wall Street giant filed for a spot Bitcoin ETF named the Wise Origin Bitcoin Trust, which was rejected by the U.S. Securities and Exchange Commission in January 2022. But it launched the Fidelity Advantage Bitcoin ETF in Canada in December 2021, which has risen 75% since the beginning of this year.\n\nAccording to the Block, Fidelity’s application will join the list of financial institutions that have recently submitted or updated their applications to issue spot Bitcoin ETFs, including BlackRock, WisdomTree, Invesco, Valkyrie and Bitwise.\n\nA spot Bitcoin ETF is a publicly traded investment vehicle tracking Bitcoin price, which allows investors to have Bitcoin exposure without directly handling the underlying cryptocurrency.\n\n“Bitcoin ETF applications have supported investors’ sentiment as institutional and retail investors could show increasing interest in the market through such investment vehicles,” said Denys Peleshok, head of Asia at Belize-based financial brokerage CPT Markets, in email comments.\n\n“If the SEC approves new applications, the market could record a surge in demand and in the number of buyers,” said Peleshok. “Due to the SEC’s legal stance over cryptocurrencies, the market could further concentrate on Bitcoin and Ethereum, the two largest assets in the market.”\n\nSince BlackRock filed for its Bitcoin ETF on June 15, Bitcoin is up by more than 22%, peaking at US$31,389 on June 23, the highest since June 2022. Bitcoin traded at US$30,433, at press time, according to data from CoinMarketCap.\n\nForkast.Insights | What does it mean? The potential foray of Fidelity, globally recognized as the third largest asset manager, into the ETF domain hardly raises eyebrows among those tuned in to the vibrant buzz of Twitter’s rumor universe. In the wake of the ETF application of the world’s largest asset manager, BlackRock, industry watchers projected that Fidelity, the Bostonian investment giant with US$4.2 trillion in assets under management, would be the subsequent contender to lodge and apply for a spot Bitcoin ETF. This topic also fuelled speculation that Fidelity might put in a bid for Grayscale, the digital asset manager responsible for the US$13.5 billion Grayscale Bitcoin Trust, the world’s biggest Bitcoin fund. So far, there has been no substantial evidence for the buyout. Fidelity has taken a proactive stance in embracing Bitcoin and other digital assets, eclipsing many of its traditional finance contemporaries. The firm claims that its research on the asset class dates back to 2014. In 2018, the firm launched an institutional trading platform for Bitcoin and Ethereum. A year later, in 2019, it expanded its venture into the Bitcoin mining business through Bitcoin technology firm Blockstream’s institutional mining service. Last year, it even joined the lengthy list of firms whose Bitcoin ETF applications got rejected by the SEC. And last week, EDX Markets, a non-custodial crypto exchange backed by Fidelity and other Wall Street titans, went live. In addition, Fidelity has shown an assertive drive in obtaining indirect exposure to Bitcoin via Microstrategy, the preeminent corporate Bitcoin holder globally. Fidelity has secured its position as Microstrategy’s third largest shareholder, possessing 6.7% of the stock, valued at over US$225 million. BlackRock follows as the fourth largest owner with 5.58%, approximating around US$185 million. Despite the entrance of these behemoth asset managers into the U.S. ETF race, the waiting list is long. ARK Invest Chief Executive Officer Cathy Wood claims that her firm is in position to launch the first spot-Bitcoin ETF in the world’s largest economy.\n\n2. Liquid dreams\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe NFT markets saw another week of decline, and again, Ethereum’s NFT ecosystem is dragging the broader market down. The Forkast 500 NFT Index is down 1.32%, as Ethereum’s decline of 1.51% stands in stark contrast to Solana, Polygon, and Cardano’s gains in value of 1.7%, 1.23% and 5.75%, respectively.\n\nEthereum sales volume rose 318% on Thursday following Azuki’s Elementals mint, which brought in US$38 million to the Azuki team in just 15 minutes.\n\nAzuki’s floor price decreased 45% to 9 Ether following the Elementals mint, and the average sales price declined to US$23,000, down from US$39,000 the previous seven days.\n\nBored Ape Yacht Club’s average sales price is up in the past seven days to US$79,214. However large BAYC holders like Machi Big Brother and Franklin have combined to sell over 60 Bored Apes, applying downward pressure on the collection.\n\nSolana’s 98,917 transactions on June 25 were its single highest daily total of NFT transactions in over eight months. September 2022 was the last time the blockchain had this level of activity, when the Y00ts were still surging on Solana.\n\nSeven-day sales volume was up across several blockchains with Ethereum up 105%, Bitcoin 22%, Solana 24%, and Polygon 10%. Mythos Chain, BNB, and Flow were down 18%, 20% and 23%, respectively.\n\nDeGods is now the third most expensive PFP based on floor price following Azuki’s falling prices. Azuki’s cheapest NFTs are selling for as low as 8.5 ETH, while DeGods is nearly 1 ETH higher at 9.5 ETH.\n\nForkast.Insights | What does it mean? This year’s biggest new NFT mint took place on Tuesday, as one of the top NFT projects, Azuki, delivered a new collection called Elementals. While some were hopeful the new collection would breathe life into the NFT markets, it instead drained liquidity from traders who sold assets across projects to afford the hefty 2 ETH mint price. The impact was visible on the Forkast 500 NFT Index even in the midst of Ethereum NFTs having its single highest day of sales volume this year with US$58 million. Azuki’s Elementals did provide some lucky traders with rare Elementals NFTs that were flipped for over 30 ETH, but most secondary sales are taking place well below the collection’s 2 ETH mint price. Instead of Azuki’s Elementals helping the broader NFT ecosystem, it instead sucked liquidity from holders, and almost across the board, brought other collections’ sales prices down with it. What went wrong with Azuki’s mint is a familiar story, and shows that the NFT space may not be as mature as some would like to believe. Starting from the initial sale that left many Azuki and Beanz holders stuck on a loading page, and ultimately unable to mint, to the massively underwhelming art reveal that almost looks like duplicates of the main Azuki collection, NFT projects talk about innovation, yet time after time, fail to deliver it. For all the talk of innovation, we have witnessed few examples of it, and other than functioning as ‘meme coins’, traders shouldn’t expect another NFT boom until we see actual innovation. If the Azuki team can turn around the current negative sentiment in their project and help foster the higher floor prices that their holders have come to expect, we may then see sales with profits that roll into existing collections floors. We’ll be watching.\n\n3. Singapore calling\n\nMAS’ move comes as Singapore seeks to utilize the power of blockchains in its financial system, while minimizing risks of crypto assets. Image: Fidelity Investments/Canva\n\nThe Monetary Authority of Singapore (MAS), the city state’s central bank, has proposed a framework to design open and interoperable networks for digital assets, as the country seeks to harness the power of asset tokenization to improve its traditional financial services.\n\n“The real value in the digital asset ecosystem” lies in the tokenization of real-world and financial assets through distributed ledger technologies and smart contracts, which could “enhance the efficiency, accessibility, and affordability of financial services,” MAS wrote in its report.\n\n“Unless digital asset networks are interoperable, both with each other and with traditional financial market infrastructures, fragmentation would reduce the network benefits and can create frictions such as inaccessibility, increased liquidity requirements due to separation of liquidity pools, and pricing arbitrage,” noted MAS.\n\nMAS’ proposal – jointly developed with the Bank for International Settlements and other financial institutions – is part of Singapore’s Project Guardian initiatives announced in May 2022 to explore the adoption of asset tokenization and decentralized finance in the city state’s financial industry.\n\nMAS also announced an expansion of Project Guardian to test the potential of asset tokenization across more financial asset classes, enlisting 11 financial institutions — including banking giants Citi, HSBC, DBS and Standard Chartered — to form the Project Guardian Industry Group to lead industry pilots in asset and wealth management, foreign exchange and fixed income.\n\nJapan Financial Services Agency, the first overseas financial regulator to join Project Guardian, will work with MAS on digital asset innovation while safeguarding against risks to financial stability and integrity.\n\nMAS’ move comes as Singapore seeks to utilize the power of blockchains in its financial system, while minimizing risks of crypto assets. Last Thursday, The Asia-Pacific branch of technology firm Ripple Labs said it would start offering crypto-enabled digital payment services in Singapore after receiving in-principle approval from the MAS.\n\nAlso on Thursday, MAS released a whitepaper – jointly developed by the International Monetary Fund, Amazon, DBS Bank, and multiple other industry players.– for “purpose-bound” money, detailing a technical overview of digital currencies designed for specific purposes."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzMwL3VwLW1vcmUtdGhhbi0yNDAtaW4tMjAyMy10aGlzLWJpdGNvaW4tbWluaW5nLXN0b2NrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Up More Than 240% in 2023, This Bitcoin Mining Stock Is Still a Screaming Buy - The Motley Fool",
        "content": "As the competition in the Bitcoin (BTC 0.60%) mining industry intensifies, one company stands out in a crowded field. Already recognized as one of the premier Bitcoin mining companies, Riot Platforms (RIOT 0.95%) is on the verge of extending its lead and solidifying its position as the industry leader.\n\nThanks to a groundbreaking agreement and ambitious expansion plans, Riot is positioned for long-term success and poised to capitalize on the growing profitability of Bitcoin mining.\n\nThe game-changing announcement\n\nOn June 26, Riot made headlines when the company announced its agreement to purchase 33,280 mining rigs from MicroBT, an up-and-coming manufacturer of Bitcoin mining equipment. With a total cost of $162.9 million, the state-of-the-art miners will be manufactured in the U.S. and are expected to nearly double Riot's mining capacity of 10.5 exahashes per second (EH/s), reaching an impressive 20.1 EH/s. These cutting-edge machines will be deployed at Riot's new facility in Corsicana, Texas, with delivery scheduled by the end of the year and operation commencing in the first quarter of 2024.\n\nFurthermore, Riot has secured an option to purchase an additional 66,560 miners, which, if exercised, would elevate its hash rate capacity to a staggering 35.4 EH/s, positioning it to become the leading Bitcoin miner by hash rate.\n\nHash rate refers to the computational power a Bitcoin mining company contributes to the network and represents its effective mining capacity. Simply put, the greater the hash rate, the greater the ability to mine Bitcoin.\n\nStrengthening its leadership position\n\nThe added benefits of a more streamlined domestic supply chain and additional miners coming online will likely only add to Riot's dominance of Bitcoin mining production. Year to date in 2023 the company ranks third in total bitcoins mined and finished 2022 as second overall.\n\nThe company has also demonstrated remarkable efficiency by keeping mining expenses minimized. Riot ranks as the second most cost-effective miner in terms of cost per bitcoin mined and also boasts a near unheard-of financial position with virtually no debt.\n\nHowever, one of Riot's most advantageous factors is its ability to offset electricity costs. This is made possible by its strategic location in Texas, where it takes advantage of the unique flexibility offered by the Texas power grid. Unlike other regions, the Lone Star State has an independent power grid infrastructure that grants Riot the opportunity to sell excess electricity back to the grid during periods of high demand, further contributing to its profitability.\n\nEmbracing the future\n\nWhile the announcement of additional miners is advantageous in itself, when considering the current landscape of the crypto economy, Riot's upside looks even more compelling.\n\nDespite a challenging second half of 2022, when Bitcoin's price plummeted by 70%, Riot demonstrated its resilience by weathering the worst of the bear market and strategically managing its reserves. Now, as Bitcoin regains momentum, Riot is poised to capitalize on revived profitability and potentially surpass the cryptocurrency's performance itself if a bull market returns. This year alone serves as evidence, with Riot's stock surging over 245% year to date, outpacing Bitcoin's more modest 75% gain.\n\nAchieving success as a Bitcoin miner lies in its ability to maximize machine power and efficiently manage costs. This rare combination is precisely what sets Riot apart from its competitors. Based on its track record and plans to increase mining production, Riot is in a position to cement itself as the leader of Bitcoin mining for years to come."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW92ZXJyZWFjdGluZy1zZWMtZXRmLWZpbGluZ3MtYnRjLXByaWNlLWRpdmVzLTbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin 'overreacting' as SEC returns ETF filings, BTC price dives 6% - Cointelegraph",
        "content": "Bitcoin (BTC) fell below $30,000 after the June 30 Wall Street open as markets panicked over the fate of its first spot exchange-traded funds (ETFs).\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBureaucratic error may explain Bitcoin ETF filing hiccup\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action hurtling downward, briefly reaching $29,500.\n\nThe volatility accompanied a report that United States regulator the Securities and Exchange Commission had refused applications for the first Bitcoin spot-price ETF.\n\nThose applications had kickstarted the latest BTC price rebound, one which had taken the largest cryptocurrency to new yearly highs.\n\nRelated: Why approving a Bitcoin ETF might unleash $18B in sell-pressure\n\nClaims by The Wall Street Journal, which cited an unidentified source, that they had now been returned, saw BTC/USD hit nine-day lows before rebounding to circle $30,000.\n\nThe original report outlined the specific circumstances of the applications’ rejection, and reacting, market observers suggested that this amounted to little more than a technicality.\n\nThe WSJ stated that “the SEC told the exchanges that it returned the filings because they didn’t name the spot bitcoin exchange with which they are expected to have a ‘surveillance-sharing agreement’ or provide enough information about the details of those surveillance arrangements.”\n\n“Asset managers can update the language and refile,” it added.\n\nThink the market is overreacting here, seems like the \"denial\" is just a technicality and Blackrock/Fidelity just have to refile naming Coinbase as the exchange that they have a \"surveillance-sharing agreement\" with — Will Clemente (@WClementeIII) June 30, 2023\n\n“This could even be interpreted that the SEC are indicating to BlackRock, what they need to do, to get this across the line and approved... which is also positive,” financial commentator Tedtalksmacro argued in a more optimistic take.\n\nRate hike bets surge despite PCE data beating expectations\n\nBitcoin nonetheless traded down over $1,000 versus the day's highs at the time of writing.\n\nRelated: Bitcoin speculators send 35K BTC to exchanges in new ‘elation inflow’\n\nIts losses come at a prescient time, with the monthly and quarterly candle close due in a matter of hours.\n\nSeparately, U.S. macroeconomic data provided further confusion for risk asset markets more broadly.\n\nThe Personal Consumption Expenditures (PCE) Index print came in lower than expected and even managed its biggest drop in a year.\n\nBREAKING: PCE inflation, the Fed’s preferred inflation metric, FALLS to 3.8%, below expectations of 4.6%.\n\n\n\nCore PCE inflation is now at 4.6%, also below expectations of 4.7%.\n\n\n\nThis is the largest monthly drop this year.\n\n\n\nThe Fed may finally be winning the fight against inflation. — The Kobeissi Letter (@KobeissiLetter) June 30, 2023\n\nDespite signals that inflation is slowing, however, markets began to price in a bigger chance of interest rate hikes returning in July.\n\nThe latest data from CME Group’s FedWatch Tool put the odds of a 25-basis-point hike next at nearly 90%.\n\nResponding, financial commentary resource The Kobeissi Letter argued that inflation was simply too high despite the result.\n\n“Interest rate expectations are RISING after the release of PCE inflation data this morning. But why?” it queried.\n\n“Core PCE inflation, the Fed’s preferred inflation metric, is now UNCHANGED since December 2022. Core PCE inflation is now at 4.6% and still a major problem for the Fed.”\n\nFed target rate probabilities chart. Source: CME Group\n\nMagazine: How smart people invest in dumb memecoins: 3-point plan for success\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xNDY5MjkvcmVtZW1iZXItbGl0ZWNvaW4tc2lsdmVyLWJpdGNvaW4tZGlnaXRhbC1nb2xkLXNvYXJpbmfSAVVodHRwczovL2RlY3J5cHQuY28vMTQ2OTI5L3JlbWVtYmVyLWxpdGVjb2luLXNpbHZlci1iaXRjb2luLWRpZ2l0YWwtZ29sZC1zb2FyaW5nP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Remember Litecoin? The Silver to Bitcoin's 'Digital Gold' Is Soaring - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEarlier today, it was Bitcoin Cash—now, it's Litecoin.\n\nThe two cryptocurrencies have received renewed interest from investors since Wall Street-backed EDX Markets listed them last week.\n\nBoth were arguably fading into obscurity but are now soaring—especially Litecoin, which just reentered the top 10 biggest digital assets by market cap.\n\nAD\n\nAD\n\nThe Bitcoin fork is up 23.6% in the past 24 hours, according to CoinGecko, trading hands for $104.63. That makes it one of the best-performing digital assets right now.\n\nAnd in the past seven days, it has shot up by 15% in value, meaning that it has regained its spot in the top 10 digital assets, with a market cap of $7.7 billion.\n\nOne likely reason for the renewed interest in Litecoin is that it's one of just four cryptocurrencies chosen by the Citadel Securities and Fidelity-backed EDX Markets to trade on its exchange. This is because—along with Bitcoin, Bitcoin Cash, and Ethereum—regulators are unlikely to target it for being an unregistered security, experts told Decrypt.\n\nThe U.S. Securities and Exchange Commission this year has launched a tough crackdown on the crypto industry—particularly coins and tokens it considers unregistered securities.\n\nEDX CEO Jamil Nazarali said that he felt \"very comfortable\" the four assets listed on EDX weren't securities.\n\nAD\n\nAD\n\nEDX is a new exchange backed by \"TradFi\" heavyweights Charles Schwab, Citadel Securities, and Fidelity Digital Assets.\n\nThe launch of the exchange has led investors to plug cash into crypto, leading to a bit of a bull run. But it's not just Wall Street that's likely responsible for this sudden jump.\n\nLitecoin is also due for its \"halving\" later next month, when the supply of coins for mining rewards will be cut in half, meaning fewer of the digital coins will be created. Such events have previously given rise to bullish price action for coins, such as during the run-up to recent Bitcoin halvings.\n\nANDDD THERE'S LITECOIN WAKING UP pic.twitter.com/DXa2LEvvBk — K A L E O (@CryptoKaleo) June 30, 2023\n\nLitecoin was launched in 2011 by ex-Google employee Charlie Lee. He wanted to create a faster, cheaper version of Bitcoin and so forked the Bitcoin blockchain.\n\nThe objective was to make a peer-to-peer cash system cheaper than the oldest and most well-known digital currency: a \"silver\" to Bitcoin's \"digital gold.\" But the asset hasn't been successful at beating Bitcoin in terms of adoption and has fallen out of favor among investors in recent years. Until now, it seems.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMjkvYml0Y29pbi1yZWdhaW5zLTMwMDAwLW1hcmstYWZ0ZXItYmlkZW4tdGF4LWxvb3Bob2xlLWNvbW1lbnRzL9IBZ2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMjkvYml0Y29pbi1yZWdhaW5zLTMwMDAwLW1hcmstYWZ0ZXItYmlkZW4tdGF4LWxvb3Bob2xlLWNvbW1lbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin regains $30,000 mark after Biden tax ‘loophole’ comments - Fortune",
        "content": "The price of Bitcoin is back on the upswing despite President Biden reiterating his unfriendly stance toward crypto traders.\n\nDuring a speech in Chicago where he laid out his economic plan, Biden took aim at crypto traders along with other financial figures, saying he wanted to make the economy and tax system fairer by eliminating opportunities for crypto traders to evade taxes.\n\n“We’re going to make it fair by eliminating loopholes for crypto traders, hedge fund managers,” Biden said, according to a transcript released by the White House.\n\nBiden just said:\n\n\n\nWe’re going to make the economy fairer by getting rid of tax loopholes for crypto traders and hedge fund managers. pic.twitter.com/vWRlVDPDSE — Quiver Quantitative (@QuiverQuant) June 28, 2023\n\nFollowing Biden’s comments on Wednesday, Bitcoin, which makes up more than half of the crypto market, fell 1.3% to just under $30,000. But on Thursday morning, investors shook off any skittishness, pushing Bitcoin up as high as $30,772 before it retreated to about $30,500, according to CoinMarketCap.\n\nBiden previously mentioned wanting to close crypto loopholes in May when his official Twitter account tweeted that Congress should close “tax loopholes that help wealthy crypto investors,” which the tweet estimated at about $18 billion in lost tax revenue.\n\nThe crypto “loophole” in question likely refers to the fact that, unlike with traditional equities, traders can sell and repurchase cryptocurrency within short windows without incurring a higher tax rate.\n\nThe increasing scrutiny from regulators did not stop Bitcoin from hitting a 52-week high above $31,000 last week on the back of BlackRock’s application for a spot Bitcoin ETF. Several other firms like WisdomTree and Invesco followed BlackRock in applying for a spot Bitcoin ETF, and on Tuesday, the Block reported that Fidelity would soon file for its own.\n\nLast week also saw nearly $200 million worth of inflows pour into digital asset investment products—the highest weekly inflows in nearly a year, according to a report by CoinShares."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWxsLXRvcC0xMC1jcnlwdG9zLWxvc2UtZ3JvdW5kLWF6dWtpLWRpc2FwcG9pbnRzL9IBUmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWxsLXRvcC0xMC1jcnlwdG9zLWxvc2UtZ3JvdW5kLWF6dWtpLWRpc2FwcG9pbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, all top 10 cryptos lose ground; Azuki Elementals NFT disappoints investors - Forkast News",
        "content": "Bitcoin fell but stayed above the US$30,000 threshold on Thursday morning in Asia. All top 10 non-stablecoin cryptocurrencies traded lower after MicroStrategy, the world’s largest corporate Bitcoin holder, said Wednesday it has acquired 12,333 Bitcoin for $347 million over the past two months. Additionally, traditional financial institutions continue to show interest in venturing into the U.S. digital asset industry, with ARK Invest amending its spot Bitcoin exchange-traded fund (ETF) application to enhance the chance for regulatory approval.\n\nBitcoin, altcoins lose ground\n\nBitcoin dropped 1.57% to US$30,103 over the last 24 hours to 7:00 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization is down 0.12% over the past seven days.\n\nEther fell 3.12% to US$1,827 for a loss of 3.51% for the week.\n\nAll other top 10 non-stablecoin cryptocurrencies traded lower. Cardano was the biggest loser among the top 10, logging a 6.49% 24-hour fall and a 6.65% weekly loss.\n\nOn Wednesday, business analytics firm MicroStrategy said in an exchange filing that between April 29 and June 27, the company and its subsidiaries together acquired roughly 12,333 Bitcoin for US$347 million in cash at an average price of US$28,136 per Bitcoin.\n\nThat purchase took its total Bitcoin holdings to 152,333 Bitcoin as of Tuesday, the company said.\n\nMeanwhile, on Wednesday, investment management fund ARK Invest filed an amendment to its April application for a spot Bitcoin ETF. The application — which would see the firm partner with crypto exchange-traded product provider 21Shares — now includes a proposed surveillance-sharing agreement.\n\nAs seen in the ETF application made by investment firm BlackRock earlier this month, an agreement of that kind is seen as a way to prevent market manipulation, increasing the application’s chances of success. If approved, it would become the first such ETF in the U.S. market.\n\n21Shares said Wednesday that the recent wave of spot Bitcoin ETF applications is “validating” for investors in the asset class.\n\n“Bitcoin has proven its value as an investable asset and disruptive technology, amidst the current markets and regulatory headwinds,” Hany Rashwan, co-founder and chief executive officer of 21Shares, said in the statement.\n\nThe total cryptocurrency market cap dropped 2.26% to US$1.16 trillion, with trading volume dropping 3.77% to US$34.12 billion, according to CoinMarketCap data.\n\nAzuki floor price plummets\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.79% to 2,852.82 in the 24 hours to 9:20 a.m. in Hong Kong. The index is down 1.79% for the week.\n\nNFT trading volume on Ethereum dropped 56.24% to US$27.39 million over the past 24 hours, while volume on the Bitcoin network rose 105.26% to US$2.83 million, according to CryptoSlam data.\n\nAzuki-related NFT collections topped the chart in CryptoSlam’s sales volume ranking. The new Azuki Elementals collection logged a 34.02% increase in the past 24 hours to US$6.04 million in sales volume.\n\nSales of the original Azuki dropped 24.16% to US$4.59 million, and the Azuki Elemental Beans sales dropped 91.21% to US$2.96 million.\n\nWhile the new Azuki Elementals sold out its 20,000 NFTs within 15 minutes when it began minting on Tuesday, collectors were “angry” as the new NFTs looked almost identical to the original Azuki collection. According to Yehudah Petscher, NFT strategist at Forkast Labs, the parent company of Forkast.News, that could potentially devalue the NFT industry as a whole.\n\n“Lenders are taking a hit on Azuki NFTs as the prices have fallen, borrowers default on loan, and then new owner immediately sells to recover what they can before the price falls even further,” Petscher said. “It’s a vicious cycle that has yet to find the bottom.”\n\nThe floor price of Azuki Elementals dropped to 1.38 Ether (US$2,530) on Thursday morning in Asia from its mint price of 2 Ether, according to data from NFT tracker NFTpricefloor.com. The original Azuki NFT’s floor price fell to 8.85 Ether from over 17 Ether a week ago.\n\nCriticism from the Azuki community led its development team to admit mistakes had been made in the design of the Elementals collection.\n\nAzuki,\n\n\n\nIt's always both challenging & exciting opening up the gate to the Garden.\n\n\n\nThis time, we missed the mark.\n\n\n\nWe hear you – the mint process was hectic, the PFPs feel similar and, even worse, dilutive to Azuki. — Azuki (@Azuki) June 28, 2023\n\nThe Azuki project then teased what appears to be a “green beans” new collection, which NFT enthusiasts “speculate may evolve the initial Azuki 10,000 collection into a different looking new collection,” Petscher added.\n\nPowell signals more restrictions coming\n\nU.S. Fed Chair Jerome Powell spoke Wednesday at a European Central Bank forum in Portugal.\n\nImage: ECB\n\nAsia equity markets mostly edged higher on Thursday morning as investors weighed the risk outlook for potential interest rate hikes in the U.S. this year.\n\nU.S. stock futures rose as of 10:30 a.m. in Hong Kong. Dow Jones Industrial Average futures edged up 0.13%, S&P 500 futures climbed 0.13%, and Nasdaq Futures added 0.19%.\n\nU.S. Federal Reserve Chairman Jerome Powell said Wednesday at a European Central Bank forum in Portugal that there will be “more restriction coming,” signaling that the Fed may raise rates at the next two meetings if necessary.\n\n“I wouldn’t take…moving at consecutive meetings off the table,” Powell said.\n\nPowell is expected to speak again on Thursday at the Banco de España Fourth Conference on Financial Stability in Madrid, Spain.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006. The CME FedWatch Tool predicts an 81.8% chance for another 25-basis-point rate hike, and an 18.2% chance the Fed will leave rates unchanged at the next meeting on July 26.\n\nMarkets in Singapore, Malaysia and Indonesia are closed for the Eid al-Adha holidays.\n\n(Updates to add equities section)"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0zMDcwMC1zb2xhbmEtbGl0ZWNvaW4tanVtcC1vdmVyLTE0L2FydGljbGVzaG93LzEwMTM4ODUxNy5jbXPSAZoBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tcmlzZXMtYWJvdmUtMzA3MDAtc29sYW5hLWxpdGVjb2luLWp1bXAtb3Zlci0xNC9hbXBfYXJ0aWNsZXNob3cvMTAxMzg4NTE3LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $30,700; Solana, Litecoin jump over 14% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading higher in Friday's trade amid robust economic data from the US, which eased fears of a slowdown, and amid news that Fidelity Investments has refiled for spot Bitcoin ETF.Bitcoin (BTC) surged 1% to $30,657, whereas Ethereum (ETH) was above the $1,850 level. BTC volume stood at approximately $17.3 billion, rising 28.5% in the last 24 hours.\"Bitcoin traded over the US$30,600 level gaining nearly 2% in the past 24 hours as the market reacted to Fidelity Investments refiles for spot Bitcoin ETF. Market sentiment was also influenced by the news of Microstrategy buying an additional $374 million worth of Bitcoin,\" Edul Patel, Co-founder and CEO at Mudrex, said.BTC's immediate resistance is at the US$30,750 level, and support is at the US$30,420 level, Edul added.Other top crypto tokens were also trading higher on Friday. Solana and Litecoin rose over 14%. Meanwhile, BNB XRP , and Polygon also traded with gains. The global cryptocurrency market cap was trading higher, around $1.19 trillion, rising 1.82% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $595 billion. Bitcoin's dominance is currently 50.15%, a decrease of 0.25% over the day, according to CoinMarketCap.\"Crypto markets have traded sideways in the last 24 hours, even amidst rekindled inflationary concerns and proposed Fed rate hikes. The crypto fear and greed index has jumped 2 points to re-enter the greed zone with a score of 56/100,\" Parth Chaturvedi, Investments Lead, CoinSwitch Ventures, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 67, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 83 and 36, respectively, further indicating a Neutral market.\"\"The MACD Level (12, 26) at 1039 indicates a Buy. The Stochastic RSI Fast (3, 3, 14, 14) is at 74 with a Neutral indicator, while the Williams Percent Range (14) at −14 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.40 hours, IST on June 30, 2023)Bitcoin $30,657 1.42%Ethereum $1,881 2.13%Tether $1.00 -0.02%BNB $237 1.81%XRP $0.4756 2.22%Cardano $0.2826 3.57% Dogecoin $0.06511 3.71%Polygon $0.6442 1.79%Solana $18.64 14.49%Litecoin $95.78 14.4Polkadot $5.06 2.62%Tron $0.07581 2.27%Shiba Inu $0.000007516 3.31%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS1zdXJ2ZWlsbGFuY2UtcGFydG5lci1maWRlbGl0eS1vdGhlci0yMDM5NTgyMDUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Coinbase Will Be Surveillance Partner for Fidelity, Other Bitcoin ETFs, Refiled Applications Say - Yahoo Finance",
        "content": "Cboe's BZX Exchange named crypto exchange Coinbase as the market for its surveillance-sharing agreement when it refiled its spot bitcoin exchange-traded (ETF) fund applications for several would-be bitcoin ETF issuers on Friday.\n\nFidelity, WisdomTree, VanEck, ARK Invest, Galaxy/Invesco and BlackRock all filed for spot bitcoin ETFs over the past few weeks, hoping to succeed at launching a product the U.S. Securities and Exchange Commission (SEC) has rejected for years. While BlackRock filed with Nasdaq, the other companies are working with Cboe.\n\nOn Friday, the SEC told some both Nasdaq and Cboe that their applications were \"inadequate\" because they didn't name the market that the fund sponsors are working with on their surveillance-sharing agreements, according to the Wall Street Journal.\n\nIn its refiled applications, Cboe said Coinbase's platform \"represents a substantial portion of U.S.-based and USD denominated Bitcoin trading\" as it named the U.S. crypto exchange as its partner for these surveillance-sharing agreements.\n\n\"The Spot BTC SSA [surveillance-sharing agreement] is expected to have the hallmarks of a surveillance-sharing agreement between two members of the ISG, which would give the Exchange supplemental access to data regarding spot Bitcoin trades occurring on Coinbase if the Exchange determines it is necessary as part of its surveillance program for the Commodity-Based Trust Shares in a manner similar to the way that exchanges share information as part of ISG,\" the filing said.\n\nRead more: Bitcoin Tumbles on Report of SEC Saying Spot BTC ETF Filings Inadequate\n\nThe SEC has called for surveillance-sharing agreements with markets of \"significant size\" in the past, arguing that this is necessary to prevent market manipulation or other unwanted behaviors and protect consumers. The lack of these agreements figured heavily into many of the SEC's prior rejections of bitcoin ETF applications.\n\nStory continues\n\nThe regulator still has to formally acknowledge it is reviewing the applications. The SEC will kick off an initial 45-day review period when it publishes the filings in the Federal Register – the national logbook – but can extend this to a total of 240 days.\n\nComplicating the SEC's calculus may be the fact that it sued Coinbase earlier this month on allegations of operating an unregistered securities exchange, broker and clearinghouse – though the SEC is not alleging that Bitcoin itself is a security, and SEC Chair Gary Gensler has often referred to it as an example of a digital asset that is not a security.\n\nIt also remains to be seen whether the SEC will agree that Coinbase is a significant, regulated market for bitcoin.\n\nRead more: A Straightforward Explanation for Why Financial Giants Want to Issue a Spot Bitcoin ETF\n\nUPDATE (June 30, 2023, 20:55 UTC): Adds additional detail.\n\nUPDATE (June 30, 2023, 21:22 UTC): Updates to say Coinbase will be surveillance-sharing partner for all the spot bitcoin ETF applications.\n\nUPDATE (June 30, 2023, 21:50 UTC): Clarifies details."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmV0ZnN0cmF0ZWd5LmNvbS92b2xhdGlsaXR5LXNoYXJlcy11bnZlaWxzLWZpcnN0LXVzLWxpc3RlZC1sZXZlcmFnZWQtYml0Y29pbi1ldGYtMTAzMzkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Volatility Shares unveils first US-listed leveraged bitcoin ETF - ETF Strategy",
        "content": "Volatility Shares has introduced the first ETF in the US providing leveraged exposure to bitcoin.\n\nThe 2x Bitcoin Strategy ETF (BITX US) has been listed on Cboe BZX Exchange with an expense ratio of 1.85%.\n\nThe fund provides twice the daily performance of the S&P CME Bitcoin Futures Daily Roll Index which tracks the value of cash-settled, front-month bitcoin futures linked to the CME CF Bitcoin Reference Rate, an aggregate of bitcoin prices across multiple eligible cryptocurrency exchanges.\n\nThe bitcoin futures contracts underlying the index are partially rolled into the following month on a daily basis.\n\nThe price of bitcoin has increased by roughly 85% year-to-date, from circa $16,500 at the end of 2022 to $30,600 on 29 June. This marks a notable turnaround for the world’s largest cryptocurrency which lost nearly 65% of its market value last year amid gloomy macroeconomic conditions, rapidly rising interest rates, and a host of negative crypto industry-related events such as the Terra Luna crash and the implosion of FTX, the world’s largest crypto exchange.\n\nAnalysts have attributed the current rally to a general weakening of the US dollar, a cooling of inflation, and the Federal Reserve slowing and most recently halting their interest rate hikes. A banking crisis that saw three small- to mid-size US banks fail over a week in March also helped to shine a light on the crypto industry’s potential advantages over the traditional financial sector.\n\nVolatility Shares’ introduction of a leveraged bitcoin ETF in the US enables sophisticated investors to amplify returns from further increases in the price of bitcoin. Leveraged ETFs do come with significant risks, however, which is why they are generally not suitable for a retail audience. Specifically, these funds are not appropriate as buy-and-hold investments as they tend to decay in value if held for an extended period of time, potentially leading to large losses, especially in volatile but range-bound markets.\n\nThe launch of BITX marks another milestone in the crypto industry’s march into the mainstream. The US market is already home to inverse bitcoin ETFs as well as several ETFs providing traditional, unleveraged exposure to bitcoin.\n\nAll of the above funds deliver their exposure to bitcoin by way of futures contracts. While many issuers have sought to launch directly replicating bitcoin ETFs, the SEC has consistently refused to greenlight these applications, citing concerns regarding validating the ownership of these funds’ underlying tokens.\n\nMany analysts have noted, however, that the SEC’s stance may be softening, leading many big-name institutions including BlackRock and Fidelity to suddenly throw their hat into the ring and file for their own spot bitcoin ETFs."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvc2VjLWRpc21pc3Nlcy1sYXRlc3Qtc3BvdC1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbnMtYXMtaW5hZGVxdWF0ZS_SAXRodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L3NlYy1kaXNtaXNzZXMtbGF0ZXN0LXNwb3QtYml0Y29pbi1ldGYtYXBwbGljYXRpb25zLWFzLWluYWRlcXVhdGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "SEC Dismisses Latest Spot Bitcoin ETF Applications as Inadequate - Finance Magnates",
        "content": "The Securities and Exchange Commission (SEC) has reportedly dismissed recent applications by various asset managers to launch spot Bitcoin (BTC) exchange-traded funds (ETFs). According to sources who shared information with The Wall Street Journal on Friday, the agency termed the applications as neither sufficiently clear nor comprehensive.\n\nSpecifically, the SEC commented about the applications filed by Nasdaq and Cboe Global Markets on behalf of the asset managers BlackRock and Fidelity, the sources familiar with the matter told the publication.\n\nSEC Is Under Pressure\n\nThe number of asset managers seeking approval to list spot Bitcoin ETFs has increased recently despite the fact that the regulator declined similar applications in the past. According to the SEC, such funds are vulnerable to fraud and market manipulation.\n\nThe recent filings, especially by the Wall Street giants, renewed hopes among investors that the SEC might soften its stance and approve the first spot Bitcoin ETF in the US. Nonetheless, there has been a record amount of funds channelled to existing ETFs, including the ProShares Bitcoin Bitcoin While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that Read this Term Strategy ETF (BITO).\n\nKeep Reading South Africa Navigates Crypto Regulations: To License 60 Firms This Month\n\nFinance Magnates reported that for the week that ended on June 25, BITO recorded the largest amount of investments worth $65.3 million. Additionally, on Friday of the same week, the fund traded 500 million shares, something that has only happened five times since it was launched. The data also showed a shift in investors’ behaviour where investments flowed from the Bitcoin cash market to the ETF market.\n\nBlackRock Leads the Pack\n\nThe situation was triggered when BlackRock submitted an application for a spot Bitcoin ETF on June 16. In the application, the leading global asset manager noted that it will use the CME CF Bitcoin Reference Rate to track the prices of Bitcoin. Several other asset managers followed, submitting similar applications to the regulator.\n\nIn a separate report, Finance Magnates reported that Invesco and WisdomTree sought similar regulatory approval to launch their spot Bitcoin ETFs. Based in Atlanta, Georgia, Invesco is an asset management company with Assets Under Management (AUM) worth $1.4 trillion. Initially, the company attempted to launch a spot bitcoin ETF in 2021 in partnership with Galaxy Digital but was unsuccessful.\n\nIn contrast, WisdomTree, one of the major ETF providers in the US with an AUM of $83 billion, plans to list an ETF dubbed WisdomTree Bitcoin Trust. Given the regulator's approval, the fund will list on Cboe BZX Exchange Exchange An exchange is known as a marketplace that supports the trading of derivatives, commodities, securities, and other financial instruments.Generally, an exchange is accessible through a digital platform or sometimes at a tangible address where investors organize to perform trading. Among the chief responsibilities of an exchange would be to uphold honest and fair-trading practices. These are instrumental in making sure that the distribution of supported security rates on that exchange are effectiv An exchange is known as a marketplace that supports the trading of derivatives, commodities, securities, and other financial instruments.Generally, an exchange is accessible through a digital platform or sometimes at a tangible address where investors organize to perform trading. Among the chief responsibilities of an exchange would be to uphold honest and fair-trading practices. These are instrumental in making sure that the distribution of supported security rates on that exchange are effectiv Read this Term under the symbol BTCW."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvZmlkZWxpdHktb2ZmaWNpYWxseS1zdWJtaXRzLWl0cy1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uL9IBcGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvZmlkZWxpdHktb2ZmaWNpYWxseS1zdWJtaXRzLWl0cy1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Officially Submits Its Spot Bitcoin ETF Application - Finance Magnates",
        "content": "Fidelity has joined other US companies to resubmit its application for a Bitcoin spot exchange-traded fund (ETF) called Wise Origin Bitcoin Trust. The asset management giant officially filed its paperwork for the spot Bitcoin ETF with the Securities and Exchange Commission (SEC) yesterday (Thursday).\n\nA US Spot Bitcoin ETF\n\nThe application of Boston-headquartered Fidelity came only two weeks after its rival Blackrock filed for the approval of a spot Bitcoin ETF. Blackrock’s application also encouraged other firms, including Invesco and WisdomTree, to seek the SEC’s approval for the much-anticipated crypto investment instrument. Unlike Blackrock, all these companies filed for permission for a spot Bitcoin ETF, but their application was rejected.\n\nFidelity, a company with $4.5 trillion in assets under management (AUM), originally applied for its spot Bitcoin ETF in 2021 when the retail sentiment in the crypto market was high. However, the SEC rejected Fidility’s application in 2022, which came a couple of months after Fidelity successfully launched a spot Bitcoin ETF in Canada.\n\nBringing Bitcoin to Mass Investors\n\nAn instrument like spot Bitcoin ETF will be listed on American stock exchanges, and retail investors can easily invest in the cryptocurrency from their brokerage accounts. It would eliminate the hassle of creating a separate crypto exchange account, setting up wallets, and other complex processes.\n\nKeep Reading South Africa Navigates Crypto Regulations: To License 60 Firms This Month\n\nIn the latest reapplication, Fidelity included a ‘surveillance sharing agreement’ with an unnamed US spot-based Bitcoin trading platform. This would eliminate the SEC’s concerns over market manipulation.\n\nThough the SEC was reluctant to approve spot Bitcoin ETFs, the interest of Blackrock in the segment this time has raised hope. With over $10 trillion in AUM, BlackRock is the largest asset manager in the US. It has a significant influence in the financial services industry and also political backing, many media reports highlighted. Further, the market is optimistic about BlackRock’s position, and speculations are mounting that its spot Bitcoin ETF will be approved. However, the SEC is yet to come up with anything official."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9maWRlbGl0eS1yZW5ld3MtcHVzaC1mb3Itc3BvdC13aXNlLW9yaWdpbi1idGMtdHJ1c3QtbWFraW5nLWl0LTd0aC1hcHBsaWNhbnQtdGhpcy15ZWFy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity renews push for spot Wise Origin BTC Trust, making it 7th applicant this year - Cointelegraph",
        "content": "Asset manager Fidelity Investments has filed an application for a spot Bitcoin exchange-traded fund (ETF), according to a filing by Cboe BZX Exchange with the United States Securities and Exchange Commission (SEC) dated June 19.\n\nFidelity’s application follows BlackRock’s spot Bitcoin ETF application on June 15 and those of WisdomTree, Invesco and Valkyrie in the following days. According to Bloomberg, seven applications for a spot Bitcoin (BTC) ETF have been filed this year. Like WisdomTree and Invesco, Fidelity was making a second try at a spot BTC ETF. Similar to other spot BTC ETF applications, this one stated that the CME Bitcoin Futures market “represents a regulated market of significant size as it relates […] to the spot bitcoin market.” It argued the point in detail and cited extensive research to support its view. The 193-page application said:\n\n“The lack of a Spot Bitcoin ETP [exchange-traded product] exposes U.S. investor assets to significant risk because investors that would otherwise seek crypto asset exposure through a Spot Bitcoin ETP are forced to find alternative exposure through generally riskier means.”\n\nIt went on to mention the bankrupt FTX, Celsius, BlockFi and Voyager Digital as riskier alternatives of the past. It also argued that investors may buy shares in companies such as Tesla and MicroStrategy — that is, unrelated businesses that have significant BTC investments — to gain BTC exposure themselves.\n\nRelated: MicroStrategy’s stock price more than doubles in 2023 in lockstep with Bitcoin\n\nFidelity Digital Assets Services, a regulated custodian licensed by the New York Department of Financial Services, would be responsible for custody of the trust’s BTC. Cboe BZX said it would enter into a surveillance-sharing agreement with a United States-based cryptocurrency exchange.\n\nMichael Saylor: BlackRock, Citadel, & Fidelity Will Send #Bitcoin to $1,000,000\n\n\n\n“It looks like a spot ETF will probably get approved. There’s massive political pressure to approve one. The circumstances have changed & now there’s a way for the SEC to approve it without… pic.twitter.com/NkEepPPbnF — Crypto News Alerts (@CryptoNewsYes) June 28, 2023\n\nThe SEC has yet to approve a single application for a spot BTC ETF. The Fidelity 19b-4 form indicated that the firm is reviving its Wise Origin Bitcoin Trust product, which it filed an application for in March 2021. That application was rejected after two extensions of deliberations.\n\nFidelity has about $11 trillion in assets under administration.\n\nMagazine: 6 Questions for Jennifer Wines of Fidelity Private Wealth Management"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZGVjcnlwdC5jby8xNDY4NjMvc2VjLWNhbGxzLWJsYWNrcm9jay1maWRlbGl0eS1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbnMtaW5hZGVxdWF0ZS13c2rSAWRodHRwczovL2RlY3J5cHQuY28vMTQ2ODYzL3NlYy1jYWxscy1ibGFja3JvY2stZmlkZWxpdHktYml0Y29pbi1ldGYtYXBwbGljYXRpb25zLWluYWRlcXVhdGUtd3NqP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "SEC Calls BlackRock, Fidelity Bitcoin ETF Applications Inadequate: WSJ - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission has said that the wave of spot Bitcoin exchange-traded funds (ETFs) applications filed this month are inadequate, according to a Wall Street Journal report.\n\nCiting people familiar with the matter, the Friday WSJ report claims that the top regulator has said the applications aren't clear enough. It's a striking revelation because have filed applications for a Bitcoin ETF this month, including the world's biggest asset manager BlackRock.\n\nThe unnamed source said the SEC doesn't think the Bitcoin ETF applicants have been specific enough about how they'll manage a \"surveillance-sharing agreement.\" The agreement is meant to deter fraud and manipulation by ensuring the fund issuer is monitoring market trading activity, clearing activity and customer identity. So far, the SEC has said that all Bitcoin ETF applications have fallen short in this regard.\n\nAD\n\nAD\n\nBlackRock entering the race caused Bitcoin's price to spike and a number of other major fund managers followed suit. Yesterday, major U.S. firm Fidelity submitted an application. Invesco, Wisdom Tree, Valkyrie, and Bitwise have also sent similar applications.\n\nA spot Bitcoin ETF does not yet exist in the U.S. because the SEC has been reluctant to approve one. The regulator claims that the price of Bitcoin being open to manipulation is one of the main reasons.\n\nBut investors want access to such a product because it would allow them to get involved with Bitcoin without having to deal with the custody of the asset, according to experts.\n\nAnd Fidelity claimed in their application yesterday that the product would help investors wanting in on the crypto world avoid risk.\n\nAn ETF is an investment vehicle that tracks the value of an underlying asset, like gold, foreign currencies, or Bitcoin.\n\nAD\n\nAD\n\nBut the SEC last week approved the first first leveraged Bitcoin futures ETF: Volatility Shares 2x Bitcoin Strategy ETF (BITX) opened to investors on the Chicago Board Options (CBOE) BZX Exchange on Tuesday."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTI5L2Jlbi1tY2tlbnppZS1vbi1oaXMtbmV3LWNyeXB0by1ib29rLWJpdGNvaW4tYW5kLW1lZXRpbmctc2FtLWJhbmttYW4tZnJpZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Ben McKenzie on His New Crypto Book, Bitcoin and Meeting Sam Bankman-Fried - Bloomberg",
        "content": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tY2FzaC1zb2Fycy10by0xNC1tb250aC1oaWdoLW9mLW92ZXItMzAwLWFzLWhhc2gtcmF0ZS1zcGlrZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Cash soars to 14-month high of over $300 as hash rate spikes - CryptoSlate",
        "content": "Bitcoin Cash (BCH) rallied to a 14-month high of over $320 after rising by 35% in the last 24 hours, according to CryptoSlate data.\n\nSince June 20, the digital asset has enjoyed renewed interest as it is one of the four cryptocurrencies available on EDX Markets—a crypto exchange backed by traditional financial giants like Fidelity, Schwab, and Citadel Securities.\n\nAdditionally, the EDX launch coincided with a wave of institutional firms’ applications for a Bitcoin spot ETF triggered by BlackRock’s June 15 application.\n\nDue to this flurry of activities, BCH’s value has more than doubled in price, rising to $308 as of press time from $127.90 recorded on June 21.\n\nSouth Korean exchanges trading volume soars\n\nIn a June 30 tweet, Wu Blockchain attributed BCH’s pump to interest in South Korea.\n\nWu reported that South Korea’s biggest exchange UpBit was responsible for roughly 24% of BCH’s total trading volume, making it the most traded asset on the platform.\n\nData from CoinMarketCap corroborates this, showing that UpBit’s BCH/KRW trading pair has recorded a trading volume of over $620 million during the last 24 hours. This is four times higher than its BTC/KRW pair trading volume, which stood at $169.4 million as of press time.\n\nMeanwhile, other exchanges’ trading volume, including Binance, OKX, and Coinbase, shows that BCH is heavily traded across these platforms.\n\nIn a June 29 tweet, IntoTheBlock further pointed out that BCH saw its highest volume in a year, exceeding $750 million.\n\nThe data aggregator added the following:\n\n“Our ‘Balance by Time Held’ indicator reveals something intriguing. Notably, this volume surge could largely be attributed to traders who have held BCH for less than a month, increasing by 33% in the last 30 days.”\n\nBesides that, the network transaction volume has also risen to 2.60 million as of press time, according to OKlink data.\n\nBCH mining difficulty rises\n\nMeanwhile, additional data from OKlink shows that BCH’s network mining difficulty has trended higher since its price surge.\n\nIts mining difficulty is currently at 464.78G, while its hash rate is 3.1EH/s.\n\nMentioned in this article"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJyaWVmbHktMzFrLW1vbnRobHktcXVhcnRlcmx5LWNsb3Nl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price briefly clears $31K as monthly, quarterly close nears - Cointelegraph",
        "content": "Bitcoin (BTC) spiked through $31,000 on June 30 as a nearly $6 billion open interest expiry loomed.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nOptions expiry precedes day of BTC price triggers\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting local highs of $31,268 on Bitstamp before returning lower.\n\nBTC price performance improved into a key quarterly options expiry event, the second largest in Bitcoin’s history, with analysts keen to see its effect on markets.\n\n“Will be interesting to see how much is rolled over to future expirations and whether that OI is call or put dominant --> as that will impact how dealers hedge (buy or sell BTC),” financial commentator Tedtalksmacro wrote in part of associated commentary.\n\nJune 30 represents a key date for BTC traders all around, with the options expiry forming just one in a series of key events.\n\nMacroeconomic data from the United States in the form of the Personal Consumption Expenditures (PCE) print is also due, leading up to the monthly and quarterly candle closes.\n\nFor popular trader and analyst Rekt Capital, a close above $29,255 would confirm a breakout on monthly timeframes.\n\n#BTC is positioning itself for a Monthly Close above a resistance that had rejected price for the past three months\n\n\n\nAnd now $BTC is holding comfortably above that same level (black)#Crypto #bitcoin pic.twitter.com/b42XYWfcLi — Rekt Capital (@rektcapital) June 29, 2023\n\nLikewise, quarterly resistance at $28,872 was a focus, withRekt Capital noting that the same level had formed both resistance in Q1 2023 and 2020, as well as support in 2021.\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nData from monitoring resource CoinGlass put Bitcoin’s current Q2 gains at 8% — still far behind Q1 performance over 70%.\n\nHoping for Bitcoin upside continuation\n\nOthers hoped that regardless of the potential volatility, Bitcoin would still be able to reach new local highs.\n\nRelated: Bitcoin speculators send 35K BTC to exchanges in new ‘elation inflow’\n\nAmong them was trader Crypto Tony, whose primary target was $32,000.\n\n$BTC / $USD - Update #Bitcoin once again looking to work some magic and climb above that supply zone. Would be a Friday treat if we can manage to do that today .. pic.twitter.com/vBzeMvgXE4 — Crypto Tony (@CryptoTony__) June 30, 2023\n\nFellow trader Jelle acknowledged that BTC price was having trouble sustaining higher levels beyond brief spurts higher, with these always met with a retracement.\n\n“The upside wicks in this consolidation may look scary, but we saw similar price action in the areas circled in red,” he reasoned, looking back on a chart of BTC/USD over the past year.\n\n“Bitcoin looks eager for upside, sometime next week.“\n\nBTC/USD annotated chart. Source: Jelle/Twitter\n\nMagazine: How smart people invest in dumb memecoins: 3-point plan for success\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8yOS9iaXRjb2luLXRvLWV4cGxvZGUtYnktdXAtdG8tMTQwMC1hbWlkLWluc3RpdHV0aW9uYWwtaW50ZXJlc3QtaGVyZXMtdGhlLXRpbWVsaW5lLW1pY2hhZWwtdmFuLWRlLXBvcHBlL9IBigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8yOS9iaXRjb2luLXRvLWV4cGxvZGUtYnktdXAtdG8tMTQwMC1hbWlkLWluc3RpdHV0aW9uYWwtaW50ZXJlc3QtaGVyZXMtdGhlLXRpbWVsaW5lLW1pY2hhZWwtdmFuLWRlLXBvcHBlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin To Explode by Up to 1,400% Amid Institutional Interest – Here’s the Timeline: Michaël van de Poppe - The Daily Hodl",
        "content": "Crypto analyst Michaël van de Poppe is expressing bullish sentiment on Bitcoin (BTC) amid growing interest from institutional investors.\n\nVan de Poppe tells his 162,000 YouTube subscribers that Bitcoin could rally by up to 15x in the run-up to the halvening and for several months after.\n\n“We’re most likely going to have a cycle that’s comparable to 2015 to 2017, which also had a phase where a big group of people were jumping into the markets. And this time it’s the next flow which is institutional investors, more retail coming in, and more governments jumping in. It’s very likely that we’re going to have that in this cycle.\n\nWe just gradually go up in terms of adoption, in terms of price growth, through which an expectation of Bitcoin to do a 10x, or maybe a 15x, is not strange to expect in this cycle. Especially since the market cap of crypto is around $1.2 trillion…”\n\nAccording to Van de Poppe, crypto assets are likely to mimic the dot-com stock market bubble of the late 1990s.\n\n“The dot-com bubble was approximately $10 to $15 trillion which also collapsed afterward as price and hype always starts to accelerate which inevitably will happen to crypto too…\n\nYou can assume that this cycle will bring crypto to between $10 to $20 trillion and peak from there. And then have this slow gradual adoption taking place in slower cycles afterward.”\n\nOver the short term, the crypto trader says that if Bitcoin were to undergo a correction, the pivot point would be around $42,000.\n\n“The next target is breaking these highs [around $40,000] and getting it towards $50,000 in the next round pre-halving. That is still a very likely case. It is also still a very likely case that altcoins can continue pushing.\n\nBut for this run, given that we are at this point [just above $30,000], it’s still up for debate whether we’re going to have a correction taking place. But I’m marking $42,000 as the potential end of the run for this current rally of Bitcoin.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tbWFzcy1hZG9wdGlvbi1pcy1jb21pbmctYnV0LWhvdy1mYXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Crypto mass adoption is coming, but how fast? - Cointelegraph",
        "content": "Cryptocurrencies must reach mass adoption to unlock their maximum potential as a network technology and their value as financial assets.\n\nAs with other technologies, the adoption of crypto follows a classic bell curve: Starting from a small number of innovators, it grows as early adopters embrace it, moving into mass adoption as it expands to the early and late majority. Finally, it reaches those lagging behind in its final phase.\n\nSince its launch 14 years ago, Bitcoin’s (BTC) adoption has dramatically increased. The cryptocurrency has gone from being a fringe technology discussed by a small group of cypherpunks and nerds to being known worldwide, with some nation-states even adopting it as legal tender.\n\nAccording to most estimates, though, crypto’s global adoption rate is still in the single digits, which means it still remains in the “early majority” phase of global adoption.\n\nTo grow further and reach true mass adoption, crypto will need to overcome the “chasm” — the gap separating the early adopters from the early majority. To do so, certain catalysts may be required.\n\nWhat are those catalysts, and how far is crypto from reaching mass adoption? To find out, don’t miss the latest Cointelegraph Report on YouTube, and don’t forget to subscribe!"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtYnRjLXByaWNlLXNvb24tYnJlYWstYmV5b25kLTMxa9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin traders say BTC price will soon break beyond $31K yearly highs - Cointelegraph",
        "content": "Bitcoin (BTC) aborted a fresh attempt to reach $31,000 on June 29, while traders waited for bulls to succeed.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price “primed to launch”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action refusing to leave its short-timeframe trading range.\n\nNow caught between $30,000 and $31,000, BTC/USD lacked impetus to continue the prior week’s uptrend or reverse downward.\n\nFor market participants, however, there was increasingly reason to believe that flipping higher resistance levels to support would come next.\n\nIt is very likely that #Bitcoin will reach the N28CT target of $34,500 in the next push higher\n\n\n\nMy model has nailed every prediction since its creation\n\n\n\n-Bottom in Nov 2022\n\n-Best cycle buying prices in green year\n\n\n\nTime to accumulate is coming to an end..https://t.co/Lg9LBcoDad pic.twitter.com/HF7EwWNpKZ — CryptoCon (@CryptoCon_) June 29, 2023\n\n“Bitcoin’s 2020 Fractal is still in play,” popular trader Jelle wrote in a Twitter update, arguing that Bitcoin was repeating its late 2020 breakout.\n\n“Up only from here if we keep following it. I’m ready.”\n\nBTC/USD annotated chart. Source: Jelle/Twitter\n\nPopular trader and analyst Rekt Capital, meanwhile, eyed equally promising signs on monthly timeframes ahead of the June 30 monthly candle close.\n\n“BTC is positioning itself for a Monthly Close above a resistance that had rejected price for the past three months. And now BTC is holding comfortably above that same level (black),” he commented on an explanatory chart.\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nReacting, CryptoCon described BTC/USD as “primed to launch into the resistance zone.”\n\n“Markets are looking ready for another leg upwards,” Michaël van de Poppe, founder and CEO of trading firm Eight, added.\n\n“Bitcoin looks good, but altcoins are moving in tandem too.”\n\nPCE print meets options expiry\n\nThe week’s major macroeconomic data releases still lay ahead.\n\nRelated: Bitcoin speculators send 35K BTC to exchanges in new ‘elation inflow’\n\nWith Jerome Powell, chair of the United States Federal Reserve, set to deliver a second day of commentary on economic policy, June 30 remained the key release date.\n\nPersonal Consumption Expenditures (PCE) figures, the preferred inflation measurement tool for Powell, were tipped to be the volatility catalyst for risk assets.\n\nBeyond macro, the June 30 options open interest expiry was also a talking point, this coming in at a huge $4.7 billion.\n\nBig options expiration date for both ETH and BTC tomorrow\n\n\n\nETH: ~$2B notional\n\nBTC: ~$5B notional\n\n\n\nIf these are rolled into more calls we should see spot buying from dealers to hedge their books; puts opposite story. Either way expect some vol. pic.twitter.com/jWBQ0XOP2p — Tom Dunleavy (@dunleavy89) June 29, 2023\n\nFinancial commentator Tedtalksmacro suggested that there would be limited crypto market movement until the expiry.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmZhLW1hZy5jb20vbmV3cy9maWRlbGl0eS1qb2lucy1zcG90LWJpdGNvaW4tZXRmLXJhY2Utd2l0aC1mcmVzaC1zZWMtZmlsaW5nLTczNzQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Joins Spot-Bitcoin ETF Race With Fresh SEC Filing - FA Mag",
        "content": "June 29, 2023\n\nFidelity Investments is the latest financial services heavyweight to throw its name into the race to offer the first US exchange-traded fund investing directly in Bitcoin.\n\nThe Boston-based asset manager, which has about $11 trillion in assets under administration and has tens of millions of customers, re-filed for the Wise Origin Bitcoin Trust, according to a document submitted Thursday with the US Securities and Exchange Commission. Similar to previous US spot Bitcoin ETF filings in the past few weeks, the updated application says that Fidelity expects to enter into a surveillance-sharing agreement with a US cryptocurrency exchange.\n\nIt’s the latest high-profile traditional-finance firm to join the race after BlackRock Inc. made a splash with its June 15 application for a spot ETF, which opened the floodgates for others to try their hand at it, as well. For crypto fans, it’s been a significant string of developments given BlackRock’s reputation on Wall Street, and the view by some market-watchers that the asset manager wouldn’t be making an attempt were it not confident it could get regulatory approval.\n\nThere have been about 30 tries for a spot-Bitcoin product, according to a tally from Bloomberg Intelligence. But applications have faced opposition by regulators, who have in the past cited market concerns and a lack of investor protections, among other things. Fidelity originally filed for the Wise Origin Bitcoin Trust in 2021, which was denied by the SEC in January 2022, according to a Fidelity spokesperson.\n\nEven so, BlackRock’s move spurred a number of similar filings from other issuers, including by Invesco Ltd., WisdomTree, Valkyrie and Bitwise. Meanwhile, Cathie Wood’s ARK Investment Management has said that it believes it could be first in line to get any potential regulatory approval. ARK had in April, in conjunction with crypto-issuer 21Shares, re-filed its application for one.\n\nFans of digital assets are excited about the prospect of crypto potentially becoming more easily accessible to everyday investors, and the wave of filings has been a boon for token prices. Bitcoin jumped back above $30,000 in June and is trading at its highest levels in about a year. The token on Thursday traded around $30,500. That’s still less than half the record of almost $69,000 reached in November 2021.\n\nTo be sure, this isn’t the first hype-cycle over a potential launch. Crypto fans, who have been yearning for a spot-Bitcoin ETF for years, have been through periods of excitement before, only for regulators to ultimately rebuff all attempts.\n\nWhile BlackRock’s filing was credited by observers for helping to push the price of Bitcoin to a one-year high last week, the market reaction to the Fidelity refiling was fairly muted. Bitcoin was up about 1.5% to $30,500 as of 2:25 p.m. in New York, though off the highest level of the day.\n\n--With assistance from Tom Maloney.\n\nThis article was provided by Bloomberg News."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmFmci5jb20vbWFya2V0cy9jdXJyZW5jaWVzL2JsYWNrcm9jay1zLWJpdGNvaW4tYW1iaXRpb25zLWRyaXZpbmctcHJpY2UtaGlnaGVyLTIwMjMwNjI5LXA1ZGtlMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Crypto: BlackRock's bitcoin ambitions driving price higher - The Australian Financial Review",
        "content": "Risk bellwethers\n\nMr Bishop, who worked as a managing director at Gresham Partners and head of fixed income at Aberdeen Standard Investments before founding crypto advisory group NotCentralised, said BlackRock’s bitcoin gambit shows it was not worried by the SEC’s track record of dismissing applications to offer the digital assets to retail investors.\n\nHe added the $US10 trillion asset manager’s application potentially fired the starting gun on a land grab among competing banks and asset managers to market and sell bitcoin to retail and institutional clients.\n\nBlackRock’s regulatory filing shows it wants to offer its bitcoin fund on the Nasdaq exchange, with custody provided by SEC lawsuit target Coinbase, and Bank of New York Mellon.\n\n“All the cryptocurrencies have become progressively more correlated with broader risk assets. That’s one downside I see of institutional involvement if a manager of BlackRock’s scale, balance sheet, or funds under management is treating this as another investible asset class,” Mr Bishop said.\n\nAdvertisement\n\n“We think of bitcoin as digital gold and ethereum as digital oil. Bitcoin is not programmable like ethereum, but it’s exceptionally good at doing its job, which is value transfer in a hyper, hyper-secure way. But that’s it.”\n\nThe institutional adoption of bitcoin widens its divergence from its original conception as a decentralised, apolitical cryptocurrency first adopted in a counter-culture world, where value could be transferred free from political or commercial control, Mr Bishop added. “A lot of the decentralised maxis will be appalled by this [BlackRock’s] involvement, and we have conversations often with some early adopters, but it’s hypocritical to say this technology is the best in the world, and then to decry the involvement of these institutions. You can’t have it both ways,” he said.\n\nProfessional investors, asset managers and traders remain uncertain how to value bitcoin or predict its future direction. Some claim it is a Ponzi scheme as it has no intrinsic value, while others like Ms Wood boast their analysis shows it could reach $US1 million by 2030.\n\nMr Bishop said the correlation between bitcoin and other risk assets will be strengthened if BlackRock and other traditional finance powerhouses launch ETFs.\n\n“Bitcoin doesn’t offer an equity ownership stake and when you buy bitcoin you’re not exposing yourself to any one operating or business model, or margin stream,” he said. “That’s one potential downside [from institutional promotion] that it gets cemented into a bucket of other digital risk assets.”"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd2hvd2hhdHdoeS5vcmcvc2NpZW5jZS90ZWNobm9sb2d5L2JpdGNvaW4tbWluaW5nLWJvb20tY29udGludWVzLWluLXRleGFzLWFzLXN0YXRlLXNoYXR0ZXJzLWVuZXJneS1yZWNvcmRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Mining Boom Continues in Texas as State Shatters Energy Records - WhoWhatWhy",
        "content": "The Texas Lege’s failure to restrain incentivized energy-demanding bitcoin mining in Texas means the industry will continue to expand alongside record-setting grid strain.\n\nListen To This Story\n\nThis story by Paul Krantz was originally published by Deceleration and is part of Covering Climate Now, a global journalism collaboration strengthening coverage of the climate story.\n\n•\n\nAll is not well in rural Corsicana, Texas. The city and surrounding county have fallen into a state of disrepair, according to local resident Jackie Sawicky.\n\n“Our roads are terrible, this week we were having brownouts, and as of this minute, my water is out,” Sawicky told Deceleration. “Our infrastructure is absolutely on the brink of failure … and what are they doing? They’re going to bring in the world’s largest bitcoin mine.”\n\nA recent report from the American Society of Civil Engineers supports Sawicky’s observations, grading Texas overall with barely passing marks for the state of its roadways, wastewater systems, and levees and dams.\n\nConcerned about social and environmental impacts, Sawicky founded the Texas Coalition Against Bitcoin Mining and launched an online petition warning about noise pollution, rising water and energy costs, and more. At the time of this writing, it has garnered 1,180 signatures from residents opposing what is expected to be the state’s largest bitcoin mine to date.\n\n“We do not want the increase in environmental temperature in the immediate vicinity of the factory-that-produces-nothing,” the petition reads.\n\nFaced with escalating extreme weather due to climate change, Texas needs to upgrade infrastructure and transition away from fossil fuel use. The urgency of this need was felt keenly in 2021 when winter storm Uri cut power to millions across Texas for days on end and claimed hundreds of lives. Yet efforts intended to make the state more energy efficient withered during the last session of the Texas Legislature as lobbyists for environmental and traditional energy interests spent much of the session playing defense against bills seeking to kill renewable power and directing billions of dollars of tax revenue toward new, unnecessary gas-fueled power plants (See: “Garbage In, Garbage Out”).\n\nAs the state struggles to keep up with the energy demands driven by rapid population growth and rising temperatures, bitcoin mining continues to add further demand to the system, encouraged along by elected Republican leadership.\n\nPower Use\n\nAccording to a report by the Energy Reliability Council of Texas (ERCOT), the state’s electric grid manager, crypto mining consumed more than 3,300 Gigawatt/hours of Texas grid energy in 2022, more than double the amount used 2021.\n\nBitcoin’s total energy consumption in Texas is only increasing. Further mining projects amounting to 39 gigawatts in demand are proposed by 2027, with at least 2.5 gigawatts already approved and 6 gigawatts more that have met planning requirements.\n\nThe daily energy demand for all of Texas is currently about 80 gigawatts.\n\nIf only the bitcoin projects that have already met planning requirements are approved, mining for digital currencies could increase energy demand on the grid by 10 percent within four years.\n\nA statement released by the grid manager said, “ERCOT will not allow the interconnection of load that would be expected to result in any violation of reliability criteria.”\n\nAs opposed to other energy-intensive industries, none of these projects offer tangible value to most Texas residents.\n\nRiot Platforms (formerly Riot Blockchain), is the company planning to bring an industrial bitcoin mine to Corsicana, potentially “the first one gigawatt load ever approved by ERCOT.” Riot already operates a 450-megawatt facility near Rockdale, Texas, reportedly the largest single bitcoin mine in North America. One megawatt of electricity powers about 200 Texas homes during periods of peak demand, according to ERCOT. So Riot’s new gigawatt plant, at peak capacity, could consume as much power as 200,000 Texas homes.\n\nRiot failed to respond to requests for comment from Deceleration.\n\nTo “mine” bitcoin, computers solve complex math equations (up to trillions per second) to identify a series of numbers that validates the next block on the blockchain. A miner is rewarded for solving the block with bitcoin currency. Due to the ever-increasing difficulty of solving these equations, the amount of energy required to power the network has exploded to exorbitant levels.\n\nThe Cambridge Bitcoin Electricity Consumption Index (CBECI) monitors bitcoin’s global electricity demand. At time of writing, it estimates that the global bitcoin network is using 144 terra-watt hours (TWh) annually. To put that number in perspective, gold mining is estimated to use 131 TWh worldwide and data centers were estimated to use 200 TWh as of 2018. The CBECI’s estimates that the bitcoin network currently pollutes more than the country of Austria, about 71.5 million tons of CO2 per year.\n\nThe New York Times found that the two bitcoin mines in Rockdale consume more energy than all of the homes in a 40-mile radius.\n\nBitcoin advocates highlight projects powered by renewable energy, such as one of Marathon Digital Holding’s mines near McCamey, Texas, which draws power from a wind farm. But many mining projects draw electricity directly from the grid, a mix of power sources that averages out to include roughly 60 percent of electrons derived from combusting coal and gas; still others are directly attached to fossil fuel power plants. Before constructing the mine in McCamey, Marathon cut a deal with a coal plant that was due to close and kept it operating for months longer.\n\nBeside energy, water is also a crucial resource for crypto mining. It’s needed to cool the computers, and in a hot Texas summer that can amount to millions of gallons per day. Navarro Mills Lake, which is to be the primary source for Riot’s planned facility, was in stage one drought this January and stressed in recent years.\n\n“Last year, a record number of cattle ranchers had to sell their herds early because the drought was so bad that it was spiking the cost of hay and they couldn’t afford to feed their cattle,” Sawicky said.\n\nCorsicana residents will also be subjected to the unending drone of thousands of mining computers buzzing. The sound of one mine built in a rural town has been described as “a small jet that never leaves.”\n\n‘Freedom Money’\n\nPierre Rochard, vice president of research at Riot Platforms, told members of the Texas Senate Committee on Business and Commerce that bitcoin brings jobs to Texas, and called bitcoin “freedom money.”\n\nLee Bratcher, president of the bitcoin lobbying group Texas Blockchain Council, said in the same hearing that bitcoin miners in Texas employ around 2,000 ongoing employees, and have employed around 20,000 contractors. Out of nearly 15 million workers in Texas, those are not big numbers. Once bitcoin mining centers are built, they require a very slim workforce to maintain. Bratcher also declined to comment for this article.\n\nERCOT classifies bitcoin mines as “large flexible loads,” because they draw a lot of power and are able to power down or reduce their energy use quickly. Bigger bitcoin mines typically have a curtailment clause in their energy contracts with ERCOT, meaning they agree to power down during moments of emergency energy demand.\n\nBitcoin miners have a business incentive to power down when demand spikes and energy prices go up, but by participating in “responsive reserve service” with ERCOT, miners collect energy credits for energy they don’t use.\n\nRiot, for instance, reported $9.5 million in energy credits from the state last July for powering down during a heatwave, and a total of $27.3 million in energy credit payouts that year, according to a recent earnings report.\n\nRecently, the proposed Texas Senate Bill 1751, sponsored by state senators Kolkhorst, Campbell, and Nichols aimed to stop bitcoin miners from gaining ERCOT energy credits. The bill passed the Senate, but failed to make it to the voting floor of the House.\n\nThe bill’s sponsors said it was not a punitive measure, but meant to eliminate unnecessary incentives for a rapidly growing industry. Bitcoin miners celebrated the death of what they called the “anti-mining” bill when they learned it would not make it to the Governor’s desk.\n\nCan Bitcoin Be Tamed?\n\nThe too often ignored reality of mitigating climate change is that humankind needs to reduce energy and resource use overall. To merely swap today’s fossil power for a renewable grid would lead to further constraints and environmentally devastating impacts. The challenge is in maintaining good living standards while reducing energy demand. Doing so requires rethinking virtually every aspect of society, including “low-energy housing, widespread public transport, and diets low in animal-based foods,” one recent assessment found. It’s safe to say that bitcoin’s terawatts don’t fit within the proposed framework.\n\nEven for those who believe in the importance of alternatives to fiat currency, there are options besides bitcoin with a significantly lower energy impact. The second most popular cryptocurrency, Ethereum, cut network greenhouse gas emissions 99 percent last year by switching from a proof-of-work algorithm to proof-of-stake. Proof-of-stake is an alternative model for maintaining a cryptocurrency that doesn’t require mining.\n\nTake a bird's-eye view of our #Bitcoin mining operations in McCamey, TX. This is one of the four quadrants that make up the site. In total, there are over 60,000 miners at the site, working together to secure the Bitcoin network. pic.twitter.com/jIUZrRCbYv — Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) April 25, 2023\n\nEnergy and water commitments now being captured by bitcoin could edge out alternative projects more capable of helping Texas navigate the energy transition, like green hydrogen fuel production, in the years ahead.\n\n“Electrolyzers … store energy in the form of hydrogen that can then be used for other applications, such as transport, industrial uses, or more simply to reuse it for power plants,” Olivier Beaufils, Market Lead for ERCOT at Aurora Energy Research, told Deceleration.\n\n“A lot of these hydrogen projects are still in early stages,” Beaufils said, noting that competition with other users hasn’t manifested yet. “Now three to five years ahead, that might be a different story.”\n\nCharlie Schumacher, Marathon’s corporate communications VP, said that bitcoin miners help rural renewables stay profitable and “soak up” electricity that may not reach users otherwise. But Adrian Shelley, Texas director of the advocacy organization Public Citizen, contends that bitcoin mining is not a viable solution to transmission issues.\n\n“You may have a glut of wind energy over here that, within a couple of years, ERCOT sees and invests in transmission that brings more of it to people where it’s needed,” Shelley said. “But if you mine bitcoin, ERCOT will never see that constraint, and is never going to make the investment.”\n\nMolly White, who has a Harvard University fellowship to research crypto and publishes a blog called Web3 is Going Just Great, cautions against taking pro-bitcoin claims at face value.\n\n“Bitcoin miners’ claims are pretty nakedly self-serving,” White told Deceleration. She added that the more computers mine bitcoin, the more difficult mining becomes, increasing power use for the network overall. “So even [miners] using so-called waste energy from renewables are still contributing to the overall energy footprint of Bitcoin … much of which is not renewable.”\n\nHow ERCOT and political leaders prioritize these projects will have a tremendous impact on the state’s energy grid.\n\nBut for now, a pro-bitcoin lobby has gained influence in Texas. Governor Gregory Abbott has previously hosted the Texas Blockchain Council at the governor’s mansion, and Senator Ted Cruz has openly supported the currency. Also, former interim president and CEO of ERCOT, Brad Jones, became the first member of Riot’s advisory board this year.\n\nTexas’s 88th legislative session confirmed that the state’s bitcoin mining industry will continue to be propped up by incentives. Three bills that passed are being celebrated by bitcoin miners, including HB 591 which will introduce tax incentives for powering crypto mining with flared gas.\n\nIn adding further tax incentives, and failing to cut existing ones, the state legislature appears to have sent a clear signal that Texas is open for bitcoin business, and the expanding peak energy demands that it entails.\n\nWhile bitcoin miners continue to profit from access to cheap energy and tax breaks, residents of communities across Texas will continue to experience increasing energy bills and the continued risk of power outages in yet another summer of record-breaking energy demands.\n\n“When I go grocery shopping, I ask people, ‘Have you heard about the bitcoin mine?’” said Jackie Sawicky. “I have talked to hundreds of people in Corsicana and Navarro County, and I can count on both hands the people who have shown positive favor.”\n\nFor the residents of Corsicana, it looks like a very noisy, thirsty, and power-hungry neighbor is coming to town."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDYvMzAvYml0Y29pbi1zdi1ic3YtZG91Ymxlcy1pbi12YWx1ZS1yb2NrZXRlcy11cC01NS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin SV (BSV) Doubles in Value, Rocketes Up 55% - Crypto Times",
        "content": "On Friday, the cryptocurrency market as a whole is experiencing a rise in prices. This is mainly due to two major cryptocurrencies, Bitcoin and Ethereum, making significant gains. Bitcoin has gone up by 3.1% and is now valued above $31,000, while Ethereum has increased by 3.4% and reached $1,900. Taking advantage of this positive trend, Bitcoin SV (BSV) has also joined the rally and surged by nearly 15%.\n\nIn 2018, Bitcoin SV (BSV) split from Bitcoin Cash (BCH), creating its own path. Now, BSV has become a significant player alongside Bitcoin and Bitcoin Cash. Surprisingly, within just eight days, BSV’s value doubled from a low of $27 on June 23rd and managed to recover over 55%, reaching $43.\n\nAs of now, the price of Bitcoin SV (BSV) is $42.2, and it has gained 14% in value overnight. However, the market capitalization of BSV has increased and is now in the range of $814 million, according to data from CoinMarketCap.\n\nBitcoin SV’s Resistance Test: Opportunity or Caution?\n\nThe price of Bitcoin SV (BSV) is currently trading well above the falling parallel channel, which is a positive sign. However, in mid-May, buyers got caught when the price broke out of this downward channel, leading to a significant sell-off.\n\nNow, BSV is approaching its highest point in June, which was $45. In order for the price to reach $50, the buyers need to push it past the key resistance range (represented by the red zone).\n\nThe trading volume for Bitcoin SV (BSV) has increased by 100% in the last 24 hours, reaching $136 million. However, it is still relatively low compared to the trading session on June 24th.\n\nAfter a period of 45 days, the bulls have managed to keep Bitcoin SV (BSV) above the 200-day simple moving average, creating a positive atmosphere. Now, the important moving averages such as EMS 20, 50, 100, and 200 have all turned into support levels. Additionally, the RSI indicator is approaching an extremely overbought region."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL3d3dy50aGVoaW5kdS5jb20vbmV3cy9jaXRpZXMvYmFuZ2Fsb3JlL2JlbmdhbHVydS1idXNpbmVzc21hbi1wbGVkZ2VzLWdvbGQtYmVncy1mcm9tLWZyaWVuZHMtYW5kLWJvcnJvd3MtZnJvbS1iYW5rLXRvLXRyYWRlLWluLWNyeXB0by1idXQtZW5kcy11cC1sb3NpbmctNTItbGFraC10by1iaXRjb2luLWZyYXVkL2FydGljbGU2NzAyNjIwOC5lY2XSAdEBaHR0cHM6Ly93d3cudGhlaGluZHUuY29tL25ld3MvY2l0aWVzL2JhbmdhbG9yZS9iZW5nYWx1cnUtYnVzaW5lc3NtYW4tcGxlZGdlcy1nb2xkLWJlZ3MtZnJvbS1mcmllbmRzLWFuZC1ib3Jyb3dzLWZyb20tYmFuay10by10cmFkZS1pbi1jcnlwdG8tYnV0LWVuZHMtdXAtbG9zaW5nLTUyLWxha2gtdG8tYml0Y29pbi1mcmF1ZC9hcnRpY2xlNjcwMjYyMDguZWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bengaluru bizman takes part-time job paying ₹50, ends up losing ₹52 lakh to Bitcoin fraud - The Hindu",
        "content": "June 30, 2023 01:21 pm | Updated 01:58 pm IST - Bengaluru\n\nBengaluru\n\nA 39-year-old businessman lost over ₹52 lakh after participating in a cryptocurrency exchange task. He pledged gold, withdrew a fixed deposit, used business overdraft and borrowed money from friends to pay the fraudsters. An FIR was registered at South East CEN Crime Police Station.\n\nNalagani Gururaju runs two hair salons at Electronics City in Bengaluru. On May 29, an unknown person [phone number +1(6292742279)]contacted him on WhatsApp and asked him to take up a part-time job subscribing to YouTube channels. Gururaju was promised ₹50 each for subscribing to multiple YouTube channels. Gururaju subscribed to three channels after clicking on the links sent by the unknown person. He received ₹150 in his bank account.\n\nLater, he was added to a Telegram group which included four members who were talking about crypto tasks. An admin of the group sent details of various packages to invest money in buying and selling Bitcoins (BTC).\n\nMembers were sending several messages and photos. The text on one photo shared on the group stated: Real Time Task Availability — Pay ₹30,000 and withdraw ₹43,500, or pay ₹9,69,000 and withdraw ₹13,08,150, or pay ₹6,28,000 and withdraw ₹9,10,600.\n\nGururaju was told to open an account on a website to transact in Bitcoins. The website was similar to that of a popular crypto exchange site bitFlyer.\n\n“In the Telegram group, other members were sharing screenshots of money received in their account. This made me confident about going ahead with the tasks,” he told The Hindu.\n\nOnce Gururaju expressed an interest to trade, he was told to transfer money to various account numbers. He sent money to 7 different accounts. The fraudsters, who were posing as BTC brokers, claimed to be trading the coins he had bought, and that the same was reflected in the account (crypto wallet), which he had opened on their website.\n\nGururaju had transferred ₹52 lakh to the accounts. As per his crypto account, he had a total of over ₹65 lakh after including the profit. But, although Gururaju could see profits growing in the account, he did not have the option to withdraw the money.\n\nWhen he asked the admin of the Telegram group to allow him to withdraw the money, the admin claimed that he could withdraw his money if he paid tax on the same. Other members in the Telegram group posted messages saying that this is the rule of the company.\n\nGururaju entered into a personal chat with the admin and requested return of his money. The admin allegedly admitted that the whole scheme was a fraud and told him to pay ₹3 lakh more to join the group, and become a partner. The admin claimed that they work from Mumbai.\n\nGururaju is now bankrupt. He does not have money even to pay the salaries of his salon staff.\n\nHe approached the bank with his complaint. The bank was unable to recover the money transferred by Gururaju to the accounts of the fraudsters, which had been opened in private banks in Delhi, Andhra Pradesh and Odisha."
    }
]