[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vcmVhc29uLmNvbS8yMDIzLzA0LzA2L3Byb3Bvc2l0aW9uLWJpdGNvaW4taXMtdGhlLWZ1dHVyZS1vZi1mcmVlLWV4Y2hhbmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Debate: Bitcoin Is the Future of Free Exchange - Reason",
        "content": "Bitcoin Is an Effective Tool for Liberty\n\nAffirmative: Alex Gladstein\n\nThere was a time when it was fair to question whether bitcoin was an effective tool for liberty. In its first few years, when the digital currency didn't have many users, wasn't worth very much, and lacked global markets, it was more a dream than a lifeline. But those days are long gone. Today, millions of people—especially in dictatorships and collapsing economies—rely on bitcoin to give them liberty that governments and corporations try to steal away.\n\nMost bitcoin users aren't \"freedom fighters\" or \"dissidents\" in the classic sense. Some are: human rights activists in Belarus, investigative journalists in Russia, humanitarians in Ukraine, feminists in Nigeria, pro-democracy organizers in Togo, educators in Taliban-ruled Afghanistan, and even whistleblowers in the West. But the vast majority are simply people finding value in a financial network that can't be devalued, censored, or stopped. One doesn't need to see oneself as a revolutionary to want a digital form of cash that doesn't require ID and doesn't need permission from the state to operate. One might just be trying to escape from a broken fiat system.\n\nIf liberty is freedom and self-sovereignty, then bitcoin is the purest expression of financial liberty. It gives anyone—regardless of birthplace, nationality, age, gender, creed, skin color, education, or wealth—access to the best-performing financial asset of the last decade. It lets anyone with a cellphone send and receive value from anyone else, regardless of what governments think and regardless of borders and political restrictions.\n\nBitcoin is a superb tool for fundraising for human rights groups and journalists at risk. But it's also—much more importantly in terms of global economic volume—a superb tool for merchants accepting payments from customers in a different country, for employers making payments to employees or contractors half a world away, or for laborers sending remittances to families overseas.\n\nFor people in the Global South, bitcoin might be much more valuable than for people in advanced economies. For example, Africa is still divided by more than 45 central banks and 45 different fiat currencies. It is also exploited by colonial currencies like the French CFA franc, and by a neocolonial payment infrastructure where 80 percent of all inter-African payments are processed by American or European companies and where the average fee to send a $200 cross-border payment or remittance from the U.S. or Europe to sub-Saharan Africa is 7 percent.\n\nMaking matters worse, corrupt governments enforce a fake \"official rate\" of exchange in many countries. In Nigeria, the dollar trades for 750 naira on the street but just 450 at regulated institutions. For many companies in Africa, bitcoin is a major upgrade. It allows them to send and receive value at the real exchange rate in seconds from anywhere in the world, colonial boundaries and rent-seeking intermediaries be damned.\n\nBitcoin can also be an important tool for liberty for citizens of the United Kingdom or Japan or the United States. What if they have family living in the Global South, where sending money is a persistent problem? What if they have friends or clients in Palestine or Cuba, where economic barriers make it difficult if not impossible to send money digitally through the legacy system? What if they have upset the administrators of the payment platform du jour—Patreon or PayPal, perhaps—and are no longer able to collect donations from their fans? Then despite their financial privilege, bitcoin can be a big help.\n\nAt its core, bitcoin protects one of the most fundamental liberties—property rights. All it takes is a few minutes of Wi-Fi to download a bitcoin app, back up the seed phrase, and generate an address. Then voila: You now have a way for anyone else in the world to pay you. No one can confiscate your funds without access to your private key. No one can debase your earnings. No one can prevent you from sending value to anyone else. Before Satoshi Nakamoto invented bitcoin in 2009, property rights existed at the pleasure of the state. A group of men with guns enforced them. Today, in the post-bitcoin world, property rights exist regardless of the state. Now they are protected by math.\n\nBitcoin inarguably has room to grow. Its privacy, user interface, and liquidity leave much to be desired—and are constantly improving. These upgrades will be desperately needed as the world edges closer to a place where governments consolidate power over citizens through central bank digital currencies and the elimination of paper cash.\n\nVast strides have been made in each of bitcoin's weak areas in the past five years. For someone living in war-torn Ukraine or drought-stricken Somalia, it's easy enough to receive bitcoin from a donor abroad and to sell it for cash, all in minutes. No passport or bank account or technical expertise is required. In sub-Saharan Africa, it's even possible to use bitcoin (with a few tradeoffs) with no internet whatsoever, through a popular mobile text messaging protocol.\n\nBitcoin's critics have generally never had to deal personally with financial repression. When their bank accounts eventually get frozen, when their payment apps deplatform them, when their wages get devalued, or when their government shows up at their doors asking where a certain bank wire came from, then—finally—they'll understand bitcoin's value proposition.\n\nGold, Not Bitcoin, Is the Most Likely Replacement for Fiat Money\n\nNegative: Lawrence White\n\nI come to praise bitcoin, not to bury it. I certainly don't come to praise government fiat money or central banking, which I've been criticizing in print for my entire career. My first two books, Free Banking in Britain and Competition and Currency, present the case for free and decentralized banking over central banking. I would love it if the world economy were to run on a completely private monetary standard with free banking.\n\nMy forthcoming book, Better Money: Gold, Fiat, or Bitcoin?, argues that gold would be a better monetary standard than bitcoin, and that gold is the standard more likely to emerge bottom-up from free choice by money users. We should appreciate bitcoin for the remarkable thing that it is, not for what it isn't and not for what it isn't likely to become.\n\nBitcoin has succeeded tremendously at creating a valuable new type of asset. As Alex Gladstein has emphasized, it provides a remarkable censorship-resistant value-transfer system. But, sad to say, it hasn't replaced government fiat money as an everyday or commonly accepted medium of exchange, and it isn't getting any closer to doing so. Granted, some people use bitcoin to remit funds across borders, which counts as medium-of-exchange use, but that too is uncommon. There are cheaper routes for ordinary remittances.\n\nLet me unpack the term \"medium of exchange.\" It means a good that is acquired by trading away a good or service, and which is intended to be spent in acquiring a third good or service.\n\nThat's not a common pattern with bitcoin. Few people are paid in bitcoin. Few people routinely buy or sell goods and services for bitcoin. Fewer than 3,000 merchants in the United States publicly accept bitcoin, according to NerdWallet subsidiary Fundera's last count. There are economic reasons for that, most importantly that the purchasing power of bitcoin is highly volatile. It would be a dangerous way to hold your rent money, because its value can drop 10 percent in a few days. Mostly, bitcoin is purchased with fiat (or fiat stablecoins) not to be spent, but to be \"hodled\" (held) as a form of savings or \"store of value,\" in hopes that its price will rise. When unhodled, it is mostly exchanged back into fiat.\n\nBitcoin is not on a trajectory to replace established monies. In the last few years it has actually lost the one niche where it was the leading medium of exchange, namely crypto-asset markets. Bitcoin used to be the main exchange medium used in buying and selling Ether, Dogecoin, Zcash, Monero, and the other coins that constitute the other 58 percent of the total crypto-asset market. No longer. The No. 1 medium of exchange on crypto markets is now USD Tether, followed by other U.S. dollar stablecoins.\n\nFollowing its current trajectory, bitcoin will continue to serve as a savings vehicle and a niche censor-resistant value-transmitting system, and continue to exhibit high price volatility, without ever replacing other monies as a commonly accepted medium of exchange.\n\nMany bitcoin owners are happy with hodling as a way to get rich. To no-coiners they say: \"Have fun staying poor.\" They don't feel the need to insist that bitcoin will supplant established monies. But others want to say that bitcoin is bound to, eventually, take the place of fiat monies, including the dollar, and that it is the future of free exchange.\n\nI can't say it's logically impossible for bitcoin to replace established fiat monies, but bitcoin's built-in volatility makes that unlikely.\n\nOne bitcoiner has proposed an \"inevitability sequence\" in which a growing market cap brings declining price volatility, that encourages wider acceptance of bitcoin as a medium of exchange, and that reinforces declining price volatility, generating a positive feedback loop.\n\nOne problem: There's no evidence of declining price volatility after 13 years.\n\nA second problem: There's no reason to expect it. Demand for bitcoin remains predominantly speculative, and every demand swing is fully reflected in price because the quantity of bitcoin—unlike ordinary commodities—does not respond to changes in demand that change its price. In Econ 101–speak, the bitcoin supply curve is vertical, completely price-inelastic. By contrast, a demand surge that raises the price of toilet paper soon leads to the production of more toilet paper, bringing the price back down. Gold has a slightly elastic supply in the short run, but very elastic supply over the long term.\n\nA single common money emerges spontaneously because of the network property of a medium of exchange. Silver (or salt, or a cowrie shell) is more useful to you as a medium of exchange if a greater number of potential trading partners accept it. An established money therefore has a strong incumbency advantage.\n\nThe 6.4 percent inflation rate of January 2023 (over January 2022), even if it persists, will unfortunately not be sufficient to reverse the U.S. dollar's incumbency advantage. The recent experiences of other countries with high inflation demonstrate that it takes an inflation rate much higher than 6.4 percent to get people to abandon an incumbent currency and start using something else for ordinary exchanges.\n\nWhen a country hyperinflates and people do switch (as in Venezuela and Lebanon in recent years), they predominantly switch to U.S. dollars. But, you might ask, what if all the major government fiat monies were to become nearly as bad as the Venezuelan bolivar? Even in the unlikely event that all the fiats do hit 20 percent inflation or more, the gold standard would be more likely to reemerge than a bitcoin standard. On top of gold's relatively limited volatility, the World Gold Council puts nonbank public ownership at $2.8 trillion in gold coins and bullion, versus the less than $0.5 trillion market cap for bitcoin (with the current price below $25,000). Gold has a larger network.\n\nSubscribers have access to Reason's whole May 2023 issue now. These debates and the rest of the issue will be released throughout the month for everyone else. Consider subscribing today!"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmV3Zy5vcmcvcmVzZWFyY2gvcHJvb2YtcHJvYmxlbXMtYml0Y29pbi1taW5pbmdzLXBvbGx1dGlvbi10b2xsLXVzLWNvbW11bml0aWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Proof of problems: Bitcoin mining's pollution toll on U.S. communities - Environmental Working Group",
        "content": "Once-dead coal-fired power plants roaring back to life and spewing hazardous emissions, overheating trout chopped up by utility water pipes, nonstop low-frequency noise – these are just some of the ways bitcoin mining is polluting communities across the U.S.\n\nIn six case studies, EWG profiles how a cryptocurrency mining process known as “proof of work” can create air, climate, water, waste, and noise pollution for those living nearby. The report spotlights the experiences of locals in six states and how the arrival of cryptocurrency mining has changed their lives and environments for the worse.\n\nNot all bitcoin mines are alike. Some rely on the resurrection of dormant fossil fuel power plants, some find low-cost high-pollution fuel sources like burning coal waste in Pennsylvania, and others flare gas from oil wells to generate the necessary electricity, like the mines blighting Montana’s scenery.\n\nThey all use the same technology, individual computer hardware no bigger than a shoe box or two, all competing to solve the same puzzle and earn a few bitcoin. But it takes thousands of these mining computers, called rigs, to become competitive in the mining industry. That’s why some companies are placing multiple shipping crates full of bitcoin mining rigs in communities across the U.S. – in one of the stories this report covers, an industrial-scale bitcoin mine sits just a few hundred feet from a home.\n\nWhat these mines have in common is their use of proof of work, which is wasteful by design. This system, a type of software to record and manage bitcoin transactions, has proven highly inefficient, requiring massive amounts of fossil fuel-generated electricity to operate. Proof of work is a source of constant noise, a blight in communities across the country, and a hotbed of fraud and corruption that bilks consumers and ratepayers out of billions of dollars.\n\nChange is needed, and it’s needed urgently.\n\nDespite staunch opposition nearly everywhere bitcoin is mined, Wall Street bankers and other large financial backers manage to continue this assault on climate and communities across the country.\n\nCurrently, the most efficient bitcoin mining computers release more than 105 metric tons of carbon dioxide per bitcoin mined, but average emissions per bitcoin are easily double that. To fight the climate crisis, we need to cut emissions – not increase them.\n\nIt doesn’t have to be this way. The bitcoin community is full of innovators who have changed its code before. Other processes also exist that use much less electricity and have none of the pollution implications outlined in these six case studies.\n\nImage\n\nWhile communities suffer, Wall Street cashes in\n\nIn the wake of a tidal wave of cryptocurrency bankruptcies that have seen average consumers’ bitcoin and other crypto deposits completely wiped out, big Wall Street players have used this moment as a chance to invest in a largely unregulated industry that actively contributes to the climate crisis and harm of communities across the country. Goldman Sachs, J.P. Morgan and Fidelity all have climate commitments, but they invest in and offer crypto trading and management services that cause average Americans more harm than good.\n\nDespite its anti-establishment decentralized-finance roots, bitcoin is now the darling of big banks, multi-billion-dollar hedge funds, and private equity interests. The days of individual entrepreneurs and local businesses carving a niche out of the bitcoin business have long passed.\n\nAs its cycle of endless growth, energy consumption, and increasing emissions continues, the only question remaining is how much will bitcoin cost us all in rising electricity prices and emissions?\n\nMuch to the distress of their neighbors, bitcoin mining operations, in search of low-cost electricity, cheap land, and limited local planning or zoning regulations, are taking root in small rural communities located in pristine natural environments across the country.\n\nBitcoin’s insatiable need for ever-more energy has led the industry to revive shuttered coal-fired power plants, siphon off energy resources from more economically productive uses, and even burn piles of waste coal too dirty for coal companies to sell.\n\nIn other places, the incessant din created by mining operations continues 24 hours a day, seven days a week, and is driving nearby residents to desperation. Many local governments have found themselves unable to effectively address the noise, leaving residents in these places to fend for themselves against the well-funded crypto mining menace.\n\nDespite staunch opposition nearly everywhere bitcoin is mined, Wall Street bankers and other large financial backers manage to continue this assault on climate and communities across the country.\n\nWhat can be done?\n\nThe White House Office of Science and Technology Policy published a report last fall that calls on federal agencies to take more steps to assess the potential environmental and energy problems associated with proof of work digital assets. It also recommended Congress consider legislation.\n\nThe report even went so far as to suggest the federal government should limit or eliminate the use of highly energy-intensive cryptocurrency mining methods, such as proof of work, should the measures outlined in the report fail to reduce climate impacts.\n\nInitiatives are needed – whether regulatory, legislative, or voluntary – to identify less harmful approaches that would retain the potential benefits of blockchain technology, like proof of stake or some as-yet-undiscovered method that would make bitcoin both efficient and environmentally friendly."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA0LTA1L3BlcnNvbmFsLXdlYWx0aC1iaXRjb2luLWRlc2VydmVzLXNvbWUtc3BhY2UtaW4teW91ci1wb3J0Zm9saW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Personal Wealth: Bitcoin Deserves Some Space in Your Portfolio - Bloomberg",
        "content": "First, Goldman Sachs Group Inc. highlighted Bitcoin as the best-performing asset in terms of absolute and risk-adjusted returns earlier this year. Then the banking crisis happened and the largest digital coin rose to its highest price in ten months. It's enough to make even some naysayers reconsider.\n\nBut is this year’s turnaround just a short-lived bubble or evidence of the what-doesn't-kill-you-makes-you-stronger thesis? Views are all over the place. The White House put out an economic report recently slamming crypto, saying the assets don't have fundamental value; while Bitcoin bulls like ARK Investment Management CEO Cathie Wood see its climb as an affirmation of decentralization."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZS1oaWRkZW4tYml0Y29pbi1tYW5pZmVzdG8tZXZlcnktMTI1OTE4ODgwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple has hidden a bitcoin manifesto in every Mac since 2018, says a tech blogger who discovered it by accident - Yahoo Finance",
        "content": "Apple CEO Tim Cook attends an Apple store in Shanghai Thomson Reuters\n\nTechnologist Andy Baio wrote in an April 5 blog post that he found a PDF of the original bitcoin white paper on his Macbook.\n\nHe said Apple has seemingly hid the original crypto manifesto in \"every copy of macOS since Mojave in 2018.\"\n\nBaio shared how any users could locate the manifesto on their own Apple computers.\n\nTechnologist Andy Baio says he accidentally discovered a copy of Satoshi Nakamoto's bitcoin white paper on his Apple Mac computer.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto's Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018,\" Baio wrote in an April 5 blog post.\n\nHe said he asked over a dozen of his friends and fellow Mac users to confirm, and the document was there for every single one, the file called \"simpledoc.pdf.\"\n\nTo find it, according to Baio's instructions, users can open the terminal and type the following command:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nFor those using macOS 10.14 or later, the document should immediately open in Preview as a PDF file, he explained.\n\nInsider tested out Baio's instructions and found a copy of the document stored on the computer running the most recent update of macOS.\n\nThe now-famous white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System\", was published in October, 2008 by the pseudonymous Satoshi Nakamoto. In it, the author lays out their thesis for the underlying mechanisms that power what is now the world's largest cryptocurrency by market value. The paper's abstract reads:\n\n\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.\"\n\nBaio added that he found barely any other evidence online save for a lone Twitter thread from November 2020, with a user posting similar screenshots.\n\nStory continues\n\nBaio couldn't figure out why, of all documents, the original bitcoin manifesto was chosen to be included in Apple's operating system.\n\n\"Maybe,\" he wrote, \"it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nAs for token itself, bitcoin is hovering around $27,925 on Thursday, and has rallied 68% so far in 2023. The crypto has seen nearly 24% of those gains come in March amid broader banking turmoil and uncertainty.\n\nRead the original article on Business Insider"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2FwcGxlLWJpdGNvaW4td2hpdGUtcGFwZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Where to Find the Bitcoin White Paper on Your Apple Computer - Blockworks",
        "content": "The Bitcoin white paper has been discovered hidden deep inside Apple’s system files for machines running macOS Catalina or later.\n\nLabeled as “simpledoc.pdf” the file appears to showcase Satoshi Nakamoto’s vision for decentralized cash, based on a public ledger, in all its nine pages of glory.\n\nThe subtle nod to the world’s oldest blockchain — on the day of Nakamoto’s 48th birthday — was first reported by an independent blogger, Andy Baio, on his Waxy blog.\n\n“I was really trying to fix my printer,” Baio told Blockworks. “I was trying to scan a document with my wireless printer/scanner, but the device wasn’t showing up in Image Capture after I upgraded macOS recently. Just this “Virtual Scanner II” device that I’d never seen (or noticed?) before.”\n\n“I went googling for “Virtual Scanner II” to find out more, and there were virtually no references to it online at all, mostly just the old Twitter thread I linked to.”\n\n“In that thread, he mentions where the files are located on the filesystem, which I was able to confirm. I asked some friends to confirm they could see the same thing, using the little command I wrote for Terminal and they could, so I wrote about it!”\n\nBaio has no explanation for why the document appears buried in an obscure folder in macOS, but says that all modern versions of the OS appear to contain it. Apple did not immediately respond to Blockworks’ request for comment.\n\nBaio explains that the way to access the document is to open Terminal and type a specific command:\n\nWaxy.org\n\nHe says that if you’re not an Apple aficionado, the alternative method is to “open Finder and click on Macintosh HD, then open the System→Library→Image Capture→Devices folder. Control-click on VirtualScanner.app and Show Package Contents, open the Contents→Resources folder inside, then open simpledoc.pdf.)”\n\nBut there’s more. In order to actually view the document, Baio states that there is another step: “In Image Capture, select the “Virtual Scanner II” device if it exists, and in the Details, set the Media to “Document” and Media DPI to “72 DPI.” You should see the preview of the first page of the Bitcoin paper.”\n\nBaio says that the document has been found by multiple friends, and Blockworks confirmed independently that it does indeed exist in the location he specifies.\n\nApple’s relationship with the crypto and blockchain industry is checkered, following the tech giant allowing NFTs to be bought and sold via applications listed on its App Store in the latter half of last year.\n\nThe move was designed to enable app developers to sell NFTs in-app and new apps to install tokens within them, albeit with a catch.\n\nIn a bid to capture some of the fervor (and monetary gains) surrounding the nascent tech, Apple decided to take a 30% cut from App developers generating more than $1 million via its store, and 15% for those making less.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vbWFzaGFibGUuY29tL2FydGljbGUvYXBwbGUtbWFjb3MtYml0Y29pbi13aGl0ZXBhcGVyLWhpZGRlbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple's macOS has a hidden Bitcoin easter egg - Mashable",
        "content": "A copy of the Bitcoin whitepaper, a seminal document authored by pseudonymous author Satoshi Nakamoto, can be found in every copy of Apple's macOS since Mojave.\n\nThe file, unearthed by Waxy, isn't exactly hidden, though it's not very easy to be found unless you know exactly where to look for. To see it, open the Terminal app and paste the following string into it: \"open /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\"\n\nAnother way to see it is to open Finder, click on Macintosh HD at the bottom of the window, then System - Library - Image Capture - Devices. There, right click on VirtualScanner.app and choose \"Show Package Contents.\" Open Resources, and click on \"simpledoc.pdf.\"\n\nIt's there all right. Credit: Stan Schroeder/Mashable/Apple/Satoshi Nakamoto\n\nThe \"simpledoc.pdf\" is a PDF document containing the nine-page Bitcoin whitepaper in its entirety. It appears to have been put there as one of several sample documents, including another PDF called \"numbers.pdf,\" containing only four numbers in very large typeface, as well as a mysterious image called \"cover.jpg,\" which is a photo that appears to have been taken on Treasure Island in San Francisco.\n\nThis image can be found in the same folder as Satoshi's Bitcoin whitepaper. Credit: Stan Schroeder/Mashable/Apple\n\nThe discovery of the image and the Bitcoin whitepaper isn't entirely new; designer Joshua Dickens found them in 2020, though it didn't gain much traction online at the time.\n\nI found the files on my Mac which runs the latest version of macOS Ventura, 13.2.1, and one of my colleagues at Mashable found it on their Mac, running Big Sur 11.7, as well. The files appear to be there in every copy of macOS since Mojave (10.14.0), which was launched in 2018.\n\nIt's unclear why Apple would deliberately choose to include the Bitcoin whitepaper in macOS. The document, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" was originally published by Nakamoto in 2008 and contains a technical overview of the Bitcoin protocol. Apple has never, to my knowledge, publicly endorsed Bitcoin or any other cryptocurrency; in fact, the company has been fairly reserved when it comes to crypto (unlike, say, Samsung, which includes a cryptocurrency wallet software on its Galaxy phones). CEO Tim Cook did say in 2021 that crypto is something the company is \"looking at,\" though he did also say Apple had nothing crypto-related to announce at the time.\n\nFeatured Video For You The solution to bitcoin's massive carbon footprint could be...volcanoes? — Future Blink\n\nA likely explanation is that an Apple engineer tasked with coming up with some sample documents chose the Bitcoin whitepaper and the mysterious image just for fun, though we're sure the internet will quickly come up with conspiracy theories of all sorts in a minute."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNC8wNS91cy1iaXRjb2luLWNvcnAtZXhwZWN0ZWQtdG8tc2V0dGxlLXdpdGgtY2l0eS10by1yZXN1bWUtbWluaW5nLWluLW5pYWdhcmEtZmFsbHMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA0LzA1L3VzLWJpdGNvaW4tY29ycC1leHBlY3RlZC10by1zZXR0bGUtd2l0aC1jaXR5LXRvLXJlc3VtZS1taW5pbmctaW4tbmlhZ2FyYS1mYWxscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "U.S. Bitcoin Corp. Settles With Niagara Falls City to Resume Bitcoin Mining - CoinDesk",
        "content": "A health worker at a rehab clinic less than a third of a mile from the site told CoinDesk that the noise it wasn't really an issue, except for once when they were doing counselling sessions outdoors. Another resident in the immediate vicinity said that at times it is annoying, but most of the time \"it is not that bad.\""
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmV3Zy5vcmcvYXJlYXMtZm9jdXMva2V5LWlzc3Vlcy9jaGFuZ2UtY29kZS1ub3QtY2xpbWF0ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Change the Code, Not the Climate - Environmental Working Group",
        "content": "Imagine a digital asset that requires so much energy it needs to bring dirty fossil fuel power plants back online, never mind the harm to nearby communities with air, water and noise pollution.\n\nThat’s often the cost of successfully “mining” bitcoin. The backing of one of the country’s largest U.S. mutual fund companies definitely helps.\n\nBitcoin, the top cryptocurrency by market cap, has been bolstered by Fidelity Investments, despite its acknowledged impact on the climate. Bitcoin uses a highly energy-intensive process known as “proof of work” to validate transactions and generate cryptocurrency.\n\nIn the U.S., bitcoin causes as much climate pollution as that caused by burning the diesel fuel used by our railroads. It already uses as much electricity as all our home computers or residential lighting.\n\nElectricity demand by comparable sectors hasn’t increased the same way and, in some cases, has even declined.\n\nImage\n\nFidelity began mining bitcoin as early as 2014. The company offers its clients the opportunity to focus their accounts on environmental, social and governance principles, which can include deliberately avoiding investments in companies or funds that harm the environment.\n\nBitcoin mining that’s hooked up to a majority-coal-powered grid, as it is in Kentucky, or generated by the revival of a once-shuttered coal-fired power plant turned natural gas – and others like these that flout the demands of addressing the climate crisis – do not qualify as “clean” or “environmentally friendly” investments.\n\nThose labels are misguided – clear examples of industry greenwashing.\n\nThat’s why we’re calling on Fidelity to end its support for dirty investments in proof of work bitcoin, which only contributes to the climate crisis.\n\nThis change would bring much-needed relief for communities in states across the country that have suffered some type of blight because of the arrival of bitcoin mining operations.\n\nAs we chronicle in an upcoming exclusive series, bitcoin mining has harmed communities across the U.S., including in Montana, Kentucky, New York and Georgia. These operations have made life miserable for its closest neighbors.\n\nThe environmental and health effects of these cryptocurrency mining operations may differ. But the effects have in common is the fact that harm to local communities is preventable.\n\nImage\n\nThe enterprising bitcoin community must acknowledge the negative impact of their proof of work process and commit to developing a much more efficient process, such as the “proof of stake” concept that the second-largest cryptocurrency, ethereum, recently switched to using.\n\nChanging the code is possible, but it takes the will of a community to make changes that will help real people.\n\nBitcoin and the proof of work process were innovations. The industry has already shown its ingenuity and ability to evolve. And that’s what’s needed now.\n\nThat’s why we’re urging support for two ways to bring about needed change:"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZXMtaGlkZGVuLWJpdGNvaW4td2hpdGUtcGFwZXItMTczMTQ3MDk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple's Hidden Bitcoin White Paper the Latest in a Long List of Easter Eggs - Yahoo Finance",
        "content": "The Bitcoin white paper has been hiding in plain sight on Apple computers.\n\nBlogger Andy Baio recently revealed that an innocuous file, \"simpledoc.pdf,\" included as part of Apple operating system MacOS, contains a copy of the foundational text of Bitcoin, written by pseudonymous founder Satoshi Nakamoto in 2008.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto’s Bitcoin white paper apparently shipped with every copy of macOS since Mojave in 2018.\" Baio wrote on his Waxy blog, \"I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them.\"\n\nAlthough Baio uncovered the mysterious easter egg on Satoshi Nakamoto's purported 48th birthday, April 5th, 2023, it’s not the first time it’s been sighted. Twitter user Joshua Dickens, a former Apple product designer, first discovered the white paper lurking in MacOS in 2020, but his tweet did not gain much traction.\n\nWeirdly, there's also a PDF of the original Bitcoin white paper: pic.twitter.com/JjPnI4fyzc — Josh D (@schwa23) November 28, 2020\n\nHow to find the Bitcoin white paper on Apple computers\n\nThe Bitcoin white paper can be found on Apple computers running macOS Mojave or later, by entering the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAlternatively, using Finder, navigate to the Macintosh HD -> System -> Library -> Image Capture -> Devices, and open the Contents -> Resources folder, where you’ll find the file “simpledoc.pdf.”\n\nThe white paper appears to be used as a sample document for the image capture device Virtual Scanner II, with Apple site MacRumors suggesting that it could be a sample document for a system for transferring photos from iOS devices to Macs.\n\nStory continues\n\nIn his 2020 Twitter thread, Dickens highlighted another peculiar file, named cover.jpg, in the same folder. This has been confirmed to be a photograph taken by Thomas Hawk named Warning Alarm System, taken on Treasure Island in San Francisco in 2008.\n\nIn 2021, a thread was made on the Apple forum to discuss these findings but, again, gained very little traction. One user even commented, \"I find it hard to believe anyone cares.\"\n\nHow did the Bitcoin white paper end up on Apple computers?\n\nThe Bitcoin white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" sets out the thesis for a decentralized cash based on a public ledger, essentially birthing Bitcoin and cryptocurrency in turn.\n\nIt is unclear why or how the Bitcoin white paper ended up on Apple systems. The company has a long history of including easter eggs in its products, however, including references to “Star Wars” and “Lord of the Rings.\" Earlier versions of the Macintosh operating system had hidden, playable versions of Tetris, Pong, and snake, and its MacOS and mobile application icons have always featured hidden messages or meanings.\n\nThe Bitcoin white paper appears to be the first crypto-related easter egg that has been found buried in Apple software.\n\nBaio himself speculated that the white paper could have been included as an in-joke by a “secret Bitcoin maxi” working at Apple, or simply included as a “convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nEx-App Store Director: 'Apple Had a Problem With Crypto From Day One'\n\nIts inclusion on Apple computers is particularly surprising given that the company’s former App Store director Philip Shoemaker has claimed that the company “had a problem with crypto from day one.” Speaking earlier this year, Shoemaker told Decrypt that Apple leadership considered cryptocurrency to be “a Ponzi scheme” and had maintained an arbitrarily harsh stance against crypto and NFTs.\n\nApple's insistence on imposing its 30% App Store fee on crypto apps prompted many developers to protest its policy, with some calling for a boycott of iOS.\n\nApple CEO Tim Cook Says He Holds Crypto\n\nIn a 2021 interview, Apple CEO Tim Cook said that he owns some crypto, but that the company had no plans to invest in it as an asset class. “I think it’s reasonable to own it as part of a diversified portfolio,” Cook said.\n\nDecrypt has reached out to Apple for comment and will update this article should we receive a response."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDQvMDYvbWFnaWMtZWRlbi1yb2xscy1vdXQtYml0Y29pbi1vcmRpbmFscy1uZnQtY3JlYXRvci1sYXVuY2hwYWQv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3dlYjMvMjAyMy8wNC8wNi9tYWdpYy1lZGVuLXJvbGxzLW91dC1iaXRjb2luLW9yZGluYWxzLW5mdC1jcmVhdG9yLWxhdW5jaHBhZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Rolls Out Bitcoin Ordinals NFT Creator Launchpad - CoinDesk",
        "content": "\"We're on the ground level listening to what is needed from all of these subgroups of the Ordinals community, and we will look to deliver on those needs,\" said Head of Marketing at Magic Eden, Tiffany Huang. \"We think involvement of our expertise and resources is much needed to continue the growth of Ordinals and encourage a flourishing ecosystem.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzA1L21pY3Jvc3RyYXRlZ3ktYnV5cy1hbm90aGVyLTEwNDUtYml0Y29pbi1mb3ItMjM5bS_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8wNS9taWNyb3N0cmF0ZWd5LWJ1eXMtYW5vdGhlci0xMDQ1LWJpdGNvaW4tZm9yLTIzOW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "MicroStrategy Buys Another 1,045 Bitcoin for $23.9M - CoinDesk",
        "content": "On March 27, MicroStrategy disclosed the purchase of 6,455 bitcoin for $161 million in the previous five weeks. At that time, the company also said it paid off what was left of its $205 million loan from failed Silvergate Bank."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDUvYml0Y29pbnMtc3BvdC10by1kZXJpdmF0aXZlcy10cmFkaW5nLXZvbHVtZS1zbGlkZXMtdG8tbG93ZXN0LXNpbmNlLW1heS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzA1L2JpdGNvaW5zLXNwb3QtdG8tZGVyaXZhdGl2ZXMtdHJhZGluZy12b2x1bWUtc2xpZGVzLXRvLWxvd2VzdC1zaW5jZS1tYXkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Spot-to-Derivatives Trading Volume Ratio Slides to Lowest in 11 Months - CoinDesk",
        "content": "\"As the on-ramp from fiat into crypto has become materially more difficult with the likes of Silvergate and Signature Bank being taken over by the regulators. This would suggest that the amount of liquidity has remained the same within crypto but has been allocated to higher leverage products,\" Thielen added. [Silvergate Bank was closed. Signature and Silicon Valley Banks were taken over by regulators.]"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzVlMDZlMjdiLWE0NWQtNDM1Yy04OTdiLTNjOGUwZTFkMmI2ZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "El Salvador hasn't defaulted. Don't thank Bitcoin - Financial Times",
        "content": "Print this page\n\nDid a bitcoin per day keep default away? So El Salvador’s crypto-touting Presidente would have us believe.\n\nSince January, the country has led Citi’s emerging market sovereign bond index as the top outperformer year to date, with returns of 22.2 per cent.\n\nAnd in late January, Nayib Bukele announced (over Twitter, of course) that his country had dodged default. With help from the Central American Bank for Economic Integration (CABEI) and the Development Bank of Latin America (CAF), El Salvador repaid in full an $800mn bond which was set to mature a week later.\n\nThroughout his presidency, Bukele has spooked investors and conventional financiers like the IMF. The prices of its bonds began to tumble in mid 2021, after Bukele did normal dictator-like things, like firing judges and brutal crackdowns. Worse still was Bukele’s face plant into cryptomania. After embracing Bitcoin and buying up plenty (2,381 as of last November), the cryptocurrency selfishly collapsed.\n\nRating agency Fitch said a “default of some sort” was probable downgrading the country’s debt into junk territory. Moody’s did the same. At their nadir in July 2022, El Salvadoran bonds maturing in 2025 and 2027 traded at 26.38 and 25.13 cents on the dollar respectively.\n\nBut times have changed. In February, Moody’s changed its outlook from negative to stable, citing a “decreased risk of a credit event in the near term” and “manageable” repayments on the 2025 bond. Its 2025 and 2027 debts are now trading at 78.39 and 55.92 cents on the dollar.\n\nSo, ¿que pasa?\n\nSaviour complex\n\nAéter settling the bond, Bukele turned his wrath on the media. “[A]lmost every legacy international news outlet said that because of our “#Bitcoin bet”, El Salvador was going to default on its debt by January 2023,” he lamented, claiming there were “[l]iterally, hundreds of articles” that did so (while apparently struggling to find very many of them).\n\nIn the past year, almost every legacy international news outlet said that because of our “#Bitcoin bet”, El Salvador was going to default on its debt by January 2023 (since we had an 800 million dollar bond maturing today).\n\n\n\nLiterally, hundreds of articles https://t.co/rEiK7K13U4 — Nayib Bukele (@nayibbukele) January 24, 2023\n\nBukele has connected his making Bitcoin legal tender in September 2021 with the country’s improved economic fortunes, saying it gave El Salvador an “advantage in the new economic system” and spurred private investment from “people escaping censorship.”\n\nBut was it really Bitcoin that helped El Salvador dodge default? Perhaps the truth is much more mundane.\n\nEl Salvador regained many investors’ graces in July 2022, after announcing a $1.6bn bond buyback using special drawing rights from the IMF and a $200mn loan from the Central American Bank for Economic Integration. Buybacks in September and December reduced the principal for the 2025 bond to $348mn from $800mn.\n\n“The buybacks to some extent fixed their communication issues. They changed from catering to the crypto community back to catering to traditional investors,” says Esteban Tamayo, a Citi economist covering the region.\n\nThe country is even earning something of a reputation for financial prudence.\n\n“When you dig in, while El Salvador has its share of difficulties, the amount of debt is manageable and the budget is under control,” says Aaron Stern, chief investment officer and managing partner at Converium Capital.\n\nAccording to Fitch, the government’s fiscal deficit was 2.7 per cent of GDP in 2022, down from 5.7 per cent in 2021 and 10.1 per cent in 2020 - driven by the post-pandemic economic rebound, subsidy cuts and enhanced tax collection.\n\n“There was a windfall of revenues in 2022, because there was better compliance on income tax collection. If you’re in a somewhat autocratic country, you’re going to be motivated to pay your income taxes,” says Siobhan Morden, managing director Latin America fixed income strategy at Santander Investment Securities.\n\nPublic debt has also decreased to 78 per cent of GDP, down from 82.4 per cent in 2021.\n\nThe IMF says the economy is bound for moderate real GDP growth in 2023, 1.7 per cent, after expanding by 2.8 per cent the previous year. This is in line with its peers in Latin America and the Caribbean, but below its peers in the emerging and developing economies bracket.\n\nWhile Bukele’s anti-crime initiatives have not endeared him to human rights advocates, the “unprecedented reduction in crime” has contributed to robust economic and investment activity, says the IMF. Bukele asked congress to agree to a state of emergency last March, giving him the power to go after the notorious Barrio 18 and MS-13 gangs. However, he is accused of sweeping up and disappearing innocents as well as gang operatives. Less crime means there’s plenty to like for investors, as well as tourist fans of Bitcoin, surfing, and the Miss Universe pageant. Less so for critics of arbitrary detentions and cattle pen prisons.\n\nMeanwhile investors are heartened that the government has some additional levers to pull. In December the government passed a pension system reform bill which imposed a cap of $3,000 per month and gave it the ability to tap into private pension savings as a source of income. While dipping into pension pots would be a bold move for even a popular President, investors are somewhat assured that the option is open.\n\n“There is still budget flexibility… fiscal adjustment could occur under the inertia and spending constraints of dollarisation since you cannot spend what you cannot borrow, ” Santander said in a note.\n\nEl Salvage-ador\n\nIt also looks like Bukele’s bitcoin dalliance hasn’t sunk the ship — for now. Partially, this is because it has bombed. In the concluding statement of its January mission, the IMF said that the “risks have not materialised due to the limited Bitcoin use so far,” — according to the University of Chicago, less than 20 per cent of businesses accept it alongside the greenback. The mooted volcano bonds, meanwhile, are going out with a whimper — “our view is that traditional investors won’t participate – making it less likely that they will try to issue it,” said Tamayo. The experiment flopping has proven a help rather than a hindrance.\n\nBut whether the world’s most online dictator can keep the wheels on is a different question. The current account deficit rose to 8 per cent of GDP in 2022, due to skyrocketing import volumes, with international reserves falling to around two months of imports.\n\n“They’ve been smashing up their reserves, which is never a good plan,” says Stephen Bailey-Smith, a portfolio manager at Global Evolution. “For me they need to further tighten up monetarily, at least in order to maintain the spread with the Federal Reserve funds rate to stem import demand and prevent locals taking money offshore”.\n\nThe same pension reform which gave the government dipping rights also increased entitlements by 30 per cent, likely creating larger liabilities for El Salvador’s treasury.\n\nThe country’s domestic debt stock, 8.75 per cent of GDP, is high too, due to high spending and tax revenue hits during Covid-19. It still has nine international dollar bonds worth $6.4bn, roughly 30 per cent of its gross domestic product.\n\nAccess to international capital markets is a further issue, with Moody’s saying the 2025 bond payments are achievable “so long as multilateral disbursements remain around programmed levels.” An IMF deal also looks elusive.\n\n“If you have a high debt stock you’re not going to be able to reduce that overnight, you have to generate a primary fiscal surplus for several years to work that down,” says Siobhan Morden from Santander Investment Securities.\n\n“The problem that El Salvador has is that there are very limited financing alternatives, they’ve saturated their local markets and they do not get a lot of access to multilateral money, because they do not have an IMF program.”\n\nAnd with an election coming up, investors are fretting about whether Bukele can keep the purse strings tight.\n\n“He’s held expenditure quite flat, which is really encouraging. But can he continue to do that, in the year before the [February 2024] election?” asks Bailey-Smith.\n\nWhile it was Bukele’s crypto capers that captured headlines, his real priorities seem much more pedestrian.\n\nFurther reading\n\nEl Bagholder strikes again"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDUvbWljaGFlbC1zYXlsb3JzLW1pY3Jvc3RyYXRlZ3ktYnV5cy0yOS0zLW1pbGxpb24taW4tYml0Y29pbi13aXRoLXByaWNlLW5lYXItMjgwMDAv0gF7aHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wNC8wNS9taWNoYWVsLXNheWxvcnMtbWljcm9zdHJhdGVneS1idXlzLTI5LTMtbWlsbGlvbi1pbi1iaXRjb2luLXdpdGgtcHJpY2UtbmVhci0yODAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Michael Saylor’s MicroStrategy buys $29.3 million in Bitcoin with price near $28,000 - Fortune",
        "content": "The business software company founded by Bitcoin devotee Michael Saylor disclosed in a Wednesday filing with the Securities and Exchange Commission that it had purchased 1,045 Bitcoin for about $29.3 million in cash—an average price of around $28,016.\n\nMicroStrategy’s recent purchase puts the company’s total Bitcoin holdings at about 140,000, worth about $4 billion and bought at an average price of $29,803, according to a Wednesday tweet by Saylor.\n\nMicroStrategy has acquired an additional 1,045 #bitcoin for ~ $29.3M at an average price of $28,016 per bitcoin. As of 4/4/2023 @MicroStrategy holds 140,000 bitcoin acquired for ~$4.17 billion at an average price of $29,803 per bitcoin. $MSTR https://t.co/IBufTxalnv — Michael Saylor⚡️ (@saylor) April 5, 2023\n\nCrypto Twitter, especially Bitcoin fans, immediately jumped to congratulate Saylor and MicroStrategy, both of which have been longtime HODLers of the cryptocurrency.\n\nMicrostrategy now owns 0.666% of all #bitcoin that will ever exist. Beast mode by @saylor — Bitcoin for Freedom (@BTC_for_Freedom) April 5, 2023\n\nIn December, the company sold off Bitcoin for the first time—704 at an average price of $16,776, collecting $11.8 million—according to an SEC filing.\n\nThe period in which MicroStrategy made the multimillion-dollar purchase (March 24 to April 4) overlapped with a massive sale by the U.S. government, which offloaded $215 million in Bitcoin seized from an alleged hacker in a case centered around the Silk Road online black market.\n\nUS gov sells, MicroStrategy buys pic.twitter.com/MMIz1y2Oxp — SIDNΞY SWIFT 🧬 (@sidneyswift) April 5, 2023\n\nDefendant James Zhong was accused of, and later pleaded guilty to, wire fraud for illegally obtaining 50,000 Bitcoin from the Silk Road marketplace. The government seized the digital assets, and even after last week’s selloff still has just over 41,000 remaining—worth more than $1 billion as of Wednesday.\n\nBitcoin has been on a tear since the start of the year, skyrocketing 73% in the first three months of 2023, its best quarter in two years, according to CoinDesk.\n\nThe world’s most popular cryptocurrency outperformed three major indexes—the S&P 500, the Dow Jones Industrial Average, and the Nasdaq—in the first quarter, as some analysts said it regained its edge as a store of value similar to gold’s.\n\nBitcoin was trading just below $28,000 on Wednesday, down half a percent over the past 24 hours, according to CoinMarketCap."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzA2L2JpdGNvaW5zLXRpZ2h0LWNvcnJlbGF0aW9uLXdpdGgtbmFzZGFxLXRvLXNwLTUwMC1yYXRpby1tdWRkaWVzLXRoZS1zYWZlLWhhdmVuLW5hcnJhdGl2ZS_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8wNi9iaXRjb2lucy10aWdodC1jb3JyZWxhdGlvbi13aXRoLW5hc2RhcS10by1zcC01MDAtcmF0aW8tbXVkZGllcy10aGUtc2FmZS1oYXZlbi1uYXJyYXRpdmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Tight Correlation With Nasdaq-SPX Ratio Muddies Safe-Haven Narrative - CoinDesk",
        "content": "\"BTC is still (and always will be) a risk asset for traditional investors. It is also likely to be regarded as a safe haven,\" Acheson said. \"We are likely to see continued accumulation from longer-term investors interested in its currency debasement hedge properties, while short-term moves are dictated by shifting theories about what monetary liquidity will do.\""
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NvdWxkLXN0ZXZlLWpvYnMtYmUtYmVoaW5kLWJpdGNvaW4tc2F0b3NoaS1uYWthbW90by1teXN0ZXJ5LWRlZXBlbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "The Bitcoin Whitepaper may still be secretly stored on your computer - CryptoSlate",
        "content": "The Bitcoin whitepaper was found as a hidden file on Mac computers in 2020, and today rumors have been refueled as the whitepaper is confirmed to still be present on the current Mac OS, sparking speculation that Steve Jobs is Satoshi Nakamoto.\n\nMultiple people have posted to confirm this finding, including the Twitter account Documenting Bitcoin – which showed a video demonstrating the file path to accessing the whitepaper.\n\n“/System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf“\n\nDocumenting Bitcoin added that the file is available on every Mac running Catalina or newer operating systems.\n\nCatalina launched in October 2019, bringing additional new features, including updated security and iPad as a second screen functionality.\n\nIs Steve Jobs the creator of Bitcoin?\n\nThe identity of Satoshi Nakamoto remains clouded in mystery to this day.\n\nThe issue is all the more puzzling, considering the reported 750,000 to 1.1 million Bitcoin fortune that Nakamoto controls remains untouched.\n\nOver the years, the Bitcoin community has put forward several names as likely candidates, including Hal Finney, who was extensively involved in its development before his death. And Nick Szabo, having published a paper on “Bit gold” in 1998 – more than a decade before Bitcoin – which detailed a decentralized, proof-of-work virtual currency.\n\nGiven Jobs’ hand in bringing personal computers to the mass market, the late Apple co-founder has also been linked as the BTC creator – albeit less likely- as he is considered a visionary and business magnate rather than a coder and cryptographer.\n\nSpeculators say Nakamoto is possibly a group of individuals, with one or all having ties to Japan in some capacity, such as living there at some point.\n\nWhat happened to Satoshi?\n\nNakamoto’s last public contact occurred as a post on the bitcointalk.org forum on Dec. 12, 2010.\n\nThe message stated that work was being done to counter Denial of Service attacks. It gave no indication of stepping back from the project. To date, no further communication has been received from that account.\n\n“There’s more work to do on DoS, but I’m doing a quick build of what I have so far in case it’s needed, before venturing into more complex ideas. The build for this is version 0.3.19.”\n\nIn November 2021 (at the market top,) Apple’s current CEO Tim Cook expressed support for holding Bitcoin or Ethereum as part of a diversified portfolio. While he acknowledged a personal interest in cryptocurrency, Cook denied any plans for collaboration or partnership between Apple and the crypto industry.\n\nSteve Jobs died of pancreatic cancer on Oct. 5, 2011."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA1L2NyeXB0by1hZnJpY2EtZm9jdXNlZC1iaXRjb2luLW1hcmtldHBsYWNlLXBheGZ1bC1zdXNwZW5kcy1vcGVyYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Crypto: Bitcoin Trading Platform Paxful Suspends Operations - Bloomberg",
        "content": "Paxful, an Africa-focused Bitcoin trading platform, is indefinitely suspending its operations, the company’s co-founder, Ray Youssef, said in a statement, citing a staffing crisis and growing regulatory challenges.\n\nCustomers will be able to retrieve their funds from the Paxful wallet, he said. The peer-to-peer Bitcoin platform, whose trading volumes were more than $4 billion since launching in 2015, was popular with users in countries including Nigeria and Ghana."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LnBvcHNjaS5jb20vdGVjaG5vbG9neS9iaXRjb2luLXdoaXRlLXBhcGVyLW1hY29zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin white paper hidden in macOS - Popular Science",
        "content": "The copy of the original white paper explaining Bitcoin’s technological, philosophical, and economic underpinnings has been available online since its publication in 2008—but for some reason, a file version is potentially also buried in every Apple product running MacOS. First spotted by the blogger Andy Baio, a simple copy-paste of the following commands entered into Terminal will reveal the cryptocurrency explainer tucked away within macOS systems folders:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nPopSci can also confirm the PDF’s existence on Ventura 13.2.1 after testing out the prompt. As Ars Technica noted on Thursday, the PDF is included within a system app called VirtualScanner.app, which is “almost certainly” related to the “import from iPhone” Continuity Camera feature first rolled out with Mojave.\n\n[Related: A beginner’s guide to how cryptocurrencies work.]\n\nPenned under the pseudonym Satoshi Nakamoto, the Bitcoin white paper’s author (or authors) have never been confirmed, but their impact on global economics has been felt ever since. Designed to be a decentralized alternative form of digital currency, Bitcoin relies on transactions recorded within a globally shared blockchain ledger, and is “mined” over time via users’ computers. As PopSci explained in 2016:\n\n“Every 10 minutes, new Bitcoin enter the system. ‘Miners’ donate spare or dedicated processing power to help validate transactions around the globe. Bitcoin come as rewards for that work. In the early days, you could just do this with a PC. Now the process is complex and requires powerful hardware.”\n\nWhile many Bitcoin and general cryptocurrency enthusiasts abound, critics often point to the monetary system’s extreme volatility. The value of single Bitcoin reached an all-time high of $68,789 on November 10, 2021. Barely a month later, its value sank to $46,164. As of writing, one Bitcoin is worth roughly $28,000.\n\nAccording to his post on Wednesday, Baio accidentally came across the PDF Easter egg while attempting to fix their printer. After double checking with over a dozen Mac-using friends, Baio confirmed the file could be located in every version of macOS they had, stretching all the way back to 2018’s Mojave (10.14.0) update. Any Mac featuring High Sierra or earlier, however, appears to be sans “Satoshi.”\n\nAs to why Nakamoto’s white paper is buried within macOS, it’s anyone’s guess. “ Is there a secret Bitcoin maxi working at Apple?” asks Baio, before surmising, “Maybe it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.”\n\nIn any case, Baio reveals a “little bird” informed him someone internally flagged the issue almost a year ago, which was subsequently assigned to the same engineer who embedded the whitepaper PDF. Clearly, nothing has happened to it since then, although that could very well change if enough people make a fuss about it.\n\nPopSci has reached out to Apple for comment, and will update accordingly."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9iaXRjb2luLW1pbmVycy1tYWtpbmctY3JpdGljYWwtZW5lcmd5LW1vdmVzL9IBWWh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1taW5lcnMtbWFraW5nLWNyaXRpY2FsLWVuZXJneS1tb3Zlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Making Critical Energy Moves - ETF Trends",
        "content": "Bitcoin mining is a notoriously energy-intensive endeavor. As a result, pro-renewable energy politicians and regulators frequently criticize bitcoin miners for their heavy carbon footprints.\n\nRecent data from the University of Cambridge’s Bitcoin Electricity Consumption Index indicates the power consumed to mine blocks recently hit an all-time high. Perhaps that’s a symptom of the cryptocurrency’s 2023 rebound, but the point is that miners need to reduce their carbon footprints and increase consumption of green energy.\n\nSome are already doing that, and if the industry proves it’s making material progress on reducing its dependence on fossil fuels, exchange traded funds such as the Invesco Alerian Galaxy Crypto Economy ETF (SATO) could benefit.\n\nSATO, which turns two years old in October, holds 37 stocks — a slew of which are classified as crypto miners. Already under siege from policymakers to reduce emissions and embrace renewables, bitcoin miners, including SATO components, don’t need to be compelled to go green. After all, some experts believe high energy costs were part of the problem for the sector last year.\n\n“Miners aren’t out of the woods just yet. Inflated power costs will remain a stubborn thorn in the industry’s side, and could quickly worsen if governments succeed in saddling miners with an added energy tax,” according to a recent report from Coin Metrics. “Even with the latest rally in Bitcoin price, daily revenue for the S19 has barely cracked $7, making every penny count. Without a sustained uptrend, mining margins may soon revisit the cold depths of winter 2022, when the average S19 briefly operated at a loss of more than $1.22 per day.”\n\nThe good news for some SATO member firms is data, as measured by bitcoin mining emissions intensity, indicates miners are making strong headway on reducing carbon emissions.\n\nAs Beincrypto.com reports, venture capitalist Daniel Batten recently noted bitcoin mining’s dependence on fossil fuels has declined by more than 6% a year since the start of 2020.\n\n“As reported by BeInCrypto in late March, Bitcoin mining is now greener than electric vehicle technology. Hydroelectric energy is Bitcoin’s major power source, according to Batten,” reported the publication. “According to Cambridge University, the BTC network currently consumes around 140 TWh per year. However, this is still less than the 206 TWh per year lost in the U.S. due to transmission and distribution.”\n\nSATO components have good reason to trim emissions in an effort to placate regulators, but there’s more benefit in that strategy. By delivering from fossil fuels, miners can potentially lower costs, boost profits and support sustainability credentials.\n\nFor more news, information, and analysis, visit the Crypto Channel .\n\nThe opinions and forecasts expressed herein are solely those of Tom Lydon, and may not actually come to pass. Information on this site should not be used or construed as an offer to sell, a solicitation of an offer to buy, or a recommendation for any product."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmxlZGdlci5jb20vYmxvZy9idWlsZGluZy1hLWJlc3QtaW4tY2xhc3MtaGFyZHdhcmUtYml0Y29pbi1tdWx0aXNpZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Building A Best-In-Class Hardware Wallet For Bitcoin Multisig - Ledger",
        "content": "\n\nThings to know:\n\n\n\n– Since the launch of the Ledger Bitcoin 2.0.0 app, and with various improvements over the past year, one of our core missions has been to improve the security and user experience for multisig wallets.\n\n\n\n– By enabling multisig wallets to be easily and fully verified on the device, Ledger now represents the best-in-class hardware wallet for securing bitcoin in multisig cold storage.\n\n\n\n– All of the new Ledger multisig functionality is available for use with Unchained and certain open-source applications such as Caravan for all Ledger models.\n\n\n\nWhat Is Multisig?\n\nIn a typical single-signature bitcoin wallet, your Ledger secures the only key needed to spend your bitcoin. This makes it easy to transfer your bitcoin around whenever you’d like, but it also means that there is a single point of failure in your bitcoin security. If someone finds your recovery phrase or gains access to your Ledger and somehow learns your PIN, they have everything they need to be able to spend your bitcoin.\n\nIn a multisig bitcoin wallet, multiple keys are used to create the bitcoin wallet, and multiple keys must be used to spend the bitcoin. The most common type of multisig wallet is created from three keys, and two out of three keys must be used to spend the bitcoin. It makes managing your security more complicated, but the trade-off is a significant improvement in security — even if someone gains access to one seed phrase or compromises one of your hardware wallets, they do not have the ability to spend your bitcoin.\n\nWhy multisig wallet is hard\n\nHistorically, hardware wallets across the industry have been optimized for single-signature custody. But as bitcoin matures, multisig is emerging as an increasingly popular option for both individuals and businesses to secure bitcoin for the long term. Unfortunately, hardware wallets generally haven’t kept up, with many continuing to provide multisig users with clunky user experiences and lower levels of on-device transaction verification.\n\nThere are three main challenges with designing a hardware wallet for multisig:\n\nAddress manipulation: During the creation and signing of a multisig wallet, a malicious attacker could try to sneak in additional keys so that they have a majority control of the bitcoin, or try to send transaction change to a very obscure address that is technically part of the multisig wallet but is far removed from standard addresses and is unrecoverable without paying a ransom. Address verification: If all the public key data for the multisig wallet is not registered on the hardware wallet, verifying that you are sending change to the right address is a manual process requiring you to verify the change address on your device or through reconstructing your wallet elsewhere. Not registering the multisig wallet is also a problem when depositing to your multisig wallet. If you can’t verify on your device that you are sending bitcoin to your multisig wallet, you are trusting that your internet-connected computer is not trying to trick you into sending it to an attacker’s address. Information leak: If the multisig wallet is stored on the hardware wallet, it means that an attacker that gains access to your PIN or coerces you to unlock your hardware wallet can now immediately see that the hardware wallet is part of a multisig wallet, which reveals more information about your security set-up than is necessary. Lack of account segregation: If you use the same device/seed to take part in different multisig wallets, it is no longer enough to know that you are spending from one of the wallets you are part of: you also want to know from which of them you’re spending from. The hardware wallet should check that for you.\n\nFinally, one of the biggest challenges is that of minimizing the UX impact: if using multisig wallets is too complicated or cumbersome, users are likely to skip or sloppily apply the necessary security measures. For the majority of users, multisig is only secure if it’s easy!\n\nLedger to the rescue\n\nPreviously, the Ledger bitcoin application could be used for multisig wallets, but it was unable to register all of the keys that were used to build the multisig wallet, and as a result, could not verify with absolute certainty that it was signing for the right multisig wallet and verify that the change was going back to the right place. After our recent update, the Ledger is now the premier multisig hardware wallet by leveraging all of the most recent software advancements in bitcoin.\n\nWe worked closely with Unchained to validate and improve our approach to multisig, in an open-source collaboration. Unchained works day-in-day-out helping thousands of bitcoiners upgrade their bitcoin security with multisig, so they were the perfect partners to help us build the best multisig support possible.\n\nFrom registering your multisig vault on the Ledger device to verifying your multisig addresses and sovereign recovery with other open-source tools, the updated bitcoin application makes Ledger best-in-class for multisig.\n\nVerify everything – Trust Nothing\n\nNow to get a bit technical for those curious. To make all of this work, Ledger implemented a policy registration mechanism based on a HMAC. An HMAC, or hash-based message authentication code, is a specific type of authentication code that confirms the origins and the content of certain information.\n\nWhen a multisig (or, miniscript) wallet policy is registered on the device, and only after the user has inspected it and confirmed it with the secure screen, the device returns a unique HMAC for that policy.\n\nThis HMAC allows the device to confirm that the Ledger is one key in a known multisig wallet that was previously registered and validated on the secure screen. The beauty of using HMACs in this way is that the Ledger doesn’t need to store the entire multisig wallet on the device, which as mentioned above unnecessarily reveals that the Ledger is used in multisig configuration. The HMAC can be stored by the multisig coordination tool (such as Unchained) and is passed to the Ledger during bitcoin transaction signing.\n\nThis allows you to verify all information about a multisig transaction on the device and confirm that nothing about the multisig wallet was changed in the future, without trusting any internet-connected device. In other words, after the one-time registration procedure, you can receive from, and send to a multisig wallet controlled by your Ledger with a user experience that is very similar to the one you are used to for single signature transactions.\n\nThis new functionality is best experienced during multisig wallet setup with Unchained, where once the wallet is generated, Unchained will prompt you to register the wallet on the device. You’ll be given the opportunity to review all of the relevant information about the multisig wallet and confirm with your Ledger. This confirmation is then stored as an HMAC and is used moving forward to remedy all of the primary multisig problems mentioned above.\n\nUpgrade your multisig game now\n\nAll of the new Ledger multisig functionality is available for use with Unchained and certain open-source applications such as Caravan for all Ledger models. We hope that all multisig providers and tools will implement Ledger multisig registration and device address confirmation, improving security and usability for their users. These features are critical for the long-term security of bitcoin, and we are happy to see teams like Unchained implement the new functionality and advance the state-of-the-art of bitcoin security.\n\nRead this article for a technical deep dive."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vYXJzdGVjaG5pY2EuY29tL2dhZGdldHMvMjAyMy8wNC9iaXRjb2luLXdoaXRlcGFwZXItaXMtaGlkZGVuLWF3YXktaW4tbWFjb3NzLXN5c3RlbS1mb2xkZXJzLWZvci1zb21lLXJlYXNvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin white paper is hidden away in macOS's system folder for some reason - Ars Technica",
        "content": "If you're using a Mac and want a refresher on the basics of Bitcoin, good news—blogger Andy Baio has discovered that \"every modern copy of macOS\" has included a copy of Satoshi Nakomoto's original Bitcoin white paper, hidden away in macOS system folders and accessible with an easy Terminal command.\n\nHere's the command you can use to open it on your own Mac:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nWe've confirmed that the document exists on a fully updated Mac running Ventura 13.3, and Baio says the 184KB PDF file appears to date all the way back to 2018's Mojave (it's not present in 2017's High Sierra).\n\nThe file is included in a system app called VirtualScanner.app. This is almost certainly related to the \"import from iPhone\" Continuity Camera feature that lets you insert pictures or documents \"scanned\" with your iPhone or iPad's camera directly into a macOS app. That feature was originally introduced in Mojave, the same macOS version that added the Bitcoin white paper.\n\nAdvertisement\n\nBaio says that \"a little bird\" told him that the presence of the Bitcoin white paper was filed as an issue internally at Apple \"nearly a year ago,\" and that it was assigned to \"the same engineer who put the PDF there in the first place.\" It has apparently gone unremarked upon since then, and the white paper is still there.\n\nThe Bitcoin white paper isn't the only secret document that has been included in macOS. For years, the Pages app included a small \"apple.txt\" file with the full text of the speech from Apple's old \"here's to the crazy ones\" ad, plus former CEO Steve Jobs' 2005 Stanford commencement speech. The document no longer appears to be included in the current version of Pages.\n\nWe've contacted Apple to see if the company has anything to add. Absent a response, the easiest explanation is that the bizarre but ultimately harmless inclusion of the white paper is an Easter egg tucked away by some cryptocurrency enthusiast at Apple, and we'd expect it to vanish in a future update now that it has been noticed."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDUvYml0Y29pbi1ldGhlci1tb21lbnR1bS10cmF2ZWxpbmctZGl2ZXJnZW50LXBhdGhzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin BTC Price, Ether ETH Price Momentum Traveling Divergent Paths - CoinDesk",
        "content": "The Relative Strength Index (RSI), a technical indicator that measures price swings, suggests bitcoin’s price is stalling, while ether’s is likely to push higher in the near future. So far this week, BTC’s price has hovered around the $28,000 threshold where it’s stood most of the past three weeks, while ETH has risen above $1,900 for the first time in nine months."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN0YW1wcy1uZnRzLWdhaW5pbmctb3JkaW5hbHMtMjI1MTUzMDU4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "'Bitcoin Stamps' NFTs Are Gaining On Ordinals - Yahoo Finance",
        "content": "There’s another wave of NFTs starting to flood the Bitcoin blockchain—and they’re not in the form of Ordinals.\n\nThe emergent STAMPS (Secure Tradeable Art Maintained Securely) protocol is proposing a different method of embedding image data into the OG blockchain, making different tradeoffs compared to the inscription technology that exploded in popularity earlier this year.\n\nRather than storing image data within prunable transaction witness data, “Bitcoin Stamps” store it directly within spendable transaction outputs.\n\n“By doing so, the data is preserved in such a manner that is impossible to prune from a full node, preserving the data immutably forever,” wrote pseudonymous Stamps creator Mike In Space on the project’s GitHub page. The developer noted that he is already in discussions with Emblem and Hiro Wallet to arrange protocol integrations, the former of which will allow users to buy and sell Stamps on OpenSea.\n\nMagic Eden’s New Bitcoin NFT Marketplace Dominates Ordinals Market\n\nAs Ordinals growth surged in early February, proponents argued that they were superior to NFTs on other platforms because they store image data within the Bitcoin blockchain. By contrast, Ethereum NFTs are usually just image pointers to centralized hosting services, which can be changed by anyone with control of the image URL.\n\nYet even Ordinals data can be pruned by choice by individual node runners, limiting the immutability and decentralization benefits of such NFTs. As such, Bitcoin Stamps go all the way, forcing nodes to store their image data across many different unspent transaction outputs (UTXOs).\n\nThe NFT is then broadcast across the network using Counterparty—an old protocol that ushered in Bitcoin images back in 2014 before the term “NFT” even existed.\n\n\n\n“They are good for the preservation of art forever by storing them securely on the strongest ledger ever devised by man backed by Proof of Work,” the creator told Decrypt via DM. He added that other services are already being built atop the STAMPS protocol, such as a Name Service by Rarity Garden.\n\nStory continues\n\nWith 11,000 NFTs Minted to Bitcoin, Are Bitcoin Maxis Coming Around?\n\nBut storing data across all Bitcoin nodes comes at a cost—quite literally. In fact, the protocol creator suggests using Stamps for lightweight “24x24 pixel, 8-color-depth PNG or GIF” files to make up for their implicit storage costs.\n\n“The constraints of this \"canvas\" are ideal for pixel art,” he wrote on GitHub. “In particular, the CryptoPunks use a native resolution of 24x24 pixels.”\n\nStamps also come with the benefit of being “semi-fungible”: they can be issued as “1 of 1” or “1 of many” digital assets. Trevor.btc on Twitter, host of The Ordinals Show, recognized this feature as similar to the Ethereum ERC-1155 multi-token standard, and as a reason for their remarkably fast growth.\n\nThe Stamps website shows that over 8,300 Stamps have been minted since their launch on March 7, compared to under 500 Ordinals within the same time period after their launch.\n\nThat said, the number of Ordinals on Bitcoin only continues to grow, now standing at over 910,000 inscriptions to date, according to Dune Analytics. Major brands including Bored Ape Yacht Club and Bugatti have already adopted the tech."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZGlwLXN0b2Nrcy1kcm9wLXJlY2Vzc2lvbi13b3JyaWVzL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZGlwLXN0b2Nrcy1kcm9wLXJlY2Vzc2lvbi13b3JyaWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether, Dogecoin dip; U.S. equities drop on recession concern - Forkast News",
        "content": "Bitcoin dipped below US$28,000 in Thursday morning trading in Asia as most other top 10 non-stablecoin cryptocurrencies lost steam. Ethereum edged lower, but held a weekly gain of over 5% as the blockchain’s Shanghai upgrade draws near. Dogecoin led the losers after a Tuesday surge triggered by Elon Musk switching the Twitter icon to a Shiba Inu dog. U.S. equities traded mixed on Wednesday as data showed a slowdown in the job market and services, raising worries among investors of a potential recession ahead.\n\nSee related article: MicroStrategy buys 1,045 Bitcoin, holds 140,000 BTC in total\n\nFast facts\n\nBitcoin dropped 2.47% to US$27,983 in the 24 hours to 9:00 a.m. in Hong Kong, down 1.34% for the week, according to CoinMarketCap data.\n\nThe world’s largest cryptocurrency has been fluctuating around the US$28,000 resistance level since late March. MicroStrategy, a U.S.-based business intelligence firm and the world’s largest corporate Bitcoin holder, said it acquired 1,045 Bitcoin for around US$29.3 million between March 24 and April 4, 2023, which could help investor sentiment.\n\nEthereum dipped 1.03% to US$1896 but is up 6.04% for the week. The token reached a high of US$1,937.50 on Wednesday to trade above the US$1,900 mark for the first time since August 2022. The Shanghai hardfork of the Ethereum blockchain, also known as Shapella upgrade, will come next Wednesday, and allow investors to withdraw their staked ETH for the first time.\n\nDogecoin led the losers, falling 4.66% to US$0,09127 but still made a weekly jump of 21.60%. Investors may be taking profits from the token’s surge earlier this week when Elon Musk on Monday changed the blue bird icon on the Twitter website to a Shiba Inu Japanese dog, the same image used by the meme coin. Musk has yet to say why he did it, other than to tweet out a meme.\n\nThe total crypto market capitalization dropped 0.95% in the past 24 hours to US$1.19 trillion. Total trading volume in the same period edged up 0.14% to US$43.08 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index edged down 0.12% to 4,029.45 in the 24 hours to 09:00 a.m. in Hong Kong, but gained 0.61% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast Labs data branch, CryptoSlam.\n\nNFT sales on the Ethereum blockchain rose 17.81% in the 24 hours to 09:30 a.m. in Hong Kong. This could be attributed to volume on OpenSea Pro, an NFT marketplace developed by OpenSea that targets expereinced investors and offers zero listing fees for a limited time, said Yehudah Petscher, NFT strategist at Cryptoslam.\n\nU.S. equities closed mixed on Monday. The Dow Jones Industrial Average added 0.24%, the S&P 500 dipped 0.25%, and the Nasdaq Composite Index dropped 1.07%, as investors analyzed weak economic readings on Wednesday.\n\nThe U.S. private sector saw a job slowdown, with 145,000 new jobs added in March, compared with the expected 210,000, and down from 261,000 in February. Annual pay rose 6.9% on year, down from 7.2% in the previous month, according to Automatic Data Processing Inc. The slowdown in job growth and pay was linked to weak consumer demand and the rising cost of borrowing.\n\nAnother bearish indicator for the U.S. economy released Wednesday was the services purchasing managers’ index (PMI) for March that came in at 51.2%, according to the Institute for Supply Management, also well below expectation of 54.5%. The index is a measure of market conditions, with a lower reading suggesting a contracting economy.\n\nDespite these signals, Federal Reserve Bank of Cleveland President Loretta Mester said on Wednesday interest rates may need to go higher and “hold there for some time in order to make sure inflation is on that sustainable downward path to 2%,” according to a Bloomberg report.\n\nInflation as measured by the U.S. consumer price index rose by 6% on year in February, a decline from 6.4% in the previous month, but still far from the Federal Reserve’s goal to keep annual inflation below 2%.\n\nU.S. interest rates are now between 4.75% to 5%, the highest since June 2006. Ahead of the Federal Reserve’s meeting on May 3 to make its next move on interest rates, analysts at the CME Group are expecting a 54.2% chance of no rate hike, while 45.8% expect a 25 basis-point rise, up from 41.1% on Wednesday.\n\nU.S. stock futures traded lower as of 9:00 a.m. in Hong Kong. The Dow Jones Industrial Average futures dipped 0.10%, S&P 500 futures moved down 0.17% and the Nasdaq Composite Index dropped 0.31%. Investors are waiting for more data releases this week on the U.S. job market, including the Labor Department’s initial jobless claims on Thursday and U.S. employment situation summary on Friday.\n\nSee related article: Paxful shuts Bitcoin exchange due to regulatory challenges, staff departures"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWFkZHMtYW5vdGhlci0xLTA0NS1iaXRjb2luLXRvLWl0cy1ncm93aW5nLWNyeXB0by10cmVhc3VyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "MicroStrategy adds another 1,045 Bitcoin to its growing crypto treasury - Cointelegraph",
        "content": "MicroStrategy, an American business intelligence firm, has just announced its latest acquisition of an additional 1,045 Bitcoin (BTC) for approximately $29.3 million at an average price of $28,016 per BTC. This news was announced in a tweet by MicroStrategy executive chairman Michael Saylor on April 5.\n\nMicroStrategy has acquired an additional 1,045 #bitcoin for ~ $29.3M at an average price of $28,016 per bitcoin. As of 4/4/2023 @MicroStrategy holds 140,000 bitcoin acquired for ~$4.17 billion at an average price of $29,803 per bitcoin. $MSTR https://t.co/IBufTxalnv — Michael Saylor⚡️ (@saylor) April 5, 2023\n\nAs of April 5, 2023, MicroStrategy holds a total of 140,000 BTC, which was acquired for approximately $4.17 billion at an average price of $29,803 per BTC. This news comes as a significant milestone for the company as it continues to invest in Bitcoin as a reserve asset.\n\nNumber 14 on Cointelegraph’s Top 100 in crypto, Saylor has been an outspoken advocate for Bitcoin and has been leading the charge for corporations to adopt the largest cryptocurrency as a strategic asset. Saylor has repeatedly stated that Bitcoin is the securest and most reliable store of value that exists in the market today and that it offers a unique opportunity for businesses to protect their assets from inflation.\n\nSaylor’s MicroStrategy recently repaid its Silvergate loan and bought 6,500 BTC at the end of March. The company’s Bitcoin strategy appears to be dollar-cost averaging but with vast amounts of money.\n\nRelated: Michael Saylor is still on the hook for alleged tax evasion, says MicroStrategy filing\n\nMicroStrategy made its first Bitcoin purchase in August 2020, and since then, the company has been consistently adding to its holdings. The latest purchase brings the total amount of Bitcoin owned by MicroStrategy to over $12.6 billion, which is a testament to the company’s confidence in the long-term potential of the cryptocurrency.\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZ3VpdGFyLmNvbS9uZXdzL2dlYXItbmV3cy9uYW1tLTIwMjMtbWFydGluLWxpbWl0ZWQtZWRpdGlvbi1iaXRjb2luLWd1aXRhcnMtY2VvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "NAMM 2023: Martin unveils a limited-edition bitcoin guitar and more - Guitar.com",
        "content": "When you purchase through affiliate links on Guitar.com, you may contribute to our site through commissions. Learn more.\n\nNAMM 2023: With NAMM 2023 just around the corner, Martin is once again spicing things up with the release of six swanky-looking limited edition acoustic guitars, including one designed by the brand’s CEO Thomas Ripsam.\n\nMartin CEO 10\n\nLimited to just 100 units, the CEO 10 is Ripsam’s first-ever Martin design effort. To start, the 000-14 fret acoustic is crafted with Guatemalan rosewood, with its top and bracing made from FSC Certified European spruce, and a 1933 ambertone finish to complete the look.\n\nIt comes also with a Vintage Deluxe neck, gold open-gear tuners and custom headplate inlay on Guatemalan rosewood. Other features include European flamed maple binding throughout, a compensated bone saddle, bone bridge pins with abalone dots on an ebony bridge, and an ebony fingerboard with Foden-style abalone inlay.\n\nAt a listed price of $8,999, each model includes a label signed by Martin CEO Thomas Ripsam and numbered in sequence.\n\nMartin D-Robert Goetzl 6 (Rabbit)\n\nIf loud and artsy are your thing, look no further than the D-Robert Goetzl 6 designed in partnership with artist Robert Goetzl. Featuring original hand-painted artwork inspired by the Chinese zodiac Year of the Rabbit, the guitar comes in full-gloss finished East Indian rosewood back and sides with a Sitka spruce top and forward-shifted scalloped X-bracing for a “full and balanced sound”.\n\nOther appointments include an ebony fingerboard and bridge, a stylized script logo on the headstock, as well as a paper label signed by the artist.\n\nThe guitar is listed at a price of $11,999.\n\nMartin OM Biosphere\n\nFeaturing more Robert Goetzl artwork and a name that’s not so much musical instrument as it is scienc-y things, the OM Biosphere is what Martin describes as “a call to action on climate change”.\n\nIn a show of support for the preservation and replenishment of coral reefs, the guitar’s top is adorned with colourful artwork depicting an ocean scene, says the brand. And true to its motto, the OM Biosphere is 100% FSC-certified and only the second plastic-free guitar in production today, preceded by Martin’s 00L Earth guitar.\n\nListing at a price of $2,299, the instrument also comes with a sustainable gig bag made from hemp.\n\nMartin D-42 Bitcoin\n\nNext up, the D-42 Bitcoin — as its name suggests — was created by the acoustic giant as a “nod to the latest global currency”. Sporting a Guatemalan rosewood back and sides and an Englemann spruce top, the guitar’s defining feature comes in the form of a one-ounce, solid-gold token coin embedded in its headstock. There’s also Bitcoin inlays on the instrument’s fretboard and headstock just in case you need a conversation starter with the crypto bro at your next gig.\n\nThe D-42 Bitcoin has no official listed price – but given the price of Bitcoin itself, don’t expect it to cheap!\n\nMartin D-28 Klaus Voormann\n\nRounding off the guitar lineup is the D-28 Klaus Voormann. Martin’s latest take on this workhorse model favoured by features original artwork by Voormann (and his son Maxi), who won a Grammy Award for his work on The Beatles’ Revolver album cover.\n\nThe guitar’s facade symbolises “peace through music”, with white doves seemingly carrying away various musical instruments with long, flowing strings. Klaus’s and Maxi’s signatures also feature on the unit.\n\nSimilar to the D-42 Bitcoin, the Martin D-28 Klaus Voormann lists for a price of $18,999.\n\nMartin Goetzl 0 Tenor Uke\n\nFinally, we have the Goetzl 0 Tenor Ukulele — a “playable collector’s item” once again featuring hand-painted, Hawaiian-themed artwork by artist Robert Goetzl.\n\nAt its core, the ukulele is crafted with sinker mahogany that was reclaimed from a river bottom in Belize. The wood creates a warm tone that Martin claims offers more harmonical complexity than regular mahogany due to its denser nature. Each unit also comes with a paper label signed by the artist.\n\nFor those interested, the Goetzl 0 Tenor Uke is listed at a price of $9,999.\n\nLearn more at martinguitar.com"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm1hY3J1bW9ycy5jb20vMjAyMy8wNC8wNi9tYWNvcy1pbmNsdWRlcy1iaXRjb2luLXdoaXRlcGFwZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple Has Included Bitcoin Whitepaper in Every Version of macOS Since 2018 - MacRumors",
        "content": "In every copy of macOS that has shipped since 2018, Apple has included the original Bitcoin whitepaper by Satoshi Nakamoto, and no-one seems to know why.\n\n\n\nThe baffling discovery (or rediscovery - see below) was recently made by developer and waxy.org writer Andy Baio, who stumbled upon the PDF document while trying to fix a problem with his printer.\n\nAnyone with a Mac running macOS Mojave or later can see the PDF for themselves by typing the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nIf you're running macOS 10.14 or later, the 184 KB Bitcoin PDF should immediately open in Preview.\n\nThe document can also be located via Finder: Navigate to Macintosh HD -> System -> Library -> Image Capture -> Devices, then open the Contents -> Resources folder. The whitepaper titled \"simpledoc.pdf\" should be in there.\n\nBaio found that in the macOS Image Capture utility, the Bitcoin whitepaper is used as a sample document for a device called \"Virtual Scanner II,\" which may or may not power Apple's Import from iPhone feature, and is either hidden or not installed for everyone by default.\n\nBaio later discovered that he wasn't the first person to find the Bitcoin document or \"Virtual Scanner II.\" An Apple Community post from 2021 queries its existence in macOS, in addition to a photo taken of a sign at San Francisco Bay's Treasure Island, after designer Joshua Dickens unearthed them in 2020.\n\n\n\nIt's not known why Apple would choose as a sample document Nakamoto's Bitcoin whitepaper. There has been widespread speculation about the identity of the presumed pseudonymous Bitcoin developer, which is only likely to add to the intrigue. What \"Virtual Scanner II\" refers to also remains unclear.\n\nAccording to a source who spoke to Baio, someone filed the Bitcoin paper with Apple as an issue nearly a year ago, and assigned it to the same engineer who put the PDF there in the first place, but that person hasn't taken action or commented on the issue since.\n\nThe mystery continues."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sYXRlc3QtYml0Y29pbi1wcmljZS1kYXRhLXN1Z2dlc3RzLWRvdWJsZS10b3AtYWJvdmUtMjAway1pbi0yMDI10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Latest Bitcoin price data suggests double top above $200K in 2025 - Cointelegraph",
        "content": "Bitcoin (BTC) is still on track to hit $180,000 in its next halving cycle, a longtime market participant said.\n\nIn a new analysis published on March 3, Filbfilb, co-founder of trading suite DecenTrader, doubled down on his bullish BTC price outlook for the years ahead.\n\nFilbfilb keeps faith in Bitcoin halving cycles\n\nWith BTC/USD approaching $30,000 but traders highly suspicious of the 2023 rally, sky-high BTC price predictions have been poorly received.\n\nTwo current $1-million forecasts, from ARK Invest CEO Cathie Wood and former Coinbase executive Balaji Srinivasan, respectively, continue to divide opinion in the aftermath of the 2022 crypto winter.\n\nConsidering whether either has merit, Filbfilb turned to raw math to determine some likely macro tops and bottoms for Bitcoin after its next block subsidy halving.\n\nDue at the end of March next year, the halving will again cut the block reward paid to miners by 50%. In prior four-year cycles after previous halvings, BTC/USD has displayed patterns of behavior that continue to hold true today.\n\n“When using Days from the Bitcoin Halving (where the inflation rate of new Bitcoins is halves); we can see that Bitcoin peaks around 368–550 days post halving and then bottoms 779–914 days post cycle,” Filbfilb summarized.\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nGenerating a so-called “price curve,” his analysis shows that it may be possible to get a rough idea of where BTC/USD will top and bottom in the coming halving cycles.\n\n“By combining expected halving dates and days to cycle tops and cycle bottoms alongside extrapolated regression of price data, it is possible to use this model in predicting where Bitcoin price may reside at the peak and trough of future cycles,” he continued.\n\nBitcoin price curve chart (screenshot). Source: DecenTrader\n\nBTC price to $200,000 or more?\n\nThus, in line with 2013, 2017 and 2021, 2025 should see a “double top” setup, in which Bitcoin peaks above $200,000 twice.\n\nRelated: Bitcoin will hit $200K before $70K ‘bear market’ next cycle — Forecast\n\nThe corresponding bear market low a year later centers around $50,000, according to the calculations.\n\nWhile acknowledging that price volatility and relative blow-off top trajectory will decrease over time, Filbfilb reasons that overall global trends toward digital stores of value will aid Bitcoin bulls.\n\nNonetheless, for his part, he believes that the next cycle will bring a slightly lower high than the numbers suggest — around $180,000, already in play since February.\n\n“I recently stated $180k is the target next cycle; I will stick to that for now,” he concluded.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aWxsLWJpdGNvaW4tYnJlYWstYWJvdmUtMzBrLW5ldy1qb2x0cy1kYXRhLXdlYWtlci1kb2xsYXItYm9vc3QtY2hhbmNlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Will Bitcoin break above $30K? New JOLTS data, weaker dollar boost chances - Cointelegraph",
        "content": "On April 4, the U.S. Dollar Index (DXY), which measures the greenback’s performance versus a basket of six leading foreign currencies, dropped by 0.5% after demand for workers in the world’s largest economy declined.\n\nBTC’s price eyes breakout with dollar at two-month lows\n\nBitcoin (BTC) has since grown 3.5% to around $28,800, continuing its extremely negative correlation with the dollar. The BTC/USD pair now eyes a breakout at $30,000, a psychological resistance level, due to hopes that the greenback will weaken further in 2023.\n\nDXY vs. BTC/USD year-to-date returns and correlation coefficient. Source: TradingView\n\nMeanwhile, the February Job Openings and Labor Turnover Survey (JOLTS) showed that the number of official job vacancies dropped below 10 million for the first time since May 2021.\n\nIn other words, while two jobs were available for each unemployed person at some point last year, there are now just 1.67.\n\nU.S. vacancies for each job seeker. Source: Bloomberg\n\nInterestingly, the implicit federal funds rate for January 2023 declined after the latest JOLTS data was published, in a similar fashion amid March’s bank failures.\n\nThe rate expectations are now around 4% compared to about 5% before the banking crisis, suggesting the market expects the Federal Reserve to stop, if not reverse, its interest rate hike program.\n\nImplicit federal funds rate drop after JOLTS data. Source: Bloomberg\n\nWorth noting is that the JOLTS readings are backward-looking, meaning the latest data does not include March’s sudden wave of bank failures and well-publicized layoffs at McDonald’s, Walmart and across technology companies, including Amazon and Apple.\n\nThus, the market is likely to see even worse JOLTS data in the next few months. This may also line up with the next Federal Open Market Committee meeting in May, prompting a dovish response, as a Reuters poll of forex strategists anticipates.\n\nLower rates should pressure the dollar downward and, in turn, Bitcoin higher, as long as their traditionally inverse price correlation remains.\n\nDollar $DXY looks fundamentally worse and worse for each year that goes by. Last #crypto bull run we didn’t really have a proper narrative, but for the next we will. Everything is alligning for a monster run after 2023 — Mac (@MacnBTC) April 3, 2023\n\nBitcoin’s price painting bullish continuation pattern\n\nFrom a technical perspective, Bitcoin’s price eyes an extended price rally in April as it paints an ascending triangle pattern.\n\nRelated: Bitcoin breakout ‘matter of time,’ says analysis with BTC price at $28K\n\nAn ascending triangle is a bullish continuation pattern that appears when the price trends between a horizontal trendline resistance and a rising trendline support.\n\nIt completes when the price breaks out of the triangle in the direction of the previous trend and rises by as much as the triangle’s maximum height.\n\nBTC/USD daily price chart featuring ascending triangle breakout setup. Source: TradingView\n\nApplying the scenario on the ongoing BTC price trend brings $31,000 as its next upside target, up around 8.5% from current price levels.\n\nMeanwhile, the DXY has the potential to drop by another 1% in April to test the lower range of its long-standing support channel (purple) at around 100.86.\n\nDXY daily price chart. Source: TradingView\n\nThe lower rate scenario risks pushing DXY below the support channel to a new yearly low, with some analysts anticipating a drop toward 95.\n\nUltimately, such a scenario will likely mean another leg-up for the cryptocurrency markets and a potential $35,000 target for Bitcoin in Q2.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy10aWdodC1jb3JyZWxhdGlvbi1uYXNkYXEtc3B4LTA5NTMwMDA3MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Tight Correlation With Nasdaq-SPX Ratio Muddies Safe-Haven Narrative - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin's (BTC) price rose 23% in March as multiple U.S. banks went bust, bolstering fears that is a recession is coming.\n\nSeveral analysts have called the move higher a safe-haven rally – with the price gain being attributed to investors seeking shelter in the top cryptocurrency amid bank failures.\n\nBitcoin, however, rose in tandem with the Nasdaq to S&P 500, or NDX/SPX, ratio, a sign the rally was partly, if not mainly, driven by improved risk appetite stemming from hopes for an early Federal Reserve pivot in favor of liquidity-boosting rate cuts.\n\nThe NDX/SPX ratio measures the relative difference in valuation between technology stocks represented in the Nasdaq 100 and a basket of broader industry stocks from the S&P 500.\n\nThe ratio rose by 5.65% in March, capping its best monthly performance since February 2009, as banking sector instability saw traders aggressively reinstate bets that the Fed would cut rates later this year. Nasdaq surged nearly 10%, outperforming the S&P 500's 3.5% gain by a big margin.\n\nThe 90-day correlation coefficient between bitcoin and the NDX/SPX ratio rose from 0.81 to 0.90, signaling the strongest positive relationship between the two assets since June 2022. At press time, the correlation coefficient stood at 0.89. The positive correlation means on days when the ratio rises, bitcoin is more likely to do the same and vice versa.\n\n\"BTC is still trading like a risk asset,\" Noelle Acheson, the author of the popular Crypto is Macro Now newsletter, said, referring to the positive correlation between bitcoin and the NDX/SPX ratio. \"The rising NDX/SPX ratio means tech is doing better, which says risk sentiment is strong.\"\n\nTech stocks tend to be more sensitive to interest-rate expectations than the broader market. Thus a rising ratio is often equated with dovish Fed expectations and improved investor risk appetite that often percolates into other assets like cryptocurrencies, as observed in 2020 and early 2021. A falling ratio represents a sentiment against risky assets.\n\nStory continues\n\n\"Much like crypto, growth-style companies, which are expected to provide cash flows, or some form of fundamental value, further out into the future, find their performance more heavily influenced by shifts in interest rates. The Nasdaq 100 index, for example, is comprised of mostly growth-style sectors, such as technology, which are more sensitive to rising or falling rate expectations,\" Gabriel Selby, a research analyst at CF Benchmarks, told CoinDesk in an email.\n\nSelby added that as the NDX/SPX ratio is closely tracking the crypto market, it suggests interest-rate expectations are in the driver's seat and the pricing divergence between equities and crypto markets may not be as wide as initially thought.\n\nBitcoin and the NDX/SPX ratio bottomed out in late 2022. (TradingView/CoinDesk)\n\nThe correlation between bitcoin and the NDX/SPX ratio was consistently positive during the 2022 bear market and between May 2020 and March 2021, when the cryptocurrency rallied nearly tenfold to $60,000.\n\nIf that's not enough, both have been rallying in lockstep since early January. While bitcoin has risen nearly 70% this year, the ratio is up 11.26%.\n\nBitcoin's pause at around $28,000 since March 22 is consistent with the consolidation in the NDX/SPX ratio.\n\nWhile bitcoin's near-term prospects appear tied to gyrations in the NDX/SPX ratio, it could benefit from fears of fiat currency devaluations over time, according to Acheson.\n\n\"BTC is still (and always will be) a risk asset for traditional investors. It is also likely to be regarded as a safe haven,\" Acheson said. \"We are likely to see continued accumulation from longer-term investors interested in its currency debasement hedge properties, while short-term moves are dictated by shifting theories about what monetary liquidity will do.\""
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA2L2RjZy1zLWJpdGNvaW4tbWluaW5nLWZpcm0tZm91bmRyeS10by1zdG9wLW9mZmVyaW5nLWZyZWUtc2VydmljZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Digital Currency Group (DCG)'s Bitcoin Mining Foundry to Start Charging - Bloomberg",
        "content": "Crypto-mining firm Foundry, which is owned by embattled conglomerate Digital Currency Group, is going to start charging users a fee for its Bitcoin mining services.\n\nFoundry USA will begin levying a pool fee on members between April 19 and April 22, according to a notice it circulated to clients on April 6. The Rochester, New York-based company has provided its services for free since launching the mining pool in 2019."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1kb3duLXRvcC0xMC1jcnlwdG9zLWpvYnMtcmVwb3J0L9IBT2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1kb3duLXRvcC0xMC1jcnlwdG9zLWpvYnMtcmVwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether down with top 10 cryptos, most equities fall ahead of US Jobs Report - Forkast News",
        "content": "Bitcoin and Ether fell during afternoon trading hours in Asia on Thursday, along with all other top 10 non-stablecoin cryptocurrencies by market capitalization. Asian and U.S. equities fell as investors remained cautious ahead of the U.S. employment report scheduled for Friday.\n\nSee related article: Bitcoin briefly loses its grip on US$28,000\n\nFast facts\n\nEther fell 1.51% to US$1,882 but maintained a weekly gain of 4.58%. The cryptocurrency is trading near a nine-month high ahead of Ethereum’s Shanghai hard fork scheduled for next Wednesday. The upgrade will allow investors to withdraw their staked ETH for the first time. Nearly 18 million ETH worth around US$33.5 billion has been staked in the network since the blockchain adopted the proof-of-stake consensus mechanism.\n\nBitcoin fell 2.08% to US$27,974 in the 24 hours to 4:30 p.m. in Hong Kong. The world’s first cryptocurrency fell 2.22% on the weekly chart after trading above the US$28,000 mark for most of the week.\n\nDogecoin fell 5.91% to US$0.09 to become the day’s biggest loser but still maintained a 22.18% seven-day gain in a week when Twitter changed its logo to a Shiba Inu dog, the memecoin’s mascot. The XRP token fell 3.83% to US$0.49, as the day’s second-biggest loser.\n\nThe global cryptocurrency market capitalization decreased by 1.97% to US$1.18 trillion in the 24 hours to 4:30 p.m. in Hong Kong, with total crypto market trading volume down by 8.91% to US$40.82 billion.\n\nThe Forkast 500 NFT index slid 0.70% to 4,002.64 points on the day and lost 0.04% on the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\nMost Asian equities were down on Thursday, with Shanghai Composite sliding 0.010% and the Shenzhen Component Index inching down 0.044%. Japan’s Nikkei 225 fell 1.10%, while Hong Kong’s Hang Seng Index rose 0.012%. Hong Kong’s financial markets will be closed from Friday to next Monday for the Easter holidays.\n\nInvestors await the release of the U.S. Employment Situation report on Friday, which includes the monthly change in non-farm payrolls. Strong growth in non-farm payroll data may indicate heating inflation, which investors will analyze to gauge the Federal Reserve’s next monetary decision. The U.S. stock market will be closed on Good Friday.\n\nEuropean bourses picked up on Thursday, as the pan-European STOXX 600 rose 0.39% and Germany’s DAX 40 gained 0.44%.\n\nGold fell 0.15% to US$2,017 per ounce to stabilize near a one-year high, following a three-day winning streak. The precious metal rose around 2.5% this week to close up on its all-time high of US$2,075 set in August 2022.\n\nInvestors digested new economic data from the U.S., including ADP Research Institute’s National Employment Report and the Job Openings and Labor Turnover Survey, showing that tighter financial conditions are slowing down the economy as investors hope for the Fed to pause rate hikes next month.\n\nSee related article: Ripple exec says innovation is leaving the US."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vOXRvNW1hYy5jb20vMjAyMy8wNC8wNi9tYWNvcy1iaXRjb2luLXdoaXRlcGFwZXItaGlkZGVuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Here's why macOS has the Bitcoin whitepaper hidden in its files - 9to5Mac",
        "content": "It’s not unusual to have a few easter eggs hidden in operating systems, and it’s no different with Apple’s. However, some users recently discovered something intriguing. Every copy of macOS has the original Bitcoin whitepaper hidden in its internal files. While this got attention on social media, the fact that this document is there in macOS probably doesn’t mean much. And here’s why.\n\nThis story is supported by Mosyle, the only Apple Unified Platform. Mosyle is the only solution that fully integrates five different applications on a single Apple-only platform, allowing businesses and schools to easily and automatically deploy, manage, and protect all their Apple devices. Over 38,000 organizations leverage Mosyle solutions to automate the deployment, management, and security of millions of Apple devices daily. Request a FREE account today and discover how you can put your Apple fleet on auto-pilot at a price point that is hard to believe.\n\nYour Mac may have a copy of the original Bitcoin whitepaper\n\nThis isn’t the first time someone has noticed this, but the fact that macOS has the original Bitcoin whitepaper hidden in its internal files has gotten attention once again after developer Andy Baio wrote an article about it this week. According to Baio, he was trying to fix his printer when he found a PDF copy of the whitepaper written by Satoshi Nakamoto, considered to be the person who invented Bitcoin.\n\nThe developer asked other friends to check if the file could also be found on their Macs. To his surprise, they all confirmed that the Bitcoin whitepaper was there in macOS. The file seems to have been added to the system with macOS Mojave, which was released in 2018, and is still present in the latest version of macOS Ventura.\n\nIf your Mac is running one of these macOS versions, you can check the file yourself by running the following command in Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nBut why is this file there and what does it represent? For people creating theories on the web about Apple and Bitcoin, I’m sorry to say that the existence of this file in macOS has no special meaning.\n\nIt’s just an internal tool from Apple\n\nThe file is part of the Image Capture app, which comes pre-installed on every Mac and lets users scan images from an external scanner. Of course, the app is also related to how macOS handles printers – which is probably why Baio ended up finding the file. And here’s something to keep in mind.\n\nThis file was never intended to be found by normal users. It is located inside a folder with assets used for internal testing by Apple engineers. The same folder also contains other random images and PDF files that are used to simulate the process of scanning and exporting documents and images with the app without actually needing a scanner.\n\nSo why use the original Bitcoin whitepaper? Well, it’s hard to say for sure, but this was probably just an inside joke by Apple engineers working on this tool. Apple’s internal software is full of references and jokes. After all, engineers never expect that users will access these files.\n\nThe most likely explanation is that the engineers didn’t bother to remove this tool from the final macOS build because it doesn’t have any sensitive information in it. But of course, it’s not every day that you find out that Apple hides a file about Bitcoin in its operating system.\n\nBaio says he has heard from a source that the Apple engineers knew the Bitcoin whitepaper was there in macOS and never took action to remove it. But given the repercussions on the web, Apple will probably end up removing it with a future update."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJ1eXMtMS0wNDUtYml0Y29pbi0xMzE3MzY3MzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "MicroStrategy buys 1,045 Bitcoin, holds 140,000 BTC in total - Yahoo Finance",
        "content": "MicroStrategy acquired 1,045 Bitcoin for around US$29.3 million, at an average price of US$28,016 per coin, between March 24 and April 4, 2023, said Michael Saylor, MicroStrategy’s co-founder and executive chairman.\n\nSee related article: Weekly Market Wrap: Bitcoin pops above US$29,000, market shrugs off Binance legal woes\n\nThis brings MicroStrategy’s total Bitcoin holdings to 140,000 coins, acquired for approximately US$4.17 billion, bought at an average price of US$29,803 per Bitcoin, according to Saylor’s Wednesday announcement.\n\nSaylor’s announcement comes a week after MicroStrategy announced purchasing 6,555 Bitcoin for around US$150 million.\n\nBitcoin rose 0.73% in the 24 hours to 8:30 p.m. in Hong Kong, to trade at US$28,558, according to CoinMarketCap data.\n\nAs the world’s largest corporate Bitcoin holder, MicroStrategy’s Bitcoin acquisition could boost sentiment among crypto investors.\n\nSaylor stepped down from his role as CEO to become executive chairman last August, and to focus on the company’s “Bitcoin acquisition strategy and related Bitcoin advocacy initiatives.”"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbWFnaWMtZWRlbi1pbnRyb2R1Y2VzLWxhdW5jaHBhZC1mb3ItYml0Y29pbi1vcmRpbmFscy1jcmVhdG9ycy0zMDE3OTE2OTIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Introduces Launchpad for Bitcoin Ordinals Creators - PR Newswire",
        "content": "Shortly after its marketplace launch for digital artifacts on Bitcoin, Magic Eden turns focus to providing creators with platform to launch collections\n\nSAN FRANCISCO, April 6, 2023 /PRNewswire/ -- Magic Eden (\"The Company\"), the leading cross-chain NFT platform, today announced plans to open a Launchpad for creators looking to inscribe Ordinals on Bitcoin. The first Ordinals launch will happen on April 7, 2023. Now the leading platform facilitating Bitcoin inscriptions transactions, Magic Eden continues adding to its capabilities by providing creators with a safe and secure platform to launch their collections. In an effort to further advance the Ordinals ecosystem, Magic Eden launched a marketplace to facilitate transactions on the side of the user, and now introduces the Launchpad to service creators.\n\nBitcoin inscriptions have seen a major uptick in popularity throughout Q1 2023 and while technology continues to catch up with demand, Magic Eden is stepping in to offer a way for creators to easily launch their collections. The Launchpad will bring together a community of enthusiasts from other native chains and foster the growth of a growing Ordinals society.\n\nSince the launch of its marketplace on March 21, 2023, Magic Eden has become the top marketplace for trading Bitcoin inscriptions. Leading with up to 70% market share, the platform is actively looking to introduce new projects to collectors in a safe and secure way. The Magic Eden Launchpad now supports four blockchains, including Ethereum, Solana, Polygon, and Bitcoin, and is the premier destination for creators to launch their projects. To date, Launchpad has served over 500 creators and raised over $150 million on behalf of creators.\n\nZhuoxun Yin, COO and co-founder of Magic Eden, commented on today's news: \"We're excited to expand our creator capabilities to Bitcoin and offer easy ways for creators to get started and launch. Bitcoin is the grandfather of all blockchains, and we believe it can be the home to pure digital artifacts. With Ordinals, content can be preserved forever, and we're proud to be helping creators and the Ordinals community grow together.\"\n\nA growing Bitcoin Ordinals ecosystem means that digital asset collectors and traders are interested in the value the digital artifacts provide and are looking to experience a smooth and user-friendly encounter when first interacting with inscriptions. Magic Eden looks forward to being the first to provide a Launchpad experience for Bitcoin. Its launch partner, Godjira, an established ETH collection, is scheduled to go live on Magic Eden on April 7 with their (Dead)jira Legacy mint. Additionally, four other creators including Genopets, Lazy Lions, Lil Durk, and Humanoids will be launching Ordinals on the platform within the first week of it being live. Genopets will be the first game to launch Ordinals on the platform.\n\n\"We chose to work with Magic Eden because they are a team of experts who can provide advice and guidance and have a reputation for quality and trustworthiness. We believe this launch is not only beneficial to [our community] but also the entire Ordinals space,\" stated Godjira co-founder. The team aims to educate and raise awareness about Ordinals through its collections to a wider audience.\n\nCreators interested in inscribing ordinals on Bitcoin through the Magic Eden Launchpad should get in touch here .\n\nAbout Magic Eden\n\nMagic Eden is the leading cross-chain NFT platform driving the next billion users to Web3. Led by former crypto, tech, and hospitality leaders, Magic Eden is building a user-friendly platform powered by market-leading minting and trading solutions. Magic Eden brings dynamic cultural moments onto the blockchain, empowering users across thousands of digital communities to create, discover and collect unique NFTs. For more information, please visit www.magiceden.io .\n\nMedia Contact\n\nDillon Arace\n\n[email protected]\n\nSOURCE Magic Eden"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xMjU2NDYvY2hhdGdwdC1waWNrcy1nb2xkLW92ZXItYml0Y29pbi1zYXlzLWNyeXB0by1jcml0aWMtcGV0ZXItc2NoaWZm0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTY0Ni9jaGF0Z3B0LXBpY2tzLWdvbGQtb3Zlci1iaXRjb2luLXNheXMtY3J5cHRvLWNyaXRpYy1wZXRlci1zY2hpZmY_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "ChatGPT Picks Gold Over Bitcoin, Says Crypto Critic Peter Schiff - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe ChatGPT artificial intelligence tool appears to have picked a side in the long-running debate over the respective worth of gold versus Bitcoin as a sound investment. Financial commentator Peter Schiff has praised the prominent generative text engine for reportedly favoring gold.\n\n“AI is pretty intelligent after all,” he tweeted on Wednesday. “It didn't recommend any allocation to Bitcoin.”\n\nThe investor referenced a report from last week covering ChatGPT’s idea of a “recession-proof” portfolio. The document—published in “Gold IRA Guide”—claimed that ChatGPT recommended a 20% allocation to gold and other precious metals to minimize the impact of any one market downturn.\n\n\n\nThe rest of its hypothetical portfolio was comprised of bonds (40%) “defensive” stocks (30%) and cash (10%)—absent any mention of Bitcoin.\n\nAD\n\nAD\n\nYet the AI bot’s answer may not necessarily be a knock against crypto, nor a promotion of gold. When Decrypt directly asked on April 6 for its opinion on “Gold or Bitcoin,” ChatGPT said the choice of which to buy ultimately depends on your investment goals.\n\n“[Gold] is a tangible asset that is considered a safe-haven investment during times of economic uncertainty,” it stated “Gold is a limited resource and is difficult and expensive to mine, which gives it a certain level of scarcity and intrinsic value.”\n\nThe bot contrasted the historic money with Bitcoin, which “is not backed by any physical asset or government” and is “considered by many to be a speculative investment.”\n\n“Gold may be a better choice for those seeking a stable, long-term investment, while Bitcoin may be more suitable for those looking for a high-risk, high-reward investment opportunity,” it concluded.\n\nIt should also be noted that the corpus of knowledge on which ChatGPT is based is current only through 2021, and likely does not include the significant movements—both up and down—that the price of Bitcoin has seen since.\n\nAD\n\nAD\n\nBoth gold and Bitcoin investors are winning big this year, with each asset respectively up 10% and 68% year to date. The former just crossed a multi-year resistance level at $2,000 per ounce, which Schiff believes could now serve as the “launch pad for a moonshot,” per a tweet on Thursday.\n\nGold and Bitcoin are often compared as forms of money due to their strong monetary properties—particularly scarcity, which theoretically makes them resistant to inflation or monetary debasement like fiat currencies. Both assets surged in March after the Federal Reserve bailed out depositors to Silicon Valley Bank, injecting hundreds of billions of dollars back into the banking system to prevent similar bank failures.\n\nWhile Schiff takes the opportunity to double down on gold, an army of Twitter Bitcoiners continue to disapprove—including his own son.\n\n“Long-term bitcoin is a much better buy than gold,” said Spencer Schiff to Decrypt via DM when asked about gold’s latest gains. “Bitcoin is likely to demonetize gold in the long term. Regarding short term, I have no idea, I’m not a trader I just focus on [the] long term.”"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXMtd2hpdGVwYXBlci1pcy1hcHBhcmVudGx5LWhpZGluZy1pbi1hcHBsZS1zLW1vZGVybi1tYWNvc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin white paper is apparently hiding in Apple's modern macOS - Cointelegraph",
        "content": "Satoshi Nakamoto’s original white paper laying out the Bitcoin (BTC) network is seemingly hiding within every modern version of the operating system for Apple’s Mac computers.\n\nAn April 5 blog post from technologist Andy Baio revealed that a PDF of the Bitcoin white paper has “apparently shipped with every copy of macOS since Mojave in 2018.”\n\nBaio told Cointelegraph that he was “just trying to fix my printer” and scan a document with a wireless scanner when a device called “Virtual Scanner II” appeared that he’d “never seen before.”\n\nBy default, Virtual Scanner II showed a photo, but when Baio changed the media type from \"Photo\" to \"Document,\" Nakamoto’s white paper appeared.\n\nA screenshot of the Bitcoin white paper appearing within the “Virtual Scanner II” device. Source: Waxy\n\n“I wasn't looking for the Bitcoin paper!” Baio exclaimed. “I was just trying to fix my printer!”\n\nIn his post, Baio said there is “virtually nothing about this online.” He shared a November 2020 Twitter thread from designer Joshua Dickens, who also found the whitepaper, which Baio used to find the file location.\n\nWeirdly, there's also a PDF of the original Bitcoin white paper: pic.twitter.com/JjPnI4fyzc — Josh D (@schwa23) November 28, 2020\n\nBaio created a prompt to use in Terminal, a command line interface for macOS, so others could bring up the whitepaper easily.\n\n“I started asking other Mac-using friends if they could co nfirm it, and all of them could,” he said.\n\nRelated: Bitcoin white paper makes its F1 racing debut on Kraken-sponsored car\n\nThe prompt successfully opened the Bitcoin white paper on three different Apple Mac devices tested by Cointelegraph.\n\nIn his blog post, Baio claimed the file is found on “every version of macOS from Mojave (10.14.0) to the current version (Ventura), but isn’t in High Sierra (10.13) or earlier.”\n\nIt’s unknown why Nakamoto’s white paper is shipped with modern versions of macOS. Baio speculated in his post that it was “just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.”\n\nCointelegraph contacted Apple for comment but did not immediately receive a response.\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZGVjcnlwdC5jby8xMjU1NTYvYml0Y29pbi1zdGFtcHMtbmZ0cy1hcmUtZ2FpbmluZy1vbi1vcmRpbmFsc9IBS2h0dHBzOi8vZGVjcnlwdC5jby8xMjU1NTYvYml0Y29pbi1zdGFtcHMtbmZ0cy1hcmUtZ2FpbmluZy1vbi1vcmRpbmFscz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "‘Bitcoin Stamps’ NFTs Are Gaining On Ordinals - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThere’s another wave of NFTs starting to flood the Bitcoin blockchain—and they’re not in the form of Ordinals.\n\nThe emergent STAMPS (Secure Tradeable Art Maintained Securely) protocol is proposing a different method of embedding image data into the OG blockchain, making different tradeoffs compared to the inscription technology that exploded in popularity earlier this year.\n\nRather than storing image data within prunable transaction witness data, “Bitcoin Stamps” store it directly within spendable transaction outputs.\n\nAD\n\nAD\n\n“By doing so, the data is preserved in such a manner that is impossible to prune from a full node, preserving the data immutably forever,” wrote pseudonymous Stamps creator Mike In Space on the project’s GitHub page. The developer noted that he is already in discussions with Emblem and Hiro Wallet to arrange protocol integrations, the former of which will allow users to buy and sell Stamps on OpenSea.\n\nAs Ordinals growth surged in early February, proponents argued that they were superior to NFTs on other platforms because they store image data within the Bitcoin blockchain. By contrast, Ethereum NFTs are usually just image pointers to centralized hosting services, which can be changed by anyone with control of the image URL.\n\nYet even Ordinals data can be pruned by choice by individual node runners, limiting the immutability and decentralization benefits of such NFTs. As such, Bitcoin Stamps go all the way, forcing nodes to store their image data across many different unspent transaction outputs (UTXOs).\n\nThe NFT is then broadcast across the network using Counterparty—an old protocol that ushered in Bitcoin images back in 2014 before the term “NFT” even existed.\n\n\n\n“They are good for the preservation of art forever by storing them securely on the strongest ledger ever devised by man backed by Proof of Work,” the creator told Decrypt via DM. He added that other services are already being built atop the STAMPS protocol, such as a Name Service by Rarity Garden.\n\nBut storing data across all Bitcoin nodes comes at a cost—quite literally. In fact, the protocol creator suggests using Stamps for lightweight “24x24 pixel, 8-color-depth PNG or GIF” files to make up for their implicit storage costs.\n\nAD\n\nAD\n\n“The constraints of this \"canvas\" are ideal for pixel art,” he wrote on GitHub. “In particular, the CryptoPunks use a native resolution of 24x24 pixels.”\n\nStamps also come with the benefit of being “semi-fungible”: they can be issued as “1 of 1” or “1 of many” digital assets. Trevor.btc on Twitter, host of The Ordinals Show, recognized this feature as similar to the Ethereum ERC-1155 multi-token standard, and as a reason for their remarkably fast growth.\n\nThe Stamps website shows that over 8,300 Stamps have been minted since their launch on March 7, compared to under 500 Ordinals within the same time period after their launch.\n\nThat said, the number of Ordinals on Bitcoin only continues to grow, now standing at over 910,000 inscriptions to date, according to Dune Analytics. Major brands including Bored Ape Yacht Club and Bugatti have already adopted the tech."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZ2l6bW9kby5jb20vYml0Y29pbi1hcHBsZS1tYWMtYml0Y29pbi13aGl0ZS1wYXBlci0xODUwMzA3MDY50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Here's How to Find the Original Bitcoin Manifesto in Your Mac - Gizmodo",
        "content": "An Apple developer left one of the strangest Easter eggs hidden in the macOS, offering a surprising and baffling connection between the Cupertino tech company’s mainline operating system to everybody’s (least) favorite cryptographic digital currency.\n\nThe Biggest Crypto Heists of 2022…So Far CC Share Subtitles Off\n\nEnglish view video The Biggest Crypto Heists of 2022…So Far\n\nOn his Waxy.org blog, tech dev Andy Baio reported Thursday he made a surprise discovery, finding the original bitcoin whitepaper written by the presumed pseudonym Satoshi Nakamoto had been shoved inside every single copy of macOS since 2018. The document, titled Bitcoin: A Peer-to-Peer Electronic Cash System, was first published in 2008 and described how to set up access to and mine the blockchain-based cryptocurrency. Just a year later, the person under the Nakamoto name launched the first version of the bitcoin network.\n\nAdvertisement\n\nAny device running macOS Mojave 10.18 or later can access the document. Users who want to access the document only need to open a macOS terminal and enter:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAdvertisement\n\nGizmodo confirmed the document popped up on preview on a MacBook Air running macOS 12.5.1 as well as more modern versions of the OS. The document is stuffed deep in the operating system’s resources, requiring the image capture Virtual Scanner II Device. MacRumors suggested it could be a sample document for the system that could power Mac’s feature letting users transfer photos from iPhone or iPads to Macs, though iCloud is a much easier option for data transfer.\n\nThe entire thing is a greater mystery, as back in 2020 Joshua Dickens, a former product designer at Apple, tweeted about the white paper. He also found a strange photo in the resources folder, which California-based photographer Thomas Hawk claimed was a sign from Treasure Island in San Francisco he took back in 2018.\n\nAdvertisement\n\nGizmodo reached out to Apple for comment, but we did not immediately hear back. Users on Apple’s own forums were pointing out the irregularities of the Virtual Scanner II Device back in 2021, though no Apple representative ever commented on it.\n\nAdvertisement\n\nBaio further claimed based on an anonymous source that somebody at Apple had filed the document as an issue close to a year ago, but that the issue was assigned to the same engineer who originally installed the document into the OS. As is plain by the white paper’s continuing existence, nothing’s really changed in that time.\n\nIt certainly makes sense that there could be a developer at Apple who used the bitcoin white paper as a test for one of macOS backend scanning systems, and then just left it in the code where nobody was looking for it. Still, the political environment surrounding cryptocurrencies is not exactly stable, especially as crypto hacks, robberies, and other crimes have expanded even as bitcoin prices dropped precipitously last year compared to 2021 highs.\n\nAdvertisement\n\nThere’s still quite a lot of speculation about if Nakamoto was a real person or, more likely, a pseudonym. Past investigations by Gizmodo and others have pointed to Australian academic and entrepreneur Craig Wright as involved in bitcoin’s creation. Still, some remain highly skeptical that he was behind it all, and instead claim other early bitcoin developers as the real minds behind crypto’s nascent beginnings. And making such proclamations haven’t helped Wright’s wallet either, as he’s had to pay $100 million in compensatory damages to the family of Dave Kleiman, one of bitcoin’s supposed original founders. Kleiman’s brother claimed Wright cheated the developer out of intellectual property rights for bitcoin."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xMjU0ODIvYmF0dGVyaWVzLWJpdGNvaW4taXMtbWluaW5nLWJlc3QtdXNlLWV4Y2Vzcy1ncmVlbi1lbmVyZ3nSAVhodHRwczovL2RlY3J5cHQuY28vMTI1NDgyL2JhdHRlcmllcy1iaXRjb2luLWlzLW1pbmluZy1iZXN0LXVzZS1leGNlc3MtZ3JlZW4tZW5lcmd5P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Batteries or Bitcoin: Is Mining the Best Use for ‘Excess’ Green Energy? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFor Bitcoin miners the motive to power their operations with renewables is clear–it's economical.\n\nPer data from MacroMicro, it costs $26,979 to mine a Bitcoin on average. With the price of the leading cryptocurrency hovering around $28,500, cutting costs is key to fattening miners’ margins.\n\nMining outfits that can tap cheaper energy powered by renewables, such as wind, hydro, or nuclear, are thus at a clear advantage over their competition.\n\nAD\n\nAD\n\nWhat’s more, beyond heftier profits, these miners also claim to be using \"excess\" energy that might not otherwise be used to power their operations.\n\nAccording to Marathon Digital Holdings’s corporate communications VP Charlie Schumacher, Bitcoin can be helpful for renewable energy grids, in particular, by offering a profitable use of energy in places where there is higher energy production than demand.\n\nMarathon draws energy from more than 200 wind turbines to power its mining operation in McCamey, Texas.\n\n\"Renewables don't always happen to be where we have large populations,\" Schumacher told Decrypt. Such is the case at King Mountain Wind Farm which is hundreds of miles from the nearest large city.\n\n\"Because electricity can only travel about 500 miles before it's fully wasted, you need to be close to the source,” he said. “If you're further away, it's less efficient.\"\n\nAD\n\nAD\n\nMiners also serve as ever-buying consumers for energy producers in these regions. Bitfarms’ chief mining officer Ben Gagnon makes a similar argument regarding his firm's use of hydropower in Québec.\n\nGagnon told Decrypt that to reduce energy costs, Bitfarms ends up \"seeking out energy sources that don't have other customers' demand.\"\n\nThis has led the company toward a pattern of essentially filling in the gaps left behind by old manufacturing hubs.\n\n\"We took over former industrial buildings…paper mills and metal shops…[industries] that basically were outsourced to third world countries,\" Gagnon said. \"The dams are still there. They've been paid off. The water still falls from the sky. It still melts from the snow. It still flows through the rivers, but there's just no demand for that electricity.\"\n\nIs it really ‘excess’ energy?\n\nWhether the energy being used can actually be called excess, however, is still up for debate.\n\nA representative from Hydro-Québec, the public utility company that provides energy for Bitfarm's Canadian operations, told Decrypt that \"there is no such thing as excess energy for Hydro-Québec. We manage our network in order to produce electricity in real time to answer the demand.\"\n\nHydro-Québec is also expecting an energy demand increase of 14%, or 25 terawatt hours (TWh), over the next ten years.\n\nBut even if there isn’t an excess of energy, many firms claim that Bitcoin mining is nonetheless easier on the grid than other types of production such as heavy industry.\n\nAD\n\nAD\n\n\"Miners have the capacity to turn on and off very quickly, in a matter of minutes,\" Marathon Digital’s Schumacher said. \"That load can be turned on and soak up energy, or it can be shut off…faster than most other industries.\"\n\nHe added that because wind and solar power are intermittent power sources–generating more or less power at different times throughout the day–it's important to have more consumers, like miners, who can be flexible with how they consume energy as grids transition to these sources.\n\nFrom Bitcoin to fuel cells\n\nPeople working on renewable energy systems tend to look to other processes for using or storing surplus energy.\n\nGreen hydrogen production is one alternative solution because electricity is used to generate hydrogen fuel which can be stored and converted back to power when it's needed.\n\n\"Hydrogen can make grids more efficient because it's an energy storage material,\" senior consultant of political affairs for the German Hydrogen and Fuel Cell Association Johannes Drijkoningen told Decrypt. \"What's stored in H2 are electrons.\"\n\nElectricity can be used to split water into hydrogen and oxygen in a process called electrolysis, and the resulting hydrogen can then be used to make clean fuels for vehicles, or stored and converted back into electricity via fuel cells when energy is needed later.\n\nOther projects that commonly compete for renewable energy contracts include solar panel production or green-aluminum or steel production.\n\n\"We always have to think twice about where our energy is going,\" Drijkoningen said. \"When it comes to [Bitcoin] mining, I personally don't see an added value for society or myself, compared to using electricity for heating, food production, or other basic human needs.\"\n\nAD\n\nAD\n\nBroader conversations about energy use and priorities on local and national levels will continue to develop into the future.\n\nBut for Bitfarm’s Gagnon, Bitcoin mining still offers an economically productive use of energy in the short term. He suggested that he understands the growing interest in projects related to battery manufacturing, hydrogen, and solar, but added that these types of projects can take decades to construct and launch.\n\nHe argues that in the shorter term, Bitcoin miners can create jobs and tax revenue with the energy that is available today.\n\n\"It's a 20-year hypothetical versus a 12-month implementation schedule [for Bitcoin mining],\" he said. \"A Bitcoin miner could be promised, 'You've got the power for the next 15 years, but after that, you've got to move on.' And Bitcoin miners would take that–they'd absolutely do that.\""
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDYvYml0Y29pbi13aGl0ZS1wYXBlci1raWNrc3RhcnRlci1hcHBsZS1tYWMtb3BlcmF0aW5nLXN5c3RlbS_SAWVodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA0LzA2L2JpdGNvaW4td2hpdGUtcGFwZXIta2lja3N0YXJ0ZXItYXBwbGUtbWFjLW9wZXJhdGluZy1zeXN0ZW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Former Kickstarter CTO finds Bitcoin white paper hidden in Mac operating system - Fortune",
        "content": "The legend of Satoshi Nakamoto, the anonymous creator of Bitcoin, lives on: in an Apple computer near you.\n\nAndy Baio, former CTO of Kickstarter, posted Wednesday on his more than two decades old blog that he’d found the Bitcoin white paper—the nine-page document outlining the design of the world’s first cryptocurrency—squirreled away on his MacBook.\n\n“I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them,” he wrote. All versions of Mac’s operating systems created after 2018 had the white paper preloaded, he said.\n\nBaio landed upon the PDF when he was trying to scan documents from a combination printer-scanner onto his computer, he told Fortune. He found the white paper, authored by Nakamoto, after trying to connect the scanner to his MacBook, which wasn’t initially appearing on his laptop. On a recently released MacBook, Fortune was able to independently access the PDF in the same location.\n\nThe discovery is but the latest in popular culture. Beyond die-hard Bitcoiners—Nakamoto’s text is seen by some as a quasi-religious screed—the white paper has shown up on Formula 1 cars and is sold as wallpaper. The author remains an almost mythological figure, whose mysterious origins and unknown identity have spawned reams of speculative journalism. (Even Elon Musk, the embattled CEO of Twitter and Tesla, has guessed at his identity.)\n\nBaio said he believes the inclusion of the white paper in the tech giant’s software wasn’t an explicit decision by the company.\n\n“In its early history, Apple developers used to hide Easter eggs in the operating system,” he told Fortune. “But I get the impression this wasn’t something that management would have approved of—basically the decision of a single engineer.”\n\nHe said an anonymous source told him that someone at Apple flagged the white paper’s inclusion in its operating systems internally, but the task of removing it was assigned to the very same engineer who had initially placed it.\n\n“With this new attention to it,” Baio added, “I’ll be surprised if it isn’t removed in the next beta.”\n\nA spokesperson for Apple didn’t immediately respond to a request for comment."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jYXRoZWRyYS1iaXRjb2luLWFubm91bmNlcy1ib2FyZC1kaXJlY3RvcnMtMTEzMDAwMTgwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Cathedra Bitcoin Announces Board of Directors Change - Yahoo Finance",
        "content": "TORONTO, April 05, 2023--(BUSINESS WIRE)--(Block Height: 783,963) – Cathedra Bitcoin Inc. (TSX-V: CBIT; OTCQX: CBTTF) (\"Cathedra\" or the \"Company\"), a Bitcoin company that develops and operates world-class bitcoin mining infrastructure, today announces the resignation of Roy Sebag from the Company’s board of directors (the \"Board\") effective April 4, 2023. President and Chief Operating Officer Drew Armstrong, who has also served on the Board since September 2021, will assume the role of Chairman. The Board has begun searching for a replacement for Mr. Sebag and hopes to provide an update in short order. Until such time, the Board shall consist of Drew Armstrong (Chairman and President), AJ Scalia (Chief Executive Officer), David Jaques (independent), and Marcus Dent (independent).\n\nStatement from Roy Sebag:\n\n\"Due to other business and personal demands on my time, I have decided to vacate my position as Chairman of the Board of Cathedra. My activity at the Company has naturally diminished into a less active role than in the 2018-2021 period, particularly since Marcus Dent, AJ Scalia, and Drew Armstrong joined the Board and AJ and Drew took the reins as management in Q3 2021.\n\nThough I will no longer serve on the Board, I will continue to be an advocate for the Company. I remain the largest individual shareholder and Cathedra is the most promising investment I have in the space. If I had any doubts about the Company’s prospects, I would not have made this decision. Indeed, it is my confidence in the existing Board along with the management team which gives me peace of mind as a long-term shareholder.\n\nI have enjoyed my time on the Board and would like to thank my fellow directors for their diligent work over the past few years.\"\n\nStatement from Drew Armstrong:\n\n\"We thank Roy for his service during his five-year tenure at Cathedra. Roy’s vision and prudence have directly benefited shareholders, employees, and partners alike. We look forward to Roy’s continued support as a shareholder. The Board has begun working to fill the vacant independent director seat with a worthy replacement and will update the market in due time.\"\n\nStory continues\n\nAbout Cathedra Bitcoin\n\nCathedra Bitcoin Inc. (TSX-V: CBIT; OTCQX: CBTTF) is a Bitcoin company that develops and operates world-class bitcoin mining infrastructure.\n\nCathedra believes sound money and abundant energy are the fundamental ingredients to human progress and is committed to advancing both by working closely with the energy sector to secure the Bitcoin network. Today, Cathedra’s diversified bitcoin mining operations total 247 PH/s and span three states and five locations in the United States. The Company is focused on expanding its portfolio of hash rate through a diversified approach to site selection and operations, utilizing multiple energy sources across various jurisdictions.\n\nFor more information about Cathedra, visit cathedra.com or follow Company news on Twitter at @CathedraBitcoin or on Telegram at @CathedraBitcoin.\n\nCautionary Statement\n\nTrading in the securities of the Company should be considered highly speculative. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nForward-Looking Statements\n\nThis news release contains certain \"forward-looking information\" within the meaning of applicable Canadian securities laws that are based on expectations, estimates and projections as at the date of this news release. The information in this release about future plans and objectives of the Company, are forward-looking information. Other forward-looking information includes but is not limited to information concerning: the Debt Settlement, the approval of the TSXV, the intentions and future actions of senior management, the intentions, plans and future actions of the Company, as well as the Company’s ability to successfully mine digital currency; revenue increasing as currently anticipated; the ability to profitably liquidate current and future digital currency inventory; volatility of network difficulty and, digital currency prices and the resulting significant negative impact on the Company’s operations; the construction and operation of expanded blockchain infrastructure as currently planned; and the regulatory environment of cryptocurrency in applicable jurisdictions.\n\nAny statements that involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking information and are intended to identify forward-looking information.\n\nThis forward-looking information is based on reasonable assumptions and estimates of management of the Company at the time it was made, and involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information. The Company has also assumed that no significant events occur outside of the Company’s normal course of business. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. The Company undertakes no obligation to revise or update any forward-looking information other than as required by law.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230405005308/en/\n\nContacts\n\nMedia and Investor Relations Inquiries\n\nSean Ty\n\nChief Financial Officer\n\nir@cathedra.com"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjU1MTEvbWljcm9zdHJhdGVneS1idXlzLW1vcmUtYml0Y29pbi1icmVhay1ldmVuLXByaWNl0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTUxMS9taWNyb3N0cmF0ZWd5LWJ1eXMtbW9yZS1iaXRjb2luLWJyZWFrLWV2ZW4tcHJpY2U_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "MicroStrategy Buys More Bitcoin as Asset Nears Company’s Break Even Price - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin had a terrific quarter—up over 68% since the start of the year—and that’s led software giant MicroStrategy to double down on its crypto bet just as the company’s initial investment closes in on profitability.\n\nThe software company today announced it had bought another 1,045 coins, or $29.3 million into the asset. Now, MicroStrategy has spent a total of $4.1 billion on the world’s biggest cryptocurrency—making it the public company with the largest stash of Satoshis in the world.\n\nAD\n\nAD\n\nIts long-term bet on the cryptocurrency is close to becoming profitable after the asset had wild price swings since 2020: its 140,000 BTC were bought at an average price of $29,803 per coin—meaning that if the asset jumps in value by 6%, or $1,780.91, the company will have made a profit.\n\nThe latest buy comes as Bitcoin has a great start to 2023: it is currently trading for $27,958 per coin, according to CoinGecko data. At the start of the year it was priced at $16,615.\n\nBut despite soaring in value this year, Bitcoin is still down 60% from the all-time high of $69,044 it touched in November 2021.\n\nMicroStrategy has acquired an additional 1,045 #bitcoin for ~ $29.3M at an average price of $28,016 per bitcoin. As of 4/4/2023 @MicroStrategy holds 140,000 bitcoin acquired for ~$4.17 billion at an average price of $29,803 per bitcoin. $MSTR https://t.co/IBufTxalnv — Michael Saylor⚡️ (@saylor) April 5, 2023\n\nMicroStrategy’s founder Michael Saylor decided to buy Bitcoin back in 2020 as a hedge against inflation just as COVID lockdowns began shutting down global economies. The investment appeared prescient the following year as Bitcoin went on a historic bull run.\n\nSaylor—who was CEO back then—claimed at the time that Bitcoin was a “dependable store of value and an attractive investment asset with more long-term appreciation potential than holding cash.”\n\nAD\n\nAD\n\nMicroStrategy has since increased its holdings by slowly buying 140,000 BTC over the past two and a half years, and Saylor is still convinced it is a safe investment.\n\n“Our [MicroStrategy’s] strategy is to buy and hold Bitcoin, and the key for us is to be consistent, transparent and responsible in the pursuit of that strategy,” he said last month.\n\nMicroStrategy stock is also up by over 95% since the first Bitcoin buy; Saylor has said that buying shares in the company is a way investors can get safe exposure to Bitcoin."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZGVjcnlwdC5jby8xMjU2MTIvYXBwbGVzLWhpZGRlbi1iaXRjb2luLXdoaXRlcGFwZXItdGhlLWxhdGVzdC1pbi1hLWxvbmctbGlzdC1vZi1lYXN0ZXItZWdnc9IBaWh0dHBzOi8vZGVjcnlwdC5jby8xMjU2MTIvYXBwbGVzLWhpZGRlbi1iaXRjb2luLXdoaXRlcGFwZXItdGhlLWxhdGVzdC1pbi1hLWxvbmctbGlzdC1vZi1lYXN0ZXItZWdncz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple's Hidden Bitcoin White Paper the Latest in a Long List of Easter Eggs - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Bitcoin white paper has been hiding in plain sight on Apple computers.\n\nBlogger Andy Baio recently revealed that an innocuous file, \"simpledoc.pdf,\" included as part of Apple operating system MacOS, contains a copy of the foundational text of Bitcoin, written by pseudonymous founder Satoshi Nakamoto in 2008.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto’s Bitcoin white paper apparently shipped with every copy of macOS since Mojave in 2018.\" Baio wrote on his Waxy blog, \"I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them.\"\n\nAD\n\nAD\n\nAlthough Baio uncovered the mysterious easter egg on Satoshi Nakamoto's purported 48th birthday, April 5th, 2023, it’s not the first time it’s been sighted. Twitter user Joshua Dickens, a former Apple product designer, first discovered the white paper lurking in MacOS in 2020, but his tweet did not gain much traction.\n\nWeirdly, there's also a PDF of the original Bitcoin white paper: pic.twitter.com/JjPnI4fyzc — Josh D (@schwa23) November 28, 2020\n\nHow to find the Bitcoin white paper on Apple computers\n\nThe Bitcoin white paper can be found on Apple computers running macOS Mojave or later, by entering the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAlternatively, using Finder, navigate to the Macintosh HD -> System -> Library -> Image Capture -> Devices, and open the Contents -> Resources folder, where you’ll find the file “simpledoc.pdf.”\n\nAD\n\nAD\n\nThe white paper appears to be used as a sample document for the image capture device Virtual Scanner II, with Apple site MacRumors suggesting that it could be a sample document for a system for transferring photos from iOS devices to Macs.\n\nIn his 2020 Twitter thread, Dickens highlighted another peculiar file, named cover.jpg, in the same folder. This has been confirmed to be a photograph taken by Thomas Hawk named Warning Alarm System, taken on Treasure Island in San Francisco in 2008.\n\nIn 2021, a thread was made on the Apple forum to discuss these findings but, again, gained very little traction. One user even commented, \"I find it hard to believe anyone cares.\"\n\nHow did the Bitcoin white paper end up on Apple computers?\n\nThe Bitcoin white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" sets out the thesis for a decentralized cash based on a public ledger, essentially birthing Bitcoin and cryptocurrency in turn.\n\nIt is unclear why or how the Bitcoin white paper ended up on Apple systems. The company has a long history of including easter eggs in its products, however, including references to “Star Wars” and “Lord of the Rings.\" Earlier versions of the Macintosh operating system had hidden, playable versions of Tetris, Pong, and snake, and its MacOS and mobile application icons have always featured hidden messages or meanings.\n\nThe Bitcoin white paper appears to be the first crypto-related easter egg that has been found buried in Apple software.\n\nBaio himself speculated that the white paper could have been included as an in-joke by a “secret Bitcoin maxi” working at Apple, or simply included as a “convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nIts inclusion on Apple computers is particularly surprising given that the company’s former App Store director Philip Shoemaker has claimed that the company “had a problem with crypto from day one.” Speaking earlier this year, Shoemaker told Decrypt that Apple leadership considered cryptocurrency to be “a Ponzi scheme” and had maintained an arbitrarily harsh stance against crypto and NFTs.\n\nAD\n\nAD\n\nApple's insistence on imposing its 30% App Store fee on crypto apps prompted many developers to protest its policy, with some calling for a boycott of iOS.\n\nIn a 2021 interview, Apple CEO Tim Cook said that he owns some crypto, but that the company had no plans to invest in it as an asset class. “I think it’s reasonable to own it as part of a diversified portfolio,” Cook said.\n\nDecrypt has reached out to Apple for comment and will update this article should we receive a response."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvbmV3cy9hcnRpY2xlLTExOTQ2OTE1L0V2ZXJ5LU1hYy1jb250YWlucy1ISURERU4tQml0Y29pbi1tYW5pZmVzdG8td3JpdHRlbi1mYXRoZXItY3J5cHRvY3VycmVuY3kuaHRtbNIBhAFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvbmV3cy9hcnRpY2xlLTExOTQ2OTE1L2FtcC9FdmVyeS1NYWMtY29udGFpbnMtSElEREVOLUJpdGNvaW4tbWFuaWZlc3RvLXdyaXR0ZW4tZmF0aGVyLWNyeXB0b2N1cnJlbmN5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Every Mac contains a HIDDEN Bitcoin manifesto written by 'the father of cryptocurrency - Daily Mail",
        "content": "Every Apple Mac computer sold since 2018 contains the original Bitcoin manifesto - prompting experts to question whether the tech firms are secretly collaborating.\n\nA white paper by the elusive 'Father of Bitcoin' Satoshi Nakamoto which lays out the value of the digital currency can be found as a PDF on the devices.\n\nThe discovery was made by tech blogger Andy Baio who asked whether there was a 'secret Bitcoin maxi' working for Apple.\n\nThe term 'Bitcoin maxi' refers to those who devotedly believe Bitcoin is the most superior digital currency.\n\nOthers pointed out that it was strange given Apple temporarily banned Bitcoin from its app store in 2014 amid concern over volatile cryptocurrencies.\n\nA copy of the 2008 Bitcoin manifesto is hidden on every Apple MacOS sold since 2018, expert discovers\n\nThe discovery was made by tech blogger Andy Baio who asked whether there was a 'secret Bitcoin maxi' working for Apple\n\nBitcoin was founded in 2008 by Namatoko and was the first ever cryptocurrency to exist\n\nBaio was attempting to fix his printer when he found the 184 kilobyte document which was built in as a sample on the Image Capture function.\n\nHe asked 'over a dozen' of his friends who confirmed the text was also hidden in their devices under the filename 'simpledoc.pdf.'\n\nThe paper - titled 'Bitcoin: A peer-to-peer electronic cash system' outlines the case for implementing digital currencies globally.\n\nIt was first published by Nakamoto in October 2008 when the world was reeling from the financial crisis.\n\nThe founder - whose identity remains a mystery - argued the way stop future collapses was through a digital currency which allowed people to make payments online 'without going through a financial institution.'\n\nHow to find the Bitcoin manifesto on YOUR laptop If you’re on a Mac, open a Terminal via the spotlight search. Do this by clicking on the small magnifying glass icon in the menu bar and typing in 'terminal.app.' From there type in the following command: open /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf If you’re on macOS 10.14 or later, the Bitcoin PDF should immediately open in Preview. The whitepaper is used as a sample text for a device called 'Virtual Scanner II' which is either hidden or not installed for everyone by default In Image Capture, select the “Virtual Scanner II” device if it exists, and in the Details, set the Media to 'Document; and Media DPI to “72 DPI.” You should see the preview of the first page of the Bitcoin paper. Source: Andy Baio via waxy.org Advertisement\n\nHe argued it would stop greedy banks from abusing their customers' funds.\n\nAfter making the discovery, Baio wrote on his site Waxy.org: 'Of all the documents in the world, why was the Bitcoin whitepaper chosen? Is there a secret Bitcoin maxi working at Apple?\n\n'Maybe it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.'\n\nAfter the post went viral Baio updated his blog to reveal Apple employees were aware of the issue - but had failed to take action yet.\n\nHe wrote: 'A little bird tells me that someone internally filed it as an issue nearly a year ago, assigned to the same engineer who put the PDF there in the first place, and that person hasn’t taken action or commented on the issue since.'\n\nHe added it was 'likely' the document will be scraped from future models.\n\nSocial media users were also quick to speculate on what the link between the two firms meant.\n\nRoberto Nixon wrote on Twitter: 'Either the company stands behind Bitcoin and its mission and this is their way of pledging support — or a rogue engineer is about to feel the wrath of their legal team.'\n\nBitcoin was founded in 2008 by Namatoko and was the first ever cryptocurrency to exist.\n\nLittle is known about Namatoko's identity and he is believed to have used a pseudonym.\n\nIn 2014 he was incorrectly identified by Newsweek as Japanese-American Dorian S Nakamoto - who denied having anything to do with the cryptocurrency.\n\nIn 2021 computer scientist Craig Wright appeared to be unmasked as the Bitcoin inventor in a Florida lawuit.\n\nHe was being sued by the family of the deceased David Kleiman who alleged he helped to create the currency and therefore they were worthy of a stake in the fortune.\n\nAfter the post went viral Baio updated his blog to reveal Apple employees were aware of the issue - but had failed to take action yet\n\nDorian Satoshi Nakamoto was incorrectly identified as Bitcoin founder Satoshi Nakamoto in 2014\n\nDavid Kleiman (left) and Craig Wright (right) appeared to be unmasked as the founders Bitcoin as part of a Florida lawsuit but the court never ruled on whether they were genuinely 'Satoshi Nakamoto'\n\nWhile Wright lost the suit, the court never ruled on whether the pair were truly 'Satoshi Nakamoto.'\n\nSince recent financial turbulence broke out following the collapse of Silicon Valley Bank, Bitcoin saw a 24 percent increase in its value.\n\nThe token was hovering at around $27,925 Thursday."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tYXJhdGhvbi1kaWdpdGFsLXBvc3RzLXF1YXJ0ZXJseS1yZWNvcmQtb2YtMi0xOTUtYml0Y29pbi1taW5lZC1pbi1xMdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Marathon Digital posts quarterly record of 2,195 Bitcoin mined in Q1 - Cointelegraph",
        "content": "Bitcoin (BTC) mining firm Marathon Digital has reported a quarterly record of 2,195 BTC mined over the first quarter of 2023, currently worth around $62 million.\n\nMarathon reported in an April 3 update that the 2,195 mined BTC is a 74% increase from the first quarter of last year and a 41% increase from Q4 2022.\n\nIt comes on the back of the miner increasing its operational hash rate by 195% from Q1 2022.\n\nMarathon also recorded a monthly record of 825 BTC mined in March — currently valued at around $23.3 million — and marked a 21% production increase from February.\n\n$MARA's March Production Update is here:\n\n- Increased #Bitcoin Production 21% MoM\n\n- Produced a Record 825 BTC in March ’23\n\n- Produced a Record 2,195 BTC in Q1 ’23\n\n- Increased Hash Rate 64% in Q1 ’23 (11.5 EH/s)\n\n- Reported Unrestricted Cash and Cash Equiv. of $124.9M\n\n- Increased… pic.twitter.com/Jc1ACI2kY2 — Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) April 3, 2023\n\nIn a statement, CEO Fred Thiel said Marathon made “notable progress” on executing its two primary initiatives for 2023 — to energize its previously purchased mining rigs to reach 23 exahashes by the end of the second quarter and to optimize performance.\n\nThe firm is now exactly on target, having increased its operational hash rate from 7.0 exahashes on Jan. 1 to 11.5 exahashes as of March 31.\n\nMarathon’s management attributed the increase in efficiency to it bringing online 25,900 Bitcoin miners based in various facilities in North Dakota, bringing its fleet to 105,200 mining rigs as of April 1.\n\nMarathon explained its operational improvements cleaned up part of its balance sheet by wiping out $50 billion in debt in addition to repaying its loan back to the now-failed Silvergate Bank:\n\n“We reduced our debt by $50 million and increased our unrestricted Bitcoin holdings by 3,132 Bitcoin after we prepaid our term loan and terminated our credit facilities with Silvergate Bank.”\n\nThe firm finished the quarter with approximately $124.9 million in unrestricted cash and cash equivalents, and 11,466 BTC, which equates to over $450 million.\n\nMarathon noted the figures have not been audited.\n\nMarathon’s figures show a stronger first quarter after tough market conditions in 2022. Source: Marathon Digital\n\nRelated: Bitcoin ASIC miner prices hovering at lows not seen in years\n\nMarathon expects operational efficiencies to continue having purchased a new batch of Antminer S19 XPs Bitcoin mining rigs that are said to be nearly 30% more efficient than the Antminer S19 Pro.\n\nOnce those miners are installed approximately 66% of Marathon’s hash rate will come from the S19 XPs, it said.\n\nThe design of S19 XPs has, however, been criticized by fellow Bitcoin mining firm Compass Mining.\n\nIn a March report the firm identified “three flaws” of the new S19s which may result in the mining rig overheating, or in some cases, shutting down completely.\n\nMagazine: Hodler’s Digest: FTX EU opens withdrawal, Elon Musk calls for AI halt, and Binance news"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vYXBwbGVpbnNpZGVyLmNvbS9hcnRpY2xlcy8yMy8wNC8wNS9iaXRjb2luLXdoaXRlcGFwZXItZm91bmQtaGlkZGVuLWluLW1hY29zLXdpdGgtdW5rbm93bi12aXJ0dWFsLXNjYW5uZXItaWktYXBw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin whitepaper found hidden in macOS with unknown 'Virtual Scanner II' app - AppleInsider",
        "content": "If you buy through our links, we may get a commission. Read our ethics policy\n\nThe Bitcoin whitepaper his hidden within macOS\n\nSatoshi Nakamoto's Bitcoin whitepaper can be found in any Mac running macOS Catalina or newer, but no one knows why.\n\nThere are a lot of hidden files on macOS that won't appear unless the user is performing a specific function or test. However, most of these files are not meant to be discovered by average users.\n\nAndy Baio, a blogger with an extensive history in the tech community, shared an odd discovery on his blog Waxy — the Bitcoin whitepaper can be found on any Mac running recent versions of macOS. It can be discovered via a simple Terminal command or by navigating Finder.\n\nOn any Mac running macOS Catalina or later, enter the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nIt should immediately open the Bitcoin whitepaper in Preview. This has been confirmed to only work on devices back to macOS Catalina, but older operating systems may have the file too.\n\nTo discover the file via Finder:\n\nThe user needs to navigate to the Macintosh HD -> System -> Library -> Image Capture -> Devices. Control-click on VirtualScanner.app and Show Package Contents, then open the Contents -> Resources folder -> simpledoc.pdf.\n\nBaio reports that the Bitcoin whitepaper is used as a sample document for a device called \"Virtual Scanner II.\" This device is hidden for some users or not installed by default.\n\nAfter some digging, Baio discovered that he wasn't the first to find this hidden scanner or Bitcoin document. In 2021, an Apple Community post asked about it, and an odd photo taken on Treasure Island found in the Virtual Scanner II app.\n\nIt is indeed a mystery. No one in or out of Apple has stepped forward to explain why these files exist or what Virtual Scanner II is for."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA2L25hc3NpbS1uaWNob2xhcy10YWxlYi1vbi1iaXRjb2luLXZhY2NpbmVzLXN2Yi1zdG9ja3MtYW5kLXJpc2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Nassim Nicholas Taleb On Bitcoin, Vaccines, SVB, Stocks and Risk - Bloomberg",
        "content": "Listen to Odd Lots on Apple podcasts\n\nListen to Odd Lots on Spotify\n\nSubscribe to the newsletter\n\nRead the transcript\n\nNassim Nicholas Taleb would like some of his biggest fans to know that they misunderstand his famous worldview."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmluZHkxMDAuY29tL3NjaWVuY2UtdGVjaC9hcHBsZS1tYWNib29rLWJpdGNvaW4tZmlsZS1oaWRkZW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "There's a secret file about bitcoin hiding in your MacBook - here's how to find it - indy100",
        "content": "Many MacBook owners take comfort in the fact that Apple products come with some pretty robust security protections in to prevent unwanted files from making their way onto their laptop, but there’s one hidden document about bitcoin lurking in the computer’s folders that not even Apple is telling you about.\n\nIt turns out that hiding in the system files of MacBooks is a blueprint or research paper on the creation of the cryptocurrency, penned by its pseudonymous and rumoured founder Satoshi Nakamoto.\n\nTitled ‘Bitcoin: A Peer-to-Peer Electronic Cash System’, the paper’s abstract notes a “purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution”.\n\nSign up to our free Indy100 weekly newsletter\n\nIt continues: “Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network.\"\n\nIronically, for a nine-page paper containing such a complex idea the file on your MacBook is in fact titled ‘simpledoc’.\n\nHow to find the hidden bitcoin paper? First of all, go to Finder – that’s the app with a blue and white smiley face icon. Once there, find a way to get to the view of Macintosh HD. One way of doing this is going to ‘Go’ in the navigation bar at the top of the screen and selecting ‘Computer’. After that, you’ll want to click System, then Library, then Image Capture, then finally, Devices. Once there, you’ll see a VirtualScanner file. Don’t click it (it did nothing for us), but instead right-click to open up the options view. There, you’ll want to click ‘show package contents’. Then click on the Contents folder, then Resources, and there you are.\n\n\n\n\n\nAs well as housing the bitcoin paper, this folder also contains more unusual files, including blank image files titled ‘bed2’, ‘edge2’ and ‘top2’, as well as a picture of a wooden blue door with the number six on it, and a sign warning of an alarm system being in place.\n\nThere’s also another image file, titled ‘grid’, which contains an 8x6 grid of the numbers 1 to 48, if you’re looking for a fun way to waste your time, or play an incomplete game of Snakes and Ladders.\n\nSimilarly, there’s a four-page PDF document in which every page contains a large number denoting the page number. It’s very weird.\n\nThis bizarre easter egg – if you can call it that – was shared by tech blogger Andy Baio on Wednesday, and before that, only a handful of other people have spotted it.\n\nAs for why it’s even there in the first place, Baio writes in a blog post: A little bird tells me that someone internally filed it as an issue nearly a year ago, assigned to the same engineer who put the PDF there in the first place, and that person hasn’t taken action or commented on the issue since.”\n\nWell, now you know. You’re welcome.\n\nHave your say in our news democracy. Click the upvote icon at the top of the page to help raise this article through the indy100 rankings."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zd2lzcy1zdGF0ZS1vd25lZC1iYW5rLXBvc3RmaW5hbmNlLXRvLW9mZmVyLWJpdGNvaW4tdHJhZGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Swiss state-owned bank PostFinance to offer Bitcoin trading - Cointelegraph",
        "content": "PostFinance, a retail bank fully owned by the Swiss government, is preparing to offer its customers cryptocurrency trading and storage services.\n\nPostFinance has partnered with the local cryptocurrency bank Sygnum to offer its customers a range of regulated digital asset banking services, the firms announced on April 5.\n\nThe partnership will specifically allow PostFinance customers to buy, store and sell major cryptocurrencies, including Bitcoin (BTC) and Ether (ETH).\n\nThe crypto services are enabled through Sygnum’s institutional business-to-business offering that provides banks with market entry to regulated and compliant digital products. The B2B network includes more than 15 partner banks and supports a “range of cryptocurrencies,” featuring revenue-generating services like staking.\n\nSygnum’s B2B banking Plug-n-Play setup gives partner banks the opportunity to go live with a GUI-based solution within 60 days while enabling access to its entire suite of digital asset products, Sygnum’s chief B2B officer Fritz Jost told Cointelegraph.\n\n“However, unlike other deployments, PostFinance involves a bespoke setup and uses Sygnum’s B2B banking platform API to natively integrate digital asset custody, trading and market-data into their e-banking,” Jost noted. He added that PostFinance will use Sygnum’s services to provide digital asset custody for their clients, while Sygnum would act as a sub-custodian.\n\nPostFinance’s move into crypto comes in response to a growing demand from its customers, the bank’s chief investment officer Philipp Merkt noted, stating:\n\n“Digital assets have become an integral part of the financial world, and our customers want access to this market at PostFinance, their trusted principal bank.”\n\nFounded in 1906, PostFinance is the financial services unit of Swiss Post, Switzerland’s national postal service. The public company is known for its pro-crypto stance, building its own crypto custody platform and issuing digital collectibles linked to physical stamps in 2021.\n\nRelated: Brazil bank BTG Pactual to issue USD-pegged stablecoin\n\nThe announcement on PostFinance’s crypto trading services comes shortly after Swiss Post announced the launch of Crypto Stamp 3.0, a new crypto stamp iteration featuring physical and nonfungible token versions integrated with artificial intelligence technology. Swiss Post’s new crypto stamp is scheduled to go on sale on May 2, 2023.\n\nPostFinance did not immediately respond to Cointelegraph’s request for comment.\n\nMagazine: Best and worst countries for crypto taxes — Plus crypto tax tips"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmludmVyc2UuY29tL3RlY2gvYml0Y29pbi13aGl0ZS1wYXBlci1oaWRkZW4tbWFjb3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Manifesto is Hidden In Every Copy of MacOS, and No One Knows Why - Inverse",
        "content": "I’m staring at the original Bitcoin white paper on my monitor, not because I’ve decided to get into crypto, but because it’s somehow been on my MacBook Pro without my knowledge. Developer and veteran blogger Andy Baio discovered the document while trying to fix his printer, and apparently, it’s been buried in a hidden app in macOS since at least macOS Mojave, released all the way back in 2018.\n\nWhy Apple (or at least one of Apple’s engineers) would include a document explaining how Bitcoin works in its desktop operating system is unknown, but the mystery is more complicated than an unexpected PDF.\n\nWhat Is Virtual Scanner II?\n\nThe Bitcoin white paper could be buried in the Mac you’re using to read this. Screenshot by Ian Carlos Campbell\n\nThe white paper is called “simpledoc.pdf” on macOS Mojave (10.14) or later and can be pulled up easily in Preview by dropping the following command in Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nIf entered correctly, you should be able to see the exact same text that’s freely available on bitcoin.org and acts as the manifesto for the currency and the early crypto movement in general. Not the kind of thing you’d expect to see hanging out in an operating system used by millions of people, let alone one from a company as buttoned up as Apple.\n\nBaio found that using the macOS Image Capture utility, the white paper is displayed as a sample document for a device called “Virtual Scanner II.” It’s not clear what this device is for, and it's seemingly not activated or visible to everyone by default, but Baio speculates it could be related to the iPhone’s ability to scan documents onto your Mac.\n\nThis isn’t the first time the white paper has been discovered, and it’s also not the only strange file lurking in Apple’s operating system. A photo of a sign from Treasure Island is also just chilling in there, waiting to be discovered too.\n\nBut Why the Bitcoin White Paper?\n\nWe may have a “Doge” situation on our hands. Screenshot by Ian Carlos Campbell\n\nApple's stance on cryptocurrencies and blockchain technologies is pretty strict in general. While it’s ostensibly okay with crypto-adjacent apps in the App Store, the company’s App Review Guidelines disapprove of apps that accept crypto payments, mine for cryptocurrencies on devices, or award cryptocurrencies for specific tasks, which removes the main reasons people might want to use a virtual currency in the first place.\n\nA company’s employees do not have to share the official stances of the company they work for, and Apple is an awfully big company. It’s just as possible that there’s a Bitcoin maximalist hoping the discovery of Bitcoin creator Satoshi Nakamoto’s white paper in Apple products will help burn down the financial system as it is that this is a freak accident. Still, it is ironic and, as MacRumors notes, could spark even more interest in the mysterious identity of Bitcoin’s creator in the first place.\n\nThe speculative and reactionary culture of the crypto world makes discoveries like these valuable for other reasons — mainly because they tend to juice the price of individual coins. Why does the web version of Twitter have a picture of “Doge” in the place of the social platform's iconic bird? Well, it’s either because Elon Musk is trying to shift the price of Dogecoin, or he’s poking fun at the fact that he’s being sued for supposedly running a Dogecoin pyramid scheme. Neither answer makes perfect sense, but either way, the number goes up. Hiding the Bitcoin white paper in macOS could be an attempt to achieve the same effect for a much more widely known and held coin.\n\nDoes This Even Matter?\n\nNot in terms of your day-to-day use of macOS, but it is a good reminder that operating systems are made by people, with values all their own, over a series of iterations, and across multiple teams. Things get forgotten, tests go unresolved, and features end up unimplemented. Apple has created an air of perfection around itself, not because it’s actually perfect, but because its choices seem intentional. Hiding a mysterious document could be intentional too, or it could stand out because the rest of the operating system is designed not to. But until someone comes forward, it might have to remain a mystery."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aG9sZWNvaW5lci1hZGRyZXNzZXMtd2l0aC1tb3JlLXRoYW4tMS1iaXRjb2luLWRvdWJsZWQtc2luY2UtMjAxNi_SAV9odHRwczovL2NyeXB0b3BvdGF0by5jb20vd2hvbGVjb2luZXItYWRkcmVzc2VzLXdpdGgtbW9yZS10aGFuLTEtYml0Y29pbi1kb3VibGVkLXNpbmNlLTIwMTYvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "“Wholecoiner” Addresses With More than 1 Bitcoin Doubled Since 2016 - CryptoPotato",
        "content": "According to on-chain analytics provider Glassnode, there are almost a million addresses holding more than one Bitcoin. Furthermore, the number of “wholecoiner” addresses has doubled since around mid-2016.\n\nIt plateaued at just over 800,000 addresses during the last cycle peak but has increased during the cycle bottom of late 2022 and into 2023 as investors accumulated.\n\nThis statistic is remarkable because there are more than 56 million millionaires in the world.\n\nHowever, with BTC trading at around $28,000, it will be quite some time before one coin will make a holder a millionaire!\n\nBinance CEO Changpeng Zhao, who has been a victim of fake news this week, made the observation on April 6.\n\nThere are more than 56 million millionaires in the world, and only 1 million people with more than 1 bitcoin. Do the math. https://t.co/k7gWNtRzkf pic.twitter.com/H6suIxRkj2 — CZ 🔶 Binance (@cz_binance) April 5, 2023\n\nBitcoin Scarcity Leads to Demand\n\nAnother observation crypto advocates like to make is dividing the total supply of Bitcoins by the world’s population. This works out at around 0.002616 BTC per person, so those holding more than one coin really are a rarity.\n\nThe scarcity of the asset with its finite supply has traditionally been a driver of demand. This has been clearly evident in previous cycles, which are catalyzed by halving events.\n\nThe next Bitcoin halving is due between April and May 2024, depending on what counter is referenced. The current block reward of 6.25 BTC will be halved to 3.125 BTC decreasing issuance and making the asset scarcer.\n\nBitcoin markets have already reached a transition or inflection point, as reported by CryptoPotato. The slow grind higher is likely to continue this year if history rhymes.\n\nThe real bull rally should follow the halving event and occur in the latter half of 2024 if previous cycles are anything to go by.\n\nGlassnode has just added the Bitcoin fear and greed index to its charts to ascertain market sentiment and compare it to previous peaks and troughs.\n\nThe sentiment is currently in a state of “greed” following Bitcoin’s 25% gain over the past month.\n\nWe have recently added the #Bitcoin Fear and Greed Index, which is now firmly within Greed territory. Will this rally push $BTC into Extreme Greed like 2019, and 2021? Or be overwhelmed by resistance like March 2020, or the 2022 deleveraging? 📊https://t.co/89w49UkXnC pic.twitter.com/k8NpbmiGtm — glassnode (@glassnode) April 5, 2023\n\nBTC Price Outlook\n\nBitcoin prices have been consolidating for almost three weeks now, with very little movement since March 18.\n\nThe asset has dipped 1.4% on the day in a fall to $28,094 at the time of writing, according to CoinGecko. Support lies at the $27,000 level, where it fell on March 28, and longer-term resistance is at $30,000, a price not visited since early June."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjU1NzUvbm9ydGgtY2Fyb2xpbmEtY291bnR5LW11bGxzLTEteWVhci1iaXRjb2luLW1pbmluZy1tb3JhdG9yaXVt0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTU3NS9ub3J0aC1jYXJvbGluYS1jb3VudHktbXVsbHMtMS15ZWFyLWJpdGNvaW4tbWluaW5nLW1vcmF0b3JpdW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "North Carolina County Mulls 1-Year Bitcoin Mining Moratorium - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNorth Carolina’s Buncombe County is considering a 1-year moratorium on new and existing Bitcoin mining operations in the area.\n\nThe pause would give the county's Board of Commissioners time to “develop standards and mitigation methods for intensive land uses that may pose detrimental harm to the natural environment,” reads a county document first reported by local news outlet News 13 WSOL.\n\nThe board will discuss and finalize the issue in a public hearing on May 2, 2023.\n\nAD\n\nAD\n\nCrypto mining refers to the process of verifying and validating transactions on a proof-of-work (PoW) blockchain. Bitcoin is the largest PoW blockchain, with Ethereum having just switched to a proof-of-stake (PoS) blockchain last September.\n\nBuncombe County's board plans to classify cryptocurrency mining separately from data centers.\n\nUntil then, the moratorium will restrict zoning certification permits for cryptocurrency mining.\n\nPrevious reports indicate that Buncombe is taking a closer look into crypto mining in the county after the activity stirred controversy in neighboring Cherokee County, specifically over how loud these operations can be.\n\nIn response, Buncombe County Commissioner Terri Wells said at that time that “it’s just something I’d rather be proactive in looking at.”\n\nAD\n\nAD\n\nBitcoin mining around the world\n\nIn November 2022, New York's governor ratified a similar 2-year moratorium on new proof-of-work (PoW) Bitcoin mining operations.\n\nChampioned by New York assembly member Anna R. Kelles, the bill will pause \"permits from being issued for two years to proof-of-work cryptocurrency mining operations that are operated through electric generating facilities that use a carbon-based fuel.\"\n\n\"As New York and Buncombe County look to halt digital asset mining, numerous other jurisdictions are welcoming the innovation, jobs, and revenue,\" the Digital Chamber of Commerce's VP of policy Cody Carbone told Decrypt. \"I believe these efforts are shortsighted, but will not impact the growth of this industry long term.\"\n\nChina’s government reiterated its ban on Bitcoin mining operations in 2021, calling crypto-related businesses \"illegal financial activities.\"\n\nSince then, the U.S. has become the major hub for miners, with American firms accounting for 37.8% of the entire network’s hash rate today, per the Cambridge Bitcoin Electricity Consumption Index (CBECI)."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kZWJ1bmtpbmctdGhlLW15dGgtY3J5cHRvY3VycmVuY3ktaXMtdXNlZC1mb3ItY3JpbWluYWwtYWN0aXZpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Debunking the myth: Cryptocurrency is used for criminal activity - Cointelegraph",
        "content": "Cryptocurrency is often associated with criminal activity, but this is mostly a myth, especially today. Bitcoin (BTC) and other cryptocurrencies don’t provide complete anonymity due to the Know-Your-Customer (KYC) policies implemented by most crypto exchanges. Even without KYC scanning, law enforcement agencies can easily track crypto transactions to identify criminal activity, as the blockchain is transparent and immutable.\n\nIn 2019, United States Treasury Secretary Steven Mnuchin said that Bitcoin was a national security issue, since it had been used for illicit activities. To him, cryptocurrencies were dominated by illegal activities and speculation. But the facts say otherwise.\n\nThough illicit crypto volumes reached an all-time high at $20.6 billion in 2022 (primarily due to sanctioned entities), the share of all crypto activity linked with illegal activity was only 0.24%.\n\nSource: Chainalysis\n\nThis pales in comparison to the $800 billion–$2 trillion laundered through traditional financial systems in fiat — about 2% to 5% of the global GDP.\n\nOne of blockchain’s defining features is its inherent transparency. All transactions are logged on a publicly accessible ledger, allowing anyone to view the entire codebase at any time. Utilizing cryptocurrencies for illicit activities leaves a clear trail of evidence that prosecutors can use to secure convictions. Europol and the Basel Institute on Governance have emphasized the importance of cryptocurrencies in combating organized crime. It is virtually impossible to transfer significant amounts of crypto without getting noticed.\n\nCrypto exchanges share expertise and resources with law enforcement agencies\n\nContrary to popular belief, crypto exchanges continue to be one of the primary allies in the fight against criminal activity. For example, Binance, the world’s largest exchange by trading volume, has been very active in helping authorities in line with its mission to further security of the larger crypto ecosystem.\n\nIn 2022, the Binance Investigations team responded to over 47,000 law enforcement requests, with an average response time of three days, which is significantly faster than any traditional financial institution.\n\nBinance has assisted many critical operations that brought down criminal groups operating with dozens to hundreds of millions of U.S. dollars. In 2021, the Binance Investigations team played a vital role in an international investigation with law enforcement agencies from Ukraine, South Korea, the U.S., Spain and Switzerland that dismantled a cybercriminal ring responsible for over $500 million in illict activity. The group, known as Fancycat, had been running multiple criminal activities, such as distributing cyberattacks, operating a high-risk exchanger, and laundering money from dark web operations and high-profile cyberattacks like Cl0p and Petya ransomware.\n\nIn most cases, crypto exchanges are not used in order to harbor criminals, but act as intermediaries for laundering stolen or otherwise ill-gotten profits.\n\nSource: Binance\n\nBesides sharing resources and being involved in cybercrime investigations, Binance is actively helping law enforcement staff with understanding how blockchain and cryptocurrencies operate and may be used in illicit activities. In September 2022, the crypto exchange formally launched its Global Law Enforcement Training Program, which includes individual and group training, workshops and other activities. The training program is led by a team of skilled professionals, including security experts and former law enforcement officers who participated in the crackdown on Silkroad and Hydra.\n\nBinance is proactively building a more secure crypto ecocystem and working with law enforcement around the world to help detect financial and cybercrimes and assisting the prosecution of bad actors.\n\nLaw enforcement agencies remain the spearhead of the collective fight against crime. Acquiring the required resources, skills and tools to reduce illicit crypto activity is imperative, and crypto exchanges like Binance play a crucial role, thanks to their position.\n\nLearn more about Binance"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZm9ya2FzdC5uZXdzL3BheGZ1bC1iaXRjb2luLWV4Y2hhbmdlLXJlZ3VsYXRvcnktc3RhZmYv0gFCaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvcGF4ZnVsLWJpdGNvaW4tZXhjaGFuZ2UtcmVndWxhdG9yeS1zdGFmZi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Paxful suspends Bitcoin exchange due to regulatory challenges, staff departures - Forkast News",
        "content": "Ray Youssef, the chief executive of Paxful Bitcoin exchange, announced the indefinite suspension of the marketplace on Tuesday, citing regulatory challenges and staff departures.\n\nSee related article: SEC Chair urges more resources to regulate crypto and technology at House Subcommittee hearing\n\nFast facts\n\nAll customer funds are accounted for, and safeguarding client assets is the exchange’s priority, Youssef said. He also encouraged customers to withdraw and self-custody their assets.\n\nYoussef added that the exchange’s regulatory challenges mostly came from the U.S.\n\nPaxful joins a growing list of cryptocurrency exchanges closing shop due to legal hurdles in the U.S.\n\nLast Friday, Bittrex, a Seattle-based crypto exchange, announced that it is winding down to close its U.S. operations, citing regulatory challenges.\n\nBeaxy, another U.S.-based platform, was shut down by the Securities and Exchange Commission for operating an unregistered exchange.\n\nU.S. regulators have been intensifying their crackdown on the industry recently. Last week, the Commodity Futures Trading Commission sued Binance, the world’s largest crypto exchange, for violating compliance rules.\n\nSee related article: Japan’s FSA steps up crypto regulation with warnings to Bybit, other exchanges"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vcHJvZmVzc2lvbmFsL2Jsb2cvY29uZmlkZW5jZS1pbi1iaXRjb2luLWdyb3dzLWFzLWl0LXBhc3Nlcy1hLWxpcXVpZGl0eS1zdHJlc3MtdGVzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Confidence in Bitcoin grows as it passes a liquidity stress test | Insights - Bloomberg",
        "content": "This analysis is by Bloomberg Intelligence Senior Market Structure Analyst Jamie Douglas Coutts. It appeared first on the Bloomberg Terminal.\n\nAlthough the rates narrative has dramatically shifted, Bitcoin continues to be the signal in the noise as its Q1 performance marks a significant milestone in its potential ascendancy as a global reserve asset. Even as the market prices in deflation and US authorities ramp up hostilities against the industry, confidence in the network based on the hashrate is hitting an all-time high.\n\nShift in market narrative\n\nWith backward-looking inflation prints remaining high, 2023 started with a consensus rates narrative of “high for longer”. Bitcoin’s outperformance of global assets had started in November and continued through the first two months of 2023, when the market narrative suddenly changed; a liquidity crisis in US banks was prompted by the Fed’s record-setting rate rises and the subsequent depositor exodus."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYWdpYy1lZGVuLXJvbGxzLWJpdGNvaW4tb3JkaW5hbHMtMTYwMDAwNjEwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Rolls Out Bitcoin Ordinals NFT Creator Launchpad - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nNon-fungible token (NFT) marketplace Magic Eden said Thursday it’s rolling out a creator launchpad for Ordinals, helping creators successfully inscribe their Bitcoin-based NFT collections.\n\nWhile the company already has the infrastructure for creators to list and sell Ordinals, the launchpad will help onboard creators to the ecosystem to easily facilitate the creation of tokens on the Bitcoin network. The process of inscribing an Ordinal NFT is far different from minting a digital asset on Ethereum, which poses a barrier to entry for many creators who aren’t familiar with the intricacies of Taproot and inscriptions. This led Magic Eden to find a way to help ease the process for the growing market of Ordinals collectors.\n\nSee Also: Crypto Custody Firm BitGo Releases Security Features Aimed at Bitcoin Ordinals\n\nZhuoxun Yin, chief operating officer and co-founder of Magic Eden, said in a press release that helping creators to mint Ordinals will help grow a larger market for tokenized assets on Bitcoin.\n\n“Bitcoin is the grandfather of all blockchains, and we believe it can be the home to pure digital artifacts,” said Yin. “With Ordinals, content can be preserved forever, and we're proud to be helping creators and the Ordinals community grow together.\"\n\nTo kick off its launchpad, Magic Eden is teaming with Ethereum-based NFT collection Godjira to release its Bitcoin-based (Dead)Jira collection on April 7. The company has also tapped creators Genopets, Lazy Lions, Humanoids and rapper Lil Durk to mint Bitcoin inscriptions on the new platform within the next week.\n\nThe excitement around Ordinals has grown since January and Magic Eden has been ready to embrace the growing market for inscriptions. Last month, Magic Eden released a Bitcoin NFT marketplace, allowing collectors to purchase Ordinals on the secondary market, integrating support for two Bitcoin wallets in doing so.\n\nStory continues\n\n\"We're on the ground level listening to what is needed from all of these subgroups of the Ordinals community, and we will look to deliver on those needs,\" said Head of Marketing at Magic Eden, Tiffany Huang. \"We think involvement of our expertise and resources is much needed to continue the growth of Ordinals and encourage a flourishing ecosystem.\"\n\nOutside of the Bitcoin network, Magic Eden has made an effort to expand its offerings outside of Solana, the layer 1 blockchain that put the marketplace on the map. Days after rolling out its Bitcoin NFT marketplace, Magic Eden established a Web3 gaming collective, bringing together leading blockchain-based game funds and publishers to help foster adoption in the space. Earlier in March, it kicked off \"Mint Madness,\" allowing users to mint free NFTs for over a dozen Web3 games.\n\nUPDATE (April 6 17:03 UTC): Added quotes from Magic Eden."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdoYWxlcy1wdXNoLWNob3Jlb2dyYXBoZWQtYnRjLXByaWNlLWFzLWV0aGVyLW5lYXJzLTJr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin whales push 'choreographed' BTC price as Ether nears $2K - Cointelegraph",
        "content": "Bitcoin (BTC) headed back toward $29,000 into April 5 as data showed whale orders guiding price action.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalysis: BTC price push still “bear market rally”\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it hit $28,780 on Bitstamp.\n\nThe pair continued a rebound from one-week lows under $27,300 at the start of the week courtesy of rumors around the Binance crypto exchange and its CEO, Changpeng “CZ” Zhao.\n\nAfter reclaiming $28,000, Bitcoin saw fresh momentum as Binance order book data showed large-volume “whale” traders buying.\n\n$BTC Binance Spot\n\nKeep an eye on the $28K area, those stacked buy walls will either support market buying here or will be pulled later.\n\n\n\nSupply is consistently being filled in these squeezes.\n\n\n\n6K BTC bought in past 1H candle pic.twitter.com/Dv7YzggCDu — Skew Δ (@52kskew) April 5, 2023\n\nThis was not all as it seemed for bulls, monitoring resource Material Indicators nonetheless warned, as those same traders could be artificially pushing the market higher in order to sell closer to $30,000.\n\n“Likely a choreographed attempt to push the distribution range up in the short term,” part of the accompanying commentary stated.\n\n“Personally still treating this as #BearMarketRally until proven otherwise.”\n\nA subsequent print of the order book with liquidity levels showed the spot price eating into a dense cloud of asks, potentially stranding latecomers choosing to go long BTC believing that the upside may continue.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nOthers were more hopeful that $30,000 could see a genuine challenge after being absent from the chart for nearly a year.\n\nAmong them was Michaël van de Poppe, founder and CEO of trading firm Eight.\n\n“Bitcoin looks eager to break the crucial barrier at $30K, while altcoins are also waking up,” he told Twitter followers on the day.\n\n“If Bitcoin makes that breakout, we'll probably see significant breakout across the board on altcoins as confidence comes back in the markets.”\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nAnalytics account IncomeSharks was similarly optimistic when it came to altcoins, in particular, opting to swap BTC exposure for alternatives at current prices.\n\n“Been waiting all year for this,” it announced.\n\n“If we can hold this and keep pushing up get ready to not care what Bitcoin does and make multiple X’s on alts. Part of me selling some $BTC at $28,000 is me wanting more exposure to alts.”\n\nTotal crypto market cap annotated chart. Source: IncomeSharks/ Twitter\n\nThe day prior, popular trader Crypto Tony had agreed that liquidity was “moving” away from Bitcoin on short timeframes.\n\nETH must hold crucial range high\n\nWith that, the largest altcoin Ether (ETH) looked primed for an attack on $2,000 at the time of writing, having gained nearly 5% in the past 24 hours.\n\nRelated: BTC price double top forming? 5 things to know in Bitcoin this week\n\nETH/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalyzing moves on ETH/USD, now at eight-month highs, trading suite DecenTrader noted that funding rates had already been hinting at the upside to come.\n\n#Ethereum Funding Rate functioning perfect as a leading indicator for the multiple moves higher. https://t.co/zypZt1kq5M pic.twitter.com/oYadIkIN44 — Decentrader (@decentrader) April 5, 2023\n\n“The goal now is for Ethereum to now stay above the range high at $1,840,” Crypto Tony added in his own ETH/USD analysis.\n\nETH/USD annotated chart. Source: Crypto Tony/Twitter\n\n“If we begin closing back below, the we have a deviation and we know what that means.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iZWFyLW1hcmtldHMtYXJlLWZvci1maWxtaW5nLXRoZS1iaXRjb2luLWZpbG0tZmVzdGl2YWwtaW4td2Fyc2F30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bear markets are for filming: The Bitcoin Film Festival in Warsaw - Cointelegraph",
        "content": "The bear market might rage on, but that won’t stop the Bitcoin (BTC) shooters, creators and filmmakers from producing new content.\n\nHosted in the capital of Poland, Warsaw, the first edition of the Bitcoin Film Festival took place in March. The festival brought together Bitcoin advocates and film lovers from across the globe to sit through some of the best-known Bitcoin films and documentaries.\n\nHosted in the Kinoteka theater in the iconic Palace of Culture and Science, the Bitcoin Film Festival festival celebrated Bitcoin’s growing global influence while underscoring the thriving cultural movement that underpins the digital network. Some talents from the Bitcoin movement’s first film festival, BitFilm in 2015, such as Tomer Kantor, were in attendance, and they continue to shoot Bitcoin-centric films.\n\nCointelegraph premiered The Bitcoin Farmer, a short documentary about Bitcoin mining using solely renewable energy in Ireland. The film was followed by a panel discussion with Cointelegraph’s director of video, Jackson Dumont; global reporter, Joe Hall; co-founder of Bitcoin Film Fest, Pierre Corbin; and Mark Morton and Vince Giltinan from Scilling Digital Mining.\n\nOn stage for the Bitcoin Farmer debrief. From left, Pierre Corbin, Joe Hall, Jackson Dumont, Vince Giltinan and Mark Morton.\n\nPierre Corbin told Cointelegraph that he and co-founder Tomek Kolodziejczuk put together the Bitcoin Film Festival because it’s a “cool idea” for the community. Although the film fest was a valuable means of introducing Polish people to Bitcoin, Pierre explained that Bitcoin “has been very popular here in Poland with Ukrainians coming here because of the war.”\n\nPoland borders Ukraine, with as much as 25% of Poland’s immigrant population being Ukrainian. At the outset of the war, Bitcoin donations soared, and Corbin explains that people on the ground used the decentralized tool:\n\n“The human rights foundation helped them [Ukrainians] transfer their wealth into Bitcoin, helping them cross the border here into Poland and then walk them through the process of getting their money back out from Bitcoin ATMs because Poland is the country in Europe with the most Bitcoin ATMs.”\n\nKolodziejczuk set the ball rolling for the world’s first Bitcoin film festival in November 2022. He was keen to meet Corbin and screen his film, The Great Reset and the Rise of Bitcoin, at a local Bitcoin meetup. However, the idea snowballed. Their encounter and subsequent meetings led to the screening of Bitcoin movies from around the world in one of Eastern Europe’s most iconic buildings.\n\nThe film festival location. Source: Linkedin\n\nFrom documentaries shot in El Salvador, like Bond to Unbind, to a snapshot of the impact of Bitcoin on individuals’ lives in The Human B, the film festival showcased the most recent and notable film production efforts. Corbin explained the selection process:\n\n“If you select the right films that tell the right stories, then bringing people from outside will understand Bitcoin from the angle that we want them to understand.”\n\nA crowdfunding campaign was held through the Bitcoin crowdfunding campaign Geyser Fund, in which The Satoshi Mystery by Remi Forte won the community voting segment. Meanwhile, Corbin raised satoshis (the smallest denomination of Bitcoin) for his second Bitcoin documentary, The Fight for the US Dollar.\n\nRelated: Film review: ‘Human B’ shows a personal journey with Bitcoin\n\nThe film festival also piggybacked off a Libertarian conference hosted in Warsaw the same weekend. Libertarians are proponents of minimizing the state’s encroachment on daily life, and were some of the earliest adopters of Bitcoin.\n\nThe Bitcoin Film Festival organizers are mulling whether to change the location for the 2024 installment or keep the festival in Warsaw. While bear markets are undoubtedly for building, it appears they’re also for filming.\n\nMagazine: NFT Creator, Sarah Zucker: The Sarah Show’s analog past meets dizzying digital future"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvbWFyYXRob24tZGlnaXRhbC1taW5lcy1yZWNvcmQtMjE5NS1iaXRjb2lucy1pbi1xMS0yMDIzL9IBamh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvbWFyYXRob24tZGlnaXRhbC1taW5lcy1yZWNvcmQtMjE5NS1iaXRjb2lucy1pbi1xMS0yMDIzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Marathon Digital Mines Record 2,195 Bitcoins in Q1 2023 - Finance Magnates",
        "content": "The publicly-listed cryptocurrency miner, Marathon Digital Holdings, Inc. (NASDAQ:MARA) has announced its March and first quarter 2023 production statistics, showing a record number of Bitcoins (BTC) mined during the previous month and the entire Q1.\n\nMarathon Posts Record-Breaking Bitcoin Mining Numbers\n\nAccording to Marathon Digital's press release from Tuesday, the crypto production reached a record 825 BTC, rising 21% month-over-month (MoM). Due to the higher hash rate Hash Rate A hash rate is the measure of a cryptocurrency miner’s performance and a key security metric. In the context of mining, the more hashing or computing power in a given network, the greater its security and its overall resistance to attackMining hashrate is a key security metric. The more hashing (computing) power in the network, the greater its security and its overall resistance to attack. Hash rate is also a measurement of the output of a device that is used to add transactions to a blockchain A hash rate is the measure of a cryptocurrency miner’s performance and a key security metric. In the context of mining, the more hashing or computing power in a given network, the greater its security and its overall resistance to attackMining hashrate is a key security metric. The more hashing (computing) power in the network, the greater its security and its overall resistance to attack. Hash rate is also a measurement of the output of a device that is used to add transactions to a blockchain Read this Term that increased by 64% in the previous quarter to 11.5 EH/s, the company was able to close the three months ending 31 March with a record-breaking 2,195 BTC produced.\n\nThe number of Bitcoin produced showed an increase of 74% compared to the same period a year earlier (1,259 BTC) and 41% compared to the previous quarter (1,562 BTC). On an average day, Marathon Digital can now mine 24.4 BTC, whereas a year ago, it was 14 BTC. As of 1 April 2023, the company holds 11,466 BTC in inventory.\n\n\"During the first quarter of 2023, we made notable progress executing on our two primary initiatives for the year, which are to energize our previously purchased mining rigs to reach our target of 23 exahashes by the middle of this year and to optimize our performance so that we are both more effective and more efficient,\" Fred Thiel, the Chairman and CEO of Marathon Digital, commented.\n\nKeep Reading Nigeria Presses Binance amid Economic Turmoil and Detains Executives\n\n$MARA's March Production Update is here:\n\n- Increased #Bitcoin Production 21% MoM\n\n- Produced a Record 825 BTC in March ’23\n\n- Produced a Record 2,195 BTC in Q1 ’23\n\n- Increased Hash Rate 64% in Q1 ’23 (11.5 EH/s)\n\n- Reported Unrestricted Cash and Cash Equiv. of $124.9M\n\n- Increased… pic.twitter.com/Jc1ACI2kY2 — Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) April 3, 2023\n\nAdditionally, Thiel shared his optimism and stated that due to the considerable improvements in the company's operations and finances during the first quarter, the company might achieve its main growth goals and establish itself as one of the largest and most energy-efficient Bitcoin mining operations worldwide.\n\nCrypto Winter Turns into Crypto Thaw\n\n2022 was undoubtedly challenging for the crypto mining Crypto Mining Cryptocurrency mining is defined as the process through which the transactions of a digital currency are authenticated then published to blockchain. For every crypto transaction conducted, a crypto miner is in charge of authenticating the information which, if approved, is then updated in the blockchain. Currently, the most popular cryptocurrencies being mined are Bitcoin, Litecoin, Ethereum Classic, Monero, and DASH. How is Cryptocurrency Mined?The process of crypto mining itself involves the s Cryptocurrency mining is defined as the process through which the transactions of a digital currency are authenticated then published to blockchain. For every crypto transaction conducted, a crypto miner is in charge of authenticating the information which, if approved, is then updated in the blockchain. Currently, the most popular cryptocurrencies being mined are Bitcoin, Litecoin, Ethereum Classic, Monero, and DASH. How is Cryptocurrency Mined?The process of crypto mining itself involves the s Read this Term industry, especially after a record-breaking 2021 when miners earned $15.3 billion. Due to the prolonged crypto winter and falling prices of the leading digital assets, the revenues were slashed last year by 37.5% and came in at $9.55 billion.\n\nAfter a quite challenging December, which Ideally summed up the difficult market conditions in 2022, the situation in the cryptocurrency mining industry has begun to improve. Data provided by publicly-listed miners from January to March showed rising income due to the rebound of the BTC spot price.\n\nAlthough Argo Blockchain, one of Marathon Digital's competitors, could not produce more Bitcoin in March than in February, the overall mining revenue rose to $4.05 million. After defending itself from potential bankruptcy, the company is finally starting to see a brighter light in the dark tunnel. Galaxy Digital Holdings, Ltd, a financial firm focused on digital assets owned by Mike Novogratz, helped the troubled miner by purchasing one of its Texas mines and refinancing its loans.\n\nAfter falling more than 60% in 2022, Bitcoin started 2023 on a stronger foot and is currently rebounding by 73%. Interestingly, the recent banking crisis that electrified traders worldwide has proved to be a savior for cryptocurrencies, again making them a hedge against inflation and uncertain times.\n\nThe crypto winter might not be over yet, but the calendar spring brings a crypto thaw, which should help investors in the cryptocurrency market and miners too."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZGVjcnlwdC5jby8xMjU1NjYvYml0Y29pbi1lbnZpcm9ubWVudGFsLWhhcm0tcmVwb3J00gFBaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTU2Ni9iaXRjb2luLWVudmlyb25tZW50YWwtaGFybS1yZXBvcnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Report Blasts Bitcoin Mining for Pollution—But Bitcoiners Aren’t Buying It - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin OGs are skeptical of a report published by the Environmental Working Group (EWG) on Wednesday, detailing how Bitcoin miners are “polluting” communities across the United States.\n\nWorking through six case studies, the non-profit group says it has documented how the mining industry is interfering with the day-to-day life of Americans through air, water, and noise pollution.\n\n“The incessant din created by mining operations continues 24 hours a day, seven days a week, and is driving nearby residents to desperation,” the report stated. One of its case studies followed a married couple in Cook County, Georgia, whose hearing has reportedly been “damaged” thanks to one of Blockstream’s neaerby Bitcoin mining facilities.\n\nAD\n\nAD\n\nAnother case study focused on Stronghold Digital Mining in Venango Country, Pennsylvania. The company combusts coal refuse to power Bitcoin mining machines, then spreads the leftover coal ash over land areas to be used as fertilizer. EWG argued that the toxic pollutants within that ash fertilizer are carried into nearby rivers and streams when it rains, thereby polluting the water.\n\n“What these mines have in common is their use of proof of work, which is wasteful by design,” the report asserted, calling it “highly inefficient” to require vast amount of “fossil-fuel generated electricity” to operate.\n\nProof of work is a consensus mechanism used by Bitcoin and other decentralized blockchains that allows all network participants to agree on the sequential order of transactions, while also issuing new coins in a non-subjective manner. Powerful computers compete in a race to construct Bitcoin’s next block of transactions by solving a complex math problem and are rewarded with new BTC for solving it first.\n\nMany modern blockchains use an alternative consensus mechanism called proof of stake, which uses cryptocurrency rather than energy to secure the network. EWG has long called for Bitcoin developers to change its code and cut its energy use in a similar fashion, backing another well-funded environmental campaign to do so.\n\nHowever, prominent Bitcoin developers are not remotely interested in such a high-stakes protocol change. Blockstream CEO (and suspected Bitcoin creator) Adam Back says energy costs for producing new Bitcoin are necessary for it to function as money.\n\nAD\n\nAD\n\n“People are buying digital gold, to protect against inflation and monetary erosion. Central banks are buying physical gold for similar reasons at a record pace,” he said to Decrypt via Twitter. “Gold is costly to mine analogously, and that's also inherent to hard money.”\n\nWhen asked by EWG about Blockstream’s noise pollution, Blockstream mining head Chris Cook described the facility as “barely audible... crickets are definitely louder.”\n\nLong-time Bitcoin developer Luke Dash Jr. also contested that Bitcoin was a source of environmental harm, arguing that the fiat currency system is much more harmful.\n\n“PoW is actually good for the environment,” he told Decrypt via DM. “It makes clean energy like solar viable on its own, where previously it would typically require fossil fuel to compliment it.”\n\nMeanwhile, the developer dismissed proof of stake as a “scam,” referencing a 2015 essay describing the system as “unworkable.”\n\n“By depending only on resources within the system, proof of stake cannot be used to form a distributed consensus, since it depends on the very history it is trying to form to enforce loss of value,” stated the report’s author Andrew Poelstra."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1iaXRjb2luLXJlYWNoZXMtdGVudGF0aXZlLXNldHRsZW1lbnQtdG8tcmVvcGVuLW5pYWdhcmEtZmFsbHMtbWluaW5nLWZhY2lsaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "US Bitcoin reaches tentative settlement to reopen Niagara Falls mining facility - Cointelegraph",
        "content": "Crypto miner US Bitcoin Corp has come to a tentative agreement with the City of Niagara Falls that will allow it to reopen its mining operation in the city, according to a local news report. A state supreme court judge ordered its plant closed in early March. The settlement still requires the approval of the city council.\n\nState Supreme Court Justice Edward Pace ordered the plant’s closing after “weeks of contentious negotiations” between the city and US Bitcoin on the wording of the order. The order enforced a ruling from another state supreme court judge to cease operations while the city sought an injunction to enforce new city ordinances affecting the plant.\n\nRelated: MIT Space Force major proposes Bitcoin mining as cybersecurity tool\n\nPace found US Bitcoin in contempt of court for ignoring the initial order and imposed fines retroactively to Dec. 9, when it was initially ordered to close. Those fines would have totaled over $1 million, according to the report, if the miner had not settled.\n\nJUST IN: U.S. Bitcoin Corp. Expected to Settle With City to Resume Mining in Niagara Falls. pic.twitter.com/AGvfJiG3gX — Crypto Avanza (@AvanzaCrypto) April 5, 2023\n\nNow the company will have to pay $150,000 in fees to the city, $180,000 to reimburse legal costs and new application fees. In addition, US Bitcoin will have to take measures to reduce noise at the plant, including building a noise-dampening wall and submitting to third-party monitoring.\n\nUS Bitcoin is in the process of merging with Canadian miner Hut 8 in a deal announced in February. It also has facilities in Texas and Nebraska. According to its website, US Bitcoin uses approximately 90% “zero-emissions electricity” at its New York plant.\n\nThe state of New York imposed a two-year moratorium on new proof-of-work mining operations and licensing renewals for existing ones, unless they operate on 100% renewable energy. The state’s attorney general issued an investor alert warning of the risks of cryptocurrency investing in June.\n\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGVjcnlwdC5jby8xMjU1OTkvbWFnaWMtZWRlbi1iaXRjb2luLW5mdC1sYXVuY2hwYWQtb3JkaW5hbHPSAUlodHRwczovL2RlY3J5cHQuY28vMTI1NTk5L21hZ2ljLWVkZW4tYml0Y29pbi1uZnQtbGF1bmNocGFkLW9yZGluYWxzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Bitcoin NFT Launchpad Debuts as Ordinals Total Nears 1 Million - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ordinals protocol for inscribing digital assets on Bitcoin—similar to NFTs on Ethereum and other blockchain networks—has taken off in a big way so far this year. And now with the total number of Ordinals about to top 1 million, Magic Eden is rolling out a platform that lets creators launch new collections.\n\nThe multi-chain marketplace, which recently launched on Bitcoin and quickly overtook rivals in terms of Ordinals trading volume, announced today that it will debut its Bitcoin launchpad on Friday. The launchpad is a primary sales platform for creators who have inscribed artwork or media to the Bitcoin blockchain.\n\nMagic Eden’s first launchpad project on Bitcoin is Deadjira, a spinoff from the Ethereum NFT project Godjira, with a series of 107 pixelated lizard-themed profile pictures (PFPs) that were inscribed in February.\n\nAD\n\nAD\n\nPG x Magic Eden\n\nFirst Bitcoin Launchpad 💀🦖 Let the 🪄 begin @PGodjira @MEonBTC pic.twitter.com/FMf3AfSIWQ — Magic Eden 🪄 (@MagicEden) April 5, 2023\n\nThe launchpad will feature a few more Ordinal drops over the following week, including from Solana-based NFT game project Genopets, fellow existing NFT projects Lazy Lions and The Humanoids, and a project from popular rapper Lil Durk.\n\nInitially, the launchpad will let creators sell Bitcoin Ordinals that have already been inscribed to the blockchain, or Magic Eden itself can help facilitate the inscription process if requested.\n\nCreators may use an allowlist if desired to let certain wallet addresses mint Ordinals, and then users will “come to mint in a trustless minting form, and it will essentially execute the sale of the pre-inscribed Ordinal to the allowlisted users wallet for the mint price,” a Magic Eden representative told Decrypt.\n\nMagic Eden's launchpad is a business initiative that complements its secondary marketplace, providing a \"white glove service\" for creators to debut new projects. It's a revenue-generating venture for Magic Eden, and a rep told Decrypt that the company's cut or share of each launch \"varies by deal.\"\n\nAD\n\nAD\n\nThe firm's Ordinals marketplace has routinely topped the charts for trading volume since its March launch, although it's still a relatively small market. Magic Eden has racked up about $3.3 million worth of sales volume with Ordinals so far, per data from Dune, serving only about 2,700 unique wallets.\n\nOrdinals rise\n\nInscribing Ordinals or “digital artifacts” on the Bitcoin blockchain is a different process than minting NFTs on a chain like Ethereum or Solana.\n\nOn those chains, NFT projects use smart contracts—which contain the code that operates decentralized protocols and software—to enable functionality like on-demand minting. That allows creators to drop things like PFP projects in which images are generated from a pool of possible traits, or generative artwork spawned from an artist’s custom algorithm.\n\nOrdinals launched in January, letting people inscribe artwork, media, and text directly to the Bitcoin blockchain by attaching them to an individual Satoshi, the smallest unit of measure for Bitcoin (1/100,000,000 BTC). Inscribing is a more complicated process than deploying NFT projects on other top chains, however, and the Ordinals infrastructure is early and still evolving.\n\nBut that hasn’t stopped creators from embracing the concept. More than 930,000 inscriptions have been made in just over two months, and given that a single-day record of over 76,000 inscriptions was set on Tuesday this week, the total could well top the million mark before the end of this week.\n\nMagic Eden Head of Marketing Tiffany Huang told Decrypt that \"a lot of creators understand the value it offers, how it differentiates from other blockchains, and how having presence on Bitcoin can be complimentary to a collection or brand.\" But she added that inscribing and selling Ordinals \"can also be quite loaded with friction to get started.\"\n\nAlong with original projects, Ordinals has thus far lured notable NFT creators from other chains, including Bored Ape Yacht Club maker Yuga Labs with its Twelvefold generative art project, DeLabs with BTC DeGods, and photographer Justin Aversano. Magic Eden believes that its launchpad will help even more creators embrace the burgeoning Ordinals space.\n\nEditor's note: This article was updated after publication to include comment from Magic Eden about its launchpad business terms.\n\nAD\n\nAD"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xMjU0OTIvc3dpc3MtYmFuay1wb3N0ZmluYW5jZS1yb2xsLW91dC1iaXRjb2luLWV0aGVyZXVtLXNlcnZpY2VzLWNsaWVudHPSAWFodHRwczovL2RlY3J5cHQuY28vMTI1NDkyL3N3aXNzLWJhbmstcG9zdGZpbmFuY2Utcm9sbC1vdXQtYml0Y29pbi1ldGhlcmV1bS1zZXJ2aWNlcy1jbGllbnRzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Swiss Bank PostFinance to Roll Out Bitcoin, Ethereum Services for Clients - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPostFinance, the financial services firm fully owned by the Swiss government, will offer its customers a range of regulated crypto services delivered through Sygnum's B2B banking platform.\n\nThanks to the partnership with digital assets bank Sygnum, its customers will now be able to buy, store, and sell cryptocurrencies such as Bitcoin (BTC) and Ethereum (ETH), according to an announcement. PostFinance is Switzerland’s fifth-largest financial services firm boasting more than 2.5 million customers.\n\n\"This partnership illustrates how digital assets are now an integral part of the financial landscape in Switzerland. In this sense, the PostFinance and Sygnum partnership represents an important, and fully regulated step, towards increased asset class adoption,\" Sygnum's chief B2B officer Fritz Jost told Decrypt. \"Switzerland as an investment ecosystem offers a number of strategic advantages, including regulatory clarity for cryptocurrencies and off-balance sheet segregation of crypto assets which eliminates credit risks.\"\n\nAD\n\nAD\n\nA PostFinance spokesperson told Decrypt that its \"analyses show that our customers want access to the crypto market. The past few months have shown that customers want more security, regulation, and trust. We can offer this. Our top priority is to offer trading and safekeeping within a secure framework for our customers and to ensure the highest level of regulatory compliance.\"\n\n📰📣 NEWS: @PostFinance partners with Sygnum, the world’s first digital asset bank, to offer its customers regulated digital asset banking services via Sygnum's B2B banking platform. Read the announcement here 👇 https://t.co/zuWRP3lXIS — Sygnum Bank (@sygnumofficial) April 5, 2023\n\nSygnum's B2B banking solution lets existing financial institutions crypto products and services, with PostFinance joining more than a dozen of the platform’s other banking partners.\n\n“Digital assets have become an integral part of the financial world, and our customers want access to this market at PostFinance, their trusted principal bank,” PostFinance's CIO Chief Investment Philipp Merkt said in a statement. “A reputable and established partner like Sygnum Bank with an excellent service offering is more important than ever.”\n\nPostFinance did not respond immediately to Decrypt's request for comment.\n\nAD\n\nAD\n\nInstitutional-grade staking services\n\nThe new partnership also enables PostFinance to provide revenue-generating services such as crypto staking—a process of locking crypto assets for a set period of time to help secure a blockchain network in exchange for rewards on users’ holdings.\n\nSygnum’s staking offerings include Ethereum, the industry’s second-largest cryptocurrency by market capitalization, Cardano (ADA), Internet Computer (ICP), and Tezos (XTZ).\n\n\"Our continually expanding B2B offering, which currently includes 25 leading cryptocurrencies including DeFi-focused, 60+ trading pairs, and four leading fiat currencies, is available for deployment by PostFinance on a flexible basis. Additional details about the token and staking offering roadmap will be communicated by PostFinance in the lead-up to launch,\" Jost told Decrypt.\n\nIn June 2021, Sygnum also launched institutional-grade custody and trading services for the USDC stablecoin, as well as for a portfolio of decentralized finance (DeFi) tokens, such as Aave (AAVE), Aragon (ANT), Curve (CRV), Maker (MKR), Synthetix (SNX), Uniswap (UNI), and 1inch (1INCH)."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL25mdC93aGF0LWFyZS1iaXRjb2luLW5mdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin NFTs: What Are Ordinal NFTs & How Do They Work? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8wNS9oYXBweS00OHRoLWJpcnRoZGF5LXNhdG9zaGktbmFrYW1vdG8v0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA0LzA1L2hhcHB5LTQ4dGgtYmlydGhkYXktc2F0b3NoaS1uYWthbW90by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Happy 48th Birthday, Satoshi Nakamoto - CoinDesk",
        "content": "The point is that it doesn’t matter, Bitcoin belongs to everyone now. There is no leader. That might make some things messy, but at least it’s our mess. If it was revealed to us in a collective fever dream who Satoshi was, that person or persons would not be handed complete ownership over the project. If it were, there would be plenty of dissenters."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xMjU1MjcvZm91bmRlcnMtZmlnaHQtcGF4ZnVsLWJpdGNvaW4tZXhjaGFuZ2UtZnV0dXJlLWJpdGNvaW7SAVVodHRwczovL2RlY3J5cHQuY28vMTI1NTI3L2ZvdW5kZXJzLWZpZ2h0LXBheGZ1bC1iaXRjb2luLWV4Y2hhbmdlLWZ1dHVyZS1iaXRjb2luP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Future of Paxful Bitcoin Exchange in Flux As Co-Founders Fight - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTensions between Paxful co-founders Ray Youssef and Artur Schaback spilled into public yesterday, as the peer-to-peer Bitcoin exchange abruptly announced it had suspended operations. While Schaback hopes to resume operations, Youssef has apparently recommended a new provider to Paxful users.\n\nIn a Tuesday message posted to Paxful’s website, Youssef—the company’s CEO—urged Paxful’s users to withdraw funds from its platform and explore alternative venues, citing the departure of key employees and ongoing regulatory headwinds in the U.S. He wrote that it was unclear whether Paxful will resume operations, suggesting that its future was in jeopardy.\n\nDuring a subsequent Twitter Spaces, Youssef said that a lawsuit filed against Paxful and himself by Schaback was an untenable factor weighing on the firm, claiming that it prompted important team members to quit.\n\nAD\n\nAD\n\n“I couldn't do it anymore, ethically, so I took some massive legal liability, and I said [...] I'm shutting this down,” Youssef said. “He had a court order preventing me from doing anything, but I said, fuck that.”\n\nSchaback told Decrypt that Paxful’s decision to suspend operations came as a shock. And while he conceded that the platform's suspension of operations could end things entirely, Schaback said he plans to get the marketplace up and running again.\n\n“I was not expecting that it’s going to be permanent,” he said. “My plan is to reopen Paxful again with a new business direction.”\n\nSchaback claimed that Paxful’s announcement yesterday was part of an “orchestrated” effort to move the company’s business outside of U.S. jurisdiction while blaming him for the company’s troubles, which Youssef later denied to Decrypt.\n\nSchaback said the root of their disagreement can be traced back to 2021 when a potential deal between him and Youssef fell through. It involved potentially buying out Schaback’s stake in Paxful.\n\nAD\n\nAD\n\n“He decided not to, basically, buy out my shares or find investors because he found a way to just completely take control of the company,” Schaback said.\n\nWhen Youssef directed people to explore other trading venues on Paxful’s website yesterday, he suggested users choose another firm called Noones—a “super app” with similar features labeled as “Ray’s Recommendation.”\n\nNoones’ website states the company is based out of Europe and the United Arab Emirates, founded by “a small group of passionate Bitcoiners who are dedicated to peer-to-peer in the Global South,” including Nicholas Gregory and Yusuf Nessary.\n\nYoussef said he doesn’t have a direct role at Noones but supports the company, per CoinDesk reporting. Yet, Schaback pointed out that Noones and Paxful share notable similarities—including what appears to be a database of users.\n\nMultiple accounts on Twitter reached out to Paxful users on Tuesday, saying that they “can log in to Noones with your Paxful credentials & your KYC, trades, etc will be there already.”\n\nFor those who use Paxful:\n\n1. A new platform recommended by Paxful CEO @raypaxful is live; Noones @noonesapp 2. You can log in to Noones with your Paxful credentials & your KYC, trades, etc will be there already. 3. Log in to Paxful then transfer your funds from Paxful to… — Grey Jabesi (@greybtc) April 4, 2023\n\nPaxful clarified on Twitter that the two companies are not affiliated, directing an account to Noone’s website for raising questions or concerns. “Please be advised that Paxful is not affiliated with Noones; it is a separate platform,” the firm’s account said.\n\nHi, @Ianosg5. Thanks for getting in touch. Please be advised that Paxful is not affiliated with Noones; it is a separate platform. You may direct your questions and/or concerns related to Noones to their website. Thank you. — Paxful (@paxful) April 5, 2023\n\nAD\n\nAD\n\nSome users in what appeared to be Noones’ official Telegram channel said they were able to log in to the platform using their Paxful credentials without any issues, while others asked for help.\n\nThe functionality is part of several referral deals between Paxful and other marketplaces as the company looks for any passive income it can get to stay afloat while users withdraw funds, Youssef told Decrypt.\n\n“I want the Paxful wallet to stay up for at least two years,” he said. “That means we have to get some passive revenue into the company to pay for engineers and staff.”\n\nThe two co-founders expressed differing accounts not only about Paxful’s potential future but also regarding the nature of Schaback’s lawsuit—filed in Delaware Chancery Court in January.\n\nSchaback’s lawsuit accuses Youssef of several “egregious, unauthorized, and self-interested actions,” such as “looting the Company’s coffers” and a “surreptitious scheme” meant to freeze Schaback out of Paxful, according to a court document. Youssef has denied these allegations.\n\nInstead, Youssef claimed yesterday that the lawsuit is an attempt by Schaback to extract as much money as possible from the company. “My co-founder thinks he's gonna get a nine-figure exit, and that's why he was fighting so hard to do this,” Youssef posted on Twitter.\n\nA spokesperson for Paxful declined to comment to Decrypt on questions related to the lawsuit, citing the firm’s role as a “nominal defendant.”\n\nThe lawsuit notes that Youssef and Schaback are the two sole members of the company’s board of directors. And as their conflict plays out, the impact of their disagreement extends far beyond Delaware or the U.S.\n\nAD\n\nAD\n\nAccording to Coin Dance, Paxful’s trading volume totaled around $37 over the past week, with a significant portion of users based in countries like Argentina, Kenya, and India.\n\nYesterday, Youssef said that Paxful was a “great experiment” in part because the firm was able to bring Bitcoin to areas of the Global South—like starting in Nigeria and building out to the rest of Africa over time. He said, “It made places fertile.”"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZGNncy1iaXRjb2luLW1pbmluZy1maXJtLWZvdW5kcnktdG8tYmVnaW4tY2hhcmdpbmctZmVlcy1mb3Itc2VydmljZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "DCG's Bitcoin Mining Firm Foundry To Begin Charging Fees For Services - Nasdaq",
        "content": "The largest mining pool by hash rate share will no longer offer its services for free, according to a notice sent to clients.\n\nFoundry, the Bitcoin mining arm of Digital Currency Group, will stop providing its services for free, according to a notice distributed to clients as reported by Bloomberg.\n\nThe company has been offering its mining pool services free of charge since 2019 which contributed to its significant growth, now holding the largest share of estimated hash rate at more than 30%.\n\n\n\nThe notice states that the mining pool fees will be tiered based on the previous quarter’s average hashrate. The change is expected to take effect between April 19 and April 22.\n\nDCG's crypto lending unit, Genesis, filed for bankruptcy as one of the final dominos ensuing from the collapse of Sam Bankman-Fried’s FTX exchange.\n\n\n\nBitcoin mining companies faced a rocky 2022, with many “fighting for survival,” as Bitcoin Magazine PRO analysts put it. But despite necessary moves like public mining giant Marathon Digital selling bitcoin for the first time in company history, good news has come out of the industry as 2023 takes off, such as the announcement of Terawulf’s nuclear facility operation, the expected 50MW CleanSpark expansion, and more.\n\n\n\nThis move by Foundry may be a bolstering effort designed to better mitigate the impacts of seasons like that of late 2022.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZW4taW4vZW50cmVwcmVuZXVycy81LXRoaW5ncy10by1rbm93LWFib3V0LXNhdG9zaGktbmFrYW1vdG8tYXMtdGhlLWZvdW5kZXItb2YvNDQ5MjMy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "5 Things To Know About Satoshi Nakamoto As The Founder of Bitcoin Turns 48 - Entrepreneur",
        "content": "Satoshi Nakamoto created Bitcoin in 2008 making it world's first decentralised currency. According to the P2P Foundation forum, Nakamoto had developed a new open-sourced P2P e-cash system called Bitcoin.\n\nOpinions expressed by Entrepreneur contributors are their own.\n\nYou're reading Entrepreneur India, an international franchise of Entrepreneur Media.\n\nThe founder of Bitcoin, the most popular crypto on the planet, Satoshi Nakamoto, turned 48 on April 5. Satoshi Nakamoto created Bitcoin in 2008 making it world's first decentralised currency. According to the P2P Foundation forum, Nakamoto had developed a new open-sourced P2P e-cash system called Bitcoin.\n\nSatoshi Nakamoto: Still a Mystery?\n\nThe name Satoshi Nakamoto has earned plaudits all over the world for inventing a new-age P2P e-cash system. However, the identity of the person still remains a mystery. Some people believe that Satoshi Nakamoto might be a group of people who helped Bitcoin to come to life while some believe it is a single person. The identity has not been disclosed as the founder of Bitcoin continues to live in the shadows.\n\nNakamoto: A Potential Nobel Prize Winner?\n\nNakamoto could have been a nobel prize winner in economic sciences in 2015 as he was nominated by Bhagwan Chowdhry, a professor of finance at UCLA.\n\nThe Hidden Meaning Behind His Birth Date\n\nSatoshi Nakamoto chose April 5th to be his birth date according to the P2P Forum foundation. The date is significant in the history of the world since Franklin D. Roosevelt, former President of the United States of America, started issuing an executive order for all U.S. citizens to return all gold coins and certificates worth more than $100 to federal reserve in 1933.\n\nSharing Wealth is Important\n\nNakamoto's main motive to start Bitcoin was to initiate decentralized transactions but also to share wealth. The pseudonymous founder of Bitcoin even told his successor Gavin Anderson to share wealth a she believed it was as important as making the venture successful.\n\nSatoshi Nakamoto: A Billionaire?\n\nThe popular belief is Satoshi Nakamoto might be a billionaire due to being the creator of Bitcoin. According to an analysis by the Independent, Satoshi Nakamoto was the 15th richest person as of 2021. Estimates suggest Satoshi Nakamoto 's net worth would be approximately $42-43 billion. People believe that Satoshi Nakamoto owns more than 1 million Bitcoin in total."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vZGVjcnlwdC5jby8xMjU1MDEvY29pbmZsZXgtZm91bmRlci1vZmZlcnMtYml0Y29pbi1ldmFuZ2VsaXN0LXJvZ2VyLXZlci1vbGl2ZS1icmFuY2gtc2V0dGxlLWFsbGVnZWQtODRtLWRlYnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "CoinFLEX Founder Offers Bitcoin Evangelist Roger Ver ‘Olive Branch’ to Settle Alleged $84M Debt - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCo-founder of the troubled crypto exchange CoinFLEX Mark Lamb issued an open letter to Bitcoin evangelist and Bitcoin Cash promoter Roger Ver offering him an “olive branch” of “two years of free trading on OPNX,” a newly-launched claims exchange co-founded by Lamb.\n\nThe “olive branch” refers to ending a longstanding feud between the two, which would see Ver pay back an alleged outstanding loan to CoinFLEX.\n\nIn June last year, Lamb accused Ver of defaulting on a $47 million loan. At the time, Ver dismissed the claim as “blatantly false.” Since then, Lamb’s claim on Ver has nearly doubled, according to a lawsuit filed by CoinFLEX against Ver back in July last year.\n\nAD\n\nAD\n\n​​\"The first estimate of $47 million which we communicated did not include the significant loss in liquidating his significant FLEX Coin positions,” read a CoinFLEX announcement at the time. “Now that we have found a bid for that size, the liquidations have created a final deficit of $84 million for the account.\"\n\nThe latest open letter also asks Ver to “agree on a payment plan for the $84 million USD.”\n\nAlongside Ver, he included Peter Smith, CEO and founder of crypto exchange Blockchain.com, in his tweet.\n\nThe letter asks Smith to \"pay the 3 million FLEX Coin owed to us via your offshore Blockchain.com Cayman entity,” likely a reference to another alleged debt that hit the press earlier this year, which, in language echoing Ver, the exchange dismissed as “completely meritless and a work of fiction.”\n\nAD\n\nAD\n\nFLEX Coin (FLEX) is the native token of CoinFLEX’s crypto exchange.\n\nUpon satisfying these conditions, Lamb promised Ver and Smith an “equity stake” in OPNX.\n\nVer, Lamb, and Smith did not immediately respond to Decrypt’s request for comment.\n\nThe letter outlined the tokenization of debt meant to save CoinFLEX’s creditors and the Bitcoin Cash (BCH) community from “long drawn-out legal processes” by offering a liability token called “Recovery Value USD” (rvUSD) on OPNX.\n\nThe idea of rvUSD was first floated back in June last year when details of the alleged multi-million dollar debt first surfaced.\n\nThe CoinFLEX community unanimously approved of the plan the following September, as did a Seychelles court in March this year, after CoinFLEX halted withdrawals and filed for restructuring citing “extreme market conditions” and \"continued uncertainty involving a counterparty,\" a thinly veiled reference to Ver’s debt.\n\n[ad-unit /}\n\nWhat is OPNX?\n\nThe Open Exchange (OPNX) is a bankruptcy claims exchange that was announced by co-founder Su Zhu last February. It caters to those looking to trade bankruptcy claims—in cases from FTX to Blockfi—and uses CoinFLEX’s FLEX Coin as its native token.\n\nAD\n\nAD\n\nThe project is the brainchild of a collaboration between Three Arrows Capital (3AC) founders Su Zhu and Kyle Davies, and CoinFLEX founders Mark Lamb and Sudhu Arumugam.\n\nA leaked early pitch deck drew negative responses from CoinFLEX’s community after they found out CoinFLEX’s founders had teamed up with the 3AC founders to raise $25 million.\n\nThree Arrows Capital was one of the larger and more well-known casualties of last year's liquidity crisis that rocked the industry in the wake of Terra’s spectacular collapse last May.\n\nOPNX officially launched yesterday, with the first tradable claims token being rvUSD."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vcHVuY2huZy5jb20vYml0Y29pbi1wbGF0Zm9ybS13aXRoLW92ZXItb25lLW1pbGxpb24tbmlnZXJpYW4tdXNlcnMtc2h1dHMtZG93bi_SAVlodHRwczovL3B1bmNobmcuY29tL2JpdGNvaW4tcGxhdGZvcm0td2l0aC1vdmVyLW9uZS1taWxsaW9uLW5pZ2VyaWFuLXVzZXJzLXNodXRzLWRvd24vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin platform with over one million Nigerian users shuts down - Punch Newspapers",
        "content": "Peer-to-peer Bitcoin platform, Paxful, with 1.5m users in Nigeria, has announced that it is shutting down its operations.\n\nThis was disclosed by the co-founder and Chief Executive Officer, Ray Youssef, in a blog post on Tuesday.\n\nHe said, “Today, Paxful will be suspending its marketplace. We are not sure if it will come back.\n\n“This will probably come as a big shock to many. While I cannot share the full story now, I can say that we unfortunately have had some key staff departures. Also, regulatory challenges for the industry continue to grow, especially in the peer-to-peer market and most heavily in the U.S. While we work through these issues, we have taken the most secure option and ask you to explore self-custody and trade elsewhere.”\n\nAccording to Decrypt, Youssef, during a Twitter Space said that the decision to close the platform was also influenced by a lawsuit brought by a Paxful co-founder who is suing Paxful and Youssef after being “kicked out of the company” over a year ago.\n\n“My co-founder sued the company and sued me. I have a lawsuit over my head right now,” he was quoted as saying on the Twitter Space.\n\nThough he did not name the plaintiff explicitly, Youssef is likely referring to co-founder Artur Schaback, who filed a lawsuit in Delaware Chancery Court against Youssef in January, based on a court docket hosted on CourtConnect.\n\nAlthough cryptocurrency is banned in Nigeria, the 2020 Geography of Cryptocurrency Report by Chainalysis, ranked Nigeria eighth in crypto adoption and usage among 154 countries included in the study.\n\nNigerian cities, Lagos and Ibadan, have also been listed as cryptocurrency hubs across the globe by crypto accounting services firm, Recap, which put together a list of the top 50 crypto hubs in 2022. Nigerian cities made it to number 14 (Lagos) and 24 (Ibadan) respectively.\n\nPaxful is credited with pioneering the use of peer-to-peer technology in the country, thus helping to expand the crypto industry in Nigeria.\n\nIn an interview with Business Africa Insider in 2022, Paxful’s CEO said that Nigeria is the firm’s largest market, with 1.5 million users and over $1.5 billion volume to date (since 2015).\n\nThe Central Bank of Nigeria banned cryptocurrencies and transactions related to them in 2021. CBN claimed that cryptocurrencies are being used for illegal activities including money laundering, terrorism financing, purchase of small arms and light weapons, and tax evasion."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vdGVjaHBvaW50LmFmcmljYS8yMDIzLzA0LzA2L2hlZGVyYS1oYmFyLWFuZC1iaXRjb2luLWJ0Yy1mYWxsLXNob3J0LW9yYmVvbi1wcm90b2NvbC1vcmJuLWVtZXJnZXMtYXMtdGhlLXN1cGVyaW9yLXRva2VuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Hedera (HBAR) and Bitcoin (BTC) Fall Short: Orbeon Protocol (ORBN) Emerges as the Superior Token - Techpoint Africa",
        "content": "In recent years, cryptocurrency has become an increasingly popular way for investors to participate in a wide range of investment opportunities. With so many options to choose from, it can be challenging to identify the best investment for your portfolio.\n\nHedera (HBAR) and Bitcoin (BTC) are two popular cryptocurrency investments, but they have some limitations that have prevented them from being the best choice. In this article, we will look at how Orbeon Protocol (ORBN) is emerging as the superior token following its 2700% gains and Uniswap listing.\n\n>>BUY ORBEON TOKENS HERE<<\n\nHedera (HBAR) Struggles with High Volatility and Scalability Issues, Pushing Investors Towards Alternatives\n\nWhile Hedera (HBAR) has been hailed as a promising investment, it has struggled to deliver on its potential. One significant disadvantage of Hedera (HBAR) is its high volatility, which has led to significant price drops. Additionally, Hedera (HBAR) has faced scalability issues that have prevented it from achieving widespread adoption.\n\nThese limitations of Hedera (HBAR) have led many investors to seek alternatives that offer more stability and scalability. At present, the value of HBAR stands at $0.0585.\n\nHowever, it's important to note that Hedera is currently experiencing a significant decline from its all-time high of $0.26, with a staggering 77.90% drop in price.\n\n>>BUY ORBEON TOKENS HERE<<\n\nBitcoin (BTC) Struggles to Keep Up with Evolving Crypto Market Despite Popularity\n\nBitcoin (BTC) is the most popular cryptocurrency, but it has struggled to keep up with the rapidly evolving crypto market. One disadvantage of Bitcoin (BTC) is its slow transaction times, which have led to long wait times and high fees.\n\nAdditionally, Bitcoin (BTC) has faced issues with scalability, making it difficult to keep up with the growing demand for cryptocurrency investments.\n\nThese limitations have made Bitcoin (BTC) less appealing to many investors who are seeking a more modern and efficient investment opportunity. As of now, the market value of BTC is $27,117.21. However, it's worth noting that Bitcoin is struggling with a steep decline of 60.58% from its record high of $68,789.63.\n\n>>BUY ORBEON TOKENS HERE<<\n\nOrbeon Protocol (ORBN) Offers Accessible and Inclusive Investment Opportunities\n\nIn contrast to Hedera (HBAR) and Bitcoin (BTC), Orbeon Protocol (ORBN) is an exciting new investment opportunity that offers a range of advantages over traditional cryptocurrency investments.\n\nOrbeon Protocol (ORBN) is designed to provide an accessible and inclusive platform for investors to participate in decentralized crowd-funding and venture capital. The key advantage of Orbeon Protocol (ORBN) is its focus on allowing startups to raise capital via equity-backed, fractionalized NFTs, which provides everyday investors with the opportunity to invest as little as $1 in budding startups.\n\nOrbeon Protocol (ORBN) is constructed on a launchpad that supports multiple blockchains, allowing projects to generate funding and launch on several blockchains at the same time.\n\nThis ecosystem is powered by the ORBN token, which grants holders access to staking bonuses, governance rights, access to exclusive investor groups and more. Having completed its presale with over 2700% gains, Orbeon Protocol (ORBN) has stunned investors with its performance and Uniswap listing, resulting in predictions of the token surging even higher, upwards of 6000%.\n\n>>BUY ORBEON TOKENS HERE<<\n\nConclusion\n\nOverall, Orbeon Protocol (ORBN) is emerging as a superior token that offers a range of advantages over traditional cryptocurrency investments such as Hedera (HBAR) and Bitcoin (BTC).\n\nOrbeon Protocol (ORBN) provides investors with accessibility, versatility, and dynamic investment opportunities that are designed to bridge the gap between the Web2 and Web3 worlds.\n\nWith the potential to grow by 6000% following its wildly successful presale, ORBN is a potentially lucrative investment opportunity that investors should not overlook.\n\nFind Out More About The Orbeon Protocol\n\nWebsite: https://orbeonprotocol.com/\n\nUniswap: https://app.uniswap.org/#/swap\n\nTelegram: https://t.me/OrbeonProtocol\n\nTwitter: https://twitter.com/OrbeonProtocol"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL21lemhhLm1lZGlhL2VuLzIwMjMvMDQvMDYvYml0Y29pbi1jcnlwdG9jdXJyZW5jeS13aGl0ZXBhcGVyLXdyaXR0ZW4tYnktc2F0b3NoaS1uYWthbW90by1mb3VuZC1pbi10aGUtbWFjb3Mtb3BlcmF0aW5nLXN5c3RlbS_SAYgBaHR0cHM6Ly9tZXpoYS5tZWRpYS9lbi8yMDIzLzA0LzA2L2JpdGNvaW4tY3J5cHRvY3VycmVuY3ktd2hpdGVwYXBlci13cml0dGVuLWJ5LXNhdG9zaGktbmFrYW1vdG8tZm91bmQtaW4tdGhlLW1hY29zLW9wZXJhdGluZy1zeXN0ZW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin cryptocurrency whitepaper, written by Satoshi Nakamoto, found in the macOS operating system - Mezha.Media",
        "content": "Bitcoin cryptocurrency whitepaper (non-promotional marketing text detailing the product) written by Satoshi Nakamoto can be found on any Mac running macOS Catalina or later, but no one knows why it’s there, reports AppleInsider. Although macOS has many hidden files that are not intended for the average user, a whitepaper can be found with a simple Terminal command or Finder navigator.\n\nAndy Baio, a well-known blogger in the tech community, shared this surprising discovery at on his blog Waxy. By entering a command in Terminal on any Mac computer running macOS Catalina or later, you can open the Bitcoin document in preview mode:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAlternatively, the user can switch to Macintosh HD -> System -> Library -> Image Capture -> Devices, then right-click on the VirtualScanner.app file and select Show Package Contents, then open the Contents folder -> Resources and in it you can find the simpledoc.pdf file.\n\nBaio reports that the file is used as a sample document for a device called Virtual Scanner II, which is hidden by default or not installed for some users.\n\nThis discovery is not entirely new, as Apple’s community post from 2021 also asked the same thing, and the Virtual Scanner II application revealed an unusual photo taken by American photographer Thomas Hawk. However, the Bitcoin cryptocurrency was not paid attention to in the whitepaper.\n\nDespite these revelations, the purpose of the Virtual Scanner II app and why it contains the Bitcoin document remains a mystery, and no one at Apple has yet attempted to explain it."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbnMtcHVyY2hhc2luZy1wb3dlci1vdXRwYWNlcy11cy1kb2xsYXItZ2FtZS1jaGFuZ2VyLWluLWZpbmFuY2lhbC13b3JsZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's purchasing power outpaces US dollar: Game-changer in financial world? - Finbold - Finance in Bold",
        "content": "While the BRICS countries – Brazil, Russia, India, China, and South Africa – are mulling the introduction of an alternative currency to the United States dollar as global reserve money, and many people are voicing their opinion that the USD would no longer be the world standard, Bitcoin (BTC) has been touted as a substitute, and its purchasing power could be one of the reasons.\n\nAs it happens, the purchasing power of the USD, which determines the amount of products and services you can buy with it, has been steadily weakening over the years, whereas that of the flagship decentralized finance (DeFi) asset has been sharply rising since 2010, according to the macro comparison chart shared by the finance analyst known as Seth on April 4.\n\nBitcoin vs. USD purchasing power. Source: Seth\n\nDollar versus Bitcoin\n\nSpecifically, the chart shows the Consumer Price Index (CPI) for all urban consumers in terms of purchasing power of the consumer dollar in the US city average, which has been declining since the 1960s, dropping from 300 to the current 33.2 points (88.93%).\n\nOn the other hand, the purchasing power of Bitcoin in the same context has shown as quickly climbing, soaring from 33 in 2010 to the current 255 points, or a whopping 672.73% increase over the observable period of only 13 years.\n\nAt the same time, the list of people warning of the dollar’s declining dominance as the world’s reserve currency is growing, recently including former U.S. President Donald Trump, who has told his supporters and the media from his Florida home that the U.S. dollar was crashing and would “no longer be the world standard.”\n\nResearch from Kaiko noted on April 5:\n\n“The Dollar took a hit yesterday after the number of job openings in the US. fell more than expected (JOLTS), boosting recession fears. Although BTC remains negatively correlated with the US Dollar, the correlation is now almost negligible, falling from -60% to -23% YTD.”\n\nBitcoin correlation with the USD. Source: Kaiko\n\nBitcoin price analysis\n\nMeanwhile, the maiden cryptocurrency was at press time changing hands at the price of $28,500, which represents a 0.93% gain in the last 24 hours, adding up to the positive price change of 4.43% over the previous seven days and 27.11% across the past month, as charts indicate.\n\nBitcoin 30-day price chart. Source: Finbold\n\nNotably, Robert Kiyosaki, author of the best-selling personal finance book ‘Rich Dad Poor Dad,’ is also skeptical about the future of the USD, recommending his followers to buy Bitcoin, gold, and silver and referring to the US fiat currency as “toilet paper” and “fake money” that is pushing the “American empire to its end.”\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWFuZC10aGUtbWljcm9zb2Z0LW1hc3Rlcm1pbmQtaXMtYmlsbC1nYXRlcy1pbnZlc3RlZC1pbi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Crypto and the Microsoft mastermind: Is Bill Gates invested in Bitcoin? - Finbold - Finance in Bold",
        "content": "As cryptocurrencies become more widely adopted around the world and blockchain is touted as one of the most important technological achievements of the 21st century, many people wonder if Bill Gates, the co-founder of the American technology mammoth Microsoft (NASDAQ: MSFT), has already jumped on the crypto train.\n\nCuriously, despite being one of the most famous ambassadors of technological advancement, Gates still remains very skeptical – if not outright disapproving – about the crypto industry, primarily concerned about volatility and the use of crypto in illegal activities.\n\nAs it happens, the legendary Microsoft co-founder has publicly discussed Bitcoin (BTC) and cryptocurrencies over time, but he has never disclosed whether he had any. It seems the chances are slim because his comments related to crypto made at a TechCrunch conference in June 2022 reveal he is still on the fence.\n\n‘Greater fool theory’\n\nAccording to a CNN report at the time, Gates was quoted as saying that cryptos and non-fungible tokens (NFTs) were “100% based on greater fool theory,” referring to profiting on worthless or overvalued assets as long as people are willing to bid them higher, adding that he was “not long or short” on crypto.\n\nAs he explained:\n\n“I’m used to asset classes, like a farm where they have output, or like a company where they make products.”\n\nEarlier, in 2021, Gates said in an interview with CNBC that he was ‘neutral’ on Bitcoin, stating he did not own any and criticizing its volatility, although he did acknowledge crypto’s goal of making money more digital and getting transactions down, which was “something the Gates Foundation does in developing countries.”\n\n‘Better than currency’?\n\nInterestingly, in October 2014, Gates, however, praised Bitcoin as ‘better than currency’ in a BloombergTV interview on the sidelines of the ‘Sibos 2014’ financial services industry conference in Boston.\n\n“Bitcoin is exciting because it shows how cheap it can be. (…) Bitcoin is better than currency in that you don’t have to be physically in the same place and, of course, for large transactions, currency can get pretty inconvenient.”\n\nAddressing the attendees at the conference, the Microsoft co-founder reiterated his opinion on crypto and stressed that financial transactions in the future would be “digital, universal, and almost free.” However, he also criticized the anonymity of virtual assets like Bitcoin.\n\nMoreover, during a Reddit Ask Me Anything (AMA) session in February 2014, he stated that his organization was “involved in digital money, but unlike Bitcoin, it would not be anonymous digital money,” as he referred to Vodaphone M-pesa, a mobile phone-based money transfer and microfinancing service in Kenya backed by his foundation.\n\nAll things considered, Bill Gates does not seem to be a vocal fan of crypto but hope remains as his views do not seem to be as scathing as those of, for instance, Berkshire Hathaway (NYSE: BRK.A) CEO Warren Buffett, who has slammed cryptocurrencies as “rat poison,” and his vice chairman Charlie Munger who referred to them a “bad combination” of “partly fraud and partly delusion.”"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vdmVyaWZpZWQteW91ci1hcHBsZS1jb21wdXRlci1pcy1ob3N0aW5nLXRoZS1iaXRjb2luLXdoaXRlLXBhcGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Verified: Your Apple computer is hosting the Bitcoin white paper - Finbold - Finance in Bold",
        "content": "The Bitcoin white paper was found buried deep inside Apple’s (NASDAQ: AAPL) system files on computers running macOS Catalina or later. The document, which has the filename “simpledoc.pdf,” purports to present Satoshi Nakamoto’s ideas for a decentralized form of currency that is based on a public ledger on all nine of its pages.\n\nOn the day of Nakamoto’s 48th birthday, an independent blogger named Andy Baio claimed for the first time that there was a subtle mention to the world’s oldest blockchain on his Waxy blog on April 5.\n\n“I was trying to scan a document with my wireless printer/scanner, but the device wasn’t showing up in Image Capture after I upgraded macOS recently. Just this “Virtual Scanner II” device that I’d never seen (or noticed?) before,” Baio told Blockworks.\n\nBitcoin whitepaper preview. Source: Waxy\n\nBaio claims that the document is present in all up-to-date versions of macOS, but he can’t explain why it would be in such a hidden location. According to Baio, you may see the file by opening Terminal and entering the following command:\n\nBitcoin whitepaper command. Source: Waxy\n\nNon Apple experts\n\nIf you are not an Apple expert, he suggests that you “open Finder and click on Macintosh HD, then open the System→Library→Image Capture→Devices folder. Control-click on VirtualScanner.app and choose Show Package Contents, then go to the ContentsResources folder and open simpledoc.pdf.”\n\nBaio adds that there is an additional step required to access the document: “In Image Capture, select the “Virtual Scanner II” device, and in the Details, set the Media to “Document” and the Media DPI to “72 DPI.” You should look at the first page of the Bitcoin paper.”\n\nApple’s relationship with the blockchain and cryptocurrency business is complicated when the company allowed non-fungible token (NFT) to be traded via apps on the App Store in the second half of 2022.\n\nThe change was made to facilitate the sale of NFTs inside applications and the incorporation of tokens into future apps. Apple opted to take a 30% share from App developers earning more than $1 million through its store, and a 15% cut from those making less, in an effort to monetize the buzz around the new technology."
    }
]