[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMS8wOC9nb2xkLW9yLWJpdGNvaW4taW52ZXN0aW5nLWJsYWNrLXN3YW4tbmFzc2ltLW5pY2hvbGFzLXRhbGViLWNyeXB0by_SAWVodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDEvMDgvZ29sZC1vci1iaXRjb2luLWludmVzdGluZy1ibGFjay1zd2FuLW5hc3NpbS1uaWNob2xhcy10YWxlYi1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin or gold? Beware the ‘malignant tumor,’ says ‘Black Swan’ guru Nassim Nicholas Taleb - Fortune",
        "content": "Is Bitcoin or gold the better investment? Opinions vary widely, with billionaire crypto fan Mark Cuban favoring Bitcoin—and slamming gold—and Euro Pacific Capital CEO Peter Schiff going the other way.\n\nNassim Nicholas Taleb has some thoughts too. This week the author of the 2010 New York Times bestseller The Black Swan—among the few who foresaw the 2007–2008 financial crisis—weighed in on the debate in an interview with the French weekly L’Express.\n\nIt’s safe to say Bitcoin, which has fallen more than 60% since the start of 2022, fails to impress him.\n\n“Technology comes and goes”\n\nOne problem with Bitcoin, he said, is that “we are not sure of the interests, mentalities, and preferences of future generations. Technology comes and goes; gold stays, at least physically. Once neglected for a brief period, Bitcoin would necessarily collapse.”\n\nWhat’s more, he said, “it cannot be expected that an entry on a register that requires active maintenance by interested and motivated people—this is how Bitcoin works—will retain its physical properties, a condition for monetary value, for any period of time.”\n\nAsked about the origins of the “craze for cryptocurrencies,” he pointed to the low interest rates of the past 15 years.\n\n“Lowering rates creates asset bubbles without necessarily helping the economy,” he said. “Capital no longer costs anything; risk-free returns on investment become too low, even negative, pushing people into speculation. We lose our sense of what a long-term investment is. It is the end of real finance.”\n\nOne of the results, he argued, was “malignant tumors like Bitcoin.”\n\nThe “everything bubble”\n\nTaleb isn’t alone in noting the effects of what’s been dubbed the “everything bubble”—created by years of loose monetary policies from the Fed and other central banks following the Great Financial Crisis. As Fortune reported this week, the easy money era was filled with bulls—from crypto experts to hedge fund managers to economists and investment banks—who believed the good times would never end.\n\nInterestingly, Taleb was supportive of Bitcoin early on. At the time, as he explained to L’Express, he was critical of then Fed Chair Ben Bernanke.\n\nBernanke, he said, did not see the structural risks of the system before the 2008 crisis, and overreacted afterward: “Instead of correcting debt and mitigating hidden risks, he covered them with a monetary policy that was only supposed to be transitory. I wrongly thought Bitcoin would be a bulwark against the distortions of this monetary policy.”\n\n“Manipulators and scammers”\n\nTaleb also warned that “the crypto universe attracts manipulators and scammers.”\n\nHe’s certainly not alone there.\n\nCoinbase CEO Brian Armstrong said at the a16z crypto Founder Summit in late November: “We have to kind of come to terms as an industry with the fact that, I think our industry is attracting a disproportionate share of fraudsters and scammers. And that’s really unfortunate. That doesn’t mean it’s representative of the whole industry.”\n\n(Armstrong added it was “baffling” to him why FTX founder Sam Bankman-Fried wasn’t already in custody—a few weeks later, he was.)\n\nTaleb tweeted this week that he’s been trolled and smeared for his crypto criticism, but that such attacks have been offset by the “many thank-you messages for saving young people from Bitcoin.”\n\nHe shared a message in which a Twitter user said he almost bought Bitcoin but then started following Taleb’s thinking on it, writing, “I got why crypto is crap in theory. Then it went bust in practice. NNT saved my dad’s hard earned money.”\n\nMeanwhile, many Bitcoin bulls remain bullish. ARK Invest CEO Cathie Wood recently reiterated her prediction that Bitcoin will hit $1 million by 2030—it’s now just below $17,000. She also argued Bankman-Fried didn’t like “transparent and decentralized” Bitcoin “because he couldn’t control it,” saying the FTX fiasco was caused by “opaque centralized players.”\n\nAs for Cuban, he said on Bill Maher’s Club Random podcast last month, “I want Bitcoin to go down a lot further so I can buy some more.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNhbmdvLWNvaW4tYW5kLXRoZS1jZW50cmFsLWFmcmljYW4tcmVwdWJsaWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Sango Coin and the Central African Republic - Cointelegraph",
        "content": "In the spring of 2022, the Central African Republic (CAR) became the first African country to adopt Bitcoin (BTC) as a legal tender.\n\nAs the second country globally to recognize Bitcoin in such a fashion, the CAR followed in El Salvador’s footsteps. El Salvador has since boasted surging tourism numbers, a resilient economy and a healthy amount of free PR since allowing its citizens to make everyday purchases with the seminal cryptocurrency.\n\nThe CAR, a substantially less economically developed economy than its Central American counterpart, would hope to emulate El Salvador’s success. Despite the nation’s vast natural resource wealth, the CAR is plagued by economic mismanagement, meager private and foreign investment, and systemic governmental issues.\n\nIt is one of the poorest countries on the poorest continent in the world, ranking right at the bottom of the World Bank’s Human Development Index. To make matters worse, up to 85% of the country’s exports are kept in French treasuries, while its currency of choice, the CFA franc, is heavily biased toward economic development in France. Consequently, tapping into a neutral, open-source and censorship-resistant monetary system such as Bitcoin could not only benefit but emancipate the country.\n\nPresident Bitcoiners\n\nSimilar to El Salvador, the CAR law would make Bitcoin “official money.” Naturally, this decision was lauded by Bitcoin advocates the world over. Plus, it appeared that CAR President Faustin-Archange Touadéra, a mathematician and Bitcoin supporter on social media, was inclined to support the adoption of the unique cryptocurrency. The pro-Bitcoin tweets smack of El Salvador’s laser-eyed president, Nayib Bukele.\n\nMathematics is the #language of the Universe.#Bitcoin is universal money. — Faustin-Archange Touadéra (@FA_Touadera) April 27, 2022\n\nHowever, celebration and support for the country among the Bitcoin community were short-lived as, despite formal visits by Bitcoin-only proponents — including Galoy Money — the country began its own token project. Just days after the Bitcoin law came into effect, the country surprised the crypto community by announcing the creation of a crypto token called Sango. The population of 5 million would also benefit from a “crypto hub” in the capital, Bangui.\n\nA francophone contingent of established Bitcoiners visit the CAR in May. Source: Twitter\n\nCointelegraph sat down in Senegal, West Africa with Mamadou Moustapha Ly, the Central African technician who oversaw the development of Sango Coin, to ask about the project’s development. A payments expert, Ly also runs the fintech startup Kete Cash. Ly shed light on the creation of what he called a “token, not a currency,” labeled Sango. Sango is the token that would accompany the country’s plans to adopt Bitcoin as a legal tender.\n\nCointelegraph speaks to Ly in Senegal.\n\nFirst, Ly stressed that the Bitcoin-as-legal-tender law clearly states that the country will adopt Bitcoin. There is no mention of other cryptocurrencies or even Sango Coin. He painted a clear divide between Sango and Bitcoin:\n\n“The law states that the digital currency that is legal tender is Bitcoin. We recognize this as our official currency. [...] Sango coin is a project for the Central African Republic state.”\n\nSango Coin offers attractive incentives to foreign investors, including citizenship by investment and eventually a CAR passport, as well as governance advantages. In a sense, buying Sango is a way of buying residency in the country, without touching government-issued fiat currencies.\n\nA token effort\n\nBut why was this necessary? El Salvador did not create a new token to support its Bitcoin adoption efforts — so, why would the CAR?\n\nTo compare the two country’s Bitcoin adoption strategies, both countries announced Bitcoin as a legal tender. From that point onward, they diverge. In El Salvador, foreigners could initially buy residency with an investment of 3 BTC, although it was then rescinded. In the CAR, “e-residency can be obtained [...] by locking a fixed collateral of SANGO Coins in the amount of 6000$ for a period of 3 years.” Plus, foreign investors can directly access the country’s strategic resources through the use of the crypto token, Ly explained.\n\nTo gain exposure to El Salvador’s rapid development without touching Bitcoin, the Central American country teed up volcano bonds. The volcano or Bitcoin bonds support the creation of a “Bitcoin City” and are backstopped by the government. In contrast, Sango is a cryptocurrency built on a blockchain “backed by Bitcoin.”\n\nThe now-defunct Luna Classic (LUNC) token was the last time a token used Bitcoin as its treasury. The token’s meltdown wiped billions of dollars from the crypto total market cap and dented confidence in the industry. So, why create a token? Why build a system liable to hacking or attack from malicious actors? And why do so despite the Bitcoin contingent’s best interest to steer a Bitcoin-only path?\n\nLy explained that Sango is a “government project.” Money raised through the sale of Sango Coin will be used to buy Bitcoin, which can then be used to acquire the materials necessary for development projects, as well as to pay for labor and other expenses.\n\nIt’s important to note the country’s dire financial situation. Reports continue to indicate that civil servants and government salaries are paid by its former colonizer, France, while the country is labeled a “repressed” economy according to the Heritage Foundation’s 2022 Index of Economic Freedom.\n\nWhile Bitcoin advocates hail Bitcoin adoption as a panacea to most modern-day problems, in the CAR, the priorities are clean water, security, education then maybe internet connectivity. With these motivations, the country needs investment — fast.\n\nThe African franc.\n\nTo this point, Ly noted that the Central African Republic’s high level of external debt makes it difficult for the country to access traditional forms of financing. Sango Coin could be that alternative source of funding. Indeed, one could infer that the quick liquidity provided by Sango is a way of jumpstarting much-needed foreign direct investment (FDI) into the country.\n\nRelated: ‘We don’t like our money’: The story of the CFA and Bitcoin in Africa\n\nIn addition, the use of a crypto token allows for greater flexibility and speed in conducting financial transactions, as well as reducing the risk of fraud, he commented. In a sense, the use of Sango could sidestep the bureaucracy and slow administrative practices for which Central African governments are known. Plus, it could allow investment flows into the country without touching dollars or the local currency.\n\nWhen asked why the Central African Republic did not simply use Bitcoin or the superfast Lightning Network for these purposes, Ly reiterated that Sango Coin is intended to serve as a token associated with the government project: “It’s not a general-purpose currency.”\n\nSango could allow for greater control over the flow of funds, therefore reducing the risk of capital flight. In addition, the World Bank points out that the country will not be able to develop its human capital without strengthening domestic revenue mobilization sustainably. Sango could be the quickest path to more robust revenues.\n\nBitcoin on the ground\n\nPaco De La India, known as “Run with Bitcoin,” recently spent two weeks traveling in the CAR in the hopes of spending Bitcoin and interacting with Bitcoin people. He told Cointelegraph:\n\n“There was no not even a single business that accepted Bitcoin. I gave my guide a tip in Bitcoin. I paid my host in Bitcoin.”\n\nWith those small successes aside, Paco told Cointelegraph that Bitcoin adoption on the ground was minimal. In a country where less than a quarter of the country has access to the internet — a basic requirement to use “magic internet money” — it’s hardly surprising.\n\nAs for the creation of Sango Coin, Paco suggested there could be external forces at play. The CAR is tremendously resource-rich, so why couldn’t a French state-run project meddle with the creation of the token? he questioned. The token was indeed created quickly after state visits to one of the world’s crypto hubs, Dubai.\n\nLy explained that foreign influences did have an effect on the decision-making process:\n\n“The idea for Sango Coin came from a private partner based in Dubai who discussed it with the Head of State.”\n\nAnd a deal was struck with foreign investors, but there was no suggestion that the former colonial power may be using Sango Coin to control resources. It might simply be the quickest way to raise capital and, as Ly suggested, use this capital to buy Bitcoin and build the country’s infrastructure.\n\nUltimately, Bitcoin adoption and the creation of Sango appear to be a ploy to inject much-needed FDI into the country and enhance the country’s standing globally. However, the creation of this token may shun interest from the wider Bitcoin community, arguably the frontline investors to places and jurisdictions that announce their plans for Bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTA5L2dyYXlzY2FsZS1zLWJpdGNvaW4tdHJ1c3QtcmFsbGllcy13aXRoLWRjZy1zLXdvcnN0LWNhc2UtZWx1c2l2ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Grayscale's Bitcoin Trust Rallies With Worst-Case Elusive - Bloomberg",
        "content": "The world’s biggest Bitcoin fund outperformed other risk assets Monday as a weekend deadline for its parent company came and went without any fireworks.\n\nThe $10.7 billion Grayscale Bitcoin Trust (ticker GBTC ) soared 12% to start the week, its largest one-day jump since February 2022. The fund has done better than Bitcoin itself as of late, narrowing the discount to its net-asset value to 44% from a record of 49% reached last month."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9ob3ctbWFjaGFua3VyYS1hbGxvd3MtYml0Y29pbi10cmFuc2FjdGlvbnMtd2l0aG91dC1hbi1pbnRlcm5ldC1jb25uZWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "How Machankura Allows Bitcoin Transactions Without an Internet Connection - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmVuZXJneW1vbml0b3IuYWkvdGVjaC9kaWdpdGFsaXNhdGlvbi90aGUtcGF0aC10by1ncmVlbi1jcnlwdG8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "The path to green crypto - Energy Monitor",
        "content": "The sight of a forlorn and dishevelled Sam Bankman-Fried, former CEO of one of the world’s largest cryptocurrency exchanges, being led away in handcuffs in the Bahamas last month aptly embodied the current plight of an entire industry. After numerous scandals and trillions of dollars wiped off its value in 2022, crypto finds itself on its knees with the vultures circling. Systemic change now seems unavoidable, and the industry can either take the bull by the horns or be forced to by the red-tape mafia waiting in the wings.\n\nCryptocurrency mining rigs at a facility in Quebec, Canada. (Photo by James MacDonald/Bloomberg via Getty Images)\n\nA good place to start would be the industry’s outsized environmental footprint, which currently exceeds that of many countries. Yet some within the industry are rising to the challenge. In September 2022, Ethereum, the world’s second-largest cryptocurrency platform (‘ether’ is second only to Bitcoin), almost nullified its power demand through an event called the Merge. By replacing the blockchain’s “proof-of-work” (PoW) mining mechanism with an alternative coined “proof-of-stake” (PoS), Ethereum cut its electricity consumption by 99.84% – a reduction equivalent to the annual power requirements of Ireland or Austria.\n\nAlthough energy consumption is just one part of crypto’s environmental problems, and it would be premature to declare the Merge an outright victory, the move does offer cryptocurrencies everywhere a possible path towards environmental sustainability. Whether they choose to follow it is another matter.\n\nAlthough estimates of the total environmental footprint of all crypto assets vary, it is thought that the electricity demand of Bitcoin alone exceeded 13GW, with an associated carbon footprint of more than 65 million tonnes of CO2 (MtCO2), in 2021. That demand is just over half that of all global data centres combined and represents nearly 0.5% of global electricity consumption. The associated carbon footprint is bigger than the global CO2 reduction created by all electric vehicles. On top of that, other cryptocurrencies were estimated – prior to the Merge – to add another 50% to Bitcoin’s energy demand.\n\nOne recent study indicated that Bitcoin has a greater climate impact than gold mining. The research from the University of New Mexico judged the climate cost of various commodities in relation to their overall market capitalisation. The results found that the climate damage from producing Bitcoin has averaged 35% of its market value over the past five years, peaking at 82% in 2020. That is comparable to 33% for beef production or 46% for natural gas extraction.\n\n“Since Ethereum’s Merge, I would hazard an educated guess that Bitcoin now represents 90% of crypto’s environmental footprint,” says Alex de Vries, a digital currencies researcher at the Vrije Universiteit Amsterdam, the Netherlands.\n\nHow well do you really know your competitors? Access the most comprehensive Company Profiles on the market, powered by GlobalData. Save hours of research. Gain competitive edge. View profiles in store Company Profile – free sample Thank you! Your download email will arrive shortly Not ready to buy yet? Download a free sample We are confident about the unique quality of our Company Profiles. However, we want you to make the most beneficial decision for your business, so we offer a free sample that you can download by submitting the below form By GlobalData Submit Country * UK USA Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Democratic Republic of the Congo Cook Islands Costa Rica Côte d\"Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati North Korea South Korea Kuwait Kyrgyzstan Lao Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and The South Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates US Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Vietnam British Virgin Islands US Virgin Islands Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo Industry * Academia & Education Aerospace, Defense & Security Agriculture Asset Management Automotive Banking & Payments Chemicals Construction Consumer Foodservice Government, trade bodies and NGOs Health & Fitness Hospitals & Healthcare HR, Staffing & Recruitment Insurance Investment Banking Legal Services Management Consulting Marketing & Advertising Media & Publishing Medical Devices Mining Oil & Gas Packaging Pharmaceuticals Power & Utilities Private Equity Real Estate Retail Sport Technology Telecom Transportation & Logistics Travel, Tourism & Hospitality Venture Capital Tick here to opt out of curated industry news, reports, and event updates from Energy Monitor. I consent to GlobalData UK Limited collecting my details provided via this form in accordance with the privacy policy Submit and download\n\nElectricity consumption is not the only problem, though. Crypto also has an issue with electronic waste. The hardware used to mine the various cryptocurrencies regularly becomes obsolete. In fact, the annual electronic waste of Bitcoin is equivalent to that of the Netherlands. “And that is just Bitcoin,” says Carmine Russo, formerly a visiting researcher at the Centre for Climate Finance & Investment at Imperial College Business School, UK, and now a PhD researcher at the University of Naples Federico II, Italy. “But consider that there are more than 20,000 cryptocurrencies out there!”\n\nShifting to green crypto\n\nAs crypto’s climate impact has become ever more apparent, regulators have begun sharpening their knives. In some places, the bloodletting has already started. In spring 2021, the Chinese government cited environmental concerns as it introduced a countrywide ban on crypto mining – effectively evicting most of Bitcoin’s global mining network.\n\nIn March 2022, the European Parliament toyed with a similar ban but settled instead on additional environmental disclosures for crypto asset service providers from 2024. However, the European Central Bank wrote in a July report that it was “highly unlikely” that European authorities would not pursue crypto mining further – and potentially ban it outright.\n\nIn the US, the state of New York is poised to introduce new legislation banning cryptocurrency miners from receiving behind-the-meter power from fossil fuel plants. However, mine operators that have already filed paperwork for new or renewal permits are exempt, including the controversial Greenidge Generating Station on the western shore of Seneca Lake. Additionally, a report from the White House Office of Science and Technology Policy released in September 2022 recommended promoting “environmentally responsible crypto-asset technologies”. Legislation to “limit or eliminate” energy-intensive cryptocurrency mining should be introduced if other measures prove ineffective, it added.\n\nChange is also coming from within. In 2021, a coalition of around 200 cryptocurrencies teamed up with think tank RMI to create the Crypto Climate Accord. The signatories agreed to reduce the carbon emissions from their electricity consumption to net zero by 2030, partly using carbon offsets but also by switching all blockchain technology to renewable energy sources by 2025 and using energy tracking tools such as so-called green hashtags.\n\nArguably the largest shot in the arm for the green crypto agenda, however, has come from Ethereum’s Merge – a small change in the software that effectively replaces the energy-intensive mining process altogether. Blockchains, the technology underlying cryptocurrency, are literal chains of blocks of data; updates to the network are processed within those blocks, which are then added to the end of the chain. No single party is in charge of that process; instead, anyone can proffer their computer hardware to assist in the block-creation process, with a reward offered for every created block. The difference between Bitcoin’s PoW and Ethereum’s PoS relates to how new blocks are added to the blockchain.\n\nWith PoW, the block-creation process is purposely made computationally challenging. New blocks are added to the blockchain only when a “miner” obtains a valid PoW, which can be achieved only through an iterative process of trial and error that is “best described as a numeric guessing game”, says de Vries. A correct guess completes a block, allowing the winner to add it to the blockchain and claim the reward. The more guesses the miner can generate, the greater their chance of winning. The process repeats indefinitely after every newly created block. “Before the Merge, the Ethereum network generated around 900 billion of these guesses every second of the day, non-stop,” says de Vries.\n\nWith PoS, however, the network does not incentivise participants, or “minters”, to compete on computational power to create new blocks. Instead, the block selection process is primarily based on wealth. Minters must buy some of the native currency from a cryptocurrency platform, which is then used as collateral in the “staking” process – a minimum of 32 units of Ether, in Ethereum’s case. The software then randomly chooses a “staker” to create the next block for the blockchain. The larger the amount staked, the greater the chance of being chosen. While minters still need a device with sufficient storage capacity and an active internet connection, the computational power of the device is irrelevant. This negates the need for vast mining networks of electricity-gorging computers. “A laptop will suffice,” says Russo.\n\nEthereum’s transition to PoS has reduced its power demand by between 99.84% and 99.9996%, according to a range of estimates, setting a benchmark for decarbonising the world’s remaining PoW-reliant cryptocurrencies. “This is the solution to getting rid of the majority of crypto’s energy consumption,” says de Vries. “It solves almost the entirety of the industry's environmental impact.”\n\nIndirectly, it goes a long way to solving crypto’s e-waste problem, explains Russo. “Because the participants aren’t competing on computational power, they just need a laptop to confirm a transaction, rather than huge amounts of computer hardware that regularly needs replacing when it becomes obsolete.”\n\nNo panacea\n\nHowever, despite the evident promise of the Merge, the purported 99% reduction of Ethereum’s power demand does not quite tell the whole story. The ‘ASICS’ devices that used to mine PoW Ethereum can still be used to mine the cryptocurrencies Ethereum Classic and EthereumPoW – a spinoff that maintains the PoW mechanism. Indeed, days after the Merge, the pair had absorbed a quarter of Ethereum’s hashrate (the marker of its mining activity) – and it was still around a fifth a month later.\n\nFurthermore, the GPUs (a type of computer hardware) formerly used to mine Ethereum can be repurposed to mine other cryptocurrencies, thereby negating some of the Merge’s saved power consumption. However, that would likely come at a cost to miners. For instance, miners on Ethereum Classic can only earn around $0.5m a day compared with the $22.1m they could make from mining Ethereum – in turn reducing the power expenses they can afford. “I’m mining at a loss,” TheCrowbill, an Ethereum Classic miner, told The Defiant on 27 September. “Probably will remain that way for some time.”\n\n[Keep up with Energy Monitor: Subscribe to our weekly newsletter]\n\nSimilarly, many of the GPUs may have been repurposed to focus on other energy-intensive activities such as cloud computing, AI and gaming. There is also a suspicion that Bitcoin miners have pounced on the data centre space that has become available as result of the Merge. Between 250,000 and 500,000 Bitcoin mining devices are thought to remain unused for a lack of data centre rack space.\n\nFinally, although the Merge makes Ethereum one of most energy-efficient cryptocurrencies, it still remains less efficient than more centralised alternatives. The underlying blockchain technology replicates data and processes over thousands of participating devices, resulting in more data redundancy and higher associated energy costs from maintaining multiple copies. For example, for the roughly 1.1 million transactions a day that Ethereum processes since the Merge, the average electricity consumed per transaction ranges from 0.8 to 14.7 watt-hours (Wh). A Mastercard transaction, by contrast, consumes just 0.7Wh on average.\n\nConverting Bitcoin’s sceptics\n\nNonetheless, many of these issues would be redundant if all cryptocurrencies switched from PoW to PoS. So, unlike many industries, crypto’s path to decarbonisation appears relatively simple. The very sizeable snag, however, is that the Bitcoin community – the source of the lion’s share of remaining emissions – has shown little willingness to make the move.\n\nThe Change the Code campaign launched by Greenpeace in 2022 aimed to convince Bitcoin to ditch PoW, but it was met with outright hostility by much of the community. They see the software’s immutability as one of its foundational strengths and the source of its enduring value, and due to the network’s decentralised structure, it is hard to imagine convincing the entire community to make the jump.\n\n“The solution is there, but now you need to get this really stubborn community to think about adopting it,” says de Vries. “That is the hard part, especially since there is nobody in charge who can enforce the decision.”\n\nIt is made even more difficult by the fact that many in that community are notoriously unconcerned by climate change. “A lot of the loudest influencers in the Bitcoin community are climate change deniers, who often make statements like, ‘we breathe out carbon, so how can it be so bad?’” adds de Vries.\n\nEthereum has, however, proven that it is possible to convince a disparate, doubting community to shift to PoS, without any resulting increase in much-dreaded centralisation. The apparent success of the Merge may convert a fair few of Bitcoin’s doubters. “You don’t necessarily need to convince the entire Bitcoin community,” notes de Vries. “You just need a critical mass.\"\n\nA transition to PoS by Bitcoin would likely result in more climate benefits than the Merge, as unlike the GPUs formerly used to mine Ethereum, Bitcoin’s ASIC-based devices cannot easily be repurposed.\n\nNet-zero crypto\n\nThe possibility of crypto ever reaching net-zero emissions is inextricably wedded to Bitcoin’s adoption of PoS or a similarly energy-efficient mining mechanism – and if and when that will happen depends on who you ask. Much will depend on the direction of the price of Bitcoin going forward. “If the price goes up again consistently, I don’t see the community considering a change in the software,” says de Vries. “But if it keeps going down, they will have a serious [financial] concern on their hands and will be much more willing to contemplate changes.”\n\nIf governments were to slam a range of adverse regulations on Bitcoin for continuing to use PoW, de Vries also believes much of the community would soon change its tune. “In the end, money talks,” he says.\n\nConsidering the Merge reduced Ethereum’s power consumption by 99%, Russo believes that if all the other cryptocurrencies followed suit, the industry could reach net zero “in a few years”. He points out that it took Ethereum five years to complete the transition. “So let's say that on average, we need ten years to do this with other cryptocurrencies,” he says. “I think in 15 years, if crypto still exists, it will be a much more sustainable environment.”\n\nUltimately, for Bitcoin, the writing is on the wall – or, more accurately, in the source code. Around 19 million of the planned 21 million Bitcoins have already been created. And when that quota is filled, there will be no incentive for mining left. That will be great news for the environment; the only downside is that is not forecast to happen until 2140. “For humanity’s sake, let’s hope it doesn’t come down to that,” says de Vries."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4taGFzaC1yYXRlLXN1cmdlcy0xNy10by10b3VjaC1hdGgtYmVmb3JlLWZhbGxpbmctYmFjay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin hash rate surges 17% to touch ATH before falling back - CryptoSlate",
        "content": "Bitcoin’s (BTC) hash rate surged 17% to an all-time high of 361.28EH/s on Jan. 6 from around 233 EH/s recorded on the same day — the second biggest one-day increase in the past year.\n\nIt has since retraced to 269.56 EH/s, as of press time.\n\nOver the past week, data shows that Foundry USA contributed 29.08% of the total hashrate, followed by Antpool’s 20.38% and F2Pool with 16.12%.\n\nMacroMicro also suggested that the average cost of mining BTC was greater than the asset’s spot price. According to the data, BTC’s average mining cost as of Jan. 7 was $19,230.\n\nSince BTC’s hash rate Christmas decline, the network has added 50th/s. During the festive period, the hash rate plunged by around 40% amid poor weather conditions that forced major miners to shut operations.\n\nMeanwhile, BTC’s hash rate uptick is expected to lead to a 7% to 10% increase in mining difficulty.\n\nBTC’s mining difficulty is currently at 34.09T. The estimated increase will see the mining difficulty rise to between 36.6T and 37.7T, according to bitrawr."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAxLzA4L2hlcmVzLW15LTIwMjMtcHJlZGljdGlvbi1mb3ItYml0Y29pbi1hbmQtaXRzLW5vdC13L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Here's My 2023 Prediction for Bitcoin, and It May Not Be What You Think - The Motley Fool",
        "content": "It probably feels like forever, but just over a year ago, Bitcoin (BTC 2.61%) hit an all-time high just shy of $70,000. Since then, the world's first and most valuable cryptocurrency has dropped about 75% and finished 2022 posting a 65% loss.\n\nAlthough corrections are more than normal after meteoric rises -- like the one Bitcoin went on when it hit its previous all-time high -- 2022's decline was exacerbated by a series of events such as bankruptcies and scandals that rattled investor confidence. Subsequently, Bitcoin tanked.\n\nI know we could all use some reason for optimism in 2023, but I would prefer to be realistic at the same time. Personally, I am hopeful Bitcoin will treat investors much better this year -- especially if they take advantage of today's cheap prices.\n\n2023: The year before the next Bitcoin halving\n\nViewed as the bell cow of crypto because of its high value relative to the rest of the industry, as Bitcoin goes so go most other cryptocurrencies. And I think there's a chance Bitcoin will have a much better year in 2023 than in 2022 -- but probably not as good as in 2021.\n\nThat belief comes down to Bitcoin's price behavior at (and in between) halvings, a mechanism in the crypto's code that reduces the rate at which new bitcoins enter circulation. These halvings occur roughly every four years, and the next one isn't set to happen until sometime in May 2024.\n\nIn the past, Bitcoin typically hit a bottom when the next halving was roughly a year and a half out. So with May 2024 less than 18 months away, that makes buying today extremely attractive since we have likely reached a bottom, and further risk looks to be minimal.\n\nBut of more importance is what Bitcoin does leading up to the halving. On average, Bitcoin's price is usually 50% of its previous all-time high when the next halving arrives. If it follows this pattern again, that would mean Bitcoin should be near $34,000 by May 2024.\n\nNow that's 2024. But I believe 2023 will be a year in which Bitcoin builds momentum to get closer to that $40,000 mark. By no means will this be a smooth ascension, though. The current backdrop of factors in the economy such as rising interest rates and persistent inflation will likely cause risk-on assets like Bitcoin to remain highly volatile.\n\nThe future won't necessarily unfold like it has in the past, but until proved wrong, I will remain a believer in the data.\n\nAs for a possible price target in 2023, I'm slightly hesitant to provide a specific number Bitcoin could reach, but as we get closer to the next halving, the data suggest that it could make some modest gains.\n\nEspecially when considering that after Bitcoin has a negative year, it averages a 70% return and has never posted a decline in consecutive years. If Bitcoin were to put in a 70% return in 2023, that would put its price at about $28,000.\n\nA word of caution\n\nAlthough predictions and speculation are common, and sometimes a little fun, we shouldn't use this as a reason to try to time the market. Rather, these data should be used to promote the profitability of long-term investing.\n\nMore so than any other asset in history, Bitcoin rewards those investors who keep the longest time frame. And with the recent price collapse of 2022, that strategy shouldn't change.\n\nHere's to hoping Bitcoin holders have a better year than 2022, and that 2023 is just the beginning for the crypto to reach a new all-time high in the coming years."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmJpdGNvaW5tYXJrZXRqb3VybmFsLmNvbS9taWNyb3N0cmF0ZWd5LWJldHRpbmctdGhlLWZhcm0tb24tYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Why MicroStrategy is Betting the Farm on Bitcoin - Bitcoin Market Journal",
        "content": "“Bitcoin is appreciating money. Bonds are crumbling credit. Build your future on a firm foundation.” – Michael Saylor, CEO & Co-founder MicroStrategy\n\nIn November 2023, the software company MicroStrategy made a big gamble: it bought over 16,000 bitcoin, spending nearly $600 million.\n\nThen it threw them onto the pile of bitcoin it had been stockpiling, for a total of 175,000 bitcoin worth over $5 billion. This puts them on the Top 10 list of bitcoin holders, along with Binance, the U.S. government, and Satoshi Nakamoto.\n\nThe reality is that MicroStrategy’s Michael Saylor is betting the farm on BTC rather than taking a more conservative approach (such as our money-making blockchain investor portfolio).\n\nSo far, Saylor appears correct, as bitcoin has appreciated 221% since MicroStrategy adopted its bitcoin strategy, while bonds have diminished by 22%. But our take is that if you want exposure to bitcoin, it’s simpler to just buy bitcoin rather than investing in MicroStrategy stock ($MSTR).\n\nWhat Does MicroStrategy Do?\n\nSince all the MicroStrategy news headlines are about bitcoin, it can be hard to remember that it’s a business.\n\nMicroStrategy creates business intelligence software that helps businesses analyze and visualize large amounts of complex data. Competitor products would be Tableau, Microsoft Power BI, or Qlik.\n\nThe company has continuously innovated its products, making developing applications that tie into your data easier, providing extensive support for mobile users, and adding advanced AI capabilities.\n\nMicroStrategy’s revenues have gradually declined over the past decade, though fortunes have improved somewhat over the past few years:\n\nMeanwhile, MicroStrategy’s stock ($MSTR) has increased by over 200% since Saylor started stockpiling bitcoin in 2020. In fact, the stock has increased even faster than the price of bitcoin, making it an attractive option for investors who can’t invest in bitcoin directly.\n\nOn the other hand, MicroStrategy’s huge bitcoin stash makes the stock extremely volatile, as if you were buying bitcoin directly. Note its correlation with the price of BTC:\n\nSaylor’s fixation on bitcoin has thrown the company’s economics out of whack: in our view, when you buy $MSTR stock, you’re not buying the business, you’re buying bitcoin.\n\nThis begs the question: why not just buy bitcoin directly?\n\nMicroStrategy’s Bitcoin Strategy\n\nBy foraying into bitcoin on such a massive scale, MicroStrategy is not merely adopting a new corporate investing strategy. The company is challenging the conventional norms that have guided other publicly traded companies for over a century.\n\nHowever, this does pose considerable challenges related to regulatory compliance, stakeholder communications, and market optics.\n\nTo adequately address these issues, MicroStrategy has created a multi-pronged BTC strategy with the following core considerations:\n\nNarrative\n\nSwitching from traditional assets to crypto presents a giant leap that could alienate a significant section of investors and raise doubts in the minds of employees and other stakeholders.\n\nAny organization mulling this move must figure out a compelling narrative to present. In a market with limited avenues for exposure to BTC, MicroStrategy is positioning itself as a vehicle for investors interested in indirect exposure to crypto.\n\nAnd this strategy is working instead nicely so far. In 2023, while BTC gained 160%, MicroStrategy stocks surged by more than 350%.\n\nAccounting and Reporting\n\nHighly volatile crypto assets like BTC present significant challenges related to corporate accounting and disclosure of financial reports.\n\nFor instance, crypto investments have an elevated risk of impermanent loss. To accurately reflect this in financial reports, MicroStrategy will have to conduct more frequent impairment testing, a financial accounting process used to assess whether the carrying value of an asset on a company’s balance sheet exceeds its recoverable amount.\n\nThe constantly shifting valuation of BTC also impacts your ability to present an accurate estimation of market risks, future earnings, liquidity, quarterly results, and more.\n\nRisk Management\n\nCryptocurrency transactions are irreversible and almost anonymous. These strengths can pose major problems from a corporate investment perspective as they increase the risk of theft, fraud, and losses due to inadvertent transactions.\n\nCustody and Storage\n\nGiven the high risk of theft associated with “hot” wallets, MicroStrategy considers “cold” wallets more appropriate for large-scale crypto holdings. They are also more convenient for risk disclosures.\n\nThe company relies on US-based qualified custodians to act as fiduciaries under relevant banking regulations. Multiple custodial accounts can offer some diversification. For large BTC transactions, MicroStrategy prefers relying on specialized brokers.\n\nMicroStrategy BTC Holdings vs Other Treasuries\n\nAs of January 2024, MicroStrategy owned 189,150 BTC, valued at over $8.4 billion. This represents 0.901% of the total BTC supply of 21 million coins. Here is how that stacks up against various other BTC treasuries.\n\nVs. Other Public Companies\n\nAmong public companies that own BTC, MicroStrategy is miles ahead of the rest of the chasing pack. The next biggest treasury on the list belongs to Marathon Digital Holdings, with 14,025 BTC worth $624 million. Honestly, that’s not even close to being in the same league.\n\nThe total value of BTC held by public companies is around $12.3 billion, or 276,336. MicroStrategy currently holds more than 68% of the total BTC under the ownership of publicly traded companies.\n\nVs. Governments\n\nSovereign nations around the globe own a combined total of at least $20.1 billion, or 451,968BTC in their treasuries. That represents 1.316% of the entire supply of BTC.\n\nIf MicroStrategy were a country, it would rank third on the largest government-owned BTC treasuries list. The company is only behind the USA ($9.22 billion) and China ($8.63) billion in its bitcoin holdings.\n\nGovernments aren’t investing in bitcoin, though. Most of the government-held bitcoin has been confiscated from criminal actors. The world’s governments have no interest in the price movement of bitcoin.\n\nVs. Private Companies\n\nAfter filing for bankruptcy, Mt Gox, the now-defunct cryptocurrency exchange, had bitcoin reserves of around 200,000 BTC worth $8.9 billion. Since most of it will be paid out to its creditors, that leaves Block as one as the next biggest privately-owned stash of BTC.\n\nThe blockchain software services company reportedly owns over 140,000 BTC, worth an estimated $6.2 billion at current rates. Other notable treasuries belong to entities like Tether Holdings ($2.44 billion), Tezos Foundation ($779 million), and Stone Ridge ($445 million).\n\nVs. ETFs\n\nOnly Grayscale Bitcoin Trust owns a bigger treasury than MicroStrategy among bitcoin exchange-traded funds. Not surprising, given that the purpose of an ETF is to purchase the asset represented by the ETF in hopes of making a profit for the fund holders. Grayscale has over 643,000 BTC valued at $28 billion, or 3.065% of the total supply.\n\nThe other significant ETFs all have smaller BTC holdings than MicroStrategy: Coinshares/XBT Provider ($2.1 billion), Purpose Bitcoin ($1.12 billion), and 3iQ Coinshares Bitcoin ($945 million) are the big ones.\n\nLearning From History\n\nSaylor is like a modern-day Scrooge McDuck, rolling around in his giant pile of bitcoin.\n\nThere’s nothing wrong with saving cash for a rainy day, even a lot of it. Alphabet, Microsoft, and Facebook hold billions in cash and marketable securities, which gives them options when they need to acquire a competitor or move quickly into a new market.\n\nBut the historical performance of hoarding behavior is mixed, at best. For example:\n\nApple Hoarding Gold : Steve Jobs believed gold was the ultimate hedge against inflation. (Sound familiar?) So, Apple kept a vast gold reserve for much of the 1970s and 1980s. The company sold off most of its gold in the 1990s and was later criticized for not investing that money back into the business.\n\n: Steve Jobs believed gold was the ultimate hedge against inflation. (Sound familiar?) So, Apple kept a vast gold reserve for much of the 1970s and 1980s. The company sold off most of its gold in the 1990s and was later criticized for not investing that money back into the business. Coca-Cola Hoarding Sugar : For much of the 20th century, Coca-Cola kept a strategic supply to protect its supply chain from sugar shortages and unexpected price increases. The practice continued until the late 2000s when sugar markets became more stable and globalized.\n\n: For much of the 20th century, Coca-Cola kept a strategic supply to protect its supply chain from sugar shortages and unexpected price increases. The practice continued until the late 2000s when sugar markets became more stable and globalized. Iran Hoarding Oil : An excellent example of resource stockpiling on a national scale. Oil is one of Iran’s most valuable assets, so the country keeps enormous oil reserves, which allows it economic and political leverage. But it brings the threat of fluctuating oil prices and international sanctions.\n\n: An excellent example of resource stockpiling on a national scale. Oil is one of Iran’s most valuable assets, so the country keeps enormous oil reserves, which allows it economic and political leverage. But it brings the threat of fluctuating oil prices and international sanctions. De Beers Hoarding Diamonds: When the company monopolized diamonds, they kept a stockpile of the precious gems to manipulate prices and maintain market dominance. Thankfully, better regulations and smarter consumers have forced De Beers to diversify their holdings.\n\nSometimes, hoarding works for a while. However, we believe that resources are usually better spent on growing the business, especially in the fast-moving technology industry. Long-term, Scrooge McDuck would probably be better off investing in his nephew’s new ideas.\n\nMicroStrategy BTC Purchases Over Time\n\nMicroStrategy’s three biggest BTC purchases were all made in their first year of BTC investing – starting in August 2020. By the end of the year, the company had amassed a BTC treasury valued at $1.125 billion.\n\nIn 2021, MicroStrategy made 14 different BTC purchases. The biggest of these was a $1.02 billion transaction on February 24. By the end of 2021, the company's BTC reserves had tripled to $3.75 billion.\n\nThe activity was relatively muted in 2022, as MicroStrategy only added around $250 million to its BTC reserves over the entire year. However, things have accelerated in 2023, with seven major purchases pushing its reserves close to $6 billion.\n\nMicroStrategy Financial Performance\n\nWhile assessing MicroStrategy’s (MSTR) financial performance, it is essential to factor in the actual impact of impairment charges/impermanent losses.\n\nThe company's operating revenues have remained relatively stagnant since 2017, staying close to the $500 million line.\n\nHowever, since its BTC investment strategy began, operating income has fallen drastically due to the reporting of impairment losses.\n\nIn 2021 and 2022, the company reported net income losses to $535 million and $1.46 billion, despite posting a gross profit of close to $400 million in both years.\n\nThis gives a somewhat inaccurate impression of the company's current performance, especially since it plans to hold BTC long-term. The numbers could bounce back in the future when the BTC prices rise.\n\nYou can see this disparity in the performance of the $MSTR stock. From a price of $166 in early January 2023, the stock had risen to $665 by the end of the year, indicating a 1Y price performance of +400. On December 29, it had a P/E ratio of 489.44.\n\nMicroStrategy Vs Competitors\n\nThe main competitors of MicroStrategy in the prepackaged software industry niche include Guidewire Software (GWRE), SS&C Technologies (SSNC), Blackbaud (BLKB), Instructure (INST), Commvault Systems (CVLT), ACI Worldwide (ACIW), Tyler Technologies (TYL), Progress Software (PRGS), Sapiens International (SPNS), and ANSYS (ANSS).\n\nLet us look closely at some of these competitors for a fair idea of MicroStrategy’s overall performance.\n\nGuidewire Software (GWRE)\n\nDespite a slightly lower market cap of $8.75 billion, GWRE boasts a better revenue than MSTR. The reported revenues of $905 million are more than double the average reported by MSRT in recent years. However, the 1Y price performance is only +70, and the P/E ratio is -125.59.\n\nInstructure (INST)\n\nThe market cap of this firm is $3.74 billion, or around one-third of MSTR. Instructure also reported comparable revenues of $475.19 million in 2023. Despite that, the demand for the stock remains rather tepid, with a 1Y price performance of +10.9%. The P/E ratio is likewise in the negative at -108.29.\n\nTyler Technologies (TYL)\n\nTYL is a more prominent company than MSTR, with a market cap of $17.19 billion. It also reported nearly 5x the latter's revenues at $1.85 billion. The 1Y price performance is positive at +26.6%. and the P/E ratio is also quite good at 110.\n\nKey Takeaways\n\nFrom a cursory glance at the competition, it is pretty clear that MicroStrategy stock is overperforming despite relatively lackluster financials and revenue reports. The investor interest generated by the company’s exposure to BTC is probably the only reason for its highly inflated P/E ratio.\n\nProblems with the SEC\n\nEven before its pivot to BTC, MicroStrategy has had past run-ins with the SEC. In 2000, the SEC filed fraud charges against the company for allegedly overstating its revenues and earnings for the preceding two years.\n\nDespite suffering losses between 1997 and 2000, MicroStrategy was alleged to have reported material gains in the run-up to its IPO in 1998. Immediately after the civil accounting fraud charges were filed, MicroStrategy reached a settlement deal with the SEC.\n\nThe company agreed to pay a fine of $11 million to settle cases. The penalties were paid by three top executives at the firm, including current CEO Michael Saylor, who paid $8.3 million. However, the settlement did not involve any admission of wrongdoing by MicroStrategy.\n\nAs part of the deal, MicroStrategy also agreed to restate financial results for 1998 and 1999. The company stock dropped 60% of its value within a day due to the fraud charges. From a peak of $333, it finally bottomed out at $33.\n\nThe Risk of Betting the Business on Bitcoin\n\nIn our investing approach, we recognize that bitcoin is risky: a roller-coaster. That’s why we hedge that risk by investing primarily in common stocks and bonds, with just a portion of our portfolio allocated to bitcoin:\n\nYou’ve got to wonder why Saylor doesn’t do the same. Why not hedge the risk of bitcoin with other investments – even gold?\n\nBy putting everything into bitcoin, he’s doing the thing we constantly warn you about. We don’t bet the farm on bitcoin.\n\nOnly in Saylor’s case, he’s betting the business on bitcoin.\n\nTrue, it’s unlikely that bitcoin will go to zero. True, it’s possible that his bitcoin investment could be 10x.\n\nAnd then what? Buy more bitcoin?\n\nInvestor Takeaway: Lots of Risk, Uncertain Reward\n\nUltimately, the purpose of a business is to generate new value for the world. If MicroStrategy is buying bitcoin without reinvesting it, investors should ask what the business really does. Is it a bitcoin holding company with a bit of software business?\n\nIf so, where is the value in that?\n\nMake no mistake: we’re bitcoin believers. More importantly, we’re believers in a new financial system. Here, MicroStrategy has enormous potential: it could use its considerable expertise to develop new financial software products or services that bring the world into the crypto age.\n\nBut sitting on top of a $5 billion bitcoin stash subjects the company to wild market uncertainty. It puts MicroStrategy on the bitcoin roller coaster. Lots of risk, with uncertain reward.\n\nFor investors who want to invest in bitcoin, our solution is simple: invest in bitcoin. Not MicroStrategy."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2UtYnJlYWtzLTE3ay1hcy1lcXVpdGllcy1qdW1wLW9uLXVzLWZlZC1zcGVjdWxhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Price Breaks $17K as Equities Jump on US Fed Speculation - Blockworks",
        "content": "Bitcoin’s daily trading session closed above $17,000 for the first time in almost a month on Sunday, following a favorable showing in US equities to close out last week.\n\nThe crypto, which is currently changing hands for around $17,200 per bitcoin, has been met by a modest amount of daily trading volume on major exchanges, and an uptick in volatility — which has been at historic lows. [indicating the relief rally could be short-lived.]\n\nMost cryptos in the top 20 have followed suit, with cardano and solana the largest gainers — rising more than 19% and 20% respectively over the past 24 hours. Solana saw a return of speculators last week chasing the latest dog-inspired meme coin, BONK.\n\nBitcoin is now trading at levels not seen since Dec. 13 where it jumped 3.5% on the day to reach a peak of $18,373 a day later. The crypto succumbed to a large sell-off on Dec. 15, courtesy of the current bear market climate and sell-side pressure.\n\n“Over the course of last week, we saw increased passive liquidity — as displayed by deeper order books and tightening bid/ask spreads mid-week,” Kurt Grumelart, special projects lead at trading firm Zerocap told Blockworks.\n\nGrumelart said the outperformance in various subsectors of the crypto market was helping to drive key narratives and prop up prices. Those include liquid staking derivatives, which have experienced “substantial rallies” in anticipation of a first-quarter launch of Ethereum’s Shanghai upgrade that will enable withdrawals of staked ether.\n\nDeFi-related assets exhibited marginal growth alongside a jump in the industry’s overall market capitalization, which grew 3.3% on Sunday to $885 billion.\n\nSitting within the top 10 of Messari’s DeFi assets category, Curve (CRV) and Maker (MKR) have witnessed growth over a 24-hour period, up 15.7% and 9% respectively. A general shift away from centralized entities to decentralized ones, following the blowout of FTX, are helping to drive up value in the sector, Clearpool CEO Rob Alcorn told Blockworks.\n\n“An entire generation of crypto products and protocols will be defined by their ability to survive last year’s stress tests and re-emerge as critical pieces of market infrastructure to lead a more compliant industry into the next bull market,” Alcorn said.\n\nUS equities and the broader markets rally ahead of bitcoin\n\nBuoyed by speculation of easing interest rate hikes by the US Federal Reserve, traders looked to signs of cooling wage growth and a contraction in services activity as a primary motivator.\n\nAnticipation is now building over a tapering of the Fed’s future rate hikes from 50 basis points to around 25 basis points to be declared at the next Federal Open Market Committee meeting by month’s end.\n\nUS equities had their best daily showing in more than a month on Friday with the S&P500 rising 2.3% to 3,895 while the Dow Jones Industrial was up 2.1% to 33,630. That represented the largest daily gains for US equities since Nov. 30 — 37 days ago.\n\nSo far, Asian shares have reacted positively to the favorable US moves, with Australia’s ASX index rising 0.6% to 7,153, Japan’s Nikkei 225 index also up 0.6% to 25,973, and in Europe the German DAX opening up 0.3% in the first hour of Monday trading.\n\nCoupled with better-than-expected nonfarm payroll figures (NPF), which measures the US labor force minus farmers and some other sectors, the macro environment has led to an increased bid in risk assets like crypto, Grumelart said.\n\n“Considering these drivers, the digital asset space is positioned to capitalize on a more favorable start to the year from a macro front,” he said. Though considerable challenges to the market, including the conclusion to the FTX debacle, will likely suppress prices in the short term.\n\nStill hanging over the market, Damocles’ sword-style, however, is the ongoing uncertainty over Digital Currency Group, and its subsidiaries, Genesis and Grayscale.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8venljcnlwdG8uY29tL2JpdGNvaW4tcHJpY2UtY291bGQtZ2V0LWFzLWxvdy1hcy05MDAwLWFzc2VydHMtcHVuZGl0LXdoby1jb3JyZWN0bHktcHJlZGljdGVkLWJ0Y3MtdG9wL9IBcGh0dHBzOi8venljcnlwdG8uY29tL2JpdGNvaW4tcHJpY2UtY291bGQtZ2V0LWFzLWxvdy1hcy05MDAwLWFzc2VydHMtcHVuZGl0LXdoby1jb3JyZWN0bHktcHJlZGljdGVkLWJ0Y3MtdG9wLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Price Could Get As Low As $9,000, Asserts Pundit Who Correctly Predicted BTC’s Top - ZyCrypto",
        "content": "Advertisement\n\nBitcoin continued to trend range bound on Saturday, riling investors who had to contend with lacklustre price volatility in the past 14 months. At press time, the top cryptocurrency was trading at $16,966 after a 1.11% increase in the past 24 hours, according to CoinMarketCap data. Its biggest rival, Ethereum, also traded sluggishly at $1263- a level it has been toying at for the past two days.\n\nBTCUSD Chart by TradingView\n\nUnlike the past year, where a clique of high net-worth investors like Tim Draper and Ark Invest CEO Cathie woods made extremely optimistic calls for Bitcoin, it has increasingly become harder for investors to predict where crypto prices may be going as 2023 unravels. However, some sceptics are convinced that Bitcoin will plunge lower before the curve can flatten out in the coming days.\n\nFor instance, Gareth Soloway, the chief market strategist of InTheMoneyStocks, believes there is more room for Bitcoin to the downside. Speaking to Kitco News earlier yesterday, the pundit who correctly predicted Bitcoin’s 2021 top, noted that Bitcoin could plunge to $9,000.\n\n“I’m still looking at eventually $12,000 to $13,000 in a short-term target. I do believe it will go lower than that and pierce $10,000 and could go as low as $9,000 before all this is over.” Soloway told Kitco’s, David Lin.\n\nAccording to him, the Bitcoin chart was in the process of forming a “bear flag pattern” which, if validated, could see its price drop to the said level. He, however, stated that BTC was likely to see a minor rally in the near term.\n\nAdvertisement\n\n“All we have to do is take out $17,000, and I actually think we are going to get a short-term rally to about $18,400. So actually, I’m very short-term bullish, but you can’t ignore the bigger pattern here, which is still bearish.”\n\nSoloway’s predictions come even as the FTX debacle hammers the markets. In the past two months, firms linked to Sam Bankman-Fried’s crypto empire have been folding, crushing investors’ risk appetite. To Soloway, however, whereas “there is still some flushing to do”, there was no doubt that all this was getting closer to ending.\n\n“We are also getting close to potential regulation, which I think will be a huge asset for bitcoin and crypto as that will be an avenue for big money to start dabbling in crypto again,” he went on.\n\nPreviously, Soloway has called for Bitcoin at $500,000 in the long term as clear regulations for the crypto sector are passed, and adoption picks up. Since tapping an all-time high of $68,789 in November 2021, Bitcoin’s price has fallen over 75%, making it the fourth largest wipe-out of all time in the asset’s history."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDkvYml0Y29pbnMtbW9kZXN0LXJhbGx5LXNlbmRzLWNyeXB0by1yZWxhdGVkLXN0b2Nrcy1zaGFycGx5LWhpZ2hlci_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzA5L2JpdGNvaW5zLW1vZGVzdC1yYWxseS1zZW5kcy1jcnlwdG8tcmVsYXRlZC1zdG9ja3Mtc2hhcnBseS1oaWdoZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin's Modest Rally Sends Crypto-Related Stocks Sharply Higher - CoinDesk",
        "content": "With most of the miners having begun the year priced as if they will follow peers Core Scientific (CORZ) and Argo Blockchain (ARBK) into either bankruptcy protection or some other form of restructuring, bitcoin's modest advance is having a big effect on Monday. Marathon is higher by 24% and the company formerly known as Riot Blockchain, Riot Platforms (RIOT), is up 18.5%. Hut 8 (HUT), Hive Blockchain (HIVE), and Bit Digital (BTBT) are all ahead more than 20%. While up just 4.6% Monday, Argo has quadrupled in value since agreeing to a bailout from Galaxy Digital (BRPHF)."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMS8wOS9jcnlwdG8tYnViYmxlLXBvbnppLXNjaGVtZS1mcmF1ZC1oaXN0b3J5LXNob2NraW5nLWZpbmFuY2lhbC1oaXN0b3JpYW4tc2F5cy_SAW5odHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDEvMDkvY3J5cHRvLWJ1YmJsZS1wb256aS1zY2hlbWUtZnJhdWQtaGlzdG9yeS1zaG9ja2luZy1maW5hbmNpYWwtaGlzdG9yaWFuLXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "‘A fraud and a bubble are two different things’: Crypto is shocking to a financial historian who literally wrote the book on financial bubbles - Fortune",
        "content": "The crypto space has lost more than $2 trillion in value over the past year. But for crypto loyalists, this is just another Crypto Winter. Remember 2018—when Bitcoin prices dropped 80%, and the media called it “dead” over 90 times? Don’t worry, they say. The Fed is raising interest rates and inflation and recession fears are making investors skittish, so they’re simply pulling back.\n\nThe meltdown of the world’s second-largest crypto exchange, FTX, the blowup of Luna and its sister algorithmic stablecoin TerraUSD, and the collapse of high-profile crypto lenders like Celsius and BlockFi, are merely bumps in the road, crypto proponents argue. But William Quinn, a senior lecturer at Queens’ University Belfast whose research focuses on financial bubbles, isn’t so sure.\n\nQuinn believes the cryptocurrency fervor of the past decade is either a “stupider bubble than any previous bubble” in financial history, or “a smarter Ponzi than any previous Ponzi”—or a third option.\n\n“So we have two possibilities,” he wrote in an article on journalist David Gerard’s website last week. “And the truth is probably somewhere in the middle.”\n\nQuinn, who wrote the book Boom and Bust: A Global History of Financial Bubbles in 2020, said that the cryptocurrency “bubble” doesn’t look like financial bubbles of the past.\n\nThe so-called “Tulip Mania” of the 17th century Dutch Golden Age was more of a “popular narrative” than a true financial bubble of modern scale, he said, arguing that it “made far too much sense to be compared to the crypto bubble.” And the dotcom bubble that began in the late ’90s is nothing but a “very flattering comparison” to crypto, according to the historian.\n\n“The problem is that crypto and blockchain, unlike the internet, are simply not very useful,” he argued.\n\nFor Quinn, there may not be a financial bubble in history that is worth comparing to the cryptocurrency mania of the past decade—this could be something else entirely.\n\nWhat makes the crypto bubble unique\n\nQuinn writes that cryptocurrencies have three defining features that make them unique from past financial bubbles.\n\nFirst, they have “no use-value” unless others are willing to accept them. Second, they don’t create cash flows. And third, some have mining costs that can only be paid in fiat, or government-issued, currencies. For example, Bitcoin miners typically buy electrical equipment, mining computers, and real estate with U.S. dollars.\n\n“Not all major cryptocurrencies are exactly like this, but most are close,” Quinn wrote. “These are uniquely terrible characteristics for an investment.”\n\nQuinn argued that these three unique characteristics mean the real question could be whether to classify crypto as a “fraud” or a “bubble.”\n\n“Every previous bubble I’ve encountered has involved either a commodity, a collectible, or an asset with associated cash flows…[b]ecause historically, producing a financial asset with no associated cash flows and marketing it as an investment would have been considered fraud,” he wrote. “And a fraud and a bubble are two different things.”\n\nQuinn is careful not to portray all cryptocurrencies in the same light. He writes that some, like Bitcoin, shouldn’t be considered frauds because they don’t have a main “perpetrator.”\n\n“Bitcoin was created as a sincere—if somewhat unhinged—political project, and operates independently of its creator. It’s a bad investment in the same way that a fraud is a bad investment, but it’s not a fraud,” he wrote.\n\nBlockchain’s proponents\n\nOf course, for every crypto skeptic, there’s a supporter ready to counter their argument. Even some of Wall Street’s most respected investors have become crypto bulls. The billionaire hedge funder Bill Miller said in January of 2022 that he has 50% of his net worth in Bitcoin. In May, he called the cryptocurrency “insurance” against financial disasters on the Richer, Wiser, Happier podcast.\n\nAnd the financial services industry has also leaned into blockchain technology in recent years. Visa’s current president, Ryan McInerney, who is set to become CEO in February, told Fortune’s Alan Murray in November that there may be “new use cases” for the blockchain in payments systems.\n\n“We do a lot of work on different opportunities using the blockchain,” he said. We think it’s possible [it will be part of the future payment system], but we are in the very, very early innings. It’s yet to be seen.”\n\nCarmelle Cadet, CEO of the fintech startup Emtech, told Fortune’s Sheryl Estrada in October that blockchain tech is the future and CFOs will likely adopt it in the coming years because it allows companies to account for assets and their ownership via a secure, decentralized ledger.\n\nAn improvement on past Ponzis?\n\nStill, Quinn argues that most cryptocurrencies could be viewed as a form of “improvement on the traditional Ponzi scheme,” and he isn’t the only one with that perspective. JPMorgan Chase CEO Jamie Dimon made a similar claim in September of last year, calling cryptocurrencies “decentralized Ponzi schemes” in testimony to the U.S. House Committee on Financial Services.\n\n“The notion that it’s good for anybody is unbelievable,” he said, arguing Bitcoin and other cryptocurrencies are “dangerous.”\n\nAnd NYU professor emeritus Nouriel Roubini has repeatedly slammed cryptocurrencies for years, even calling them “Ponzi scams” and a form of “corrupt gambling” in recent interviews.\n\nCryptocurrencies like Bitcoin work the same way as Ponzi schemes, according to critics like Roubini and Quinn, with new investors paying out early investors because no actual cash flows are being produced."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tc3VycGFzc2VzLTE3ay1mb3ItZmlyc3QtdGltZS1zaW5jZS1lYXJseS1kZWNlbWJlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin surpasses $17K for first time since early December - CryptoSlate",
        "content": "Crypto’s benchmark cryptocurrency, Bitcoin, has pushed past $17,000 for the first time in 2023 after being range bound for several weeks between $16,380 and $16,975.\n\nBitcoin has now been on a positive trend since the start of January when it opened the year at $16,482. Bitcoin is up 3.72% over the last seven days and 2.33% in the previous 24 hours, according to CryptoSlate data.\n\nWhy is Bitcoin pumping?\n\nWith a lack of significant on-chain developments within the Bitcoin ecosystem, the rally appears unlinked to any news related to the network. Further, noteworthy developments within the crypto space at large to which Bitcoin could react have been scarce.\n\nHowever, as the dust begins to settle on the FTX news cycle, the use case for Bitcoin in self-custody is stronger than ever. A global financial crisis is looming with continually steep inflation, no end in sight for the war in Ukraine, and growing tensions between China and the West. In addition, the concern over which asset class will act as the best store of value in 2023 may be strengthening investors’ resolve in Bitcoin.\n\nWhile Bitcoin acted as a risk-on asset throughout the majority of 2022, eyes now move to whether Bitcoin will repeat its strong performance when the Ukraine war started as we move further into 2023.\n\nThe next Bitcoin halving event is roughly 18 months away, so historical metrics suggest the bull market is not yet around the corner. However, plenty of investors have fled crypto after the tumultuous events of 2022. The collapse of major exchanges, projects, hedge funds, and lending platforms shook out plenty of investors while removing bad actors from the space.\n\nForbes recently discussed potential Bitcoin price predictions for 2023 with Alistair Milne, founder of Altana Digital Currency Fund, suggesting it could reach as high as $300,000 by 2024. Others had more conservative estimates predicting prices between $30,000 and $50,000, such as the Professor of Finance at Sussex University, Carol Alexander.\n\nEric Wall, the CIO of Arcane Assets, also stated the bottom is in for Bitcoin, and it will now race toward a $30,000 price target in 2023.\n\nPotential bear trap\n\nThe biggest elephant in the room, however, is the fate of Digital Currency Group and, therefore, Genesis and the Grayscale Trust. A recent CryptoSlate market report showcased the predicament facing DCG and the potential havoc it could wreak on the crypto industry should it be forced to liquidate assets to avoid bankruptcy.\n\nCryptoSlate is keeping a keen eye on developments at DCG as there have been no further updates following the Winklevoss Twin‘s ultimatum regarding Genesis Earn funds. The Winklevoss brothers set a deadline of Jan. 8 for DCG to respond to an open letter, a date which has now passed without a word.\n\nThe Forbes article mentioned above also highlighted several traditional finance companies that predicted Bitcoin would fall below $10,000 this year. Most notably, Eric Robertsen, the Global Head of Research for Standard Chartered, called for $5,000 as “crypto firms and exchanges find themselves with insufficient liquidity, leading to further bankruptcies and a collapse in investor confidence in digital assets.”\n\nYet, as the chart below indicates, the overall crypto market cap has been rallying since 2023. Over the past nine days, over $50 billion has been injected into the crypto markets. As we welcomed in the new year, the total market cap was $795 billion but has since hit $859 billion, according to CoinMarketCap.\n\nThe global crypto market cap with Bitcoin removed stood at $477 billion on Jan. 1. It has steadily grown to $525 billion, an increase of $58 billion. Thus, while Bitcoin is performing well in 2023, the broader crypto market is outperforming the flagship crypto network. Only $18 billion has been injected into Bitcoin, a mere 4.7% increase in market cap compared to the rest of the total market (minus Bitcoin), which rose by 10%.\n\nNothing has changed regarding Bitcoin’s fundamentals, and 2023 is set to be a year where either the FIAT system solves the inflation problem, or the events of 2008 come back to bite central banks harder than ever.\n\nThe FIAT problem\n\nA world where the FIAT system is on its last legs is a world where Bitcoin has the potential to reign supreme. Time will tell whether the U.S. Federal Reserve, Bank of England, European Central Bank, and Bank of Japan can regain economic control.\n\nWhile Bitcoin has remained flat before starting to rise in value, the Dollar has been downward since late September. The chart below shows the peak strength of the Dollar being reached on Sept. 22, 2022. Since then, it has fallen over 10%, roughly the same decline seen on the Bitcoin chart for the same period.\n\nBitcoin’s volatility has been at some of the lowest levels in its history between November and January, moving around 12% in both directions during the period.\n\nToday’s price action in Bitcoin mirrors the Dollar’s poor performance over the last 24 hours. Since Jan. 6, the DXY has declined by 2.49%, while Bitcoin has risen by 2.9%. Of course, neither of these moves is unprecedented. However, should the DXY continue to fall throughout 2023, it could give Bitcoin the strength it needs to return to levels last seen before the bad actors caused a market-wide sell-off during 2022.\n\nBitcoin is clearly positioning itself as a flight from FIAT in a world where global currencies are potentially in serious jeopardy. Of course, there are multiple moving parts, some historically correlated and some not, but 2023 is undoubtedly set to be an interesting experiment in how Bitcoin performs amid further global economic uncertainty."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sZXNzLXRoYW4tMTAwLWJpdGNvaW4tYXRtcy1hZGRlZC13b3JsZHdpZGUtaW4tdGhlLXNlY29uZC1oYWxmLW9mLTIwMjItZGF0YdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Less than 100 Bitcoin ATMs added worldwide in the second half of 2022: Data - Cointelegraph",
        "content": "While Bitcoin (BTC) ATMs were an afterthought to Satoshi Nakamoto’s vision of sound money, they are now considered one of the main pillars of Bitcoin’s mainstream adoption. However, the global Bitcoin ATM network, which used to add thousands of machines each month in 2021, recorded a net addition of just 94 Bitcoin ATMs over the past six months since July 2022.\n\nA year-long bear market in 2022 — accompanied by geopolitical tensions and global inflation — hindered various initiatives aiding the growth of the entire crypto ecosystem. As a result, efforts to install new Bitcoin ATMs dipped in many countries that once spearheaded the initiative.\n\nChart showing the number of bitcoin machines installed over time. Source: CoinATMRadar\n\nOver the last six months, between July to the end of 2022, just 94 Bitcoin ATMs were added to the global network. In contrast, a modest 4,169 ATMs were added during the year’s first six months, confirms data from CoinATMRadar.\n\nDespite the global slowdown, countries such as Spain and Australia have taken the lead in crypto ATM installations. The United States and Canada retain the top two positions for hosting the highest number of ATMs. El Salvador, the country that once held the third position, has now moved down to the fifth position after Spain and Australia, respectively.\n\nNumber of cryptocurrency machines installed over time per each top manufacturer over time. Source: CoinATMRadar\n\nDuring this timeframe, Bitcoin ATM manufacturer BitAccess saw a relative drop in its ATM installation while others reported a comparatively steady increase.\n\nAs crypto investors shake off the negative sentiments from the past year and dive back into the game, sub-ecosystems like Bitcoin ATMs remain well-positioned for a recovery.\n\nRelated: Florida best-prepared US state for widespread crypto adoption: Research\n\nAustralia, just after overtaking El Salvador to become the fourth-largest crypto ATM hub, got its first Bitcoin ATM with integrated Lightning Network (LN) capabilities.\n\nUsing LN, Bitcoin ATMs can process transactions immediately without having the operator batch the funds. As Cointelegraph previously reported, this development can potentially lower transaction fees compared to an on-chain payment."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzA5L2NyeXB0by1tYXJrZXRzLWFuYWx5c2lzLWZhbGxpbmctaW5mbGF0aW9uLWV4cGVjdGF0aW9ucy1taWdodC1zaWduYWwtYnVsbGlzaC10dXJuLWZvci1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Falling Inflation Expectations Might Signal Bullish Turn for Bitcoin - CoinDesk",
        "content": "It ranges between 0-100, with 30 implying that an asset may be oversold and 70 indicating that an asset may be overbought. Ether has breached the upper range of its Bollinger Bands in four of the last six days. An asset reaches the upper range of Bollinger Bands, is often interpreted as a bullish signal."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iZWxnaWFuLW1wLXJlY2VpdmVzLWJpdGNvaW4tc2FsYXJ5LWZvci1hLXllYXItaGVyZS1zLXdoYXQtaGUtbGVhcm5lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Belgian MP receives Bitcoin salary for a year: Here's what he learned - Cointelegraph",
        "content": "At the end of January 2022, member of the Belgian parliament Christophe De Beukelaer became the first European politician to convert his salary to Bitcoin (BTC). Celebrating the anniversary of this experiment, Cointelegraph reached out to a lawmaker to know more about his experience.\n\nBack in 2022, Beukelaer, who represents Humanist Democratic Centre (CDH) party, cited the example of New York City Mayor Eric Adams and how American politicians are working to make their native states or cities Bitcoin hubs to justify his decision. The Brussels MP’s monthly salary of 5,500 euros ($6,140) was to be converted to Bitcoin using the Bit4You crypto trading platform.\n\nRelated: Belgium says BTC, ETH and other decentralized coins are not securities\n\n“I did this political act of paying in Bitcoin to defend political ideas,” shared Beukelaer, citing four ones: defending financial freedom and economic opportunity and combating financial illiteracy and growth model. The last one is perhaps the most interesting, as the lawmaker, who called himself a “pragmatic environmentalist,” sees a clear link between Bitcoin and the environmental clause:\n\n“What does the central bank do when it prints money as it has done in recent years? It gives the illusion of infinite resources and thus encourages all economic actors to produce and consume more and more.”\n\nBeukelaer considered his experiment successful in both putting Belgium on the global crypto map and encouraging local officials to educate themselves on digital assets:\n\n“A lot of politicians said to themselves: ‘De Beukelaer is not an anarchist. If he is interested in Bitcoin, there must be something interesting behind it.’”\n\nWas it comfortable in practical terms? The positive answer is hardly imaginable, given the BTC’s decline from almost $38,000 in January 2022 to $17,246 at the time of publication in January 2023, but the MP didn’t regard his experiment as an economic strategy from the very beginning:\n\n“It was a political act and not a financial gesture. Like those who grow mustaches in November to fight prostate cancer. I put this salary in Bitcoin on a cold wallet every month and I haven't touched it. My goal was not to live in crypto.”\n\nWhile the first major step to pan-European regulation is undertaken, Beukelaer highlighted the reservations of the Markets in Crypto-assets legislation: The excessive constraints imposed on the personal holding of crypto or the way stablecoins are considered.\n\nEurope is heading toward hard times, the politician believes, citing the crises in energy supply and climate, and the rise of authoritarian leaders. It is in that regard how Western countries will gradually understand the usefulness of crypto."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wMS8wOC8yNTg0NzI0LzAvZW4vT2xkLUJpdGNvaW4tQkMtTGF1bmNoZXMtU3VyZ2luZy10aHJvdWdoLXRoZS1EZWNlbnRyYWxpemVkLU1hcmtldHMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Old Bitcoin ($BC) Launches Surging through the Decentralized Markets - GlobeNewswire",
        "content": "London, UK, Jan. 08, 2023 (GLOBE NEWSWIRE) -- The Old Bitcoin ($BC), has been launched on the ERC network to memorialize the original Bitcoin that now suffers in the hands of the elite. The Old Bitcoin ($BC) aims to put things right and reinstate Bitcoin to its deserved glory as a pre-eminent peer-to-peer cash transfer system.\n\n\n\nOld Bitcoin ($BC)\n\nBC DAO\n\nThe foundations of BC DAO have already been laid, although its inauguration is still awaited. BC DAO will soon be launched by the project where holders of $BC will decide on policies and administer their execution.\n\nTokenomics\n\nThe token has a total circulating supply of 21 million with the entire stock being utilized for maintaining the liquidity pool. A 2% tax is collected for every transaction. The tax collected is used for improvising the liquidity pool, marketing, and funding new projects.\n\nNew Developments that Users can Expect in the Following Years\n\nThe community of the platform is about to witness some of the most sublime projects and developments of the project. BC DAO and Shill-to-Earn dApp will soon be launched by the project.\n\nOther than that, a Roadmap following the community and team goals has also been released.\n\n\n\nOld Bitcoin Roadmap\n\n1st January 2023\n\nThe project is already thriving at a supernatural rate. At the time of its launch, it had already gathered a market cap of $4,000,000 and allured 2,300 investors. However, there is still more to attain.\n\nThe project has already signed a deal with $BEEP, a top-notch community, and research-driven media in China. It has already been listed on CoinMarketCap and has applied for CoinGecko.\n\nFurthermore, the project has also added more moderators to its team that respond to client queries on Telegram and ensure the efficient operation of all activities. The project keeps its community members updated with any developments via Telegram and Twitter.\n\nAbout Old Bitcoin ($BC)\n\nOld Bitcoin is a foremost cryptocurrency platform on the ERC Network that is ideal for investors wishing to transfer value without the slightest hint of double-spending.\n\nFurthermore, potential investors and crypto enthusiasts interested in Old Bitcoin can visit the project’s official website or social platforms, to get more details.\n\nWebsite | Telegram | Twitter\n\nReferences:\n\nERC Contract: https://etherscan.io/address/0xe03b2642a5111ad0efc0cbce766498c2dd562ae9\n\nDEXTools: https://www.dextools.io/app/en/ether/pair-explorer/0xc9c9c0c9a70355b0afb47571c37d6f7c5220e36d\n\nCoinMarketCap: https://coinmarketcap.com/currencies/old-bitcoin-erc/\n\n###\n\nOld Bitcoin\n\nNathan Guericke\n\nsatoshi@oldbtc.net\n\nhttps://oldbtc.net\n\nDisclaimer:\n\nThis press release may contain forward-looking statements. Forward-looking statements describe future expectations, plans, results, or strategies (including product offerings, regulatory plans and business plans) and may change without notice. You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements.\n\n"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtMy13ZWVrLWhpZ2hzLWdyZWV0LXVzLWNwaS01LXRoaW5ncy10by1rbm93LWluLWJpdGNvaW4tdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "BTC price 3-week highs greet US CPI — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a new week on a promising footing with BTC price action near one-month highs — can it last?\n\nIn a new year’s boost to bulls, BTC/USD is currently surfing levels not seen since mid-December, with the weekly close providing cause for optimism.\n\nThe move precedes a conspicuous macroeconomic week for crypto markets, with the December 2022 Consumer Price Index (CPI) print due from the United States.\n\nJerome Powell, Chair of the Federal Reserve, will also deliver a speech on the economy, with inflation on everyone’s radar.\n\nInside the crypto sphere, FTX contagion continues, with Digital Currency Group (DCG) at odds with institutional clients over its handling of solvency problems at subsidiary Genesis Trading.\n\nAt the same time, under the hood, Bitcoin still shows signs of recovery from the FTX turmoil, with miners among those catching a break.\n\nCointelegraph takes a look at these factors and more as the second trading week of January gets underway.\n\nBitcoin price passes $17,000\n\nBitcoin managed to spike higher at the Jan. 9 weekly close, hitting levels absent from the chart since Dec. 16.\n\nData from Cointelegraph Markets Pro and TradingView shows local highs coming in at $17,250 on Bitstamp.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nDespite only adding several hundred dollars, the move on BTC/USD did not go unnoticed given the extremely compressed trading range in place for many previous weeks.\n\nNonetheless, eyeing potential continuation, traders were less than willing to change their longer-term conservative perspective.\n\n“Onwards and upwards to my $17,300 - $17,500 target,” Crypto Tony told Twitter followers in an update on the day:\n\n“I have taken some profit here on my scalp long, and remain in my short as long as we are below 17,500 on 4 hour closure.”\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, likewise left the door open for some modest upside continuation, but warned that the start of the week would present hurdles.\n\n“Still watching a case like this on Bitcoin,” he confirmed alongside an explanatory chart:\n\n“I think we’ll continue rallying coming week, but probably have a drop due to Gemini or correction on Monday first.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/ Twitter\n\nMeanwhile, Venturefounder, a contributing analyst at on-chain analytics platform CryptoQuant, reminded investors to zoom out.\n\n“Bitcoin has been stuck between $16k and $18.5k for 2 months now,” he acknowledged:\n\n“Watch this range very very carefully, a break from either direction can bring 20% volatility, could happen soon. A definitive break of $16k could see $13k, make $18.5k support we can see $22.5k.”\n\nBTC/USD annotated chart. Source: Venturefounder/ Twitter\n\nCPI countdown returns as risk asset traders eye volatility\n\nAll eyes, including those of the Federal Reserve, are on inflation data this week with the December print of the Consumer Price Index (CPI) due for release.\n\nCPI, which will greet markets on Jan. 12, is a key component of Fed policy, and traders and analysts alike are keenly aware that the signals it provides can lead to shifts in its stance.\n\nRecently, CPI has been declining, hinting that the Fed’s existing interest rate hikes have had a positive impact on inflation.\n\nShould this continue or even decline more than expected, hopes that the Fed will decrease rate hikes faster — or even cancel them altogether — will increase.\n\nThis, in turn, provides a window for risk assets including crypto to gain, as Fed policy easing ignites appetite for risk.\n\n“Expecting enormous volatility. Huge cash position and light position size for me,” Ted Zhang, trader and research analyst at Revere Asset Management, told Twitter followers, describing the CPI event as a “huge week.”\n\nOthers noted the unusual timing of the CPI schedule, with the data coming two days after a speech on the economy by Fed Chair, Jerome Powell.\n\n“Unfortunately or fortunately the speech is on Tuesday while cpi on Thursday so any hawkishness will be undone post cpi numbers on Thursday!” one response read, adding that market reactions to Powell’s speech may well amount to “noise.”\n\nAccording to CME Group’s FedWatch Tool, the chances of a 25-basis-point rate hike this month currently stand at 75% versus a 25% chance of a large 50-basis-point move.\n\nFed target rate probabilities chart. Source: CME Group/ Twitter\n\nLong term, skeptics including “Big Short” investor Michael Burry maintain that inflation will return, with the Fed obliged to raise rates again as a result.\n\n“CPI inflation is unlikely to fall as low as 2%, let alone go negative,” gold bug Peter Schiff wrote in a response to Burry last week:\n\n“But I agree with you that the Fed will return to QE and the official inflation rate will hit a new high. The unofficial actual rate will hit a new all-time record high.”\n\nDCG publicly faces the music\n\nAs the fallout from the FTX saga rolls on, it is institutional investment giant Digital Currency Group (DCG) coming in for a grilling this month.\n\nExposure to FTX heightened pressure on certain DCG subsidiaries in an increasingly complex story which has even raised questions about the future of the largest institutional Bitcoin investment vehicle.\n\nThe Grayscale Bitcoin Trust (GBTC) currently has BTC assets under management in excess of $10 billion. Its share price, according to data from Coinglass, trades at an implied 44% discount to the Bitcoin spot price.\n\nAs Cointelegraph reported, exchange Gemini has had some of its assets frozen in DCG firm Genesis Trading after it halted withdrawals in light of FTX. Its co-founder, Cameron Winklevoss, has publicly appealed to DCG CEO, Barry Silbert, for answers.\n\nJan. 8, he wrote in an open letter to Silbert, marking a deadline for the situation to be resolved, but with time up, Silbert himself disputes this.\n\n“DCG delivered to Genesis and your advisors a proposal on December 29th and has not received any response,” he claimed in part of a Twitter response to Winklevoss on Jan. 2.\n\nShould events take an unpredictable turn, the implications for Bitcoin markets may become more serious, with DCG’s prominence as an investment entity making the debacle particularly conspicuous.\n\nDescribing recent events, Checkmate, lead on-chain analyst at Glassnode, said that DCG was continuing to “blow up in slow motion.”\n\n“And Bitcoin price is basically a stablecoin,” he added.\n\n“2023 all depends on DCG at this point,” Justin Herberger, author of the Invest and Prosper newsletter, meanwhile forecast:\n\n“If they somehow collapse, it’s gonna get ugly. That could be our last leg down to 85% draw down from Bitcoin ATH’s.”\n\nGBTC premium vs. asset holdings vs. BTC/USD chart. Source: Coinglass\n\nMiners break severe selling streak\n\nBitcoin miners have been on the radar for most of 2022, but the BTC price dip which followed the FTX implosion worsened an already tenuous situation.\n\nMiners began to divest themselves of their stored Bitcoin in order to remain financially viable, and on-chain metrics swiftly warned of a miner “capitulation” already in progress.\n\nAs Cointelegraph reported, however, neither the extent of the sell-off nor its duration appeared critical, and recently, the situation has stabilized.\n\n“The heavy sell pressure from Bitcoin miners that has barraged the market for the last 4 months has finally subsided for now,” William Clemente, founder of crypto research firm Reflexivity, summarized alongside data from on-chain analytics firm Glassnode this weekend.\n\nThat data showed the 30-day net position change for Bitcoin miners, this in fact beginning to increase versus the month prior.\n\nBitcoin miner net position change chart. Source: William Clemente/ Twitter\n\nSeparate Glassnode data supported the observation, with miners’ BTC reserves hitting their highest in a month on Jan. 8.\n\nBitcoin miner balance chart. Source: Glassnode/ Twitter\n\nEyeing Bitcoin’s hash rate — the estimated processing power dedicated to mining — Jan Wuestenfeld, analyst at crypto research and advisory firm Quantum Economics, was equally upbeat on the status quo.\n\n“It is crazy how the hashrate, albeit miners coming under heavy pressure, has only corrected a bit over the last two months of 2022 and now is even increasing considering the 30-day moving average,” he noted.\n\nLast week, Bitcoin’s network difficulty adjusted downward by around 3.6%, taking into account a drop in competition among active miners. According to the latest forecast from BTC.com, however, the next adjustment will wipe out those losses to add 9% to the difficulty level, in so doing marking a fresh all-time high.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\n“Extreme fear” meets 18-month crypto volume lows\n\nCrypto market sentiment is as unsure as ever when it comes to the near-term outlook, according to the Crypto Fear & Greed Index.\n\nRelated: Macroeconomic data points toward intensifying pain for crypto investors in 2023\n\nOver the weekend, the Index, which compiles a sentiment score from a basket of weighted triggers, dipped back into the top of its most bearish bracket, “extreme fear.”\n\nA first for 2023, “extreme fear” is nonetheless familiar to longtime market participants, who watched as sentiment endured its longest-ever stint in the Index’s lowest zone last year.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nAt the same time, interaction with crypto appears noticeably lacking at current price levels.\n\nData from research firm Santiment has captured the lowest transaction volume across crypto since mid-2020.\n\n“Altcoin volume is particularly low,” a note to an accompanying chart stated.\n\nBitcoin spent output value bands annotated chart. Source: CryptoBitcoinChris/ Twitter\n\nSeparate numbers from CryptoQuant flagged by popular social media commentator CryptoBitcoinChris nonetheless noted that whale selling had also decreased since December, this potentially setting a trend and “positive effect on market sentiment.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzA5L2FuYWx5c3Qtd2FybnMtb2YtMjMzMDM0MTAwMC1lbGVwaGFudC1pbi10aGUtcm9vbS1mb3ItYml0Y29pbi1idGMtaGVyZXMtd2hhdC1oZS1tZWFucy_SAXpodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8wOS9hbmFseXN0LXdhcm5zLW9mLTIzMzAzNDEwMDAtZWxlcGhhbnQtaW4tdGhlLXJvb20tZm9yLWJpdGNvaW4tYnRjLWhlcmVzLXdoYXQtaGUtbWVhbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Analyst Warns of $2,330,341,000 Elephant in the Room for Bitcoin (BTC) – Here’s What He Means - The Daily Hodl",
        "content": "A widely followed crypto analyst is warning of an elephant in the room that could trigger another sell-off event for king crypto Bitcoin (BTC).\n\nIn a new strategy session, Nicholas Merten, the host of DataDash, tells his 512,000 YouTube subscribers that dormant sell-side pressure from the Mt. Gox debacle may rear its head and cause another leg down for the top crypto asset by market cap.\n\n“There is a question we need to ask, as to whether or not the Mt. Gox trust is going to [cause the price of BTC to dip], or more specifically, what’s more relevant is whether or not the long-awaited unloading of this Bitcoin back to its original holders is going to happen due to pressure from those holders to be able to finally get access to that Bitcoin.\n\nThe second question is whether or not the sell-off from that is going to be the bottom, because as we saw during that last bull market, the [Mt. Gox’s BTC] holdings not even dropped in half. It dropped from around 200,000 to 137,000 [BTC]. If we see this kind of sell pressure or in this case unloading of Bitcoin into the supply in the open market, what is that going to mean for price?”\n\nMt. Gox is a defunct crypto exchange that was based in Japan. It went bankrupt in 2014 after being hacked. In July 2022, it was announced that it will be repaying former customers as part of its bankruptcy proceedings.\n\nMerten says that the payment of BTC to Mt. Gox’s former clients could be an immense source of sell-side liquidity.\n\n“I think it is going to mean a brutal amount of sell-side pressure. People who have had Bitcoin since back when it was double, triple digits, just a couple dozen dollars, or a couple hundred bucks, and they’re going to want to start to take profit because they feel that Bitcoin as an asset is done for.”\n\nBitcoin is changing hands for $17,195 at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE-2"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjAwMDg5L2JpdGNvaW4tYXRtLWluc3RhbGxhdGlvbnMtZmxhdGxpbmXSAUpodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMDAwODkvYml0Y29pbi1hdG0taW5zdGFsbGF0aW9ucy1mbGF0bGluZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin ATM installations flatline as crypto winter bites - The Block",
        "content": "The growth of new bitcoin ATMs globally has essentially flatlined, with little progress since July 2022 — when bitcoin collapsed from all-time highs and fell as low as $23,000.\n\nThe number of bitcoin ATMs around the world is now 38,641, according to Coin ATM Rader. Although that’s up from 14,051 at the start of 2021, there has been little growth since the crypto market collapsed last year.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nWhile the majority of ATMs are in the U.S., where growth has subsided, a few other countries are still seeing some increases. There are 100 more ATMs in Europe since the start of last year, 430 more in Canada, 50 in Spain, 30 in Poland and 190 in Australia."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTA5L2NyeXB0by10b3BzLXN0b2Nrcy1nb2xkLWluLW5ldy15ZWFyLWdhaW4tc2hhZG93ZWQtYnktc2tlcHRpY2lzbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Crypto Tops Stocks, Gold on Best Bitcoin Streak in Nearly a Year - Bloomberg",
        "content": "A cryptocurrency sector battered by turmoil last year is showing some signs of life early in 2023, posting bigger gains than other asset classes like stocks, bonds and gold.\n\nThe MVIS CryptoCompare Digital Assets 100 Index of top tokens is up 7% so far this month, exceeding advances of about 2% in global stocks , 1% in bonds and 3% from gold , according to data compiled by Bloomberg."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tcHJpY2UtdGVzdHMtc3VwcG9ydC1hdC0yNi0wMDAtd2l0aC1hdWd1c3RzLXVzLW5mcC1kYXRhLWV4Y2VlZGluZy1tYXJrZXQtZXhwZWN0YXRpb25zLTIwMjMwOTAxMTI1MNIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLXByaWNlLXRlc3RzLXN1cHBvcnQtYXQtMjYtMDAwLXdpdGgtYXVndXN0cy11cy1uZnAtZGF0YS1leGNlZWRpbmctbWFya2V0LWV4cGVjdGF0aW9ucy0yMDIzMDkwMTEyNTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price tests support at $26,000 with August’s US NFP data exceeding market expectations - FXStreet",
        "content": "Share:\n\nUS Nonfarm Payrolls increased by 187,000 in August, above the market expectations of 170,000.\n\nBitcoin and altcoin traders can expect a sell-off in BTC in the short- term, in response to the hot employment figures.\n\nThe Federal Reserve’s double mandate requires keeping employment and inflation in check, the NFP data could therefore influence the upcoming interest rate hike decision.\n\nThe Nonfarm Payrolls data is closely scrutinized by the US Federal Reserve to assess the impact of its monetary policy. The US Central Bank is focused on keeping employment and inflation in check, the heating job market is therefore likely to influence the Fed’s decision to hike interest rates in September.\n\nBitcoin traders’ reaction to the release of NFP data is likely to be short-lived, market participants can expect volatility in the American trading session.\n\nAlso read: Could US Nonfarm Payrolls provide directional cues Bitcoin needs?\n\nBitcoin price experiences downside volatility, knee-jerk reaction to NFP data\n\nBitcoin price tested support at $26,000 as market participants displayed a knee-jerk reaction to the release of Nonfarm Payrolls data for August. 187,000 Nonfarm Payrolls were added in the month of August, against the market’s expectations of 170,000.\n\nA heated job market is likely to factor in, when the Federal Reserve assesses the impact of its monetary policy. To promote effectively the goals of maximum employment and stable prices, there is a likelihood of an interest rate hike in September.\n\nMoreover, the impact of the data release on Bitcoin is likely to be short-lived, as noted in previous instances. Participants can expect higher volatility in the American trading session in BTC price.\n\nAt the time of writing, Bitcoin price is $26,023 on Binance. A short-term sell-off, or BTC sweeping lows below $26,000 is likely, as traders digest the employment numbers for August 2023.\n\nBTC/USDT five-minute price chart on Binance"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2JpdGNvaW4vaG93LW11Y2gtd291bGQtaS1oYXZlLWVhcm5lZC1pZi1pLWludmVzdGVkLTEwMC1pbi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "How Much Would I Have Earned if I'd Invested $100 in Bitcoin? (2024 Edition) - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tYXR0cmFjdHMtbWVnYS13aGFsZXMtd2l0aC1uZXctbW92ZXMtZmluZHMtc3VwcG9ydC1hdC10aGUtMTYtODAwLWxldmVsLTIwMjMwMTA4MTEyNtIBjQFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLWF0dHJhY3RzLW1lZ2Etd2hhbGVzLXdpdGgtbmV3LW1vdmVzLWZpbmRzLXN1cHBvcnQtYXQtdGhlLTE2LTgwMC1sZXZlbC0yMDIzMDEwODExMjY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin attracts mega whales with new moves, finds support at the $16,800 level - FXStreet",
        "content": "Share:\n\nBitcoin price is prepared to break out of its triangle formation after establishing new support at the $16,800 level.\n\nThe cryptocurrency has attracted large wallet investors to its network with a new 100-week point of control below the $17,000 level.\n\nExperts believe that the $16,800 level is the new potential bottom for the asset; this is where the most volume has been traded in the last 100 weeks.\n\nBitcoin, the most significant asset by market capitalization, has witnessed a consistent decline in its volatility over the past eight weeks. Despite declining activity on the Bitcoin network, analysts have identified a potential bottom at the $16,800 level. They believe BTC will likely hold its ground at this volume point of control.\n\nAlso read: Bitcoin price holds steady after FOMC minutes release, will BTC rally soon?\n\nBitcoin establishes new volume point of control below $17,000\n\nBitcoin, the dominant cryptocurrency with a market capitalization of $356 billion, formed support at the $16,800 level. BTC recently climbed above the 50-day Exponential Moving Average (EMA) and the 200-day EMA. Bitcoin flipped its two long-term moving averages and formed new support at the $16,800 level.\n\nExperts have identified a new 100-week point of control below the $17,000 level. @TrendRidersTR, a crypto analyst and trader, identified the $16,800 level as a critical BTC price support zone.\n\nBTC/USD price chart\n\nAs seen in the chart above, the 100-week point of control is at the $16,800 level, the 200-week POC is at $9,200, and the 300-week POC is at $3,700. The POC is a key level for an asset as it represents the highest volume traded level in a cryptocurrency’s chart; it acts as a fundamental support/ resistance level.\n\nThe largest asset by market capitalization has been trading in an increasingly narrow trading range since the FTX saga in November 2022. Contrary to popular belief, Bitcoin price could continue its climb against the USD.\n\nThe expert was quoted as:"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGUtcmFjZS1mb3ItYml0Y29pbi1pcy1hLW1hdHRlci1vZi1uYXRpb25hbC1zZWN1cml0eS1vcGluaW9uL9IBW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGUtcmFjZS1mb3ItYml0Y29pbi1pcy1hLW1hdHRlci1vZi1uYXRpb25hbC1zZWN1cml0eS1vcGluaW9uLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "The Race for Bitcoin Is A Matter of National Security (Opinion) - CryptoPotato",
        "content": "Financial markets for everything, including crypto, remain on pause as we mark off the first week of 2023. At this time of global economic uncertainty, people are holding their cash close. Here’s why it’ll be increasingly important for governments to hold their Bitcoin close.\n\nBitcoin’s price barely budged after the release of the latest jobs report. It moved less than a percent, holding above $16,900 as the job data suggested more rate hikes.\n\nBitcoin Is Poised To Become The World’s “Primary Monetary Good”\n\nLet’s set aside investors’ woes over the crypto price winter for a moment and consider the reality of Bitcoin in 2023. People used to question whether the cryptocurrency was even here to stay. Now, successful investors and even banking giants have acknowledged its merits.\n\nFidelity Investments not only considers Bitcoin a more secure and resilient cryptocurrency than most of its peers, but its report states the bank’s opinion that BTC has the characteristics and positioning to become the world’s “primary monetary good.”\n\nNot only is Bitcoin here to stay, but it will underpin more global reserves as the decade goes on. That poses serious concerns and opportunities for U.S. national security and for that of all major world powers in the international hegemony.\n\nNational Security Stake in Joining The Bitcoin Race\n\nWe’re near an important inflection point in Bitcoin’s history. 14 years into the grand experiment, it is now understood by technical professionals and industry investors as a mature technology platform. It has proven its security and reliability, stacking a new block without interruption every ten minutes for 14 years now.\n\nMarkets are starting to reflect this new reality of Bitcoin’s stability and ascendency in world finance. The Bitcoin price is at historically low volatility. While traders who profit from roiling markets may not find it as interesting, institutions and governments are stepping up to bat next.\n\nWhen regulations get clearer, the U.S. will have to rethink its entire foreign policy toolkit. Other sovereign nations are making haste to jump into the Bitcoin race. El Salvador is most notable among them, and others in Central America.\n\nIn its latest National Security Strategy document (NSS), the Biden Administration says:\n\n“We will explore the merits and responsibly lead development of digital assets, including a digital dollar, with high standards and protections for stability, privacy, and security to benefit a strong and inclusive U.S. financial system and reinforce its global primacy.”\n\nThat will be important over the next decade. The dollar will never go away as a major world reserve. It is too stable, too conventional, and it’s backed by the United States. But many parts of the world actively pursue a de-dollarization policy unheard of in the last century.\n\nThe U.S. can only preserve its global dominance and relevance at 20th-century levels by joining the Bitcoin race for hash power and BTC."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAxLzA5L3doeS1yaW90LXBsYXRmb3Jtcy1pcy1hYnNvbHV0ZWx5LXNreXJvY2tldGluZy10b2RhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Why Riot Platforms Is Absolutely Skyrocketing Today - The Motley Fool",
        "content": "What happened\n\nAmid a sea of green in most cryptocurrencies and crypto-adjacent stocks today, it's hard to find any asset that's not seeing significant gains. However, among the biggest winners in today's session is crypto miner Riot Platforms (RIOT -1.36%). As of 2:45 p.m. ET, RIOT stock has rocketed 15.4%, among the leaders in the tech-heavy Nasdaq.\n\nThis move appears to be driven by a number of key factors. The price of Bitcoin (BTC 2.49%) has continued to move higher, appreciating 2.3% over the past 24 hours. For Bitcoin miners such as Riot, this is a key fundamental metric, which is typically the directional driver for price movements on a given day.\n\nAdditionally, a relatively strong operational update provided by Riot last week has provided investors with reason to take a risk-on position with this company. Riot reported 55% year-over-year growth in terms of total Bitcoin production, as well as some nominal Bitcoin sales to fund operations.\n\nFinally, the company's corporate rebranding (from Riot Blockchain to Riot Platforms) has intrigued some investors. That's because within the rebranding press release, Riot noted its strategic shift to focusing on various vertical opportunities to support growth over the long term, in areas such as electrical equipment manufacturing and data center facilities.\n\nSo what\n\nRiot's fundamentals, which looked sharp for most of 2021 as Bitcoin prices remained elevated, have begun to deteriorate. The company is seeing quarterly losses swell, and while Riot has put up $0.11 of earnings per share for the trailing 12 months, it's likely that we'll see a negative number in that spot after the company's upcoming earnings report.\n\nAccordingly, this is a stock that's seen outsized interest from short sellers, and for good reason. While some retail investors may be looking for a beaten-down short squeeze to go after to play this rally, it remains to be seen how sustainable today's move in RIOT stock will be a week or two from now.\n\nNow what\n\nAs a Bitcoin miner, Riot's ability to produce consistent profitability really depends on whether the price of Bitcoin can stabilize, and preferably rise, to previous levels. At around $17,000 apiece, the long-term profitability of Bitcoin mining remains in serious question. Thus, this is a highly risky bet for those with a less-than-stellar outlook for the world's largest cryptocurrency.\n\nThat said, in many ways, Riot represents a very high-beta vehicle for investors to play a bullish stance on crypto. Given the outsized impact rising Bitcoin prices has on Riot's income statement, should we see a rally materialize, this is a stock that could actually outperform the crypto itself.\n\nGiven the inherent volatility of Bitcoin (which I think is enough for most investors), Riot is a company that doesn't entice me here. That said, it's easy to see why so many investors are enticed by this beaten-down name right now."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbmdlZWsuY29tL2JpdGNvaW4tc3VjY2Vzcy1yZWxpZXMtb24taXQtYmVpbmctdXNlZC1ub3QtaG9kbGQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin's success relies on it being used, not HODL'd - CoinGeek",
        "content": "The HODL strategy is a long-term investment approach that involves holding onto Bitcoin for an extended period of time rather than selling it. The term “HODL” is a play on the word “hold” and was coined by a drunken Bitcoiner who misspelled “hold” as “hodl” in a forum post titled “I AM HODLING.” Advocates of the HODL strategy—HODLERs—argue that Bitcoin has the potential to significantly increase in value over time and that holding onto it for the long term is the best way to maximize returns.\n\nBSVSearch.com conducted a poll on Twitter asking people what stops them from using and spending BSVs. Of the participants, 35% said they are waiting for the exchange rate of BSV to reach a more favorable level before spending, while 45% said there are not enough merchants and businesses accepting BSVs. Entrepreneurs, business owners, retailers, wholesalers, and developers are therefore encouraged to accept BSVs in exchange for goods and services to allow BSV users around the world to do business with them. The remaining 20% of poll participants said they just want to HODL their BSVs.\n\nIn this article, we will explore the idea of HODLing and argue why it is important for everyone, especially HODLERs, to use BSVs in order to help the BSV economy grow and increase the value of their BSVs.\n\nThe HODL strategy assumes that the value of Bitcoin will increase over time. However, there is no guarantee that this will happen. As we have learned in a previous article, if the demand for Bitcoin does not increase, the price could go down.\n\nThere is renewed hope for Bitcoin with the restoration of its original protocol on BitcoinSV (BSV). This was made possible by the persistent insistence of Craig Wright, who claimed that the original protocol had everything needed for Bitcoin to be used as a global cash system. As it turns out, Wright, who is known to be the inventor of Bitcoin under the pseudonym Satoshi Nakamoto, was right. BSV can now process 100,000 transactions per second with low fees anywhere in the world instantly. The low fees also allow for small transactions under $5 to be made with minimal transaction costs. Many people in developing countries, where average daily earnings and transactions are less than $5, have never had access to an electronic payment system. With BSV, they can now enjoy the privilege of digital money that people in more developed countries have had for decades.\n\nMany of us understand the potential impact that Bitcoin can have on the world due to its ability to reduce transaction costs and facilitate the efficient transfer of value and data across the globe at the speed of the Internet. That’s why many of us have been earning satoshis or buying BSV. It’s an investment in our future that rewards us for recognizing the potential of BSV to transform the world. However, this transformation won’t happen if we, as individuals, do not participate in the BSV economy and only HODL. It’s important to remember that regardless of how many satoshis or BSV you have, none of them will be worth anything if BSV fails to be adopted and used globally.\n\nWe cannot simply stand by and watch Craig Wright fight the enemies of the real Bitcoin in costly, time-consuming, and emotional court cases. We cannot continue to be passive spectators while Calvin Ayre, nChain, and the Bitcoin Association work to educate businesses and governments on how Bitcoin can help them reduce costs and become more productive and efficient. We cannot simply hope that some team in the near future will create a “killer app” or the next “unicorn” to catalyze the massive migration towards using BSV.\n\nIf you want the value of the BSVs you hold to rise in the future, understand that this can only happen if the BSV economy grows. It only grows if everyday people like you and I contribute to this economy by actually using, spending, and receiving BSVs. The best way to do this is to buy BSVs and spend it on things you usually would have paid for in fiat. So instead of paying fiat currency directly for a product or a service, you buy BSVs and use that BSV to pay for that product or service. You are not worse off, but you have now injected value into the BSV economy. Little transactions like this, multiplied by many individuals around the world, will lead to sustained growth that creates an environment where massive surges of BSV adoption can happen. The impact of millions of transactions—no matter how small—will eventually add to a gargantuan expansion of the BSV global economy. It all begins with you.\n\nABOUT THE AUTHOR\n\nMarquez Comelab has launched BSVSearch.com, an exciting initiative that connects businesses accepting BSVs with consumers around the world. It’s a place where individuals and businesses can also sell goods and services priced in BSVs, expanding the choices for BSV shoppers and driving growth for the BSV economy.\n\nWatch: The BSV Global Blockchain Convention presentation, Domineum: Better Government & Enterprise Applications with BSV\n\nwidth=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2FwcHJvYWNoaW5nLWEtMy13ZWVrLWhpZ2gtd2lsbC10aGUtcHJpY2Utb2YtYml0Y29pbi1yZW1haW4tZHluYW1pYy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Approaching a 3-Week High: Will the Price of Bitcoin Remain Dynamic? - Analytics Insight",
        "content": "Bitcoin pushes past $17,000. A week ahead focus is on Fed, digital currency group, Solana, Tron\n\nBitcoin conclusively pushed past $17,000 today, after witnessing a consistent decline in its volatility over the past eight weeks. BTC price recently climbed above the 50-day Exponential Moving Average (EMA) and the 200-day EMA. But there is still room for Bitcoin to fall, and the end of the current bear market won’t be expected until the price surpasses the realized price, which is presently at $19.7K. Until then, the negative trend is expected to continue. As things stand, the Bitcoin (BTC) price is currently being traded at $17,240.59. This represents an increase of 1.73% on the day, in contrast to a gain of 3.62% during the week as per the cryptocurrency market tracker CoinMarketCap.\n\nAnalysts were quick to point out that price charts are still tilting bearish, although Coinbase Institutional’s David Duong wrote in a report that a successful push past the $17,100 mark might put bitcoin on track toward the next technical level around $17,800. According to FundStrat’s Sean Farrell, blockchain data suggests there are plenty of ready buyers with “appetite to buy BTC at the very specific level of $16,00-$17,200.”\n\n“This paints an incredible picture of a strong buy wall at current market prices and suggests a strong bottom is forming,” Farrell wrote in a report.\n\nIn the week ahead, bitcoin traders will be monitoring a key report on U.S. inflation – also theoretically an input to the Federal Reserve’s calculations. The central bank’s monetary tightening last week was a big factor in bitcoin’s 64% price decline last year, the worst annual performance in four years.\n\nThe largest asset by market capitalization has been trading in an increasingly narrow trading range since the FTX saga in November 2022. Contrary to popular belief, Bitcoin price could continue its climb against the USD.\n\nBitcoin Price Prediction\n\nBefore you decide whether Bitcoin is a good investment or not, you should know that all Bitcoin price predictions are speculative. That said, these predictions are educated guesses because they are based on a mix of fundamental and technical analysis.\n\nDespite Bitcoin’s shortcomings, analysts agree that during 2023 this crypto will still experience value growth, predicting its maximum value of $30,121 by the end of next year. However, it is more long-term that analysts expect Bitcoin to do well. For instance, analysts expect Bitcoin to trade at $200k or more in 2025.\n\nSo, Is Bitcoin a good investment?\n\nWhen you study the past performance of a cryptocurrency, you familiarize yourself with how it moves. Some are more volatile than others, and some increase or decrease in a certain way. Technical analysis will enable you to make better Bitcoin price predictions.\n\nBitcoin being the first-ever successful cryptocurrency, gained traction faster than the rest. This has seen it gain traction, especially at institutional levels. This means it could gain value over time.\n\nAt its core, the value of bitcoin is determined by its inherent scarcity. Like Gold, it is a limited resource: only a finite supply of bitcoin can be mined and traded on the market, which means that its price will likely continue to rise as demand grows. This has made it extremely attractive to investors eager to get in on the increasingly lucrative cryptocurrency market.\n\nBitcoin’s unique combination of scarcity and utility will keep investors coming back for more. And as long as that demand continues to grow, so will the profits generated by trading this increasingly valuable commodity.\n\nBitcoin can be used for everyday payments. This is done peer-to-peer, so the payment cannot be controlled by any government. Thanks to its scarcity, Bitcoin could become a store of value, just like Gold. Bitcoin’s decentralized nature makes it perfect as a store-of-value cryptocurrency.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tYnRjLXByaWNlLXByZWRpY3Rpb24taXMtYml0Y29pbi1yYWxseS1oYXBwZW5pbmctaW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Price Prediction: Is Bitcoin Rally Happening in 2023? - Analytics Insight",
        "content": "BTC/USDT 1-Hour Analysis Chart (Source: TradingView)\n\nLooking at the hourly chart of the first-ever cryptocurrency to become used in real life, Bitcoin has been fluctuating between $16,622 and $17,248 within the past 7 days, according to CoinMarketCap. Since Bitcoin has been trading above the 200-moving average, it is generally thought that the cryptocurrency is now moving in bullish momentum.\n\nWhile BTC is currently inside an overbought region and has an RSI value of 72.39, we can anticipate a retracement of its recent gains in the near future. If BTC is unable to overcome the weak high it has reached right now, it is likely to revert to its previous order block, which is currently located between $16,957.78 and $16918.63. Another bearish scenario is between $16,771.05 and $16,708.11, which would occur if the bears applied more pressure and forced Bitcoin to move downward.\n\nIf Bitcoin bulls and buyers can pull up the price and the current bullish trend keeps on continuing, we can expect Bitcoin to reach $17,760.\n\nBitcoin is currently valued at $17,200 on CoinMarketCap, with a positive 1.45% 24-hour change in price. The trading volume of Bitcoin currently stands at $13,620,812,969, an increase of 79.18% over the previous day.\n\nA futures trader named Satoshi Flipper noted in a tweet that if the CPI report is less than 7%, which indicates that inflation is declining more quickly than expected, the market may gain momentum and hit multi-month highs above $19,000.\n\n<embed> https://twitter.com/SatoshiFlipper/status/1611483333023727616?s=20&t=Q_bQkm6Dp8cDdjPBVu_QCA </embed>\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tYmlsbGlvbmFpcmVzLXN1YnNlcXVlbnQtZGVhdGhzLXNwYXJrLXdpbGQtdGhlb3JpZXMtYW1vbmctdGhlLWNvbW11bml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Crypto billionaires' back-to-back deaths spark wild theories among the community - Cointelegraph",
        "content": "The death of four crypto billionaires within a month has caught the crypto community’s attention. The deaths occurred under suspicious circumstances, and some of these billionaires had even raised alarms about being in danger.\n\n4 crypto billionaires dead in the span of a month. Just before, and during the FTX collapse.\n\n\n\nToo strange\n\n\n\nsound ... pic.twitter.com/ubtpweiJcw — Wall Street Silver (@WallStreetSilv) January 9, 2023\n\nThe spiral started toward the end of October 2022 when Nikolai Mushegian, co-founder of MakerDAO, was found dead on a Puerto Rican beach just hours after tweeting that intelligence agencies were after him. The next billionaire to perish was broker Javier Biosca, who was found dead on Nov. 22 in Estepona, Spain. At the time, Biosca was being investigated for the biggest cryptocurrency fraud in Spain.\n\nOn Nov. 23, Amber Group co-founder Tiantian Kullander died mysteriously in his sleep. Just two days later, Russian crypto billionaire Vyacheslav Taran died in a helicopter crash.\n\nApart from these four suspicious deaths, another death made headlines on Dec. 30 when Park Mo, vice president of Vidente — the largest shareholder of South Korean cryptocurrency exchange Bithumb — was found dead in front of his house in the early morning.\n\nRelated: Logan Paul backflips on defamation lawsuit against Coffeezilla, apologizes\n\nThe four crypto billionaire deaths within a month gave fuel to several conspiracy theories among the crypto community. One user associated the string of deaths with a mafia-style hit job and said that the “crypto world is taking a page from the mafia handbook.”\n\nAnother user associated the death spiral with the “central banking hierarchy,” sarcastically saying, “I would definitely not put money on it being connected to the central banking hierarchy. There is no way. They are very trustworthy. 100% no chance.”\n\nOne user questioned the information sources but acknowledged that seeing four deaths in less than a month is suspicious. On the other hand, several Redditors speculated that they may not have actually died at all, with one writing, “I wonder how many of these are people faking their own deaths.” Another speculated that the billionaires might be living under fake names and are using their “deaths” to start a new chapter of their life.\n\nThe deaths may be a cause of concern, but the crypto ecosystem is also known for its fascination with conspiracy theories. A similar saga erupted in May 2020 when the CEO of defunct crypto exchange QuadrigaCX mysteriously died during a visit to India."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdGVjaG5leHQyNC5jb20vMjAyMy8wMS8wOS9iaXRjb2luLW1pbmluZy1mb3ItcHJvZml0LTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "How Bitcoin Mining can help you make a profit in 2023 - Technext",
        "content": "Bitcoin is one of the most profitable investments in today’s economy, and its value continues to skyrocket! With our comprehensive guide on how to mine Bitcoin in 2023, you can get ahead of the cryptocurrency trend and start earning a passive income TODAY!\n\nBitcoin.\n\nWhat is Bitcoin mining?\n\nIf you’re looking to mine Bitcoin in 2023 for a profit, you should know a few things. First, Bitcoin mining is becoming increasingly tricky as more-and-more miners compete for rewards. Second, the costs of mining equipment and electricity are rising. Finally, there is no guarantee that you will be able to recoup your investment. Still interested?\n\nHere’s how to get started:\n\n1. Choose your mining hardware carefully. The type of equipment you choose will significantly impact your profitability. You’ll need to balance cost against processing power to make a profit.\n\n2. Find a reliable electricity supply: Electricity costs can make or break your mining operation, so make sure you find a good deal before signing on the dotted line.\n\n3. Set up a well-organized system for managing equipment and keeping track of profits and losses. This will help you stay organized and avoid making costly mistakes.\n\nBitcoin mining is creating new Bitcoin by verifying transactions on the Bitcoin blockchain. Miners are rewarded with Bitcoin for their efforts, and mining helps secure the Bitcoin network.\n\nIn 2023, miners will still be able to profit from Bitcoin mining if they have access to cheap electricity and efficient ASIC miners. However, difficulty levels will continue to increase, making it more difficult to turn a profit. Those who can mine profitably in 2023 will have invested in efficient equipment and have access to cheap electricity.\n\nRead also: African Bitcoin miner, Gridless raises $2m seed in round led by Jack Dorsey’s Block\n\nThe current state of Bitcoin mining\n\nBitcoin mining is currently in a transitional phase. In the early days of Bitcoin, mining was performed with basic computer processors. However, as the Bitcoin network grew and became more competitive, miners began to use specialized equipment designed specifically for mining.\n\nToday, two main types of equipment are used for Bitcoin mining: ASICs and FPGAs. ASICs are purpose-built chips that offer tremendous performance gains over CPUs and GPUs. FPGAs are similar to ASICs, but they can be reconfigured to perform different tasks.\n\nBoth ASICs and FPGAs have their benefits and drawbacks. ASICs are very efficient at mining Bitcoin, but they come at a high up-front cost. FPGAs are less expensive than ASICs, but they’re not as efficient. The current state of Bitcoin mining is highly competitive. You’ll need to invest in the best equipment available to be profitable.\n\nHow to mine Bitcoin in 2023\n\nBitcoin mining is a process of verifying and adding transaction records to the public ledger, known as the blockchain. Bitcoin miners are rewarded with BTC for verifying and validating transactions. To be profitable, miners must have access to cheap electricity and efficient mining hardware.\n\nIn 2023, profitability will largely depend on the price of Bitcoin. If the price of BTC increases, more miners will enter the market in an attempt to earn a profit.\n\nThis will lead to increased competition and lower profits for individual miners. However, if BTC prices decrease, fewer miners will be willing to continue mining at a loss. This could lead to higher profits for those who can continue mining at a profit.\n\nRead also: Want to invest in crypto this January? Here are 3 coins to consider\n\nConclusion\n\nAs you can see, there are many ways to mine Bitcoin in 2023. Some of these methods may be more profitable than others, but all of them can be done if you are willing to do the work.\n\nIf you want to make a profit from Bitcoin mining, then you need to find the most efficient way to do it. With some research and effort, you should be able to find a method that works for you and that will allow you to make a profit in 2023."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LnRla2VkaWEuY29tL2JsYWNrcm9jay1hZGRzLWJpdGNvaW4tZXhwb3N1cmUtZm9yLWl0cy1yZXRhaWwtYW5kLWluc3RpdHV0aW9uYWwtaW52ZXN0b3JzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "BlackRock Adds Bitcoin Exposure for its Retail and Institutional Investors - Tekedia",
        "content": "Blackrock, the world’s largest investment management company, has added bitcoin to its “Global Allocation Fund,” an IPO since 1997. Only 0.32% of Blackrock’s funds are said to be able to buy all the bitcoin from global exchanges.\n\nThe BlackRock Global Allocation Fund now provides exposure to Bitcoin for regular and passive investors. The $15 trillion in assets that BlackRock Global Allocation Fund manages should increase with the inclusion of Bitcoin. Bitcoin adoption is growing non-stop. Other cryptos are doing also well on adoption. And the message is clear: spreading your investments across different cryptocurrencies is strategic, and we must learn from the experts.\n\nThe fund has been through many crises. Therefore, this is an important step in crypto that Blackrock saw and decided to invest some money, so keep an eye out. Bear could turn Bull market real quick, once other global asset managers start to follow suit. Compare $BTC mcap to Gold, now think of digital gold ‘BTC’s potentials.\n\nExcept it’s more cash settled futures. “The Fund may invest in cash-settled bitcoin futures that are traded on commodity exchanges registered with the Commodity Futures Trading Commission.”\n\nYes, the point is in the attention of such a giant. If the BTC Stop ETF gets approved, it will send it. Institutions would inject trillions in crypto, this bear market will just be a blip on charts. Not saying it will happen as I don’t have a crystal ball, but it is a possibility.\n\nNow imagine when there’s real crypto regulation. Sure, let the SEC call them all securities and let there be panic. When the dust settles, remaining holders will be very happy after the big guys like black rock take a 0.5% position.\n\nSo with BlackRock now announcing a new private Bitcoin [BTC] trust for institutional investors, you know things are getting serious. Because with this new service, some of the firm’s biggest clients will now be able to gain direct exposure to the largest and most well-known cryptocurrency.\n\nBitcoin, along with all the major crypto coins, has been smashed in recent months. We are deep in the early stages of a ‘crypto winter’. These periods of price and investment dormancy are symptomatic of the recurring boom and bust cycle that crypto goes through every few years.\n\nThe key point, though, is that BlackRock is likely betting they’re getting in close to the bottom. Like any experienced investor, they know that the time to start buying is when most people are selling. And their clientele likely knows this too:\n\n‘Despite the steep downturn in the digital asset market, we are still seeing substantial interest from some institutional clients in how to efficiently and cost-effectively access these assets using our technology and product capabilities.’\n\nBlackRock is among a group of creditors that lent money to Bitcoin miner Core Scientific so that it can continue to operate while in bankruptcy in December of 2022, BlackRock issued a $17 million loan to bankrupt Bitcoin miners.\n\nFew seem to be talking about how the matrix took over a huge chunk of the hashrate through bankruptcies the last 12 months.\n\nApparently, Cash-settled futures are NOT bitcoin. It’s a derivative that requires NO actual ownership of Bitcoin. It is a fiat mechanism for paper trading real assets.\n\nThis is a synthetic position that has unlimited supply. They need black rock to be a market maker and provide liquidity, one step closer for more Bitcoin mining derivatives institutional adoption.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmJheXRvZGF5LmNhL2xvY2FsLW5ld3Mvbm9ydGgtYmF5LWJpdGNvaW4tb3BlcmF0aW9uLXNodXR0ZXJlZC1vdmVyLXBvd2VyLWJpbGwtZGlzcHV0ZS02MzUzMTE40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "North Bay bitcoin operation shuttered over power bill dispute - BayToday.ca",
        "content": "There was no response from Hut 8 if the facility is completely shuttered or remains in an idled but maintained state\n\nBitcoin mining operations at a North Bay data centre are suspended due to a dispute between a cryptocurrency company and its energy provider.\n\nHut 8 Mining reports operations in the facility have been shuttered this winter stemming from a disagreement with Validus Power on their power supply contract.\n\nThe issue between the two companies has been brewing for some time, according to a string of news releases issued from Hut 8 since November.\n\nHut 8 and Validus had partnered on bringing a mothballed power plant on Highway 11, north of the city, back to life by signing a power purchase agreement (PPA) in 2021. The former Atlantic Power plant ceased generating in 2017 until acquired by Validus.\n\nSee: Bitcoin 'Power to Data' project unveiled at idle North Bay power plant\n\nNow Hut 8 accuses Validus of “breaches of certain obligations” under the terms of that energy contract. The two companies have exchanged notices of default.\n\nRead the news release here.\n\nTwo months ago, Hut 8 disclosed it was issuing a notice of event of default to Validus, claiming Validus “failed to achieve certain key operational milestones” under the terms of the power agreement.\n\nThese bitcoin data centres consume huge amounts of electricity to run and cool banks of high-powered computers. In the last year, cryptocurrencies like Hut 8 have grumbled about fluctuating power prices that have cut into bitcoin production.\n\nIn Hut 8’s third-quarter financial results posted in early November, the company claimed that Validus “demanded that the company (Hut 8) make payments for delivery of energy that are higher than those negotiated under the terms of the PPA,” and accused Validus of failing “to meet its contractual obligations under the PPA.”\n\nHut 8 said Validus has stopped supplying power to the North Bay facility and delivered a notice of event of default of their own, alleging that Hut 8 failed to make certain payments related to the delivery of energy, an allegation Hut 8 said it categorically denies.\n\nHut 8 said it’s going the mediation route with Validus to reach a resolution.\n\nThere was no response from Hut 8 if the facility is completely shuttered or remains in an idled but maintained state.\n\nThe company also hasn’t responded to how many jobs are impacted. During a groundbreaking ceremony in October 2021, company officials said there could be as many as 30 high-skilled technicians employed.\n\nIn a recent online interview with Compass Mining, Sue Ennis, Hut’s vice-president of corporate development, said they “ultimately plan” on reaching a resolution with Validus. “We hope to have a positive outcome.”\n\nBut at the same time, Hut 8 has indicated its backup plan is to secure an alternative power supplier, likely through the merger and acquisition path.\n\nIn an email response, Jesse Nickel, Validus’ vice president of business development, said both parties are “actively engaged and collectively pursuing a resolution.”\n\n“We are quite hopeful we will reach a mutually successful outcome, either at mediation or prior to. Hut has a strong vision and deep industry expertise and they’re a great partner to Validus Power. We are optimistic and anticipating back to business as usual in due course.”\n\nMeanwhile, Validus maintains big cryptomining plans for its own.\n\nThe company has two data centres under development in Kingston and Iroquois Falls, the latter involving the use of a 120-megawatt natural gas-fired generating facility not far from the planned data site. Validus previously announced it was building a data centre in Kapuskasing, supplied by a local power plant."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1taWxsaW9uYWlyZXMtZHJvcC1saWtlLWZsaWVzLWFzLWZ0eC1mYWxsb3V0LXNoYWtlcy1jcnlwdG8tbWFya2V0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin millionaires 'drop like flies' as FTX fallout shakes crypto market - CityAM - City A.M.",
        "content": "Bitcoin millionaires ‘drop like flies’ as FTX fallout shakes crypto market\n\nCrypto market maker B2C2 has been taken to court by a former employee\n\nThe number of bitcoin millionaires has plunged and scammers have filled their boots in the past year as the market is gripped by a ‘crypto winter’ brought on by soaring inflation and a string of high profile bankruptcies.\n\nNearly £1.15tn ($1.4tn) was wiped from the value of the market in 2022 as soaring inflation and rate hikes sent investors scrambling for steadier ground. The sector was dealt a fresh blow in November when Sam Bankman-Fried’s exchange FTX imploded amid allegations of fraud and misuse of customer funds.\n\nBitcoin, the most valuable crypto currency, plunged more than 54 per cent across the year and is currently trading at £14,168 $ (17,249) – down from over £30,000 at the beginning of the year and 75 per cent down from an all-time high in 2021.\n\nNew blockchain data analysed by CoinJournal has now revealed the amount of crypto millionaires – those with over $1m (£820k) worth of value in their wallets – fell by around 73 per cent from 90,000 to 24,000 in the period.\n\nThe data points to the scale of the carnage wreaked on retail investors with cash tied up in crypto. Analysts at CoinJournal said millionaires had “dropped like flies.”\n\n“The on-chain data sums up what is glaringly obvious from looking at a Bitcoin price chart – that the party is over and investors are no longer dreaming of retirement off their Bitcoin holdings, in the near future at least,” said CoinJournal analyst Dan Ashmore.\n\n“Nearly three-quarters of Bitcoin millionaires losing that status is perhaps the best piece of data of all to summarise how ugly 2022 was for investors.”\n\nThe statistics came as separate data from the firm revealed that scams had surged in the past 12 months as fraudsters picked off investors amid the downturn.\n\nThe number of breaches and hacks jumped over 27 per cent to 120 – up from 94 the previous, year according to on-chain data analysed by CoinJournal. Total value of the scams came in at £1.87bn, down from £4.37bn the year before due to the sharp slide in the market/\n\nSo-called ‘bridges’ between blockchain were the target of some of the years’ most costly, with Wormhole suffering a $320m attack in February, while the Ronin Network was drained of over $600m.\n\nCrypto investors may not see respite in the year ahead\n\nWrites Charlie Conchie\n\nIt’s hard not to think of the implosion of Sam Bankman-Fried’s exchange FTX as the defining moment in the crypto market last year. The sheer scale of the 30-year-old former billionaire’s fall from grace and the subsequent revelations of corporate mismanagement will mark it out as one of the greatest business scandals in history.\n\nBut the eye-catching collapse can almost shroud the fact that investors had already seen billions of dollars wiped from their wealth in the 10 months prior, as soaring inflation and sharp rate hikes plunged the market into a deep ‘crypto winter’.\n\nAnd investors could now face grimmer times ahead, with analysts bandying round gloomy predictions that could point to extreme pain to come.\n\nIn a research note last month, analysts at Standard Chartered said flagship currency bitcoin could tumble as low as $5,000 next year as investors flee digital assets to take shelter in Gold.\n\nVeteran investor Mark Mobius, who was not far off the mark with his 2022 predictions, predicted the flagship currency would fall to $10,000, in comments shared with CNBC.\n\nThe predictions will not make pleasant reading for speculative investors who, just over a year ago, may have had half an eye on crypto-funded retirement. Recessions around the world look lengthy and likely this year and sadly, many investors may be left lamenting their hopeful decision to hold.\n\nTraders may be forgiven for seeking some comfort in the predictions of former bitcoin billionaire Tim Draper, who says bitcoin will rally `1,400 per cent to reach $250,000. Dare to dream."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYm9sZC5jb20vcGxhbm5pbmctdG8tdHJhZGUtYml0Y29pbi1uZXh0LXdlZWstYmUtcmVhZHktZm9yLXRoaXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Planning to trade Bitcoin next week? Be ready for this - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) has kicked off 2023 on a positive note sustaining short-term gains, although the flagship cryptocurrency continues to trade below crucial support levels. Notably, Bitcoin gains in the first week of 2023 can be attributed to the positive macroeconomic data around the United States employment news.\n\nMoving into the second week of 2023, it is worth noting that Bitcoin’s price action is likely to be dictated by more macroeconomic news, with the Consumer Price Index (CPI) and inflation data for December expected to come out.\n\nIn this line, crypto trading expert and analyst Michaël van de Poppe has stated that Bitcoin’s odds of breaking out have increased while explaining what traders planning to trade in BTC the following week should be aware of, he said in a YouTube video posted on January 7.\n\nHowever, according to Poppe, despite the impressive breakout odds, Bitcoin is likely to test sideways trading for a while, noting that the $17,000 target remains possible. Overall, he said Bitcoin is expected to continue rallying.\n\n“We got a clear resistance at $16,950, and we got a support area here around $16,760. So it seems apparent that we’re going to stay sideways for a little bit before we can start breaking out because the odds of breaking out have increased given the fact that we are testing the resistance multiple times already,” he said.\n\nHowever, with CPI data expected to be positive, the analyst states that Bitcoin will likely continue on a big run to target $17,800 while noting the push can be boosted by increased buying pressure. Notably, the data will influence the Federal Reserve’s next monetary policy, with Poppe warning that a weaker economy will likely result in more interest rate hikes.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was trading at $16,949, having recorded daily gains of about 0.1%. On the weekly chart, Bitcoin is up over 2.5%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nIndeed, the minor weekly gains helped Bitcoin move away from the sideways trading pattern that characterized the asset towards the end of 2022. In this line, Bitcoin has been attempting to break the $17,000 resistance, focusing on hitting the $18,000.\n\nThe ongoing rally emerged after the U.S. unemployment rate hit 3.5% in December from the 3.7% witnessed in November 2022. Furthermore, the U.S. economy added 223,000 jobs in December, higher than the estimated 200,000.\n\nElsewhere, the Bitcoin technical analysis on TradingView is mixed. A summary of the one-day gauges recommends the ‘neutral’ sentiment at 7 while moving averages are for ‘buy’ at 8. Oscillators are for the ‘sell’ sentiment at 4.\n\nBitcoin technical analysis. Source: TradingView\n\nWhat next for Bitcoin?\n\nIn the meantime, as Bitcoin attempts to sustain the recent rally, it’s worth noting that the machine learning algorithm at PricePredictions indicates that BTC might end the first month of 2023 on a bearish note. According to the 30-day forecast, Bitcoin might trade at $15,532 on January 31, 2023.\n\nOverall, investors will be hoping Bitcoin has found a bottom to rally again from the lows of 2022. Interestingly, despite the bearish market, Bitcoin’s blockchain managed to record transactions of over $8 trillion in 2022.\n\nFurthermore, there are prevailing fears that the fallout from incidents such as the FTX collapse could impact the market further.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]