[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmtpcGxpbmdlci5jb20vaW52ZXN0aW5nL2lzLWludmVzdGluZy1pbi1iaXRjb2luLWFuZC1vdGhlci1jcnlwdG9jdXJyZW5jaWVzLXJlYWxseS1qdXN0LWdhbWJsaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Is Investing in Bitcoin and Other Cryptocurrencies Really Just Gambling? - Kiplinger's Personal Finance",
        "content": "If you buy cryptocurrency , are you just taking a punt on it performing well, or is it a genuine investment like buying shares and commodities?\n\nMany people have asked that question as Bitcoin, Ethereum and other cryptocurrencies have boomed in popularity over the past few years, which has brought riches to some but financial catastrophe to others.\n\nI’ve previously written about my experience of buying and selling Bitcoin as being more akin to gambling than investing.\n\nSubscribe to Kiplinger’s Personal Finance Be a smarter, better informed investor. Save up to 74% Sign up for Kiplinger’s Free E-Newsletters Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. Sign up\n\nIs Bitcoin and other cryptocurrencies just gambling?\n\nA prominent group of politicians in the UK have now called for buying crypto to be treated as gambling when considering regulation of the sector.\n\nIn their view, crypto is such a high risk sector that it is more akin to gambling than investing, while they say the currencies themselves have no underlying value and their price is purely based on what the market is prepared to pay for them.\n\nThe Treasury Committee, a group of UK MPs who hold the financial services sector to account, said in a report last week that crypto has “no intrinsic value and serves no useful social purpose and these characteristics more closely resemble gambling than a financial service.”\n\nOur friends at MoneyWeek in the UK also reported the committee saying: “The events of 2022 have highlighted the risks posed to consumers by the crypto asset industry, large parts of which remain a wild west.”\n\nA look at the fortunes of Bitcoin shows wild swings over the years, which have created millionaires but have also led some to lose everything.\n\nOver the past five years, the price of a Bitcoin has swung from about $3,500 to $65,000, and as I write this, it currently sits at about $27,000.\n\nA closer look at the charts shows in a short time, prices have plunged dramatically at times. For example, in May 2021 the price plunged from close to $60,000 to just under $35,000 in just three weeks. Of course, prices have risen at a similar speed too.\n\nWhat’s more, as UK MPs have said, there is little substance to crypto other than the price others are prepared to pay for it.\n\nWhen you buy shares in a company, you could argue that ultimately the same principle applies, but you at least have a myriad of factors that influence demand for that stock that are based on tangible components such as its recent performance, quality of its management team and its strategic aims.\n\nWhen you buy a commodity such as gold or art, you often physically hold that item and it may bring you or a future buyer pleasure such as in the quality of the art.\n\nMany people do not understand crypto\n\nThen there is the fact that crypto is such a mystery to so many people, which leans into my point that it is difficult to conduct the due diligence you need to do when investing. What’s more, it’s much harder to find a financial adviser who specializes in crypto as it is with standard investments.\n\nI got a lot of stick from crypto experts when I wrote my article on my experiences with Bitcoin , with some saying I didn’t understand what I had bought and that it is indeed a long-term investment and not a gamble.\n\nThey’re correct that I didn’t understand all the ins and outs of exactly what goes into a Bitcoin like I would a standard investment or other areas of personal finance as I have not researched it to the level I have analyzed other personal finance topics. Don’t get me wrong, I know what crypto is and how it works, but as you peel back more of the details, l I will come unstuck versus someone who works for a crypto firm.\n\nYet the fact I have some gaps in my knowledge, with the experience I have in personal finance, makes me question if anyone who doesn’t devote a huge amount of time to the subject will fully understand crypto to the level required to pump lots of money into it, as it is complex.\n\nSo should you buy Bitcoin or other cryptocurrencies?\n\nIn simple terms, if you know the crypto markets inside out and consider yourself an expert, then, of course, you are in a good position to decide for yourselves when and what to buy and sell.\n\nIf you don’t know the markets inside out, there is nothing wrong with investing… ahem, gambling… with crypto as long as you know the risks and can afford to lose whatever you put in.\n\nI’m not suggesting people shy away from crypto, more that I hope my words can help them understand what exactly they are getting themselves into. Hopefully it is a venture that makes them a lot of money, but none of us have a crystal ball to know if that will be the case."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yNS9kZXNhbnRpcy1iaXRjb2luLXJlcHJlc2VudHMtYS10aHJlYXQtdG8tdGhlLWN1cnJlbnQtcmVnaW1lL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yNS9kZXNhbnRpcy1iaXRjb2luLXJlcHJlc2VudHMtYS10aHJlYXQtdG8tdGhlLWN1cnJlbnQtcmVnaW1lL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "DeSantis: ‘Bitcoin Represents a Threat to the Current Regime’ - CoinDesk",
        "content": "DeSantis isn't the first Republican candidate to mention bitcoin. Former pharma entrepreneur and longshot contender Vivek Ramaswamy said onstage at Bitcoin 2023 in Miami that the next election should be a \"referendum of fiat currency\" and has also come out against CBDCs with a \"hell no.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMjMvYml0Y29pbi1yaXNlcy1hZnRlci1ob25nLWtvbmctZ3JlZW5saWdodHMtc29tZS1yZXRhaWwtY3J5cHRvLXRyYWRpbmcuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA1LzIzL2JpdGNvaW4tcmlzZXMtYWZ0ZXItaG9uZy1rb25nLWdyZWVubGlnaHRzLXNvbWUtcmV0YWlsLWNyeXB0by10cmFkaW5nLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin climbs back above $27,000 after Hong Kong greenlights some retail crypto trading - CNBC",
        "content": "Cryptocurrency prices moved higher on Tuesday after Hong Kong's securities regulator announced it will allow retail trading of certain crypto assets starting June 1.\n\nBitcoin rose 1.7% to $27,293.64, according to Coin Metrics. The largest cryptocurrency has been trading in a small range throughout May, struggling to break above $30,000 but staying above $25,000. Ether advanced nearly 2% to $1,851.91.\n\nLate Monday night, Hong Kong's Securities and Futures Commission said it would allow retail investors to trade certain crypto assets beginning next month on registered trading platforms. The move was widely expected, with the announcement marking the end of a request for public comment it put out in February on its proposed regulatory requirements around retail trading in crypto.\n\nThe new guidelines are part of a broader effort of Hong Kong's to become a global crypto hub. That ambition is in sharp contrast with China, which banned crypto trading in 2021, as well as the U.S. where the regulatory stance toward crypto has turned hostile since the collapse of FTX.\n\n\"This news doesn't mean that a flood of retail buying power will enter the market at the beginning of June. … We could see some volume uptick in June, however,\" said Noelle Acheson, economist and author of the \"Crypto is Macro Now\" newsletter.\n\nHong Kong's Securities and Futures Commission has already licensed two digital asset platforms, OSL and Hash Blockchain, and it's likely some are already actively trading offshore, Acheson said."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnVzYXRvZGF5LmNvbS9zdG9yeS9tb25leS9pbnZlc3RpbmcvMjAyMy8wNS8yNC9iaXRjb2luLWV0aGVyZXVtLWxpdGVjb2luLXRvZGF5LzcwMjUyNjMyMDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Crypto, the Fed and the debt ceiling: Why Bitcoin, Ethereum, and Litecoin are falling today - USA TODAY",
        "content": "Bram Berkowitz\n\nThe Motley Fool\n\nWhat happened with cryptocurrencies today?\n\nSeveral of the largest cryptocurrencies fell today in what appeared to be a move driven by macro fears, uncertainty about the debt ceiling, and ahead of the release of the Federal Reserve's May meeting minutes today.\n\nSince late afternoon yesterday, the price of the world's largest cryptocurrency Bitcoin (CRYPTO: BTC) traded 3% lower as of 11:45 a.m. ET today. Meanwhile, the price of the world's second-largest cryptocurrency Ethereum (CRYPTO: ETH) traded 3.2% lower, while the price of Litecoin (CRYPTO: LTC) was down 5.3%.\n\nSo what\n\nPart of what's been dogging cryptocurrencies today is the constant tug-of-war investors are having about their view on the Fed and interest rates and whether on not the Fed will pause its rate-hiking campaign at its next meeting. Currently, roughly 72% of investors are betting on a pause but that's a smaller percentage than it had been recently.\n\nFast-rising interest rates over the last year have crushed the likes of crypto and Bitcoin because they make riskier assets less appealing. Crypto has rallied this year largely on the belief that the Fed is preparing to end its rate-hiking campaign.\n\nWill they raise them again?Powell says Fed interest rates may not need to rise as much amid banking stress\n\nInflation has slowed a good amount this year but is still far away from the Fed's 2% target and the job market still looks extremely strong, which has investors questioning whether or not the Fed has seen enough data to end its rate-hiking campaign.\n\n\"Most developed markets are grappling with a shared problem. Core inflation is proving more stubborn than expected and remains well above central banks' 2 per cent targets,\" BlackRock analysts wrote in a recent research note. \"We think that means central banks can't undo any of their inflation-fighting rate hikes any time soon, even if financial markets think the Federal Reserve will start cutting rates before the end of the year.\"\n\nOn top of all of this, U.S. lawmakers still haven't reached an agreement to raise the debt ceiling, and the June 1 deadline when the U.S. could potentially default on its debt is rapidly approaching. Treasury yields have risen as a result of the uncertainty, which usually leads investors to take a risk-off approach.\n\nNow what\n\nCryptocurrencies have been rising all year on the belief that a Fed pause is near, but now investors are less sure that a pause and the rate cuts the market had been pricing in will actually materialize.\n\nAt 2 p.m. ET today, the Fed will release the minutes from its meeting earlier this month, which could shed light on whether or not the Fed will pause rates at its June meeting. The fact that we still don't have an agreement to raise the debt ceiling is concerning, but I'm hopeful lawmakers will eventually come to their senses. Cryptocurrencies tend to do well when the traditional financial system struggles, but if the U.S. defaults on its debt it's hard to know exactly what would happen.\n\nWhat happens if the US defaults?What you need to know as the debt ceiling deadline nears.\n\nI continue to believe Bitcoin and Ethereum are here to stay long term and like them as long-term investments. I own a little bit of Litecoin and there's talk that the altcoin may benefit from its upcoming halving event, but I really prefer Bitcoin and Ethereum.\n\nBram Berkowitz has positions in Bitcoin, Ethereum, and Litecoin. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nOffer from the Motley Fool:10 stocks we like better than BitcoinWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\n\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Bitcoin wasn't one of them! That's right -- they think these 10 stocks are even better buys.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of May 22, 2023"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjQvYml0Y29pbi1ldGhlci1zbGlwLWFzLXVrLWNvcmUtY3BpLXJlYWNoZXMtaGlnaGVzdC1zaW5jZS0xOTkyL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjQvYml0Y29pbi1ldGhlci1zbGlwLWFzLXVrLWNvcmUtY3BpLXJlYWNoZXMtaGlnaGVzdC1zaW5jZS0xOTkyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether Slip as UK Core CPI Reaches Highest Since 1992 - CoinDesk",
        "content": "The figures are higher than expected for the third month in a row, dampening hopes of an economic recovery. As such, it is likely to add to pressure on the Bank of England to keep raising interest rates in the coming months."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMjQvYml0Y29pbi1hbmQtZXRoZXItc2xpZGUtYXMtZGVidC1jZWlsaW5nLW5lZ290aWF0aW9ucy13ZWlnaC1vbi1pbnZlc3RvcnMuaHRtbNIBcGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA1LzI0L2JpdGNvaW4tYW5kLWV0aGVyLXNsaWRlLWFzLWRlYnQtY2VpbGluZy1uZWdvdGlhdGlvbnMtd2VpZ2gtb24taW52ZXN0b3JzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin and ether slide as debt ceiling negotiations weigh on investors - CNBC",
        "content": "Crypto fell with stocks Wednesday as investors worried about the debt ceiling and the Federal Reserve's next move.\n\nBitcoin fell more than 3% to $26,207.42, according to Coin Metrics. Ether lost about the same amount and was trading at $1,787.17.\n\nThe move coincided with a drop in U.S. equities. The Dow was down nearly 300 points, while the S&P 500 and Nasdaq Composite fell about 1% each.\n\nOn Wednesday, House Speaker Kevin McCarthy said debt ceiling talks are still hung up on spending levels — with eight days to go until the U.S. is at risk of a default. He also said he believes the negotiating teams could make progress Wednesday.\n\n\"Markets opened quite down after being down significantly yesterday, so this could be a reaction to that,\" said David Wells, CEO at Enclave Markets. \"Even though crypto is a global market, volumes pick up quite a bit during U.S. trading hours, so sometimes big crypto moves are following big equities moves that are macro driven.\"\n\nAs investors monitor the ongoing debt ceiling negotiations in Washington and Fed officials divided on where to go with interest rate hikes, bitcoin has started behaving like a risk asset again, just as it was starting to trade more in tandem with gold earlier this year.\n\nBitcoin and ether are on pace for their worst month of 2023, down 10% and almost 6%, respectively. Bitcoin is down more than 7% for the quarter, after finishing the first quarter up 71%. Ether is down 1.8%, after it posted a 52% gain in Q1."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yMy91cy1pcy1sb3NpbmctdGhlLWJpdGNvaW4tbW92ZW1lbnQtY2F0aGllLXdvb2Qv0gFdaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA1LzIzL3VzLWlzLWxvc2luZy10aGUtYml0Y29pbi1tb3ZlbWVudC1jYXRoaWUtd29vZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "U.S. Is 'Losing' the Bitcoin Movement: Cathie Wood - CoinDesk",
        "content": "Cathie Wood also referenced last year's dramatic collapse of crypto exchange FTX, saying it \"proved the concept\" of bitcoin, as did this year's banking crisis in which Silicon Valley Bank, Silvergate and Signature all went to the wall. Wood believes these crises underlined the dangers of centralization in financial systems, something to which bitcoin runs counter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzI0L2JpdGNvaW5zLWRlY2xpbmluZy1jb3JyZWxhdGlvbi13aXRoLXN0b2Nrcy1yZXZpdmVzLWl0cy1hcHBlYWwtZm9yLWludmVzdG9ycy1rMzMtcmVzZWFyY2gv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjQvYml0Y29pbnMtZGVjbGluaW5nLWNvcnJlbGF0aW9uLXdpdGgtc3RvY2tzLXJldml2ZXMtaXRzLWFwcGVhbC1mb3ItaW52ZXN0b3JzLWszMy1yZXNlYXJjaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin’s Declining Correlation With Stocks Revives Its Appeal for Investors: K33 Research - CoinDesk",
        "content": "A portfolio with 3% weight in BTC, 58.5% in stocks and 38.5% in bonds has outperformed the classic 60% equities, 40% bonds investment over the years. Even when it’s measured from January 2018, near when cryptocurrency prices entered a two-year bear market, the portfolio that included BTC would have outperformed by 6.9%, according to K33."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjMvYml0Y29pbi1ob2RsaW5nLWhhcy1uZXZlci1iZWVuLW1vcmUtcG9wdWxhci_SAVxodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2JpdGNvaW4taG9kbGluZy1oYXMtbmV2ZXItYmVlbi1tb3JlLXBvcHVsYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin HODLing Has Never Been More Popular - CoinDesk",
        "content": "“The trend is bullish insofar it means that higher prices are ahead in this cycle and any reticence to sell from current HODLers could result in a mini-supply squeeze,” said Farrell."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yMy90aGUtYml0Y29pbi1taW5pbmctZGViYXRlLWlzLWlnbm9yaW5nLXRoZS1wZW9wbGUtbW9zdC1hZmZlY3RlZC_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDUvMjMvdGhlLWJpdGNvaW4tbWluaW5nLWRlYmF0ZS1pcy1pZ25vcmluZy10aGUtcGVvcGxlLW1vc3QtYWZmZWN0ZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "The Bitcoin Mining Debate Is Ignoring the People Most Affected - CoinDesk",
        "content": "It’s important to note that Greenidge occupies a unique role, and it’s difficult to directly compare these different facilities and how they affect the communities around them. Riot taps into an existing (sometimes shaky) energy grid, while Greenidge generates its own electricity. Other mining facilities, such as those in upstate Washington, might rely on a limited amount of power or use power paid for by the community as a collective, meaning the costs from an increase in usage get passed along to everyone regardless of how much power each individual may use. A county in Tennessee is suing a local mine in part due to the noise it generates, a complaint that some locals in Dresden say doesn’t apply to them."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2JpdGNvaW4tY2xpbWJzLXBhc3QtMjc0ay1idXQtcmVtYWlucy1pbi1ob2xkaW5nLXBhdHRlcm4tYXMtaW52ZXN0b3JzLWNvbnRpbnVlLXRoZWlyLWRlYnQtbGltaXQtdmlnaWwv0gGVAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjMvYml0Y29pbi1jbGltYnMtcGFzdC0yNzRrLWJ1dC1yZW1haW5zLWluLWhvbGRpbmctcGF0dGVybi1hcy1pbnZlc3RvcnMtY29udGludWUtdGhlaXItZGVidC1saW1pdC12aWdpbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin Climbs Past $27.4K but Remains in Holding Pattern as Investors Continue U.S. Debt Limit Vigil - CoinDesk",
        "content": "“This break in correlation between bitcoin and traditional assets has been a prevailing theme that seems to be continuing in 2023,” Savic wrote. “As some macro catalysts come to a head, like the debt ceiling debate or Fed rate policy, it will be interesting to watch how much bitcoin has decoupled from the broader market.”"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1ob2xkcy1zdGVhZHktbmVhci0yN2stYXMtaW52ZXN0b3JzLXdlaWdoLWRlYnQtY2VpbGluZy1kZXZlbG9wbWVudHMv0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjMvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLWhvbGRzLXN0ZWFkeS1uZWFyLTI3ay1hcy1pbnZlc3RvcnMtd2VpZ2gtZGVidC1jZWlsaW5nLWRldmVsb3BtZW50cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Steady Near $27K as Investors Weigh Debt Ceiling Developments - CoinDesk",
        "content": "“One of the very big problems that crypto suffers with is liquidity being massively fragmented, and events such as this only exacerbate the problem,” Ismail said. “So what we're seeing right now is there is not much activity because liquidity is even more fragmented, and markets are very inefficient. As a result, you will see I think we are seeing certain narratives coming back."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yMy91cHN0cmVhbS1kYXRhLXN1ZXMtY3J1c29lLWVuZXJneS1vdmVyLXdhc3RlLWdhcy1taW5pbmctcGF0ZW50L9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yMy91cHN0cmVhbS1kYXRhLXN1ZXMtY3J1c29lLWVuZXJneS1vdmVyLXdhc3RlLWdhcy1taW5pbmctcGF0ZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Upstream Data Sues Crusoe Energy Over Waste Gas Mining Patent - CoinDesk",
        "content": "Crypto miners like these two work on oil and natural gas wells where excess gas is released, or flared into the atmosphere, adding carbon dioxide equivalents, particularly methane. The miners instead set up power generators that burn that excess gas, extracting energy and using it to power bitcoin mining rigs."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2JpdGNvaW4tanVtcHMtdG8ta2V5LXByaWNlLXJlc2lzdGFuY2UtYXMtaG9uZy1rb25nLW9wZW5zLWNyeXB0by10cmFkaW5nLWZvci1yZXRhaWwtaW52ZXN0b3JzL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzIzL2JpdGNvaW4tanVtcHMtdG8ta2V5LXByaWNlLXJlc2lzdGFuY2UtYXMtaG9uZy1rb25nLW9wZW5zLWNyeXB0by10cmFkaW5nLWZvci1yZXRhaWwtaW52ZXN0b3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin Jumps to Key Price Resistance as Hong Kong Opens Crypto Trading for Retail Investors - CoinDesk",
        "content": "Bitcoin's short-term outlook also depends on the ongoing U.S. debt ceiling drama and the dollar index's trajectory. Treasury Secretary Janet Yellen has warned that the government would run out of money in early June if a debt deal is not reached, opening doors for what many say would be a catastrophic default. Some analysts said a successful resolution of the debt ceiling drama might see the Treasury suck out liquidity from the market and put downward pressure on bitcoin."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjMvY29pbmRlc2staW5kaWNlcy10cmVuZC1pbmRpY2F0b3ItaGludHMtYXQtY29udGludWVkLWRvd250dXJuLWZvci1iaXRjb2luLWV0aGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "CoinDesk Indices Trend Indicator Hints at Continued Downturn for Bitcoin, Ether - CoinDesk",
        "content": "Historically, May has been a relatively solid month for bitcoin and ether, with average daily returns of 0.195%, or approximately 1.4% weekly. However, given the amount of time left in May, there may not be enough runway left for bitcoin to finish on a positive note."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTIzL2JpdGNvaW4tYnRjLXNoZWRzLXZvbGF0aWxpdHktdHJhaXQtd2l0aC10aGlyZC13ZWVrLWFyb3VuZC0yNy0wMDDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Nears $27,000 Value As US Debt Ceiling Talks Continue - Bloomberg",
        "content": "For an asset that’s known to be highly volatile, Bitcoin has been shedding that characteristic of late.\n\nThe largest digital asset is lingering around $27,000 for the third consecutive Tuesday in what’s been “lackluster price action,” according to K33’s Bendik Schei and Vetle Lunde . And “the remarkably unremarkable state of the market is now aggressively reflected in most metrics,” with seven-day average trading volumes touching two-and-a-half-year lows, and 30-day volatility at its lowest since January, they wrote in a note."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDUvMjQvYml0Y29pbi1zaW5rcy1vZmFjLXNhbmN0aW9ucy13YWxsZXRzLXRpZWQtbm9ydGgta29yZWEtY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin sinks to $26,000, and OFAC sanctions crypto wallets tied to North Korea - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin sinks to $26,000, and OFAC sanctions crypto wallets tied to North Korea: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Leo Mizuhara of Hashnote discusses the state of crypto markets as bitcoin and ether prices fall."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLTIwMjMtbWlhbWktb3JkaW5hbHMtcG9saXRpY2lhbnMtMDk0NTUzNTMwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin 2023 Miami: Ordinals and Politicians Bring The Heat to Marquee Bitcoin Conference - Yahoo Finance",
        "content": "Bitcoin 2023 Miami: Ordinals and Politicians Bring The Heat to Marquee Bitcoin Conference\n\nIt's May in balmy Miami, and that means Bitcoin 2023 is in town (well and those NBA playoffs as well!). The world's largest Bitcoin conference hosted its 2023 edition at the Miami Beach Convention Center for a final time last week. After 3 years in Florida, it’s moving to Nashville in 2024. The conference welcomed the Bitcoin faithful from May 18 to 20, in the latest bid to dispel the Bitcoin winter gloom for good.\n\nThe next presidential hopeful, Robert F. Kennedy Jr., , was among the notable speakers at the event this year. Best-selling author Michael Lewis of The Big Short, Moneyball and The Blind Side was also present. U.S. Representative Patrick McHenry and presidential candidates Vivek Ramaswamy and Tulsi Gabbard also attended the event.\n\nBitcoin heavyweights in attendance included Michael Saylor, Adam Back, Samson Mow, Jack Mallers, Caitlin Long, Robert Breedlove, Dan Held, and recent convert David Marcus, who graced the Nakamoto and mining stages to dissect Bitcoin’s biggest pain points and rally the masses.\n\nIndustry Day\n\nThursday's Industry Day was a rather muted affair this year. There was a noticeable decrease in turnout compared to 2022, not only in attendance but also in (mainstream) star power, when the likes of Serena Williams and Jordan Peterson shared their 2 satoshis worth at the Bitcoin event last year.\n\nIt served as an overdue autopsy, with various panelists dissecting last year's FTX meltdown, intense regulatory scrutiny in the US, as well as a renewed emphasis on the importance of self-custodying your Bitcoin holdings.\n\nSeveral engaging talks on the main Nakamoto stage covered all corners of crypto. From why we need Bitcoin in the face of CBDCs and AI, to regulators, Bitcoin NFTs, TradFi, greener mining and so on.\n\nOne notable session, \"Boom to Bust: Wall Street & FTX,\" featured Jan van Eck and Eric Donovan. They explored the relationship between the financial industry and the now-defunct exchange, and the lessons it holds for investors.\n\nStory continues\n\nThe panel \"Fed vs Financial System '' brought together Caitlin Long, Miles Paschine, Ram Ahluwalia, and Mark Connors. They analyzed the complex dynamics between the Federal Reserve and the financial system.\n\nOther discussions centered around eco-friendly advances in Bitcoin mining, the renewed interest in self-custody, and combating anti-crypto sentiment. Frank Holmes and Andy Long shared insights on mining during the \"Mining Stage\" panel. Matt Odell provided a comprehensive Bitcoin 101 session, emphasizing the importance of self-custody. Additionally, experts like David Zell, Perianne Boring and Mina Khattak discussed strategies for combating regulatory obstacles in the \"Fighting the Anti-Crypto Army\" panel.\n\nGeneral Attendance Day 1\n\nAfter a slow Industry Day on Thursday, Friday saw a sizable uptick in attendance. A solid turnout of visitors came to listen to and interact with hundreds of speakers, Bitcoin proponents, and projects during General Attendance Day 1.\n\nHighlights included pro-Bitcoin regulation talks by Democratic Party hopefuls, Arthur Hayes’ interview with “The Big Short” author Michael Lewis, the big Ordinals debate, Jack Mallers’ Strike unveiling and more.\n\nSaylor On Ordinals\n\nBitcoin’s biggest evangelist, Michael Saylor, CEO of MicroStrategy, continues to accumulate Bitcoin over the long term with little regard for short-term fluctuations. He put in a long day in the service of the world's leading cryptocurrency.\n\nThe tech billionaire spent several exhausting hours in the media room at the tail end of the day, where he conducted many in-depth interviews and waxed lyrical about the role of Bitcoin in the face of inflation, authoritarian regimes, central bank digital currencies (CBDCs). Oh, and network congestion caused by BRC20 and Ordinals transactions.\n\nOn the latter, Saylor remained neutral, stating that he neither endorsed the likes of Ordinals nor wanted it censored.\n\nHe believes that the entire discussion of ordinal inscriptions is important to Bitcoin for two reasons.\n\n1) For Bitcoin to achieve long-term success, the Bitcoin miners must be successful.\n\n2) For companies, governments and individuals to adopt Bitcoin, it is necessary to develop applications on layer two and layer three.\n\nIf one were to discourage application developments, it would make it more difficult to scale and would also harm the Bitcoin mining network, where transaction revenue has to grow faster than the hash rate for the network to grow .\n\nElection 2024 Candidates Champion Bitcoin’s Cause\n\nIn their talks, Kennedy and Gabbard highlighted Bitcoin’s values and importance as a tool against governmental overreach. They explained that it will help to combat enhanced surveillance and financial control, facilitated by CBDCs and artificial intelligence (AI).\n\nThey criticized US regulators' hostile climate for crypto companies and investors, such as the 30% Bitcoin mining tax. Kennedy in particular laid out a strong manifesto in which he pledged to ensure Bitcoin stays the global hub of crypto. He aims to do this by defending the right to self-custody and run home nodes of Bitcoin, ensuring the neutrality of industry energy regulations, and even reviewing whether the likes of Ross Ulbricht should be pardoned if they’re victims of an anti-crypto crackdown.\n\n“We broke Bitcoin”: Bitcoin Ordinals Debate Takes Center Stage\n\nThe Big Bitcoin Ordinals Debate brought together experts to discuss the future of Bitcoin. It delved into the implications of ordinals, which have split the Bitcoin community into smaller factions. Those that embrace BRC20 see ordinals’ extended use cases for BTC. But, others see them as an attack on the world’s biggest cryptocurrency due to the network congestion and fee spikes they bring with them.\n\nSource: Bitcoin Magazine Youtube\n\nBitcoin purists and the new Ordinals and BRC20 rebel alliance clashed on the Nakamoto stage Friday afternoon.\n\nUdi Wertheimer and Eric Walls of Taproot Wizards, sporting cheap wizard outfits and beards, shared the stage with Spiral’s Matt Corallo, a Bitcoin Core contributor, and masked independent writer Shinobi Monkey. Things got off to a predictable start with Shinobi getting called a “Blockchain Karen” by Wertheimer after saying ordinals were an attack on Bitcoin that originated out of the Bitcoin SV camp.\n\nDuring the often lighthearted and technical discussion, the expert panelists explored whether ordinals pose a threat to Bitcoin, and the need to distinguish between user behavior and the underlying protocol. The debate also touched upon different approaches to tokenization, such as counterparty tokens, and covered the efficiency of protocols and trade-offs involved, especially with BRC20.\n\nArthur Hayes Interviews Michael Lewis\n\nDuring a fireside chat, Arthur Hayes, founder of BitMEX, interviewed Michael Lewis, the bestselling author known for books like \"Moneyball\" and \"The Big Short.\"\n\nLewis drew attention in the crypto community after spending time with Sam Bankman-Fried for research on his next book on the FTX collapse.\n\nLewis expressed he’s intrigued by the crypto space and referred to it as \"Financial Kanye.\" He criticized the persistence of financial intermediaries in the banking system, noting that they have found ways to rig the system and take unnecessary rents. Lewis expressed hope for a financial revolution through DeFi. He also speculated on US regulators' slow response to bail out banks connected to crypto during the recent liquidity crisis.\n\nMallers’ Strike Expands to 65 countries and Adds Lightning Features\n\nJack Mallers, CEO of Strike, announced that his Bitcoin payments company Strike has expanded to 65 countries. It would also be moving its global headquarters to El Salvador, as US crypto firms are getting out to friendlier regulatory pastures.\n\nThe expansion allows users to send and receive money instantly using the Lightning Network, catering to the requests of users. The update also introduces the ability to receive funds in U.S. dollar equivalents, including USDT, and a revamp of the app's user interface and logo.\n\nDuring his speech at Bitcoin 2023, Mallers emphasized the company's wider vision, aiming to provide a reliable service for Bitcoin adoption and a unique brand identity. Mallers highlighted the company's responsiveness to user feedback and expressed their commitment to being an exceptional global money app.\n\nSaturday: Day 2 General Attendance\n\nThe final day of Bitcoin Miami 2023 delivered several strong talks revolving around Bitcoin’s current and future use cases. It also covered challenges in an ever-evolving broader technological, investing and regulatory landscape.\n\nNotable talks include The Art of Bitcoin Banking panel with Caitlin Long, Obi Nwosi (Fedi) and Casa’s Jameson Loop, while Adamant Research’s Tuur Demeester pondered if “AI Dream of Electric Bitcoin.”\n\nWertheimer was on again in the Transaction Censorship panel with Nick Hansen (Luxor) and Bitcoin Magazine’s Craig Deutsch. The discussion then shifted to global with Zoltan Pozcar (Credit Suisse)’s talk on Geo Politics and Bitcoin. Following that, El Salvador government member Max Keiser explained the plot behind Super-HyperBitcoinization to Stacy Herbert of the Bitcoin Office.\n\nAfter lunch, Lyn Alden and Dylan LeClair spoke on Lightning for Businesses and Steady Lads.\n\nThe 2023 edition finally concluded with a short but good one: The Biggest Bulls. The old and new guard of Bitcoin, Adam Back of Blockstream and Strike’s Jack Mallers espoused on the value of Bitcoin, with the organizer’s Matt Odell moderating.\n\nAsked at what price he would sell his BTC, Mallers made it clear that only health-related expenses would separate him from his satoshis.\n\n“... the only thing that I mentally compartmentalize to reference how to price this thing is how much I value my life.\"\n\nExhibition Hall Highlights\n\nOf course, Bitcoin Miami wouldn’t be the same without some extravagance.\n\nBitcoin Bazaar\n\nThe Bitcoin Bazaar market provided plenty of Bitcoin in-jokes, cool stuff and not-so-subtle digs at the wider crypto space, with everything from Bitcoin panties, shitcoin toilet to Bitcoin children’s books.\n\nAttendees could also ride a mechanical bull to win 1 BTC, play a cornhole competition or kick a soccer ball, or simply gawk at a Bitcoin DeLorean car straight out of Back to the Future.\n\nOrdinals Alley\n\nThe Ordinals Alley by Gamma provided strong visual energy to the event, with dozens of eye-catching art pieces adorning temporary walls and many sold for auction.\n\nThis scene seems likely to continue to explode in the coming year, and with the independent event Ordinals2023 running simultaneously in Miami this year.\n\nFinal Thoughts\n\nBitcoin Week wrapped up in Miami on Bitcoin Pizza Day. It is the industry’s Thanksgiving, with a couple of small events to celebrate Laszlo Hanyecz’s 10,000 BTC sacrifice.\n\nLast year saw a staggering 35,000 visitors flock to the event on the back of the 2021 bull run. The conference, organized by BTC Inc. and Bitcoin Magazine's owners BTC Media, LLC, only drew an estimated 15,000 visitors this year. Factors such as the ongoing crypto winter, Bitcoin market doldrums, and steep ticket prices all drove down attendance.\n\nThe 3-day event remains a necessary staple on the crypto calendar. It serves as a platform for passionate discussions about the impact of Bitcoin. This includes its role in the battle for society in a technological and authoritarian landscape.\n\nOverall, the conference can be a bit heavy handed on the Bitcoin rhetoric if you’re a bit more chain-agnostic. But, it still provides a feast of worthwhile ideas, innovation and discussions for everyone.\n\nWhile Bitcoin Miami 2023 may not herald Crypto Spring yet, it is setting itself up as a springboard to what is to be a much sunnier 2024. With the next Bitcoin halving locked in for late April next year, and the Ordinals and BRC20 movement growing, expect things to be very different this time around next year in Nashville."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXN1cnBhc3Nlcy1zb2xhbmEtdG8tYmVjb21lLXNlY29uZC1tb3N0LXBvcHVsYXItbmZ0LWJsb2NrY2hhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin surpasses Solana to become second-most popular NFT blockchain - Cointelegraph",
        "content": "The monthly trading volume of nonfungible tokens (NFTs) and memecoins on Bitcoin in May surpassed Solana’s volume, according to data from CryptoSlam.\n\nBitcoin ordinals trading volume currently stands in second place behind Ethereum, which did $393 million in NFT volume, more than twice that of ordinals on Bitcoin (BTC) in 30-days starting April 23. Bitcoin gained a significant lead over popular blockchains like Polygon, ImmutableX, BNB Chain and Solana during this period.\n\nAccording to a Dune dashboard by BRC-20 token standard creator Domo, BRC-20 token transactions accounted for the majority of ordinals activity on Bitcoin.\n\nThe BRC-20 token standard is an experimental fungible token standard built using ordinals. It has harbored hype for memecoin, speculative cryptocurrencies whose price action is fueled by certain enthusiastic communities.\n\nThe total market capitalization of BRC-20 memecoins breached the $1 billion mark during the first half of May as the hype around it picked up. The current market capitalization of BRC-20 tokens is $447 million.\n\nPercentage share of Bitcoin transactions by activity. Source: Dune\n\nThe popular BRC-20 tokens like ORDI, PEPE and MEME have no utility attached to them and were primarily issued for experimental purposes. For instance, Twitter user Domo created ORDI to showcase the BRC-20 functionality that Ordinals provided.\n\nThe primary driver of BRC-20 volumes appears to be coming from traders who are looking to benefit from the newfound craze. However, as gains subside, the trading activity around BRC-20 tokens will likely fall as well.\n\nBitcoin NFT trading picks up\n\nBesides BRC-20 tokens, the market is witnessing a shift from BRC-20 tokens to media-based ordinals, aka Bitcoin NFTs. Magic Eden, a popular Bitcoin NFT marketplace, has started to eat into UniSat’s volume, which primarily trades in BRC-20 tokens.\n\nPercentage share of volume by marketplace. Source: Dune\n\nPopular collections like Bitcoin Frogs did around one-fourth the volume of top collections on Ethereum like Bored Ape Yacht Club (BAYC), which did just over $40 million in trading volume between April 23 and May 23.\n\nNFT traders will hope to replicate the success of Ethereum NFTs on Bitcoin with collections forming exclusive groups of ordinals holders.\n\nSo far, the Bitcoin NFT ecosystem appears miles behind Ethereum, which can support decentralized autonomous organizations and has other advantages like integration with the $27.5 billion strong decentralized finance ecosystem.\n\nFor instance, BAYC and Azuki have metaverse projects built around them, which provide exclusive advantages to NFT holders. On the other hand, CryptoPunks and Milady Maker enjoy popularity due to their scarcity and early mover advantage.\n\nRelated: Milady NFT floor price surges after Elon Musk tweet\n\nIt remains to be seen how successful Bitcoin NFT collections are in forming loyal communities like that of CryptoPunks, Milady Maker, Azuki or BAYC. While the trading volume of NFTs and memecoins on Bitcoin attained the second spot in May, the NFT collections have yet to provide utility or build a loyal community of holders.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2Nhbi1xdWFudHVtLWNvbXB1dGVycy1taW5lLWJpdGNvaW4tZmFzdGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Can quantum computers mine Bitcoin faster? - Cointelegraph",
        "content": "Quantum computing, explained Quantum computing is an emerging technology that leverages the principles of quantum mechanics to process information. Quantum mechanics is the foundation for quantum computing, allowing for the special qualities of superposition and entanglement that could make quantum computers more powerful than conventional computers. Quantum computers use quantum bits, or qubits, which can exist in numerous states simultaneously, as opposed to classical computers, which use bits to represent information as either a 0 or a 1. As a result, they can carry out some computations far more quickly than traditional computers. Quantum computing may have a significant influence on cryptography. Today’s encryption techniques frequently rely on the difficulties of factoring huge numbers or resolving other challenging mathematical puzzles for conventional computers. However, the speed at which quantum computers could solve these puzzles might make current encryption techniques attackable. Another area where quantum computing could have an impact is in Bitcoin mining. Bitcoin mining involves complex arithmetic problems that must be solved to validate transactions and add them to the blockchain. However, mining Bitcoin (BTC) demands a lot of processing power, which is why specialist equipment and software are needed. Quantum computers might be able to handle these issues considerably more quickly than traditional computers, which might make mining BTC more efficient. Nonetheless, it is crucial to remember that quantum computers are not always superior to classical computers in all situations. For instance, certain operations that require sifting through a lot of data, like looking for a particular record in a database, are still better suited for classical computers. Additionally, the impact of quantum computing on cryptography and Bitcoin mining remains to be seen, with researchers still exploring the potential of this emerging technology.\n\nHow efficient are quantum computers in Bitcoin mining? Complex mathematical problems must be solved throughout the Bitcoin mining process, which can be accomplished significantly more quickly using quantum computers than with classical ones. Yet, it is currently unclear how quantum computing may affect Bitcoin mining. While quantum computers may increase mining productivity, they may also increase the risk of quantum hacking on the Bitcoin network. This is because many public key cryptography-based encryption techniques used to protect Bitcoin are susceptible to attack by quantum computers. Quantum hacking is a cyberattack that uses quantum computing to break through cryptographic systems. Public key cryptography is a mathematical algorithm allowing two parties to communicate securely without exchanging a secret key beforehand. The approach is based on the complexity of some mathematical tasks, such as computing discrete logarithms or factoring huge integers, which are thought to be challenging for traditional computers to tackle well. Researchers are investigating using quantum cryptography and quantum-resistant algorithms to address this issue. These techniques could help safeguard the Bitcoin network in the future since they are more resistant to attacks from quantum computers. Furthermore, there are currently no quantum computers that can mine Bitcoin more effectively than conventional computers. But, as quantum technology develops further, it is conceivable that quantum Bitcoin mining may become a reality in the future. Related: Cryptocurrency vs. quantum computing: A deep dive into the future of cryptocurrencies\n\nCan a quantum computer hack Bitcoin? By exploiting its higher processing capacity to defeat the encryption that safeguards private keys and transactions on the Bitcoin network, a quantum computer could theoretically hack Bitcoin. However, the current state of quantum technology is not yet advanced enough to pose a significant threat to Bitcoin’s security. Quantum computers might make public-key cryptography less secure because of their capacity to answer some mathematical problems far more quickly than classical computers. For example, Shor’s algorithm — a quantum algorithm — can factor large integers exponentially faster than classical algorithms. Factoring large integers is the basis of many public key encryption schemes, including the one used in Bitcoin. The public-key cryptography employed in Bitcoin and other cryptocurrencies might hypothetically be cracked if a quantum computer had the processing capability to carry out Shor’s algorithm. An attacker with a quantum computer could potentially steal BTC by computing the private key corresponding to a public key used to receive Bitcoin. The big prime numbers used to generate the public-private key combination could be factored in to achieve this. However, it is crucial to remember that quantum computing is still in its infancy and lacks the power to carry out Shor’s algorithm at the scale necessary to decrypt Bitcoin. Although small-scale quantum computers have been shown to factor in small numbers, there is still a long way to go before a large-scale quantum computer that breaks Bitcoin’s encryption can be built. In addition, the Bitcoin network is constantly developing to counter possible security risks, such as the risk presented by quantum computers. For instance, a hash-based signature system like the Lamport signature method might make Bitcoin more resilient against quantum attacks. Researchers are also investigating the use of post-quantum cryptography, which was created to be resistant to quantum computers. The Lamport signature method is considered one of the post-quantum cryptographic methods that can be used to secure digital signatures from potential threats from quantum computers. This technique generates several pairs of public and private keys to verify digital signatures using a one-time hash function. The communication is protected against efforts at quantum hacking since each pair is used to sign a distinct section of the message. Due to the one-time nature of the hash function, even if an attacker gets hold of one of the private keys, they cannot use it to forge other signatures or find the other private keys."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9mLWFtZXJpY2EtdG8taGFsdC1vcGVyYXRpbmctdW5saWNlbnNlZC1jcnlwdG8ta2lvc2tzLWluLWNvbm5lY3RpY3V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin of America to stop operating unlicensed crypto ATMs in Connecticut - Cointelegraph",
        "content": "Cryptocurrency and Bitcoin (BTC) ATM provider Bitcoin of America consented with the Connecticut Department of Banking to halt its operations due to a lack of licensing.\n\nIn a statement released on May 22, the Department of Banking highlighted that Bitcoin of America failed to obtain a proper license to operate Bitcoin ATM kiosks in the state. However, the consent order was enforced after four Connecticut consumers lost tens of thousands of dollars in a scam involving the kiosks in question. The state revealed:\n\n“As a result of the consent order, Bitcoin of America made restitution to these consumers totaling $86,000. Following a criminal indictment, Bitcoin of America is winding down operations here in Connecticut.”\n\nBanking commissioner Jorge Perez issued a warning against the use of unlicensed crypto kiosks. He stated that investors are often urged and tricked into depositing cash into the kiosks and transferring an equal amount of cryptocurrencies to the scammers.\n\nBitcoin of America — which allows the transfer of consumers’ funds to third parties — is required to be licensed as a money transmitter. Legislation is making its way through the state legislature to put more regulations and consumer protections in place and demand the licensing of digital currency kiosks as money transmitters in Connecticut.\n\nIn addition, the Connecticut State Police, Department of Banking, Office of the Attorney General and the Connecticut Department of Consumer Protection issued a scam alert against the use of unlicensed crypto and Bitcoin ATMs.\n\nIn March, 52 Bitcoin of America ATMs and kiosks suspected of being used in scams were confiscated in Ohio.\n\nRelated: Australia installs more Bitcoin ATMs than whole of Asia\n\nGeopolitical instability across the globe, compounded by a crackdown on unlicensed operations, has had a negative effect on the overall Bitcoin ATM network. In March alone, 3,627 crypto ATMs went offline, recording the largest-ever monthly decline of crypto ATMs.\n\nNet change of cryptocurrency machines installed and removed monthly. Source: Coin ATM Radar\n\nAs shown above, net crypto ATM installations declined for four months between September 2022 and March 2023.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDUvMjMvYml0Y29pbi1qdW1wcy1pbnRlcm5hdGlvbmFsLXdhdGNoZG9nLWNyeXB0by1ydWxlcy1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin jumps back above $27,000, and international watchdog unveils crypto rules - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin jumps back above $27,000, and international watchdog unveils crypto rules: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Mike Brock, the head of the TBD business unit at Block, discusses the firm's new Web5 identity platform from Bitcoin 2023 in Miami.\n\n12:11 Tue, May 23 2023 3:08 PM EDT"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8xNjBrLWhhbHZpbmctYnRjLXByaWNlLXByZWRpY3Rpb24tbW9kZWwtY291bnQtZG93bi1uZXctYml0Y29pbi1hbGwtdGltZS1oaWdo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "$160K at next halving? Model counts down to new Bitcoin all-time high - Cointelegraph",
        "content": "Bitcoin (BTC) price action may lack momentum this month, but one popular analyst is still eyeing new all-time highs.\n\nIn his latest analysis, TechDev confirmed that he believes BTC/USD will see a “parabolic top” around the 2024 block subsidy halving.\n\nCan Bitcoin gain 500% in a year?\n\nLess than 12 months away, Bitcoin’s next halving is already the topic of debate among market participants.\n\nSome argue that the event will lay the foundations for the next all-time high, in line with previous halving cycles.\n\nFor TechDev, however, the new BTC price record should come sooner than later, in Q2 of 2024.\n\nThe idea was initially covered in a Market Update blog post earlier in May. This week, meanwhile, it was described as his “primary time-based idea.”\n\nA chart uploaded to Twitter showed the path to the Q2 top dotted with resistance lines, Fibonacci retracement levels and the current all-time high from 2021.\n\nUltimately, BTC/USD should top out at around $160,000, it predicts.\n\nBTC/USD prediction chart. Source: TechDev/ Twitter\n\nTechDev additionally updated a log scale BTC price prediction which he nonetheless acknowledged was unlikely to come true.\n\n“Not a forecast. Not a prediction. Not even my primary idea,” a prior update from August 2022 stated.\n\nFormed using a simple log curve, the idea puts BTC/USD at a similar price level, but sooner — by the end of 2023.\n\nUpdate: #Bitcoin on adjusted log time\n\n\n\nTime = log(weeks)^3.44\n\n\n\nNext period meets curve at 160-180K December 2023.\n\n\n\nObservation based on a sample of 2. pic.twitter.com/GH3zjEsdti — TechDev (@TechDev_52) May 23, 2023\n\nShort-term bullish takes absent\n\nHow Bitcoin will behave for the rest of 2023 in the run-up to the halving continues to divide opinion.\n\nRelated: Bitcoin Halving: How it works and Why it matters\n\nAs Cointelegraph reported, some market participants expect a deeper price correction, with veteran analyst Philip Swift not discounting the chance of a return to $20,000 in the coming months.\n\nAfter weeks of cooling, few voices are betting on the kind of upside seen in Q1 to make a comeback in the short term.\n\nIn ongoing research, popular trader and analyst Rekt Capital reiterated that Bitcoin failed to keep hold of support levels required for upward continuation.\n\n“BTC continues to reject from ~$27600. Weeks ago, this level was decisively lost as support. And for the past 2 weeks - it is a firm resistance,” he tweeted on May 24.\n\n“$BTC is technically positioned for downside. If BTC cannot reclaim $27600 as support soon, BTC will go lower in time.“\n\nAn accompanying chart showed BTC/USD behavior on weekly timeframes.\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNS8yNC9iaXRjb2luLXBheW1lbnRzLWZpcm0tc3RyaWtlcy1oZWFkcXVhcnRlcnMtdG8tc3RheS1pbi11cy1kZXNwaXRlLW5ldy1lbC1zYWx2YWRvci1vZmZpY2Uv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzI0L2JpdGNvaW4tcGF5bWVudHMtZmlybS1zdHJpa2VzLWhlYWRxdWFydGVycy10by1zdGF5LWluLXVzLWRlc3BpdGUtbmV3LWVsLXNhbHZhZG9yLW9mZmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin Payments Firm Strike’s Headquarters to Stay in U.S., Despite New El Salvador Office - CoinDesk",
        "content": "“We're living in a country right now where the SEC is fighting with Brian Armstrong,” Mallers said – likely referencing the Wells notice Coinbase received in March from the Securities and Exchange Commission (SEC). “And we're going global, headquartered out of El Salvador. It's really f*cking awesome, it's really a beautiful thing.”"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmRhdGFzY2llbmNlY2VudHJhbC5jb20vZXhwbG9yaW5nLXRoZS1zeW5lcmd5LWJldHdlZW4tYml0Y29pbi1hbmQtY2hhdGdwdC1lbXBvd2VyaW5nLWZpbmFuY2lhbC1jb252ZXJzYXRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Exploring the Synergy between Bitcoin and ChatGPT: Empowering Financial Conversations - DataScienceCentral.com - Data Science Central",
        "content": "ChatGPT continues to revolutionize the way financial conversations are conducted, by providing its users with a fast and reliable tool for decision-making.\n\nThe synergy between Bitcoin and ChatGPT is evident in how each technology enables the other to reach its full potential. Bitcoin provides an efficient payment system, while ChatGPT enhances conversational capabilities through natural language processing (NLP) technology.\n\nChatGPT’s NLP algorithms can be used to help improve user experience during financial discussions. It understands human behavior patterns as well as underlying market trends, allowing it to generate intelligent insights that can help inform decisions in real-time.\n\nIn addition, ChatGPT can be integrated with existing blockchain systems, such as Ethereum or Hyperledger Fabric, which allows for improved security and stability of financial transactions.\n\nThe synergy between Bitcoin and ChatGPT is further strengthened when it comes to customer service. ChatGPT’s AI-powered chatbot can assist customers with their queries in a fraction of the time taken by human labor, allowing for faster resolution times and better customer satisfaction. It can even use sentiment analysis to detect user emotions, meaning that it can respond appropriately in different scenarios.\n\nUltimately, this combination of technologies enables users to conduct financial conversations in a secure and efficient manner, all while being informed by accurate insights and backed up by reliable security systems.\n\nBy exploring the power of these two revolutionary technologies together, businesses and individuals are sure to benefit from improved communication capabilities as well as enhanced customer service. In short, Bitcoin and ChatGPT offer a powerful synergy that is sure to shape the future of financial conversations.\n\nThe potential for this combination of technologies is limitless, and businesses in all industries should take advantage of it. With Bitcoin and ChatGPT powering their financial conversations, they can expect to streamline operations, increase customer satisfaction, and reduce costs. The true power of these two technologies lies in how they empower each other – so start exploring today.\n\nChatGPT and its ability to break down complex topics and whitepapers\n\nAnother point of synergy between ChatGPT and Bitcoin is the way in which it can easily break down complex topics like fractional trading and bitcoin halving, as well as whitepapers related to blockchain technology.\n\nFor example, if a user wants to learn more about a certain token or protocol, they can ask ChatGPT an open-ended question such as “What is the difference between ERC-20 and ERC-721?” ChatGPT will then provide a comprehensive explanation which could include definitions of both tokens, how they work, their advantages and disadvantages, and any other relevant information.\n\nThis helps users gain a better understanding of cryptocurrency investing without having to strain through pages of technical documents.\n\nBy leveraging the power of natural language processing (NLP) and deep learning algorithms, ChatGPT further improves its ability to understand financial questions asked by users. This allows it to provide more accurate and in-depth financial advice tailored specifically for individual portfolios.\n\nChatGPT Portfolios and Investment Advice\n\nA lot of people have been putting a considerable amount of faith is ChatGPT as a money manager and, while, perhaps, still not there yet, it is not unimaginable to consider that one day, investors may be able to have a conversation with ChatGPT that helps them construct the ideal investment portfolio.\n\nAs Bitcoin continues to gain in value and acceptance, its inclusion as part of an investor’s portfolio could become more commonplace. With the assistance of ChatGPT, it might even become possible for individuals to craft their own personalized portfolios based on their individual risk profiles and long-term goals.\n\nChatGPT can help create customized financial plans tailored to each investor’s needs. Through intelligent conversations, it can guide users through different options and explain why certain investments may be better suited than others depending on an individual’s risk preference and goals.\n\nThis provides increased autonomy over one’s finances while ensuring guidance is at hand when needed.\n\nAs Bitcoin continues to mature, it has the potential to become a key part of investment portfolios. With the help of ChatGPT, investors can receive tailored advice on how best to include Bitcoin in their portfolio and how much to allocate towards it.\n\nThis could be particularly useful for those who are new to investing or cryptocurrency and need some direction when figuring out where and how much they should invest in Bitcoin.\n\nBy combining the power of ChatGPT with the growing acceptance of Bitcoin, investors have access to an unprecedented level of customized financial guidance that allows them to make informed decisions about their investments with confidence.\n\nToken risk analysis\n\nRisk analysis refers to the process of evaluating potential investment opportunities. Risk analysis is based on a set of criteria and typically involves an assessment of potential returns, risks, and costs associated with a given investment strategy.\n\nBy analyzing the risk factors associated with Bitcoin investing, ChatGPT can help you understand how to best manage your investments in order to maximize return while minimizing risk.\n\nChatGPT can generate personalized financial advice tailored specifically for your portfolio, but it is important to keep in mind that ChatGPT and its architects acknowledge that AI is not “qualified” to pick assets.\n\nIt can create custom portfolios that reflect unique strategies and optimize for specific preferences such as low-risk or high-returns. Additionally, it’s capable of generating trading code which allows users to automatically execute trades according to predefined parameters.\n\nFor example, someone who is 45 years old and trying to put money away for retirement might ask ChatGPT something like “What is the best way for me to invest $10,000?” ChatGPT can then generate a portfolio of investments that is customized to this individual’s risk tolerance and long-term goals.\n\nThis portfolio could include a combination of Bitcoin, stocks, bonds, and other investments.\n\nChatGPT also offers advice on token risk analysis. It considers factors like market volatility when recommending tokens for investment.\n\nWith its comprehensive understanding of the crypto market and vast insights from the blockchain technology it leverages, ChatGPT can offer valuable advice on which tokens you should buy or sell in order to meet your financial objectives.\n\nChatGPT’s limitations\n\nIt’s important to recognize that ChatGPT is still in its relative infancy and, therefore, any guidance it is able to provide users should be approached cautiously.\n\nIt cannot guarantee a return on investment, or make any promises about the performance of an asset over time. As with any investment, it is important for users to do their own research before making financial decisions.\n\nUltimately, the potential synergy between Bitcoin and ChatGPT offers investors unprecedented access to customized financial guidance that helps them make informed decisions with confidence.\n\nBy leveraging its powerful chatbot capabilities, ChatGPT can generate personalized portfolios tailored specifically for individual risk tolerances and goals.\n\nAdditionally, its ability to break down complex topics related to blockchain technology gives users deeper insights into cryptocurrency investments, allowing them to maximize returns while minimizing risks.\n\nWith all these features combined, ChatGPT has become an invaluable asset for investors looking to maximize their success.\n\nConclusion\n\nThe synergy between Bitcoin and ChatGPT is undeniable, offering investors the ability to customize their portfolios, take advantage of token risk analysis, and gain a better understanding of complex topics related to blockchain technology.\n\nBy combining these powerful technologies together, ChatGPT can revolutionize the way people interact with the crypto market and build long-term financial success.\n\nWith its comprehensive understanding of cryptocurrency markets and vast insights from the blockchain technology it leverages, ChatGPT can offer invaluable assistance when it comes to making smart investment decisions and optimizing one’s portfolio."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2luLW1pbmluZy1jb250cm92ZXJzeS1hbmQtdGhlLWNhc2Utb2YtZ3JlZW5pZGdlLWdlbmVyYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin Mining Controversy and the Case of Greenidge Generation - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzVmMjczN2ZjLTM0NzAtNDQzNi04ZGRiLTlkNDRkOTNhNjU2Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Don't treat crypto like gambling — even if it is largely pointless - Financial Times",
        "content": "Print this page\n\nEven the heat of Miami can’t warm a crypto winter.\n\nThe faithful descended on Florida last weekend for the world’s “biggest bitcoin event”. Only half as many made the journey as in 2022. Some of the buzz and meme coins were gone. So was the sense of indestructibility, after a year in which some of the crypto world’s biggest names cratered and US agencies launched a slew of enforcement actions in the sector.\n\nThere was a cold blast from Westminster last week too, where an influential parliamentary committee suggested that crypto was, not disruptive or renegade, but worse: borderline irrelevant. Unbacked cryptoassets, said the Treasury select committee, had “no intrinsic value” and served “no useful social purpose”. The right thing to do to protect consumers, it suggested, was to regulate this activity as gambling.\n\nThis was dismissive, appealing and, I think, wrong. The committee has a point about utility. You can be open-minded about the potential for distributed ledger technology, or even stablecoins and central bank digital currency, and still think cryptocurrencies have totally failed to demonstrate their usefulness, either as a store of value, medium of exchange or tool for financial inclusion. “The industry still does a very bad job of explaining things,” says Oliver Linch, chief executive of Bittrex Global. “It’s been wink wink . . . if you know, you know, to the moon nonsense.”\n\nThe committee’s concern was that financial regulation would mean a “halo effect” for that kind of guff, giving a false sense of safety — a legitimate concern. But “to say it’s gambling makes no sense legally”, says Marc Jones, partner at Stewarts Law firm, noting the ownership aspect to cryptoassets. Nor would it be likely to result in effective regulation.\n\nThe dividing line between financial regulation and gambling is already murky. Spread betting and other types of leveraged trading are taxed as gambling but regulated by the Financial Conduct Authority. Adverts for betting platforms prominently display that 80 per cent of retail accounts lose money, an at-source version of the FCA’s warnings in the absence of more powers.\n\nMeanwhile, UK gambling regulation is still trying to catch up with the invention of the smartphone. It is “not fit for purpose”, says Matt Zarb-Cousin, who campaigns to clean up gambling. This year’s gambling reform proposals belatedly pledge controls on free bets and other inducements. The FCA sent shares in spread-betters tumbling in 2016 with leverage limits and bans on account bonuses and promotions. Crypto (and spread betting) can cause gambling-like harm, says Zarb-Cousin. But better to incorporate protections such as self-exclusion tools into the tougher financial framework.\n\nDividing responsibility between regulators would be a mistake. The crypto universe doesn’t neatly split into conceivably useful and definitely pointless. A split is an invitation for regulatory arbitrage. And the intersection of crypto with mainstream finance should be of as much interest to regulators as the tokens themselves.\n\nThe committee’s report seems unlikely to prompt a change of direction from the government, which in February followed Europe and other jurisdictions such as Hong Kong in proposing to regulate crypto under the UK’s existing financial services framework.\n\nThat doesn’t make it insignificant. After much excitable talk about the UK as a “global crypto hub”, the mood has shifted — a shift that, oddly, this latest broadside could reinforce. Crypto will increasingly be asked to play by the rules of mainstream finance. The committee is unlikely to be pushing for a lighter touch in the name of innovation.\n\nThis is also true internationally. The US crackdown rests on protecting investors using the same securities laws and standards as for the rest of finance: “There’s no reason to treat the crypto market differently just because different technology is used,” said SEC chair Gary Gensler last year. Iosco, the co-ordinating body for global securities regulators, this week called for watchdogs to move faster in establishing a “level playing field between cryptoassets and traditional financial markets”, including breaking up crypto firms where services including broking, trading and custody are combined in a way that would be unacceptable elsewhere.\n\nAll signs to date — from Binance’s troubles in securing licences, to the low success rate for UK anti-money laundering registration — suggest that large parts of the crypto world, even those eager for the warm glow of accreditation, will struggle to clear basic hurdles, let alone a like-for-like standard. As the crypto winter lifts, it won’t just be conference audiences that have shrunk.\n\nhelen.thomas@ft.com"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhhbmdzLWluLXRoZS1iYWxhbmNlLWZyaWRheS1zLTItMjZiLWJ0Yy1vcHRpb25zLWNvdWxkLXJlc3VsdC1pbi1tb3JlLWRvd25zaWRl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin price hangs in the balance — Friday's $2.26B BTC options could result in more downside - Cointelegraph",
        "content": "Bitcoin’s price failed to break above $27,500 for the fourth time in 12 days on May 23. The subsequent 24-hour rejection down to $26,100 might seem small in absolute terms, but it potentially represents the lowest daily close in 68 days.\n\nAs the deadline for the Bitcoin (BTC) monthly options expiry on May 26 approaches, the fate of the $2.26 billion open interest could determine whether the recent bearish trend will prevail, opening room for a correction down to $25,000 or lower.\n\nBitcoin price and the U.S. debt ceiling debate\n\nAnalysts argue that even if the United States government is able to raise the debt ceiling ahead of the June 1 deadline, risk-on assets such as stocks and cryptocurrencies could suffer, as the offer of new U.S. Treasurys would drain liquidity from the market.\n\nThe incentives for fixed income are in place as the one-year instruments return a 5.15% yield and the prospects of an economic crisis increase. Regardless of how the U.S. manages its debt issues, in periods of uncertainty, investors tend to seek shelter in the least risky asset classes.\n\nFor instance, U.S. money market fund assets hit a new record of $5.8 trillion this week as investors turned their focus to short-term debt securities, according to Reuters. Fixed-income mutual funds are a primary source of corporate and municipal funding and have faced $615 billion in net inflows so far this year.\n\nBitcoin’s 11% accumulated losses since May 6 might be precisely what bears need to succeed in May’s $2.26 billion monthly options expiry.\n\nBitcoin options: Bulls placed 84% of bets above $29,000\n\nThe open interest for the May 26 options expiry is $2.26 billion, but the actual figure will be lower since bulls were expecting a Bitcoin price above $29,000. These traders were caught by surprise as Bitcoin dropped 10.9% between May 6 and May 12.\n\nBitcoin options open interest for May 26. Source: Deribit\n\nThe 0.38 put-to-call ratio reflects the imbalance between the $1.64 billion call (buy) open interest and the $630 million in put (sell) options.\n\nHowever, if Bitcoin’s price remains near $26,500 at 8:00 am UTC on May 26, only $67 million worth of these call options will be available. This difference happens because the right to buy Bitcoin at $27,000 or $28,000 is useless if BTC trades above that level on expiry.\n\nBears aim for sub-$25,000 to secure a $270 million profit\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on May 26 for call (bull) and put (bear) instruments varies, depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit:\n\nBetween $24,000 and $25,000: 900 calls vs. 12,100 puts. The net result favors the put (sell) instruments by $270 million.\n\n900 calls vs. 12,100 puts. The net result favors the put (sell) instruments by $270 million. Between $25,000 and $26,000: 1,800 calls vs. 8,900 puts. The net result favors the put (sell) instruments by $180 million.\n\n1,800 calls vs. 8,900 puts. The net result favors the put (sell) instruments by $180 million. Between $26,000 and $27,000: 2,600 calls vs. 6,400 puts. Bears’ advantage is reduced to $100 million.\n\n2,600 calls vs. 6,400 puts. Bears’ advantage is reduced to $100 million. Between $27,000 and $28,000: 4,800 calls vs. 5,200 puts. The net result is balanced between call and put instruments.\n\nThis crude estimate considers the call options used in bullish bets and the put options exclusively in neutral-to-bearish trades. Even so, this oversimplification disregards more complex investment strategies.\n\nFor example, a trader could have sold a call option, effectively gaining positive exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nRelated: Why Bitcoin is stuck below $28,000 resistance\n\nBears could use profits to further pressure Bitcoin’s price\n\nBitcoin bulls will likely be satisfied if they manage to come out empty-handed by pushing the Bitcoin price above $27,000 during the expiry. Meanwhile, bears need a mere 2% price drop from $26,300 to secure a $180 million profit.\n\nGiven the bearish momentum for risk-on assets triggered by the U.S. debt ceiling standoff, Bitcoin bears are in a better position for the May $2.26 billion BTC monthly options expiry.\n\nIn short, an expiry price below $26,000 will boost bears’ appetite to further suppress Bitcoin’s price down to $25,000 or lower.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRyb3BzLWJlbG93LXVzLTI3LTEwMTYzNDI3OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin drops below US$27,000, Dogecoin biggest loser - Yahoo Finance",
        "content": "Bitcoin fell below US$27,000, recording the second biggest loss among the top 10 non-stablecoin cryptocurrencies on Wednesday afternoon in Asia. Dogecoin topped the day’s decline, leading the downward trend as all the coins in the top 10 list recorded losses. Asian equities fell as U.S.-China tensions escalated after China banned U.S. memory chip maker Micron Technology’s products. The world’s second biggest economy faces a new Covid-19 wave. U.S. stock futures fell as negotiations on raising the U.S. debt ceiling failed to make progress.\n\nSee related article: Hong Kong to open crypto to retail traders, plans guardrails\n\nDogecoin leads the losers pack\n\nBitcoin lost 2.33% to US$26,671 in 24 hours to 4 p.m. in Hong Kong, according to CoinMarketCap data. The world’s biggest cryptocurrency lost 0.68% over the last seven days.\n\nEther dropped 2.15% to US$1,813, but gained 0.30% on the week.\n\nDogecoin was the day’s biggest loser, dropping 2.83% to US$0.07119, bringing its weekly losses to 2.02%.\n\nBNB, the native token of the world’s biggest cryptocurrency exchange Binance, lost 1.81% in 24 hours to US$307. On Tuesday, a Reuters report alleged that Binance had mixed client funds with its own corporate revenue, which violates U.S. regulations.\n\nThe total crypto market trading volume fell 6.35% to US$28.72 billion, while the global crypto market capitalization lost 1.78% to US$1.12 trillion.\n\nAmong corporate developments in Asia, StraitsX, a Singapore-based digital asset payment firm, announced its StraitsX Singapore Dollar (XSGD) stablecoin will be available on the Hedera, a distributed ledger-based network, in a statement on Wednesday. The partnership allows users to send and receive XSGD on Hedera.\n\nSince its launch in October 2020, XSGD has surpassed over 7 billion XSGD in on-chain transactions, making it one of the largest non-USD stablecoin by market capitalization, StraitsX said.\n\nBitcoin NFT sales surge\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index inched down 0.46% to 3,376.48 points in the 24 hours to 4:30 p.m. in Hong Kong while declining 0.30% during the week.\n\nStory continues\n\nSecondary non-fungible tokens sales on Bitcoin rose for the first time this week, increasing 65.92% to US$4.8 million in the past 24 hours, boosted by a 3.45% sales increase in Bitamigos, that generated over US$1.9 million for the world’s first blockchain, according to CryptoSlam.\n\nEthereum’s 24-hour NFT sales picked up for the first time this week, rising 4.35% to US$14.6 million, along with the Forkast ETH NFT Composite, which rose 0.11% to 1,129.28 points. The largest Ethereum-based collection, the Bored Ape Yacht Club, rose 5.47% to US$530,769 and Milady Maker sales increased by 3.52% in the past 24 hours to US$1.2 million.\n\nAmong other developments, Singapore-based NFT company Bored Island Group opened a physical profile picture NFT gallery, BIGHAUS, on May 20, according to a statement.\n\n\n\nThe gallery was developed in collaboration with a range of NFT clubs, namely, the 250-member Bored Ape Singapore Club, as well as CryptoPunks Club SG, Goblin Town, Doodles, and others. The current collection is valued at 33.7 million Singapore dollars (US$25 million).\n\nAmong acquisitions in the sector, Vertex Labs, the metaverse, Web3, and AI infrastructure provider, has acquired London-based digital art studio Digimental Studio, developer of 3D NFT fashion brand HAPE, for US$12 million, the company said in an emailed statement on Wednesday.\n\nThrough its acquisition of Digimental, Vertexlabs.uk will introduce a staking programme for its HAPE community members, the statement said. HAPE currently has a trading volume of US$200 million, the company said.\n\n“Builders and brands are pushing Web3 forward with innovative products and solutions, but it’s the collectors and communities that are showing the real strength of NFTs in the bear market,” according to Yehudah Petscher, NFT strategist at Forkast Labs.\n\nU.S. futures down amid Sino-U.S. pressures and debt concerns\n\nImage: Envato Elements\n\nAsian equities fell on Wednesday as investors traded cautiously after Sino-U.S. tensions rose following China’s ban on products made by U.S. memory chip maker Micron Technology citing security concerns. Traders are also concerned as raising the U.S. debt ceiling negotiations has not progressed.\n\nThe Shanghai Composite dropped 1.28% and the Shenzhen Component Index lost 0.84%. Hong Kong’s Hang Seng Index fell 1.62% and Japan’s Nikkei 225 dropped 0.89%.\n\nThe world’s second biggest economy, struggling to recover from three years of pandemic-led disruptions, reportedly faces a new Covid-19 wave that may see as many as 65 million cases per week by the end of June.\n\nMajor U.S. stock futures dropped as of 4:30 p.m. in Hong Kong. The tech-heavy Nasdaq-100 futures fell 0.17%, the S&P 500 futures index fell 0.19% and the Dow Jones Industrial Average futures fell 0.20%.\n\nThe stagnating debt ceiling negotiations have also weighed down investor sentiment, as House Speaker Kevin McCarthy said on Tuesday that the two sides had yet to reach a deal, to avert the government’s default by June 1. Negotiations are set to resume this week, for raising the US$31.4 trillion debt ceiling.\n\nInvestors now look forward to the May policy meeting minutes of the U.S. Federal Open Market Committee, scheduled for release on Wednesday, along with corporate earnings from tech companies like Nvidia, Snowflake and Splunk.\n\nEuropean bourses also fell on Wednesday, weighed down by the uncertainty on the U.S. debt ceiling negotiations. The benchmark STOXX 600 fell 1.36%, on track for its biggest daily drop since March 24, while Germany’s DAX 40 fell 1.24%.\n\nIn the United Kingdom, annual consumer price inflation for April decreased to 8.7% from 10.1% in the previous month, but food prices continued to rise at the fastest pace in 45 years, soaring 19% in the 12 months to April. Following the release on Wednesday, London’s benchmark FTSE 100 fell 1.43% to 7,651.63 points, its lowest level since early April.\n\nSee related article: Governments could access Ledger wallet private keys, says CEO"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktYml0Y29pbi1pcy1zdHVjay1iZWxvdy0zMC0wMDAtdmlkZW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Why Bitcoin is stuck below $28,000 resistance - Cointelegraph",
        "content": "On May 23’s episode of The Market Report, analyst and writer Marcel Pechman discusses why Bitcoin (BTC) is stuck near $27,000 and how the macroeconomic scenario has become more critical than ever for an eventual breakout. Plus, the show dissects what United States President Joe Biden has been saying about crypto traders being wealthy tax cheaters.\n\nThe first news article shows that the most significant price movements tend to occur after periods of low volatility, as traders tend to get overconfident and add leverage. That creates a perfect storm for a decisive breakout, so, ultimately, stop-loss orders and liquidations further boost the price swing.\n\nPechman does not believe the U.S. Federal Reserve decision on June 14 will be the trigger everyone expects because it’s relatively priced in that the current 5% rate will be maintained. In his 20-year trading experience, Pechman says those events tend to come out of nowhere.\n\nThe show dissects what Biden has been saying about wealthy crypto traders cheating on their taxes. The alleged protections for crypto traders refer to tax-loss harvesting — a strategy investors use to reduce their overall tax liabilities.\n\nAccording to Pechman, tax-loss harvesting is nothing new and is relatively common in the stock, mutual fund, and commodities markets. There are no grounds for Biden’s baseless differentiation of asset classes, and Pechman does not believe the U.S. president is in a bargaining position right now, with less than 10 days to go before a potential debt default.\n\nThe show’s third and final article covers the speculation of an imminent Bitcoin breakout toward $29,000. The recent sideways price movement is eerily similar to early April when Bitcoin’s 12-hour chart ranged between $27,800 and $28,700 for 11 days.\n\nHowever, Pechman reveals little similarity between the early April bullish breakout and the current status of the Bitcoin futures premium and options risk metric. The bottom line? This time is different, which doesn’t mean bulls can’t get ahead; it’s just less likely according to those metrics.\n\nDon’t miss out! The show is available exclusively on the Cointelegraph Markets & Research YouTube channel."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNoaW5hLXNpZ25hbHMtY3J5cHRvLXRyYWRpbmctcGxhbi1ob25nLWtvbmctMDg0MDM4MDE5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin gains after China signals crypto trading plan for Hong Kong - Yahoo Finance",
        "content": "A proposed plan could permit retail investors in Hong Kong and institutional investors in mainland China to trade cryptocurrencies, including bitcoin, through Hong Kong. Photo: Florence Lo/Reuters (Florence Lo / reuters)\n\nBitcoin (BTC-USD) has risen over 2% as investors eye the ongoing stalemate over the US debt ceiling and anticipate a positive crypto move in China.\n\nBitcoin was trading around $27,500 (£22,175) on Tuesday, up 0.8% in the week.\n\nThe global cryptocurrency market cap stood at $1.19tn, up 1.8%.\n\nInvestors are monitoring developments in Hong Kong and China, in anticipation of a proposed plan that could permit retail investors in Hong Kong and institutional investors in mainland China to trade cryptocurrencies through Hong Kong.\n\nThe Hong Kong Securities and Futures Commission is set to reveal the consultation conclusions on retail participation at a Tuesday briefing, with a plan to launch a licensing regime for digital asset platforms on 1 June.\n\nRead more: Crypto live prices\n\nThis move is not without controversy, given the global crypto market's turmoil in 2022 and the collapse of the FTX exchange.\n\nBitcoin has hovered between $26,500 and $27,500 in the past fortnight, amidst US debt ceiling talks between president Joe Biden and House leaders, according to Coingecko.\n\nThe US Treasury Department affirmed on Monday that it could only fulfil the government's financial responsibilities until 1 June without a debt limit hike, leaving a 10-day window for an agreement between White House negotiators and congressional Republicans.\n\nAlthough analysts believe the risk of a US default is minimal, if it does occur it could potentially cause cryptocurrencies to plummet.\n\nBitcoin was given a confidence boost by co-founder of MicroStrategy (MSTR) Michael Saylor, who said that bitcoin is entering a new bull market.\n\nHe attributes this upswing to the bitcoin halving process, increased adoption, and the anticipated regulatory crackdown on the wider crypto industry, which could favour bitcoin.\n\nSpeaking to CNBC he said he foresees a shift of investor and developer interest from other blockchains to bitcoin as regulations weed out other competing cryptocurrencies.\n\nStory continues\n\nWatch: Japan vies to be 'number one again through web3 innovation' | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9sZWdlbmRhcnktaW52ZXN0b3ItbWljaGFlbC1zYXlsb3Itc3BlYWstMTMwMzAwNzc3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Legendary Investor Michael Saylor to Speak at Europe's Largest Bitcoin Conference BTC Prague - Yahoo Finance",
        "content": "\n\n\n\nPrague, Czech Republic, May 24, 2023 (GLOBE NEWSWIRE) -- Over 80 exhibiting companies, 130 speakers from all over the world, including one of the most famous figures of the Bitcoin world, Michael J. Saylor, three days of lectures, workshops, and 10 thousand visitors. At the beginning of June, Prague will host the first edition of BTC Prague, the largest and most important event in Europe focused solely on the most popular cryptocurrency, Bitcoin.\n\n\n\nMichael J. Saylor is among the most influential Bitcoin maximalists and key figures in the crypto world. American Michael J. Saylor founded the company MicroStrategy, which regularly buys Bitcoins as part of its corporate assets and with 132,000 Bitcoins, the richest cryptocurrency company in the world, and will now speak in Europe for the first time. This will happen during the BTC Prague conference, the Bitcoin event of the year, which will take place from June 8th to 10th at the PVA Letňany exhibition center in Prague.\n\n\"Michael has an excellent reputation and strong and consistent views that carry significant weight in the Bitcoin community, and he is also a person who opened the doors to Bitcoin adoption by traditional companies. That is why I am glad that we managed to persuade him to speak for the first time in Europe at our event,\" says Martin Kuchař, one of the organizers of BTC Prague. \"With an estimated attendance of 10,000, a conference that is unrivaled, not just in the Czech Republic, but also across Europe.\"\n\nIn addition to Saylor, a number of other influential personalities in the Bitcoin world, including Blockstream CEO Dr. Adam Back, SatoshiLabs co-founder Marek Palatinus, and Robert Breedlove, author of the popular \"What is Money?\" podcast, have accepted invitations to Europe’s largest exclusively Bitcoin-focused conference. The bi-lingual Czech-English program promises to offer a wealth of stimulating ideas for entrepreneurs, researchers, influencers, philosophers, developers, and advocates of freedom g throughout the course of the three-day event.\n\nStory continues\n\nRunning parallel to the program on stage, the expo will also take place, showcasing over 100 companies focused on building Bitcoin infrastructure. These include providers of hardware and software wallets, mining tools, exchanges, or even beer taps connected to the Lightning Network. Among the exhibitors, there will be one exclusive guest - El Salvador. The Central American country, which made history two years ago as the first in the world to make Bitcoin the official national currency, is sending a government delegation to Prague to share their experience and review the implications of their groundbreaking decision at the crypto event of the year.\n\nThe BTC Prague organizers aim to appeal not only to seasoned Bitcoin enthusiasts but also to those who have some knowledge of Bitcoin yet are not fully immersed in it. Their ambition is to guide these individuals through the entire Bitcoin journey.\n\n\"In the current complex economic situation, when we all feel the effects of inflation, uncertainties surrounding the stability of banks or high-interest rates, Bitcoin is proving to be a kind of lifeboat. It is certainly riskier today not to have it than to have it. Therefore, we want to focus heavily on newcomers, to make it easier for them to enter the Bitcoin world and practically show them how to do it,\" says Martin Kuchař.\n\nMartin, a significant figure in the domestic Bitcoin scene, along with his brother Matyas, has been instrumental in organizing four successful annual Bitcoin events known as ChainCamp. These events attract over 2,000 enthusiasts each year in Ostrava. Moving to Prague and significantly expanding the scale of the entire event is a logical culmination of both brothers' journey or rather the growing popularity of Bitcoin.\n\nThe fact that the largest and most significant Bitcoin conference will take place in Prague is symbolic, as Martin Kuchar says, the Czech Republic is the \"Bitcoin Valley\" of the crypto world and Prague could boldly be called the world capital of Bitcoin because of a number of revolutionary projects that played a key role in the adoption of the world's largest cryptocurrency was created in the Czech Republic. We can name, for example, the hardware wallet Trezor from SatoshiLabs or the first mining pool from Braiins, or Bitcoin ATMs from General Bytes. \"I see BTC Prague as another Czech project that confirms the importance of the Czech Republic for Bitcoin,\" adds Martin Kuchar.\n\nCONTACT: Alnura Belyalova Director of PR, Luna PR alnura@lunapr.io\n\n\n\n"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvcmVndWxhdGlvbi9jcm9hdGlhbi1iaXRjb2luLWZpcm0tY29sbGFwc2VzLXdpdGgtNzVtLWluLWxvc3Nlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Croatian Bitcoin firm crashes with millions in losses and a police probe - DLNews",
        "content": "Bitlucky shutters after ‘series of bad trades and decisions’\n\nFirm reportedly offered 5 to 25% in monthly returns\n\nA Croatian cryptocurrency investment firm called Bitlucky has proved anything but as police opened an investigation into its collapse amid the loss of an estimated $15 million in assets, according to local media reports.\n\nEarlier this week, Croatian news outlets reported that Luka Burazer, the company’s director, sent an email to the firm’s 700 or so clients disclosing a series of missteps.\n\nBad trades\n\n“Dear clients, unfortunately, with a series of bad trades and decisions, I brought the state of the company into a crisis situation,” Burazer said, according to media reports. “We will have more information in the coming days. We are available by phone.”\n\nInvestors in Bitcoin and other cryptocurrencies in the Balkan nation are buzzing that there may be more to Bitcluky’s demise than “bad trades”. The firm was reputed to have offered monthly returns of 5 to 25%, local media reported.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nNOW READ: Tornado Cash developer’s trial pushed to next year as ‘worried’ tech contributors seek clarity\n\nNow Bitlucky, which billed itself as “your window into the blockchain world,” is kaput. And Croatian police officials told DL News they are probing the five-year-old company after fielding complaints from customers.\n\nThe firm apparently helped clients invest in Bitcoin and other tokens. On its website, the firm described itself as “an intermediary” providing “advisory and education services” and promised a “safe and secure entry” to the crypto market.\n\nRepresentatives of Bitlucky did not respond to a request for comment.\n\nJoin the community to get our latest stories and updates\n\nUnrealistic promises\n\nBitlucky appears to be an outlier in Croatia’s burgeoning crypto scene. In a press release, the Croatian Association for Blockchain and Cryptocurrencies said Bitlucky was not a member and “the director,” an apparent reference to Burazer, did not participate in the group’s round tables and conferences.\n\nAs investors digested the news, members of a Discord group for the crypto community in the Balkans grumbled that Bitlucky made unrealistic promises of profit from crypto trading.\n\n“It lasted longer than expected,” said one investor.\n\nCorrection: A previous version of this story reported Bitlucky lost an estimated $75 million and cited a Croatian media site called Kriptovijesti as the source of the information. The site and another Croatian publication, Novi List, report the loss was an estimated $15 million. DL News has amended the story to reflect the lower figure.\n\nHave tips on crypto trading? Contact the author at ana@dlnews.com."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDUvMjQvYml0Y29pbi1waXp6YS1kYXktbGVhZHMtdG8tcGl6emEtdGhlbWVkLWNyeXB0by1zY2Ftcy_SAV9odHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA1LzI0L2JpdGNvaW4tcGl6emEtZGF5LWxlYWRzLXRvLXBpenphLXRoZW1lZC1jcnlwdG8tc2NhbXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Scammers net 6 figures on Bitcoin Pizza Day - Fortune",
        "content": "Bitcoin Pizza Day was supposed to be a celebration of crypto utility, but instead it was dampened by a flurry of new pizza-themed memecoins that swindled thousands of dollars from investors.\n\nEvery May 22, many crypto and Bitcoin faithful celebrate the anniversary of when, in 2010, a computer developer named Laszlo Hanyecz bought two pizzas for 10,000 Bitcoin, a sum now worth more than $260 million.\n\nWhile many crypto users (and some company executives) this year celebrated and shared jokes on Crypto Twitter, others ginned up memecoins that accumulated hundreds of thousands of dollars in market capitalization before rugging investors.\n\n#Bitcoin Pizza Day – CZ giving tips on making the best #BinancePizza pic.twitter.com/yMEMyzV1dG — Richard Teng (@_RichardTeng) May 22, 2023\n\nIn total, four tokens—BTCPizza, BPizza, PizzaDay, and EthPizza—that all were created within the past three days have accumulated more than $300,000 in market cap, according to Dextools. It’s possible there were more.\n\nThe team or person behind BPizza, the new memecoin with the second-largest investment total, quickly changed its sell tax, to 100%, meaning it would be unfeasible for investors to sell it. Meanwhile, EthPizza turned off transfers and sales for the token shortly after accumulating a market cap of $38,000.\n\nThe coin with the highest market cap, BTCPizza, was still trading as of Wednesday afternoon at a market cap of nearly $200,000. The token’s price was down 16% from its high on Tuesday.\n\nMemecoins are highly volatile and are backed by nothing but hype. They have no practical use and quite often are scams for unsuspecting investors seeking the next big thing.\n\nOne of the latest, and perhaps most surprising memecoin moons, came from Pepe coin, which quickly peaked at market cap of $1.6 billion before plummeting. The coin still had a market cap of more than $250 million on Wednesday, according to CoinMarketCap."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jZW50cmFsLWFmcmljYW4tcmVwdWJsaWMtZ2V0cy1pbWYtb3B0aW1pc20tYS15ZWFyLWludG8tYml0Y29pbi1hZG9wdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "IMF optimism in Central African Republic, despite Bitcoin adoption - Cointelegraph",
        "content": "The Central African Republic (CAR) has received optimism from the International Monetary Fund (IMF) one year since it adopted Bitcoin (BTC). The IMF’s positive outlook reflects the country’s economic prospects and the impact of embracing the leading cryptocurrency.\n\nThe IMF published a report expressing a more positive view of the country’s economic prospects for 2023. The report indicates a projected rebound in real gross domestic product (GDP) growth to 2.2%, attributed to factors such as the base effect and policy adjustments leading to enhanced fuel supply. The IMF also anticipates an average inflation rate of 6.3% for 2023.\n\nAccording to the IMF document, the projected public debt of the CAR is expected to remain sustainable. However, the report highlights the presence of significant liquidity risks, as indicated by relevant debt indicators. These risks arise from potential shortfalls in donor support and challenges in accessing domestic and regional markets.\n\nThe CAR made history by becoming the second country in the world, after El Salvador, to adopt Bitcoin as a legal tender. Despite being one of the poorest nations in the world, the CAR is harnessing the potential of Bitcoin to reshape its financial infrastructure and boost its economic prospects.\n\nFollowing the approval of Bitcoin as legal tender in CAR, the government wasted no time in laying the groundwork for digital currency integration. CAR President, Faustin-Archange Touadera, revealed the initiative called Sango Project, marking the country’s entry into the world of cryptocurrencies.\n\nRelated: IMF sees room for eNaira improvement in first-year assessment\n\nIn December 2022, the CAR announced a delay in the listing of Sango Coin on crypto exchanges. The decision was attributed to prevailing market conditions and marketing considerations. On March 31, the organization behind Sango Coin announced further delays “just for a few weeks,” citing legal and regulatory obstacles.\n\nIn January 2023, the Sango Project revealed that a government task force is actively working on legal amendments to enable the smooth integration of the cryptocurrency.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RlY3J5cHQuY28vMTQyMDYxL21pbGxpb25zLXdvcnRoLW9mLWJpdGNvaW4tYW5kLXRldGhlci11c2VkLXRvLXBheS1jaGluZXNlLWNvbXBhbmllcy1pbnZvbHZlZC1pbi1mZW50YW55bC1jcmlzaXMtc2F5cy1lbGxpcHRpY9IBjAFodHRwczovL2RlY3J5cHQuY28vMTQyMDYxL21pbGxpb25zLXdvcnRoLW9mLWJpdGNvaW4tYW5kLXRldGhlci11c2VkLXRvLXBheS1jaGluZXNlLWNvbXBhbmllcy1pbnZvbHZlZC1pbi1mZW50YW55bC1jcmlzaXMtc2F5cy1lbGxpcHRpYz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Millions Worth of Bitcoin and Tether Used to Pay Chinese Companies Involved in Fentanyl Crisis, Says Elliptic - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nChinese businesses selling the chemicals used to make Fentanyl are accepting payment in Bitcoin and Tether, according to an investigative research report published Tuesday by Elliptic.\n\nThe blockchain analytics firm specializes in risk management and regulatory compliance. It said an overwhelming majority of pharmaceutical chemical companies it contacted in China that can ship precursors for fentanyl overseas accept cryptocurrencies as a form of payment.\n\nElliptic found that most of the chemical suppliers it identified used accounts at “three specific exchanges” based outside of China, which were unnamed in the report. The analytics firm said it had notified the exchanges being used by China-based drug suppliers, highlighting hundreds of wallets that had received more than $27 million worth of crypto assets.\n\nAD\n\nAD\n\nElliptic did not immediately respond to requests for comment from Decrypt.\n\nFentanyl, a synthetic opioid that’s cheap to produce and vastly more potent than heroin, has been linked to thousands of drug overdose deaths in the United States each year. In 2021, of the U.S.’s more than 106,000 drug overdose deaths, synthetic opioids were involved in around 70,600, according to research from the National Institutes of Health.\n\nFentanyl overdoses are also the leading cause of death among Americans aged 18 to 45 years old, Elliptic noted.\n\nThe analytics firm identified more than 80 China-based firms that offered to ship fentanyl precursors abroad in exchange for cryptocurrencies. One supplier told Elliptic that cryptocurrency was a popular payment method among its Mexico-based customers.\n\n“They always use USDT or Bitcoin to pay,” Elliptic was told by the supplier, who referenced the stablecoin Tether by its ticker name. “It is no problem.”\n\nAD\n\nAD\n\nElliptic’s team of researchers encountered multiple suppliers that said they shipped fentanyl precursors and the drug itself to Mexico, where drug cartels can then traffic the drug into the U.S.\n\nThe analytics firm said it may be surprising to see China-based firms leveraging crypto exchange accounts. In 2019, China said it would begin restricting residents’ access to international exchanges as part of the country’s crypto crackdown.\n\nThat same year, the White House released a report that linked fentanyl trafficking to cryptocurrencies including Bitcoin, Ethereum, and Monero—the so-called “privacy coin” that’s become popular on dark web marketplaces.\n\nThe Trump administration’s report claimed that cryptocurrencies are the “predominant funding mechanisms associated with fentanyl trafficking.”"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1eXMtdGhlLXJ1bW9yLW9uLXVzLWRlYnQtY2VpbGluZy1hcy1idGMtcHJpY2UtbmVhcnMtMjctNWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin 'buys the rumor' on US debt ceiling as BTC price nears $27.5K - Cointelegraph",
        "content": "Bitcoin (BTC) staged a classic range comeback on May 23 as markets “bought” hopes that the United States had resolved the debt ceiling debacle.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\n$30,000 back on the cards\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it headed toward $27,500 on Bitstamp overnight.\n\nStill stuck in a familiar trading corridor, the pair nonetheless showed signs of life as news hit that the Biden administration had potentially resolved the debt crisis.\n\nThis turned out to be premature, but Bitcoin stayed higher on the day, as market participants hoped that bulls could follow through.\n\nPopular trader Skew eyed various trend lines, including hourly and daily exponential moving averages (EMAs), for cues as to short-term moves.\n\n“Successful bounce from weekly open reclaim into the bounds of 4H EMAs & 1D EMAs,” part of a Twitter update stated.\n\n“Looking forward would expect real positioning to shift & show up today. Hold both EMA trends = resolution towards $30K + Failure = price pulls back towards 200W MA again.”\n\nBTC/USD annotated chart. Source: Skew/Twitter\n\nInvestigating the Binance BTC/USD order book, monitoring resource Material Indicators suggested that markets had “bought the rumor” when it came to debt ceiling news.\n\n#FireCharts show that moment the market bought the rumor that @POTUS and @SpeakerMcCarthy are going to reach a deal on the #DebtCeiling #BTC pic.twitter.com/dulYZI4HTI — Material Indicators (@MI_Algos) May 23, 2023\n\nA subsequent tweet revealed that two of its proprietary trading tools had converged to deliver long signals.\n\n“Confluence between the algos has historically been a very strong signal with a high probability of validating at the candle close,” part of an accompanying commentary added.\n\nMuted response to Hong Kong crypto greenlight\n\nA cooler reaction, meanwhile, came as Hong Kong announced the return of retail crypto trading.\n\nRelated: 2 more rate hikes? Bitcoin analyst counts down to ‘huge’ volatility\n\nExchanges would be able to apply for a license as soon as June 1, local regulator, the Hong Kong Securities and Futures Commission (SFC), confirmed.\n\n“Providing clear regulatory expectations is the key to fostering responsible development,” SFC CEO Julia Leung commented in a press release.\n\n“Hong Kong’s comprehensive virtual assets regulatory framework follows the principle of ‘same business, same risks, same rules’ and aims to provide robust investor protection and manage key risks. This will enable the industry to develop sustainably and support innovation.”\n\nWhile Cointelegraph noted that the move did not mean that Hong Kong would offer a “carte blanche” environment for crypto trading, cautious optimism from within the industry was palpable.\n\nHong Kong opening up the gates.\n\n\n\nLet's see how other markets respond. https://t.co/4gGRT2A8sG — Philip Swift (@PositiveCrypto) May 23, 2023\n\n“Many may not know it, but Hong Kong is one of the top 10 wealthiest cities in the world. I think we’ll see a lot of green candles this summer,” popular trader Moustache added on the day.\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hbi1leHBhbmRpbmctYnJjLTIwLWV4Y2hhbmdlLWZ1ZWxzLWRlZmktYm9vbS1vbi1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "An expanding BRC-20 exchange fuels DeFi boom on Bitcoin - Cointelegraph",
        "content": "Bitcoin’s recent Taproot upgrade birthed a new protocol known as Taproot Ordinals. This innovation now allows users to mint BRC-20 tokens on Bitcoin. While these tokens are still somewhat under the radar, their impact is increasingly evident in Bitcoin transaction numbers. The growing demand has put a strain on Bitcoin, resulting in higher transaction fees. For investors wanting BRC-20 tokens, availability is a key concern.\n\nMultiple projects are rising to tackle these challenges, including a decentralized finance (DeFi) platform called ALEX.\n\nFostering DeFi growth\n\nIn April 2021, entrepreneurs Dr. Chiente Hsu and Ms. Rachel Yu noted the rapid expansion of DeFi and the relative lack of mainstream adoption. To help DeFi mature, they decided to create ALEX, an automated liquidity exchange. Instead of building on Ethereum or another newer network, Hsu and Yu chose to build their DeFi solution on the Bitcoin blockchain. With their Wall Street backgrounds, entrepreneurs knew that trust was key in financial services, making Bitcoin the perfect choice.\n\nToday, as BRC-20 tokens become more popular, ALEX has introduced a new platform called B20 By ALEX. This platform is a decentralized exchange (DEX) built specifically for trading BRC-20 and all other upcoming Bitcoin L1 tokens. B20 promises an easy-to-use trading experience like centralized exchanges while also offering the security of Bitcoin’s base layer.\n\nUnifying liquidity\n\nB20 By ALEX is aiming to unite the currently fragmented liquidity of BRC-20 tokens. It processes transactions on a separate layer and then settles them all at once. This setup helps speed up trading on the DEX and reduces strain on the Bitcoin network.\n\nB20 offers features like stop-loss orders and lending and borrowing services. Price discovery is based on market participants’ bids and asks, and the order book offers a deeper look into market depth and sentiment.\n\nSource: ALEX\n\nALEX’s goal is to make Bitcoin as useful as Ethereum. The team believes that the future of DeFi is intertwined with Bitcoin, given its trusted and secure nature.\n\nA two-pronged solution\n\nThe BRC-20 market’s fast growth has put significant pressure on Bitcoin, leading to higher transaction fees and some negativity around the DeFi movement on Bitcoin. However, with its L2 infrastructure, B20 can help address these issues.\n\nBy processing transactions on a separate layer, then bundling and settling them on Bitcoin, B20 keeps transaction fees low and maintains scalability. This approach improves the trading experience and alleviates strain on Bitcoin.\n\nWith the launch of B20, ALEX is showcasing its commitment to becoming a significant player in the DeFi space. The co-founder and CEO of ALEX, Chiente Hsu, shared her ambitious vision:\n\n“We’re looking at the bigger picture. We believe DeFi can eliminate the need for centralized entities. As the world’s wealth becomes tokenized, Bitcoin’s security and the innovative tools we’re building will become invaluable.”\n\nALEX has also launched an AMM DEX, and it offers services like yield farming, staking, and an IDO launchpad, all of which are integrated with Bitcoin.\n\nSource: ALEX\n\nLearn more about ALEX"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRpcHMtNS10by1rZXktc3VwcG9ydC1pbi1tb21lbnQtb2YtdHJ1dGgtZm9yLWNyeXB0by1tYXJrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Bitcoin dips 5% to key support in 'moment of truth' for crypto market - Cointelegraph",
        "content": "Bitcoin (BTC) fell sharply after the May 24 Wall Street open as a “long awaited retest” of key trend lines materialized.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nBitcoin abandons uptick to retest moving averages\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting $26,154 on Bitstamp — its lowest since May 12.\n\nThe latest action was a world away from just the day prior, when upside formed the main story for the market and Bitcoin was aiming for $27,500.\n\nRangebound volatility was thus the name of the game on the day, while traders eyed key levels for bulls to protect going forward.\n\nThese came in the form of the 100-day and 200-week moving averages (MAs), both already a topic of conversation in recent weeks.\n\n“We are getting a long awaited retest of the 200-Week Moving Average. IMO, this is the MOST important level for BTC bulls to hold,” monitoring resource Material Indicators summarized to Twitter followers.\n\nBTC/USD 1-day candle chart on Bitstamp with 100-day, 200-week MA. Source: TradingView\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, further noted the 200-week MA and exponential MA coming into play for the total cryptocurrency market capitalization.\n\nThis he described as a “moment of truth” for the chart.\n\nTotal market capitalization for #Crypto is getting into the areas of the 200-Week MA and EMA.\n\n\n\nMoment of truth is coming up.\n\n\n\nBreaking beneath, and some additional harm will be there. pic.twitter.com/g1HW05Pmgb — Michaël van de Poppe (@CryptoMichNL) May 24, 2023\n\nPopular trader Daan Crypto Trades, meanwhile, eyed long positions returning to the market at the lows just hours after the downside began. Longs “buying the dip” had been a characteristic feature of recent local lows.\n\n“Bybit Open Interest already almost back to where it was before this long squeeze. Seems like quite a lot of longs instantly re-entering,” he commented.\n\nDebt ceiling woes mount\n\nUnited States equities also lost at the open amid concerns over markets’ reaction to the Biden administration’s debt ceiling stalemate.\n\nRelated: $160K at next halving? Model counts down to new Bitcoin all-time high\n\nFor trading platform QCP Capital, now was the time for caution for Bitcoin bulls.\n\nBTC/USD “holding up” — acting in a tight range — despite the uncertainty increased the chances of a catch-up correction, it warned in a market update on the day. The ultimate result, however, would depend on the resolution of the debt ceiling problem.\n\n“Although our medium-term bias is for higher BTC, on a deal scenario — we think BTC could quickly sync back with what other macro markets are implying,” it summarized.\n\n“On a ‘no-deal’ scenario however, we will easily take out the year’s highs.”\n\nS&P 500 (SPX) 1-hour candle chart. Source: TradingView\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8yNS9mYWhyZW5oZWl0LXdpbnMtYmlkLXRvLWFjcXVpcmUtYXNzZXRzLW9mLWluc29sdmVudC1jcnlwdG8tbGVuZGVyLWNlbHNpdXMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA1LzI1L2ZhaHJlbmhlaXQtd2lucy1iaWQtdG8tYWNxdWlyZS1hc3NldHMtb2YtaW5zb2x2ZW50LWNyeXB0by1sZW5kZXItY2Vsc2l1cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Fahrenheit Wins Bid to Acquire Assets of Insolvent Crypto Lender Celsius - CoinDesk",
        "content": "The bid, though accepted by Celsius and a committee of its creditors, must still be approved by regulators to finalize the acquisition. Months ago, Bankruptcy Court Judge Martin Glenn warned “regulatory roadblocks” could plague the sale of Celsius much like it thwarted a fellow lender’s acquisition. In April, crypto exchange Binance.US abruptly terminated its purchase of bankrupt crypto lender Voyager’s $1 billion in assets after federal officials appealed the sale, citing the \"hostile and uncertain regulatory climate\" in the U.S."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vbGlnaHRuaW5nLW5ldHdvcmvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "How the Lightning Network could solve Bitcoin's speed and scale conundrums - OKX",
        "content": "The emergence of ordinals and BRC-20 tokens sparked a lively debate within the Bitcoin community. On the one hand, enthusiasts celebrated the newfound potential these innovations bring to the Bitcoin blockchain. On the other hand, concerns have been raised about the rise in gas fees, longer transaction times, and the potential occupation of valuable block space by ordinals and BRC-20 tokens.\n\nMost BRC-20 tokens use ordinal inscriptions of JavaScript Object Notation (JSON) data to create, deploy, and transfer tokens. However, this method is criticized by developers for being far more expensive in transaction fees compared to using binary.\n\nBitcoin has encountered concerns like this before, particularly regarding scalability. For example, in the past, transactions on the Bitcoin network could take a few minutes to several hours to finalize, not to mention the high gas fees encountered.\n\nThe good news is, Lightning Labs recently released its rebranded version of Taro, now called the Taproot Asset Protocol, which aims to help alleviate network congestion, lower gas fees, and bridge BRC-20 to another advancement that's helping solve some of Bitcoin's challenges: the Lightning Network.\n\nIn 2018, the Lightning Network, a layer 2 payment protocol layered on top of Bitcoin, launched to make transactions faster, cheaper, and more efficient.\n\nOKX is one of the major exchanges to embrace the Lightning Network, integrating it seamlessly into our platform. This forward-thinking move enables our users to enjoy lightning-fast deposits and withdrawals, making transactions smoother and more efficient.\n\nWill, from our Product Marketing team, has put together a video tutorial on how you can deposit and withdraw Bitcoin using the Lightning Network with OKX. Let's find out more about it.\n\nWhat is the Lightning Network?\n\nThe Lightning Network is an innovative payment protocol designed to supercharge your transactions. When you make a transaction with the Bitcoin blockchain, it needs to be recorded by the entire network, which takes time. The Lightning Network allows users to create private payment channels directly between themselves, bypassing the need for every transaction to be broadcast on the entire network and therefore saving time.\n\nFor example, let's say you want to send some Bitcoin to a friend. Both of you hop on the Lightning Network and open a private channel. Once the channel is open, both of you can conduct an unlimited number of transactions with each other without needing to record each transaction on the blockchain.\n\nThese off-chain transactions are only known between yourself and your friend involved in the channel, providing privacy and reducing the load on the main blockchain. The Lightning Network uses smart contracts to establish trust between yourself and those you invite to your private channel to make sure of proper funds settlement.\n\nIt allows for instant payments and increased scalability since transactions can be processed within the payment channel without needing confirmation from the entire Bitcoin network. This dramatically reduces transaction fees and improves the overall speed and efficiency of the Bitcoin network.\n\nDepending on network congestion on the Bitcoin blockchain, you may be paying more in gas fees than what you're trying to send to your friend. The Lightning Network is also a tangible solution for Bitcoin micropayments.\n\nThe Lightning Network, as previously mentioned, operates as a layer 2 solution that seamlessly integrates with the existing Bitcoin infrastructure. Instead of modifying the fundamental Bitcoin protocol, it establishes an extra layer that works in parallel with it.\n\nIt's important to flag that Lightning Network and Lightning Labs are distinct entities. While both are related to Lightning technology, they serve different purposes. The Lightning Network refers to the decentralized payment protocol itself. Meanwhile, Lightning Labs is responsible for maintaining the Lightning Network and developing the network’s technology. The Lightning Network developers created LDN, an implementation of the Lightning Network protocol. It serves as a software framework that allows developers and users to interact with the Lightning Network. And, they're the developers behind the Taproot Assets Protocol.\n\nLightning Labs is also behind the @Lightning Twitter account, not the Lightning Network protocol.\n\nLightning Labs Taproot Assets Protocol\n\nLightning Labs recently announced the Taproot Assets Protocol, which aims to provide a more efficient method for users to create new assets on the Bitcoin blockchain. In addition, by operating \"maximally off-chain,\" the protocol seeks to avoid network congestion, a persistent issue on the Bitcoin network since the introduction of the BRC-20 token standard by anonymous developer \"Domo\" on March 8, 2023.\n\nWith the Taproot Assets Protocol, users can seamlessly integrate BRC-20 assets into the Lightning Network. This means that wallets, exchanges, and merchants can simply be ported over instead of starting a new ecosystem from scratch, streamlining the process for everyone involved. This development holds great promise for enhancing the usability and scalability of the Bitcoin network.\n\nWhere has the Lightning Network been integrated?\n\nThe Lightning Network continues to grow in both functionality and adoption, with various major players in crypto and beyond now integrating the technology. OKX and Binance both offer users the option to process BTC payments via the Lightning Network, providing unprecedented speed when completing transactions.\n\nCoinbase is also reportedly looking to add the Lightning Network to its platform for BTC payments. Meanwhile, Kraken, Bitfinex, River Financial, and CoinCorner have also integrated the network with their respective platforms. Meanwhile, July 2023 saw Lightning Labs announce a new suite of developer tools that integrate Bitcoin with artificial intelligence and Large Language Models such as ChatGPT. Now, these technologies can hold, receive, and send Bitcoin via the Lightning Network, as well as on-chain.\n\nAlso in 2023, Google Cloud partnered with Lightning-as-a-Service provider Voltage to increase its hosting capacity and expand Voltage’s global reach. The partnership allows Voltage users to create Bitcoin Lightning nodes anywhere in the world through Google Cloud, providing cheaper and ultra-fast payment processing compared to alternative options. As the core of Voltage's client base place payment processing at the center of their business, the Google Cloud collaboration could help boost network activity and guide more players towards the Lightning Network.\n\nThese developments and partnerships underline the versatility and wider potential for the Lightning Network beyond its core applications, signaling that further growth for the network could lie ahead.\n\nThe benefits of the Lightning Network\n\nThe Lightning Network has gained significant attention, especially around the hype of BRC-20 and ordinals, by providing users with speedy transactions and low gas fees. The benefits go well beyond this.\n\nSpeed: Lightning Network transactions are confirmed within seconds, significantly faster than Bitcoin blockchain transactions.\n\nCost: Lightning Network transactions are generally more cost-effective than Bitcoin blockchain transactions.\n\nPrivacy: Lightning Network transactions offer enhanced privacy compared to Bitcoin blockchain transactions.\n\nThe Limitations of the Lightning Network\n\nWhile the Lightning Network has a dedicated team of developers and enthusiasts behind it, it imposes some limitations you should know of. And, it's important to do your own research before participating in a protocol.\n\nLiquidity: One core challenge of the Lightning Network is receiving liquidity. Currently, users can't receive funds over the network until they’ve received funding liquidity from another user’s node.\n\nChannel capacity: The Lightning Network's payment channels have a maximum fund capacity, limiting the size of transactions within each channel.\n\nNetwork routing: As the Lightning Network expands, finding efficient routes between participants for transactions becomes increasingly complex, potentially resulting in slower or failed transactions.\n\nSecurity: The Lightning Network has some security concerns, such as the risk of fund theft if hackers compromise a user's node.\n\nFinal thoughts\n\nThe Lightning Network is indeed a promising technology that holds the potential to enhance the usefulness and accessibility of Bitcoin. While it's constantly being developed, it addresses the need for faster and more cost-effective transactions.\n\nHowever, like any evolving technology, the network has limitations requiring attention and resolution before widespread adoption can be seen. Nevertheless, as further advancements and refinements are made, the Lightning Network will continue to bring us closer to a more efficient and scalable blockchain ecosystem.\n\nDisclaimer\n\nTHIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNS8yNC8yNjc1MDY0LzAvZW4vRW5lcmd5LVdlYi1MYXVuY2hlcy1DZXJ0aWZpY2F0aW9uLWZvci1TdXN0YWluYWJsZS1CaXRjb2luLU1pbmluZy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Energy Web Launches Certification for Sustainable Bitcoin Mining - GlobeNewswire",
        "content": "ZUG, Switzerland, May 24, 2023 (GLOBE NEWSWIRE) -- Energy Web, an independent non-profit that develops open-source software for clean energy solutions, today announced the launch of Green Proofs for Bitcoin (GP4BTC), a first-of-its kind initiative to establish an independent, standardized energy measurement system for the Bitcoin mining industry.\n\n\n\nGP4BTC will provide transparency into the decarbonization efforts of Bitcoin miners and hosting companies, supporting the industry on its journey to net-zero. As part of the solution, certifications will be issued to Bitcoin miners based on their clean energy use and contributions to grid stability via demand response. By delivering verifiable metrics that are consistent across companies and geographies, GP4BTC will provide recognition and reputational benefit for companies mining sustainably, as well as improved access to institutional finance and other returns on their investments into sustainability practices.\n\nSpeaking on the launch of the certification initiative, Amy Westervelt, Senior Delivery Lead and head of the GP4BTC initiative at Energy Web, said “Today Bitcoin is scrutinized for its electricity consumption and associated climate impact. While leading miners are pursuing strategies to reduce their carbon footprints, the industry lacks a unifying definition of sustainable mining, as well as a shared framework for assessing and verifying miners’ sustainability practices. Green Proofs for Bitcoin seeks to provide this.”\n\nLaunched with five certified miners, the GP4BTC certification platform and registry assesses miners via a Clean Energy Score and a Grid Impact Score, each of which are calculated based on operational information including location and energy consumption data. Together, these scores reflect miners’ procurement of renewable electricity, siting operations in regions with low grid carbon intensity, and their contributions to grid stability through demand flexibility.\n\nDeveloped in partnership with over 35 miners, NGOs, grid operators, and other energy and crypto market participants, this approach to scoring is aligned with best practices for sustainability leadership in other industries, and to approaches to corporate ESG reporting in the financial sector and beyond.\n\n“Until now, efforts to standardize clean energy procurement practices and drive collective action across the Bitcoin mining sector have been siloed and inconsistent,” added Westervelt. “While other electricity-intensive industries have benefited from custom decarbonization roadmaps, Bitcoin has largely been ignored, creating a negative feedback loop where climate-conscious miners are left to forge their own paths. Our goal is to create a virtuous cycle where clean mining is easier to define, pursue, and monetize—so that it eventually becomes the status quo.”\n\nFor miners, GP4BTC offers a solution for miners to provide evidence of clean energy practices. Using Energy Web’s privacy-first Green Proofs technology, miners retain full ownership and control of their data. For Bitcoin users and institutions, GP4BTC provides a one-stop-shop for discovering and validating miners' sustainability credentials so they can make data-driven decisions regarding commercial strategy and policy.\n\nAt launch, certified miners and data centers include Argo Blockchain, Cowa, DMG Blockchain Solutions, Hive Blockchain Technologies, and Gryphon Digital Mining.\n\nDMG’s CEO, Sheldon Bennett, commented, “We are pleased to be included among the initial Green Proofs for Bitcoin miner participants. We believe Energy Web’s launch of Green Proofs for Bitcoin represents a real first step towards recognizing a broad swath of industry participants for powering their data center equipment utilizing primarily carbon neutral energy sources.”\n\n“This initiative will settle the basis for long term sustainability within the Bitcoin mining industry. We are proud to contribute to the growth of the ecosystem and to have the ability to certify our commitment towards sustainability,” said Fiorenzo Manganiello, co-founder of Cowa.\n\n“Decarbonization represents one of the main priorities for the sector, and by providing standardized and verifiable metrics, as well as acknowledging best practices with certifications, initiatives such as Energy Web’s Green Proofs for Bitcoin serve a fundamental role in driving industry standards. At Argo, sustainable mining has been at the core of our business model and growth strategy ever since our foundation. We are proud of our GP4BTC certification, and we look forward to contributing to the impact and success of this exciting initiative,” said Seif El-Bakly, Interim CEO at Argo Blockchain.\n\nPresident and CEO of Hive Blockchain Technologies Aydin Kilic commented, “In our commitment to be green energy focused—which has been our mandate since HIVE went public back in 2017 as the first publicly traded crypto miner—we are glad to see the industry embracing this strategy, and advocates like Energy Web helping to validate and certify the renewable aspects of crypto miners. This makes our industry stronger. We hope that the public, along with policy makers and utility companies, realize that a large contingent of crypto miners are utilizing renewable energy.”\n\nGryphon Digital Mining’s CEO Rob Chang urges the Bitcoin mining industry to start providing concrete evidence of sustainable mining practices. “We need to move past pandering press releases and start offering tangible, coordinated, third-party certifications that confirm clean energy use,” Chang emphasized. “We believe in GP4BTC’s mission and proudly announce that Gryphon is one of the first recipients of its certification. As Bitcoin mining continues to grow, it is critical to prioritize sustainable practices and hold the industry accountable for its impact on the environment.”\n\nEnergy Web is keen to work with any Bitcoin miner or other party interested in using Green Proofs for Bitcoin. Miners and data centers can learn more about the solution and apply for certification directly at www.GP4BTC.org or by contacting gp4btc@energyweb.org.\n\n\n\nAbout Energy Web\n\nEnergy Web is a global non-profit accelerating the clean energy transition by developing open-source technology solutions for energy systems. Our enterprise-grade solutions improve coordination across complex energy markets, unlocking the full potential of clean, distributed energy resources for businesses, grid operators, and customers. Our solutions for enterprise asset management, data exchange, and Green Proofs, our tool for registering and tracking low-carbon products, are underpinned by the Energy Web Chain, the world’s first public blockchain tailored to the energy sector. The Energy Web ecosystem comprises leading utilities, renewable energy developers, grid operators, corporate energy buyers, automotive, IoT, telecommunications leaders, and more. More information on Energy Web can be found at www.energyweb.org or follow us on Twitter @EnergyWebX\n\nMedia contact\n\nDaniyal Ajdadi\n\nEnergy Web\n\ndaniyal.ajdadi@energyweb.org"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMjQvbGVkZ2VyLXJlY292ZXItZmlhc2NvLWV4cG9zZXMtZ2FwLWJldHdlZW4tYmxvY2tjaGFpbi1pZGVhbHMtYW5kLXRlY2huaWNhbC1yZWFsaXR5L9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMjQvbGVkZ2VyLXJlY292ZXItZmlhc2NvLWV4cG9zZXMtZ2FwLWJldHdlZW4tYmxvY2tjaGFpbi1pZGVhbHMtYW5kLXRlY2huaWNhbC1yZWFsaXR5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ledger Recover Fiasco Exposes Gap Between Blockchain Ideals and Technical Reality - CoinDesk",
        "content": "Once the potential “backdoor” was revealed, outrage flooded Crypto Twitter, with posters panning Ledger for being out of touch with its own customer base – ostensibly self-sovereign types who want nothing but to be entirely in control of their own crypto. Ledger vehemently denied allegations that its capabilities amounted to a “backdoor.” But the company’s initial response to the outrage – pointing out (in a now-deleted tweet) that users were always trusting Ledger not to extract user keys – only served to fuel the furor: One widely-circulated video appeared to show a user smashing a Ledger device with a hammer and then blow-torching it into flames."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnR3ZWFrdG93bi5jb20vbmV3cy85MTU3My9iaXRjb2luLXByaWNlLWhpdHMtaXRzLWJvdHRvbS1hbmQtbmV3LWJ1bGwtcnVuLWhhcy1iZWd1bi1zYXlzLW1pY2hhZWwtc2F5bG9yL2luZGV4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin price hits its bottom and a new bull run has begun, says Michael Saylor - TweakTown",
        "content": "Big figures in the cryptocurrency industry are calling that Bitcoin has reached its bottom, and the world's biggest cryptocurrency is now rallying.\n\nOne of the biggest figures in the cryptocurrency space has said that Bitcoin, the world's most popular cryptocurrency, has said that Bitcoin has bottomed out and a new bull run has started.\n\n3\n\nMichael Saylor\n\nVIEW GALLERY - 3 IMAGES\n\nPopular Now: Scientists unveil PC breakthrough that gives 2x speed without hardware upgrades\n\nMichael Saylor, the co-founder and executive chairman of MicroStrategy, has become one of the few Bitcoin maximalists to publicly embrace Ordinals, a protocol that allows for arbitrary and non-financial information to be included on the Bitcoin blockchain. In an interview at the Bitcoin 2023 conference in Miami, Saylor discussed his views on Ordinals, its potential use cases, and the ongoing debates within the Bitcoin community.\n\nSaylor sees Ordinals as a positive development for Bitcoin, although he acknowledges that many of the early use cases are more speculative than serious. He stated, \"What if I was using them to tokenize all of the stocks and ETFs trading on NASDAQ so that individuals can take personal custody of their shares of stock instead of leaving them locked up with a centralized custodian? If it was presented that way, then Bitcoiners would love it.\"\n\n3\n\nAddressing concerns about potential unregistered securities, Saylor emphasized the importance of ethical and legal regulation. He said, \"If BRC-20 tokens are viewed as fungible tokens to issue unregistered securities, there's a lot of objection to that because it's unethical. It's illegal. And you can't blame [the community] for objecting to that.\" However, he believes that if BRC-20 tokens are issued and regulated in an ethical and legal manner, there should be no issue.\n\nSaylor also shared his perspective on the ongoing bull run of Bitcoin. He attributed the market's upward trajectory to factors such as Bitcoin's halving, increased adoption of the cryptocurrency, and a regulatory crackdown that benefits Bitcoin by weeding out competitors like Ethereum. He stated, \"You're going to see a consistent flow of capital flowing from the rest of the crypto ecosystem [into] bitcoin.\"\n\nMoreover, Saylor highlighted the recent proposed guidance on crypto accounting and reporting by the Financial Accounting Standards Board (FASB), which provides further clarity and transparency for companies that hold crypto assets on their balance sheets. He said, \"The FASB initiative to adopt fair value accounting is a very auspicious development.\"\n\nIn addition to Ordinals' growing activity on the Bitcoin network, Bitcoin's halving event, set to occur in April 2024, is expected to enhance scarcity and potentially drive the cryptocurrency's price higher. Saylor expressed confidence in Bitcoin's current state, stating, \"I think bitcoin's found the bottom. I think the leverage is out of it. I think we're on a bull run.\"\n\nSaylor's support for Ordinals comes at a time when transaction fees on Ethereum have soared, leading to discussions within the Bitcoin community about potential network attacks and the need for censorship. While Saylor acknowledges that Ordinals' early use cases may be seen as speculative, he believes in the importance of allowing the free market to function and for individuals to invest in what they believe in. He firmly stated, \"Do I think we should modify the protocol to censor certain types of transactions? My answer is no.\"\n\nSaylor's stance reflects his commitment to the principles of decentralization and freedom of choice within the Bitcoin ecosystem. As the Bitcoin community continues to debate the role of Ordinals and navigate regulatory challenges, Michael Saylor remains optimistic about Bitcoin's future and believes that market forces and free choice should guide the cryptocurrency's development."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvaG93LXdoYWxlLWFjdGl2aXR5LWZ1ZWxzLWJpdGNvaW4tY3ljbGVzLWEtMjAxNy12cy0yMDIzLWNvbXBhcmlzb24tMjAyMzA1MjQxNTMz0gGBAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2hvdy13aGFsZS1hY3Rpdml0eS1mdWVscy1iaXRjb2luLWN5Y2xlcy1hLTIwMTctdnMtMjAyMy1jb21wYXJpc29uLTIwMjMwNTI0MTUzMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "How whale activity fuels Bitcoin cycles: a 2017 vs. 2023 comparison - FXStreet",
        "content": "Share:\n\nBitcoin price rally in 2017 was largely driven by the ICO craze kicked off by Ethereum and a focus on altcoins.\n\nWhile the 2023 YTD price increase is driven by institutions and large wallet investors, the 2017 cycle was largely supported by retail traders.\n\nProfit rotation from altcoins drove a Bitcoin price rally in 2017, while DeFi-related assets take the center stage in 2023.\n\nBitcoin (BTC) price cycles are structured around halving events that occur once roughly every four years, when rewards to miners are cut in half. The next BTC halving is expected in early 2024, and evaluating the differences between the 2015 to 2017 and 2020 to 2023 Bitcoin cycles can help traders define their expectations and prepare for the bull run.\n\nAlso read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC to surprise investors with 10% sell-off\n\nComparing two Bitcoin price cycles and whale activity\n\nBitcoin’s massive price rally in its 2015 to 2017 cycle set a record. However, the 2020 to 2023 cycle, which sent BTC to an all-time high of $69,044, has different catalysts and players. Still, the two Bitcoin price cycles followed a similar trajectory: it started with a bullish catalyst that was followed by capital rotation into BTC and massive participation from key players in the ecosystem.\n\nThe two cycles, however, differed in terms of the role played by retail and institutional traders, as well as activity of large wallet investors, popularly known as whales, in the Bitcoin ecosystem.\n\nThe 2015 to 2017 Bitcoin price cycle is considered one of the most iconic ones and can be summarized as follows:\n\nInitial Coin Offering (ICO) spree initiated by Ethereum.\n\nAltcoins, shitcoins and everything in between.\n\nCapital rotation into Bitcoin.\n\nBitcoin price rally to $19,665 in mid-December 2017 was fueled by a massive participation of retail investors.\n\nBitcoin whales pushed BTC price to its 2017 cycle top\n\nBased on data from crypto intelligence tracker Santiment, there was a consistent rise in the number of large wallet addresses holding more than 1,000 BTC. At the beginning of 2015, there were 13,903 addresses holding between 100 and 1,000 Bitcoin, 1,438 addresses containing between 1,000 and 10,000 BTC and 90 wallets holding between 10,000 to 100,000 Bitcoin.\n\nAll three segments of large wallet investors on Bitcoin witnessed a consistent increase from 2015 to the 2017 cycle top, after which there was a notable decline. Bitcoin price is represented by the green line.\n\nBitcoin whale wallet address count through segments in the 2015 to 2017 cycle\n\nAs seen in the chart above, a large segment of retail traders accumulated BTC at a discount, before price started rallying in the second half of 2017.\n\nThe 2015 to 2017 Bitcoin cycle in a glimpse\n\nIn 2017, Bitcoin acted as a gateway for market participants to jump in on the Initial Coin Offering (ICO) craze, where traders exchanged BTC for altcoins and the popularly known shitcoins, currencies with little to no discernible purpose and low value. This fueled a massive spike in demand for Bitcoin and acted as a catalyst for its price rally.\n\nThe following chart from TradingView puts Bitcoin’s dominance into perspective and signals a massive decline after the 2017 bull run, at a moment when altcoins gained relevance and popularity. In the 2015 to 2017 cycle, capital rotated from altcoins to Bitcoin, giving the flagship cryptocurrency an edge over the others, but this changed at the cycle’s end.\n\nMarket Capitalization Bitcoin dominance %\n\nBitcoin’s dominance fell from nearly 100% at the beginning of 2015 to just over 96% in 2017.\n\nHow the 2020 to 2023 Bitcoin cycle is different\n\nThe 2020 to 2023 BTC price cycle kicked off in a similar fashion as previous cycles. In this case, the bullish catalyst was Decentralized Finance, or DeFi, instead of the ICO craze. . DeFi emerged as the biggest highlight of 2020, going from $700 million locked in contracts at the beginning of 2020 to as much as $15 billion by the end of that year.\n\nCompound was one of the largest DeFi players as it allowed traders to deposit crypto into lending pools that facilitated borrowing. Lenders, in turn, earned an interest on the assets they deposited, fueling the DeFi spree that lasted all summer, with several copy cats and similar protocols offering the service to market participants.\n\nA wave of food-themed DeFi tokens flooded the market, with SushiSwap (SUSHI), BurgerSwap (BURGER), Yam Finance (YAM), BakerySwap (BAKE), Pizza (PIZZA), Hotdog.Swap (HOTDOG), and Kimchi Finance (KIMCHI) taking the lead. Capital rotated from these assets to Bitcoin and BTC’s rally in the first half of the cycle was also driven largely by retail traders.\n\nLater, MicroStrategy’s incursion into Bitcoin started the era of mass institutional participation in crypto. Investment banks, funds and hedge funds turned to Bitcoin as an opportunity to amass returns for their clients. Tesla’s $1.5 billion Bitcoin purchase in 2021 contributed to the shift of traditional markets’ attention into the crypto ecosystem, leading to a rally in Bitcoin price that was fueled by a frenzy among large wallet investors and institutions.\n\nWhale transactions worth $1 million or higher, represented in blue, climbed steadily throughout 2020, hitting a peak in early 2021 and Q3 2021. This signals an increase in participation by large wallet investors on the Bitcoin network in the 2020-2023 cycle.\n\nWhale transaction count (valued at $100,000 or higher), represented by yellow bars, peaked in the months leading up to BTC’s run up to its peak of $69,044.71 in November 2021. The chart below focuses on the role of whales in Bitcoin price cycles and the critical role played in the 2021 bull run.\n\n\n\n\n\nBitcoin whale participation and activity\n\nWhales emerged as one of the dominant catalysts in Bitcoin’s price cycles. When BTC price hit its all-time high of $69,044.71, both segments of whale transactions climbed to their peaks, highlighting the importance of these participants in Bitcoin’s cycles.\n\nRising whale transaction count can therefore be considered a sign of an impending BTC price rally, based on data from the 2015 to 2017 and the 2020 to 2023 cycles. While Bitcoin price cycles do not repeat, and the catalysts which start them can change, there seems to be a common factor pushing the BTC price higher every time: whales."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5hdGlvbmFsb2JzZXJ2ZXIuY29tL3BvZGNhc3QvbWF4ZWQtb3V0L2JpdGNvaW4tb3ItYnVzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin or Bust | Canada's National Observer: Climate News - Canada's National Observer",
        "content": "In an era where all debate seems to be increasingly polarized, one man tries to have a reasonable conversation. Sometimes it works.\n\nMaxed Out is hosted by Canada’s National Observer’s lead columnist Max Fawcett. If you read his columns or follow him on Twitter, you’ll know Max has a take-no-prisoner approach when it comes to errors, lies and disinformation. But like so many people, Max is frustrated by the relentless partisanship and refusal to discuss things in good faith. In other words, he is maxed out. You probably are, too.\n\nIn this podcast, Max invites a new guest each week to debate — even contradict — him. This isn’t about picking fights. It’s about escaping our silos and re-learning the art of disagreeing, without being disagreeable. Maybe we’ll all find some new common ground we didn’t know was there.\n\nThis bimonthly podcast is part of Podcast Tuesdays at Canada’s National Observer."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdXBzdHJlYW0tZGF0YS1maWxlcy1sYXdzdWl0LWFnYWluc3QtY3J1c29lLWVuZXJneS1zeXN0ZW1zLWZvci1iaXRjb2luLW1pbmluZy1vcGVyYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Upstream Data Files Lawsuit Against Crusoe Energy Systems For Bitcoin Mining Operations - Nasdaq",
        "content": "Canadian Bitcoin mining corporation Upstream Data Inc. has filed a patent infringement lawsuit against Delaware limited liability company Crusoe Energy Systems LLC in the United States District Court for the District of Colorado.\n\nThe lawsuit alleges that Crusoe has infringed on Upstream's patent related to bitcoin mining technology used to convert stranded natural gas into bitcoin. According to the complaint, Upstream holds the patent for a system that powers a blockchain mine at remote oil well sites using stranded gas to generate electricity for cryptocurrency mining. According to the filing, the company has deployed over 350 bitcoin mining systems across the U.S. and Canada, addressing the issue of stranded gas venting and flaring.\n\nCrusoe, which manufactures and operates cryptocurrency mining systems connected to stranded natural gas sources, is accused of competing with Upstream by selling and operating similar systems. The complaint claims that Crusoe's \"Digital Flare Mitigation\" systems infringe on Upstream's patented technology. The lawsuit further alleges that Crusoe was aware of Upstream's patented technology during the development of its own products. The lawsuit filing highlights instances where Crusoe identified Upstream as a competitor in blog posts and claims made in patent applications.\n\nThe lawsuit seeks damages and injunctive relief against Crusoe for patent infringement. Upstream argues that Crusoe's actions have caused harm to its business by infringing on its patent rights and creating unfair competition in the market.\n\nThe case will be heard in the United States District Court for the District of Colorado, where Crusoe has regular and established places of business according to the filing. Also noted in the lawsuit is a complaint filed against a customer of Upstream in Crusoe Energy Systems LLC v. Alkane Midstream LLC, which the lawsuit says \"further confirm[s] Crusoe’s significant and substantial contacts with this district.\" Upstream asserts in the lawsuit that the court has jurisdiction over the case.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doZW4td2lsbC1iaXRjb2luLWJ0Yy1oaXQtMTAway1leHBlcnRzLXNheS10aGlzLW5ldy1jcnlwdG8td2lsbC1oaXQtaXQtZmFzdGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "When Will Bitcoin (BTC) Hit $100k? Experts Say This New Crypto Will Hit It Faster - Analytics Insight",
        "content": "The elusive $100k mark for Bitcoin (BTC) has kept investors on their toes, but there’s a fresh face in the crypto world that’s generating significant buzz and might just reach that milestone faster. Welcome to the world of Tradecurve (TCRV), a new cryptocurrency that’s currently in its presale phase and has experts predicting it will hit $100k before 2025.\n\nBitcoin (BTC) Price Prediction\n\nThe value of Bitcoin (BTC) has been a roller coaster ride for investors in 2023. Starting the year at $15.6K, Bitcoin (BTC) grew to $31K in less than four months. Currently, Bitcoin (BTC) is valued at around $27.4K after a recent dip. There are various predictions for where Bitcoin (BTC) might go in the future but a common one among experts is that it will reach $100k by 2027.\n\nThe most bullish Bitcoin (BTC) analysts believe that as more people lose trust in traditional banking, Bitcoin (BTC) will become a more reliable investment and surge to new highs during 2024. However, others believe that the current economic uncertainty will considerably slow down its growth.\n\nTo try and anticipate what will happen next in the short term, it’s recommended to watch certain two price levels: $25K and $31K. If Bitcoin (BTC) breaks through the $31K level, it will likely continue its uptrend to reach $50K within months.\n\nA drop below $25K will likely result in a significant price correction and could significantly delay the milestone of reaching $100K as investors lose confidence in the asset. It is clear that momentum is essential to reach the coveted six-figure mark.\n\nThe Crypto Set to Eclipse Bitcoin (BTC)\n\nNot all investors want to wait five years, however, and many are looking for ways to invest in cryptocurrencies that could appreciate faster than Bitcoin (BTC). The cryptocurrency on everybody’s lips is Tradecurve (TCRV).\n\nTradecurve is an all-encompassing trading platform that lets users trade digital currencies, stocks, commodities like gold, and even forex. This isn’t just a place for crypto enthusiasts — it’s a one-stop shop for traders.\n\nThe great thing about Tradecurve is that it doesn’t come with a complicated sign-up process. You just need an email address and a DeFi wallet, and you’re good to go — no need to jump through regulatory hoops or sign up for costly trading accounts.\n\nTradecurve isn’t just about the basics. It also equips users with high-tech tools to boost their trading game. For instance, there are automated trading tools that use artificial intelligence and deep data analysis to help maximize profits.\n\nThe TCRV token is at the heart of Tradecurve. Holders of these tokens get special perks, like the chance to earn passive income, and lower fees on their trades.\n\nThe Tradecurve development team has locked up the liquidity pool for two years and the team’s own tokens for three years. Plus, they’ve had their smart contracts thoroughly checked out by Cyber Scope to make sure everything’s as secure as possible.\n\nWith TCRV tokens currently in presale for just 12 cents, early investors could see a huge return on their investment if the token hits $100,000. Tradecurve’s innovative technology and its team of experienced professionals have given this token a chance to make history, with some experts predicting it may get there even sooner than Bitcoin (BTC).\n\nFor more information about TCRV presale tokens:\n\nWebsite: https://tradecurve.io/\n\nBuy presale: https://app.tradecurve.io/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nTelegram: https://t.me/tradecurve_official\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50Lzg4NjAyMjIzLTAwNGItNGUyNy1iOWViLWM0NWUxZjg1MGY5ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "UK crypto fraud losses jump 40% - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nUK losses to crypto fraud increased more than 40 per cent over the past year, surpassing £300mn for the first time, according to Britain’s fraud reporting agency.\n\nLaw firms said the data, provided by Action Fraud, reflected the scale of cyber crime and the high-profile collapse of crypto exchange FTX last year that triggered a wave of losses among retail investors.\n\nCryptocurrency scams are part of a wider “epidemic” of fraud, which accounted for more than 40 per cent of all reported crimes in England and Wales last year, according to the Office for National Statistics.\n\nLosses from crypto fraud increased 41 per cent year on year to £306mn in the 12 months to March 2023 compared with £216.5mn in the previous year, said law firm RPC, which collected the data from Action Fraud.\n\n“These numbers show both the impact of crypto fraud on UK investors and more specifically the colossal impact that the collapse of FTX had on UK retail investors,” said Dan Wyatt, partner at RPC.\n\nMore than a third of crypto fraud losses for the year, £115.7mn, occurred in November 2022, the month FTX filed for bankruptcy. The Bahamas-based business had been valued at $32bn less than a year earlier.\n\nJennifer Craven, fraud expert at law firm Pinsent Masons, said the figures reflected how widespread crypto crime had become.\n\n“[The figures] align with the sharp increase in English High Court actions commenced by victims of crypto fraud who are determined to recover their losses by civil remedial means,” she added.\n\nCryptocurrencies such as bitcoin are largely unregulated in the UK. In February, the Treasury set out draft proposals for the regulation of crypto assets, including new requirements on exchanges to ringfence customers’ money in the event of insolvency.\n\nMPs on the House of Commons’ Treasury select committee said last week that cryptocurrencies should be regulated in a similar way to the gambling sector, given it had “no intrinsic value, huge price volatility and no discernible social good”.\n\nRPC said the losses could also reflect the collapse of crypto-related Ponzi schemes that were unable to continue as the value of the cryptocurrencies they were based on cratered.\n\nThe value of bitcoin, the oldest cryptocurrency, fell as low as $15,700 on November 10, 2022, the day before FTX filed for bankruptcy, according to cryptocurrency site CoinGecko.\n\nThe currency is at present valued at $26,200 per bitcoin, down more than 60 per cent since its high of just over $69,000 in November 2021.\n\nIn the UK government’s national fraud strategy, a blueprint released earlier this month for how it will clamp down on financial crime, it pledged to ban cold calls on all financial and investment products.\n\nHowever, many companies said the strategy did not go far enough and called for online platforms, where many scams originate, to face further tougher rules."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2JpdGNvaW4tYW5kLWNyeXB0by1ndWlkZS9hLWJlZ2lubmVycy1ndWlkZS10by10aGUtZ3JhcGgtcHJvdG9jb2wtcGFydC0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "A Beginner's Guide to The Graph Protocol - Part 2 - Bitcoin & Crypto Guide - - Altcoin Buzz",
        "content": "The Graph makes it easy to access blockchain data without the involvement of third parties. It queries and organizes data from different blockchains. So developers can use this data to build APIs.\n\nWe recently published an introductory article to the Graph Protocol. This article takes a dive into the platform’s ecosystem and how to stake GRT.\n\nHave you seen The Graph’s brand new homepage yet? 👀 It's now easier than ever to visualize how The Graph works & discover how to get involved 💫 See it for yourself ⬇️ 🌐 https://t.co/3YVpq4Z343 pic.twitter.com/5ZNBf95eVE — The Graph (@graphprotocol) May 22, 2023\n\nIntroduction to the Graph’s Ecosystem\n\nThe Graph’s ecosystem is comprised of four roles: developers, indexers, delegators, and curators. So, indexers stake $GRT, the native Graph token, and are rewarded for accurately indexing subgraphs through query and index rewards. Then, delegators stake $GRT to indexers in exchange for a share of the indexer’s query fees. Curators indicate that a subgraph is of exceptional quality and should be indexed by the network.\n\nLet’s look deeper at these protocol roles:\n\nDelegators: This group of participants stakes their GRT tokens with the indexers and gets a part of the indexer query fees. Delegators are subject to a 0.5% tax on each delegation. Indexers: They provide indexing and querying services as node operators. In return, indexers receive rewards and earn query fees. However, they have to stake 100,000 GRT tokens. This token will be slashed if the indexers carry out practices deemed harmful to the network. Curators: This group helps identify the subgraphs the Graph Explorer needs to index and receives 10% of the query fees. Data consumers, community members, and subgraph developers who want to signal their subgraphs can serve as curators. However, they have to pay a deposit tax of 1% to curate. They’ll also receive lower fees if they curate subgraphs of low quality. In addition, they’ll pay a tax of about 0.5–1% if a subgraph fails. Developers: Developers fall on the demand side of the ecosystem. They create subgraphs and publish them to the Graph Network. Furthermore, developers query live subgraphs with GraphQL to power their applications.\n\n🎉 Congrats to @graphprotocol on reaching 1000 subgraphs! 🚀🌐\n\nA major milestone that highlights the growth and potential of the decentralized ecosystem. With diverse data and interactions, the future of decentralized applications looks promising.Keep pushing the boundaries! 🌍💻 pic.twitter.com/ltHwgVZe0c — 📊Andy S.👨‍🚀| TheGraphGermany🛡️ (@German_TheGraph) May 22, 2023\n\nHow to Stake GRT\n\nThere are different ways to earn GRT: Staking, lending, and yield farming. So, let’s talk about staking. You can stake GRT on a centralized exchange like Binance. Here are the steps:\n\nLog in to your Binance account if you have one, or create one if you don’t.\n\nGo to the “Finance” option and the “ Binance Earn ” option.\n\n” option. Move to the “ Locked Staking ” option and click on the “ View more ” button.\n\n” option and click on the “ ” button. Select GRT from the list displayed. Then, fix the duration and then click on “ Stake Now. “\n\n“ Confirm details like duration and available amount.\n\nInput the amount you want to stake and click on “Confirm purchase.“\n\nWe’re excited to announce our support for @graphprotocol $GRT staking! Earn up to 8% in yearly rewards, issued weekly with instant stake & unstake. Learn more here 👉 https://t.co/G4WkktJk1g * Rewards subject to change. Staking is not available to clients in US & CA. pic.twitter.com/eM6uRI0Bkt — Kraken Exchange (@krakenfx) November 22, 2022\n\nWhat is the Graph Explorer?\n\nThe Graph Explorer is where you can view every subgraph that has been deployed to the Graph Network. The explorer allows you to see the subgraph’s details, including its metadata and participant statistics. The curators can then select a subgraph and deposit GRT tokens in it so that it is signaled to the indexers. The Graph Explorer has tabs for:\n\nSubgraphs.\n\nIndexing.\n\nDelegating.\n\nCurating.\n\nFurthermore, the explorer allows all network users to view their user profiles. The Graph Explorer also displays the past and active results of each activity and details of the rewards earned.\n\nConclusion\n\nThe Graph has unique potential as a querying service. However, you’ll need to do your own research before investing. As of this article, GRT trades at $0.1215.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vdGVjaGNhYmFsLmNvbS8yMDIzLzA1LzI0L2RvZXMtY2hhdGdwdC10aGluay1iaXRjb2luLXdpbGwtcmVhY2gtMzVrLXRyYWRlY3VydmUtcHJpY2UtcmlzZXMtMjAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Does ChatGPT think Bitcoin will reach 35K? Tradecurve price rises 20% - TechCabal",
        "content": "Bitcoin has been one of the most talked-about topics recently because of its volatile nature. It has seen its fair share of ups and downs, making predicting its future difficult. In comparison, one project currently in Stage 2 of its presale has shown continuous price increases – Tradecurve (TCRV).\n\nIn this article, we will explore whether ChatGPT, a popular AI chatbot, thinks Bitcoin will reach 35k or not while also looking at what makes Tradecurve so attractive to investors.\n\n>>Register For The Tradecurve Presale<<\n\nBitcoin (BTC) unable to maintain momentum\n\nBitcoin is a decentralized and anonymous cryptocurrency that allows for quick and straightforward transactions without banks or intermediaries. Since its launch in 2009, Bitcoin has been on the crypto market throne since it is the world’s largest cryptocurrency by market capitalization.\n\nCurrently, Bitcoin is trading hands at $26,796.71 with a market cap of $519B, which is a decrease of 0.38% in the past day alone. In the last month, Bitcoin has been struggling with a fall of 1.5% in its value during that period. ChatGPT cannot predict the future, but it has noted that Bitcoin is a volatile investment that may cause some concerns.\n\nExperts agree that if Bitcoin cannot climb beyond the $27,250 level, a further price decrease is in store. And if it does climb above it, Bitcoin may find a resistance level of $30,000. With these Bitcoin price predictions stating that a $35,000 valuation is not obtainable anytime soon, investors are looking at other projects to diversify their portfolios.\n\nTradecurve (TCRV) presale continues capturing all attention\n\nBy creating a unique Ethereum-based hybrid trading exchange that does not require sign-up KYC checks, Tradecurve will become a significant power in the online trading market.\n\nIndividuals, no matter their location, will soon be able to trade stocks, commodities, forex, and cryptocurrency just by creating an account using their email, connecting a crypto wallet, and depositing on Tradecurve. This will be a significant turning point as traditional trading platforms such as Binance and eToro require KYC checks, effectively disabling privacy and anonymity for traders.\n\nTradecurve will also have a social trading feature, allowing users to copy what experienced traders are doing for a small subscription fee. Beginner traders may also find the metaverse trading academy very appealing as they can communicate with trading professionals.\n\nBuilding on the Ethereum blockchain will also have its perks, as individuals will control their keys and assets and enjoy lower trading fees thanks to decentralization. Tradecurve will employ its utility token, TCRV, as the backbone of this platform and features – providing holders with benefits such as subscription fee discounts, passive income via staking, and exclusive account rewards.\n\nIndividuals have found these benefits very appealing as millions of TCRV tokens have been sold already, and given its current presale price of just $0.012, now is a great time to purchase it.\n\nThis project is now in Stage 2 of its presale and has already seen a price increase of 20% from its starting price of $0.01. Experts forecast that more price hikes will come as they foresee a 50x increase by the time the presale finishes. Moreover, a 100x increase after its launch is not out of the question, as the TCRV token will get listed on a significant Tier-1 exchange such as Uniswap.\n\nAll signs are bullish for Tradecurve, and if we compare it to Huobi’s ICO, which began in 2018 with a price of $1.52 and reached an ATH of $39.81 , a price surge can be expected for the TCRV token soon, so sign up for its presale below and obtain a 25% deposit bonus on each purchase.\n\nFor more information about the Tradecurve presale see links below:\n\nWebsite: https://tradecurve.io/\n\nBuy presale: https://app.tradecurve.io/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nTelegram: https://t.me/tradecurve_official\n\nShare this article"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL25ld3MvZHViYWktdG8tYnVpbGQtd29ybGRzLWZpcnN0LWJpdGNvaW4tdG93ZXItNjAzNDQ1Lmh0bWzSAV9odHRwczovL3d3dy5pbmRpYXRpbWVzLmNvbS9hbXAvd29ydGgvbmV3cy9kdWJhaS10by1idWlsZC13b3JsZHMtZmlyc3QtYml0Y29pbi10b3dlci02MDM0NDUuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "World's First Ever Bitcoin Tower Set To Be Built In Dubai Soon - Indiatimes.com",
        "content": "The United Arab Emirates will soon be the home of the world's first ever bitcoin tower, which will be a hotel in the shape of a bitcoin. The 40-story tower will be built in Dubai, and the plan is set to be unveiled on May 24th.\n\nThe World's First Bitcoin Tower In Dubai\n\nA developer in Dubai recently unveiled plans to construct the world’s first bitcoin (BTC) tower. With the unveiling scheduled for May 24th, the project aims to demonstrate the significance of digital assets and cryptocurrencies, coinciding with the upcoming COP28 meeting in Dubai.\n\n\n\nfinbold\n\nSalvatore Liggiero, the developer behind this venture, said the hotel will be the first of its kind, as per the Binance report. Designed in the style of bitcoin, the hotel developer plans to use cutting-edge technologies and sustainable materials, and it has a commitment to zero CO2 usage.\n\n\"It Gives You Back What You Paid\"\n\nIn a unique blend of traditional hospitality and cryptocurrency, the Bitcoin Tower isn’t just a luxurious accommodation; it’s a symbol of the digital age, illustrating cryptocurrencies’ increasing importance and influence in our everyday lives. The hotel chain’s innovative approach transforms the hotel experience by offering guests exclusive NFTs (non-fungible tokens) as rewards. These tokens prove authenticity and ownership in the digital realm, granting holders exclusive privileges.\n\nThis model introduces a new facet to the hospitality industry: the rental price isn’t just a payment; it’s an investment. It is treated as staking cryptocurrency, producing an annual percentage yield (APY) that guests can claim.\n\nIn the words of developer Salvatore Leggiero, it’s “the first hotel that gives you back the money you paid, plus interest,” as per various media reports.\n\nNot only does this project aim to educate the general public about cryptocurrencies, but it also encourages participation. Leggiero invites artists, architects, creatives, and crypto enthusiasts to submit their works.\n\nshutterstock\n\nAlso Read: Here Are The Beautiful Glimpses Of World's First Bitcoin City\n\nThese creations will form an exclusive NFT collection dedicated to the Bitcoin Tower’s design or its internal spaces, manifesting an asset of tremendous tangible value in the digital space.\n\nA Homage To The World's First Cryptocurrency\n\nThe architectural work hopes to serve as homage to the first cryptocurrency and to encapsulate the principles laid down by its enigmatic creator, Satoshi Nakamoto.\n\n\n\nThe bitcoin tower’s developer also wants to demonstrate Dubai’s goal to bridge the gap between digital and physical assets. To foster a collaborative environment, Leggiero encourages individuals from diverse backgrounds to participate in this endeavour, recognising the immense value that their collective expertise can bring to the project.\n\nAlso Read: Death Of One Of The World's Richest Arabs Leaves Behind Messy Inheritance In Dubai\n\nFor the latest and more interesting financial news, keep reading Indiatimes Worth. Click here.\n\n"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vaW5ld3MuY28udWsvaW5ld3MtbGlmZXN0eWxlL21vbmV5L2JpdGNvaW4tYXRtcy1pbGxlZ2FsLWNvcm5lci1zaG9wLWNyYWNrZG93bi0yMzU4NTc40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Bitcoin ATMs available in corner shops leaving customers at risk - inews",
        "content": "Exclusive\n\nIllegal crypto ATMs are still operating in corner shops around the country despite a crackdown by the financial watchdog, the i has found.\n\nLawyers have warned that these ATMs are a risk to unwitting customers, who may not know they are illegal and could struggle to get cash back if the transaction were to go wrong.\n\nShopkeepers who have the machines on their premises may also be providing a “perilously simple” way for criminals to money launder, through a technique known as “smurfing”, the lawyers warn.\n\nThe Financial Conduct Authority (FCA) has previously warned operators of crypto ATMs in the UK to shut their machines down or face enforcement action including potential criminal charges.\n\nOver the past year it says it has visited sites in east London, Leeds, Exeter, Nottingham and Sheffield as part of its crackdown.\n\nBut maps circulating online still show more than a dozen of the ATMs operating in London, Manchester and Birmingham.\n\ni visited two of the machines in bustling corner shops in inner London within the past week.\n\nThe ATMs allow customers to move bitcoin and other cryptocurrencies on to a “digital wallet” using cash.\n\nThe FCA has said that none of the cryptoasset firms registered with it have been approved to offer crypto ATM services, meaning that any of them operating in the UK are doing so illegally and people should not be using them.\n\nAkber Datoo, founder of D2 Legal Technology, told i that the customers using the machines may not be “aware” of the risk involved.\n\nA crypto ATM within a store in London, visited by i\n\nMr Datoo, who also sits on the Law Society’s Technology and Law Committee added: “These are not regular ATMs, despite appearances. What if something were to go wrong – if money were not returned, or the cryptocurrency did not transfer to your wallet? The reality is that there is less by way of consumer protection, compared with a regular ATM”.\n\n“Additionally, they may be used for illegal purposes. Through ‘smurfing’ – whereby large amounts of money are split into micro transactions – it can become perilously simple to effect money laundering through these Crypto ATMs.”\n\nHe explained that shopkeepers may be enticed to house the machines because they could lead to an increase in footfall in their shops.\n\n“There is an association with cryptocurrencies and getting rich quick, which may be attractive to certain people that may actually need the consumer protection”, he said.\n\nWhat is bitcoin? Bitcoin is a type of digital “currency”, but unlike other currencies, such as the pound and the dollar, it does not rely on a government or central bank to maintain it.\n\n\n\nIt is the most well-known cryptocurrency and hit headlines a few years ago as people started to use it as an investment vehicle. One bitcoin went from being worth less than a penny in 2010 to being worth around £48,000 in 2021. The value has fallen since, but still sits above £20,000. People can invest in bitcoin via exchanges or brokers – with the likes of EToro being an example of a regulated firm – but the currency has also been the focus of many scams in the past few years, where fraudsters claim to be offering investment opportunities that turn out to be fake.\n\nThe machines seen by i were prominently disaplyed, with clear instructions on how to obtain cryptocurrency using the machine.\n\nOne shop, just a few minutes walk from a Zone One London tube station had adverts outside, flagging that customers could purchase bitcoin in the store.\n\nAn advert telling customers they can buy bitcoin inside the store\n\nThe FCA has said it is continuing to inspect and take action against those hosting unregistered crypto ATMs in the UK, and is liaising with the Association of Convenience Stores (ACS).\n\nIt said that it regularly repeats warnings that that cryptoassets are unregulated and high risk, which means people are very unlikely to have any protection if things go wrong.\n\nACS chief executive James Lowman said: “We are working with the FCA on ensuring that retailers understand the regulations surrounding unregistered cryptocurrency ATMs. There are very few of these operating in the UK, but it is important that both consumers and retailers appreciate the risks associated with this technology.”\n\nOne of the machines that i was able to find said it was operated by Big Sea Coins, which claims on its website it operates at 11 locations in the UK.\n\nThe organisation is on an FCA list of unregistered cryptoasset businesses."
    }
]