[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMTAvMTMvdXMvYml0Y29pbi1taW5lcy1jaGluYS11bml0ZWQtc3RhdGVzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Across U.S., Chinese Bitcoin Mines Draw National Security Scrutiny - The New York Times",
        "content": "When a company with Chinese origins broke ground last year on a crypto-mining operation in Cheyenne, Wyo., a team at Microsoft that assesses national security threats sounded the alarm.\n\nNot only was the site next door to a Microsoft data center that supported the Pentagon — it was about a mile away from an Air Force base that controlled nuclear-armed intercontinental ballistic missiles.\n\nThe location could allow the Chinese to “pursue full-spectrum intelligence collection operations,” the Microsoft team wrote in an August 2022 report to the Committee on Foreign Investment in the United States, a federal body that monitors threats posed by overseas investors.\n\nMicrosoft’s warning did not go unheeded. Speaking on the condition of anonymity, U.S. government officials told The New York Times last week that they had been tracking the Wyoming operation for months. One official said that measures had been taken to mitigate potential intelligence collection but declined to elaborate. In addition, the mining company said it responded to queries from the federal investment committee."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTEwLTE5L2JpdGNvaW4taXMtbm90LWdyZWF0LWZvci1tdXJkZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Is Not Great for Murder - Bloomberg",
        "content": "Programming note: Money Stuff will be off tomorrow, back on Monday.\n\nThere are three classic problems that you might encounter if you try to use Bitcoin to pay for goods and services. The first problem is that your Bitcoins might go astray: Bitcoin transactions are irreversible and involve sending money to long complicated addresses, and people are constantly trying to steal them. So if you send someone Bitcoin to pay for something, there will probably be a typo in the address and the person won’t get it and you’ll have to send it again and your first payment will just be permanently lost."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmdyZWVucGVhY2Uub3JnL3VzYS9yZXNlYXJjaC9yaW90LXBsYXRmb3Jtcy10aGUtY29tcGFueS1iZWhpbmQtdGhlLW1vc3QtZW5lcmd5LWludGVuc2l2ZS1iaXRjb2luLW1pbmUtaW4tdGhlLXUtcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Riot Platforms: The Company Behind the Most Energy Intensive Bitcoin Mine in the U.S. - greenpeace.org",
        "content": "Riot Platforms: The Company Behind the Most Energy Intensive Bitcoin Mine in the U.S.\n\nRiot Platforms is leading the polluting Bitcoin boom in Texas. The company operates the largest, and one of most energy and carbon-intensive, Bitcoin mines in the U.S. at their Rockdale facility and now plans to build an even bigger and dirtier mine in Corsicana.\n\nSummary\n\nRiot Platforms is leading the polluting Bitcoin boom in Texas. The company operates the largest, and one of most energy and carbon-intensive, Bitcoin mines in the U.S. at their Rockdale facility and now plans to build an even bigger and dirtier mine in Corsicana.\n\nRiot’s massive fossil fuel-generated energy use contributes to the climate crisis, while the company also profits from extreme weather. During heatwaves and cold snaps, Riot makes millions of dollars by simply doing nothing and selling energy back to the grid – often more than they earn mining Bitcoin.\n\nTexans are footing the bill with higher energy prices due to increased electricity demand from Riot, and tax incentives and subsidies going to Riot and other Bitcoin miners.\n\nBig financial companies including BlackRock, JP Morgan Chase, and Vanguard are helping bankroll Riot’s carbon emissions and water consumption.\n\nIntroduction\n\nAs the saying goes, everything is bigger in Texas, including Bitcoin mines. And that means big carbon emissions. Texas has become a hub for Bitcoin mining and since 2021, 2,234 megawatts (MW) of Bitcoin mining facilities have been built in the state by around 30 companies. [1] Standing out in this Bitcoin boom is Riot Platforms’ sprawling facility near Rockdale, Texas that is estimated to be the most energy and carbon-intensive Bitcoin mine in the U.S. [2] Riot now plans to grow that facility and while building an even bigger mine in the state, one that could be the largest in the world. This all means even more carbon emissions and local air, water, and noise pollution. [3]\n\nThrough its large Texas operations, Riot, a publicly traded company based in Castle Rock, Colorado, has grown into one of the largest Bitcoin mining companies in the U.S. Riot’s facilities also rely primarily on fossil fuel generated electricity leading to massive carbon emissions. [4] While the company contributes to the climate crisis, it makes money during extreme weather events, like heat waves and cold snaps, by getting paid to simply shut down and sell power back to the grid. [5] Meanwhile, everyday Texans are suffering from sweltering temperatures, paying higher energy bills, and dealing with the consequences of a strained electricity grid.\n\nEnvironmental and Community Impacts\n\nRiot Platforms operates the most energy and carbon-intensive Bitcoin mines in the United States out of an abandoned aluminum smelting plant in Rockdale, Texas. The facility is estimated to use 450 MW of power, equivalent to the amount of electricity used by the nearest 300,000 homes. [6] And almost all of that electricity comes from dirty fossil fuels, producing annual CO2 emissions of 1.9 million tons. Yet, according to Riot, the facility has even greater power capacity, 750 MW, and the company is in the process of expansion. [7] That would mean more GHG emissions and more electricity drained from the grid rather than going into people’s homes and offices.\n\nMeanwhile, Riot is constructing a new facility in Corsicana, Texas, about 60 miles south of Dallas in Navarro County, that would be even larger, potentially using 1 gigawatt of energy. [8] That could make it the largest Bitcoin mine in the world. The facility would generate even more carbon emissions and increase demand on the already-strained Texas electrical grid. [9] The added energy demand could push fossil fuel plants to keep operating and expand production.\n\nRiot’s approach to criticism is to either deny creating carbon emissions or greenwash its operations by claiming to support renewable energy. In response to an extensive New York Times investigation revealing the company’s huge energy use and GHG emissions, Riot released a video claiming the company’s mines have no emissions – a ridiculous argument that ignores how carbon emissions are calculated. [10] The company also issued a scathing statement in response that denied the company’s climate impacts. [11]\n\nYet, Riot’s environmental record is concerning. The company does not disclose GHG emissions or other environmental data which would provide vital transparency and accountability. It has a dismal ESG Score of 1.06 out of 10 from Bloomberg, and a 0 on environmental factors since the company does not disclose any environmental data, aside from discussing potential risks of climate change to its business. [12] In January 2022, a group of U.S. Senators and Congresspeople, including Elizabeth Warren and Edward Markey, wrote a letter to Riot and five other Bitcoin mining companies, over concerns about high energy use and requested more reporting and data including about the companies’ energy consumption and emissions. [13]\n\nBeyond the climate and air pollution implications of Bitcoin mining, these operations also create noise pollution that is harmful and disruptive to surrounding communities. Bitcoin mines are very loud largely due to the fans needed to cool the equipment. Facility noise can reach and remain at 95 dB, which some nearby residents have compared to having a jet-engine in your backyard. [14] All that noise has led to complaints and protests from affected communities in Texas and around the United States who are upset about the constant din from these industrial facilities that operate around-the-clock. [15] Riot’s Rockdale mine uses a mix of the loud air cooling method and some immersion cooling – submerging computers in liquid to keep them cool and clean, which reduces the need for fans. [16] The company has a water reservation agreement to pay approximately $2.1 million annually to get water from a nearby lake for use in cooling. [17] Riot says that the Corsicana mine will use immersion cooling. [18] However, it remains to be seen whether Riot actually uses this technology, which is more expensive.\n\nThe new Corsicana mine could use large amounts of water which is a major concern in an area enduring a historic drought. [19] The City of Corsicana plans to sell water to Riot which is projected to be up to 1.5 million gallons of water per day. [20] Meanwhile ranchers have recently been forced to sell cattle due to the lack of water in the region. [21]\n\nRunning on Public Money\n\nRiot’s polluting facilities benefit from a range of public subsidies and tax incentives, despite the anti-government rhetoric from the Bitcoin industry. [22] In particular, Riot receives payments from the Texas grid operator, ERCOT, to reduce and shut-down operations during periods of high demand and high energy prices. Thus, large energy users like Riot contribute to the climate crisis and strained energy grids while benefiting from extreme weather and an overloaded grid. [23] Riot has been paid millions by reducing usage and selling back electricity during periods of peak demand, like the record-setting deadly heat waves in summer 2023 when the company made $31.7 million in August alone. [24] Meanwhile, everyday Texans were asked to turn down their air conditioning and suffer through hot temperatures with no compensation.\n\nThe demand response program (in Texas called Responsive Reserve Service) that Riot participates in pays companies, with funds from ratepayers, for agreeing to cut back energy use. Yet residential customers cannot participate in the program and are asked to voluntarily cut back their use during energy crises. [25] Through the demand response program, Riot gets paid by promising to stop using electricity if ERCOT asks, even though ERCOT rarely requests them to do so. [26] Plus, miners might have shut-down at those times anyway given the high price of energy. Thus, miners like Riot can make millions of dollars for essentially doing nothing.\n\nAnother way Riot makes money is by selling electricity back to the grid which, in 2022, earned the company $18 million. [27] Miners like Riot secure long-term energy contracts with low prices and then can sell energy back at the higher market prices during periods of peak demand. [28] Price fluctuations are particularly extreme in Texas given the state’s independent and deregulated energy market. In 2022, the New York Times found that Riot saved around $27 million in potential fees by cutting back usage during periods of high demand. [29] At times Riot can make more money by shutting down and selling energy back to the grid than mining Bitcoin. [30] In August 2023, Riot made nearly four times as much money by selling energy than the company made mining Bitcoin.\n\nWhen winter storm Uri hit Texas in 2021, millions went without electricity for days during subzero temperatures and at least 246 people died, some freezing inside their homes. [31] And Texans who did have power faced astronomical electricity bills due to huge electricity price spikes. [32] Yet, miners like Riot were getting paid to scale back their operations and sell energy to the grid at high prices. Riot made $125 million selling energy during the storm. [33]\n\nWhile heat waves and winter storms have exposed vulnerabilities in the Texas energy grid, more and more energy demand from Bitcoin mining is being proposed, like Riot’s Corsicana facility. ERCOT is reviewing applications from Bitcoin miners to bring nearly 42 GW of electricity demand online by 2027, even a fraction of that would be a tremendous growth from the already substantial 3,000 megawatts used by the industry. [34]\n\nTexans are also paying more to keep their lights on than Riot pays to guess numbers in the race to win Bitcoin. Riot told investors in an August 2023 report that the company paid 2.8 cents per KwH compared to the average price of 7.2 cents for other industrial users and 13.5 cents for residents. [35] And miners like Riot are even making those electricity bills higher for residents. Analysis by energy research and consulting firm Wood Mackenzie finds that Bitcoin mining in Texas will lead to a 5% increase in electricity costs and cost an additional $1.8 billion per year. [36]\n\nRiot benefits from other tax incentives and subsidies as well. The company’s Whinstone mine in Rockdale is exempted from many state sales taxes through a Texas program for data centers that exempts companies from state sales and use tax on equipment and electricity. [37] The company that originally built the facility, Whinstone, also received public incentives and tax abatements. [38] Riot receives an abatement on improvements to the facility for an estimated taxable value of $151 million. [39] However the promise of 300 jobs at Riot’s Rockdale mine were overblown as only 14 new hires have been confirmed. [40]\n\nMeanwhile, Riot’s executives are making large sums of money. In 2022, CEO Jason Les and Chairman Benjamin Yi both made over $21 million in compensation while four other top executives all made between $2 and $3 million. [41] That was a year in which the company reported nearly $510 million in losses. [42]\n\nHopping on the Bitcoin Bandwagon\n\nRiot Platforms was not always in the mining Bitcoin business and used to develop veterinarian products and tools for diagnosing diseases. [43] In October 2017, amidst a wave of hype about blockchain and Bitcoin, the company made an abrupt shift after 17 years in biotech into the crypto industry. The company announced a name change from Bioptix to Riot Blockchain and told investors the company was getting into Bitcoin mining and other cryptocurrency services. [44] The company’s stock price soared and attracted lots of new buyers. But the sudden change was met with some criticism for following the hype about Bitcoin. Some large shareholders sold off large numbers of shares, making a lot of money, and several annual meetings were abruptly canceled. [45] This all led to several shareholder lawsuits and an SEC investigation. Ultimately, the lawsuits were dismissed and the SEC investigation ended without any recommendation of charges. [46] Still, the company continues to have weak governance practices. Bloomberg’s ESG scores give Riot a 4.68 out of 10 on governance issues which includes issues like executive compensation, board oversight, and the strength of auditing practices. [47]\n\nSince rebranding as a crypto company, Riot has acquired companies to grow its Bitcoin mining operations. In May 2021, under the leadership of the new CEO Jason Les, a former professional poker player, Riot made one of its largest acquisitions – a $651 million deal to buy Whinstone US, the company that built the Rockdale mining facility. [48] Riot has also sought vertical integration by expanding into industries that supply equipment services for Bitcoin mines. Also in 2021, Riot purchased ESS Metron, an electrical component engineering and manufacturing firm that caters to Bitcoin miners, for $50 million. [49] This gives Riot ownership over a company that provides essential infrastructure for its growing mining facilities. Riot also has a majority ownership stake in TessPay, a fintech company that offers a blockchain payment platform for telecom companies. [50]\n\nIn January 2023, the company changed its name again from Riot Blockchain to Riot Platforms to signal diversification from Bitcoin and cryptocurrency to other business streams, like high performance and cloud computing, amidst a period of economic turmoil for Bitcoin miners. [51] Riot’s share price had dropped 85% in 2022 as the price of Bitcoin slumped and the industry’s reputation struggled after numerous high-profile scandals. [52]\n\nPolitical Ties and Lobbying\n\nRiot, along with Bitcoin industry groups, has used its political muscle to secure and protect policies and subsidies favorable to miners’ bottom line. Riot has engaged in federal and state lobbying, and hired staff, often with ties to government agencies and conservative groups, to promote the companies’ interests.\n\nPublicly available data shows that Riot began spending on state and federal lobbying in 2022. In 2022, Riot (then named Riot Blockchain) reported spending $280,000 on federal lobbying through a contract with Holland and Knight, a Florida-based law firm that has a large federal lobbying operation. [53] As of August 2023, Riot has spent $220,000 on federal lobbying, which included paying $160,000 for lobbying services to Holland and Knight while the rest was done in-house by Riot staff. [54] Agencies that the company lobbied include the Commodity Futures Trading Commissions (CFTC) that oversees Bitcoin futures trading, the Department of Energy, Environmental Protection Agency (EPA), and Securities Exchange Commission (SEC). As of September 2023, Riot has spent between $70,000-$151,000 on hiring lobbyists in Texas for the 2024 election cycle. [55]\n\nThere is also a revolving door between former government officials and Riot’s staff and board, especially people with ties to right-wing politicians. In 2023 Riot hired a head of public policy, Brian Morgenstern, who is a former Trump Whitehouse official. Morgenstern served as deputy communications director and deputy press secretary for Trump starting in July 2020, and before that was a deputy assistant secretary for external affairs at the Department of the Treasury where he served as a senior aide and chief speechwriter to Trump-appointed Treasury Secretary Steven Mnuchin. [56] Morgenstern was named in an investigation by the U.S. Office of Special Counsel as one of the officials who violated the Hatch Act by promoting Trump’s reelection campaign during official interviews and media appearances. [57] After working for Trump, Morgenstern was a Senior Advisor at the America First Policy Institute – a group founded by ex-Trump administration officials to continue promoting Trump’s conservative policy agenda. [58] Morgenstern has a long career in Republican politics including working on Rudy Giuliani’s presidential campaign in 2008. [59] The company also hired Samuel Lyman as Director of Public Policy who also has ties to conservative politicians and powerful corporate interests who worked at the Orrin G. Hatch Foundation after being a speechwriter for Republican Senator Hatch, and was a speechwriter for the U.S. Chamber of Commerce – the wealthy corporate lobby group that has opposed action on climate change and environmental regulations. [60]\n\nIn May 2023, Riot announced that Brad Jones, the former Interim President and CEO of the Energy Reliability Council of Texas (“ERCOT”), was appointed to its advisory board. [61] Riot makes millions of dollars through various ERCOT programs and lobbies for those policies to continue in order to protect a key source of revenue.\n\nWhen Riot’s valuable ERCOT incentives were threatened by proposed state legislation, the company and allied industry groups pushed hard to block the bill. In spring 2023, Republican Texas state senator Lois Kolkhorst introduced Senate Bill 1751 that would cut back some incentives used by Riot and other miners. [62] The bill would cap miner’s enrollment in ERCOT’s emergency response services programs to 10% of all participants, require miners to register with ERCOT as “large flexible load,” and prohibit property tax breaks to Bitcoin mining facilities. The bill was passed by the Senate with bipartisan support, but didn’t make it out of a House committee in part due to mobilization by Riot and Bitcoin industry groups including the Texas Blockchain Council (TBC), the Satoshi Action Fund, and the Chamber of Digital Commerce. [63] Riot worked to stop the bill by issuing statements criticizing the legislation, telling legislators to vote against it, and having company leaders testify against the bill. [64] TBC was also a vocal opponent and has deep ties to Riot, which is an executive partner, the highest level of support for the group. Riot’s head of public policy is also a board member of the TBC. TBC has ties to powerful Texas Republicans like Governor Gregg Abbott. For example, the TBC’s VP for Public Policy and External Affairs, Reed Clay, was the Chief Operating Officer for the State of Texas under Governor Greg Abbott and helped advance Abbot’s far-right wing political agenda. [65] The industry celebrated killing the bill which they framed as an attack on the industry. [66]\n\nMeanwhile Riot has worked with Bitcoin mining and crypto industry groups to push favorable legislation. For example, the U.S. Congressman Pete Sessions, a Republican from Texas representing the district that covers Riot’s Rockdale mine, proposed House Resolution 238 that asserts proof-of-work mining is a boost for national energy goals and economic growth. [67] Sessions has appeared at events sponsored by the industry alongside representatives of Riot and praised the company. [68]\n\nBig Financial Backers\n\nRiot’s pivot to Bitcoin mining and continued expansion relies on investments from big financial companies and support from the traditional finance sector. Riot has funded its expansion in part by selling more shares in the company to large institutional investors. Currently, the two largest shareholders of Riot are asset managers Vanguard and BlackRock who control 9.68% (valued at $196 million) and 6.5% (valued at $131.58 million) of outstanding shares respectively. Other large banks and investment companies also control shares of Riot, including State Street with 2.68% of shares, Morgan Stanley with 1% of shares, JPMorgan Chase with 0.66% of shares, and Goldman Sachs with 0.35%. [69] These six big financial companies collectively hold nearly 21% of Riot’s shares which are valued at $421.54 million. Thus, Wall Street serves as a major source of capital for Riot and its polluting Bitcoin mines.\n\nIssuing new shares, or equity, relies on support from investment banks to facilitate the sale and take on the risk of buying the new stock and then selling it to investors. In May 2019, Riot issued additional shares in a deal managed by investment bank HC Wainright which raised $18.9 million that Riot said would be used for working expenses and capital. [70] In 2022, Riot again issued additional shares raising $267 million in a deal managed by B Riley along with BTIG LLC, Cantor Fitzgerald, DA Davidson & Co, Macquarie Capital USA, Northland Securities, and Roth Capital Partners. [71] Riot said this equity offering would be used for general corporate purposes which could include investments in current and future projects and strategic acquisitions. [72]\n\nOn August 9, 2023, Riot announced another share offering that is expected to raise $750 million. B Riley is the manager along with several other co-managers including BTIG LLC, Cantor Fitzgerald, Compass Point Research, Moelis & Co, Northland Securities, Roth Capital Partners, and Stifel Nicolaus & Co. [73] The deal is still in process and is presumably being used to help fund construction of the Corsicana site.\n\nBitcoin miners like all companies also need banking services to manage money flows, make payroll, and make payments. Riot reported having operating accounts with Signature Bank, which catered to the crypto industry, before it failed and was shut down by regulators in March 2023. [74] Riot has subsequently transferred deposits to other banks which have not been reported publicly.\n\nCommunity Resistance\n\nRiot’s large polluting and noisy facilities have sparked the ire of nearby residents and led to community resistance to the company’s expansion. As people become aware of the noise, strain on the energy grid, and large water usage from Bitcoin miners, opposition to Riot’s and other companies’ facilities around Texas has grown. Construction of the new Corsicana facility has met resistance from nearby residents. The Concerned Citizens of Navarro County, led by Jackie Sawicky, mobilized to oppose the project, voicing concerns about noise, water usage, increasing electricity bills, and public subsidies. [75] Concerned Citizens led a protest at the groundbreaking ceremony for the 265-acre site and continues to push for more public input and scrutiny into the opaque permitting and approval processes for the facility. [76] Residents are worried that Riot’s mine would use large amounts of water and drive up electricity prices which is a major concern for people who already pay a lot to cool their homes during the long, hot summers. [77] This is in an area where many people struggle to make ends meet. In 2020, Navarro County has a 15.5% poverty rate and a median household income of $47,574 which is below the national average. [78]\n\nIn summer 2023, Concerned Citizens joined with other advocates in Texas to form the Texas Coalition Against Cryptomining to coordinate communities across the state in addressing the environmental, economic, and social impacts of the rapidly growing Bitcoin mining industry. Texas activists are also connecting with a national network of groups working to stop expansion of Bitcoin mining in their backyards, often with little public input but large drains on public infrastructure. [79]\n\nEndnotes"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1pcy1jb21pbmctYnV0LWFuYWx5c3RzLWRpZmZlci1vbi1wb3NzaWJsZS1wcmljZS1yZWFjdGlvbi_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xOC9zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFsLWlzLWNvbWluZy1idXQtYW5hbHlzdHMtZGlmZmVyLW9uLXBvc3NpYmxlLXByaWNlLXJlYWN0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Approval Might Be Near, but Analysts Differ on Possible BTC Price Reaction - CoinDesk",
        "content": "Spot Bitcoin ETF Approval Might Be Near, but Analysts Differ on Possible BTC Price Reaction\n\nOne line of thought envisions a major rally, while another suggests approval has been fully baked into prices.\n\nBy Krisztian Sandor Oct 18, 2023 at 7:41 p.m. UTC"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTAvMTkvZ3JheXNjYWxlLW5ldy1hcHBsaWNhdGlvbi1zZWMtc3BvdC1iaXRjb2luLWV0Zi_SAVlodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzEwLzE5L2dyYXlzY2FsZS1uZXctYXBwbGljYXRpb24tc2VjLXNwb3QtYml0Y29pbi1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Grayscale filed a new application with the SEC for a spot Bitcoin ETF. But a lawsuit against its parent company could complicate matters - Fortune",
        "content": "Grayscale filed a new application with the Securities and Exchange Commission for its Grayscale Bitcoin Trust as it looks to secure one of the first spot Bitcoin ETFs in the U.S.\n\nThe application, filed Thursday, is laying the groundwork for the company’s Grayscale Bitcoin Trust (GBTC) digital currency investment product to operate as a spot Bitcoin ETF listed on the New York Stock Exchange, pending SEC approval of its S-3 form.\n\n“Importantly, GBTC is ready to operate as an ETF upon receipt of these regulatory approvals, and on behalf of GBTC’s investors, Grayscale looks forward to working collaboratively and expeditiously with the SEC on these matters,” the company said in a statement.\n\nThe new filing comes after Grayscale’s recent court victory over the SEC in which the company was told the agency had no basis for denying Grayscale’s request to convert its GBTC product into a spot Bitcoin ETF. Last week, the SEC declined to appeal that ruling, improving the odds that a spot Bitcoin ETF is approved in the coming months.\n\nBut whether Grayscale is among the first to receive approval for a new ETF remains uncertain. On Thursday, New York State Attorney General Letitia James sued Grayscale parent company Digital Currency Group, along with crypto exchange Gemini and DCG subsidiary Genesis, a crypto lending firm. The lawsuit claims DCG was partly responsible for defrauding investors of more than $1 billion.\n\nThe lawsuit is also seeking to bar DCG from engaging in securities and commodities-related business in New York, which could complicate Grayscale’s effort to list a product on the NYSE.\n\nStill, as of Thursday, GBTC’s discount compared with its net asset value was closing, signifying that investors were increasingly confident in the product. The exchange-traded product was trading down less than 1%, around $22.18, as of Thursday morning."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LnRhbGxhaGFzc2VlLmNvbS9zdG9yeS9zcGVjaWFsL2NvbnRyaWJ1dG9yLWNvbnRlbnQvMjAyMy8xMC8xOS90aGUtZXZvbHV0aW9uLWFuZC1pbXBhY3Qtb2YtYml0Y29pbi83MTI0MDY0ODAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "The Evolution and Impact of Bitcoin - Tallahassee Democrat",
        "content": "Sixteen Ramos\n\nContributor\n\nStory by OKX\n\nThe 2008 financial crisis brought us the impact of Bitcoin. As the concept of cryptocurrency was revealed to the public, it received an exceptional amount of attention. As Bitcoin evolved over time, it had various negative and positive impacts on the market, a market of its own making.\n\nBitcoin helped radically redefine money and trust. On the blockchain, Bitcoin offered an entirely new type of financial asset. It was more secure and direct than any traditional banking option, elevating how we considered the financial sector as a society. A paper published in 2008 heralded it as, “Bitcoin: A Peer-to-Peer Electronic Cash System.” This was a nine-page manifesto outlining the blueprint for a decentralized currency that operated independently of governments or banks. Blockchain technology emerged on the scene, stapling financial autonomy into our collective future.\n\nBitcoin offered investors and ordinary people a way to exert full control over their financial assets without having to trust a traditional bank. Transactions were direct and practically infallible, with no fees or functions from third parties required. The monetary revolution was underway, and everyone wanted to join the action.\n\nThe minds behind Bitcoin went above and beyond to do their part in bringing cryptocurrency to the public. They produced resources for new investors, providing guidance, resolving issues, and contributing to the ever-strengthening system. A project that had started out as a fringe experiment culminated in the creation of cryptocurrency, a new, overarching way to work with financial assets that are bound to be the future structure of the system itself.\n\nThe traction that Bitcoin gained over the past decade and a half is unprecedented. Digital currency took to the market like wildfire, leaving skeptics and critics in the dust. Now, Bitcoin stands as a behemoth of the industry. If you haven’t heard of any other type of cryptocurrency, it’s still likely you’ve already heard of Bitcoin!\n\nTraditional finance is upgrading to include digital currencies in its fabric, taking the entire financial sector to the next level. As more people are drawn to the blockchain and decentralized finance, Bitcoin and other cryptocurrencies continue to change.\n\nOver the past few years, Bitcoin has seen some disappointing market moves that surprised investors. It wasn’t the only cryptocurrency affected by the pandemic and consequential financial struggles, such as pepe coin and Pepe price. Although parties experienced losses during this time, Bitcoin’s popularity was largely unaffected. It’s still one of the most popular and beloved cryptocurrencies on the market, a fact due to more than nostalgia. The efficacy of Bitcoin continues to remain strong.\n\nAfter things evened out, Bitcoin stabilized accordingly. It’s still one of the reigning cryptocurrencies into which investors entrust their financial assets. Those looking to become part of the cryptocurrency community or get in on the future of finance are drawn to Bitcoin, as well as seasoned investors. Although Bitcoin isn’t as boomingly successful in the market as it once was, it’s still taking the financial sector by storm, throwing us into the next evolution of finance.\n\nInvesting in digital assets carries a high level of risk and may not be suitable for all investors. Potential investors should ensure that they have an understanding of the risks involved, seeking professional advice where appropriate."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktMjAyNC1iaXRjb2luLWhhbHZpbmctcGxheS1vdXQtZGlmZmVyZW50bHktdGhhbi1wcmV2aW91c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Why the 2024 Bitcoin halving may play out differently than in the past - Cointelegraph",
        "content": "The impact of the Bitcoin halving on crypto prices is often overestimated, and the next halving, set for April 2024, may play out differently than previous ones — according to a leading analyst.\n\nThe halving event, which every four years cuts in half the rate by which new Bitcoin (BTC) is created, is generally considered one of the main catalysts driving Bitcoin’s biggest upside moves.\n\nDespite the bullish narrative surrounding the halving, however, the event by itself does not necessarily guarantee Bitcoin’s price appreciation.\n\nIf the reduced supply of new BTC is not accompanied by significant demand, prices are unlikely to surge.\n\nAlso, the halving is an entirely predictable event, meaning all market participants know in advance when it will occur. Therefore, its current price may already reflect the halving’s impact before it happens.\n\n“Things that we most anticipate generally don’t happen,” said Bloomberg analyst Mike McGlone, commenting on the much-anticipated event.\n\n“And that's what I’m concerned about. It’s complete consensus,” he continued.\n\nAlso, each time the halving occurs, its impact on the new Bitcoin supply decreases; and over time, its impact will eventually become irrelevant, he argued. Changes in demand, rather than supply, are therefore becoming the dominant factor influencing the price of Bitcoin.\n\nSo, how will the next Bitcoin halving impact the crypto market? And, if not the halving, what are the catalysts behind Bitcoin’s cyclical upside moves? To find out, check out the latest Cointelegraph Report on YouTube, and don’t forget to subscribe!"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1uZWFycy0yOWstYXMtZmlkZWxpdHktZXRmLWFtZW5kbWVudC1idW1wcy1idWxsaXNoLXNlbnRpbWVudC_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE4L2JpdGNvaW4tbmVhcnMtMjlrLWFzLWZpZGVsaXR5LWV0Zi1hbWVuZG1lbnQtYnVtcHMtYnVsbGlzaC1zZW50aW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Nears $29K as Fidelity ETF Amendment Bumps Bullish Sentiment - CoinDesk",
        "content": "“We continue to see continued elevated trading volumes. We view this as good news, given that the price is not high by historical standards,” said Alex Kuptsikevich, FxPro senior market analyst, in a note to CoinDesk. “It is an influx of fresh buyers rather than an active exit from the market.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE4L2JpdGNvaW4tZXRmLWJ0Yy13YXRjaGVycy1jaXJjbGUtZnJpZGF5LWFzLW5leHQta2V5LWRhdGUtaW4tdGhlLXJhY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin-ETF Watchers Circle Friday as Next Key Date in Approval Race - Bloomberg",
        "content": "Those closely following the quest for an exchange-traded fund that would hold Bitcoin have Friday circled on their calendars.\n\nThat’s when a DC court will issue a mandate that could make effective an August opinion that went in favor of Grayscale Investments LLC, which had sued the US Securities and Exchange Commission as it looked to convert its Bitcoin trust (GBTC) into an ETF, according to Bloomberg Intelligence analysts Elliott Stein and James Seyffart . It’s the next step in the process after the SEC last week opted against appealing the previous ruling, which it had lost."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOS9tYXRyaXhwb3J0LXNheXMtYml0Y29pbi13aWxsLXJpc2UtdG8tYmV0d2Vlbi00MmstYW5kLTU2ay1pZi1ibGFja3JvY2stZXRmLWlzLWFwcHJvdmVkL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOS9tYXRyaXhwb3J0LXNheXMtYml0Y29pbi13aWxsLXJpc2UtdG8tYmV0d2Vlbi00MmstYW5kLTU2ay1pZi1ibGFja3JvY2stZXRmLWlzLWFwcHJvdmVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Could Rise to Between $42K and $56K if BlackRock ETF Is Approved: Matrixport - CoinDesk",
        "content": "The SEC delayed a slew of ETF applications last month, saying it “finds it appropriate to designate a longer period within which to take action,” giving the regulator “sufficient time to consider."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE5L3Rlc2xhLWtlZXBzLWJpdGNvaW4tc3Rhc2gtc3RlYWR5LWF0LTI3NW0taW4tcTMv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTAvMTkvdGVzbGEta2VlcHMtYml0Y29pbi1zdGFzaC1zdGVhZHktYXQtMjc1bS1pbi1xMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Elon Musk's Tesla Didn't Buy or Sell Any Bitcoin During the Third Quarter - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE4L3Nwb3QtYml0Y29pbi1ldGYtYXBwcm92YWxzLWNvdWxkLWFkZC0xLXRyaWxsaW9uLXRvLWNyeXB0by1tYXJrZXQtY2FwLWNyeXB0b3F1YW50LXNheXMv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbHMtY291bGQtYWRkLTEtdHJpbGxpb24tdG8tY3J5cHRvLW1hcmtldC1jYXAtY3J5cHRvcXVhbnQtc2F5cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Approvals Could Add $1 Trillion to Crypto Market Cap, CryptoQuant Says - CoinDesk",
        "content": "\"Nobody will dare to short BTC now for the foreseeable future. Even if this Cointelegraph news was false, BTC can still grind higher in anticipation of the approval,\" Markus Thielen, head of research and strategy at Matrixport, said in a Telegram broadcast."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE4L2JpdGNvaW4tbWluZXItbWFyYXRob24tdG8tY3VzdG9keS1zb21lLW9mLWl0cy1idGMtd2l0aC1maWRlbGl0eS1kaWdpdGFsL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE4L2JpdGNvaW4tbWluZXItbWFyYXRob24tdG8tY3VzdG9keS1zb21lLW9mLWl0cy1idGMtd2l0aC1maWRlbGl0eS1kaWdpdGFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Marathon to Custody Some of Its BTC With Fidelity Digital - CoinDesk",
        "content": "Marathan's decision comes after several custodians, including Fortress Trust, have been targeted by hackers that stole some digital assets. In the case of Fortress Trust, the theft spurred the custodian to try to sell itself to blockchain tech company Ripple, but that deal fell apart."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjAvYml0Y29pbi1pbmNoZXMtY2xvc2VyLXRvLTMway1hcy1ldGYtaG9wZS1kcml2ZXMtYnVsbHMv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8yMC9iaXRjb2luLWluY2hlcy1jbG9zZXItdG8tMzBrLWFzLWV0Zi1ob3BlLWRyaXZlcy1idWxscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Jumps Over $30K as ETF Hope Drives Bulls - CoinDesk",
        "content": "“Bitcoin has also been encouraged by possible ETF approval and an increasing number of ETF submissions by leading companies,” shared Lucy Hu, senior trader at Metalpha, in a message early Friday. “The SEC opted for a no-appeal on Grayscale’s ruling, and as the deadline for BTC spot ETF applications from institutions such as Blackrock looms closer, the market’s confidence in ETF approval has increased.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMTgvbGlnaHRuaW5nLWxhYnMtcm9sbHMtb3V0LXRhcHJvb3QtYXNzZXRzLXRvLW1ha2UtYml0Y29pbi1tdWx0aS1hc3NldC1uZXR3b3JrL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMTgvbGlnaHRuaW5nLWxhYnMtcm9sbHMtb3V0LXRhcHJvb3QtYXNzZXRzLXRvLW1ha2UtYml0Y29pbi1tdWx0aS1hc3NldC1uZXR3b3JrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Lightning Labs Rolls Out 'Taproot Assets,' to Make Bitcoin 'Multi-Asset' Network - CoinDesk",
        "content": "\"The protocol only requires an issuer to make a single bitcoin transaction to mint an effectively unbounded amount of Taproot Assets, and all of the metadata describing those assets is stored off-chain, with only a cryptographic commitment to the assets stored on-chain,\" Gentry wrote in a direct message. \"Further, transacting with Taproot Assets over the Lightning Network will happen off-chain and will not touch the blockchain at all.\""
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE5L2JpdGNvaW4tZXRmLXJ1bW9yLWhhZC1hLXNpbHZlci1saW5pbmctYW5kLWl0cy1hcHBhcmVudC1pbi10aGUtY3J5cHRvLW9wdGlvbnMtbWFya2V0L9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE5L2JpdGNvaW4tZXRmLXJ1bW9yLWhhZC1hLXNpbHZlci1saW5pbmctYW5kLWl0cy1hcHBhcmVudC1pbi10aGUtY3J5cHRvLW9wdGlvbnMtbWFya2V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin ETF Rumor Had a Silver Lining and It's Apparent in the Crypto Options Market - CoinDesk",
        "content": "\"The short-lived pump we saw on the back of fake news on ETF approval provided a preview of what is to come in the event of BTC spot ETF approvals,\" said Dick Lo, the founder and CEO of quant-driven crypto trading firm TDX Strategies. \"The fact that BTC is holding well above $28k is encouraging and potentially shows that the market are under-invested and may be inclined to start building positions.\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTkvYml0Y29pbi1leWVzLTI5ay1kZWZ5aW5nLWZyZXNoLWNyeXB0by1sYXdzdWl0LXJhdGUtZmVhcnMv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xOS9iaXRjb2luLWV5ZXMtMjlrLWRlZnlpbmctZnJlc2gtY3J5cHRvLWxhd3N1aXQtcmF0ZS1mZWFycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Eyes $29K, Defying Fresh Crypto Lawsuit, Rate Fears; XRP Jumps 6% as SEC Drops Charges - CoinDesk",
        "content": "Also at work were U.S. Federal Reserve Chairman Jerome Powell's remarks at the Economic Club of New York. He said that inflation is still too high but rising long-term bond yields could mean less need for further interest rate hikes. Powell signaled the Fed will likely keep rates unchanged in November but kept the option open for a potential hike in December."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE5L2JpdGNvaW4tYXNzZXQtbWFuYWdlci1vbnJhbXAtdW52ZWlscy1tdWx0aXNpZy1wbGF0Zm9ybS1hZGRzLWJpdGdvLXRvLWN1c3RvZGlhbnMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE5L2JpdGNvaW4tYXNzZXQtbWFuYWdlci1vbnJhbXAtdW52ZWlscy1tdWx0aXNpZy1wbGF0Zm9ybS1hZGRzLWJpdGdvLXRvLWN1c3RvZGlhbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Asset Manager Onramp Unveils Multisig Platform, Adds BitGo to Custodians - CoinDesk",
        "content": "Tanguma said he believes bitcoin offers investors a degree of regulatory clarity that other digital assets lack. BTC's classification as a commodity by the U.S. Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC) is \"the only thing the [regulators] seem to agree on,\" he said."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5vbmxpbmVhdGhlbnMuY29tL3N0b3J5L25ld3MvbG9jYWwvMjAyMy8xMC8xOS9leC1hdGhlbnMtcmVzaWRlbnQtamFtZXMtamltbXktemhvbmctYml0Y29pbi1mcmF1ZC1mZWF0dXJlZC1ieS1jbmJjLzcxMjI2OTE0MDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Ex-Athens resident James 'Jimmy' Zhong Bitcoin fraud featured by CNBC - Online Athens",
        "content": "A new CNBC documentary details the story of James \"Jimmy\" Zhong and the 2019 Athens break-in that exposed a $3 billion cryptocurrency fraud.\n\n\"Crypto 911: Exposing a Bitcoin Billionaire\" shows never-seen-before footage and in-depth interviews with Athens-Clarke County police, a special agent with the IRS, a cyber intelligence expert and a private investigator. The half-hour feature was reported by CNBC's Eamon Javers and produced by Paige Tortorelli.\n\nZhong, who lived a lavish lifestyle using the billions of dollars he made of stolen cryptocurrency, was living on Ruth Street in Athens in March 2019, when he reported his home was burglarized while he was out of town. He came home to discover a window in a rear bedroom shattered and the thief had found a brief case that contained $400,000 cash and a USB thumb drive with personal information, according to the police report obtained by the Athens Banner-Herald.\n\nThat 911 call turned into a $3.36 billion bitcoin bust, described by the U.S. Attorney as the largest financial seizure ever by the Internal Revenue Service, according to previous reporting from the Athens Banner-Herald.\n\nIn 2012, Zhong hacked a site on the dark web called Silk Road, one of the earliest crypto marketplaces, where anonymous buyers and sellers exchanged all manner of illicit material. In the hack, Zhong stole 50,000 Bitcoins, which eventually increased in value to $3 billion.\n\nLawsuits by crime victims:Two Marsy's Law complaints filed against Western Circuit District Attorney\n\nAn investigation by ACCPD, the IRS and other agencies into Zhong’s Bitcoin finances led to a November 2021 search of Zhong’s home in Gainesville that resulted in the seizure of more than $3.36 billion in Bitcoin.\n\nWhen federal investigators searched Zhong’s home they seized bitcoin in an underground floor safe, bitcoin loaded on a computer that was hidden inside a popcorn tin, along with $661,900 cash and 11 1-ounce bars of silver and gold.\n\nThe ACCPD never solved the mystery of who burglarized Zhong, so he turned to private investigator Robin Martinelli, who owns and operates Martinelli Investigations in nearby Loganville, Georgia, according to CNBC.\n\nMartinelli looked through surveillance footage at his home, then surveilled Zhong's circle of friends. She said that they may have been using him a little bit, according to CNBC, and that he didn't like hearing about it.\n\nZhong told the police officer he felt the person who stole the money apparently knew him because he had hidden the brief case behind an air vent.\n\n\"Jimmy wanted to be loved,\" Martinelli told CNBC. \"Jimmy wanted friends.\"\n\nZhong plead guilty to wire fraud in November 2022 and was sentenced in April 2023 to one year and a day in federal prison. Zhong, 33, began his sentence at the federal prison camp in Montgomery, Alabama, on July 14, 2023, according to CNBC."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy13aGF0LXRlc2xhLWRpZC13aXRoLWl0cy1iaXRjb2luLWhvbGRpbmdzLWluLXEzLTIwMjMv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2hlcmVzLXdoYXQtdGVzbGEtZGlkLXdpdGgtaXRzLWJpdGNvaW4taG9sZGluZ3MtaW4tcTMtMjAyMy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Here’s What Tesla Did With its Bitcoin Holdings in Q3 2023 - CryptoPotato",
        "content": "Tesla’s Q3 2023 financial report reveals that the company did not trade or sell any Bitcoin during the last three months.\n\nAs of Sept. 30, Tesla still possesses around 9,720 BTC, valued at approximately $275.6 million based on current market rates.\n\nTesla Still Holds its Bitcoin\n\nAccording to Tesla’s recently released Q3 2023 financial report, the electric vehicle manufacturer did not engage in any Bitcoin buying or selling activities over the past three months.\n\nAs of Sept. 30, Tesla still held around 9,720 BTC, valued at approximately $275.6 million at current market prices. This marks the fifth consecutive quarter that Tesla has maintained its Bitcoin holdings without making any changes.\n\nMeanwhile, Tesla’s stock faced a 4.78% decline after the market closed today, with shares valued at $242.68 each. In addition to the information about Tesla’s Bitcoin holdings, the company reported revenue of $23.35 billion for the third quarter, slightly below the estimated $23.9 billion projected by analysts.\n\nTesla also reported adjusted earnings of 66 cents per share, falling short of the 73 cents per share expected.\n\nTesla’s History with Bitcoin\n\nTesla first ventured into cryptocurrency in early 2021 when it invested $1.5 billion in Bitcoin, as reported in a filing with the United States Securities and Exchange Commission (SEC). At that time, the company acquired 43,000 BTC at an estimated price of approximately $34,000 per coin. Simultaneously, Tesla started accepting Bitcoin as a payment option for its vehicles and other products.\n\nHowever, shortly after this initial investment, concerns arose about the environmental impact of Bitcoin mining. CEO Elon Musk expressed reservations about the cryptocurrency and decided to sell 4,320 BTC from Tesla’s holdings. This move coincided with a decline in Bitcoin’s value, resulting in a $101 million impairment loss for the company.\n\nTesla continued to sell its Bitcoin holdings, and by the second quarter of 2022, it had reportedly disposed of 75% of its holdings. Musk explained that this decision was influenced by uncertainties surrounding the duration of COVID lockdowns in China, and the company needed to bolster its cash reserves. Since then, Tesla has maintained a consistent stance on its Bitcoin holdings, as emphasized by its recently released Q3 2023 report."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOC9iaXRjb2luLWZpbmFuY2lhbC1zZXJ2aWNlcy1maXJtLXVuY2hhaW5lZC1sb29rcy10by1hdHRyYWN0LXdlYWx0aHktY2xpZW50cy13aXRoLW5ldy1hZHZpc29yeS1zZXJ2aWNlL9IBlgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOC9iaXRjb2luLWZpbmFuY2lhbC1zZXJ2aWNlcy1maXJtLXVuY2hhaW5lZC1sb29rcy10by1hdHRyYWN0LXdlYWx0aHktY2xpZW50cy13aXRoLW5ldy1hZHZpc29yeS1zZXJ2aWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Financial Services Firm Unchained Looks to Attract Wealthy Clients With New Advisory Service - CoinDesk",
        "content": "In attempting to attract the deep pockets of HNWIs and other institutional investors, crypto firms are looking to craft offerings providing services that they would expect in traditional finance, advisory being one of them."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE4L25vdm9ncmF0ei1zYXlzLWJpdGNvaW4tZXRmLXdpbGwtYmUtYXBwcm92ZWQtdGhpcy15ZWFyLWJ5LXRoZS1zZWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Novogratz Says Bitcoin ETF Will Be Approved This Year by the SEC - Bloomberg",
        "content": "Michael Novogratz says he expects the US Securities and Exchange Commission will finally approve exchange-traded funds that invest directly in Bitcoin this year.\n\n“It’s gonna get approved,” Novogratz, the founder and chief executive officer of Galaxy Digital Holdings Ltd., said during an interview on CNBC. “We actually think it’s gonna happen in 2023.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy90ZXNsYS1idGMtaG9sZGluZ3Mtc3RhYmxlLW11c2stY29vbHMtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Tesla BTC Holdings Not Going Anywhere As Musk Cools on Bitcoin - CCN.com",
        "content": "Key Takeaways\n\nElon Musk has previously made multiple commitments to not sell Bitcoin, and then changed his mind.\n\nTesla’s latest earnings report appears to show it kept hold of its share of BTC.\n\nIn recent years, Musk has turned his attention to the memecoin DOGE.\n\nBitcoin investors often look to companies with large crypto holdings like Tesla for clues on market sentiment. So Tesla’s latest earnings report will do nothing to excite holders of the world’s original cryptocurrency.\n\nConsidering Elon Musk’s famed ability to move markets with a single tweet (or “post”), perhaps Tesla’s Q3 earnings report showing stable Bitcoin holdings could be a welcome note of calm, considering the alternatives.\n\nTesla Appears To Cool on Bitcoin\n\nIt turns out Tesla’s love affair with Bitcoin may have cooled off significantly. The electric vehicle maker’s latest Q3 earnings report appears to show that its Bitcoin stash has remained unchanged for the fifth quarter in a row. The report did not explicitly mention Bitcoin, indicating that its holdings have remained the same.\n\nTesla is still holding steady at around 9,720 Bitcoins, valued at approximately $279 million as of October 19, 2023.\n\nThe car manufacturer made a big splash back in early 2021 by investing $1.5 billion in Bitcoin and saying it would accept the cryptocurrency for car payments. Those days are clearly over, however. After liquidating 75% of its crypto holdings last year at a hefty loss, and selling 4,320 Bitcoin in the first quarter of 2021, Tesla has pressed pause on any further Bitcoin buying or selling.\n\nIts current Bitcoin trove makes Tesla the third largest public company holder of crypto, trailing only MicroStrategy and Marathon Digital Holdings according to bitcointreasuries.net . But don’t expect that position to change anytime soon. While Tesla clocked lower earnings in Q3, down 44% year-over-year, crypto trading clearly isn’t the priority.\n\nCEO Elon Musk may have boosted Bitcoin prices back in the day by championing crypto. But Tesla’s breakup with Bitcoin seems pretty definitive now. The company dumped over 30,000 coins in mid-2022 and hasn’t touched its remaining crypto stash in months.\n\nMusk Was Never Much of a Fan\n\nDespite assumptions, the South-African born billionaire has never been a huge cheerleader of the world’s original cryptocurrency. Back in May 2021, Musk halted plans to accept Bitcoin for payments over rising concerns about its environmental impact.\n\nIn a tweet, the Tesla owner said the firm would be looking at other crypto alternatives, and that cryptocurrency itself was “a good idea on many levels.” Currently, the only cryptocurrency you can buy a Tesla with is DOGE, Musk’s personal favorite cryptocurrency.\n\nNot that you’d want to. According to Tesla’s official support page , orders placed with DOGE cannot be canceled, returned, or even refunded in the original form of payment if you accidentally overpay.\n\nLater that year in December, Musk explained his affinity for the memecoin, saying Bitcoin “just gives power to new rich people,” and “That’s why I’m pro doge.”\n\nIn July 2021, the billionaire explained he had no plans to sell any of his Bitcoin in the near future, and that he doesn’t believe in dumping when the price is high. “I would like to see Bitcoin succeed,” he said. As we know, Musk eventually changed his mind. SpaceX sold all of their Bitcoin holdings in August 2023, whilst Tesla sold Bitcoin in both 2021 and 2022."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1ob2xkcy0yOGstYXMtc3RvY2tzLWJ1Y2tsZS11bmRlci1pbnRlcmVzdC1yYXRlLWNvbmNlcm5zL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1ob2xkcy0yOGstYXMtc3RvY2tzLWJ1Y2tsZS11bmRlci1pbnRlcmVzdC1yYXRlLWNvbmNlcm5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Holds $28K as Stocks Buckle Under Interest Rate Concerns - CoinDesk",
        "content": "Socking the stock market indices is a new leg up in interest rates. The U.S. 30-year Treasury bond yield is higher by nine basis points to 5.02%. Should that level hold, it would be the first close above 5% for the long bond since the summer of 2007. The 10-year Treasury note yield is up seven basis points to 4.905%, also the highest yield since that summer."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8xOS9ncmF5c2NhbGUtZXRmLWNhc2VzLWZpbmFsLXdvcmQtY29taW5nLWluLWZlZGVyYWwtY291cnQtYXMtc2VjLWxvc3MtZm9ybWFsaXplZC_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTAvMTkvZ3JheXNjYWxlLWV0Zi1jYXNlcy1maW5hbC13b3JkLWNvbWluZy1pbi1mZWRlcmFsLWNvdXJ0LWFzLXNlYy1sb3NzLWZvcm1hbGl6ZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Grayscale ETF Case's Final Word Coming in Federal Court as SEC Loss Formalized - CoinDesk",
        "content": "According to procedure in such cases, the D.C. Circuit Court of Appeals had seven days to close the books on this matter after the SEC chose last week not to appeal the court's ruling that the agency must scrap its rejection of Grayscale's ETF application. That deadline is arriving on Friday, and there are a couple of possibilities for what the court does next: It can just terminate the case without comment, or it could issue some further direction to the SEC on what comes next."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE4L2V0aGVyLWNvdWxkLWNvbnRpbnVlLXRvLXVuZGVycGVyZm9ybS1iaXRjb2luLWFzLXVzLWJvbmQtbWFya2V0LWRpcy1pbnZlcnNpb24tcmVzdW1lcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) May Triumph Ether (ETH) Investments as U.S. Bonds Recover - CoinDesk",
        "content": "The spread between the 10- and two-year notes, another widely followed bond market gauge, has also dis-inverted by nearly 70 basis points to -0.34% in three months, raising the risk of broad-based risk aversion in financial markets."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctaGlnaC1jYW4tYml0Y29pbi1wcmljZS1nby0yMDI00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "How high can Bitcoin price go by 2024? - Cointelegraph",
        "content": "Bitcoin (BTC) is up over 70% so far in 2023, helped by a banking crisis and hopes about a spot BTC exchange-traded fund (ETF) approval in the United States.\n\nBTC/USD daily price chart. Source: TradingView\n\nSo, will Bitcoin price continue to climb for the rest of 2023? Cointelegraph takes a look at its chances and possible BTC price targets.\n\nRelated: BTC price models hint at $130K target after 2024 Bitcoin halving\n\n2020 Bitcoin price fractal eyes $50K\n\nBitcoin’s ongoing market trend looks very similar to its price action during the 2017 to 2020 period. Therefore, it can repeat a key breakout moment (the greened area) for a decisive bull run, argues popular BTC analyst Stockmoney Lizards.\n\nBTC/USD price performance comparison between 2020 and 2023. Source: TradingView/Stockmoney Lizards\n\nThe 2020 breakout preceded a Bitcoin bull run to its record high of $69,000 in November 2021. If a similar breakout occurs, the analyst sees BTC’s price climbing to the $45,000-$50,000 range by year’s end.\n\nUnlike Bitcoin’s 2020 price rally, however, Bitcoin is currently facing headwinds from the United States Federal Reserve's tightening, resulting in lower liquidity in the market.\n\nBitcoin's price is down 40% since April 2022 when the Federal Reserve's balance sheet reached its peak.\n\nStandard Chartered also sees Bitcoin at $50K\n\nStandard Chartered also predicts Bitcoin will reach $50,000 by the year's end.\n\nGeoff Kendrick, the global head of research and chief strategist at Standard Chartered, argues that increased miners’ profitability will reduce their need to sell BTC, leading to a lower supply against potential rising demand.\n\n“Increased miner profitability per BTC (Bitcoin) mined means they can sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,” Kendrick stated in a report.\n\nInterestingly, the number of Bitcoin held by miners surged during the Ordinals hype in May 2023, stabilizing since.\n\nBitcoin miner reserves in 2023. Source: CryptoQuant\n\nBitcoin price technical pattern hints at $32,000\n\nMeanwhile, one Bitcoin technical setup puts its year-end target near $32,000, also a recent price peak.\n\nNotably, BTC has entered the breakout stage of its prevailing bump-and-run reversal (BARR) Bottom pattern. The BARR Bottom pattern typically resolves after the price breaks above its descending trendline resistance and rises by as much as the pattern’s maximum height, as shown below.\n\nBTC/USD daily price chart ft. BARR breakout setup. Source: TradingView\n\nThe same BARR Bottom pattern played out accurately in Dogecoin’s case in June 2022. BTC price will be up another 12.75% by the end of 2023 if this pattern plays out as intended.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ncmF5c2NhbGUtbmV3LXNwb3QtYml0Y29pbi1ldGYtbnlzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Grayscale files for new spot Bitcoin ETF on NYSE Arca - Cointelegraph",
        "content": "Major cryptocurrency investment firm Grayscale Investments has filed a new application with the United States Securities and Exchange Commission (SEC) for a new spot Bitcoin (BTC) exchange-traded fund (ETF).\n\nOn Oct. 19, Grayscale submitted an S-3 form registration statement with the SEC, intending to list the shares of Grayscale Bitcoin Trust on the New York Stock Exchange (NYSE) Arca under the ticker symbol GBTC.\n\nThe new filing aligns with Grayscale’s ongoing effort to convert its Grayscale Bitcoin Trust into a spot Bitcoin ETF, according to a statement by Grayscale.\n\n“We remain committed to working collaboratively and expeditiously with the SEC on behalf of GBTC’s investors,” the firm wrote in the announcement.\n\nThe latest S-3 registration statement is a shorter filing version of a typical form S-1 statement that targets the initial public offering of equity securities registered under the Securities Act.\n\n“GBTC, however, is eligible to use Form S-3, a shorter filing that incorporates by reference its SEC disclosures and reports, because its shares have been registered under the Securities Exchange Act of 1934 since January 2020 and it meets the other requirements of the form,” Grayscale stated.\n\nThe firm mentioned that Grayscale would be able to convert GBTC to an ETF and issue shares on a registered basis once NYSE Arca’s 19b-4 application is approved and the Form S-3 must be declared effective by the SEC. The announcement added:\n\n“Importantly, GBTC is ready to operate as an ETF upon receipt of these regulatory approvals, and on behalf of GBTC’s investors, Grayscale looks forward to working collaboratively and expeditiously with the SEC on these matters.”\n\nThe news comes weeks after Grayscale won an SEC lawsuit for its spot Bitcoin ETF review, with the U.S. Court of Appeals for the District of Columbia Circuit ordering the SEC to explain why it rejected Grayscale’s application in June 2023. The company also filed with the SEC to list an Ether (ETH) futures ETF in September.\n\nRelated: Grayscale GBTC discount falls to 16% as markets bet on Bitcoin ETF approval\n\nGrayscale is one of several companies seeking the SEC’s approval to launch a spot Bitcoin ETF, including companies like ARK Investment, BlackRock, Fidelity and others.\n\nAccording to Bloomberg Intelligence analyst James Seyffart, BlackRock filed an updated Bitcoin ETF prospectus on Oct. 19 as well. The filing is “likely their response to SEC comments like we’ve seen from Ark, Fidelity, and others,” he said, adding that it brings “more confirmation that issuers are in talks with the SEC.”\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Beyond crypto: Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTIwL2JpdGNvaW4tYnRjLXJpdmFsLWV0aGVyLWV0aC1mYWx0ZXJzLWFzLXN0YWtpbmctZGVtYW5kLXdlYWtlbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Rival Ether (ETH) Falters as Staking Demand Weakens - Bloomberg",
        "content": "A key pillar of demand for Ether , the second-largest digital token, is weakening against a backdrop of elevated Treasury yields .\n\nCrypto investors can earn rewards by pledging Ether tokens to help operate the Ethereum blockchain, a return some cite as a potential prop for the coin. But the staking payout on pledged tokens has fallen to an annualized 3.5%, near the lowest in at least 10 months and well below a recent peak of more than 8%."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxvbmctdGVybS1pbnZlc3RvcnMtb3duLTc2LXBlcmNlbnQtYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Hodling hard: Bitcoin's long-term investors own over 76% of all BTC for the first time - Cointelegraph",
        "content": "Bitcoin (BTC) is becoming scarcer than ever — whether you are a BTC price speculator or new to the market.\n\nThe latest data from on-chain analytics firm Glassnode shows a record portion of the available BTC supply is locked up in long-term storage.\n\nBitcoin long-term holder presence beats all-time highs\n\nAt more than 76%, Bitcoin’s long-term holders (LTHs) control more of the BTC supply than at any point in history.\n\nDespite the supply increasing with every block, in percentage terms, the low-time preference Bitcoin investor cohort has a record market presence.\n\nAs noted by Charles Edwards, founder of quantitative Bitcoin and digital asset fund Capriole Investments, the achievement marks a first in Bitcoin’s lifespan.\n\n“A record 76.2% of the Bitcoin network is locked up with long-term holders today,” he wrote on X on Oct. 18.\n\n“Topping the record set in 2015. Less liquid supply means the same people are bidding on less coins. You do the math.”\n\nBitcoin long-term holder (LTH) % BTC supply share chart. Source: Charles Edwards/X\n\nEdwards referenced the knock-on effect of the LTH record — that coins available for other market participants are getting rarer.\n\nAn accompanying Glassnode chart shows LTHs increasing their BTC exposure dramatically from mid-2021 onward, “hodling” through the entirety of the subsequent bear market. Only during brief periods since has the percentage of supply that they control decreased.\n\nIn private comments to Cointelegraph, meanwhile, Edwards added that, while demand for Bitcoin itself fluctuates, the trend trajectory is clear.\n\n“I don’t mean demand is the same as 2015. I mean that for the same given demand and a reduced supply means price must go up — supply/demand economics,” he explained.\n\n“But in reality, demand has increased quite a lot since 2015, so it should put even more upward pressure on price for this cycle. We have never had Bitcoin’s supply this constricted going into a halving.”\n\nBTC speculators stay on the sidelines\n\nAs Cointelegraph reported, the opposite end of the spectrum to LTHs — short-term hodlers (STHs), or speculators — are also of major interest to market observers.\n\nRelated: BTC price models hint at $130K target after 2024 Bitcoin halving\n\nThe realized price of the STH cohort has functioned as support during much of this year, and this week, fresh data shows that the trend remains in play.\n\nThe STH realized price — the price at which all STH-owned coins last moved — sits at just below $27,000, and BTC/USD breaking above it this week is an important bullish impetus, analysis says.\n\nData from Cointelegraph Markets Pro and TradingView shows Bitcoin holding $28,000 support after hitting two-month highs.\n\nBTC/USD 1-day chart. Source: TradingView\n\nIn August, meanwhile, the historically low BTC exposure among STH entities was already on the radar.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY291bGQtYml0Y29pbi1iZS1nZWFyaW5nLXVwLWZvci1hLXllYXItZW5kLWJ1bGwtcnVuL9IBZ2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY291bGQtYml0Y29pbi1iZS1nZWFyaW5nLXVwLWZvci1hLXllYXItZW5kLWJ1bGwtcnVuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Could Bitcoin Be Gearing Up for a Year End Bull Run? - Finance Magnates",
        "content": "As the year comes to an end, cryptocurrency enthusiasts and investors are focusing on Bitcoin, the world's most renowned digital asset. Bitcoin has a history of generating big year-end rallies, prompting the moniker \"Santa Claus rally\" to be coined in the crypto community. With a variety of factors at play, including macroeconomic conditions and institutional acceptance, everyone is wondering whether Bitcoin is ready for another year-end bull run.\n\nBitcoin's Year-End Performance\n\nSince its introduction, Bitcoin's performance in the closing months of the year has been widely monitored. Historically, Bitcoin has had spectacular price increases in the later half of the year, notably in November and December. Several factors have been attributed to this phenomena by analysts.\n\nIncreased trading activity as investors restructure their portfolios before the end of the year is one important aspect. Tax considerations, portfolio rebalancing, and the prospect of a new year's start all contribute to increasing demand for Bitcoin and other cryptocurrencies.\n\nFurthermore, the holiday season tends to instill a sense of optimism and risk-taking in financial markets, and Bitcoin is no exception. As investors look for ways to end the year on a high note, the cryptocurrency market frequently sees an increase in trade volumes and bullish mood.\n\nKeep Reading TradingView Enhances DeFi Tools on Polygon via QuickSwap Partnership\n\nMarket maturation and institutional adoption\n\nThe growing participation of institutional investors in the cryptocurrency industry has been one of the most significant events in the last year. Companies such as Tesla, Square, and MicroStrategy have made high-profile endorsements and investments in the company.\n\nInstitutional adoption adds legitimacy and stability to the cryptocurrency market that was previously lacking. Institutional investors have a longer investment horizon, and their participation has aided Bitcoin's maturity as an asset class.\n\nFurthermore, the emergence of Bitcoin futures and other financial products on established exchanges has made it easier for institutions to have exposure to Bitcoin. This accessibility has not only increased demand, but has also allowed institutions to efficiently hedge their bets.\n\nThe Role of Macro Factors\n\nAside from crypto-specific dynamics, macroeconomic variables have had a substantial impact on Bitcoin's performance. Concerns have been made concerning inflation and currency depreciation as a result of unprecedented fiscal stimulus measures implemented by governments around the world in reaction to the COVID-19 epidemic.\n\nBitcoin, sometimes known as \"digital gold,\" has being marketed as a hedge against these economic concerns. Investors looking to preserve their assets from the potential depreciation of fiat currencies have turned to Bitcoin as a store of value.\n\nFurthermore, the low-interest-rate environment, combined with the possibility of negative real yields, has made traditional assets such as bonds and cash less appealing. In such an environment, Bitcoin's potential for high returns has piqued the interest of investors looking for alternative investments.\n\nRegulatory Advances\n\nWhile institutional adoption has given the crypto market credibility, regulatory events continue to be a cause of concern. Governments and authorities throughout the world are debating how to approach and regulate cryptocurrencies.\n\nClear and friendly regulatory frameworks can help the crypto market by creating trust in investors. Regulatory crackdowns or negative verdicts, on the other hand, might have a chilling impact.\n\nMarket participants are keeping a close eye on regulatory developments, particularly in the United States, where politicians are debating prospective laws governing cryptocurrencies and digital assets.\n\nMarket Attitudes and Technical Analysis\n\nAside from fundamental reasons, market sentiment and technical analysis frequently play an important influence in Bitcoin price changes. Traders and analysts employ a variety of techniques and indicators to assess market sentiment and forecast price changes.\n\nThe study of price charts and trends to determine probable entry and exit locations is known as technical analysis. To make informed trading decisions, traders employ indicators such as moving averages, the Relative Strength Index (RSI), and Fibonacci retracement levels.\n\nNews events, social media debates, and overall market attitude can all have an impact on market sentiment. Positive news, such as prominent corporations investing in Bitcoin, can feed optimistic enthusiasm, whilst negative news or regulatory developments can have the opposite impact.\n\nChallenges and Threats\n\nWhile the prospect of a year-end Bitcoin bull run is appealing, it is critical to understand the limitations and hazards connected with cryptocurrency investing. The price volatility of Bitcoin can result in big gains, but it also entails the danger of significant losses.\n\nBefore making investing decisions in the cryptocurrency market, investors should proceed with care and undertake extensive study. Diversification and risk management measures are critical for limiting the hazards associated with bitcoin investments.\n\nFurthermore, the bitcoin market is open 24 hours a day, seven days a week, and price changes can occur at any time. Investors should brace themselves for both short-term and long-term market swings.\n\nPast Performance No Guarantee of Future Results\n\nAs we approach the end of the year, predictions for Bitcoin's future value have already begun circulating in the cryptocurrency space. Analysts and experts have turned to historical data to make forecasts, but they also acknowledge that past performance doesn't guarantee future results.\n\nFor 2024, the range of Bitcoin price predictions is quite wide, indicating the uncertainty surrounding the cryptocurrency market's future.\n\nIn 2023, Bitcoin saw a remarkable increase of over 70%, largely driven by hopes of a banking crisis and the approval of a spot Bitcoin exchange-traded fund (ETF) in the United States. This surge in value led some to draw parallels between the market trends in 2023 and the period from 2017 to 2020.\n\nSome analysts suggest that the current market trend appears reminiscent of the price movement leading up to Bitcoin's historic peak of $69,000 in November 2021. This has sparked speculation that a significant breakout could happen once again, potentially setting the stage for a sustained bull run.\n\nDrawing from the analogy with the 2020 breakout, one might posit that Bitcoin might reach a price range of $45,000 to $50,000 by the end of 2024 if a similar pattern unfolds.\n\nHowever, the cryptocurrency landscape is in a different place than it was in 2020. Today, Bitcoin faces challenges posed by the tightening regulatory policies of the U.S. Federal Reserve and other financial authorities. These policy changes could have a substantial impact on the future of Bitcoin and the broader cryptocurrency market.\n\nAs investors eagerly await the new year, it's crucial to remember that while past performance can offer insights, cryptocurrency markets are highly volatile and influenced by various unpredictable factors. Thus, Bitcoin's future trajectory remains uncertain, and investors should approach these forecasts with a degree of caution.\n\nConclusion: The Uncertain Future\n\nThe question of whether Bitcoin will have a year-end bull run remains unanswered. While historical trends, institutional acceptance, and macroeconomic considerations all contribute to a favorable backdrop, the cryptocurrency market is notorious for its volatility.\n\nBitcoin and other cryptocurrencies should be approached by investors with a thorough grasp of the dangers and a long-term perspective. Whether or not a year-end boom occurs, Bitcoin's function as a digital asset and store of value continues to expand, impacting the broader financial and investment landscape."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctYnVsbGlzaC1pcy1iaXRjb2luLWhhbHZpbmctZm9yLWJ0Yy1wcmljZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Just how bullish is the Bitcoin halving for BTC price? Experts debate - Cointelegraph",
        "content": "A recent panel at the Swan Pacific Bitcoin Festival was cleverly titled “Are halving price cycles bullshit?” Throughout the discussion, the host and founder of The Bitcoin Layer, Nik Bhatia, asked Marathon Digital CEO Fred Thiel, Swan chief investment officer Ralph Zagury and Swan product manager Andy Edstrom to share their thoughts on whether the Bitcoin halving is truly a bullish event or just another narrative that novice investors buy into.\n\nWhile the panel’s headline might be off-putting for some, the inquiry is of great interest to all manner of Bitcoin (BTC) and cryptocurrency investors. The conventional belief held by many in the space is that the Bitcoin supply halving is a bullish phenomenon that, when complete, is followed by near-parabolic upside in BTC’s price.\n\nGo and ask any Bitcoin lover about what they’re most excited about in the next year, and if they don’t mention the chance for a spot Bitcoin exchange-traded fund approval first, they’re probably going to say the upcoming halving event.\n\nPrevious Bitcoin halving events have coincided with bull markets ramping up.\n\n\n\nBut will the macro conditions be ripe for that next year in May?\n\n\n\n~ If we are past the initial shock of a recession.\n\n~ If a spot BTC ETF is approved.\n\n~ If QE is back on the menu.\n\n\n\nThen the planets will… pic.twitter.com/g5dEEKiSMF — ecoinometrics (@ecoinometrics) September 6, 2023\n\nWhile previous performance does provide some compelling evidence for what might happen in the next halving, questioning long-held assertions and price expectations for a high-volatility asset like Bitcoin is probably something every investor should do more often — especially when considering the number of bearish events that have occurred in the past two years.\n\nTo start the discussion, host Bhatia jumped right in by asking whether the halving is the main driver of the Bitcoin price.\n\nThiel quickly responded with:\n\n“In this cycle, no, I think it’s liquidity.”\n\nZagury agreed, adding that “flow is really what drives the market, so the halving, by definition, there’s nothing on it that should impact price.” Interestingly, Edstrom took a different position:\n\n“I think the halving is still bullish, and we can debate what the magnitude of that effect is. But yeah, I think it still matters for price.”\n\nEach panelist, including host Bhatia, seemed to agree that, while the halving may possess some market-moving capacity, it could be diminishing over time. According to Bhatia:\n\n“The halving affects supply. It is less and less material as time goes on, and it does nothing to affect demand. But from a psychological perspective, we might be able to play devil’s advocate.”\n\nHalving hype and hopium is all in investors’ heads\n\nPanelists at the “Are halving price cycles bullshit?” panel. Source: Swan Bitcoin YouTube\n\nSpeculation is essentially at the root of all investing, and while Zagury and Thiel are of the mind that investors attribute more hope than fact to the forecast impact of the Bitcoin halving, Edstrom sees the event as the manifestation of a “psychological feedback loop coming into the demand side.”\n\n“We think that Bitcoin price is going to be higher in the future, and by extension, we are applying a lens of investment as we’re investing in Bitcoin.”\n\nAnother popular, yearslong-held belief by many investors is the role derivatives play in Bitcoin’s price discovery. Bhatia asked whether derivatives played a larger role than spot trading in impacting Bitcoin’s price action, and Zagury said:\n\n“The reality is that the data points we have, in terms of halving, are not enough to come to any conclusion. If you look historically at Bitcoin price, we’ve got the whole data set of price, and you try to find patterns of distribution of how returns actually work. Very quickly, you see that there’s a lot of outer correlation, which means that price depends on time and also past performance.”\n\nAccording to Zagury, “A thing about Bitcoin, which is super curious — and I think there isn’t any other asset class like this out there — is that most of the time, Bitcoin is moving either sideways, in terms of number of days, it’s either sideways or down.”\n\nRelated: BTC price models hint at $130K target after 2024 Bitcoin halving\n\nBitcoin’s time spent trading in a rangebound band or in a downtrend is what Zagury said “makes it really hard to hodl, right, because it means you’re going to have months and years of pain, and you’re going to have days of glory.”\n\n“Being a hodler by definition, by distribution of prices that you see historically, it’s extremely hard.”\n\nPeddling back to the initial question about the role derivatives play in Bitcoin price discovery, Zagury said:\n\n“When we talk about derivatives, the first thing you’re going to talk about is probability. It’s impossible to conclude what is really going to happen with Bitcoin price. That’s the first thing that you conclude by looking at historical returns. Going back to the halving, the fact that it actually outer correlates a lot, sometimes, in particular times of low liquidity. A small move that bumps the price up, the marginal seller out there will go through the short-term sellers, and then the price will jump up significantly. This explains why price moves up very, very quickly.”\n\nLiquidity will be the focal point\n\nDespite discounting the impact of Bitcoin supply halvings on BTC’s price, each panelist expressed their positive, longer-term bullish perspectives on Bitcoin’s value.\n\nWith liquidity being the agreed-upon future price catalyst for Bitcoin, Zagury said:\n\n“I’m very bullish. I think we are going to see that soon because liquidity has been drawing down, and we see that these things are starting to happen, and it’s not going to take a lot for us to see a very big move.”\n\nWhen asked when and how this all-important liquidity comes back, Edstrom hinted that 10-year United States Treasurys pushing above 5%, the potential regional bank failures that mirror the ones seen six months ago, and the rising number of banks holding long-duration government debt at a loss are all signs that a Federal Reserve pivot returning to quantitative easing could occur sooner than later.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnNpbXBsaWxlYXJuLmNvbS90dXRvcmlhbHMvYmxvY2tjaGFpbi10dXRvcmlhbC9ibG9ja2NoYWluLXRlY2hub2xvZ3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "What is Blockchain Technology? How Does Blockchain Work? [Updated] - Simplilearn",
        "content": "Reviewed and fact-checked by Sayantoni Das\n\nOver the past few years, you have consistently heard the term ‘blockchain technology,’ probably regarding cryptocurrencies, like Bitcoin. In fact, you may be asking yourself, “what is blockchain technology?” It seems like blockchain is a platitude but in a hypothetical sense, as there is no real meaning that the layman can understand easily. It is imperative to answer “what is blockchain technology, “including the technology that is used, how it works, and how it’s becoming vital in the digital world.\n\nAs blockchain continues to grow and become more user-friendly, the onus is on you to learn this evolving technology to prepare for the future. If you are new to blockchain, then this is the right platform to gain solid foundational knowledge. In this article, you learn how to answer the question, “what is blockchain technology?” You’ll also learn how blockchain works, why it’s important, and how you can use this field to advance your career.\n\nWhat Is Blockchain Technology?\n\nBlockchain is a method of recording information that makes it impossible or difficult for the system to be changed, hacked, or manipulated. A blockchain is a distributed ledger that duplicates and distributes transactions across the network of computers participating in the blockchain.\n\nBlockchain technology is a structure that stores transactional records, also known as the block, of the public in several databases, known as the “chain,” in a network connected through peer-to-peer nodes. Typically, this storage is referred to as a ‘digital ledger.’\n\nEvery transaction in this ledger is authorized by the digital signature of the owner, which authenticates the transaction and safeguards it from tampering. Hence, the information the digital ledger contains is highly secure.\n\nIn simpler words, the digital ledger is like a Google spreadsheet shared among numerous computers in a network, in which, the transactional records are stored based on actual purchases. The fascinating angle is that anybody can see the data, but they can’t corrupt it.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nDive into the transformative world of blockchain technology with our intensive Cyber security Bootcamp. Uncover the revolutionary potential of blockchain while honing your skills in safeguarding these decentralized systems. From understanding the intricacies of smart contracts to fortifying digital transactions, this bootcamp equips you to navigate the evolving landscape of cybersecurity within the blockchain domain. Don't miss this opportunity to become a proficient cybersecurity professional in the realm of blockchain.\n\nWhy is Blockchain Popular?\n\nSuppose you are transferring money to your family or friends from your bank account. You would log in to online banking and transfer the amount to the other person using their account number. When the transaction is done, your bank updates the transaction records. It seems simple enough, right? There is a potential issue which most of us neglect.\n\nThese types of transactions can be tampered with very quickly. People who are familiar with this truth are often wary of using these types of transactions, hence the evolution of third-party payment applications in recent years. But this vulnerability is essentially why Blockchain technology was created.\n\nTechnologically, Blockchain is a digital ledger that is gaining a lot of attention and traction recently. But why has it become so popular? Well, let’s dig into it to fathom the whole concept.\n\nRecord keeping of data and transactions are a crucial part of the business. Often, this information is handled in house or passed through a third party like brokers, bankers, or lawyers increasing time, cost, or both on the business. Fortunately, Blockchain avoids this long process and facilitates the faster movement of the transaction, thereby saving both time and money.\n\nMost people assume Blockchain and Bitcoin can be used interchangeably, but in reality, that’s not the case. Blockchain is the technology capable of supporting various applications related to multiple industries like finance, supply chain, manufacturing, etc., but Bitcoin is a currency that relies on Blockchain technology to be secure.\n\nBlockchain is an emerging technology with many advantages in an increasingly digital world:\n\nHighly Secure It uses a digital signature feature to conduct fraud-free transactions making it impossible to corrupt or change the data of an individual by the other users without a specific digital signature.\n\nIt uses a digital signature feature to conduct fraud-free transactions making it impossible to corrupt or change the data of an individual by the other users without a specific digital signature. Decentralized System Conventionally, you need the approval of regulatory authorities like a government or bank for transactions; however, with Blockchain, transactions are done with the mutual consensus of users resulting in smoother, safer, and faster transactions.\n\nConventionally, you need the approval of regulatory authorities like a government or bank for transactions; however, with Blockchain, transactions are done with the mutual consensus of users resulting in smoother, safer, and faster transactions. Automation Capability It is programmable and can generate systematic actions, events, and payments automatically when the criteria of the trigger are met.\n\nStructure and Design of Blockchain\n\nA blockchain is a distributed, immutable, and decentralized ledger at its core that consists of a chain of blocks and each block contains a set of data. The blocks are linked together using cryptographic techniques and form a chronological chain of information. The structure of a blockchain is designed to ensure the security of data through its consensus mechanism which has a network of nodes that agree on the validity of transactions before adding them to the blockchain.\n\nBlocks:\n\nA block in a blockchain is a combination of three main components:\n\n1. The header contains metadata such as a timestamp which has a random number used in the mining process and the previous block's hash.\n\n2. The data section contains the main and actual information like transactions and smart contracts which are stored in the block.\n\n3. Lastly, the hash is a unique cryptographic value that works as a representative of the entire block which is used for verification purposes.\n\nBlock Time:\n\nBlock time refers to the time taken to generate a new block in a blockchain. Different blockchains have different block times, which can vary from a few seconds to minutes or may be in hours too. Shorter block times can give faster transaction confirmations but the result has higher chances of conflicts but the longer block times may increase the timing for transaction confirmations but reduce the chances of conflicts.\n\nHard Forks:\n\nA hard fork in a blockchain refers to a permanent divergence in the blockchain's history that results in two separate chains. It can happen due to a fundamental change in the protocol of a blockchain and all nodes do not agree on the update. Hard forks can create new cryptocurrencies or the splitting of existing ones and It requires consensus among the network participants to resolve.\n\nDecentralization:\n\nDecentralization is the key feature of blockchain technology. In a decentralized blockchain, there is no single central authority that can control the network. In decentralization,the decision-making power is distributed among a network of nodes that collectively validate and agree on the transactions to be added to the blockchain. This decentralized nature of blockchain technology helps to promote transparency, trust, and security. It also reduces the risk to rely on a single point of failure and minimizes the risks of data manipulation.\n\nFinality:\n\nFinality refers to the irreversible confirmation of transactions in a blockchain. If and when a transaction is added to a block and the block is confirmed by the network, it becomes immutable and cannot be reversed. This feature ensures the integrity of the data and prevents double spending, providing a high level of security and trust in Blockchain Types & Sustainability\n\nOpenness:\n\nOpenness in blockchain technology makes the blockchain accessible to anyone who intends to participate in the network. This implies that it is open for all and anyone can join the network, validate transactions, and can add new blocks to the blockchain, so long as they know the consensus rules. Openness promotes inclusivity, transparency, and innovation, as it allows for participation from various stakeholders.\n\nPublic Blockchain:\n\nIt is a kind of blockchain which is open for the public and allows everyone to join the network to perform transactions and to participate in the consensus process. Public blockchains are transparent, because all transactions are publicly recorded.\n\nHow Does Blockchain Technology Work?\n\nIn recent years, you may have noticed many businesses around the world integrating Blockchain technology. But how exactly does Blockchain technology work? Is this a significant change or a simple addition? The advancements of Blockchain are still young and have the potential to be revolutionary in the future; so, let’s begin demystifying this technology.\n\nBlockchain is a combination of three leading technologies:\n\nCryptographic keys A peer-to-peer network containing a shared ledger A means of computing, to store the transactions and records of the network\n\nCryptography keys consist of two keys – Private key and Public key. These keys help in performing successful transactions between two parties. Each individual has these two keys, which they use to produce a secure digital identity reference. This secured identity is the most important aspect of Blockchain technology. In the world of cryptocurrency, this identity is referred to as ‘digital signature’ and is used for authorizing and controlling transactions.\n\nThe digital signature is merged with the peer-to-peer network; a large number of individuals who act as authorities use the digital signature in order to reach a consensus on transactions, among other issues. When they authorize a deal, it is certified by a mathematical verification, which results in a successful secured transaction between the two network-connected parties. So to sum it up, Blockchain users employ cryptography keys to perform different types of digital interactions over the peer-to-peer network.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nTypes of Blockchain\n\nThere are different types of blockchains. They are as follows:\n\nPrivate Blockchain Networks\n\nPrivate blockchains operate on closed networks, and tend to work well for private businesses and organizations. Companies can use private blockchains to customize their accessibility and authorization preferences, parameters to the network, and other important security options. Only one authority manages a private blockchain network.\n\nPublic Blockchain Networks\n\nBitcoin and other cryptocurrencies originated from public blockchains, which also played a role in popularizing distributed ledger technology (DLT). Public blockchains also help to eliminate certain challenges and issues, such as security flaws and centralization. With DLT, data is distributed across a peer-to-peer network, rather than being stored in a single location. A consensus algorithm is used for verifying information authenticity; proof of stake (PoS) and proof of work (PoW) are two frequently used consensus methods.\n\nPermissioned Blockchain Networks\n\nAlso sometimes known as hybrid blockchains, permissioned blockchain networks are private blockchains that allow special access for authorized individuals. Organizations typically set up these types of blockchains to get the best of both worlds, and it enables better structure when assigning who can participate in the network and in what transactions.\n\nConsortium Blockchains\n\nSimilar to permissioned blockchains, consortium blockchains have both public and private components, except multiple organizations will manage a single consortium blockchain network. Although these types of blockchains can initially be more complex to set up, once they are running, they can offer better security. Additionally, consortium blockchains are optimal for collaboration with multiple organizations.\n\nHybrid Blockchains\n\nHybrid blockchains are the combination of both public and private blockchains. In a hybrid blockchain, some parts of the blockchain are public and transparent, while others are private and accessible only to authorized and specific participants. This makes hybrid blockchains ideal for use in those cases where a balance is required between transparency and privacy. For example, in supply chain management multiple parties can access certain information, but sensitive data can be kept private.\n\nSidechains\n\nSidechains are different blockchains that run parallel to the main blockchain, allowing for additional functionality and scalability. Sidechains enable developers to experiment with new features and applications without affecting the main blockchain's integrity. For example, sidechains can be used for creating decentralized applications and to implement specific consensus mechanisms. Sidechains can also be used to handle transactions of the main blockchain to reduce congestion and increase scalability.\n\nBlockchain Layers\n\nBlockchain layers refer to the concept of building multiple layers of blockchains on top of each other. Each layer can have its own consensus mechanism, rules, and functionality which can interact with other layers. This ensures greater scalability, as transactions can be processed in parallel across different layers. For example, the Lightning Network, built on top of the Bitcoin blockchain, is a second layer solution that enables faster and cheaper transactions by creating payment channels between users.\n\nThe Process of Transaction\n\nOne of Blockchain technology’s cardinal features is the way it confirms and authorizes transactions. For example, if two individuals wish to perform a transaction with a private and public key, respectively, the first person party would attach the transaction information to the public key of the second party. This total information is gathered together into a block.\n\nThe block contains a digital signature, a timestamp, and other important, relevant information. It should be noted that the block doesn’t include the identities of the individuals involved in the transaction. This block is then transmitted across all of the network's nodes, and when the right individual uses his private key and matches it with the block, the transaction gets completed successfully.\n\nIn addition to conducting financial transactions, the Blockchain can also hold transactional details of properties, vehicles, etc.\n\nHere’s a use case that illustrates how Blockchain works:\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program Hash Encryptions blockchain technology uses hashing and encryption to secure the data, relying mainly on the SHA256 algorithm to secure the information. The address of the sender (public key), the receiver’s address, the transaction, and his/her private key details are transmitted via the SHA256 algorithm. The encrypted information, called hash encryption, is transmitted across the world and added to the blockchain after verification. The SHA256 algorithm makes it almost impossible to hack the hash encryption, which in turn simplifies the sender and receiver’s authentication.\n\nblockchain technology uses hashing and encryption to secure the data, relying mainly on the SHA256 algorithm to secure the information. The address of the sender (public key), the receiver’s address, the transaction, and his/her private key details are transmitted via the SHA256 algorithm. The encrypted information, called hash encryption, is transmitted across the world and added to the blockchain after verification. The SHA256 algorithm makes it almost impossible to hack the hash encryption, which in turn simplifies the sender and receiver’s authentication. Proof of Work In a Blockchain, each block consists of 4 main headers. Previous Hash: This hash address locates the previous block. Transaction Details: Details of all the transactions that need to occur. Nonce: An arbitrary number given in cryptography to differentiate the block’s hash address. Hash Address of the Block: All of the above (i.e., preceding hash, transaction details, and nonce) are transmitted through a hashing algorithm. This gives an output containing a 256-bit, 64 character length value, which is called the unique ‘hash address.’ Consequently, it is referred to as the hash of the block. Numerous people around the world try to figure out the right hash value to meet a pre-determined condition using computational algorithms. The transaction completes when the predetermined condition is met. To put it more plainly, Blockchain miners attempt to solve a mathematical puzzle, which is referred to as a proof of work problem. Whoever solves it first gets a reward.\n\nIn a Blockchain, each block consists of 4 main headers.\n\nMining In Blockchain technology, the process of adding transactional details to the present digital/public ledger is called ‘mining.’ Though the term is associated with Bitcoin, it is used to refer to other Blockchain technologies as well. Mining involves generating the hash of a block transaction, which is tough to forge, thereby ensuring the safety of the entire Blockchain without needing a central system.\n\nHistory of Blockchain\n\nSatoshi Nakamoto, whose real identity still remains unknown to date, first introduced the concept of blockchains in 2008. The design continued to improve and evolve, with Nakamoto using a Hashcash-like method. It eventually became a primary component of bitcoin, a popular form of cryptocurrency, where it serves as a public ledger for all network transactions. Bitcoin blockchain file sizes, which contained all transactions and records on the network, continued to grow substantially. By August 2014, it had reached 20 gigabytes, and eventually exceeded 200 gigabytes by early 2020.\n\nAdvantages and Disadvantages of Blockchain\n\nLike all forms of technology, blockchain has several advantages and disadvantages to consider.\n\nAdvantages\n\nOne major advantage of blockchains is the level of security it can provide, and this also means that blockchains can protect and secure sensitive data from online transactions. For anyone looking for speedy and convenient transactions, blockchain technology offers this as well. In fact, it only takes a few minutes, whereas other transaction methods can take several days to complete. There is also no third-party interference from financial institutions or government organizations, which many users look at as an advantage.\n\nDisadvantages\n\nBlockchain and cryptography involves the use of public and private keys, and reportedly, there have been problems with private keys. If a user loses their private key, they face numerous challenges, making this one disadvantage of blockchains. Another disadvantage is the scalability restrictions, as the number of transactions per node is limited. Because of this, it can take several hours to finish multiple transactions and other tasks. It can also be difficult to change or add information after it is recorded, which is another significant disadvantage of blockchain.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nHow is Blockchain Used?\n\nBlockchains store information on monetary transactions using cryptocurrencies, but they also store other types of information, such as product tracking and other data. For example, food products can be tracked from the moment they are shipped out, all throughout their journey, and up until final delivery. This information can be helpful because if there is a contamination outbreak, the source of the outbreak can be easily traced. This is just one of the many ways that blockchains can store important data for organizations.\n\nHyperledger, Hosted by the Linux Foundation\n\nHyperledger is a global collaboration hosted by The Linux Foundation, including finance, banking, IoT, supply chain, manufacturing, and technology leaders. By creating a cross-industry open standard for distributed ledgers, Hyperledger Fabric allows developers to develop blockchain applications to meet specific needs.\n\nTen Steps to Your First Blockchain Application\n\nUnderstand what Blockchain is and its key components. Understand the purpose of your application. Create a use case for your application. Find out if there's already an existing blockchain for your purpose. Explore the different types of Blockchain platforms available for your application. There are many types of Blockchain, each with its strengths and weaknesses. Choose the right platform for developing your app. Select the consensus algorithm you will use. Learn Solidity - Ethereum's programming language for smart contracts and DApps (decentralized applications). Learn how to use Truffle or Remix - development tools for Ethereum DApps and smart contracts. Get an Ethereum account or wallet and buy some Ether (ETH), the currency of the Ethereum network.\n\nDecentralization\n\nDecentralization is difficult to Understand, but it is vital in the world today; decentralization is distributing or dispersing functions, powers, people, or things away from a central location or authority. Within the business world, decentralization typically refers to delegating authority from senior executives to middle managers and other employees further down the organizational hierarchy. The benefits of devolution are many and varied, but the most commonly cited advantages include improved communication, greater employee empowerment, and increased flexibility and responsiveness.\n\nTransparency\n\nOne of the most critical aspects of decentralization is transparency. All employees have access to information and decision-making processes in a decentralized organization. This transparency fosters a greater sense of trust and cooperation among employees. Furthermore, it allows employees to hold managers accountable for their decisions.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nBitcoin vs. Blockchain\n\nBitcoin is a digital currency that was first introduced in 2009 and has been the most popular and successful cryptocurrency to date. Bitcoin's popularity is attributed to its decentralized nature, which means it doesn't have a central authority or bank controlling its supply. This also means that transactions are anonymous, and no transaction fees are involved when using bitcoin.\n\nBlockchain is a database of transactions that have taken place between two parties, with blocks of data containing information about each transaction being added in chronological order to the chain as it happens. The Blockchain is constantly growing as new blocks are added to it, with records becoming more difficult to change over time due to the number of blocks created after them.\n\nBlockchain vs. Banks\n\nBlockchain has the potential to revolutionize the banking industry. Banks need to be faster to adapt to the changing needs of the digital age, and Blockchain provides a way for them to catch up. By using Blockchain, banks can offer their customers a more secure and efficient way to conduct transactions. In addition, Blockchain can help banks to streamline their operations and reduce costs.\n\nWhy is Blockchain Important?\n\nBlockchain is important because it has the potential to revolutionize the banking industry. Banks need to be faster to adapt to the changing needs of the digital age, and Blockchain provides a way for them to catch up. By using Blockchain, banks can offer their customers a more secure and efficient way to conduct transactions. In addition, Blockchain can help banks to streamline their operations and reduce costs.\n\nWhat is a Blockchain Platform?\n\nA blockchain platform is a shared digital ledger that allows users to record transactions and share information securely, tamper-resistant. A distributed network of computers maintains the register, and each transaction is verified by consensus among the network participants.\n\nProof of Work (PoW) vs. Proof of Stake (PoS)\n\nProof of work (PoW) is an algorithm to create blocks and secure the Blockchain. It requires miners to solve a puzzle to create a block and receive the block reward in return.\n\nProof of stake (PoS) is an alternative algorithm for securing the Blockchain, which does not require mining. Instead, users must lock up some of their coins for a certain time to be eligible for rewards.\n\nEnergy Consumption Concerns of Blockchain\n\nThe main concern with blockchain technology is its energy consumption. Traditional blockchains like Bitcoin and Ethereum, use a consensus mechanism called PoW( Proof of Work), which requires computational power and electricity to solve complex mathematical puzzles. This energy-intensive process has raised concerns about the environmental impact of blockchain technology because it produces carbon emissions and consumes a huge amount of electricity.\n\nBlockchain or Scalability Trilemma: Decentralization, Security, and Scalability\n\nBlockchain is a distributed database that maintains a continuously growing list of records called blocks. Blockchain is often said to have the potential to disrupt many industries, including banking, law, and healthcare.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat are the Benefits of Blockchains Over Traditional Finance?\n\nBlockchain offers several potential advantages over traditional finance. One of the most touted advantages is that Blockchain is decentralized, while traditional finance is centralized. This means there is no single point of failure in a blockchain system. Another advantage of Blockchain is that it is more transparent than traditional finance.\n\nPromising Blockchain Use Cases and Killer Applications\n\nPromising Blockchain Use Cases and Killer Applications: Although there are many potential applications for blockchain technology, there are a few that stand out as having the potential to be truly game-changing. These are often referred to as killer applications. Some of the most promising killer applications for blockchain technology include supply chain management, identity management, and data management.\n\nPromising blockchain use cases and killer applications are being developed every day. The Shiba Inu team is committed to finding and developing the most promising applications for the SHIB community. The team has a proven track record in the cryptocurrency space, and they are committed to creating value for the SHIB community.\n\nHow to Invest in Blockchain Technology\n\nBlockchain technology and stocks can be a lucrative investment, and there are several ways to take the next step toward making your first blockchain investment purchase. Bitcoin is typically the first thing that comes to mind when it comes to investing in blockchain technology, and it shouldn’t be overlooked. Aside from Bitcoin, there is also the option of investing in cryptocurrency penny stocks, such as Altcoin and Litecoin. There are also certain apps and services that are in the pre-development phase and that are using blockchain technology to raise funding. As an investor, you can buy coins, with the expectation that prices will go up if the service or app becomes popular. Another way to invest in blockchain technology is to invest in startups built on blockchain technology. Finally, there is always the option to invest in pure blockchain technology.\n\nTraditional Finance and Blockchain Investment Strategies\n\nIn traditional finance, there are two main investment strategies: active and passive. Active investing involves picking stocks or other assets, and then holding onto them for a long period of time. Passive investing, on the other hand, involves investing in a basket of assets, and then holding onto them for a long period of time. Both of these strategies have their pros and cons, but there is one major difference between them: active investing is much more risky than passive investing.\n\nHow Do Different Industries Use Blockchain?\n\nBlockchain has the potential to streamline processes across many different industries.\n\nIn the supply chain industry, for example, Blockchain can track the movement of goods and materials as they change hands. This would allow for greater transparency and accountability and reduce the risk of fraud.\n\nIn the healthcare industry, Blockchain can be used to secure patient data and streamline the process of billing and claims.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat are the Features of Blockchain Technology?\n\nBlockchain technology is a distributed ledger that is secure, transparent, and immutable.\n\nBlockchain technology can be used to create a decentralized database that is tamper-proof and has the potential to revolutionize the way we interact with the digital world.\n\nBlockchain technology is secure, transparent, and tamper-proof.\n\nWhat are the Key Components of Blockchain Technology?\n\nThere are three key components to blockchain technology:\n\nThe distributed ledger, the consensus mechanism, and the smart contracts.\n\nThe distributed ledger is a database that is spread across a network of computers. The consensus mechanism is what allows the network of computers to agree on the state of the ledger.\n\nThe smart contracts are what allows the blockchain to be used for more than just a database.\n\nWhat are Blockchain Protocols?\n\nThe three most common protocols Bitcoin was the first blockchain protocol and is still the most widely used is:\n\nBitcoin- Bitcoin is a decentralized digital currency, often referred to as a cryptocurrency. It exists on a decentralized network of computers, often called a blockchain, that keeps track of all transactions made using the currency. Bitcoin uses a proof-of-work algorithm to validate transactions and add them to the blockchain. Bitcoin was the first cryptocurrency to be created and is the most well-known.\n\nRipple- Ripple is a cryptocurrency that is similar to Bitcoin. Ripple uses a decentralized network of computers to keep track of all transactions made using the currency. Ripple uses a proof-of-work algorithm to validate transactions and add them to the blockchain. Ripple was created in 2012 and is the second largest cryptocurrency by market capitalization.\n\nEthereum- The Ethereum blockchain was initially described in a white paper by Vitalik Buterin in 2013. Buterin, a programmer who was born in Russia and raised in Canada, had been involved with bitcoin from its early days. He was excited by the technology, but he thought that bitcoin needed a scripting language for application development. He decided to create a new platform that would be more general than bitcoin.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat is the Difference Between a Database and a Blockchain?\n\nSo what is the difference between a database and a blockchain? A database is centralized, meaning that a single entity controls it. This entity can be a company, government, or individual. On the other hand, a blockchain is decentralized, meaning that any entity does not control it.\n\nHow is Blockchain Different From the Cloud?\n\nBlockchain is a new technology that is different from the cloud in several ways:\n\nBlockchain is decentralized, while the cloud is centralized. This means that Blockchain is distributed across a network of computers, while the cloud is stored on a central server.\n\nBlockchain is immutable, meaning that once data is written to the Blockchain, it cannot be changed.\n\nWhat is Blockchain as a Service?\n\nBlockchain as a Service is a cloud-based offering that allows customers to build, host, and use their blockchain applications, smart contracts, and functions on the Azure cloud platform. Azure offers integrated services that make it easy to develop, deploy, and manage blockchain applications. Customers can use Azure's managed services to create and deploy blockchain applications without having to set up and manage their infrastructure.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat are the Implications of Blockchain Technology?\n\nBlockchain technology has made a great impact on society, including:\n\nBitcoin, Blockchain’s prime application and the whole reason the technology was developed in the first place, has helped many people through financial services such as digital wallets. It has provided microloans and allowed micropayments to people in less than ideal economic circumstances, thereby introducing new life in the world economy.\n\nThe next major impact is in the concept of TRUST, especially within the sphere of international transactions. Previously, lawyers were hired to bridge the trust gap between two different parties, but it consumed extra time and money. But the introduction of Cryptocurrency has radically changed the trust equation. Many organizations are located in areas where resources are scarce, and corruption is widespread. In such cases, Blockchain renders a significant advantage to these affected people and organizations, allowing them to escape the tricks of unreliable third-party intermediaries.\n\nThe new reality of the Internet of Things (IoT) is already teeming with smart devices that — turn on your washing machines; drive your cars; navigate your ships; organize trash pick-up; manage traffic safety in your community — you name it! This is where blockchain comes in. In all of these cases (and more), leveraging blockchain technology by creating Smart Contracts will enable any organization to ‒ both — improve operations and keep more accurate records.\n\nBlockchain technology enables a decentralized peer-to-peer network for organizations or apps like Airbnb and Uber. It allows people to pay for things like toll fees, parking, etc.\n\nBlockchain technology can be used as a secure platform for the healthcare industry for the purposes of storing sensitive patient data. Health-related organizations can create a centralized database with the technology and share the information with only the appropriately authorized people.\n\nIn the private consumer world, blockchain technology can be employed by two parties who wish to conduct a private transaction. However, these kinds of transactions have details that need to be hammered out before both parties can proceed:\n\nWhat are the terms and conditions (T&C) of the exchange? Are all the terms clear? When does the exchange start? When will it finish? When is it unfair to halt the exchange?\n\nSince blockchain technology employs a shared ledger, distributed ledger on a decentralized network, all parties involved can quickly find answers to these questions by researching “blocks” in the “chain.” Transactions on a blockchain platform can be tracked from departure to the destination by all of the transactions on the chain.\n\nHow Can Features of Blockchain Support Sustainability Efforts\n\nIn spite of huge energy consumption the blockchain technology has features that can support sustainability efforts. For example:\n\nBlockchain can give transparency and traceability in supply chains, allowing consumers to verify the origins and sustainability of products. This can encourage sustainable practices and discourage unethical practices such as deforestation, illegal fishing, or labor exploitation.\n\nDecentralization: Blockchain's decentralized nature helps to eliminate the need for intermediaries and reduce costs and also to increase efficiency. This can enable more direct and transparent transactions, reducing the environmental impact associated with traditional intermediaries.\n\nSmart Contracts: These are self-executing contracts that run on blockchain which eliminates the requirements for intermediaries and automating processes. This can reduce paperwork to minimize the disputes and streamline operations. It can help to lead to greater sustainability by reducing paper waste by increasing resource utilization.\n\nTokenization: Blockchain enables tokenization where assets can be represented as digital tokens. This can enable fractional ownership and make the process easier for people who intend to invest in sustainable assets such as renewable energy projects or carbon credits, promoting green investments and supporting sustainability initiatives.\n\nConclusion\n\nAlthough we just skimmed the industry-wide potential of blockchain applications in this article, the career potential in this field is growing exponentially. Getting ahead of the game is always a good strategy for any professional. At Simplilearn, our latest and most up-to-date course on this emerging field is the Professional Blockchain Certificate Program in Blockchain. In partnership with the world-renowned university, IIT Kanpur, this program will help you get on track.\n\nIn this blockchain program, you will learn how to master blockchain concepts, techniques, and tools like Truffle, Hyperledger, and Ethereum to build blockchain applications and networks.\n\nFAQs\n\n1. What is Blockchain in Simple Terms?\n\nBlockchain is a shareable ledger that records transactions and is difficult to modify or change. It also tracks tangible and intangible assets such as cash or a house.\n\n2. How Many Blockchains Are There?\n\nThere are 4 types of blockchain networks currently - public blockchains, private blockchains, consortium blockchains, and hybrid blockchains.\n\n3. What’s the Difference Between a Private Blockchain and a Public Blockchain?\n\nPrivate blockchains are only open to selected people, while public blockchain is open to the general masses. Private blockchains are more secure compared to public ones.\n\n4. What is a Blockchain Platform?\n\nA Blockchain Platform is any platform that exists to support or facilitate Blockchains. There are many types of blockchain platforms for different needs, such as Ethereum, Hyperledger, etc.\n\n5. Who Invented Blockchain?\n\nBlockchain was created by unknown persons under the pseudonym Satoshi Nakamoto when they designed the online currency, Bitcoin.\n\n6. What is Blockchain used for?\n\nWhile most popularly used for digital currency such as Bitcoin, Blockchain is also now used in different sectors to safeguard records.\n\n7. What are the 3 Pillars of Blockchain Technology?\n\nDecentralization, Transparency, and Immutability are the 3 main pillars of blockchain technology.\n\n8. Who Controls the Blockchain?\n\nIn blockchain, the power is divided between all of the users operating on the network. No single user has any control.\n\n9. Why is Blockchain Important?\n\nBlockchain offers security, transparency, and trust between the entire network of users. It also offers cost saving and efficient methods for data recording and sharing."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhvbGRzLWFzLWluc3RpdHV0aW9uYWwtaW52ZXN0b3ItYm9vc3RzLXNlbnRpbWVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price holds $28K range as institutional investor maneuvering boosts sentiment - Cointelegraph",
        "content": "Bitcoin’s (BTC) price continues to show strength this week by hitting an intra-day high at $28,516 even as macroeconomic headwinds in the United States continue to weigh on investor sentiment. It’s possible that a certain degree of BTC’s price stability can be attributed to increasing institutional activity and positive institutional investor interest in Bitcoin.\n\nOn Oct. 17, Fidelity Investments, a large asset management institution, amended its proposed spot Bitcoin exchange-traded fund (ETF) with the United States Securities and Exchange Commission. The ETF, called the Wise Origin Bitcoin Trust, updated and outlined how Fidelity plans to protect customers’ Bitcoin in custody accounts and revealed risks associated with the unstable regulatory landscape of cryptocurrencies.\n\nFidelity is following in the footsteps of other large institutions such as ARK Invest and Invesco, which also amended their spot Bitcoin ETF filings. ARK Invest refiled on Oct. 11, with Invesco refiling on Oct. 13.\n\nThese actions suggest an ongoing dialogue between ETF applicants and the SEC, something ARK Invest CEO Cathie Wood seemed to verify this week on ETF Edge, stating:\n\n“We responded to the SEC request for information surrounding our Bitcoin filing. The SEC chose to engage, which is a change in behavior.”\n\nWood’s comment, combined with Fidelity’s filing, is providing renewed optimistic sentiment on Bitcoin. Grayscale’s Bitcoin investment vehicle, Grayscale Bitcoin Trust (GBTC), which is similar to an ETF, has reached its lowest net asset value premium discount since Dec. 9, 2021.\n\nGBTC premium. Source: Coinglass\n\nRelated: Beyond crypto: Zero-knowledge proofs show potential from voting to finance\n\nGrayscale was dealt a victory against the SEC on Oct. 14, with the commission reportedly not appealing an Aug. 29 ruling by the U.S. Court of Appeals, which means Grayscale’s ETF will now have to be reviewed.\n\nDespite all of the momentum, the SEC continues to delay Bitcoin ETF approval.\n\nCertain analysts anticipate that when approval is granted, it could potentially add at least $600 billion in new demand for Bitcoin. During an Oct. 16 interview on Fox Business, BlackRock CEO Larry Fink spoke about Bitcoin after false spot BTC approval news sparked a rally.\n\n“I think the rally is about a flight to quality, with all the issues around the Israeli war now [and] global terrorism. And I think there are more people running to a flight to quality — whether that is in Treasurys, gold or crypto, depending on how you think about it.”\n\nRelated: How high can Bitcoin price go by 2024?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTkvdGhlLWNyeXB0by13aW50ZXItbWF5LWJlLW92ZXItbW9yZ2FuLXN0YW5sZXktd2VhbHRoLW1hbmFnZW1lbnQv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xOS90aGUtY3J5cHRvLXdpbnRlci1tYXktYmUtb3Zlci1tb3JnYW4tc3RhbmxleS13ZWFsdGgtbWFuYWdlbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "The Crypto Winter May Be Over: Morgan Stanley Wealth Management - CoinDesk",
        "content": "Most of bitcoin’s gains come directly after the halving, Galindo wrote, and this “bull-run period starts with the halving event and ends once the price of bitcoin hits its prior peak.” Roughly every four years the reward for successfully mining a bitcoin block is cut in half, an event known as the halving, and this reduces inflationary pressure on BTC."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy93aHktYml0Y29pbi10cmVuZGluZy1vbi10d2l0dGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Why is 'Bitcoin ETF' Trending on Twitter Today? - CCN.com",
        "content": "Key Takeaways\n\nMajor financial institutions seek approval for US Bitcoin ETFs, signaling a shift in the crypto industry’s ETF approach.\n\nGrayscale’s conversion success and BlackRock’s application suggest a shifting landscape for crypto financial products.\n\nBitcoin briefly exceeded $30,000 amid price swings following a false report of SEC approval for a spot Bitcoin ETF.\n\nThere may soon be more alternatives available to those who wish to wager on Bitcoin, and this has Twitter in a frenzy as ‘Bitcoin ETF’ is trending following a bout of confusion news.\n\nMajor financial institutions, including BlackRock, Fidelity, and Invesco, have applied to sell US “spot” exchange-traded funds (ETFs) directly linked to holdings in Bitcoin, while Grayscale Investments LLC has been successful in its effort to convert its Bitcoin trust into an ETF, having won a court decision on August 29.\n\nThese products have frequently been rejected by the US Securities and Exchange Commission (SEC) in the past due to concerns about volatility and possible manipulation. However, the Grayscale decision and the BlackRock filing, in particular, may indicate that the cryptocurrency industry is taking the lead.\n\nHowever, many jumped the gun when a bogus report emanated from Cointelegraph suggesting that the SEC had approved the first offering in the U.S. With all the bubbling news, it is unsurprising that Twitter is so active around this point.\n\nCrypto Twitter Frenzy\n\nSome of the reasons why ‘Bitcoin ETF’ is trending on Twitter include progress being made by Fidelity, BlackRock’s continued push in this space, and a looming deadline on their decision, as well as positive news for Grayscale. Not to mention, socio-economic factors like global conflicts, also have people looking towards safe-haven assets.\n\nAs industry analysts and influencers expect that BlackRock’s Bitcoin spot ETF will launch soon, anticipation is growing. The popular cryptocurrency YouTuber Crypto Rover, who boasts an incredible 100,000 subscribers, claims that the BlackRock Bitcoin spot ETF’s actual expiration date or target date is within the next 60 to 90 days.\n\nThis forecast is based on BlackRock’s decision to forgo an appeal of Grayscale’s recent legal victory, which suggests that they lack any legal justification to deny any Bitcoin Spot ETF applications.\n\nThe real deadline/ expectation date for the BlackRock #Bitcoin spot ETF is in the coming 60-90 days. Here is why: They haven't appealed Grayscale's win, meaning they have no basis to reject ANY Bitcoin Spot ETF. The final deadline for the initial application from ARK is set… pic.twitter.com/FOdptgaOx3 — Crypto Rover (@rovercrc) October 17, 2023\n\nThe final date for the initial application from ARK , another significant participant in the crypto investment space, is set for January 10, 2024, according to Crypto Rover. Crypto fans predict that, should the SEC decide to approve any ETF, it will likely do so simultaneously with all others rather than picking one and rejecting the others.\n\nTherefore, the consensus among industry insiders is that the launch of the first Bitcoin spot ETF is likely to occur well before January 10, 2024.\n\n“Gary Gensler is standing in the way of spot Bitcoin ETFs – Cathie Wood,” according to “The Wolf Of All Streets.” The CEO of a well-known asset management company, Cathie Wood, stated that she does not believe the SEC as a whole, but rather SEC Chair Gary Gensler, is the biggest barrier to the establishment of a Bitcoin ETF.\n\nGARY GENSLER IS \"STANDING IN THE WAY\" OF SPOT BITCOIN ETFS – CATHIE WOOD She said the out loud part… out louder. Cathie Wood, the head of asset management firm Ark Invest, claims that SEC Chair Gary Gensler is the main obstacle to the approval of spot bitcoin ETFs, not the… pic.twitter.com/5UkUcANOPL — The Wolf Of All Streets (@scottmelker) October 16, 2023\n\nWood claims that the SEC staff is knowledgeable about BTC and understands its benefits. She went on to question Gensler’s decision to support a Bitcoin futures ETF while opposing a spot Bitcoin ETF, despite the latter’s lower counterparty risk.\n\nNotably, the SEC has already denied Ark Invest’s requests to launch ETFs twice. Grayscale Investments’ recent legal victory has increased pressure on the SEC to reconsider its position on spot Bitcoin ETFs.\n\nBitcoin On The Week Rally\n\nIn the last 24 hours, the price of Bitcoin fluctuated around $28,450, staying steadfastly above a range of around $26,000 that had remained for most of the previous two months due to sluggish mood and unusually low volatility and trading volumes.\n\nOne of the reasons was the fact that the application for its Bitcoin spot ETF “Wise Origin Bitcoin Trust” had been resubmitted to the SEC, a major ETF issuer with $37 billion in 58 ETFs. The regulator’s concerns that were earlier voiced when rejecting the Bitcoin ETF update are being addressed by the revised proposal.\n\nFollowing a bogus news report that the SEC had approved a spot Bitcoin exchange-traded fund (ETF), the largest digital asset even soared beyond $30,000 on Monday, most certainly signaling the beginning of ETF-linked volatility.\n\nSince last Friday, when it was revealed that the SEC had decided not to appeal a federal court decision that essentially allowed digital asset management Grayscale to convert its Bitcoin trust into an ETF, Bitcoin has been on the rise.\n\nETF issuers are working together with the SEC regarding changes required for SEC approval. BULLISH FOR #BITCOIN 🚀 pic.twitter.com/42nrcvwOEK — Crypto Rover (@rovercrc) October 18, 2023\n\nSince the summer, when BlackRock and other major mainstream financial institutions filed for SEC approval, the possibility of a spot Bitcoin ETF—which would hold the token itself rather than funds holding futures—has been a looming driver for cryptocurrencies.\n\nAlthough there is still uncertainty and potential roadblocks before any spot Bitcoin ETF starts trading, it is widely predicted that regulatory approval of such funds will revive the cryptocurrency markets and usher in a new wave of investment in Bitcoin. Despite this, traders are becoming more optimistic that the SEC will approve the conversion of the Grayscale Bitcoin Trust.\n\nLook no further than the Grayscale discount. The trust owned by the asset management trades similarly to a closed-end fund, with a price that varies from the net asset value of the Bitcoin it owns. For almost two years, that variance has been discounted, but it is getting smaller: The Grayscale discount was at its tightest since late 2021 on Tuesday, when it was around 15%, down from almost 19% at the beginning of the month.\n\nCrypto – A Safe Haven In The Time Of War\n\nDue to the recent Israel-Palestine conflict, the world is now more aware of the geopolitical tensions in the Middle East. Despite the wide-ranging impacts of the upheaval, one feature that is sometimes regarded as a safe haven in times of unrest has remained unaffected: the stability of the price of Bitcoin (BTC).\n\nAmid the Israeli authorities’ crackdown on cryptocurrency accounts and efforts to sever connections with Hamas following an attack, many have been closed, with millions in crypto assets seized. People attribute this action to growing concerns about global conflicts and their potential impact on the monetary system, prompting some to invest in Bitcoin.\n\n\"There is a way to trace transactions from bad actors and that digital paper trail has led to disruptions and seizures. The numbers we've seen need some context.\" @SignCurve on @crypto w/@kaileyleinz @mattmiller1973 https://t.co/WQGyPZ4SKZ pic.twitter.com/7mHmfUwTV8 — Crypto Council for Innovation (@crypto_council) October 18, 2023\n\nSince Russia’s invasion of Ukraine , cryptocurrencies have been frequently in the news, with demand for the always-volatile bitcoin in both Russia and other countries.\n\nDuring the greatest attack on a European nation since World War Two, cryptocurrencies have performed as shown in the following charts.\n\nCrypto enthusiasts view the Bitcoin as “digital gold,” a convenient place to deposit funds in times of conflict or calamity. According to the argument, Bitcoin is more secure than conventional currencies because it has a finite quantity and operates on a worldwide computer network outside the control of governments.\n\nNothing is ever really that easy. Uncertainty surrounds Bitcoin’s potential as a safe-haven asset: It frequently exhibits more risk-on asset characteristics, like equities.\n\nBe it as it may, Bitcoin is not just a speculative asset, it is also a seizure-resistant, policy-independent, longer-term store of value, and the war has contributed to this perception.\n\nIt is unclear which of the most recent wave of applications for a Bitcoin ETF the SEC will approve. However, the recent push for one from organisations like BlackRock may be an indicator of a more significant development for the token: the entry of institutional investors."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvd2h5LWlzLXhycC1vbi1maXJlLXRvZGF5LW91dHNoaW5pbmctYml0Y29pbi1ldGhlcmV1bS1hbmQtZG9nZWNvaW4tZ2FpbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Why Is XRP On Fire Today, Outshining Bitcoin, Ethereum, And Dogecoin Gains? - Nasdaq",
        "content": "Ripple Labs’ creation XRP (CRYPTO: XRP), has exhibited a surge of 7% in the past 24 hours, outpacing other prominent cryptocurrencies such as Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH), and Dogecoin (CRYPTO: DOGE).\n\nWhat Happened: As of the latest data, XRP was trading at $0.51, while BTC, ETH, and DOGE saw comparatively modest gains of 2.18%, 2.01%, and 0.18%, respectively, over the same 24-hour period.\n\nThis notable rise in XRP’s value can be attributed to a significant development in the ongoing legal battle between Ripple and the Securities and Exchange Commission (SEC). The SEC has decided to no longer pursue claims against Ripple’s CEO, Brad Garlinghouse, and its Executive Chairman, Chris Larsen.\n\nThis development has led to the cancellation of a trial that was scheduled for the coming year, marking another favorable outcome for Ripple in the SEC’s lengthy legal battle against the company. However, the SEC still intends to pursue its claims against Ripple itself.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: The agreement reached between the parties involves the voluntary dismissal of the aiding and abetting charges against Garlinghouse and Larsen, with prejudice, meaning that these charges cannot be reinstated. The SEC will continue to pursue its claims against Ripple.\n\nGarlinghouse said, “For nearly three years, Chris and I have been the subject of baseless allegations from a rogue regulator with a political agenda. Instead of looking for the criminals stealing customer funds on offshore exchanges that were courting political favor, the SEC went after the good guys.”\n\nThis development follows a partial victory secured by Ripple in July when a judge ruled that the company had not violated federal securities laws by making XRP available to retail investors through exchanges. However, the judge also found that the company had violated federal securities law by directly selling XRP to institutional investors.\n\nPrice Action: At the time of writing, BTC was trading at $28,810.35, up 2.18% in the last 24 hours, according to Benzinga Pro.\n\nPhoto Courtesy: Diamond Visuals On Shutterstock.com\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzE5L3RoaXMtMS1iaXRjb2luLW1pbmluZy1zdG9jay1ub2JvZHktaXMtdGFsa2luZy1hYm91L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "This 1 Bitcoin Mining Stock Nobody Is Talking About Is Up 340% for the Year - The Motley Fool",
        "content": "Throughout 2023, Bitcoin mining stocks have been on a roll. Marathon Digital Holdings is up a remarkable 130% year to date. Riot Platforms is up an even more impressive 160%. No surprise here, but these two Bitcoin mining stocks are getting all the attention from investors right now.\n\nBut what if I told you that the best-performing Bitcoin mining stock this year was not Riot Platforms or Marathon Digital? Instead, it's Cipher Mining (CIFR -7.66%), which has skyrocketed in value by about 370% this year. Due to its relatively small size, Cipher Mining has flown under the radar of many investors. But should it be on yours heading into 2024?\n\nA new investment thesis for Bitcoin mining stocks\n\nGiven that Bitcoin miners are most profitable when the price of Bitcoin is increasing, it's obvious why mining stocks are performing so well. Bitcoin is up about 70% this year, and that means the mantra for Bitcoin mining stocks in 2023 has been \"bigger is better.\" The more mining facilities you have, the more mining rigs you have deployed, and the more Bitcoin you are able to mine, the better it typically is for your bottom line. When Bitcoin miners report monthly operational updates, the focus is almost exclusively on how much Bitcoin they've been able to mine.\n\nHowever, this investment thesis for Bitcoin mining stocks could be starting to change. The next Bitcoin halving is scheduled for April 2024, and that landmark event is going to change what it means to be successful in the Bitcoin mining industry. In a halving event, the reward for mining a new block of Bitcoin falls by one-half. In other words, unless the price of Bitcoin rises or costs drop dramatically, Bitcoin miners are going to be making half as much money next year as they did this year.\n\nAs a result, the emphasis is most likely going to shift to operational efficiency. The goal will be to become a low-cost producer. Analysts are already starting to warn that only the most efficient Bitcoin miners are going to survive. CNBC has called the halving an \"extinction-level event\" for the Bitcoin mining industry. It is quite likely that only the most operationally efficient miners with the lowest cost structures are going to make it. Everyone else is doomed to become a dinosaur.\n\nSize vs. efficiency\n\nAnd this is what makes Cipher Mining potentially attractive. In its latest research note for the Bitcoin mining industry, JPMorgan specifically pointed out that Cipher Mining has the lowest power costs in the industry. While JPMorgan put out underweight ratings for both Riot Platforms and Marathon Digital, it put out a neutral rating for Cipher Mining. The one knock against Cipher Mining was that it is \"growth-constrained.\"\n\nTranslation: Cipher Mining is small. While Riot Platforms and Marathon Digital have market capitalizations of roughly $1.6 billion, Cipher Mining has a total market cap of less than $700 million. According to its latest operational report from September 2023, Cipher Mining has just 70,000 deployed mining rigs. By way of comparison, Riot Platforms has nearly 100,000 deployed mining rigs. Thus, it's easy to see why Cipher Mining has been overlooked in 2023. It simply can't produce as much Bitcoin as its larger rivals.\n\nInvest in Bitcoin or Bitcoin miners?\n\nThe big question, of course, is what's going to happen in 2024. From my perspective, the Bitcoin halving is going to exert greater and greater pressure on Bitcoin miners to become as efficient as possible. The goal will be to produce Bitcoin at the lowest possible price. This is almost definitely bad news for Marathon Digital, which has the highest energy costs in the industry. But it could provide an opening for smaller, more nimble Bitcoin miners such as Cipher Mining.\n\nHowever, given that investing in Bitcoin mining stocks is really just a leveraged bet on the future price of Bitcoin, one strategy might be to invest directly in Bitcoin. Yes, you are going to sacrifice some potential upside, but you also won't have to worry about picking winners in a highly competitive industry or trying to time each new Bitcoin cycle.\n\nIt really depends on your investment time horizon. If you are looking to maximize gains over a short- to medium-term time horizon, Bitcoin mining stocks could continue to outperform Bitcoin. But if you are a long-term investor, it might be easier and more profitable simply to invest in Bitcoin."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvLm5ld3MvY2hhcmxpZS1tdW5nZXItc2F5cy1haS1pcy1vdmVyaHlwZWQtYml0Y29pbi1pcy1zdHVwaWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Charlie Munger says AI is overhyped, Bitcoin is stupid - crypto.news",
        "content": "Charlie Munger, the billionaire vice chairman of Berkshire Hathaway, dismissed artificial intelligence (AI) as excessive hype while doubling down on his criticism of Bitcoin (BTC).\n\nThe AI buzz and Munger’s take\n\nAI is rapidly gaining traction across various sectors of the global economy just like blockchain, with platforms like Binance already incorporating the burgeoning technology into varies processes. However, Munger — a close friend and advisor to Warren Buffett — isn’t quite sold on the trend.\n\nDuring Zoom’s recent Zoomtopia conference, which took place from Oct. 3-4, Munger aired his doubts.\n\n“I believe it’s receiving an excessive amount of attention, and it’s likely receiving more attention than it merits,” Munger said, according to Fortune.\n\nMunger acknowledges the importance of AI breakthroughs but remains unconvinced about its “exaggerated” potential. And his doubts about AI are not new. The 99-year-old billionaire previously voiced his skepticism at Berkshire Hathaway’s shareholder meeting, stating that old-fashioned intelligence works well and cautioning against the unrealistic expectations surrounding AI.\n\nWhile some predict that AI could lead to a utopian future with extended lifespans and the eradication of diseases, Munger dismisses such notions as “crazy hype” and sees AI as a mixed blessing.\n\nWarren Buffett shares some of Munger’s skepticism, acknowledging AI’s technological advancement but admitting that he doesn’t fully understand it. He has raised concerns about AI’s societal impact.\n\nMunger bashes Bitcoin (BTC)\n\nTurning to cryptocurrencies, Munger doesn’t mince words. When asked about Bitcoin and other digital assets, he bluntly states, “Don’t get me started on Bitcoins — that was the stupidest investment I ever saw.”\n\nCryptocurrency investments, he says, are destined to be worthless.\n\nMunger’s criticism of crypto isn’t new either. In the past, he has triggered reactions and discussions on social media after comparing Bitcoin to “rat poison” and equating other cryptocurrencies to harmful infections. Last February, Munger urged the U.S. government to ban Bitcoin, describing it as speculative gambling.\n\nBuffett shares Munger’s skepticism regarding Bitcoin, calling it a “gambling token.” JPMorgan Chase CEO Jamie Dimon has also dismissed cryptocurrency, comparing it to “owning a pet rock.”\n\nYou might also like: Warren Buffett dumps crypto-affiliated banks after he sees red flags\n\nA different perspective\n\nHowever, not every investor agrees with Munger and Buffett’s assessment of Bitcoin. MicroStrategy chair Michael Saylor believes that critics like Munger should invest more time in studying Bitcoin to gain a better understanding of how the world’s largest cryptocurrency works.\n\nYou might also like: Charlie Munger calls Bitcoin’s Success “Disgusting,” Crypto Twitter Reacts\n\nFormer BlackRock executives, Stephen Schoenfield and Martin Bednall, remain focused on the future of Bitcoin exchange-traded funds (ETFs) in the U.S.\n\nAfter Grayscale’s legal victory against the regulatory watchdog, they believe that the approval of multiple Bitcoin ETFs will happen in the coming months.\n\nProponents say approval could potentially draw about $200 billion into the cryptocurrency market.\n\nIn contrast to Munger’s skepticism, both AI and cryptocurrencies continue to be sectors of interest among major Wall Street firms.\n\nRead more: Charlie Munger continues bashing cryptos at shareholder meeting\n\nFollow Us on Google News"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXByaWNlLXNob290cy1ibGFja3JvY2stYmxrLTA5MzgwMDM4My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price Shoots Up on BlackRock (BLK) ETF Approval Rumor - Yahoo Finance",
        "content": "The race to launch a Bitcoin ETF has been getting a lot of eyeballs as it would give a regulated and orderly way to obtain exposure to Bitcoin price swings without actually owning the cryptocurrency. On Monday, Oct 16, the price of Bitcoin (BTC) briefly crossed the $30,000 mark on reports that the Securities and Exchange Commission (“SEC”) approved BlackRock, Inc.’s BLK application to launch a BTC ETF. The news turned out to be a rumor.\n\n“The iShares Spot Bitcoin ETF application is still under review by the SEC,” a BlackRock spokesperson clarified. On this, the price of the benchmark crypto coin settled back down below $29000, falling sharply by about 8%. The SEC, too, gave a cryptic yet stern message on social media, stating, \"Careful what you read on the internet. The best source of information about the SEC is the SEC.\"\n\nHowever, the sharp uptick in the price of Bitcoin on these rumors has started speculations that an actual approval may not be far off. The regulations body has been struggling in recent days to keep the rising optimism about Bitcoin ETFs at bay, and the best it has been able to do is to delay passing its verdict on various applications. Traditional finance giants seem to have decided to go mainstream with crypto, and the market appears prepared for it.\n\nOf late, the major development in this next-stage crypto move has been the Court of Appeals siding with Grayscale in its lawsuit against the SEC. Previously, the SEC had denied Grayscale’s application to convert its popular Grayscale Bitcoin Trust (GBTC) to an ETF. The SEC had until Friday to appeal the judge’s opinion that it had failed to provide a coherent explanation for its denial. But they did not take up that option in a significant act of omission. This will now pave the way for various companies from the traditional sector that are waiting for the SEC’s approval to jump into the crypto fray.\n\nStory continues\n\nApart from BlackRock, which is probably the biggest player in the race, the SEC is currently reviewing applications from major investment companies like Invesco Ltd. IVZ and Franklin Resources, Inc. BEN. Invesco and Franklin Resources currently carry a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFranklin Resources, Inc. (BEN) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nInvesco Ltd. (IVZ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXNsYS1lYXJuaW5ncy1iaXRjb2luLWhvbGRpbmdzLWludmVzdG1lbnQtYWktZWxvbi1tdXNr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Tesla earnings: Bitcoin bags untouched as firm splashes out on AI - Cointelegraph",
        "content": "Electric vehicle maker Tesla made no changes to its sizeable Bitcoin (BTC) holdings for the fifth quarter in a row. However, it has directed more funds to double its computing capacity amid artificial intelligence (AI) efforts.\n\nTesla’s Q3 2023 results released on Oct. 18 show as of Sept. 30, it held $184 million worth of digital assets — a portion of the $1.5 billion worth of Bitcoin it first bought in March 2021.\n\nThe latest quarterly results mean it hadn’t bought or sold any Bitcoin since its sell-off of around 75% of its holdings in Q2 2022 when it fetched $936 million for more than 30,000 BTC.\n\nExcerpt of Tesla’s Q3 2023 balance sheet with its digital asset holdings highlighted. Source: Tesla\n\nOn the other hand, Tesla reported it had “more than doubled the size” of its computing power for its AI projects, citing a growing training data set and switching the training of its humanoid robot Optimus to AI rather than coded software.\n\n“We have commissioned one of the world’s largest supercomputers to accelerate the pace of our AI development, with compute capacity more than doubling compared to Q2.”\n\nTesla saw its third-quarter earnings and profits miss Wall Street estimates, with reported total revenues of $23.35 billion. While this was up by nearly 9% from the prior-year period, it missed Zacks Investment Research’s estimate of $24.38 billion.\n\nIt also missed projected profits, with reported earnings per share (EPS) of $0.66 compared to Zack’s $0.72 EPS estimate.\n\nTotal third-quarter operating expenses came in at $2.41 billion, marking more than a 13% increase from last quarter and over a 42.5% increase from the prior year.\n\nRelated: Bitcoin clean energy usage reportedly exceeds 50% — Will Tesla start accepting BTC payments?\n\nTesla’s research and development expenses were $1.16 billion in the quarter, a 58% jump from last year. It attributed the increases to its “Cybertruck, AI and other R&D projects.”\n\nTesla shares continued to fall after the bell to a low of $230.19. Source: Google Finance\n\nTesla shares were down nearly 4.8% on the day, closing at $242.68 and fell a further 4.25% in after-hours trading to $232.37 per Google Finance data.\n\nMagazine: NFT Collector: Creative AI art, Tomorrowland sells tomorrow’s future"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1ib2xsaW5nZXItYmFuZHdpZHRoLXNpZ25hbHMtd2lsZC1wcmljZS1zd2luZ3MtYWhlYWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin 'Bollinger Bandwidth' Signals Wild Price Swings Ahead - CoinDesk",
        "content": "Volatility is said to be mean-reverting. Therefore, a prolonged period of below-average volatility often paves the way for sudden violent price action in either direction. In other words, the market is said to build energy during consolidation, which is eventually unleashed in the form of a notable bullish or bearish trend. The longer the volatility meltdown, the more violent the eventual breakout."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1jb3VsZC1saWZ0LXRoaXMtY3J5cHRvLXN0b2NrLWZ1bmQv0gFpaHR0cHM6Ly93d3cuZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFsLWNvdWxkLWxpZnQtdGhpcy1jcnlwdG8tc3RvY2stZnVuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Approval Could Lift This Crypto Stock Fund - ETF Trends",
        "content": "The Securities and Exchange Commission (SEC) recently decided not to appeal a court ruling in favor of Grayscale Investments. And now, speculation is mounting in the cryptocurrency and broader investment communities that approval of spot bitcoin ETFs in the U.S. is imminent.\n\nSome crypto experts believe the SEC could finally relent and green-light such ETFs before the end of this year. While there’s debate among crypto market observers about the extent to which a spot bitcoin ETF will lift prices of the largest digital currency, there’s no arguing that prices are already rallying and more upside could benefit assets such as the Invesco Alerian Galaxy Crypto Economy ETF (SATO) .\n\nSATO, which tracks the Alerian Galaxy Global Cryptocurrency-Focused Blockchain Equity, Trusts, and ETPs Index, doesn’t directly hold bitcoin or any other cryptocurrency for that matter. But it is among the equity-based ETFs correlated to bitcoin price movements. That status could make SATO a beneficiary of spot bitcoin ETF approval.\n\nSATO Ready for Primetime\n\nSATO turned two years old earlier this month and its time on the market has been eventful. The ETF’s primary industry exposure is crypto miners. This group came under considerable duress during the crypto winter of 2022. That bad news is in the rearview mirror. If the SEC approves spot bitcoin ETFs, SATO could be primed for better things. And some experts believe it’s just a matter of time.\n\n“It’s going to get approved… We think it happens this year in 2023,” said Galaxy Digital CEO Mike Novogratz in an interview with CNBC on Wednesday. “All the indications of dealing seem to be heading in the right direction.”\n\nNovogratz, who is one of the biggest names in crypto investing, noted that Grayscale’s recent court victory could be a positive sign for spot bitcoin ETF approval.\n\n“The judge said, ‘What are you talking about SEC? You have a futures ETF and you’re saying you can’t have a cash ETF. That makes intellectually zero sense.’ And I think that put the SEC on the back foot,” Novogratz told CNBC.\n\nWhile approval of spot bitcoin ETFs would be a clear catalyst for SATO, the Invesco ETF has other avenues through which it could generate upside. For example, roughly 64% of the ETF’s 37 holdings are classified as small-cap stocks. Currently, the valuation gap between large- and small-cap equities is at a 20-year high. If that chasm narrows, small-cap equities could benefit.\n\nvettafi.com is owned by VettaFi LLC (“VettaFi”). VettaFi is the index provider for SATO, for which it receives an index licensing fee. However, SATO is not issued, sponsored, endorsed, or sold by VettaFi, and VettaFi has no obligation or liability in connection with the issuance, administration, marketing, or trading of SATO."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJhc2VkLWFpLWxhbmd1YWdlLW1vZGVsLWFpbXMtdG8tZHJpdmUtZWR1Y2F0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin-centric AI language model aims to drive BTC education and adoption - Cointelegraph",
        "content": "“It’s good at answering Bitcoin- and economics-related questions — at least better than GPT-4,” Aleksandar Svetski told Cointelegraph at a bustling Bitcoin Amsterdam.\n\nThe entrepreneur, author and founder of Spirit of Satoshi, a novel artificial intelligence (AI) large language model (LLM), begins to unpack the arduous journey his small startup has undertaken to create its Bitcoin-centric AI chatbot.\n\nThe model is the result of a time-consuming training process to generate responses based on reputable Bitcoin resources, the Austrian school of economics and libertarian ideals. Still in its infancy, Spirit of Satoshi reflects ideals from a “well-curated Bitcoin corpus,” including resources such as Saifedean Ammous’ best-seller The Bitcoin Standard.\n\nSpirit of Satoshi’s dashboard is reminiscent of ChatGPT, while its outputs invoke a Bitcoin-centric theme. Source: Spirit of Satoshi\n\nSvetski explained that the major difficulty in building the model was not just curating relevant sources of information from books, research papers and podcasts but also guiding the model to generate responses through an exhaustive training process. He added that a common misconception about LLMs is that they’re sourcing information like a search engine:\n\n“They are just probabilistically stringing words together in a way that is representative of the patterns within the model. So, it’s not even sourcing anything.”\n\nIt’s part of the reason why AI chatbots tend to “hallucinate” from time to time, Svetski explained, and why developing an LLM requires a focus on training it on a style of answering. Spirit of Satoshi is by no means perfect either, at least not in its current iteration.\n\n“Our model will also hallucinate. It’s also going to talk shit, but it’s going to say something more like a Bitcoiner would say.”\n\nHaving established a broad but targeted base of Bitcoin-centric information and data, Svetski’s team has set about feeding the model tens of thousands of question-and-answer pairs using programmatic methods. However, a human element is still required to help Spirit of Satoshi generate responses that might have come from its namesake.\n\nRelated: Bitcoin Amsterdam: BTC shines in depths of crypto bear market\n\nThe ongoing development of the model is leaning on the wider Bitcoin community as a result. Spirit of Satoshi employs an incentive process that allows the public to verify, create and validate data for the model.\n\nUsing credentials from the Lightning Network, Nostr or email addresses, a “proof-of-knowledge” mechanism allows users to get paid in satoshis for helping train the model.\n\nThe process uses a consensus model that will automatically impose a penalty if users are creating “junk data.” Svetski described it as the crucial “human” element to improve Spirit of Satoshi’s outputs:\n\n“It’s producing incredible content; it’s the last piece to take your content from 80% good to 95% good. And that has a huge impact on the quality of the model.”\n\nThe difference between responses generated by Spirit of Satoshi and ChatGPT is palpable, according to Svetski. The latter is trained on mainstream ideas of what Bitcoin (BTC) and concepts like inflation are:\n\n“If we ask ChatGPT about inflation, it will tell you it is a sign of a healthy economy. Well, it’s not; inflation is the sign of systemic problems, like your purchasing power decreasing.”\n\nSvetski said this scenario was part of the raison d’être behind Spirit of Satoshi, retraining the LLM to reflect the nuances that embody the type of thinking behind the Bitcoin movement:\n\n“If you ask about inflation, our model should say, ‘No, inflation is actually bad for the economy because it disincentivizes savings,’ or ‘Savings have a knock-on effect on people’s time preference.’”\n\nThe future of the platform is fairly open-ended, according to its founder. Spirit of Satoshi could be a learning tool or online tutor embedded into educational platforms or online universities. It could also be the basis for the “ultimate Bitcoin influencer” through its BTC-centric outputs:\n\n“I’d like to see it become the destination for the next 100 million or 500 million people that want to learn about Bitcoin — the point for their first steps of understanding.”\n\nSpirit of Satoshi was built on the basis of an existing open-source model that possesses inherent proficiency in English and a “Wikipedia-type of bias.” The latter was addressed by structuring the model’s responses to its Bitcoin and Austrian economics principles data sets.\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saWdodG5pbmctbGFicy1yZWxlYXNlcy10YXByb290LWFzc2V0cy1hbHBoYS1icmluZ2luZy1zdGFibGVjb2lucy10by1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Lightning Labs releases Taproot Assets alpha, bringing stablecoins to Bitcoin - Cointelegraph",
        "content": "Bitcoin layer-2 infrastructure firm Lightning Labs has released the mainnet alpha of Taproot Assets, a protocol aimed at enabling stablecoins and real-world assets to be issued on the Bitcoin and Lightning Network.\n\nThe current version, Taproot Assets v0.3, will provide a “feature-complete developer experience” to issue, manage and explore stablecoins and other assets on the Bitcoin blockchain, according to Ryan Gentry, head of business development at Lightning Labs.\n\n“We believe this new era for Bitcoin will see a myriad of global currencies issued as Taproot Assets, and the world's foreign exchange transactions settled instantly over the Lightning Network.”\n\n“With this release, developers can issue financial assets on-chain in a scalable manner,” Lightning Labs stated on Oct. 18 in a separate post. “Today marks a new era of multi-asset bitcoin.”\n\nAnnouncing the first mainnet release of Taproot Assets , a protocol for assets on #bitcoin and Lightning.\n\n\n\nWith this release, developers can issue financial assets on-chain in a scalable manner.\n\n\n\nToday marks a new era of multi-asset bitcoin. https://t.co/2cNvZSvv8v — Lightning Labs⚡️ (@lightning) October 18, 2023\n\nThis version of Taproot Assets will work by routing through existing Bitcoin (BTC) liquidity on the Lightning Network.\n\nGentry says the integration will extend Bitcoin’s network effects and move it one step closer toward “bitcoinizing the dollar.” He added:\n\n“This is how we make bitcoin the global routing network for the internet of money. This is how we bitcoinize the dollar and the world’s financial assets.”\n\nGentry described developer demand for stablecoin applications on Bitcoin as “overwhelming,” particularly given that some stablecoin issuers hold more United States Treasurys than the likes of Germany and South Korea.\n\n“[It] signifies the importance of these assets globally, and gives a sense of scale for the global user demand,” Gentry added.\n\nRelated: BitVM wasn’t created to make Bitcoin a pseudo-Ethereum, says developer\n\nNearly 2,000 Taproot Assets were minted on testnets over the last several months in the lead-up to the mainnet alpha launch, according to Gentry.\n\nAlpha launches typically mean the development isn’t in its final state. Lightning Labs said the alpha tag indicates that they expect the community to test it for potential bugs.\n\nBitcoin Drivechains (through Bitcoin Improvement Proposal-300), Botanix Labs’ Spiderchain and the BitVM are among the other developments in the Bitcoin ecosystem looking to expand Bitcoin’s capabilities.\n\nMagazine: Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9iaXRjb2luLWFuZC1ldGhlcmV1bS1nby10aGVpci1zZXBhcmF0ZS13YXlzLWZvci1ub3ctMTM4MTkxM9IBV2h0dHBzOi8vYW1wLmZ4ZW1waXJlLmNvbS9lbi9iaXRjb2luLWFuZC1ldGhlcmV1bS1nby10aGVpci1zZXBhcmF0ZS13YXlzLWZvci1ub3cvMTM4MTkxMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Go Their Separate Ways for Now - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY3J5cHRvLWJ1bGwtc2NhcmFtdWNjaS1zZWVzLTN4LWdhaW5zLWZvci1iaXRjb2luLWV0aGVyZXVtLWFuZC1hbGdvcmFuZC1oZXJlcy13aHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Crypto Bull Scaramucci Sees 3X Gains For Bitcoin, Ethereum, And Algorand — Here's Why - Nasdaq",
        "content": "SkyBridge Capital founder, Anthony Scaramucci has shed a bullish light on the future price trajectories of Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH), and Algorand (CRYPTO: ALGO), suggesting hearty targets for these cryptocurrencies, detailing the intrinsic factors that could drive such a bullish trend.\n\nThis optimistic outlook comes just ahead of Benzinga's Future of Digital Assets conference on Nov. 14, which aims to delve into the evolving dynamics of digital assets. Discussions about these predictions by Scaramucci could form a riveting part of the narrative as industry experts explore the potential future of cryptocurrencies.\n\nScaramucci postulates a bullish scenario for Bitcoin, attributing his confidence to the post-halving cycle which historically propels a surge in demand, in an interview with Altcoin Daily.\n\nHe states, “I believe six to 12 months after the halving cycle, there’s no reason why Bitcoin couldn’t be at $100,000. Just given what I know about demand and given what I know about the cycle and where the miners are, and so forth, plus, we may get some interest rate relief. That’s a 3x bump.”\n\nHis prediction reflects a tripling in Bitcoin’s value, which he analogizes to the technological advancements that have historically witnessed such price surges.\n\nWhile Scaramucci admits to not being as intimately acquainted with Ethereum, he nonetheless holds a positive stance.\n\nAlso Read: Fed Governor Michelle Bowman Says Creation Of US CBDC 'Could Pose Significant Risks'\n\nHighlighting the technological improvements and the increasing utility that Ethereum offers, he said, “Could Ethereum be $4,500 by then? Why not? You know it’s a great utility. Speeds have improved. The layer-2s have helped it. Why not? Why couldn’t it be $4,500? These things are maturing.”\n\nHis optimism extends to Algorand, albeit with a tempered tone due to its current trading price. Despite the crypto’s present modest trading range of around $0.09 to $0.10, Scaramucci sees potential for growth.\n\nHe envisions a path to $0.30 per token as Algorand continues to develop and garner adoption, especially from corporations enamored by its technology.\n\nHe adds, “I’m bullish. I thought at $1 it could have easily gotten to $5... but could Algorand from here... could it be a $0.30 token as they continue their development and continue the adoption of what they’re doing and bringing in corporations that love the technology? I believe it can.”\n\nRead Next: Binance.US Changes Terms: No More Direct Withdrawals Of US Dollars From Platform\n\nJoin Benzinga's Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nPhoto: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8yMDIzODUvYmxhY2tyb2NrLWFtZW5kcy1iaXRjb2luLWV0Zi1hY2tub3dsZWRnZXMtZmllcmNlLWNvbXBldGl0aW9u0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzIwMjM4NS9ibGFja3JvY2stYW1lbmRzLWJpdGNvaW4tZXRmLWFja25vd2xlZGdlcy1maWVyY2UtY29tcGV0aXRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "BlackRock Amends Bitcoin ETF Prospectus, Acknowledges Fierce Competition - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlackRock submitted an amended prospectus for its spot Bitcoin exchange-traded fund (ETF) application with the U.S. Securities and Exchange Commission (SEC) yesterday.\n\nNotable changes in BlackRock’s new filing include acknowledgment of the competition in the race for Bitcoin ETF approval, as well as detailed explanations on the product’s pricing and reporting mechanisms.\n\nThe world’s largest asset manager filed its first spot Bitcoin application under the title iShares Bitcoin Trust on June 15, 2023.\n\nAD\n\nAD\n\nThe asset manager refiled in July shortly after to include a surveillance sharing agreement with its custodian Coinbase and Nasdaq.\n\nBlackRock’s ETF latest changes\n\nYesterday’s filing reads that “There can be no assurance that the Trust will achieve initial market acceptance and scale due to competition.”\n\nCurrently, BlackRock is in the race with at least seven other applicants, including the largest Bitcoin trust fund, Grayscale.\n\nGrayscale recently won a key court case against the SEC after the agency rejected its application to convert its Grayscale Bitcoin Trust (GBTC) to a spot ETF. Last week, the SEC opted out of challenging the court’s ruling, boosting confidence in an approval.\n\nThe other significant difference in the new filling is in the pricing details of the ETF in the periodic financial statements filed by BlackRock.\n\nAD\n\nAD\n\nThe latest filing provides specific details about how this pricing source is determined in the Trust's periodic financial statements, including accounting specifications such as “Level 1 input according to ASC Topic 820,” which are not mentioned in the previous drafts.\n\nThe new filling also provides a detailed analysis with examples for the pricing of its CF benchmark index. The index aggregates Bitcoin’s price across several exchanges and will form the basis of BlackRock’s ETF.\n\nBlackRock is the third applicant to file an amended spot Bitcoin filing within a week following Ark Invest and Fidelity.\n\nSome experts have suggested that the amendments are a “good sign” and “solid progress” toward an approval.\n\nEdited by Liam Kelly."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFtc3RlcmRhbS1odXJkbGVzLWZvci1jb25zZW5zdXMtb3Zlci1vc2Fsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Amsterdam highlights hurdles for consensus over improvement proposals - Cointelegraph",
        "content": "Bitcoin core developers have long been at odds over Bitcoin improvement proposals (BIPs) to address the pain points of the protocol, as was apparent in a heated panel discussion during Bitcoin Amsterdam 2023.\n\nLong-time Bitcoin developers Paul Sztorc and Peter Todd brought this to the fore in Amsterdam, with the latter coming across as highly critical of Sztorc’s work in the ongoing development of Drivechains.\n\nSztorc’s LayerTwo Labs has been working on BIP-300 for nearly six years, which advocates for the creation of layer-2 sidechains that have the potential to address several problems without requiring base layer changes to the Bitcoin protocol.\n\nThe ensuing debate, which was at times heated, with Todd talking over Sztorc, highlighted the difficulty in reaching a consensus over BIPs that could potentially improve the overall functionality of the Bitcoin protocol.\n\nJameson Lopp, co-founder and chief technology officer of Bitcoin (BTC) custody firm Casa, weighed in on the issue during an in-depth interview with Cointelegraph at the conference, saying that the velocity of improvements and protocol changes has slowed down more than he would have liked.\n\nThat has changed somewhat in recent weeks with the emergence of new projects like BitVM and SpiderChain, as Lopp explains, which leads him to believe that a couple of proposed soft forks may well be beneficial to the future of the protocol:\n\n“In general, I think that Bitcoin should implement functionality that will improve its ability to be what you could call a cryptographic accumulator. Bitcoin should enable functionality that will boost the ability of second layers.”\n\nLopp adds that any potential “hardcore ossification” that some maximalists have argued for in the past would have stifled innovation that led to the creation of solutions like the Lightning Network that has helped the Bitcoin network scale to better process transactions.\n\n“Lightning wouldn’t really be possible without OP_CLTV. It would have maybe been possible, but really clunky without SegWit. And without OP_CSV, it would not be possible to have indefinitely long-lived Lightning channels.”\n\nLopp was referencing CHECKSEQUENCEVERIFY (OP_CSV) and CHECKLOCKTIMEVERIFY (OP_CLTV) — two BIPs that were carried out to facilitate payment channels as soft forks. OP_CLTV was authored by Todd, describing a Bitcoin operation code that allows a transaction output to be made unspendable until some point in the future.\n\nRelated: Bitcoin Amsterdam: Focus on BTC fundamentals, says Edward Snowden\n\nLopp adds that while Bitcoin’s protocol may become static due to a lack of consensus over base layer improvement proposals, developers are likely to keep building in ways that don’t require permissions:\n\n“If it’s not possible to implement a solution that may be optimally implemented at the base layer at the base protocol, then generally what we see end up happening is solutions being kind of bolted-on in many cases.”\n\nThe Casa exec believes that if Bitcoin does not continue to scale, users will inevitably turn to storing and using BTC through a “handful of Bitcoin banks, aka custodians and exchanges,” which comes with significant trade-offs:\n\n“Then it’s IOUs, right? That’s not the future that I think any of us want to see.”\n\nAs Cointelegraph previously reported, Bitcoin proponents and analysts at Bitcoin Amsterdam 2023 highlighted the growing importance of the cryptocurrency’s value proposal and hard money characteristics amid a drawn-out bear market.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTgtb2N0b2Jlci0yMDIzL2FydGljbGVzaG93LzEwNDUyMjcwMC5jbXPSAcEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE4LW9jdG9iZXItMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTA0NTIyNzAwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $28,500; Toncoin jumps over 6% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading mixed in Wednesday's trade with a positive bias. Bitcoin, Solana, Toncoin and Tron were trading in the green, while Ethereum, XRP BNB , Cardano, Dogecoin , and Polkadot were trading in the red.The global cryptocurrency market cap surged 0.76% to around $1.09 trillion in the last 24 hours.Bitcoin was up 1.1% at $28,586 as of 12:39 p.m., while Ethereum was below the $1,600 level.\"Bitcoin has maintained a trading position above the $28,300 mark in the last 24 hours. This price movement is driven by growing excitement among investors about the potential approval of a Bitcoin Spot ETF in the United States,\" said Edul Patel, CEO of Mudrex.\"BTC has successfully reclaimed the 200-day Simple Moving Average (SMA) and is currently holding above it. However, for BTC to continue its upward momentum, it needs to clear and sustain the crucial resistance level at ₹25,02,000 ($28,600),\" said CoinDCX Research Team.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, surged to $557 billion. Bitcoin's dominance is currently 51.23%, according to CoinMarketCap. BTC volume in the last 24 hours declined 40.3% to $15.4 billion.The central point of the chart is the pivotal $28,077, a key reference price. Immediate obstacles include resistance levels at $28,549, with subsequent obstacles at $29,219 and $29,886. Bitcoin's initial support is at $27,667 and other safety nets are at $27,208 and $25,985.The Relative Strength Index (RSI) is currently at 74, indicating that Bitcoin may be overbought. While an RSI above 50 usually indicates an uptrend, caution is advised due to its proximity to the overbought boundary.Meanwhile, the 50-day exponential moving average (50 EMA) at $28,077 reinforces its significance. Bitcoin is comfortably above the 50 EMA, indicating a short-term bullish outlook. Chart patterns reveal 4-hour trendline resistance near $28,600. Neutral candlestick patterns signal investor indecision, likely due to anticipation of clearer fundamental signals before taking action.Quick Glance (Source: coinmarketcap.com , data as of 13.08 hours, IST on October 18, 2023)Bitcoin $28,586 1.10%Ethereum $1,576 -0.53%Tether $1 -0.01%BNB $213 -0.16%XRP $0.4898 -0.12%Cardano $0.2477 -1.17%Dogecoin $0.0591 -1.05%Solana $24.01 0.32%Polygon $0.5211 -1.56%Litecoin $62.28 -1.36%Polkadot $3.68 1.75%Tron $0.0888 0.23%Shiba Inu $0.000006908 -2.08%Toncoin $2.08 6.08"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vYWZyaWNhLmJ1c2luZXNzaW5zaWRlci5jb20vbG9jYWwvbWFya2V0cy9ob3ctYml0Y29pbi1jcmVhdGVzLWludmVzdG1lbnQtb3Bwb3J0dW5pdGllcy1mb3ItaW5zdGl0dXRpb25zLzBrY3A4ZTjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "How Bitcoin Creates Investment Opportunities for Institutions - Business Insider Africa",
        "content": "From setting up metaverse shops to adding Bitcoin to balance sheets, institutions are finding new ways to invest in this cryptocurrency. Initially, only a few people could imagine large institutions investing in Bitcoin. Many people thought Bitcoin was a mere cloud that would eventually pass. But this cryptocurrency has captured the attention of many institutional leaders due to its increasing value and popularity. The 2020 and 2021 bull run has particularly attracted the interest of many institutions in the crypto industry.\n\nAnd as more institutions bring money into the crypto sector, it draws more retail investors. But how does Bitcoin create investment opportunities for retail investors? This blog post explores different ways Bitcoin motivates institutions to invest in it.\n\nPortfolio Management and Diversification\n\nADVERTISEMENT\n\nBitcoin is unique due to its borderless and decentralized nature. Many institutional leaders see it as an alternative asset with low portfolio risk and attractive returns. Therefore, they invest in it to diversify their investment portfolio. Platforms like the Bitcoin Profit App enables institutions to quickly purchase this cryptocurrency and transfer it into their digital wallets, where they can hold it waiting for its value to increase. If you want to invest in bitcoins then you can check out the online trading platform bitqt\n\nHedging Against Economic Turmoil\n\nSome institutions see Bitcoin investments as a potential hedge against inflation and economic uncertainty. They see Bitcoin's limited supply and decentralization as a feature that can help safeguard against conventional currencies' devaluation. Additionally, they see Bitcoin as a tool for storing and protecting wealth.\n\nCustomer Demand and Retention\n\nThe number of customers wanting to pay with Bitcoin is increasing daily. That's because more people are realizing the benefits of this digital currency. Therefore, some institutions invest in Bitcoin to attract and retain more customers. Besides seeking Bitcoin investment opportunities, they are providing crypto-related services. Failure to address customers' demands can make them choose their competitors.\n\nADVERTISEMENT\n\nIncreasing Returns\n\nBitcoin lures corporate institutions to invest in it with the growing crypto investment returns. Any entity that invested in Bitcoin ten years ago can reap significant profits by cashing out this crypto today. This cryptocurrency's historical volatility and price performance have attracted companies seeking opportunities for reaping high returns. Such firms see Bitcoin as a speculative investment opportunity that can yield high profits with proper management.\n\nBitcoin's Future Outlook as an Investment for Institutions\n\nBitcoin has an evolving and promising future outlook as an investment for institutions. That's because institutional investors' interest in this cryptocurrency is growing. Additionally, cryptocurrencies are showing the potential to impact the financial landscape. More institutions have shown interest in Bitcoin, and this trend will likely continue as more institutional investors learn about Bitcoin's potential and the opportunities it presents.\n\nThe increasing participation of institutions in the crypto industry will increase liquidity, credibility, and stability in the Bitcoin market. And this will foster a favorable environment for this cryptocurrency's acceptance and growth.\n\nADVERTISEMENT\n\nMoreover, institutional investors' entrance into the crypto space will lead to overall market maturity. It will introduce expertise, regulatory compliance measures, and risk management strategies. These developments will help players in the crypto market address regulatory frameworks, custody, and security concerns among Bitcoin investors. Also, they will make Bitcoin more attractive and accessible to more investors.\n\nFinal Word\n\nBitcoin is an innovation with many investment opportunities for institutional investors. These investors play a vital role in Bitcoin's incorporation into various economic sectors and the future. Moreover, they help expand activities in the crypto industry. The unique nature of Bitcoin as a digital asset enables it to create various investment opportunities for institutions. And as more institutional investors explore these opportunities, they enhance Bitcoin's credibility, usage, and acceptance.\n\n--"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vY3J5cHRvd2FsbGV0LmNvbS9hY2FkZW15L2Jlc3QtYml0Y29pbi13YWxsZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "Top 11 Best Bitcoin Wallets Of 2024 - CryptoWallet.com",
        "content": "Welcome to our guide on the Best Bitcoin Wallets of 2024! The Bitcoin market is growing rapidly, with institutional interest and mainstream adoption now at unprecedented levels. It’s an exciting time to buy Bitcoin, and for would-be investors, the first step is choosing a safe and effective wallet to store your funds.\n\nBTC wallets offer a secure solution for safeguarding your BTC holding as well as other cryptocurrencies. With so many different types of BTC wallets available, it is quite important to select the one that aligns with your specific needs.\n\nThese top Bitcoin wallets cater to a range of cryptocurrencies including BTC, while some crypto wallets are designed exclusively for Bitcoin. Furthermore, BTC wallets are categorised into two primary types – hot wallets and cold wallets, which we will explain in the next section.\n\nCryptoWallet.com – Best wallet to spend Bitcoin\n\nCryptoWallet.com is the best Bitcoin wallet for daily use. You can send and receive BTC with ease and manage 800+ other cryptos on multiple blockchain networks. You can also buy and sell Bitcoin instantly and spend BTC with our Crypto Card. Ledger Nano X – Best Hardware wallet for BTC\n\n– Best Hardware wallet for BTC Trust Wallet – Best mobile wallet\n\n– Best mobile wallet Exodus – Best desktop wallet\n\nWhat is a Bitcoin Wallet?\n\nA Bitcoin wallet or BTC wallet is a software or a device that acts as an “account” to hold your BTC funds and stores the data required to access it. You can use your BTC wallet to access your Bitcoin, initiate transactions such as sending Bitcoin (withdrawal), receiving Bitcoin (deposit), and checking the status of transactions.\n\nEvery BTC wallet contains a pair of cryptographic keys — a private key and a public key. The private key is a secret code (or password) that enables the owner to access their Bitcoins and make transactions, while the public key is a wallet address that others can use to send Bitcoin (BTC) to the wallet.\n\nBTC Wallets come in various forms, including mobile apps, desktop software, web-based interfaces, and hardware wallet devices. Users can choose the type of wallet that suits their preferences and needs.\n\nSome Bitcoin wallets are custodial, meaning you don’t control the keys — this is similar to a bank having direct control over the money in your bank account, and it serves the same purpose, which is to share or deflect responsibility for looking after your funds to a professional.\n\nSome people prefer non-custodial wallets, which is more similar to walking around with cash in your pocket or keeping money under your mattress. Using a non-custodial BTC wallet means you’re in charge of the funds, and responsible for their safekeeping.\n\nHow to Choose The Best BTC Wallet?\n\nIf you want to choose the best Bitcoin wallet, the primary factor to consider is whether you prefer a hot wallet or a cold wallet.\n\nHot BTC wallets are connected to the internet and are convenient for everyday transactions. They include web wallets, mobile wallets, and desktop wallets. While they offer ease of use, they are more vulnerable to online threats compared to cold wallets.\n\nCold BTC wallets, also known as hardware wallets (for example Leder Nano X), are offline storage solutions that provide enhanced security. These wallets are less susceptible to hacking but may be less convenient for frequent transactions.\n\nChoosing the best BTC wallet depends on factors like security preferences, usage patterns, and the level of control users want over their private keys. It’s essential to research and select a reputable wallet provider to ensure the safety of your Bitcoin holdings.\n\n11 best Bitcoin Wallet Reviewed\n\nCryptoWallet.com\n\nOK, we know what you’re thinking — of course, we’re going to recommend our own product. However, we built CryptoWallet.com specifically to target the issues we found in other popular wallets.\n\nCryptoWallet.com is more than just a wallet. It’s a crypto neobank that offers various crypto banking services including crypto-powered IBAN, SEPA bank transfers using crypto funds, crypto card to spend Bitcoin and other assets directly and a built-in exchange to buy and sell cryptocurrencies.\n\nCryptoWallet.com offers the best wallet for spending BTC directly. We call our custodial Bitcoin wallet “Bitcoin Account” where you can hold your bitcoins and spend it anywhere with our Crypto Card.\n\nOn our exchange, you can buy Bitcoin with a credit card or debit card and use it for banking and payments – such as making bank transfers using your Bitcoin, spending it online with the crypto card, or converting it to fiat instantly at any ATMs.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Fiat currency: Yes\n\nYes Own exchange incorporated: Yes\n\nYes Ease of Use: Very Easy\n\nPros 👍\n\nWe made CryptoWallet.com to help you buy, store, trade, and sell Bitcoin. CryptoWallet.com is the Best BTC wallet that allows you to spend Bitcoin and other assets practically anywhere. It is an all-in-one solution. It comes with a built-in buy and sell feature that allows you to buy hundreds of cryptocurrencies, with fiat support for both euros and pound sterling.\n\nYou can even order your own crypto card and finally spend Bitcoin or over 800 other cryptos as real money! Order your crypto card here.\n\nThe ability to spend crypto online or in shops really sets our solution apart in our opinion, as the app provides you with everything you need for Bitcoin in one place.\n\nCons 👎\n\nCryptoWallet.com is a custodial BTC wallet which means users don’t control their own keys with CryptoWallet.com, unlike non-custodial solutions like Trust Wallet or Ledger hardware wallet. Again, this is a personal preference. Users with paper wallets or non-custodial solutions have sole access to their keys. However, with the card, you can link non-custodial wallets and spend funds directly from them if you wish, instead of the CryptoWallet.com wallets.\n\nOf course, self-custody means no exchange, no debit card, no customer support, no community, and no rewards program. We offer an enterprise-grade level of security, as well as all the perks mentioned above. We’re happy to put our name forward as the best wallet out there for users looking for the all-in-one Bitcoin wallet solution.\n\nLedger Nano X\n\nThe Ledger Nano X is a highly regarded hardware crypto wallet known for its mobile support (via Bluetooth) exceptional security features and wide-ranging coin support. Ledger the best Bitcoin wallet if you want to store large amounts of BTC for a long period of time.\n\nHardware wallets like Ledger is the SAFEST way to store Bitcoins (BTC) because your digital assets remain offline, protecting them from online threats and providing peace of mind for long-term cryptocurrency storage. It’s a trusted choice among crypto enthusiasts for safeguarding their investments.\n\nAs a product from Ledger, a prominent name in the crypto space, the Ledger Nano X builds upon the success of its predecessor, the Nano S. It offers enhanced storage capacity and compatibility with a vast range of cryptocurrencies.\n\nThe standout feature that distinguishes Ledger from Trezor is its Bluetooth connectivity, allowing the hardware wallet to sync with your mobile device, and providing the convenience of managing your cryptocurrencies while on the move.\n\nType of wallet: Hardware\n\nHardware Purchase cost: £109 or €149\n\n£109 or €149 Own exchange incorporated: No\n\nNo Ease of Use: Advanced\n\nPros 👍\n\nLedger Nano X is the best Bitcoin wallet that offers a “cold storage” solution to safeguard your BTC and other assets. This means that funds are kept offline when not in use. Hardware wallets are considered the most secure BTC wallets. Users can set up the Ledger software on their desktop computer and plug in the Ledger Nano X to transfer cryptos.\n\nCons 👎\n\nSetups can be complicated for hardware devices, and these crypto wallets are arguably for more advanced users.\n\nCoinbase Wallet (DeFi)\n\nCoinbase Wallet is a cryptocurrency wallet provided by Coinbase, a reputable cryptocurrency exchange. It is the best BTC wallet – ideal for beginners due to its user-friendly interface and strong security features. The wallet supports a vast array of cryptocurrencies, including popular ones like Bitcoin, Litecoin, and Dogecoin, along with thousands of ERC-20 tokens and tokens on EVM-compatible blockchains.\n\nOne crucial distinction is that Coinbase Wallet operates independently of the Coinbase exchange. While the exchange offers a web wallet convenient for trading, the Coinbase Wallet is non-custodial, meaning it doesn’t control your private keys.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Own exchange incorporated: Yes\n\nYes Ease of Use: Very easy\n\nPros 👍\n\nCoinbase Wallet offers a user-friendly interface for easy navigation and supports over 100 digital assets. It prioritizes security with features like multi-signature and two-factor authentication.\n\nCons 👎\n\nOnly available on mobile and tablet devices (except for Chrome extension)\n\nTrezor Model T\n\nThe Trezor Model T is a hardware wallet designed to securely store wide range of cryptocurrencies including BTC. It is compatible with Windows, MacOS, and Linux operating systems, offering versatility for various users. With support for over 1,000 cryptocurrencies and robust PIN code protection, USB-C, and a touchscreen interface. Additionally, it is compatible with the Exodus wallet and the wallet boasts a high trust rating, underlining its reliability and security.\n\nTrezor Model T is also one of the best hardware wallets to store Bitcoin. It is an ideal choice for beginners due to its simple setup process. It distinguishes itself by enabling users to purchase assets and tokens directly through its Trezor Wallet application, offering a unique feature not found in most other software wallets or Ledger hardware wallets.\n\nHowever, it’s worth noting that it comes at a relatively higher initial cost compared to other cryptocurrency wallets on the market. Read the full Trezor hardware wallet review.\n\nType of wallet: Hardware\n\nHardware Purchase cost: £190 or €219\n\n£190 or €219 Own exchange incorporated: Yes\n\nYes Ease of Use: Beginners\n\nPros 👍\n\nLike Ledger, Trezor is a hardware wallet that offers better security than software BTC wallets or “hot wallets”. Trezor is considered one of the best Bitcoin wallets that offers support for a growing number of currencies and is compatible with certain online wallets.\n\nCons 👎\n\nUnlike Ledger, Trezor doesn’t offer any mobile support. This means users cannot access their crypto funds instantly, especially on the go.\n\nTrust Wallet\n\nTrust Wallet is the best Bitcoin wallet for mobile. It is a top choice for mobile due to its outstanding features and impressive versatility. As our preferred mobile BTC wallet, it stands out for its user-friendly app interface, extensive support for decentralized applications (dApps) and NFTs, and an extensive array of supported digital assets.\n\nTrust Wallet supports a range of cryptocurrencies, including major coins like Bitcoin (BTC) and Ethereum (ETH), as well as numerous ERC-20, BEP-2, and BEP-20 tokens. Users can manage multiple assets within a single wallet.\n\nTrust Wallet is a non-custodial wallet, meaning users have full control over their private keys and funds. It doesn’t rely on a centralized third party to manage your assets, enhancing security and privacy.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Crypto exchange: Partners’ website\n\nPartners’ website Ease of Use: Beginners\n\nPros 👍\n\nTrust Wallet, chosen as the top mobile crypto wallet, stands out for its user-friendly mobile app interface and extensive support for thousands of cryptocurrencies and tokens. Owned by Binance, it offers an array of features including earning interest on 12 different cryptocurrencies and a built-in Web3 browser for easy access to decentralized applications (dApps) and NFTs.\n\nCons 👎\n\nHowever, its association with Binance, which has faced regulatory challenges in the US, may raise concerns for some users, and the wallet’s educational resources on cryptocurrencies are somewhat limited.\n\nExodus\n\nExodus is the best BTC wallet for desktop use, and we selected it due to its speedy transactions, user-friendly interface, and versatile features.\n\nExodus supports Bitcoin as well as various other cryptocurrencies such as Bitcoin, Litecoin, Ethereum and many other cryptos across a range of blockchain networks. It can also get linked to Trezor hardware wallet allowing you to store Bitcoins more safely offline.\n\nInitially designed exclusively for desktop use, Exodus has since expanded to include mobile apps for both iOS and Android platforms. However, its core offering remains its desktop application, which is compatible with Windows, Linux, and Mac operating systems and receives regular updates every two weeks.\n\nOne of Exodus’ standout features is its extensive support for cryptocurrencies and NFTs, with over 260 different digital assets available for storage and management. This impressive list covers established cryptocurrencies like Bitcoin, Ethereum, Litecoin, XRP, and Bitcoin Cash, along with popular meme coins such as Dogecoin and Shiba Inu.\n\nAdditionally, Exodus offers various apps that enhance its functionality, including tools for live crypto charts, staking, and crypto deposits, making it a versatile and visually appealing choice for cryptocurrency enthusiasts and investors.\n\nType of wallet: Mobile and desktop\n\nMobile and desktop Purchase cost: Free\n\nFree Fiat currency: No\n\nNo Own exchange incorporated: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nExodus offers support for over 260 different cryptocurrencies, ensuring users can manage a wide variety of digital assets within a single interface. Additionally, its compatibility with Trezor One and Trezor T hardware wallets provides an added layer of security, catering to users who prioritize cold storage solutions.\n\nCons 👎\n\nThere are a few drawbacks to consider when using Exodus. Notably, the wallet may incur high transaction fees on its in-wallet crypto exchange, potentially impacting users seeking cost-effective trading options.\n\nAtomic Wallet\n\nAtomic Wallet is a decentralized, non-custodial crypto wallet available in both mobile and desktop versions. It is another safe wallet to store your Bitcoin. Atomic Wallet is known for its user-friendly interface that allows users to securely and privately manage their digital assets.\n\nAtomic Wallet offers support for Bitcoin as well as a wide range of cryptos, making it a versatile solution for managing diverse digital assets. Users can perform cryptocurrency exchanges within the wallet interface without needing to leave the application. This feature is available in both the mobile and desktop versions.\n\nType of wallet: Mobile and Desktop\n\nMobile and Desktop Purchase cost: Free\n\nFree Buy/Sell Cryptos: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nUsers can store Bitcoin as well as hundreds of different digital assets on Atomic Wallet, and also carry out atomic swaps for select currencies (a form of crypto trading). The app is also supported on mobile devices.\n\nUsers can earn rewards through in-app staking, making it a convenient option for those interested in participating in cryptocurrency staking.\n\nCons 👍\n\nAtomic Wallet may not be compatible with a wide range of hardware wallets, potentially limiting options for enhanced security.\n\nUsers can’t spend cryptocurrency on real-life goods or services using Atomic, so it’s still necessary to use the app in conjunction with a bank or something similar for that purpose. Like most non-custodial wallets, there’s no customer support, nor are there security features such as 2FA.\n\nCrypto.com (DeFi wallet)\n\nCrypto.com’s DeFi Wallet is non-custodial crypto wallet, which is different from the Crypto.com exchange wallet. This wallet does not require users to create an account on Crypto.com’s exchange platform, giving you full control over your Bitcoin and other digital assets.\n\nCrypto.com’s DeFi Wallet is recognized as one of the best DeFi crypto wallets due to its comprehensive suite of decentralized finance tools, user-friendly onboarding process, and robust security measures. Designed for users venturing into the world of decentralized finance (DeFi), this wallet empowers individuals with full control over their digital assets and private keys, emphasizing self-custody and security.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Fiat currency: No\n\nNo Own exchange incorporated: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nKey features of the Crypto.com DeFi Wallet include the ability to engage in peer-to-peer crypto swaps and a diverse range of tools for earning passive income from existing cryptocurrencies.\n\nCons 👎\n\nJust like any other non-custodial wallet, your funds are inaccessible if you lose your private key and recovery phrase. The Built-in token swap also has some geo-restrictions\n\nElectrum\n\nElectrum is a highly respected Bitcoin wallet known for its robust security and user-friendly design. This desktop wallet offers a secure way to store and manage your Bitcoin assets. It employs a hierarchical deterministic structure, providing users with a seed phrase for wallet recovery. Electrum works on Windows, macOS, and Linux, and can be used in conjunction with popular hardware wallets like Trezor and Ledger for added protection.\n\nElectrum offers privacy-enhancing options, supports customizable transaction fees, and provides multi-language support.\n\nType of wallet: Desktop\n\nDesktop Purchase cost: Free\n\nFree Own exchange incorporated: No\n\nNo Ease of Use: Intermediate\n\nPros 👍\n\nFast and easy to set up and offer better security than other hot wallets\n\nCons 👎\n\nSetup and interface are not ideal for beginners and no customer support via chat, email or phone\n\nGuarda\n\nGuarda is a non-custodial Bitcoin wallet that supports BTC and a variety of other digital assets such as Litecoin, Ethereum and erc-20 tokens, USDT, and many more. Guarda is available as a web wallet, desktop application (Windows, macOS, and Linux), and mobile app (Android and iOS), providing users with flexibility and accessibility across various devices.\n\nIt is one of the best Bitcoin wallet that offers a built-in token swap service, enabling users to exchange one cryptocurrency for another without leaving the wallet. This can be convenient for trading and portfolio management.\n\nUsers can store, swap, earn interest, and buy Bitcoin and other cryptocurrencies directly within the wallet. Guarda offers in-app staking, allowing users to earn interest on their digital assets. Many supported cryptocurrencies feature opt-in staking opportunities.\n\nType of wallet: Mobile, Web, Desktop\n\nMobile, Web, Desktop Purchase cost: Free\n\nFree Buy/Sell Cryptos: Swap only\n\nSwap only Ease of Use: Easy\n\nPros 👍\n\nGuarda allows users to store funds on desktop, mobile, and web browsers. The wide variety of options will appeal to some traders. While Guarda is non-custodial, it still offers customer support in the event of an issue or lost funds. You can create multiple-user wallets for different currencies.\n\nIt is one of the best BTC wallets and features an intuitive and user-friendly interface, making it suitable for both newcomers and experienced cryptocurrency users.\n\nCons 👎\n\nGuarda Wallet charges transaction fees for in-app crypto purchases, with a standard transaction fee rate of 5.5%. This fee structure may be considered relatively pricey when compared to competitors. However, it does offer customizable transaction fees for users.\n\nThis solution is still a basic storage-only app, with no added features such as a debit card, bank account number, or affiliate program.\n\nRobinhood\n\nRobinhood is a stock trading app that also offers Bitcoin support.\n\nThe Robinhood Wallet app serves as a self-custodial wallet. You can securely store and oversee your cryptocurrency holdings across various networks, including Ethereum, Bitcoin, Dogecoin, Polygon, Arbitrum, and Optimism. Robinhood Wallet empowers you with complete authority over your digital assets, ensuring that you retain ownership of the private keys.\n\nType of wallet: Mobile\n\nMobile Purchase cost: Free\n\nFree Own exchange incorporated: Yes\n\nYes Ease of Use: Easy\n\nPros 👍\n\nRobinhood is beginner-friendly, with a simple interface and access to stocks as well as cryptocurrencies.\n\nCons 👎\n\nRobinhood is also only available in the US.\n\nBest Hardware Wallet for Bitcoin\n\nA hardware or “cold” wallet will be the most secure way to store your Bitcoin tokens. These physical devices are always offline which prevents hackers from gaining access.\n\nTo access or transfer funds, you’ll need to connect it to an online device. This extra step, which ensures the safety of your funds, adds a level of complication that some investors prefer to avoid. This is why many investors opt for an easy-to-use assured software wallet like CryptoWallet.com instead.\n\nTrezor and Ledger offer the most reliable cold wallets on the market today. Both have a proven track record of security and offer a range of different features. If you’re looking for your first hardware wallet, you’ll want one that is easy to set up and use.\n\nWith Trezor, you’ll need to use a USB to connect it to a computer to use the Trezor Wallet desktop app. This means it may be harder to capitalize on sudden market changes.It’s a good choice for users who are concerned about the security of their funds above all else.\n\nLedger is Bluetooth-enabled and comes with a desktop and a mobile app called Ledger Live. This makes it that little bit easier to connect and use. It also supports a wider range of tokens. It is an ideal hardware wallet for intermediate traders. Let’s keep looking at Bitcoin wallets.\n\nTypes of Bitcoin (BTC) Wallets\n\nThere are several types of Bitcoin wallets, each with its own characteristics and use cases.\n\nHardware BTC Wallet\n\nThese are physical devices designed to store Bitcoin offline, making them highly secure from online threats. Examples include Ledger Nano X, and Trezor Model T.\n\nThese wallets are highly secure. Funds are stored offline, meaning it’s not possible for hackers to access them remotely. It’s a little tricky to set these wallets up, and buying and selling Bitcoin is more time-consuming as you’ll need to plug your wallet into a computer and operate it from the desktop app.\n\nCrypto investors sometimes keep large sums offline in a hardware wallet (or cold wallet) and smaller sums for convenient trading or spending in an online wallet (or hot wallet).\n\nRead More: Best Hardware Wallets\n\nSoftware BTC Wallets:\n\nDesktop Wallets: Desktop wallets store Bitcoin data on a desktop computer. You can store your private keys (similar to account passwords) in some of these wallets, and send and receive Bitcoin on your computer.\n\nThese wallets are only as secure as your desktop device, so one downside is the potential for funds to be vulnerable to viruses or hackers. Examples are Electrum, Exodus, and Bitcoin Core.\n\nMobile Wallets: Mobile wallets are typically mobile apps that allow users to send and receive Bitcoin. These wallets offer greater accessibility than desktop wallets, as you can use them anywhere.\n\nWith private key wallets, it’s possible to lose your phone and your private keys and thus your funds. However, many mobile wallets are offered by companies with customer support that secure your keys and make it very easy to restore funds should you lose or break your device\n\nWeb Wallets: A web wallet can be accessed on any web browser. These are device-agnostic, meaning you can use a mobile phone, desktop computer, tablet, or other internet device to access your funds. They are user-friendly but potentially less secure as they are connected to the internet.\n\nRead more: Best Crypto Wallet\n\nCustodial VS Non-Custodial Wallet\n\nCustodial wallets and non-custodial wallets are two different types of cryptocurrency wallets, each with its own set of characteristics and trade-offs:\n\nCustodial Wallets\n\nCustodial wallets, often provided by exchanges or wallet services, grant a third party control over your private keys and funds. Custodial wallets are often easier to use, making them suitable for beginners. Users can access their funds with a username and password.\n\nSince the Bitcoin wallet provider (company) holds your private keys, they are responsible for security measures, including safeguarding your funds and protecting against hacks. Some custodial wallets offer account recovery services, which can be helpful if you forget your login credentials.\n\nNon-Custodial Wallet\n\nIn a non-custodial wallet, you have full control over your private keys and, by extension, your cryptocurrencies. The wallet provider does not have access to your keys.Non-custodial wallets are considered more secure because they reduce the risk of hacks or breaches at the wallet provider’s end. Users are responsible for their wallet’s security.\n\nNon-custodial wallets can be more complex to set up and use, making them better suited for experienced users. These wallets often prioritize user privacy, as they don’t require users to provide personal information.\n\nThe choice between a custodial and non-custodial wallet depends on your preferences, experience level, and security priorities. If you value convenience and are willing to trust a third party with your funds, a custodial wallet might be suitable. On the other hand, if you prioritize security and want full control over your assets, a non-custodial wallet is the better option.\n\nCryptoWallet.com – The Best Bitcoin Wallet to Spend BTC\n\nThere are many factors to consider when choosing a crypto wallet that allows you to use Bitcoin for its intended purpose. At CryptoWallet.com, you can not only store your Bitcoins but also spend BTC with our crypto card.\n\nThe CryptoWallet.com card enables you to spend more than 800 cryptocurrencies directly from your crypto wallet, with real-time crypto conversion and the lowest transaction fees in the market among all currently available crypto cards.\n\nAdditionally, you can buy Bitcoin and other cryptos with a credit card and debit card. You can also sell your Bitcoins instantly on our exchange at low fees.\n\nWith a CryptoWallet.com account, you can create an IBAN to manage EUR funds, which you can use to buy and sell cryptos and perform crypto-powered bank transfers within the SEPA zone.\n\nBitcoin Wallet FAQs\n\nWhat is a BTC wallet? A BTC wallet, or Bitcoin wallet, stores your crypto funds safely — as long as you look after the private keys! A BTC wallet is a piece of software or a physical device that stores bitcoins. It can be thought of a little like a regular wallet, or a bank account. When you open a BTC wallet, you receive a string of characters and numbers called a public key. This is the wallet address, and if you want someone to send you BTC, you need to give them this address. You’ll also receive another series of characters and numbers called a private key, and this one is similar to a password. If you want to send BTC from your wallet, you need to enter this password. You don’t need to take any action to receive BTC. Some BTC wallets are non-custodial, meaning you don’t have control of the private keys. This takes us back to the bank account analogy — you’re not responsible for the funds, a professional is. Technically, it would be possible for them to freeze your funds under extreme circumstances, such as government intervention. Some people prefer to go for a non-custodial wallet, meaning they’re solely in control of the funds. This is similar to carrying cash in a wallet, or under a mattress. Nobody else is responsible for the safekeeping of these funds, and like regular fiat money, some people aren’t comfortable keeping large sums on their person or in their house. Sometimes, the best solution is a hybrid one. One BTC wallet for walking around money, and another for larger sums. Whatever you choose, you’ll need to protect your details to prevent any security breach from taking place. Look after your BTC wallet, and it will look after you! How do you cash out your Bitcoin wallet? Cashing out of a Bitcoin wallet has historically been very complicated. It was necessary to join an exchange like Coinbase and sell Bitcoin for cash, then transfer that cash to a bank account over the course of several days. Of course, that’s the beauty of CryptoWallet.com! With CryptoWallet.com account, you can simply cash out BTC to your bank account instatnly. Alternatively you can also withdraw Bitcoin (as cash) from any ATM using our Crypto Card, or even spend it directly on anything you like, whether online or in-store. Get your Crypto Card today! How to add funds to a Bitcoin wallet? You can add funds to a Bitcoin wallet from any other Bitcoin wallet. You can simply use the public key (wallet address) to send BTC to any Bitcoin wallet. If you want to buy Bitcoin, you can use any crypto exchange that accepts credit or debit cards. That includes CryptoWallet.com! When purchasing BTC, simply add the wallet address (public key), and the BTC will be transferred to your Bitcoin wallet. What is Bitcoin cold storage? Bitcoin cold storage refers to a method of keeping a reserve of Bitcoins offline (on Hardware wallets like Trezor or Ledger), which is completely isolated from the internet or any online computer network. The main purpose of cold storage is to provide a high level of security for your Bitcoin holdings by minimizing exposure to potential online threats, such as hacking, malware, or unauthorized access. What is a Bitcoin address? A Bitcoin address is a string of alphanumeric characters that show the destination of a Bitcoin payment. Your address is the same as the public key of your Bitcoin wallet. Should you use multiple Bitcoin wallets? Some people like to diversify crypto storage locations. When dealing in large sums, it can be a good idea to keep some funds on a hardware or offline wallet and some on an online wallet for easy trading or spending. Which is the safest Bitcoin wallet? When considering wallet safety there is no ‘one size fits all’ wallet. Fortunately, there exists a wide variety of different wallet systems that are each tailored to different accessibility and security needs. In terms of raw security, hardware wallets are considered to be the most secure means of storing Bitcoin. Hardware Wallets such as Ledger or Trezor are stored on a device similar to that of a USB key and are generally offline or ‘cold,’ and therefore extremely resistant to virus attacks. However, this type of wallet system may not be suitable for everyone’s needs, as they aren’t as easily accessible as other wallet types and are considered to be a little pricey. Desktop or Mobile Wallets systems are much cheaper and far more accessible, as they store one’s coins on an app installed onto one’s computer or handheld device. These wallets such as Hive Android or Mycelium have a high degree of accessibility allowing for easy trade through QR codes or Near Field Communication. The drawback to this accessibility is that they are considered ‘hot’ or online, and therefore more vulnerable to malware and phishing attacks. What is the best crypto wallet? Every crypto wallet will offer different features and levels of security. Some wallets prioritize convenience while others are focused on security above all else. Ultimately, the best crypto wallet will be the one that matches your requirements. If you’re looking for the most secure crypto wallet, a hardware wallet would be a perfect choice. These are physical devices which store your keys offline. This makes them less vulnerable to hacks or malware. You’ll need to connect them to an online device to fully use your assets which can be inconvenient. Software wallets offer much greater convenience as your keys are stored online and you can access your funds from anywhere. They are generally easier to use and set up than a hardware wallet. However, their constant online connection makes them more vulnerable to cyberattacks. At CryptoWallet.com, we don’t believe that you should have to sacrifice security for convenience. That’s why we’ve protected all funds held in our software wallets. The mobile app and cryptocurrency exchange are streamlined and intuitive to use. Our crypto wallet combines security, convenience and ease of use to make one of the best crypto wallets on the market. What is the best crypto wallet for beginners? If you’re looking to get started in the world of trading cryptocurrencies, you’ll want a crypto wallet tailored to your needs. An ideal crypto wallet would be secure, convenient and easily operated.\n\nSoftware wallets will be the easiest wallet to set up and use. They are more vulnerable to cyber attacks as they are constantly online but they are far easier to use. There are two types of software wallets available, self-custody or custodial. With a self-custody wallet, you have full control over your keys. While many investors prefer this, it comes with more responsibility and you may need to be more tech-savvy than with a custodial wallet. If you lose access to your wallet, your funds may be irretrievable. This is why many beginners choose custodial wallets. With custodial wallets, a third party, like an exchange, manages your keys. This is much more convenient and can be helpful if you lose your keys or login details. At CryptoWallet.com, we offer one of the most secure custodial wallets. This is ideal for anyone looking to get started safely. There is a dedicated customer support service for any questions you might have and an Academy if you want to broaden your knowledge. We also offer a cryptocurrency exchange, making our platform a perfect all-in-one option for beginners. What crypto wallet should I use? While there are a range of different crypto wallets on the market, the crypto wallet that you should use depends on what level of trading and features you’re looking for. Beginner traders and advanced traders may be looking for different things when it comes to choosing a crypto wallet. Some platforms offer an entire suite of DeFi products and thousands of coins. These wallets are ideal for advanced traders looking for savings accounts, highly-speculative investment opportunities and more. These platforms are often more difficult to navigate and get used to. Hardware wallets like Ledger and Trezor are the most secure but also the least convenient. As they are offline devices, you’ll need to connect them to an online device to use. They can be tricky to set up which makes them more suitable for intermediate or advanced inventors. Software wallets are more suitable for beginners but they are often less secure. They are constantly online meaning you can access your funds wherever you are. This also makes them more vulnerable to being hacked. If you’re looking for a robust option for beginners, CryptoWallet.com offers all of the convenience of a software wallet while assuring all funds are held. Our exchange is integrated with our mobile app making it extremely user-friendly.\n\nRead More: Best Ethereum Wallet ; Best USDT Wallets ; Best Litecoin Wallet, Best XRP Wallet, Best Solana Wallet"
    }
]