[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjgvYml0Y29pbi1wcmljZS13b250LXN0YXktYmVsb3ctMzBrLWZvci1sb25nLWNyeXB0by1vcHRpb25zLXRyYWRlcnMtYmV0L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjgvYml0Y29pbi1wcmljZS13b250LXN0YXktYmVsb3ctMzBrLWZvci1sb25nLWNyeXB0by1vcHRpb25zLXRyYWRlcnMtYmV0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Won’t Be Stuck Below $30K for Long, Crypto Options Traders Bet - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2hhY2tlci1zdG9sZS1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "What would you do if a hacker stole all your bitcoin? - Blockworks",
        "content": "It’s the heat of a bitcoin bull market and you’ve just been phished for all your crypto.\n\nIf you’re anything like Colorado resident Andrew Schober, you’d turn to Reddit.\n\nBack in 2018, Schober unknowingly downloaded a compromised iteration of the Electrum bitcoin wallet he’d found on the /r/BitcoinAirdrops subreddit.\n\nBuried inside the phony wallet was malware: a clipboard hijacker designed specifically to phish bitcoin.\n\nThe malware would take any outbound Bitcoin address on Schober’s machine and mimic it, replacing the intended recipient address with one controlled by the hacker.\n\nSchober, who’d been slowly acquiring bitcoin since 2014, ended up losing 16.5 BTC ($487,000) sent via the dodgy software — 95% of his net worth.\n\nThe bitcoin was valued at $180,000 when he was phished, but $1.1 million at bitcoin’s all-time high in 2021. Schober considered it “life-changing money.”\n\n“I came across a link to the malware on Reddit and installed it on my PC and realized pretty quickly that it wasn’t doing what it was advertised to do,” Schober told Blockworks. “So I just deleted it off my PC and didn’t think about it anymore.”\n\n“But unfortunately, once that Trojan is installed on your hard drive, deleting the original source program doesn’t get rid of the Trojan. So from that point forward, it was monitoring my hard drive for any time I copied a Bitcoin address.”\n\nThe malware was pre-coded with 195,112 different BTC addresses. “It doesn’t just change the Bitcoin address to some random new address,” Schober explained. “It matches the first few characters of the address you copied. So it looks pretty visually similar and if you’re not really paying attention, you won’t catch the difference and that’s what happened to me.”\n\nFour of those addresses ended up receiving BTC from unknowing victims around the time of Schober’s attack, which considerably narrowed his scope.\n\nTracing stolen bitcoin through Monero\n\nThe beauty of the blockchain is in its open ledger. Almost all crypto transactions leave breadcrumbs that form a digital paper trail.\n\nMost often, following that trail involves stepping through transfers to track where coins end up. But for anonymity-focused Monero, secondary data such as IP addresses, social media activity and even protected crypto exchange data helps link transactions beyond a reasonable doubt.\n\nIn Schober’s case, he’d traced bitcoin that had been stolen by the same malware to ShapeShift, the long-serving platform for atomically swapping between cryptocurrencies.\n\nShapeShift, for a time, maintained an API that shared addresses involved in its swaps. The API data showed Schober’s attacker had swapped BTC for XMR, as well as the addresses used.\n\nSo, Schober posted on Reddit, asking if it were possible to trace Monero transactions. Nick Bax, an on-chain investigator and asset recovery specialist, answered the call.\n\n“He got like five replies that were like: ‘No, that’s impossible.’ I sent him a direct message that said: ‘This is really hard to do. But I’ve done it before. And I know one lawyer who managed to get funds recovered once,’” Bax told Blockworks.\n\nBax ended up submitting on-chain evidence identifying the hacker as part of Schober’s lawsuit filed in May 2021 — more than two years ago. Part of that process involved analyzing Monero transactions to determine, with high confidence, the provenance of XMR featured in attempts to launder Schober’s stolen BTC.\n\nShapeShift’s API made tracking the stolen BTC a cinch | Source: Nick Bax\n\nHe coded the Monero-tracing software himself. “You flag an output [strings that instruct the Monero blockchain where to direct transactions] and look for every transaction that could possibly have spent that flagged output. When you do that, patterns start to emerge.”\n\nThis method of cracking Monero ring signatures — now known as an Eve-Alice-Eve (EAE) attack — popped up in the fallout of the prolific North Korea-fueled ransomware campaign WannaCry that started in 2017.\n\n“Monero’s RingCT…hides the exact UTXO being spent, but does provide blockchain analysts with a list of plausible ‘ring members,’ one of which is being spent and the remainder of which are ‘decoys,’” Bax wrote in a blog unpacking his investigation.\n\nA now-patched bug in Monero may have made separating real UTXOs from the decoys — and thus tracing the transactions — easier at the time.\n\nA brilliant idea: Subpoena the FBI\n\nBax determined that Schober’s alleged hacker had converted some BTC stolen from another victim to XMR through ShapeShift, before sending it back through the protocol to transform it into BTC once more.\n\nThe washed BTC was directed to what’s known as a “vanity address” that started with “1BeNEdict.”\n\nAs for Schober’s bitcoin, that ended up on Bitfinex. Crypto exchange hot wallets are effectively black boxes, as their balances represent pooled customer funds.\n\nOnce crypto goes into a hot wallet, it’s almost impossible to determine where they’re withdrawn to unless the amounts are identical and uncommon — and even that proof is not definitive.\n\nThat’s where Schober and Bax’s investigation sat for more than a year. Stuck. Schober had subpoenaed Bitfinex to disclose the owner of the accounts which received the pilfered BTC, but he was stonewalled.\n\n“Bitfinex will only respond to law enforcement requests for customer information, not civil requests, because Bitfinex does not get involved in civil matters, in particular in the United States since US courts do not have jurisdiction over us,” Sarah Compani, Bitfinex legal adviser, told Schober’s lawyer Ethan Mora via email in response.\n\n“The reason that some of these crypto exchanges like FTX and Bitfinex incorporate in the British Virgin Islands or the Caymans is for those legal reasons, where they don’t necessarily have to abide by US law, or any other law,” Schober said.\n\n“They can just be down there and be kind of extrajudicial. They didn’t even really give us an answer.”\n\nBlockworks has reached out to Bitfinex for comment.\n\nWith no way into Bitfinex directly, Mora initiated what’s known as a Touhy request to the Cyber Division of the FBI — demanding documents and other information related to the agency’s own investigations into the malware. Schober had reported the hack to the FBI just after he lost the bitcoin.\n\n“The FBI started to issue subpoenas to companies that were involved in the malware, like Reddit [where it was posted] and GitHub, which was hosting it,” Schober said. The subpoenas happened in late 2018, early 2019. The FBI had even seized his computer for a few months as part of their investigation.\n\nIt took around 10 months, but the Touhy request worked. Suddenly, Schober’s team had internal Bitfinex data pointing to the exact IP and email addresses tied to the accounts which had received his stolen bitcoin.\n\n“We really had no idea what the FBI investigation had uncovered until we got the response from the DOJ regarding the Touhy questions,” Mora said.\n\nVanity address comes back to bite\n\nThanks to the FBI subpoena, Schober’s team could identify the hacker’s accounts across a suite of online services: Gmail, Keybase, Reddit, Twitter and Github. Code necessary for the malware was found on the alleged hacker’s public GitHub repository, including the BTC address generator on which it hinged.\n\nThe 1BeNedict address used to launder stolen BTC through ShapeShift was also verified by some of those accounts — which Bax cited as proof of the hacker’s identity (the vanity address matched his first name).\n\nA return address lodged with ShapeShift by the attacker during the apparent laundering process, where the protocol would send crypto in the case of transaction issues, was identical to the Bitfinex hot wallets which had received BTC stolen from Schober.\n\nThere was even a post on the bitcoin-dev mailing list, sent from an email address matching the alleged hacker’s real name, which described how easy it was to generate Bitcoin addresses with a striking resemblance to ones provided. The post matched the Electrum malware’s modus operandi to a tee.\n\nAfter running enough diagnostics, Bax found that “every bitcoin transaction sent by the Electrum Atom malware operator went to a destination address that was linked” to the alleged hacker that had been investigated by the FBI. Addresses tied to the malware had received 17 BTC ($501,000) in total — 97% of it Schober’s. He was able to get in touch with another victim via long-running Bitcoin forum BitcoinTalk.\n\nBitcoin has been through an entire bull cycle since Schober’s phishing incident | Chart by David Canellis\n\nAll this meant Schober could lodge a civil lawsuit against the suspected perpetrator — along with another individual who’d allegedly peddled the same malware on Reddit. Both were underage at the time of the heist, so the suit also named their parents. All parties deny any wrongdoing.\n\nThat was in May 2021, more than three years after Schober was phished for his BTC. The price of bitcoin had more than doubled in that time.\n\nComplicating matters is that the alleged hacker lives in the UK. The FBI referred the case to UK law enforcement, leading to a joint investigation. Both suspects were arrested, interrogated and had their devices seized and forensically searched, Schober said.\n\nBut before their arrest, desperation (and perhaps a touch of naivety) meant Schober contacted them and their parents to let them know they’d been identified. “I hoped they would come clean and just return it to me because all I was doing was asking them to return what was stolen, and they didn’t do it,” Schober said.\n\n“The UK Crown Prosecution Service ended up telling me that after I contacted them, they likely destroyed their devices because they had entirely new devices and there wasn’t enough forensic evidence for them to warrant pressing charges.”\n\n(Bax said he would have done the exact same thing as Schober did — they figured the parents were probably decent people on account they worked at a bank and at the UK National Health Service. “They should just give the money back and I’d think it all goes away.”)\n\nSchober’s civil suit is now potentially his one-and-only shot at justice. But the case is moving slowly, with lawyers arguing over in which jurisdiction a trial should take place.\n\nLawyers for the alleged hacker say the suit should be dismissed because Schober, based in the US, doesn’t have jurisdiction over someone in the UK. They also argue that the statute of limitations has expired for him to file a complaint.\n\n“But that’s not true from our perspective because it took so much time and effort and investigation to even identify that it was a human being that was on the other end of this,” Schober said.\n\nHe feels he shouldn’t be punished by the statute of limitations argument, considering he was forced to wait 10 months for an FBI subpoena after being stonewalled by Bitfinex over critical information to his case.\n\nAn unprecedented case\n\nSchober’s situation could really be the first of its kind, as it stretches across the pond.\n\n“There aren’t many cases like this one, in fact, I’m not aware of any cases where an individual has ever tracked down, properly served (under international law), and sued hackers like this… let alone hackers who stole cryptocurrency,” Mora said.\n\n“I was involved in some cases here in California where some individual plaintiffs sued some domestic scammers/hackers from other US states, but those defendants had been arrested in the US.”\n\nMora highlighted cases in which the government brought criminal charges against blackhats foreign and domestic, as well as instances where tech giants like Amazon and Google sued their hackers, some of which demand ransoms in crypto.\n\nSchober is anything but a multinational conglomerate — a typical guy, unlike some high-profile wealthy victims of crypto theft that have brought cases against their attackers.\n\n“I believe this case is unprecedented in a number of ways…there’s no telling how long this case could be going on,” Mora said.\n\nGitHub couldn’t let Schober know if law enforcement had investigated, making the Touhy request a gamble that paid off\n\nExactly how it might be resolved is really anyone’s guess. If a US court rules that the hacker owes Schober, then an English court would still need to recognize that ruling before it can enforce the judgment in the UK. Eventually, it could even come down to debt collection, liens or even wage garnishment.\n\nSchober said they’d been able to trace a sizable amount of bitcoin sitting in addresses gleaned from the FBI subpoena, so it appears the alleged hackers do have funds to pay Schober back.\n\nThe situation is especially frustrating considering it seems Schober knows exactly who stole his crypto.\n\nStill, Schober is pro-Bitcoin, despite everything that’s happened, legal fees and the half-million dollars in bitcoin lost. “I still love the promise of Bitcoin. That was what got me into it in the first place. But certainly, my early mover advantage has been erased, which is painful.”\n\n“So it hurts but I’m still positive about it at this point. And I’m proud of the fact that I’ve been able to take this case to the point where it’s at now, because the odds against it were very, very slim.”\n\nHe’s optimistic that US courts will see that he’s a victim of theft. Had the alleged attackers been based in Russia or North Korea, for example, he’d hardly have any recourse.\n\n“It’s been five years and I’m ready to move on from this as soon as possible,” Schober said. “But on the other hand, I’ve really put in so much effort and time and have people like Bax, and others, that are in my corner because they’ve heard the story and they think it’s kind of remarkable.”\n\n“So I’m resolved to see it through to the end.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0by1zdG9ja3Mtd2F0Y2gtYml0Y29pbnMtMTMxMTAwMjEzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "3 Crypto Stocks to Watch on Bitcoin's Expected Long-Term Gains - Yahoo Finance",
        "content": "Cryptocurrencies have had a solid run this year after a not-so-memorable 2022. The Fed’s aggressive interest rate hikes to battle multi-decade-high inflation saw the cryptocurrency market taking a hit last year. This year has been good as favorable macroeconomic conditions have helped cryptocurrencies, including Bitcoin (BTC), make a solid rebound.\n\nHowever, Bitcoin price fell below $29,500 on Jul 26 after the Fed increased interest rates by 25 basis points. Earlier this year, Bitcoin soared to a 13-month high of $31,500 driven by robust demand from institutional buyers.\n\nThe scenario is exactly opposite to that of last year. The Fed has increased interest rates by 525 basis points since March 2021, which raised doubts about the potential of Bitcoin.\n\nBesides, a series of unfortunate events like the Terra Luna crash and a major fraud that resulted in FTX’s bankruptcy raised concerns about the future of cryptocurrencies.\n\nThe flash crash on Wednesday was expected as market participants were almost certain about the Fed’s rate hike. Growth assets like technology stocks, consumer discretionary stocks and cryptocurrencies are adversely affected by higher interest rates. So, this may not entirely come as a shock.\n\nBitcoin’s price has surged 78.1% year to date and hovered around the $30,000 mark almost through July. Economists had forecast that Bitcoin would bounce back in 2023 and gather further momentum in the second half.\n\nThis is because macroeconomic conditions are a lot more favorable now. Economic data indicates that inflation has started cooling. Although the Fed increased interest rates once again, slowing inflation has raised hopes that the latest interest rate hike could be the last in the central bank’s current monetary tightening cycle.\n\nThis bodes well for the overall cryptocurrency market.\n\nStocks to Watch\n\nHIVE Blockchain Technologies Ltd. (HIVE - USD) operates as a cryptocurrency mining firm. The company validates transactions on blockchain networks. It also provides crypto mining and builds bridges between crypto and traditional capital markets.\n\nStory continues\n\nHIVE Blockchain’s expected earnings growth rate for the current year is 78.1%. Shares of HIVE have gained 35.5% in the past 30 days. HIVE presently carries a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nStronghold Digital Mining, Inc. SDIG is a vertically integrated Bitcoin mining company. SDIG focuses on mining Bitcoin in the United States.\n\nStronghold Digital Mining’s expected earnings growth rate for next year is 92.7%. Shares of SDIG have gained 138% in the past 30 days. Stronghold Digital Mining presently carries a Zacks Rank #2 (Buy).\n\nBitfarms Ltd. BITF is a Bitcoin mining company. BITF provides vertically integrated mining operations with onsite technical repair, proprietary data analytics, and company-owned electrical engineering and installation services to deliver operational performance and uptime.\n\nBitfarms’ expected earnings growth rate for the current year is 86.1%. Shares of BITF have gained 29.7% in the past 30 days. BITF presently has a Zacks Rank #3 (Hold).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBitfarms Ltd. (BITF) : Free Stock Analysis Report\n\nStronghold Digital Mining, Inc. (SDIG) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtcHV0LWV5ZXMtb24tMzFrLXByaWNlLWFzLTJiLW9wdGlvbnMtZXhwaXJlLWZyaWRhedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin traders put eyes on $31K even as $2B in BTC options expire on Friday - Cointelegraph",
        "content": "The upcoming $2 billion Bitcoin (BTC) monthly options expiry on July 28 could potentially establish $29,500 as a support level. Some argue that the recent United States Federal Reserve interest rate increase to 5.25% had a detrimental effect on risk-on assets like cryptocurrencies. However, Bitcoin bulls believe that the full impact of a tighter economic policy takes time to influence the markets.\n\nBitcoin daily price movements during option expiries. Source: TradingView\n\nLooking back, the monthly expiry on June 30 did not cause significant volatility, given that Bitcoin had already experienced a 22.2% gain between June 15 and June 23. Conversely, the May monthly expiry triggered a 9% rally, with Bitcoin’s price rising from $26,100 on May 25 to $28,450 on May 29.\n\nIn contrast, the options expiry in April resulted in a 7% correction, as Bitcoin’s price dropped from $29,900 on April 27 to $27,800 on May 1. This data clearly indicates that the impact of options expiry takes a few days to consolidate but eventually becomes highly relevant for setting trends.\n\nBulls have regulatory and the ETF momentum on their side\n\nThere are multiple spot Bitcoin ETF requests from some of the world’s largest fund managers, including BlackRock and Fidelity. In addition, on July 26, a U.S. House committee approved a pair of bills aiming to clarify the distinctions between securities instruments and digital commodities.\n\nThe recent positive corporate earnings also support the bullish momentum in risk-on markets. Along with the latest Consumer Confidence data, they strengthen the argument that the risk of a recession is diminishing, at least in the short term. For starters, Meta Platforms reported $32 billion in 2Q revenues, surpassing the market’s estimates.\n\nSeveral other companies have also reported earnings above consensus, including McDonald’s, Coca-Cola, Google, Johnson & Johnson, Morgan Stanley and Novartis. As for the U.S. Consumer Confidence Index, the metric reached its highest level in two years, reaching 117 in July, up from 110.1 in June.\n\nData shows bulls were excessively optimistic on Bitcoin price\n\nThe open interest for the options expiry on July 28 is $2 billion. Still, the actual figure is expected to be lower because some bullish traders anticipated price levels of $31,000 or higher. This excessive optimism stemmed from Bitcoin trading above the resistance level from July 13 to July 24.\n\nBitcoin options aggregate open interest for July 28. Source: Deribit\n\nThe 0.56 put-to-call ratio reflects the imbalance between the $1.3 billion in call (buy) open interest and the $740 million in put (sell) options. Yet, if Bitcoin’s price remains near $29,500 at 8:00 am UTC on July 28, only $137 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $30,000 or $31,000 is useless if BTC trades below that level on expiry.\n\nBitcoin bears aim for sub-$29,000 to secure some profit\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on July 28 for call (buy) and put (sell) instruments varies depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit.\n\nThis crude estimate disregards more complex investment strategies. For instance, a trader could have sold a put option, effectively gaining positive exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nBetween $27,000 and $28,000: 1,100 calls vs. 10,000 puts. The net result favors the put instruments by $240 million.\n\n1,100 calls vs. 10,000 puts. The net result favors the put instruments by $240 million. Between $28,000 and $29,000: 3,000 calls vs. 6,800 puts. The net result favors the put instruments by $110 million.\n\n3,000 calls vs. 6,800 puts. The net result favors the put instruments by $110 million. Between $29,000 and $31,000: 6,500 calls vs. 6,600 puts. The result is balanced between put and call options.\n\n6,500 calls vs. 6,600 puts. The result is balanced between put and call options. Between $31,000 and $32,000: 15,400 calls vs. 3,800 puts. The net result favors the call instruments by $360 million.\n\nNote that the bulls’ best shot requires a 5.5% price increase ahead of the July 28 expiry to secure a profit. On the other hand, bears only need a modest 2% correction below $29,000 to come out ahead on the monthly expiry. However, the potential profit of $110 million doesn’t justify a large effort for the bears. Moreover, given that Bitcoin has recently failed to break the $29,000 support level, the most probable outcome for the expiry is a neutral area near $30,000.\n\nWhen analyzing a broader mid-to-long-term scenario, Bitcoin bears may have the upper hand due to the added incentives of higher fixed-income returns resulting from the reduced 3% inflation and increased interest rates. But, considering the overall bullish momentum in the economy, there’s actually a favorable outlook for Bitcoin to break above $31,000 in the following weeks.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL3doYXQtaXMtc3Rha2luZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 18:16:56 GMT",
        "title": "What is staking? | Learn about crypto and DeFi | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "What is staking?\n\nStaking is a way for people to lock up their cryptocurrencies or digital assets in order to earn rewards over time. Staking crypto is akin to depositing money in a bank. Banks need customer deposits to create loans for other people and businesses. To incentivize customer deposits, banks offer interest. Staking operates in a similar manner.\n\n\n\nStaked cryptocurrencies are locked up in a project. The project then uses these staked coins to maintain its operations, such as validating transactions. And just like a bank pays interest on deposits, the crypto project gives rewards for staking cryptocurrencies. So, both banks and crypto networks use the assets they are given (money or crypto) to operate (create loans or validate transactions), and both offer incentives (interest or staking rewards) to encourage people to provide these assets.\n\nUse the multichain Bitcoin.com Wallet app, trusted by millions to safely and easily buy, sell, trade, and manage bitcoin and the most popular cryptocurrencies. Stake VERSE, Bitcoin.com’s official utility and rewards token, easily on Verse DEX."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzI4L2JpdGNvaW4tYnVsbHMtc2hvdWxkLXN3aXRjaC10by1jYWxsLW9wdGlvbnMtY3J5cHRvLXNlcnZpY2VzLXByb3ZpZGVyLW1hdHJpeHBvcnQtc2F5cy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNy8yOC9iaXRjb2luLWJ1bGxzLXNob3VsZC1zd2l0Y2gtdG8tY2FsbC1vcHRpb25zLWNyeXB0by1zZXJ2aWNlcy1wcm92aWRlci1tYXRyaXhwb3J0LXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Bulls Should Switch to Call Options, Crypto Services Provider Matrixport Says - CoinDesk",
        "content": "Buying a call lets you control the same amount of shares as buying the underlying asset with significantly less money. A call buyer pays a premium to the seller for offering protection against bullish moves. The premium paid is the maximum amount the call buyer can lose if the market drops. An at-the-money call is the one whose strike price is closer to the going market rate of the underlying security. For instance, calls at strikes around bitcoin's current market price of $29,180 are at-the-money."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tZnV0dXJlLWNoYW5nZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin doesn't need to change, but… - Blockworks",
        "content": "Bitcoin is over ten years old, but you wouldn’t know it. Almost all of the changes to its inner workings over the years have been quite conservative, leaving us a Bitcoin that Satoshi would easily recognize.\n\nProposed changes sometimes ignite a debate within the community centered around what Bitcoin truly “is” or “needs.” While there are strong opinions and arguments on both sides, the protocol ultimately requires fundamental but careful updates, alongside meaningful but functional second-layer applications.\n\nWhen thinking about Bitcoin’s future, it’s essential to consider the repercussions of ossification. I’ve touched on this topic several times — but in a nutshell, ossification is the process whereby so many applications get built on top of a protocol and adopted by the masses that it becomes exceedingly difficult, if not impossible, to alter the underlying protocol without breaking almost everything.\n\nWith thousands or tens of thousands of third-party services relying on the base network, it’s infeasible to coordinate upgrades across every provider simultaneously. We’ve already seen this occur with protocols like TCP, one of the primary mechanisms used to handle internet traffic, and it will inevitably happen with Bitcoin.\n\nI bring this up because we don’t know when Bitcoin will become too ossified to change — and there’s a small chance it’s already too late. This adds pressure to the entire debate because, at some point, updating through BIPs will become impossible, so solving problems at that level will be a moot point.\n\nThat being said, Bitcoin represents an uncontrollable technology that all are free to build on top of.\n\nConsidering that many, including myself, believe that there is still some important work to be done on the protocol level, we need to act swiftly to ensure the Bitcoin network is developed enough to work as the digital currency system it intended to be.\n\nUpdating Bitcoin’s code is nothing new\n\nBecause the network operates around consensus, any new changes submitted via Bitcoin Improvement Proposals (BIPs) need to be agreed upon (or at least not objected to) by an overwhelming portion of ecosystem participants.\n\nThis is understandably a slow and onerous process. Unsurprisingly, as a result, there have only been a handful of major upgrades in the history of the protocol.\n\nOne of these upgrades, known as Segregated Witness, or Segwit for short, represented a change in the fundamental transaction format to protect against transaction malleability: the ability to change small bits of information in an unconfirmed transaction in such a way that makes child transactions invalid.\n\nMore recently, we implemented the Taproot upgrade, enabling more scalable and private complex spending conditions for Bitcoin as well as signature aggregation. This, however, was likely not the last upgrade Bitcoin will see, and many proposals are already in the works that may eventually become a part of the core protocol.\n\nSIGHASH_ANYPREVOUT would allow a transaction to spend from any unspent transaction output that is encumbered by a given set of spending conditions. This enables greater flexibility, unlocking complex transaction constructions, such as creating atomic swaps and shared lightning network channels.\n\nThere are also covenants — a topic I’ve spoken about at length — that would restrict where a given address could send Bitcoin, which holds significant security implications.\n\nDrivechains also stand to bring permissionless pegging of bitcoin to and from sidechains, which could both aid in scalability as well as experimentation.\n\nOf course, there’s one major change that is pushed by ESG proponents, and that’s a claim that the network should change from one secured by proof-of-work to one powered by proof-of-stake. This is being suggested because proof-of-work takes a significantly greater amount of energy to perform than proof-of-stake.\n\nEthereum recently switched to proof-of-stake, ushering in a ~99.5% reduction in energy usage. However, there are trade-offs in switching from one type of consensus mechanism to another that are more complicated than just power consumption. This article isn’t going to wade through that debate, but it is one of the best examples of a controversial change that is unlikely to occur, even though it has its proponents.\n\nThe case for building on bitcoin instead\n\nThe Bitcoin ecosystem is free to update the protocol in any way it can collectively agree upon. However, further upgrades to the core code aren’t the only way forward.\n\nUsers are exploring a myriad of ways that Bitcoin can be developed on top of, without changing anything within the core protocol.\n\nThere are already some well-known examples. They include the Lightning Network, a second-layer solution utilizing off-chain micropayment channels, scaling the blockchain’s capacity and speed, and lowering fees. There’s also been the recent addition of inscriptions, which amount to Bitcoin’s own version of NFTs by embedding image data in the blockchain.\n\nA brief internet search will reveal many more such projects, and admittedly, the previous upgrades to the Bitcoin protocol made these technical achievements possible. Nonetheless, this highlights that Bitcoin, as it is now, is fully capable of being built on to enable innovative improvements.\n\nThe debate rages on\n\nSome Bitcoin proponents don’t want to see the protocol change at all. Remember, there are as many opinions about these additions to the network as there are projects and proposals. Still, some purists are quite vocal about what they see as the failures of some of these endeavors.\n\nPopular Bitcoin commentator Shinobi wrote an essay outlining multiple existing shortcomings of the lightning network, explaining at length that it’s unlikely to become a globally scalable, secure payment system without additional upgrades.\n\nLightning may be spurring some debates, but the recent addition of Ordinals is stirring the pot further.\n\nThe argument is largely between those who feel that Bitcoin should be strictly about financial transactions, and others who believe that the network is robust enough to host any type of data, secured by the fees required to transact them. This disagreement showcases another inherent tension between the philosophy of changing Bitcoin, against the philosophy of building on top of it.\n\nUltimately, there’s no one clear path forward for Bitcoin. The protocol will continue to reflect the desires of its users as it was intended. Bitcoin is designed to exist for hundreds of years to come, but that doesn’t mean it is already in its final form.\n\n\n\nMoving forward, I’d like to see a combination of thoughtful, community-driven updates to the core protocol that enable and enhance innovative new protocols built on top of the base layer.\n\nThe idea that there is only one path forward is simply too restrictive of a view for something as important as Bitcoin.\n\nJameson Lopp is the CTO & cofounder of Casa, a self custody service. A Cypherpunk whose goal is to build technology that empowers individuals, he has been building multisignature bitcoin wallets since 2015. Prior to founding Casa, he was the lead infrastructure engineer at BitGo. He is the founder of Mensa’s Bitcoin Special Interest Group, the Triangle Blockchain & Business meetup, and several open source Bitcoin projects. Throughout this time he has worked to educate others about what he has learned the hard way while writing robust software that can withstand both adversaries and unsophisticated end users.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjcvYml0Y29pbi1tYXktcmVhY2gtMzAway1ieS0yMDI4LWhhbHZpbmctc2F5cy0xNmItYXNzZXQtbWFuYWdlci_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzI3L2JpdGNvaW4tbWF5LXJlYWNoLTMwMGstYnktMjAyOC1oYWx2aW5nLXNheXMtMTZiLWFzc2V0LW1hbmFnZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin May Reach $300K by 2028 Halving, Says $1.6B Asset Manager - CoinDesk",
        "content": "Yusko joins other bitcoin bulls who have recently predicted a higher price for the digital currency. Most recently, British multinational bank, Standard Chartered, predicted that bitcoin could reach $120,000 by the year-end. Meanwhile, Crypto services provider Matrixport, said it sees bitcoin rallying to as high as $125,000 by the end of 2024."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tZXRoZXItb3duZXJzaGlwLTIwMjItYmFuay1vZi1jYW5hZGHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, ether ownership fell in 2022, Bank of Canada finds. Here's why. - Blockworks",
        "content": "In a 2022 survey released on Wednesday, the Bank of Canada broke down the ownership of cryptocurrencies in Canada.\n\nThe report found that Canadians sold out of their bitcoin positions in 2022, but did not ”shift out of Bitcoin and into other cryptoassets, as we observed decreased ownership of altcoins.”\n\nPossibly adding to that statistic is the fact that the Bank of Canada found that under a third of bitcoin owners “are highly literate about how the Bitcoin system actually works, while a slightly larger proportion have basically no knowledge.”\n\nBut altcoin ownership remained roughly the same in 2022 as it was in 2021. Only about a percent of Canadians surveyed owned a stablecoin.\n\nMeanwhile, “…the ownership rate for ether, the second most popular cryptoasset, declined from 7% in 2021 to 4% in 2022,” the Bank wrote.\n\nRead more: Canadians appear willing to embrace CBDC: Survey\n\nThe Bank of Canada found that, in 2021, bitcoin holders cashed out for profit while “the decline in Bitcoin ownership from 13% to 10% contrasts with stable ownership rates observed from 2017 to 2018 (5%) when prices declined even more than between 2021 and 2022.”\n\nLast year, the price of bitcoin was volatile as crypto winter settled in and the collapses of TerraUSD and FTX sent shockwaves throughout crypto.\n\nThe Bank of Canada believes that the decline in bitcoin ownership in 2022 “shouldn’t be surprising” because 2021 saw many Canadians invest “record” amounts in traditional financial assets as well as cryptos — such as bitcoin, which helped to “explain the increase in the ownership rate to 13% in 2021.\n\nJumping into investments isn’t the only reason that Canadians were interested in bitcoin, however. The Bank noted that 24% of bitcoin owners in 2022 “cited technology-related reasons, such as an interest in new technologies, for holding the cryptoasset.” Only 11% said that they held bitcoin for payment reasons.\n\n“With the exception of 2021, the percentage of owners citing payment-related reasons for owning bitcoin has steadily declined from its peak in 2016,” the Bank said.\n\nThe Bank stated that the volatility not only in crypto markets, but also in financial markets, helped to “reduce investors’ appetites for risky assets, including cryptocurrencies.”\n\nThe tight regulatory environment was also noted, between the Canadian Securities Administration forcing cryptocurrency platforms to “comply with investor protection laws” and the US SEC regulating through enforcement helped to lessen the appetite.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDcvMjcvcmZrLWpyLWJpdGNvaW4tY3VycmVuY3ktb2YtZnJlZWRvbS1jYW5hZGlhbi1nb3Zlcm5tZW50LW1vcnBoZWQtaW50by1tb25zdGVyLWR1cmluZy10cnVja2VyLXByb3Rlc3RzL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDcvMjcvcmZrLWpyLWJpdGNvaW4tY3VycmVuY3ktb2YtZnJlZWRvbS1jYW5hZGlhbi1nb3Zlcm5tZW50LW1vcnBoZWQtaW50by1tb25zdGVyLWR1cmluZy10cnVja2VyLXByb3Rlc3RzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "RFK Jr: Bitcoin ‘Currency of Freedom’; Canadian Government Morphed Into ‘Monster’ During Trucker Protests - CoinDesk",
        "content": "A recent controversial video posted by the New York Post shows Kennedy saying “COVID-19 attacks certain races disproportionately.” He has also been a vehement critic of vaccines and has demanded better vaccine safety. He’s been called a bigot and an anti-vaxxer, but during the Twitter Spaces, claimed that all these labels are simply underhanded attempts to censor him."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzI4L2ZpcnN0LW1vdmVyLWFzaWEtc29tZS1iaXRjb2luLXdoYWxlcy1hcHBlYXItY29udGVudC10by13YWl0LWZvci10aGUtbmV4dC1wcmljZS1jYXRhbHlzdC_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNy8yOC9maXJzdC1tb3Zlci1hc2lhLXNvbWUtYml0Y29pbi13aGFsZXMtYXBwZWFyLWNvbnRlbnQtdG8td2FpdC1mb3ItdGhlLW5leHQtcHJpY2UtY2F0YWx5c3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "First Mover Asia: Some Bitcoin Whales Appear Content to Wait for the Next Price Catalyst - CoinDesk",
        "content": "First Mover Asia: Some Bitcoin Whales Appear Content to Wait for the Next Price Catalyst\n\nPLUS: BTC continued to trade above $29.2K, slightly down over the past 24 hours amid another day of low volatility."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjcvYml0Y29pbi12b2xhdGlsaXR5LWV4cGVjdGVkLW9uLWZyaWRheXMtYmFuay1vZi1qYXBhbi1yYXRlLWRlY2lzaW9uLWhlcmVzLXdoeS_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzI3L2JpdGNvaW4tdm9sYXRpbGl0eS1leHBlY3RlZC1vbi1mcmlkYXlzLWJhbmstb2YtamFwYW4tcmF0ZS1kZWNpc2lvbi1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Volatility Expected on Friday's Bank of Japan Rate Decision. Here's Why - CoinDesk",
        "content": "For instance, Japanese yields might rise sharply on potential YCC tweak, eventually leading Japanese investors to sell their foreign bond holdings in favor of domestic bonds. That, in turn, would lift foreign bond yields and dent money flow into risk assets. (bond yields and bond prices move in opposite directions). Japan is the world's largest creditor nation, with record net external assets of 418.63 trillion yen ($3 trillion) in 2022. Japanese investors have been on a foreign bond buying spree, given the low yields at home and relatively higher yields elsewhere."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8yOC9hLWJsYWNrcm9jay1idGMtZXRmLXdvdWxkbnQtYmUtcG9zc2libGUtd2l0aG91dC1iaXRjb2luLW1pbmVycy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDcvMjgvYS1ibGFja3JvY2stYnRjLWV0Zi13b3VsZG50LWJlLXBvc3NpYmxlLXdpdGhvdXQtYml0Y29pbi1taW5lcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "A BlackRock BTC ETF Wouldn't Be Possible Without Bitcoin Miners - CoinDesk",
        "content": "A Bitcoin spot ETF validates the validators. Its arrival would be a sign that securing the network always had global significance, and that there is even more of a role to play as promising new technology finds its place in the global economy. As Wall Street and regulators debate the specifics of a spot Bitcoin ETF, miners are developing profitable business models with Ethereum and Artificial Intelligence, making the ETF debate already seem dated. I noted in another CoinDesk piece from earlier this year how our company, Bit Digital, had developed an Ethereum “Flywheel Model” wherein mined Bitcoin can be converted into Ethereum and then staked for rewards."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNy8yNy93b3JsZGNvaW4tY291bGQtZW5hYmxlLXdpZGVyLWRpc3RyaWJ1dGlvbi1vZi1jcnlwdG8tdGhhbi1ldmVuLWJpdGNvaW4tc2F5cy1jb2luZnVuZC_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDcvMjcvd29ybGRjb2luLWNvdWxkLWVuYWJsZS13aWRlci1kaXN0cmlidXRpb24tb2YtY3J5cHRvLXRoYW4tZXZlbi1iaXRjb2luLXNheXMtY29pbmZ1bmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Worldcoin Could Enable Wider Distribution of Crypto Than Even Bitcoin, Says CoinFund - CoinDesk",
        "content": "The CEO said he's not worried about the token not being available in the U.S. at the moment due to regulatory concerns, and believes that WLD will eventually be available stateside."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8yNy9taW5pbmctYml0Y29pbi1pcy1hbi1hY3Qtb2YtZnJlZWRvbS_SAV9odHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDcvMjcvbWluaW5nLWJpdGNvaW4taXMtYW4tYWN0LW9mLWZyZWVkb20vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Mining Bitcoin Is an Act of Freedom - CoinDesk",
        "content": "Bitcoin mining is sometimes criticized for being overly concentrated. However, it's important to note that many of the largest miners are public entities. While the ideal situation might be small scale individual miners competing in the free market, and mining bitcoins from their laptops, this is also economically unviable for a decentralized monetary network that has to guard itself against corporate and nation-state attacks. There is much at stake, and if Bitcoin is to survive then serious resources need to be committed to it."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzI3L2dyYXlzY2FsZS11cmdlcy1lcXVhbC10cmVhdG1lbnQtZm9yLWFsbC1zcG90LWJpdGNvaW4tZXRmcy1pbi1sZXR0ZXItdG8tc2VjL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzI3L2dyYXlzY2FsZS11cmdlcy1lcXVhbC10cmVhdG1lbnQtZm9yLWFsbC1zcG90LWJpdGNvaW4tZXRmcy1pbi1sZXR0ZXItdG8tc2VjL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Grayscale Urges Equal Treatment for All Spot Bitcoin ETF's in Letter to SEC - CoinDesk",
        "content": "“An approval that promotes investor protection and fairness for issuers should therefore be made simultaneously with approval of all proposed spot bitcoin ETPs, including those such as the Trust whose Rule 19b-4 filings were previously disapproved after lengthy Commission consideration,” said the statement."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8yNy9lbmhhbmNpbmctcHJvZml0YWJpbGl0eS1vZi13aW5kLWFuZC1zb2xhci10aHJvdWdoLWJpdGNvaW4tbWluaW5nL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8yNy9lbmhhbmNpbmctcHJvZml0YWJpbGl0eS1vZi13aW5kLWFuZC1zb2xhci10aHJvdWdoLWJpdGNvaW4tbWluaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Enhancing Profitability of Wind and Solar Through Bitcoin Mining - CoinDesk",
        "content": "This means they can be located directly at or near the site of renewable energy installations, reducing the need for extensive energy transmission networks. They can also adjust their energy consumption based on the availability of renewable energy, consuming more when there is a surplus and less when there is a shortage."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjcvYml0Y29pbnMtc2hydWdzLW9mZi1wb3NpdGl2ZS1lY29ub21pYy1kYXRhLWFzLXNsb3ctbW92aW5nLWp1bHktY29udGludWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin's Shrugs Off Positive Economic Data as Slow-Moving July Continues - CoinDesk",
        "content": "One area of opportunity that investors may be eyeing is the discrepancy in performance between bitcoin and ether. While still tightly correlated, BTC has outperformed ETH by 21% thus far in 2023, possibly driven by expectations that a spot bitcoin ETF could soon be available in the U.S."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzI4L2JpdGNvaW4tYW5kLWV0aGVyLXRyYWRlLXF1aWV0bHktYnV0LWxlc3Nlci1rbm93bi1uYW1lcy1ib2FzdC1zdHJvbmctcGVyZm9ybWFuY2UtdGhpcy13ZWVrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin and Ether Trade Quietly, but Lesser Known Names Boast Strong Performance This Week - CoinDesk",
        "content": "With just three days remaining in July, bitcoin (BTC) and ether (ETH) are poised to finish in negative territory for the month. Over the most recent seven days, bitcoin and ether fell -1.59% and -0.81%, respectively, very much in line with what has been a range-bound trading environment for the entire month."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vaGFja2Vybm9vbi5jb20vd2hhdC1hcmUtYml0Y29pbi1zdGFtcHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "What Are: ‘BITCOIN STAMPS’ - hackernoon.com",
        "content": "1,942 reads\n\nWhat Are: ‘BITCOIN STAMPS’"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzI4L3dpbGwtYml0Y29pbi1iZS1hLXRyaWxsaW9uLWRvbGxhci1jcnlwdG9jdXJyZW5jeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Will Bitcoin Be a $1 Trillion Cryptocurrency by 2030? - The Motley Fool",
        "content": "There are a number of stocks that have reached the $1 trillion market cap club, including Apple, Microsoft, and Amazon. Getting in on these businesses early could have led to life-changing returns.\n\nIn the world of cryptocurrencies, reaching this level is rare.\n\nBut with a current market cap of about $570 billion, Bitcoin (BTC 0.47%) is by far the world's largest cryptocurrency, so it has the highest chance to hit the 13-figure mark among the tens of thousands of digital tokens out there.\n\nCan this happen by 2030? I think it's certainly possible. Here's why.\n\nBitcoin has done it before\n\nIn 2021, the cryptocurrency market was on fire, almost tripling that year. And, unsurprisingly, Bitcoin soared as well. In November that year, the top digital asset reached a market cap of $1.2 trillion, more than double where it stands today.\n\nTo be clear, just because an asset reached a milestone in price before, it doesn't necessarily mean that it can do it again. This happens all the time with stocks, and it's a good thing for investors to remember.\n\nHowever, Bitcoin has gone through multiple wild cycles ever since its launch in 2009. And the longer it remains relevant, the more confidence I have in its ability to stay alive. This is called the Lindy effect.\n\nAnd the longer it stays alive, the greater the likelihood that it continues to rise over time. That's mainly due to more people becoming more educated about, and wanting to own, an asset that has a fixed supply cap of 21 million.\n\nBitcoin is ready to do it again\n\nThere are also some catalysts on the horizon that can push up Bitcoin's price. The most obvious one is next April's halving, which is when Bitcoin's supply growth rate gets cut in half. Bitcoin typically starts rising several months before this event, and this momentum usually carries over several months after the halving.\n\nThe Federal Reserve aggressively started hiking interest rates early last year to slow soaring inflation. And in the past few months, inflation has started to cool. This means that there is a possibility that the central bank not just pauses, but even reverses and begins to cut rates. A looser monetary policy stance can certainly be a boon to risky assets, especially Bitcoin.\n\nLonger-term, there are also some compelling reasons to believe that Bitcoin can skyrocket over the next several years. One of the most important bull arguments is that a larger number of institutions will enter the Bitcoin market. Recently, leading asset managers BlackRock and Fidelity filed applications with the Securities and Exchange Commission (SEC) to launch spot Bitcoin exchange-traded funds. I don't think they'd make these moves if their clientele, which collectively holds trillions of dollars, didn't have an interest in gaining more exposure to Bitcoin.\n\nAnd speaking of the SEC, that agency and others should adopt more definitive rules and regulations in terms of policing the cryptocurrency industry. Some critics can argue that this will hurt the industry. But I think it could prove to be a catalyst for Bitcoin that can help bring it into the mainstream.\n\nLooking at the return potential\n\nIf Bitcoin reaches a $1 trillion market cap by 2030, that implies its price rises at a compound annual rate of 8.4% between now and then. In the last seven years, by comparison, its price has increased at an annualized clip of 72%, making the forward expected return nothing to rave about.\n\nThe S&P 500 has averaged a 9% to 10% historical return. Do I think Bitcoin can outperform the overall market's past performance in the future? Yes, I'd bet on this scenario happening without hesitation.\n\nBy the end of this decade, Bitcoin's valuation could far exceed $1 trillion, making now a great time to consider buying this leading cryptocurrency."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9oZWRnZS1mdW5kLW1hbmFnZXItZXhwbGFpbnMtaG93LWJpdGNvaW4tY291bGQtcmVhY2gtZG9sbGFyMzAway_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Hedge Fund Manager Explains How Bitcoin Could Reach $300K - CoinDesk",
        "content": "Bitcoin and neither are holding steady shrugging off the 25 basis point rate rate hike by the Federal Reserve. Joining us now to discuss the crypto markets is Morgan Creek capital, CEO and Cio Mark. Yes. Welcome to the show Mark. Good morning. Good to be with you. Good morning. Good morning. All right, we are going to talk about this rate hike that everyone was expecting. Uh, the Federal Open Market Committee raise its benchmark fed funds by 25 basis points. The European Central Bank also just announced a rate increase. What's your reaction? Uh I think it was mostly a non event. Uh, you've seen that in, in the market reaction. Uh, it had been priced in the market for weeks. And you know, I think the thing that, that people really are paying more attention to or should be paying more attention to is the fact that despite the rhetoric on higher short term rates, uh they are still expanding the money supply. So M two has turned back up really since the bailout of SBB. And I think that's why you've seen things like, uh Bitcoin and other cryptocurrencies do so well. Uh because remember we don't, we don't price Bitcoin and Bitcoin. We price Bitcoin in dollars or yen or Euros and those currencies are all continuing to weaken. I want to talk about that increase in liquidity in just in just a minute. But the next meeting is eight weeks away in September. What's the likelihood we see another rate hike there? And do you think the market is going to react? Yeah. Look, I think the chairman was very clear. No more hikes this year. Uh, so I think we're, we're done with the fed funds rate. You know, the funny thing about the fed funds rate. I don't know about you but I don't borrow at fed funds. No one. I know borrows at fed funds. Uh, it's really a rate that is used for interbank, uh, uh, transfers and loans and it, a higher fed funds rate allows the banks to, to have higher spreads, higher net interest margins and it's good for bank profits. So I think that part of the market may, uh, cool down a little bit after having, uh, a nice run here lately, if there's not gonna be any, uh, more increases in fed funds. But overall, I don't think the markets, you know, looking at, at interest rates going forward, I think now everybody's focused on, oh, he said there's gonna be no recession. So now we can take the boogeyman off our back and focus on all this growth. Well, what growth I mean, II I don't see a lot of growth. Uh I don't see any inflation um and inflation was a big part of, of that growth and that prices were rising. So people put up higher sales numbers, but then they had higher costs. So the profits weren't going up as much. And look, I think the, the big thing for me is, is the earnings game that gets played. You just had a guest on talking about, you know, the meta beat. Look, if you told me a year ago, you were gonna make a dollar. You told me six months ago you're gonna make 50 cents. You told me last week you were gonna make 10 cents and then you make 11 cents. That's not a beat, right? That, I mean, ok, technically it's, it's a beat and it goes in the books as a beat. But to me that's like, you know, being the, uh, the, the high jump guy and you go up and take the bar off the rack, you put it on the ground, you jump over it and you call yourself the world champ, step over it. There's not even any jumping involved there. No jumping. Well, you, you mentioned the increasing liquidity. I want you to unpack that a little bit more for us. You know, you, you've said that um, the fed and other global central banks are quietly increasing liquidity. Tell us more. Yeah. So it started with China back in October. And you know, once again, China leads the way uh as they are prone to do uh in liquidity. They are the, the kings and queens of, of producing liquidity. You know, you go back to 2000 17 and you know, they said, oh, you know, the fed bailed us out and Bernanke was this hero. No, it was China. They printed four trillion with a T uh dollars. Uh And starting in October, they, they created about a trillion dollars worth of liquidity. Uh The US was still in, in qt uh quantitative tightening. Europe was still uh in tightening. And what's interesting, I haven't heard the word quantitative tightening in months and nobody's talking about contraction in the money supply because it's not contracting, it's actually rising. And when you have a rising money supply, you get a weaker currency and then you get an increase in the price of things that are priced in that currency like gold like Bitcoin. Uh And the like, so I, I think quietly they talk this, this rhetoric of, hey, we're still hawkish and, and uh we're still focused on inflation. Show me the inflation, right? We're at 3% probably heading to sub two. chairman said it's not going sub two, I'll, I'll take the under, you know, the one funny thing about the fed uh and not the chairman, but the, but the fed is an organization. You have hundreds and hundreds of phd s and they forecast inflation and GDP every quarter and they've been right, zero times out of, out of almost 300 estimates. They've never been. Right. I could flip a coin and be right half the time. So I just think it's interesting. So there's either some gamesmanship in that they intentionally try to be wrong to, you know, create an illusion of beat. Right. That, that's, that, that take the bar off and put it on the ground thing uh or some other reason but, but uh I'm not privy to that. Uh I, I want to change gears and talk about Bitcoin here. You recently predicted that the price of Bitcoin could reach a market cap equivalent to gold. That was on the Wolf of All Streets podcast. This would translate to a price of $300,000 for one Bitcoin unpack that for us. That is uh a big prediction. But when, when I heard you unpack it on the podcast made sense to me. Yeah. And, and it's not an overnight prediction, it's not tomorrow. Um It's, it, it goes like this, right? So gold is the only money in the world. And what, what is money? Money is an asset that exists in the absence of a liability. Now, everybody says, well, what about all this other stuff? You know, these, these dollars or yen or Euros? We use them as money. Well, no, we, we use them as currency and they're created by banks, central banks. Uh and they're backed by debt. So it's not that they're bad or evil. It's just, they're not. Money, money is an asset that exists in the absence of a liability. And so for 5000 years, it's a long time, you know, gold has played that role and we had experiments with other things along the way. Puka shells and stone wheels and things like that. But, but gold has survived uh through belief and custom and one ounce of gold for 5000 years has bought a fine person suit. So, from, you know, Cleopatra's time to a suit of armor to a suit suit in the twenties to Saville Row today, you or I could go to Saville and for a single ounce of gold, about 1900 bucks, we could get a fine suit, you know, and that's about what it would take. So what's changed? Well, gold suffers from two things. It's not very portable, meaning it's really heavy and clunky and it's not very divisible. Like if I had a bar of gold here and go pull it out of the safe and I want to give you half right. You know, because it's been a nice interview. I want to give you half even if I could break it in half, which I, I couldn't do. Um, and have a hard time stuffing it in the computer and sending it to you. So it's not very divisible. I can't break it in half and it's not very portable. I can't send it to you. Well, Bitcoin fixes both of those, it is equally scarce. Its stock to flow ratio is the same as gold. The amount that's lost or stolen every year roughly equals the amount that's created. And so it's a scarce asset. Well, why do scarce assets matter? Well, they a scarce asset which also exists in the absence of a liability. It wasn't created by a government with debt has an interesting feature of being a perfect store of value. So as people realize that in the digital age and Bitcoin being more divisible and more portable, I can punch a few buttons on my smartphone and send you Bitcoin immediately. You don't have to have a bank account. I don't need to have a bank account. We can make that transfer of wealth instantaneously. So the monetary value of gold to sum up is about $6 trillion. Give or take the total value goes about 11. But you know five I of that is jewelry and chalices and that doesn't really count. But the monetary that's in central banks around the world, about six trillion. I think Bitcoin can replace all of that. The monetary equivalent six trillion is about a 10 X from here. So it gives us a price of about 300 K. All right. Well, when you talk us on that journey, like I said, it, the pieces start to come together really quickly before we wrap here. How long before you think we can we reach that 300 K or how long before we reach this feature that you've just explained? So, look, I, I've said for years, so that was like a 10 year process and we probably 34 years into that. So I can still, I, I would say the next having not this having in 2024 but the 2028. And where do I get that? Well, every having we've added a zero, we've about 10 times the market cap of Bitcoin. So we went from 100 to 1000 1000 to 10,000. I think this having next April, we go to 100,000 as fair value. But in these movements during crypto fall, right? We're in crypto summer today until next June. Then after the having we go to Crypto Fall, that's the parabolic, you know, everybody's crazed and FOMO rules, we usually go above fair value. So I think we could get into the high hundreds, maybe even a couple 100 but let's call it the high hundreds 150 180. Uh And then we go into the next crypto winner. So we have our correction. Then for the next having in 2028 the fair value jumps to a million dollars and people say a million dollars that could never happen. Well, hopefully, by that time, we're not talking about Bitcoin. We're talking about Satoshi because the Satoshi is the unit of measure that we should all I think be talking about, which is there are 100 million Satoshi per Bitcoin. And then we don't have to think about Bitcoin is a million dollars. No, a single Satoshi is worth fractions of, of pennies at some point. All right, Mark, we gotta leave it there. Thanks so much for joining the show this morning. Thanks for having me talk to you again soon. That was Morgan Creek, Capital, CEO and Cio Mark. You."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjcvY3J5cHRvLW1hcmtldHMtdG9kYXktYnRjLXRrLWV0aC1tYXRpYy1kb2dlLXByaWNlLWFuYWx5c2lzL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjcvY3J5cHRvLW1hcmtldHMtdG9kYXktYnRjLXRrLWV0aC1tYXRpYy1kb2dlLXByaWNlLWFuYWx5c2lzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Erases Losses, Holds Near $29.3K as Nasdaq Gains Nearly 2% - CoinDesk",
        "content": "Gene Hoffman, CEO and president of blockchain and smart-contract platform Chia Network, expects bitcoin to continue trading sideways with a possible slight turn upward in August, a historically slow month in financial markets. \"There's no real positive or negative push right now across the market,\" Hoffman told CoinDesk. \"There's no real force to break things one side or the other.\""
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiqwFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDcvMjcvdWtyYWluZS1oYXMtcmFpc2VkLTIyNW0taW4tY3J5cHRvLXRvLWZpZ2h0LXJ1c3NpYW4taW52YXNpb24tYnV0LWRvbmF0aW9ucy1oYXZlLXN0YWduYXRlZC1vdmVyLXRoZS1sYXN0LXllYXItY3J5c3RhbC_SAa8BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA3LzI3L3VrcmFpbmUtaGFzLXJhaXNlZC0yMjVtLWluLWNyeXB0by10by1maWdodC1ydXNzaWFuLWludmFzaW9uLWJ1dC1kb25hdGlvbnMtaGF2ZS1zdGFnbmF0ZWQtb3Zlci10aGUtbGFzdC15ZWFyLWNyeXN0YWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Ukraine Has Raised $225M in Crypto to Fight Russian Invasion, but Donations Have Stagnated Over the Last Year: Crystal - CoinDesk",
        "content": "Ukraine Has Raised $225M in Crypto to Fight Russian Invasion, but Donations Have Stagnated Over the Last Year: Crystal\n\nUkraine attracted over $225 million from supporters around the world, while Russian military fundraisers only scored several millions.\n\nBy Anna Baydakova Jul 27, 2023 at 1:58 p.m. UTC"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wcmVzaWRlbnRpYWwtY2FuZGlkYXRlLXJmay1qci1wdXJjaGFzZWQtYml0Y29pbi1mb3ItaGlzLWNoaWxkcmVu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Robert Kennedy Jr. reveals buying 2 Bitcoin for each of his 7 children - Cointelegraph",
        "content": "Democratic presidential candidate Robert F. Kennedy Jr. has confirmed he purchased a significant amount of Bitcoin (BTC) earlier this year — buying two BTC for each of his seven children.\n\nSpeaking in a July 26 Twitter Space, Kennedy said the decision came after he received “a lot of criticism” from crypto industry pundits and the mainstream press in the wake of his pro-Bitcoin comments made at the Bitcoin Miami Conference in May.\n\nKennedy said he was critiqued for promoting a “volatile commodity” while not having any skin of his own in the game.\n\n“Right after that Bitcoin conference I got a big check and I said, okay, you know, I'm going to put my money where my mouth is and so I bought two Bitcoin for every one of my seven children.”\n\nKennedy has six biological children, four sons and two daughters ranging in age from 22 to 38.\n\nPresumably, the seventh child comes from Kennedy’s most recent marriage to actress Cheryl Hines, who had one daughter before the pair married in 2014.\n\nBREAKING: Democrat Presidential candidate Robert Kennedy Jr. announces that he is a #Bitcoin holder. — Dennis Porter (@Dennis_Porter_) July 26, 2023\n\nAt the time of his speech at the conference — where he also announced that he would begin accepting campaign donations in Bitcoin — the candidate denied having any personal investment in the cryptocurrency.\n\n“I am not an investor, and I am not here to give investment advice,” he said.\n\nThis marks the first time that Kennedy has admitted to owning the cryptocurrency, and lines up with a leaked financial disclosure that revealed the candidate had“between $100,001 and $250,000” worth of Bitcoin at the end of June.\n\nHowever, if RFK Jr. had purchased a total of 14 Bitcoin for an approximate price of $26,800 in the days following the end of the conference, his total holdings at the end of June would’ve surpassed $380,000.\n\nRelated: RFK Jr. elaborates position on CBDC, crypto: ‘It isn’t just criminals who want privacy’\n\nAt the time of publication, the price of Bitcoin stands at $29,327, according to Cointelegraph price data, meaning that Kennedy’s investment is now worth a total of $410,000.\n\nIn the interview, Kennedy reaffirmed his plan to back the U.S. dollar with Bitcoin as well as making the asset exempt from capital gains taxes if elected President.\n\nThis kind of thing partly explains the appeal of Bitcoin. Our freedom to transact and save should not be at the mercy of political enforcers. No payment platform should be allowed to discriminate against people for exercising their right to free speech. — Robert F. Kennedy Jr (@RobertKennedyJr) July 26, 2023\n\nSaying that he sees Bitcoin as a vehicle for returning innovation to America, he added that any capital gains exemptions on Bitcoin conversions should only apply to smaller investors and businesses, as not to create huge windfalls for large companies like BlackRock and Goldman Sachs.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nOpinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8yNy93YW50LXRvLW1pbmUtYml0Y29pbi1hdC1ob21lLWRpeS1iaXRjb2luZXJzLWhhdmUtc3Rvcmllcy10by1zaGFyZS_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDcvMjcvd2FudC10by1taW5lLWJpdGNvaW4tYXQtaG9tZS1kaXktYml0Y29pbmVycy1oYXZlLXN0b3JpZXMtdG8tc2hhcmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Want to Mine Bitcoin at Home? DIY Bitcoiners Have Stories to Share - CoinDesk",
        "content": "This spring, Foxley started anew, with just one ASIC, and now he’s been mining bitcoin for three months. He chose the Whatsminer device because it’s more tolerant of higher temperatures than Bitmain’s Antminer ASICs, famously popular with the large-scale miners, he said. Plus, unlike some other miners, Whatsminer does not require a three-phase electric system to plug it into, so you don’t need to make additional modifications, Foxley explained."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXZvbGF0aWxpdHktMTBrLWJ0Yy1leGNoYW5nZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin price risks 'major volatility' as 10K BTC hits exchanges - Cointelegraph",
        "content": "Bitcoin (BTC) returned to exchanges en masse on July 27 in a sign that “major volatility” could come next.\n\nAccording to data from on-chain analytics firm Glassnode, intraday BTC exchange inflows have hit multi-month highs.\n\nTrader warns of BTC price volatility “spike”\n\nBTC price action continues to linger below $30,000, and traders have consistently warned that further downside could come next.\n\nAt current levels, Bitcoin’s largest-volume investor cohort, the whales, appear to be in a state of flux in an unclear market.\n\nNow, with large tranches of coins on the move in recent days, attention is focusing on entities sending funds to exchanges — with the implication that selling pressure could increase as a result.\n\nAs noted by market observers, including James Straten, research and data analyst at crypto insights firm CryptoSlate, over 10,000 BTC in inflows on a single day represented the biggest one-day increase for several months.\n\n“Yesterday, the most amount of Bitcoin went back onto exchanges since the SVB collapse in March,” he commented on July 28.\n\nStraten referenced the fall of Silicon Valley Bank (SVB), which at the time sparked mass market uncertainty.\n\n“Watch out for a spike in volatility!” popular trader Ali continued on the topic, alongside data from research firm Santiment.\n\n“A large number of idle BTC has been exchanging hands over the past 24 hours, which coincides with a 10,000 BTC increase in supply on crypto exchanges.”\n\nBitcoin exchange supply data. Source: Ali/Twitter\n\nGlassnode shows that the changes took the combined BTC balance on the exchanges it monitors back above the 2.25-million mark.\n\nOverall, however, balances remain at multi-year lows, having last circled 2.25 million in March 2018.\n\nBitcoin Balance on Exchanges chart. Source: Glassnode\n\nBitcoin hodler cost basis in focus\n\nContinuing, Straten noted the ongoing influence of the cost basis of various hodler cohorts over BTC price.\n\nRelated: Bitcoin bull run next? Bitfinex stablecoin ratio ‘blows up’ in 2023\n\nThe cost basis of both short-term and long-term holders, already on the radar at Glassnode and elsewhere, remain important support levels.\n\n“Bitcoin long-term holders have reduced their cost basis to $20,490. This is the lowest cost basis since April 2022. Realized price is now only $70 below,” he wrote alongside a summary chart.\n\n“Price in both the 2015 and 2019 bear markets used short-term holder realized price as support, 2023 is exactly the same, testing it three times so far $28,241.”\n\nBitcoin long-term and short-term holder cost basis data. Source: James Straten/Twitter\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjcvYml0Y29pbi1ldGhlci1jbWUtZnV0dXJlcy1zYXctcmVjb3JkLXBhcnRpY2lwYXRpb24tZnJvbS1sYXJnZS10cmFkZXJzLWluLXEyL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjcvYml0Y29pbi1ldGhlci1jbWUtZnV0dXJlcy1zYXctcmVjb3JkLXBhcnRpY2lwYXRpb24tZnJvbS1sYXJnZS10cmFkZXJzLWluLXEyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether CME Futures Saw Record Participation From Large Traders in Q2 - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yZWRkaXRvci1nZXRzLWxlc3Nvbi1hZnRlci1iaXRjb2luLXBhcGVyLXdhbGxldC1oYWNrZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Redditor's hacked Bitcoin is a lesson on the hidden dangers of paper wallets - Cointelegraph",
        "content": "A Reddit user has become the latest example of why crypto users should be more careful when using wallet generators after the user lost a few thousand dollars worth of Bitcoin (BTC) from their “secure” paper wallet.\n\nOn July 24, a Reddit user, r/jdmcnair, posted on the r/Bitcoin subreddit, asking for an explanation on how a hacker could have been able to steal over $3,000 worth of Bitcoin from their supposedly secure paper wallet — which was even generated on an offline computer.\n\nThe Redditor's Bitcoin wallet address shows an outgoing transaction of 0.12 BTC. Source: Blockchain.com\n\n“I was doing self-custody, generated my key and printed it on paper on an offline computer, transferred my BTC to this offline wallet, and kept it stored in a safe that only I have the key for,” the user wrote.\n\n“I thought I was keeping it in one of the more secure ways possible.”\n\nIn an update to his initial post, the Redditor revealed that they used the wallet creation tool walletgenerator.net to create their wallet’s private keys, which some users highlighted have been infamous for vulnerabilities in the past.\n\nSpeaking to Cointelegraph, blockchain security firm CertiK’s director of security operations Hugh Brooks said users should think twice before using a crypto wallet generator.\n\nSuch online wallet generators have served as a viable hacking tool for a while now, Brooks said:\n\n“Some of these wallet generators could be straight-up scams. The website that the post claims returns an IP address in Russia. When looking at a tool such as Criminal IP, we can see that the address has several abuse reports filed against it.”\n\nPaper wallet generators have been known to contain serious vulnerabilities since 2019, Brooks said, adding that if anyone has generated wallets using walletgenerator.net, it’s likely “the same keys have been given to different users.”\n\nThe Profanity wallet generator exploit was a textbook example of this security vulnerability which led to the $160 million hack on algorithmic market maker Wintermute in September 2022.\n\nThe solution is simple, according to Brooks. Users wanting safe crypto storage should use a “trusted hardware wallet provider such as Ledger and Trezor.”\n\nRelated: Almost $1M in crypto stolen from vanity address exploit\n\nThe Redditor was baffled as to why the exploiter waited over 12 months to exploit the funds, prompting another to offer a possible explanation.\n\n“[The hackers] wait for enough noobs to think they generated secure private keys, wait for them to deposit significant amounts, and then, one day, swipe all the funds, so there is no time to react to reports of the site being compromised.”\n\nWith a sudden increase in long-dormant Bitcoin wallets waking up — many with funds in the millions — some pundits think it’s due to wallet generators being hacked.\n\nUnpopular crypto opinion: the fact that wallet generators can be cracked and people can lose their funds with no recourse is terrifying. I’m going to tell you what I believe to be the answer, and I know the “make everything decentralized” crew will hate it — Jesse Hynes (@jesse_hynes) April 25, 2023\n\nHackers managed to snatch over $300 million in Q2 2023, according to CertiK, a 58% decline from the same period last year.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWVyYXNlcy1mb21jLWdhaW5zLXVzLWRvbGxhci1nZHDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin price erases FOMC gains as US dollar surges on Q2 GDP print - Cointelegraph",
        "content": "Bitcoin (BTC) ate away at the prior day’s gains on July 27 as United States macroeconomic data produced a muted reaction.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nAnalyst warns of BTC price dip\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price strength waning after a brief push to $29,680 into the daily close.\n\nThe largest cryptocurrency had offered a modest uptick after the Federal Reserve hiked interest rates to their highest since 2001 — a move already priced in by markets.\n\nThe day’s U.S. gross domestic product (GDP) advanced print for Q2 came in better than forecast at 2.4% annualized, pointing to inflationary pressures continuing to ebb in what could prove a catalyst for risk asset performance.\n\nBitcoin did not noticeably react, however, with stocks likewise fairly flat after the Wall Street open.\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, thus hoped that the July 28 Personal Consumption Expenditures (PCE) Index release would provide a more tangible growth incentive.\n\n“GDP comes out way more positive than expected. That’s great. Soft landing case starts to pick up pace. If GDP was worse than expected, you’d see markets drop,” he argued in a Twitter update.\n\n“Bitcoin steady, stocks steady. Now PCE better than expected and we go up.”\n\nA subsequent post nonetheless cautioned that BTC/USD could see a dip beforehand, while $29,700 now formed a line in the sand.\n\nOpen Interest to new highs, price grinding upwards, seems likely to sweep down before up for #Bitcoin.\n\n\n\nIf not? Break $29,700 in one-go and we'll have a party. pic.twitter.com/CxznrbMCVh — Michaël van de Poppe (@CryptoMichNL) July 27, 2023\n\nOn-chain monitoring resource Material Indicators, meanwhile, suggested ahead of time that the GDP would be a “nothingburger” for crypto.\n\nAn accompanying chart of the BTC/USD order book on the largest global exchange, Binance, showed support still thin above $28,500, potentially easing a market drop should one begin.\n\n“The strong economy/soft landing narrative is gaining some traction, but the FED would still like to see softening of the labor market to support the thesis relative to what the ‘historical record’ shows about the correlation between the labor market and inflation,” Material Indicators added in part of additional analysis.\n\nBTC/USD order book data for Binance. Source: Material Indicators/Twitter\n\nU.S. dollar strength hits two-week highs\n\nThe GDP likewise had little impact on market expectations for where Fed policy would go at the next interest rate decision point in September.\n\nRelated: Bitcoin bull run next? Bitfinex stablecoin ratio ‘blows up’ in 2023\n\nOn the day, odds of rates pausing at their current 5.25-5.5% stood at 76%, with a 24% likelihood of another 0.25% hike, according to CME Group’s FedWatch Tool.\n\nFed target rate probabilities chart. Source: CME Group\n\nCommenting on the outlook for crypto vis-a-vis U.S. macro movements, financial commentator Tedtalksmacro called the rate hike event “very vanilla.”\n\n“The markets reacting as if we are just one more hike closer to a pause, BTC and US equities higher,” he concluded the day prior.\n\nOne conspicuous reaction traditionally a headwind for crypto was U.S. dollar strength, which spiked on July 27.\n\nThe U.S. Dollar Index (DXY) hit 101.84, its highest since July 11 and furthering a bounce from its lowest levels in over a year.\n\nU.S. dollar index (DXY) 1-day chart. Source: TradingView\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDcvMjgvYW1pZC1zYW5jdGlvbnMtYml0Y29pbi1taW5pbmctbWFjaGluZXMtYXJlLWZsb3dpbmctaW50by1ydXNzaWEtYXMtaW5kdXN0cnktdGhyaXZlcy_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA3LzI4L2FtaWQtc2FuY3Rpb25zLWJpdGNvaW4tbWluaW5nLW1hY2hpbmVzLWFyZS1mbG93aW5nLWludG8tcnVzc2lhLWFzLWluZHVzdHJ5LXRocml2ZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Amid Sanctions, Bitcoin Mining Machines Are ‘Flowing’ Into Russia, as Industry Thrives - CoinDesk",
        "content": "Cheap energy costs, one of the largest contributors to mining profitability, have also incentivized miners in Russia to ramp up their operations. Currently miners are able to install their machines at other firms’ facilities at a cost of $0.05-$0.055 per kilowatt hour (kWh) of energy all-in, thanks to the abundance of cheap energy, so the region will likely continue developing. Prices in the U.S. are around $0.08 per kWh."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4taGFsdmluZy1jb3VsZC1wdW1wLWludmVzdG9ycy1iYWdzLWJ1dC1hLWdsb29teS1mdXR1cmUtYXdhaXRzLWJ0Yy1taW5lcnMtMjAyMzA3MjcyMzQ00gGPAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4taGFsdmluZy1jb3VsZC1wdW1wLWludmVzdG9ycy1iYWdzLWJ1dC1hLWdsb29teS1mdXR1cmUtYXdhaXRzLWJ0Yy1taW5lcnMtMjAyMzA3MjcyMzQ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin halving could pump investors' bags, but a gloomy future awaits BTC miners - FXStreet",
        "content": "Share:\n\nBitcoin halving cycle is due in 2024, only a few months out to April or May 2024.\n\nWhile traders anticipate the cycle, miners are disconcerted.\n\nThe event, which may kickstart the next bullish phase for BTC, could have devastating implications for miners.\n\nBitcoin (BTC) halving is a narrative that cryptocurrency traders and investors highly anticipated because of its characteristic ability to kickstart a new phase of bullish momentum for the flagship crypto, surpassing the peak prices recorded in the previous cycle to record a new all-time high.\n\nAlso Read: XRP retail holders made biggest winners from Torres' decision, technology policy expert says\n\nBitcoin halving countdown continues\n\nBitcoin (BTC) halving countdown continues, around eight months out, but traders and investors alike remain on the edge of their seats waiting to see what the new cycle will achieve. In every cycle that has passed, the event brings a fresh start to the yearlong bullish market, with Bitcoin price recording a new all-time high, preceding another yearlong bear market.\n\nThe bear market is followed by a two-year recovery period as the price attempts to reclaim the all-time high. This is where the BTC market currently stands, and investors cannot wait.\n\nBitcoin Halving Cycle\n\nWhat is Bitcoin Halving?\n\nBitcoin halving is an event where the rewards for mining BTC tokens are cut in half. With every cycle, the impact of individual halving events continues to diminish as the block reward procedurally edges toward zero. The objective of a halving activity is to slow down the rate of generating new coins, thereby lowering the available amount of tokens in supply.\n\nThe previous Bitcoin halving event occurred on May 11, 2020, with the next one slated between April and May 2023. The final one is estimated for 2140, 117 years ahead. This estimate is based on the calculation that by this time, the number of BTC tokens in circulation will have attained the maximum supply of 21 million. The current circulating supply is 19,440,787 BTC, based on CoinMarketCap data.\n\nWhile traders anticipate the 2024 Bitcoin halving and its expected impact to pump BTC price, miners do not share in the same sentiment. On the contrary, BTC miners and mining companies' are feeling unsettled.\n\nThe miners, serving as validators to secure the network and process transactions, receive incentives to keep the operation running. These incentives are called block rewards. Specifically, by mining a single BTC token, the miner adds one block to the blockchain. The incentive for this single block is 6.25 Bitcoin tokens. Based on current rates ($29,210), this is approximately $182,562.\n\nPost-halving, miners will receive 3.125 Bitcoin tokens (half of 6.25) for every successful block added to the blockchain. This translates to about $91,281. The drop in mining rewards is part of the reasons why miners are fretting over the oncoming event, as it means their revenue source will suffer a 50% slash.\n\nWhy BTC miners are disconcerted over Bitcoin halving\n\nIt makes sense for a trader or investor to assume that a 50% slash in mining rewards is a reasonable sacrifice considering the event in itself serves to increase the value of Bitcoin. This means that even the 3.125 block reward could account for more than the rewards when incentives added up to 6.25 BTC tokens.\n\nHowever, from a miner or mining company's standpoint, it is a stark value loss, considering the operating expenses required to mine Bitcoin. The infrastructure required to mine Bitcoin has increased in price over time, with mining equipment costing more now, electricity rates going higher, and the fact that there are deliberations for a 30% mining tax to be imposed on miners in the US specifically.\n\nNotably, Bitcoin's hash power, the power that a computer or hardware uses to run and solve different hashing algorithms, is mostly concentrated in the US.\n\nAlso Read: Bitcoin price heedless as institutions that know markets better than anybody wager on BTC mining"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMipwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yOTQwMC1wb3N0LWZvbWMtb3V0Y29tZS1zb2xhbmEtY2FyZGFuby1qdW1wLXVwLXRvLTcvYXJ0aWNsZXNob3cvMTAyMTY1MzM3LmNtc9IBqwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yOTQwMC1wb3N0LWZvbWMtb3V0Y29tZS1zb2xhbmEtY2FyZGFuby1qdW1wLXVwLXRvLTcvYW1wX2FydGljbGVzaG93LzEwMjE2NTMzNy5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $29,400 post FOMC outcome; Solana, Cardano jump up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were majorly trading higher on Thursday after the US Federal Reserve stuck to script with a 25 basis-point rate hike.The Fed as anticipated lifted its benchmark lending rate to a range between 5.25% and 5.5%, with Chair Jerome Powell saying during a press conference that the central bank would let data determine whether to hike again.Bitcoin (BTC) surged 0.67% to $29,429, whereas Ethereum (ETH) was above the 1,850 level. BTC volume in the last 24 hours stood at approximately $12.96 billion, rising 20.32% in the last 24 hours.\"After the US Federal Reserve raised its interest rates by 25 basis points, as expected by the market, there was a mild uptick in most cryptocurrencies. Bitcoin, which had previously dipped to a low of US$29,097 on Tuesday, has now shown signs of recovery, surpassing the US$29,400 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.\"However, to fend off aggressive bearish sentiments, the bulls must assert their dominance and sustain the price above the US$31,000 threshold,\" Edul added.Other top crypto tokens, XRP BNB , Cardano and Solana were also trading higher on Thursday. Meanwhile, the global cryptocurrency market cap was trading higher, around $1.19 trillion, rising 0.87% in the last 24 hours.The total volume in DeFi is currently 2.72 billion, 8.94% of the total crypto market 24-hour volume. The volume of all stablecoins is now $27.94 billion, which is 91.8% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $571 billion. Bitcoin's dominance is currently 48.21%, a decrease of 0.1% over the day, according to CoinMarketCap.\"Cryptocurrency prices are volatile, but generally higher after Fed announcements. Bitcoin is trading around $29,300, up 1% on the day, with a positive medium-term outlook,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX, said, \"The Ichimoku Base Line of BTC, valued at 30330, shows a Neutral sentiment for quite a long time, whereas the Hull Moving Average indicates a Buy signal at 29164. The Volume Weighted Moving Average at 30125 showed a Sell signal.\"The MACD Level (12, 26) at -69 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 13 with a Neutral indicator, while the Williams Percent Range (14) at -79 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.45 hours, IST on July 27, 2023)(Note: Price change in last 24 hours)"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ncmF5c2NhbGUtc2VjLWFwcHJvdmUtYWxsLWJpdGNvaW4tZXRmcy10b2dldGhlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Grayscale urges SEC to approve all Bitcoin ETFs simultaneously - Cointelegraph",
        "content": "Crypto fund manager Grayscale is urging the Securities and Exchange Commission to approve all proposed spot Bitcoin (BTC) exchange-traded funds (ETFs) at the same time to avoid one having an advantage.\n\nA July 27 post by Grayscale Chief Legal Officer Craig Salm said Grayscale’s legal team submitted a letter regarding eight spot Bitcoin ETF filings — including its own — arguing the SEC shouldn’t pick “winners and losers” and instead make a fair and orderly decision.\n\nThe letter claimed the SEC could approve the spot ETFs based on its approvals for Bitcoin futures ETFs, saying the two fund types are “inextricably linked.”\n\nGrayscale added recent surveillance sharing agreements (SSAs) between Coinbase and the spot ETF providers are “not a new idea” and claimed they would not meet the SEC’s standards.\n\nThe SEC should approve spot #bitcoin ETFs to trade in the US.\n\nWhat’s more, their previous approval of bitcoin futures ETFs shows that they are already in a position to do so.\n\nRead more about the latest from our legal team: https://t.co/UC8ksqNcwy $GBTC $BTC — Grayscale (@Grayscale) July 27, 2023\n\nETF filings from Invesco, BlackRock, Valkyrie, VanEck, Wisdom, Fidelity and ARK Invest were recently updated to include SSAs with Coinbase.\n\nCoinbase would share information on its trading books and other information so the SEC can monitor any possible market manipulation or irregular trading activity.\n\nIn late June, the SEC pushed back on the ETFs due to there being no SSAs, saying they were needed due to what it claimed was the potential for crypto markets to be manipulated.\n\nGrayscale claimed, however, that the SSA’s “would neither satisfy nor be necessary” under the SEC’s standards, as Coinbase isn’t registered with the SEC as a securities exchange or broker-dealer nor with the Commodity Futures Trading Commission as a futures exchange.\n\nIt added approving the ETFs would be “a positive but sudden and significant change” in the SEC's application of its standard and would “improperly grant an unfairly discriminatory and prejudicial first-mover advantage to these proposals.”\n\nThe Grayscale Bitcoin Trust (GBTC), which aims to track Bitcoin’s price, has nearly 1 million investors, Salm claimed.\n\nRelated: Grayscale CEO: BlackRock ETF filing a ‘moment of validation’ for Bitcoin\n\nHe said if it’s converted to an ETF, it would return billions in value to investors, adding there’s “simply no reason” the SEC should keep GBTC investors from a spot Bitcoin ETF.\n\nThe SEC denied Grayscale’s application to convert the GBTC to a spot Bitcoin ETF last June.\n\nIn response, Grayscale sued the regulator, saying it was acting arbitrarily by failing to apply consistent treatment to similar investment vehicles.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vbmV3cy55YWhvby5jb20vY29uZ3Jlc3NtYW4tdGFsa3Mtc21hY2stYml0Y29pbi1jcmVhdG9yLTE2MjU1OTIxNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Congressman Talks Smack About Bitcoin Creator 'Saratoshi Nagamoto' - Yahoo News",
        "content": "In a Financial Services Committee hearing this week, Rep. Brad Sherman (D–Calif.) had some choice words for bitcoin bros:\n\n\"We are told that cryptocurrency is very innovative,\" said Sherman. \"Look at the incredible financial innovation of Enron and WorldCom,\" he continued, implying that bitcoiners are fraudsters. \"I don't believe that Saratoshi Nagamoto was innovative,\" he added.\n\nHe is, of course, butchering the name of Satoshi Nakamoto, the pseudonymous person (or group of people) who 15 years ago released the nine-page bitcoin white paper sketching out a \"peer-to-peer electronic cash system\" which would bypass financial institutions and be fully censorship-resistant.\n\nThough bitcoin today is not yet used as a medium of exchange to the degree that many had thought, due to the long processing times of transactions, the Lightning Network is beginning to solve this scalability problem. And the promise of bitcoin delivering financial freedom to all who want it—\"an escape hatch from tyranny,\" in the words of the Human Rights Foundation's Alex Gladstein—is being borne out as it becomes more widely adopted, fulfilling Satoshi's vision.\n\nSherman has previously compared crypto to cocaine and organ harvesting. \"There's this fear of missing out that we gotta keep up with other countries,\" he told Bloomberg back in May. \"Peru is way ahead of us in cocaine production. China is way ahead of us in organ harvesting. We don't need to keep up on those things, and we don't need to keep up on crypto.\"\n\nBrad, did the EU pass comprehensive cocaine legislation? Is Hong Kong encouraging the domiciling of cocaine firms? Are Bermuda and UAE regulators trying to get cocaine firms onshore? Do you think perhaps your metaphor isn't apt? — nic ???? carter (Orb #2) (@nic__carter) May 10, 2023\n\nSherman, like Sen. Elizabeth Warren (D–Mass.), who compared buying bitcoin to buying air, seems to fundamentally misunderstand the features of the technology he seeks to regulate (an all-too-common tale for our ancient legislators). In 2021, Sherman said cryptocurrency, which he believes should be considered a security, is considered by advocates to be \"an attack on the powers of society\" when in fact \"the advocates of crypto represent the powers in our society,\" saying that J.P. Morgan, BlackRock, and Goldman Sachs have made so much money off of crypto that it undermines the fundamental proposition. (Tell that to Senegalese app developer Fodé Diop, who correctly calls bitcoin \"a weapon for us to fight oppression.\")\n\nSherman has also said that bitcoiners' political contributions to lawmakers would result in regulators going easy on it, which has not turned out to be true.\n\nHere's a hint: If you're getting Satoshi's name wrong, chances are you might not know very much about bitcoin. What else might you be getting wrong?\n\nFor more on U.S. legislators' war on bitcoin, check out this documentary Reason produced last month:\n\nThe post Congressman Talks Smack About Bitcoin Creator 'Saratoshi Nagamoto' appeared first on Reason.com."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtcGNlLWRhdGEtYml0Y29pbi10cmFkZXJzLTI4a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "BTC price shrugs off strong PCE data as Bitcoin traders eye $28K range - Cointelegraph",
        "content": "Bitcoin (BTC) stayed rangebound at the July 28 Wall Street open despite further United States inflation data beating expectations.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nFed’s “preferred” inflation metric points to waning pressure\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action getting only a modest boost from the Personal Consumption Expenditures (PCE) Index print.\n\nThis came in below estimates, hinting that U.S. inflation was continuing to subside and copying other data prints from the week.\n\nBREAKING: US PCE Price Index comes in below expectations\n\n\n\nExpected = 3.1%\n\nActual = 3.0%\n\n\n\nInflation continues to wane as per this metric pic.twitter.com/61mrcBDON6 — Game of Trades (@GameofTrades_) July 28, 2023\n\nAddressing its implications, financial commentary resource The Kobeissi Letter noted that PCE represented the Federal Reserve’s “preferred” inflation metric, as previously revealed by Chair Jerome Powell.\n\n“PCE inflation is now at its lowest since April 2021. The Fed may finally have inflation under control,” it suggested in part of its analysis on social media.\n\nAt this week's Fed's meeting, they said inflation data over the next 2 months is important.\n\n\n\nPCE inflation is another sign of progress on the fight against inflation.\n\n\n\nIs the Fed's rate hike cycle finally over?\n\n\n\nFollow us @KobeissiLetter for real time analysis as this develops/ — The Kobeissi Letter (@KobeissiLetter) July 28, 2023\n\nHowever, much like the July 26 Fed interest rate hike and the July 27 U.S. Q2 gross domestic product (GDP) estimate, Bitcoin refused to turn on volatility, sticking between $29,000 and $29,500.\n\nBitcoin stays below bulls’ resistance target\n\nAmong traders, there was still an appetite for BTC price downside, with the $30,000 resistance now in place for over a week.\n\nRelated: Bitcoin price risks ‘major volatility’ as 10K BTC hits exchanges\n\nPopular trader Crypto Tony confirmed that he remained short BTC below $29,600.\n\n“I expect continuation down to $28,000 in time, but for sure we could range here for a little while before the drop,” he told Twitter (now known as X) followers on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/X\n\nFellow trader Daan Crypto Trades likewise placed emphasis on the loss of the local range focused on the $30,000 mark.\n\n“With Bitcoin Rejecting from the previous range, I think it makes sense to prepare for low $28Ks,” he argued.\n\n“Invalidation upon retaking $29.5K but there seems to be a lot of supply at that level and little spot bid to bring it up. Likely a choppy road on the way there.”\n\nBTC/USD annotated chart. Source: Daan Crypto Trades/Twitter\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, meanwhile spied what he called “deviation” on the daily BTC/USD chart — something previously occurring in February that was followed by an upward rebound.\n\nVan de Poppe additionally asked whether the weekend, with its thinner liquidity and more options for volatile movement, could produce a “classic” comeback.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnRpcHJhbmtzLmNvbS9uZXdzL21pY3Jvc3RyYXRlZ3ktbmFzZGFxbXN0ci1zdG9jay10aGlzLWJpdGNvaW4tcGxheS13aW5zLWEtbmV3LWJ1bGzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "MicroStrategy Stock (NASDAQ:MSTR): This Bitcoin Play Wins a New Bull - TipRanks.com - TipRanks",
        "content": "Business intelligence company MicroStrategy (NASDAQ:MSTR) has gained another bull this month. On Wednesday, TD Cowen analyst Lance Vitanza started coverage of MicroStrategy with a Buy rating and a price target of $520, citing the company’s exposure to Bitcoin (BTC-USD), the largest cryptocurrency by market capitalization and the optimism about its BI platform. Microstrategy shares were up 1.5% on Wednesday and have skyrocketed more than 213% year-to-date.\n\nEarlier this month, BTIG analyst Andrew Harte initiated coverage of MicroStrategy with a Buy rating and a price target of $490, as he believes that it is the best vehicle for investors to gain exposure to Bitcoin due to several reasons, including ease of access, downside protection, and access to capital markets.\n\nTD Cowen is Bullish on MicroStrategy\n\nMicroStrategy’s founder Michael Saylor is considered one of the biggest Bitcoin bulls in the world. The company’s strategy is to buy and hold Bitcoin for the long term. Its core business is not impacted by near-term price fluctuations in Bitcoin. The company intends to use its excess cash and net proceeds from capital markets transactions to accumulate Bitcoin.\n\nMicroStrategy, the largest corporate holder of Bitcoin, and its subsidiaries held about 152,333 bitcoins as of June 27, 2023, acquired at an aggregate purchase price of nearly $4.52 billion.\n\nVitanza thinks that the company represents a “new kind of firm,” which generates its revenue from enterprise software and cloud services but converts its excess cash flow into Bitcoin. This makes the company the best option for institutions to gain exposure to BTC.\n\nThe analyst also pointed out that while investors may directly purchase Bitcoin or gain exposure through the Bitcoin ETF, network and management fees can reduce the value of their returns.\n\nAdditionally, Vitanza believes in the prospects of the company’s flagship BI platform, given the solid enterprise spending in the cloud and continued transition to the cloud. The analyst thinks that the BI platform is apt for both on-premises and cloud. He projects recurring revenue as a proportion of total revenue, currently at 67%, to continue to grow.\n\nIs MSTR a Good Stock to Buy?\n\nMicrsoStrategy has a Strong Buy consensus rating based on three unanimous Buys. The average price target of $506.67 implies 14.3% upside even after the phenomenal year-to-date rally.\n\nDisclosure"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzI4L2JpdGNvaW4tc3RlYWR5LWFib3ZlLTI5ay1ib25kLXlpZWxkcy1yaXNlLWFzLWJvai1tYWtlcy15aWVsZC1jdXJ2ZS1jb250cm9sLW1vcmUtZmxleGlibGUv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMjgvYml0Y29pbi1zdGVhZHktYWJvdmUtMjlrLWJvbmQteWllbGRzLXJpc2UtYXMtYm9qLW1ha2VzLXlpZWxkLWN1cnZlLWNvbnRyb2wtbW9yZS1mbGV4aWJsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Steady Above $29K, Bond Yields Rise as BOJ Makes Yield Curve Control More Flexible - CoinDesk",
        "content": "The BOJ relaxing its grip on the bond market at a time when the Federal Reserve and other major central banks look set to hold interest rates higher for longer might mean a challenging time for risk assets. BOJ's yield curve control – perpetual QE – has been a significant source of liquidity for the global markets since 2016. The program has also contributed to lowering borrowing costs across the advanced world."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLXN0cnVnZ2xlcy0yOTYwMC_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvYml0Y29pbi1wcmljZS1zdHJ1Z2dsZXMtMjk2MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Price Struggles Post Expected Fed Result, More Losses Ahead? - NewsBTC",
        "content": "Bitcoin price is struggling to recover above the $29,000 resistance level. BTC must settle above $29,000 and then $29,600 to move into a positive zone.\n\nBitcoin is attempting a recovery wave above the $28,850 level.\n\nThe price is trading below $29,200 and the 100 hourly Simple moving average.\n\nThere is a key bullish trend line forming with support near $29,250 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could face a strong resistance near the $29,600 resistance.\n\nBitcoin Price Still In The Negative Zone\n\nBitcoin price started a short-term recovery wave above the $29,000 resistance zone. BTC was able to climb above the $29,200 resistance zone after the Fed interest rate decision.\n\nThere was a move above the 23.6% Fib retracement level of the key drop from the $30,335 swing high to the $28,880 low. However, the bears were active near the $29,600 resistance zone and there was no close above the 100 hourly Simple moving average.\n\nBitcoin is now trading below $29,200 and the 100 hourly Simple moving average. Besides, there is a key bullish trend line forming with support near $29,250 on the hourly chart of the BTC/USD pair.\n\nImmediate resistance is near the $29,450 level and the 100 hourly Simple moving average. The first major resistance is near the $29,600 level. It is near the 50% Fib retracement level of the key drop from the $30,335 swing high to the $28,880 low.\n\nSource: BTCUSD on TradingView.com\n\nThe next major resistance is near the $29,800 level, above which the price might start a decent increase toward the $30,000 resistance zone. The next major resistance is near the $30,350 level, above which the price could gain bullish momentum.\n\nFresh Decline in BTC?\n\nIf Bitcoin fails to clear the $29,600 resistance, it could start a fresh decline. Immediate support on the downside is near the $29,200 level and the trend line.\n\nThe next major support is near the $29,000 level, below which the price could drop toward $28,880. The next support is near the $28,500 level. Any more losses might call for a move toward the $28,200 level in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bullish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level.\n\nMajor Support Levels – $29,200, followed by $29,000.\n\nMajor Resistance Levels – $29,400, $29,600, and $30,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYXdzLmFtYXpvbi5jb20vYmxvZ3MvZGF0YWJhc2UvYXdzLWV4cGFuZHMtYW1hem9uLW1hbmFnZWQtYmxvY2tjaGFpbi13aXRoLWFjY2Vzcy1hbmQtcXVlcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "AWS expands Amazon Managed Blockchain with Access and Query | Amazon Web Services - AWS Blog",
        "content": "Today, we are happy to announce the general availability of Amazon Managed Blockchain (AMB) Access and Query. These two services expand AMB’s capabilities to help developers seamlessly interact with public blockchains so they can build scalable applications quickly and securely. AMB Access provides a new serverless offering for non-mining, full blockchain nodes. With AMB Access, developers can instantly call standard remote procedure calls (RPCs) to interact with digital assets and distributed applications built on multiple blockchains, starting with Bitcoin, without specialized blockchain infrastructure. AMB Query delivers standardized and formatted blockchain data from multiple blockchains, starting with Bitcoin and Ethereum, which applications can consume quickly without having to perform complex data transformations or pay expensive storage costs. In this post, we share the developer problems AMB Access and Query can solve, the new service capabilities, and target use cases.\n\nBackground\n\nOur journey started by working backwards with blockchain developers from enterprises integrating Web3 innovations into Web2 products and blockchain-native startups pushing the boundaries of Web3 innovation. Over the past three years, use cases for public blockchains have matured, allowing developers to create mainstream applications which enable new forms of value exchange with decentralized finance (DeFi), consumer engagement and loyalty platforms using non-fungible tokens (NFTs), and efficient payments with cryptocurrencies such as Bitcoin and collateralized stablecoins. However, the emerging state of public blockchain tooling forces developers to spend time on undifferentiated work such as node operations and indexing data, instead of building value-added user experiences.\n\nAt a high level, there are three complex but undifferentiated tasks developers face with blockchain today:\n\nDevelopers must maintain specialized blockchain servers, known as nodes, in order to submit transactions or read the latest state of the blockchain. Developers have to keep up with a stream of node software updates through a labor-intensive process or risk losing the transactions they send to the blockchain. Scaling the node infrastructure with application usage also introduces operational risks. For example, new nodes can take days and multiple tries to sync with the blockchain before they can be used.\n\nDevelopers must maintain nodes for multiple blockchains to provide users with access to popular applications and cryptocurrencies on blockchains such as Bitcoin and Ethereum. This further complicates the developer task, because each blockchain has its own language, hardware requirement, and software upgrade cycle to manage.\n\nDevelopers must transform raw blockchain data into formats that can be easily accessed by their applications to provide richer analytics for blockchain data, such as wallet balances and descriptions of NFTs. This is difficult because developers have to download terabytes of data from special archive nodes, standardize raw blockchain data with complex transformations, call smart contracts to get information such as token symbols, and store the data in application databases for fast querying. In addition, developers have to write special logic to handle historical data updates from the blockchain while new information continues to stream in.\n\nCapabilities of AMB Access and Query\n\nTo help blockchain developers with their undifferentiated tasks, we prioritized simplifying access to the foundational blockchain infrastructure and data components with these capabilities:\n\nServerless access – AMB Access extends the existing dedicated node offerings from AMB with serverless, scalable, and secure access to blockchain networks. AMB Access makes it even simpler for developers with instant availability to standard RPCs, removing the undifferentiated effort to configure dedicated infrastructure for blockchain resiliency and scalability, maintain blockchain nodes, or patch blockchain server software. In response to the institutional and retail demand our customers are seeing, AMB Access will support Bitcoin as its first serverless blockchain network through non-mining, full Bitcoin Core nodes. Our dedicated node offerings will continue to be available for customers who need a more hands-on approach to meet their resiliency and compliance requirements.\n\n– AMB Access extends the existing dedicated node offerings from AMB with serverless, scalable, and secure access to blockchain networks. AMB Access makes it even simpler for developers with instant availability to standard RPCs, removing the undifferentiated effort to configure dedicated infrastructure for blockchain resiliency and scalability, maintain blockchain nodes, or patch blockchain server software. In response to the institutional and retail demand our customers are seeing, AMB Access will support Bitcoin as its first serverless blockchain network through non-mining, full Bitcoin Core nodes. Our dedicated node offerings will continue to be available for customers who need a more hands-on approach to meet their resiliency and compliance requirements. Multiple blockchains – AMB Access and Query provide access to the most popular blockchains in one place, starting with Bitcoin and Ethereum. With the addition of Bitcoin, AMB introduces the ease and instant availability of serverless APIs to complement its dedicated managed public blockchain offering for Ethereum. We will continue to listen to our customers for additional blockchains to support with AMB Access.\n\n– AMB Access and Query provide access to the most popular blockchains in one place, starting with Bitcoin and Ethereum. With the addition of Bitcoin, AMB introduces the ease and instant availability of serverless APIs to complement its dedicated managed public blockchain offering for Ethereum. We will continue to listen to our customers for additional blockchains to support with AMB Access. Straightforward data access – AMB Query will provide common application APIs to make data from multiple blockchains quickly available with response times that can meet the needs of interactive consumer applications. The complicated infrastructure setups, data transformation processes, and query statements required to provide common application requests, such as getting the wallet balance of all cryptocurrencies for the supported blockchains, are abstracted behind simple API calls.\n\n– AMB Query will provide common application APIs to make data from multiple blockchains quickly available with response times that can meet the needs of interactive consumer applications. The complicated infrastructure setups, data transformation processes, and query statements required to provide common application requests, such as getting the wallet balance of all cryptocurrencies for the supported blockchains, are abstracted behind simple API calls. Predictable pricing – AMB Access and Query provide a simple and transparent pay-as-you go pricing structure charged per remote procedure call (RPC) or API call. There is no utilization minimum and no need to translate abstract units into dollar costs.\n\nGeneral availability features\n\nAMB Access and Query offer the following features in our initial release:\n\nAMB Access for Bitcoin – Developers can connect to mainnet as well as testnet non-mining full Bitcoin Core nodes to access 28 commonly used JSON RPCs from the Bitcoin Core Client. AMB Access is available over the internet via the public endpoints or privately from their virtual private cloud (VPC) using AWS Private Link. Refer to our documentation for additional details. AMB Query for Bitcoin and Ethereum – Developers can access commonly requested on-chain current and historical data for address token balances and transaction history. With AMB Query’s six initial APIs, developers can get data from Bitcoin and Ethereum mainnet in a standardized format. Refer to our documentation for additional details.\n\nUse cases\n\nAs foundational components, AMB Access and Query can help developers with every public blockchain use case. The following are two examples:\n\nCustodians and wallets – These applications can be considered the Web3 equivalent of traditional banking applications. Users of these applications expect similar experiences to their traditional banking applications, such as having their current and historical balances as well as transactions available at their fingertips. Regardless of whether they are centralized and operated by licensed operators or decentralized and self-managed by individual consumers, these applications serve the same basic purposes to store and transfer cryptocurrencies. While developers would still have to manage their own security to store cryptocurrencies, developers can have their applications interact with the blockchain RPCs through AMB Access so to transfer cryptocurrencies and read data from the blockchain quickly with AMB Query to display in the application.\n\n– These applications can be considered the Web3 equivalent of traditional banking applications. Users of these applications expect similar experiences to their traditional banking applications, such as having their current and historical balances as well as transactions available at their fingertips. Regardless of whether they are centralized and operated by licensed operators or decentralized and self-managed by individual consumers, these applications serve the same basic purposes to store and transfer cryptocurrencies. While developers would still have to manage their own security to store cryptocurrencies, developers can have their applications interact with the blockchain RPCs through AMB Access so to transfer cryptocurrencies and read data from the blockchain quickly with AMB Query to display in the application. Consumer engagement – The use of NFTs as a way to connect and increase engagement with consumers by enterprises such as Nike and Starbucks continues to grow. These NFTs serve as gating tokens that unlock exclusive benefits for the holders (such as access to real-world events), which can be used to incentivize specific actions (such as purchasing physical goods), and increase collaboration across brands (such as unlocking in-game digital goods from a popular brand). To enable these actions, applications must create, manage, and transfer NFTs using the RPCs on AMB Access, as well as quickly check ownership information with AMB Query. For example, to unlock an exclusive NFT for high-value customers, an application may need to check user wallets for ownership of an existing NFT issued on Ethereum and have holdings of greater than 1 BTC on Bitcoin.\n\n“Amazon Managed Blockchain Access and Query provide friction-free access to blockchain networks and their data so developers can easily create their Web3 applications,” said Saman Michael Far, VP of Financial Services Technology, AWS. “I expect this easy to incorporate functionality will enable new mainstream applications ranging from interacting with digital assets to creating new ways of engaging consumers and their brands.”\n\nAMB Access and Query are being used today by leading institutions for their digital initiatives.\n\n“Brazil is one of the world’s fastest growing cryptocurrency markets, with interest from the retail sector and among institutions, as well as supportive regulation from our government. Itaú is at the forefront of meeting this need as a trusted, and regulated entity, with a comprehensive cryptocurrency initiative. By using AMB Access we have accelerated our time to market by months which holds great strategic significance for Itaú’s continued leadership across multiple businesses within a rapidly evolving market. Further, we are able to focus on delivering innovative products with the assurance of AMB’s scalability, security, and reliability supporting our efforts. After seeing the benefits of AMB Access, we are looking at AMB Query to help us more quickly get the critical balance and transaction information that is stored on the blockchain.” – Caio Cesar Lopes Gomes, CIO of Itaú digital\n\nSummary\n\nAMB Access and Query demonstrate the ongoing investment of AWS to help our customers in the growing Web3 and blockchain industry. Our initial offerings address the most common needs of customers for their foundational components with the performance, scalability, security, and reliability they expect. This foundation allows us to keep releasing new features regularly that simplify access to blockchain technology for enterprises and startups.\n\nAMB Access and Query can be accessed by customers using the AWS SDK, AWS Command Line Interface (AWS CLI), AWS Management Console, or REST APIs. To get started, refer to our AMB Access and AMB Query product pages. The existing dedicated AMB services for Hyperledger Fabric and Ethereum will be available under AMB Access.\n\nWe will explore in more detail the use cases and capabilities of AMB Access and Query in our upcoming deep-dive series.\n\nAbout the authors\n\nJohn Liu is the Head of Product for Web3 / Blockchain at AWS. He has 13 years of experience as a product executive and 10 years of experience as a portfolio manager. Prior to AWS, John spent 4 years leading product and business development at public blockchain protocols with a heavy focus on cross-chain technology, DeFi, and NFTs. Prior to that, John gained financial expertise as Chief Product Officer for fintech companies and portfolio manager at various hedge funds.\n\nPaul Fullarton is the GM for Web3 / Blockchain at AWS. Paul has led Blockchain managed services for AWS for the past 3+ years. Prior to Web3 / Blockchain, he spent 6+ years leading AWS SNS and AWS Pinpoint as well as teams in Amazon Stores. Prior to Amazon, Paul was a technology leader for 18+ years at companies such at Cisco, Motorola, and multiple start-ups. He holds 20 patents and BS & MS degrees in Computer & Electrical Engineering from Purdue University."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvam91cm5leXMtaGVydmUtbGFycmVuLW9uLWJpdGNvaW4tYXBlcy1hbmQtdGhlLXBzeWNob2xvZ3ktb2YtYmx1ZS1jaGlwLW5mdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Journeys: Hervé Larren on Bitcoin, Apes and the psychology of 'blue-chip' NFTs - Cointelegraph",
        "content": "During a period of hyperinflation in 2013, “my Venezuelan mother asked me to send money to Caracas, the country’s capital,” Hervé Larren recalls. However, bank transfers were not possible between the two countries.\n\nBusy with work in New York, he told a friend that he planned to fly to Caracas — carrying cash for his mother — and return the same day. “Why don’t you just send Bitcoin?” his friend asked, which quickly led to a change of plans as Larren made his first Bitcoin transfer.\n\n“My first crypto transaction, in 2013, was to wire Bitcoin from the U.S. to Venezuela. Due to the economic collapse, there was no functioning banking system between these two countries.”\n\nSwitching from a career with luxury goods company LVMH Moët Hennessy Louis Vuitton, Larren co-founded a large-scale crypto mining operation and worked with Grayscale to bring crypto assets to old-school investors. He later became a key adviser to ApeCoin and the first person to bid a million dollars for a nonfungible token.\n\nFrom old to new\n\n“We were reporting to Nicolas Sarkozy, and he was coming to our meetings,” Larren recalls of his time as the head of a high school student council in Neuilly-sur-Seine, the wealthiest old-money suburb of Paris, where he grew up.\n\nSarkozy served as the local mayor for 20 years before becoming the president of France. Larren’s mother — from Venezuela — was a TV host and the first Latina model signed by the L’Oreal cosmetics brand. His French father imported wine to Canada, where a third of the population is French-speaking.\n\nIn the late 90s, Larren began undergraduate business studies at Montreal’s Concordia University. In 2019, Concordia labeled him “The Blockchain Maven” as part of a “50 Under 50” alumni distinction. Upon graduation, he got a job at Moët Hennessy’s New York office, where he worked on brand development of the firm’s Hennessy cognac brand in the United States.\n\nLarren worked on his MBA at Columbia University part time while at LVMH, graduating in 2010 and entering the venture capital world with Peak Ventures, which “was involved in tech companies including Twitter.” It was Larren’s first experience in the technology sector, which he describes as very different from the old-world, intergenerational luxury goods industry.\n\nLarren quickly moved to accept Bitcoin at an e-commerce business he was involved with, a company that helped charities raise money by partnering with celebrities. In 2015, he formed crypto mining firm Global Crypto Ventures, which grew into an operation of nearly 3,000 machines composed primarily of Bitmain Antminer S9 miners in Las Vegas and Texas, where “the cost of infrastructure and electricity was cheaper.”\n\nLarren at his mining facility. (Hervé Larren)\n\nGrayscale Digital Large Cap Fund\n\nWhile speaking at the 2017 World Technology Forum in New York, Larren met Digital Currency Group CEO Barry Silbert, who was talking right after him about the Grayscale Bitcoin Trust, through which retail investors could get exposure to Bitcoin through their brokerage. He was also working on a new investment vehicle called Grayscale Digital Large Cap Fund (GDLC), which represented a weighted portfolio of cryptocurrencies, including Ether, MATIC, ADA and SOL, in addition to Bitcoin.\n\nAs a publicly traded investment instrument, it would require approval by the Securities and Exchange Commission. One relevant matter would be to ensure that the fund could buy its digital assets from a trusted source, preferably from within the United States. Larren’s mining firm was an ideal source, and having a ready buyer for mining proceeds made business smoother.\n\nThis opportunity represented Larren’s first foray into crypto beyond Bitcoin, and it “attracted me to a new space.”\n\nWorking with the SEC was no easy task, Larren recalls. “It was a nerve-racking process. Though the company was very confident about getting approval, there was a lot of uncertainty because no such investment trust had been approved previously.”\n\nHowever, the GDLC was approved, expanding the potential pool of crypto investors. Though many in the industry continue to preach the “not your keys, not your coins” mantra, Larren argues that just as with stocks, owning Bitcoin and other crypto assets through a financial instrument instead of on an exchange or cold-storage device is preferable for most of the public.\n\nThere is less risk of being hacked or losing access to keys, and regulated funds must meet stringent security policies and often carry insurance. He also notes that they are easier to manage on a portfolio basis, particularly regarding taxation and being more straightforward for accountants to understand.\n\nWill BlackRock’s Bitcoin ETF be approved?\n\nThese advantages make it easy to see why heavyweights of the financial industry see an opportunity in offering Bitcoin investment vehicles accessible to retail investors. One of these is BlackRock, which recently applied to launch a Bitcoin spot exchange-traded fund in the United States.\n\n“BlackRock offers the credibility to convince the SEC that the Bitcoin market can be operated safely and has much to offer investors,” Larren says optimistically. He expects that with BlackRock’s track record of 575 approved ETFs versus one denial, it will soon come online, with similar products expected in other markets.\n\n“I think it would lead to an automatic rise in Bitcoin’s price. I think many people are on the sidelines waiting for clarity, and that’s a step in Bitcoin’s institutional adoption.”\n\n“For a very long time, Grayscale had a premium on its shares” compared with the price of Bitcoin, Larren notes, explaining that the security, certainty and convenience meant that more conservative investors were historically willing to pay more per BTC. BlackRock’s ETF is unlikely to hold a large premium, which would serve to make the market more efficient.\n\nAll roads in Decentraland lead to Beeple\n\nLarren first heard about the metaverse through Decentraland’s initial coin offering in August 2017. “They were selling 90,000 pieces of NFT land in the metaverse,” he recalls, adding that he felt a proximity to the project’s Argentine founders due to South America’s shared currency issues. “My first NFT purchase was actually buying my name in the metaverse,” he says, recalling how he spent 100 MANA to name his avatar.\n\n\n\nHe was also given a piece of land on which to build the Airvey art gallery, where Larren placed various NFTs for sale. When Christie’s announced it would auction Beeple’s “Everydays” piece in its first-ever NFT auction in March 2021 — a story previously covered by Magazine — the auction house contacted the Airvey gallery to invite bids.\n\n“I wanted to be the first person in the world who bid seven figures on an NFT.”\n\n“Well that escalated quickly” was Beeple’s only comment when Larren’s bid for $1 million came through, representing the first volley in a bidding battle that would see an anonymous buyer later revealed as Vignesh Sundaresan, also known as Metakovan, beat Tron founder Justin Sun with a record-setting bid of $69 million.\n\nBeeple posted his reaction to the $1 million bid on Instagram.\n\nBored Apes design ApeCoin\n\nWith a newfound passion for NFTs, Larren joined Horizen Labs in 2021, months before the firm began discussions with Yuga Labs, a small company where four founders were working on an NFT project involving monkeys.\n\nYuga contracted Horizen Labs to create ApeCoin, a large allocation of which was distributed to holders of Yuga’s NFT collections — including Bored Ape Yacht Club, Mutant Ape Yacht Club and Bored Ape Kennel Club — via massive airdrop.\n\n“We did everything from the white paper, tokenomics, to listing on exchanges. In less than 20 minutes, it became an $8 billion project,” Larren says, referring to the token’s undiluted market cap, now about $2 billion. In addition to the launch, Larren notes that Horizen Labs designed the token’s staking mechanism, which will see “100 million tokens distributed to the community over three years.\n\nAs Gucci and TAG Heuer began accepting ApeCoin as a form of payment, Larren’s luxury contacts came calling back.\n\n“I spent a week with Chanel’s team at a castle in the English countryside, educating them on all aspects of Web3,” including MetaMask and NFT drops. Larren observes that as he moved from “the most successful physical goods company, LVMH, to the most successful digital goods company, Yuga Labs, the thought process was the same.”\n\nHe describes metaverse real estate and PFPs, which include Yuga’s famous monkey pictures, as fitting into a broad category of “consumer NFTs” that are purchased by individuals in a way not dissimilar to luxury goods. Indeed, he notes that many of LVMH founder Bernard Arnault’s children — heirs of the world’s second-richest man — are actively dabbling in them.\n\nLarren overlooking the Horizen Labs office floor in Milan. (Elias Ahonen)\n\n“People want to feel that they are part of an exclusive community with like-minded individuals,” he explains, relating the concept sold in luxury boutiques and exclusive events the world over. In the case of Yuga’s NFTs, he argues that “there is value for many people in being members of a group that shares similar cultural references, whether it being digital or at concerts,” referring to events like ApeFest, the next of which will take place in Hong Kong in November.\n\nCan an ape JPG really be a blue-chip NFT?\n\nNFTs that gain mass appeal as recognizable status symbols are often labeled as “blue chip” among the NFT community, a nod to a term typically referring to reliable stocks and originally derived from poker, where blue chips are traditionally the most valuable.\n\n“It’s a brand-building element as recognition of industry and buyers. Supply is far less than demand, and there is a strong fan and collector base. In traditional art, Picasso and Jean-Michel Basquiat are blue chips,” he explains, noting that Bored Apes and CryptoPunks hold such a position within the PFP hierarchy.\n\n“The price is a result of the value that has been created. When you go to a Louis Vuitton store, the price is nowhere to be seen.”\n\n“Holding a BAYC can make sense because you can stake it to earn tokens, and it can act as a financial instrument because you can borrow against it,” he notes, naturally enough, considering his company designed the staking mechanism.\n\nLarren poses in Milan with images of NFTs, including a Bored Ape and an Otherside land plot. (Elias Ahonen)\n\n“There are blue chips in other categories as well, such as metaverse land,” he adds, cautioning that its value, “like traditional real estate, will depend on the income generated with it.”\n\nThis is because, in his opinion, people will not remain interested in vast spaces of empty metaverse land but rather in spaces that are built up and useful, like his art gallery. “Traditional real estate involves buildings — the same will be true of metaverse land.”\n\nWhere might we look for the next crop of blue chips?\n\n“I’m now passionate about building on top of Bitcoin with BRC-20s and Ordinals,” Larren explains, hinting that something big is in the works. For him, the coming metaverse is a place and time “when your digital life is more important than your physical life and where digital image matters more than physical image.” In this new environment, he believes that the Bitcoin chain, with its newfound capability to host NFTs, will hold a key position as a central pillar.\n\n“In Web3, you need to anticipate how consumer taste will evolve and what the market will want in the next six months.”"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yOTIwMC1kb2dlY29pbi1wb2x5Z29uLXNoZWQtdXAtdG8tMi9hcnRpY2xlc2hvdy8xMDIxOTcxNjQuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWZhbGxzLWJlbG93LTI5MjAwLWRvZ2Vjb2luLXBvbHlnb24tc2hlZC11cC10by0yL2FtcF9hcnRpY2xlc2hvdy8xMDIxOTcxNjQuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $29,200; Dogecoin, Polygon shed up to 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading lower in Friday's trade. Bitcoin (BTC) fell 0.70% to $29,190, whereas Ethereum (ETH) was below the $1,900 level.Meanwhile, the global cryptocurrency market cap was trading lower, around $1.18 trillion, falling 0.64% in the last 24 hours.\"Bitcoin remained above $29,000 despite the U.S. Federal Reserve's decision to raise the interest rate by 25 basis points (bps). Bitcoin continues to stay within a narrow range between $29,000 and $31,500 for over a month with over 3.4 Mn Bitcoin addresses buying the dip below $30,000,\" said, CoinDCX Research Team.Other top crypto tokens, Dogecoin , Solana, Polygon, and Polkadot were also trading lower.The total volume in DeFi is currently $2.49 billion, 9.50% of the total crypto market 24-hour volume. The volume of all stablecoins is now $24.43 billion, which is 93.26% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $567 billion. Bitcoin's dominance is currently 48.19%, a decrease of 0.02% over the day, according to CoinMarketCap. BTC volume stood at approximately $10.92 billion, declining 15.83% in the last 24 hours.\"Over the past 24 hours, there has been a noticeable change in patterns in the dynamic world of cryptocurrencies. The resiliency of BTC has been on display as it has mostly stayed unaffected by anticipated 25 basis point interest rate increases by the US and ECB,\" Shivam Thakral, CEO of BuyUcoin, said. Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said, \"BTC is holding steady at around $29.2k and traded within a tight range of $29k-29.5k in the last 24 hours. The Federal Reserve's interest rate hike, followed by a higher-than-expected U.S. GDP, raises concerns about prolonged high rates. This may impact the market’s future price action, as investors may begin to move towards ‘risk-off’ asset classes.\"Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.43 hours, IST on July 28, 2023)Bitcoin $29,190 -0.70%Ethereum $1,859 -0.82%Tether $0.9999 -0.02% BNB $240 -0.33% XRP $0.7076 -0.62%Cardano $0.3107 2.97%Dogecoin $0.07642 -2.48%Solana $24.69 -1.81%Polygon $0.7095 -2.45%Litecoin $91.18 0.45%Polkadot $5.18 1.39%Tron $0.08412 2.19%Shiba Inu $0.000007808 -0.65%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc2F6bWluaW5nLWVzdGFibGlzaGVzLXN1c3RhaW5hYmxlLWJpdGNvaW4tbWluaW5nLWZhY2lsaXR5LWluLXBhcmFndWF50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Sazmining Establishes Sustainable Bitcoin Mining Facility In Paraguay - Nasdaq",
        "content": "Sazmining, a hosted Bitcoin mining provider committed to 100% renewable energy, has set its sights on South America with the establishment of a new facility in Paraguay. Slated to commence operations on September 15th, the facility takes advantage of Paraguay's low electricity prices, offering hosting at an competitive rate of 4.7 cents per kWh – a far cry from the average cost of 16.1 cents per kWh in the United States.\n\n\"By harnessing surplus electricity, Bitcoin mining has ingeniously transformed Paraguay's previous losses into a profitable venture for the entire nation,\" stated Kent Halliburton, President and COO of Sazmining. \"Embracing this development, Paraguayan politicians and the local power provider, ANDE, are actively participating in electricity-for-Bitcoin transactions. Beyond immediate financial gains, Sazmining has a larger vision focused on creating a sustainable and forward-looking future by investing in electrical infrastructure that will benefit Paraguay for generations to come, extending well beyond the lifespan of any Bitcoin mining activities.\"\n\nAs a fully non-custodial service, Sazmining ensures customers' Bitcoin rewards are directly sent from the mining pool to their private wallets. Operating on a mutually beneficial model, Sazmining only earns when the customer does, incentivizing them to optimize the mining environment for maximum efficiency and the longevity of the miners.\n\nThe facility will provide customers with their signature white-glove, on-site maintenance, customer-service experiences, and a dedicated security team to ensure the highest standards of safety and performance.\n\nIn 1971, Brazil and Paraguay joined forces to construct the Itaipu Dam, generating 14 gigawatts of electricity. Under the agreement, Brazil financed the project, and in return, Paraguay received surplus electricity beyond its domestic needs. Initially faced with the challenge of handling this surplus, Paraguay started selling the excess power to Brazil, albeit at a financial loss. However, the advent of the Bitcoin mining industry has now presented a perfect solution to this situation, allowing Paraguay to not only profit from their surplus energy but also house advanced Bitcoin mining facilities.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3dvcmxkY29pbi1wcmljZS1wcmVkaWN0aW9uLXdpbGwtaXQtb3ZlcnRha2UtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Worldcoin Price Prediction: Will it Overtake Bitcoin? - Analytics Insight",
        "content": "Worldcoin is a crypto acting as a digital passport issued after scanning the user’s iris. This project raises serious questions about the need for controversial digital identity creation methods. The concept of “orbing” seems like a dystopian surveillance tactic, reminiscent of a sci-fi movie, rather than a practical and ethical solution.\n\nThe risks of mishandling sensitive biometric data and violating individuals’ privacy rights are not to be taken lightly, and the absence of proper regulatory scrutiny in some regions is alarming. With its potential, many people wonder if it may overtake Bitcoin. However, BTC20, an ERC-20 Bitcoin version also known as green Bitcoin, is making quite a huge splash and can easily outshine this controversial project.\n\n<<<Buy The Best Coin Now<<<\n\nWorldcoin Price Prediction\n\nBefore diving deeper into the details of this project, let’s first take a look at the price prediction table.\n\nYear Price (Min-Max) 2023 $3.5 – $4.8 2024 $3.8 – $5.2 2025 $4 – $6.5 2030 $7.4 – $9\n\nWorldcoin is a project founded in 2019 by Sam Altman, Max Novendstern, and Alex Blania. The project aims to create a “digital passport” utilizing “Proof of personhood.” In order to obtain a Worldcoin ID, users are required to undergo an in-person iris scan using the project’s AI-powered scanners called orbs.\n\nAccording to data from Crunchbase, Worldcoin successfully raised $125 million through two funding rounds. The Series A round was initiated on October 21st, 2021, and it was led by Andreessen Horowitz, resulting in funding of $25 million. Following the Series A round, Worldcoin initiated an ICO, which raised $100 million through investments from Andreessen Horowitz and Khosla Ventures.\n\n<<<Buy The Best Coin Now<<<\n\nAs of the time of writing, the project is still in its infancy, having been launched on July 24th. After the launch, the price of Worldcoin significantly increased by more than 42%. Since then, the price has experienced some correction, and the current value of WLD stands at $2.38.\n\nAccording to the experts, the maximum price could go up to $9 by the end of 2030, but the question that bothers many people is, would this crypto really conquer the world? Could it overtake Bitcoin? Well, it is highly unlikely due to people’s fear surrounding Al technology. Since Bitcoin hovers around $29k and is too expensive for most investors, most people turn to BTC20. Here is why!\n\n<<< Get BTC20 Now<<<\n\nBTC20 Poised to Leave Worldcoin Behind\n\nBitcoin has made a huge difference to the world as we know it. The recent launch of BTC20 has made it clear that BTC history can be recreated, and it was done with the goal of giving investors one more shot at getting it at the modest price of $1. This pricing pays tribute to Bitcoin’s early days in 2011, infusing the project with a nostalgic touch.\n\nBTC20’s straightforward plan has already proven to be a game-changer, yielding significant results during the ongoing presale aimed at funding marketing efforts and expanding the project’s scope. But BTC20 goes beyond mere symbolism; it introduces an innovative passive income-staking feature akin to a modern version of Bitcoin’s block reward mechanism. What sets it apart is its eco-friendly nature and accessibility for all.\n\n<<< Get BTC20 Now<<<\n\nCompared to WLD, it is easy to understand why people prefer investing in BTC20. The launch of Worldcoin’s eye-scanning site in London on Monday raised eyebrows as people lined up to participate in the questionable “orbing” process. This procedure involves scanning individuals’ irises to verify their humanity and eligibility for a “World ID” on the Worldcoin smartphone app. As a reward for undergoing this concerning procedure, participants are handed roughly £40 worth of the project’s cryptocurrency, WLD.\n\nIt is concerning to note that this “orbing” process is being rolled out in 35 cities across 20 countries, indicating a widespread invasion of privacy in the name of digital identification. However, it is notable that the rollout conveniently skips the United States, where regulatory concerns seem to be holding up the currency’s introduction. One cannot help but wonder whether the absence of regulatory approval in the US is due to the potential ethical and legal implications of such a biometric identification system. At the same time, the presale of BTC20 is progressing extremely fast.\n\n<<< Get BTC20 Now<<<\n\nBTC20 Presale going strong – More than $2 million raised\n\nDuring the presale, 6.05 million BTC20 tokens will be available, just like the original token supply for BTC back in 2011. Any unsold presale tokens will be incorporated into the BTC20 staking contract before the official listing, ultimately capping the total supply at 21 million BTC20 tokens. This offers investment opportunities and enables active token holders to stake their assets and earn a portion of the staking rewards. The brilliance of this staking mechanism lies in its community-driven approach. As more people participate in staking, the collective rewards grow, leading to prosperity for everyone involved.\n\n<<< Get BTC20 Now<<<\n\nBy embracing staking with BTC20, the investors will not only tap into the inherent value of the tokens but also reap the rewards distributed through the staking contract. Following the original Bitcoin token release schedule, these rewards are released with each block confirmation, ensuring steady and sustainable growth in the long run. With a well-thought-out design intended to offer reliable returns for around 120 years, it’s no wonder that BTC20 is being hailed as an absolute gem with the potential to yield remarkable returns for investors.\n\nIf you’re seeking a project that combines a rich history, innovative features, and a community-focused growth strategy, BTC20 is undoubtedly an enticing opportunity worth exploring. Don’t miss your chance to be part of this thrilling journey, where possibilities for substantial rewards abound!\n\n<<< Get BTC20 Now<<<\n\nConclusion\n\nThe world is facing many changes, and one of the biggest ones is the use of Al. Having a crypto that directly uses it raises many questions, which is why it may hardly achieve the desired results. On the other hand, BTC20 is an environment-friendly token that is a fresh opportunity for big gains, just like BTC brought to early investors in the past, making it easy to see why it is poised to outshine it!\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2NyeXB0by9ob3ctdG8ta2VlcC15b3VyLWNyeXB0b2N1cnJlbmN5LXNhZmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "How to Keep Your Bitcoin and Cryptocurrency Safe (2023) - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYXJ0cy53YWxlcy9uZXdzLWpvYnMtb3Bwb3J0dW5pdGllcy9uZXdwb3J0LWdyb3duLW11c2ljYWwtcGxheS1iaXRjb2luLWJvadIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Newport-Grown Musical Play, Bitcoin Boi - Arts Council of Wales",
        "content": "Excitement is mounting in The Riverfront Theatre as the countdown for the launch of the brand-new musical play, Bitcoin Boi, has begun.\n\nThis production has been a long time in the making and holds a special place for many of the team at The Riverfront, who saw the beginning of the creative journey and have watched the storyline evolve. We’re looking forward to an evening of banging tunes and poppy visuals in what will be a fun night out for all.\n\nWith the work of a highly accomplished creative team well known on the Welsh theatre scene, this production is a powerful blend of a gripping storyline, inventive visual elements and fantastic tunes heavily inspired by 80s and early 90s style electro music.\n\nJade and her mother Crystal dream of a better life - the life promised to them by Jade's father, before he vanished.\n\nWhile struggling to deal with financial strains and individually navigating their own grief, their relationship has become fraught. Both Crystal and Jade pursue their own journey, desperately seeking solutions and happiness. While Jade relentlessly chases down a mythical fortune in a video game, Crystal is seduced by the offer of a new life from a mysterious stranger.\n\nThey say you can't put a price on a good life. They're wrong.\n\nWhile exploring themes of grief and hope, this play will leave audiences reflecting on what is most valuable in life and the cost of the dreams that we are sold.\n\nMeet The Cast and Creative Team\n\nDena Davies will be playing the role of Jade; an obsessive gamer, desperate to find the key to the better life that her Dad promised before he left. Dena is an actor/director from Swansea and a 2022 LIPA graduate. Her credits in training include, Everyman, Our Town and Twelfth Night. Last year she made her professional stage debut playing Hermia in A Midsummer Night’s Dream at the Sherman Theatre. More recently she was the assistant director on Grand Ambition’s production Sorter.\n\nElin Phillips plays stressed out single mother Crystal. With a mix of comedy and pure emotion Elin creates a relatable character who the audience can connect with. Elin's many credits include (Theatre) The Clockwork Crow, Seagulls and The Populars (Volcano Theatre), Finding Home (Mercury Theatre), All My Sons, The Herbal Bed, Rape of the Fair Country, As You Like It and Animal Farm (Theatr Clwyd); (TV) Itopia (Boom Cymru), The Pact (Little Door for BBC), Will (TNT), IHA Sheelagh (S4C). (Radio) The Last Lesson (BBC Radio Wales), Writing The Century 1966 - 1970 and Lemon Meringue Pie (BBC Radio 4). Elin has also featured in two films: Love Type D (Dumpee Ltd), and Y Syrcas (Ffatti Films for S4C).\n\nGwawr Loader will be playing the role of Bounty Hunter. With her breath-taking vocals, Gwawr helps narrate the story and Jade’s heart-breaking journey through the levels of her game. Gwawr has a wealth of experience in theatre, TV and Radio. Her credits include (Theatre) Angamol (Theatr Genedlaethol Cymru), Before I Leave and The Radicalisation of Bradley Manning (National Theatre Wales), Cyrano De Bergerac, Portrait of The Artist as a Young Dog, Skyhawk and Rape of The Fair Country (Theatr Clwyd); (TV) Lost Boys and Fairies (Duck Soup Films for BBC), Hidden/Craith (Severn Screen for BBC Four/BBC One Wales/S4C) and The Indian Doctor (Rondo for BBC); (Radio) Stalingrad: Episode 2, Superstar Me and Ten Days That Shook The World (BBC Radio 4).\n\nAlex Parry will be playing the role of Jasper, the charismatic stranger who offers Crystal the chance to transform her life. Alex trained at the Royal Welsh College of Music and Drama. His credits include (Theatre) Pippi Longstocking (Royal and Derngate), Burke and Hare (Watermill and West End), As You Like it (Shared Experience), After the Dance (Theatre by the Lake); (TV and Film) Protein (Broadside Films), Wargamers (Sky), Muppets: Most Wanted (Disney Pictures), Torchwood, Dirk Gently (BBC) and Empire Square (Channel 4).\n\nThis production is a Riverfront Theatre and Arts co-production, written by Catherine Dyson, directed by Hannah McPake, with music composed by Dyfan Jones and lighting by Joe Price.\n\nWhether you’re a lover of innovative theatre, online gaming, crypto currency, 80s style electro music, or simply a great night out, this is the show for you! The collaboration of skill, precision and pure talent from the creative team behind this production has created an inspiring piece of innovative theatre that mustn’t be missed.\n\nTo find out more about the production and book your tickets, head to The Riverfront’s website or contact 01633 656757."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1pcy1mYWNpbmctYmFkLW1vbnRocy1haGVhZC1oaXN0b3JpY2FsLWRhdGEtc3VnZ2VzdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin is facing 'bad months' ahead, historical data suggests - Finbold - Finance in Bold",
        "content": "Bitcoin’s (BTC) price has experienced a short-term recovery, making attempts to secure substantial gains above the $29,000 level while the asset maintains a sideways trading pattern. As the market anticipates a potential price rebound beyond the $30,000 mark, historical data suggests that Bitcoin might encounter a bumpy ride in the upcoming months.\n\nIn particular, an analysis by prominent pseudonymous crypto market analyst Fiery Trading shared in a TradingView post on July 26 indicates that Bitcoin could be in for challenging months during the third quarter. The analysis suggests the asset has been facing bearish performance during its pre-halving phase.\n\nAccording to the analyst, the cryptocurrency has historically experienced a downturn during this time frame, with all three pre-halving years showing a significant price drop, surpassing 20% at some point.\n\nThe analysis indicates that a potential 20% drop from the current monthly open could result in Bitcoin’s price declining to $25,000.\n\nBitcoin price analysis chart. Source: Trading View\n\n“As seen on the chart, Bitcoin’s performance has ALWAYS been bad in the third quarter. During all three pre-halving years, the price dropped over 20% at some point. As of today, BTC is down a little over 4%. A 20% drop from the monthly open would bring Bitcoin back at $25,000,” he said.\n\nBitcoin makes minor recovery\n\nAmid the analysis, Bitcoin made minimal gains, seemingly unfazed by the recent Federal Reserve decision to raise interest rates by 25 basis points. However, it still lags significantly behind its peak in July at $31,800.\n\nInterestingly, the cryptocurrency appears to remain relatively unaffected by macroeconomic events despite witnessing more significant price fluctuations over the past year due to such events.\n\nAs interest in Bitcoin’s future performance persists, Finbold utilized Google Bard, a generative artificial intelligence (AI) platform, to predict the asset’s valuation. The tool highlighted factors that could potentially influence Bitcoin’s price following the 2024 halving event, known as a bullish factor.\n\nIn addition to the AI prediction, financial experts shared their projections for Bitcoin’s price by the end of 2023. According to Finbold’s report, these experts believe that Bitcoin might reclaim trading levels near the $40,000 mark.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was trading at $29,429 after making minor gains of over 1% in the last 24 hours. On the weekly chart, Bitcoin is down around 1.5%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nAs Bitcoin faces a short-term correction, the asset remains among the biggest gainers of the year at almost 80%.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL2J1c2luZXNzLXNwb3RsaWdodC93bGQtcmVhY2hlcy0yMC1iaWxsaW9uLW1hcmtldC1jYXAtc3RyYWlnaHQtYWZ0ZXItbGF1bmNoLWNhbi13b3JsZGNvaW4tYmUtdGhlLW5leHQtYml0Y29pbi1uZXdzLTMwNjA5MtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "WLD Reaches $20 Billion Market Cap Straight After Launch - Can Worldcoin Be The Next Bitcoin - Outlook India",
        "content": "The fast-rising token has taken the crypto market by storm, but many experts have raised concerns about its business model and mission. Their chief worry is that $20 billion is WLD’s fully diluted market cap. With just 1% of the total supply in circulation, Worldcoin’s real market cap is just $243 million at the current price of $2.23. Instead of rushing in to invest in WLD, some of the biggest analysts recommend taking a look at several other crypto projects that have been flying under the radar despite their massive potential. Wall Street Memes (WSM) and BTC-20 (BTC20) are among the most exciting cryptos on the market currently, setting up to deliver huge ROI to their early investors. With both of these tokens in presale, there is still time to grab some before they explode."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vcGN0ZWNobWFnLmNvbS8yMDIzLzA3L2V0aGVyZXVtLW9yLWJpdGNvaW4td2hhdC1pcy1hLWJldHRlci1pbnZlc3RtZW50LW9wdGlvbi_SAVVodHRwczovL3BjdGVjaG1hZy5jb20vMjAyMy8wNy9ldGhlcmV1bS1vci1iaXRjb2luLXdoYXQtaXMtYS1iZXR0ZXItaW52ZXN0bWVudC1vcHRpb24v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Ethereum or Bitcoin: What is a Better Investment Option? - PC Tech Magazine",
        "content": "When it comes to cryptocurrencies and the cryptocurrency market, any person interested in them will, first of all, mention Bitcoin and Ethereum. The major cryptocurrencies have really changed the world, but which one is better for investment? Should I convert USDC to ETH now or is it better to buy BTC?\n\nWhat is the difference between Bitcoin and Ethereum?\n\nBitcoin was the first successful cryptocurrency and was created as an alternative means of payment, a decentralized digital currency. Although during its existence it has not yet become an alternative form of money, it is still evolving towards a means of payment and a means of storing value. Experts say that Bitcoin is acquiring more and more features that bring it closer to gold.\n\nEthereum is a multifunctional blockchain platform and cryptocurrency. Initially, the goal of creating Ethereum was to develop an improved version of Bitcoin, but today there are more differences between the main cryptocurrencies than similarities. Ethereum is multi-tasking and, above all, it remains a development tool. The massive emergence of new crypto projects and entire areas of the crypto industry is primarily the merit of Ethereum.\n\nBitcoin is more independent and decentralized and has more confidence from investors. There are fewer hard forks in its history, while Ethereum already boasts a whole bunch of individual options that are available for purchase, including on https://letsexchange.io/exchange/eth-to-btc on par with the original coin.\n\nOn the other hand, ETH has more applications. The platform’s capabilities can potentially be used in logistics, finance, and audit. Another undoubted advantage of Ethereum is the high speed of transaction processing. To eliminate problems with the scalability of the blockchain, a transition was made to the Proof of Stake consensus mechanism. It is expected that after the phased introduction of additional updates, the throughput of the platform will increase by orders of magnitude.\n\nIn terms of the combination of characteristics and capabilities, Ethereum surpasses Bitcoin in terms of the increase in the volume of transactions and the number of active users. At the same time, Ether is more volatile than Bitcoin.\n\nAnother significant difference concerns monetary policy. The emission of Bitcoin is limited to 21 million units, and this creates the preconditions for an increase in the price of the asset. The supply of ETH coins is unlimited, although anti-inflationary measures are provided in the tokenomics.\n\nThe price of BTC is formed directly by the market, while the price of ETH is highly dependent on the platform itself and the pace of development of the DeFi industry. At the moment, the Ethereum blockchain is the leader in its segment, but the emergence of a worthy competitor is a matter of time.\n\nWhich coin to choose for long-term investment\n\nThe long-term prospects for Ethereum and Bitcoin depend on many variables. First of all, it is the functionality of each asset, the ratio of supply and demand, as well as pressure from regulators.\n\nEthereum firmly holds the second position in the ranking of the most capitalized cryptocurrencies. Bitcoin is also consistently the flagship of the market and sets its overall dynamics. There are no prerequisites for moving ETH in the rating one line lower or higher yet.\n\nToday, we can confidently say that both assets are suitable for long-term investment. Bitcoin is more stable, less volatile, it has a more stable reputation. The adoption of Bitcoin as a means of payment increases its credibility of it, and institutional investors are investing in the coin.\n\nHowever, Ethereum is now cheaper and could potentially be more profitable. Therefore, it makes sense not only to follow the Ethereum rate but also to include it in an investment portfolio to diversify risks.\n\nALSO READ: INVESTING IN CRYPTOCURRENCY, TOO LATE TO THE PARTY?"
    }
]