[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMy8wOC8wMy9pbnZlc3RpbmcvY3J5cHRvLWNvdXBsZS1wbGVhZC1ndWlsdHkvaW5kZXguaHRtbNIBUmh0dHBzOi8vYW1wLmNubi5jb20vY25uLzIwMjMvMDgvMDMvaW52ZXN0aW5nL2NyeXB0by1jb3VwbGUtcGxlYWQtZ3VpbHR5L2luZGV4Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "‘Bitcoin Bonnie and Clyde’ plead guilty to money laundering - CNN",
        "content": "CNN —\n\nA husband and wife, whose eccentricities and alleged crimes earned them the nickname “Bitcoin Bonnie and Clyde,” pleaded guilty to orchestrating a $4.5 billion money-laundering scheme linked to the 2016 hack of crypto exchange Bitfinex.\n\nThe couple, Russian-born tech entreprener Ilya Lichtenstein and Heather Morgan, an aspiring rapper who goes by the alias “Razzlekhan,” were arrested in 2022 in what the Justice Department called its “largest financial seizure ever.”\n\nOn Thursday, as part of a cooperation deal with prosecutors, Lichtenstein and Morgan both pleaded guilty to charges of money laundering conspiracy. The presiding judge, Colleen Kollar-Kotelly accepted their pleas.\n\nUntil Thursday’s hearing in Washington, DC, federal court, neither Morgan nor Lichtenstein had been directly implicated in the hacking of Hong Kong-based crypto exchange Bitfinex.\n\nBut the Justice Department now says Lichtenstein “used a number of advanced hacking tools and techniques to gain access to Bitfinex’s network” and was able to fraudulently authorize more than 2,000 transactions in which nearly 120,000 bitcoin were transferred to a cryptocurrency wallet in Lichtenstein’s control.\n\n“Lichtenstein then took steps to cover his tracks” and enlisted his wife’s help in laundering the funds, prosecutors said.\n\nSince their arrest, the details of their lives have become something of a New York media sensation. The couple were known to walk their Bengal cat, Clarissa, on a leash in Manhattan.\n\nMorgan, who raps about being “the crocodile of Wall Street” as her online music persona, has a Twitter bio that reads: “I make the weird kids feel at home,” and describes herself as a “tech entrepreneur, surrealist artist, rapper, prolific writer, & fashion designer with synesthesia.”\n\nLichtenstein, who emigrated from Russia, will remain in jail while awaiting sentencing. Morgan will remain under house arrest.\n\nLichtenstein entered into a cooperation agreement with the government, agreeing to testify and meet with law enforcement when requested, outside the presence of his attorney.\n\nLichtenstein pleaded guilty to conspiracy to commit money laundering, which carries a maximum sentence of 20 years in prison, according to a press release from the Justice Department. Morgan pleaded guilty to one count of money laundering conspiracy and one count of conspiracy to defraud the United States, each of which carries a maximum sentence of five years in prison.\n\nIf government prosecutors find that their cooperation has been sufficiently helpful, however, they can ask the judge for a sentence below those guidelines."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYXdzLmFtYXpvbi5jb20vYmxvZ3MvZGF0YWJhc2UvaW50cm9kdWNpbmctYW1hem9uLW1hbmFnZWQtYmxvY2tjaGFpbi1hY2Nlc3MtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Introducing Amazon Managed Blockchain Access Bitcoin - AWS Blog",
        "content": "Builders in the blockchain space are often burdened with the undifferentiated heavy lifting involved in managing a resilient fleet of blockchain node clients to access one or more public blockchains. Configuring, provisioning, and maintaining a multitude of public blockchain nodes can be prohibitively resource intensive, both in infrastructure costs and in the human hours required to operate these nodes in a highly available, resilient, and performant manner. In a resource-constrained environment, it’s increasingly important for Amazon Web Services (AWS) customers to optimize costs and resource expenditures wherever possible. This has driven interest in serverless, API-based access patterns for public blockchains that offer a pay-as-you-go model rather than dedicated nodes that have higher single-organization costs regardless of usage.\n\nIn response to this prevalent challenge and to customer demand, Amazon Managed Blockchain has expanded its fully managed blockchain infrastructure service, Amazon Managed Blockchain (AMB) Access, to support access to the Bitcoin network (mainnet and testnet). Through Amazon Managed Blockchain Access Bitcoin, developers will be able to work with Bitcoin JSON-RPC APIs through easily accessible endpoints that offer predictable pay-as-you-go pricing to build a variety of applications that interact with the Bitcoin network. AMB Access Bitcoin features a fleet of non-mining Bitcoin Core nodes serve JSON-RPC requests in a highly available and reliable way. For use cases that need highly available access to Bitcoin JSON-RPC APIs without requiring a local, dedicated Bitcoin node, or use cases that necessitate intermittent access to the Bitcoin network, AMB Access Bitcoin is an ideal choice.\n\nIn this post, we provide an overview of the new AMB Access Bitcoin offering, its key features and benefits, and several examples of how the service can be used. You can find more details and resources about how to get started building on Bitcoin in the Amazon Managed Blockchain Access Bitcoin developer guide.\n\nNOTE: The Bitcoin Core nodes operated by AWS are not mining nodes, meaning they are not participating in Bitcoin mining through proof-of-work.\n\nAMB Access Bitcoin – Key Features\n\nThere are a variety of features that support builders in developing applications to interact with the Bitcoin blockchain with the Bitcoin offering on Amazon Managed Blockchain Access. Among these, there are three key features that highlight the core value of the service.\n\nBuild on Bitcoin without managing node infrastructure\n\nOne of the key features of using AMB Access Bitcoin is that it lowers the barrier to entry for developers to build on Bitcoin. Without provisioning any infrastructure, managing configuration, or waiting for node synchronization, developers can instantaneously interact with the Bitcoin mainnet or testnet using the AWS-provided endpoints in supported AWS Regions. By relying on underlying Bitcoin node infrastructure managed by AWS, you can focus on the use-case specific aspects of your project rather than provisioning and maintaining Bitcoin nodes.\n\nAMB Access Bitcoin offers mainnet and testnet endpoints that load balance requests against a fleet of Bitcoin Core full nodes (non-mining) under the hood. These nodes are used to handle JSON remote procedure call (RPC) requests made to the Amazon Managed Blockchain Access endpoints, and support most of the JSON-RPC APIs available in Bitcoin Core. You can review a full list of supported JSON-RPC APIs in the Amazon Managed Blockchain Access Bitcoin developer guide.\n\nPredictable pricing and lower total cost of ownership\n\nMost commonly, Bitcoin Core node clients used in applications run as a full node, which is a configuration that dictates that the node client software maintain a full copy of the Bitcoin blockchain ledger. As such, this node client requires consistent internet connectivity capable of handling several hundred gigabytes (GB) of upload traffic per month, as well as expandable storage to accommodate the approximately 500 GB size of the Bitcoin ledger and its growth of around 16–22 GB per month. Ideally, a Bitcoin full node should run continuously—24 hours a day, 7 days a week—to continue to sync with the rest of the network. In a situation where a single node isn’t sufficient to serve requests to read data from Bitcoin or submit transactions, as is increasingly common for most applications scaling for mainstream user traffic, you might choose to operate several nodes. In this scenario, the costs associated with running a Bitcoin node are multiplied by the number of nodes in the fleet. Furthermore, the human hours required to configure, provision, and maintain these nodes add to the cost. For example, production-grade fleet of Bitcoin nodes running on Amazon Elastic Compute Cloud (Amazon EC2) instances with the necessary load balancing, storage, and authorization/authentication infrastructure could cost between $1000 and $1500 per month to operate. This cost also grows with compute demands for complex RPC requests, data transfer costs to interact with the nodes, and expanding storage requirements.\n\nWith AMB Access Bitcoin, you can build on Bitcoin without managing your own nodes for a fraction of the cost. You can remove the fixed costs associated with maintaining one or more Bitcoin Core node clients and simply access Bitcoin JSON-RPC APIs on demand, only paying for actual usage. With transparent pricing for each JSON-RPC API, you can easily predict what your workload will cost to operate while reducing the total cost of ownership for an application that must access the Bitcoin mainnet or testnet. For example, an application that makes 10 million getblock (verbosity =1) calls, 1 million getblockstats calls, creates and broadcasts 10 thousand transactions in a month would cost approximately $176 based on API pricing.\n\nReliable and highly available Bitcoin APIs\n\nWith a fleet of Bitcoin Core full nodes serving JSON-RPC request traffic in each supported Region, AMB Access Bitcoin offers the same reliability and high availability you rely on with other AWS managed services. Rather than relying on a single provisioned node that may not scale with your needs, you can make requests against a horizontally scalable fleet of Bitcoin nodes that are monitored and replaced if unhealthy. Furthermore, you no longer have to guess if the nodes will be able to handle your JSON-RPC request volume at sub-second latency, as the JSON-RPC APIs used by AMB Access Bitcoin scale with your needs. AMB Access Bitcoin is also highly available. With Bitcoin endpoints available in multiple Regions and individual nodes in each region deployed across Availability Zones, you can expect 99.9 percent availability from the service.\n\nWhether you’re building a proof-of-concept or a high-scale production workload, AMB Access Bitcoin can support your Bitcoin JSON-RPC request traffic.\n\nAMB Access Bitcoin use cases\n\nThere are a variety of use cases that require Bitcoin network access, which can be achieved with the AMB Access Bitcoin offering. A few of these use cases are listed below.\n\nBitcoin Spot ETF management\n\nEstablished financial services institutions have continued to apply for approval of a Bitcoin (BTC) spot exchange-traded fund (ETF) to offer a Bitcoin investment product to retail and institutional investors that enable them to gain exposure to digital assets without directly owning the underlying assets. The implementation and management of a spot Bitcoin ETF, a product that offers Bitcoin investment at its present cash cost rather than its presumed future value, would require consistent access to the Bitcoin mainnet to broadcast transactions that move actual Bitcoin on the network, verify historical transactions, and more.\n\nDigital asset exchanges\n\nRetail investors who wish to gain access to Bitcoin as an investment or medium of exchange turn to cryptocurrency exchanges to purchase Bitcoin with fiat currency (for example, USD, CAD, GBP, or EUR). Cryptocurrency exchanges rely on large fleets of public blockchain nodes to service their customers’ transaction volume, track asset balances, and perform data analytics across multiple different blockchains, but not every exchange wants to manage its own nodes for every blockchain and cryptocurrency it supports. AMB Access Bitcoin offers a mechanism for exchanges to facilitate Bitcoin transactions, read data from the Bitcoin network, and more without provisioning or managing nodes on their own. Exchanges also offer custody, or the management of a digital asset wallet on behalf of a customer, which also necessitates the use of public blockchain nodes.\n\nDigital asset custody\n\nThe development of digital asset custody services that help secure Bitcoin on behalf of users, such as Coinbase Custody, Fireblocks, and BitGo, require direct access to the Bitcoin blockchain through nodes in order to send transactions on behalf of users, verify deposits of Bitcoin, read information related to historical or pending transactions, and more. With AMB Access Bitcoin, custody services can reduce their infrastructure footprint by performing Bitcoin JSON-RPC operations through the on-demand APIs rather than managing several Bitcoin core full node clients.\n\nBorrowing and lending on DeFi applications\n\nFor holders of Bitcoin, it’s possible to trustlessly lend or borrow funds through decentralized finance (DeFi) applications that run on other public blockchains such as Ethereum. Bitcoin can be wrapped by sending units of Bitcoin on the Bitcoin network to be held effectively in escrow by a custodian and then minting (creating) the equivalent units on another blockchain to be exchanged or used as collateral in DeFi applications. For example, wrapped Bitcoin (WBTC) can be deposited into a liquidity pool for a lending protocol like Aave to earn yield (interest) as a reward for supplying liquidity used for borrowing on the platform. Upstream, these WBTC custodians must be able to verify signed messages and Bitcoin transactions and facilitate Bitcoin transactions on behalf of users during unwrapping events, that is, where the WBTC is destroyed on Ethereum and withdrawn back to native Bitcoin. This action requires access to the Bitcoin JSON-RPC API, making AMB Access Bitcoin a compelling option. In addition, Amazon Managed Blockchain Access also offers fully managed, dedicated Ethereum full nodes, which would allow customers to similarly verify the balance of WBTC on the Ethereum network as it’s minted and to interact with the aforementioned DeFi applications. With Amazon Managed Blockchain Access Bitcoin and Ethereum, you can create a single application service that connects to both Bitcoin and Ethereum, reducing architectural complexity for cross-chain applications.\n\nConclusion\n\nWith the release of the new Amazon Managed Blockchain Access Bitcoin, you can quickly and reliably develop powerful applications that rely on the Bitcoin blockchain and do so at a lower cost. Interested in diving deeper into the technical aspects of the AMB Access Bitcoin offering? Stay tuned for a follow-up blog post that provides more technical detail, sample code and insight into how to integrate AMB Access Bitcoin into your application! If you are interested in building with public blockchain data, check out Retrieve Bitcoin and Ethereum Public Blockchain Data with Amazon Managed Blockchain Query, which details AWS’ new blockchain data service that provides developer-friendly REST APIs to access data from multiple public blockchains.\n\nAbout the authors\n\nForrest Colyer manages the Web3/Blockchain Specialist Solutions Architecture team that supports the Amazon Managed Blockchain (AMB) service. Forrest and his team support customers at every stage of their adoption journey, from proof of concept to production, providing deep technical expertise and strategic guidance to help bring blockchain workloads to life. Through his experience with private blockchain solutions led by consortia and public blockchain use cases like NFTs and DeFi, Forrest helps enable customers to identify and implement high-impact blockchain solutions.\n\nWilliam R. Tolbert IV is a Solutions Architect based in Austin, Texas (AUS16). He is a New York native and United States Air Force veteran, with over 3 years of experience in the cloud space. Currently, William is active in the Blockchain Aspiring Area of Depth TFC. William prides himself on introducing customers to the Amazon Managed Blockchain service and providing value in the cloud."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOC8wMy9taWNoYWVsLXNheWxvLXNheXMtYml0Y29pbi1ldGZzLXdpbGwtYmUtdGhlLXN1cGVyLXRhbmtlci1mb3ItaGlzLW1pY3Jvc3RyYXRlZ3ktc3BvcnRzLWNhci_SAYsBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDgvMDMvbWljaGFlbC1zYXlsby1zYXlzLWJpdGNvaW4tZXRmcy13aWxsLWJlLXRoZS1zdXBlci10YW5rZXItZm9yLWhpcy1taWNyb3N0cmF0ZWd5LXNwb3J0cy1jYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Michael Saylor Says Bitcoin ETFs Will Be the ‘Super Tanker’ for His MicroStrategy ‘Sports Car’ - CoinDesk",
        "content": "Michael Saylor Says Bitcoin ETFs Will Be the ‘Super Tanker’ for His MicroStrategy ‘Sports Car’\n\nThe software company now owns around $4.5 billion worth of bitcoin and is planning to buy more in the third quarter of this year.\n\nBy Helene Braun Aug 3, 2023 at 4:06 p.m. UTC"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvd2hpc3RsZWJsb3dlci1lZHdhcmQtc25vd2Rlbi10by1oZWFkbGluZS10aGUtYml0Y29pbi1hbXN0ZXJkYW0tY29uZmVyZW5jZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Whistleblower Edward Snowden to Headline the Bitcoin Amsterdam Conference - Nasdaq",
        "content": "The Bitcoin Amsterdam Conference is thrilled to welcome renowned whistleblower and cybersecurity expert, Edward Snowden, to its landmark event, where he will share his insights on the intersection of digital currency, privacy, and the future of financial freedom during a 45 minute long online talk with a Q&A session.\n\nThe event will take place in Westergas, Amsterdam on October 12-13, 2023 and will bring together industry leaders, enthusiasts, and experts to discuss the future of bitcoin, decentralization and freedom.\n\n\n\n\n\n“In 2013, Ed Snowden alerted the American people to the fact that the US Government was knowingly conducting warrantless surveillance of its own citizens; a violation of basic rights. It was a watershed moment both for government overreach, as well as for the ability of individual freedom fighters and cypherpunks to push back. As Snowden announced to the world at Bitcoin 2019, Bitcoin was a key tool in his efforts to expose the ongoing surveillance,” said Brandon Green, Head of Events for BTC Inc. “10 years after his initial action, Snowden will talk to our community at Bitcoin Amsterdam about the ongoing fight to protect privacy for individuals, not just in the US, but around the world, and especially right here in Europe. And he will discuss the importance of Bitcoin in that fight,” continued Green.\n\nAs a prominent advocate for cybersecurity and freedom, Edward Snowden has long expressed his support for Bitcoin, stating \"Bitcoin is free money... When I think about liberty, that’s what this is all about. It’s freedom from permission.\"\n\nHe views it as an essential tool for preserving financial privacy and protecting individuals from surveillance and censorship. Snowden's endorsement of Bitcoin aligns with its core principles of decentralization, transparency, and financial sovereignty, making his appearance at the Bitcoin Amsterdam Conference highly anticipated.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzA4LzAzL25ldy15b3JrLW1hbi1hZG1pdHMtYmVpbmctb3JpZ2luYWwtYml0ZmluZXgtaGFja2VyLWR1cmluZy1ndWlsdHktcGxlYS1pbi1kYy10by1iaXRjb2luLW1vbmV5LWxhdW5kZXJpbmcuaHRtbNIBkAFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOC8wMy9uZXcteW9yay1tYW4tYWRtaXRzLWJlaW5nLW9yaWdpbmFsLWJpdGZpbmV4LWhhY2tlci1kdXJpbmctZ3VpbHR5LXBsZWEtaW4tZGMtdG8tYml0Y29pbi1tb25leS1sYXVuZGVyaW5nLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin launderer pleads guilty, admits to massive Bitfinex hack - CNBC",
        "content": "watch now\n\nA New York man on Thursday admitted to being the original hacker of bitcoin in the 2016 cyberattack on Bitfinex, a theft that ended up being worth $4.5 billion. Ilya \"Dutch\" Lichtenstein, 35, made that bombshell admission while pleading guilty to laundering the stolen bitcoin in Washington, D.C., federal court. The plea came before his wife, 33-year-old Heather Rhiannon Morgan, who was in the audience, stepped up to enter her own guilty plea to two charges, money laundering conspiracy and conspiracy to defraud the United States government. Until Thursday's admission in court by Lichtenstein, it was not publicly known who had hacked the bitcoin from the cryptocurrency exchange Bitfinex. The couple was not charged in the hack itself.\n\nBooking photos for Heather Morgan and Ilya Lichtenstein. Courtesy: Alexandria Adult Detention Center.\n\nLichtenstein faces a maximum possible sentence of 20 years in prison for one count of conspiracy to commit money laundering. The Russian emigre, has been held without bond since his arrest after a judge ruled he is a flight risk, will remain jailed until his sentencing, and has agreed to cooperate with federal investigators. Morgan, an aspiring rapper known as \"Razzlekhan\" and \"The Crocodile of Wall Street,\" faces a maximum possible sentence of five years in prison. She was in the courtroom for her husband's plea hearing. Morgan has been free on $3 million bond since her arrest. Lichtenstein smiled at her and blew her a kiss during their moment of eye contact, the first time they had seen each other in more than a year.\n\nCourtroom sketch of Ilya \"Dutch\" Lichtenstein while pleading guilty to laundering the stolen bitcoin in Washington, D.C., federal court. Artist: William Hennessey\n\nWhen they were arrested in February 2022, the Department of Justice said officials had seized more than 94,000 bitcoin of the more than 119,000 hacked bitcoin. The seized cryptocurrency at the time was worth about $3.6 billion, making it the largest seizure in DOJ history. \"Since their arrests, the government has seized another approximately $475 million tied to the hack,\" the DOJ said in a press statement Thursday. Bitfinex in a statement said, \"Following the August 2016 hack, Bitfinex engaged in unprecedented efforts to make its customers whole.\" \"Bitfinex also diligently worked with the U.S. Department of Justice to identify the perpetrators of the hack, recover the stolen bitcoin, and bring the hackers to justice,\" the company said. \"After seven years, those efforts have come to fruition.\" When the bitcoin was stolen, it was worth just $70 million. But its value soared over the years to $4.5 billion. In its statement Thursday, the DOJ said, \"Lichtenstein used a number of advanced hacking tools and techniques to gain access to Bitfinex's network.\" \"Once inside their systems, Lichtenstein fraudulently authorized more than 2,000 transactions in which 119,754 bitcoin was transferred from Bitfinex to a cryptocurrency wallet in Lichtenstein's control,\" the DOJ said.\n\nHeather Rhiannon Morgan, who was in the audience, stepped up to enter her own guilty plea hearing in the case. Artist: William Hennessey\n\n\"Lichtenstein then took steps to cover his tracks by going back into Bitfinex's network and deleting access credentials and other log files that may have given him away to law enforcement\" the DOJ said. \"Following the hack, Lichtenstein enlisted the help of his wife, Morgan, in laundering the stolen funds.\" When the couple was arrested in early 2022, the department said about \"25,000 of those stolen bitcoin were transferred out of Lichtenstein's wallet via a complicated money laundering process that ended with some of the stolen funds being deposited into financial accounts controlled by Lichtenstein and Morgan.\"\n\nHeather Rhiannon Morgan, who was in the audience, stepped up to enter her own guilty plea hearing in the case. Artist: William Hennessey\n\nDuring Lichtenstein's plea hearing, it was revealed that he had converted some assets to gold coins, and that Morgan had buried gold coins at a location now known to law enforcement officials. And it also was revealed that Lichtenstein's past travel to Ukraine and Kazakhstan was done to convert digital assets to cash through Russian and Ukrainian middlemen. That cash was then shipped to addresses in Russia and Ukraine, where Lichtenstein picked it up physically and deposited it into U.S. accounts so he could retrieve it while in New York City. The Crypto Couple's separate plea hearings were moved up from their originally scheduled times Thursday due to arraignment later in the afternoon at the same courthouse of Donald Trump. The former president was charged Thursday in that case with crimes related to an effort to overturn his 2020 election loss. A charging document filed last month against the couple says that in early 2107 Lichtenstein \"began to move a portion of the bitcoin\" stolen in the hack \"in a series of small, complex transactions across multiple accounts and platforms.\"\n\nCourtroom sketch of Ilya \"Dutch\" Lichtenstein while pleading guilty to laundering the stolen bitcoin in Washington, D.C., federal court. Artist: William Hennessey"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wOC8wMy9iaXRjb2luLWhlaXN0LXRpZWQtdG8tYml0ZmluZXgtaGFjay1jYXNlLXNlZXMtZ3VpbHR5LXBsZWEv0gFdaHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzA4LzAzL2JpdGNvaW4taGVpc3QtdGllZC10by1iaXRmaW5leC1oYWNrLWNhc2Utc2Vlcy1ndWlsdHktcGxlYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "‘Crocodile of Wall Street’ spouse pleads guilty in Bitcoin heist tied to Bitfinex hack - Fortune",
        "content": "One of the most enduring mysteries in the world of cryptocurrencies was resolved Thursday when Ilya Lichtenstein acknowledged that he was the hacker who executed the 2016 attack on the Bitfinex exchange.\n\nLichtenstein, along with his social-media rapper wife, who dubbed herself the “Crocodile of Wall Street,” pleaded guilty to a money-laundering conspiracy tied to the theft of billions of dollars of Bitcoin from the exchange. Who executed the exploit has been the biggest guessing games in crypto after the identity of Bitcoin’s pseudonymous creator, Satoshi Nakamoto.\n\nLichtenstein, 35, admitted during a hearing on Thursday before US District Judge Colleen Kollar-Kotelly that he orchestrated the hack, which took 119,756 Bitcoin from Bitfinex. He faces as long as 20 years in prison.\n\nLichtenstein and Heather Morgan entered their pleas as part of cooperation agreements with prosecutors. The government had charged them with conspiring to launder those stolen Bitcoin. The couple was arrested in February 2022 in New York, but they were not accused of doing the actual hacking at the time. A detailed report published along with the arrest showed how they were able to move the stolen funds after the hack.\n\nMorgan, who also called herself “Razzlekhan, said her husband didn’t make her aware of the hack until early 2020, initially thinking that his funds might have come from drugs or tax avoidance. Morgan, 33, developed a social media presence by rapping about investment strategies, calling herself a risk-loving moneymaker who was “sly as a gator.”\n\nThe pleas come as part of a deal the couple struck with the government following several delays they requested since their arrest last year. As part of the arrangement, both agreed to forfeit almost $73 million combined. Morgan, who also pleaded guilty to conspiring to defraud the US government, could face a maximum of five years in prison for the two counts.\n\nBitfinex is the crypto exchange affiliated with the world’s largest stablecoin, USDT. At the time of the hack, the value of the stolen funds was estimated at about $71 million.\n\nBurying Gold Coins\n\nDuring the hearing, the government outlined details of how Lichtenstein conducted the hack and later enlisted Morgan to help hide the source of the illicit funds. For example, Morgan admitted to burying gold coins that Lichtenstein had converted from stolen funds, setting up fictitious accounts and holding some of the illegal proceeds in her own legitimate accounts.\n\n“I did help him launder funds at his direction,” Morgan said.\n\nMorgan also said her husband kept her in the dark about some of his activities, including subsequent hacks. “I was not aware of any of these other hacks until his arrest,” she said. When the pair traveled to Kazakhstan and Ukraine, Morgan said she thought the purpose was for tourism. “I recall him burning documents at a trash can in Kazakhstan,” she said, noting that he acted “evasive” when she questioned him.\n\nProsecutors alleged the two used fake identities to create online accounts and covered up the trail of transactions by depositing and withdrawing the stolen funds from virtual currency exchanges and darknet markets. Some of the money went to purchase nonfungible tokens, or NFTs, gold and Walmart gift cards, the government said.\n\nWhen Bitfinex was hacked, Bitcoin was trading under $1,000. It had skyrocketed to $44,000 by the time the couple was arrested in early 2022, pushing up the value of the stolen assets to $4.5 billion, of which $3.6 billion was recovered by authorities. Since then, the cryptocurrency has fallen to around $29,000.\n\nRead More: ‘Crocodile of Wall Street’ Arrested in $4.5 Billion Crypto Crime\n\nThe case is US v. Lichtenstein, 23-cr-00239, US District Court, District of Columbia (Washington, DC)"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyMy8wOC8wNC9iaXRmaW5leC1oYWNrLWd1aWx0eS1wbGVhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "'Bitcoin Bonnie and Clyde' plead guilty in 'spy novel'-like laundering case - The Washington Post",
        "content": "Shockwaves rippled through the cryptocurrency world in the summer of 2016 when 119,754 bitcoin, worth around $71 million at the time, disappeared from the digital coffers of the Hong Kong-based exchange Bitfinex through thousands of unauthorized transactions. Over the next half-decade, that crypto cache exploded in value, reaching the billions — yet the identity of the mastermind behind one of the largest heists in crypto history remained a mystery.\n\nThat is until Thursday, when tech entrepreneur Ilya “Dutch” Lichtenstein admitted in federal court to hacking Bitfinex seven years ago. He and his wife, Heather Morgan, a marketing expert who moonlights as a rapper, were arrested last year on money laundering charges. Dubbed “Bitcoin Bonnie and Clyde,” the couple was accused of trying to launder a fraction of the stolen bitcoin — 25,000 to be exact. The rest — worth approximately $3.6 billion — remained in a digital wallet that federal authorities eventually gained access to, leading to the largest single seizure of funds in Justice Department history.\n\nStill, neither Lichtenstein nor Morgan had been implicated in the hack itself — until Lichtenstein delivered the bombshell revelation in the same Washington courthouse where former president Donald Trump would be indicted hours later.\n\nAdvertisement\n\nOn Thursday, Lichtenstein pleaded guilty to conspiracy to commit money laundering and now faces up to 20 years in prison. His wife entered a guilty plea to one count of money laundering conspiracy and one count of conspiracy to defraud the United States, each of which carries a maximum penalty of five years in prison.\n\nAttorneys for Lichtenstein and Morgan didn’t immediately respond to requests for comment from The Washington Post. A sentencing date still hasn’t been scheduled.\n\nDeputy Attorney General Lisa Monaco announced the “largest seizure of cryptocurrency ever” on Feb. 8, charging a New York couple with laundering the proceeds. (Video: Reuters)\n\nWhen the Department of Justice announced the arrests in February 2022, the internet became enthralled by Lichtenstein and Morgan, not merely because of the case’s bizarre twists and complexities but also because of Morgan’s expansive and quirky social media footprint.\n\nLichtenstein was the more low-key figure in the husband-and-wife duo — a dual citizen of Russia and the United States who grew up in a Midwest suburb and whose high school friend described him as “introverted but really tech-savvy.” Morgan, however, showcased two somewhat distinct personas across her numerous social media profiles: one as an ambitious business executive and writer, and another as the self-proclaimed “Crocodile of Wall Street,” a surrealist rapper with “more pizazz” than Genghis Khan.\n\nFollowing their arrests, the songs Morgan released under her artistic name “Razzlekhan,” which she described as “horror-comedy, with a splash of weird allure,” were dissected across Twitter. Her videos — including one of Morgan marveling at the size of her plate of pancakes and another of her strutting down the streets of Manhattan in a shiny gold jacket — were broadly shared. The reactions they elicited ranged from mocking to incredulity — and many were left flabbergasted at the prospect of such unorthodox characters pulling off a complex scheme investigators said required a “sophisticated laundering technique.”\n\nAdvertisement\n\nCourt documents describe how Lichtenstein on Aug. 2, 2016, employed a slew of advanced hacking tools and techniques to purloin 119,754 bitcoin, or more than half of Bitfinex’s inventory at the time, in under four hours. According to prosecutors, Lichtenstein transferred the coins to a cryptocurrency wallet under his control through more than 2,000 transactions and then covered his tracks by deleting the access credentials in Bitfinex’s network.\n\nWhat happened next was the financial equivalent of stealing a pumpkin and having it suddenly turn into a magical horse carriage. At the time of the hack, bitcoin’s value hovered around $600 — but the price skyrocketed over the years, reaching a peak of more than $68,000 in 2021. As the money grew, the couple attempted to launder it by funneling the funds into dark-net marketplaces, converting the bitcoin into other forms of cryptocurrency, opening accounts under false names and moving the stolen funds in thousands of small-sum transactions to avoid detection, according to prosecutors.\n\nShare this article Share\n\nA tiny amount of the funds was also spent on non-fungible tokens (NFTs), as well as a Walmart gift card and payments to Uber, Hotels.com and PlayStation, according to a criminal complaint.\n\nAdvertisement\n\nDuring Thursday’s plea hearing, prosecutors said Lichtenstein had used the assets to buy gold coins, which Morgan helped bury in California, Reuters reported. The two also traveled to Ukraine and Kazakhstan to meet with middlemen to convert the bitcoin into cash, which was then shipped to addresses in Russia and Ukraine and subsequently picked up to be deposited into American accounts, prosecutors said.\n\nThe couple’s activities in Ukraine “at times appear pulled from the pages of a spy novel,” prosecutors wrote in a court filing last year — and they “appear to have been setting up a contingency plan for a life in Ukraine and/or Russia prior to the COVID-19 pandemic.”\n\nThose alleged plans, however, came crashing down on Jan. 5, 2022, when federal agents searched the couple’s home in New York City. There, authorities encountered a slew of materials that raised alarms: $40,000 in cash and a “substantial amount” of foreign currency, a set of hollowed-out books and a list of vendors selling fake passports, according to court documents.\n\nAdvertisement\n\nInvestigators also found multiple cellphones — inside a bag labeled “Burner Phone.”\n\nLichtenstein and Morgan were arrested on Feb. 8, 2022. Three days later, Netflix commissioned a series about the couple’s scheme, which is set to be directed by the executive producer of “Tiger King.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2JsYWNrcm9jay1iaXRjb2luLWV0Zi1leHBsYWluZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "BlackRock Bitcoin ETF: How it works, benefits and drawbacks - CCN.com",
        "content": "Key Takeaways\n\nBlackRock is a major global player in investment and advisory services\n\nBlackRock’s entry into the Bitcoin ETF space indicates an opportunity for increasing mainstream adoption of cryptocurrencies worldwide.\n\nThe proposed BlackRock Bitcoin ETF aims to directly track the price of actual Bitcoins, offering investors transparency and accessibility.\n\nThere are potential drawbacks of BlackRock Bitcoin ETF, including regulatory hurdles and uncertainties in approval timelines.\n\nUnderstanding BlackRock And The Bitcoin BlackRock ETF\n\nBlackRock, who manages $8 trillion in assets globally, is a leading global player in investment, advisory, and risk management solutions. BlackRock began the process of introducing a Bitcoin-based ETF on June 15, which gave Bitcoin supporters hope for widespread acceptance. It is anticipated that the SEC will approve it with a high probability.\n\nLarry Fink, the CEO of BlackRock, believes that Bitcoin has the potential to “transcend any one currency” and serve as an international asset providing an alternative to traditional currencies like gold. He has compared Bitcoin to gold, mentioning it as “digitizing gold,” indicating its potential as a hedge against inflation and currency devaluation across different countries.He also goes on record to call the underlying Bitcoin technology “fantastic”.\n\nBlackRock’s Experience In ETFs\n\nIn 2023, BlackRock unveiled the iShares Global Corporate Bond ETF, offering investors a comprehensive mix of global corporate bonds exposure. Simultaneously, they launched the BlackRock U.S. Carbon Transition Readiness ETF, targeting U.S. companies poised to thrive in a low-carbon future. BlackRock has had 575 ETF applications accepted and only 1 rejected back in 2014.\n\nBlackRock holds history as an ETF innovators, introducing a series of 17 ETFs, among which were the first-ever international ETFs granting exposure to Mexico, Canada, and Brazil. Throughout its history, BlackRock has continuously pushed the boundaries of ETF offerings, reaffirming its position as a leading force in the financial industry.\n\nWhat Is BlackRock’s iShares Blockchain And Tech ETF\n\nThe iShares Blockchain and Tech ETF aims to replicate the investment performance of an index consisting of both U.S. and non-U.S. companies engaged in the development, innovation, and utilization of blockchain and cryptocurrency technologies. Such types of ETFs are referred to as spot ETFs.\n\nA spot Bitcoin ETF directly holds and tracks the price of actual Bitcoins. A spot Bitcoin ETF provides investors with exposure to the real-time price movements of Bitcoin in the underlying market. This kind of ETF offers a direct and transparent way for investors to gain exposure to the Bitcoin price without the need to hold or manage actual Bitcoins themselves.\n\nThe credibility behind BlackRock’s experience in ETFs and its position as the world’s largest asset manager, carries significant weight and credibility in the financial industry. The SEC might view BlackRock’s involvement as a sign of maturity and institutional acceptance of cryptocurrencies, which could positively influence the approval decision.\n\nBenefits of BlackRock’s Bitcoin ETF\n\nIf the BlackRock Bitcoin ETF is launched we can expect the following beneficial ripple effects to impact the Bitcoin market:\n\nInstitutional adoption: If BlackRock’s Bitcoin ETF receives approval, it could encourage more institutions to adopt cryptocurrencies, legitimizing the Bitcoin market and providing a secure and regulated entry point for investors.\n\nDiversification opportunity: With the inclusion of Bitcoin alongside other investment assets, the BlackRock Bitcoin ETF could present investors with a chance to diversify their portfolios.\n\nEnhanced market structure: BlackRock’s proposed Bitcoin ETF functions more like a spot ETF, enabling direct purchase and holding of actual Bitcoin, thereby avoiding issues seen in products relying on speculative futures contracts.\n\nMarket stability and transparency: BlackRock’s reputable involvement might alleviate concerns about market manipulation, fostering a transparent and stable Bitcoin trading environment.\n\nReduced complexity for investors: A Bitcoin ETF provides an easier way for traditional investors to invest in Bitcoin without the need for digital wallets or cryptocurrency exchanges, making it more accessible.\n\nPotential price impact: The expectation of BlackRock’s Bitcoin ETF approval has had a positive effect on the market, leading to a swift recovery from recent Bitcoin losses.\n\nPotential Drawbacks Of BlackRock’s Bitcoin ETF\n\nIf the BlackRock Bitcoin ETF is launched we can also anticipate some key potential drawbacks that should be considered such as:\n\nRegulatory hurdles: The SEC’s history of rejecting spot Bitcoin ETF applications, with over 30 rejections, raises concerns as to whether they will accept BlackRocks spot ETF.\n\nWall Street influence: A spot Bitcoin ETF might trigger a Bitcoin bull market, but it could also give traditional finance firms more control over the cryptocurrency space, raising debates among market players and Bitcoin maximalists over the benefits behind BlackRock’s ETF introduction.\n\nImpact on Bitcoin network: A significant portion of actual Bitcoin in financial products like ETFs, even one-third of supply, may potentially harm the network’s decentralized nature and original purpose.\n\nUncertain approval: Optimism surrounds BlackRock’s filing, but experts caution against expecting immediate approval. However, it is uncertain when it will be approved.\n\nHidden costs or risks: While some see BlackRock’s ETF as positive for Bitcoin, others warn of potential hidden costs or risks linked to these financial products, such as manipulation and loss of decentralization.\n\nWill BlackRock’s Bitcoin ETF Get The SEC Approval?\n\nIt is yet known whether BlackRock’s Bitcoin ETF will get the SEC approval. However, the information indicates that the SEC has accepted BlackRock’s application for a spot Bitcoin ETF for review.\n\nWhile there are no guarantees that the SEC will approve, BlackRock’s filing has fueled speculation that permission is more likely due to their credibility in financial markets. It’s important to note that the approval process for ETFs can be lengthy, and the SEC may request additional information or make further evaluations before making a final decision.\n\nBlackRocks Partnership With Coinbase Custody Trust Company\n\nBlackRock collaborates with Coinbase, providing institutional investors access to Bitcoin through Coinbase Custody Trust Company as the custodian. This partnership showcases the increasing interest of traditional financial institutions in the crypto market, offering institutional investors a trusted entry point with BlackRock’s involvement.\n\nWhile the precise start date of their affiliation remains uncertain, it is believed to have commenced in the second quarter of 2022. Coinbase’s role is critical in ensuring market integrity and overseeing potential market manipulation through a “surveillance-sharing” agreement.\n\nDesigned for institutions, Coinbase Prime provides a comprehensive suite of services, including advanced agency trading, custody, prime financing, staking, and infrastructure, along with data and reporting capabilities to support the entire transaction lifecycle.\n\nConclusion\n\nAs we look to the future of Bitcoin, the emergence of ETFs, particularly with BlackRock’s involvement, signals a pivotal moment in the cryptocurrency’s journey. The approval of Bitcoin ETFs may lead to increased institutional adoption, market stability, and enhanced transparency.\n\nAs traditional finance institutions like BlackRock step into the crypto space, they bring credibility and attract more investors. The combination of ETFs and BlackRock’s expertise creates an avenue for broader participation, solidifying Bitcoin’s position as a mature asset class, poised to enter a new phase of growth and acceptance on a global scale.\n\nFAQs\n\nWill BlackRock’s Bitcoin ETF lead to increased institutional adoption of cryptocurrencies?\n\nYes, if approved, the ETF could encourage more institutions to enter the crypto market, legitimizing Bitcoin and attracting more investors.\n\nHow might BlackRock’s ETF benefit investors?\n\nBlackRock’s Bitcoin ETF offers diversification opportunities and a transparent way to invest in Bitcoin without handling actual cryptocurrencies.\n\nWhat are the potential drawbacks of BlackRock’s Bitcoin ETF?\n\nInvestors should be aware of potential drawbacks with BlackRock’s Bitcoin ETF, including, regulatory hurdles, potential impact on the Bitcoin network decentralization, and uncertain ETF approval timelines are some concerns.\n\nHow does BlackRock’s affiliation with Coinbase impact the crypto market?\n\nBlackRock’s collaboration with Coinbase reflects growing institutional interest, enhancing market integrity and oversight of potential market manipulation."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTA0L2JpdGNvaW4tbG9zZXMtbW9qby1hZnRlci1maXJzdC1oYWxmLXJhbGx5LWZhaWxzLXRvLXJlaWduaXRlLWVudGh1c2lhc23SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Mired in Tight Range in Change of Pace for Volatile Cryptocurrency - Bloomberg",
        "content": "Chalk it up to the heat, to late-summer doldrums, or to the phases of the moon, but the usually volatile Bitcoin hasn’t been acting in its typical sporadic ways of late.\n\nThe largest digital currency has gone eight trading sessions without a 1% move, the longest such stretch since the start of January, according to data compiled by Bloomberg. Before that, one has to go back to October 2018 to find such a streak."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmRhdGFjZW50ZXJkeW5hbWljcy5jb20vZW4vbmV3cy9iaXRjb2luLW1pbmVyLWdkYS1vcGVucy10aHJlZS1kYXRhLWNlbnRlcnMtaW4tc291dGgtY2Fyb2xpbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin miner GDA opens three data centers in South Carolina - DatacenterDynamics",
        "content": "Bitcoin mining company Genesis Digital Assets (GDA) has opened three data centers in South Carolina with a total capacity of 33MW.\n\nThe data centers are located in Upstate South Carolina, one near the town of Anderson, and the other two between Union and Lockhart.\n\nThe Anderson facility has been operational since February and has a capacity of 18MW, while the Union/Lockhart facilities launched the following month and have a combined total of 15MW.\n\nThe company used local suppliers and contracts for the facilities, noting in the news release that the Anderson facility is a repurposed textile warehouse and was built using North American-built infrastructure equipment.\n\n95 percent of contractors at the Union/Lockhart facility were South Carolina locals. In total, the three facilities generated 150 jobs.\n\nThe Anderson data center will return excess power to the grid where appropriate, while the Union/Lockhart facilities are located just three miles from two hydroelectric generation plants by Lockhart Power. According to the company, the prevalence of clean energy sources in the state was a motivator for choosing the region.\n\n“The opening of these new data centers is perfectly in line with our commitment to expand our fleet on clean energy resources,” GDA CEO Andrey Kim said. “Our goal is to be industry leaders and show the world that Bitcoin mining can be very ESG-friendly.”\n\nThe opening of three new facilities is part of the company's wider US expansion. The company claims that its portfolio of over 20 data centers accounts for more than two percent of the entire hash rate of the Bitcoin network.\n\nIn total, GDA has more than 400MW of IT capacity."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDMvY3J5cHRvLW1hcmtldHMtdG9kYXktYnRjLWV0aC1hZGEtc29sLW1hdGljLXByaWNlLWFuYWx5c2lzL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDMvY3J5cHRvLW1hcmtldHMtdG9kYXktYnRjLWV0aC1hZGEtc29sLW1hdGljLXByaWNlLWFuYWx5c2lzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Wobbles at $29K as XRP Leads Altcoin Losses; SHIB, Helium Gain - CoinDesk",
        "content": "\"We are certainly close to peak rates, though we could have another hike or two ahead of us depending on how sticky inflation actually is,\" Xu wrote. \"I’m not convinced inflation is falling as fast as many are hoping. In short, we have a long way to go before we enter the optimistic phase of the cycle.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wOC8wMy90ZXRoZXItaXMtZ29pbmctb24tYS1iaXRjb2luLWJ1eWluZy1zcHJlZS1idXQtaXQtc2hvdWxkLWJlLWhvbGRpbmctY2FzaC_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA4LzAzL3RldGhlci1pcy1nb2luZy1vbi1hLWJpdGNvaW4tYnV5aW5nLXNwcmVlLWJ1dC1pdC1zaG91bGQtYmUtaG9sZGluZy1jYXNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Tether Is Going on a Bitcoin Buying Spree, but It Should Be Holding Cash - CoinDesk",
        "content": "Tether Is Going on a Bitcoin Buying Spree, but It Should Be Holding Cash\n\nThe USDT issuer Tether says it holds a lot of U.S. Treasuries and made a lot of money last quarter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDgvMDQvZ2xvYmFsLXgtcmVmaWxlcy1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uLW5hbWluZy1jb2luYmFzZS1hcy1zdXJ2ZWlsbGFuY2Utc2hhcmluZy1wYXJ0bmVyL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDgvMDQvZ2xvYmFsLXgtcmVmaWxlcy1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uLW5hbWluZy1jb2luYmFzZS1hcy1zdXJ2ZWlsbGFuY2Utc2hhcmluZy1wYXJ0bmVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Global X Refiles Spot-Bitcoin ETF Application, Naming Coinbase as ‘Surveillance-Sharing’ Partner - CoinDesk",
        "content": "Several other pending applications, including those on behalf of Fidelity and BlackRock, have also announced surveillance-sharing agreements with the exchange, in response to previous SEC rejections of bitcoin ETF applications which called out the lack of a strong surveillance-sharing agreement as one issue."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzA0L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1yZW1haW5zLWNhbG0tYWJvdmUtMjkxLWstYnV0LWlzLWhpZ2hlci12b2xhdGlsaXR5LWluLWl0cy1mdXR1cmUv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDQvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXJlbWFpbnMtY2FsbS1hYm92ZS0yOTEtay1idXQtaXMtaGlnaGVyLXZvbGF0aWxpdHktaW4taXRzLWZ1dHVyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Remains Calm Above $29.1 K, but Is Higher Volatility in Its Future? - CoinDesk",
        "content": "First Mover Asia: Bitcoin Remains Calm Above $29.1 K, but Is Higher Volatility in Its Future?\n\nPLUS: A decrease in bitcoin supply active a year ago indicates that long-term holders have reduced their bitcoin exposure. Is hodling starting to wane?"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDQvYml0Y29pbi1saXR0bGUtY2hhbmdlZC10aGlzLXdlZWstYXMtYnJvYWRlci1jcnlwdG8tZ2F1Z2VzLXNoZWRzLTE2L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Little Changed This Week as Broader Crypto Gauge Sheds 1.6% - CoinDesk",
        "content": "There don’t appear to be many bearish indications either, which may give a measure of comfort to current holders. On-chain data has given no indication that either BTC or ETH is being moved onto exchanges, which can often precede a bearish move."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzA0L2JpdGNvaW4tbWluZXJzLWFyZS1hZGRpbmctc2lnbmlmaWNhbnQtY2FwYWNpdHktYmVybnN0ZWluL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzA0L2JpdGNvaW4tbWluZXJzLWFyZS1hZGRpbmctc2lnbmlmaWNhbnQtY2FwYWNpdHktYmVybnN0ZWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Largest Crypto Miners Will Benefit Most From Capacity Growth: Bernstein - CoinDesk",
        "content": "Still, if the market sees positive momentum from bitcoin exchange-traded-fund (ETF) approvals and increased institutional participation, that would give miners enough “margin room” for the 2024 halving, the note said, adding that the “lower the cost of production, better the miner positioning for the bitcoin halving impact.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOC8wMy9tYXJhdGhvbi1kaWdpdGFsLXNvbGlkaWZpZXMtcG9zaXRpb24tYXMtd29ybGRzLWxhcmdlc3QtcHVibGljbHktdHJhZGVkLWJpdGNvaW4tbWluZXIv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzAzL21hcmF0aG9uLWRpZ2l0YWwtc29saWRpZmllcy1wb3NpdGlvbi1hcy13b3JsZHMtbGFyZ2VzdC1wdWJsaWNseS10cmFkZWQtYml0Y29pbi1taW5lci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Marathon Digital Solidifies Position as World's Largest Publicly Traded Bitcoin Miner - CoinDesk",
        "content": "Other bitcoin miners are also racing to plug in the newest machines in advance of the bitcoin halving, an event coded into bitcoin's fundamentals in which the rewards that miners get for successfully mining a bitcoin block are cut in half. The next halving is estimated to occur some time in April 2024."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDQvY21lLWNyeXB0by1vcHRpb25zLXRyYWRpbmctdm9sdW1lLXJvc2UtdG8tOTQwbS1pbi1qdWx5LWNjZGF0YS_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzA0L2NtZS1jcnlwdG8tb3B0aW9ucy10cmFkaW5nLXZvbHVtZS1yb3NlLXRvLTk0MG0taW4tanVseS1jY2RhdGEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Crypto Options Volume on CME Rose to Nearly $1B in July: CCData - CoinDesk",
        "content": "Bitcoin and ether each fell by 4% in July as optimism from the potential launch of a bitcoin-spot exchange-traded fund faded and regulatory uncertainty and decentralized-finance hacks roiled sentiment. Bitcoin traded alongside stocks and gold a little more than it did in the second half of June, warranting the use of options to hedge directional exposure in the crypto market."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOC8wNC9wcm9zaGFyZXMtZmlsZXMtYXBwbGljYXRpb24td2l0aC1zZWMtZm9yLWJpdGNvaW4tYW5kLWV0aGVyLWVxdWFsLXdlaWdodC1ldGYv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA4LzA0L3Byb3NoYXJlcy1maWxlcy1hcHBsaWNhdGlvbi13aXRoLXNlYy1mb3ItYml0Y29pbi1hbmQtZXRoZXItZXF1YWwtd2VpZ2h0LWV0Zi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "ProShares, Bitwise File for Bitcoin and Ether ETFs - CoinDesk",
        "content": "Rosie Perper was the Deputy Managing Editor for Web3 and Learn, focusing on the metaverse, NFTs, DAOs and emerging technology like VR/AR. She has previously worked across breaking news, global finance, tech, culture and business. She holds a small amount of BTC and ETH and several NFTs. Subscribe to her weekly newsletter, The Airdrop."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctd2lsbC1iaXRjb2luLWhhbHZpbmctYWZmZWN0LWJ0Yy1wcmljZS1hbmQtaXMtZGVmaS1kZWFk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "How will Bitcoin halving affect BTC price, and is DeFi dead? - Cointelegraph",
        "content": "On the latest episode of Market Talks, host Ray Salmond spoke with Blockware Solutions account executive David Gamble about the future of Bitcoin (BTC) mining, expectations for the cryptocurrency’s price, and his views on how the decentralized finance (DeFi) sector needs to evolve.\n\nGamble described himself as a staunch believer in DeFi, but he added that protocols within the industry need to find ways to incorporate tokenized real-world assets instead of relying on mercenary capital and the attraction of liquid staking. According to Gamble, the steady entry of institutional investors and even central bankers experimenting with tokenized bonds and other yield-bearing assets could be a step in the right direction.\n\nThe best time to buy Bitcoin is now\n\nBitcoin’s block reward halving is less than 300 days away, and many investors expect that BTC’s price will go on a parabolic run — though this outcome is not guaranteed. The halving tends to introduce an extra dose of volatility to Bitcoin’s price and can temporarily result in challenging times for Bitcoin miners. When asked about “the best time to buy Bitcoin,” Gamble said he believes investors should be trying to buy it whenever they can. According to Gamble, the crypto sector is heading toward a $10 trillion market capitalization in the next few years, and if such a milestone is achieved, Bitcoin and other cryptocurrencies are likely to see their value significantly increase.\n\nGamble explained that some of the liquidity and equipment acquisition problems that plagued the sector and Bitcoin miners in previous market cycles have been resolved by ASIC marketplaces that connect buyers to sellers. These marketplaces help miners acquire gear and spin up operations faster than ever before, and if a miner becomes financially distressed, it is also easier to offload equipment to raise liquidity.\n\nBasically, the presence of better infrastructure, participants’ more mature approach to the crypto market, and the presence of institutional investors are clear fundamentals on which investors can build an investment thesis, according to Gamble.\n\nRelated: Was Sam Bankman-Fried behind a scam project?\n\nTo hear more of Gamble’s thoughts on the future of the Bitcoin mining space, BTC price and the impact of the upcoming halving, tune in to the latest episode of Market Talks.\n\nMarket Talks airs every Thursday, featuring interviews with some of the most influential and inspiring people from the crypto and blockchain industry. So, head over to the Cointelegraph Markets & Research YouTube page, and smash those “Like” and “Subscribe” buttons for all future videos and updates."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZmludGVjaC9rcG1nLXJlcG9ydC1zYXlzLWJpdGNvaW4taGFzLXBvc2l0aXZlLWVzZy1pbXBhY3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin's energy consumption is on par with tumble dryers globally, says KPMG - DLNews",
        "content": "A KPMG report says Bitcoin is a net positive for ESG goals.\n\nThe report argues that Bitcoin mining can help subsidise the cost of renewable energy.\n\nKPMG's Canadian arm previously invested in Bitcoin and Ethereum in 2022.\n\nThe report found that Bitcoin uses about the same amount of electricity as tumble dryers globally.\n\nMajor accounting firm KPMG has released a report highlighting several ways Bitcoin has a positive impact on environmental, social, and governance criteria.\n\nOften shortened to ESG, these criteria are commonly used by socially conscious investors to judge a company’s ethical and sustainable practices.\n\nThe report, co-authored by KPMG principal of technology risk Brian Consolvo and director of ESG Kirk Caron, refutes notions that Bitcoin has a mostly negative environmental and societal impact because of its high energy use and popularity among cybercriminals.\n\nBitcoin is ‘widely misunderstood’\n\n“Despite Bitcoin’s increased adoption, it continues to often be a misunderstood technology and asset class,” the report said.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\n“This is a phenomenal endorsement,” Daniel Batten, an ESG analyst and co-founder of CH4 Capital, a fund that specialises in methane mitigation technologies, told DL News. “KPMG has done an outstanding job researching the nuances, because these conclusions, while true, are not obvious at first glance.”\n\nAccording to report co-authors Consolvo and Caron, Bitcoin mining — the process of using powerful computers to solve the complex equations needed to validate transactions on the network — can help incentivise clean energy production, bolster financial inclusion, and even reduce greenhouse gas emissions from industrial activities.\n\nStill, there’s no denying that Bitcoin uses a lot of energy.\n\nA common comparison is that the top crypto asset uses as much energy as a medium-sized country such as Norway annually, per data from the Cambridge Centre for Alternative Finance.\n\nJoin the community to get our latest stories and updates\n\nA different perspective\n\nBut Consolvo and Caron see the energy use from a different perspective. Using the same data, they highlight that Bitcoin uses about the same amount of electricity as tumble dryers globally.\n\n“Bitcoin miners can be a useful ally in the transition to more renewable energy sources and reduce emissions, despite its significant energy consumption,” the report said.\n\nThey also say those criticising Bitcoin’s energy use do so under the assumption that all industries should attempt to achieve net zero emissions.\n\nInstead, the report states, “it’s helpful to compare the emissions associated with Bitcoin’s operations with the emissions of a wide range of industries and services.”\n\nKPMG CO2 emissions from tourism, fashion and air conditioning dwarf those of Bitcoin. (KPMG)\n\nThe KPMG report focuses on four key areas in which Bitcoin mining can support environmental goals. It argues that mining can help subsidise the cost of renewable energy, balance electricity grids through demand response, heat buildings through recycled heat from mining rigs, and incentivise methane reduction.\n\nMethane in particular is one of the biggest contributors to climate change, and according to the US Environmental Protection Agency, is 25 times more potent as a greenhouse gas than carbon dioxide. It is emitted from many sources, such as coal mining, oil drilling and landfills.\n\nOverstated societal impacts\n\nFlaring — or burning — the gas breaks it down into carbon dioxide and water, and of course, releases energy. The report argues that using this energy to mine Bitcoin incentivises methane flaring and enables various industries to reduce the environmental impact of their operations.\n\nNOW READ: Green Bitcoin mining now cheaper than fossil fuels says Sazmining COO as mining company taps Paraguayan hydro dam\n\nAs for social impacts, the report notes the negative impact of Bitcoin’s use in financial crime is overstated, citing a 2022 Chainalysis report which concluded the illegal use of crypto accounted for only 0.24% of all transaction volume in 2022.\n\nYet the report argues Bitcoin provides many benefits to society, particularly in low-income countries.\n\nIt enables low-cost cross-border payments — important for immigrants from developing countries such as Honduras, Haiti, and El Salvador who work abroad and regularly send money back to relatives in their home countries.\n\nIn Africa, Bitcoin mining is also helping subsidise electricity grids, helping bring power to millions and reducing costs for consumers.\n\nFor governance, the report lauds Bitcoin as a truly decentralised network that removes the need for trusted intermediaries.\n\nKPMG’s investment in Bitcoin\n\nBecause Bitcoin is decentralised, no one single entity can exert control over it, making it highly resistant to attack and providing a high degree of confidence in the overall system.\n\nNOW READ: Circle can’t shake SVB hangover as market cap dwindles to two-year low\n\nThe report argues that these attributes, coupled with the fact that Bitcoin’s governance and rules are hard coded, results in a system that cannot be abused or misused by those in power or even individuals with ulterior motives.\n\nThe Bitcoin-friendly report follows KPMG’s investment in Bitcoin, and the second-biggest cryptocurrency Ethereum, from its Canadian arm in 2022.\n\nAt the time, KPMG Canada managing partner Benjie Thomas said the investment reflected the firm’s belief that “institutional adoption of cryptoassets and blockchain technology will continue to grow and become a regular part of the asset mix.”"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2UyYWIwNjA5LWRjMjgtNDlkOS05YWMxLTQwZGU4YWRkMDM2Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Global X files for ETF that combines bitcoin futures and T-bills - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nGlobal X has filed to launch an ETF that will alternate between allocating to Bitcoin futures and the firm’s recently launched Treasury bill ETF, a regulatory filing shows.\n\nThe Global X Bitcoin Trend Strategy ETF will dynamically and systematically allocate between the United States and, once available, Canadian exchange traded bitcoin futures contracts and the Global X 1-3 Month T-Bill ETF, a passively managed ETF that launched this year, the ETF’s prospectus states.\n\nThe latter ETF launched on June 20 and has amassed $42mn in assets, according to data from Morningstar Direct.\n\nThe manager’s largest ETF is the Nasdaq 100 Covered Call ETF, filings show. Investors piled $1.3bn into the ETF during the year ended June 30, according to Morningstar.\n\nThis article was previously published by Ignites, a title owned by the FT Group.\n\nFees for the planned ETF were not disclosed.\n\nGlobal X declined to comment.\n\nGlobal X manages $41.8bn in assets across 107 ETFs, according to Morningstar.\n\n“This appears to be a tactical allocation ETF that adjusts the portfolio from bitcoin futures to T-bills whenever the bitcoin trend weakens,” said Bryan Armour, director of passive strategies for North America at Morningstar.\n\n“Market timing is extremely challenging, so these types of quantitative approaches tend not to be high performers” he said. “This is the first tactical strategy I’ve seen for bitcoin.”\n\nThe first US bitcoin futures ETF, the $1.1 billion ProShares Bitcoin Strategy ETF, launched in October 2021 and was quickly followed by similar offerings from VanEck and Valkyrie, Morningstar data shows.\n\nAlthough bitcoin futures ETFs do not hold the digital asset directly, several issuers have filed to launch a spot bitcoin ETF. The Securities and Exchange Commission has repeatedly shot down those applications because of concerns about potential manipulation and a lack of surveillance from the exchanges on which the ETFs would be listed.\n\nLast month, BlackRock set off the latest flurry of new applications or reapplications when it filed to launch a spot bitcoin ETF.\n\nBlackRock’s application was quickly followed by similar applications from VanEck, Valkyrie, Fidelity, Invesco, WisdomTree and Bitwise. Ark Invest filed to launch a spot bitcoin ETF in April.\n\nThose spot filings should not be an impediment to the Global X ETF, Armour said.\n\n“This strategy has a risk-off mechanism that can cause performance to differ significantly from bitcoin itself,” he said. “There could also be a long runway to a spot bitcoin ETF, leaving plenty of time for Global X and others to go after that market.”\n\nIgnites is a news service published by FT Specialist for professionals working in the asset management industry. Trials and subscriptions are available at ignites.com.\n\n\n\n"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDQvYml0Y29pbi1ob2xkaW5ncy1vbi1vdGMtZGVzay1kZWNsaW5lLXRvLTE1MG0tZ2xhc3Nub2RlL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDQvYml0Y29pbi1ob2xkaW5ncy1vbi1vdGMtZGVzay1kZWNsaW5lLXRvLTE1MG0tZ2xhc3Nub2RlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Holdings on OTC Desks Decline 33%: Glassnode - CoinDesk",
        "content": "That said, drawing definite conclusions from changes in the desk balances may be risky because they are exposed to address-labeling issues. Besides, the balance itself does not reflect whether the desk is accumulating or looking to liquidate coins on behalf of their clients."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA4LzA0L2JldHRlci1idXktYml0Y29pbi1vci1iaXRjb2luLW1pbmluZy1zdG9ja3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Better Buy: Bitcoin or Bitcoin Mining Stocks? - The Motley Fool",
        "content": "Bitcoin (BTC -0.26%) mining stocks have easily outperformed Bitcoin this year, and it's not even close. Through the first six months of 2023, the nine biggest publicly traded Bitcoin miners were up an average of 257%. In comparison, Bitcoin is up 76% year to date.\n\nBut that recent performance doesn't necessarily mean Bitcoin mining stocks are a better investment than Bitcoin. If you're a long-term buy-and-hold investor, there are three key factors to keep in mind as we head into the second half of the year.\n\nCyclical nature of Bitcoin mining stocks\n\nIt might sound obvious, but Bitcoin mining stocks are highly correlated with the price of Bitcoin. They go up when Bitcoin goes up, and they go down when Bitcoin goes down. In a bull market rally for Bitcoin, such as we've experienced in the first half of 2023, this makes them very attractive investment targets. However, during a bear maket, this makes them terrible investment targets. Simply stated, it's nearly impossible for them to turn a profit when the price of Bitcoin is nosediving.\n\nWe just saw this scenario play out during the crypto winter of 2022, when investors began to give up on Bitcoin mining stocks. With the price of Bitcoin down significantly, these miners become big money-losing operations. So, before you start buying Bitcoin mining stocks, be sure you understand the cyclical nature of these stocks. Since they are so highly correlated with the price of Bitcoin, they share the same volatility.\n\nThe Bitcoin proxy effect\n\nThere are several well-known stocks that are considered Bitcoin proxies simply because they have so much exposure to Bitcoin. Chief among them are top Bitcoin mining stocks such as Riot Platforms (RIOT 0.95%) and Marathon Digital Holdings (MARA -2.43%). Not only do these mining stocks have business models that are almost 100% based around Bitcoin, they also hold an enormous amount of Bitcoin on their balance sheets. Thus, they are arguably as close as you can get to buying Bitcoin without actually buying Bitcoin.\n\nFrom my perspective, this Bitcoin proxy effect helps to explain why Bitcoin mining stocks are absolutely trouncing Bitcoin this year. For institutional investors that are unable to buy Bitcoin directly, getting exposure to Bitcoin mining stocks is a useful proxy. That's a great opportunity over the short term, because there's obviously a lot of pent-up demand for Bitcoin from institutional investors.\n\nBut, over the long haul, the market will see the emergence of new investment products for Bitcoin, such as new spot Bitcoin ETFs. In June, BlackRock (BLK -0.43%), the largest asset manager in the world, made headlines with its application for a spot Bitcoin ETF. That was quickly followed by other investment firms filing for spot Bitcoin ETFs. As these investment products eventually get approved by the SEC, the Bitcoin proxy effect is likely to disappear. Investors looking for Bitcoin exposure will simply buy a spot Bitcoin ETF instead of relying on proxy stocks.\n\nBitcoin halving in 2024\n\nFinally, it's important to keep in mind that the upcoming Bitcoin halving, which is now scheduled for April 2024, is going to shake up the playing field for Bitcoin miners. In a halving event, which takes place only once every four years, the mining reward for Bitcoin miners is cut in half. This directly affects the top-line revenue of Bitcoin miners, and makes it imperative for them to have streamlined operations.\n\nThus, my expectation is that only the most efficient Bitcoin miners will survive. That's because energy costs for mining Bitcoin are off the charts, so only Bitcoin miners with the lowest costs will still be able to turn a profit. This might not affect Riot Platforms, which is generally acknowledged to have some of the lowest Bitcoin production costs in the industry. But it will certainly affect other Bitcoin miners that have very energy-intensive mining operations. So be careful which Bitcoin mining stocks you buy -- they're not all the same.\n\nBuy Bitcoin, not proxies\n\nBased on the above, I'm convinced that Bitcoin is the superior investment over the long haul. Mining stocks don't offer enough diversification, and thus will always be highly correlated with the price of Bitcoin. So why would you buy a very capital-intensive company instead of the underlying asset? Moreover, mining stocks are getting a big bump right now from the Bitcoin proxy effect. As soon as that proxy effect starts to dissipate, then the case for buying Bitcoin mining stocks is going to become even weaker.\n\nLong-term, I'm bullish on Bitcoin. And I'm also bullish on companies that are building business models around Bitcoin. But there's simply no reason to buy mining stocks when you can buy Bitcoin instead."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOC8wNC9taWFtaS1tYXlvci1mcmFuY2lzLXN1YXJlei10by1hY2NlcHQtcHJlc2lkZW50aWFsLWNhbXBhaWduLWRvbmF0aW9ucy1pbi1iaXRjb2luLWFuZC1vdGhlci1jcnlwdG8v0gGSAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzA0L21pYW1pLW1heW9yLWZyYW5jaXMtc3VhcmV6LXRvLWFjY2VwdC1wcmVzaWRlbnRpYWwtY2FtcGFpZ24tZG9uYXRpb25zLWluLWJpdGNvaW4tYW5kLW90aGVyLWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Miami Mayor Francis Suarez to Accept Presidential Campaign Donations in Bitcoin - CoinDesk",
        "content": "The move to allow bitcoin payments for donations should come as no surprise given that the Miami mayor has long been an advocate for digital assets, specifically bitcoin, which he has said will have a “democratizing impact on the future of wealth for every American.” He has vowed to make Miami a bitcoin hub and has accepted his salary in bitcoin."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzA0L3VzLWFkZGVkLTE4N2stam9icy1pbi1qdWx5LW1pc3NpbmctZXN0aW1hdGVzLTIwMGstYml0Y29pbi1zbGlwcy10by0yOTEwMC_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOC8wNC91cy1hZGRlZC0xODdrLWpvYnMtaW4tanVseS1taXNzaW5nLWVzdGltYXRlcy0yMDBrLWJpdGNvaW4tc2xpcHMtdG8tMjkxMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "U.S. Added 187K Jobs in July, Missing Estimates for 200K, Bitcoin Slips to $29,100 - CoinDesk",
        "content": "Still, the headline miss seems unlikely to set off any panic alarms over the economy at the central bank. Alongside the slower-than-expected job growth, the unemployment rate ticked even lower. Also, average hourly earnings, which are being closely followed by the Fed, rose 4.4% from a year ago, versus forecasts for a 4.2% rise."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnB5bW50cy5jb20vZWFybmluZ3MvMjAyMy9ibG9jay1hbmQtY29pbmJhc2UtZWFybmluZ3Mtc2hvdy1jcnlwdG9zLWZsaWdodC10by1xdWFsaXR5LWxhbmRzLW9uLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Block and Coinbase Earnings Show Crypto's Flight to Quality Lands on Bitcoin - PYMNTS.com",
        "content": "Expectations weren’t very high for Coinbase Global this most recent quarter.\n\nThe company continues to face very significant risks on the regulatory front within the U.S., and remains entangled in a nasty case with the Securities and Exchange Commission (SEC).\n\nStill, the crypto exchange’s stock has jumped almost 80% since mid-June, lifted by a partial court win by Ripple against the SEC (from which a later federal ruling diverged) as well as BlackRock’s recent application to launch a bitcoin exchange-traded fund.\n\nCoinbase’s Chief Legal Officer Paul Grewal said to investors on the company’s second quarter 2023 earnings call that the exchange is moving to fully dismiss the case.\n\n“It is our view that none of the assets or services in the SEC’s complaint constitute investment contracts under longstanding securities law,” Grewal added. “We plan to use these proceedings as an opportunity to bring more clarity to our industry as a whole … and are encouraging the U.S. to follow the progressive regulatory frameworks seen in emerging crypto hubs.”\n\nThe crypto firm is also looking to broaden its ecosystem — and that of the builders in the Web3 and crypto space.\n\n“As we look ahead, we are expanding our focus towards crypto use cases beyond trading,” Coinbase CEO Brian Armstrong said. “Trading is the big use case of the early days of crypto, but it is starting to move away from that … with layer 2 solutions [alternative uses] can get much, much better as people interface with them more.”\n\nWhile the company beat Wall Street expectations, the earnings results might appear moot to the most cynical observers, given the regulatory turmoil brewing in the background.\n\n“Trust is the premium brand that we are selling,” Coinbase CFO Alesia Haas said to investors.\n\nDigging Into the Numbers\n\nCoinbase notched a 30% reduction in headcount compared to this same time last year.\n\nTwo of the only metrics that were “up” for Coinbase this quarter were its sales and marketing expenses of $84 million, up 31% since last quarter, and general and administrative expenses of $259 million, up 4% since last quarter, driven by legal costs.\n\nBoth cost centers make sense given the position the exchange finds itself in.\n\nCoinbase’s net revenue was $663 million, down 10% since last quarter, and Q2 total transaction revenue was $327 million, down 13% from Q1.\n\nThe transaction revenue slide was driven by a 37% decrease in trading volume from Q1.\n\nConsumer transaction revenue was $310 million in Q2, down 12% from Q1. Q2 consumer trading volume was $14 billion, down 33%. Coinbase Q2 institutional transaction revenue was $17 million, down 24%. Institutional trading volume was $78 billion, down 37% from the previous quarter.\n\nOverall, bitcoin accounted for 40% of trading volume in the quarter, up from 31% in the year-ago period.\n\nAnd it was a similar bitcoin-as-hero narrative over at Block, the payments giant run by Jack Dorsey and formerly known as Square, which also reported earnings Thursday (Aug. 3).\n\nIt’s an Ecosystem Block Party\n\nOf Block’s total $5.5 billion Q2 net revenue, $2.39 billion came from bitcoin, which was helped along by 34% increase in bitcoin revenue compared to this same period last year.\n\nThe price of bitcoin has increased more than 75% year-to-date. The digital asset comprises nearly half of the cryptocurrency market cap and has proven its resiliency in the face of ongoing sector issues and scrutiny.\n\nBlock’s Cash App, which started as a person-to-person payments app, has emerged as a popular tool for buying and selling bitcoin.\n\n“The year-over-year increase in bitcoin revenue and gross profit was driven by an increase in the quantity of bitcoin sold to customers, partially offset by a decrease in the average market price of bitcoin compared to the prior-year period,” the company wrote in a letter to shareholders.\n\nBlock’s two central businesses, Cash App and Square, both generated earnings that topped Wall Street expectations.\n\nSquare generated gross profit of $888 million, up 18% year over year (YoY), and Cash App generated gross profit of $968 million, up 37% YoY.\n\nSquare had strong momentum with its banking products, which generated $167 million in gross profit, up 24% YoY, driven primarily by Square Loans, Instant Transfer and Square Debit Card.\n\nCash App boasted 54 million monthly transacting active customers, a growth of 15% YoY.\n\nEnabling omnichannel, growing upmarket, expanding globally, and integrating generative artificial intelligence were listed as four growth pillars across Block’s house of businesses.\n\nCompany executives told investors on the call Thursday (Aug. 3) that they expect Tap to Pay to become the “dominant way to pay” in the future, and that “markets outside the U.S. that we’re less than 1% penetrated in are [a huge] opportunity with a long runway for growth.”\n\n“Because Square is one ecosystem and it all connects together with all the operational utilities as well, it’s very easy to choose and add these new dimensions to your offering and to your customers, which ultimately differentiates you from your competitors and grows your sales,” Block leadership told investors on the call.\n\nBlock’s stock price has largely recovered from the hit it took this spring when short seller Hindenburg released a critical report on the business, alleging Block made false claims about its customer acquisition costs and user counts."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9pbnN0aXR1dGlvbmFsLWludGVyZXN0LWJpbGxpb24tZG9sbGFycy1wcmljZS1yZW1haW5zLXJhbmdlLWJvdW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Institutions Pour $1 Billion in Bitcoin Option Yet Price Stays Range Bound - CCN.com",
        "content": "Key Takeaways\n\nBitcoin trading reaches a 4-month high\n\nBitcoin has yet to bounce back above $30,000\n\nPotential reasons for market optimism and price stalling\n\nData from CryptoQuant shows that Bitcoin trading activity increased by 24% in July, reaching over $940 million. Volumes in bitcoin (BTC) options also increased by 16.6% to $734 million, while ether (ETH) options registered a 60% increase to $207 million.\n\nChicago Mercantile Exchange (CME) reports a substantial increase in Bitcoin options trading.\n\nHowever, the price of Bitcoin still floats somewhere around $29,000 per token despite increased trading activity.\n\nInvestors Are Optimistic\n\nCME reports Bitcoin options trading significantly increased during July. The investment option provides investors with the right to buy or sell a digital asset at a predetermined price on or before a specific date.\n\nThe Exchange gives buyers the option to buy or sell one cryptocurrency futures contract at a specific price at some future date. CME offers both Bitcoin and Ether options based on the exchange’s cash-settled standard and micro BTC and ETH futures contracts.\n\n\n\n“The increase in BTC options volume on the CME suggests that institutions might be hedging their positions with options as uncertainty remains in the market,” according to a CCData report .\n\nBitcoin Is Yet To Bounce Back\n\nEver since the $4,000 price increase for Bitcoin due to BlackRock’s ETF application, the token has not seen any further increases. As a matter of fact, BTC has dropped by almost 4% in value throughout July.\n\nThe ETF application that led to a tidal wave of financial institutions applying for similar ETFs was at risk of rejection until the world’s largest asset manager refiled its application, naming Coinbase as its surveillance partner.\n\nHowever, since then, there has been almost no news about the application and investors are starting to show signs of doubt.\n\nAs a result, many investors are now opting for BTC and ETH options, rather than futures contracts.\n\nCCData shows a 17.6% drop in Futures volume on CME to $39.1 billion. Simultaneously, total derivatives trading volume (futures and options) dropped to $40.1 billion.\n\nWhat Would It Take For BTC To Go Over $30k?\n\nThe market is already showing signs of optimism following Ripple’s triumph during its SEC litigation. Other crypto institutions such as Coinbase are now hopeful of the outcome of their own SEC lawsuits.\n\nWhile a win for these institutions might signal a more stable crypto market, it’ll take more than that to give BTC the push it needs.\n\nFor one, many stakeholders, both private and governmental, are calling for clear crypto regulations that would help crypto institutions and investors navigate the market while avoiding legal challenges.\n\nSecond, the market is obviously in anticipation of BlackRock and Co’s ETF applications to go through. If the SEC somehow manages to process said applications smoothly, the market is likely to witness a surge of activity in expectations for an almost definite increase in BTC pricing."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9tYXJrZXRzL2JpdGNvaW4tYm9ubmllLWNseWRlLXBsZWFkLWd1aWx0eS1tb25leS1sYXVuZGVyaW5nLWhhY2tlZC1jcnlwdG_SAWhodHRwczovL3d3dy5mb3hidXNpbmVzcy5jb20vbWFya2V0cy9iaXRjb2luLWJvbm5pZS1jbHlkZS1wbGVhZC1ndWlsdHktbW9uZXktbGF1bmRlcmluZy1oYWNrZWQtY3J5cHRvLmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "'Bitcoin Bonnie and Clyde' plead guilty to money laundering hacked crypto - Fox Business",
        "content": "A married couple dubbed \"Bitcoin Bonnie and Clyde\" pleaded guilty Thursday to laundering funds stolen from cryptocurrency exchange Bitfinex in a yearslong heist dating back to 2016.\n\nIlya Lichtenstein admitted to hacking the exchange and enlisting his wife, Heather Morgan, an online rapper also known as \"Razzlekhan,\" the \"Crocodile of Wall Street,\" to help hide nearly 120,000 stolen bitcoins through an elaborate scheme.\n\nLichtenstein pleaded guilty to conspiracy to commit money laundering and faces up to 20 years in prison. Morgan pleaded guilty to one count of money laundering conspiracy and one count of conspiracy to defraud the United States, each of which carries a maximum penalty of five years in prison.\n\nThe couple were arrested in New York in February 2022 in what the Department of Justice said was the largest financial seizure in its history.\n\nThe DOJ recovered $3.6 billion in assets at the time and has since recovered another $475 million. Lichtenstein, 35, and Morgan, 33, jointly agreed in court to forfeit another $72 million.\n\nBITCOIN ON TRACK TO CHALLENGE U.S. DOLLAR?\n\nWhen the hack occurred, the tokens were worth around $71 million, but their value ballooned to $4.5 billion at the time of the duo's arrest.\n\nProsecutors say the bitcoins were stolen from Bitfinex's website over five years via some 2,000 transactions that were transferred to Lichtenstein's digital wallet. Morgan told the court Thursday that her husband had informed her in 2020 that he had hacked the exchange.\n\nThe couple took several trips to Ukraine and Kazakhstan, and prosecutors said Lichtenstein used the visits to meet with \"money mules\" who converted cryptocurrency into government-issued currency and deposited it into Russian and Ukrainian banks. Lichtenstein and Morgan would then withdraw cash from the accounts in the United States.\n\nBITCOIN CASE: MEET THE COUPLE WHO ALLEGEDLY SCAMMED $4.5B IN CRYPTO\n\nAccording to the criminal complaint, Lichtenstein and Morgan used an array of laundering techniques to hide the funds, including using fake identities to set up online accounts, depositing stolen funds into numerous crypto exchange accounts to cover transaction history, converting Bitcoin to other forms of virtual currency, and using U.S.-based business accounts to make the funds seem legitimate.\n\nLichtenstein admitted to converting some of the funds into gold coins and giving them to Morgan, who buried them in California. Authorities have since dug them up.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nMorgan is free on bail, and Lichtenstein remains jailed. Sentencing dates have not yet been set for either defendant.\n\nReuters contributed to this report."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmZpbnRlY2huZXh1cy5jb20vYmxvY2stYmVhdHMtZm9yZWNhc3RzLXNpZ2h0cy10dXJuLXRvLWFmdGVycGF5LWFuZC1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Block beats forecasts, sights turn to Afterpay and Bitcoin - Fintech Nexus",
        "content": "Block revealed it had beat forecasted earnings during its Q2 2023 call yesterday, August 3, despite the challenging economic backdrop.\n\nIt was reported that quarterly net revenue was up on last year, reaching $5.53 billion. All but hardware revenue had increased year on year, hinting at the rising levels of competition in the POS space.\n\nAdjusted operating income had also bounced back from a $103 million loss in Q2 2022, to $25 million.\n\nGross profit grew 27% to $1.87 billion, with both Square and CashApp registering consistent profit growth. The company stated that Square, in particular, had shown “strong momentum” which was driven primarily by Square Loans, Instant transfer and Square Debit Cards.\n\n“As a company, our strength and resilience comes from our diversified ecosystems, each serving different audiences and the connections we create between them,” said CEO and Founder, Jack Dorsey.\n\nThe company has stated that it will embark on a “disciplined” strategy going forward, weathering the challenging climate.\n\n“Winding Down” BNPL in Europe\n\n“This past quarter we decided to wind down operations in certain markets, including Cash App’s Verse brand in the EU, and our Buy now pay later platform ClearPay in Spain, France and Italy,” said Dorsey. “They have required significant investment and the markets have not seen the growth and profitability we had expected over the past several years.”\n\n“We see an opportunity to shift these resources towards strategic areas that have a higher potential return on investment.”\n\nThe high-profile, $29 billion acquisition of BNPL provider Afterpay (ClearPay in the EU) in 2021, has proved to be a challenge for Block. A cooling of the hype around BNPL and heightened competition with companies like Apple have made growth rates far from ideal.\n\nIn the last quarter, seriously delinquent loans (151-180 days past due) had also spiked, reaching over $35,000, an all time high in the past year.\n\nIt has not gone unnoticed. Dorsey stated his current priority was the Afterpay platform.\n\n“This is where a lot of my focus is right now,” said Dorsey. “I’m meeting the team almost on a daily basis to make sure that we come up with a compelling and differentiated experience.”\n\nA key factor, he stated, would be the connection of its US CashApp with users of Square’s payment terminals through Afterpay.\n\nBitcoin Bet Pays Off\n\nHowever, it seems Block’s focus on Bitcoin is paying off, with Bitcoin revenue now making up almost half of its quarterly net revenue.\n\nThe company first invested in bitcoin in 2020, consistently adding to its commitment over the following years. In December 2021, the company changed its name to Block, which some have seen as a signal of its ongoing support of Web3 technology.\n\nEarlier this year, Block announced their development of bitcoin wallet, Bitkey, that would integrate into CashApp. Partnering with Coinbase, Dorsey stated during the call that it would be launched internationally from the start and added to the dynamism of the company.\n\n“We continue to refine (the product strategy) and look for opportunities to build a really compelling experience within the Cash App. That build network effects and increases are network effects within Cash App, but also enables us to have an app that people are checking every day,” said Dorsey.\n\nRELATED: Block shows resilience and a refocused investment framework"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qYWNrLWRvcnNleXMtYmxvY2stcmVwb3J0cy01LTIxMDExMTkxMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Jack Dorsey's Block Reports $5.5 Billion in Q2 Revenue—Almost Half of It From Bitcoin - Yahoo Finance",
        "content": "Bitcoin-loving payments firm Block Inc. today reported gross profit of $1.87 billion in its second quarter 2023 results—a 27% year-over-year increase. And $2.4 billion of its total $5.5 billion Q2 net revenue came from Bitcoin, the company said.\n\nThe company—formerly known as Square—saw a 34% increase in Bitcoin revenue compared to the same period in 2022. Bitcoin revenue refers to the total sale amount of cryptocurrency sold to customers.\n\n\"We delivered strong growth and profitability at scale during the second quarter of 2023,\" the company said in a letter to shareholders.\n\nBlock's Cash App business Bitcoin revenue stood at $1.16 billion, a 39% increase compared to the same period in 2022. If not for a dip in prices, the company said, the revenue could have contributed even more to its bottom line.\n\n\"The year-over-year increase in Bitcoin revenue and gross profit was driven by an increase in the quantity of Bitcoin sold to customers, partially offset by a decrease in the average market price of Bitcoin compared to the prior-year period,\" the company said in a letter to shareholders.\n\nThe company also recorded no impairment losses on its Bitcoin holdings, which now total $245 million, in the three- and six-month periods ending June 30, 2023.\n\nBlock’s Cash App Bitcoin Revenue Drops 25% Year-Over-Year\n\nAn impairment charge refers to a loss of value in assets—in this case, the digital assets held by the company.\n\nBlock is a payments company founded by Twitter co-founder Jack Dorsey. Its popular mobile app, Cash App, is a popular tool for buying and selling Bitcoin.\n\nThe app last year installed the Bitcoin \"second-layer solution\" the Lightning Network—allowing users to make small and quick payments with crypto.\n\nWhat is Bitcoin?\n\nThe move shows just how committed the company is to pushing Bitcoin adoption. In June, Dorsey-backed Bitkey launched the beta for its Bitcoin wallet, which will allow users withdraw BTC from their Coinbase and Cash App wallets using \"copy and paste.\""
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvbWljaGFlbC1zYXlsb3ItYml0Y29pbi1vdXRsb29rLW1pY3Jvc3RyYXRlZ3ktc3RvY2stc2FsZS1jcnlwdG9jdXJyZW5jeS10b2tlbnMtMjAyMy040gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Outlook: MicroStrategy Stocks for Sale Amid Bitcoin Grab - Markets Insider",
        "content": "MicroStrategy is looking to buy more bitcoin, potentially using proceeds from selling equity.\n\n\"Our goal is to accumulate as much Bitcoin as we can on behalf of our shareholders,\" Michael Saylor told Bloomberg TV.\n\nHe previously forecast that bitcoin's market dominance will double amid the crypto crackdown.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nMicroStrategy founder Michael Saylor said the company may be looking to cash in shares to add to the firm's already huge trove of bitcoin.\n\nThe company has used proceeds from stock and bond sales to buy more bitcoin in the past, and a Tuesday federal filing shows that MicroStrategy could sell $750 million of class A common stock, to be used for either buying more bitcoin or other general corporate purposes.\n\n\"Our goal is to accumulate as much Bitcoin as we can on behalf of our shareholders,\" he told Bloomberg TV on Wednesday.\n\nAs of July 31st, the software company held 152,800 bitcoins, worth of about $4.5 billion. That's after Saylor had added to the firm's holdings of the token that month, scooping up 12,333 bitcoins.\n\nAdvertisement\n\nSo far 2023, the world's largest cryptocurrency by market value has rallied 75%. Its impressive performance helped MicroStrategy post its first profitable quarter in two years. MicroStrategy stock, meanwhile, has climbed 189.45% in the same period.\n\n\"We've pursued a strategy of levered bitcoin investments. So we use cheap capital — our average cost of capital is like 1.6%, or something in that range — and the combination of leverage, and then offering our shareholders a yield,\" he said.\n\n\"We don't charge them a fee to manage this bitcoin, we actually aim to write a yield; that's allowed us to actually generate 254% performance in the same time the bitcoin was up 145% [since last August].\"\n\nSaylor is a long-time bitcoin bull. In June, he said he expects bitcoin's market dominance to only grow, stating that the ongoing regulatory crackdown would eliminate a number of competing cryptocurrencies.\n\nAdvertisement\n\n\"Now I think that the public is beginning to realize that bitcoin is the next bitcoin,\" Saylor said. \"The next logical step is for bitcoin to 10x from here and then 10x again.\"\n\nAs of Thursday morning, bitcoin was trading around $29,162."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1jYW4tYmUtZXNnLWRyaXZlci_SAUdodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2JpdGNvaW4tY2FuLWJlLWVzZy1kcml2ZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Can Be ESG Driver - ETF Trends",
        "content": "Due to the energy-intensive nature of the bitcoin mining process, many consider miners and the digital currency itself detractors to environmental, social, and governance (ESG) and sustainability objectives.\n\nThose criticisms can affect bitcoin mining equities and the exchange traded funds that hold those stocks, including the Invesco Alerian Galaxy Crypto Economy ETF (SATO) . Fortunately, some experts are optimistic that the bitcoin mining industry is cognizant of the need to be a better environmental steward. There is also optimism that it sees long-term benefits in boosting adoption of renewable energy.\n\nThe current proof-of-stake mining system contributes to air pollution and climate change. Indeed, the ASIC hardware used to mine bitcoin results in a process that produces Scope 1 emissions. This indicates that some SATO member firms would do well to increase adoption of green energy.\n\nAs noted by KPMG, bitcoin mining requiring a lot of energy isn’t so much the problem as is the use of fossil fuels in the mining process. Bitcoin miners’ consumption of fossil fuels creates harmful emissions, and that weighs on the industry’s ESG credentials.\n\nBitcoin Miners Have Advantages\n\nSATO member firms can locate mining farms nearly anywhere they choose. This is advantageous when dealing with some reliability issues tied to renewables.\n\n“Renewable energy facilities are incentivized to produce at their maximum capacity to deliver electricity in a manner consistent with their contractual agreements,” observed KPMG. “This can leave utilities with an excess supply of electricity, which if coupled with a supply and demand mismatch, can lead to low, and even negative, electricity prices.”\n\nBitcoin miners have the ability to be selective when it comes to location, as well as other advantages. Miners, including those that dwell in SATO, can leverage this over the long term to potentially bolster their ESG resumes.\n\nFirst, bitcoin miners can swiftly adjust to real-time demand conditions. In a hypothetical example, a bitcoin miner operating in the Phoenix can scale back activity during sweltering summer days. This would reduce energy consumption. Conversely, when energy demand falls during the more accommodating winter months, miners can increase output.\n\nSecond, as noted by KPMG, bitcoin miners can “provide additional incentive to the buildout of renewable energy capacity.” Moreover, in a broad sense, bitcoin arguably isn’t getting the ESG credit it deserves.\n\n“Bitcoin appears to provide a number of benefits across an ESG framework,” concluded KPMG. “Throughout its short history, new and innovative ways of leveraging the network and its native asset continue to emerge, such as helping to stabilize energy grids, reduce greenhouse gas emissions, and even assist with providing sustainable heat to commercial and residential properties.”\n\nVettaFi LLC (“VettaFi”) is the index provider for SATO, for which it receives an index licensing fee. However, SATO is not issued, sponsored, endorsed or sold by VettaFi, and VettaFi has no obligation or liability in connection with the issuance, administration, marketing or trading of SATO."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWFya2V0LXR1cmJ1bGVuY2UtcGx1bmdlcy1jcnYv0gE_aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1tYXJrZXQtdHVyYnVsZW5jZS1wbHVuZ2VzLWNydi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin plunges under US$30,000 amid market turbulence. Is US$27,000 next? - Forkast News",
        "content": "Bitcoin fell 0.26% from July 28 to Aug. 4 to US$29,136 as of 7:00 p.m. Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under US$30,000 since July 24, dipping to US$28,799 on Tuesday, its lowest since June 21. Ether lost 1.77% over the week to US$1,833.\n\nBitcoin’s price falling from multiple key levels suggests a bearish market trend, according to Lucas Kiely, chief investment officer of digital asset platform Yield App.\n\n“Investors may be contemplating whether it is time to cut their losses or ride out this turbulent period due to weak prices despite the positive nature of [exchange-traded fund] applications and the XRP ruling,” Kiely said. “Despite this, sentiment in crypto remains largely down. It seems weekly that the [Securities and Exchange Commission] sues another crypto company, which seems to turn away investors.”\n\nThe week started off with following a US$70 million hack in Curve Finance, a stablecoin-focused decentralized exchange, on Sunday.\n\n“Although this [Curve Finance hack] has nothing to do with Bitcoin, it still casts a negative light on the crypto industry,” Marco Johanning, writer of The Summit Post, a newsletter that provides technical analysis on cryptocurrency price movements, told Forkast. “Historically, August has been a weaker month, so I believe a grinding lower at the moment is the most likely scenario.”\n\nIn the macroeconomic landscape, credit agency Fitch Ratings downgraded the U.S. long-term credit rating on Tuesday from AAA to AA+, citing “expected fiscal deterioration” in the country, over the next three years.\n\n“The U.S. government has US$32 trillion dollars in debt and trillion dollar interest payments. Meanwhile, the economy is only growing slightly. The Fitch downgrade sent Bitcoin higher, but Bitcoin faced resistance at the US$30,000 level,” Kiely said.\n\nThe global crypto market capitalization stood at US$1.16 trillion on Friday at 7:00 p.m. in Hong Kong, down 1.69% from US$1.18 trillion a week ago, according to CoinMarketCap data. With a market cap of US$566 billion, Bitcoin represented 48.7% of the market while Ether, valued at US$220 billion, accounted for 18.9%.\n\nNotable Movers: XDC, BONE\n\nOpen-source blockchain protocol XDC Network’s XDC token was the week’s biggest gainer in the top 100, rising 39.23% to US$0.08245. The token started picking up momentum on Tuesday, a day after XDC Foundation announced the integration of the network with Infocomm Media Development Authority Singapore, to digitalize cross-border trading.\n\nBone, the governance and reward token of the Shiba Inu ecosystem, was this week’s second-biggest gainer, rising 25.11% to US$1.65. The coin started picking up pace last Friday, in anticipation of the launch of Ethereum layer-2 blockchain Shibarium, set to debut at the ETH Toronto conference scheduled for August 15 and 16.\n\nProof-of-work based blockchain Litecoin completed its third halving event on Wednesday, reducing miner rewards from 12.5 to 6.25 Litecoins per block. The much-awaited halving failed to restore investor confidence, as Litecoin fell 6% within the next 24 hours.\n\nSee related article: Binance Japan launches with 34 tokens, BNB debuts in the country\n\nNext week: Will Bitcoin fall below US$28,000?\n\nIf Bitcoin does not return to US$29,800 next week, it may fall to as low as US$28,000, said Johanning.\n\n“The support at US$27,000 is much stronger and coincides with the trendline formed by the lower lows on December 22nd, March 23rd, and June 23rd. Furthermore, there is a large liquidation pool below the US$28,000 resistance. Therefore, US$27,000 appears to be a likely target,” he said.\n\nInvestors will look forward to next Thursday’s release of the U.S. core consumer price index, a report on the inflation of goods and services, excluding food and energy.\n\nSee related article: CyberKongz moves to Sky Mavis’ Ronin blockchain for Genkai collection"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNyeXB0by1iaW5hbmNlLWZyYXVkLWNoYXJnZS11cy0wOTIzNTY2MjEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin falls on Binance fraud charge fear - Yahoo Finance UK",
        "content": "Bitcoin dipped over 2% on Thursday. Photo: Getty (KTSDESIGN/SCIENCE PHOTO LIBRARY via Getty Images)\n\nBitcoin dipped over 2% following news the US Department of Justice (DOJ) is reportedly contemplating bringing fraud charges against cryptocurrency exchange Binance.\n\nBitcoin (BTC-USD) fell below the $29,000 mark in early trade in Asia, but then bounced back modestly, with its price settling around $29,100 (£22,956), down over 2%.\n\nThe DOJ is hesitating over the fraud charges due to concerns over the negative impact on the larger crypto industry, according to Semafor.\n\nFederal prosecutors are concerned charges against Binance could cause a run on the platform. They fear a repeat of the FTX collapse in November 2022 when an indictment led to a bank run that caused many retail investors to lose their money.\n\nADVERTISEMENT\n\nRead more: Crypto live prices\n\nUS prosecutors are considering other options, such as fines and deferred or non-prosecution agreements, according to Semafor.\n\nBinance and its founder, Changpeng Zhao, have already been slapped with charges by the Securities and Exchange Commission (SEC).\n\nIn June, the US financial regulator accused Binance of mishandling customer funds and lying to regulators and investors about its operations.\n\nIt comes as bitcoin's price sees some stability as trading volumes remain low.\n\n\"Bitcoin is wavering above the $29,000 level as traders await any updates with a US spot Bitcoin ETF,\" Edward Moya, senior market analyst for foreign exchange market maker Oanda, wrote in a note.\n\nRead more: Sovereign agents: Your own personal AI assistant? | The Crypto Mile\n\n\"Fresh money has not yet been coming into the cryptoverse so range trading might remain a while longer.\"\n\nConfidence in bitcoin and the cryptocurrency market was also affected by a hack on the Curve Finance decentralised exchange on Sunday which lead to a loss of around $70m, according to Chainalysis.\n\nThe attackers exploited a weakness in Vyper, a Python-based programming language for Ethereum (ETH-USD) smart contracts utilised by Curve and other DeFi platforms.\n\nStory continues\n\nWatch: The risks of banks tokenising assets on blockchain | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibG9jay1xMi1yZXN1bHRzLWNhc2gtYXBwLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Block posts 34% increase in Bitcoin revenue in Q2 but shares stumble - Cointelegraph",
        "content": "Shares in payment technology firm Block Inc. tumbled after hours despite its second-quarter results beating earnings expectations, including a 34% year-on-year increase in Bitcoin (BTC) revenue.\n\nIn a Q2 earnings call, Block reported a whopping $2.4 billion in Bitcoin sales on its Cash App platform, with gross profit from Bitcoin sales coming in at $44 million, a 7% increase from the same time last year.\n\nBlock’s revenue for the quarter increased 25.6% from $4.4 billion to $5.53 billion year on year, meaning nearly half came from Bitcoin sales alone.\n\nOur Q2 earnings are now available. $SQ https://t.co/oGcnRuzFb3 — Block Investor Relations (@BlockIR) August 3, 2023\n\nThe company attributed the increase in Bitcoin revenue to customers continuing to purchase the crypto asset despite a decline in price over the course of the last year.\n\n“The year-over-year increase in bitcoin revenue and gross profit was driven by an increase in the quantity of bitcoin sold to customers, partially offset by a decrease in the average market price of bitcoin compared to the prior-year period.”\n\nHowever, the market failed to register a positive response, with the price of Block shares closing down 5.6% in after-hours trading, according to data from Google Finance.\n\nDespite beating earnings expectations, Block's share price fell 5.6% in after hours trading. Source: TradingView\n\nBlock also highlighted its own Bitcoin investments, noting a purchase of $50 million in Q4 2020 and an additional $170 million in Q1 2021.\n\n“As of June 30, 2023, the fair value of our investment in Bitcoin was $245 million based on observable market prices, which was $142 million greater than the carrying value of the investment after cumulative impairment charges,” read the earnings report.\n\nRelated: Cathie Wood’s ARK loads up crypto bags, buys $19.9M Block shares\n\nOverall, Block Inc. reported a gross profit of $1.87 billion — a 27% increase year over year — while Cash App continued to show strength with $968 million in gross profits, up 37% on the year.\n\nBlock Inc. gross profits Q2 2023. Source: Block\n\nDeposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA4LzAzL2lmLXRoaXMtb25lLXZhbHVhdGlvbi1tb2RlbC1pcy1yaWdodC10aGVuLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "If This One Valuation Model Is Right, Then Bitcoin Is a Screaming Buy - The Motley Fool",
        "content": "Looking ahead to 2024, a growing number of investors are expecting the price of Bitcoin (BTC -0.19%) to surge in value. Some expect Bitcoin to soar past the $100,000 level, and still others expect Bitcoin to skyrocket past the $1 million mark.\n\nBut just how realistic are any of these predictions? After all, sometimes it feels like Bitcoin price predictions are based on nothing more than hope and a prayer. But there's one popular Bitcoin valuation model that has the attention of investors, and it's currently sending out some very bullish signals right now. Let's take a closer look.\n\nThe Stock-to-Flow model\n\nWhile there are a variety of ways to model Bitcoin's future price, one of the most popular is known as the Stock-to-Flow (S2F) model. Simply stated, this is a way to model the future price of Bitcoin by treating it like a store-of-value commodity, much like gold, silver, or platinum. That makes sense, on a certain level, because Bitcoin has often been called \"digital gold.\"\n\nThe Stock-to-Flow model attempts to calculate the relative scarcity of Bitcoin in order to arrive at a valuation for the cryptocurrency. You simply divide the current existing supply of Bitcoin by the amount of new production that's coming online each year from Bitcoin miners and then plug this number into a simple mathematical formula. The Stock-to-Flow model relies on two primary inputs -- the amount of total circulating Bitcoin supply and the rate at which Bitcoin is currently being mined -- and both of these numbers are publicly available.\n\nRight now, for example, the total circulating supply of Bitcoin is 19.444 million coins. From the original Bitcoin white paper, we know that the total lifetime supply of Bitcoin is capped at 21 million coins and that the final Bitcoin will be mined in the year 2140. Thus, 92.6% of all Bitcoin has already been mined, and over the next 117 years, there will be a race to mine the remaining 7.4% of Bitcoins that are yet to be produced. As the scarcity of Bitcoin increases over time, we would expect the value of Bitcoin to increase as well.\n\nThe Bitcoin halving\n\nIn 2024, things get really interesting because that's when the next Bitcoin halving takes place. In a halving event, the total reward for mining a new block of Bitcoin drops by one-half. This is determined algorithmically and can not be changed. This halving obviously impacts Bitcoin miners because it changes the amount of Bitcoin that they can mine. All things being equal, the same number of Bitcoin mining machines working at the same rate next year is going to produce half the amount of Bitcoin that they will this year.\n\nThis is important because it has an impact on calculations for the Stock-to-Flow model. If Bitcoin is being produced at a 50% lower rate (as a result of the mining reward being cut in half), that immediately changes the denominator of the Stock-to-Flow model, which in turn produces a much higher suggested value for Bitcoin. According to the Stock-to-Flow model, we would expect the value of Bitcoin to \"jump\" every four years, which is when every new halving takes place. And indeed, this has been the case in 2012, 2016, and 2020.\n\nDrawbacks to this model\n\nHowever, there are several drawbacks to using this model. For one, it only takes into account the supply of Bitcoin. It does not factor into account demand (i.e., all the potential use cases of Bitcoin). And, as anyone knows from an introductory course in economics, the way you arrive at a price of an asset is by taking into account both supply and demand. That's why other valuation models for Bitcoin might have more predictive power.\n\nThe other big drawback is that this model can come up with some pretty ridiculous price targets. During the last big crypto boom, for example, Fidelity Investments used this same model to come up with a theoretical price of $100 million for Bitcoin. (Yikes!) The latest Bitcoin price target is anywhere from $100,000 to $1 million, according to PlanB, the anonymous creator of the Stock-to-Flow model.\n\nWhat happens to Bitcoin next?\n\nIf the Stock-to-Flow model is correct, then Bitcoin should be worth quite a bit more than it is now. Just how much higher, though, is still open for debate. Remember, as Warren Buffett once remarked, \"Price is what you pay; value is what you get.\" So, just because a valuation model says Bitcoin should be worth $100,000 by 2024 doesn't mean that's the price that people are going to be willing to pay for it."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOC8wMy9oYXNoa2V5LXdpbnMtaG9uZy1rb25ncy1maXJzdC1jcnlwdG8tZXhjaGFuZ2UtbGljZW5zZS10by1zZXJ2ZS1yZXRhaWwtY3VzdG9tZXJzL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOC8wMy9oYXNoa2V5LXdpbnMtaG9uZy1rb25ncy1maXJzdC1jcnlwdG8tZXhjaGFuZ2UtbGljZW5zZS10by1zZXJ2ZS1yZXRhaWwtY3VzdG9tZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Hong Kong Officially Opens Crypto Trading to Retail Investors, Grants First Licenses to HashKey, OSL - CoinDesk",
        "content": "HashKey Exchange, a unit of digital asset financial-services firm HashKey Group, announced the license on Thursday, saying it can now expand its business scope to retail users in addition to the professional investors it has been serving. The announcement was followed by another from OSL Digital Securities, a subsidiary of Hong Kong's BC Technology Group Ltd, that it also had obtained a license to serve retail customers."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hdWx0LWFsbGlhbmNlLWFubm91bmNlcy1zdWJzaWRpYXJ5LXNlbnRpbnVtLTEwMzAwMDc5MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ault Alliance Announces Its Subsidiary, Sentinum, Inc., Has Mined 909 Bitcoin From January 1, 2023 Through July 31 ... - Yahoo Finance",
        "content": "For the Month of July 2023 Sentinum Has Mined 145 Bitcoin for a Total Annualized Run Rate of 1,740 Bitcoin\n\nLAS VEGAS, August 04, 2023--(BUSINESS WIRE)--Ault Alliance, Inc. (NYSE American: AULT), a diversified holding company (\"Ault Alliance,\" or the \"Company\"), today announced that its wholly-owned subsidiary, Sentinum, Inc., mined a combined total of 909 Bitcoins from January 1, 2023 through July 31, 2023.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20230804902641/en/\n\nMichigan Data Center - Sentinum, Inc. Bitcoin Mining Operations (Photo: Business Wire)\n\nThis achievement includes the mining of 668 Bitcoins through its dedicated data center located in Michigan during the same period. An additional 241 Bitcoins were mined in partnership with Core Scientific, a leader in customizable infrastructure and software solutions for Blockchain networks, since the inception of the partnership on April 6th, 2023.\n\n\"We are excited to share our notable strides in Bitcoin mining with our stakeholders; this success underscores our strategic efficiency and dedication,\" stated Milton \"Todd\" Ault, III, Executive Chairman of Ault Alliance. \"By leveraging the growing opportunities in the digital asset sector, we stay committed to elevating shareholder value. We extend our appreciation to our partners at Core Scientific, whose significant contributions were instrumental in achieving these impressive figures.\"\n\nAult Alliance maintains its commitment to the exploration and utilization of Blockchain technology, contributing to the digital asset industry while providing substantial value to its shareholders.\n\nThis unaudited update underscores Ault Alliance’s unwavering dedication to transparency and maintaining open communication with its shareholders and the broader market.\n\nAult Alliance notes that all estimates and other projections are subject to the volatility in Bitcoin market price, the fluctuation in the mining difficulty level, the ability to build out and provide the necessary power for miners, and other factors that may impact the results of Bitcoin mining production or operations.\n\nStory continues\n\nFor more information on Ault Alliance and its subsidiaries, Ault Alliance recommends that stockholders, investors, and any other interested parties read Ault Alliance’s public filings and press releases available under the Investor Relations section at www.ault.com or available at www.sec.gov.\n\nAbout Ault Alliance, Inc.\n\nAult Alliance, Inc. is a diversified holding company pursuing growth by acquiring undervalued businesses and disruptive technologies with a global impact. Through its wholly and majority-owned subsidiaries and strategic investments, Ault Alliance owns and operates a data center at which it mines Bitcoin and colocation and offers hosting services for the emerging artificial intelligence ecosystems and other industries, and provides mission-critical products that support a diverse range of industries, including metaverse platform, oil exploration, crane services, defense/aerospace, industrial, automotive, medical/biopharma, consumer electronics, hotel operations and textiles. In addition, Ault Alliance extends credit to select entrepreneurial businesses through a licensed lending subsidiary. Ault Alliance’s headquarters are located at 11411 Southern Highlands Parkway, Suite 240, Las Vegas, NV 89141; www.ault.com.\n\nForward-Looking Statements\n\nThis press release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements generally include statements that are predictive in nature and depend upon or refer to future events or conditions, and include words such as \"believes,\" \"plans,\" \"anticipates,\" \"projects,\" \"estimates,\" \"expects,\" \"intends,\" \"strategy,\" \"future,\" \"opportunity,\" \"may,\" \"will,\" \"should,\" \"could,\" \"potential,\" or similar expressions. Statements that are not historical facts are forward-looking statements. Forward-looking statements are based on current beliefs and assumptions that are subject to risks and uncertainties. Forward-looking statements speak only as of the date they are made, and the Company undertakes no obligation to update any of them publicly in light of new information or future events. Actual results could differ materially from those contained in any forward-looking statement as a result of various factors. More information, including potential risk factors, that could affect the Company’s business and financial results are included in the Company’s filings with the U.S. Securities and Exchange Commission, including, but not limited to, the Company’s Forms 10-K, 10-Q and 8-K. All filings are available at www.sec.gov and on the Company’s website at www.ault.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230804902641/en/\n\nContacts\n\nAult Alliance Investor Contact:\n\nIR@ault.com or 1-888-753-2235"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL25ld3Muc2t5LmNvbS9zdG9yeS9hbWF0ZXVyLXJhcHBlci1hbmQtaGVyLWh1c2JhbmQtcGxlYWQtZ3VpbHR5LWFmdGVyLXRyeWluZy10by1sYXVuZGVyLXN0b2xlbi1iaXRjb2luLXdvcnRoLWJpbGxpb25zLTEyOTMzMzIy0gGJAWh0dHBzOi8vbmV3cy5za3kuY29tL3N0b3J5L2FtcC9hbWF0ZXVyLXJhcHBlci1hbmQtaGVyLWh1c2JhbmQtcGxlYWQtZ3VpbHR5LWFmdGVyLXRyeWluZy10by1sYXVuZGVyLXN0b2xlbi1iaXRjb2luLXdvcnRoLWJpbGxpb25zLTEyOTMzMzIy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Man and amateur rapper wife who went to great lengths to launder stolen Bitcoin plead guilty - Sky News",
        "content": "An amateur rapper and her husband have pleaded guilty to attempting to launder stolen Bitcoin.\n\nHeather Morgan and Ilya Lichtenstein went to desperate lengths in their attempts to convert billions of dollars worth of cryptocurrency into cash.\n\nAt the time of their arrest in 2022, the stash of 120,000 Bitcoin was worth $4.5bn (£3.5bn).\n\nThe US Department of Justice managed to recover $3.6bn (£2.8bn) of this, in what was the biggest financial seizure in its history.\n\nWhile the couple were only accused of laundering this cryptocurrency rather than stealing it, Lichtenstein has now admitted that he was the person who hacked the Bitfinex exchange in 2016.\n\nThe 35-year-old then enlisted his wife in an elaborate scheme that involved burying gold coins and burning documents in a bin in Kazakhstan.\n\nProsecutors had accused the pair of creating fake identities to set up online trading accounts so they could launder the Bitcoin.\n\nDetectives found folders on Lichtenstein's computer named \"personas\" - and a plastic bag labelled \"burner phones\" was also discovered under their bed.\n\nThey also used their ill-gotten gains to buy non-fungible tokens, and Walmart gift cards.\n\nAdvertisement\n\nHeather Morgan called herself as \"Razzlekhan\" in her rap videos, and claimed she was the \"Crocodile of Wall Street\".\n\nIn the past, she had also worked as a public speaker, and held an event in New York called \"How to Social Engineer Your Way Into Anything\".\n\nHer tips for crashing an event included wearing black T-shirts to look like security, and wearing as many layers as possible so outfits could change at short notice.\n\nThe husband and wife had entered into a plea deal late last month, and a date for their sentencing has not been set.\n\nAt the time of their arrest, officials said they could face up to 20 years behind bars if convicted."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzAzL2JpbmFuY2UtYm9vc3RzLWZpcnN0LWRpZ2l0YWxzLXN0YWJsZWNvaW4td2l0aC16ZXJvLWZlZXMtdG8tYnV5LWFuZC1zZWxsLWJpdGNvaW4tZXRoZXIv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDMvYmluYW5jZS1ib29zdHMtZmlyc3QtZGlnaXRhbHMtc3RhYmxlY29pbi13aXRoLXplcm8tZmVlcy10by1idXktYW5kLXNlbGwtYml0Y29pbi1ldGhlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Binance Boosts First Digital's Stablecoin With Zero Fees to Buy and Sell Bitcoin, Ether - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LnRoZXJlZ2lzdGVyLmNvbS8yMDIzLzA4LzA0L2NvdXBsZV9iaXRmaW5leF9oYWNrX2d1aWx0eS_SAUdodHRwczovL3d3dy50aGVyZWdpc3Rlci5jb20vQU1QLzIwMjMvMDgvMDQvY291cGxlX2JpdGZpbmV4X2hhY2tfZ3VpbHR5Lw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Couple admit they laundered $4B in stolen Bitcoins after Bitfinex super-heist - The Register",
        "content": "Ilya Lichtenstein and Heather Morgan on Thursday pleaded guilty to money-laundering charges related to the 2016 theft of some 120,000 Bitcoins from Hong Kong-based Bitfinex.\n\nThe Feds arrested Lichtenstein, 35, and Morgan, 33, in February 2022 following the US government's tracing of about 95,000 of the stolen BTC – worth about $3.6 billion at the time and $2.8 billion today – to digital wallets controlled by the married couple.\n\nIn case you're wondering, 120,000 BTC in August 2016, when Bitfinex was ransacked, was worth about $70 million; by February 2022, it would have been about $4.8 billion; and today, it's about $3.6 billion. At Bitcoin's peak, $65,000 a pop in 2021, the stash would have hit $7.8 billion.\n\nThe Justice Department at the time described the seizure as the largest ever and has since recovered an additional $475 million.\n\nLichtenstein, a Russian national, founded MixRank, a marketing firm, and Endpass, a decentralized identity platform, and owned a single-member investment entity called Demandpath. Morgan was the CEO of SalesFolk, a marketing firm, and briefly became something of an internet celebrity for her entrepreneurial rapping under the name Razzlekhan.\n\nLichtenstein admitted in court he gained access into Bitfinex's network using unidentified tools and techniques. According to prosecutors, once inside, Lichtenstein proceeded to initiate more than 2,000 fraudulent transactions that sent 119,754 bitcoin from Bitfinex into a cryptocurrency wallet he controlled.\n\nThereafter, the Justice Department said, he tried to cover his tracks by deleting access credentials and log files, and then involved Morgan to help launder the stolen funds by transferring them through a maze of financial accounts. At one point Lichtenstein used some of the funds to buy gold coins, which were then buried by Morgan.\n\nAn affidavit [PDF] from IRS investigator Christopher Janczewski, which documents the basis of the US government's case, traces the flow of stolen funds through multiple accounts associated with the defendants.\n\nShortly before the couple's arrest, the affidavit says, the Feds \"gained access to wallet 1CGA4s by decrypting a file saved to Lichtenstein's cloud storage account, which had been obtained pursuant to a search warrant. The file contained a list of 2,000 virtual currency addresses, along with corresponding private keys. Blockchain analysis confirmed that almost all of those addresses were directly linked to the hack.\"\n\nJanczewski noted that some of the information that helped investigators came from \"private entities that the US government believes to be reliable,\" and that some of these may be financially motivated, specifically by \"a sizable reward related to the return of the stolen funds\" offered by Bitfinex.\n\nIn July, Bitfinex announced that it received $312,219.71 in cash and 6.917 BCH from the United States Department of Homeland Security related to the 2016 robbery. It is using the recovered funds to redeem Recovery Right Tokens (RRTs) issued to account holders after the incident as a form of speculative compensation to the attack's victims.\n\nLichtenstein faces up to 20 years in prison after pleading guilty to conspiracy to commit money laundering. Morgan pleaded guilty to two counts – money laundering conspiracy and conspiracy to defraud the US – and faces up to five years in prison for each count. ®"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtMjlrLWJpdGNvaW4tcnNpLWFuYWx5c2lzLXRyYWRlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "BTC price upside 'yet to come' at $29K after Bitcoin RSI reset — Trader - Cointelegraph",
        "content": "Bitcoin (BTC) has not yet seen the majority of its gains this cycle, one popular trader believes.\n\nIn an Aug. 3 post on X (formerly Twitter), Credible Crypto doubled down on his bullish BTC price thesis.\n\nCredible Crypto: Bitcoin still to see “biggest upside moves”\n\nAfter over a month of acting within a tight trading range, traders’ patience with Bitcoin is wearing thin.\n\nAmid expectations that BTC price will test levels closer to $25,000 or even lower, Credible Crypto is one of those arguing the opposite.\n\nAnalyzing data, including Bitcoin market cap dominance and its relative strength index (RSI), he concluded that conditions had been reset.\n\n“Biggest upside moves on BTC are YET TO COME,” he summarized.\n\n“A month of sideways action on BTC and dominance has simply made a higher low. H12 bullish div confirmed, RSI on higher TF looks reset, maintaining above the ‘magic’ 40 RSI level, who's ready for the next leg up?”\n\nBTC/USD annotated chart with RSI. Source: Credible Crypto/Twitter\n\nRSI measures the price strength of an asset at a specific price point and is currently consolidating on daily timeframes after Bitcoin’s July spike to one-year highs failed to sustain.\n\nCredible Crypto is known for his optimism when it comes to how Bitcoin will evolve in the coming year and beyond.\n\nAs Cointelegraph reported in June, he predicted that BTC/USD would need only four months to challenge its current all-time highs of $69,000 seen in November 2021.\n\n“I am not saying we MUST hit new all time highs by October, I AM saying I do think we will hit new ATH by the end of this year and if someone forced me to pick a month in which I think this will occur it would be October. Let’s see how things play out,” he wrote at the time.\n\nA more recent video update in late July made a fresh reference to Bitcoin’s upcoming “parabolic advance” to eclipse those highs.\n\n“Early bull market price action, period”\n\nContinuing, fellow trader CryptoCon flagged RSI over longer timeframes to deliver a similarly bullish take on BTC price performance.\n\nRelated: BTC price risks new sub-$29K dip as Binance fears test Bitcoin bulls\n\n“Bitcoin bears and recession callers are relentless just below yearly highs... astounding!” part of an X post stated on Aug. 3, saying that those bears had “no patience.”\n\n“I see price going sideways, and I've never been more bullish! Just wait until we break into phase 2 on the 3 Week RSI... Early bull market price action, period.”\n\nAn accompanying chart showed RSI peaks and troughs over the years, with current conditions reminiscent of a pre-breakout stage.\n\nBitcoin RSI phases chart. Source: CryptoCon/Twitter\n\nMagazine: Experts want to give AI human ‘souls’ so they don’t kill us all\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVycy1idGMtcHJpY2UtOThrLWhhbHZpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin miners need BTC price over $98K by the halving — Analysis - Cointelegraph",
        "content": "Predictions that Bitcoin (BTC) will see a six-figure price by the end of 2024 continue to surface despite the BTC price losing the $30,000 level recently.\n\nFor publicly-listed Bitcoin miners, in particular, a price north of $100,000 may be more of a necessity than a forecast if their business models are to remain profitable.\n\nBitcoin halving: Bad news for public miners?\n\nBitcoin mining stocks have been on a tear this year, outperforming BTC by a wide margin in recent months. While BTC has seen reduced volatility and a period of consolidation, Bitcoin mining companies’ stocks have risen by nearly 100% in a matter of months.\n\nRecent performance of popular BTC mining stocks. Source: Seeking Alpha\n\nA recent report by Seeking Alpha explores BTC mining by examining one popular miner in particular: Riot Platforms.\n\nIt notes that despite Riot being expected to triple its mining capacity in 2024, the company and Bitcoin miners, in general, could face serious headwinds from the halving. A 50% decrease in BTC block rewards cuts miners’ main source of revenue in half.\n\nMiners like Riot can also issue new equity shares to fund their operations. This dilutes existing shares, meaning that even if the company’s underlying fundamentals are sustained, the share price may not keep up.\n\nRelated: $160K at next halving? Model counts down to new Bitcoin all-time high\n\nCombine this with the fact that many miners could already be overbought at current valuations, and things don’t look too rosy for public Bitcoin mining stocks. Although public mining stocks have outperformed Bitcoin in 2023, an increase in BTC being sent to exchanges could indicate a decline in momentum.\n\nA big increase in Bitcoin’s price will therefore be required for miners to remain profitable at today’s hash rate levels.\n\nBitcoin miners have had a banger of a year.\n\n\n\nRIOT is up 457%\n\nMARA is up 421%\n\nBITF is up 337%\n\nCLSK is up 246%\n\n\n\nBoth Bitcoin and Nvidia rose by less than public miners this year — 80% and 222% respectively.\n\n\n\nThe best way to get leveraged/high-beta exposure to BTC.\n\n\n\nh/t @zackvoell pic.twitter.com/xTsJqikh0L — Joe Consorti ⚡ (@JoeConsorti) July 18, 2023\n\nMiners might need six-figure Bitcoin to stay afloat\n\nHow high does the BTC price need to go for miners to maintain their current valuations? The report mentioned above concludes that nearly $100,000 could be required for miners to carry on as usual:\n\n“Unless Bitcoin outperforms our Bitcoin thesis, we don’t see any way where the Bitcoin sector can come out unscathed. Even with RIOT’s ambitious 35 EH/s, our model suggests that Bitcoin needs to trade above $98,000 to justify RIOT’s current valuation (post-halving).”\n\nBased on this, the report warns that “hodling” BTC mining stocks is “extremely risky,” as underlying fundamentals may not keep pace with current valuations that may not be pricing in next year’s Bitcoin halving yet.\n\nBTC price to $125,000 in 2024?\n\nMeanwhile, a recent report from Matrixport entitled “Matrix on Target: Prepare for the Soaring 2024 Year-End Bitcoin Target of $125,000” describes how BTC could reach $45,000 by year-end and $125,000 by the end of 2024.\n\nThe significance of Bitcoin price reaching a one-year high for the first time in a year is emphasized by the authors.\n\nThis signal has marked the beginning of a new bull market every time in the past:\n\n“On June 22, 2023, Bitcoin made a new one-year high, marking the first time in a year. This signal has historically indicated the end of bear markets and the start of new crypto bull markets. Previous occurrences took place in August 2012, December 2015, May 2019, and August 2020, with the actual bull markets materialising in 2013, 2017, and 2021.”\n\nIt continues:\n\n“This signal has been triggered four times and in all four cases, the bull market fully unfolded within 12-18 months. If history is any guide, then, there is now a 100% probability that by the end of 2024, Bitcoin will experience another massive bull market with a price target of $125,000 (+310%) - based on the previous three signals.”\n\nThis six-figure Bitcoin price prediction echoes numerous others. Standard Chartered, for example, forecasts a $120,000 Bitcoin price by the end of 2024. Interestingly, this is largely based on BTC miners not selling Bitcoin before the halving.\n\nBitcoin may reach $120,000 by the end of 2024, Standard Chartered forecasts, as an expected improvement in crypto miners' fortunes allows them to hold on to more of the tokens https://t.co/Z9z0BbKCqS — Bloomberg Crypto (@crypto) July 11, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnVuaWxhZC5jb20vbmV3cy9tb25leS9iaXRjb2luLWRhdmluY2ktamVyZW1pZS13aGVyZS1pcy1oZS1ub3ctMzIwNzI5LTIwMjMwODAz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Man who told everyone to buy just $1 of Bitcoin 10 years ago now lives an amazing life - UNILAD",
        "content": "You can call him a genius or you can call him lucky - but either way - he's filthy rich.\n\nDavinci Jeremie is the man who told everyone to buy just $1 of Bitcoin 10 years ago and pretty much no one listened.\n\nLoading…\n\nAdvert 10\n\nIn May 2013, when Jeremie told the world to invest in crypto, the price of one Bitcoin per 1$ was $116.75.\n\nAt its peak in 2021, one Bitcoin was worth a whopping $61,000.\n\nEven though crypto has taken a dip in recent months, its value is still at $30,000.\n\nNot to rub it in like. Credit: Instagram/@davincij15\n\nAdvert 10\n\nBut Jeremie would have already made his money by now and the man from Chile clearly lives a lavish life, from private planes and flash cars to beach holidays and private yachts.\n\nOn his Instagram, he's often tagged in places like Monte Carlo and Dubai, which are famously welcoming to the super-wealthy.\n\nHe describes himself in his Twitter bio as a 'Family Man, Programmer, YouTuber, and early Bitcoin adopter', as one of his posts is captioned: \"Me living like a boss!\"\n\nTo be fair, that seems to be quite an accurate description.\n\nAdvert 10\n\nHe's living it up. Credit: Instagram/@davincij15\n\nAnd his incredible life apparently all came from his savvy investment in Bitcoin.\n\nAlong with the video he posted back in 2013, Davincie wrote: \"Look, for the price of [a] lotto ticket you can hold Bitcoin (BTC) for 10 years and become a millionaire. It's time you stop living in fear. If it goes to zero you lose $1, who cares!!!\n\n\"But if I'm right I want all of you to thank me, it will not make me happy if you come back to me in 10 years saying 'dude, I wish I listened to you back 2011 or 2013'.\"\n\nAdvert 10\n\nDavinci Jeremie is the man who told everyone to buy just $1 of Bitcoin 10 years ago and pretty much no-one listened. Credit: YouTube\n\nHe added an explanation in his video, posting: \"Just so you know, Bitcoin is a digital crypto and global money system currency. I talk about technical analysis of Bitcoin, Ethereum, and crypto and how I make money trading BTC.\n\n\"Bitcoin allows people to send or receive money across the internet, without a third party.\"\n\nHe's also been reassuring followers on Twitter that the recent slump in Bitcoin is nothing to worry about.\n\nAdvert 10\n\nTaking to social media, one follower joked: \"Can you next do a story about those who bought Bitcoin at $64,000?\"\n\nAnother added: \"I used to watch this guy on YouTube and nearly bought 2,600 bitcoin for £10.\n\n\"Had my card details in but the server I was buying from kept crashing so I ditched the transaction.\"\n\n\"He didn’t tell me. I should sue,\" someone else quipped."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vbmV3cy5zb3Bob3MuY29tL2VuLXVzLzIwMjMvMDgvMDQvY3JvY29kaWxlLW9mLXdhbGwtc3RyZWV0LWFuZC1oZXItaHVzYmFuZC1wbGVhZC1ndWlsdHktdG8tZ2lhbnQtc2l6ZWQtY3J5cHRvY3JpbWVzL9IBf2h0dHBzOi8vbmV3cy5zb3Bob3MuY29tL2VuLXVzLzIwMjMvMDgvMDQvY3JvY29kaWxlLW9mLXdhbGwtc3RyZWV0LWFuZC1oZXItaHVzYmFuZC1wbGVhZC1ndWlsdHktdG8tZ2lhbnQtc2l6ZWQtY3J5cHRvY3JpbWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "“Crocodile of Wall Street” and her husband plead guilty to giant-sized cryptocrimes - Sophos",
        "content": "Back in August 2016, Heather Morgan, a.k.a. Razzlekhan, a.k.a. the Crocodile of Wall Street (actually, there’s a double-barrelled expletive in front of the word ‘crocodile’, but this is a family-friendly website so we’ll leave you to extrapolate for yourself), and her husband Ilya Lichtenstein got their hands on 120,000 of your finest bitcoins.\n\nAt the time, BTC was trading at about $600, so their stash was worth a cool $72,000,000.\n\nFor a couple in their mid-to-late 20s at the time, you’d imagine that sort of capital would fund a long life of idle luxury, especially if you stop to think that Bitcoin hasn’t traded below $10,000 for the past three years.\n\nEven if they’d burned through half of their original fortune by now, they’d still have close to $2 billion left at today’s rate, about 25 times as much as they started out with.\n\nBut things didn’t work out that way.\n\nThe problem was that Morgan and Lichtenstein hadn’t acquired those bitcoins legally, weren’t able to cash them out as quickly as they probably thought they could, and ultimately disovered that bitcoin anonymity only goes so far, especially if you’re stuck with the problem of trying to launder a large quantity of the world’s best-known cryptocurrency.\n\nIn early 2022, US law enforcement experts had pieced together enough of the couple’s BTC story to arrest them for trying to spend the proceeds of a crime:\n\nSimply put, the couple weren’t directly charged with stealing the bitcoinage in the first place, but for trying to cash it out despite knowing it was stolen.\n\nIn the court document submitted to apply for their arrest warrants, the victim is referred to simply as VCE, short for virtual currency exchange, but that VCE is now publicly known to be Bitfinex, so we have used that real name here:\n\nIn or around August 2016, a hacker breached [Bitfinex’s] security systems and infiltrated its infrastructure. While inside [Bitfinex’s] network, the hacker was able to initiate over 2,000 unauthorized BTC transactions, in which approximately BTC 119,754 was transferred […] to an [outside wallet]. […] US authorities traced the stolen funds on the BTC blockchain. As detailed [in the affidavit], beginning in or around January 2017, a portion of the stolen BTC moved out of [that wallet] in a series of small, complex transactions across multiple accounts and platforms. This shuffling, which created a voluminous number of transactions, appeared to be designed to conceal the path of the stolen BTC, making it difficult for law enforcement to trace the funds. Despite these efforts, […] US authorities traced the stolen BTC to multiple accounts controlled by ILYA “DUTCH” LICHTENSTEIN, a Russian-US national residing in New York, and his wife HEATHER MORGAN.\n\nFast forward just over a year-and-a-half, and both of the suspects have now pleaded guilty to money laundering charges.\n\nThis time, the US Department of Justice (DOJ) unambiguously states that Lichtenstein was the hacker referred to above, and offers some intriguing new details about how the couple tried to turn the stolen cryptocoins into ready money, including using some of the tainted bitcoins to buy gold, which they hid in the traditional way of robbers and pirates throughout the ages:\n\nAccording to court documents, Lichtenstein used a number of advanced hacking tools and techniques to gain access to Bitfinex’s network. Once inside their systems, Lichtenstein fraudulently authorized more than 2,000 transactions in which BTC 119,754 was transferred from Bitfinex to a cryptocurrency wallet in Lichtenstein’s control. Lichtenstein then took steps to cover his tracks by going back into Bitfinex’s network and deleting access credentials and other log files that may have given him away to law enforcement. Following the hack, Lichtenstein enlisted the help of his wife, Morgan, in laundering the stolen funds. Lichtenstein, at times with Morgan’s assistance, employed numerous sophisticated laundering techniques, including using fictitious identities to set up online accounts; utilizing computer programs to automate transactions; depositing the stolen funds into accounts at a variety of darknet markets and cryptocurrency exchanges and then withdrawing the funds, which obfuscates the trail of the transaction history by breaking up the fund flow; converting bitcoin to other forms of cryptocurrency, including anonymity-enhanced cryptocurrency (AEC), in a practice known as “chain hopping”; depositing a portion of the criminal proceeds into cryptocurrency mixing services, such as Bitcoin Fog, Helix, and ChipMixer; using US-based business accounts to legitimize their banking activity; and exchanging a portion of the stolen funds into gold coins, which Morgan then concealed by burying them.\n\nLichtenstein now faces up to 20 years in prison when he’s sentenced, while the Crocodile Lady faces up to 10 years behind bars.\n\nAs the law requires, and as the DOJ reminds everyone, “there will be a formal process at the conclusion of the case […] for third-party claimants to submit claims for any seized and forfeited property”.\n\nFascinatingly, that restitution process could produce some peculiar results for different claimants, depending on which stolen bitcoins got traded out and recovered in the form of gold, which ones were still in BTC form when seized, and how the assests are divided up amongst the claimants.\n\nFor example, if your bitcoins were stolen in 2016, cashed out for gold by the Crocodile Lady in early 2017, and were returned to you right now in the form of gold bullion, you’d end up with a reasonably healthy return of somewhere between 250% and 300%.\n\nThat’s because BTC went from about $600 in mid 2016 to roughly double that by early 2017 (x2), and gold has gone up from $1500 an ounce to $2000 an ounce since then (x1.3), for an overall gain of approximately 2×1.3 = 260%.\n\nIf your specific bunch of bitcoins ended up untouched by the guilty pair, however, and you were to get them back directly, they’d now be worth about 50 times what they were at the time of the heist, for a 5000% return.\n\nBut if your coins were swapped out for gold in late 2021, just before the Crocodile Lady was taken into custody, they’d have been worth more than 100 times their 2016 value at the time of the trade, and although the value of BTC is now less than half what it was then, gold has declined only very slightly, so you’d still be looking at a return of better than 10,000%.\n\nIn practice, we’re assuming that the total amount recovered will be divided proportionally between all claimaints, including those whose specific cryptocoins were cashed out along the way and spent on high living…\n\n…but it’s an intriguing reminder of how complex the and confusing the cryptocoin ecosystem can be.\n\nHOW CRYPTOCOINS CAN BE TRACKED\n\nIf you’re wondering how stolen and laundered transactions can be traced in a pseudoanonymous trading system such as Bitcoin…\n\n…you’ll enjoy this special episode of the Naked Security podcast in which we talk to best-selling US author Andy Greenberg about his awesome book on this very subject, Tracers in the Dark – The Global Hunt for the Crime Lords of Cryptocurrency:\n\nClick-and-drag on the soundwaves below to skip to any point. You can also listen directly on Soundcloud.\n\nYou can also find our podcasts on Apple Podcasts, Google Podcasts, Spotify and anywhere that good podcasts are found. Or just drop the URL of our RSS feed into your favourite podcatcher."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qb2UtYmlkZW4tYml0Y29pbi1jb2ZmZWUtbXVnLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "'Is this a Bitcoin ad?' Joe Biden unknowingly touts BTC in coffee mug video - Cointelegraph",
        "content": "United States President Joe Biden may have inadvertently become Bitcoin’s latest brand ambassador in a new \"cringe\" video advertising merchandise for his reelection campaign.\n\nOn Aug. 3, President Biden tweeted: “A cup of Joe never tasted better” along with a video of himself drinking coffee from a mug.\n\nA cup of Joe never tasted better.\n\n\n\nGrab yours: https://t.co/4fbxCBQNPZ pic.twitter.com/s2qboyE7C1 — Joe Biden (@JoeBiden) August 3, 2023\n\nThe Bitcoin and crypto community were quick to notice the design of the coffee mug, which features his face with glowing red “laser eyes” — a popular addition for Bitcoin enthusiasts when designing their profile pictures.\n\nWhile the origins of the meme are hazy, the laser eyes phenomenon kicked off as part of a movement across social media to drive Bitcoin’s price to $100,000 by the end of 2021 — a goal that didn’t come to fruition. The most notable laser-eyed personalities once included NFL star Tom Brady, Paris Hilton and Elon Musk.\n\nIt's typically used as a symbol for showcasing their bullish outlook for Bitcoin and cryptocurrencies more broadly.\n\nBiden’s post has been littered with responses from the crypto community, both delighted and amused by the obvious oversight.\n\n“Joe Biden is a Bitcoin maxi now. Laser eyes and everything. Haters in disbelief,” declared one user.\n\nsleepy joe w the laser eyes and you think etf getting rejected? https://t.co/i4JyLoPqze — Hal Press (@NorthRockLP) August 3, 2023\n\nOther users piled on, saying that Biden had just provided the “biggest endorsement of Bitcoin history” while another suggested that Biden was trying to “win over Bitcoin maxis.”\n\nRelated: Republican candidate wants to end President Biden’s supposed ‘war on Bitcoin’ if elected\n\nThe Biden administration has been criticized by the community for its not-so-welcoming stance towards crypto which includes controversial tax proposals for digital asset miners and other “anti-crypto” political efforts. It is thus unlikely the coffee mug design was in reference to Bitcoin.\n\nThe coffee mug’s name is in reference to “Dark Brandon” — Biden’s meme-based online alter-ego. The Dark Brandon meme depicts Biden as darker and edgier — often used by his supporters to tout his policy victories.\n\nMagazine: Chinese police vs. Web3, blockchain centralization continues: Asia Express"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMy1hdWd1c3QtMjAyMy9hcnRpY2xlc2hvdy8xMDIzODU0NjkuY21z0gG_AWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0zLWF1Z3VzdC0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDIzODU0NjkuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tanks below $29,100; Litecoin, Solana shed up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nTop crypto tokens were trading in the red in Thursday's trade amid reports that US Department of Justice officials are considering fraud charges against crypto exchange Binance.\"Bitcoin surged to US$30,000 yesterday after the positive developments from Fitch downgrade of U.S Treasurys and Microstrategy plan to purchase more bitcoin. However, soon after a news website wrote about Binance could face US fraud charges, BTC immediately started to drop,\" Edul Patel, Co-founder and CEO at Mudrex, said.\"Currently, it is trading above the US$29,100 level. On the other hand, institutional investors await the US SEC's decision on the approval of a Bitcoin Spot ETF. Despite the excitement surrounding Litecoin 's halving event, the coin's value plummeted by more than 5% in the last 24 hours. In the same timeframe, Uniswap's token also experienced a significant decline of over 7.8%,\" he added.Bitcoin (BTC) fell 2% to $29,030, meanwhile, its largest peer, Ethereum, was also trading lower and declined below the $1,850 level.Other top crypto tokens, BNB, XRP, Dogecoin , Solana, Polygon and Litecoin were also trading lower on Thursday.The total volume in DeFi is currently $2.98 billion, 8.96% of the total crypto market 24-hour volume. The volume of all stablecoins is now $31.25 billion, which is 93.91% of the total crypto market 24-hour volume.Meanwhile, the global cryptocurrency market cap was trading lower, around $1.16 trillion, falling 1.57% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $563 billion. Bitcoin's dominance is currently 48.56%, a decrease of 0.08% over the day, according to CoinMarketCap. BTC volume stood at approximately $15.5 billion, falling 21.08% in the last 24 hours.\"Bitcoin is currently engaged in a fierce battle between buyers and sellers, with the sellers holding a slight advantage at the moment. On August 2nd, the US equities markets experienced profit-taking, which also caused the recovery in the crypto market to come to a halt,\" said ZebPay Trade desk.Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said, \"BTC 4-hour chart reveals interesting setup after correction. Price at 0.5 and 0.618 Fibonacci support indicates a potential recovery and will trigger a bullish trend.\"\"However, a drop below this range could signal concern and risk further decline to the $25,000 support. Traders are waiting for confirmation of support for a possible bullish recovery or closely watching for a breakdown with a potential short-term drop to $25,000,\" Sathvik added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.58 hours, IST on August 3, 2023)Bitcoin $29,030 -2.00%Ethereum $1,832 -1.36%Tether $0.9989 -0.04%BNB $239 -2.18%XRP $0.6714 -3.3%Cardano $0.2954 -3.26%Dogecoin $0.07423 -3.57%Solana $23.71 -4.27%Polygon $0.6738 -2.72%Litecoin $86.33 -5.49%Polkadot $5.01 -2.73%Tron $0.07649 -1.55%Shiba Inu $0.000008224 -0.96%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vcm9iYnJlcG9ydC5jb20vbGlmZXN0eWxlL25ld3MvYml0Y29pbi1ib25uaWUtY2x5ZGUtbW9uZXktbGF1bmRlcmluZy1zY2hlbWUtMTIzNDg3NzEzMy_SAWJodHRwczovL3JvYmJyZXBvcnQuY29tL2xpZmVzdHlsZS9uZXdzL2JpdGNvaW4tYm9ubmllLWNseWRlLW1vbmV5LWxhdW5kZXJpbmctc2NoZW1lLTEyMzQ4NzcxMzMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "A ‘Bitcoin Bonnie and Clyde’ Plead Guilty to a $4.5 Billion Cryptocurrency-Laundering Scheme - Robb Report",
        "content": "A Russian-born tech entrepreneur and his rapper wife are facing the music in federal court.\n\nOn Thursday, Ilya Lichtenstein and Heather Morgan pleaded guilty to orchestrating a $4.5 billion money laundering scheme that took place in 2016. The couple, arrested in 2022 and nicknamed the “Bitcoin Bonnie and Clyde,” reportedly stole the funds by hacking cryptocurrency exchange Bitfinex. Lichtenstein and Morgan shared their pleas with Judge Collen Kollar-Kotelly in federal court as part of a cooperation deal with prosecutors, CNN reported.\n\nWhen the duo was arrested last year, the Justice Department called what they found its “largest financial seizure ever.” Yet until their hearing this week in Washington, D.C., Morgan and Lichtenstein had not been implicated in the hacking of Bitfinex. Further investigation revealed that Lichtenstein “used a number of advance hacking tools and techniques to gain access to Bitfinex’s network.” His methods allowed him to fraudulently authorize over 2,000 transactions and transfer nearly BTC120,000 to a crypto wallet of his own.\n\nThe disgraced businessman then “took steps to cover his tracks,” prosecutors claim, going so far as to enlist his wife’s help in stealing the money. Morgan, an aspiring rapper aliased as “Razzlekhan,” has bragged about being “the crocodile of Wall Street” in her music and claims to “make the weird kids feel at home,” according to her bio on the social media site X, formerly known as Twitter. The attention-seeking bandit has been placed on house arrest. Her husband will remain in jail as they await sentencing.\n\nLichtenstein pleaded guilty to conspiracy to commit money laundering, which could land him a maximum sentence of 20 years in prison. His wife has also pleaded guilty to one count of money laundering conspiracy and one count of conspiracy to defraud the United States. Both counts carry a max of five years in prison, which means that Morgan could serve up to 10 years in jail. Lichtenstein entered a cooperative agreement with the government to testify and meet with law enforcement as requested, without the presence of his attorney.\n\nThe couple can ask the judge for sentences below the guidelines should prosecutors find their cooperation sufficient. But would the punishment still fit the crime for stealing billions?"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9taWNyb3N0cmF0ZWd5cy1yZXNvbHV0ZS1wYXRoLXdpdGgtYml0Y29pbi11bmRhdW50ZWQtYnktcG90ZW50aWFsLWV0Zi1hcHByb3ZhbHMvODcyNzUvMdIBjQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYW1wL2FydGljbGUvY3J5cHRvY3VycmVuY3kvbWljcm9zdHJhdGVneXMtcmVzb2x1dGUtcGF0aC13aXRoLWJpdGNvaW4tdW5kYXVudGVkLWJ5LXBvdGVudGlhbC1ldGYtYXBwcm92YWxzLzg3Mjc1LzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "MicroStrategy's resolute path with Bitcoin: Undaunted by potential ETF approvals - Forbes India",
        "content": "\n\n\n\nMicroStrategy, a prominent software developer known for its substantial Bitcoin holdings, plans to raise $750 million by selling additional stock. The company aims to utilise the funds for various purposes, including acquiring more Bitcoin. Following the announcement, the price of Bitcoin experienced a noticeable rise.\n\nMicroStrategy's Chairman, Michael Saylor, has been a vocal advocate for Bitcoin, leading the company to buy billions of dollars worth of the crypto since the onset of the pandemic. The company has previously utilised stock and equity sales to fund its Bitcoin purchases as part of its strategy. This latest move reaffirms their commitment to expanding their Bitcoin holdings.\n\n\n\n\n\nCurrently, MicroStrategy holds an impressive 152,800 bitcoins, which translates to an approximate value of $4.5 billion. The decision to raise funds through stock sales aligns with the company's intention to bolster its crypto investments further.\n\n\n\n\n\nSaylor is confident that even if a spot Bitcoin ETF gains approval, MicroStrategy will remain an appealing option for investors seeking Bitcoin exposure. He believes the company's unique operating strategy differentiates it from traditional ETFs.\n\n\n\n\n\nIn a recent interview, Saylor likened the potential impact of a Bitcoin ETF approval to a \"supertanker\" and MicroStrategy to a \"sports car.\" He anticipates that the ETF's approval will attract more significant investments into the crypto space, primarily from large hedge funds.\n\n\n\n\n\nDespite fluctuations in MicroStrategy's stock, Saylor remains optimistic about the firm's role in the Bitcoin ecosystem. The company's aggressive investment approach and the potential approval of a Bitcoin ETF could reshape the crypto investment landscape, offering new opportunities for all market participants.\n\n\n\n\n\nMicroStrategy's immense influence in the crypto space is evident through its substantial Bitcoin holdings, and its commitment to acquire more coins underscores its confidence in the digital asset. With the potential influx of funds from the stock sale, MicroStrategy is well-positioned to remain a key player in the Bitcoin market.\n\n\n\nThe writer is the founder at yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb3VsZC1hLWJpdGNvaW4tYnVsbC1ydW4tYmUtdHJpZ2dlcmVkLWJ5LWZpdGNoLXMtdXMtY3JlZGl0LXJhdGluZy1kb3duZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Could a Bitcoin bull run be triggered by Fitch's US credit rating downgrade? - Cointelegraph",
        "content": "On Aug. 1, a significant event occurred within the financial world: Fitch, a reputable credit ratings agency, lowered the credit rating of the United States government from the pristine AAA to AA+. This downgrade signaled diminished confidence in the U.S. government’s ability to handle its fiscal responsibilities effectively.\n\nThe downgrade nudged investors into a cautious stance, leading many to move their money out of assets like stocks, silver, oil and long-term bonds. Instead, they favored cash and short-term instruments, which are perceived as safer options in uncertain times.\n\nS&P 500 futures (blue), WTI oil futures (cyan), U.S. 20-year notes (yellow), silver (orange). Source: TradingView\n\nAs evident from the above chart, the reaction to Fitch’s decision to downgrade the U.S. government’s credit rating was broad-based, affecting commodities, fixed income and equities alike. This has implications for various financial institutions and investment portfolios, including Bitcoin (BTC).\n\nTraders are now contemplating if Bitcoin’s digital scarcity and censorship resistance can offer refuge from the widespread “flight to safety” movement instigated by the deteriorating credit score of the world’s largest economy.\n\nThe downgrade had little impact on markets\n\nA Moody’s Analytics report from May hinted at a potential domino effect, where a downgrade of U.S. Treasury debt could lead to further downgrades in the financial sector. Notably, only Fitch and S&P have marked U.S. debt as AA+, while Moody’s still holds it at AAA with a stable outlook.\n\nInterestingly, the cost of insuring U.S. sovereign debt against default, as indicated by credit default swaps, has largely remained stable post-downgrade, a surprising development in the face of such significant news.\n\nU.S. 5-year Treasuries credit default swaps value. Source: World Government Bonds\n\nThis financial instrument protects against the risk of default on debt, working similarly to an insurance policy, where investors pay a premium to receive compensation if the issuer of the debt (in this case, the U.S. government) defaults.\n\nThis stability indicated that investors were not panicking about the immediate impact of the downgrade. A potential reason is that U.S. Treasurys are considered one of the safest investments globally because they are backed by the U.S. government. The issuer guarantees that it will repay the debt on the specified maturity date, including interest.\n\nU.S. 5-year Treasury yield, 12-hour chart. Source: TradingView\n\nNote that the recent daily yield fluctuations appear less significant given the five-year government note yield’s consistent rise over the last two weeks. This can be linked to eroding investor confidence in U.S. debt management, prompting demand for higher yields.\n\nApart from the Treasurys' yield dynamics, a falling U.S. Dollar Index (DXY) — which gauges the U.S. dollar’s value relative to other currencies — could spell trouble. If it leads to dwindling faith in traditional assets, investors might seek alternative stores of value, potentially boosting Bitcoin’s appeal.\n\nU.S. Dollar Index (DXY). Source: TradingView\n\nIn the last two weeks, the DXY has risen from 99.50 to 102.60, implying a potential sentiment shift among investors. They might be moving away from Treasurys, equities and commodities to seek refuge in cash, highlighting the dollar’s appeal during uncertainty.\n\nRelated: How will Bitcoin halving affect BTC price, and is DeFi dead?\n\nThe outlook for Bitcoin’s price in the short term is negative\n\nThe resilience of credit default swaps for U.S. Treasurys and the strengthening dollar, as per the DXY, suggest that investors might be enhancing cash holdings in anticipation of market turmoil.\n\nConsequently, Bitcoin might not immediately thrive from the U.S. government’s debt profile downgrade. The initial flight to liquidity often overlooks the benefits of decentralized assets during early market turbulence.\n\nGiven Bitcoin’s digital scarcity and fixed supply, it stands out as a valuable asset amid expanding government debt, which can depreciate cash. As a result, investors may increasingly consider Bitcoin a safe haven and a robust asset class that is resistant to censorship due to its decentralized nature.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNhbmFkYS1iaXRjb2luLWNyeXB0by1vd25lcnNoaXAtZGVjbGluZS0yMDIyLWNlbnRyYWwtYmFua9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Canadian crypto ownership declines amid tight regulations, falling prices - Cointelegraph",
        "content": "The Bank of Canada (BoC) reported a decline in the ownership of Bitcoin (BTC) and cryptocurrencies in the country in 2022, as neither market conditions nor regulations sided in favor of Canadian crypto investors, according to a BoC study published on July 26.\n\nThe study includes data from the annual Bitcoin Omnibus Survey conducted by the Canadian central bank, which showed a relapse from the massive crypto adoption witnessed in 2021.\n\nBitcoin awareness and ownership in Canada, 2016 to 2022. Source: Bank of Canada\n\nThe above graph shows that Bitcoin ownership in Canada declined to 9% by August 2022. However, BTC adoption saw a slight uptick to 10% by the end of the year, and the drop in Bitcoin ownership does not imply that investors were spreading out their investments into other cryptocurrencies. The report read:\n\n“Investors did not appear to shift out of Bitcoin and into other cryptoassets, as we observe decreased ownership of altcoins.”\n\nThe biggest motivation for Canadians interested in Bitcoin is as an investment, according to over one-third of the 4,996 respondents in the Bank of Canada’s 2022 survey.\n\nPercentage of Canadians who own Bitcoin, 2016 to 2022. Source: Bank of Canada\n\nMost Canadians acquired their crypto holdings through mobile and web apps. Bitcoin and crypto mining became the third-most-popular method of accumulating tokens for the second consecutive year.\n\nWhen it comes to the altcoin ecosystem, Dogecoin (DOGE) was the most sought-after crypto investment considering the Elon Musk-induced hype and its history of randomly skyrocketing in price. Ether (ETH), Bitcoin Cash (BCH) and Litecoin (LTC) were some of the other popular altcoins among Canadians.\n\nRelated: Parliamentary report recommends Canada recognize, strategize about blockchain industry\n\nAccording to the BoC, the research is relevant for monitoring the two conditions that could warrant the issuance of an in-house central bank digital currency (CBDC): “if Canadians almost or do stop using cash, or if Canadians widely adopt and use private cryptocurrencies for payments.”\n\nHey Canada, we need your input!\n\n\n\nOur public consultation on a potential #DigitalCanadianDollar is now LIVE. #HaveYourSay by June 19: https://t.co/p8BdG3tQ9h pic.twitter.com/vKRoBfAngu — Bank of Canada (@bankofcanada) May 8, 2023\n\nThe BoC highlighted that ecosystem collapses, regulatory hurdles and price depreciation contributed to the decline in crypto ownership. However, considering the government’s intent to provide regulatory clarity combined with a stable market, crypto ownership in the region is expected to pick up.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZmFsbC1hbG9uZy10b3AtMTAtY3J5cHRvcy1saXRlY29pbi1oYWx2aW5nLWZhaWxzLWxpZnQtbWFya2V0LXNlbnRpbWVudC_SAW5odHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWZhbGwtYWxvbmctdG9wLTEwLWNyeXB0b3MtbGl0ZWNvaW4taGFsdmluZy1mYWlscy1saWZ0LW1hcmtldC1zZW50aW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether fall, along with all top 10 cryptos, after Litecoin halving fails to lift market sentiment - Forkast News",
        "content": "Bitcoin and Ether slipped during Thursday afternoon trading in Hong Kong, along with all other top 10 non-stablecoin cryptocurrencies by market capitalization. Litecoin led the losers in the top 10, despite successfully completing its third quadrennial halving event yesterday.\n\nSee related article: Weekly Market Wrap: Bitcoin falls below US$30,000 as institutional interest in ETFs fails to lift markets\n\nBitcoin, Ether remain under key levels; Dogecoin reverses gains\n\nBitcoin was little changed during afternoon trading in Asia, trading at US$29,027 as of 4:30 p.m. in Hong Kong.\n\n“Despite the chances of a further minor correction, higher timeframe on-chain metrics continue to signal a bull market. When Bitcoin re-ascends to a position above its Realised Price, following an extended period of staying below it, this usually signals the onset of a new bull market,” according to a Bitfinex research note shared with Forkast.\n\nEther fell 0.76% during afternoon trading in Asia to US$1,828 and declined 2.37% during the past week.\n\nLitecoin was the day’s biggest loser in the top 10, falling 4.73% in the past 24 hours to US$86.11 after successfully completing its third halving event yesterday that reduced miner rewards from 12.5 to 6.25 Litecoins per block.\n\nThe XRP token was the day’s second biggest loser, falling 4.69% to US$0.6603.\n\nThe total crypto market capitalization over the past 24 hours fell 1.57% to US$1.16 trillion while market volume decreased 16.22% to US$32.85 billion, according to CoinMarketCap data.\n\nBitcoin, Ethereum NFT sales decline, CryptoPunks sales rise on Beeple’s purchase\n\nThe Forkast 500 NFT index slipped 1.2% to 2,475.02 points in the 24 hours to 4:30 p.m. in Hong Kong and fell 5.98% during the week.\n\nBitcoin’s 24-hour non-fungible token dropped 35.79% to US$462,968, making Bitcoin the eighth largest blockchain by 24-hour NFT sales volume, according to CryptoSlam.\n\nEthereum’s 24-hour NFT sales fell 8.18% to US$12 million, but sales for the largest Ethereum-native NFT collection, the Bored Ape Yacht Club, rose 73.9% to US$836,148.\n\nEthereum-based CryptoPunks surpassed the Bored Apes in 24-hour sales volume, rising 3.08% to US$1.29 million, after digital artist Beeple announcing that he bought a CryptoPunk NFT yesterday.\n\n“Beeple is finally a CryptoPunk! While I thought this icon from the NFT space already was a CryptoPunk holder, that turned out to not be the case. Instead, Beeple has been carefully waiting to find his perfect Punk,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\n“Coming in at over US$200,000, it’s a pricey flex, but well worth it to have a stake in the iconic NFT collection.”\n\nAll Forkast Labs NFT indexes were in the red for the day.\n\nAsian equities mixed, U.S. stock futures continue decline after Fitch downgrades U.S. credit rating\n\nImage: elements.envato\n\nMajor Asian equities were mixed as of 4:30 p.m. in Hong Kong, as Japan’s Nikkei 225 and Hong Kong’s Hang Seng Index both declined, as investors remained concerned about China’s economic recovery. The Shenzhen Component and the Shanghai Composite both posted gains.\n\nU.S. stock futures fell during Thursday afternoon trading in Hong Kong, with the Dow Jones Industrial Average futures, the S&P 500 futures index and the tech-heavy Nasdaq-100 futures all posting losses.\n\nInvestors remained pessimistic after credit agency Fitch Ratings downgraded the U.S. long-term credit rating on Tuesday from AAA to AA+, citing “expected fiscal deterioration” in the country, over the next three years.\n\nU.S. Treasury Secretary Janet Yellen called Fitch’s credit downgrade “arbitrary and based on outdated data,” while White House officials released their own statement Tuesday saying they “strongly disagree” with the decision.\n\n“The ratings model used by Fitch declined under President Trump and then improved under President Biden,” said the White House statement.\n\nIn Europe, major bourses fell for a third consecutive day, with the DAX and pan-European STOXX 600 falling nearly 1% each as market participants held back to await earnings results and the Bank of England’s interest rate decision.\n\nThe bank is expected to raise its borrowing rate by 25 basis points to a 15-year high of 5.25%.\n\nEarnings reports are expected later Thursday from Apple, Amazon, travel company Booking Holdings that operates booking.com and Airbnb.\n\nSee related article: Bitcoin Ordinals profitability falls in July, but total inscriptions pile on\n\nUpdates with equities section"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdS50b2RheS9iaXRjb2luLWhhdGVyLXBldGVyLXNjaGlmZi1ncmlsbHMtbWljaGFlbC1zYXlsb3Itd2l0aC1lcGljLXF1ZXN0aW9u0gFXaHR0cHM6Ly91LnRvZGF5L2JpdGNvaW4taGF0ZXItcGV0ZXItc2NoaWZmLWdyaWxscy1taWNoYWVsLXNheWxvci13aXRoLWVwaWMtcXVlc3Rpb24_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Hater Peter Schiff Grills Michael Saylor With Epic Question - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent twist of events, renowned financial expert and vocal critic of cryptocurrencies, Peter Schiff, took a direct shot at MicroStrategy CEO Michael Saylor over the company's Bitcoin holdings.\n\nAdvertisement\n\nOn Aug. 1, it was revealed that MicroStrategy had acquired an additional 467 BTC for $14.4 million, bringing their total Bitcoin stash to an impressive 152,800 BTC. The company's CEO, Michael Saylor, disclosed that they had acquired the digital assets for a total cost of $4.53 billion, averaging $29,672 per Bitcoin.\n\nHowever, it seems Schiff could not resist poking fun at Saylor's investment strategy. Seizing the opportunity to question the move, the expert confronted the MicroStrategy CEO, stating that the latest BTC purchase had already resulted in a 5% loss. He further inquired about the total losses that the company's shareholders had incurred since the company first ventured into the world of cryptocurrencies.\n\nSo you're already down 5% on that new $14.4 buy. How many billions have MSTR shareholders lost so far on the entire BTC position? — Peter Schiff (@PeterSchiff) August 2, 2023\n\nDespite the direct challenge, Saylor has yet to respond to Schiff's query, a move that might not be too surprising for those familiar with Saylor's social media style.\n\nIs glass half full?\n\nAt present, Bitcoin's price is indeed trading slightly below MicroStrategy's average purchase price, but by just 2%. While this might seem like a cause for concern, it is essential to note that the company's investment in Bitcoin has yielded significant returns. Since MicroStrategy began buying Bitcoin for its treasury, MSTR shares have surged an astonishing 220% to their current value. At the peak, the growth skyrocketed to an impressive 965%, reaching an all-time high of $1,315 per share.\n\nWhile the recent dip in Bitcoin's value may have raised some eyebrows, MicroStrategy seems undeterred, displaying confidence in their digital asset strategy."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2Utcmlza3MtYmluYW5jZS1mZWFycy1iaXRjb2luLWJ1bGxz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "BTC price risks new sub-$29K dip as Binance fears test Bitcoin bulls - Cointelegraph",
        "content": "Bitcoin (BTC) dipped below $29,000 on Aug. 3 as market concerns over largest global exchange Binance reignited BTC price downside.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price analysis “expects” support retest\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action heading lower before a modest comeback into the Wall Street open.\n\nRumors over new United States legal action against Binance made for a disappointing 24 hours for Bitcoin bulls after a brief trip above $30,000.\n\nWith the trading range still firmly in place, monitoring resource Material Indicators forecast a further bearish support retest to come.\n\nWant to know what changed on the #Bitcoin Daily chart in the U.S. overnight hours?\n\n\n\nAccording to the #TrendPrecognition algos, the probability of a downside move in the Daily TF increased from >75% to >84%.\n\n\n\nExpecting to test support at the trendline. #NFA https://t.co/FtR25ruHHr pic.twitter.com/34v1OoZgp9 — Material Indicators (@MI_Algos) August 3, 2023\n\n“If you’re surprised, confused or think the bi-directional volatility is over then you haven’t been paying attention,” part of prior analysis read.\n\nPopular trader Daan Crypto Trades, meanwhile, suggested that current BTC price behavior was merely the continuation of an all-too-familiar pattern.\n\nThe past few weeks have been all the same.\n\n\n\n1. Price grinds down\n\n2. Shorts get aggressive\n\n3. Shorts get squeezed/Price goes up\n\n4. Spot starts selling\n\n5. Price rolls over.\n\n\n\nRinse & Repeat.\n\n\n\nUntil spot starts bidding after these squeezes we'll just keep doing these full retraces. pic.twitter.com/vGgKUFI00f — Daan Crypto Trades (@DaanCrypto) August 2, 2023\n\n“I’ve said it before but I’ll say it again… The longer price hovers around here, the bigger the move following it, will be,” he added on the day.\n\nOthers made light of the Binance narrative. Ki Young Ju, CEO of analytics platform CryptoQuant, argued that panic over solvency issues would turn out to be a non-event.\n\n“I've heard about the ‘bank run/insolvency risk on Binance’ a hundred times for years, but their user balances always tell a different story,” he tweeted alongside charts showing the exchange’s BTC and Ether (ETH) reserves.\n\nBinance BTC, ETH reserves charts. Source: Ki Young Ju/Twitter\n\nBitcoin volatility prepares to undercut stocks, gold\n\nOverall, however, Bitcoin volatility remains at historically-low levels.\n\nRelated: Bitcoin price risks $25K dip despite ‘macro pivot point’ — New analysis\n\nAccording to the Bitcoin Historical Volatility Index (BVOL), weekly volatility was headed toward record lows seen at the start of 2023.\n\nBitcoin Historical Volatility Index (BVOL) 1-week chart. Source: TradingView\n\nThis chimes with existing comparisons to January, with Bollinger Bands data likewise echoing the period immediately prior to Bitcoin’s Q1 breakout.\n\nDylan LeClair, senior analyst at digital asset fund UTXO Management, additionally noted that 10-day realized volatility was almost below that of U.S. stocks, bonds and gold.\n\n10-day realized volatility for #bitcoin near falling below average of stocks, bonds, and gold. pic.twitter.com/QKq5HItY80 — Dylan LeClair (@DylanLeClair_) August 3, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy9ob3ctdG8tdHJhZGUtY3J5cHRvLXdpdGgtcm9iaW5ob29k0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "How to Buy Bitcoin With the Robinhood App - Brave New Coin Insights",
        "content": "How to Buy Bitcoin With the Robinhood App\n\nRobinhood is a commission-free trading platform that allows users to buy and trade Bitcoin, Ethereum, Litecoin and other major cryptocurrencies, in addition to stocks, options, ETFs and gold.\n\nWith the Bitcoin price moving upward after the announcement of several prominent ETF applications, a new wave of retail investors will make the decision to purchase their first crypto.\n\nMany new crypto investors find the process of buying via an exchange challenging. For many a common question is ‘can you buy Bitcoin on Robinhood?’. The answer is yes. The Robinhood app allows account holders to easily trade over 5,000 different stocks, ETFs, options, gold, and crypto via its mobile app or web browser. Robinhood is available as a free download for Android, iOS and most popular web browsers.\n\nHow To Buy Bitcoin with Robinhood\n\nFor anyone applying for a Robinhood account, the following requirements need to be met:\n\n• Be 18 years or older\n\n• Have a valid Social Security Number\n\n• Have a legal U.S. residential address within the 50 states or Puerto Rico\n\n• Be a U.S. citizen, U.S. permanent resident, or have a valid U.S. visa\n\nRobinhood Crypto is available in 46 of the 50 US states. The restricted states are Hawaii, Nevada, New Hampshire, and West Virginia. Non U.S investors are geo-blocked from opening Robinhood accounts. While it would be possible to bypass this obstacle using a VPN, Robinhood is not an anonymous platform, and follows bank-like ‘know your customer’ onboarding procedures – requiring anyone wanting to open an account to also provide ID like a passport, a drivers license, a social security card or other US specific ID to do so.\n\n1. Download and Set Up the Robinhood App: If you don’t already have the Robinhood app, download it from the App Store (for iOS) or Google Play Store (for Android) and create an account.\n\n2. Fund Your Account: Before you can buy Bitcoin or any other cryptocurrency, you’ll need to fund your Robinhood account. You can do this by linking your bank account and transferring money to your Robinhood account.\n\n3. Navigate to the Cryptocurrency Section: Open the Robinhood app and navigate to the cryptocurrency section. This is typically done by tapping on the \"Investing\" or \"Crypto\" tab in the app’s main menu.\n\n4. Search for Bitcoin: Once you’re in the cryptocurrency section, use the search bar to find Bitcoin (BTC) among the available cryptocurrencies. It’s important to ensure you’re selecting the right asset as there are various cryptocurrencies listed on the platform.\n\n\n\n5. Place an Order: After selecting Bitcoin, tap the \"Trade\" or \"Buy\" button. You can then choose the amount of Bitcoin you want to buy or specify the amount in USD that you wish to invest. Keep in mind that you can buy a fraction of a Bitcoin if you don’t want to invest the full amount for one whole Bitcoin.\n\n6. Confirm the Trade: Review the details of your trade, including the purchase amount, any fees involved, and the current price of Bitcoin. If everything looks correct, confirm the trade to execute the purchase.\n\n7. Monitor Your Investment: Once you’ve bought Bitcoin, you can monitor its performance in the cryptocurrency section of the Robinhood app. The app will display the current value of your holdings and any changes in their value over time.\n\nRemember that cryptocurrency investments can be volatile and may involve risk, so it’s essential to do your own research and consider your risk tolerance before investing. Additionally, regulatory policies and features of trading apps can change over time, so it’s crucial to double-check the app’s functionality and rules before making any trades.\n\nWhat Cryptocurrencies Can You Buy With Robinhood?\n\nBesides Bitcoin, Robinhood app also supports trading of other popular cryptocurrencies, such as Ethereum (ETH), Litecoin (LTC), Dogecoin (DOGE), Bitcoin Cash (BCH), Ethereum Classic (ETC), and Bitcoin SV (BSV). You can search for them on the app and follow the same steps as buying Bitcoin. However, keep in mind that not all cryptocurrencies are available in every state due to regulatory restrictions. You can check the availability of each cryptocurrency on Robinhood’s website.\n\nWhat are Robinhood’s fees for crypto trading?\n\nWhilst Robinhood and Robinhood Crypto advertise their service as commission free, there are still costs to trading on the platforms. In terms of Robinhood Bitcoin fees, one of the ways Robinhood makes money is off the spread, which is the difference between the best buy and sell price.\n\nThe size of the spread is a measure of the liquidity of the market, or how quickly and easily a trader can convert between cash and a cryptocurrency. Typically, there are smaller spreads for better known cryptocurrencies like Bitcoin, and larger spreads for lesser known cryptocurrencies.\n\nTraders on Robinhood Crypto can also have the fees charged by cryptocurrency exchanges, brokers, market-makers, liquidity providers, or other types of cryptocurrency counterparties, trading venues, or intermediaries, passed onto them. These terms are stated in the Robinhood Crypto User Agreement, and allows Robinhood to pass on any fees they incur from buying and selling the underlying cryptocurrency to the traders.\n\nWhat is the Robinhood crypto wallet?\n\nThe Robinhood wallet is a separate app from the Robinhood app and must be downloaded from the Apple app store. The wallet app is iOS only. There is currently no Robinhood wallet for Android. Described as a “portal to web3”, the Robinhood Wallet app is a self-custody wallet which gives users full control their crypto on the Polygon and Ethereum networks, while they hold and maintain their private keys. The company says more networks will be coming soon. Users can send and receive tokens from and to any address or exchange that supports Ethereum or Polygon transfers. You can also receive and store NFTs on the wallet – but sending is not available at this time.\n\nIs your crypto safe on Robinhood?\n\nRobinhood crypto uses industry best practices for storing and managing cryptocurrencies by dividing the crypto among a mix of cold (offline) wallets and hot (online) wallets. Most of the coins are kept in cold storage, with the rest being in hot wallets to support day-to-day operations.\n\nAdditionally, coin transfers need to be authorized by a select group of people, and Robinhood says this group is constantly being rotated to ensure a high level of security is maintained. The company does have a crime insurance policy, underwritten by Lloyd’s of London, that covers a portion of the assets held by Robinhood Crypto against losses from theft, including cybersecurity breaches.\n\nThat said, however, Robinhood Crypto is not a member of FINRA, and as such they are absolved from responsibilities and obligations that they would typically be subject to when providing trading services for equities. User funds are also not covered by the Securities Investor Protection Corporation, which protects stock purchases on Robinhood to the tune of $500,000, nor are they covered by the Federal Deposit Insurance Corporation (FDIC), which insures bank deposits for up to $250,000 USD per customer.\n\nRobinhood Crypto holds a BitLicense issued by the New York State Department of Financial Services (NYSDFS), which enables a company to conduct business activities related to cryptocurrency. The NYSDFS has only awarded seventeen of these licences since they were first introduced in August 2015.\n\nRobinhood Crypto is also registered with the Financial Crimes Enforcement Network as a money services business. As such, Robinhood Crypto is subject to and complies with the applicable requirements of the Bank Secrecy Act, and complies with the applicable money transmitter laws of U.S. states."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYmlndGhpbmsuY29tL3RoZS1mdXR1cmUvd2hlcmUtbmV4dC1jcnlwdG8tZXZvbHV0aW9uLWJsb2NrY2hhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Where next for crypto and the evolution of blockchains? - Big Think",
        "content": "Excerpted from Data Money: Inside Cryptocurrencies, Their Communities, Markets, and Blockchains by Koray Caliskan Copyright (c) 2023 Koray Caliskan. Used by arrangement with the Publisher. All rights reserved.\n\nThe first decade of our century witnessed the emergence of the third hegemonic materiality of money in history: data. Previously, we imagined and exchanged fiat value on metal and paper. We built economies around these monies, drawing on technologies that turned these materials into devices harboring monetary value. Money materials are not neutral instruments. They contribute to the ways in which monies are made and exchanged, as well as the ways in which economies and markets are designed and maintained around them. With the emergence of Bitcoin (BTC) in 2009, and then around ten thousand more data monies in the following decade, we have figured out a way to make money and imagine its value in the intangible materiality of the exclusive right to send data.\n\nUsually misunderstood as a passive and solitary data entry in a memory device, in reality data money is an active and relational right to send data from one place to another. These places are defined by the specific blockchain network where these rights are exchanged. If a network removes your node from its universe, you may still have data about your cryptocurrency in your memory device, but these same data cease to work as money. To work, data money needs actors, devices, and networks that are operational. A data money is not digitally represented, as the dollars in your checking account are, but is computationally made with the infrastructural possibility of a blockchain. That is why it is impossible to comprehend the making and workings of data monies without also understanding their accounting systems — that is, blockchains.\n\nBefore Bitcoin, monies were digitally represented and exchanged. These relations had to be governed by banks. Banks are controlled by the state, which also serves as a guarantor of the account balances that the banks keep. Unless a legal dispute arises or tax documentation is needed, the documentation of these transfers between accounts owned by human persons (for example, you) or legally defined persons (for instance, a company) are kept private.\n\nThe emergence of blockchains proposed a new accounting system and a novel way to transfer money without needing a bank or a state by defining new actors that can claim responsibility for accounting. Replacing banks and states as guarantors and double-entry bookkeeping as accounting, miners began to document all transactions on a digital ledger that we call a blockchain. But how? The answer may look complicated, yet it rests on a very simple logic.\n\nThere is no free lunch in any accounting system. Accountants are paid to keep the books in order. In crypto economies, miners are paid to keep the blockchain accounting working. Blockchain accountants — or miners, as they are called in crypto economies — invest their time, energy, and infrastructure to ensure that transactions are approved and registered in the space of blockchains. Once registered and accounted for, a transaction is safe and can be checked for validity in every computer that forms part of that operational blockchain system. Everyone can download a copy of this ledger, and every ledger has every transaction that has been approved by miners. In exchange for their successful work, miners receive a unique gift, a payment from the blockchain network. This payment is then used as currency in this new crypto economy — hence, cryptocurrency.\n\nIn the beginning, mining was easy. There were not many people transacting. No one could imagine that Bitcoin was going to reach tens of thousands of dollars in value. People would buy pizza with 10,000 BTC — which, at the time of writing this book, are worth half a billion dollars. As Bitcoins have turned into money and have begun to serve as asset or exchange vehicles — and in the case of El Salvador, as a unit of national account — more accountants are needed to register its transactions, thus decreasing the Bitcoins you can make with your mining operations. Such slowing down is achieved by making it more difficult to carry out computational operations, an automatic response conditioned by the coders who wrote the blockchain algorithms. Increasing difficulty has been addressed by increasing the number and capacity of the processors that the miners use; thus, mining has become a very energy-intensive computational industry.\n\nThat is why the Bitcoin network burns a lot of energy to operate an accounting and transactional architecture that is now criticized as slow and energy-inefficient. First-generation blockchains built their own services, algorithms, and programs on the specific computational infrastructure of the Bitcoin blockchain. They were slow, massive energy-burner networks that did not provide users with any capability to treat computer programs as money. The Bitcoin network still had some capacity to allow simple programming to be imagined as money; yet the more complex it grew, the slower the network became.\n\nNow it is possible to bridge structurally dissimilar blockchains and carry out transactions on them.\n\nThe emergence of second-generation blockchains, with the then superfast and cost-efficient Ethereum network, addressed Bitcoin’s problems in a variety of ways. First-generation blockchains facilitated the sending of data as money, whereas second-generation blockchains did so only if certain conditions were met, thus embedding computer programmatic conditions in the materiality of data money making. This allowed for imagining contracts made of data as value and transferring a short computer program as a contract, thus changing the nature of accounting from checking for value to checking for a working contract or a program. Essentially, this is still monetizing the right to send data — but in the form of a program and within a very fast network that consumes less energy.\n\nBut over time, the Ethereum network also began to face the same challenges that Bitcoin had faced half a decade ago. The Ethereum blockchain was faster and more energy-efficient; still, as more people began to use it and as Ethereum’s value increased vis-à-vis the dollar, the Ether cost of transactions (called gas) began to increase in value, too. The extreme volatility of the cryptocurrency markets made it more desirable to execute buy and sell decisions quickly; thus, actors needed transactions to be faster, which could be carried out only by increasing the gas fee one pays for moving data monies. In addition to the increasing costs and decelerating accounting services, Ethereum’s and Bitcoin’s blockchains were not interchains, which allow other chains to work together. One could build a new blockchain on Ethereum or Bitcoin; however, it was not feasible to build a chain that would connect different blockchains.\n\nThe new generation of blockchains — such as Cardano, Polkadot, and Avalanche — sometimes called platforms, provide actors with opportunities to build an entire market or interchain network, as they put mutually exclusive blockchains with varying computing protocols into contact so they can transact with each other. Now it is possible to bridge structurally dissimilar blockchains and carry out transactions on them. It will be immensely difficult for the Bitcoin and Ethereum blockchains to protect their competitive edge if they do not pursue a radical change."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJpdGNvaW4tc3RyYXRlZ3ktcmVtYWluLWRlc3BpdGUtZXRmLWFwcHJvdmFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "MicroStrategy to stay on Bitcoin course even if spot ETFs approved: Saylor - Cointelegraph",
        "content": "MicroStrategy co-founder Michael Saylor believes his firm will remain an enticing way for investors to gain exposure to Bitcoin (BTC) regardless of any future exchange-traded fund approvals.\n\nHe has also confirmed his firm’s intention to continue adding more Bitcoin to its balance sheet, including with the potential proceeds of a planned $750 million share sale.\n\nSpeaking to Bloomberg on Aug. 2 on how an approved spot Bitcoin ETF could impact his firm’s offering, Michael Saylor was confident MicroStrategy would still be able to offer something spot Bitcoin ETFs can't.\n\nHe made similar comments during the Aug. 1 earnings call, saying that MicroStrategy will still be “differentiated as a particular Bitcoin operating strategy” when spot ETFs arrive.\n\nBitcoin is up 145% since the company started its purchasing strategy in August 2020, he said, adding that his firm uses leveraged investments to generate yields that are passed to shareholders.\n\n“We can tap into leverage because we’re an operating company, which an ETF couldn't do so we view it as being beneficial to the entire ecosystem.”\n\nOn the other hand, Saylor said spot Bitcoin ETFs would allow large hedge funds and sovereigns to come into the space with billions of dollars.\n\n“We are a unique instrument, we are the sportscar whereas the spot ETF is going to be the supertanker.”\n\n“Spot ETFs will serve another set of customers in a synergistic fashion to grow the entire asset class,” he added at the earnings call.\n\nThe firm has more than 470 institutional shareholders, according to Fintel, and a market capitalization of $5.3 billion.\n\nRelated: MicroStrategy returns to profit and now owns $4.4B worth of Bitcoin\n\nOn Aug. 2, analysts raised spot Bitcoin ETF approval chances in the United States to 65%.\n\nSaylor confirmed the goal is to “accumulate as much Bitcoin as we can,” when asked how much their existing holdings of 152,800 BTC will increase in the quarters to come.\n\nHe also confirmed that the company intends to sell up to $750 million in class A common stock as per a recent SEC filing, adding that the primary use of proceeds “generally is just to acquire Bitcoin.”\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTI5My1kYXRhLXJlc2lsaWVudC11cy1qb2JzLW1hcmtldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price taps $29.3K as data shows 'most resilient' US jobs market - Cointelegraph",
        "content": "Bitcoin (BTC) inched higher at the Aug. 4 Wall Street open as mixed United States unemployment data rocked U.S. dollar strength.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nU.S. unemployment gives mixed picture\n\nData from Cointelegraph Markets Pro and TradingView followed BTC price action as BTC/USD set daily highs of $29,273.\n\nU.S. jobless figures came in below expectations on the day, at 3.5% versus an estimated 3.6%, while the number of jobs added was less than forecast.\n\nResponding, financial commentator Holger Zschaepitz said that the data had “no clear message.”\n\n“Despite the fastest rising rates of all time, the labor market remains strong,” financial commentary resource The Kobeissi Letter continued in part of its own synopsis.\n\n“This is the most resilient labor market in history.”\n\nWhile U.S. stocks and Bitcoin managed to eke out modest gains as a result, the U.S. dollar felt the pressure in what could still aid a more pronounced BTC price rebound.\n\nThe U.S. Dollar Index (DXY) was down 0.6% on the day at 101.8, setting new lows for August.\n\nU.S. Dollar Index (DXY) 1-day chart. Source: TradingView\n\nFor Michaël van de Poppe, founder and CEO of trading firm Eight, there was reason to believe that BTC/USD could improve into the next round of macroeconomic data releases.\n\n“This means $DXY down, stocks up & Bitcoin potentially up awaiting CPI next week,” he wrote about the jobs data.\n\nVan de Poppe referenced the upcoming Consumer Price Index inflation print for June, due Aug. 10.\n\nBTC price range to stick into weekend, says trader\n\nTurning to Bitcoin itself, popular trader Skew tracked rash moves among traders as brief BTC price volatility appeared.\n\nRelated: BTC price upside ‘yet to come’ at $29K after Bitcoin RSI reset — Trader\n\nHe nonetheless described the broader market reaction to the data as “very interesting.”\n\nOn-chain monitoring resource Material Indicators likewise followed changes in bid and ask liquidity on the Binance BTC/USD order book.\n\nWas watching the #Bitcoin PA in real time on #FireCharts 2.0 (beta) as the Economic Reports came across the wire. Purple Whales started eating resistance as the numbers came in, then a column of bids and asks were pulled and a few minutes later moved.\n\n\n\nOut of respect and… pic.twitter.com/5bjloZM7DW — Material Indicators (@MI_Algos) August 4, 2023\n\nGoing into the weekend, few expected a significant change in the overall sideways trading environment.\n\n“I feel we will be stuck above this support zone for this weekend. For now no entry for now as we just remain range bound,” a typical prediction from popular trader Crypto Tony read earlier in the day, alongside a chart showing relevant levels.\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nMagazine: Experts want to give AI human ‘souls’ so they don’t kill us all\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L25ldy15b3JrLWNvdXBsZS1wbGVhZC1ndWlsdHktdG8tYml0Y29pbi1sYXVuZGVyaW5nL2FydGljbGVzaG93LzEwMjQxMzk4OC5jbXPSAYMBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvbmV3LXlvcmstY291cGxlLXBsZWFkLWd1aWx0eS10by1iaXRjb2luLWxhdW5kZXJpbmcvYW1wX2FydGljbGVzaG93LzEwMjQxMzk4OC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "New York couple plead guilty to bitcoin laundering - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nA married couple from New York dubbed \"Bitcoin Bonnie and Crypto Clyde\" pleaded guilty on Thursday to laundering billions of dollars in stolen bitcoin, prosecutors announced. Ilya Lichtenstein , 35, and Heather Morgan, 33, were arrested in February last year after the US government seized 95,000 bitcoin then valued at $3.6 billion.Prosecutors said the pair stole the bitcoin in 2016 using \"advanced hacking tools.\" Authorities recovered the funds from wallets controlled by the duo.Since their arrests, the government has seized another approximately $475 million tied to the hack, the Southern District of New York said in a statement.In total, the couple admitted to laundering conspiracies arising from the theft of approximately 120,000 bitcoin from Bitfinex , a global cryptocurrency exchange.The charges carry a maximum penalty of 20 years in prison.Prosecutors said that Lichtenstein, at times with Morgan's help, \"employed numerous sophisticated laundering techniques.\"That included using fictitious identities to set up online accounts and utilizing computer programs to automate transactions.They deposited the stolen funds into accounts in a variety of darknet markets and cryptocurrency exchanges and then withdrew the money, which confuses the transaction history.They couple also converted bitcoin to other forms of cryptocurrency and even exchanged a portion of the stolen funds into gold coins, which Morgan then concealed by burying them.One of Morgan's aliases was \"Razzlekhan\" while Lichtenstein was known as \"Dutch.\"The couple were dubbed \"Bitcoin Bonnie and Crypto Clyde\" by financial newsletter Morning Brew"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRmaW5leC1oYWNrZXItcmV2ZWFsZWQtcmF6emxla2hhbnMtaHVzYmFuZC0xNjU5NDE1ODguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Bitfinex Hacker Revealed: Razzlekhan's Husband Admits He Stole Billions in Bitcoin - Yahoo Finance",
        "content": "Ilya Lichtenstein, who last month agreed to forfeit billions in a plea deal for his role in laundering funds from a 2016 hack of crypto exchange Bitfinex, has now admitted he was the hacker.\n\nAlthough it has long been suspected either Lichtenstein or his wife, Heather Morgan, were the ones who stole 120,900 Bitcoin, it's only now been confirmed. The new detail was originally reported by CNBC on Thursday.\n\nThe couple appeared at a sentencing hearing today in Washington D.C.\n\nBitfinex Hackers Agree to Forfeit Billions in Bitcoin in Plea Deal\n\nDuring the court hearing, the Bitfinex hacker also admitted that he and his wife converted some of the stolen crypto assets to gold coins and buried them. According to CNBC’s account of the hearing, Lichtenstein flew to Ukraine and Kazakhstan to convert the crypto to cash before depositing the funds in an American bank account.\n\nLichtenstein and Morgan (also known by her rapper name \"Razzlekhan\") were arrested early last year on charges of having laundered the funds stolen from Bitfinex in 2016. They could face up to 20 years in prison.\n\nAs part of their plea deal, the couple has agreed to forfeit proceeds from the almost 120,000 Bitcoin they stand accused of laundering. At the time of their arrest, the Department of Justice seized $3.6 billion worth of Bitcoin it believed to be connected to the 2016 hack.\n\nAt the time, Deputy Attorney General Lisa O. Monaco said in a press release it was the department’s largest ever seizure of crypto assets and proved “cryptocurrency is not a safe haven for criminals.”\n\nBitfinex Recovers $314K of the $3.6 Billion Stolen in 2016 Bitcoin Hack\n\nBefore the arrest, investors were keen to track the funds using blockchain data—a maddening bit of transparency for victims who can see their funds being moved around. A few weeks before the plea deal was announced in July, Bitfinex recovered a small portion of the Bitcoin Cash, about $314 thousand, that was taken during the 2016 hack. But the majority of the funds still have not been returned to users.\n\nEditor's Note: This story was updated at 4 p.m. ET on Thursday, August 3 to add additional details about the hearing and context about the hack."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2hvdy1ibG9ja2NoYWluLWFuZC1haS1hcmUtZHJpdmluZy1jcnlwdG8tYWRvcHRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Beyond Bitcoin: How Blockchain and AI are Driving Crypto Adoption - CCN.com",
        "content": "Key Takeaways\n\nThe integration of blockchain technology and artificial intelligence helps boost cryptocurrency adoption.\n\nBlockchain technology guarantees safe, open, and decentralized transactions, fostering user confidence.\n\nAI improves the user experience, opening up and increasing the profitability of cryptocurrency investments.\n\nThe fusion of blockchain and AI is revolutionizing many sectors, including finance and healthcare.\n\nThe cryptocurrency industry has substantially evolved since the launch of Bitcoin (BTC) in 2009. Bitcoin, which was at first viewed with mistrust, is today well known and a well-liked investment choice. The underlying technology that drives Bitcoin is centered on the concepts of blockchain and decentralized consensus.\n\nAlthough the Bitcoin protocol does not include any fundamental elements of artificial intelligence (AI), AI is frequently employed in secondary tasks, including data analysis, trading algorithms, market forecasting, and user experience enhancement on crypto platforms. AI can analyze massive data sets, spot patterns, and forecast market moves or trends for traders and investors in the cryptocurrency market.\n\nThe Power Of Blockchain\n\nAs the foundation of cryptocurrencies, blockchain technology has far-reaching effects that go well beyond Bitcoin. Transactions are secure, transparent, and immutable thanks to its decentralized nature.\n\nUsers are encouraged to engage in financial transactions through this trustless system without the use of middlemen like banks or payment processors. Blockchain thereby eliminates inflated costs, speeds up transactions, and encourages financial inclusion for those without access to conventional banking services.\n\nImproving User Experience With AI\n\nImproving user experience with AI has become a key focus for many industries, including those related to cryptocurrencies and blockchain. Here are some use cases where AI enhances the user experience in the context of crypto and blockchain applications:\n\nPersonalized Investment Suggestions\n\nTo provide tailored investment suggestions, AI-powered investing platforms examine user preferences, risk tolerance, and market movements. Based on the user’s financial objectives, time horizon, and risk tolerance, these platforms can recommend relevant cryptocurrencies or trading strategies, making the investment process more individualized and user-friendly.\n\nSmart Trading Bots\n\nTrading bots powered by AI carry out trades on users’ behalf by automatically evaluating market data, keeping track of price changes, and carrying out deals in accordance with predefined strategies. These bots can operate around-the-clock, eliminating the need for continuous manual monitoring and decision-making while possibly improving trade outcomes.\n\nSentiment Analysis\n\nAI can analyze sentiment on news and social media sites to determine how the general public feels about a certain cryptocurrency or blockchain project. Users can make better decisions and anticipate prospective market movements by analyzing public sentiment.\n\nSecurity And Fraud Detection\n\nAI algorithms are used to improve security on crypto platforms and identify fraudulent behavior. AI systems can spot suspicious transactions, safeguard user accounts, and lower the danger of hacks and scams by using pattern recognition and anomaly detection.\n\nNatural Language Processing (NLP) Chatbots\n\nChatbots with NLP capabilities provide users with immediate customer service by comprehending and answering their questions in natural language. In order to increase user happiness, these chatbots can offer real-time support on a variety of subjects, such as account questions, transaction status, and platform navigation.\n\nAutomated Portfolio Management\n\nBy rebalancing assets in accordance with market fluctuations and investing objectives, AI-powered portfolio management tools enable users to maximize the value of their cryptocurrency holdings. For consumers with little background in finance or investing, these tools make managing a varied portfolio easier.\n\nEnhanced Data Analytics\n\nAI can produce insights and forecasts by analyzing enormous amounts of historical and current data from the blockchain and cryptocurrency marketplaces. Users get access to data-driven analytics and visualizations, which help them keep up with industry trends and make wise decisions.\n\nUser Activity Analysis\n\nTo find trends and preferences, AI algorithms examine user activity on cryptocurrency platforms. By using this information, platform design, user interface, and overall user experience can be enhanced, making it more user-friendly and intuitive.\n\nCrypto Adoption In Different Industries\n\nBlockchain and AI are combining to drive crypto adoption in many businesses outside of finance. Supply chain management benefits from enhanced transparency, enabling customers to verify the origins and authenticity of products.\n\nAdditionally, medical record management has advanced in healthcare, guaranteeing data protection and interoperability. Governments are also looking into blockchain-based voting systems, which would guarantee safe and incorruptible elections.\n\nChallenges And Future Prospects\n\nDespite the advancement, adoption of cryptocurrencies still confronts obstacles. Regulatory ambiguity, security challenges, and scalability problems are a few of the obstacles that must be addressed.\n\nHowever, ongoing research and development in blockchain and AI technologies are driving innovative solutions. The development of decentralized finance (DeFi) platforms is one example of how continuing research and development in blockchain and AI technologies is fostering the creation of novel solutions.\n\nDeFi platforms use blockchain technology to create open, permissionless financial services and products, and they also use AI algorithms to optimize various aspects of these platforms.\n\nFor instance, AI-powered risk assessment models are being created for DeFi lending processes to better accurately analyze borrowers’ creditworthiness. To ascertain the possibility of payback, these algorithms examine a broad range of data, including transaction history, collateral value, and social media activity.\n\nAs a result, DeFi solutions can increase efficiency and boost user trust by incorporating AI to make more precise loan decisions and lower the risk of defaults.\n\nConclusion\n\nThe use of cryptocurrencies will probably increase as blockchain and AI continue to converge, upsetting established businesses and igniting a new era of creativity. Blockchain’s transparent and secure nature gives users confidence, and AI’s analytical powers enable them to make wise decisions.\n\nThe convergence of these technologies has the power to transform innumerable sectors and move society toward a future that is more decentralized and interconnected.\n\nFAQs:\n\nHow does blockchain influence the adoption of cryptocurrencies?\n\nUsers develop trust because blockchain technology provides safe, open, and decentralized transactions. By eliminating middlemen, it lowers prices and speeds up transactions, fostering financial inclusion and expanding the use of cryptocurrencies.\n\nHow does AI improve the user experience for the cryptocurrency industry?\n\nAI-powered algorithms analyze a large amount of data to provide insights and forecasts for wise investing decisions. Trading bots automate procedures, increasing profits and lowering risks, making cryptocurrency investments easier for customers to access and more lucrative.\n\nHow are the convergence of blockchain and AI affecting various industries?\n\nBlockchain and AI are transforming industries outside of finance. Governments are exploring safe blockchain-based voting systems; hospitals are seeing improvements in record management; and supply chain management benefits from more openness.\n\nWhat challenges does crypto adoption face?\n\nThe adoption of cryptocurrencies confronts obstacles like legislative ambiguity, security worries, and scalability problems. However, it is anticipated that current blockchain and AI research and development will address these challenges and open the door for creative solutions."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xNTExOTEvY29pbmJhc2UtYml0Y29pbi1iZWFyLW1hcmtldC1iZWF0cy1lYXJuaW5ncy1xMtIBTmh0dHBzOi8vZGVjcnlwdC5jby8xNTExOTEvY29pbmJhc2UtYml0Y29pbi1iZWFyLW1hcmtldC1iZWF0cy1lYXJuaW5ncy1xMj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Coinbase Seeks to 'Optimize' Amid Bitcoin Bear Market, Beats Earnings Expectations - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency exchange Coinbase reported a second-quarter loss of $97 million on Thursday, but shares edged up during after-hours trading on better-than-expected financial results.\n\nCoinbase reported a second-quarter loss of $0.42 per share on $708 million revenue, while analysts expected a loss of $0.76 on $634 million revenue.\n\nCompared to the same period a year ago, revenue was significantly down from $808 million. Yet the San Francisco-based firm’s losses were less severe compared to a staggering $4.98 loss per share reported the same time in 2022.\n\nAD\n\nAD\n\nCoinbase’s second-quarter performance marked a dip compared to the previous one, when the exchange disclosed a loss of $0.34 per share on $773 million revenue. The exchange had built on positive momentum towards the end of 2022 despite the collapse of FTX and sinking crypto prices, growing revenue by 22% sequentially.\n\nIn a letter to shareholders, Coinbase said the firm’s strong quarter was driven in part by a continued push toward efficiency. The firm highlighted a 50% drop in its recurring operating expenses year-over-year, which includes slashing its headcount by 30% during that span.\n\n“We started this journey of being more financially disciplined about a year ago,” Coinbase’s Vice President of Investor Relations Anil Gupta told Decrypt. “There's definitely headcount reductions, but there's also a lot more efficiency and optimization across the whole company.\"\n\nCoinbase took in $201 million in interest income during the second quarter, $151 of which came from its revenue-sharing agreement with Circle on USDC reserves. By the quarter’s end, Coinbase said it had around $1.8 billion in USDC on its platform.\n\nCoinbase disclosed trading volume on its platform sank quarter-over-quarter by a substantial amount, to $92 billion from $145 billion. Compared to the same period a year ago, it represented a 57% decline from $217 billion.\n\nAD\n\nAD\n\nSome analysts predicted this could be the first time that revenue from subscriptions and services—which includes products like staking and interest income earned from assets backing the Circle-issued stablecoin USDC—overtakes transaction revenue.\n\nCoinbase reported second-quarter transaction revenue of $327 million, notably down compared to $665 million a year ago. Revenue from subscriptions came in at $335 million, up from $147 million a year ago yet down from $361 million in the first quarter.\n\nThe Securities and Exchange Commission (SEC) sued Coinbase during the second quarter. The agency accused the firm of failing to register as a securities exchange and broker, claiming its staking products constituted unregistered securities as well.\n\nBut Wall Street has largely shrugged off regulatory concerns. Coinbase shares were trading at $90.75 when markets closed on Thursday, up from $52—roughly 75%—since the SEC filed its lawsuit against the company on June 6.\n\nStill, it doesn’t hurt that BlackRock seems to have faith in the San Francisco-based crypto exchange. The monolithic asset manager tapped Coinbase as a custodian for its spot Bitcoin ETF on June 15, later revising its filing to include the exchange in a surveillance-sharing agreement as it vies against other firms in a race to get a spot Bitcoin ETF approved by the SEC."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1hYm92ZS0yOTEwMC1zaGliYS1pbnUtYm5iLXJpc2UtdXAtdG8tNC9hcnRpY2xlc2hvdy8xMDI0MjE0MzkuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLWFib3ZlLTI5MTAwLXNoaWJhLWludS1ibmItcmlzZS11cC10by00L2FtcF9hcnRpY2xlc2hvdy8xMDI0MjE0MzkuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $29,100; Shiba Inu, BNB rise up to 4% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed in Friday's trade. Bitcoin, BNB , Tron, and Shiba Inu were trading with gains, while XRP Litecoin , Cardano and Polkadot were trading with cuts.\"The crypto market has experienced slight selling pressure in the last 24 hours. The crypto greed and fear index is up by 2 points and is currently in the neutral zone with a score of 54/100. The overall market, especially BTC, seems to be rather immune to many macro developments in its current state. The latest example is the rise of jobless claims and treasury rates, which usually triggers a risk-off sentiment amongst investors,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.Bitcoin (BTC) rose 0.55% to $29,180, meanwhile, its largest peer, Ethereum, was also trading higher and stood above the $1,800 level.The total volume in DeFi is currently $2.41 billion, 8.31% of the total crypto market 24-hour volume. The volume of all stablecoins is now $27.03 billion, which is 93.14% of the total crypto market 24-hour volume.Meanwhile, the global cryptocurrency market cap was trading marginally higher, around $1.16 trillion, rising 0.08% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $567 billion. Bitcoin's dominance is currently 48.73%, an increase of 0.17% over the day, according to CoinMarketCap. BTC volume stood at approximately $12.44 billion, falling 19.22% in the last 24 hours.\"Bitcoin continues to be in a range-bound between $29,000 and $29,500 for much of the past 10 days. This is likely due to a lack of fresh money flowing into the crypto market. Investors are waiting for more clarity on the regulatory environment and the potential approval of a Bitcoin ETF in the United States,\" said CoinDCX research team.Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said, \"Recent analysis of the Bitcoin market on the 4-hour time frame reveals limited trading range, which is hitting resistance around $30,000, while support is set at $29,000.\"\"Technical metrics like RSI and MACD signal a bearish trajectory. The recent drop to $29,100 suggests a possible continuation of the decline, possibly targeting $28,700 as the next support level. Another violation could see it drop to $28,200,\" Sathvik added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 13.30 hours, IST on August 4, 2023)Bitcoin $29,180 0.58%Ethereum $1,836 0.25%Tether $0.9989 -0.01%BNB $242 1.24%XRP $0.6584 -1.69%Cardano $0.293 -0.78%Dogecoin $0.07444 0.44%Solana $22.99 1.13%Polygon $0.6671 -0.89%Litecoin $82.86 -3.89%Polkadot $5.01 -0.42%Tron $0.07743 1.31%Shiba Inu $0.000008553 3.97%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9jcnlwdG8tc3Rvcm0tYnJld2luZy1iaXRjb2luLXZvcnRleC1pbmRpY2F0b3ItZmxhc2hlcy1idXktYWxlcnQv0gFpaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYml0Y29pbi1uZXdzL2NyeXB0by1zdG9ybS1icmV3aW5nLWJpdGNvaW4tdm9ydGV4LWluZGljYXRvci1mbGFzaGVzLWJ1eS1hbGVydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Crypto Storm Brewing: Bitcoin Vortex Indicator Flashes Buy Alert - NewsBTC",
        "content": "Bitcoin has flashed an important high timeframe buy signal on the Vortex Indicator. Find out why this suggests a storm of buying could be brewing in crypto — and why it could soon suck up everything in its path.\n\nForecasting A Storm in Crypto\n\nLike a meteorologist can with some degree of accuracy forecast the weather, a technical analyst can increase the probability of predicting price movements.\n\nBoth fields rely on on watching for potentially cyclical behavior, repeating patterns, seasonality, and historical trends. But instead of classifying cloud formations, technical analysts rely on Ichimoku clouds expanding and contracting with volatility, or other similar tools.\n\nYet another technical tool related to the elements, the Vortex Indicator, says that Bitcoin buying season is around the corner, and once it starts, it could suck in everyone that’s sidelined and then some.\n\nThe Vortex Indicator has given a buy signal | BTCUSD on TradingView.com\n\nAbout The Bitcoin Vortex Indicator\n\nThe 1M Bitcoin Vortex Indicator has crossed bullish. According to Wikipedia, a buy signal triggers when VM+ crossed above VM-. First revealed by creators Etienne Botes and Douglas Siepman in 2010, the tool helps “identify the start of a new trend or the continuation of the existing trend.”\n\nNotably, in the past, each time the buy signal triggered, the bottom in Bitcoin was in. Even during the COVID collapse the monthly Vortex Indicator didn’t give another sell signal. Also worth mentioning is the fact that it appears to give its signal on the later side, after a bear or bull market is already visible. This speaks to the tool’s use for confirming trend changes. Only a handful of the buy side signals have triggered in BTCUSD history, and each time cryptocurrencies stormed substantially higher.\n\nThe Vortex Indicator was inspired by the work from Viktor Schauberger, an Austrian forest caretaker, naturalist, philosopher, inventor and pseudoscientist. Schauberger studied the flow of water in rivers and turbines during his career. Etienne Botes and Douglas Siepman developed the “idea that movements and flows within financial markets are similar to the vortex motions found in water.”\n\nIn nature, vortices are powerful forces inherent to whirlpools, tornados, and other powerful storms, known for sucking in everything in its path. Even the Great Red Spot on Jupiter is a vortex circling uncontrollably for hundreds – potentially thousands – of years. With this storm potentially changing direction, a wave of buying could be in the forecast.\n\nThe #Bitcoin monthly Vortex Indicator has triggered a buy signal It is used to “spot trend reversals and confirm current trends” Introduced by Etienne Botes and Douglas Siepman in 2010, the Vortex Indicator gives a buy signal when VM+ crosses VM- pic.twitter.com/n82LyOv9ru — Tony \"The Bull\" (@tonythebullBTC) August 4, 2023\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmF0bW1hcmtldHBsYWNlLmNvbS9uZXdzL2JpdGNvaW4tYm9ubmllLWFuZC1jbHlkZS1tYWtlLWd1aWx0eS1wbGVhLWRlYWwtb3Zlci1jcnlwdG8tbW9uZXktbGF1bmRlcmluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin 'Bonnie and Clyde' make guilty plea deal over crypto money laundering - ATM Marketplace",
        "content": "Illya Lichtenstein and Heather Morgan, a married couple known by the nickname 'Bitcoin Bonnie and Clyde,' have pleaded guilty to a $4.5 billion money laundering scheme in connection with the 2016 hack of crypto exchange Bitfinex.\n\nThe Justice Department claimed Lichtenstein hacked into Bitfinex's network and made more than 2,000 fraudulent transactions to transfer nearly 120,000 bitcoins to his cryptocurrency wallet, according to a report by CNN.\n\nHis wife Morgan helped him launder these stolen funds. The pair were arrested in 2022, and since then their lives have come under media attention. Morgan was a rapper who went by the alias Razzlekhan and raps about being \"the crocodile of Wall Street.\" The couple was known to walk a Bengal cat Clarissa on a leash in Manhattan.\n\nLichtenstein who is a Russian immigrant, will remain in jail while awaiting sentencing while Morgan is under house arrest. He pleaded guilty to conspiracy to commit money laundering which comes with a maximum sentence of 20 years in prison, while Morgan pleaded guilty to one county of money laundering conspiracy and one count of conspiracy to defraud the U.S., which each carry a maximum sentence of five years in prison."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLW1heS1iZS1yZWFkeS1mb3ItYS1yZWJvdW5kLWhlcmVzLXdoeS_SAUdodHRwczovL2FtYmNyeXB0by5jb20vYml0Y29pbi1tYXktYmUtcmVhZHktZm9yLWEtcmVib3VuZC1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin may be ready for a rebound – Here’s why - AMBCrypto News",
        "content": "Bitcoin’s utility has increased amid recent losses, signaling a potential increase in value.\n\nLiquidity decreased, but BTC may not drop near $20,000 anytime soon.\n\nAs the flagship digital asset, Bitcoin [BTC] may be showing signs of a potential rebound after facing a period of consolidation and downward pressure. The recent dip, which led BTC below $28,000, has caused a change in market sentiment, leading some to question the presence of an early bull market.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nSights on recovery\n\nHowever, Santiment revealed that there has been an increase in active addresses, such that the metric as of 3 August surpassed the heights of the last three and a half months. The rise in active addresses suggests a surge in utilizing BTC in transactions.\n\n? #Bitcoin's address activity has surged to its highest level in 3.5 months in August. This utility increase, combined with major loss transactions & negative sentiment, is a strong sign that a short-term (at minimum) $BTC price bounce is more probable. https://t.co/5PzjYROX5T pic.twitter.com/G2tevAWdSM — Santiment (@santimentfeed) August 3, 2023\n\nBut it wasn’t just that. The increase coincided with negative sentiment and major transactions in losses. Historically, this is evidence that the period of consolidation could soon come to an end. In turn, BTC might bounce back in the upward trajectory.\n\nFrom the chart shared above by the on-chain analytics platform, on-chain volume in profit to loss was down to -0.155. As a key indicator of profitability in the market, this decline implies that loss-taking volume was overwhelming profits made.\n\nFurthermore, the 30-day Market Value to Realized Value (MVRV) ratio was also negative. The MVRV ratio measures the relationship between the market and realized capitalizations. Values in the positive region indicate an advancement toward the market top.\n\nConversely, when the metric is in negative territory, it implies that BTC could be near the bottom. So, in its press time state, BTC had more tendency to recover than slide again. Another metric to consider in this regard is volume.\n\nThe pace is being established\n\nAs of this writing, the volume was 12.32 billion. While this metric decreased, it has previously risen to 20.05 billion on 2 August, indicating increased liquidity. Therefore, if the volume experiences another hike, it could set the tone for BTC’s bounce.\n\nMeanwhile, Bitcoin’s realized cap was $396.98 billion, according to CryptoQuant. This metric attempts to measure the value of a coin by comparing the network value and the on-chain volume-weighted price.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nWhen compared with the market cap, on-chain data showed that the market value was far ahead at $567.11 billion. Typically, when the market cap and realized cap are similar in value or the latter is a little higher, it could signal closeness to the market bottom.\n\nBut in this case, BTC may have the potential to rebound. However, considering the press time price as the bottom may not be valid. Hence, if BTC decreases again, it might still be around the $25,000 region."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdGVjaGNhYmFsLmNvbS8yMDIzLzA4LzA0L2hvdy10by13aXRoZHJhdy1iaXRjb2luLXRvLXlvdXItYmFuay1hY2NvdW50LWluLW5pZ2VyaWEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "How to Withdraw Bitcoin to Your Bank account in Nigeria. - TechCabal",
        "content": "In Nigeria, there’s a large community of crypto enthusiasts. However, there are some difficulties in navigating the market – like crypto-to-cash exchanges – or in this case, withdrawing Bitcoin to your bank account in Nigeria.\n\nThis challenge has made many Nigerians vulnerable to fraudulent transactions or getting short-changed when converting to Naira.\n\nAs the majority deal with these issues, a solution that targets it must be provided. This is why the Breet app was designed as a one-stop platform focused on seamless crypto-to-cash transactions.\n\nIn this post, we’ll discuss the smoothest way to withdraw Bitcoin to your local bank account —the Breet app.\n\nBreet App: The Best Way To Directly Withdraw Bitcoin To Your Bank Account In Nigeria\n\nBreet is a crypto exchange platform that offers Bitcoin withdrawals directly to Nigerian bank accounts. The Breet app is built for Nigerians (and Ghanaians) and is optimised for ease, speed, and convenience.\n\nThe Breet app is a highly secure exchange platform with state-of-the-art security protocols. There are also various security features such as biometrics, two-factor authentication, and a transaction pin. All of these work to keep unauthorised users out of your app.\n\nIn addition, Breet’s interface is intuitive, user-friendly, and straightforward. This allows you to quickly and smoothly navigate the app with no issues.\n\nThe Breet app offers the most competitive exchange rate in the market, giving you the best cash equivalent for your Bitcoin. It’s also a great way to beat inflation without losing funds as you swiftly move from digital currency to Naira.\n\nTrading with Breet means you’d never need to worry about being stranded. You can get your cash straight into your bank account in minutes. Transactions are that fast!\n\nGetting onboard the Breet app is super simple —you even get an automatic Bitcoin wallet address generated upon sign-up. Want to see how it’s done? We’re talking about that next.\n\nSetting Up A Bitcoin Wallet On Breet\n\nFirst step: Download the Breet App (available on App Store or Playstore, or use the web version).\n\nSecond step: Register with your details\n\nThird step: Verify your email address\n\nFinal step: You’re all set!\n\nYou get your Bitcoin wallet address automatically generated upon sign-up. Your address is permanent, so you can copy and use it when you want to make a withdrawal.\n\nYour wallet address is generated in two formats:\n\nThe QR code, which you can easily scan. Your wallet address which you can copy or share.\n\nWithdrawing Bitcoin To Your Bank Account in Nigeria\n\nWith your Bitcoin wallet address, you receive BTC instantly, which reflects in your wallet in Naira.\n\nNote: you can see the real-time Bitcoin exchange rate on the wallet’s dashboard.\n\nYour Naira is immediately available for withdrawal after the blockchain confirmation time. You don’t have to do anything until the confirmation number is reached. After that, your balance is directly deposited into your bank account.\n\nTo hasten this, toggle on the Automatic Settlement feature and have your crypto converted to Naira as soon as it hits your wallet.\n\nThis is all you need to go from Bitcoin to Naira; it’s super easy!\n\nSecurity And Risk Management Measures When Selling Bitcoin\n\nUse strong passwords and enable two-factor authentication: Create complicated passwords that cannot be easily guessed. It’s best not to use personal information such as date of birth, name, phone number, or a loved one’s information. Your two-factor authentication also provides an extra layer of security — so activate that too.\n\nAvoid public networks (e.g. WiFi): Don’t conduct any Bitcoin transactions on an open network, as it makes your device vulnerable to attacks. Your wallet details are sensitive, so keep them as safe as possible.\n\nStay educated: The Bitcoin market is fast-paced, so keep yourself updated on the best practices and market trends to protect yourself.\n\nConclusion\n\nFellow Nigerian Bitcoin enthusiasts, this is all you need to know for a quick and easy Bitcoin-to-Naira exchange. With the Breet app, you can say hello to secure and reliable trading while keeping all the profits for yourself. Now that you’re aware, hurry and make your first Bitcoin-to-Naira trade. You’ll be glad you did!\n\nShare this article"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1iaXRjb2luLXByaWNlLWZvci1hdWd1c3QtMzEtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Machine learning algorithm sets Bitcoin price for August 31, 2023 - Finbold - Finance in Bold",
        "content": "Amidst a rather subdued beginning to the month of August, Bitcoin’s (BTC) performance has come under scrutiny as it treads precariously closer to the critical support level of $29,000.\n\nDespite a slight uptick on August 4, there are indications that some long-term Bitcoin holders have been cautiously taking profits, seemingly apprehensive about a potential larger downward shift should the crucial $29,000 support fail to hold.\n\nTo glean more comprehensive insights into the near-term price movements of the flagship cryptocurrency, Finbold enlisted the advanced machine learning algorithms deployed by PricePredictions.\n\nThe algorithms analysis, conducted on August 4, suggests that Bitcoin’s price might experience a gradual decline to approximately $28,071 by the end of August, representing a decrease of over $1,100 from its present value.\n\nBitcoin price prediction for August 31. Source: PricePredictions\n\nThe above forecast is based on several key technical indicators, including the moving average convergence divergence (MACD), relative strength index (RSI), Bollinger Bands (BB), and more.\n\nBitcoin price analysis\n\nIt is important to note that while the present trading situation indicates a relatively mild bearish sentiment, Bitcoin may encounter a brief period of correction and potentially dip below the $28,500 mark. However, for such a scenario to materialize, the bears would need to overcome the resistance level at $29,100.\n\nAs things stand, BTC is trading at $29,176, up a marginal 0.55% on the day and 0.26% across the previous week. The largest crypto by market cap has a support level at $28,698, and faces more resistance, slightly below the psychological $30,000 level at $29,727.\n\nBTC 1-week price chart. Source: Finbold\n\nAnalyzing the broader trend, Bitcoin has been experiencing a pattern of lower lows since its decline from the $31,850 mark in mid-July. This observation has prompted market participants to scrutinize critical on-chain indicators, which have revealed that long-term BTC holders seem to be preparing for a potential price reversal.\n\nSuch a cautious approach reflects a mixture of uncertainty and cautiousness among investors, who are carefully monitoring the evolving market conditions and possible factors that might influence Bitcoin’s future trajectory.\n\nThe current market climate for Bitcoin is marked by nuanced dynamics, with investors keenly observing key support and resistance levels, as well as considering technical indicators and on-chain signals. The interplay of these factors will likely determine Bitcoin’s short-term trajectory, influencing whether the cryptocurrency manages to rebound or experiences further corrective movements in the near future.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]