[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzExL2JpdGNvaW4tYnJlYWtzLWFib3ZlLTMway1mb3ItZmlyc3QtdGltZS1zaW5jZS1qdW5lLTIwMjIv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMTEvYml0Y29pbi1icmVha3MtYWJvdmUtMzBrLWZvci1maXJzdC10aW1lLXNpbmNlLWp1bmUtMjAyMi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Breaks Above $30K for First Time Since June 2022 - CoinDesk",
        "content": "Mico noted that there is certainly a narrative shift happening because of the banking crisis feeding into bitcoin’s momentum. Increasingly, \"BTC is also being seen as a reliable store of value that lacks the issues that come with storing your money by way of a third-party intermediary, or a bank,\" he added. \"BTC is now properly starting to be perceived as a risk-off asset.\""
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTEvYml0Y29pbi10b3BzLTMwMDAwLWZvci10aGUtZmlyc3QtdGltZS1zaW5jZS1qdW5lLmh0bWzSAVlodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8xMS9iaXRjb2luLXRvcHMtMzAwMDAtZm9yLXRoZS1maXJzdC10aW1lLXNpbmNlLWp1bmUuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin tops $30,000 for the first time since June ahead of key inflation data; ether nears $2,000 - CNBC",
        "content": "Bitcoin climbed on Tuesday, topping the key psychological level of $30,000 as investors awaited key inflation data later in the week that could steer crypto prices.\n\nThe largest cryptocurrency by market cap was last higher by more than 3% $30,237.42, according to Coin Metrics. Earlier in the day it rose as high as $30,432.83. On Monday night it climbed 7% Monday night to break through the $30,000 level for the first time since June.\n\nEther advanced more than 1.5% to $1,922.06 as investors awaited the Ethereum network's latest tech upgrade, scheduled for Wednesday. Earlier, it rose to $1,937.03, its highest level in a year.\n\nNow that bitcoin has touched $30,000, a move into the mid- to high-30s will be \"likely\" if it pushes through with conviction and would \"force short speculators to cover and buy instead,\" said James Lavish, managing partner at the Bitcoin Opportunity Fund. \"Some investors are trying to get positioned ahead of that,\" he said."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzQvMTAvMjM2NzcxMTMvYml0Y29pbi1taW5lLWludmVzdGlnYXRpb24tZW5lcmd5LWVtaXNzaW9ucy1lbGVjdHJpY2l0eS1iaWxscy1uZXcteW9yay10aW1lc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's insatiable appetite for energy is driving up pollution and costs for Americans, report finds - The Verge",
        "content": "Bitcoin mines in the US have had a tremendous impact on power grids, a New York Times investigation reveals. The mines — which are giant data farms — use vastly more electricity than the communities surrounding them, driving up pollution from coal and gas power plants. The crypto mines also make electricity bills more expensive for their neighbors, even as the companies profit off incentives that grid operators offer to prevent blackouts during an energy crunch.\n\nThis is the most comprehensive analysis yet of Bitcoin’s impact on the environment and energy system in the US. And it comes as Democratic lawmakers press federal agencies to require crypto companies to divulge information about their operations. The Times has startling numbers for individual crypto mines and the industry as a whole, which it got by pouring over financial records, satellite imagery, and studies it commissioned from outside research groups.\n\nThe newspaper identified 34 of the biggest crypto mines in the US, each operating at 40 megawatts or higher. Every single one of them, on its own, uses at least 30,000 times as much electricity as the average home in America. In Rockdale, Texas, the largest and most energy-hungry Bitcoin mining facility in the country burns through as much electricity as the closest 300,000 homes combined.\n\nIn Rockdale, Texas, the largest and most energy-hungry Bitcoin mining facility in the country burns through as much electricity as the closest 300,000 homes combined\n\nThe industry’s expansion in the US has been swift, another stressor for US power grids. The US only became the world’s biggest hub for Bitcoin miners after China kicked them out in 2021. The Times compares the new power demand coming from American crypto mines to suddenly adding another “New York City’s worth of residences.”\n\nBitcoin is a purposely energy-demanding blockchain. To validate transactions and generate new tokens, Bitcoin “miners” use specialized hardware to solve mathematical puzzles. The amount of energy needed to solve those puzzles is supposed to dissuade bad actors from messing with the ledger. The puzzles get increasingly complex with time as more people try to solve them, requiring more sophisticated software that eats up more electricity in the process.\n\nPollution stemming from the added energy demand of Bitcoin mines is about as much as the annual emissions from 3.5 million new gas-guzzling cars, the Times reports. Promises from the industry that Bitcoin mines would spur renewable energy growth haven’t panned out. Coal and gas plants meet about 85 percent of the demand Bitcoin mining adds to power grids, according to an analysis the Times commissioned from the nonprofit Watttime.\n\nOn top of making pollution worse, crypto mines also affect Americans’ energy bills. Skyrocketing demand raises electricity prices and forces nearby households to compete for limited supply. The energy consumption has raised other customers’ electricity bills by almost 5 percent in Texas, according to a Wood Mackenzie analysis commissioned by the Times. That amounts to $1.8 billion per year in higher electricity costs for consumers across Texas, which is home to about a third of the crypto mines scrutinized.\n\nWhile they drive other people’s bills up, crypto companies have managed to game energy systems in their favor. The company operating the Bitcoin mine in Rockdale, Texas, paid just 2.96 cents per kilowatt-hour last year, it reported to investors. That’s compared to 13.5 cents residential customers typically paid that year.\n\nHow does a crypto mine get electricity for so cheap? In Texas, it can benefit from a program that pays industrial businesses to power down when the grid is under too much pressure. This happened in February 2021 when a severe cold snap disrupted energy supply — leaving millions of residents without power and ultimately killing hundreds of people. During the disaster, the state power grid operator paid one crypto mining company an average of $175,000 an hour to power down its computers. In 2020, five mines made at least $60 million from that energy-saving program, the Times reports."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5wZXdyZXNlYXJjaC5vcmcvc2hvcnQtcmVhZHMvMjAyMy8wNC8xMC9tYWpvcml0eS1vZi1hbWVyaWNhbnMtYXJlbnQtY29uZmlkZW50LWluLXRoZS1zYWZldHktYW5kLXJlbGlhYmlsaXR5LW9mLWNyeXB0b2N1cnJlbmN5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "75% of those who've heard of crypto aren't confident in its safety, reliability - Pew Research Center",
        "content": "Cryptocurrency markets are taking hits from all sides – from declines in value to multiple corporate bankruptcies to lawsuits and regulatory threats. Among the vast majority of Americans who say they have heard at least a little about cryptocurrency (88%), three-quarters say they are not confident that current ways to invest in, trade or use cryptocurrencies are reliable and safe, according to a Pew Research Center survey conducted March 13-19. This comes out to about two-thirds of all U.S. adults.\n\nRoughly four-in-ten adults who have heard about cryptocurrency (39%) say they are not at all confident and an additional 36% are not very confident in the reliability and safety of cryptocurrencies. On the other end of the spectrum, few of these adults are extremely (2%) or very (4%) confident in cryptocurrencies. About one-in-five (18%) say they are somewhat confident.\n\nWhile concern about cryptocurrency is broad, some groups of Americans are more concerned than others. For instance, adults ages 50 and older who have heard about cryptocurrency are more likely than their younger counterparts to say they are not confident in its reliability and safety (85% vs. 66%).\n\nHow we did this Pew Research Center conducted this study to examine Americans’ views of and personal experiences with cryptocurrency. This survey was conducted among 10,701 U.S. adults from March 13-19, 2023. Everyone who took part is a member of Pew Research Center’s American Trends Panel (ATP), an online survey panel that is recruited through national, random sampling of residential addresses. This way, nearly all U.S. adults have a chance of selection. The survey is weighted to be representative of the U.S. adult population by gender, race, ethnicity, partisan affiliation, education and other categories. Read more about the ATP’s methodology. Here are the questions used for this analysis, along with responses, and its methodology. This survey includes a total sample size of 375 Asian adults. The sample primarily includes English-speaking Asian Americans and therefore may not be representative of the overall Asian adult population. Despite this limitation, Asian adults’ responses are incorporated into the general population figures throughout this report.\n\nWomen are also slightly more skeptical of investing in, trading or using cryptocurrencies. Among Americans who have heard about cryptocurrency, 80% of women say they are not confident in it, compared with 71% of men.\n\nAttitudes also differ based on whether someone has invested in cryptocurrency. While one-in-five cryptocurrency users say they are extremely or very confident that it is safe and reliable, that share drops to 2% among those who are familiar with cryptocurrency but have not invested. Still, many who have invested in cryptocurrency also have concerns about its security: 43% of this group say they are not very or not at all confident in it.\n\nWho uses cryptocurrency in the U.S.?\n\nOverall, 17% of U.S. adults say they have ever invested in, traded or used a cryptocurrency. This share is mostly unchanged from previous Center surveys conducted in 2021 and 2022.\n\nAs was true in past surveys, younger men are more likely to use cryptocurrency compared with men 50 and older and women of any age. For example, 41% of men ages 18 to 29 say they have ever invested in, traded or used cryptocurrency, compared with 16% of women in the same age range.\n\nCryptocurrency use also differs by race, ethnicity and income level. Some 24% of Asian adults and 21% of Black or Hispanic adults say they have ever invested in or used a cryptocurrency, compared with 14% of White adults.\n\nAbout one-in-five adults with upper (22%) or middle (19%) incomes have ever invested in, traded or used cryptocurrency, compared with 13% of those with lower incomes.\n\nFew cryptocurrency users first used it within the past year\n\nThe survey also asked Americans when they first used cryptocurrency. Roughly three-quarters of those who have ever invested in, traded or used cryptocurrency (74%) say they did so for the first time one to five years ago. Much smaller shares say they first did this within the past year (16%) or more than five years ago (10%).\n\nThere are differences by race, ethnicity and household income among newer cryptocurrency investors. Black users (27%) are more likely than White users (12%) to say they first used cryptocurrency within the past year. Roughly two-in-ten Hispanic users (21%) say the same. (There were not enough Asian American cryptocurrency users to be broken out into a separate analysis.) And about three-in-ten users from lower-income households report first investing in cryptocurrency within the past year, compared with about one-in-ten adults from middle- or upper-income households.\n\nSome past cryptocurrency users no longer have it today\n\nRoughly three-in-ten adults (31%) who have ever invested in, traded or used cryptocurrency say they currently do not have any cryptocurrency. Still, a majority (69%) say they do currently have cryptocurrency.\n\nThose who live in lower-income households (43%) are more likely than those in middle- (30%) or upper-income (21%) households to have given up cryptocurrency. And women who have ever used cryptocurrency are more likely than men in this same group to say they currently do not have any of the currency (37% vs. 29%).\n\nRoughly one-in-five cryptocurrency users say the investments have hurt their personal finances at least a little\n\nA plurality of cryptocurrency users (45%) report that their investments have performed worse than they expected, a result that is statistically unchanged since July 2022, when the Center last asked about this. In comparison, 15% say their investments have done better than expected, 32% say they have done about the same as expected and 7% are unsure.\n\nHowever, when it comes to the impact these investments have had on users’ personal finances, three-in-five users (60%) say that they have neither helped nor hurt. Roughly equal shares say that these investments have helped (20%) or hurt (19%) their finances. Just 7% say that cryptocurrency has helped their finances a lot and 3% say that it has hurt a lot. ­\n\nCollege graduates (25%) and those with some college experience (20%) are more likely than those with a high school education or less (10%) to say that their cryptocurrency investments hurt their personal finances.\n\nNote: Here are the questions used for this analysis, along with responses, and its methodology."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXZzLWdvbGQtaGVyZXMtZm91bmRlci0xNDI0MDYwNzMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin vs. Gold: Here's What the Founder of the World's Largest Hedge Fund Would Choose - Yahoo Finance",
        "content": "The price of Bitcoin and gold surged in March after Silicon Valley Bank led a string of bank failures and liquidity crises. Few analysts were surprised by these price movements as both are used to circumvent banks and other centralized financial institutions. The question is, which one is a better choice in the current economic climate?\n\nRay Dalio, the founder of the world's largest hedge fund, Bridgewater Associates, has weighed in on the great Bitcoin vs. gold or digital gold vs. real gold debate. Few were surprised to hear his opinion as he is well known for his bullish stance on gold. In an interview with Maria Bartiromo at Fox Business, Dalio expressed that he much prefers gold over Bitcoin, even though he said that he holds a small amount of Bitcoin.\n\nDalio has soured further on Bitcoin since the interview, saying that Bitcoin “has no relation to anything” and that it receives disproportionate attention. Dalio believes that Bitcoin's status as a form of digital gold is still unproven, citing concerns that it’s too volatile to be money or a store of value. He acknowledges the potential of blockchain tech; he just doesn’t think Bitcoin will be the one to win out.\n\nIn contrast, gold is stable because it has been a reliable store of value and medium of exchange for thousands of years. Its stability, scarcity and inherent value make it a trusted asset for preserving wealth.\n\nDalio has emphasized that he is not opposed to cryptocurrencies in general but remains skeptical of their ability to replace gold. He has previously stated that he owns \"some Bitcoin,\" but his personal investments in the digital asset have been limited compared to his holdings in gold.\n\nOne of the main arguments against Bitcoin as a store of value is its volatility. Although the digital asset has seen a meteoric rise in value over the past decade, it has also experienced significant price fluctuations. In contrast, gold's price has remained relatively stable, providing investors with a more secure option for preserving their wealth.\n\nStory continues\n\nAnother concern Dalio has raised is the possibility of government intervention in the cryptocurrency market. In a recent podcast, he warned that “in history, they’ve outlawed gold and they’ve outlawed silver and so on, and they could outlaw Bitcoin.” He isn’t the only one who expects world governments to try to shut down a currency they have no control over before it supplants their own.\n\nAs governments around the world start to pay closer attention to digital assets, there is a growing risk of regulatory crackdowns that could impact Bitcoin's value and adoption. Gold, on the other hand, is less likely to face such intervention because it’s a physical asset, it already plays a large role in the global economy and would be extremely difficult to ban. It can also provide unique exposure to things like volatility and fear in the markets, making it a popular tool for diversification and hedging.\n\nInvestors are turning to gold and silver in droves to protect their portfolios as uncertainty rises in the economy. Check out Benzinga’s Precious Metals Hub to master the sector and discover the best precious metals trading platforms.\n\nCheck Out More Precious Metals Articles From Benzinga:\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Bitcoin vs. Gold: Here's What the Founder of the World's Largest Hedge Fund Would Choose originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JhbmstYW1lcmljYS1maWRlbGl0eS1iaXRjb2luLW1pY3Jvc3RyYXRlZ3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Fidelity, Bank of America's Indirect Exposure to Bitcoin Through MicroStrategy - Blockworks",
        "content": "Bank of America and Fidelity have been significant owners of MicroStrategy shares in recent months, suggesting continued institutional interest in indirect bitcoin exposures.\n\nBitcoin volatility has tapered off in recent weeks as crypto traders weigh the asset’s substantial bounceback in 2023 from last year’s lows.\n\nBank of America in a recent SEC disclosure was showing 86,147 MicroStrategy (MSTR) shares owned by one or more of the bank’s investment entities. Banks typically purchase stocks in these cases on behalf of clients and investors in active or passive strategies run out of an asset management arm\n\nFidelity, according to an SEC filing tracking stock purchases through year end 2022, snapped up 97,199 MSTR shares.\n\nBoth regulatory filings are not necessarily indicative of overall holdings for either company.\n\nShares of MicroStrategy (MSTR) have closely tracked the price of Bitcoin since the company began holding the digital currency as a reserve on its balance sheet. And scores of traders still view the stock as one of the closest publicly traded proxies for spot bitcoin exposures.\n\nBTC vs MSTR 2 year / Yahoo Finance\n\nYouwei Yang, chief economist at Bit Mining, told Blockworks in an interview that MicroStrategy continues to be known as the “top choice” for obtaining indirect bitcoin exposure via public and regulated markets.\n\nPlus, bitcoin has been on the upswing for the last three to four months, Yang said, making it a no-brainer for traders to hop on MicroStrategy shares and other bitcoin exposed assets.\n\n“Starting [in] early January, the coins have been climbing quite a bit and it’s [natural] for a trader, whether small or large, to jump in to [buy] any exposure related to crypto or bitcoin,” Yang said.\n\nThe SEC disclosures come as MicroStrategy has continued its long time corporate strategy of adding more and more bitcoin to its portfolio. Founder Michael Saylor’s business intelligence company owned 140,000 bitcoins (BTC) through April 4.\n\nMicroStrategy has maintained its accumulation even as crypto markets have been rattled by escalating US enforcement actions by the SEC and the CFTC. Saylor last year stepped down from his chief executive seat and has since been accused of tax evasion.\n\nThe US publicly traded company hasn’t been deterred — despite posting a net loss of $250 million in the fourth quarter on its BTC holdings.\n\nOn a fourth quarter earnings call in February, MicroStrategy Chief Financial Officer Andrew Kang said that “our corporate strategy and conviction in acquiring, holding and growing our bitcoin position for the long term remains unchanged.”\n\nIndustry participants, including crypto hedge funds and family offices, have been eyeing MicroStrategy’s latest market moves as traders parse unsteady macro conditions.\n\nUpdated April 12, 2023 at 6:59 pm ET: Corrects the disclosed duration of Fidelity’s MicroStrategy stocks holdings to year end 2022. Also clarifies general SEC stock disclosure practices.\n\nLoading Tweet..\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vcXouY29tL2JpdGNvaW4tbWluaW5nLWhhcy1yYWlzZWQtdGV4YXMtZWxlY3RyaWNpdHktcHJpY2VzLTUtMTg1MDMxOTk2MdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin mining raised Texas electricity prices by 5% - Quartz",
        "content": "Industrial-scale bitcoin mining facilities in the US create as much carbon pollution as 3.5 million gas-powered cars, and Texas, which boasts the largest number of mining facilities in the country, will see the cost of electricity rise nearly 5% by mid-2023 due to cryptocurrency mining.\n\n\n\nThose stunning figures come from analyses by tech nonprofit WattTime and energy consultancy Wood Mackenzie for a New York Times investigation into the rise of large-scale bitcoin mining in the US.\n\nAdvertisement\n\nBitcoin miners operate large arrays of computers that are paid fees to solve the cryptological problems that allow the currency to maintain a decentralized database of all its transactions. The investigation found 34 mining operations, each drawing more than 40 megawatts of electricity; many of them were started in the US after China banned the activity there in 2021, partly due to concerns over power usage.\n\nAdvertisement\n\nIronically, many of the mines were able to profit from agreements with electrical grids to pause their operations during emergencies. Systems to reward large electricity users that commit to shutting down when the grid is strained, whether they actually do or not, predate the bitcoin miners, but participating in them added tens of millions of dollars to their aggregate bottom lines.\n\nAdvertisement\n\nIs bitcoin too big for Texas?\n\nTexas, which governor Gregg Abbott wants to be a “crypto leader,” has seen major stress on its grid in recent years, particularly rolling blackouts in February 2021 and a failure in 2022 that left 70,000 people without power.\n\nAdvertisement\n\nThe additional load created by the miners, equal to tens of thousands of new homes, as well as their participation in incentive programs, increased the cost of electricity by nearly 5% across the state and by as much as 9% in some West Texas communities.\n\nRiot Platforms, the largest miner discussed in the New York Times story, said it paid 2.96 cents per kilowatt-hour of electricity in Texas in 2022. Other industrial power users in the state paid 7.2 cents, while residents paid 13.5 cents.\n\nAdvertisement\n\nBitcoin proponents say that other industries aren’t judged on their electricity usage, and that they don’t have a say in how the power they buy is generated. But grid experts say their constant demand for power makes bitcoin mines more reliant on plants that burn fossil fuel.\n\n\n\nThe other question is whether their benefits match the costs: While most forms of power usage offer some obvious added value, the jury is still out on what kind of advantages bitcoin and other cryptocurrencies offer society besides an opportunity for speculation.\n\nUnlike other industrial power users, which typically generate jobs and products, bitcoin mines employ few people, and the gains from the currency largely accumulate for insiders. The price of a bitcoin has risen 76% this year to nearly $30,000, but it is still more than 50% off its peak value in 2021 after the collapse of FTX and disillusionment with the idea of “Web3.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3Lm5ld3NkYXkuY29tL2xvbmctaXNsYW5kL2ludmVzdGlnYXRpb25zL3N1ZmZvbGstY291bnR5LWJpdGNvaW4tbWluaW5nLXh2cnFzb3h50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Illegal bitcoin mining by Suffolk County employees suspected years before discovery, records show - Newsday",
        "content": "Suffolk County’s cybersecurity chief suspected that county employees were bitcoin mining in 2017 — nearly four years before authorities uncovered an illegal mining operation that officials say helped open up the county’s computer network to a devastating ransomware attack, according to an employee’s sworn statement filed in the court case.\n\nOther county employees discussed seeing bitcoin mining devices in the county data center in the county clerk’s office, and a county systems analyst took photos of 10 bitcoin mining devices he saw in the data center and showed them to his boss, recently released court records show.\n\nBut it wasn’t until July 2021 that a county official notified the Suffolk County District Attorney’s Office, which immediately opened an investigation. That resulted in the Sept. 8, 2021, arrest of Christopher Naples, 43, assistant manager of information technology in the clerk’s office, for allegedly running the illegal operation.\n\nA Newsday investigation into the cyber hack that crippled Suffolk County uncovered records that show county IT employees knew of or suspected bitcoin mining but didn't stop it. NewsdayTV's Sandra Peddie reports. Credit: Newsday\n\nThe district attorney's investigation relied on computer-savvy detectives and old-school police work, including hidden-camera surveillance.\n\nWHAT TO KNOW Cybersecurity experts said that the bitcoin mining might have contributed to a ransomware attack in Suffolk County.\n\nsaid that the bitcoin mining might have contributed to a ransomware attack in Suffolk County. Investigators found 46 bitcoin miners.\n\nfound 46 bitcoin miners. Bitcoin is a form of cryptocurrency.\n\nNaples, who admitted to detectives that he installed the bitcoin mining devices to make money, was charged with grand larceny in the third degree, public corruption and computer trespass.\n\nSign up for the NewsdayTV newsletter From breaking news to special features and documentaries, the NewsdayTV team is covering the issues that matter to you. By clicking Sign up, you agree to our privacy policy.\n\nA forensic auditor calculated that Naples stole at least $6,477 in electricity from Suffolk County to run the bitcoin mining equipment, court records show.\n\nLaunched in 2009, bitcoin doesn't exist as physical bills or coins, but as blocks of data that feature a digital signature each time they are moved from one owner to another. Its value has varied significantly in the last few years. Bitcoin mining involves running complex calculations to encrypt blocks of data.\n\nThe charges against Christopher Naples. Source: Southampton Town Justice Court\n\nNaples, of Mattituck, has been suspended with pay. He earned $149,721 last year, according to payroll records. He has not responded to interview requests. His attorney, William Keahon, said he expected the case to be resolved soon. Naples has another court date in May.\n\nThe court records show for the first time that county IT professionals working in County Executive Steve Bellone's administration were aware of the illegal bitcoin mining. The Suffolk clerk is an independently elected office, but its data center is under the purview of the county's Department of Information Technology.\n\nThe question for management, said John Bandler, who teaches cybersecurity at the John Jay College of Criminal Justice in Manhattan, is, “How did it allow this to happen essentially in the open and for so long?”\n\nSuffolk officials, including Chief Deputy County Executive Lisa Black and IT Commissioner Scott Mastellon, did not respond to numerous requests for interviews. Deputy County Executive Vanessa Baird-Streeter said: \"We will not comment on a pending criminal matter being prosecuted by the district attorney's office.\"\n\nCybersecurity experts interviewed by Newsday said the bitcoin mining might have contributed to opening up the county’s system to the ransomware attack. Bellone last year released a report on the cyberattack that found it started in the county clerk's office as early December 2021; took advantage of a common security flaw in computer systems; and spread throughout the computer network, halting the county's websites and servers. In the months after Naples' arrest, the county clerk's office sought a security upgrade, but a steering committee — chaired by the county IT commissioner — rebuffed it, according to emails obtained by Newsday.\n\n\"The issue is that there are so many other attacks on municipalities around the country that are going through this. So, are they related? Possibly. Probably. Certainly, I think there’s a huge chance it was,” said Michael Nizich, director of the Entrepreneurship and Technology and Innovation Center at New York Institute of Technology.\n\nWill Cong, Cornell University Rudd Family professor of management, said the bitcoin mining may have indirectly increased the county’s exposure to a ransomware attack, just as browsing certain websites does.\n\nAttorney William Keahon is representing Christopher Naples, the Suffolk County employee who allegedly ran an illegal bitcoin mining operation. Credit: James Carbone\n\nBellone suggested in a December news conference that Naples, “the architect of the clerk’s IT environment,” for years delayed a key security upgrade that could have blocked the ransomware attack because he didn’t want outsiders discovering his illegal mining operation.\n\nKeahon disputed that.\n\n“He’ll do everything he can to shift the blame,” he said of Bellone.\n\nIn response to Keahon, Baird-Streeter, the deputy county executive, said: \"No official forensic examination has been released nor has the Legislature conducted their review, obviously.\"\n\nThe full court file lays out the suspicions of county IT employees and their unease with the unusual devices they saw not just in the data center but around Naples’ desk. The file also paints a picture of an increasingly brazen Naples, who kept bringing in more bitcoin mining devices, even after a subordinate asked about them. There were so many devices — 46 in all — that they raised the temperature in the data center by 20 degrees and set off alarms.\n\nNonetheless, the court file shows, IT employees were reluctant to remove them, despite the damage the high heat could do to other equipment, or even to confront Naples.\n\nOne systems analyst, Christopher Rizopoulos, who worked for Naples, told detectives in a statement: “I am aware the bitcoining units were not OK. I wanted to notify someone. However, I was really concerned about repercussions from Chris Naples. I didn’t want him to seek revenge.”\n\n\"I am aware the bitcoining units were not OK. I wanted to notify someone. However, I was really concerned about repercussions from Chris Naples. I didn’t want him to seek revenge.\" Source: Southampton Town Justice Court\n\nNaples started working at the clerk’s office in 2000 at the age of 21 under then-Clerk Ed Romaine, who is now the Brookhaven' Town supervisor. Naples’ father, builder Jim Naples Sr., has contributed money to Romaine's political campaigns, giving at least $7,650, state records show.\n\nJim Naples Sr. also contributed at least $2,300 to Judy Pascale, who followed Romaine as clerk.\n\nRizopoulos also told detectives that in 2017, Brian Bartholomew, the county’s information security coordinator, said, “These guys are bitmining.”\n\nThe Suffolk County Clerk's office, where employees reported seeing bitcoin mining devices. Credit: Chris Ware\n\nBartholomew’s attorney, Ray Doyle, declined to comment. Rizopoulos did not respond to requests for an interview.\n\nAnother systems analyst, Matthew Ballantine, became alarmed when he noticed the excessive heat in the data center.\n\n“I know that heat is not good for the equipment, so I looked for the source of the heat,” he said in a statement to investigators. “That’s what caused me to find several devices that appeared to be hidden inside the server racks.”\n\nAt first, Ballantine wasn’t sure what they were and thought there might be a legitimate reason for them. Later in the day, he realized that they might be bitcoin miners. But because he wasn’t authorized to remove the equipment, he instead told Vincent Cordiale, assistant manager of IT operations. Ballantine offered to photograph the equipment the next time he was in the data center. He took the photos of 10 bitcoin miners on Feb. 9, 2021, and showed them to Cordiale.\n\nBallantine and Cordiale did not respond to requests for interviews.\n\nAround July 16, 2021, Ballantine returned to the data center with several other systems analysts to work on some network problems. One analyst, Anthony Oliveto, noticed the excessive heat. Ballantine pointed out the devices and saw additional ones sitting atop server racks, according to his statement.\n\n“None of us had any more conversations about the equipment, but I believe everyone had an understanding that they were miners that probably did not belong in the data center,” Ballantine said in his statement.\n\nAn IT employee who is not named in court records told his superiors, who notified the Suffolk district attorney, according to a statement by district attorney investigator Christopher Acquilino, who led the investigation.\n\nWhat followed was an investigation marked both by technical complexity and cloak-and-dagger technique, such as entering the building in the middle of the night to install covert video equipment.\n\nOn July 29, 2021, special investigator John Primiano and systems analyst Mark Enoch visited the data center after employees left, about 6:45 p.m. They immediately noticed the high heat — it was 89 degrees — and saw an LCD display flashing a red warning light as a high-temperature alarm, despite several large fans in the room. The ideal temperature is just under 70 degrees.\n\nSeveral branch circuits were nearing overload, as the miners were connected to county power strips. They also noticed that someone had put duct tape over the miners’ identification labels, according to Primiano’s statement.\n\nThey counted 21 bitcoin miners.\n\nAbout five hours later at 12:15 a.m., investigators installed a video camera system in the public corridor next to the data center, according to Primiano’s statement. They finished by 2 a.m. and left the building.\n\nTheir nighttime work paid off. They saw Naples installing one of the devices in the data center, according to Acquilino’s statement.\n\nDistrict attorney investigators executed a search warrant on Aug. 19, 2021. This time, they found 46 machines.\n\n“SCDAO investigators found devices in server racks, on top of server racks, on Naples’ desk, under removable floorboards in the data center and in an unused electrical wall panel,” according to Acquilino’s statement.\n\nEquipment used in the illegal bitcoin mining operation that Suffolk authorities displayed in 2021. Credit: John Roca\n\nNaples showed up at 11:30 a.m. District attorney investigators searched the data center and Naples agreed to answer questions, according to Primiano’s statement. Naples acknowledged that he installed the miners to earn money and “indicated that he bought the servers from eBay and 'they were six for $90.' \"\n\nTwo hours after investigators removed the machines, the temperature in the data center dropped 20 degrees.\n\nJust how much Naples earned in cryptocurrency is not revealed in the court file. But at the time he was mining, a single bitcoin was worth $30,000 to $40,000, Cong said.\n\nA bitcoin is now worth about $28,000.\n\nBitcoin is a form of cryptocurrency. It is based on what is known as the blockchain, which is a series of data points linked together. The blockchain serves as a public ledger that anyone can see. Each block in the chain is encrypted through a highly complex and secure algorithm. Because no one has been able to break the code, it is extremely valuable, Nizich said.\n\nAdding a block to the chain requires that somebody make sure that the encryption was done right. That’s called “proof of work,” which is the same as bitcoin mining. That’s done through a complex mathematical process. When someone successfully completes a proof of work, the reward is a bitcoin. Because people all over the world are trying to solve the same mathematical problems, there’s intense competition, Nizich said.\n\n“So you have to have a really good algorithm and a really powerful device — not just a single computer or PC — you have to have a very special device, using what is called an ASIC processor, or you have to have some sort of distributing process level. It wouldn’t be something you’d have usually in your home office,” he said.\n\nNaples’ operation was “extremely sophisticated,” he said.\n\nBecause these devices use enormous amounts of energy, it’s not practical to do it at home. A single device uses the same amount it takes to run a house for 24 hours in just 45 minutes, Nizich said.\n\nA conservative estimate of the cost of the electricity used by Naples' machines was $6,477 from Feb. 10, 2021, though Aug. 10, 2021, according to the court file.\n\nThe machines also used so much county bandwidth that employees working on the weekend couldn’t access the internet, Bellone said in December."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWluLWNpcmN1bGF0aW9uLW92ZXItNTAtbm90LW1vdmVkLWluLTIteWVhcnMtZ2xhc3Nub2RlLXNheXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin in circulation: Over 50% hasn't moved in 2 years, Glassnode says - Cointelegraph",
        "content": "More than half of all Bitcoin (BTC) in circulation has not been touched for two years, according to data compiled by the crypto analytics platform Glassnode.\n\nOn April 10, crypto influencer Anthony Pompliano highlighted that 53% of Bitcoin’s circulating supply has been inactive in the last two years. Citing data published by Glassnode, Pompliano pointed out that this is a new all-time high for this specific metric tracked by the data platform.\n\nMore than 1 out of every 2 bitcoin in circulation has not moved in the last 2 years.\n\n\n\nWe hit a new all-time high of 53% today. pic.twitter.com/W6GzopMAtu — Pomp (@APompliano) April 10, 2023\n\nIn addition, the crypto entrepreneur also pointed toward other metrics, such as Bitcoin, which hasn’t moved for five and 10 years. According to the data, almost 29% of Bitcoin’s circulating supply has not been moved in the last five years. This amounts to over 5.6 million BTC, worth around $158 billion at the time of writing.\n\nAround 2.7 million BTC, worth $76 billion, have not been touched in a decade. Pompliano commented that these Bitcoin could potentially be lost or are in the hands of “the most disciplined investors in the world.”\n\nRelated: CPI to spark dollar ‘massacre’ — 5 things to know in Bitcoin this week\n\nSome community members believe that the data means those holding bought when BTC was at an all-time high and are waiting for the right time to sell. On April 10, 2021, BTC was trading above $60,000, according to the coin information aggregator CoinGecko.\n\nMeanwhile, the keyword “Bitcoin” recently topped the list of most popular search terms in the United States, suggesting that Americans have been curious about Bitcoin lately. The term surpassed other trending keywords, such as the former U.S. president Donald Trump and American singer Elvis Presley.\n\nThe increase in American search interest for Bitcoin follows an announcement by the United States Federal Reserve confirming the launch of the FedNow payments system. On March 16, the U.S. government said that the instant payments platform will be launched in July.\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZm9ya2FzdC5uZXdzL2Fya2Fuc2FzLW1vbnRhbmEtdGV4YXMtYml0Y29pbi1taW5pbmcv0gE_aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYXJrYW5zYXMtbW9udGFuYS10ZXhhcy1iaXRjb2luLW1pbmluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Arkansas joins Montana, Texas with bills on Bitcoin mining guidelines - Forkast News",
        "content": "The U.S. state of Arkansas joined Montana and Texas this year in proposing legislation to regulate Bitcoin mining while also offering legal protections to companies operating such businesses, a stance in contrast to national regulators, such as the Securities and Exchange Commission (SEC), that have fined and filed lawsuits against companies running cryptocurrency exchanges.\n\nSee related article: Solana introduces ‘state compression’ to lower NFT storage costs\n\nFast facts\n\nThe state’s bitcoin bill, known as the Data Centers Act of 2023, has passed in both the Arkansas House of Representatives and Senate and now awaits the governor’s approval. The bill, proposed by Republican Senator Joshua Bryant on March 30, seeks to protect miners from discriminatory regulations and taxes with clearer guidelines.\n\nIt states that crypto miners will be required “to pay applicable taxes and government fees in acceptable forms of currency and operate in a manner that causes no stress on an electric public utility’s generation capabilities or transmission network.”\n\nUnder the legislation, crypto miners will have the same rights as data centers, which the state recognizes as a value to the local economy.\n\nThe move in Arkansas reflects a similar action in Montana in February when the state Senate passed a bill to offer legal protections to cryptocurrency miners, such as prevention of discriminatory electricity rates.\n\nThe picture in Texas is more mixed, with legislation introduced on April 4 that would eliminate some incentives for crypto miners in the state, while in March, the state introduced a bill in support of Bitcoin mining, which is still pending at the House Committee on State Affairs.\n\nMeanwhile, U.S. regulators such as the SEC and the Commodity Futures Trading Commission have fined and filed lawsuits against crypto trading platforms, such as Kraken and Binance, claiming they lack legal approvals to sell some of their services.\n\nCongressman Tom Emmer of the Republican Party has criticized SEC chair Gary Gensler during a podcast appearance, saying Gensler is “blindly spraying the crypto community with enforcement actions while completely missing the truly bad actors.”\n\nThe administration of President Joe Biden has also proposed an excise tax on crypto miners that equals 30 percent of the cost of electricity they use.\n\nSee related article: Thai opposition pledges US$15 bln in digital tokens: Bloomberg"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvZWNvbm9teS13aXRob3V0LWJpdGNvaW4tbmVnYXRpdmUtd2FzdGUtbW9uZXktY29zdHMtc29jaWFsLWZpbmFuY2lhbC1lZmZlY3QtMjAyMy000gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Why the Economy Would Be Better Off Without Bitcoin: Dieter Wermuth - Markets Insider",
        "content": "Bitcoin is a wasteful asset that doesn't add to global welfare, Dieter Wermuth, economist and partner at Wermuth Asset Management, wrote in a recent note.\n\nHe says the bitcoin market is highly centralized, and primarily benefits early investors and miners.\n\nThe tokens fail as currency, given their high volatility and lack of real-world use, according to Wermuth.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nDespite calls from crypto enthusiasts to HODL (hold on for dear life), letting go of bitcoin may be good for world prosperity, at least according to one economist.\n\nThat's because the cryptocurrency is a wasteful investment that takes funds away from general economic growth, Dieter Wermuth — economist and partner at Wermuth Asset Management — wrote in a note published on Wednesday.\n\nNot only does the speculative asset not contribute to broader welfare, it creates social inequalities and allows for money laundering, tax evasion and major climate deterioration, Wermuth said.\n\n\"Bitcoin activities are a negative-sum game,\" he wrote. \"Without crypto, the economy would be better off — there would be more money for consumption and investment.\"\n\nAdvertisement\n\nDetailed below are three reasons to support Wermuth's negative assertions about bitcoin.\n\n(1) It doesn't distribute wealth equally\n\nAfter the front-and-center cryptocurrency bitcoin first launched in 2009, it went from being a virtually worthless asset to holding a level of nearly $68,000 by 2021. But Wermuth argues that the gains were not enjoyed by every investor; rather, an uneven wealth distribution formed that favored crypto insiders.\n\nTo illustrate, a 2021 Wall Street Journal article reported that 0.01% of bitcoin investors held 27% of coins then in circulation, or approximately $232 billion at the time.\n\nWermuth notes that coin-producing crypto miners and those who had positions long before the 2021 rally overwhelmingly profited from the currency's gains, while those who joined late helped make the initial investors richer — only to potentially undergo losses themselves when bitcoin crashed by around 75% in 2022.\n\nAdvertisement\n\n(2) It's not really a currency\n\nThe intense volatility that bitcoin has experienced through its history also demonstrates how ill-equipped it is for a monetary role.\n\n\"Bitcoin has been brought to market with the narrative that it would be a better, more stable currency than traditional money,\" Wermuth wrote. \"This story has been a deception.\"\n\nHis assertion runs on the premise that money needs to attain three core roles — as a means of payment, unit of account and store of value — all of which bitcoin performs poorly at.\n\nIn order to facilitate stability, cryptocurrencies like bitcoin have a limit to the amount of tokens that will enter circulation. However, this is quickly undone when investors treat it as an investment and create more daily volatility than other markets, Wermuth said.\n\nAdvertisement\n\nAt the same time, he cites the fact that bitcoin has yet to have widespread use as a purchasing device, and hasn't been accepted as a means to pay taxes. Transfers between bitcoin accounts, meanwhile, continue to be slower and more expensive than traditional ones.\n\n(3) It's a negative-sum asset\n\nDespite the elements outlined above, bitcoin generates a great deal of financial liquidity without any proof that it contributes to productivity growth, Wermuth said.\n\n\"Back in November 2021 bitcoin's market capitalization reached 1.27 trillion dollars,\" he wrote. \"When Lehman Brothers went belly-up in 2008, a smaller amount of money had triggered the largest financial crisis and the deepest recession of the post-World War period.\"\n\nOn top of that, the process of bitcoin mining — which uses computer hardware to add transactions in the crypto to a blockchain in return for newly minted coins — is so energy intensive that Wermuth described it as a \"major climate killer.\"\n\nAdvertisement\n\nBroader crypto-market issues\n\nHis note comes at a time of high-profile challenges for the broader crypto world — ones that may have started deteriorating investor confidence in the asset.\n\nMost recently, the collapse of the crypto-friendly Signature Bank revealed that it had faced a US probe indicating that its crypto clients may have been taking part in money laundering. At the same time, crypto-exchange Binance is facing a US lawsuit, with one of the allegations citing that it knew that it was facilitating criminal transactions.\n\nBefore that, November's FTX collapse demonstrated the risks for crypto investors operating in the unregulated market, as many of the lender's clients saw their holdings wiped out.\n\n\"I wonder whether it will be enough to just step up regulatory efforts, or to forbid the participation of banks and other financial institutions — or to get rid of these markets altogether (if this is still an option),\" he wrote."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTAvYml0Y29pbi1hcHByb2FjaGVzLTMway1yZWFjaGluZy1oaWdoZXN0LXByaWNlLXNpbmNlLWp1bmUv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8xMC9iaXRjb2luLWFwcHJvYWNoZXMtMzBrLXJlYWNoaW5nLWhpZ2hlc3QtcHJpY2Utc2luY2UtanVuZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Approaches $30K, Reaching Highest Price Since June - CoinDesk",
        "content": "“BTC is also being seen as a reliable store of value that lacks the issues that come with storing your money by way of a third-party intermediary, or a bank,” Richard Mico, the U.S. CEO and chief legal officer of Banxa, a payment-and-compliance infrastructure provider to the crypto industry, wrote in an email to CoinDesk. “This is further supported by the decreasing correlation with the equity markets since 2021 – BTC is now properly starting to be perceived as a risk-off asset.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTAvY3J5cHRvLXJlbGF0ZWQtc3RvY2tzLXN1cmdlLWFzLWJpdGNvaW4tcHJpY2UtaGl0cy1oaWdoZXN0LXNpbmNlLWp1bmUtMjAyMi_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzEwL2NyeXB0by1yZWxhdGVkLXN0b2Nrcy1zdXJnZS1hcy1iaXRjb2luLXByaWNlLWhpdHMtaGlnaGVzdC1zaW5jZS1qdW5lLTIwMjIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Crypto-Related Stocks Surge as Bitcoin Price Hits Highest Point Since June 2022 - CoinDesk",
        "content": "Prior to today's upside action, bitcoin had been locked in a very tight range on either side of $28,000 for about 10 days. There's no apparent news behind Monday's sizable gains. Wednesday the consumer price index (CPI) will be released for March, one of the more important pieces of economic data prior to the U.S. Federal Reserve's early May meeting. Many market watchers are predicting the central bank might end its more than year-long series of interest rate hikes at that meeting."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTAvYml0Y29pbi1mYWNlcy1sb3ctcmlzay1vZi1saXF1aWRhdGlvbnMtaW5kdWNlZC1wcmljZS12b2xhdGlsaXR5LWFmdGVyLTcwLXN1cmdlL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTAvYml0Y29pbi1mYWNlcy1sb3ctcmlzay1vZi1saXF1aWRhdGlvbnMtaW5kdWNlZC1wcmljZS12b2xhdGlsaXR5LWFmdGVyLTcwLXN1cmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Faces Low Risk of 'Liquidations-Induced' Price Volatility After 70% Surge - CoinDesk",
        "content": "\"BTC has essentially traded sideways for the past three weeks, yet, we haven’t seen a build-up in open interest. This is a signal that the market is still in a risk-off mode,\" Blockware's analysts noted, saying the non-expiring perpetual futures are typically in demand during periods of sideways price action, as seen ahead of FTX's implosion."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTAvZmlyc3QtbW92ZXItYXNpYS1pcy1hLXNoYXJwLW1vdmUtYXJvdW5kLXRoZS1jb3JuZXItZm9yLWJpdGNvaW4tYW5kLWV0aGVyL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTAvZmlyc3QtbW92ZXItYXNpYS1pcy1hLXNoYXJwLW1vdmUtYXJvdW5kLXRoZS1jb3JuZXItZm9yLWJpdGNvaW4tYW5kLWV0aGVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "First Mover Asia: Is a ‘Sharp Move’ Around the Corner for Bitcoin and Ether? - CoinDesk",
        "content": "First Mover Asia: Is a ‘Sharp Move’ Around the Corner for Bitcoin and Ether?\n\nALSO: In his latest Money Reimagined column, CoinDesk Chief Content Officer Michael Casey ties the recent political and regulatory backlash toward the crypto industry to the alleged misdeeds of disgraced FTX CEO Sam Bankman-Fried. Will the current climate drive digital-asset innovation and leadership away from the U.S.?"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtc3RhdGUtb2YtdGhlLWJpdGNvaW4tbGlnaHRuaW5nLW5ldHdvcmstaW4tMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "The state of the Bitcoin Lightning Network in 2023 - Cointelegraph",
        "content": "The Lightning Network, a layer-2 payment solution built on top of the Bitcoin blockchain, is six years old.\n\nProducts, users and the amount of Bitcoin (BTC) sent on the Lightning Network (LN) has sky-rocketed in 2023, despite the price per Bitcoin slipping under $20,000.\n\nSource: Twitter/Kerooke\n\nThe LN has benefited from the integration into the Nostr protocol — in which users can send one another satoshis (small amounts of Bitcoin) — and the proliferation of custodial and noncustodial LN wallets, and its formal integration in territories such as El Salvador and Lugano.\n\nFrom Mediterranean cities to Senegal, the LN is also growing as a peer-to-peer means of payment. Nonetheless, despite its growth, concerns still stymie the network, according to key opinion leaders interviewed during Advancing Bitcoin Developer Conference in London.\n\nEric Sirion, co-founder of Bitcoin mobile app Fedi and maintainer of the Fedimint protocol, explained that running a Lightning node in 2023 is still difficult and that some people don’t bother when faced with the complexity:\n\n“To keep your own Lightning node running, to keep well connected, like keep your connections up to date with the nodes that are relevant — it’s a part-time job essentially.”\n\nMatthias Koller, co-founder of Swiss company Pocket Bitcoin, said, “It has become substantially easier compared to early 2018. However, it is still not ‘easy’ for the masses.”\n\n“But it’s exciting to see the development around full node implementations and the progress that’s been made.”\n\nSirion, who wrote the open-source code Fedimint and now works on the Fedi team, explained that custodial Lightning wallets, such as Wallet of Satoshi, are popular among Bitcoin advocates. He’s right: It is the wallet of choice for Nostr, a space dominated by Bitcoiners.\n\nHowever, the reliance on custodial wallets could be a problem for the LN. Trusting a third party with funds, such as Wallet of Satoshi, is contrary to the Bitcoiner mantra, “not your keys, not your coins,” Sirion said.\n\nFurthermore, Koller explained that the reason many Bitcoiners end up sidestepping the “not your keys, not your coins” mantra is that some of the custodial solutions are just so easy. “It’s set up in seconds, ready to transact,” he said, noting:\n\n“But in fact, it’s no different from keeping Bitcoin on an exchange — it’s not your Bitcoin. It’s risky if people aren’t aware of the risks involved and the amounts kept in custodial wallets grow in size.”\n\nHowever, Koller conceded that custodial solutions are fine for “pocket money.” The LN is ideal for micropayments, but even so, trusting centralized wallet providers could erode privacy. In response to the rise in custodial wallets, one Twitter user explained, “If payments are being made from custodial mobile wallets to custodial mobile wallets it’s very simple to link senders and receivers.”\n\nSirion hopes that the rollout of Fedi will undermine the reliance on third parties and provide a straightforward and privacy-centric route to using Bitcoin and Lightning. Fedi uses the open-source protocol Fedimint in which trusted members of a community share ownership of Bitcoin:\n\n“If you’re already using custodial service, at least use one where you have a reason to trust the people that are.”\n\nMoreover, the reliance on Lightning custodial wallets could be in part due to the difficulties in running a Lightning node. Node software businesses, such as Amboss and Umbrel, attempt to remedy the issue with improved UX, but in comparison to downloading Bitcoin Core to run a Bitcoin node, there are more steps, and a deeper understanding of Bitcoin is required to run a Lightning node.\n\nFurthermore, in the world of Venmo, Revolut and other near-instant centralized payment services, there’s a risk that Lightning’s free and frictionless payments do not necessarily solve a pressing problem. During Advancing Bitcoin, Alex Leishman, CEO of Bitcoin firm River Financial, told Cointelegraph, “Bitcoiners use Lightning mostly because it’s interesting and it’s cool. It’s not solving deep problems in their life.”\n\nRelated: Bitcoin Lightning Network growth is organic, coming from real-world adoption\n\nKoller joked that the LN is “Bitcoin on steroids. Fast, cheap and perfect for small, daily transactions.” Plus, it’s still substantially more private than Google Pay or using Visa or Mastercard at a checkout:\n\n“The pain I feel every time I have to use a credit card online is just gut-wrenching. Give me Lightning everywhere!”\n\nLeishman would like to see more people working backward from real human problems observed worldwide and see where Lightning can fit in. For example, in the West, the LN could resolve inter-institutional transactions.\n\n“It can really move the needle on a number of things in the West and in the developing world.”\n\nIn El Salvador, some Salvadorans use the Lightning Network, but cash is still king. Leishman mentions the Taro protocol, which, once implemented, could allow for assets to be issued on the Bitcoin blockchain.\n\n“Do people actually just want dollars? And does that mean we want to try to build stablecoins on Lightning with Taro?” he said.\n\nTaro Diagram. Source: River Financial\n\nThese assets could be deposited into Lightning Network payment channels and transacted instantly. In theory, LN users could hold several balances in their wallets, including different stablecoins or dollars.\n\nCurrently, developers can mint, send and receive Taro assets on the test network of the Bitcoin blockchain. In the meantime, LN developers will continue to seek out more user-centric Bitcoin solutions."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wb3Atb3ItZHJvcC1iaXRjb2luLWFuYWx5c3RzLWRlY2lkZS1pZi1idGMtcHJpY2Utd2lsbC1iZWF0LTMwa9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "'Pop or drop?' Bitcoin analysts decide if BTC price will beat $30K - Cointelegraph",
        "content": "Bitcoin (BTC) continues to tread water at the April 10 Wall Street open, but crypto market participants are betting on a serious breakout next.\n\nAfter a late surge took BTC/USD to its highest weekly close since June 2022, there is new optimism over an attack on $30,000.\n\nData from Cointelegraph Markets Pro and TradingView shows a cool start to the macro trading week, with $28,200 currently forming a focus.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nWith formidable resistance overhead, however, Bitcoin has spent much of the last week in a firmly established but increasingly narrow trading range.\n\nThe longer this holds, the theory goes, the more intense the eventual breakout should be — whether up or down.\n\nCointelegraph takes a look at some popular analysts’ outlooks when it comes to what BTC price action will do next.\n\nMaterial Indicators: Will Bitcoin “pop or drop?”\n\nOrder book data plays a key role in determining flash price moves, and the latest figures from Binance warn that volatility is incoming.\n\nA snapshot uploaded to Twitter by monitoring resource Material Indicators shows that both buy-side and sell-side liquidity are being removed from near spot price to lower and higher levels, respectively.\n\nThis in turn gives the market room for more erratic moves within its range, increasing the potential for a more substantial trend break.\n\n“It’s going to be an interesting week. FireCharts shows pathways to volatility are clearing in both directions. The question is, will BTC pop or drop after all of this chop?” Material Indicators commented.\n\n“CPI and PPI reports this week could be catalysts, but so could liquidity being pulled as we saw yesterday before the W candle close.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nCredible Crypto: BTC price copying 2020 breakout\n\nFor popular trader Credible Crypto, Bitcoin is reenacting a bullish preparatory structure from just before it broke through its old $20,000 all-time high in late 2020.\n\n$26,000 to $29,000 today is “incredibly similar” in terms of price behavior to the $8,000–$10,000 range from the summer of that year, he argued.\n\nIn a perfect world, BTC/USD would dip to around $27,500 to consolidate that area as support before a bullish surge higher, an accompanying chart illustrates.\n\nBTC/USD comparison chart. Source: Credible Crypto/ Twitter\n\nAs Cointelegraph reported, Credible Crypto is not the only market participant eyeing similarities to Bitcoin bull runs of old, with 2019 also forming a focus.\n\nStockmoney Lizards: “Decision point” for Bitcoin\n\nFinancial information resource Stockmoney Lizards meanwhile believes that the overwhelmingly likely outcome of the current rangebound period is “up.”\n\nRelated: CPI to spark dollar ‘massacre’ — 5 things to know in Bitcoin this week\n\nIn its latest chart prediction, it highlighted BTC/USD making a series of higher lows while preserving the same cloud of resistance near $30,000.\n\nThis, it believes, will result in bulls winning out as Bitcoin arrives at a “decision point.”\n\nBTC/USD annotated chart. Source: Stockmoney LIzards/Twitter\n\nAnalysis released the same day reinforces the idea that if a resistance level “has been tested x times and hasn’t broken, it may be a sign that the level is weakening and a breakout is more likely.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3VycGFzc2VzLTEtbWxuLW9yZGluYWxzLWluc2NyaXB0aW9ucy_SAUdodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLXN1cnBhc3Nlcy0xLW1sbi1vcmRpbmFscy1pbnNjcmlwdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin surpasses 1 mln Ordinals inscriptions - Forkast News",
        "content": "The Bitcoin network has recorded over 1.05 million Ordinals inscriptions within the first three months since launch. Bitcoin Ordinals, launched Jan. 21, is a protocol that enables digital assets to be inscribed on satoshis (sats), the lowest Bitcoin denomination.\n\nSee related article: NFT’s Bitcoin Future\n\nFast facts\n\nOver 170 Bitcoin (US$4.8 million) in fees have been spent to inscribe the assets on the Bitcoin blockchain, according to data from Dune Analytics.\n\nOrdinal inscriptions are likened to non-fungible tokens (NFTs) on Bitcoin. They allow users to mint images, videos, text and even video games on sats, which can benefit from the network’s immutability.\n\nThe protocol was developed in the past year by software engineer Caser Rodarmor. It relies on Bitcoin’s Segwit and Taproot, two upgrades that enhanced the blockchain’s smart contract functionalities.\n\nThe millionth inscription comes as interest in Bitcoin Ordinals has been increasing. On Tuesday, April 4, there were 76,374 inscriptions on the network, a daily record, Dune Analytics data shows.\n\nLuxury carmaker Bugatti announced last week a partnership with Asprey Studio, a division of luxury retailer Asprey, to launch a Bitcoin-native NFT collection.\n\nBitcoin rose 1.23% in the 24 hours to 9:30 p.m. Hong Kong time, to trade at US$28,263, according to CoinMarketCap.\n\nSee related article: Bitcoin Punks exceed 1,145 ETH in daily trading volume as Bitcoin Ordinals gain traction"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRlZmllcy1za2VwdGljcy1icmVha3MtMzAtMDQyMDA0MTc4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Defies Skeptics, Breaks $30,000 - Yahoo Finance",
        "content": "Bitcoin Reclaims $30,000\n\nThe road to redemption for the world’s oldest and most popular cryptocurrency has been a rough one (to say the least) and has had plenty of skeptics. However, last night, Bitcoin breached the $30,000 mark for the first time since June 2022. Against all odds, BTC is up ~80% year-to-date. Here are a few important things you should know:\n\n“Buy when there’s blood in the streets”: More times than not, the best time to buy a market is when the news is the worst. Indeed, this turned out to be the case for BTC and various BTC proxies such as the Grayscale Bitcoin Trust (GBTC) and the ProShares Bitcoin ETF (BITO). In November 2022, doomed crypto exchange FTX filed for bankruptcy (after committing the largest fraud since Madoff’s Ponzi scheme), shaking crypto markets. Over that short time, BTC has doubled.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nSafe Haven Asset: For months in 2022, Bitcoin was closely correlated to equities, specifically tech, and the Nasdaq. However, in the past few months, Bitcoin has been trading more in sync with gold. Finally, it appears that “Bitcoin Maximalists” that believe BTC is a safe haven asset and not just a “yolo” product of easy money central bank policies have something to hang their hats on.\n\nBitcoin Behemoth is Back Onside: In 2020, MicroStrategy (MSTR), a public software company in business since the late 1990s, took the bold and unorthodox step to move to the “Bitcoin Standard”. Led by its outspoken and eccentric founder Michael Saylor, MSTR has purchased nearly $4 billion worth of Bitcoin, which translates to roughly 130,000 BTC! In a show of conviction or unfounded confidence (you decide), Saylor and MSTR have dollar cost averaged into BTC the entire way down is finally back to their cost basis of around $30,000 per coin.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nBitcoin Halving is Slated for Early 2024: Roughly one year from now, Bitcoin will experience its next “Halving”. Bitcoin halvings occur every four years and refers to when the reward for Bitcoin miners (network validators) is cut in half. Each halving event means that the number of new Bitcoin being let out into circulation is slashed in half. Remember, unlike central bank currencies, Bitcoin is finite – there will only ever be 21 million in existence. Past halving events have led to dramatic bull markets in BTC’s price.\n\nStory continues\n\nMiners are on Fire: Year-to-date, the Valkyrie Bitcoin Miners ETF (WGMI) is up 97%, making it one of the top-performing ETFs in the entire market. The ETF’s top three holdings include Marathon Digital Holdings (MARA), HIVE Blockchain Technologies (HIVE), and Riot Platforms (RIOT).\n\nLong-Term Technical Picture is Improving: While it is hard to chase Bitcoin into a large round number like $30,000 after a rapid short-term move, BTC and BTC proxies like the Grayscale Bitcoin Trust (GBTC) are showing improving longer-term technical. GBTC just triggered a bullish golden cross – a bullish technical signal that occurs when the 50-day moving average crosses over the 200-day from below. While the signal failed the last time, when it happened in 2020, GBTC shot higher from $10 to $60 is rapid order fashion.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMicroStrategy Incorporated (MSTR) : Free Stock Analysis Report\n\nHIVE Blockchain Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\n\nGrayscale Bitcoin Trust (GBTC): ETF Research Reports\n\nRiot Platforms, Inc. (RIOT) : Free Stock Analysis Report\n\nProShares Bitcoin Strategy ETF (BITO): ETF Research Reports\n\nValkyrie Bitcoin Miners ETF (WGMI): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb2luYmFzZS1jZW8tc2F5cy1iaXRjb2luLWxpZ2h0bmluZy1pcy1zb21ldGhpbmctd2UtbGwtaW50ZWdyYXRl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Coinbase CEO says Bitcoin Lightning is 'something we'll integrate' - Cointelegraph",
        "content": "Bitcoin (BTC) layer 2 scaling solution Lightning may feature on the cryptocurrency exchange Coinbase in some capacity, according to its CEO, Brian Armstrong.\n\nIn a tweet on April 8, Armstrong said that “Lightning is great and something we’ll integrate” in response to a tweet criticizing him for “actively ignoring” the network.\n\nMy tweets auto-delete after some number of months, so there is no search history.\n\n\n\nLightning is great and something we’ll integrate. — Brian Armstrong (@brian_armstrong) April 8, 2023\n\nArmstrong provided no further details on what a Lightning integration with Coinbase would involve or when it could be expected.\n\nCoinbase, along with Binance and the now bankrupt FTX, has been called out in the past for not integrating the Lightning network which enables faster and cheaper BTC transactions than the Bitcoin base network.\n\nAccording to a GitHub repository by Lightning enthusiast David Coen, Coinbase would join Bitfinex, Kraken and OKX as the largest trading platforms to have integrated Lightning, if Armstrong stays true to his word.\n\nCoen had previously suggested that Lightning integration may go against the business plan for many of these trading platforms, “since the priority seems to be to integrate as many altcoins as possible and follow the trends of the market.”\n\nArmstrong claims to have tested out a Lightning network application in recent days, and sent Cointelegraph reporter Joseph Hall $100 in BTC after Hall shared a video of himself using Bitcoin in Senegal.\n\nThe $100 was a prize by Armstrong for those who shared the “best” examples of how people are using crypto in Africa. Hall said he would give away the funds to onboard others to Bitcoin.\n\nHere is a video of me using #Bitcoin in Africa\n\n\n\nI used #lightning for instant, free payments. Does Coinbase Wallet have lightning? ⚡️\n\n\n\n#BitcoinAfrica > #CryptoAfrica pic.twitter.com/1Syz71swR4 — Joe Nakamoto (@JoeNakamoto) April 7, 2023\n\nHall reported, however, that he hasn’t received the payment, prompting Bitcoiner Derek Ross to suggest that Armstrong “needs a lesson on Lightning.”\n\nCoinbase has lately been more active in the Ethereum ecosystem having launched “Base” on Feb 23 — an Ethereum layer 2 application-focused network powered by fellow layer 2 Optimism.\n\nRelated: Bitcoin Lightning Network growth is organic, coming from real-world adoption\n\nInterestingly, Armstrong wrote a “Scaling Bitcoin” article in January 2016, where he said that he would throw support behind Bitcoin scaling solutions:\n\n“We also did it to show our support for scaling Bitcoin, and encourage things to move forward, since we’d like to see a solution sooner rather than later.”\n\nLightning was launched about two years later in March 2018, with last month marking the fifth anniversary of the network.\n\nCointelegraph contacted Coinbase for comment but did not receive an immediate response.\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYXBwbGUtbWFjYm9vay1iaXRjb2luLWRvY3VtZW50YXJ5LWIyMzE2Nzk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Every Mac computer is hiding a secret Bitcoin document - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nA secret Bitcoin document is hiding inside every modern Mac.\n\nAny Mac computer that has been updated to use a version of the MacOS operating system since 2018 is hiding a copy of the “Bitcoin Whitepaper”, a technology blogger has found.\n\nThe Bitcoin Whitepaper was written in 2008, by a person or group of people calling themselves Satoshi Nakamoto and whose real identity has never been found. The document not only details how the cryptocurrency works, but also explains in detail the thinking behind why it was created in the first place.\n\nAs a result, it has become an important document to those advocating for Bitcoin and cryptocurrencies in general.\n\nThat may be the reason that it was seemingly quietly added to the software, presumably by an engineer working on MacOS.\n\nAnyone can open it, simply by looking inside the files for a device called “Virtual Scanner II”. The document appears to have been added as a sample file for that utility, and it may just have been a useful, short document to use as an example.\n\nThe secret document was found by Andy Baio, the blogger and technologist. He noted that despite the file being inside the software for five years, there was very little discussion of it online.\n\nApple has not given any information about how the file came to be added to MacOS. The company did not immediately respond to a request for comment from The Independent.\n\nMr Baio said that he had received a tip-off that the existence was filed as an issue a year ago, and that it was assigned to the engineer who added it, but that there has not been any update since.\n\nOfficially, Apple has stayed largely separate from cryptocurrency, even as it moves into more traditional financial services such as payments and lending.\n\nIn 2021, chief executive Tim Cook said Apple was “looking at” cryptocurrencies and that he had invested in it personally. But he said that the company did not have “immediate plans” to move into it."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTEvYml0Y29pbi1wcmljZS10aWNrZXItZ29lcy1saXZlLW9uLWNoaW5hcy1kb3V5aW4tYXBwL9IBZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTEvYml0Y29pbi1wcmljZS10aWNrZXItZ29lcy1saXZlLW9uLWNoaW5hcy1kb3V5aW4tYXBwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "China’s Douyin App Takes Down Bitcoin Price Ticker Hours After It Went Live - CoinDesk",
        "content": "“In order for Web3 to steadily take the road of innovative development, we will adopt a strategy that emphasizes both ‘proper regulation’ and ‘promoting development,’” he wrote. “In terms of proper supervision, in addition to ensuring financial security and preventing systemic risks, we will also do a good job in investor education and protection, and anti-money laundering.”"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJhbGxpZXMtdG8tMjktNGstYXMtdHJhZGVycy1nZWFyLXVwLWZvci10aGlzLXdlZWstcy1jcGktcHJpbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price rallies to $29.4K as traders gear up for this week's CPI print - Cointelegraph",
        "content": "Bitcoin (BTC) rose to its highest level in ten months on April 10 as traders await this week’s April 12 Consumer Price Index report to gain deeper insight into the Federal Reserve’s fight against sticky inflation. If the report shows inflation dropping, it could be the next possible catalyst that furthers BTC's upward move.\n\nOn April 10, BTC price soared 3.37% to over $29,300 after a quiet Easter weekend. Interestingly, Bitcoin’s intraday gains appeared alongside a drop in U.S. equities, a rare decoupling that highlights the coin’s diminishing risk-on characteristics.\n\nBTC/USD year-to-date returns versus U.S. stock indexes. Source: TradingView\n\nThe pre-CPI dynamic could be in effect\n\nThe Bureau of Labor Statistics will release March Consumer Price Index (CPI) data on April 12, which is expected to show inflation down to 5.1% from 6.0% year-over-year previously.\n\nA slowdown in headline CPI increases the prospects of the Federal Reserve shifting in a more dovish direction. Conversely, persistent inflationary forces could lead traders to bet on more interest rate hikes in May.\n\nBitcoin’s rise above $29,000 suggest that crypto traders have been pricing in a drop in inflation, which, in turn, could lead to a potential Fed pivot.\n\nNonetheless, the U.S. Dollar Index (DXY), which tracks the greenback’s strength against a basket of top foreign currencies, climbed 0.7% on April 10, which, alongside a weaker U.S. stock market, shows macro investors see a rate hike ahead.\n\nDXY daily price chart. Source: TradingView\n\nIn fact, the market sees a 70% probability of the Fed lifting rates by 25 basis points at its meeting in May, according to the CME Fed Watch Tool. That could be due to a tightening labor market that gives the Fed more ammunition to continue raising lending rates in the future.\n\nCould Bitcoin hit $30,000 in April?\n\nFrom a fundamental perspective, Bitcoin looks prepared to hit $30,000 ahead of the Fed FOMC. However, its likelihood of holding those gains will depend on the inflation data, as mentioned above.\n\nRelated: CPI to spark dollar ‘massacre’ — 5 things to know in Bitcoin this week\n\nMeanwhile, from a technical analysis standpoint, Bitcoin must close above its weekly resistance range — defined by the $29,500 to $32,000 area — to eye a run-up toward $40,000.\n\nBTC/USD weekly price chart. Source: TradingView\n\nThis range served as support in the December 2020 to February 2021, May 2021 to July 2021 and January 2022 to March 2022 sessions.\n\nIn the event of a pullback from the mentioned range, BTC price risks a sharp decline toward its 50-week exponential moving average (50-week EMA; the red wave) near $25,250 and its 200-week exponential moving average (200-week EMA; the blue wave) near $25,000.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXNldHMtdXAtZm9yLWFuLWV4cGxvc2l2ZS1tb3ZlLWFzLWFkYS14bG0tYWF2ZS1hbmQtY2Z4LXR1cm4tYnVsbGlzaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price sets up for an explosive move as ADA, XLM, AAVE and CFX turn bullish - Cointelegraph",
        "content": "The long weekend has not produced any fireworks in Bitcoin (BTC) price, which continues to trade inside an ever-narrowing range. Bitcoin is on track to form a third consecutive Doji candlestick pattern on the weekly chart. This suggests that the Bitcoin bulls and the bears are not clear about the next directional move.\n\nIt is not only Bitcoin that is stuck inside a range. On April 7, Jurrien Timmer, director of global macro at asset manager Fidelity Investments, tweeted that the S&P 500 Index had been stuck inside a range for the past nine months and a breakout was due “sooner or later.”\n\nCrypto market data daily view. Source: Coin360\n\nBitcoin’s failure to break above the $30,000 level has attracted profit-booking in several altcoins but a few have witnessed shallow pullbacks. This indicates that traders are holding on to their positions expecting a move higher.\n\nLet’s study the charts of select altcoins that may turn up and start an uptrend if Bitcoin breaks out to the upside. What are the resistance levels above which these five cryptocurrencies turn bullish?\n\nBitcoin price analysis\n\nBitcoin has been trading inside a tight range for the past two days, indicating indecision among the bulls and the bears. Usually, tight ranges are followed by an expansion in volatility.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe 20-day exponential moving average ($27,500) is flattening out and the relative strength index (RSI) has gradually been slipping toward the center. This suggests a balance between supply and demand.\n\nIf the price tumbles below the 20-day EMA, several short-term stop losses may be triggered and the BTC/USDT pair may dive to the breakout level of $25,250.\n\nConversely, if the price rebounds off the 20-day EMA with strength, it will suggest that the sentiment remains positive and traders are buying the dips. A rally above $29,200 could enhance the prospects of a rally to $30,000 and subsequently to $32,500.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe 20-EMA is flattening out on the four-hour chart and the RSI is just below the midpoint. This does not give a clear advantage either to the bulls or the bears. This uncertainty is unlikely to continue for long, and a directional move could soon start. However, it is difficult to predict the direction of the breakout.\n\nTherefore, it is better to wait for the breakout to happen before establishing directional bets. The important level to watch on the upside is $29,200 and on the downside is $26,500. A breach of either level could start a short-term trending move.\n\nCardano price analysis\n\nThe bulls are not allowing Cardano (ADA) to dip below the 20-day EMA ($0.37), indicating demand at lower levels.\n\nADA/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day EMA and the RSI in the positive area suggest that the path of least resistance is to the upside. The ADA/USDT pair could first rise to the neckline of the inverse head-and-shoulders pattern. A break and close above this resistance will signal a potential trend change. The pair could then rally toward the pattern target of $0.60.\n\nIf bears want to prevent the up-move, they will have to quickly yank the price back below the 20-day EMA. The pair may then drop to the 200-day simple moving average ($0.35) and later to $0.30.\n\nADA/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls have pushed the price above the 20-EMA and will next try to overcome the barrier at the downtrend line. If they do that, it will suggest that the pullback may be over. The pair may then climb to the neckline where the bears are expected to mount a strong defense.\n\nContrarily, if the price faces rejection at the downtrend line, it will suggest that bears are active at higher levels. The selling could accelerate below $0.37 and the pair may plunge to the 200-SMA.\n\nStellar price analysis\n\nStellar (XLM) turned down from the overhead resistance of $0.12 and the price is nearing the 20-day EMA ($0.10). The bulls are likely to buy the dips to the 20-day EMA.\n\nXLM/USDT daily chart. Source: TradingView\n\nIf the price rebounds off the 20-day EMA, the bulls will again try to clear the overhead hurdle. If they succeed, the XLM/USDT pair will complete a bullish rounding bottom pattern. That could signal the start of a new up-move. The pair may first rally to $0.15 and thereafter march toward the pattern target of $0.17.\n\nContrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will suggest that bulls are losing their grip. The pair may then drop to the 200-day SMA ($0.09). This is a make-or-break level for the bulls because if it cracks, the pair may plummet to $0.07.\n\nXLM/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the pair is correcting inside a falling wedge pattern. The price has bounced off the support line and the bulls will next attempt to propel the pair above the wedge. If they manage to do that, the pair could rally to $0.11 and subsequently to $0.12.\n\nOn the other hand, if the price turns down and plummets below the support line, it will suggest that the selling has intensified. There is a small support at $0.10 but if that cracks, the decline could extend to the 200-SMA.\n\nRelated: SushiSwap approval bug leads to $3.3 million exploit\n\nAave price analysis\n\nAave (AAVE) has turned down from the overhead resistance of $82, indicating that the bears are fiercely protecting this level. They have pulled the price below the immediate support at the 20-day EMA ($75).\n\nAAVE/USDT daily chart. Source: TradingView\n\nThe AAVE/USDT pair could next slip to the 200-day SMA ($73), which is close to the uptrend line. Buyers are likely to defend this level with vigor. If the price rebounds off the uptrend line and breaks above the 20-day EMA, the pair could reach $82.\n\nIf bulls overcome this barrier, the pair will complete an ascending triangle pattern. This setup has a target objective of $100. This bullish view will invalidate if the price continues lower and breaks below the uptrend line. The pair may then slide to $68 and later to $64.\n\nAAVE/USDT 4-hour chart. Source: TradingView\n\nThe bears have pulled the price to the 200-SMA on the four-hour chart. The 20-EMA has started to turn down and the RSI is in the negative territory, indicating that bears have the upper hand.\n\nIf the 200-SMA gives way, the pair could decline further to the uptrend line. This is an important level for the bulls to defend because a break below it will further strengthen the bears.\n\nOn the upside, a break above the 20-EMA will be the first sign that the bulls are making a comeback. The pair may then rise to the overhead resistance at $82.\n\nCFX price analysis\n\nConflux (CFX) has been in a corrective phase for the past few days but a minor positive is that the bulls are trying to defend the 20-day EMA ($0.36).\n\nCFX/USDT daily chart. Source: TradingView\n\nIf the price rebounds off the current level, the CFX/USDT pair could reach the downtrend line. This is an important level for the bears to guard because a break above it could open the doors for a possible rally to $0.44 and then $0.49.\n\nConversely, if the price plunges and sustains below the 20-day EMA, it will suggest that the bulls may be rushing to the exit. That could attract further selling, pulling the price toward the next support at $0.30. The bulls are expected to buy the dips to this level.\n\nCFX/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are trying to keep the price below the 20-EMA. That could pull the pair to the 200-SMA, which is likely to act as a major support.\n\nIf the price rebounds off this level, the bulls will again try to drive the price to the downtrend line. This is the key level to keep an eye on because a break above it will signal that bulls are back in the game.\n\nOn the downside, a break and close below the $0.30 support could attract further selling, sinking the price to $0.25.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzEwL3doeS1iaXRjb2luLWNvaW5iYXNlLWFuZC1yaW90LXBsYXRmb3Jtcy1hcmUtbW92aW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Why Bitcoin, Coinbase, and Riot Platforms Are Moving Higher Today - The Motley Fool",
        "content": "What happened\n\nThe price of several cryptocurrencies and crypto-related stocks moved higher today for no obvious reason, but as investors prepared for new economic data and for earnings season to kick off later this week.\n\nSince late afternoon yesterday, the price of the world's largest cryptocurrency, Bitcoin (BTC 0.49%), traded 3.8% higher as of 3:37 p.m. ET today.\n\nMeanwhile, shares of the large crypto exchange Coinbase Global (COIN -1.72%) traded 5.5% higher during normal trading hours, while shares of the Bitcoin miner Riot Platforms (RIOT 0.95%) traded nearly 15% higher.\n\nSo what\n\nBecause the markets were closed Friday, the market didn't get to react to the March jobs report until today. The U.S. economy added 236,000 jobs in March, which does represent a slowdown in hiring and was in line with estimates. However, the unemployment rate ticked down to 3.5% as the labor force participation rate increased.\n\nStill, that's a healthy month of hiring, and following the report traders increased their bets that the Federal Reserve would increase interest rates at its May meeting. Rising interest rates crushed Bitcoin in 2022.\n\nYet in another report that came out today from the Federal Reserve Bank of New York, consumers said that accessing credit in March got more difficult and is the toughest it's been since 2014. Since the banking crisis started, banks have been expected to tighten credit, which could chill the economy and potentially even trigger a recession. This might entice the Fed to cut interest rates, which has historically been good for riskier assets like Bitcoin.\n\nAdditionally, analysts from Bernstein in a research note today said that investors' rising interest in gold should also lead to a rise in interest in Bitcoin. The analysts said they see more investors expecting a hard landing for the economy, which will trigger rate cuts and a weakening dollar, which has led them to start favoring gold as a hedge.\n\n\"When there is a massive monetary debasement event, while both Bitcoin and Gold rally, Bitcoin outperforms Gold,\" the analysts wrote. \"For example, post-Covid monetary printing, Bitcoin outperformed Gold (2.9x over ~3.5 years). In fact, even this year, since the banking crisis fears have escalated, Bitcoin rallied ~71% YTD vs. Gold rallying ~10% YTD.\"\n\nWhen Bitcoin trades up other crypto stocks tend to follow. Coinbase benefits when there is increased trading activity in cryptocurrencies, while Riot benefits because the asset that the company mines, Bitcoin, is increasing in value.\n\nNow what\n\nI think the economic data has been somewhat conflicting recently. Traders have been penciling in rate cuts this year, which would likely favor Bitcoin and crypto, but the Friday jobs report also hints that inflation hasn't been tamed yet. The Fed is now expected to do another quarter-point hike at its May meeting.\n\nStill, there will be new key inflation data out Wednesday, and then bank earnings kick off Friday. Both of these events could still change the trajectory of the Fed, so you'll want to keep an eye on them.\n\nWhile I expect volatility, I do think Bitcoin is a cryptocurrency worth having at least a little bit of exposure to, and I would expect Bitcoin to benefit from a weakening dollar or a rate cut. Currently, I am not interested in Coinbase or Riot because of the enhanced regulatory environment around crypto companies, although both will likely benefit if Bitcoin rises. I just prefer Bitcoin."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcGktdG8tc3BhcmstZG9sbGFyLW1hc3NhY3JlLTUtdGhpbmdzLXRvLWtub3ctaW4tYml0Y29pbi10aGlzLXdlZWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "CPI to spark dollar 'massacre' — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts the week on a firm footing as bulls send BTC price to a new 10-month high weekly close.\n\nAfter a relatively calm week, last-minute volatility is getting traders excited at the prospects of a repeat attack on $30,000 resistance — but a lot stands in the way.\n\nIn what is set to be a significant week of macroeconomic data releases, the Consumer Price Index (CPI) print for March is due April 12, along with fresh insights into Federal Reserve policy.\n\nAdd to that the Ethereum Shanghai upgrade and it’s a recipe for volatility. How will Bitcoin react?\n\nVolatility correlations between the largest cryptocurrency and traditional risk assets are inverting, data shows, while sentiment data also suggests little appetite for sudden selling among the hodler base.\n\nCointelegraph takes a look at the status quo in the run-up to what promises to be a week that keeps market participants on their toes.\n\nCPI headlines key macro data week\n\nA familiar event leads the week’s macro calendar, with U.S. CPI data due for March.\n\nThe release, this time on April 12, traditionally accompanies heightened volatility in risk assets, making that date a key area to watch for “fakeouts” in crypto markets.\n\nThe Federal Reserve will further produce the minutes of its latest Federal Open Market Committee (FOMC) meeting, during which it opted to continue raising interest rates.\n\nKey Events This Week:\n\n\n\n1. March CPI inflation data on Wednesday\n\n\n\n2. Fed minutes on Wednesday\n\n\n\n3. March PPI inflation data on Thursday\n\n\n\n4. Consumer sentiment data on Friday\n\n\n\n5. Retail sales data on Friday\n\n\n\n6. 4 Fed speakers this week\n\n\n\nThis week determines what the Fed does next. — The Kobeissi Letter (@KobeissiLetter) April 9, 2023\n\nThe environment is thus somewhat complicated when it comes to CPI’s impact on asset performance. While traders want to see inflation receding faster than expected, the Fed itself remains hawkish, last month confirming that further interest rate hikes may be appropriate.\n\nHowever, a divergence between the Fed and markets is equally evident, with sentiment beginning to show that the latter simply does not believe rate hikes will continue much longer.\n\nAccording to CME Group’s FedWatch tool, next month’s FOMC meeting will likely end in a repeat 0.25% hike. Those odds are highly flexible and react immediately to any new macro data releases, CPI included.\n\nFed target rate probabilities chart. Source: CME Group\n\nFor macroeconomic and stock market analyst James Choi, there is another side to the inflation story, one involving a traditional headwind for crypto: the U.S. dollar.\n\nThis week’s release will set dollar strength on a three-month freefall, he warned on April 10, paving the way for some potential further relief on risk assets.\n\n“People seem to have no idea how the $USD $DXY will fall in the next 3 months,” he commented on a U.S. Dollar Index (DXY) chart originally shared in late 2022.\n\n“And this massacre will begin with this week's CPI report. Mark my words, mark them well…”\n\nU.S. dollar index (DXY) annotated chart. Source: James Choi/ Twitter\n\nOthers are eyeing Q1 bank earnings as a source of potential knee-jerk market reactions, among them Jim Bianco, president of macro analysis firm Bianco Research.\n\nIn part of a Twitter commentary, Bianco predicted that the earnings would be “bigger than CPI.“\n\nBitcoin price volatility on the up\n\nIf volatility is what traders want, they arguably already have it in abundance, data shows.\n\nAccording to market data resource Kaiko, Bitcoin is on a diverging path from equities when it comes to volatility, increasing action while the Nasdaq cools.\n\nThe events of last month, centered around the unfolding U.S. banking crisis, were enough to send the “gap” between Bitcoin and Nasdaq 30-day rolling volatility to its highest levels in a year.\n\nBitcoin vs. Nasdaq correlation chart. Source: Kaiko/ Twitter\n\nBitcoin’s correlation with gold, Kaiko revealed last week, is now higher than with the S&P 500.\n\nBitcoin correlation annotated chart. Source: Kaiko/ Twitter\n\nKaiko added that Bitcoin’s inverse correlation to the U.S. dollar is also rapidly unwinding.\n\n“Although BTC remains negatively correlated with the US Dollar, the correlation is now almost negligible, falling from -60% to -23% YTD,” part of Twitter commentary read at the weekend.\n\nBitcoin vs. DXY volatility chart. Source: Kaiko/ Twitter\n\nBTC price sets new 10-month high weekly close\n\nBitcoin offered a late surprise into the April 9 weekly close, with BTC/USD making last-minute gains to seal the candle at just above $28,300 on Bitstamp, data from Cointelegraph Markets Pro and TradingView shows.\n\nBTC/USD 1-week candle chart (Bitstamp). Source: TradingView\n\nThis is impressive in itself, marking fresh ten-month highs for weekly closes as bears are continually denied a return to lower levels.\n\n“Bitcoin still holding the lower area of support, and still following the path,” Michaël van de Poppe, founder and CEO of trading firm Eight, wrote as part of his latest analysis.\n\n“Everyone wants to long $25K, but I think we won't be getting it. No clear bearish divergences either on higher timeframes. Retest of $28.6K & most likely breakout to $30K+.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/ Twitter\n\nDuring the close, BTC/USD managed to hit local highs of $28,540 before returning to consolidate below the closing level.\n\nVan de Poppe remains optimistic about the short-term prospects.\n\n“Bitcoin consolidated at support and runs to $28,500. Another test of $28,600-29,000 and we’ll most likely breakout significantly,” he continued.\n\n“More importantly; confidence comes back in the markets then, so you’ll see more Altcoins starting to break out.”\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nIn his own appraisal of longer-term market strength, popular trader and analyst Rekt Capital described Bitcoin as “very well positioned” to make further gains.\n\n#BTC is very well-positioned for mid- to long-term upside\n\n\n\nIt would be a shame to miss out on the exponential post $BTC Halving gains#Crypto #Bitcoin pic.twitter.com/FE1j3nCTmN — Rekt Capital (@rektcapital) April 9, 2023\n\nWhen it comes to price action in 2023 so far, however, he remains conservative, noting the ongoing potential for BTC/USD to form a “double top” structure and return toward its yearly open.\n\n“Still unclear whether BTC is forming a Double Top here,” he summarized alongside an explanatory daily chart.\n\n“Either side of the Double Top formation is approximately equal, though this more recent part is becoming a bit longer. If this second part becomes even longer, it could distort the pattern altogether.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nEthereum Shanghai upgrade looms\n\nAs Bitcoin market dominance sees a return to form, BTC may see an internal source of friction this week as Ethereum prepares to undergo its Shanghai hard fork.\n\nETH/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nCointelegraph has extensively reported on the event, which will unlock — and open up for sale — around $2 billion in Ether (ETH).\n\nAnalysts are classically divided over how intense the resulting sell-side pressure might be. Some soberer takes argue that there will be few incentives for holders to exit the market.\n\n“For those looking to ‘sell the news’ after the Shanghai upgrade, staked ETH will take around 1 year+ to be completely unlocked, it will be on a first come first served basis,” analytics account The Modern Investor summarized on Twitter.\n\n“Those who started in 2021 will be released first. Caution: You’ll just be selling your ETH to whales.“\n\nWhile ETH/USD recently hit its highest levels since August, attempting to snatch $2,000, ETH/BTC is struggling to lift off from ten-month lows.\n\nETH/BTC 1-day candle chart (Bitstamp). Source: TradingView\n\n“Rejected,“ popular trader Cheds reacted to the latest events on the ETH/BTC daily chart.\n\nSustainable greed?\n\nDespite crypto market sentiment being at its most “greedy” since the BTC/USD all-time highs of November 2021, there are some encouraging signals from hodlers.\n\nRelated: Bitcoin traders expect ‘big move’ next as BTC price flatlines at $28K\n\nThese come courtesy of research firm Santiment, which at the weekend noted an ongoing trend that echoes hodler action from earlier that year as Bitcoin headed into unknown price territory.\n\n“There is a rising rate of Bitcoin hodlers as traders seem to have become increasingly content in keeping their bags unmoved for the long-term,” it stated.\n\n“We saw a similar trend from January, 2021 through April, 2021 when $BTC rose above $64k for the first time.“\n\nDuring Q1 2021, crypto market “greed” was much more intense, with the Crypto Fear & Greed Index spending much of the time near its maximum levels — traditionally a warning that a correction is due.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRvcHMtZG9uYWxkLXRydW1wLWd1bnMtaW4tYW1lcmljYS1nb29nbGUtdHJlbmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin tops Donald Trump, guns in America: Google Trends - Cointelegraph",
        "content": "Amid the growing discussions around Donald Trump, guns and other topics tied to politics and entertainment, Bitcoin (BTC) remains the most Googled term in the United States.\n\nA search volume comparison based on Ahrefs data revealed that Americans are curious about Bitcoin, with Nevada taking the spot as the “most Bitcoin-crazy state” in the United States. Despite former U.S. President Donald Trump making headlines consistently, he only takes the second position on the list of the most-searched terms in America.\n\nSearch volume comparison (U.S. and global). Source: Ahrefs\n\nAs shown above, other popular terms following Bitcoin and Donald Trump include breaking news, Elvis Presley and Disney World. Previously popular terms such as guns, Chuck Norris, health insurance and politics did not even make it to the top 10 in the list.\n\nSearch comparison of Donald Trump and Bitcoin. Source: Google Trends\n\nIn the last 30 days, Google searches for Donald Trump exceeded Bitcoin for just two days — on April 4 and 5 — when reports of the former president’s possible arrest emerged, according to Google Trends data.\n\nState-wide comparison of Bitcoin searches. Source: Google Trends\n\nA state-wise comparison revealed Nevada as the state with the biggest number of “Bitcoin” searches, followed by Miami, California and Washington.\n\nThe primary reason for this finding is attributed to lower taxes and local government initiatives to promote innovation, according to Trading Browser. “Nevada’s long-standing gambling respiration might be a contributing factor to the success and high interest in Bitcoin,” the study added.\n\nRelated: Binance.US unable to find bank partners in the United States: Report\n\nA new report from the U.S. Department of the Treasury concluded that North Korea and criminals use decentralized finance services to bag illicit profits.\n\nThe @USTreasury just released a risk assessment on #DeFi illicit finance risk. A risk assessment is a study that is often the first step to regulation. Any regulation on #crypto must be compatible with the technology. https://t.co/iag84fJ67G — Perianne (@PerianneDC) April 6, 2023\n\nHowever, as Cointelegraph reported, the Treasury believes that “most money laundering, terrorist financing, and proliferation financing” occurred using fiat currency or outside the digital asset ecosystem.\n\nMagazine: DeFi abandons Ponzi farms for ‘real yield’"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4taG9sZHMtdXMyODAwMC1kb2dlY29pbi1yaXNlcy1tb3N0L9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4taG9sZHMtdXMyODAwMC1kb2dlY29pbi1yaXNlcy1tb3N0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin holds above US$28,000, Dogecoin rises most - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9idGMtdW5hYmxlLXRvLWVzY2FwZS0yOGstcmFuZ2UtaXMtYS1jb3JyZWN0aW9uLWluY29taW5nLWJpdGNvaW4tcHJpY2UtYW5hbHlzaXMv0gFsaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2J0Yy11bmFibGUtdG8tZXNjYXBlLTI4ay1yYW5nZS1pcy1hLWNvcnJlY3Rpb24taW5jb21pbmctYml0Y29pbi1wcmljZS1hbmFseXNpcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "BTC Unable to Escape $28K Range, is a Correction Incoming? (Bitcoin Price Analysis) - CryptoPotato",
        "content": "Bitcoin’s recent upward trend has ceased, and the price has entered a phase of steady consolidation with no clear direction. The cryptocurrency is currently in a crucial zone, and in order to surpass the significant obstacle of the $30K resistance level, there must be an increase in demand and buying power.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nBitcoin has recently reached a critical zone of $30,000, which has proven to be a significant resistance level.. This level has halted Bitcoin’s recent impulsive rally and has resulted in a period of steady PA with low volatility.\n\nIf the BTC bulls push the price above this crucial region, it could likely lead to a long-term bullish trend.\n\nHowever, the divergence between the price and the RSI indicator suggests that a short-term correction is likely to occur soon. In this case, the $25K region, which aligns with the 50-day moving average, will become the primary support level for Bitcoin.\n\nThe 4-Hour Chart\n\nBitcoin has formed an ascending trendline on the 4-hour timeframe, which has been in place for several months and is currently acting as a support for the price. However, the cryptocurrency has been trapped between the ascending trendline and the $30K price region. A significant move above or below this crucial range will potentially eliminate any uncertainty and determine the mid-term outlook of the price.\n\nTo summarize recent movements, a short-term rejection followed by a consolidation correction stage seems likely for Bitcoin in the coming days.\n\nOn-chain Analysis\n\nBy Shayan\n\nBitcoin’s difficulty adjusts based on the behavior of miners and the latest movements in the hash rate. The difficulty level is readjusted depending on the number of miners currently using their machines to mine. When there are more active miners, the difficulty adjustment makes it harder for them to mine a block, which helps ensure that the rate of block production remains relatively constant.\n\nAccording to data from CryptoQuant, the most recent adjustment has led to a spike in the difficulty metric, resulting in a new all-time high. This indicates that more miners are willing to mine Bitcoins and keep their machines running, making the network more secure. Overall, this is a bullish sign for the cryptocurrency."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhvbGRzLWFib3ZlLXVzLTI4LTExMjgyMjQ4Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin holds above US$28,000, Dogecoin rises most in top 10 cryptos - Yahoo Finance",
        "content": "Bitcoin and Ether rose in Monday afternoon trade in Asia, along with most other top 10 non-stablecoin cryptocurrencies by market capitalization. Polygon’s Matic token was the only loser, while Dogecoin gained the most. Asian equity markets were mixed as investors assessed Friday’s U.S. jobs data while awaiting key inflation figures to be released later this week.\n\nSee related article: FTX’s lack of financial controls complicates bankruptcy asset recovery, says legal filing\n\nBitcoin, the world’s largest cryptocurrency by market capitalization, rose 1.36% to US$28,301 in the 24 hours to 4 p.m. in Hong Kong, bringing its weekly gains to 1.23%, according to CoinMarketCap data.\n\nEthereum gained 1.24% to US$1,859, ahead of its Shapella Upgrade on Wednesday, which is expected to lower gas fees for developers and allow investors to withdraw their staked Ether.\n\n“The Beacon Chain and Ethereum have been working smoothly as one since last year, and the Shapella Upgrade is set to enable new features based on the new architecture,” Chen Zhuling, founder and chief executive of crypto staking provider RockX, said in a statement shared with Forkast.\n\n“While some short-term market volatility is to be expected, the long-term benefits to the ecosystem are substantial, as Ethereum’s capacity to handle more transactions per second increases, transaction costs decrease, and the security and efficiency of smart contracts improve,” Zhuling added.\n\nDogecoin led gains at 1.44% to US$0.08287, bringing its weekly gains to 6.15%. Polygon’s Matic was the only coin among the top 10 cryptos to drop, diving 0.09% to US$1.10 in 24 hours, although it is still up 0.32% on the week.\n\nThe global crypto market capitalization rose 1.02% to US$1.18 trillion, while the total crypto market volume gained 4.09% to US$29.18 billion in the last 24 hours.\n\nThe Forkast 500 NFT index fell 0.24% to 3,942.37 points during the day and 2.93% during the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\nAsian markets were mixed on Monday, after U.S. jobs data on Friday revealed that nonfarm payrolls increased by 236,000 jobs in March, indicating that the Federal Reserve may again raise interest rates at its meeting on May 3. Currently, interest rates in the world’s biggest economy are 4.75% to 5%, the highest since June 2006.\n\nThe Shanghai Composite dropped 0.37%, while the Shenzhen Component Index lost 0.80%. Japan’s Nikkei 225 gained 0.42%, and South Korea’s Kospi strengthened 0.87%.\n\nThe U.S. dollar index slid 0.2% to trade above 102 on Monday, a near one-week high, after the U.S. non-farm payrolls report signaled a tight labor market and supported speculation for another interest rate hike in May.\n\nThe euro rose 0.14% to hover above US$1.09 on Monday, close to its two-month high on April 4, as investors expect another interest rate hike from the European Central Bank (ECB). Last week, Klass Knot, a member of the ECB governing council, said he was unsure whether rates should rise by 25 or 50 basis points."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmVycy1zYW1lLXJpZ2h0cy1kYXRhLTEwMDUyOTQ3Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Will Have Same Rights as Data Centers, Says New Arkansas Bill - Yahoo Finance",
        "content": "A new bill aimed at regulating Bitcoin mining in Arkansas has been approved by both the House of Representatives and Senate and is now awaiting Governor Sarah Huckabee Sanders’ signature.\n\nThe Arkansas Data Centers Act of 2023 seeks to establish guidelines for Bitcoin miners and protect them from discriminatory regulations and taxes, guaranteeing that firms have the same rights as data centers.\n\nProposed on March 30 by Rep. Rick McClure and co-sponsored by Arkansas Senator Joshua Bryant (R), the bill quickly garnered support from state legislators.\n\nThe legislation acknowledges the economic value of data centers, recognizing that they \"create jobs, pay taxes, and provide general economic value to local communities.\"\n\nArkansas to Lure Remote Tech Workers With ‘Bitcoin and a Bike’ Sweetener\n\n“Data centers, digital currency, and blockchain technology are legal in all fifty (50) states; and guidance for future industry growth is needed in Arkansas to protect Arkansans from fraudulent business practices,” reads the document.\n\nWhile the bill mandates that crypto miners must pay applicable taxes and government fees using acceptable forms of currency and must operate in a way that does not strain the public electricity grid, it also specifies that the Arkansas government cannot impose unique requirements that are different from those imposed on data centers.\n\n“Discrimination against digital asset mining business [is] prohibited,” states paragraph 14-1-505 of the bill.\n\n“The state of Arkansas has pulled off a surprise victory and become the first in the nation to pass the ‘Right to Mine’ Bitcoin bill in both the House and Senate,” Satoshi Act Fund CEO and co-founder Dennis Porter commented on the news.\n\nThe state of Arkansas has pulled off a surprise victory and become the first in the nation to pass the ‘Right to Mine’ #Bitcoin bill in both the House and Senate. I hope to join @SarahHuckabee for the signing ceremony soon. — Dennis Porter (@Dennis_Porter_) April 8, 2023\n\nThe proposed bill also defines certain terms related to digital asset mining. For instance, \"digital asset mining business\" refers to a collection of computers located at a single site that consumes over one megawatt (1MW) of power on average per year to generate digital assets through blockchain network security.\n\nStory continues\n\nThe legislation also seeks to protect individuals engaged in cryptocurrency mining from their homes, saying that “an individual may utilize a node in this state for the purpose of operating home digital asset mining at the individual's residence according to applicable utility rules and rates.”\n\nThe bill defines a \"node\" as a computational device that houses a copy of the blockchain-distributed ledger technology, while a \"residence\" is defined as a permanent dwelling place, unit, or accessory structure.\n\nFurthermore, “a person that is engaged in home digital asset mining or that has a digital asset mining business shall not be considered a money transmitter under the Uniform Money Services Act,” reads the bill.\n\nIt’s quite a different picture in Texas, where legislators are seeking to remove incentives for Bitcoin miners through Bill 1751. Last week, the bill was unanimously approved in a state Senate committee vote; however, lobbying groups opposing the legislation still hope it doesn’t become a law.\n\nAs explained by Kristine Cranley, Director of Business Development at the Texas Blockchain Council, after being voted out of the Senate, the bill will proceed to the House and have to go through the same process there.\n\n“It does not at this point have a co-sponsor in the House. Even if it does get heard on the house floor, time is short for bills to make it through the entire process before the legislature adjourns on May 29, so there are many places along the way where it can get stalled,” Cranley told Decrypt.\n\nThe Texas Blockchain Council is now focusing on contacting senators and asking them to register a “no” vote on the bill, and is urging others to reach out to their senators “to request that they support a level playing field for all industries by voting no on this discriminatory bill,” added Cranley.\n\nA more significant decision was made by the State of New York in November 2022, when Governor Kathy Hochul approved the proof-of-work mining moratorium, which effectively prohibits cryptocurrency mining operations in the state for a period of two years.\n\nMeanwhile, at the federal level, crypto miners may soon be liable for a 30% tax on their electricity expenses if President Biden's budget proposal, introduced on March 9, is enacted."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTAtYXByaWwtMjAyMy9hcnRpY2xlc2hvdy85OTM3NTExNS5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTEwLWFwcmlsLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5Mzc1MTE1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $28,300; Dogecoin, Ethereum surge up to 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading higher on Monday. Bitcoin (BTC) rose 1.37% to $28,300, whereas Ethereum (ETH) was above the $1,850 level. BTC volume in the last 24 hours stood at approximately $12.43 billion, rising 30.14% in the last 24 hours.\"Most cryptocurrencies rose over the weekend as markets reacted to the non-farm payrolls report, which showed that 236,000 jobs were added to the U.S. economy last month. Bitcoin was back above the US$28,000 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.\"BTC's support now lies at US$27,900, while the resistance lies at US$29,200. On the other hand, Ethereum is attempting to move towards the US$1,900 level and is currently trading flat at the US$1,850 level ahead of the Shanghai update scheduled for April 12th,\" Edul added.Other top crypto tokens were also trading higher. BNB, Dogecoin , Solana and Shiba Inu rose up to 2%. The global cryptocurrency market cap was trading higher around $1.18 trillion, rising 0.85% in the last 24 hours.The total volume in DeFi is currently 3.41 billion, 11.56% of the total crypto market 24-hour volume. The volume of all stablecoins is now $25.94 billion, which is 87.82% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $547 billion. Bitcoin’s dominance is currently 46.17%, up 0.09% over the day, according to CoinMarketCap.\"If Bitcoin is able to break through its current resistance level, we may see a significant price increase, potentially reaching $28,900 or even $29,250. On the other hand, if the current downtrend continues, we can expect significant support around $26,500 and $25,500,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 61, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) indicate a Neutral outlook as well at 63 and 34 respectively.”\"The MACD Level (12, 26), at 750, indicates “Sell”. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be “Neutral” at 34 and −33 respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.22 hours, IST on April 10, 2023)Bitcoin $28,300 1.37%Ethereum $1,860 1.25%Tether $0.9998 0.01%BNB $312.96 0.83%XRP $0.5049 0.10%Cardano $0.3876 0.28%Polygon $1.10 -0.38%Dogecoin $0.08302 1.48%Solana $20.26 1.20%Polkadot $6.18 0.61%Shiba Inu $0.00001094 0.83%Litecoin $90.56 0.39%Tron $0.06668 0.99%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LndpcmVkLmNvLnVrL2FydGljbGUvZXRoZXJldW0tc2hhbmdoYWktdXBkYXRlLWNyeXB0by1yaWZ00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Update Opens a Rift in Crypto - Wired.co.uk",
        "content": "At 19:27 Eastern time on April 12, the Ethereum blockchain, home to the world’s second-most-popular cryptocurrency, ether, will finally sever its links to crypto mining. Within the Ethereum bubble, a sense of anticipation is building; some are planning “viewing parties” for the occasion. Codenamed “Shanghai,” the update to Ethereum caps off a process, after “The Merge,” which fundamentally changes the way transactions are verified and the network secured.\n\nUnder the old system, proof-of-work (PoW) mining, the right to process a batch of transactions and earn a crypto reward is determined by a race to solve a mathematical puzzle. The greater the computing power miners throw at the problem, the greater their chance of winning the race. Under Ethereum’s new proof-of-stake (PoS) system, there is no race and there are no miners; instead, the winner is determined by raffle. The greater the amount of ether somebody locks up on the network—or stakes—the greater the chance they hold a prize-winning ticket.\n\nBy demonstrating that a large-scale blockchain can shift from one system to another, Shanghai will reignite a debate over whether the practice of mining that still supports bitcoin, the most widely traded cryptocurrency, is viable and sustainable. Figures from the University of Cambridge suggest the Bitcoin network consumed 107 terawatt-hours of energy in 2022—equivalent to that of the Netherlands—of which only just over a quarter came from renewable sources. Prior to The Merge, Ethereum consumed roughly two-thirds as much energy as the Bitcoin network. But the move away from mining has cut that consumption, according to analysis by Alex de Vries, data scientist at De Nederlandsche Bank and creator of Digiconomist, a source of crypto emissions data, by at least 99.84 percent.\n\n“The energy consumption problem is Bitcoin’s achilles heel,” says de Vries. “It’s a simple fact that as the price of bitcoin gets higher, the energy consumption problem gets worse. The more money miners make, the more they will typically spend on resources: hardware and electricity.\n\nBut many bitcoiners dispute the characterization of the network as energy-guzzling and carbon intensive, saying that mining is increasingly powered by renewable energy. And, they say, PoS is inferior to PoW—prone to centralization (crypto’s great nemesis), concentrating influence and wealth in the hands of the wealthy, without any mitigating forces, like energy costs, pulling in the opposite direction. All of this makes Shanghai a proxy battle over the future of crypto.\n\nIn bitcoin’s infancy, the cryptocurrency could be mined effectively with just a personal computer and simple software. But as the level of appetite for bitcoin increased, the industry professionalized. Today, the mining scene is dominated by large companies—some publicly traded, like Marathon Digital and Riot Blockchain—that operate gargantuan facilities with rack upon rack of hardware. The largest of these mines, many of which are located in Texas, can draw upwards of 700 MW of power."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZGVjcnlwdC5jby8xMjU4MTEvYml0Y29pbi1taW5lcnMtd2lsbC1oYXZlLXNhbWUtcmlnaHRzLWRhdGEtY2VudGVycy1zYXlzLW5ldy1hcmthbnNhcy1iaWxs0gFoaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTgxMS9iaXRjb2luLW1pbmVycy13aWxsLWhhdmUtc2FtZS1yaWdodHMtZGF0YS1jZW50ZXJzLXNheXMtbmV3LWFya2Fuc2FzLWJpbGw_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Will Have Same Rights as Data Centers, Says New Arkansas Bill - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA new bill aimed at regulating Bitcoin mining in Arkansas has been approved by both the House of Representatives and Senate and is now awaiting Governor Sarah Huckabee Sanders’ signature.\n\nThe Arkansas Data Centers Act of 2023 seeks to establish guidelines for Bitcoin miners and protect them from discriminatory regulations and taxes, guaranteeing that firms have the same rights as data centers.\n\nProposed on March 30 by Rep. Rick McClure and co-sponsored by Arkansas Senator Joshua Bryant (R), the bill quickly garnered support from state legislators.\n\nAD\n\nAD\n\nThe legislation acknowledges the economic value of data centers, recognizing that they \"create jobs, pay taxes, and provide general economic value to local communities.\"\n\n“Data centers, digital currency, and blockchain technology are legal in all fifty (50) states; and guidance for future industry growth is needed in Arkansas to protect Arkansans from fraudulent business practices,” reads the document.\n\nWhile the bill mandates that crypto miners must pay applicable taxes and government fees using acceptable forms of currency and must operate in a way that does not strain the public electricity grid, it also specifies that the Arkansas government cannot impose unique requirements that are different from those imposed on data centers.\n\n“Discrimination against digital asset mining business [is] prohibited,” states paragraph 14-1-505 of the bill.\n\n“The state of Arkansas has pulled off a surprise victory and become the first in the nation to pass the ‘Right to Mine’ Bitcoin bill in both the House and Senate,” Satoshi Act Fund CEO and co-founder Dennis Porter commented on the news.\n\nAD\n\nAD\n\nThe state of Arkansas has pulled off a surprise victory and become the first in the nation to pass the ‘Right to Mine’ #Bitcoin bill in both the House and Senate. I hope to join @SarahHuckabee for the signing ceremony soon. — Dennis Porter (@Dennis_Porter_) April 8, 2023\n\nThe proposed bill also defines certain terms related to digital asset mining. For instance, \"digital asset mining business\" refers to a collection of computers located at a single site that consumes over one megawatt (1MW) of power on average per year to generate digital assets through blockchain network security.\n\nThe legislation also seeks to protect individuals engaged in cryptocurrency mining from their homes, saying that “an individual may utilize a node in this state for the purpose of operating home digital asset mining at the individual's residence according to applicable utility rules and rates.”\n\nThe bill defines a \"node\" as a computational device that houses a copy of the blockchain-distributed ledger technology, while a \"residence\" is defined as a permanent dwelling place, unit, or accessory structure.\n\nFurthermore, “a person that is engaged in home digital asset mining or that has a digital asset mining business shall not be considered a money transmitter under the Uniform Money Services Act,” reads the bill.\n\nIt’s quite a different picture in Texas, where legislators are seeking to remove incentives for Bitcoin miners through Bill 1751. Last week, the bill was unanimously approved in a state Senate committee vote; however, lobbying groups opposing the legislation still hope it doesn’t become a law.\n\nAs explained by Kristine Cranley, Director of Business Development at the Texas Blockchain Council, after being voted out of the Senate, the bill will proceed to the House and have to go through the same process there.\n\n“It does not at this point have a co-sponsor in the House. Even if it does get heard on the house floor, time is short for bills to make it through the entire process before the legislature adjourns on May 29, so there are many places along the way where it can get stalled,” Cranley told Decrypt.\n\nAD\n\nAD\n\nThe Texas Blockchain Council is now focusing on contacting senators and asking them to register a “no” vote on the bill, and is urging others to reach out to their senators “to request that they support a level playing field for all industries by voting no on this discriminatory bill,” added Cranley.\n\nA more significant decision was made by the State of New York in November 2022, when Governor Kathy Hochul approved the proof-of-work mining moratorium, which effectively prohibits cryptocurrency mining operations in the state for a period of two years.\n\nMeanwhile, at the federal level, crypto miners may soon be liable for a 30% tax on their electricity expenses if President Biden's budget proposal, introduced on March 9, is enacted."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmF0bW1hcmtldHBsYWNlLmNvbS9uZXdzL2NvaW5odWItdG8tZGVsaXZlci1iaXRjb2luLWF0bXMtdG8tMTAwMC1yZXRhaWxlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Coinhub to deliver bitcoin ATMs to 1000 retailers - ATM Marketplace",
        "content": "Coinhub, a bitcoin ATM operator, will deliver bitcoin ATMs to more than 1,000 gas stations and store owners in an effort to expand its overall reach, according to a press release.\n\nCustomers can purchase bitcoin with cash on the ATMs, and the process is designed to be simple for those new to cryptocurrency, according to the release.\n\nStore owners can visit Coinhub's website to sign up to host a bitcoin ATM."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZGVjcnlwdC5jby8xMjU4MDUvYml0Y29pbi1lbmVyZ3ktdXNlLXRyYW5zcGFyZW5jeS1mZWF0dXJlLW5vdC1idWfSAU9odHRwczovL2RlY3J5cHQuY28vMTI1ODA1L2JpdGNvaW4tZW5lcmd5LXVzZS10cmFuc3BhcmVuY3ktZmVhdHVyZS1ub3QtYnVnP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin’s Energy Transparency Is a Double-Edged Sword: Hut 8 Mining CEO - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nConversations surrounding Bitcoin’s sustainability often touch on how much power the network consumes. But the mere fact that its power consumption is a known factor is notable, according to Canadian Bitcoin miner Hut 8’s CEO Jaime Leverton.\n\n“We see our energy use, really, as a feature of proof of work,” she said, referencing the process by which Bitcoin transactions are verified on the latest episode of Decrypt’s gm podcast.\n\nAD\n\nAD\n\nCritics like Massachusetts Senator Elizabeth Warren have slammed Bitcoin mining as a contributor to the climate crisis. Bitcoin faithful like MicroStrategy CEO Michael Saylor counter with the notion that miners give what would be wasted energy a new purpose, effectively storing it in cyberspace as Bitcoin.\n\nBitcoin mining consumes roughly the same amount of electricity as Washington state—putting pressure on our power grids and worsening the #ClimateCrisis. We need to protect our planet and crack down on environmentally wasteful crypto mining practices. https://t.co/ChKYcD82gH — Elizabeth Warren (@SenWarren) September 7, 2021\n\nRegardless, the environmental footprint of Bitcoin mining has been well documented, in part because Bitcoin’s hashrate is public. The measure captures the computational force being used across Bitcoin’s network as miners race to solve Bitcoin’s next block by continuously crunching complex calculations.\n\nLeverton said that having this competition play out in front of everyone’s eyes creates a degree of transparency innate to Bitcoin mining—one that isn’t shared by the traditional financial system.\n\n“It’s easy to see how much energy is used by Bitcoin miners because it’s publicly available information,” she said. “Whereas, you can’t see how much energy is used by the traditional fiat banking system or by hard metal mining.”\n\nAD\n\nAD\n\nIn terms of where miners source their power, Leverton noted that the Bitcoin Mining Council produces quarterly reports by surveying industry participants. The latest report found that around 60% of the power tapped by BMC's members—which comprise nearly of the Bitcoin mining industry globally—came from a sustainable power mix, harnessing sources like solar, wind, and hydro electricity.\n\n\"That data is incredibly relevant,\" Leverton said. \"It differs from other industries that aren't transparent about their energy use.\"\n\nThe conversation surrounding Bitcoin’s energy consumption reignited last month partly due to the “Skull of Satoshi,” an art installation unveiled as part of Greenpeace’s “Change the Code, Not the Climate” campaign. Working with the artist Benjamin Von Wong, the international environmental NGO sought to bring attention to Bitcoin’s carbon footprint. (Von Wong later said that his black-and-white perception of Bitcoin mining was wrong.)\n\nBut making a judgment about Bitcoin’s energy consumption is influenced by whether or not someone thinks Bitcoin itself has any value, Leverton said. And she argued that the value versus energy critique hasn’t historically been applied to other forms of technology with the same scrutiny, overlooking the potential that Bitcoin has to offer financial services to the globe's unbanked population at the same time.\n\n“We don’t talk about how much energy the gaming industry uses, as an example, or whether video games have value to the broader population,” she said. “We just accept that we know we assume that’s a lot of energy, but we don’t have a value debate about it.”\n\nListen to the full episode and subscribe to the gm podcast."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi3wFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG8tbmV3cy1qZXNzZS1teWVycy1wcmVkaWN0cy1iaXRjb2luLXByaWNlLXRvLXJlYWNoLTEwLW1pbGxpb24tcGVyLWJ0Yy1yZW5xLWZpbmFuY2UtcmVucS10by1vdXRwZXJmb3JtLW1vc3QtY3J5cHRvcy1pbi10aGUtbWFya2V0LWFuZC1iZWNvbWUtdGhpcmQtYmlnZ2VzdC1hZnRlci1idGMtYW5kLWV0aC1mZWVscy1leHBlcnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Crypto News: Jesse Myers predicts Bitcoin price to reach $10 Million per BTC, RenQ Finance (RENQ) to outperform ... - Analytics Insight",
        "content": "The crypto market is always buzzing with news and predictions from experts, and the latest one comes from Jesse Myers who predicts that Bitcoin price will reach an incredible $10 Million per BTC. While this news is exciting for Bitcoin investors, there is another crypto that is expected to outperform most others in the market – RenQ Finance (RENQ). Experts believe that RenQ Finance has the potential to become the third biggest crypto after BTC and ETH, and it’s no surprise why.\n\nIn this article, we will explore why RenQ Finance is making waves in the crypto world and why it should be on every investor’s radar.\n\nJesse Myers’ Prediction for Bitcoin Price\n\nJesse Myers, has recently made waves in the crypto world with his bold prediction for the future price of Bitcoin. Myers believes that BTC could reach an astounding $10 million per coin in the next decade.\n\nIn an interview on the “Coin Stories” podcast with Natalie Brunell, Myers explains the reasoning and timeline behind his daring forecast. He points out that Bitcoin is carving out its place as a solid and scarce store of value in an age where debt is ballooning, and currencies are depreciating at an alarming rate.\n\nMyers emphasizes the precarious state of holding bonds or fiat money in today’s economic climate, with the national debt and unfunded liabilities necessitating unprecedented levels of money printing just to stay afloat. According to Myers, Bitcoin’s maximum supply of 21 million BTC will create a massive supply shock as the leading cryptocurrency’s rate of adoption increases.\n\nTo reach his $10 million per BTC prediction, Myers breaks down the math in today’s dollar terms. He believes that Bitcoin capturing half of gold’s market cap, along with additional percentages of the world’s top store of value categories, could lead to this incredible price point.\n\nRenQ Finance’s Potential in the Market\n\nIn addition to Myers’ bold prediction for Bitcoin, there is another crypto that is catching the attention of experts: RenQ Finance (RENQ). According to market analysts, RenQ Finance is poised to outperform most cryptocurrencies in the market and become the third-largest after BTC and ETH.\n\nRenQ Finance is a multi-chain DeFi yield optimizer that allows users to earn compound interest on their crypto holdings. RenQ uses a set of investment strategies secured and enforced by smart contracts to automatically maximize user rewards from various liquidity pools (LPs), automated market-making (AMM) projects, and other yield farming opportunities in the DeFi ecosystem. This DeFi token aims to provide a range of financial services, including yield optimization and lending protocols, to users across multiple blockchain networks.\n\nOne of the main advantages of RenQ Finance is its focus on user experience. By using a RenQ vault to compound gains, users can save thousands of transactions with their associated gas costs and precious personal time. RenQ Finance also offers a decentralized launchpad for blockchain projects, an NFT launchpad, and a lending protocol, which further enhances its appeal to investors.\n\nIn addition, RenQ Finance’s focus on interoperability is a key factor that sets it apart from other tokens. The ability to operate across different blockchain networks can increase the adoption and utility of the token, leading to further growth in its value.\n\nRenQ Finance’s Recent Milestones\n\nRenQ Finance has already achieved several significant milestones in its journey. The token’s presale stage saw tremendous success, with the team raising over $5.6 million in just four stages of the presale, with over 75% price gain as of writing. The presale stage was launched in February 2023, and the project is currently in its fourth stage, selling at $0.035, which is 84% full, and approaching stage five with full force and a gain of 100%.\n\nRenQ Finance has also partnered with several key players in the industry, including Chainlink, Binance Smart Chain, and Polygon. These partnerships have helped to increase the visibility and credibility of the project and provide users with a seamless experience across different blockchain networks.\n\nConclusion\n\nThe cryptocurrency market is always evolving, with new developments and predictions emerging on a regular basis. While Bitcoin continues to dominate the market, other tokens like RenQ Finance are gaining attention for their innovative offerings and potential for growth.\n\nWhether Jesse Myers’ prediction for Bitcoin’s future comes true or not, it is clear that the cryptocurrency market will continue to be an exciting space to watch in the coming years.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDQvMTAvaGlkZGVuLWJ1bGxpc2gtcGF0dGVybi1jYW4tYml0Y29pbnMtcHJpY2UtcmVhY2gtdG8tMzVrLW1hcmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Hidden Bullish Pattern: Can Bitcoin's Price Reach to $35K? - Crypto Times",
        "content": "The leading cryptocurrency Bitcoin appears to be under consolidation ahead of a move toward $35,000 in the coming weeks.\n\nOver the past several days, the total market capitalization has remained in the range of $1.8 to $1.9 billion, suggesting stability in the market. Meanwhile, Bitcoin price is in a consolidation phase after last week’s rapid rally above $20K, a key support level.\n\nAt the time of writing, the Bitcoin price is trading at $28,315 against the USDT pair with an overnight gain of 1.37%. The trading volume also increased by almost 24% to $12.23 billion in the last 24 hours.\n\nBuyers seem to be getting tired as the BTC price traded sideways above $27,700 and $28,500. However, the largest cryptocurrency reached a 2023 high of $28,028 on March 30.\n\nFollowing the bullish rally in March, the Bitcoin price structure drew a pole and flag pattern on the daily price scale. This bullish price action displays an upcoming bullish rally which will take place at the next conceptual round level of $30K. If this level gets broken, then the price can see a bullish rally up to $35K. Sellers may attempt a massive sell-off near the $35K area.\n\nOn the daily time frame, Bitcoin remains above all significant moving averages such as 20, 50, 100, and 200. Specifically, its low volatility and sideways market momentum could lead to a BTC crackdown below the 20 DMA (black).\n\nSupport levels – $25,000 and $20,000\n\n– $25,000 and $20,000 Resistance levels – 30,000 and 35,000\n\nSubscribe to The Crypto Times to stay updated on Market Analysis!!"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL3RlY2gvbmV3cy9lbG9uLW11c2stamFjay1kb3JzZXktZmluYWxseS1saW5rLXVwLW5vdy1ibG9jay10by1taW5lLWJpdGNvaW4tYXQtdGVzbGEtdGV4YXMtc29sYXItcGxhbnQtNzE2NDk0ODE1MDgxMzEuaHRtbNIBnAFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL2FtcC90ZWNoL25ld3MvZWxvbi1tdXNrLWphY2stZG9yc2V5LWZpbmFsbHktbGluay11cC1ub3ctYmxvY2stdG8tbWluZS1iaXRjb2luLWF0LXRlc2xhLXRleGFzLXNvbGFyLXBsYW50LTcxNjQ5NDgxNTA4MTMxLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Elon Musk, Jack Dorsey finally link-up! Now, Block to mine Bitcoin at Tesla Texas Solar Plant - HT Tech",
        "content": "Tesla Inc. is collaborating with Jack Dorsey's Block Inc. and crypto firm Blockstream Corp. to mine Bitcoin at a solar-powered battery manufacturing facility run by the automaker in Texas. The mining farm will tap into Tesla's energy storage technology with rechargeable large-scale batteries at the site, Adam Back, chief executive of Blockstream, said at the Bitcoin Conference 2022 in Miami. Back didn't specify the location.\n\nThe venture is the latest manifestation of the aligning interests of Tesla Chief Executive Elon Musk and Twitter co-founder Dorsey, including over the energy usage of Bitcoin. Earlier this week, Dorsey said he was happy that Musk joined the board of directors of Twitter after Musk revealed his sizable stake in the social media giant.\n\nMusk expressed his interest in Bitcoin and Dogecoin early last year and allowed Tesla customers to buy the electric cars with Bitcoin, helping to send the crypto market to record highs. However, the carmaker later suspended the Bitcoin payment opening citing environmental concerns over Bitcoin mining.\n\nThe latest move comes after Block, which is formerly known as digital payment company Square, secured a purchase from Intel Corp.'s Bitcoin mining chip. Buyers of the chip can potentially either make their own mining rigs or receive an assembled machine from the chipmaker.\n\nDorsey revealed the plan to decentralize Bitcoin mining and make the token's network more secure with Block earlier this year.\n\nIn the meanwhile, Dorsey has fully embraced the largest cryptocurrency by including Bitcoin micropayment Lightening Network in Twitter's tipping function and launching the NFT profile function. He has funded Bitcoin developers and planned to decentralize Bitcoin mining.\n\nTesla's first-quarter filing disclosed the company held $2.48 billion in Bitcoin as of March 31. Bitcoin revenue contributed to over half of the total net revenue of Block's Cash App, a separate filing showed.\n\nThe central and western parts of Texas are among the regions with rich wind and solar power resources. Bitcoin miners have flocked to the region, set up mines or expand transmission capacity in the past year.\n\nA Tesla subsidiary registered as Gambit Energy Storage LLC is building a more than 100 megawatt energy storage project in Angleton, Texas, a town roughly 40 miles (64 kilometers) south of Houston."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9leHBlcnQtdmlldy94bS1hdXN0cmFsaWFzLXBldGVyLW1jZ3VpcmUtaXMtYnVsbGlzaC1vbi1jcnVkZS1iaXRjb2luLWFuZC1pbmRpYS1oZXJlcy13aHkvYXJ0aWNsZXNob3cvOTkzNzMwMTkuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2V4cGVydC12aWV3L3htLWF1c3RyYWxpYXMtcGV0ZXItbWNndWlyZS1pcy1idWxsaXNoLW9uLWNydWRlLWJpdGNvaW4tYW5kLWluZGlhLWhlcmVzLXdoeS9hbXBfYXJ0aWNsZXNob3cvOTkzNzMwMTkuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "XM Australia's Peter McGuire is bullish on crude, Bitcoin and India. Here's why - The Economic Times",
        "content": "Unlock Leadership Excellence with a Range of CXO Courses Offering College Course Website Indian School of Business ISB Chief Digital Officer Visit Indian School of Business ISB Chief Technology Officer Visit IIM Kozhikode IIMK Chief Product Officer Programme Visit\n\nYou Might Also Like: 4 oil and gas stocks to bet on now: Probal Sen\n\nYou Might Also Like: ETMarkets Trade Talk: Bengaluru CFA student hits bull's eye with option trading\n\n\n\n\n\n\n\n\n\n, CEO,, says he has been an advocate of India for long, India has an incredibly young population, growing population, appetite, entrepreneurship, innovation, some of the best professors in the world are Indians who have been trained at US business schools and the brains trust here is just immense.Mcguire doesn’t doubt India's recovery or growth over this decade, let alone what will happen in the next few decades. The best years of economic growth are ahead of India. The construction and infrastructure sector is coming up the curve at a thousand miles an hour. It is boom time for India.Well, I think it is an interesting time over Easter. We have seen dramatic moves and we are worrying over geopolitical fronts – the China-Taiwan situation, the ongoing situation with Russia and crude. So that is going to be a very interesting quarter. We have to see how it plays out over the next couple of months. The first quarter was electric and this quarter is going to be equally volatile and exciting.Yes, that really shook the market last Sunday week and it hit everyone for a six. It was out of the field. It really surprised everyone. There was an end. I think there is further upside. Many of the investment banks are saying $95 is achievable, maybe even $100. I just want to see where we are over the next matter of weeks. If geopolitical tensions escalate, we could put $15, $20 on very, very quickly. So, yes, it is exciting times across that trading complex.I do not know. When you think about demand, we are still at 100 million barrels approximately a day from a big picture perspective. Yes we could see a softening as far as demand, but China is still doing incredible numbers. I have been in Mumbai for 12 hours and it is just incredible; the construction here, the movement, the mobility. We cannot kid ourselves that there is no huge demand across the planet and we have just got to see where that all plays out from an OPEC perspective. It is going to be again very exciting for the complex.Well it has been strong. They have come out of the blocks very quickly after Lunar New Year and it really surprised everyone with those growth forecast numbers moving forward. So from a demand picture, we have very strong demand for crude, strong demand for base metal and strong demand for every commodity in the world. I think there has been chronic underinvestment over the last decade which is going to come home to roost and will in turn make this decade a continuation of the super-cycle across the commodity complex.The dollar has come under continued pressure to the downside. Only a couple of months back, when it hit that 114 everyone was saying the US dollar index is capable of hitting 120. It is now at 102. You have seen big moves across the Yen, British Pound, Aussie Dollar and naturally the Euro. We are at the end of the rate tightening cycle. Some of the other currencies are going to see a continuation of rate rises, probably the ECB and the Pound. I think that the dollar will come under a little bit further downdraft and between Jerome Powell's rhetoric and inflation numbers, everyone is sitting on the edge of their seats, seeing if there is going to be any surprise.Absolutely. It has been incredible after the last six weeks or so. Metal has been whipsawing. It went to 1810, came back to 2000 and is currently at about 2010, I had a look at 2020., So it has got plenty of upside and the demand picture as far as precious metals and silver are concerned. Do not count that one out. Again central banks have been hoarding gold, buying like crazy and the retail sector is really on fire.Yes.That is right.It was oversold and the best days of crypto may be ahead of us.Oh yes, definitely, they are back at $28,000 and there will be that upside maybe later on this year. There is a lot of uncertainty. There are different payment systems that banks are looking at as far as centralised digital and, of course, decentralised are concerned. On the other side are countries asking for payment of commodities or goods other than the petrodollar. So, there is going to be a fractured mindset. It is going to be incredible how it plays out and as an observer looking in, volatility across crypto and currencies is going to be incredible.Yes, I think so. It is pretty hard not to. There are a lot of traders out there that are absolutely in love with it and that is a global phenomenon.Absolutely, From 18,000 to 28,000, it has been a monstrous move, up nearly 50%.We have forgotten that SVB only a month ago, shook the markets like anything. One month down, it is more or less forgotten., I do not think that that has been put to sleep yet.We are offering retail derivatives globally but as far as a personal side is concerned, there is just so much upside. I have been an advocate of India and I am not saying that because I am here but one has to look at the dynamics;an incredibly young population, growing population, appetite, entrepreneurship, innovation, some of the best professors in the world are Indians who have been trained at US business schools and the brains trust here is just immense.So, I am not doubting India's recovery or growth over this decade, let alone what will happen in the next few decades. The best years of economic growth are ahead of India and you have only got to look at the construction, the infrastructure and everything. It is just coming up the curve at a thousand miles an hour. It is boom time. It truly is. It is mind-blowing.I do not think it has run its course. The best days are ahead of it and how it trades over the next 18 months is going to be electric. I would not be surprised to see big whipsaws and I would not be surprised to see it considerably up from here. I do not know what that number is going to be. The overall momentum, central banks buying, geopolitical concerns – there are a lot of pluses playing into gold's picture and its basket.Well, in some ways something like the Nasdaq at 16,000, then back to 10,000, now at 12,000. There is a lot of fear across the main street as far as the earning season is concerned. I am pretty sure that equities probably will have another leg up but I just want to take my point in time to look at where the US trades in the next few months.Inflation worries me and the world is concerned how it is going to play as far as equity market growth is concerned. We have got strong interest rates and that flight to safety from the money market versus equity perspective. So, yes, I am sitting here being patient. You also have to be patient at the moment."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3RlY2hwb2ludC5hZnJpY2EvMjAyMy8wNC8xMC9iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLXByaWNlcy10cmFkZS1mbGF0LWNvbGxhdGVyYWwtbmV0d29yay1jb2x0LWZvcmVjYXN0ZWQtZm9yLTM1MDAtcHJlc2FsZS1yZXR1cm5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) and Ethereum (ETH) prices trade flat, Collateral Network (COLT) forecasted for 3500% presale returns - Techpoint Africa",
        "content": "Investors who understand the workings of market cycles within crypto will be more profitable than those who do not. Bitcoin (BTC) and Ethereum (ETH) prices have been trading flat after recent rallies, which means only one thing, altcoin season has begun. New projects have huge potential to rip, and one, Collateral Network (COLT), has already been forecast to gain 3,500% in its presale.\n\n>>BUY COLT TOKENS NOW<<\n\n\n\nBitcoin (BTC)\n\n\n\nBitcoin (BTC) has thrived in the past months as the failings of fractional reserve banking have been highlighted to the world. With decreasing confidence in the dollar, more and more people have begun to look to Bitcoin (BTC). This application-specific hard money may unseat gold as the world’s reserve currency in the coming decade.\n\n\n\nBitcoin (BTC) began in 2009 following the global financial crisis, and the same landscape which birthed Bitcoin (BTC) is helping it gain traction currently. Bitcoin (BTC), after surging upwards, has stalled as money floods into altcoins such as Collateral Network (COLT), and investors would be wise to rotate. Price predictions from analysts vary enormously, with some predicting that Bitcoin (BTC) will trade as high as $180,000 in 2025, whereas more conservative estimates put Bitcoin (BTC) trading between $77,000 and $92,000 in 2025.\n\n\n\n\n\n\n\nEthereum (ETH)\n\nWith the Shanghai upgrade for Ethereum (ETH) scheduled on the 12th of April, many investors have grown increasingly cautious about holding Ethereum (ETH). The Shanghai upgrade will enable Ethereum (ETH) staking withdrawals, and analysts predict that Ethereum (ETH) withdrawals will unleash heavy sell pressure.\n\n\n\nHowever, more bullish analysts and capital fund managers such as Chris Burnisky predict that Ethereum (ETH) withdrawals going live with lead to a greater influx of staked Ethereum (ETH). Regardless of the upgrade, traders should be cautious and, instead of holding Ethereum (ETH), should take advantage of altcoin season and projects like Collateral Network (COLT), which continue to rip to the upside.\n\n>>BUY COLT TOKENS NOW<<\n\n\n\nCollateral Network (COLT)\n\n\n\nCollateral Network (COLT) has generated a buzz not seen in the crypto landscape for a long time. This challenger lender unlocks liquidity for real-world assets. The growth and integration of real-world assets into DeFi have been an expected growth driver amongst venture-capital firms for several months. Collateral Network (COLT) makes this possible through its use of 100% asset-backed NFTs.\n\n\n\nAsset owners can collateralize their assets with Collateral Network (COLT), anything from real estate and vintage cars to fine art and luxury watches. Collateral Network (COLT) mints an NFT 100% backed by the asset, which then becomes liquid. The holder can access the crowdsourced liquidity through fractionalizing the NFT.\n\n\n\nThe COLT token powers this entire ecosystem and grants discounts to borrowers and lenders, and also enables access to the auction where distressed assets will be sold off. On top of this, it can be staked for passive income, making it a DeFi token with excellent utility cases.\n\n\n\nCollateral Network (COLT) aggressively expands liquidity flows and lending potential within DeFi. For this reason, analysts have already forecast a 3,500% growth in its presale. Still, many expect it will rally much harder when it launches on centralized exchanges, and early holders could see a 100X on their initial investment.\n\n\n\n\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bXMtcmVjb2duaXRpb24tYXMtYS1jb21tb2RpdHktYm9vc3RzLWJ1bGxpc2gtbWFya2V0LWFsb25nc2lkZS1iaXRjb2luLWRvZ2V0dGktbWVtZS1jb2lucy1wcmVzYWxlLWV4cGVyaWVuY2VzLXN1cmdpbmctZGVtYW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Recognition as a Commodity Boosts Bullish Market Alongside Bitcoin, Dogetti Meme Coin's Presale ... - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9zaWdudXB0b2tlbi1jb20tYWNoaWV2ZXMtMzAwMC1zdWJzY3JpYmVycy1iaXRjb2luLWJ1bGxzLWZlZWwtcmVsaWV2ZWQtYXMtcHJpY2Utc3RhYmlsaXplcy1hdC0yODAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Signuptoken.Com Achieves 3,000 Subscribers; Bitcoin Bulls Feel Relieved As Price Stabilizes At $28,000 - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RoZS1zYWZlc3QtY3J5cHRvY3VycmVuY2llcy10by1pbnZlc3QtaW4tMjAyMy1iaXRjb2luLWNoYWlubGluay1hbmQtc2lnbnVwdG9rZW4tY29tL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "The Safest Cryptocurrencies to Invest in 2023: Bitcoin, Chainlink, and Signuptoken.com - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi13aGl0ZS1wYXBlci1pcy1ub3ctYXZhaWxhYmxlLWluLTQzLWRpZmZlcmVudC1sYW5ndWFnZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin white paper is now available in 43 different languages - Finbold - Finance in Bold",
        "content": "The Bitcoin white paper, authored by the anonymous Satoshi Nakamoto, continues to be disseminated in multiple languages by community members who strive to make the document’s content accessible to a wider audience.\n\nTo date, the whitepaper has been translated into 43 languages, including including Chinese, Spanish, Italian, Russian, French, German, Bahasa Indonesian, Basque and Swedish, among others, according to information gathered from bitcoin.org on April 10.\n\nAdditionally, to cater to people with visual impairments, the whitepaper is also available in braille. These efforts have significantly contributed to making the document’s contents more accessible and understandable to a broader audience worldwide.\n\nThe translation of the Bitcoin whitepaper plays a significant role in breaking down the entry barriers to Bitcoin and enabling millions of people worldwide to understand its technology better. By eliminating the language barrier, people can engage with the subject and gain a deeper understanding of how Bitcoin works.\n\nFortunately, anyone interested in translating the whitepaper can do so by submitting a request through the bitcoin.org Github page. This open approach allows anyone, anywhere in the world, to contribute to the dissemination of knowledge about Bitcoin and help make it more accessible to people of diverse cultures and languages.\n\nBitcoin white paper found on Apple MacBooks\n\nLast week, it was revealed that the Bitcoin white paper was found buried deep inside Apple’s (NASDAQ: AAPL) system files on computers running macOS Catalina or later.\n\nThe document, which has the filename “simpledoc.pdf,” purports to present Satoshi Nakamoto ideas for a decentralized form of currency that is based on a public ledger on all nine of its pages.\n\nInterestingly, the self-proclaimed Satoshi Dr. Craig Wright accused the tech giant of breaching copyright laws by putting the Bitcoin white paper on MacBooks. Wright is well-known for his contentious approach to asserting intellectual property rights over Bitcoin and its underlying technology."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZmluYm9sZC5jb20vbWljcm9zdHJhdGVneXMtYml0Y29pbi10YWN0aWMtaXMtY29taWNhbGx5LXN0dXBpZC1zYXlzLW5vcnRoLXJvY2stZGlnaXRhbC1mb3VuZGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "MicroStrategy's Bitcoin tactic is 'comically stupid,' says North Rock Digital founder - Finbold - Finance in Bold",
        "content": "Enterprise business intelligence (BI) software vendor MicroStrategy has so far purchased over 140,000 Bitcoin (BTC), largely due to the enthusiasm of its executive chairman and former CEO, Michael Saylor. However, not everyone thinks this is necessarily a good thing for the company.\n\nAs it happens, Hal Press, the founder and CEO of the cryptocurrency-focused investment fund North Rock Digital, has voiced concern over MicroStrategy’s large purchases of Bitcoin, stating it was “comically stupid” to leverage a software company to this end in a series of tweets posted on April 8.\n\nCommenting on an April 5 tweet by Bitcoin Magazine, in which the crypto news outlet had highlighted that “MicroStrategy now owns one out of 150 Bitcoin that will ever exist,” considering that the maximum supply of Bitcoin is 21 million, Press had this to say:\n\n“It’s not gonna happen anytime soon (multiple years minimum IMO), but eventually, every single one of Saylor’s coins will need to be sold. When the time eventually comes, it will be a career-making short.”\n\n‘Comically stupid’ strategy\n\nIn the following tweet, he ridiculed Saylor’s strategy, arguing that “the idea of taking a software company and levering it to the gills to run a ‘Bitcoin acquisition strategy’ is so comically stupid it’s actually quite funny” and that it would “be so obvious in hindsight.”\n\nThat said, Press insisted that his view “genuinely isn’t a comment about Bitcoin,” but that “hijacking a public company and levering it to acquire any asset in a way that adds nothing to its core business just doesn’t make any sense.” As he added, “If he did it to buy ETH, it would be just as silly IMO,” but admitting that it doesn’t mean “he won’t be profitable either, there is a chance he will be.”\n\nIndeed, it is no secret that Saylor is a vocal Bitcoin enthusiast, having hailed the flagship decentralized finance (DeFi) asset as an “economic engine based on a truth machine poised to emerge as a freedom machine,” which is why he led MicroStrategy to adopt the Bitcoin strategy back in August 2020, as Finbold reported in October 2022.\n\nMeanwhile, Bitcoin was at press time trading at the price of $28,373, up 1.59% on the day, as well as gaining 0.48% across the previous week and as much as 40.49% on its monthly chart. This means that the current value of MicroStrategy’s Bitcoin bid stands at close to a staggering $4 billion ($3,972,220,000)."
    }
]