[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmFsbGVnaGVueWZyb250Lm9yZy92aW9sYXRpb24tYXQtYS1wZW5uc3lsdmFuaWEtZHJpbGxpbmctc2l0ZS1yYWlzZXMtcXVlc3Rpb25zLWFib3V0LWxhY2stb2YtYml0Y29pbi1yZWd1bGF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Violation at a Pennsylvania drilling site raises questions about lack of Bitcoin regulation - alleghenyfront.org",
        "content": "This story comes from our partners at WPSU\n\nA gas and oil company mining for cryptocurrency in Elk County, Pennsylvania, was found to be in violation of state regulations when it installed equipment before getting approval from the state Department of Environmental Protection, but the company says it is following the rules.\n\nA March 1 DEP inspection at Diversified Gas and Oil’s Jay Township site found the company had put in place tools for cryptocurrency operations. The company does have a General Permit. But, according to the DEP, Diversified did not have a permit to install the air pollution sources used to generate power for crypto mining. That specific permit is currently under review.\n\nA DEP spokesman said the violation might result in an enforcement action.\n\nThe inspection report notes equipment that was at the Longhorn C pad site, including four natural gas microturbines to make electricity along with two trailers with equipment for cryptocurrency. An engine, generator and oil tank were also there, but were not in operation. The DEP spokesman said the department could not confirm if the cryptocurrency equipment was installed and operating before March 1.\n\nDiversified, headquartered in Alabama, is reportedly the biggest oil and gas well owner in the country. A statement from a company spokesman said Diversified is complying with state rules.\n\n“We believe operations at the Longhorn C pad are permitted and also operating through exemptions with the Department of Environmental Protection, and that we are in compliance with the requirements,” the statement says.\n\nRead More\n\nEnvironmental groups oppose plan\n\nCrypto mining has been growing in Pennsylvania, raising questions about oversight.\n\nJay Township supervisors had written to DEP earlier this year, saying they were getting complaints about the noise coming from the site. Residents near other crypto mining sites in Pennsylvania have made similar complaints. When reached for comment, a supervisor said the company had addressed the township’s concerns and the site was quieter now.\n\nThree environmental organizations, PennFuture, Clean Air Council and Earthjustice, submitted comments asking the DEP to deny or withdraw approval of Diversified’s plan. Their letter points to the company’s previous violations in Pennsylvania — operating without valid authorization at 19 locations — that are listed in a DEP filing.\n\nRob Altenburg, director of the PennFuture Energy Center, said the bitcoin mining industry is not highly regulated.\n\n“If we’re seeing a whole lot of violations at a company, it certainly does raise questions: Are they prioritizing public health and environmental protection in their operations,” Altenburg said.\n\nBitcoin, a type of cryptocurrency, currently has a price of about $30,000. Bitcoin mining uses computer systems to solve complex problems, in an effort to do it more quickly than other miners and get rewarded with a coin. But, those supercomputers use a lot of energy.\n\n“Across the whole Bitcoin network, it uses about as much energy as the state of New York — more than many entire countries,” Altenburg said.\n\nAltenburg said he and others are trying to raise awareness at the state and federal levels.\n\n“There’s this problem here, and it’s bad now,” he said. “There’s pollution happening now, but it has the potential to get worse.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzIyL2hlcmUtYXJlLXNpeC1uZXctcHJvamVjdHMtbG9va2luZy10by1taXRpZ2F0ZS1iaXRjb2luLW1pbmluZ3MtZW5lcmd5LWZvb3RwcmludC_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMjIvaGVyZS1hcmUtc2l4LW5ldy1wcm9qZWN0cy1sb29raW5nLXRvLW1pdGlnYXRlLWJpdGNvaW4tbWluaW5ncy1lbmVyZ3ktZm9vdHByaW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Here Are Six New Projects Looking to Mitigate Bitcoin Mining’s Energy Footprint - CoinDesk",
        "content": "Here Are Six New Projects Looking to Mitigate Bitcoin Mining’s Energy Footprint\n\nFrom technical improvement efficiencies to novel market-based solutions, a plethora of projects are trying to improve the bitcoin mining’s environmental footprint.\n\nBy Eliza Gkritsi Apr 22, 2023 at 2:51 p.m. UTC"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZmxvYXQtYWJvdmUtdXMyNzUwMC13ZWVrbHktbWFya2V0L9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZmxvYXQtYWJvdmUtdXMyNzUwMC13ZWVrbHktbWFya2V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Can Bitcoin float above US$27,500 after sinking below US$30,000? - Forkast News",
        "content": "Bitcoin fell 8.48% in the week from April 14 to 21 to trade at US$28,114 at 7:30 p.m. on Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading below US$30,000 since Wednesday. Ether rose 8.66% over the week to US$1,923.\n\nBitcoin fell below US$29,000 on Thursday for the first time since April 10, leading to the liquidation of over US$266 million worth of long positions in a 24-hour period, according to futures data provider Coinglass.\n\n“The drop below US$30,000 may have been [caused] by built-up leverage, which resulted in liquidations, but it’s unlikely to last,” John Isige, an analyst at crypto trading platform Vauld told Forkast in a LinkedIn message. “Investors can look toward US$27,500 ahead of a larger bounce back above the now pivotal US$30,000.”\n\nThe global crypto market capitalization stood at US$1.19 trillion on Friday at 7:30 p.m. in Hong Kong, down 7% from US$1.28 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$544 billion market cap accounted for 45.73% of the market, while Ether’s US$231 billion accounted for 19.4%.\n\nU.S. Securities and Exchange Commission Chair Gary Gensler addressed the House Financial Services Committee during a congressional oversight hearing on Tuesday, where he repeatedly evaded the opportunity to clarify whether Ether, the native cryptocurrency of the Ethereum blockchain, should be labeled as a security.\n\nThe European Parliament voted in favor of the Markets in Crypto Assets (MiCA) on Thursday, a framework to standardize regulations for crypto assets across the world’s third-largest economy. It is now pending approval from the European Council.\n\nSee related article: Bitcoin, other cryptos fall as investors book profit\n\nBiggest gainers: OKX & CSPR\n\nThe OKX crypto exchange’s utility token (OKB) was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap, rising 10.92% to US$52.82. The token started picking up on Monday, after OKX announced that it would add layer-1 blockchain Sui’s token (SUI) to their jumpstart program. This will allow investors to trade OKB for SUI at a discount.\n\nProof-of-stake blockchain Casper Network’s CSPR coin was this week’s second biggest gainer, with an 8.06% price increase to trade at US$0.04919. The coin started its rally last Saturday, days after announcing the launch of the Casper Wallet on April 11.\n\nNext week: Bitcoin’s US$27,500 resistance\n\nAccording to a March 31 court filing, the U.S. government seized 51,351.89 Bitcoin (worth US$1.4 billion) from Ross Ulbricht, the creator of the darknet marketplace Silk Road. The government sold 9,861 Bitcoin (US$279 million) on March 14 and is planning to sell the remaining 41,490 Bitcoin (US$1.1 billion) in four batches this year.\n\nBitcoin values will decline further in the short term as “the U.S. plans to sell its remaining 41,490 Bitcoin, which I’m expecting to happen soon,” said Kasper Vandeloock, chief executive officer of quantitative trading firm Musca Capital. “Bitcoin is up 70%+ year to date. It’s only expected that investors are taking profits or derisk,” he added.\n\nVauld analyst Isige said that US$27,500 will be a key price level next week.\n\n“Bitcoin needs a weekly close above US$27,500 or the 50-day EMA on the daily timeframe to weaken its downside potential and confirm an upward trend. Primary support traders will be looking at US$24,000, although US$27,500 is a price level we must watch keenly. Its upside is primarily capped by the seller congestion at US$30,000,” wrote Isige.\n\nMeanwhile, concerns over interest rate hikes in the world’s largest economy have reignited as Atlanta Federal Reserve President Raphael Bostic and St. Louis Fed President James Bullard said it is too early to consider pausing interest rate hikes. The U.S. inflation rate dropped to 5% in March, above the Fed’s target of 2%.\n\n“Considering they called inflation ‘transitory,’ it is reasonable to assume we will get a potentially long and hard recession that affects risk assets, such as Bitcoin. The stock market additionally seems to be setting up for a difficult second half of 2023, which would likely drag Bitcoin and crypto, as well. [As low as] US$9,000 remains in play,” wrote Santos.\n\n“The price will need to hold above US$30,500 for 5-7 weekdays to confirm the low. Until then, moves to the upside are nothing more than bear market rallies,” he added.\n\nSee related article: Crypto firms hardpressed to find U.S. bank partners as industry blames ‘Operation Choke Point 2.0’"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTIxL2JpdGNvaW4tYnRjLXN0dW1ibGVzLXRoaXMtd2Vlay1hZnRlci0zMC0wMDAtdGhyZXNob2xkLWZhaWxzLXRvLWhvbGTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Stumbles This Week After $30000 Threshold Fails to Hold - Bloomberg",
        "content": "Bitcoin is ending the week on a down note after failing to sustain momentum once it pushed past $30,000 for the first time since June.\n\nThe largest cryptocurrency by market value has dropped about 10% since last Sunday to around $27,300, rounding out its first weekly loss in four. Bitcoin had climbed as high as $31,013 on March 14, and has surged around 65% this year, helping to soften the blow from a similar-sized decline in 2022."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIyL2JpdGNvaW4tdnMtZ29sZC13aGljaC1vbmUtaXMtYS1iZXR0ZXItaW52ZXN0bWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin vs. Gold: Which One Is a Better Investment? - The Motley Fool",
        "content": "Over the past decade, Bitcoin (BTC -0.22%) has catapulted into the spotlight as the premier cryptocurrency. Along the way, multiple narratives have arisen to justify an investment in Bitcoin. One of those is that it is like \"digital gold\" because, like gold, it can act as a store of value and a hedge against inflation.\n\nSo if Bitcoin is basically digital gold, which is the better investment?\n\nThe tale of the tape\n\nTo start, let's talk about the concept of a store of value. A store of value is an asset that preserves wealth and acts as a counter to economic declines and inflation, with the expectation that it will also appreciate over time. Gold has long been considered to meet this criterion.\n\nWhen we compare the price of both since Bitcoin was created in 2009, it becomes clear that while gold does a fair job at preserving wealth, it comes nowhere near the combination Bitcoin provides of preserving and growing wealth.\n\nWhat the numbers say\n\nSince 2009, the inflation-adjusted return of gold annually has been about 3.3%, and the total return has been about 57%. In the same period, Bitcoin has an inflation-adjusted annualized return of nearly 145% and a total return of 33,983,965%.\n\nNow, clearly there is a flaw in this comparison because gold has been in existence for millennia and Bitcoin has only been around for 14 years. So let's take it back further.\n\nSince 1980, gold's performance has proven lackluster, generating an annualized return of 3.1% before inflation. After we account for 40 years of inflation, gold produced an unappetizing annualized return of -0.24% and a total return of -10.1%.\n\nFrom this angle, it becomes clear that not only does Bitcoin outpace gold in terms of preserving wealth as a store of value and as a hedge against inflation, it also does an excellent job of growing wealth.\n\nWhy Bitcoin?\n\nBut to truly understand how Bitcoin has risen to this level, it helps to understand how it improves upon some of the primary characteristics that originally made gold attractive to investors.\n\nBitcoin and gold both exist in finite amounts. But Bitcoin takes this a step further. While gold is finite in the sense that it is a physical resource that needs to be mined, its supply is not fixed and can fluctuate based on mining activity and new discoveries. However, Bitcoin's supply is fixed at 21 million coins, and new coins will gradually enter circulation at a diminishing rate until the year 2140, when the last Bitcoin will be mined.\n\nAnother advantage of Bitcoin over gold is its portability and ease of transfer. Bitcoin can be sent anywhere in the world in a matter of minutes, without the need for intermediaries such as banks or payment processors. All one needs is an internet connection.\n\nIn addition, Bitcoin has a high degree of divisibility, with each coin divisible into 100 million satoshis. This makes it easier to use Bitcoin as a medium of exchange for small transactions, something that isn't as feasible with gold. While Bitcoin as form of currency hasn't quite materialized like some might hope, there is progress being made thanks to growing adoption of payment solutions like the Lightning Network.\n\nFinally, it is worth mentioning the technological advancements that Bitcoin represents. Bitcoin is built on blockchain technology, a decentralized digital ledger that is immutable and transparent. This means that every transaction that takes place on the Bitcoin network is verified and recorded on the blockchain, making it virtually impossible for anyone to alter or manipulate the data. This level of transparency and security is unprecedented in the world of finance and represents a significant leap forward.\n\nConsider these additional characteristics and the simple fact that Bitcoin has recently dominated gold in terms of its performances as a store of value and inflation hedge, and it becomes clear that an investment in Bitcoin today could prove valuable. In a world that is becoming increasingly digital and as the need for alternatives to inflation-prone fiat currencies persists, Bitcoin is in a unique position to benefit for decades to come as increased demand runs up against its finite supply."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtZ2FtZS10aGVvcnktb2YtYml0Y29pbi1hbmQtY3J5cHRvY3VycmVuY2llc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "The game theory of Bitcoin and cryptocurrencies - Cointelegraph",
        "content": "The unique characteristics of cryptocurrencies make them an interesting subject for game theory analysis, as they can help explain the incentives and behaviors involved in trading and investing. This article discusses the concept of the prisoner’s dilemma, mining cryptocurrencies and blockchain forks that are relevant to the game theory of Bitcoin and cryptocurrencies.\n\nIntroduction to game theory and cryptocurrencies\n\nGame theory is a mathematical framework that helps explain decision-making in strategic situations. Cryptocurrencies, like Bitcoin (BTC), have become a popular subject for game theorists due to their decentralized nature and potential to disrupt traditional financial systems.\n\nThe prisoner’s dilemma and cryptocurrency mining\n\nIn the classic game theory scenario known as the prisoner’s dilemma, two parties must make a choice without knowing what the other will do. In the context of cryptocurrency mining, the prisoner’s dilemma can help explain why miners may act in their own self-interest, even if it is not in the best interest of the network as a whole.\n\nThe first miner to successfully solve a challenging mathematical equation receives fresh BTC units. Both computer power and energy usage are essential requirements for the mining operation. The tragedy of the commons, which happens when individuals prioritize their own interests over the needs of the whole, is one of the biggest obstacles in cryptocurrency mining. By mining cryptocurrencies, miners may put their individual financial gain ahead of the network’s overall security and stability.\n\nA helpful foundation for comprehending this behavior is provided by the prisoner’s dilemma. In the scenario, two people are arrested for a crime, and they are offered the option to work together or turn on one another. If they both cooperate, their sentences are both lowered. When one betrays the other, the betrayer is given a lighter punishment, while the other is given a lengthier one. Both receive a moderate penalty if they betray one another.\n\nRelated: How does blockchain solve the Byzantine generals problem?\n\nMiners confront a similar decision-making process while mining cryptocurrencies. The network is safe and secure if all miners collaborate by mining honestly and making a contribution. Yet one miner may benefit more from mining maliciously or not contributing to the network if they choose to behave in their own self-interest.\n\nLet's look at the below diagram illustrating an example of two miners in a cryptocurrency pool to understand how the prisoner's dilemma can be applied to the context of cryptocurrency mining.\n\nIn the above diagram, Miner A and Miner B are two miners in a cryptocurrency mining pool. They have the choice to cooperate (continue mining together) or defect (leave the pool and mine independently). The rewards and payoffs are based on the classic prisoner's dilemma scenario:\n\nIf both miners cooperate, they both receive a reward (e.g. a share of the mining profits).\n\nIf Miner A defects while Miner B cooperates, Miner A receives a temptation payoff (e.g. a larger share of the mining profits), while Miner B receives a suckers payoff (e.g. a smaller share of the mining profits).\n\nIf Miner A cooperates while Miner B defects, Miner A receives a suckers payoff, while Miner B receives a temptation payoff.\n\nIf both miners defect, they both receive a punishment (e.g. lower overall mining profits).\n\nThis diagram illustrates how the prisoner's dilemma can be applied to the context of cryptocurrency mining. It shows the potential rewards and payoffs for each combination of cooperation and defection, and can help miners make decisions about whether to stay in a pool or mine independently.\n\nThe defector will receive a larger share of the profits because they are not sharing their earnings with the other miner. On the other hand, the cooperator who remained in the pool will receive a smaller share of the rewards because they are now contributing more computing power but still receiving the same share of the rewards as before.\n\nTo address this challenge, cryptocurrency networks can implement various incentives and mechanisms to encourage miners to act in the interest of the network as a whole. For example, networks can reward miners who contribute to the network with lower fees or increased mining rewards. Additionally, networks can implement penalties or defensive mechanisms to discourage malicious behavior.\n\nThe game theory of blockchain forks\n\nBlockchain forks are another scenario where game theory can help explain the decision-making process of participants. A fork occurs when a blockchain network splits into two separate paths, often due to disagreements among participants about the direction of the network.\n\nA fork can be thought of as a coordination game from the perspective of game theory. Two or more players must work together to attain a common objective in a coordination game. Participants in a blockchain fork must work together to decide which fork to promote and which to reject.\n\nThe Bitcoin network split into two distinct forks in 2017: Bitcoin and Bitcoin Cash. This is one of the most well-known instances of a blockchain fork. Disagreements within the Bitcoin community on how to expand the network to handle an increasing volume of transactions led to the creation of this fork.\n\nIn this case, members of the Bitcoin community had to choose between sticking with the old Bitcoin network and switching to the new Bitcoin Cash network. The choice was not easy because each fork has pros and cons of its own. For instance, while Bitcoin Cash offered quicker transaction times and lower fees, Bitcoin had a larger network and higher acceptance.\n\nParticipants in this scenario had to take into account their personal preferences and opinions regarding the potential future worth of each network in the context of game theory. Participants would be motivated to promote Bitcoin Cash even if it meant leaving the original Bitcoin network if they thought it had a stronger chance of long-term growth.\n\nRelated: How to buy Bitcoin Cash: A beginner’s guide for buying BCH\n\nLet's look at the below diagram, illustrating two miners facing the choice of whether to adopt a new fork in the blockchain or continue on the old fork to understand how game theory can be applied to the context of blockchain forks.\n\nThe above diagram depicts the strategic decision-making of two miners, Miner A and Miner B, on a blockchain, as they face the choice of either adopting a new fork or continuing on the old fork. The rewards and penalties are based on the following assumptions:\n\nIf both miners adopt the new fork, they both receive a reward (e.g. increased mining efficiency).\n\nIf Miner A adopts the new fork while Miner B continues on the old fork, Miner A receives a penalty (e.g. decreased mining efficiency), while Miner B receives a reward.\n\nIf Miner A continues on the old fork while Miner B adopts the new fork, Miner A receives a reward, while Miner B receives a penalty.\n\nIf both miners continue on the old fork, they both receive a temptation payoff (e.g. maintaining control over the blockchain).\n\nThis diagram illustrates how game theory can be applied to the context of blockchain forks. It shows the potential rewards and penalties for each combination of adopting or not adopting a new fork, and can help miners make decisions about whether to switch to a new fork or stick with the current one.\n\nTo address this challenge, cryptocurrency networks can implement various mechanisms to ensure that forks occur as smoothly as possible. For example, networks can implement replay protection, which prevents transactions on one network from being replayed on the other."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JhYnlsb24tYml0Y29pbi1zZWN1cml0eS1kYXBwc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Security for Proof of Stake? Why Not, Says Babylon - Blockworks",
        "content": "Babylon, a crypto security blockchain using Bitcoin’s proof-of-work security to integrate with proof-of-stake chains, plans to expand beyond the Cosmos.\n\nDesigned by David Tse and his team at Stanford’s Blockchain Consensus Protocol Lab, Babylon was created using the Cosmos Software Development Kit (SDK). It communicates with Bitcoin through a Bitcoin timestamping protocol.\n\nThis means that it interacts with the Bitcoin chain by sending events on Babylon onto the Bitcoin chain, Tse told Blockworks in an interview.\n\nIn Satoshi Nakamoto’s original Bitcoin white paper, the author noted how they wanted to build Bitcoin to become a timestamping server, Tse said.\n\n“In his case, he was interested in timestamping Bitcoin transactions,” Tse said. “It turns out that you can also put arbitrary data onto the Bitcoin chain, so this allows you to timestamp not only Bitcoin transactions but also events happening outside of the Bitcoin chain.”\n\nUsing this knowledge, Babylon is able to timestamp events occurring on different proof-of-stake chains.\n\nRead more: The Beginner’s Guide to Consensus Mechanisms\n\nWait, so how does it make the blockchain more secure?\n\nExisting proof-of-stake chains such as Osmosis already have a handful of validators signing off on transactions.\n\nWhat Babylon does through Bitcoin timestamps is bring in a second-level committee to certify the transaction.\n\n“For smaller transactions of $1,000 or a few hundred, the proof-of-stake committee is enough — they’re fast to validate and approve transactions, but if you have a transaction that has very high value or transactions that actually affect the security of the proof-of-stake chain, that will deserve an extra level of protection from Bitcoin,” Tse said.\n\nAn example Tse notes would be unbinding transactions, where the transaction itself will affect the security of the validators. “Bitcoin is slower, but it has a much higher level of security,” he said\n\nBabylon is currently integrated with 16 different app chains on their testnets that have a value of $1.4 billion. These 16 different app chains are secured using Bitcoin’s $600 billion.\n\nBeyond the Cosmos\n\nBabylon currently exists as a testnet and plans to launch its mainnet in Q3 or A4, Tse said.\n\nThe Cosmos ecosystem has been its focus for a handful of reasons — notably its powerful interoperability capabilities through its inter-blockchain communication protocol (IBC) which enables automatic time stamping from all these chains to Babylon, but also due to its diverse app chain ecosystem.\n\n“This gives us very broad exposure to different kinds of applications…We learn quite a bit working with them and understanding how they want to use Bitcoin security,” Tse said.\n\nAlthough this is the case, Babylon is also looking at ways it can expand beyond the Cosmos. This is currently being explored in two different directions, one of which is implementing smart contracts on Babylon that create timestamping.\n\n“This allows us to go outside the Cosmos ecosystem…it doesn’t even have to be chains, it could be specific applications that are running on Ethereum that want additional security,” Tse said. “Bitcoin is very powerful, very secure, but it has a very big limitation…which is it doesn’t have smart contracts, so Babylon deals with the difficult work of interacting with the not-so-smart chain Bitcoin and enables it to interact with the rest of the world.”\n\nThe second direction, Tse notes, is to integrate with interoperable chains — such as Axelar.\n\n“Axelar is interoperable with many chains outside the Cosmos, then we can get timestamps for all these chains Axelar is integrated with as well,” he said.\n\nUsing Bitcoin security to build dapp projects\n\nInstead of competing directly with Ethereum, Tse believes it is possible to bring existing proof-of-stake chains to an even more secure Bitcoin through interoperability.\n\n“Ethereum has been very successful in building an ecosystem that incorporates brilliant new technology,” Tse said. “So what we’re saying here is that Bitcoin is an arguably even more secure chain and it has a 14-year history.”\n\nBabylon is not the only project that Tse and his team are working on.\n\nUsing ordinal technology, Tse and his team are currently looking into ways to use Bitcoin block space to eliminate censorship of transactions on proof-of-stake chains.\n\n“You could put these transactions onto the Bitcoin block space and because Bitcoin has [a] very strong censorship resistance property, that would allow that transaction to survive the censorship… that is another type of protocol that is on our roadmap,” Tse said.\n\nRead more: Proof-of-Work vs. Proof-of-Stake: Which Is Better?\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXdoYWxlLW1vdmVzLW5lYXJseS04bS0xODEzMTk1NjkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Whale Moves Nearly $8M After 10 Years of Inactivity - Yahoo Finance",
        "content": "Another sleeping Bitcoin whale just woke up.\n\nToday, a holder who hadn’t touched their cryptocurrency for a decade moved over 279 BTC—or $7.8 million worth—to three new wallets, according to a tweet from on-chain sleuth, Lookonchain.\n\nThe blockchain tracker said in a Friday tweet that the whale in question had originally received 1,128 BTC in the months of October 2012 and May 2013, when prices were about $12 and $195, respectively. In total, the whale holds $31.6 million in BTC.\n\nA whale with 1,128 $BTC($31.6M) that has been dormant for 10 years transferred 279 $BTC($7.8M) to 3 new addresses just now. The whale received 1,128 $BTC in October 2012 and May 2013, when prices were $12 and $195.https://t.co/2MxnVzcEMl pic.twitter.com/2GM7Oq4e2P — Lookonchain (@lookonchain) April 21, 2023\n\nAncient, untouched Bitcoin stashes have been on the move lately. “Whales”—those who have hoarded huge amounts of cryptocurrency—sometimes reemerge after a long stretch of time to move their investment to other addresses.\n\nIn February, an old BTC address that had not budged in 11 years came back to life to move $9.6 million worth of the cryptocurrency—which had appreciated by 120,000,000% over the years.\n\nBitcoin whales are the most successful crypto investors, according to research from the Bank for International Settlements. In February, it said that those who sit on the asset for years tend to do well, while the retail investor who buys and sells in a short time frame typically loses out.\n\nStory continues\n\nBlockchain firm Arkham Intelligence told Decrypt in February that data shows that Bitcoin investors are again focusing on long-term gains, as over 53% of coins ever minted hadn’t budged for more than two years by that point.\n\nNumber of Bitcoin Whales Drops to Lowest Level Since 2019\n\nAt the time of writing, Bitcoin is trading for about $27,900, according to CoinGecko, still way below—by nearly 60%—the $69,045 all-time high it hit in November 2021. It is also down over 8% in the past week.\n\nBut the largest digital asset by market cap is still up massively this year, having gone from under $17,000 in January to $30,000 last week."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzIxL2V0aGVyLWVyYXNlcy1hbGwtZ2FpbnMtZnJvbS1zaGFuZ2hhaS1yYWxseS1hcy1iaXRjb2luLWNyeXB0by1wcmljZXMtZmFsbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ether Erases All Gains From Shanghai Rally as Bitcoin, Other Crypto Prices Also Fall - CoinDesk",
        "content": "The April 12 hard fork, the last major step in the transformation of the Ethereum blockchain from a proof-of-work to more energy-efficient proof-of-stake protocol, enabled withdrawals of some $35 billion worth of tokens locked in staking contracts. ETH began spiking a day after the event and surged to its highest level in 11 months. It had been lingering below $2,000 for most of the past year."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluaW5nLWhlYXQtaXMtZW5lcmd5LWdvbGQv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1taW5pbmctaGVhdC1pcy1lbmVyZ3ktZ29sZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin mining heat is energy gold. Let's make use of it - Forkast News",
        "content": "Despite concerns over Bitcoin mining’s energy consumption, Bitcoin mining has the potential to be a net positive for humanity’s relationship with energy and sustainability. This can be achieved by the mining industry using intermittent, stranded and waste power sources and subsidizing sustainable energy. A less-explored opportunity is to collect and redirect the excess heat generated by Bitcoin mining for other heating needs. This Earth Day, let us consider how Bitcoin mining can not only help our planet and improve humanity’s relationship with energy by serving as a buyer of zero-carbon energy, but it can also serve as a producer of recyclable and reusable energy.\n\nBitcoin’s energy recycling potential\n\nMany of Bitcoin’s critics are understandably worried about Bitcoin’s rising energy consumption. The Cambridge Bitcoin Electricity Consumption Index indicates that Bitcoin’s electricity consumption has only ever gone up since the digital asset’s inception. Similarly, Bitcoin’s greenhouse gas emissions — although there have been ups and downs — have also grown over time.\n\nBut Bitcoin’s energy consumption is not the whole story.\n\nBitcoin mining produces a lot of heat, and harnessing and redirecting that excess heat is not just a theoretical possibility. In fact, there are already plans for a Canadian city to be heated by Bitcoin miners. An energy provider, Lonsdale Energy Corporation, and MintGreen, a Bitcoin mining company, are partnering up to provide at least some of the heat demanded by the residents of North Vancouver.\n\nMintGreen will recycle about 20,000 tons of toxic gas per megawatt that would have otherwise entered the atmosphere and contributed to global warming. Instead, this liability of toxic emissions will be turned into an asset: Over 95% of the energy that the miners initially consume will be converted into thermal energy that will be used to heat several buildings. Since Bitcoin miners can run continuously, and because there will almost certainly always be a supply of Bitcoin miners available, the city will be able to rely on their excess heat during any month of any year.\n\nThis endeavor is not a pie-in-the-sky dream. MintGreen had already made deals with the Vancouver Island Sea Salt facility and Shelter Point Distillery to sell them heat during frigid Canadian winters.\n\nBitcoin mining’s versatility also allows its excess heat to be used for recreational ends. For example, it costs between US$2,000 and US$5,000 to heat a typical swimming pool. Bitcoin mining can turn this money sink and associated energy consumption into a zero-cost endeavor. All you have to do is connect your Bitcoin mining machine to your pool’s water pump. You simultaneously earn the hardest asset ever created and heat your pool at no additional charge.\n\nWhile heating a swimming pool is an amusing application, Bitcoin miners’ excess heat has more profound use cases for humanity. Companies are already collaborating with researchers to create greenhouses that are heated by Bitcoin mining.\n\nIn the Netherlands, the heat from Bitcoin mining is warming a greenhouse for tulips and cutting the flower farmers’ reliance on gas, which has become more expensive since Russia’s war on Ukraine. In Sweden, another mining company’s 600-kilowatt ASIC machines’ heat is directed toward warming a 300-square-meter greenhouse in which fruit and vegetables are grown. The miners are embedded in a data center container, which is fitted with an air duct apparatus that draws heat from the ASICs and sends it to the greenhouse. In theory, this would keep the greenhouse at 77 degrees Fahrenheit continuously. Considering that the temperature of the area drops to minus 22 degrees Fahrenheit in wintertime, the potential savings on heat costs and use are significant.\n\nJust as Bitcoin mining can make good use of intermittent, stranded and waste energy sources, recycling and reusing miners’ waste heat can potentially increase the profitability and sustainability of indoor farming and food production. As one researcher said, “A 1 [megawatt] data center would have the ability to strengthen the local self-sufficiency up to 8% with products that are competitive on the market.”\n\nSimmering tensions\n\nNot everyone is excited about Bitcoin miners’ heat, especially those who suffer from its unintended consequences. For example, residents near Seneca Lake in upstate New York have complained that a nearby power plant’s collaboration with over 8,000 miners has caused their lake to “feel like you’re in a hot tub.”\n\nThe power plant takes in 139 million gallons of water from the lake and gives back 135 million gallons every day. The water that is recycled back into the lake gets up to 108 degrees Fahrenheit in the summer. To be sure, solutions can in principle be found, but we must nevertheless admit that sometimes miners’ heat can affect a community’s environment in ways that people do not enjoy.\n\nSustainable energy sources still matter\n\nAside from Bitcoin mining helping subsidize renewable energy, our ability to harness and direct its excess heat is yet another way that Bitcoin can help combat climate change. Less than a decade ago, Imperial College London estimated that heating residential and commercial buildings accounted for almost half of all energy consumption and 40% of all energy-related carbon dioxide emissions. If all of this heat could be provided by carbon-neutral sources, it could be the most revolutionary impact on climate change in a generation.\n\nOn the face of it, replacing carbon-emitting heat sources with the excess heat of Bitcoin miners may not make enough of a difference. After all, if Bitcoin miners are themselves fueled by carbon-intensive fuel sources, then heating one’s home with miners’ excess heat does not necessarily reduce enough emissions for us to meet our climate goals.\n\nBut Bitcoin miners are unique in their ability to render viable renewable energy sources that would have not been profitable in the miners’ absence. Heating commercial and residential buildings with miners’ excess heat really could help put a dent in humanity’s carbon emissions — provided that the miners themselves are powered by, say, solar energy.\n\nWe have already seen that heating buildings and powering indoor farms with Bitcoin miners’ excess heat is not a pipe dream but a reality. It may not be a big leap to imagine what a difference it could make on our planet if Bitcoin miners could themselves be fueled entirely by carbon-neutral sources."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIyLzMtdG9wLWNyeXB0b3MtdGhhdC1jb3VsZC1zb2FyLWhpZ2hlci10aGFuLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "3 Top Cryptos That Could Soar Higher Than Bitcoin - The Motley Fool",
        "content": "In the crypto market, all eyes are on Bitcoin (BTC -0.07%), the world's largest cryptocurrency by market capitalization. At one point, Bitcoin was up more than 80% for the year, as it soared to a price of $30,000. However, Bitcoin has started to pull back in recent days and is now up only 3% over the past 30 days.\n\nAt the same time, a number of cryptos are keeping pace with Bitcoin's overall performance. For example, Ethereum (ETH -0.89%) is up more than 63% for the year and 10% over the past 30 days. And both Avalanche (AVAX 2.69%) and Cardano (ADA -1.75%) are up more than 64% for the year. Here's a closer look at why these three cryptos could be ready to soar higher than Bitcoin.\n\nThe Layer 1 blockchain thesis\n\nAll three of these cryptos are premier Layer 1 blockchains. You can think of these blockchains as the \"building blocks\" of the crypto industry. Once you have a Layer 1 blockchain like Ethereum, you can start to build on top of it. That means enjoying things like non-fungible tokens (NFTs), smart contracts, decentralized finance (DeFi), blockchain gaming, and web3 decentralized applications.\n\nImportantly, these are all innovations the Bitcoin blockchain was not designed to offer. Bitcoin is, first and foremost, a potential store of value, similar to gold. Satoshi Nakamoto, the anonymous creator of Bitcoin, also designed it to be a peer-to-peer electronic cash system. But beyond that, Bitcoin does not offer nearly the functionality and diversification that you find with the big Layer 1 blockchain networks. If you want to get involved in the world of decentralized finance (DeFi), for example, you go to a blockchain like Ethereum.\n\nAs a result, one powerful investment thesis right now involves Layer 1 blockchains. All three of these Layer 1 blockchains -- Ethereum, Cardano, and Avalanche -- are highly diversified, and all of them rank as Top 15 cryptocurrencies by market capitalization. In terms of market cap, Ethereum trails only Bitcoin. Cardano, which launched back in 2017, now ranks as the No. 7 crypto in terms of market cap.\n\nOf these three, Avalanche (No. 15 in terms of market cap) may be the least-known among casual investors. However, during the last crypto bull market rally, Avalanche was routinely discussed as a potential \"Ethereum killer\" and comes with a solid pedigree. And in January 2023, Avalanche signed an important partnership deal with Amazon Web Services to offer blockchain services to large corporate and government clients.\n\nThe flight to quality\n\nHowever, not all Layer 1 blockchains are seeing the same type of performance as Ethereum, Cardano, and Avalanche. For example, if you look at the next tier of smaller Layer 1 blockchains, many of them are actually struggling right now. For example, Aptos (CRYPTO: APT) is down 9% over the past 30 days, and Algorand (CRYPTO: ALGO) is down 11%.\n\nThe big factor here appears to be an overall flight to quality by investors. While sentiment has turned markedly bullish for crypto in 2023, there is still a realization that we're not out of the woods yet. Case in point: Bitcoin seemed to be unstoppable for the first three months of the year but now is struggling to soar past $30,000.\n\nAs a result, investors are still searching out high-quality names. This generally means a focus on cryptos with huge market caps and the biggest blockchain ecosystems. This explains why some Layer 1 blockchains are doing so well while others are not.\n\nWhich Layer 1 blockchain is the best investment?\n\nIn choosing between top Layer 1 blockchains, the obvious choice would be Ethereum. This crypto, just like Bitcoin, is a favorite of institutional investors. It has a huge market cap, a well-diversified ecosystem, and a huge developer base. Ethereum also ranks No. 1 in terms of NFT trading volume and No. 1 in terms of Total Value Locked (TVL), which is a key metric for determining how much activity is actually taking place on a blockchain. Moreover, in late 2022, Ethereum completed a highly successful technological transformation -- known as The Merge -- that sets the stage for strong long-term growth.\n\nHowever, if you're looking for a dark horse candidate that might end up outperforming Ethereum over the long run, it's Cardano. This crypto, which has never traded higher than $3.10, is en fuego this year. It's up 64% for the year, which is keeping pace with both Ethereum and Bitcoin. And it has a new strategy based around DeFi that is going gangbusters. The latest first-quarter 2023 metrics for Cardano are now in, and all signals are flashing green.\n\nNow is the time to invest in high-quality Layer 1 blockchains that have diverse blockchain ecosystems and solid long-term growth prospects. The three names on my list right now are Ethereum, Cardano, and Avalanche."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxpZ2h0bmluZy1uZXR3b3JrLWlzLTEtMDAweC1jaGVhcGVyLXRoYW4tdmlzYS1hbmQtbWFzdGVyY2FyZC1kYXRh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Lightning Network is 1,000x cheaper than Visa and Mastercard: Data - Cointelegraph",
        "content": "Fresh data from Glassnode demonstrates that Bitcoin's (BTC) Lightning Network is significantly cheaper to use than legacy payment networks.\n\nThe median fee rate, or the cost of sending value across the Lightning Network, is 0.0029%, 1,000 times cheaper than that of Mastercard or Visa payment processors.\n\nJames Check, the lead analyst at Glassnode, told Cointelegraph that the median fee rate, or the fee charged per 1 BTC sent across the Lightning Network, is currently 3,000 satoshis (the smallest unit of Bitcoin). That is “equivalent to $0.84 to send $28,800 worth of value [...,] which is a fee of 0.0029%.”\n\n“Pretty remarkable when you think about it.”\n\nIn a post on the Nostr social media protocol, Bitcoin analyst Dylan LeClair noted that this rate is many times less than that charged by major credit card companies.\n\nThe Lightning Network, a layer-2 payments solution built atop the world’s largest cryptocurrency, was first proposed as a way to make Bitcoin effective as a payment method. These data points demonstrate that it is not only fast but low-cost, with the mean fee rate steadily trending lower since November 2021.\n\nSource: Glassnode\n\nLegacy payment networks such as Visa and Mastercard charge merchants a fee of around 2-3% per transaction, making them an expensive option for businesses. In an upcoming Cointelegraph documentary shot in Cape Verde, the business owner of one of the few businesses to accept Bitcoin explained that accepting foreign Visa and Mastercard costs over 8%.\n\nMoreover, Glassnode’s Check referred to users who run their own nodes and manage their own channels. Many Lightning users take advantage of custodial wallets, such as the Wallet of Satoshi and Alby, to make micropayments on social media apps such as Nostr.\n\nSome Bitcoin early adopters have noted the growing preference for custodial solutions (the Bitcoiner mantra is “not your keys, not your coin”), although semi-custodial solutions such as Fedi and Cashu could undermine reliance on fully custodial solutions.\n\nRelated: MicroStrategy’s Saylor fuses work email address with Bitcoin Lightning\n\nFurthermore, the throughput of the Lightning Network could be called into question. Check explained:\n\n“Of course, we must also consider that the typical channel is smaller than 1 BTC. The median channel size is 0.02 BTC and the mean is 0.08 BTC, so overall the Lightning Network remains well suited to payments below $1,000.”\n\nIn the below graph, the channel size is trending higher but still well under $10,000. In such an environment, payments over $1,000 may be better suited to the Bitcoin base chain in order to avoid payment failure or misfire.\n\nRelated: Bitcoin in Senegal: Why is this African country using BTC?"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNC0yMS9hLWNsb3Nlci1sb29rLWF0LWJpdGNvaW4tcy1idGMtcmFsbHktc3VnZ2VzdHMtdGhlLWRlcHRoLW9mLWRlbWFuZC1pcy1kZWNlcHRpdmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Rally Data Suggests Depth of Demand Is Deceptive - Bloomberg",
        "content": "Crypto trading volumes seem to have surged last quarter as token prices spiked higher. But looking at the data more closely paints a different picture.\n\nWhen looking at overall trends, Bitcoin trade volumes seem to have spiked, with two trading pairs standing out during that stretch — Bitcoin-Tether and Bitcoin-BUSD, a relatively little-known stablecoin trading on the Binance platform that has since halted issuance, according to crypto market data provider Kaiko. Those two were the top-traded duos on that exchange in the first three months of the year."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIxL2Nhbi1iaXRjb2luLXJlYWNoLTEwMDAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Can Bitcoin Reach $100,000? - The Motley Fool",
        "content": "To say that Bitcoin (BTC -0.07%) has been on a tear in 2023 would be an understatement: The world's leading cryptocurrency is up more than 70% so far this year as of April 20. This gain not only easily outpaces the tech-heavy Nasdaq Composite Index, but it is also a greater rise than Ethereum, another popular digital asset.\n\nAfter eclipsing the $30,000 mark, investors might be thinking of a much larger target to set their eyes on. Can Bitcoin reach $100,000? While it might not happen this year, there is a very real possibility that it will occur in the next five. Here's why.\n\nAll eyes on the Fed\n\nJust around the time when the Federal Reserve indicated that inflation might not be so transitory after all, Bitcoin peaked at nearly $69,000, in November 2021. Throughout 2022, when the central bank hiked interest rates at the fastest pace in history, the digital currency got crushed, losing 65%, a much bigger loss than the stock market and about in line with the overall cryptocurrency market.\n\nInvestors can glean one very important insight from this type of price action. For now, it's evident that Bitcoin trades more like a growth tech stock, influenced by macroeconomic news like recent inflation data or the Fed's actions. At the start of this year, risk assets have generally performed well, a possible sign that investors think rate hikes are coming to an end soon.\n\nAnd Bitcoin is up significantly since the start of the regional-bank fiasco more than a month ago. Perhaps investors also view this top digital asset as a safe and reliable holding amid the turmoil. While these catalysts can drive greater demand for Bitcoin, I don't think they are enough to push the price to $100,000, especially not in 2023.\n\nBitcoin as a store of value\n\nThese catalysts do, however, bring more attention to Bitcoin, which should benefit over the long term as more dollars flow in as well, despite the inevitable ups and downs. I think Bitcoin's most compelling use centers on it becoming a more widely adopted store of value, something that individual and institutional investors will propel. And the growing number of businesses that provide easy access to buying Bitcoin will make it more accessible to the masses.\n\nBut this raises the question: What fundamental reason is there that would make investors want to buy and hold Bitcoin over extended periods of time? Bulls point to one thing and one thing only, and that is the fact that there will only ever be 21 million coins in circulation, an absolutely finite cap that should support a higher price many years from now. And in about a year, Bitcoin's block reward for processing transactions will be cut in half, usually a positive indicator for its price trajectory.\n\nWhat's more relatable is Bitcoin's superiority when inflation is still soaring and governments all over the world -- including the U.S. -- have debased their currencies throughout history. More dollars chasing fewer bitcoins bodes well for the latter's future price. And although Bitcoin won't move in lockstep with the consumer price index, its total return of nearly 48,000,000% (since July 2010, based on the earliest data provided by coinmarketcap.com) certainly proves that it not only preserves purchasing power, but also raises it.\n\nAccording to consulting firm McKinsey & Co., the total global net worth was more than $600 trillion at the end of 2021. This means that Bitcoin's current market cap of $590 billion accounts for less than 0.1% of this astronomical value, even after its huge run-up this year. This means there is still a very long runway for the crypto to find itself in more portfolios.\n\nTo be fair, to get from Bitcoin's current price to $100,000 in five years, there needs to be regulatory clarity, especially in the U.S., allowing the country to lead development of the global framework for this asset class.\n\nEven more important, people just need to learn more about Bitcoin's value proposition in the broader financial landscape. Once this happens, it's hard not to be bullish."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIxL3doeS1iaXRjb2luLW1pbmluZy1zdG9ja3MtZHJvcHBlZC1saWtlLWEtcm9jay10aGlzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Why Bitcoin Mining Stocks Dropped Like a Rock This Week - The Motley Fool",
        "content": "What happened\n\nAfter some recovery over the past few weeks, Bitcoin (BTC -0.07%) miners had a rough go of it this week. The value of Bitcoin is down 7.6% in the past week as of noon ET on Friday, and that leads to a lot of lost value for miners and related companies.\n\nAccording to data provided by S&P Global Market Intelligence, shares of Canaan (CAN -1.44%) have fallen 15.7% since Friday's close, HIVE Blockchain (HIVE -0.32%) is down 17%, Riot Platforms (RIOT 0.95%) has dropped 17.6%, Hut 8 Mining (HUT) is down 16.9%, and Cipher Mining (CIFR 7.81%) has fallen 22.7%. But will the drop continue?\n\nSo what\n\nYou can see in the chart below how these companies follow the price of Bitcoin, at least over the short term. And with good reason.\n\nWhether you're mining Bitcoin or creating chips or other products for miners, the price of Bitcoin itself is very important. It's the equivalent to the price of a commodity for miners in the commodity industry. If the price falls, so does revenue.\n\nTo make matters even more complicated, miners often hold Bitcoin they mine on the balance sheet. This puts additional leverage on these companies, making the volatility worse both when Bitcoin goes up and when it goes down.\n\nThe reliance on high Bitcoin prices is evident when you start looking at net income for each of these companies.\n\nThey need Bitcoin to remain elevated to make money. If the bounce above $30,000 doesn't hold, they might continue losing money.\n\nNow what\n\nWhat's not clear at this point is whether the Bitcoin rally will continue. There's been renewed interest in blockchain assets after the U.S. began cracking down on some companies in the wake of SVB's failure, but both could actually lead to the U.S. crypto industry being even smaller.\n\nInternationally, the news is better, with countries like the U.K. and Hong Kong creating rules that make crypto easier to own. It's possible that the U.S. will follow a similar path eventually, given Congressional pressure, but that has yet to happen.\n\nOne of the biggest challenges for these miners is that competition is much stronger than it has been in previous crypto cycles. Some other blockchains are faster, cheaper, and less energy intensive, reducing the market opportunity for Bitcoin.\n\nCombine that with miners' reliance on the price of Bitcoin itself, and this is a tough business in which to generate long-term value. Most Bitcoin mining companies are just leveraged plays on Bitcoin, and investors who are looking for exposure to Bitcoin can just buy the cryptocurrency itself.\n\nI have not been bullish on Bitcoin miners for a long time, and this week's move is a good example of why. They carry more risk than Bitcoin and often just exaggerate the cryptocurrency's moves."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tb3B0aW9ucy1iaXRub21pYWwtYmxvY2stdHJhZGVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Options Specialist Bitnomial Rolling out Block Trades - Blockworks",
        "content": "Bitcoin-focused derivatives exchange Bitnomial is rolling out block trading for the first time in an industry bid to capitalize on a long time traditional finance practice, as US institutional interest in bitcoin and ether options has booked a marked uptick.\n\nOpen interest in the US and in other countries plummeted in the fourth quarter of 2022 as digital asset markets collapsed. But in the first quarter of this year, open interest, a metric that reflects the number of outstanding contracts on a given unsettled options contract, has recovered.\n\nBitcoin (BTC) was down about 7% in the last seven days through the stock market close in New York on Thursday.\n\nIn terms of bitcoin options on Deribit, “recovered” is an understatement — they hit an all-time high last month, as previously reported by Blockworks. Volume on Deribit, long one of the world’s largest bitcoin and cryptocurrency option exchanges, exceeded $20 billion at the time, the company said.\n\nOptions on digital assets in the US are limited to bitcoin and ether (ETH) by regulators.\n\nIn an exclusive interview with Blockworks on Thursday, Bitnomial President Michael Dunn said the exchange is rolling out block trading this week because “now’s a good time as we see a lot of crypto-native firms coming in” to the bitcoin options trading space with dry powder to splurge.\n\nAnd they’ve been asking, according to Dunn, for customized baskets of bitcoin option books specifically. Crypto hedge fund managers, family offices and other types of traders typically shop around for market makers on digital asset options, often tapping a number of counterparties to try to lock in the best possible price, coupled with the best possible execution.\n\nBlock trading is an over the counter (OTC) arrangement that results in an agreement between a market maker and a buy side counterparty to take on a specified number of derivatives at a specified cost of carry.\n\nIt’s more time consuming than executing an algorithmic trade on BTC options tied to underlying bitcoins. But traders find the practice worthwhile if they’re buying in enough bulk that they snap up futures contracts at a discount to where the market is pricing the cost of opening and closing them.\n\n“Crypto native [traders], they came knocking on our door saying, ‘Hey, you guys have a lit order book and electronic execution, that’s great. But we’re looking to do more complex, structured trades that actually make sense to do atomically and in bigger size and kind of poke around and do block deals.”\n\nBelow are some additional excerpts from Blockworks’ interview with Dunn, who formerly worked in the Chicago options trading scene and has experience with quantitative market making of options on traditional option classes as a result.\n\nBlockworks: Given your and the exchange’s background on the algorithmic side of things, what’s your take on trends you’ve been noticing from a technical perspective? What’s been interesting to you generally, institutional or retail moves from a trading perspective?\n\nMichael Dunn; Source: Bitnomial\n\nDunn: There is something kind of fascinating that we noticed.\n\nBack in December of last year is when we noticed that backwardation occurred in the bitcoin futures curve in our markets and other comparable markets like CME — which is fascinating to us, because that just creates a lot of opportunity for people who have bitcoin on their balance sheet to go in and capture those spreads and actually make money moving Bitcoin into the futures ecosystem, which is really awesome.\n\nThat’s a real advantage our exchange has because CME is a cash-settled product. So, moving your bitcoin to capture those spreads, it’s very difficult. There’s a lot of slippage. You’re doing a lot of weird trades to get in and out of that product …\n\nNow, from the end of the quarter last year to now, we’re seeing more of a steepening of the curve, which is what I would expect given the interest rate environment that we’re in right now.\n\nBlockworks: Who do you view as your direct competition now?\n\nDunn: That’s a great question. If I’m going to be honest, nobody.\n\nWe’re the only ones that are focusing on the physical deliverable space in the US, the only ones that are continuing to build that out. And I think that’s obvious from our customers who we talked to. There’s just not a lot of options out there.\n\nBlockworks: How would you answer that same question last fall?\n\nDunn: I’ll be honest, the way that we view [or viewed] other exchanges, particularly FTX, is that we didn’t really view them as competition.\n\nBecause ultimately, it’s a different customer base. You had a lot of US firms that were setting up these offshore businesses to go and trade those. But that necessarily wasn’t our target market.\n\nLook, when you look at a lot of the US firms now, they’re not willing to set up those offshore companies. They’re not. It’s too much risk for them — particularly after the FTX collapse.\n\nThat’s actually been great marketing for us because you know, like, even look at Deribit. There’s a lot of platform risks there that are being underappreciated from a risk perspective. One thing we saw with Deribit: it had [at one point] like $20 billion of open interest.\n\n_____________________________________________________________________\n\nBitnomial’s trading team booked its first block trade in recent weeks, which was executed between crypto trading firm DV Chain and Electric Capital, a long time digital assets-focused investment manager with a venture capital arm and other investment strategies under its trading purview.\n\nA spokesperson for the company told Blockworks that the exchange’s largest transaction was booked on April 5, adding that Bitnomial’s interest “hit record levels since the beginning of” the first quarter.\n\nDunn said that the exchange’s view is that competition is coming, and that it’s “when, not if” that Wall Street banks start making markets on crypto options in real numbers.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8yMS93aGF0LXRheWxvci1zd2lmdC1jYW4tdGVhY2gteW91LWFib3V0LWludmVzdGluZy_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDQvMjEvd2hhdC10YXlsb3Itc3dpZnQtY2FuLXRlYWNoLXlvdS1hYm91dC1pbnZlc3RpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "What Taylor Swift Can Teach You About Investing - CoinDesk",
        "content": "But taken at face value, the lesson of Moskowitz’s story is that maybe you don’t have to be completely up to speed on every single long-tail risk facing everything you invest in. What Swift did right wasn’t so much asking a specific question about the law or securities – it was asking any challenging and critical questions at all."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1kZWNsaW5lLWVxdWl0aWVzLWZhbGwtdS1zLWNoaW5hLXRlbnNpb24v0gFXaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvbWFya2V0cy1iaXRjb2luLWV0aGVyLWRlY2xpbmUtZXF1aXRpZXMtZmFsbC11LXMtY2hpbmEtdGVuc2lvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether decline; equities fall amid U.S.-China tension - Forkast News",
        "content": "Bitcoin and Ether fell by the end of Asian trading hours on Friday afternoon, together with all top 10 non-stablecoin cryptocurrencies by market capitalization apart from the BNB token. Asian equities declined along with U.S. futures, amid mounting political pressure between China and the U.S.\n\nFast facts\n\nBitcoin fell 2.79% to US$28,118 in the 24 hours to 4:30 p.m. in Hong Kong. The world’s largest cryptocurrency lost 8.47% during the week, after falling below US$30,000 on Monday.\n\n“Bitcoin’s march toward becoming a global reserve asset could surprise many as it siphons value from other asset classes, namely the US$300 trillion global fixed-income market,” wrote Jamie Douglas Coutts, senior market structure analyst at Bloomberg Intelligence, to Forkast.\n\nEther fell 1.65% to US$1,923, according to CoinMarketCap data. Ether also lost 8.66% on the weekly chart, mirroring Bitcoin’s movement, but remained above US$1,900.\n\nDogecoin was the day’s biggest loser, falling 8.44% to US$0.08423, after being yesterday’s biggest gainer in the top 10. The BNB token was the only token in the green, rising 1.52% to US$330.\n\nThe global cryptocurrency market capitalization decreased by 2.27% to US$1.19 trillion in the 24 hours to 4:30 p.m. in Hong Kong. The total crypto market trading volume decreased by 11.51% to US$52.85 billion.\n\nThe Forkast 500 NFT index fell 1.85% to 3,934.04 points on the day and lost 1.85% on the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nAsian equities declined, pressured by U.S.-China tension with President Biden set to sign an executive order in the next few weeks to curb U.S. investments in key parts of China. U.S.-China pressures also intensified after Beijing announced plans on Thursday that it would conduct military drills off its coast and in the South China Sea, amid tensions with Taipei and Washington.\n\nThe Shanghai Composite fell 1.95%, the Shenzhen Component Index dropped 2.28%, Japan’s Nikkei 225 decreased 0.33% and Hong Kong’s Hang Seng Index lost 1.57% to a three-week low.\n\nEuropean bourses were mostly flat on Friday, after Hamburg Commercial Bank’s eurozone manufacturing report showed the biggest contraction in the European manufacturing sector since May 2020. The STOXX 600 inched down 0.064% and Germany’s DAX 40 rose 0.01%.\n\nU.S. stock futures declined on Friday amid mounting tensions between the world’s two largest economies. The Dow Jones Industrial Average fell 0.33%, the S&P 500 Futures inched down 0.03% and the Nasdaq Composite Index slipped 0.025%.\n\nThe U.S. dollar gained 0.03% to 101.8 points after five consecutive days of losses. The euro shed 0.05% to hold above US$1.09, close to a month-high.\n\nGold fell 0.72% to US$1,989 an ounce, set to decline for the second straight week, dragged by interest rate hike expectations from the U.S. Federal Reserve.\n\nSee related article: EU green lights MICA but Cryptos tumble on economy worries"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93YXJyZW4tYnVmZmV0dC13YXMtd3JvbmctYWJvdXQtYS1yYXQtcG9pc29uLWJpdGNvaW4tcG9ydGZvbGlvLWRhdGEtc2hvd3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Warren Buffett was wrong about a 'rat poison' Bitcoin portfolio, data shows - Cointelegraph",
        "content": "Legendary investor Warren Buffett sees no value in Bitcoin (BTC), infamously calling it “rat poison squared.” But data shows that adding Bitcoin to a so-called “rat poison portfolio,” an equally weighted portfolio of Berkshire Hathaway, Microsoft, JPMorgan and BlackRock stocks, would have produced much better returns for The Oracle of Omaha.\n\n“Rat poison portfolio” with Bitcoin does better\n\nSince 2014, allocating only 2.5% Bitcoin yearly to the rat poison portfolio increases returns by nearly 20% with reduced risks, according to independent market analyst Alpha Zeta. For now, the portfolio’s returns stand around 16%.\n\nRat poison portfolio with Bitcoin allocations. Source: Alpha Zeta\n\nDespite Bitcoin’s notorious price volatility, Alpha Zeta noted that BTC’s correlation with the stocks of Berkshire Hathaway, Microsoft, JP Morgan and BlackRock is very low.\n\nCorrelation between Bitcoin and Berkshire Hathaway, Microsoft, JP Morgan and BlackRock stocks since 2014. Source: Alpha Zeta\n\nFor instance, during the 2021–2023 bear market, allocating Bitcoin to the rat poison portfolio could have negated losses by around 10%.\n\nRat poison portfolio drawdown including Bitcoin’s 2.5% allocation. Source: Alpha Zeta\n\nIn other words, BTC typically negates losses imposed by downside movements in the said stocks. Therefore, allocating a small portion of Bitcoin to the rat poison portfolio has proven to be a reasonable hedging strategy to offset potential negative returns.\n\nBitcoin has outperformed Berkshire Hathaway by 320,000%\n\nBitcoin proponents have projected it as an alternative to traditional safe-haven assets, such as gold, given the scarcity that comes with its fixed supply of 21 million BTC and increasing deflation over time.\n\nThis has attracted many people to buy Bitcoin as a way of offsetting fiat debasement and excessive money printing by central banks around the world. For instance, the number of non-zero Bitcoin addresses has grown from around 2,500 in 2009 to over 45 million in 2023, per Glassnode.\n\nThe number of non-zero Bitcoin addresses since 2009. Source: Glassnode\n\nNonetheless, Buffett has recently said that Bitcoin is a gambling token, noting that “it doesn’t have any intrinsic value [...], but that doesn’t stop people from wanting to play the roulette wheel.”\n\nHowever, the veteran investor continues to have exposure in the broader crypto market through his popular investments, such as Nubank, which offers crypto-related services in Latin America.\n\nRelated: Financial analyst agrees Bitcoin could be ‘rat poison,’ but not in the way you think\n\nAs of April 2023, Bitcoin is down nearly 60% from its record high of $69,000 in November 2021 but is up 100% so far this year.\n\nSince its launch in January 2009, Bitcoin has outperformed Berkshire Hathaway’s portfolio by over 320,000%.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8xMzc0OTMvYml0Y29pbi13aGFsZS1tb3Zlcy1uZWFybHktOG0tYWZ0ZXItMTAteWVhcnMtaW5hY3Rpdml0edIBV2h0dHBzOi8vZGVjcnlwdC5jby8xMzc0OTMvYml0Y29pbi13aGFsZS1tb3Zlcy1uZWFybHktOG0tYWZ0ZXItMTAteWVhcnMtaW5hY3Rpdml0eT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Whale Moves Nearly $8M After 10 Years of Inactivity - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAnother sleeping Bitcoin whale just woke up.\n\nToday, a holder who hadn’t touched their cryptocurrency for a decade moved over 279 BTC—or $7.8 million worth—to three new wallets, according to a tweet from on-chain sleuth, Lookonchain.\n\nThe blockchain tracker said in a Friday tweet that the whale in question had originally received 1,128 BTC in the months of October 2012 and May 2013, when prices were about $12 and $195, respectively. In total, the whale holds $31.6 million in BTC.\n\nAD\n\nAD\n\nA whale with 1,128 $BTC($31.6M) that has been dormant for 10 years transferred 279 $BTC($7.8M) to 3 new addresses just now. The whale received 1,128 $BTC in October 2012 and May 2013, when prices were $12 and $195.https://t.co/2MxnVzcEMl pic.twitter.com/2GM7Oq4e2P — Lookonchain (@lookonchain) April 21, 2023\n\nAncient, untouched Bitcoin stashes have been on the move lately. “Whales”—those who have hoarded huge amounts of cryptocurrency—sometimes reemerge after a long stretch of time to move their investment to other addresses.\n\nIn February, an old BTC address that had not budged in 11 years came back to life to move $9.6 million worth of the cryptocurrency—which had appreciated by 120,000,000% over the years.\n\nBitcoin whales are the most successful crypto investors, according to research from the Bank for International Settlements. In February, it said that those who sit on the asset for years tend to do well, while the retail investor who buys and sells in a short time frame typically loses out.\n\nBlockchain firm Arkham Intelligence told Decrypt in February that data shows that Bitcoin investors are again focusing on long-term gains, as over 53% of coins ever minted hadn’t budged for more than two years by that point.\n\nAD\n\nAD\n\nAt the time of writing, Bitcoin is trading for about $27,900, according to CoinGecko, still way below—by nearly 60%—the $69,045 all-time high it hit in November 2021. It is also down over 8% in the past week.\n\nBut the largest digital asset by market cap is still up massively this year, having gone from under $17,000 in January to $30,000 last week."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2luLXByaWNlLXN0cnVnZ2xlcy1hdC0yOWstYnV0LXBlcGUtaHlwZS1jYXJyaWVzLW9uLW1hcmtldC13YXRjaC_SAWJodHRwczovL2NyeXB0b3BvdGF0by5jb20vYml0Y29pbi1wcmljZS1zdHJ1Z2dsZXMtYXQtMjlrLWJ1dC1wZXBlLWh5cGUtY2Fycmllcy1vbi1tYXJrZXQtd2F0Y2gvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Price Struggles at $29K but PEPE Hype Carries On (Market Watch) - CryptoPotato",
        "content": "Bitcoin’s price was unable to get the quick recovery that many seemed to have hoped for yesterday. On the contrary – it is now trading slightly below $29K, and the broader market sentiment has shifted.\n\nMeanwhile, the hype around the explosive PEPE memecoin continues. The cryptocurrency is up a few thousand percent the past couple of days, and it doesn’t seem to be slowing down.\n\nBitcoin Price Fights for $29K\n\nBitcoin’s price took a turn for the worst in the past 24 hours, tumbling below $29,000 and causing hundreds of millions in long leverage positions liquidations.\n\nBTC tumbled toward $29K in minutes yesterday, and many were hoping for a quick recovery, but that hasn’t been the case so far. On the contrary, the price is currently trading below this level, and the market sentiment has shifted, respectively.\n\nAccording to data from alternative.me, which provides multifactorial crypto market sentiment analysis in the face of the so-called Fear and Greed Index, the current sentiment is neutral at 52 points. For comparison, it was at Greed (63 pts) yesterday.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nPEPE Isn’t Having It\n\nPEPE is the latest kid on the block – an altcoin with zero value that’s created just for the meme.\n\nThe cryptocurrency started gaining traction a couple of days ago when its market cap was less than a million. Now, it’s traded on multiple major exchanges and has become the 250th largest crypto with a market cap of almost $140 million, literally printing money for those who got in early.\n\nA lot of them can’t sell at face value because of the lack of liquidity, but that’s quickly changing because it already has over $130 million worth of 24-hour trading volume, according to CoinGecko.\n\nElsewhere, though, the market looks grim.\n\nAs seen in the heatmap above, most of the altcoins are treading well in the red, with certain slight exceptions in the face of DOGE, TRX, and ATOM.\n\nIt’s interesting to see if the market will start recovering or if there’s more pressure coming ahead."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy1kb21pbmFuY2UtcmF0ZS1ydW5zLWZhbWlsaWFyLTExMjEyOTMxMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Dominance Rate Runs Into Familiar Resistance, Hints at 'Altcoin Season' Ahead - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nThe increase in bitcoin's (BTC) dominance rate, or the largest cryptocurrency's share of the overall crypto market, has halted, hinting at the potential outperformance of alternative tokens known as altcoins ahead.\n\nAltcoins are any cryptocurrency other than bitcoin.\n\nData from TradingView show bitcoin's dominance rate rose to 48% from 42% during the first quarter and has struggled to surpass that level so far this month.\n\nThe metric has oscillated between 38% and 48% for almost two years, with declines from 46% to 48% coinciding with outsized gains in altcoins.\n\n\"Bitcoin’s dominance could peak out, this would signal that altcoins would outperform,\" Markus Thielen, head of research and strategy at crypto-services provider Matrixport, said in a note to clients on Thursday.\n\nBitcoin's dominance rate's previous declines from 48% coincided with the altcoin market boom. (CoinDesk/TradingView)\n\nThe chart shows that the total market cap of altcoins (white line, blue arrows) rose more than 60% to $1.39 trillion in the two months after the BTC dominance rate turned lower from 48% in July 2021. Similar bearish turnarounds in the dominance rate in mid-October 2021 and June 2022 also pushed altcoin valuations higher.\n\nHistory could repeat itself, according to Thielen.\n\n\"Bitcoin’s dominance appears to be peaking out at similar levels as in 2022 – accounting for 45/46% of the total crypto market capitalization,\" Thielen said. \"For bitcoin to continue outperforming the rest of the ecosystem would imply that only bitcoin matters, which appears to be unlikely considering the intellectual and financial firepower that is being deployed on other chains.\n\n\"Bitcoin benefited from U.S. liquidity, but going forward, this could change,\" he said."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtY2FsbC1mb3ItY2FsbS1hcy1idGMtcHJpY2Utc2xpcHMtMTAtaW4tYS13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin traders call for calm as BTC price slips 10% in a week - Cointelegraph",
        "content": "Bitcoin (BTC) barely held $27,000 on April 22 as another round of losses left bulls with little firepower.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nGiant RSI support retest greets Bitcoin bulls\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD barely preserving the $27,000 mark on April 22 after the Wall Street trading week ended on a sour note.\n\nIn contrast to United States equities, which managed to seal modest gains on April 22, Bitcoin continued to suffer as analysts warned of a return toward $25,000.\n\nWith that, BTC/USD was down 10% for the week and 4% in April overall, according to data from monitoring resource Coinglass, amid a dramatic turnaround in fortune versus much of Q1.\n\nBitcoin monthly returns chart (screenshot). Source: Coinglass\n\nFor popular trader Credible Crypto, however, there was still every reason to hope that the long-term uptrend remained intact.\n\n“If your macro thesis on Bitcoin has changed because of a $2,000 pullback after a $10,000+ vertical rally from 19k to 30k+ you’re doing it wrong,” he insisted in part of his latest Twitter commentary.\n\nIn an additional post, he argued that such price action is “common” in crypto markets.\n\n“The last major retest we had was at 19k before our rally to 30k+. A retest of 25k here would be logical and healthy,” he stated.\n\nBTC/USD annotated chart. Source: Credible Crypto/Twitter\n\nFinancial information resource Stockmoney Lizards agreed, telling Twitter followers that the road higher may be slow and steady.\n\n“After these huge green candles, we usually find some cooldown,” it wrote regarding the three-month BTC/USD chart.\n\n“Short-/mid-term still bullish (3 months), but don't expect it to go too fast.”\n\nCrypto analyst CryptoCon delivered similar conclusions on the basis of the latest movements in Bitcoin’s relative strength index (RSI).\n\nUsed to determine overbought and oversold conditions at given price points, the RSI can help offer insights into forthcoming price trends.\n\n“Short term #Bitcoin price action seems grim, but behind the scenes, the Weekly RSI has broken out of a 6-year downtrend and is now attempting to make support,” CryptoCon revealed, comparing the latest action to prior halving cycles.\n\n“Bitcoin is now at decision point. Continue 2019 parabolic price action, or take the healthier, steady 2015 approach?”\n\nBTC/USD annotated chart with RSI. Source: CryptoCon/Twitter\n\nBTC price analyst expects “stronger buy interest” near $25,000\n\nTrader Skew, meanwhile, delved into the potential near-term price targets for BTC/USD, focusing on moving averages (MAs).\n\nRelated: Forget BTC price: The Bitcoin mining boom is quietly going parabolic\n\nThe zone north of $25,000 remained the principal point of interest, with the 200-week MA residing at $25,850.\n\n$BTC 1D\n\nFailed breakout above 1D resistance $30K\n\n\n\nWill be interesting if price retests $25K & 1W Trend MAs\n\n\n\nI'd expect a stronger buy interest around there as it's closest to invalidation there before HTF demand around $19K pic.twitter.com/D5eP9ujyHh — Skew Δ (@52kskew) April 22, 2023\n\nThe market composition remained apt to liquidate traders, with Coinglass data showing April 22 costing crypto longs another $173 million.\n\nAs Cointelegraph reported, April 19 saw the largest amount of long liquidations of 2023 so far.\n\nCrypto liquidations chart. Source: Coinglass\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5wb3N0YW5kY291cmllci5jb20vYnVzaW5lc3Mvc2MtYml0Y29pbi1taW5lci1zYXlzLWl0cy1idXNpbmVzcy1pcy10aHJlYXRlbmVkLWJ5LWJhbmtydXB0LXZlbmRvci9hcnRpY2xlXzcyMDQ0M2IyLWRlYzUtMTFlZC05NTI2LTI3ZjM2YjU3OTZkNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "SC bitcoin miner says its business is threatened by bankrupt vendor - The Post and Courier",
        "content": "A Greenville-based cryptocurrency business led by a former gubernatorial candidate says a bankrupt vendor that provides high-powered computers vital to its operations is threatening to pull the plug unless it's paid more money.\n\nGEM Mining has asked a judge to intervene in its dispute with Austin, Texas-based Core Scientific Inc., which filed for bankruptcy protection in December.\n\nThe legal battle provides a glimpse into the murky world of bitcoin mining, an industry that relies on thousands of computers to solve complicated math equations to earn the world's most valuable form of crypto.\n\nGEM said in court documents that data processor Core Scientific has repeatedly threatened to reject contracts to provide computer equipment, known as \"miners,\" as part of its restructuring unless GEM agrees to renegotiate the agreements \"with a materially higher hosting rate.\"\n\nDuring a conference call last month, Core Scientific executives said they would \"intentionally shut down\" GEM's equipment by April 3 if GEM did not agree to terminate or rework the deals, according to court documents.\n\nJudge David Jones called the allegations \"troubling\" in an April 13 order requiring Core Scientific to provide uninterrupted service to GEM pending a hearing on May 22.\n\nJohn Warren, GEM's president and a 2018 candidate for South Carolina governor who previously founded Lima One Mortgage, did not respond to requests for comment last week. Neither did an attorney representing Core Scientific.\n\nThe bankruptcy filing stems in part from the shakeup following last year's epic collapse of the cryptocurrency exchange FTX and the subsequent arrest of founder Sam Bankman-Fried on fraud charges. Bitcoin tumbled from a 52-week high of $42,945 to a low of $15,516 in the wake of the scandal. Prices have since stabilized at around $30,305 but are still far below their peak.\n\nCore Scientific — which provides mining services for itself and clients at data centers in five states — also felt the brunt of soaring energy costs, with electricity to power and cool the company's high-speed computers one of its biggest expenses. The company listed about $1.3 billion in debts and has obtained financing to reorganize its business."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb3VsZC1iaXRjb2luLWJlLXBhcnQtb2YtdGhlLTEyMHQtbXV0dWFsLWZ1bmQtaW5kdXN0cnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Could Bitcoin be part of the $120T mutual fund industry? - Cointelegraph",
        "content": "Macro Markets, hosted by crypto analyst Marcel Pechman, airs every Friday on the Cointelegraph Markets & Research YouTube channel and explains complex concepts in layman’s terms, focusing on the cause and effect of traditional financial events on day-to-day crypto activity.\n\nThis week’s show starts by discussing the mutual fund industry, including the well-known BlackRock, Fidelity and Vanguard, and how the top 15 asset managers handle over $54 trillion. Can you believe it? That money could buy all the companies listed in the S&P 500 Index, plus all the gold, fiat bills and coins in circulation on the planet.\n\nPechman explains how the $120 trillion managed by these mutual funds relies heavily on fixed income and why it remains their top bet despite paying below inflation for the past three years. Moreover, the show discusses how passive investment strategies might catapult Bitcoin (BTC) into a whole other sphere, instantly gaining adoption among institutional investors.\n\nThe next segment of Macro Markets answers a question from “Film City,” who posed a question in last week’s YouTube video comments. Pechman explains why the 40-year low unemployment rate in the United States is not necessarily bullish for risky investments. On the other hand, the analyst illustrates how an increase in the unemployment rate, especially above 10%, is certainly detrimental to cryptocurrencies.\n\nThe show concludes by examining the U.S. credit default swap (CDS) rates, which recently reached an 11-year high. Those insurance instruments activate if the debt issuer fails to honor their payments — in this case, the U.S. government Treasury. Pechman explains why the U.S. CDS is not worrisome at the moment and how one should analyze specific risks to the U.S. dollar currency.\n\nIf you are looking for exclusive and valuable content provided by leading crypto analysts and experts, make sure to subscribe to the Cointelegraph Markets & Research YouTube channel. Join us at Macro Markets every Friday."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGFpbHljb2luLmNvbS9lbC1zYWx2YWRvci1iZWdpbnMtdGhlLWJpdGNvaW4tbGlnaHRuaW5nLXVuaXZlcnNpdHktcHJvZ3JhbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "El Salvador Begins Bitcoin Lightning University Program - DailyCoin",
        "content": "The BTC-focused Cubo+ developer educational program is set to kick off Monday.\n\nIn March, El Salvador’s school system launched an English program.\n\nA week ago, El Salvador passed the crypto bill for Volcano bonds.\n\nThe brightest young minds of El Salvador will be able to partake in the inaugural education program, which aims to prepare a new generation of engineers and developers to maintain the Bitcoin Lightning ecosystem in the Latin American country.\n\nNayib Bukele’s government is ready to award the most talented university students with the first-ever Plan B Fellowship. The Fellowship takes inspiration from Lugano, Switzerland – the first city in the world to roll out a Bitcoin-focused financial ecosystem.\n\n🇸🇻 El Salvador positioning itself for the 21st century! 💪 — Bitopia (@BitopiaLand) April 21, 2023\n\nEl Salvador to Recruit Next Devs Generation\n\nThe first country that declared Bitcoin legal tender, El Salvador, now aims to prepare the next generation of Bitcoin and Bitcoin Lightning developers, who could maintain the country’s new, digital crypto asset-based financial system in the nearest future.\n\nAiming for this goal, the Cubo+ initiative is launching the first curriculum at the University of Don Bosco. The initial group comes with 54 selected students who will concentrate on topics including economics, monetary history, theory, and future use cases and will be highlighted with a concluded statement by Saifedean Ammous, the famed author of the Bitcoin Standard, a best-seller in tech books that’s been already translated to 36 foreign languages.\n\nThe first Cubo+ Devs Generation learning initiative will last until the end of June. Further on, the top students will be able to test their skills in a practice coding boot camp in July, mentored by the best Bitcoin Lightning engineers.\n\nHarvard & Yale are passé. Slaves to the fiat mentality\n\n\n\nCUBO+ and the “Devs Generation” is the new Ivy League. #ElSalvador is ‘Volcano Valley’ 🌋\n\n\n\nLEARN MORE! https://t.co/Gy6nGaLA2Y pic.twitter.com/BULF3W5QBT — Max Keiser, sr. bitcoin advisor to Pres. Bukele 🧢 (@maxkeiser) April 20, 2023\n\nOn the Flipside\n\nThe Cubo+ initiative is only available to university students under 25.\n\nIt’s unknown whether all classes will be available in both English and Spanish.\n\nWhy You Should Care\n\nEl Salvador is setting a precedent for Bitcoin technology adoption and focuses on increasing the general population’s financial literacy.\n\nExplore the latest cryptocurrency news:\n\nShibarium’s Puppynet Popularity Grows as BONE Price Tumbles\n\nUsers Relieved as Binance-Voyager Deal Approved"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZmluYm9sZC5jb20vcmljaC1kYWQtcm9iZXJ0LWtpeW9zYWtpLW91dGxpbmVzLXdoeS1oZS1sb3Zlcy1iaXRjb2luLWFuZC1zYXlzLWJ0Yy10by0xMDBrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "'Rich Dad' Robert Kiyosaki outlines why he loves Bitcoin and says BTC to $100k - Finbold - Finance in Bold",
        "content": "Robert Kiyosaki, the world-renowned investor and author of the best-selling personal finance book, “Rich Dad Poor Dad,” has once again voiced his support for Bitcoin (BTC).\n\nIn a tweet on April 21, he declared his love for the world’s largest cryptocurrency, citing its independence from government and central bank control as one of its primary strengths.\n\nKiyosaki’s tweet reminisces about the time when Bitcoin first hit $20,000 and then subsequently crashed to zero. He initially believed that the digital currency was finished, but over time, he watched as it climbed back up to $6,000. It was then that he decided to invest heavily in Bitcoin because, in his words, “people support BC, not FED or Gov.”\n\nKiyosaki is confident that Bitcoin will continue to rise in value, predicting that it will eventually reach $100,000. He believes that the currency’s popularity and adoption will continue to grow as more and more people recognize the benefits of using a decentralized currency that is not subject to the whims of governments or central banks as it does not need to be bailed out by the government or the federal reserve.\n\nWHY I ❤️BITCOIN: Years ago I watched BC climb to $20k then drop to 0. I thought BC finished. Slowly watched BC climb to $6 k & I bought lots. WHY? Because people support BC not FED or Gov. BC did not need FED or Gov bailout because BC people’s money. BC to $100k. Long live BC. — Robert Kiyosaki (@theRealKiyosaki) April 21, 2023\n\nKiyosaki on Bitcoin\n\nOne of the most significant advantages of the digital asset, according to the author, is its independence from government or central bank control. Unlike fiat currencies, which governments and central banks can manipulate, Bitcoin’s value is determined solely by the market forces of supply and demand.\n\nThis feature makes the cryptocurrency a popular investment option for people who are concerned about the traditional financial system’s instability and volatility.\n\nKiyosaki also had harsh words for the Federal Reserve, the Treasury, and President Biden, whom he accused this week of lying about the state of the US economy. In his opinion, the US is on the verge of a financial collapse, and investors should be looking for alternative investments like Bitcoin to protect their wealth.\n\nHe also predicted a massive backlash for the US dollar, stating that it is no longer the world’s reserve currency. He believes that the US is no longer the ‘playground bully‘ and that other countries, particularly China and Russia, are working to undermine the dollar’s dominance."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI2MDEzLzEwLWJlc3QtY3J5cHRvLWJpdGNvaW4tc2xvdHMtc2l0ZXMtdG8tcGxheS1vbmxpbmUtaW4tMjAyMy_SAWFodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8yNjAxMy8xMC1iZXN0LWNyeXB0by1iaXRjb2luLXNsb3RzLXNpdGVzLXRvLXBsYXktb25saW5lLWluLTIwMjMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "10 Best Crypto & Bitcoin Slots Sites to Play Online in 2023 - CoinCodex",
        "content": "We offer you an honest and quality review of Bitcoin slots sites. You can also check out the most popular slots where you can bet on the cryptocurrency. The reason for this rating is that there are very few quality reviews of Bitcoin slots casinos on the web. Moreover, crypto slots sites are very popular and there is little information on this topic. That's why we have highlighted the top 10 sites that have been sorted according to many parameters. Our research revealed the strongest points of each Bitcoin casino, as well as the benefits that players will get.\n\nOverview of the Best Bitcoin Slots Sites in 2023\n\nTake a look at the top 10 sites with the best Bitcoin slots:\n\nMore than 100 gaming platforms that accept cryptocurrency and allow slot games were included in the study. As you can understand this is quite a time-consuming process because each site had to be checked. But, we have made it through the process and present you with a list of these the best sites.\n\n1. Mirax Casino - Best New Casino\n\nMirax Casino was launched relatively recently in 2022. In just a short period, this gaming platform has managed to gain the trust of many players. You are offered a fully licensed product that has been approved by the Curacao Parliament. The site offers many different benefits, including support for Bitcoin, Bitcoin Cash, Ethereum, and Dogecoin cryptocurrencies. For gambling fans, the best Bitcoin slots will be offered.\n\nTop Gambling Features\n\nPlayers can get top-notch opportunities:\n\nAbility to exchange cryptocurrencies directly on site\n\nSupport for top cryptocurrencies, up to 10 in total\n\nAmong the most popular promotions are Loot Boxes and Free Spins Packages\n\nImagine being able to play four games at once\n\nYou can also set up to receive notifications\n\nAll games can be checked for fairness.\n\nGaming Portfolio\n\nPlayers can play Bitcoin slots as well as select other games, of which Mirax Casino has up to 9,000. All of these games are from certified providers such as:\n\n1x2 Gaming\n\nEvoplay\n\nBelatra\n\nMascot\n\nPlay’n GO\n\nRelax Gaming\n\nWinfas.\n\nThere is also a section with Live Games, where you can choose from Poker, Roulette, Baccarat and Blackjack. The most popular crypto slots have become:\n\nMummyland Treasures\n\nBrumby's 243\n\nMighty Gorilla\n\nBig Wild Buffalo\n\nTNT Bonanza\n\nExpansion!\n\nCrypto Bonuses\n\nWhen you make deposits in cryptocurrency, you can get interesting bonuses that will increase your starting bankroll.\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? Welcome Bonuses 300% up to 5 BTC x45 0.001 BTC up to 60 minutes Yes Wednesday Match Bonus 50% up to 0.005 BTC x45 0.0009 BTC up to 60 minutes Yes\n\nWithdrawal speed\n\nGenerally, the withdrawal of cryptocurrency to your wallets is done in Instant mode. This means that you will receive your funds automatically. Therefore, the average withdrawal speed for BTC, BCH, ETH, or LTC will take no more than 15 minutes. However, the speed may vary due to the blockchain load.\n\nAverage RTP\n\nWhen it comes to the RTP that the games have, particularly the best Bitcoin slots, it's worth looking at the technical side of the games. We have studied all the games in detail and we can say that Mirax Casino has a theoretical RTP of 95-97%. This figure is the most demanded in the iGaming market.\n\nPros: 24/7 customer service\n\nLarge number of cryptocurrencies for payments\n\nMobile-friendly design and games\n\nLots of games from leading developers\n\nBitcoin casino has a Curacao license Cons: A limited number of poker games\n\nSupport\n\nIf players have any questions regarding the operation of the gaming platform or have any problems with Bitcoin casino slots or bonuses, they can contact customer support. The support team works 24/7 to provide help and quality services. To contact the operators you need to send your question to support@miraxcasino.com.\n\nVisit Site\n\n2. 7BitCasino - Best Overall\n\n7BitCasino is one of the most renowned gaming platforms and has been awarded the prestigious Casino Guru award for the clearest Terms. The site was established in 2014, and since then it has been on a course to modernise its service to provide a quality service.\n\nThis Bitcoin casino offers you to play certified games because all the software has been tested as part of the Curacao licensing process. Now you can play the most popular BTC slots, Instant Games, Live Games, or Table Games.\n\nTop Gambling Features\n\nAt 7BitCasino you will be offered benefits such as:\n\nA choice of 10+ cryptocurrencies\n\nAbility to make deposits without charges\n\nThe game platform has a built-in currency converter to help you make any exchange transactions\n\nThe website supports mobile devices.\n\nGaming Portfolio\n\n7BitCasino offers a large number of different games. You will be presented with more than 6,000 games from such providers as:\n\nLucky\n\nIgrosoft\n\nBetsoft\n\nReel Play\n\nBooongo\n\nSwintt\n\nSpribe.\n\nEach user has access to thousands of Bitcoin slot games, as well as Live Games and other entertainment. The most sought-after and popular slots have become:\n\nBrumby's 243\n\nBuffalo Date Grand Ways\n\n3x3 Hold The Spin\n\nTrump Card Queen\n\nTNT Bonanza\n\nFruit Million.\n\nCrypto Bonuses\n\nWhen you play for real money, keep in mind that 7BitCasino will offer you different promotions on virtually every deposit. These can range from Free Spins to cash bonuses.\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? Welcome Package 300% up to 5 BTC x40 0.0009 BTC up to 60 minutes Yes Monday Bonus 25% up to 0.00235 BTC x40 0.0009 BTC up to 60 minutes Yes\n\nWithdrawal speed\n\nWhen requesting a withdrawal, you should be aware that the speed of withdrawal is directly dependent on how busy the blockchain is. Therefore, the maximum withdrawal time can be up to 60 minutes. But most of the time it takes less than 10 minutes for the funds to reach your account.\n\nAverage RTP\n\nHaving studied all the games on the gaming platform, it is safe to say that the average RTP at 7BitCasino ranges from 91-97%.\n\nPros: Huge selection of games that are available to play with cryptocurrencies\n\nYou can run games directly from the browser of your mobile device\n\nBonuses are offered on almost every deposit you make\n\nYou are encouraged to play at bitcoin casino with a Curacao license\n\nYou are encouraged to play at bitcoin casino with a Curacao license You can use 10+ cryptocurrencies for payment transactions\n\nThe casino allows you to play more than one game at a time\n\nThe casino allows you to play more than one game at a time You can play demo games for free Cons: Low limit on withdrawal of winnings\n\nSupport\n\nYou can contact customer support with various questions. For instance, if you want to get information on a specific bonus or have questions on a crypto casino slot machine, or maybe you want to know the terms and conditions of the VIP Program. In any case, the specialists will help you. For your available online chat, where you can ask a question and get an answer right away. You can also email support@7bitCasino.com.\n\nVisit Site\n\n3. KatsuBet Casino - Best Crypto and Real Money Payment Range\n\nOne of the most sought-after benefits of KatsuBet Casino has been the ability to use various payment instruments. The gaming platform was created in 2020 and since then, a course has been taken to improve and enhance the payment systems. The system offered is classic fiat Visa, Mastercard, Maestro, Neosurf, Neteller, and ecoPayz, but also the cryptocurrencies BTC, ETH, BCH, LTC, XRP, and DOGE.\n\nTop Gambling Features\n\nWhen you open an account at KatsuBet Casino you will immediately have access to features such as:\n\nThe game platform has a built-in cryptocurrency exchange service where you can buy different types of cryptocurrencies\n\nThere are also achievements that you will receive for completing tasks from the casino\n\nYou can run multiple games in one window\n\nThe games and software on the website have been tested by iTechLabs.\n\nGaming Portfolio\n\nJust imagine, the KatsuBet Casino website integrates games from over 100 providers. Among them you can find:\n\nGamebeat\n\nMascot\n\nFortunefactory\n\nMaxwingaming\n\nQuickfire.\n\nWhat's more, there are the most popular Bitcoin slot games. Not only can you find classic games, but also All Ways slots, Megaways or Cluster Pays. In these slots, you can find exclusive Wild features as well as Bonus Buy options. The most popular games are:\n\nLady KAKA\n\nFairytale Coven\n\nHot Triple Sevens\n\nBonanza Billion\n\nInner Fire.\n\nCrypto Bonuses\n\nOn the gaming platform, you will be able to receive various bonuses and take part in promotions. At the moment, the best deposit bonuses are:\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? Welcome Bonus 325% up to 5 BTC+100 Free Spins x45 0.001 BTC up to 1 hour Yes Welcome High Roller Bonus 50% up to 0.04 BTC x45 0.004 BTC up to 1 hour Yes Monday Reload Bonus 25% up to 0.005 BTC x45 0.005 BTC up to 1 hour Yes\n\nWithdrawal speed\n\nKatsuBet Casino withdraws your funds very quickly. Moreover, as soon as you order a payout, it will be processed automatically and sent immediately to the blockchain. However, there are times when you need to wait for your funds because the network may be overloaded and it will take a little longer to process your transaction.\n\nAverage RTP\n\nIn addition to the payout benefits, you're also offered a great opportunity to play those games where the average RTP borders on 97%.\n\nPros: iTechLabs test lab certification\n\nQuite a fresh product where you can get lots of different bonus offers\n\nMore than 100 certified providers that produce casino games\n\nOver 20 jackpot slots in the casino lobby\n\nSupport not only for Bitcoin and Bitcoin Cash, but also other cryptocurrencies\n\nProfessional customer support Cons: A limited number of video poker games\n\nSupport\n\nThe support team can only be contacted using the contact form. Go to Contact Us and enter your request. The customer support team will then process your request immediately.\n\nVisit Site\n\n4. Bitstarz Casino - Best Games Variety\n\nBitstarz Casino was created in 2014 and began to gain momentum a few years later. The fact is that the main focus of this platform is on the quality and quantity of games. You will be able to play the latest innovations not only with cryptocurrencies but also with fiat currencies. You will also be able to filter all the games according to the parameters that suit you best. These can be themes, cold or hot games, or jackpot games.\n\nTop Gambling Features\n\nOnce you have registered, you will have access to some features:\n\nLots of great bonuses and other promotions\n\nYou can open your casino account in just one minute\n\nA large range of games, where you can find the different games you like best\n\nFast withdrawal with minimal or no fees.\n\nGaming Portfolio\n\nThere's a catalog of games located on the gaming platform, with around 2,800 titles available. Here you'll find an extended range of Live Games, where you can play with real dealers in Card Games, Craps, or Roulette. In the slots category, you can find your favorite Bitcoin slot. Here we have games such as:\n\nDragons Element\n\nDa Hi Da Li\n\n5 Lions\n\nAsgard\n\nCandy Starz.\n\nCrypto Bonuses\n\nA great opportunity awaits every player who is going to play Bitstarz Casino for real money. The best bonuses will be offered to you.\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? Welcome Bonus 300% up to 5 BTC+180 Free Spins x40 0.0002 BTC up to 10 minutes Yes Monday Bonus 50% up to 0.11 BTC x40 0.0002 BTC up to 10 minutes Yes\n\nWithdrawal speed\n\nBy and large, all cryptocurrency payments on this platform are very fast. You can request withdrawals in any of over 10 cryptocurrencies and your funds will be in your wallet within minutes.\n\nAverage RTP\n\nBitstarz Casino has games that have an RTP of 86%. Yes, it's certainly not much, but when you consider that it's the minimum value, it's not all bad. The maximum RTP value on the site is 97%.\n\nPros: Very generous Welcome Bonus for new players\n\n24/7 Customer Support\n\nSupport for multiple language versions of the website for players from different countries\n\nIncluded in top crypto casino sites that offer tournaments and raffles\n\nSingle wagering requirements x40 for all games Cons: Identity verification is required\n\nSupport\n\nThere is an online chat room on the website, where the support team can answer any questions you may have. You can ask an operator in the chat room about bonuses, games or payment systems.\n\nVisit Site\n\n5. mBitCasino - Best Loyalty Program\n\nThe best Loyalty Program at mBitCasino shows that you will have plenty of opportunities to earn big winnings. Just increase your level in the online casino and then you can get even more different gifts from the platform. This casino was launched in 2014 and is licensed by Curacao. There are many different certified games and over 20 different cryptocurrencies for financial transactions.\n\nTop Gambling Features\n\nSo, the best features at mBitCasino are:\n\nAfter registering, you will be able to access a variety of bonuses\n\nThe website supports several languages for the convenience of players\n\nYou can play from all modern devices, including Android and iOS\n\nLivespins games.\n\nGaming Portfolio\n\nSeveral different providers have introduced their games to the gaming platform lobby. You'll notice developers such as:\n\nAmatic\n\nGameArt\n\nPlay’n GO\n\nBetsoft\n\nEvolution Gaming\n\nEndorphina.\n\nYou'll also be able to play the famous games that are popular with all players:\n\nMighty Gorilla\n\nSea Secret\n\nBonus Mania\n\nEagles Gold\n\nShark’s Bay.\n\nCrypto Bonuses\n\nIf you plan to play for real money, including using cryptocurrency, you will be offered various bonuses. These are designed to help you get a better chance of winning.\n\nThe casino also has a special Daily Deal program that aims to help you increase your rewards and promotions. There are 10 levels, where you'll get various benefits in the form of bonus funds and other bonuses for reaching each one.\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? First Deposit Bonus 75% up to 1 BTC+75 Free Spins x40 0.002 BTC up to 10 minutes Yes Second Deposit Bonus 100% up to 1.5 BTC+100 Free Spins x40 0.002 BTC up to 10 minutes Yes Third Deposit Bonus 125% up to 1.5 BTC+125 Free Spins x40 0.002 BTC up to 10 minutes Yes\n\nWithdrawal speed\n\nYou can choose to withdraw funds in cryptocurrencies such as BTC, BCH, ETH, DOGE, XRP, LTC and others. When you form your withdrawal request, the funds will be credited to your wallet within a short period.\n\nAverage RTP\n\nAlthough many online casinos have a fairly low percentage this doesn't make them any less attractive. mBitCasino will allow you to play with an RTP of 82% and up to 96%. These are great numbers for you to get more opportunities to play.\n\nPros: The best Loyalty Program for all players\n\nOne of the best crypto gambling sites licensed by the Curacao\n\nA recognisable brand in the online casino industry\n\nHuge number of certified games including Live Dealer Games, Slots, and other crypto games\n\nMore than 20 providers that produce casino games\n\nFast withdrawal of winnings with no fees\n\nUnique Loyalty Program Cons: There are very few interactive elements in the casino\n\nSupport\n\nCustomer support is available 24/7 on the gaming platform to ensure that you can get help at any time of the day or night.\n\nVisit Site\n\n6. Stake Casino - Top Tournaments\n\nThe main focus during the creation of Stake Casino in 2017 was on cryptocurrencies, in particular, Bitcoin. However, in addition to cryptocurrencies, various Tournaments as well as sports betting have started to be offered here. All of these events have their benefits as well as various bonuses. But, you will also have access to modern Bitcoin slots, Table Games, Live Games, Instant Games and others.\n\nTop Gambling Features\n\nStake Casino has many different features and these are just some of them:\n\nThis casino is an official partner of UFC Sports\n\nThere are no withdrawal or deposit limits on the gaming platform\n\nNo fees for all financial transactions\n\nYou can use 9 popular cryptocurrencies for betting\n\nThe casino is a Verified Operator by the Crypto Gambling Foundation.\n\nGaming Portfolio\n\nSince the casino is regulated under a Curacao license you have the opportunity to play certified and verified games. The main providers on the site are more than 40 companies. Here you can spot brands such as:\n\nGameArt\n\niSoftBet\n\nBelatra\n\nEzugi\n\nWazdan\n\nYggdrasil.\n\nWhat's more, there are also plenty of games that users choose from. The most popular have been:\n\nDice\n\nWolf Cold\n\nMoney Train 3\n\nPride Fight\n\nFor the Realm!\n\nCrypto Bonuses\n\nPlayers are offered a huge number of different benefits. However, as such, there are no specific bonus offers. Therefore, pay attention to the promotions that are available at the casino.\n\nWhat's more, you'll also have access to fancy tournaments where you can get real money for taking part.\n\nEvent Prize Terms Daily Race $100,000 Win a prize on the Leaderboard and become one of the 5,000 racers who will receive a prize Weekly Giveaway $75,000 For every $1,000 you win, you will receive a special ticket. Collect maximum crypto casino tickets to increase your chances of winning Conquer the Casino! $50,000 Get the most successful games and for that you can share part of the prize pool.\n\nWithdrawal speed\n\nLet's say you want to withdraw your cryptocurrency winnings. You would need to log into your account to enter the withdrawal amount, and then enter your wallet address. You will also need to choose which cryptocurrency is preferred. You can withdraw in ETH, BTC, DOGE, XRP, TRX and others. The payment speed does not exceed 15 minutes, which is very fast.\n\nAverage RTP\n\nImagine that Stake Casino offers those games where the RTP starts at 84% and ends at 95%. That's a pretty decent figure on which to base your game selection.\n\nPros: Casino accept Bitcoin, Bitcoin Cash, Ethereum, Litecoin and other popular cryptocurrencies\n\nYou can play the best games directly from your mobile phone\n\nWithdrawals are made within a short period of time and crypto casino does not charge for it\n\nOne of those crypto casino sites that have a reputable Curacao license\n\nA huge range of different tournaments and other draws Cons: Very few deposit bonuses\n\nSupport\n\nGet help when you want it. Customer support is available 24/7 and they can help you whenever you want. Any questions you have about how the casino works or requirements for bonuses and so on.\n\nVisit Site\n\n7. BC.game - Over 50 Cryptos Accepted\n\nBC.game was created in 2017 and since then there have been many changes. For example, more than 50 different cryptocurrencies have been integrated so that you can make deposits and you can also bet on sporting events. It's a great site where you can make financial transactions with many different tools.\n\nTop Gambling Features\n\nBC.game offers you the following features that you can use immediately after registering:\n\nThe casino encourages players who are open to playing responsibly and makes every effort to make games safe\n\nA proven security system is used here\n\nYou will be able to get a Welcome bonus which is aimed at increasing your chances of winning\n\nThis gaming platform is a verified operator by the Crypto Gambling Foundation.\n\nGaming Portfolio\n\nYou will be offered more than 20 different providers that create Bitcoin games. Among the best-known brands are:\n\nBGaming\n\nPragmatic Play\n\nBooongo\n\nRed Tiger\n\nFugaso\n\nKA Gaming.\n\nYou will have access to various types of entertainment in which you can bet on cryptocurrencies. There are well-known games here:\n\nDa Vinci Deluxe Ways\n\nBC.game Olympus\n\nDog Town Deal\n\nRonin’s Honour\n\nMoney Cart 3\n\nWild Bandito.\n\nCrypto Bonuses\n\nDepending on how interested you are in the bonuses BC.game may offer various bonuses as a Welcome Offer. There are also various Quests as well as bonuses in the form of Free Spins and Free Rolls.\n\nWithdrawal speed\n\nThe gaming platform has a withdrawal speed of up to 60 minutes.\n\nAverage RTP\n\nThe minimum RTP in the casino is 86%. The maximum, however, reaches 96%. Note that the average theoretical return will be quite bearable and the game will be quite profitable.\n\nPros: A globally recognisable brand that is popular\n\nThe site is named best bitcoin casino because it offers betting in more than 50 cryptocurrencies\n\nSingle wagering requirements for all bonuses\n\nHas many partnerships with reputable crypto casino sites\n\nIt is possible to take part in sports betting\n\nAll games tested by iTechLabs\n\nHas a popular bitcoin casino license Curacao Cons: Few ways of contacting customer support\n\nRather complicated navigation\n\nSupport\n\nIf you want to contact support then you should choose the contact form. The fact is that there is no online chat on this platform. Any questions can be asked at any time of the day or night, because the support team is open 24/7.\n\nVisit Site\n\n8. Ignition Casino - Best for Bitcoin Poker\n\nIgnition Casino is one of the best sites where you can play not only casino games but also Bitcoin slots. The gaming platform was created in 2016. Since then, the platform has gained recognition from players because it provides a unique gaming experience. Moreover, you will have the opportunity to bet not only in cryptocurrencies but also in fiat money.\n\nTop Gambling Features\n\nThis site may be of interest to players and offer them features:\n\nThe gaming platform will provide you with Bitcoin betting options as well as fiat betting\n\nWelcome Bonus which will help you increase your chances of winning\n\nAlthough only 2 providers are integrated into the platform, this does not make them any less popular\n\nYou have unbeatable wager requirements for your bonuses.\n\nGaming Portfolio\n\nThe gaming platform integrates games from RTG and Rival Gaming. This means that the total number of games is still 120. However, this is not a minus, but rather a plus, because these two providers can offer you official jackpots and big winnings.\n\nCrypto Bonuses\n\nPlay at Ignition Casino and earn various bonuses that will be available in cryptocurrency and fiat money.\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? Split Bonus 150% up to $1,500 x25 $10 up to 10 minutes Yes Poker Welcome Bonus 200% up to $2,000 x25 $10 up to 10 minutes Yes Weekly Bonus 100% up to $1,000 x25 $10 up to 10 minutes Yes\n\nWithdrawal speed\n\nPlease note that all withdrawals in Bitcoin and other cryptocurrencies take up to 10 minutes. But, withdrawal of fiat currencies will depend on the payment system to which you plan to make the withdrawal.\n\nAverage RTP\n\nAll of the slots and other games on the site have an RTP that borders on 89-97%. Even though there are only two providers, most of the slots will have a theoretical RTP of 95-97%.\n\nPros: A recognisable brand in the online gambling arena\n\nSingle wagering requirements x25 for all bonuses\n\nPlayers have the option of Virtual sports betting\n\nCuracao license\n\nThis bitcoin casino has its own customer support where you can get help by phone or online chat Cons: Small number of games and providers\n\nSupport\n\nYou will only have a few options for contacting the support team. They are available 24/7 and will process requests as they are received. You can contact them via online chat or leave an enquiry and they will get back to you.\n\nVisit Site\n\n9. RocketPot Cassino - Top Pick for Blackjack\n\nOur next contender is the RocketPot Casino website. The thing is, this platform started in 2019 and can offer players decent types of games as well as some tempting bonuses. The platform also offers players first-class customer support and plenty of ways to deposit cryptocurrencies.\n\nTop Gambling Features\n\nSo, the best features offered on the website:\n\nGreat design that doesn't burden you with a huge variety of options\n\nYou can choose several languages in which to display the website\n\nPlayers have the option of betting on sports\n\nAll games on this website can be checked using fair play\n\nA great selection of different Bitcoin slots.\n\nGaming Portfolio\n\nGambling enthusiasts will be pleasantly surprised to discover that the site integrates games from more than 40 providers. Here you can find:\n\nBGaming\n\nHabanero\n\nEvolution Gaming\n\nBelatra\n\nPlatipus\n\nTrueLab.\n\nAnd the range of games is extremely broad. You can choose not only slot bitcoin but also various Roulette, Poker, Video Poker, Baccarat and other games.\n\nCrypto Bonuses\n\nIf you like to bet on cryptocurrency, you can get a nice bonus from the casino.\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? 100% Match Bonus 350 mBTC x100 5 mBTC Instant Yes\n\nWithdrawal speed\n\nWhen you want to withdraw funds from your account, it will only take a few minutes. This means that 5-10 minutes after you create your withdrawal request your funds will arrive in your wallet.\n\nAverage RTP\n\nThis casino offers you the opportunity to get as many different benefits as possible. The RTP is 85-96%. This means that you will have plenty of opportunities to win.\n\nPros: One of the top best bitcoin casino sites that is popular with players\n\nYou have the opportunity to get a Welcome bonus on your first deposit at the casino\n\nLike all best bitcoin casino there is a Curacao license which gives players reliability and security\n\nEvery player has the opportunity to make sports betting\n\nQuick payout from best bitcoin casino Cons: No clear conditions on bonuses\n\nSupport\n\nContact support with any questions about how the casino works. You can ask online chat about how you can get a bonus or how the VIP Program works. Operators are ready to help at any time of the day or night.\n\nVisit Site\n\n10. MetaSpins Casino - Best Bitcoin Bonuses\n\nMetaSpins Casino is a new and fresh gaming platform that was created in 2022. This site has all the necessary documents and licenses that allow it to operate legally. A distinctive feature of the casino can be called excellent bonuses for cryptocurrency deposits.\n\nTop Gambling Features\n\nMetaSpins can offer you features such as:\n\nA license granted by the Curacao parliament\n\nMany different cryptocurrencies to bet on\n\nA large number of different game providers\n\nVirtually instant withdrawal of funds\n\nQuickly upgrade to VIP levels to get more great deals.\n\nGaming Portfolio\n\nOnly the best providers have made their games available to MetaSpins Casino. Here you can find:\n\nRed Rake\n\nNolimit\n\nThunderkick\n\nEvolution Gaming\n\nPeter & Sons\n\nBGaming.\n\nThese developers will also delight you with very interesting and lucrative games:\n\nTNT Bonanza\n\nThe Big Score\n\nPotion Spells\n\nElemento\n\nAnubis\n\nWild Chapo 2.\n\nCrypto Bonuses\n\nThose who want a bigger bankroll can pick up the Welcome Bonus first. This is quite a lucrative offer that can increase your deposit.\n\nCrypto Bonus Wagering Requirements Minimum Deposit Payout Time Accepts Fiat Players? 100% Welcome Bonus up to 1 BTC x25 No minimum deposit 15 minutes Yes\n\nWithdrawal speed\n\nIt takes no more than 15 minutes to withdraw the funds you have ordered in your account section. You can choose the cryptocurrency in which you want to receive the funds. There is no withdrawal fee.\n\nAverage RTP\n\nThe theoretical casino return is in the 90-97% range. This means that you stand a good chance of making a big win.\n\nPros: Quick registration where you only need to enter your email and password\n\nAn active player table where you can watch other users' winnings\n\nPowerful Welcome Bonus to help you start winning immediately after signing up\n\nCuracao International License\n\nWithdrawal of winnings within 15 minutes Cons: Very poor design\n\nSupport\n\nChoose a support chat if you need help. If you encounter a problem and do not know the solution, speak to an operator.\n\nVisit Site\n\nSome useful tips for the crypto player\n\nSlot machine Bitcoin sites offer players a large number of different options to protect their accounts. You need to use all of them. In particular, use strong passwords and also include 2FA if possible\n\nTo include the maximum number of opportunities to win you need to play Bitcoin slots in which there are many options like Megaways, Avalanche Reels, Cluster Pays etc. This will allow you to maximize your gameplay and maximize your chances of winning\n\nTake advantage of the bonuses, because it's a great way to start the game with an increased balance. In some cases, this can increase your bankroll by up to 200%. Imagine how much your chances of winning can increase\n\nYou should also choose games that have an RTP of at least 95%. This will give you more opportunities to win.\n\nCryptocurrency Slots vs Traditional Online Slots\n\nBitcoin slots can be considered the safest option, unlike slots, where you can bet in fiat currency. The fact is that the blockchain technology used in crypto slots allows players to be protected from various financial fraudulent manipulations. In turn, crypto game slots can be called the most promising games in terms of security.\n\nWe have prepared information for you about the advantages and possible disadvantages of btc slots in casinos.\n\nAdvantages of Crypto Slots\n\nAnonymity\n\nWe probably don't need to explain to you the importance of anonymity for cryptocurrency enthusiasts. When you start playing Bitcoin slots you won't want to reveal your personal information. This is what becomes a huge advantage when you play in a crypto casino. Therefore, many gaming platforms require a minimum of information from you.\n\nProvably fair\n\nEvery Bitcoin slots online casino offers proof of fairness. Various algorithms are used here to verify and in turn, confirm that all games are fair. This way you can play in peace and not have to worry about playing unfair games.\n\nCrypto slots casino also has a higher RTP percentage. A figure that indicates the Return To Player characteristic in each game. It is this value that calculates the player's chances of winning, based on previous rounds. This is an added benefit that helps you play with more peace of mind.\n\nSpeed\n\nThere is no doubt that Bitcoin slot games are much faster than traditional fiat slots. Not only is it faster in terms of loading and gameplay, but also in terms of payments. Cryptocurrency payments will be much faster than, for example, Bank Transfers or Card Payments, which are used in fiat payments.\n\nBetter Bonuses\n\nEvery player can get more bonuses for the best Bitcoin slots and other offers. This fact takes cryptocurrency games to a new level and attracts more and more people. For example, once you register with the casino, in addition to the Welcome Bonus, you will be offered Free Spins packages as an add-on.\n\nSecurity\n\nBitcoin casino slots are more secure. The thing is, SSL and other tools are used to ensure security in such games. Also, each game has Fair Play which generates the outcome of each round. This in turn makes it impossible to hack or cheat.\n\nDecentralization\n\nEvery Bitcoin slot is decentralized according to cryptocurrency ideology. Namely, there is no single center where the result of each round is generated. In other words, the network is supported by many users around the world.\n\nDisadvantages of Crypto Slots Online\n\nResponsibility\n\nWhen you start playing crypto slots you immediately take responsibility for all payment transactions. This is where you need to be very careful and take it seriously. The fact is that once you send a transaction it will be impossible to roll it back or refund it. So watch what you do and how you do it.\n\nFewer options\n\nAlthough cryptocurrency has become popular it is still very young and has some drawbacks. You can note the scarcer selection of Bitcoin online slots than traditional fiat slots. But, we have done our research to provide you with the best online btc slots.\n\nVolatility\n\nCryptocurrencies themselves are quite volatile and many players who start playing Bitcoin slot machines know this. Volatility can both increase your deposit in value and decrease it. This does not change the amount of cryptocurrency you have in your wallet.\n\nBitcoin Slot Game Providers\n\nWe have done our research and concluded that Bitcoin slots are produced by many providers. Each of them once developed games for fiat currencies only. However, now their target is cryptocurrency games for the most part. At the moment, we can highlight such providers as:\n\nBGaming\n\nPlay’n GO\n\nEvolution Gaming\n\nPlayson\n\nEndorphina\n\nWazdan\n\nBetsoft\n\nQuickfire\n\nPragmatic Play.\n\nBitcoin slot-themes\n\nOnline slots for Bitcoin offer a huge variety of themes. This will allow you to diversify your gaming experience and try more interesting games. Crypto slots themes come in:\n\nAztecs\n\nEgyptian civilization\n\nFruit themes\n\nRaces\n\nWesterns\n\nFantasy\n\nScientific and many others.\n\nPayment Options\n\nTo start playing online slots with crypto you must use all available payment instruments. You have to use the cryptocurrencies that are supported by the casino of your choice. Based on our research, we can conclude that players can play using such payment tools as:\n\nBitcoin Ethereum Litecoin Bitcoin Cash XRP Doge Binance Coin Cardano and others.\n\nOf course, to play popular Bitcoin slots you will need to have a crypto wallet, which will be used to make deposits into the casino. The minimum deposit amount in each Bitcoin casino does not exceed 1 USDT or 0.0002 BTC. However, there are no limits for withdrawals. This significantly increases the popularity of cryptocurrency games.\n\nPlay BTC Slots on Mobile\n\nPlayers can select any crypto slot machine and start playing directly from their mobile device without any problem. You don't even need to download an app to do so. The fact is that thanks to HTML5 technology, many providers have adapted their games for mobile devices. You can open the browser built into your Android or iOS device, go to the casino and start playing the Bitcoin slot. Everything will work just fine. What's more, you'll even have access to Live Games.\n\nTypes of Bitcoin Slots Games\n\nYou're probably thinking that slots with crypto are rather scarce and have a few different types. This is the biggest misconception because you will be offered different slot designs that use all sorts of bonus features and other elements.\n\nClassic 3-reel Slots\n\nThis is one of the popular types of online Bitcoin slots. There are only 3 reels and there can be from 1 to 9 paylines. These games were most often found in land-based casinos.\n\n5 X 3 Reel Layout\n\nThis design implies more modern games. There can be 5 reels and 3 rows, and the number of active paylines reaches 1,024 Ways to Win and even Megaways. This way you can play Bitcoin slots with more modern themes.\n\nWild Symbols\n\nOne of the most popular and interesting symbols in online crypto slots. The point is that Wild can replace all standard symbols on the playing field except for Scatter and Bonus and complete combinations. There are several modifications of this symbol: Sticky Wild, Moving Wild, Stacked Wild, Random Wild etc.\n\nBonus Buy\n\nThis is another feature that allows you to play slots with Bitcoin by buying bonus rounds. What does it look like? You go to your chosen slot, select your stake and click on Bonus Buy. After that, the bonus game starts, for example, 10 Free Spins. That way you don't have to spin the reels until 3 Scatter hits.\n\nMegaways\n\nYou can select such Bitcoin online casino slots from any gaming platform. These are the usual slot machines, which usually consist of 6-7 reels, and the number of rows can vary up to 10-12. But, the most important feature of Megaways slots is that there are 117,000 paylines. These lines are always active and their number is fixed.\n\nProgressive Jackpot Slots\n\nOnline slots with real money in BTC allow players to receive much larger prizes than the usual payout for a combination. Players are offered a large selection of jackpot slots. The prizes are generated as a result of player bets. The more bets placed on a particular slot, the bigger the prize grows. Getting the jackpot is a reality that you can get into.\n\nBonus-Rich Slots\n\nPlay slots on BTC where there are many different bonus rounds. This will greatly diversify your gambling activity and help you win as much money as possible.\n\n10 Most Popular BTC Slots\n\nAs with traditional games, users have the best crypto slots, which they play much more often. We have done our research and based on various parameters like reviews and ratings we have compiled the TOP 10 Bitcoin play slots.\n\nWild Spin slot by Platipus\n\nOne of the favorite Bitcoin casino slot themes has been the main Wild symbol. A 5x3 playing field awaits players with 25 paylines. The minimum bet is $0.25 and the maximum bet reaches $50. The game's maximum multiplication reaches x1,063. The volatility in this slot is at a Low-Medium level, and the RTP is 95%.\n\nBuffalo Trail slot by GameBeat\n\nThe themes of these real Bitcoin slots are based on nature and wild animals. Chief among them is Buffalo. This animal allows you to win multipliers of up to x5,000 on a playing field with 6 reels and 3 rows. The number of paylines in this slot is 4,096. The game has a High Volatility and RTP of 96.14%.\n\nThe themes of these real Bitcoin slots are based on nature and wild animals. Chief among them is Buffalo. This animal allows you to win multipliers of up to x5,000 on a playing field with 6 reels and 3 rows. The number of paylines in this slot is 4,096. The game has a High Volatility and RTP of 96.14%. 3x3 Hold The Spin slot by Gamzix\n\nIn this online Bitcoin slot machine, you will be greeted by a 3x3 playing field. These designs are most often used in classic games. The main symbols here are Fruits and Sevens. The slot has 5 paylines and an RTP of 96.1%. The volatility is at the Medium level, allowing you to win a maximum multiplier of up to x1,579.\n\nIn this online Bitcoin slot machine, you will be greeted by a 3x3 playing field. These designs are most often used in classic games. The main symbols here are Fruits and Sevens. The slot has 5 paylines and an RTP of 96.1%. The volatility is at the Medium level, allowing you to win a maximum multiplier of up to x1,579. Fruit Million slot by BGaming\n\nThis game is one of the top best Bitcoin slots because players can bet in cryptocurrencies and also because it has a maximum multiplier of x3,000. Pretty interesting classic game with 5 reels, 4 rows and 100 bets. Another advantage of the slot is the RTP, which is 97.1%. Volatility is at the Medium-High level.\n\n7Bit Million slot by BGaming\n\nAnother one of the Bitcoin slot machine games with a fruit theme. The player is presented with a playing field that consists of 5 reels, 4 rows and 100 betways. The maximum multiplication in this game is x1,000. The RTP of this slot is 96.3%.\n\nTreasure Vault slot by Booming\n\nBecome rich and don't deny yourself anything. Experience luxury and jewelry in a game that's on the list of top Bitcoin slot casinos. This slot uses a 5x4 grid and 30 paylines. As for Volatility, the parameter is at a High level. The game's RTP is 95.1% and the maximum prize reaches a multiplication of x8,000.\n\nWild Cash slot by BGaming\n\nFruit, fruit and more fruit. Yes, it's another Bitcoin slot machine online casino that uses this theme. The appealing thing about this game is that it's classic with a 3x3 playing field. The number of paylines here is 5, and the maximum winnings reach x1,000. You'll have plenty of chances to win because the game's RTP is 96.34%.\n\nWild Cash x9990 slot by BGaming\n\nThis is a continuation of that game above. However, there are some very interesting differences in this Bitcoin casino slot machine. The most important one is that the playing field has expanded to 5 reels and 3 rows. You have a Buy Bonus option. The maximum multiplication has increased to x9,990. The number of lines has also increased to 10.\n\nElvis Frog TRUEWAYS slot by BGaming\n\nHelp Elvis the Frog win the golden microphone in Sin City. One of the best Bitcoin slot players choose can bring you multipliers up to x5,000. And as for the features, you'll be facing a TrueWays option that consists of 262,144 lines. An unrealistic number of lines will allow you to form winning sequences more often. The RTP in the slot is at 96.79%. Volatility, on the other hand, shows a value of High.\n\nBig Bang slot by Belatra\n\nThe theme of this slot is ancient times before the beginning of life. You will simply be presented with a huge playing field with a Cluster Pays feature, where instead of spinning the reels, the symbols are dropped. The option is called Avalanche. The slot is dominated by High Volatility which sees a big multiplier of up to x5,000. The RTP is 96.11%. Such features allow you to play slots with crypto just like in traditional games.\n\nHow To Play Slots With Crypto\n\nIt's quite easy to get started playing slots with crypto. There are only a few things you need to do:\n\nCheck out our TOP 10 list of crypto casinos and choose your favorite slots\n\nFind a quality trusted cryptocurrency exchange or a reliable crypto wallet\n\nNow you need to buy a cryptocurrency and send it to the site where you are going to play Bitcoin casino slots\n\nPlay and win big cash prizes!\n\nWe also want to highlight that online casino slots that use Bitcoin offer players the option of buying cryptocurrency on their platforms, which is an advantage.\n\nRules and Gameplay of Online Bitcoin Slots\n\nWhen you play BTC slots, you'll notice that the gameplay is no different from traditional slots. You will also be able to choose your stake, enter the number of lines or turn on Fast Spin mode. What's more, the graphics and design will also be top-notch as these games use the best JavaScript and HTML5 technologies.\n\nBTC Slots RTP (Return to Player): Why is it important?\n\nIn Bitcoin slot games as well as in traditional slots there is such a thing as RTP (return to player). This parameter shows the profitability of the slot. If for example, the game has 96% RTP, you should get $0.96 back from each $1. However, this is in theory. RTP also affects volatility, where its value depends on the frequency and size of payments. Therefore, you need to choose slots where the RTP is higher than 95%.\n\nBitcoin slots bonuses: How do they work?\n\nTo make playing a Bitcoin slot machine casino more fun, many platforms offer various bonuses. Let's look at a few of them so you understand how it works.\n\nMatched Deposit Bonus\n\nThese are usually deposit bonuses. You need to make a minimum deposit in your chosen Bitcoin casino and get a 25% to 200% bonus for it. For example, you deposit 1 BTC into your account and get a 100% bonus of 1 BTC more. Now you can play Bitcoin slot machines with 2 BTC on your balance. This will allow you to start playing with a bigger bankroll and increase your chances of winning big.\n\nFree Spins\n\nThis type of bonus allows you to play real online slots of Bitcoin after making a deposit. There are times when you need to make a fixed deposit to get a certain amount of Free Spins. Or there are times when Free Spins are added in addition to the Match Bonus. Either way, you'll get a certain amount of Free Spins that can be used to play slots.\n\nNo Deposit Bonus\n\nAn unconventional type of reward bitcoin slots no deposit bonus. You need to register on the gaming platform or meet specific conditions to receive this bonus. It is a free bonus and you do not have to deposit to get it.\n\nWagering Requirements\n\nThese are not a type of bonus, but special requirements that are imposed on the bonuses you receive for slots of bitcoin. There are wagering requirements for each bonus you receive at the Bitcoin casino. For example, you received a Match Bonus of 1 BTC with a wager x45. That means you need to multiply the bonus amount by the wager. You will get an amount of 45 BTC. That's how much you need to wager this bonus. Also here it is not so simple, in some games, wagering goes not the whole amount of the bet. So be sure to check the Bonus Terms and Conditions on the website of the Bitcoin casino you choose before you start playing.\n\nTips & Strategies to Play Best Crypto Slots\n\nWhen you start playing the Bitcoin slot machine online you need to gain some skills and knowledge. You need to become familiar with the games as well as the technology used in them. So we have deduced some tips on how to play vest crypto slots.\n\nThe first thing you need to remember is to choose games that have an RTP of at least 95%. This will help you get back more for fewer spins Choose slots with Low Volatility until you get the hang of it. Why? Because Low volatility will allow you to make more frequent, but smaller winnings. So you'll stay afloat longer. Once you get the hang of it, you can choose other Volatility options Try to choose games that have no jackpot or a low jackpot value. This will allow you to earn higher winnings When you're on the lookout for games with big winnings, start playing the slots with the biggest jackpot figure. Undoubtedly, this is very risky. But, if you win, you will recoup all your expenses and efforts You can use the bonuses and take part in the Loyalty Program. This will enable you to start playing with larger amounts of money so that you can increase your chances of winning big money Be sure to set a win-loss minimum and a lose-lose maximum at which you must stop playing. Never gamble with money you cannot afford to lose Another tip: Try to choose games that have the most different bonus options and paylines. Such games are more likely to bring you higher returns\n\nHow We Ranked the Best Bitcoin Slots Sites?\n\nTo rank crypto slot machine casinos we have used several important parameters. They are responsible for all the important aspects of the game.\n\nSecurity of Payments\n\nThis point is the first because it is very important whether it is safe to make payments to the chosen Bitcoin casino. We looked at what technical solutions have been chosen to ensure security, whether there is a license to operate and which company runs the casino.\n\nDeposits and Withdrawals\n\nOf course, it is very important to know how many cryptocurrency options you have to make a deposit and withdrawal. Some Bitcoin casino options may or may not have more. But, this does not affect the performance and reputation of the gaming platform. We have selected the most popular cryptocurrencies for gambling including: BTC, ETH, LTC, BCH, DOGE, XRP, TRX, and ADA.\n\nBonuses and Promos\n\nIf a Bitcoin casino does not offer bonuses for its players, it has no place in our ranking. Moreover, we tried to choose those sites where you can be offered Promos almost every day.\n\nLimits to Withdrawal and Deposits\n\nWhen you play Bitcoin slots traditionally online then you should know that there are no withdrawal limits for cryptocurrency payments. But, in some Bitcoin casinos there can be a minimum deposit limit of 0.002 BTC.\n\nRange of Slot Games\n\nThis is a prerequisite because users must get the most out of the game. We chose the Bitcoin casino where there is a huge number of slot games, as well as providers who produce them.\n\nCustomer Support\n\nEvery player should be able to get help from qualified staff. Therefore, on the site of Bitcoin casino, there should be customer support that works 24/7. This gives a guarantee that players will not be left alone with their problems.\n\nWhere to Buy Bitcoin for Online Slots\n\nTo start playing Bitcoin slots online you need to buy cryptocurrency. You can do this on many different cryptocurrency exchanges and brokers. The most famous in this regard are Coinbase, Bybit and Binance. All of these tools allow you to buy Bitcoin, Ethereum and other cryptocurrencies via Bank Transfers or Payment Cards. It is also possible to use fiat e-Wallets such as Skrill, Neteller, ecoPayz, Neosurf and others.\n\nHow to get started playing Best Bitcoin Slots Games\n\nTo start playing slots for Bitcoin you need to follow a few steps:\n\nStep 1: Create a free account on a crypto exchange of your choice\n\nYou can buy Bitcoin on virtually every crypto exchange, with some of the most reputable options being KuCoin, Binance, Kraken, Bybit, and Coinbase. After you decide which exchange to use, you can open a new account for free.\n\nStep 2: Make a crypto deposit or buy Bitcoin with a credit card\n\nThere are several different methods and payment services you can use for funding an exchange account. You can either deposit cryptocurrency and use it to buy Bitcoin, or deposit fiat via a bank deposit or credit card.\n\nFor more information, check our detailed guide on how to buy Bitcoin.\n\nStep 3: Create a 7bitCasino Account\n\nNow create an account at 7BitCasino by clicking Sign Up.\n\nStep 4: Deposit Bitcoin into your slots account\n\nClick on the Deposit button and then select Bitcoin and copy the wallet address. After that, send funds from your Trust Wallet account to the copied Bitcoin wallet.\n\nStep 5: Get your deposit bonus money\n\nWhen your deposit is credited to your account, you will be credited with a bitcoin bonus.\n\nStep 6: Choose Bitcoin slots and Play online\n\nGo to the 7BitCasino lobby and choose the best bitcoin play slots online. Start playing and win!\n\nStep 7: Cash-out your winnings\n\nWhen you win a large amount, you can immediately withdraw it to your Bitcoin wallet. You only need to click on the Cash Out button, enter the amount and specify the wallet number.\n\nFAQs about Bitcoin online slot machines\n\nCan I play slots with Bitcoin or other cryptocurrencies?\n\nYes, you can play crypto slots using Bitcoin and other cryptocurrencies. For example, almost all Bitcoin casinos from our list support Bitcoin Cash, Ethereum, XRP, Litecoin, and Dogecoin.\n\nCan I play slot games for free?\n\nIf you want to play for free in the best Bitcoin casino slots then you can do it by clicking on Demo. You will have virtual money available which cannot be withdrawn and you will be able to practice almost every slot.\n\nCan I use Bonus Money to play slots?\n\nFor the most part Bonus money should only be used for slots. The point is that you need to wager all the bonus money, and for wagering according to the rules you can only use slots.\n\nAre crypto slots legal?\n\nIt's certainly legal. The fact is that every casino in our rating has a license. This allows Bitcoin casinos to operate completely legally and provide access to slots and other games legally.\n\nAre Bitcoin Sites Safe?\n\nAll Bitcoin casino sites are protected to a sufficient degree. In addition to the fact that a lot of software is used there to maintain network and SSL security, you have the option to install 2FA to have extra security.\n\nHow to win on Bitcoin slots\n\nUnfortunately, we cannot advise on winning strategies. However, you can use some simple recommendations to increase your chances of winning. Play slots with an RTP of at least 95%, set a stop loss and take profit for your game, do not play on your last funds, and choose games with lots of bonuses and other options.\n\nWhat is the best Bitcoin casino to play Bitcoin slots?\n\nThe best Bitcoin casinos have been listed in our ranking. So you can refer to it and choose what you like best.\n\nCan you play Bitcoin slots with no deposit?\n\nYes, some Bitcoin casinos offer no-deposit bonuses for registration.\n\nWhat is a crypto casino?\n\nThe crypto casino is a gaming platform where you can bet on the cryptocurrency. You are offered a large number of games where you can bet and win big in Bitcoins, Ethereum, Litecoins, and Dogecoins.\n\nAre Bitcoin slots fair?\n\nAll crypto games have a fair play option. This allows players to check the result of each round and make sure that all games are fair and honest.\n\nWhich slots pay more?\n\nThis is quite a complicated question because many parameters must be taken into account. It can be assumed that you can win the most in crypto slots, which have the highest RTP.\n\nHow do you pick a winning slot machine?\n\nJust find information regarding the RTP in this game and the maximum winnings you can get.\n\nWhat is the highest RTP crypto slot?\n\nThese are slots where the Return to Player reaches rather high values of 98%+. This means that only 2% will be charged on each of your bets to the pool. So it will be more profitable than slots with an RTP of 94%.\n\nConclusion\n\nWe have collected for you the best Bitcoin slot casinos and for each of them we gave a lot of different tests. Based on what you have read, you will be able to conclude in favor of any particular Bitcoin casino. For example, are you satisfied with Promos and Bonuses offered by the gaming platform or Payment Options? Decide what is more important to you and then just make a choice.\n\nDisclaimer: Before you start playing for real money, you should familiarise yourself with the legislation in your country of residence. It may be that gambling is illegal in your area. It is also important to remember that all games are accessible to those 18+. Gambling can be addictive for some players, so only gamble with money you can afford to lose. Some of the Bitcoin casinos listed may not be available in your country."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIxL3dpbGwtY3J5cHRvLXJlY292ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Will Crypto Recover? - The Motley Fool",
        "content": "Cryptocurrencies suffered tremendously in 2022. Scandals and bankruptcies rattled several large and popular names in the space, against a backdrop of raging inflation and painful anti-inflation policies. From market-darling growth stocks to overpriced real estate properties, anything risky took a massive price cut.\n\nOf course, cryptocurrencies led that race to the bottom, and many investors lost their enthusiasm for the crypto sector after price cuts like these:\n\nCryptocurrency Price 12/31/2021 Price 12/31/2022 Change Bitcoin (BTC -0.12%) $47,192 $16,604 (65%) Ethereum (ETH -1.02%) $3,715 $1,199 (68%) XRP (XRP -1.65%) $1.36 $0.35 (59%) Cardano (ADA -1.95%) $0.84 $0.25 (82%)\n\nWas that the beginning of the end for crypto investments? Did the crypto bubble pop once and for all last year? Or should you expect at least some of these plunging coins to make another comeback?\n\nHere's what I think about these burning questions. Let's see if you agree or not.\n\nHistorical perspective\n\nLet's rewind to 2013. Bitcoin was the only name in the game back then, but that was more than enough fuel for some head-turning market action. The token was worth less than $13 per coin when it performed its first \"halving\" in November 2012. That's a preordained 50% cut in the rewards earned for mining a new Bitcoin block, scheduled to occur roughly every four years. The inflation-killing event inspired more people to try their hand at Bitcoin mining and the token soon soared.\n\nBitcoin prices rose to $130 by August 2012 and then peaked at $1,151 in December. That's when a leading cryptocurrency exchange was hacked, popping that bubble with authority. Bitcoin retreated to roughly $180 per coin amid loud proclamations that the whole cryptocurrency concept was just a mirage with no real value. We Fools poked fun at the fledgling crypto market with the fictional FoolCoin launch on April 1, 2014. Har de har har.\n\nAnother surge, peak, and crash followed in 2017, about one year after the next halving. This time, Bitcoin's moves led the pricing action in thousands of newer cryptocurrencies, including all the names listed in the table above. The trading volumes were also much higher and the price moves saw more coverage in traditional news outlets. Bitcoin prices nearly reached $20,000 per coin this time. Yet, another crypto winter followed and plenty of investors swore off cryptocurrencies forever. The old joke just wasn't funny anymore, right?\n\nThe next halving during the COVID-19 lockdowns in May 2020 didn't seem to do much at first, as Bitcoin prices held firm for several months at roughly $10,000. Still, another bull run followed in 2021 and Bitcoin prices soared above $60,000 a couple of times. Some of the same people who had given up on crypto in 2018 took this market seriously again. Non-fungible tokens were red-hot for a while. Some store chains started accepting payments in Bitcoin, Ethereum, or even Dogecoin (DOGE 8.56%).\n\nAnd then, you know, the inflation-inspired retreat from risky investments followed. The eternal death of Bitcoin, Ethereum, Dogecoin, and Cardano was announced from the rooftops. This is different somehow. This really is the end. There's no coming back from the devastating price cuts you saw in that handy little data table.\n\nRight?\n\nDon't call it a comeback (crypto has been here for years)\n\nWell, the rumors of crypto's death have been exaggerated many times before and I expect another full recovery. You see, these nifty digital currencies have game-changing implications for every corner of the financial world. The market is off to a good start in 2023, too.\n\nThe government seems to have tamed the inflation beast at long last. The economy may go through a recession this year but should come out stronger on the other side. Investors are interested in riskier growth-oriented ideas again, including cryptocurrencies. The four digital currencies listed above are up by at least 43% year to date, led by Bitcoin's 73% upward charge.\n\nAnd there are several additional growth catalysts in the cards right now:\n\nThe next Bitcoin halving is about one year away. The exact date depends on how quickly people and companies are earning their Bitcoin-mining rewards, but the last block at the current rewards rate should fall near the end of April 2024. You've seen what usually happens a few months later. History doesn't repeat itself but it does tend to rhyme. This cyclical pattern alone seems almost certain to spark a fresh bull run next year.\n\nRegulators and crypto projects are hammering out a future framework for crypto regulation. The Securities and Exchange Commission (SEC) lawsuit against XRP's managing body, Ripple Labs, is awaiting a judgment after more than three years of claims, filings, and high-profile media sparring. When that gavel bangs, it should bring some much-needed clarity to how the SEC and other government agencies should treat the crypto market as a whole. Even a draconian ruling in the SEC's favor would be better than the rudderless boat crypto investors have been stuck with so far.\n\nThe inflation crisis gave a lot of people the idea that traditional financial systems may not be perfect after all. Cryptocurrencies could have the power to right many of the old-school banking market's wrongs, for example. Just a couple of usable and widely adopted decentralized finance (DeFi) apps would light a fire under whichever blockchain network powered the new app. Even a smaller hit could do the trick for a modestly sized crypto like Cardano, while Ethereum's needle is harder to move.\n\nBitcoin's predictable halving events may set the rhythm of the crypto market, but in the long run I'm much more interested in robust regulations and mass-market adoption of DeFi apps. That's where the crypto market's real value springs from. Without developers and app users, cryptocurrencies don't mean a thing.\n\nSo there is no doubt in my mind that cryptocurrencies will soar again. The timing and magnitude of the next rise is up for discussion, though. Again, look for successful DeFi apps and invest in the cryptocurrencies that make them tick. Ideally, you already own some before the rocket launch starts without much advance notice."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmFkdmlzb3IuY2EvaW52ZXN0bWVudHMvcHJvZHVjdHMvbmluZXBvaW50LWNoYW5naW5nLWJpdGNvaW4tZXRmLXRvLWZvY3VzLW9uLWVtZXJnaW5nLXRlY2hub2xvZ2llcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ninepoint changing Bitcoin ETF to focus on emerging technologies - Advisor's Edge",
        "content": "123RF\n\nNinepoint Partners is changing the name and investment objective of its Bitcoin ETF to focus more broadly on digital asset and blockchain companies.\n\nUnitholders approved Ninepoint’s proposed change in a vote on Thursday. At the end of May, the Ninepoint Bitcoin ETF will become the Ninepoint Web3 Innovators Fund (TSX: TKN; TKN.U), investing in companies operating in the decentralized internet, blockchain and digital assets.\n\nThe fund may continue to own bitcoin indirectly through other Canadian cryptocurrency ETFs, according to a notice sent to unitholders last month.\n\n“Bitcoin, while important, is now one of several significant innovations enabled by blockchain,” the notice said. “The new strategies will give unitholders access to a much larger investment universe, while remaining focused on digital asset innovation.”\n\nMore Web3 and digital asset companies have gone public, Ninepoint said, creating investment opportunities.\n\nThe Ninepoint Bitcoin ETF launched in January 2021 and other manufacturers released similar products around the same time, as the price of bitcoin and other cryptocurrencies soared. By November of that year, when bitcoin’s price was peaking above US$68,000, the Ninepoint fund had more than $72 million in assets under management.\n\nThe following year saw cryptocurrency values plunge. The Ninepoint ETF dropped by 64% in 2022. By Jan. 31, 2023, the ETF’s assets were down to $22.3 million.\n\nBitcoin has rebounded this year. As of March 31, the Ninepoint fund was up more than 80% year to date. Its return since inception was -5.9%.\n\nHere’s other product news from Canadian fund companies.\n\nMackenzie Investments launched a sustainable ETF and accompanying mutual fund that tracks the Corporate Knights Global 100 Index. The media and research company Corporate Knights selects the 100 global companies in the index using 25 sustainability measures, and all must have more than US$1 billion in annual revenue. The Mackenzie Corporate Knights Global 100 Index ETF (NEO: MCKG) holds the constituent securities — which include Tesla Inc., Apple Inc., First Solar Inc. and Teck Resources Ltd. — in equal weighting and rebalances annually. The mutual fund invests in the ETF. The management fee is 0.5% for the ETF and for the Series F of the mutual fund, while the Series A fee is 1.55%. The risk rating is medium.\n\nlaunched a sustainable ETF and accompanying mutual fund that tracks the Corporate Knights Global 100 Index. The media and research company Corporate Knights selects the 100 global companies in the index using 25 sustainability measures, and all must have more than US$1 billion in annual revenue. The Mackenzie Corporate Knights Global 100 Index ETF (NEO: MCKG) holds the constituent securities — which include Tesla Inc., Apple Inc., First Solar Inc. and Teck Resources Ltd. — in equal weighting and rebalances annually. The mutual fund invests in the ETF. The management fee is 0.5% for the ETF and for the Series F of the mutual fund, while the Series A fee is 1.55%. The risk rating is medium. MD Financial Inc. introduced a new private investment product, the MD Platinum Global Private Equity Trust. Offered through MD Private Investment Counsel, the trust will invest in primary and secondary private equity funds, start-ups and buyouts. MD says the longer-term investments will diversify portfolios and reduce volatility. It is MD’s fourth private asset pool, following the release of private credit, private real estate and an earlier private equity product.\n\nIf you have investment product news, email Mark Burgess at markb@newcom.ca."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi1wcmljZS10b2RheS1jcnlwdG8tbWFya2V0LXZhbHVlLWV0aGVyZXVtLWFsdGNvaW5zLWxvc3Nlcy0zOTY3MDg30gF7aHR0cHM6Ly93d3cuZ2FkZ2V0czM2MC5jb20vY3J5cHRvY3VycmVuY3kvbmV3cy9iaXRjb2luLXByaWNlLXRvZGF5LWNyeXB0by1tYXJrZXQtdmFsdWUtZXRoZXJldW0tYWx0Y29pbnMtbG9zc2VzLTM5NjcwODcvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Fall as Increase in Selling Pressure Causes Drop in Values of Most Cryptocurrenc... - Gadgets 360",
        "content": "Bitcoin price in India and international markets dropped on Friday, after days of seeing its value rise. Industry experts say that at present, the selling pressure on investors has increased, triggering a period of volatility for crypto assets. On Friday, the world's most popular cryptocurrency opened with a loss of 2.22 percent to trade at $28,245 (roughly Rs. 23.2 lakh). While it remains the most expensive cryptocurrency, BTC is currently trading at a similar price on both national as well as international exchanges. In the last 24 hours, the value of Bitcoin has dropped by $613 (roughly Rs. 50,370).\n\n“Bitcoin dropped for the second consecutive session due to an increased selling pressure,” Edul Patel, CEO of crypto investment platform Mudrex told Gadgets 360. Selling pressure garners heat when majority of the traders begin selling, indicating that the majority is betting on the market price to decrease. “This resulted in the loss of the rally and wiped out the weekly gains of Bitcoin. Despite this, there is still substantial support down to the late-March lows of $26,500 (roughly Rs. 21 lakh) and Bitcoin has seen a 40 percent increase over the past six weeks.”\n\nEthereum followed Bitcoin in a conventional market movement and reflected a loss of 0.10 percent at the time of publishing. The value of Ether is hovering around the mark of $1,940 (roughly Rs. 1.60 lakh) after having fallen by $157 (roughly Rs. 12,899) in the last three days.\n\nOn Friday, most cryptocurrencies saw their prices fall alongside Bitcoin and Ether. These included altcoins like Tether, Binance Coin, USD Coin, Ripple, and Cardano as well as Dogecoin, Polygon, Solana, and Polkadot.\n\nShiba Inu, Avalanche, and Tron also saw their values drop on Friday.\n\n“Market performance has been sideways with a downward bias in the last 24 hours. The two-day continuous drop could be triggered by a $400 million (roughly Rs. 3,268 crore) sell order on Binance. On the regulatory front, the US seems to be lagging as market liquidity seems to be moving away from the country. Greed seems to be on a decline, as the crypto fear and greed index stands at 50, down two points in the last 24 hours and lowest since March 15,” Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch told Gadgets 360.\n\nThe overall crypto market valuation dipped by 1.45 percent over the last 24 hours. As of Friday, the crypto market cap stood at $1.20 trillion (roughly Rs. 98,26,980 crore), showed the data by CoinMarketCap. In the otherwise top-to-bottom loss-ridden price chart, LEO and Bitcoin SV managed to record miniscule price hikes.\n\nWhile there are several factors that could have led to the crypto market hitting a speed breaker after rallying for days, it could also be due to the possibility of stricter oversight that could make it risky for miscreants to engage with the sector. The European Parliament on Thursday overwhelmingly backed the European Union's (EU) first set of rules to regulate the cryptoasset markets.\n\nCalled MiCA — or Markets in Crypto Assets — these rules largely revolve around consumer protection and prevention of market manipulation and financial crimes in the crypto sector. The MiCA bill is aimed at preventing insider dealing, unlawful disclosure of inside information, and market manipulation of crypto-assets.\n\n“The crypto market faces headwinds, but long-term tailwinds for Bitcoin are highlighted in 3iQ's 2023 Outlook. Key market indicators showed a ‘Sell' sentiment amidst prices of BTC and ETH decreasing after a good run in the past few days. Investors must proceed with caution,” Rajagopal Menon, Vice President, WazirX told Gadgets 360.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nApple is opening its first stores in India, one in Mumbai and the other in Delhi. What does this mean for Apple customers in India? We discuss this and more on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9pc3JhZWxzLWNlbnRyYWwtYmFuay1sYXVuY2hlcy1kaWdpdGFsLWN1cnJlbmN5LWJpdGNvaW4tZXRoZXJldW0tc2lnbnVwdG9rZW4tY29tLWNhbi1jYXBpdGFsaXplL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Israel's Central Bank Launches Digital Currency; Bitcoin, Ethereum, Signuptoken.com Can Capitalize - Analytics Insight",
        "content": "In recent years, cryptocurrencies, particularly Bitcoin (BTC) and Ethereum (ETH), have gained significant attention as widely used digital currencies. However, alongside these established players, newer cryptocurrencies like Signuptoken.com (SUT) have also emerged as potential contenders in the evolving crypto landscape.\n\nAmidst this changing payment landscape, Israel’s Central Bank is reportedly considering the development of a Central Bank Digital Currency (CBDC), which refers to a digital form of fiat currency issued and regulated by a country’s central bank.\n\nIsrael’s Digital Shekel Or SHAKED?\n\nThe Steering Committee on the Potential Issuance of a Digital Shekel, or “SHAKED,” is in charge of the Bank of Israel’s investigation into the feasibility of releasing a digital shekel. They have identified a number of scenarios that could influence the creation and use of a central bank digital currency (CBDC), including things like CBDC issuances by other nations, a decline in the use of cash in transactions, the adoption of stablecoins or other private payment methods, competition within the domestic payment system, and technological developments in the payments industry.\n\nThe Bank of Israel acknowledges the necessity to proactively address these issues and maintain control over the nation’s payment system as the landscape of digital currencies continues to change. As a viable means of navigating these adjustments and ensuring that Israel stays at the forefront of financial innovation, CBDC is being taken into consideration. Although negotiations over the creation of “SHAKED” are ongoing, no official decision has been made.\n\nWhy Does Signuptoken.com Gain Attention\n\nSignuptoken.com (SUT) has unveiled groundbreaking features poised to revolutionize the crypto world, positioning it as a valuable asset comparable to gold.\n\nSUT, an ERC-20-based cryptocurrency, is committed to generating financial growth for its members. Despite being a relatively new player in the crypto space, Signuptoken.com has ambitious plans to launch on the Uniswap blockchain once it reaches one million sign-ups.\n\nWhat sets Signuptoken.com apart from other altcoins is its unique approach to fundraising. Unlike traditional initial coin offerings (ICOs) or presale programs, Signuptoken.com only collects email addresses, ensuring equal opportunity for all to increase their financial assets. By joining the exclusive Millionaires Club email list, members may even become eligible for early retirement.\n\nPoised to be a safe asset, Signuptoken.com (SUT) has responded to the clamor from its esteemed Millionaires Club members by introducing a highly anticipated referral system. Also, SUT ensures the security of its funds by taking measures to instill confidence in its platform. It acquired audits and secured listings on established crypto platforms such as CoinSniper and Solidity Finance.\n\nBitcoin And Ether — Likened To Gold\n\nAccording to CoinTelegraph, ARK Invest CEO Cathie Wood believes that cryptocurrencies like Bitcoin and Ether are similar to safe-haven investments like gold in that they offer stability during macroeconomic turbulence. She cites their endurance over the most recent banking crisis, outperforming other asset classes, as proof of their widespread acceptance and adoption, pointing to a potential upheaval of the established order of things.\n\nAs cryptocurrencies gain popularity and come under regulatory pressure from the US government, Wood anticipates that they will play a significant role in the upcoming election. But only some people are as enthusiastic about this idea as she is. The world’s largest hedge fund’s founder, Ray Dalio, is skeptical of Bitcoin due to its volatility and central banks’ unwillingness to accept it as a legitimate form of payment. After the US dollar and the euro, gold continues to be a substantial reserve held by central banks, according to Dalio.\n\nThe emergence of cryptocurrencies and the growing interest in CBDC by Israel’s Central Bank reflect the changing landscape of digital assets. With “gold” cryptos like Bitcoin, Ethereum, and SUT establishing their existence in the crypto world and CBDC being considered a potential digital currency by central banks, the future of payments and financial systems is likely to be shaped by the continued evolution of digital assets.\n\nProvide Your Email on the Signuptoken.com Roster\n\nWebsite: https://www.signuptoken.com\n\nTwitter: https://twitter.com/_SignUpToken_\n\nTelegram: https://t.me/SignUpToken\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9hbXAvY29udGVudC8zMTk0MjEyNNIBLWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9hbXAvY29udGVudC8zMTk0MjEyNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Dogecoin Drop Following Hawish Inflation Data: What To Watch Over The Weekend - Benzinga",
        "content": "This 141-Year-Old Retailer Is Outperforming Amazon Forget tech behemoths. This old stock is expanding faster while raising dividends. Believe it or not, it has handily beaten Amazon’s 117% run since 2019. By reading Benzinga’s latest insider-only report, you can set yourself up for future profits and income with this stock, plus more.Get access for just $0.99.\n\nBitcoin (CRYPTO: BTC) was falling about 3% lower during Friday’s trading session, showing weakness compared to the general market, which saw the S&P 500 holding flat.\n\nThe crypto sector appeared to be trading more in tandem with spot gold, which was retracing about 1.3% lower.\n\nENTER TO WIN $500 IN STOCK OR CRYPTO Enter your email and you'll also get Benzinga's ultimate morning update AND a free $30 gift card and more! {{message}} {{message}}\n\nU.S. Services Purchasing Managers' Index rose from 52.6 points in March to 53.7 points in April, which came in above the expectation of 51.5. The news had investors fearing the Federal Reserve may continue with its hawkish stance when it meets in May to decide whether to continue hiking interest rates or pause.\n\nEthereum (CRYPTO: ETH) was following Bitcoin to trade about 5% lower, and Dogecoin (CRYPTO: DOGE) was falling by about the same amount.\n\nTraders will be watching the crypto sector over the weekend for clues on how the S&P 500 may open on Monday.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin and Ethereum Charts: Bitcoin and Ethereum reversed downward on April 14 and April 16, respectively, with both negating their uptrends on Friday by printing lower lows.\n\nBitcoin’s most recent high was printed on April 14 at $31,050 and Ethereum’s high was formed at the $2,142 mark two days later. Although the cryptos negated their uptrends, neither has bounced up to print a lower high yet to confirm a new downtrend is intact.\n\nBitcoin and Ethereum were working to print bearish Marubozu candlesticks on Friday, which may indicate more downside is on the horizon before a bounce. Traders can watch for the cryptos to eventually print a bullish reversal candlestick, such as a doji or hammer candlestick, to indicate the bounce is on the horizon.\n\nBitcoin has resistance above at $28,690 and $31,418 and support below at $25,772 and $25,288.\n\nEthereum has resistance above at $1,957 and $2,150 and support below at $1,846 and $1,717.\n\nThe Dogecoin Chart: Dogecoin’s drop on Friday caused the crypto to fall under the 200-day simple moving average, which is bearish and the crypto also printed a lower low to negate its uptrend. Like Bitcoin and Ethereum, Dogecoin was working to print a bearish Marubozu candlestick.\n\nThe move lower was coming on lower-than-average volume, which indicates a reversal to the upside may be in the cards over the next few days. Bullish traders can watch for Dogecoin to eventually print a reversal candlestick to indicate a bounce is in the cards.\n\nDogecoin has resistance above at $0.083 and $0.091 and support below at $0.075 and at 7 cents.\n\nRead Next: 'Rich Dad, Poor Dad' Author Says Bitcoin On Its Way To $100K"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20vZXhwZXJ0LXByZWRpY3RzLW1ham9yLXB1bGxiYWNrLWZvci1iaXRjb2luLWFuZC1ldGhlcmV1bS1hcy11cy1yZWNlc3Npb24tbG9vbXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Expert predicts major pullback for Bitcoin and Ethereum as US recession looms - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) and Ethereum (ETH) could be facing resistance at key round number levels of $30,000 and $2,000, with the potential for a stock market downturn with the Federal Reserve tightening into a recession that could affect all risk assets.\n\nBitcoin and Ethereum have had a pivotal status since 2020, with definable diminishing supply and low but increasing adoption making a strong case for long-term bullishness.\n\nOn April 21, Bloomberg senior commodity strategist Mike McGlone stated that the yield curve’s highest probability since 1982 suggests a growing consensus that the worst of a US recession may be over. However, this could potentially lead to large pullback risks, according to McGlone.\n\nMcGlone tweeted: “Bitcoin and Ethereum — may be running into a wall of resistance at the key round number levels of $30,000 and $2,000. Our bias is bullish in the long term for the top cryptos, but an overwhelming force of the stock market going down with the Fed tightening into a recession has the potential to lower the tide for all risk assets, and Bitcoin and Ethereum are among the riskiest.”\n\nBitcoin and Ethereum are among high-risk assets. Source: Mike McGlone\n\nBitcoin and Ethereum\n\nThe future of Bitcoin and Ethereum is closely tied to technological advancements and increasing adoption. Many experts believe that these cryptocurrencies will continue to gain mainstream acceptance as more businesses and individuals recognize the benefits of decentralized financial systems.\n\nSince the turn of the year, Bitcoin has experienced a notable increase of approximately 70%, while Ethereum has climbed just above 60%. Interestingly, a recent historical pattern has emerged as the value of Bitcoin has again reached 15 ETH after six years.\n\nDespite the impressive performance of these digital assets and surpassing key price levels of $30,000 and $2,000 in April, both have experienced significant pullbacks in the last week. At present, Bitcoin is trading at $28,077, down 1.88% on the day and 8.91% over the previous week. Meanwhile, Ethereum, the second-largest asset by market cap, is currently trading at $1,908, down 1.75% in the last 24 hours and 9.86% in the last week.\n\nWhile Bitcoin and Ethereum’s recent pullbacks may cause temporary concern, their overall upward trend and potential for long-term growth remain. Investors should remain vigilant of potential downside risks, especially in light of broader market conditions.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vdGVsZWdyYW0td2FsbGV0LXVzZXJzLWNhbi1ub3ctYnV5LXdpdGhkcmF3LWFuZC1leGNoYW5nZS1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Telegram wallet users can now buy, withdraw and exchange Bitcoin - Finbold - Finance in Bold",
        "content": "The users of the widely used Telegram messaging app now have the ability to purchase, withdraw, and exchange Bitcoin (BTC). It is noteworthy, however, that the Wallet bot and its associated services, which allow for these functions, were created by a third-party, as opposed to being developed by Telegram itself.\n\nIn fact, the Wallet bot and such similar services are created by third-party developers using Telegram’s open bot API. This means that anyone can utilize the API to develop their own crypto-related bot, without any direct involvement from Telegram.\n\nThus, users of the @wallet web interface can now access buy, withdraw, exchange, and make peer-to-peer (P2P) transactions directly through Telegram’s web interface in Bitcoin, as per the latest announcement from the @wallet account on April 21. This move builds upon the existing services surrounding cryptocurrencies that are already popular within the chat program. Notably, the announcement states:\n\n“Bitcoin is now available on the @wallet web interface, along with a new instant exchange. You can now buy, withdraw, exchange, and make P2P transactions with BTC directly through our updated web interface. It is now possible to buy Bitcoin using a bank card or the P2P market in the “Buy & Sell” section of our user-friendly interface.”\n\nThe announcement also reminded users that the updated “Exchange” of the platform can now instantly swap Bitcoin, Tether (USDT), and Telegram Open Network (TON) with each other.\n\nAs the popularity and adoption of cryptocurrencies continue to grow, it will be interesting to see how Telegram and other third-party industry players continue to innovate and adapt to meet the changing needs and expectations of users around the world."
    }
]