[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY29pbnMvdGhlLWJpdGNvaW4tZXRmLWRlYmF0ZS_SAVBodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2NvaW5zL3RoZS1iaXRjb2luLWV0Zi1kZWJhdGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "The Bitcoin ETF Debate - Finance Magnates",
        "content": "Bitcoin, the world's largest cryptocurrency by market capitalization, has sparked heated debate over its regulation and acceptance. One of the major points of contention is whether regulatory authorities should approve a Bitcoin exchange-traded fund (ETF).\n\nIn this article, we'll look at the benefits and drawbacks of a Bitcoin ETF, as well as the future of this contentious asset.\n\nBenefits of a Bitcoin ETF\n\nA Bitcoin ETF would give investors an easy and familiar way to gain exposure to Bitcoin without having to hold and store the asset themselves. This would allow more retail investors to invest in Bitcoin, potentially increasing demand, and price.\n\nA Bitcoin ETF would also allow investors to track the price of Bitcoin without having to deal with the technical complexities of directly holding and trading Bitcoin.\n\nKeep Reading Social Media Reward Coins: A Catalyst for Widespread Crypto Adoption\n\nA Bitcoin ETF has piqued the interest of institutional investors, who would be able to invest in the asset class without violating their investment mandates. Many institutional investors have restrictions on investing in assets that have not been registered with regulatory authorities, as Bitcoin is currently.\n\nA Bitcoin ETF may also help to reduce volatility in the Bitcoin market. Currently, the price of Bitcoin is heavily influenced by news and events in the cryptocurrency market. A Bitcoin ETF could potentially stabilize the market and reduce the impact of news and events by providing a regulated and centralized platform for trading Bitcoin.\n\nThe Drawbacks of a Bitcoin ETF\n\nThe possibility of market manipulation is one of the main arguments against a Bitcoin ETF. The cryptocurrency market's lack of regulation and oversight has raised concerns about market manipulation and price volatility.\n\nBy allowing investors to short or long Bitcoin on a regulated exchange, a Bitcoin ETF could potentially provide a platform for market manipulation.\n\nAnother source of concern is the possibility that a Bitcoin ETF will increase the risk of fraud and theft. Bitcoin security has always been a concern, with numerous high-profile hacks and thefts over the years.\n\nBecause a Bitcoin ETF would hold a significant amount of Bitcoin, it would be an appealing target for hackers and thieves.\n\nFinally, there is concern that a Bitcoin ETF could cause a Bitcoin market bubble. Bitcoin has already seen several bubbles in its short history, and a Bitcoin ETF could potentially attract more speculative investors, pushing the price to unsustainable levels.\n\nBTC vs BTC ETF: What’s the Better Investment?\n\nSurely many have wondered what’s best: to buy a BTC ETF or just buy BTC directly. To answer that question there are many advantages and disadvantages to buying a Bitcoin ETF you should know about.\n\nConvenience at a cost\n\nFirst and foremost, investing in a BTC ETF is a direct way of diversifying into the crypto market without actually being in the cryptocurrency market, without signing up for crypto exchanges, without taking on the inherent risk of owning crypto and, more importantly, without needing to learn the ins and outs of Bitcoin.\n\nHowever, that very same convenience comes with three inherent disadvantages:\n\n1. Management fees: when you buy cryptocurrency, that’s the end of it. However, by deliberately choosing to invest in an ETF, you’ll certainly have to factor in management fees. And, as we all know, these fees can be significant over time.\n\n2. Inability to trade crypto: BTC can be traded. As such, if you own BTC, you can trade it for any cryptocurrency you like. However, investing in a BTC ETF doesn’t allow you to do the same as you won’t be eligible for trading it for cryptocurrency.\n\n3. Lack of ownership: Many see Bitcoin as a way of mitigating risks that lie within the traditional financial system. Hedging against central banks is the thesis of many Bitcoin maximalists. Moreover, BTC and the blockchain provide some level of privacy, something which an ETF simply cannot match.\n\nDiversification and taxes\n\nBitcoin ETFs should mean diversification as they claim to provide investors with ways of mitigating risks (by bundling BTC with, for example, stocks).\n\nAs for taxation, BTC ETFs are much more tax efficient as opposed to BTC which is decentralized in nature and unregulated.\n\nSo, as an investment strategy, the answer will ultimately come down to whatever your goals are. If you plan to navigate the cryptocurrency universe, perhaps it’s best to outright buy crypto. If the plan is a long term investment, BTC is the better investment as you won’t be met with maintenance fees. However, if you don’t plan to invest and get to know how cryptocurrency works, an ETF will do just fine.\n\nThe Way Forward\n\nThe debate over a Bitcoin ETF has raged on for several years, with regulatory authorities rejecting several proposals. However, the landscape is shifting, and the approval of a Bitcoin ETF could be closer than ever.\n\nThe US Securities and Exchange Commission approved the first Bitcoin futures ETF in October 2021. (SEC). While it is not a traditional Bitcoin ETF, it does provide investors with exposure to Bitcoin futures contracts traded on regulated exchanges.\n\nAs it demonstrates that Bitcoin can be traded on a regulated platform, this could pave the way for a Bitcoin ETF in the future.\n\nA Bitcoin ETF was approved in Canada in February 2021, allowing investors to invest in Bitcoin through a regulated ETF. The success of the Canadian Bitcoin ETF could provide regulatory authorities with additional evidence that a Bitcoin ETF can be regulated and provide investors with a safe and secure way to invest in Bitcoin.\n\nWrapping Up\n\nThe Bitcoin ETF debate is far from over, and investors and regulators alike will continue to debate the pros and cons of a Bitcoin ETF. While a Bitcoin ETF would offer investors a simple and familiar way to invest in Bitcoin. It also carries risks, such as the possibility of market manipulation and theft.\n\nThe approval of the first Bitcoin futures ETF in the United States, as well as the success of the Canadian Bitcoin ETF, are both encouraging signs for the future of a Bitcoin ETF.\n\nWhile regulatory authorities must address the concerns raised by a Bitcoin ETF, the growing interest in Bitcoin and the cryptocurrency market suggests that a Bitcoin ETF may become a viable investment option in the future.\n\nThe regulatory environment is likely to evolve as the cryptocurrency market continues to evolve and mature. The risks associated with a Bitcoin ETF could be mitigated with increased regulation and oversight, making it a safer investment option for both retail and institutional investors.\n\nIndividual investor preferences and risk tolerance will ultimately determine whether or not to invest in a Bitcoin ETF. A Bitcoin ETF may be a convenient and regulated way to invest in Bitcoin, but it may not be the best option for all investors.\n\nTo summarize, the debate over a Bitcoin ETF is complex and multifaceted, with both advantages and disadvantages to consider. While a Bitcoin ETF may offer investors a regulated and secure way to invest in Bitcoin, there are risks that must be addressed.\n\nThe approval of the first Bitcoin futures ETF in the United States, as well as the success of the Canadian Bitcoin ETF, are encouraging signs for the future of a Bitcoin ETF, and it will be interesting to see how the regulatory environment and investor interest in Bitcoin evolve in the coming years."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMjQvZm9yLXRoZS1ibGFjay1jb21tdW5pdHktYml0Y29pbi1yZXByZXNlbnRzLWFuLW9wcG9ydHVuaXR5LWZvci13ZWFsdGgtcHJlc2VydmF0aW9uLmh0bWzSAXpodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMi8yNC9mb3ItdGhlLWJsYWNrLWNvbW11bml0eS1iaXRjb2luLXJlcHJlc2VudHMtYW4tb3Bwb3J0dW5pdHktZm9yLXdlYWx0aC1wcmVzZXJ2YXRpb24uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "For the Black community, bitcoin represents an opportunity for wealth preservation - CNBC",
        "content": "The bitcoin narrative has veered far away from early investors' vision of it enabling economic freedom, at least in the U.S. But for many in the Black community, that narrative is still alive and it's imperative that people stay focused on it.\n\nBitcoin's core values – decentralization, censorship resistance, its peer-to-peer nature – get pushed to the side time and again as the industry tries to grow in a world run by intermediary institutions. Opening an account at a centralized exchange like Coinbase or Kraken (or, until recently, FTX) is the easiest and most common way to get into crypto. And it's safe to bet most people are playing the speculation game, trading crypto on an exchange instead of transacting directly with another person as bitcoin was intended.\n\nThere's a long game to play, however, particularly for the Black community. Thanks to bitcoin's core values, anyone can store their wealth or move it around on the network and no one person can stop or control that. For Black people, that's a golden opportunity to level the playing field and give them \"sovereignty\" over their wealth, said Lamar Wilson, founder of crypto-focused network Black Bitcoin Billionaire.\n\n\"A lot of our history with America has not been the greatest,\" Wilson told CNBC. \"Whenever Black people have put their money into things in the past to build wealth in this country, it has been coerced out of their hands, it has been taken from them, it has been burned down or destroyed.\"\n\nIn the 1800s, Seneca Village, Manhattan's first known community of African-American property owners, was destroyed to build Central Park, for example. The Tulsa race massacre, also known as the Black Wall Street massacre, happened in 1921 when a white mob burned the wealthiest Black community in the U.S. to the ground in the Greenwood district of Tulsa, Oklahoma. A couple years later in California, Manhattan Beach officials forced out Willa and Charles Bruce claiming eminent domain. That land was returned to the Bruce family last year.\n\n\"Bitcoin is an asset that you can actually store and hold yourself and no one can take you,\" Wilson said. \"This provides a way to be part of an asset that is globally liquid around the world.\"\n\nFast forward to today, and Black people still largely start their wealth building journeys from behind. According to an FDIC survey, the proportion of U.S. households that were unbanked in 2021 was the lowest it's been (4.5%) since the bank regulator began the survey in 2009. Still, within that group, at every income level, there's a big difference in the unbanked rates between Black and white households. Ultimately, that discrepancy shows up in the stock market's racial investing gap."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjQvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtYml0Y29pbi1mYWxscy1mb3ItdGhlLXdlZWstYW1pZC1pbmZsYXRpb24tcmF0ZS1oaWtlLWZlYXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin Falls for the Week Amid Inflation, Rate Hike Fears - CoinDesk",
        "content": "BTC’s 50-day moving average remains above its 200-day moving average, a so-called golden cross that usually yields positive results but has yet to do so in this most recent instance. BTC’s price is down 6% since its occurrence on Feb. 18."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vYWJjbmV3cy5nby5jb20vVVMvbWFzc2FjaHVzZXR0cy1tYW4tY2hhcmdlZC1hZnRlci1oaWRpbmctY3J5cHRvY3VycmVuY3ktbWluaW5nLXJpZy9zdG9yeT9pZD05NzQ0MDE3M9IBcGh0dHBzOi8vYWJjbmV3cy5nby5jb20vYW1wL1VTL21hc3NhY2h1c2V0dHMtbWFuLWNoYXJnZWQtYWZ0ZXItaGlkaW5nLWNyeXB0b2N1cnJlbmN5LW1pbmluZy1yaWcvc3Rvcnk_aWQ9OTc0NDAxNzM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Massachusetts man charged after hiding cryptocurrency mining rig in school crawl space - ABC News",
        "content": "A small Massachusetts town enlisted the help of the Department of Homeland Security to track down the person who illegally installed a cryptocurrency mining operation in a crawl space of a middle school.\n\nAccording to the Cohasset Police Department, the director of facilities for the Cohasset Middle/High School called the police in Dec. 2021 after noticing out-of-place electrical wires, computers and temporary ductwork. With the assistance of the town’s IT director, detectives located a cryptocurrency mining operation, connected to the school’s electrical system, in a crawl space.\n\nThe Cohasset Police Department demonstrates the equipment used to mine cryptocurrency in the crawl space. Cohasset Police Department\n\nThe process of “mining” cryptocurrency utilizes computers to verify transactions by solving complex equations, requiring a “considerable amount of electricity,” according to the White House Office of Science and Technology Policy.\n\nAccording to the University of Cambridge, bitcoin (which is just one of many cryptocurrencies) requires roughly 14 gigawatts of electricity daily. According to the Department of Energy, the daily energy needs of bitcoin would require approximately 43 million solar panels or 4,662 utility-scale wind turbines.\n\nAfter discovering the unauthorized mining setup, the Cohasset Police Department contacted the Coast Guard Investigative Service and the Department of Homeland Security to remove the computer and conduct a forensic examination.\n\nPolice identified the Town of Cohasset’s assistant facilities director Nadeam Nahas, 39, as a suspect after a three-month investigation. Nahas resigned from his role in 2022.\n\nNahas was charged with vandalizing a school and fraudulent electricity use in Quincy District Court. According to ABC’s Boston affiliate, Nahas failed to appear at his Thursday court appearance, prompting an arrest warrant for his arrest. He is accused of stealing nearly $18,000 in electricity from the school district."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLTIwMjQtaGFsdmluZy13aWxsLWJlLWl0cy1tb3N0LWltcG9ydGFudC1pbnRlcnZpZXctd2l0aC1jaGFybGVzLWVkd2FyZHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin 2024 halving will be its 'most important' — Interview with Charles Edwards - Cointelegraph",
        "content": "Bitcoin (BTC) stands at the start of a “new regime” after its early 2023 price gains, and next year will prove pivotal.\n\nThat is the opinion of Charles Edwards, founder of quantitative Bitcoin and digital asset fund Capriole Investments.\n\nAs investment behavior around Bitcoin recovers in line with network fundamentals and price action, Edwards, perhaps like many other institutional professionals, is gearing up for an explosive period of growth.\n\nThe jury may still be out on whether the bottom is in for BTC’s price, but for long-term investors, the time to allocate is just beginning, he argues.\n\nIn an extensive interview with Cointelegraph, Edwards reflects on the prospects for Bitcoin and the crypto industry in the coming years and whether the 2023 rebound has legs.\n\nLooking ahead, next year’s block subsidy halving will be especially important as Bitcoin becomes, in his words, the “hardest asset in the world with certainty.“\n\nCointelegraph (CT): Bitcoin’s NVT metric is now at two-year highs. You said this is “showing indications of value normalization and the start of a new market regime.” What is NVT, and why is this a big deal?\n\nCharles Edwards (CE): NVT is often referred to as the Bitcoin version of a “PE Ratio” – a simple yardstick for relative value of the network. NVT is network value to transaction value. It is the ratio of Bitcoin’s U.S. dollar market capitalization to the 90-day average U.S. dollar transaction volume that flows through on-chain Bitcoin transactions.\n\nThe reasoning is simple. If Bitcoin’s network is used to settle a lot of transaction value, then the network should be worth more. So, when NVT is relatively low, it means the market is undervaluing Bitcoin versus the value of transactions it is securely settling.\n\nOne way to identify the relative value of NVT is using Dynamic Range NVT; this applies two-year Bollinger Bands to the NVT ratio. When NVT hits the lower band, Bitcoin has historically been very cheap (a better value buy); when it hits the top band, it has been relatively expensive (a time to manage risk).\n\nBitcoin spent most of the second half of 2022 in the $16–20,000 region, and during this time it was trading at the lower NVT band — a signal for great long-term value. As of February 2023, NVT has broken out above fair value. This can be a signal that we are in a new regime, the early stages of a new bull market. However, as of writing, NVT is fast approaching the overvaluation band. We are not there yet, but we could be in for some near-term volatility.\n\nCT: How confident are you that Bitcoin is now in a “new regime” or bull cycle?\n\nCE: There is a very good chance this is the start of a new regime, the early stages of a Bitcoin bull market. We have all the signs of a typical turning point on value and sentiment. This is not to say I expect price to dramatically rally upward from here like it did in January; the early stages of Bitcoin bull markets typically involve a 6–12 month period of volatility and an overall slow trend and grind up. My base case is a positive 2023, with the more significant cyclical growth and returns coming in 2024.\n\nHere are some of the reasons why I see a new regime forming today. As of January 2023, we have:\n\nJust exited a period of deep value as defined by many on-chain metrics, including Bitcoin trading at its electrical cost for two months ending this January. Historically this is the global price floor for Bitcoin and this was the second-longest period spent at the electrical cost in Bitcoin’s history (the first was 2016).\n\nCompletely eclipsed the price collapse of the third-biggest fraud of all time in just two months. Despite the industry’s great loss of wealth to millions of people, Bitcoin has demonstrated that there are very few marginal sellers left, and the level of deep value is too much to maintain prices this cheap for long, regardless of such negative news.\n\nA major technical price confirmation and confirmed fakeout at the most important price level on the Bitcoin chart — the old $20,000 all-time high and the point of the FTX collapse.\n\nWitnessed a 40% short squeeze with identical characteristics to the 2021 China mining ban Bitcoin price bottom.\n\nEntered a new regime of upward momentum, confirmed across multiple long-term moving averages commonly referenced in major markets.\n\nAre having an optimal halving cycle timing where Bitcoin typically bottoms (Q4 2022 and Q1 2023).\n\nThe Bitcoin cycle drawdown hit typical 80% levels in late 2022.\n\nIn November/December 2022, sentiment was at its worst, and market hedging at its highest on record.\n\nA likely Fed rate pause and change of policy is due in 2023.\n\nCT: What was the significance of the $20,000 breakout in January?\n\nCE: The $20,000 breakout was the most important price movement we have seen since the all-time high in 2021. $20,000 is important for many reasons:\n\nIt is the 2017 (prior Bitcoin cycle) all-time high.\n\nIt is the price level that the FTX fraud was exposed at, and the third-biggest exchange (and top three fraud in human history) collapsed at in 2021.\n\nIt is perhaps the most important price order block level on the Bitcoin chart.\n\nIt has significance as major round number support.\n\nIt is at the intersection of Bitcoin’s electrical and production costs — the region where Bitcoin miners become unprofitable and the level historically representing a price floor.\n\nWhen Bitcoin collapsed below $20,000 in November 2022, it signified a failing of major technical support. It made most Bitcoin miners unprofitable and was the climax of fraud, collapse, bankruptcies and negative sentiment in the industry. We spent two months below $20,000 before a 40% short squeeze took us back above $21,000. From a technical perspective, this represented a clean deviation below major support and is a technical movement that often represents the start of a new trend in the opposite direction.\n\nWhen an asset price moves suddenly in one direction, then shortly after moves suddenly in the opposite direction, it’s the second move which tends to “stick” and generate a higher probability of a new trend. The probability of the second move being the correct move is significantly higher than that of the first move. That’s what makes deviation fakeout signals like this one so powerful — especially at such an important level like $20,000.\n\nCT: Scrutiny of exchange solvency appears to be fading compared to previous months. Is the FTX debacle behind us?\n\nCE: I believe so. The FTX situation was a massive outlier. It’s not often that you get a Bernie Madoff situation — a top three fraud of all time — occurring. People panicked and generally took the FTX situation out of perspective for what it was; the exceptional greed and immoral activities of one man, SBF.\n\nA lot of work has to be done in our industry as it scales; the SBF saga was a sad and unnecessary development but should not be taken out of context.\n\nWe are in a young burgeoning industry that is moving at lightning pace, and things tend to get broken along the way as we scale. Just like all new industries before it, and any tech startup stock price, it’s a rollercoaster ride. We can’t expect Bitcoin and crypto to take over the world of finance in a smooth straight line; volatility happens in price, and it also happens in broader operations with scale. Best practices take time to be learned in a new industry, and regulation takes even longer to catch up.\n\nA lot of fear, uncertainty and doubt (FUD) has been spread across the industry regarding various other platforms. In late 2022 this caused a bank run on most exchanges which was unwarranted and ultimately not an issue for these platforms which had full backing. Exchange risk can be monitored in real-time using on-chain data and this is one of the reasons Capriole saw the FTX collapse coming and avoided it. There simply were not anywhere near the same levels of obvious risk on other crypto platforms in late 2022.\n\nNonetheless, it is so important to prioritize risk management in everything you do in the crypto space. Risk management must come above all else. Distribution of assets across trusted sources is important. Learning about self-custody is important. Security is important. On-chain monitoring and reporting is important. If you can’t actively manage risk in this 24/7 industry, then there are professional, regulated hedge fund structures that can do that for you. Be sure to always do your due diligence in crypto.\n\nCT: Did the FTX episode strengthen or weaken Bitcoin or specific altcoins, if any?\n\nCE: The FTX episode weakened the institutional reputation of Bitcoin and crypto. Many institutions were burned. Large U.S. pension funds also lost money on FTX. It takes a long time for these types of entities to get into a new asset class like Bitcoin and crypto, and an event like this caused them to pull the hand brake on their investment activities as they wait for the seas to calm and regulators to respond.\n\nIt is a shame that it has temporarily slowed the movements of these larger players, which rely on quarterly board meetings to make such big decisions — but it is a great opportunity for the smaller investors and the more innovative and agile family offices.\n\n“In the wake of the FTX collapse, incredibly rare value was opened up for long-term investments in Bitcoin in particular.”\n\nFor anyone with a multiyear investment horizon, $16,000 should represent a great opportunity to allocate to this asset class based on the on-chain data we analyze. At Capriole, we were particularly excited by this, and doubled our own investment in our fund during this period. For the reasons noted above, $16–20,000 was a one-in-four-year valuation opportunity for Bitcoin, an incredibly rare opportunity to allocate into this asset class at great discounts across most on-chain valuation metrics.\n\nThe FTX collapse cleansed the market of leverage, bad actors, and an array of entities with poor risk management and operations. The market now has a clean slate to start the new halving cycle fresh and ready for organic growth. The institutions will come back; it’s only a matter of time when an industry is 10Xing its number of users every three years. We are seeing a strong uptick in savvy investors taking advantage of today’s opportunity.\n\nCT: What kind of impact will a ban of crypto staking service providers have on Bitcoin and Ethereum price?\n\nCE: It’s hard to say for sure and would depend on the extent of any ban. If there is a major sweeping regulatory action against staking, there will be a short-term price impact. But this fear, like most in crypto, is overweighted. There may be some regulations or restrictions in the area, but I expect the long-term impact will be negligible.\n\nLikely there will be more requirements on staking entities, including regulator data sharing, which in the short-term could reduce market size, but in the mid to long term this just moves the decision to stake to the individual user for that platform.\n\nAs we saw with the China ban on Bitcoin mining in 2021, Bitcoin (and crypto) is too big now for any one country to stop adoption. Bitcoin’s hash rate recovered from a 50% collapse in just one year. A staking ban would be harder to implement, would likely be less severe and much less impactful than the China ban.\n\nCT: What’s the possibility of this happening? Do you expect a general crackdown on crypto on-ramps on the horizon?\n\nCE: Exchanges are under the microscope. There will be more regulation and more reporting and communication requirements for exchanges globally. Many small exchanges won’t be able to meet these requirements and it will further consolidate the industry.\n\n“I expect all of the large players will ultimately comply.“\n\nIn November 2022, we saw how every major exchange implemented proof-of-reserves using on-chain data to verify Bitcoin holdings of customer assets in a matter of weeks. Sure, there are limitations in this reporting, but for so much of the industry to implement that globally and so fast shows just how quickly this industry moves, how most of us are here to do good and do the right thing. More needs to be done, and it will be. It’s just a matter of time and it’s part of the natural growth and adoption of an exponential age industry.\n\nCT: What are the biggest dangers to Bitcoin’s potential bull cycle?\n\nCE: The most obvious risk is if interest rates rise further, and substantially more, than expected. That would squeeze the relative value of Bitcoin. Assuming all else equal, higher interest rates increase the relative value of the dollar to a long-term investor, and arguably lessen the value of hard assets like gold and Bitcoin.\n\nHowever, we have been predicting for some time that rate rises will stop in 2023, and the broader market is pricing this in today too. The Fed is also now signaling to the market that the top for interest rates is in this year. The significant decline in inflation we are currently seeing has also historically marked the top for interest rates.\n\nRelated: Bitcoin eyes 25% of world’s wealth in new $10M BTC price prediction\n\nGiven we are late in the economic cycle, unemployment is at multi-decade lows and debt-to-GDP is extraordinarily high; it simply isn’t sustainable to keep interest rates at aggressively high levels today.\n\nAll of this skews the probability toward policy easing to support economic growth. Which means Bitcoin is positioned to be the perfect investment against easing a world with high debt and inflation. Much like the 1970s, but even more so today.\n\nCT: What are the biggest tailwinds for Bitcoin’s potential bull cycle?\n\nCE: In 2024, Bitcoin will become the hardest asset in the world with certainty. The inflation rate of Bitcoin will drop to half that of gold, overtaking gold as the best store of value. Not to mention the improved portability, speed and fungibility of Bitcoin in a digital world.\n\n“Every Bitcoin halving drives a narrative shift and heightened adoption curve for Bitcoin, and the 2024 cycle is probably the most important halving we will ever see. A transition point.“\n\nIt is worth mentioning that none of the prior halvings have ever been priced in, so I am expecting multi-hundred-percent returns to continue here as well.\n\nFurther, this decade we are entering the period where most technology adoption “s-curves” go vertical. That is, it takes roughly 10 years for new technologies to go from 0–10% adoption (where Bitcoin is today) and then another 10 years to go to full adoption.\n\nGiven Bitcoin usage is growing faster than the internet did in the late 90s, all signs point to the next decade being incredible for Bitcoin. The global macroeconomic backdrop also looks set to only support that adoption curve.\n\nCT: What are your favorite metrics to keep an eye on right now to anticipate the next market move?\n\nCE: Predicting short-term moves is a full-time job; we approach that with fully automated quant strategies at Capriole. For investors looking to allocate for multi-year periods, the best bet is to try and allocate at or near cyclical lows and reduce some exposure at cyclical highs.\n\nBitcoin still very much operates on a four-year cycle, driven by the four-year halvings. Therefore, you usually get roughly 12 months of great value to allocate into the market and 6–12 months to reduce risk.\n\n“It’s not about timing exact bottoms and tops — unless you are monitoring the market full time, don’t bother!”\n\nWhen you get a confluence of multiple long-term metrics, only metrics that have proven themselves to be reliable through years of usage (without modification), that is, when you have something useful to act on. Some I like are:\n\nHash ribbons (recently signaled a buy at $20K)\n\nNVT\n\nMarket value to realized value (MVRV)\n\nBitcoin production cost and electrical cost\n\nBitcoin energy value\n\nSLRV ribbons\n\nDormancy flow\n\nHold waves\n\nNet unrealized profit and loss (NUPL)\n\nYou can read more about each here.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmlndGhpbmsuY29tL25ldXJvcHN5Y2gvYml0Y29pbi1kYXJrLXBlcnNvbmFsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "\"Impulsive psychopaths\" are drawn to Bitcoin and other crypto - Big Think",
        "content": "Since the invention of Bitcoin in 2009 the global cryptocurrency market has grown from nothing to a value of around US$2 trillion. From a price of US$1 in 2011, Bitcoin rose to an all-time high of more than US$63,000 in April 2021, and now hovers around the US$42,000 mark.\n\nLarge fluctuations in cryptocurrency prices are common, which makes them a highly speculative investment. What kind of people are willing to take the risk, and what motivates them?\n\nWe conducted a survey to find out. In particular, we wanted to know about the relationship between the so-called “dark tetrad” personality traits and attitudes towards cryptocurrency.\n\nThe dark tetrad\n\nIn psychology, the “dark tetrad” refers to a group of four personality traits. These are Machiavellianism, narcissism, and psychopathy (together known as the “dark triad”), plus sadism.\n\nThey are called “dark” because of their “evil” qualities: extreme selfishness and taking advantage of others without empathy. The dark tetrad are also often related to risk-taking behaviours.\n\nThe appeal of cryptocurrency\n\nWe identified two main areas of appeal. First, the high risks and high potential returns of crypto trading make it attractive to the kind of people who like gambling.\n\nSecond, cryptocurrencies are not issued or backed by governments like traditional or “fiat” currencies. This makes them attractive to people who distrust government.\n\nWhat are the personalities of crypto buyers?\n\nWe asked 566 people to complete online personality surveys as well as answer questions about their attitudes to crypto and whether or not they planned to invest in it. Of our participants, 26% reported they own crypto and 64% showed interest in crypto investing.\n\nWe measured their dark tetrad traits using standard psychological tests. We also measured traits that might connect the dark tetrad to judgements about crypto: fear of missing out(FOMO; the feeling that others are experiencing better things than you are), positivity (the tendency to be positive or optimistic in life), and belief in conspiracy theories.\n\nWhy do people want to buy crypto? It’s not just about making money\n\nA common reason to invest in crypto is the hope of earning high returns. Beyond the desire to build wealth, our research shows dark personality traits also drive crypto buying.\n\nMachiavellianism is named after the Italian political philosophy of Niccolò Machiavelli. People who rate highly on this trait are good at deception and interpersonal manipulation.\n\nMachiavellians take a calculated approach to achieving goals, and avoid impulsive decisions. They are less likely to engage in problem gambling.\n\nMachiavellians also tend to believe strongly in government conspiracies. For example, they often believe politicians usually do not reveal their true motives, and that government agencies closely monitor all citizens.\n\nWe found Machiavellians like crypto primarily because they distrust politicians and government agencies. Many crypto supporters believe governments are corrupt, and crypto avoids government corruption.\n\nOverconfidence and positivity\n\nNarcissism is a self-centred personality trait, characterised by feelings of privilege and predominance over others. Narcissists are overconfident and are more willing to do things like make risky investments in the stock market and gamble.\n\nNarcissists tend to focus on the positive side of life. We found narcissists like crypto because of their great faith in the future, and because of their confidence their own lives will improve.\n\nImpulsive psychopaths like crypto\n\nPsychopathy is a callous, impulsive antisocial personality trait. Psychopathic people often find it difficult to perceive, understand, or address emotions due to a lack of emotional intelligence and empathy.\n\nThe reckless nature of psychopaths makes them more resistant to stress and anxiety. As a result, psychopaths like stimulation-seeking and risk-taking. They are prone to gambling and gambling addiction.\n\nWe found that impulsive psychopaths like crypto, because they fear missing out on investing rewards that others are experiencing.\n\nHow is sadism involved?\n\nEveryday sadism relates to a personality enjoying another’s suffering. Sadists often display aggression and cruel behaviours. For example, sadists troll others on the Internet for enjoyment.\n\nSubscribe for counterintuitive, surprising, and impactful stories delivered to your inbox every Thursday Notice: JavaScript is required for this content.\n\nAt first glance, buying crypto is unlikely to harm others. However, we found sadists like crypto because they do not want to miss out on investment rewards either. To them, perhaps both the pleasure from seeing another’s pain and the fear of missing out are related to selfishness.\n\nUnlike narcissists, we found both psychopaths and sadists lack positivity about their prospects, which cancels out their liking of crypto.\n\nDark tetrad personality traits influence positivity, conspiracy beliefs, and fear of missing out, which in turn influence attitudes to cryptocurrency. (Wes Mountain/The Conversation, CC BY-ND)\n\nA psychological lens\n\nStudying cryptocurrency through the psychological lens of the dark tetrad offers insight into why people want to buy crypto. We are not suggesting that everyone interested in crypto displays dark tetrad traits.\n\nWe studied only a subset of people interested in crypto who do have these traits. If you happen to be a Bitcoin or other crypto holder, you may or may not exhibit them.\n\nIf you want to know how you score for dark tetrad traits, you can do the Dark Triad Personality Test and Sadism Test online.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8yNC9jcnlwdG8tYmlsbGlvbmFpcmUtYmFua2Vycy1qYW1pZS1kaW1vbi1jaGFybGllLW11bmdlci1iaXRjb2luLWZpbmFuY2Utb21pZC1tYWxla2FuL9IBdmh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8yNC9jcnlwdG8tYmlsbGlvbmFpcmUtYmFua2Vycy1qYW1pZS1kaW1vbi1jaGFybGllLW11bmdlci1iaXRjb2luLWZpbmFuY2Utb21pZC1tYWxla2FuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "The crypto kids are onto something–and they shouldn’t listen to billionaire bankers like Jamie Dimon - Fortune",
        "content": "Over the past few months, a chorus of some of the world’s most powerful businessmen has been determined to scare the financial system into believing that crypto is dangerous. Jamie Dimon said, “Bitcoin itself is a hyped up fraud.” Jane Fraser opined, “If grandma is investing in crypto, we better have protections in place.” And Charlie Munger described it as “a gambling contract with a nearly 100% edge for the house.”\n\nThe loudest critics of the new asset class all seem to have one thing in common–they’re some of the biggest winners of the legacy financial system, and arguably have the most to lose if cryptocurrency becomes the norm.\n\nIf a record-holding athlete campaigns for a change in the rules that happens to make it harder for others to break that record—then we’d question their motives. It’s time to hold the affluent figures who oppose crypto to the same standard. At the same time, there are a number of myths that they keep trying to advance, which don’t hold up against the evidence.\n\nLet’s start with Charlie Munger, who is calling for America to follow China’s example and ban crypto. Munger is a billionaire whose wealth derives almost entirely from his shares in Berkshire Hathaway, itself a sophisticated investment vehicle. He and his business partner Warren Buffett (who said Bitcoin is “probably rat poison squared”) are the archetype of wealth created by America’s free and open capital markets.\n\nMunger, Dimon, and Fraser are beneficiaries of a system that relies on too-big-to-fail intermediaries like J.P. Morgan, run by Dimon, or Bank of America, a major Berkshire holding. That these intermediaries require government intervention once a decade is not considered controversial. Now, Munger wants America to suppress an entire asset class.\n\nCryptocurrencies are different. Users don’t need intermediaries to transact. In over a decade of operation, the Bitcoin system has never been down or needed a bailout. Unlike some of traditional finance’s biggest names, it has never made a mistake or defrauded millions of its own customers.\n\nIn his column, Munger compares crypto to a bet that’s guaranteed to lose, but Bitcoin has mostly appreciated over the years, as have other blue-chip coins. Long-term holders tolerate the volatility because it usually resolves to the upside. Other asset classes have also done well during the lifespan of crypto, but investments like real estate, fine art, and startup equity are not accessible to the general public. Even Berkshire Hathaway stock is only ownable by a select few given its high price.\n\nAnyone can own crypto in small amounts–and hundreds of millions of people all over the world do. Adoption is highest in places like Vietnam, Pakistan, and Nigeria, countries where the banking system is unreliable and the local currency inflationary. If your domestic currency is collapsing, then all a cryptocurrency needs to do is bounce around and you still benefit. Despite the overall decline in crypto prices in the past year, Bitcoin has still appreciated against the Argentine peso. Cryptocurrencies use technology to create property rights where they don’t exist.\n\nTo be fair, Omaha–where Berkshire Hathaway is headquartered–does not have these problems. But even in the U.S., crypto per capita adoption is highest with minorities. Maybe these communities still remember the discriminatory banking practices of the past or the lack of services in the present. According to official estimates, 40% of Black households in America remain unbanked or underbanked. That’s real rat poison–but don’t expect any op-eds from captains of industry proposing a solution. It’s Dogecoin that keeps them up at night.\n\nYes, there are scams and collapses in the crypto ecosystem, and it needs sensible regulation. But there are scams and collapses in every industry, particularly early on. Tellingly, no reasonable person ever proposes banning them. Imagine if we had banned tech stocks after the dot-com bubble, or bank stocks after the 2008 crisis.\n\nMunger says that “a cryptocurrency is not a currency, not a commodity, and not a security”–as if this proclamation proves something. If semantics were the basis for value, then English majors would be running Wall Street. Google was not a telephone company, not a postal service, and not a TV station when it first launched. Gmail and YouTube still took over.\n\nThings change, industries get disrupted and new asset classes arise. The sausage-making of building a new financial system is not pretty–but it’s a necessary condition of building something better. The billionaire bankers calling for the end of crypto shouldn’t be taken seriously. If anything, their over-the-top opposition proves the kids are onto something.\n\nOmid Malekan is an adjunct professor at Columbia Business School and the author of Re-Architecting Trust, the Curse of History and the Crypto Cure for Money, Markets and Platforms.\n\nThe opinions expressed in Fortune.com commentary pieces are solely the views of their authors and do not necessarily reflect the opinions and beliefs of Fortune.\n\nMore must-read commentary published by Fortune:"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LnRoZXJlZ2lzdGVyLmNvbS8yMDIzLzAyLzI0L2NyeXB0b2N1cnJlbmN5X21pbmluZ19zY2hvb2wv0gFIaHR0cHM6Ly93d3cudGhlcmVnaXN0ZXIuY29tL0FNUC8yMDIzLzAyLzI0L2NyeXB0b2N1cnJlbmN5X21pbmluZ19zY2hvb2wv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin mining rig found stashed in school crawlspace - The Register",
        "content": "Pics A Massachusetts man accused of using his job as a city's assistant facilities director to hide a cryptocurrency mining operation in the crawlspace of a school has surrendered himself to authorities on Friday morning after skipping his Thursday arraignment.\n\nA judge issued a default warrant for Nadeam Nahas' arrest yesterday on charges of fraudulent use of electricity and vandalizing a school, in relation with the cryptomining operation discovered under Cohasset Middle/High School in December, 2021. Nahas surrendered to authorities with his attorney this morning, the Norfolk District Attorney's office told The Register.\n\nBitcoin mining computers seized by Cohasset Police from the school\n\nThe mining setup was discovered by Nahas' boss when conducting a routine inspection of the school two years ago, Cohasset Police Chief William Quigley told us.\n\nThe director \"noticed electrical wires, temporary duct work, and numerous computers that seemed out of place. After researching and contacting the town IT director, it was learned that this was a cryptocurrency mining operation which was unlawfully attached to the school electrical system,\" Quigley said.\n\nThe crypto mining setup under a Massachusetts school\n\nCohasset police asked the US Coast Guard Investigative Services and Department of Homeland Security remove the machines safely and determine where they came from. After three months of investigation, and Nahas himself allegedly checking out the machines and denying he knew what they were, Cohasset detectives found probable cause to charge him of the aforementioned crimes. He resigned his position with the town in early 2022.\n\nDuctwork used as part of an illegal cryptocurrency mining operation discovered under a Massachusetts school\n\nAccording to Boston news station WCVB, Nahas is said to have operated his underground crypto mine for eight months before being discovered in December, racking up approximately $17,492 (£14,644) in electricity on the district's dime.\n\nStrike where the power's cheap - or just steal it\n\nBitcoin mining requires a lot of power and a recent claimed it uses as much electricity as nation states like The Philippines.\n\nThat said, mining Bitcoin or other cryptocurrencies can be profitable if you do it in a state where energy is cheap. Massachusetts is decidedly not one of those states, according to a 2021 map of average US retail electrical prices.\n\nElectricity prices as of January 2023 show the New England region and Boston, Massachusetts, specifically, to still be considerably higher than the national average.\n\nAfter entering a plea of not guilty, Nahas was released on the condition the he stay away from all public buildings in the town, as requested by Norfolk assistant DA Mark Assad, his office told us.\n\nNahas is due back in court in May for pretrial hearings. If convicted, he faces up to two years in prison. ®"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2EzYjU5ZjNiLWQwYjMtNDA0Ny1hZjcxLWM4ZWY2MWFhOGQ1ONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "The two sides of crypto in Ukraine war - Financial Times",
        "content": "Print this page\n\nHello and welcome to the latest edition of the FT’s Cryptofinance newsletter. One year on from Russia’s invasion of Ukraine, we’re looking at the role crypto has played in the conflict\n\nCrypto’s impact on geopolitical issues does not often make for uplifting reading. The US, for example, fears digital assets can offer actors under sanctions a fresh means of skirting the financial system.\n\nBut the war in Ukraine has showed that the use of crypto in international affairs is far more nuanced and complicated. Blockchain data analytics company Elliptic shared data with the FT showing private crypto fundraising for pro-Ukrainian causes has outpaced Russian equivalents by a rate of 44 to one in the last year.\n\nIn total, more than $200mn worth of crypto has made its way to what have been described as pro-Ukraine causes. Over $80mn worth of these funds was sent directly to the Ukrainian government.\n\nJust weeks after the invasion, a Ukrainian politician said crypto had helped supply its armed forces with supplies including bulletproof vests, helmets and walkie talkies. Other funds turned to humanitarian causes, and even journalism and intelligence efforts.\n\nNot only do these funds eclipse the less than $5mn sent to pro-Russian entities, it represents at least one-fifth of overall non-state-mandated aid to Ukraine, marking the first time in history crypto has played a significant role in a major conflict.\n\n“Ukraine bet big on crypto by offering donation addresses literally hours after the invasion, and it did pay off,” said an Elliptic analyst who spoke to me on the condition of anonymity. “Twenty per cent of grassroots funds coming from crypto is no small feat,” they added.\n\nIf you have subscribed to this newsletter for some time, you’ll recall only a few weeks ago I questioned crypto’s utility as a force for good, as hard-to-spend crypto tokens poured into Turkey and Syria in the days after the region’s tragic earthquake. But in Ukraine, crypto has shown to have some social utility.\n\nSo can crypto claim to be a force for legitimate good? Possibly but as crypto fans also say, the technology is neutral and can be used in a multitude of ways.\n\nOf the near-$5mn worth of crypto donated to pro-Russian entities, more than half of those funds were dedicated to military fundraising, and most originated from exchanges and mixing services — a particular slice of crypto technology to have raised the ire of western governments in recent months.\n\nThese groups often provide spending reports on messaging platform Telegram. Elliptic estimates that MOO “Veche” — a military fundraising group active in the Donbas — has received roughly $1.8mn in bitcoin, which would make it the wealthiest pro-Russian fundraising group by crypto holdings.\n\nA collection of supplies donated by MOO “Veche” © Elliptic\n\nElliptic’s research also highlights one “particularly brutal” use for cryptocurrency that traces to Rusich, a paramilitary fighting group known for neo-Nazi symbolism. The organisation — also linked to the Wagner Group — has been involved in military campaigns in Syria and Ukraine.\n\nIn Rusich-affiliated Telegram channels, wallet addresses have been shared widely soliciting crypto donations. Those wallets have had sanctions imposed by the US Office of Foreign Assets Control, but in addition the paramilitary group has tried to extort the families of lost loved ones by promising co-ordinates of their dead relatives in exchange for bitcoin.\n\n“If you can’t identify the bodies of those killed, don’t just give them away. Take the coordinates of the exact burial place . . . and offer relatives the details for $2,000 — $5,000. Money can be transferred to your bitcoin wallet.”\n\nAnother caveat that might subdue crypto’s evangelists is that while Ukrainian donations have far outpaced those of Russian fundraising, the pace of donations has slowed markedly.\n\nElliptic estimates that much of the $200mn-plus donated to Ukraine was sent in the immediate aftermath of Russia’s invasion. After March 2022, the rate of Ukrainian donations declined. In contrast, Russian crypto fundraising shows no signs of subsiding.\n\n“That’s why a lot of virtual asset services can’t afford to be complacent about this, because while Ukraine funds have fallen, Russia is much more stable in terms of funds flowing in,” the Elliptic analyst added.\n\nBefore Christmas, one Ukrainian politician told me Russian use of crypto was set to become a “huge issue”. If Russian crypto fundraising doesn’t slow down in the coming months, he might be right.\n\nWhat’s your take on crypto’s role on a global scale? As always, send me your thoughts at scott.chipolina@ft.com.\n\nWeekly highlights:\n\nThe Federal Reserve issued a joint statement with the Federal Deposit Insurance Corporation and the Office of the Comptroller of the Currency highlighting liquidity risks to banks from some sources of funding in crypto markets. It is the latest slice of evidence that US agencies are leaning heavily on US banks to divorce themselves from crypto, a lesson some banks such as Silvergate have learned the hard way.\n\nLife got worse for Sam Bankman-Fried this week when US prosecutors widened their criminal case against the former FTX chief. Thursday’s updated indictment added charges including securities fraud and conspiracy to commit bank fraud, bringing an already long charge sheet to 12. SBF’s political donations also came under the spotlight, described as being “made in the names of others in order to obscure the true source of the money and evade federal election law”.\n\nHong Kong put more detail on its plan to attract more crypto business into the territory by letting retail investors trade coins.\n\nThe Securities and Exchange Commission issued a fresh bid to oppose Binance US’s proposed $1bn acquisition of the assets belonging to Voyager Digital, the collapsed crypto lender from last summer. The SEC said the rescue package may violate securities law. I teamed up with my editor Philip Stafford for the story, which you can read here.\n\nSoundbite of the week: Crypto’s lost battle\n\nAgustín Carstens, head of the Bank for International Settlements, said it was time for crypto to admit defeat over one of its deepest-held beliefs: that it is a viable medium of exchange that rivals fiat currencies.\n\n“A few years ago crypto assets and cryptocurrencies were in a way put as an alternative to fiat money, I think that battle has been won, technology doesn’t make for trusted money.”\n\nMike Novogratz — a man who has a tattoo of failed stablecoin Luna — thought he would try to school the BIS head. Read his response here.\n\nMike Novogratz’s Luna tattoo © Mike Novogratz\n\nData mining: Tether’s dominance grows\n\nTether’s stablecoin has long been established as the largest on the crypto market, but scrutiny over its reserves and the growth of rival tokens undermined its dominance in recent months.\n\nNew York’s recent action against BUSD — the third-biggest stablecoin and thus a chief Tether rival — has reshaped the market again.\n\nSince regulators in the state ordered Paxos to stop issuing fresh BUSD tokens, the Binance-branded coin has lost billions in market share.\n\nBy contrast Tether’s USDT is now more than half of the market and has its highest share since October 2021, data provider CryptoCompare found."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGVjcnlwdC5jby8xMjIxMjgvYml0Y29pbi1kaXBzLWluZmxhdGlvbi1yYXR0bGVzLW1hcmtldNIBRWh0dHBzOi8vZGVjcnlwdC5jby8xMjIxMjgvYml0Y29pbi1kaXBzLWluZmxhdGlvbi1yYXR0bGVzLW1hcmtldD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Dips After Key Inflation Indicator Rattles Market - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin dropped sharply on Friday—dragging the rest of the digital asset market with it—after key inflation data came in and seemingly rattled investors.\n\nThe biggest cryptocurrency is currently down 3% in 24 hours, trading for $23,070, CoinGecko data shows. Just last week, it broke above $25,000 per coin for the first time in eight months.\n\nMost other cryptocurrencies have also taken a hit: Ethereum has shed 3.1% in the past day, trading hands for $$1,593; Dogecoin is now priced at $0.082—a 3.3% 24-hour drop.\n\nAD\n\nAD\n\nCryptocurrency is following the U.S. equities market today as it typically does. Investors shifted “risk-on” assets like stocks and digital assets after key inflation data came in on Friday and showed that more interest rate hikes by the U.S. Federal Reserve could be coming.\n\nCoinShares Head of Research James Butterfill told Decrypt that the sudden dip in crypto prices was the “direct result of macro data from the U.S.,” adding that “investors expect a more hawkish Fed.”\n\nFriday’s report showed that inflation in the world’s biggest economy increased: the personal consumption expenditures price index rose 5.4% from last year and the core metric was up 4.7%.\n\nEquities investors reacted by selling: the Dow Jones Industrial Average fell by 390 points, or 1.2%, while the S&P 500 dipped 1.6% and Nasdaq Composite by 2%.\n\nBitcoin is doing nothing new: the volatile asset has followed other volatile assets like tech stocks whenever there are signs the Fed might remain hawkish with its aggressive monetary policy.\n\nAD\n\nAD\n\nThe Fed started raising interest rates last year in an urgent attempt to tame 40-year high inflation in the U.S. It hiked rates by 75 basis points four times, and then slowed down by upping them by 50 basis points.\n\nMost recently, the central bank has slowed down to 25 basis points—but Fed Chairman Jerome Powell has repeatedly said that the road ahead to get inflation down will be bumpy.\n\nInvestors tend to avoid “risk” like Bitcoin and instead plug money into “safe-haven” assets like the U.S. dollar—which is up today: the dollar index jumped 0.5% Friday, its highest in nearly two months."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9uLWNoYWluLWRhdGEtaGlnaGxpZ2h0cy1rZXktc2ltaWxhcml0aWVzLWJldHdlZW4tdGhlLTIwMTktYW5kLTIwMjMtYnRjLXByaWNlLXJhbGx50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin on-chain data highlights key similarities between the 2019 and 2023 BTC price rally - Cointelegraph",
        "content": "Bitcoin’s (BTC) recent price rally from $16,500 to $25,000 can be attributed to a short squeeze in the futures market and recent macroeconomic improvements. However, while prices increased, data suggests many interested buyers (including whales) were left on the sidelines.\n\nThe recent rally to $25,000 shared many similarities with the 2019 bear market rally, which saw a 330% surge in Bitcoin’s price to highs around $14,000 from the November 2019 low of $3,250. The BTC/USD pair recently rose 60% from its November 2022 low.\n\nOn-chain and market indicators relative to the 2019 rally send mixed signals on whether or not Bitcoin’s rally will continue. Nevertheless, there are strong reasons to believe that the market has reached a crucial turning point where it can either turn into a full-fledged bull market or slump back into a long-term bear trend.\n\nLet’s look at the top five indicators to understand the current price dynamic relative to the 2019 bull run.\n\nBitcoin tackles historical trading levels\n\nBitcoin’s price surpassed the 200-day moving average (MA) at $19,600, which could encourage paper traders looking to open a long position. Historically, this metric has acted as a bull-bear pivot line, with breakouts above it being bullish and vice versa.\n\nBTC/USD usually retests the 200-day MA on a breakout, which raises the possibility of a correction toward $19,500. However, this was not the case in 2019, when the price continued rising without a pullback to the 200-day MA.\n\nBTC/USD daily price chart with 200-day MA metric. Source: TradingView\n\nAt the same time, traders are likely paying attention to the 200-week moving average at $25,100. Bitcoin price had never dropped below the 200-week MA until November 2022, and reclaiming this level could encourage technical buyers to join the bandwagon.\n\nHowever, until a breakout happens, traders might continue to stay on the sidelines. The funding rates for perpetual swap contracts are currently neutral, suggesting that traders are waiting for confirmation.\n\nCrypto Twitter trader, Immortal, found the market is only at the “halfway point” considering the duration of the current rally compared to the one in 2019. The 2019 rally lasted 193 days from bottom to top, while only 92 days have passed since the bottom on Nov. 9, 2023.\n\nComparing the time from the bottom to local top in 2019 and 2023. Source: Twitter\n\nImmortal says that if the 2019 timeline fractal holds true in 2023, BTC/USD could surge as high as $46,000 by March.\n\nA stablecoin supply ratio oscillator is close to the 2019 top\n\nBitcoin’s stablecoin supply ratio (SSR) oscillator gauges the market’s buying power. The indicator measures the ratio between Bitcoin’s market capitalization and stablecoin supply. Low readings on the SSR oscillator indicate higher purchasing power of stablecoins. Conversely, a spike in the metric indicates overbought conditions.\n\nBitcoin’s price surge in February 2023 saw the SSR oscillator spike toward levels not seen since 2019 and 2021. The indicator suggests that the positive trend might end soon. There is a slight chance of one last push higher toward the $30,000 psychological level.\n\nHowever, the data could be taken with a grain of salt because of the regulatory crackdown on the Binance USD (BUSD) stablecoin, which caused a significant decline in supply. It might have skewed the SSR oscillator to show overbought conditions.\n\nBitcoin’s stablecoin supply ratio (SSR) oscillator. Source: Glassnode\n\nOne of the biggest concerns of the current surge is the absence of whale buying. Contrary to 2019, the whales have sold in the present rally. The divergence between the number of whales and the price raises concerns about the sustainability of the positive trend.\n\nNumber of BTC addresses with balance more than or equal to 1,000. Source: Glassnode\n\nData highlights a crucial bull-bear pivotal point\n\nInvestors add to their winning positions on pullbacks in an uptrend, indicated when the spent output profit ratio (SOPR) indicator stays above one. The opposite happens in a downtrend where bears dominate the market by selling into rallies. A crossover of the metric above one is a potential trend reversal signal.\n\nGlassnode’s 7-day moving average of the adjusted SOPR indicator shows that the bear trend has likely reversed. The indicator turned bullish when BTC broke out above $20,800 in January 2023. The metric retested the pivotal support level with Bitcoin’s price at $21,800, making it a crucial support level for a sustained uptrend.\n\nRelated: Bitcoin faces do-or-die weekly, monthly close with macro bull trend at stake\n\n7-day MA of Bitcoin’s adjusted SOPR indicator. Source: Glassnode\n\nSimilarly, the price has moved above the average buying levels of both short and long-term holders, which is another signal of a potential trend reversal. This could indicate that the market has reached a crucial turning point as the on-chain oscillators return to equilibrium.\n\nThe metrics also hint that a potential bull trend appears likely while the price holds above support at $21,800, $20,800 and $19,600.\n\nA weekly close above $25,100 could encourage derivatives and technical traders to buy into the current rally, but there are some warning signs that the market might be reaching overheated conditions and a quick correction toward lower support levels cannot be ruled out.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI0L2JpdGNvaW4tZnV0dXJlcy1vbi1jbWUtdHJhZGUtYXQtaGlnaGVzdC1wcmVtaXVtLXNpbmNlLW5vdmVtYmVyLTIwMjEtYmluYW5jZS1mdXR1cmVzLWxhZy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8yNC9iaXRjb2luLWZ1dHVyZXMtb24tY21lLXRyYWRlLWF0LWhpZ2hlc3QtcHJlbWl1bS1zaW5jZS1ub3ZlbWJlci0yMDIxLWJpbmFuY2UtZnV0dXJlcy1sYWcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Futures on CME Outpace Those on Binance to Trade at Widest Premium Since November 2021 - CoinDesk",
        "content": "Looking forward, a continued move higher in the premium may see carry traders return to the market. The cash-and-carry arbitrage involves buying bitcoin in the spot market and simultaneously selling futures contracts in a bid to pocket the premium. Carry trading was quite popular during the bull run when premiums reached as high as 40% on offshore exchanges."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXJldGlyZW1lbnQtcGxhbnMtZWxpY2l0LWNhdXRpb24tZnJvbS1yZWd1bGF0b3Jz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin retirement plans elicit caution from regulators - Cointelegraph",
        "content": "Even as the crypto market continues to forge an impressive recovery from the 2022 bear market, the industry continues to attract the wrath of regulators worldwide, especially in the United States. Three U.S. financial watchdogs recently issued stern warnings to individuals looking to invest in retirement funds offering exposure to digital assets.\n\nThe U.S. Securities and Exchange Commission’s (SEC) Office of Investor Education and Advocacy, the North American Securities Administrators Association and the Financial Industry Regulatory Authority (FINRA) warned investors that individual retirement accounts (IRAs) that include cryptocurrencies could potentially be classified as “securities,” unless they are registered with the SEC or have a valid exemption certificate.\n\nMoreover, in the past year, many policymakers have continued to aim at cryptocurrency investment vehicles, such as retirement accounts, citing the string of insolvencies witnessed last year. For example, New York Attorney General Letitia James has repeatedly called for a ban on all crypto-inclusive contribution plans and IRAs.\n\nRegulators are understandably cautious, with one Canadian teacher’s pension fund, the Ontario Teacher’s Pension Plan, taking a $95 million loss on its substantial stake in the FTX crypto exchange.\n\nHowever, some prominent crypto proponents in the U.S. Senate, like Wyoming Senator Cynthia Lummis, believe that Bitcoin (BTC) should be a part of 401(k) retirement packages.\n\nAre crypto retirement funds a good idea?\n\nTo better understand whether including cryptocurrencies in pension funds makes investment sense, Cointelegraph reached out to Ilan Sterk, CEO of Altshuler Shaham Horizon — an Israeli cryptocurrency custody and trading provider — one of the few crypto firms in the country approved to deal with banks.\n\nAccording to Sterk, minimal exposure to digital assets can be a good fit for long-term retirement-centric investments. He added, “For pensioners, an investment portfolio can be allocated between various assets like securities, bonds, hedge funds, digital assets and private equity. Blockchain and digital assets are considered a relatively new field but with high utilization and a wide ecosystem, so allocating a conservative portion to such investments might be fruitful.”\n\nRecent: SEC vs. Kraken: A one-off or opening salvo in an assault on crypto?\n\nThat said, he does agree with the warnings issued by the SEC and FINRA, especially since they pertain to retirement accounts containing the hard-earned savings of many people. Sterk said that crypto is a “very volatile investment for a retirement account” and, therefore, people investing in such offerings should take the time to understand the inherent risks associated with digital assets. He added:\n\n“I believe that regulators are crucial to organizing new investment fields like digital assets as well as for laying out clear guidelines, especially for pension accounts, so investors won’t find themselves penniless upon reaching retirement.”\n\nIn 2021, the Israeli Capital Market, Insurance and Savings Authority published similar guidelines for local institutions — including provident funds and pension funds — telling institutions that should they decide to invest in Bitcoin, they must detail and explain their decision to the regulatory body.\n\nExtreme volatility of crypto\n\nWade Wang, the founder and CEO of Safeheron — a digital asset self-custody provider that recently integrated its multi-party computation multisignature security solution with MetaMask — told Cointelegraph that it is “not recommended” that retirement funds seeking long-term returns be exposed to cryptocurrencies, at least in the near future. He added:\n\n“Investing in digital assets comes with high uncertainty and severe volatility. So far, any coins or tokens within the crypto landscape are circulated within their own individual markets. The circulation between these different ecosystems, especially traditional ones like pension funds, requires considerably greater development.”\n\nWang highlighted that crypto should not be viewed differently from other investment forms. As the industry matures and novel Web3 applications emerge, many traditional funds — including family offices and retirement funds — will continue to eye digital assets.\n\nZoomers wants crypto in their retirement funds\n\nAccording to a survey conducted by U.S. asset manager Charles Schwab during Q4 2022, almost 50% of zoomers and millennials want to see crypto become a part of their 401(k) retirement plans. Millennials were born in the early 1980s to mid-1990s, while zoomers were born in the mid to late 1990s and early 2010s.\n\nAnalysts for Charles Schwab found that 46% of zoomers and 45% of millennials would like to invest in cryptocurrencies as part of their retirement plans. Moreover, the survey found 43% of zoomers and 47% of millennials had already put a portion of their savings into digital assets outside their retirement plans.\n\nYounger investors want a wider range of investment choices, like cryptcurrencies. Source: Charles Schwab\n\nThese results lay in stark contrast to another survey conducted by the investment manager, which found that just 31% of Gen X’ers and 11% of boomers — those born anywhere between the mid-1940s to late 1970s — were keen on investing in digital currencies through their 401(k) retirement plans.\n\nBill to remove roadblocks\n\nOn Feb. 15, Alabama Senator Tommy Tuberville announced he would reintroduce the Financial Freedom Act to allow American 401(k) retirement plans to gain cryptocurrency exposure. The bill, first tabled in the Senate in May 2022, seeks to reverse a policy from the U.S. Department of Labor (DOL) directing the type of investments allowed in 401(k) plans, including crypto.\n\nIn Tuberville’s words, the bill seeks to prevent the DOL from pursuing enforcement actions for individuals utilizing brokerage windows to invest in digital assets. “The federal government shouldn’t choose winners and losers in the investment game. My bill ensures that everyone who earns a paycheck has the financial freedom to invest in their futures however they see fit,” Tubernille added.\n\nThe bill’s co-sponsors include several prominent pro-crypto senators, including Cynthia Lummis, Rick Scott and Mike Braun. In a December 2022 interview, Senator Lummis stated that despite the recent market meltdown, she is still quite comfortable with the idea of Americans incorporating Bitcoin into their pension funds.\n\nRecent: DeFi security: How trustless bridges can help protect users\n\nSimilarly, on Feb. 14, Florida Representative Byron Donalds said he wanted to table a bill similar to Tuberville’s in the House of Representatives. Both Donalds and Tuberville are likely to face stiff resistance from members of the Democratic party, as Senator Elizabeth Warren has repeatedly expressed her concerns about crypto being included in 401(k) plans. Senator Roger Marshall also shares a similar stance.\n\nWhat lies ahead?\n\nSince the beginning of 2022, the DOL has warned pension fund owners about crypto, asking them to exercise extreme caution when dealing with cryptocurrencies, citing the risk of fraud, theft and loss of funds. Other regulators have also adopted similar stances across the globe. As crypto adoption grows, time will tell how legislators come to view this novel asset class, especially from a long-term investment perspective."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW5vZGUtY29ubmVjdGlvbi1zaHV0cy1kb3duLWJsdWV3YWxsZXQtdXNlcnMtdXJnZWQtdG8td2l0aGRyYXctZnVuZHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin node connection shuts down: BlueWallet users urged to withdraw funds - Cointelegraph",
        "content": "BlueWallet is sunsetting its lightning node connection to Lndhub, according to an official statement. BlueWallet will cease custodial lightning operations, meaning that BlueWallet users of the Bitcoin (BTC) Lightning Network must connect to nodes to continue using BlueWallet lighting services.\n\nWhat does BlueWallet sunsetting LndHub mean for you?\n\n\n\n- If you use BlueWallet for on-chain bitcoin: ✅ nothing\n\n- If you use other LndHub services (like LightningTipBot, LNbits, Alby): ✅ nothing\n\n- If you use the Lightning account hosted by them: ⚡️ Move your sats out\n\n\n\nRead on — calle ⚡️ (@callebtc) February 23, 2023\n\nCalle, a lightning developer who tweeted about the change, told Cointelegraph:\n\n“The most important thing is that people don’t panic and suddenly noobs move out their on-chain funds or wrong lightning balances.”\n\nThe Lightning Network is a layer-2 payment solution built upon Bitcoin. The Lightning Network is used to send small amounts of Bitcoin around, called satoshis or sats, often using a lightning wallet.\n\nBlue Wallet is a popular Lightning Network wallet with over 42 BTC ($1 million) liquidity. Its largest channel has a 4 BTC ($95,000) capacity, according to data from Amboss. BlueWallet is a popular lightning wallet, often recommended by well-known Bitcoiners.\n\nCalle continued, “It’s important to realize that lndhub is a protocol that helps you connect wallets to accounts. The wallet (in this case) is BlueWallet but other wallets also support LndHub (like Alby or Zeus).”\n\n“The account is shutting down, not LndHub or Bluewallet itself. The account here is hosted by the BlueWallet team and they don’t want to do this anymore.”\n\nWhile users will still be able to withdraw their sats, creating new or refilling existing lightning wallets on the LndHub node will no longer be possible. BlueWallet publicly stated that users with sats connected to BlueWallet’s lightning node, they should move them as soon as possible.\n\nBlueWallet’s website advises to “keep the amount [of Bitcoin] low” for using the Lightning Network, as it’s “experimental.“ Source: bluewallet.io/lightning\n\nThe service will be shut down on April 30th, so it is crucial that BlueWallet users move their sats to another service or wallet of their choice. However, regular Bitcoin wallets are not affected by this change.\n\nRelated: Bitcoin Lightning Network growth is organic, coming from real-world adoption\n\nWhile some may view the change as a thorn in the side of Lightning Network adoption, it is important to note that BlueWallet will “only support self-custody solutions,” according to the website. The change seeks to promote decentralized solutions and self-custody.\n\nDisclaimer: Cointelegraph reached out to BlueWallet for comment. BlueWallet said to check the blog post on BlueWallet’s website."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNvbnRpbnVlcy10by1mYWxsLWJ1dC1kZXJpdmF0aXZlcy1kYXRhLWhpbnRzLWF0LWEtc2hvcnQtdGVybS1yYWxseS10by0yNWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price continues to fall, but derivatives data hints at a short-term rally to $25K - Cointelegraph",
        "content": "It’s possible that many people have already forgotten that Bitcoin’s (BTC) price closed 2022 at $16,529 and the recent rebound and rejection at the $25,000 level could raise concern among certain investors. Bears are pushing back at the $25,000 level and there has been multiple failed attempts at the level between Feb. 16 and Feb. 21. Currently, it looks like the $23,500 resistance is continuing to gain strength with every retest.\n\nPinpointing the rationale behind Bitcoin’s 45.5% year-to-date gain is not apparent, but part of it comes from the United States Federal Reserve’s inability to curb inflation while raising interest rates to its highest level in 15 years. The unintended consequence is higher government debt repayments and this adds further pressure to the budget deficit.\n\nIt’s virtually impossible to predict when the Fed will change its stance, but as the debt to gross domestic product ratio surpasses 128, it should not take longer than 18 months. At some point, the value of the U.S. dollar itself could become endangered due to extreme debt leverage.\n\nOn Feb. 23, the Fed, the Federal Deposit Insurance Corporation and the Office of the Comptroller of the Currency issued a joint statement encouraging U.S. banks that rely on funding from the crypto sector to prevent liquidity runs by maintaining strong risk management practices. Regulators said the report was spurred by “recent events” in the industry due to increased volatility risks.\n\nLet's look at derivatives metrics to better understand how professional traders are positioned in the current market conditions.\n\nBitcoin margined longs were used to defend the $24,000 level\n\nMargin markets provide insight into how professional traders are positioned because it allows investors to borrow cryptocurrency to leverage their positions.\n\nFor example, one can increase exposure by borrowing stablecoins to buy (long) Bitcoin. On the other hand, Bitcoin borrowers can only bet against (short) the cryptocurrency. Unlike futures contracts, the balance between margin longs and shorts isn’t always matched.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe above chart shows that OKX traders' margin lending ratio increased between Feb. 21 and Feb. 23, signaling that professional traders added leverage long positions as Bitcoin price broke below $24,000.\n\nOne might argue that the excessive demand for bullish margin positioning seems a desperate move after the failed attempt to break the $25,000 resistance on Feb. 21. However, the unusually high stablecoin/BTC margin lending ratio tends to normalize after traders deposit additional collateral after a few days.\n\nOptions traders are more confident with downside risks\n\nTraders should also analyze options markets to understand whether the recent rally has caused investors to become more risk-averse. The 25% delta skew is a telling sign whenever arbitrage desks and market makers overcharge for upside or downside protection.\n\nThe indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put options premium is higher than risk call options.\n\nIn short, the skew metric will move above 10% if traders fear a Bitcoin price crash. On the other hand, generalized excitement reflects a negative 10% skew.\n\nRelated: IMF exec board endorses crypto policy framework, including no crypto as legal tender\n\nBitcoin 30-day options 25% delta skew: Source: Laevitas\n\nNotice that the 25% delta skew shifted slightly negative since Feb. 18 after option traders became more confident and the $23,500 support strengthened. A skew reading at -5% denotes a balanced demand between bullish and bearish option instruments.\n\nDerivatives data paints an unusual combination of excessive margin demand for longs and a neutral risk assessment from options traders. Yet, there is nothing concerning about it as long as the stablecoin/BTC ratio returns to levels below 30 in the coming days.\n\nConsidering regulators have been applying enormous pressure on the crypto sector, Bitcoin derivatives are holding up nicely. For example, on Feb. 22, the Bank for International Settlements general manager Agustín Carstens emphasized the need for regulation and risk management in the crypto space. The limited impact of the BIS statement on the price is a bullish sign and it possibly increases the odds of Bitcoin price breaking above $25,000 in the short-term.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibG9jay1zLXE0LWJpdGNvaW4tcmV2ZW51ZS1kb3duLTctb24tY3J5cHRvLXByaWNlLWRlY2xpbmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Block's Q4 Bitcoin revenue down 7% on crypto price decline - Cointelegraph",
        "content": "Jack Dorsey’s payment company Block Inc. reported $1.83 billion of Bitcoin (BTC) revenue from its Cash App business unit in the fourth quarter, representing a 7% fall from the same time last year.\n\nIn its Q4 and full-year results announced on Feb. 23, Block attributed the fall in Bitcoin revenue to the decline in BTC price in the year. Bitcoin fell approximately 65% throughout 2022.\n\nThis fall in revenue led to a 25% year-on-year drop in Bitcoin gross profit for Cash App, which fell to $35 million in the quarter.\n\nCash App is a mobile phone payment processing app created by Block, which added support for transactions via the Bitcoin Lightning Network on Oct. 25. It generates Bitcoin revenue by selling Bitcoin to customers through the app.\n\nCash App gross profit graph from Q4, 2021 to Q4, 2022 Source: Block Inc Q4 shareholder letter\n\nFor the full 2022 year, Cash App generated $7.11 billion of Bitcoin revenue and $156 million of Bitcoin gross profit, down 29% and 28% compared to 2021, respectively.\n\nMeanwhile, Block Inc. reported a widened net loss of $114 million for the quarter compared to a loss of $77 million in 2021. Its adjusted earnings before interest, tax, depreciation and amortization (EBITDA) increased 53% to $281 million compared to the same time last year. Total revenue in the quarter was $4.65 billion.\n\nRelated: Bitcoin bears attempt to pin BTC price under $23K ahead of this month’s options expiry\n\nThe share price of Block jumped in after-hours trading following the earnings report.\n\nBlock Inc. (SQ) share price action over the last day. Source: Barron’s\n\nSome analysts have attributed the jump to the firm’s gross profit growth, which was up 40% in Q4 compared to the prior year, and also beat analyst expectations."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmJpdGNvaW5tYXJrZXRqb3VybmFsLmNvbS9ob3ctdG8tcmVhZC1jcnlwdG8tZmluYW5jaWFsLXN0YXRlbWVudHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "How to Read Crypto Financial Statements - Bitcoin Market Journal",
        "content": "Summary: I talk about the mental game of investing, particularly as it applies to crypto markets. Subscribe here and follow me to get weekly updates.\n\nThis week, Token Terminal released one of the greatest crypto products I’ve seen in years: crypto financial statements. (See them here.)\n\nThe idea of creating crypto financial statements may have started with James Wang, who created one for Ethereum in Q1 2021. It was a clever concept: public companies are required to disclose their quarterly financials; why not do the same thing for crypto “companies”?\n\nSince blockchain technology is transparent, these financial statements would be much better than those of traditional companies. They wouldn’t be prepared by an in-house financial team, shrouded in secrecy, and released weeks later. They would be available to anyone, instantly.\n\nNow, Token Terminal has taken this one better: they’ve automated them.\n\nThe SEC, which prides itself on requiring clear and transparent financial information for investors, should be praising this latest development. This is so much better than the way it’s done with public companies.\n\nI’ve been geeking out over these reports all week. As a long-term crypto investor, these financial statements are like a secret weapon. It cuts through the hype and the headlines, and gives you the cold, hard facts about any crypto project they have listed (currently about 150).\n\nThe best part? The product is completely free.\n\nToday I’ll show you how to read crypto financial statements, and some of the quick numbers you can pull to see whether a crypto investment might be worth your hard-earned money.\n\nUnderstanding the Income Statement\n\nFirst, a caveat: Token Terminal needs to work on their token terminology.\n\nIf you’re used to reading traditional income statements, you’ll have to wrap your head around these confusing names, so I’ll break them down.\n\nWhat they call “fees” is like a traditional company’s “revenue.” As every crypto investor knows, you have to pay fees to use crypto products. These fees are the money the crypto company takes in – like revenues of a traditional company.\n\n“Supply-side fees” are the share of these fees that go to the miners or validators: the ones who maintain the network. In a traditional company, this might be like your salaries paid to employees, or what you pay to make the product (also known as Cost of Goods Sold, or COGS).\n\nWhat they call “Revenue” is transaction fees that are paid to token holders, or (in some cases) tokens that are burned. Think of this more like “dividends” and “stock buybacks”: it’s revenue that’s benefiting the “shareholders” or “owners” (i.e., those who hold the token).\n\n“Token incentives” are “extra rewards” paid to users to get them to use the product. Compound, for example, pays COMP tokens to lenders and borrowers. This encourages usage of the product, but continually dilutes the value of COMP for everyone else. This is a useful metric, and I don’t think there’s a public-company equivalent: it would be like if Uber paid stock to get you to use their product in the early days. (More info here.)\n\nFinally, what they call “Earnings” are the aforementioned “Revenue” minus “Token incentives.” (Or value that accrues to shareholders, minus value that is taken away.) Earnings is incredibly valuable, even if it’s confusingly-named, because it tells you whether owners/shareholders are gaining value or losing it.\n\nHere’s a quick reference guide:\n\nTerm What it is Public-company equivalent Fees Money taken in from users of the product Revenue Supply-side fees Fees that go to miners or validators Salaries, COGS Revenue Value that is passed to token holders (fee-sharing or token burning) Dividends, stock buybacks Token incentives Free tokens given to users for using the product Discounts, rebates (but paid by issuing new shares) Earnings Token incentives minus earnings Share dilution (or buyback)\n\nLet’s take a few real-life examples, and the “story” that you can tell from each. To tell the story, we read the statements from right to left, or past to present.\n\nBitcoin Income Statement\n\nThe story: Fewer people are using the bitcoin network over the last few quarters ($30 million to $16.67 million in fees), which is not surprising given what we know about the current market.\n\nCalling the bottom line “Earnings” looks like the bitcoin company is losing money every quarter, which isn’t really accurate, but it does highlight an important point: all bitcoin fees are going to miners, and none to the owners (or BTC investors).\n\nIn these reports, negative Earnings are not necessarily bad. They just mean you (the owner/shareholder) are not getting additional value, on top of the value of your underlying BTC.\n\nAs an analogy, some traditional investors only want to buy companies that pay dividends. Others don’t care about regular payments, as long as the company has good long-term growth prospects. Bitcoin would appeal to the second type of investor.\n\nEthereum Income Statement\n\nThe story: A much better financial picture. Not only are fees (think: revenues) holding up, but earnings (think: the value of your investment) is going from negative to positive. This is a positive trend for ETH investors.\n\nUniswap Income Statement\n\nWe have a new metric here, which is the confusingly-named GMV, or “Gross Merchandise Volume.” While this sounds like something a clothing manufacturer would measure, GMV is really just how much money they are moving. On a decentralized exchange like Uniswap, it’s their trading volume. With a lending company like Compound, it’s the value of active loans.\n\nThe story: Total trading volume is down about half from two quarters ago – again, not a surprise in the current market. All the fees earned by Uniswap go to the liquidity providers (you can read more about LPs in our Investor’s Guide to Uniswap). As with bitcoin, UNI investors are betting on the company (i.e., that UNI price will rise), not on any payments to shareholders.\n\nUnderstanding the Treasury\n\nForward-thinking crypto companies keep a “Treasury” – a bit like “retained earnings” for traditional companies – that can be used to grow the business.\n\nYou might use Treasury to create new developer incentives, fund related startups, pay executives, or anything else that might cost real money. (Even though it’s held in tokens, it can be converted into cash.) Communities usually vote on where to spend Treasury.\n\nTerm What it is Public-company equivalent Treasury Funds set aside to grow the business Retained earnings\n\nHere’s a look at Compound’s Treasury:\n\n\n\nThe story: When you see the Treasury slipping from $442 to $126 million (bottom row, right to left), you may think they are spending a boatload on what is clearly a declining business (top row, right to left).\n\nHowever, everything is affected by the macro market: when crypto is down, the demand for loans is down. The same goes for the value of their Treasury: since it’s likely held in COMP tokens, the value of the token affects the value of the Treasury. Not a great financial picture, but more investigation is needed.\n\nWhich brings us to…\n\nUnderstanding Market Data\n\nYou’re already familiar with “Price”: unfortunately, it’s the only metric most crypto investors use. (That’s why these reports are your secret weapon.)\n\nThey give you two market cap metrics, and the difference is how many tokens have been minted vs. how many have been promised:\n\n“ Fully Diluted Market Cap” is the total value of the crypto company when all tokens are minted , according to their promised rules;\n\n, according to their promised rules; “Circulating Market Cap” is the total value of all the tokens in circulation today.\n\n“Trading Volume” shows you the value of tokens traded during the quarter, and “Tokenholders” tells you how many individual wallets hold the token (imperfect number, since people can hold more than one wallet, but probably close enough).\n\nHere’s the Market Data for Balancer (BAL):\n\nThe story: Bucking market trends, the price of BAL has actually increased over the last few quarters, as have the number of BAL tokenholders. There are roughly $250 million in tokens issued, out of $615 million that can eventually be minted.\n\nLooking at the total picture, we can see that even though trading volume (top line) has declined with the overall market, and earnings (think: shareholder value) are in the red, the price of BAL keeps going up. This is a red flag: why are investors so optimistic? (This may be the answer.)\n\nUnderstanding Valuation Multiples\n\nIn the traditional world, a valuation multiple is a ratio of one financial metric to another. They’re useful for comparing very different companies, apples to apples.\n\nThese reports list four valuation multiples:\n\nP/F ratio (fully diluted) : Fully diluted market cap / annualized fees.\n\n: Fully diluted market cap / annualized fees. P/F ratio (circulating) : Circulating market cap / annualized fees.\n\n: Circulating market cap / annualized fees. P/S ratio (fully diluted) : Fully diluted market cap / annualized revenue.\n\n: Fully diluted market cap / annualized revenue. P/S ratio (circulating): Circulating market cap / annualized revenue.\n\nThe most helpful here is probably P/F ratio (circulating), which gives you the total value of all tokens, divided by the fees (or revenue) generated. Think of this like P/E ratio in traditional investing.\n\n(You’re probably wondering why they chose the letter “P.” It stands for “Price” in traditional Price-to-Earnings ratios. Super-confusing names, but great idea.)\n\nTerm What it is Public-company equivalent P/F ratio (circulating) Total value of all tokens, divided by fees (revenue) P/E ratio\n\nThe rule of thumb is that stocks with higher P/E ratios are more overvalued, while those lower P/E ratios are more undervalued. As a value investor, we hope to buy good companies with lower P/E ratios: these are the “hidden gems.”\n\nHere are the valuation multiples for Lido (LDO):\n\nThe story: We can see healthy financials, with a growing number of assets staked (top line), a growing Treasury, and a steadily increasing price.\n\nThe P/F ratio (circulating) has increased from 3.6x to 4.8x, showing you that LDO is not quite the deal it was back when we issued our BUY ALERT in July. But it is still remarkably low compared to many other crypto projects (Ethereum, for example, is selling at a 150x P/F ratio). Still might be a great buy.\n\nUnderstanding Alternative KPIs\n\nFinally, the Alternative KPIs gives you key information to gauge the health of the business:\n\n“Daily Active Users” is like the number of loyal customers. DAU is one of the most important metrics in blockchain, due to network effects. (Please read our piece on Daily Active Users: Like X-Ray Vision for Crypto Investors.)\n\n“Active Developers” and “Code Commits” shows you how many people are actually behind these projects. Think of this like the size of the tech team, and how many big changes they are making each quarter.\n\nLet’s compare these metrics for bitcoin and Ethereum:\n\nThe story: You’ll be surprised to learn that bitcoin had only 13 active developers last quarter, while Ethereum had 165. The team made just 250 changes (code commits) for bitcoin, versus 2,000 for Ethereum.\n\nThis paints a picture of Ethereum as a growing, vibrant ecosystem, with bitcoin a tiny squad of developers keeping the lights on. (And as the Wall Street Journal reported today, this is indeed the case.\n\nPutting it All Together\n\nThese financial reports are a significant milestone for the crypto industry. They’re not perfect. They could be more intuitive. But they’re the start of something really great: a picture of financial health over time.\n\nNo more do we have to rely on hype and headlines to make investing decisions: we can now evaluate the businesses ourselves, using reason and reporting over FUD and FOMO.\n\nThese reports are still a work in progress, since there are no Generally Accepted Accounting Principles (GAAP) for crypto. In fact, most people won’t even admit that cryptos are companies. Which is why these reports are a godsend for the serious crypto investor.\n\nWe’ve been saying for years the obvious truth: even if they’re not technically companies, we can think of cryptos like companies. With these new financial reports, we now have a powerful new tool to evaluate their corporate performance.\n\nIt’s the crypto investor’s secret weapon.\n\n50,000 crypto investors get this column every Friday. Click here to subscribe and join the tribe."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLWxpbmdlcnMtdXMyNDAwMC1sZXZlbC13YWxsLXN0cmVldHMtd29yc3QtZGF5LTIwMjMv0gFmaHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvd2Vla2x5LW1hcmtldC13cmFwLWJpdGNvaW4tbGluZ2Vycy11czI0MDAwLWxldmVsLXdhbGwtc3RyZWV0cy13b3JzdC1kYXktMjAyMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin lingers at US$24,000 level after Wall Street’s worst day in 2023 so far - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, inched up 0.48% in the week from Feb. 17 to Feb. 24, trading at US$23,932 at 8:30 p.m. on Friday in Hong Kong. Ether slid 1.04% in the same period to change hands at US$1,648.\n\nDespite Wall Street posting this year’s worst performance on Tuesday, Bitcoin remained resilient, briefly dropping below the US$24,000 price level the next day, before reclaiming it again.\n\n“The fact that Bitcoin remained resilient during Wall Street’s biggest loss of the year and even recovered after briefly dipping below the US$24,000 mark suggests that Bitcoin’s correlation to U.S. equity markets is not very strong. In fact, Bitcoin’s correlation to the S&P 500 is at its lowest since late 2021, according to data from Dylan LeClair, senior analyst at digital asset fund UTXO Management, on Twitter. However, the two assets are still positively correlated,” wrote Jonas Betz, a Germany-based crypto analyst, in a LinkedIn response to Forkast.\n\nKasper Vandeloock, chief executive officer of quantitative trading firm Musca Capital, told Forkast that there is still “a strong correlation” between the Nasdaq and the crypto market and that investors are looking for fiat alternatives.\n\n“People are fleeing to Bitcoin as trust in fiat currencies and traditional systems are dropping. Banks in Lebanon are being put on fire because of limits on cash withdrawals. The value of currencies has dropped a lot, people are looking for alternatives,” Vandeloock said.\n\nKarlen Danielian, the founder and chief executive officer of play-and-earn metaverse 2040world, said that Bitcoin is highly correlated with the U.S. stock market, particularly the S&P 500.\n\n“Recently, Bitcoin has shown strength compared to the stock market. There is a theory that this is due to expectations for the development of the cryptocurrency market in China via Hong Kong. I believe that Chinese money can greatly help the growth of the cryptocurrency market, and Bitcoin in particular, in the coming years,” wrote Danielian to Forkast.\n\nUnemployment benefits claims in the U.S. fell by 3,000 last week to 192,000, according to data released by the Department of Labor on Thursday, lower than the 200,000 forecasted by economists surveyed by Reuters. The tight labor market could have prompted the U.S. Federal Reserve to continue raising interest rates.\n\nThe global crypto market cap stood at US$1.09 trillion on Friday at 8:30 p.m. in Hong Kong, the same value as a week ago, according to CoinMarketCap data. Bitcoin’s US$461 billion market cap represented 42.2% of the market, while Ether’s US$201 billion accounted for 18.5%.\n\nSee related article: Industry reacts: US cracks down on crypto, India calls for regulatory collaboration\n\nBiggest gainers: STX & CFX\n\nSTX, the native token of the Stacks Network, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. STX was up 133% on the weekly chart to trade at US$0.75 at 8:30 p.m. in Hong Kong.\n\nStacks is a Bitcoin layer-2 that allows developers to deploy smart contracts, bringing decentralized applications such as NFTs to the network. The STX token started its rally on Feb. 19, fueled by renewed interest in Bitcoin-native NFTs after the launch of Bitcoin Ordinals, a protocol that allows users to inscribe data on satoshis, the lowest denomination of Bitcoin.\n\nOrdinals Inscriptions surpassed 154,000 on Feb. 21, adding more fuel to the STX rally.\n\n“BTC now has an extra use case other than just being a currency. BTC is now a place where NFTs or “digital artifacts” can be created and stored on every single node on the BTC network. The added benefit of having a rock-solid use case of NFTs added to BTC will impact miner fees to go up as demand for network resources go up,” wrote Yohann Calpu, chief marketing officer at NFT data aggregator CryptoSlam, to Forkast.\n\nBetz said that Bitcoin Ordinals have an immutability benefit over traditional NFTs.\n\n“Ordinals have an immutability benefit over traditional NFTs as ordinals allow users to store all the data directly and permanently on the Bitcoin blockchain. Proof-of-stake-based NFTs on the other hand often require off-chain data storage and could be altered using metadata,” wrote Betz.\n\nConflux’s native token (CFX) was this week’s second-biggest gainer in the top 100 coins. Conflux Network is an interoperability-focused protocol and the only public, permissionless blockchain with regulatory compliance in China.\n\nCFX was up 84.54% on the weekly chart, changing hands at US$0.27. The token started its rally on Jan. 26, after news emerged of Conflux partnering Little Red Book, a Chinese social media platform, enabling over 200 million users to mint their profile pictures as NFTs on Conflux.\n\nNext week?\n\n“The current support level is in the US$23,375-23,600 range, as this marks the lows of the retracements of Bitcoin’s failed attempts to break through US$25,000,” wrote crypto analyst Betz.\n\n“The most important resistance that Bitcoin has to overcome is the psychological mark of US$25,000. Unfortunately, Bitcoin has failed to break through this resistance three times in the last 7 days. This in turn means that a future breakout is even more significant and could be greeted with great euphoria,” he wrote, adding that he expects “a breakout and subsequent fall of Bitcoin into the US$21,000 to US$22,500 range,” due to Bitcoin’s previous attempts to breach US$25,000 and the Fed’s signals to raise interest rates further.\n\nAziz Kenjaev, head of partnerships at decentralized crypto derivatives exchange GammaX, also expects a downtrend next week, with Bitcoin heading towards US$21,500-22,300.\n\n“As per the technical outlook, Bitcoin bounced back from the important dynamic resistance at US$25,266, this level was retested again and created a strong static resistance, hence buyers’ pressure is getting weaker. If bears can push BTC below US$23,500 it will most likely drop to US$21,500-22,300,” wrote Kenjaev.\n\n“As the regulatory provisions of the crypto market are set to take higher pace this year, after the FTX collapse, we might also see watchdogs reporting concerns over several crypto-projects. In addition, FSB (Financial Stability Board) will release a report on findings in their cryptocurrency and stablecoin research in collaboration with the International Monetary Fund. This could result in uncertainty in the market,” added Kenjaev.\n\nDanielian said that US$25,000 is a key price level for Bitcoin: “It is crucial for Bitcoin to break through and establish itself above the US$25,000 level, and then we can say that the market has turned from bearish to bullish.”\n\nVandeloock said there is a large focus on Asian and Chinese coins right now, which he expects to shift back to AI coins, adding that “AI projects such as 0xAI have gained massive attention.”\n\nSee related article: Be careful what you wish for? Regulators pick up pace in the crypto industry crackdown"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXR1bWJsZXMtdG8tMTAtZGF5LWxvd3MtYXMtbm90b3Jpb3VzLWItaS1kLWtlZXBzLXN1cHBvcnQtYXQtMjItNWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price tumbles to 10-day lows as 'Notorious B.I.D.' keeps support at $22.5K - Cointelegraph",
        "content": "Bitcoin (BTC) threatened to ditch $23,000 as support on Feb. 25 as an ongoing price correction strengthened into the weekend.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nBTC price support inches lower\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD attempting to decide the fate of the $23,000 mark on the day.\n\nThe pair had lost almost $1,000 on Feb. 24, ending the week in a limp position along with United States equities while the dollar gained.\n\nWith “out-of-hours” trading now in place until Monday, chances for thinner liquidity to spark more pronounced moves heightened.\n\nAnalyzing the state of the Binance order book, monitoring resource Material Indicators confirmed the continued existence of a major line of bid support informally known as the “Notorious B.I.D.” and “great wall.”\n\nPreviously higher up, the owners of the liquidity had moved it lower during the week.\n\n“If the Notorious B.I.D. wall at $22,250 holds, I expect it to be part of the weekend whale games. I would not be trying to catch knives,” Material Indicators commented.\n\n“Expect BTC to retest lows or potentially move to price discovery before a legit Bull Market Breakout.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nTurning to the upcoming weekly close, trader and analyst Rekt Capital meanwhile delineated $23,300 as important to hold to protect bulls’ interests.\n\n“Weekly retest of the confluent area that is the Lower High and Monthly Range High resistance is now in progress,” they wrote in a Twitter update.\n\n“Price needs to hold here for the retest to be successful. However, Weekly Close below this area would be a bearish sign.“\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nAn additional post argued that the monthly close would be a key determining factor in the overall trend, this also being just days away.\n\nA failed #BTC Weekly retest of ~$23400 as support would mean that price remains inside the Monthly Macro Range\n\n\n\nLet's see how the Monthly Closes\n\n\n\n1M Close above ~$23400 -> likely range breakout\n\n\n\n1M Close below -> $BTC stays in & range & could dip lower in range#Crypto #Bitcoin pic.twitter.com/xTAqH7pVlm — Rekt Capital (@rektcapital) February 24, 2023\n\nBitcoin difficulty, hash rate stay the course\n\nOthers showed signs of frustration that Bitcoin could not crack $25,000 and reckon with more substantial long-term resistance levels above it.\n\nRelated: Bitcoin 2024 halving will be its ‘most important’ — Interview with Charles Edwards\n\n“Pretty amazing that we couldn’t just get an exit pump above 25K for god-tier short entry,“ Crypto Chase summarized.\n\n“Everyone bullish and euphoric and price just dumps off most obvious resistance.. such a shame. Maybe still get it later on.. idk. Crypto just don’t trade like it used to tbh.“\n\nA subsequent update highlighted $22,700 as a downside level to preserve for another run at $25,000.\n\n$BTC\n\n\n\nGonna want to see 22.7K hold if a real push above 25K for liquidity is still in the cards. Confluence of Daily S/R + 0.618 fib of current leg. pic.twitter.com/ZHShTi9SzT — Crypto Chase (@Crypto_Chase) February 24, 2023\n\nA point of optimism meanwhile came in the form of Bitcoin network fundamentals, with difficulty increasing 9.95% in its latest automated readjustment — the biggest since mid-January.\n\nAs Cointelegraph reported, both difficulty and hash rate continue to surge to new record levels despite the slowdown in price recovery.\n\n“Bitcoin mining became 10% more difficult last night,“ Maartunn, a contributing analyst to on-chain data platform CryptoQuant, responded.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDIvMjQvcnVqYS1pZ25hdG92YS1jcnlwdG9xdWVlbi1vbmVjb2luLW11cmRlci1idWxnYXJpYS1jcmltZS1ib3NzLXlhY2h0L9IBbWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDIvMjQvcnVqYS1pZ25hdG92YS1jcnlwdG9xdWVlbi1vbmVjb2luLW11cmRlci1idWxnYXJpYS1jcmltZS1ib3NzLXlhY2h0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "The ‘Cryptoqueen’ who made FBI’s most wanted after $4 billion heist was rumored killed—but evidence leaves more questions than answers - Fortune",
        "content": "The “Cryptoqueen” vanished more than five years ago with more than $4 billion, and at least one report said she was murdered roughly a year later.\n\nA new police document, published by Bulgarian investigative outlet BIRD, or the Bureau for Investigative Reporting and Data, suggests that Ruja Ignatova, who disappeared in 2017 after scamming investors with a fake cryptocurrency, was killed in a hit ordered by a Bulgarian crime boss.\n\nBut Atanas Tchobanov, a journalist at BIRD who worked with the International Consortium of Investigative Journalists to publish the Pandora Papers, told Fortune that scenario was just “a hypothesis.” BIRD first caught wind of the rumored murder while reporting on a police officer shot dead in March 2022.\n\n“It’s not conclusive,” added Tchobanov, who was once a member of the board of the Organized Crime and Corruption Reporting Project.\n\nThe document in question was found in a safe in the police officer’s apartment. There was a one-page report that detailed how the brother-in-law of Bulgarian crime boss Christophoros Amanatidis, a.k.a. Taki, drunkenly told an anonymous informant during a yacht trip in Cuba that Taki had ordered a successful hit on Ignatova. According to this account, Ignatova was killed on another yacht in the Ionian Sea in November 2018, and her body was carved up and tossed overboard.\n\nThis account is heavy on hearsay and so should be taken with a grain of salt. That said, it is one of the few public leads to detail the whereabouts of Ignatova, who landed on the FBI’s most wanted list after absconding with billions.\n\nMoreover, Tchobanov said, a source who was in contact with Ignatova’s brother disputed the document published by BIRD. That source said Ignatova contacted her brother in early 2019, months after her rumored killing.\n\nIn January, she was reported to be selling a four-bedroom penthouse in London for approximately $13 million. Instead, prosecutors in Germany were organizing the sale, after having seized the property.\n\nThe Cryptoqueen rose to prominence in 2014, when Ignatova, a German-Bulgarian businesswoman, suddenly announced that she had created a rival to Bitcoin called OneCoin.\n\n“OneCoin is easy to use. OneCoin is for everyone,” she said to a packed stadium in England in 2016. “Make payments everywhere, everyone, globally.”\n\nUsing multi-level marketing tactics, she convinced crypto newbies to invest billions in her project, which turned out to be a pyramid scheme. Her new token didn’t even run on a blockchain.\n\nIn 2017, after reportedly undergoing multiple plastic surgeries, she boarded a plane from Bulgaria to Greece and was never seen again. Today she would be 42."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tYW4tZmFjZXMtYXJyZXN0LW92ZXItYWxsZWdlZC1jcnlwdG8tbWluZS1oaWRkZW4tdW5kZXItYS1zY2hvb2zSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Man faces arrest over alleged crypto mine hidden under a school - Cointelegraph",
        "content": "A former facilities worker who allegedly set up a secret cryptocurrency mining operation inside a Massachusetts school’s crawl space is due for arrest after missing a scheduled court hearing to answer to charges.\n\nNadeam Nahas was scheduled to be arraigned on Feb. 23 facing charges of vandalizing a school and fraudulent use of electricity, according to media reports.\n\nJUST IN: an ex-town employee is accused of running a \"Cryptocurrency mining operation\" out of Cohasset High School. pic.twitter.com/cdBlMIxnnH — whalechart (@WhaleChart) February 24, 2023\n\nA default warrant is a type if warrant issued by courts when a person fails to appear in court or comply with an order, and authorizes law enforcement officers to arrest the person.\n\nNahas, who is said to have previously worked in the facilities department for the town of Cohasset, Massachusetts, United States, is alleged to have stolen electricity worth almost $18,000 in order to power his crypto mining operation in 2021, between April 28 and Dec. 14.\n\nCourt documents show the town calculated Nahas - of Norwell (he worked for the town of Cohasset in the facilities dept) allegedly stole $17,492.57 worth electricity as the computers did their work 24/7 near the boiler room in the basement. It was discovered 12-14-21. — Jonathan Hall (@JHall7news) February 23, 2023\n\nLocal police were reportedly initially informed about the operation in December 2021 after Cohasset’s facilities director noticed computers, wiring and ductwork that seemed out of place given they were in a crawl space near the school’s boiler room.\n\nA total of 11 computers were found there, and Nahas was identified as a suspect after a three-month investigation.\n\nNahas resigned from his position with the town of Cohasset in March.\n\nRelated: The economics of cryptocurrency mining: Costs, revenues and market trends\n\nIt is certainly not the first time someone has been charged with stealing electricity in order to mine cryptocurrency.\n\nIn July 2021, Malaysian officials destroyed $1.2 million worth of Bitcoin (BTC) mining rigs that were confiscated from residents who were stealing electricity to mine.\n\nA year prior, in August 2020, Bulgarian authorities arrested two men for illegally siphoning off more than $1.5 million in electricity to operate two crypto mining farms."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL25mdC1uZXdzL2JpdGNvaW4tbmZ0cy1zdGFja3Mtb3Itb3JkaW5hbHMv0gFKaHR0cHM6Ly93d3cubmZ0Y3VsdHVyZS5jb20vbmZ0LW5ld3MvYml0Y29pbi1uZnRzLXN0YWNrcy1vci1vcmRpbmFscy8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs Stacks or Ordinals? - NFT Culture",
        "content": "Bitcoin was created in 2009 as a decentralized, peer-to-peer digital currency that operates on a public ledger called the blockchain. Over the years, the Bitcoin network has evolved to include various layers and protocols that allow for additional functionality and features beyond simple payments. One of these protocols is the ability to create non-fungible tokens (NFTs) on the Bitcoin blockchain.\n\nNFTs are unique digital assets that can represent anything from art to collectibles to in-game items. They are “non-fungible” because each token is unique and cannot be exchanged for another token of equal value, unlike fungible tokens like Bitcoin itself. NFTs have become increasingly popular in recent years, with many high-profile sales of digital art and collectibles.\n\nThe first NFT standard on the Bitcoin blockchain was called Colored Coins, which was created in 2012. Colored Coins allowed users to attach additional information to Bitcoin transactions, essentially creating a new type of asset that could be traded on the blockchain. However, Colored Coins never gained widespread adoption and was eventually supplanted by other NFT protocols.\n\nOne of the most promising NFT protocols on the Bitcoin blockchain today is Ordinals. Ordinals is a simple and elegant protocol that allows users to “inscribe” up to 3.9 MB of data on the Bitcoin blockchain without the use of smart contracts. These inscriptions can represent anything from art to music to text. Because the inscriptions are directly on the Bitcoin blockchain, they are highly secure and tamper-resistant. Ordinals are fully backed by Bitcoin’s hash power and decentralization, making them permanent and as permanent as anything ever known. They can be exchanged like Bitcoin and used as proof of ownership for digital assets.\n\nStacks vs. Ordinals?\n\nStacks and Ordinals are two different protocols that utilize the Bitcoin blockchain, each with their unique set of features and use cases.\n\nStacks is a layer on top of the Bitcoin blockchain that allows developers to build Ethereum-style smart contracts that read, write, and secure data on Bitcoin. It is similar to a sidechain in that it has its own ledger and virtual machine, but it also has properties of a layer-two scaling solution because it inherits security (finality) from Bitcoin L1. Stacks enables developers to create a range of decentralized applications (dApps) that can interact with Bitcoin in a secure and trustless manner. However, Bitcoin itself cannot verify Stacks transactions, so Stacks requires a separate consensus mechanism to secure its ledger.\n\nOn the other hand, Ordinals is a protocol on Bitcoin L1 that allows users to “inscribe” data up to 3.9 MB on the Bitcoin blockchain without the use of smart contracts. Ordinals are essentially non-fungible tokens (NFTs) that are fully backed by Bitcoin’s hash power and decentralization. They are permanent and can be exchanged like Bitcoin. Because they are inscribed directly on the Bitcoin blockchain, they are highly secure and tamper-resistant.\n\nIn summary, while Stacks and Ordinals both use the Bitcoin blockchain, they have different characteristics and use cases. Stacks allows developers to build complex dApps that can interact with Bitcoin, while Ordinals provide a simple and elegant way to inscribe data on the Bitcoin blockchain without the use of smart contracts. Both protocols have their unique advantages and are being developed by a community of builders who are committed to advancing the Bitcoin ecosystem.\n\nFriend of NFT Culture TO also has a great thread that inspired this post."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vcmVzdG9md29ybGQub3JnLzIwMjMvc29tZS1mdHgtamFwYW4tdXNlcnMtc3RpbGwtd2FpdGluZy1mb3ItbW9uZXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Japan FTX users still can’t withdraw bitcoin after collapse - Rest of World",
        "content": "On Tuesday, FTX Japan, a subsidiary of FTX, began allowing customers to withdraw funds frozen in the now-defunct crypto exchange. Transfers for Japanese customers started being processed later that day, making them some of the first FTX users in the world to get their money back.\n\nMany of these customers are now breathing a sigh of relief, after four months of alarm and uncertainty. In the mad rush to claim these withdrawals, however, others have run into hurdles, and taken to Japanese social media to share their accounts. Some users are being told they aren’t eligible for withdrawals at all. Rest of World spoke to seven FTX Japan customers, most of whom say they feel like they’ve fallen victim to a bait-and-switch.\n\nYakiginnan, who asked to use his social media name to protect his privacy, is a 48-year-old working in asset management. He is one of the many customers to successfully complete his withdrawal. He had roughly 2 million yen ($14,800) in bitcoin with FTX Japan, which was returned in full on Wednesday. Instead of celebrating, though, he has spent the last few days contacting FTX Japan’s customer support on behalf of those who haven’t seen a dollar.\n\n“I am very angry because I know that there are many people, including my daughter, who were denied the return of their assets,” he told Rest of World. “And I am angry that FTX Japan has been falsely announcing that the assets are segregated and properly protected, when, in fact, they were not.”\n\nRest of World joined one Discord group this week that had over 50 victims of FTX. Using public Twitter accounts, many members of the community are now pushing for clarity from FTX Japan on why customers still haven’t been able to withdraw, and have demanded a closer investigation from Japan’s Financial Services Agency (FSA).\n\nFTX Japan did not answer questions from Rest of World about why some customers have been denied their withdrawals. In a blogpost published on February 22, the company announced it had issued withdrawals of more than 6 billion yen ($49 million) to 3,454 individual accounts and 94 corporate accounts in the first two days.\n\nThe FTX saga began in early November 2022, when Sam Bankman-Fried’s massive crypto exchange collapsed following allegations that the company had severely mismanaged customer assets. FTX Japan was one in a web of international FTX subsidiaries. But, unlike other subsidiaries, FTX Japan was under the purview of strict Japanese crypto regulations. As a result, the company claimed that the exchange was still solvent.\n\nIt’s taken FTX Japan four months to restart withdrawals, which required an ambitious plan overseen by Japanese regulators to sidestep the now-defunct FTX system. Rest of World previously reported on the plan’s unique challenges, which entailed reviving an exchange discontinued in Japan — called Liquid.com — to deliver withdrawals.\n\nMeanwhile, FTX Japan has issued updates to customers claiming that the exchange was solvent and explaining how Japan’s notoriously strict regulations, including restrictions on the movement of customers’ assets, have insulated users from the wholesale losses of FTX users elsewhere.\n\nYakiginnan says his daughter has roughly 200,000 yen ($1,480) in FTX. But when she applied for her withdrawal through Liquid.com, she received a notification that she was ineligible to complete the transaction. In fact, she was told her assets weren’t managed by FTX Japan at all, but rather by its parent company, currently in the midst of bankruptcy proceedings.\n\nMany customers have taken to social media to share screenshots of similar notifications. Some had used FTX International’s exchange website, FTX.com, or the FTX app prior to FTX Japan’s official launch in June 2022. They are being told that they did not successfully transfer their assets after the June launch.\n\nOne customer, who asked to remain anonymous over privacy concerns, told Rest of World he has lost almost all the assets he had saved since 2014 — nearly $140,000 — due to the FTX collapse. Initially an FTX app customer, in May 2022, he conducted a Know Your Customer (KYC) check to verify his identity, he thought, for FTX Japan. FTX Japan claims that since he did not complete an additional KYC check after June, his assets were never transferred properly, despite his registration with the subsidiary and the fact the domestic app was branded as FTX JP at the time, he said.\n\n“My biggest concern is that I will be recognized as an FTX.com user by FTX Japan and as an FTX Japan user by FTX.com, leaving me hanging in the balance,” he said.\n\nFor many, the sudden disclosure that their assets were never managed by FTX Japan, after months of messaging from the subsidiary that they had been protected from the fallout, has come as a shock.\n\nYakiginnan says his daughter opened her account using the FTX JP app, so there should be no need to transfer the account from FTX International.\n\nOthers, though, still aren’t sure why withdrawals aren’t coming through. Initial restrictions and delays on the withdrawals of both Bitcoin and Ripple cryptocurrencies appear to have mostly been resolved. But Wagami, a computer graphics designer who asked to use only her last name to protect her privacy, told Rest of World she still receives error messages when she tries to apply for a withdrawal. “There are people with the same status who are able to withdraw and people who are not able to withdraw. It is very frustrating because I don’t know why I can’t,” she said.\n\n“I would like to see an investigation into the cause of the problem and a response from FTX as soon as possible,” said Wagami. “I can’t say yet if I will get a refund, but I believe I will. That’s my only option.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWFzc2Vzc2luZy13aGV0aGVyLW9yLW5vdC1hLWxvY2FsLWJvdHRvbS1oYXMtYmVlbi1yZWFjaGVkL9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWFzc2Vzc2luZy13aGV0aGVyLW9yLW5vdC1hLWxvY2FsLWJvdHRvbS1oYXMtYmVlbi1yZWFjaGVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin: Assessing whether or not a local bottom has been reached - AMBCrypto News",
        "content": "CryptoQuant analyst Wedson has opined that a local top has been reached.\n\nOn-chain metrics, however, paint a different picture.\n\nCryptoQuant analyst Joao Wedson has suggested that Bitcoin’s [BTC] price, which saw a 6% decline in the last week, may have hit a local bottom at the $24,000 price mark.\n\nWedson concluded after assessing the 350-day moving average and the 100-day exponential moving average that makes up BTC’s Taker Buy Sell Ratio indicator.\n\nAccording to Wedson, with the Taker Buy Sell Ratio indicator, analysts have found that the 350-day MA and 100-day EMA can identify BTC’s price trend changes.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nHe noted further that the 100-day EMA crossing a value line of one could also signal local tops and bottoms, presenting buying or selling opportunities.\n\nIn the current BTC cycle, the rally in BTC’s price since the year began pushed the 100-day EMA above one.\n\nThis, according to Wedson, might have ushered in a bear cycle that might result in a downward trend in BTC’s price.\n\nOn-chain price bottom markers say otherwise\n\nIn terms of identifying local price bottoms for cryptocurrency assets, some on-chain metrics have been effective in that regard. One of the most effective indicators is Age Consumed, which monitors the behavior of previously inactive coins on the blockchain.\n\nA surge in Age Consumed indicates a significant number of inactive tokens have been transferred to new addresses, indicating a sudden and pronounced change in the behavior of long-term holders.\n\nSince long-term holders and experienced traders seldom make impulsive decisions, a renewed activity of dormant coins often corresponds with significant changes in market conditions.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nA look at BTC’s age consumed revealed a spike in its Age Consumed metric on 22 February, when the king coin traded at $23,700. BTC’s price spent the next three days rallying to trade at $24,100, at press time.\n\nThe growth in BTC’s price, which followed the surge in Age Consumed, could be taken to mean that the leading coin bottomed at the $23,700 price point, and further rallies should be anticipated.\n\nAnother indicator that might be useful in this regard is BTC’s Network Profit/Loss ratio (NPL). This metric calculates the mean profit or loss of all coins that are transferred to new addresses on a daily basis.\n\nThis approach is used to identify instances of profit-taking or holder capitulation on the blockchain.\n\nDips in the NPL metric frequently indicate brief periods of capitulation by “weak hands” and the return of “smart money” to the market. This is why these dips often occur concurrently with local rebounds and phases of price recovery.\n\nThis has been the case with BTC in the past few days. Data from Santiment revealed a significant dip in the king coin’s NPL on 22 February, which has since been followed by a surge in its price."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vYXRsYW50aWMuY3R2bmV3cy5jYS9jb252aWN0ZWQtbm92YS1zY290aWEtbXVyZGVyZXItcy1zdGFzaC1vZi1iaXRjb2luLWF0LWNlbnRyZS1vZi13cm9uZ2Z1bC1kZWF0aC1sYXdzdWl0LTEuNjI4ODI1NdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Convicted Nova Scotia murderer's stash of bitcoin at centre of wrongful death lawsuit - CTV News Atlantic",
        "content": "HALIFAX -\n\nA legal battle is brewing in Nova Scotia over access to bitcoin owned by an ex-medical student recently convicted of fatally shooting a fellow student during a drug deal.\n\nThe lawyer who represents the victim's family says the cryptocurrency could be worth more than $200,000 -- money that could be awarded to them if they win a wrongful death civil lawsuit.\n\nLast Saturday, a jury declared William Sandeson guilty of second-degree murder in the 2015 death of Taylor Samson, a 22-year-old physics student at Dalhousie University in Halifax. Sandeson admitted to disposing of the victim's body in the Bay of Fundy. Samson's remains have yet to be found.\n\nBefore his six-week trial began in Nova Scotia Supreme Court, Sandeson applied to the court to have his Dell laptop returned to him while he was in custody. In October 2022, Sandeson told the court his bitcoin account was worth between $8,000 and $10,000, but he said it had appreciated in value during his seven years in custody.\n\nAt the time of that court hearing, Sandeson said he needed the money to pay his legal team. He said he required physical possession of the computer to access the funds, adding that \"if the laptop is inoperable, the money is lost forever.\"\n\nSandeson will be sentenced in April.\n\nJames Goodwin, a lawyer who represents Samson's family, says the court approved Sandeson's request for the laptop. Goodwin, however, was granted an interim injunction blocking the move in December 2022. The court will revisit the issue in May.\n\nEarlier this month, Samson's mother, Linda Boutilier, and her other son, Connor Samson, filed an amended statement of claim for a wrongful death lawsuit against Sandeson.\n\nGoodwin said his clients are claiming special and general damages, and he said they want to make sure Sandeson's cryptocurrency remains available to the court if they win their civil case.\n\n\"The family is entitled to damages,\" Goodwin said in an interview from his office in Amherst, N.S. \"It's pretty rare for someone who commits homicide to have any assets at all.\"\n\nGoodwin said he was confident the court will keep the injunction in place, denying Sandeson access to the disputed account.\n\n\"Part of the test to get the injunction was to show evidence that this person isn't trustworthy,\" Goodwin said. \"He's admitting to (killing) somebody. He's changed his story repeatedly. There's a lot of evidence here of a character the court shouldn't trust.\"\n\nPolice seized the laptop at Sandeson's Henry Street apartment, which is where Samson was last seen alive. But the machine was never entered as an exhibit for Sandeson's trial.\n\nThe Crown argued it was reluctant to return the laptop until court proceedings ended because it contains text messages, internet searches, and information on websites that were accessed up to and including Aug. 15, 2015 -- the day Samson was murdered.\n\nThis report by The Canadian Press was first published Feb. 24, 2023."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5oYW5kZWxzemVpdHVuZy5jaC91bnRlcm5laG1lbi9rdW5mdGlnLW51ci1ub2NoLXJlcHJhc2VudGFudC1iaXRjb2luLW1pbGxpb25hci1kYWR2YW4teW91c3VmLWxlZ3QtYW10ZXItYmVpLWtyeXB0by1iaWxkdW5nc3BsYXR0Zm9ybS1uaWVkZXItNTc3MjUz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Künftig nur noch Repräsentant: Bitcoin-Millionär Dadvan Yousuf legt Ämter bei Krypto-Bildungsplattform nieder - Handelszeitung",
        "content": "«Ich wurde in den Medien verunglimpft, als Terroristenunterstützer hingestellt, als Betrüger, Geldwäscher, dem man das Handwerk legen muss. Dann wurden meine Konti blockiert. Sorry, ich habe das als totalen Eingriff in meine Privatsphäre erlebt. Und das alles innert Tagen», sagte Davdan Yousuf in einem ausführlichen Interview mit der «Handelszeitung» vergangenen Herbst."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZmluYm9sZC5jb20vMTMteWVhcnMtYWdvLXNhdG9zaGktbmFrYW1vdG8tdW52ZWlsZWQtYml0Y29pbi1pY29uLXNlZS1ob3ctYnRjLWxvZ28tZXZvbHZlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "13 years ago Satoshi Nakamoto unveiled Bitcoin icon; See how BTC logo evolved - Finbold - Finance in Bold",
        "content": "As the cryptocurrency industry marks 13 years since the mysterious Bitcoin (BTC) founder Satoshi Nakamoto unveiled the historic “₿” icon and sign, it is time to go down memory lane and look at how many times the iconic Bitcoin logo changed before it received the final form that is widely known and loved today.\n\nIndeed, Satoshi Nakamoto revealed his idea for the redesigned Bitcoin logo, which was to meant to replace its older iteration, showcasing the future images he created in various sizes in a post published on the Bitcointalk forum on February 24, 2010, exactly 13 years to this date.\n\nSatoshi’s original post revealing redesigned Bitcoin icon. Source: Wayback Machine\n\nPlain beginnings\n\nAs shown by the Daily Crypto, the redesigned logo was the replacement for the earlier one, released in early 2009, which was also represented in the form of a gold-colored circle but instead of the elaborate “₿” symbol displayed the very plain letters ‘B’ and ‘C’ at its center.\n\nOriginal Bitcoin symbol from 2009. Source: Bitnovo\n\nNew logo, more details\n\nOn February 24, 2010, the Bitcoin symbol became today’s letter ‘B’ with two vertical strokes, following the suggestion loosely based on the Thai baht currency symbol (฿) in the discussion about the maiden cryptocurrency’s future symbol at the Bitcointalk forum. The golden circle itself received some more details.\n\nRedesigned Bitcoin symbol from February 2010. Source: Bitnovo\n\nFinal design\n\nIn November 2010, Bitcoin received its final form that is recognized around the world – the “₿” symbol, rendered in white and tilted clockwise by 14% inside an orange circle. It was suggested by the Bitcointalk user named Bitboy, who took the symbol created by Satoshi and redesigned it using Visa (NYSE: V) and Mastercard (NYSE: MA) as inspiration.\n\nCurrent Bitcoin symbol from November 2010. Source: Wayback Machine\n\nDesign flaws\n\nInterestingly, social media users have recently drawn attention to a couple of minor imperfections in the widely accepted design of the Bitcoin icon, which have been present for over 12 years, although invisible to the naked eye.\n\nA small design detail that has stayed with many iterations of the original #bitcoin logo since its inception in 2010 pic.twitter.com/nYElwD2S6v — ben (@_Bosch_) February 9, 2023\n\nAs it happens, upon zooming in on the original vector files posted by BitBoy, the image reveals a small orange line from the background seeping into the white ₿ symbol, as well as one of the curvatures of the symbol itself not being perfectly smooth, as Twitter users ben and Skyler pointed out.\n\nThat said, the necessity for creating new vectors that would fix these flaws could be argued, as the revelation itself doesn’t impact in any way the operations of the flagship decentralized finance (DeFi) asset, unless the crypto community shows interest in resolving the microscopic design issue."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZ2FkZ2V0c3RvdXNlLmNvbS9ibG9nLzIwMjEvMDgvMjQvcGF4ZnVsLXJldmlldy1tb3N0LWZsZXhpYmxlLWJpdGNvaW4tZXhjaGFuZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Feb 2023 08:00:00 GMT",
        "title": "Paxful Review: The Most Flexible Exchange to Buy and Sell Bitcoin - Gadgets To Use",
        "content": "Cryptocurrencies are becoming mainstream as more people have started investing in this new-age digital currency. If you are here and still wondering what the cryptocurrency “Bitcoin,” is all about, you can go read our previous article where we have explained Bitcoin in detail. We have previously shared with you some of the best crypto exchanges to buy and sell Bitcoins and in this article from our Crypto Tips series, we are reviewing a crypto exchange in detail, so you can easily get started with your crypto adventure. The crypto exchange that we will review here is Paxful. Let’s begin!\n\nPaxful Review\n\nPaxful is a peer-to-peer (P2P) crypto exchange or you can say Bitcoin exchange. So, what exactly is a P2P exchange and how does it differ from other types of platforms? Also, how can you get started with Paxful? What are the pros and cons of trading on its platform? You can get the answers to these questions in our Paxful Review.\n\nPros:\n\nFree online wallet\n\n350+ payment methods\n\nNo commission fees\n\nSecured by escrow.\n\nCons:\n\nBuying crypto on Paxful is a bit more complicated vs. buying on traditional crypto exchanges\n\nLow liquidity – only a few vendors accept large transactions\n\nNeed to be extra careful as there are a few bad eggs that may take advantage of you.\n\nAbout Paxful\n\nAs mentioned above, Paxful is a peer-to-peer cryptocurrency exchange and digital wallet where you can buy and sell Bitcoins as well as other cryptocurrencies. It was founded back in 2015 as EasyBitz and soon renamed Paxful. Within five to six years, the crypto exchange has grown to a whopping 6 million user base. It also receives more than 300K daily transactions.\n\nPaxful offers a simple interface where users can directly trade Bitcoins and other cryptocurrencies without the need for any mediator.\n\nFurther clarifying, there are two types of exchanges— the traditional and P2P. In traditional exchanges, users get help from the platform as a middleman to complete the trade. While in P2P exchanges like Paxful, buyers, and sellers complete the trade themselves. This gives them the payment flexibility for buying or selling Bitcoins.\n\nWith P2P exchanges, you can enjoy payment flexibility. You can use the money in your digital wallets to buy Bitcoin and accept crypto payments directly in your digital wallet. Paxful allows you to enjoy ultimate flexibility for payments. You can use gift cards, goods and services, and more.\n\nTrading on Paxful is really simple. Just create and verify your account and start trading. If you want to become a vendor, you can sell Bitcoin to millions of users around the world.\n\nPaxful Facts and Figures:\n\nMobile Apps: Android and iOS\n\nNotifications: Email, SMS, Telegram\n\nCoins: BTC, ETH, USDT\n\nMinimum Trade: INR 250 (approx.) or 10 USD\n\nSecured by: Escrow\n\nCryptocurrencies available on Paxful\n\nAt Paxful, you can trade Bitcoin (BTC), Tether (USDT), and Ethereum (ETH). The platform has all the popular digital currencies but still, these are limited options when we compare it to other players like Binance.\n\nPaxful Payment Methods\n\nOne of the best features of Paxful is that you can use any of the 400 payment methods available to buy and sell crypto. So you can exchange your Bitcoins with anything ranging from cash to gift cards. This platform supports bank transfers, debit and credit cards, cash payments, several online wallets, gift cards, goods, and services, and other digital currencies as payment methods.\n\nIf you’re from India, you have several popular payment methods to choose from including Airtel Money, Amazon Gift Card, BHIM, Google Pay, JioMoney, MobiKwik, PayZapp, Paytm, PhonePe, alongside all other UPI payment options, and major e-com gift vouchers.\n\nCreating an Account on Paxful\n\nIf you are a newbie on Paxful, here’s how you can easily create an account.\n\nOn Desktop\n\n1. Go to the Paxful website and click “Register” at the top right.\n\n2. Enter your email address, choose a password, and click on “Create Account.” Once done, you will receive a free Bitcoin wallet where you can store and manage all your cryptocurrencies.\n\n3. You will receive a verification code at your email address. Enter the code on the website in order to verify your account.\n\nThat’s it! You can now start trading on Paxful.\n\nMobile Apps\n\nPaxful also offers Bitcoin wallet apps for iOS and Android devices. The app offers simple and secure access to your wallet and lets you send, receive, and store cryptocurrencies on your mobile phone anytime. Other features of the Paxful app include real-time updates of balance, the status of recent transactions, and profile personalization.\n\nDownload Paxful for Android\n\nDownload Paxful for iOS\n\nBuy Bitcoin on Paxful\n\nOnce you’re done setting up your profile, you can now start buying Bitcoin and other currencies right away. Here’s how:\n\n1. Go to the home page and click on “Buy”. You will see all the offers from vendors selling their coins.\n\n2. You can customize these offer results by selecting cryptocurrency, payment method, amount, and location from the side menu.\n\n3. Once you see the curated offers, click on “Buy” next to the offer that best suits your needs. To buy Bitcoin from any vendor, you must verify your email and phone number first.\n\nSell Bitcoin on Paxful\n\nIf you want to sell Bitcoins on this platform, you will need to set your preferences first. The process is again very simple. Here’s how you can get started.\n\n1. On the home page, click on “Sell” and then choose your payment method.\n\n2. Or, directly click on “Sell” from the available offers listed below.\n\n3. Once again, you will need to verify your email and phone number to start selling. Also, make sure that you have enough crypto in your wallet before you create an offer.\n\nCreate an Offer\n\nLastly, if you want to create an offer on Paxful that appears on the offer page, you will need to verify your identity. So, aside from email and phone verification, you will also be asked to verify your ID and address.\n\n1. Go to the home page and click on Create an offer.\n\n2. If you haven’t verified your ID yet, click “Verify Identity.”\n\nUpload all the necessary documents to verify your identity and once these are approved, you will be able to create an offer.\n\nTrading Fees\n\nPaxful does not charge any fees when you buy cryptocurrency. However, there is an exchange fee set by Bitcoin sellers on the platform. Also, a transfer fee is applied when sending crypto to a non-Paxful wallet.\n\nPoints to remember:\n\n1. Users will also incur at least 0.5% charges for bank transfers. Other payment methods including debit cards, other digital currencies, and online wallets are subject to a 1% fee.\n\n2. The gift cards incur the highest fee for selling crypto at 5%. Lastly, there is an escrow network fee deducted from a vendor’s wallet immediately when the trade is completed.\n\n3. When you are purchasing crypto on Paxful, the rate will be set by the sellers themselves. These rates will vary based on numerous factors such as your payment method, currency type, and order size.\n\n4. When you are selling crypto, an escrow amount is deducted from your Paxful wallet at the beginning of the trade. After the successful trade, Paxful receives that fee. In case the trade is not completed, Paxful charges no fee.\n\nTrading Speed\n\nThe trading speed on Paxful varies depending on various factors, including the seller’s availability, specific terms and conditions of the seller, and payment methods. To improve trading speed, you can try contacting the seller directly via their online accounts and see what can be done.\n\nOn Paxful, the trading speed ranges from within a minute to 30 minutes. Once the crypto is successfully sent, the buyer will receive a notification via SMS, email, or push notification on the app stating the confirmed BTC.\n\nPaxful Common Queries\n\nQ. How secure and safe is Paxful?\n\nA. Paxful uses a strict verification process to verify its customers. It uses a “Trusted” badge next to the sellers who are authentic, so you don’t need to not worry about safety. It also has dispute and fraud prevention analysts to make sure trades run smoothly.\n\nThe platform also has an “Escrow” security feature where the currency is held while trading and until the trade is complete. This ensures that the money goes to the right buyer. Paxful uses BitGo as a wallet service provider, which is one of the most secure available in the market.\n\nAdditionally, you can protect your Paxful account with security features like two-factor authentication (2FA).\n\nQ. Does Paxful have a minimum age requirement to create a trading account?\n\nA. Yes, you must be at least 18 years old to create an account and start trading on Paxful.\n\nQ. Can I sign up on Paxful without any ID?\n\nA. You can create a Paxful account using just your email address. However, when you start buying or selling bitcoins, you will need to verify your account. In some cases, you can start buying only by verifying your email ID and phone number.\n\nFurther, to open a vendor account, you need to meet mandatory requirements, including ID verification, address verification, etc. Also, when you reach a certain volume or wallet activity limits, you may need to complete additional KYC including video verification.\n\nQ. Is Paxful a regulated crypto exchange?\n\nA. Paxful is regulated by the US government and complies with OFAC sanctions.\n\nQ. How do I contact Paxful customer support in case of any dispute?\n\nA. You can contact Paxful via a live chatbot at the bottom right corner of the Paxful website or mobile app. If the chatbot doesn’t understand your issue, you can raise a ticket by writing to [email protected].\n\nMoreover, Paxful also offers an extensive FAQ section and help center where you might have all your questions answered. Lastly, the best way to reach the Paxful support team is via their social media channels, including Twitter and Facebook.\n\nPaxful Review: Wrapping Up\n\nSo, if you have read our Paxful review till the end, you now know what exactly this peer-to-peer crypto exchange is. The best part is that it offers a wide range of payment methods to choose from in order to start trading cryptos. Apart from that, other features like a free wallet, escrow security, and no commission fee make it even better. If you don’t find trading that complicated and manage it by yourself, then Paxful can be the best crypto exchange for you, especially because of its flexibility with payment methods."
    }
]