[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8va2VudHVja3lsYW50ZXJuLmNvbS8yMDIzLzA2LzEzL2FzLWtlbnR1Y2t5cy1sYXJnZXN0LWNvYWwtcHJvZHVjZXItbWluZXMtYml0Y29pbi1pdHMtcG93ZXItZGlzY291bnRzLWRyYXctc2NydXRpbnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "As Kentucky's largest coal producer mines Bitcoin, its power discounts draw scrutiny • Kentucky Lantern - Kentucky Lantern",
        "content": "Union County in Western Kentucky has been the state’s top coal-producer for years, mining more than 10 million tons in 2022.\n\nSomething else is being mined in Union County: Bitcoin.\n\nIn both cases, the mining is done by Alliance Resource Partners (ARP) headed by Joseph Craft III, whose wife Kelly Craft, just lost an expensive race to become the Republican nominee for governor.\n\nMining cryptocurrency requires enormous amounts of electricity to power high-capacity computers that perform complicated mathematical calculations, securing online transactions of virtual currencies such as Bitcoin. These mining operations are rewarded for solving the calculations with Bitcoin itself, valued at more than $25,000 a coin as of early June.\n\nA dispute before the Kentucky Public Service Commission (PSC), the state’s utility regulator, will determine whether electrical utilities should have given Alliance and two Bitcoin miners in Eastern Kentucky hefty price discounts on the electricity powering their computers.\n\nUtilities give the discounts, known as economic development riders, as incentives to businesses to locate in their service territories.\n\nA group of environmental and renewable energy advocacy organizations asked the PSC last year to investigate the discounts.\n\nThey cite multiple reasons for closer scrutiny, including the strain these operations and their huge demand for power places on the grid, in exchange for relatively few jobs.\n\nThe cryptocurrency industry is expanding as climate experts call for the world’s power generation to rapidly decarbonize amid climate change’s increasing impacts. Utilities in Kentucky are trying to transition to lower-carbon-emission energy sources such as natural gas and renewables.\n\nAnother concern: The industry’s volatility, as already evidenced in Kentucky. Core Scientific, which has had a crypto mining operation in West Kentucky since 2019, declared bankruptcy in December. Another mining operation that set up shop in downtown Paducah moved out abruptly due to “a business decision dealing with the energy market.”\n\nThe groups asking for more scrutiny — including Kentuckians for the Commonwealth, Kentucky Solar Energy Society and the Kentucky Resources Council — question whether the jobs created by crypto mining justify the discounts and whether the discounts shouldn’t be saved for industries that would employ more Kentuckians.\n\nAlliance was promised more than $4 million in discounts while promising to create five jobs, although the utility doesn’t have a process in place to make sure those employees weren’t being double-counted from another part of Alliance’s business, according to one utility employee.\n\n“This idea of utilities providing a discount to what, by appearances, looks to be a real possibility of boom, bust — or potentially bust, and then no further boom — is very concerning,” said Josh Bills, a commercial energy specialist with the Mountain Association, a Berea-based economic development nonprofit and one of the interveners in the PSC case.\n\nAs he helps small businesses become more energy efficient and incorporate renewable energy, Bills also sees them struggle to pay electricity bils, so it troubles him when a “boom, bust” industry receives significant electricity discounts.\n\nHe said the cases before the PSC, including Alliance’s Bitcoin mine, will set precedents and that it’s important to get concerns about subsidies for crypto on the record.\n\nOn the other hand, an advocate for the cryptocurrency mining industry says such companies are being unfairly singled out for taking advantage of economic development incentives for which they qualify, while the utility that offered discounts to the Union County mine asserts it wasn’t in error for doing so.\n\nTom Mapes, the director of energy policy for the cryptocurrency mining lobbying group Digital Chamber of Commerce, said if a cryptocurrency mining company and a utility are operating within the parameters of the laws set out for the economic development incentives, they should be able to utilize those incentives. “If we’re working within the parameters of what is written out within state law or national law, why would we be judged differently?” he said.\n\nMining Bitcoin on a coal mine\n\nBecause cryptocurrency mines use a lot of power, the operators are looking for the cheapest rates possible.\n\n“Obviously, they’re going to go to where the most bang for your buck you can get in these regions, you know, the best purchasing power you have for energy or land,” Mapes said. “We’re running computers pretty much.”\n\nCoal mining also uses a lot of electricity, and Alliance’s site in Union County had some ready-made advantages, including electricity infrastructure and meters on the former coal mine site that the company planned to transfer over to use for the Bitcoin mining operation, according to emails and reports provided by Kentucky’s largest utility, LG&E and KU, to the state utility regulator.\n\nAn LG&E/KU representative who visited the Bitcoin mining site in October 2022 said the initial understanding was that Alliance would put its high-powered computers in “underground mine space” but that it was “too damp and didn’t have enough ventilation.”\n\nKentucky Utilities, a subsidiary of LG&E and KU, offered more than $4 million in discounts over several years to Alliance’s Bitcoin mining operation, a subsidiary called Bitiki-KY. Alliance promised to create five jobs and invest $25 million into the company.\n\nBitiki-KY has been running high-powered machines on a former coal mine site near Waverly in Union County since last year to mine the cryptocurrency using a constant stream of 10 megawatts of electricity, enough to power thousands of homes over the course of a year.\n\nWhether Alliance actually needed those electricity discounts as an incentive to locate at the Union County site it already owned became a central topic at a PSC hearing on May 31. Alliance did not respond to an interview request for comment about its Bitcoin mining subsidiary Bitiki-KY, which changed its legal name from Bitiki Blockchain last year.\n\nThom Cmar, a senior attorney for Earthjustice representing the environmental and renewable energy groups in the PSC case, said there normally is evidence that without such incentives, a company proposing a new facility will move elsewhere.\n\n“There’s no evidence here that they even looked anywhere outside of Kentucky Utilities territory,” Cmar said in an interview with the Lantern. “They were taking an existing site that they already owned, or that an affiliated company already owned, and just transferring it over.”\n\nIn that late May hearing, Cmar asked John Bevington, director of business and economic development for LG&E and KU: Was there specific evidence that the electricity discounts were necessary to make sure Bitiki-KY didn’t locate elsewhere?\n\nBevington said that he wasn’t aware of evidence the coal company considered potential sites outside KU’s territory and that the need to offer the discounts came over time as the utility talked with Alliance.\n\n“Our goal is to try to get customers to grow and locate here without providing any incentive. But you know, occasionally it becomes a competitive environment, and the cost considerations are necessary as they were in this case,” Bevington said.\n\nHe told Cmar that Alliance’s previous history with the site and the existing infrastructure “was definitely attractive” to the coal company.\n\nAlso during that hearing, Cmar honed in on the jobs Alliance said it would create, asking: Did the utility have evidence those five jobs were actually created?\n\nBevington, who previously worked in the Kentucky Cabinet for Economic Development, responded Bitiki-KY had “committed” to creating five jobs in its application for the incentives, but the utility didn’t have a process in place to make sure those employees weren’t being double-counted from another part of Alliance’s business.\n\nIn written testimony, Bevington added that it’s “impossible” for the utility to know exactly how many jobs a company would create through electricity discounts. He said the utility also relies on cues from state officials, such as if a company receives state tax breaks, on whether to give discounts. Bitiki-KY in March 2022 received from the Kentucky Economic Development Finance Authority (KEDFA) $250,000 in tax benefits through the Kentucky Enterprise Initiative Act.\n\nInstead of jobs being at play with these electricity discounts, Bevington said, the Bitcoin mine’s electricity usage hinges on the incentives; Bitiki-KY would likely not increase its power usage from 10 MW to 13 MW without the discounts.\n\n“[I]t is both facially plausible and consistent with my experience in economic development that an entity proposing to deploy $25 million of capital and create 13 MW of load might also create five jobs,” Bevington said in written testimony.\n\nAn LG&E and KU spokesperson declined to answer detailed questions emailed by the Lantern about how and whether the utility verifies economic development created from electricity discounts.\n\nDoes crypto benefit the community?\n\nFor Cmar, the Earthjustice attorney, Alliance’s Bitcoin mining site is a microcosm of what cryptocurrency mining companies are bringing to Kentucky.\n\n“There’s a real concern when the company comes in and says things like, ‘Well, we’re going to be creating five jobs.’ But there’s no evidence that has been presented that any significant amount of jobs have been created,” Cmar told the Lantern.. “Why should a company like this get a discount? Shouldn’t the economic development discounts be saved for other types of industries that are bringing real meaningful economic development to the area?”\n\nAlliance’s Bitcoin mining operation isn’t the only operation moving into Kentucky and receiving electricity discounts. Two of the other PSC investigations into cryptocurrency mining involve discounts provided by Kentucky Power to operations in Pike County and Lawrence County, the latter of which would build what would likely be the state’s largest such facility and have the capacity to use up to 250 megawatts of electricity. The PSC will hold hearings regarding both of those operations in July.\n\nCmar said those operations cumulatively are soaking up “all this extra electricity.”\n\n“At a time when we are working to try to transition our electric sector to cleaner forms of energy and address the imperative need to try to avoid the worst impacts of climate change by reducing emissions wherever possible, having these energy intensive — energy wasteful, really — operations coming in … has put an incredible strain on the grid.”\n\nMapes, the cryptocurrency mining lobbyist, said crypto mining operations such as in Union County still provide much needed jobs to rural communities. He also said crypto mining’s need for power will spur development of solar and wind generation to meet the demand.\n\nPaul Monsour, treasurer of the Union County Chamber of Commerce and a city council member in Morganfield, the county seat, recognizes that the five jobs created by Alliance will have a small impact compared to the company’s coal mining in the county.\n\n“It’s five more jobs than we had,” Monsour said. “But I would think the county would support mostly everything Alliance would want.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTEzL21pY3Jvc3RyYXRlZ3ktcy1tc3RyLXNheWxvci1zYXlzLWJpdGNvaW4tYnRjLW1hcmtldC1zaGFyZS13aWxsLWNsaW1iLXRvLTgw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy’s (MSTR) Saylor Says Bitcoin (BTC) Market Share Will Climb to 80% - Bloomberg",
        "content": "Bitcoin’s dominance of the cryptocurrency markets will nearly double as more investors gravitate to the original digital asset while regulators continue to crack down on the sector, according to MicroStrategy Inc.’s Michael Saylor .\n\nBitcoin currently accounts for nearly 48% of crypto’s $1 trillion market value, according to data tracker CoinMarketCap. Its dominance will rise to 80%, as other coins are declared securities by regulators and their use is reduced, Saylor said in a Bloomberg Television interview. MicroStrategy is the enterprise-software that Saylor co-founded and has made into the largest public holder of the cryptocurrency."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYnJlYWtpbmctYmFycmllcnMtaG93LWJpdGNvaW4taXMtY3JlYXRpbmctb3Bwb3J0dW5pdGllcy1mb3ItaW5zdGl0dXRpb25hbC1pbnZlc3RvcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Breaking Barriers: How Bitcoin is Creating Opportunities for Institutional Investors - Nasdaq",
        "content": "Bitcoin was created in 2009 by an anonymous person or group going by the name of Satoshi Nakamoto. The technology behind Bitcoin is known as a blockchain, which is a decentralized, public ledger that records all of the transactions on the network.\n\nWhat makes Bitcoin significant in the financial world is its unique characteristics and potential impact, one of them including decentralization. This decentralization provides several advantages, such as reducing the risk of censorship, enabling global accessibility, and fostering financial inclusion for those who are unbanked or underbanked.\n\nAnother significant feature of Bitcoin is its limited supply. Since there will only ever be 21 million bitcoins in existence, that makes it a deflationary asset. Additionally, the limited supply and the decentralized nature of Bitcoin contribute to its perceived value and the potential for price appreciation over time.\n\nUtilizing blockchain technology in Bitcoin transactions ensures transparency and immutability, thereby rendering the alteration or manipulation of transaction records a challenging task.\n\nFurthermore, Bitcoin has gained attention as an alternative investment and a diversification tool. It has attracted interest from institutional investors, hedge funds, and even some governments. This growing acceptance and adoption of Bitcoin have led to the emergence of regulated exchanges, investment products, and services around cryptocurrency.\n\nEnrico Rubboli, the CEO of Mintlayer, told Nasdaq, “Investment firms recognize Bitcoin's potential as a store of value and inflation hedge. With its limited supply and decentralized nature, Bitcoin is seen by some as a way to preserve wealth in the face of inflationary pressures and currency devaluation. This appeal is particularly relevant given the unprecedented monetary stimulus measures central banks adopt worldwide.”\n\nHowever, it is also important to note that Bitcoin also faces challenges and criticisms. Its price volatility, regulatory uncertainties, and concerns about its use in illicit activities have raised questions about its stability and long-term viability as a mainstream currency. Nonetheless, Bitcoin has undeniably disrupted traditional financial systems and sparked a broader interest in blockchain technology.\n\nIt has stimulated innovation in various industries beyond finance, including supply chain management, voting systems, and decentralized applications. The potential for old institutions to change, for people to gain financial independence, and for the global economy to challenge the status quo of centralized control make Bitcoin significant in the financial world.\n\nInstitutional adoption of Bitcoin: Key players and their motivations\n\nInstitutional adoption of Bitcoin has seen significant growth, with key players from various sectors embracing cryptocurrency. These players include financial institutions, technology companies, and investment firms, each driven by unique motivations.\n\nFinancial institutions, including banks and asset management companies, have been actively exploring Bitcoin adoption. Their motivations include:\n\nDiversification and Portfolio Management: Financial institutions seek to diversify their investment portfolios by including Bitcoin. They view cryptocurrencies as an alternative asset class that can potentially provide attractive returns and reduce overall portfolio risk. Client Demand and Retention: Many clients have expressed interest in Bitcoin and other cryptocurrencies. Financial institutions aim to meet this demand and retain their clients by offering cryptocurrency-related services and investment opportunities. Failing to address this demand could result in losing clients to competitors. Hedge Against Economic Uncertainty: Some financial institutions view Bitcoin as a potential hedge against economic uncertainty and inflation. They perceive Bitcoin's decentralized nature and limited supply as features that can protect against the devaluation of traditional currencies and safeguard wealth.\n\nRubboli shared his views on institutional investors' interests in Bitcoin, telling Nasdaq \"Investment firms, including hedge funds and institutional investors, have been attracted to Bitcoin for various reasons. Firstly, the potential for significant returns has been a major motivation.\"\n\n\"Bitcoin has demonstrated remarkable price appreciation over the years, and some investment firms view it as an opportunity to generate alpha and outperform traditional markets. The volatility of Bitcoin, although a risk, can also provide substantial profit opportunities for those with the expertise to navigate the market.\"\n\nTechnology Companies: Technology companies, particularly those involved in payment processing and digital services, have shown interest in Bitcoin adoption. Their motivations include:\n\nInnovation and Market Expansion: Technology companies strive to stay at the forefront of emerging trends and technologies. By incorporating Bitcoin into their offerings, they can position themselves as innovative players and expand their market reach. Seamless Payments: Bitcoin's blockchain technology enables fast and secure peer-to-peer transactions. Technology companies recognize the potential for seamless cross-border payments and cost-effective remittance services by leveraging Bitcoin's decentralized network.\n\nInvestment firms, including hedge funds and institutional investors, have been increasingly involved in Bitcoin. Their motivations include:\n\nPotential Returns: Bitcoin's historical price performance and volatility have attracted investment firms seeking potentially high returns. They view Bitcoin as a speculative investment opportunity that can yield significant profits if properly managed. Portfolio Diversification: Investment firms aim to diversify their investment strategies by adding Bitcoin to their portfolios. By diversifying across different asset classes, including cryptocurrencies, they can minimize risk and potentially enhance overall portfolio performance. Store of Value and Inflation Hedge: Some investment firms perceive Bitcoin as a digital store of value similar to gold. They view it as a potential hedge against inflation and a long-term investment that can preserve wealth in an increasingly digital and interconnected world.\n\nInstitutional adoption of Bitcoin is driven by motivations such as portfolio diversification, meeting client demand, hedging against economic uncertainty, innovation, market expansion, potential returns, and viewing Bitcoin as a store of value or inflation hedge. The participation of key players from various sectors signifies the growing acceptance and recognition of Bitcoin's potential impact on the financial landscape.\n\nFuture outlook for Bitcoin and institutional investors\n\nThe future outlook for Bitcoin in relation to institutional investors is promising and evolving. Institutional investors have demonstrated a growing interest in Bitcoin and cryptocurrencies, indicating a potential shift in the financial landscape.\n\nRubboli said, \"The future outlook for Bitcoin concerning institutional investors appears promising. Institutional involvement in the cryptocurrency market has been steadily increasing, and there are indications that this trend will continue. As more institutional investors recognize the potential benefits and opportunities associated with Bitcoin, we expect to see further capital inflows into the market.\"\n\nInstitutional adoption of Bitcoin is expected to continue as more institutions recognize the benefits and opportunities presented by digital assets. This increased participation brings stability, liquidity, and credibility to the cryptocurrency market, fostering a favorable environment for Bitcoin's growth and acceptance.\n\nAs institutional investors enter the space, they contribute to the overall maturation of the cryptocurrency market. Their involvement introduces professional expertise, risk management strategies, and regulatory compliance measures. This development helps to address concerns related to security, custody, and regulatory frameworks, making Bitcoin more accessible and attractive to a broader range of investors.\n\nInstitutional investors are poised to play a pivotal role in Bitcoin's future and its incorporation into the financial landscape as the cryptocurrency and blockchain sector continues to expand and regulatory frameworks change.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTQvbWljcm9zdHJhdGVneS1taWNoYWVsLXNheWxvci1iaXRjb2luLWNyeXB0by1iaW5hbmNlLWNvaW5iYXNlL9IBZ2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTQvbWljcm9zdHJhdGVneS1taWNoYWVsLXNheWxvci1iaXRjb2luLWNyeXB0by1iaW5hbmNlLWNvaW5iYXNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy founder Michael Saylor says Bitcoin could grow to 80% of crypto market after SEC suits against Binance and Coinbase - Fortune",
        "content": "MicroStrategy founder and executive chairman Michael Saylor believes the crypto industry will consolidate around Bitcoin following the Securities and Exchange Commission’s lawsuits against Binance and Coinbase.\n\nIn an interview with Bloomberg TV, Saylor said regulators “don’t have any love for crypto tokens” and have taken a narrow perspective on what a crypto exchange should be.\n\n“Their view is crypto exchanges should trade and hold pure digital commodities like Bitcoin,” he told Bloomberg. “And so the entire industry is kind of destined to be rationalized down to a Bitcoin-focused industry, with maybe a half a dozen to a dozen other proof-of-work tokens.”\n\nBitcoin’s dominance has grown in recent months, with it now making up about 48% of the crypto market, compared with 43% at the end of February, according to CoinMarketCap. Saylor thinks Bitcoin’s dominance could eventually reach 80%.\n\nThat could put exchanges in a tough spot. U.S.-based Coinbase has been trying to diversify revenue streams away from an overreliance on trading fees as regulatory pressure has decreased investor interest. If Bitcoin’s dominance grows, trading alongside a smaller stable of peers, that could further depress top-line numbers.\n\nCoinbase reported just $374 million in trading fees in the first quarter, compared with $1.013 billion in the same quarter last year, a decrease of nearly two-thirds. But in stark contrast to last year, when trading fees made up 86% of first-quarter revenue, this year it was just under half.\n\nSaylor brushed off any potential threat to exchanges should there be a consolidation around Bitcoin, insisting they’ll still have a key role to play in the industry—and in the U.S. Already, though, several exchanges and companies in the crypto space are looking abroad. Coinbase in May launched an international exchange in Bermuda, and other companies have said they’re looking for a foothold in Hong Kong as China may be warming to crypto.\n\nMany institutional investors, Saylor continued, are confused or put off by the vast array of cryptocurrencies available, and they’re more likely to invest in the sector if it becomes more Bitcoin-focused. Despite the cryptocurrency’s 4.5% slump, to below $26,000, since the SEC lawsuits were announced last week, Saylor, long a proponent of Bitcoin, remained firm.\n\n“Eventually, I have confidence that the crypto exchanges will come around to realizing that Bitcoin really is the dominant asset in this space, and their business models are fine when Bitcoin goes up by a factor of 10,” Saylor said.\n\nThe MicroStrategy founder has led the company’s strategy of accumulating billions of dollars in Bitcoin, even as he stepped down as CEO last year. As of April, the company owned about 140,000 Bitcoin, bought at an average price of $29,803, according to Saylor. Those holdings are worth $3.6 billion as of Wednesday, down about $1 billion from their value in April."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQvYml0Y29pbnMtcHJpY2UtdGhyb3diYWNrLXN1Z2dlc3RzLXBvdGVudGlhbC1mb3ItcmFsbHktdG8tMzdrLXZhbGt5cmllLWludmVzdG1lbnRzL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE0L2JpdGNvaW5zLXByaWNlLXRocm93YmFjay1zdWdnZXN0cy1wb3RlbnRpYWwtZm9yLXJhbGx5LXRvLTM3ay12YWxreXJpZS1pbnZlc3RtZW50cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Price 'Throwback' Suggests Potential for Rally to $37K: Valkyrie Investments - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy5rd3R4LmNvbS8yMDIzLzA2LzEzL2VsZGVybHktd29tYW4tc2NhbW1lZC1pbnRvLWNvbnZlcnRpbmctMTVrLWludG8tYml0Y29pbi1zcGFya3MtbGVnYWwtYmF0dGxlLWJldHdlZW4tY3J5cHRvLWtpb3NrLW1hbmFnZXItbWNsZW5uYW4tY291bnR5LXNoZXJpZmZzLW9mZmljZS_SAbcBaHR0cHM6Ly93d3cua3d0eC5jb20vMjAyMy8wNi8xMy9lbGRlcmx5LXdvbWFuLXNjYW1tZWQtaW50by1jb252ZXJ0aW5nLTE1ay1pbnRvLWJpdGNvaW4tc3BhcmtzLWxlZ2FsLWJhdHRsZS1iZXR3ZWVuLWNyeXB0by1raW9zay1tYW5hZ2VyLW1jbGVubmFuLWNvdW50eS1zaGVyaWZmcy1vZmZpY2UvP291dHB1dFR5cGU9YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Woman scammed into converting $15K into Bitcoin sparks legal battle between crypto kiosk manager, McLennan County Sheriff’s Office - KWTX",
        "content": "WACO, Texas (KWTX) - An 82-year-old Crawford woman who scammers convinced to convert $15,000 in cash into Bitcoin cryptocurrency has sparked a legal battle between the operators of the ATM-like Bitcoin machine and the McLennan County Sheriff’s Office, which seized cash from the machine and returned it to the woman.\n\nLux Vending, which does business as Bitcoin Depot, alleges in its suit that the sheriff’s office unlawfully seized the cash from one of its kiosk machines and returned the money to the woman without following proper due process procedures. The suit, filed in Waco’s 74th State District Court, asks Judge Gary C. Coley to conduct a hearing on the dispute and to declare Bitcoin Depot the rightful owner of the seized cash.\n\nNo hearing has been set in the case.\n\n“While the company is sympathetic to the victimized customer, as stated in the petition, the actions taken by the McLennan County Sheriff’s Office are unlawful and violate Bitcoin Depot’s rights under both the Texas and U.S. Constitutions,” said Houston attorney John MacVane, who represents Lux Vending. “Bitcoin Depot looks forward to making our arguments in court and seeking the return of our property.”\n\nMcLennan County Sheriff Parnell McNamara said despite the accusations in the lawsuit, his officers “did everything right” and the Bitcoin Depot officials “can go to hell.”\n\nWEB XTRA: Sheriff Parnell McNamara discusses the case and lawsuit\n\n“It’s a bunch of hogwash,” McNamara said of the lawsuit. “As far as I am concerned, they are a bunch of vultures who want to take the money back from this person who has already been victimized. I think it is a real travesty. The money does not belong to them. It was scammed. It still belongs to the lady who put it in there. So I think it is preposterous that they have filed this lawsuit.\n\n“… But it will be a cold day in hell that they get this money back from our good citizen, who has already been scammed and traumatized,” he said.\n\nThe woman who reported she was scammed did not return phone messages from KWTX on Tuesday.\n\nShe reported the elaborate scam to the sheriff’s office on April 27, and a detective got a search warrant from 19th State District Judge Thomas West on May 3 to seize the woman’s money from the Bitcoin Depot at a Sunoco store at 7500 Bosque Blvd.\n\nAccording to the search warrant affidavit, the woman said she was online looking up cooking recipes when she received an email with a link to view a recipe. She clicked the link, which the affidavit said appears to have activated a “Ransomware” computer virus.\n\nShe contacted “customer support” and was transferred to a “fraud investigator,” the affidavit states. She was told all her personal information had been compromised and that the fraud department could help her work through the problem.\n\nThe woman said she should contact her bank and law enforcement but was told it was not necessary because at that point, nothing had happened with her bank account and a “computer virus” was not something law enforcement would respond to, according to the affidavit.\n\nThe 82-year-old Crawford woman was scammed into turning $15,000 into bitcoin at a Central Texas cryptocurrency kiosk. (KWTX GRAPHIC)\n\nNext, the “fraud investigator” asked if she had written a check for a laptop. She said no, and the “fraud investigator” said a check just cleared the bank that someone wrote to pay for a laptop.\n\n“The ‘fraud investigator’ then told (the woman) he could see where a check was written to a construction company in the amount of $15,000, which had not cleared yet. (The woman) was then given instructions on how to prevent the loss of this amount of money,” the affidavit states.\n\nThe woman was told to drive to her bank, make a $15,000 cash withdrawal and then go to the store at 7500 Bosque Blvd. and deposit it into the Bitcoin machine. She said she knew nothing about Bitcoin and told the man she was going to call law enforcement.\n\n“(The woman) said the person on the phone stressed that essentially the longer she took to get the money out of the bank the closer the check could be to clearing,” the affidavit says. “(The woman) said she followed the instructions and that the guy stayed on the phone with her the entire time. (The woman) said she deposited $15,000, $100 at a time.”\n\nMcNamara said, coincidentally, that when his officers arrived to serve the search warrant on the kiosk machine, the armored car company hired to service the machine pulled up to the store.\n\n“While we were there with the search warrant, the armored car people came and we served them with the search warrant,” McNamara said. “We were going to get in the machine one way or the other because we had a legal search warrant. The $15,000 she put in the machine was still in the wallet that she had put it in. So we retrieved that $15,000 and brought it back to the office. We photographed it, put it into evidence and ultimately got it back to the victim so she wouldn’t be further traumatized by these creeps.”\n\nThe Bitcoin Depot lawsuit against the sheriff’s office alleges the search warrant “only permitted the MCSO to seize the $15,000 ‘for evidentiary purposes,’ not for return of stolen property, forfeiture, or restitution.”\n\n“Notably, Bitcoin Depot was not served with the search warrant before or at the time of execution – it only received it after the seizure had already been executed,” the suit alleges. “On May 3, 2023, Bitcoin Depot received the search warrant at issue from its armored car service contractor.”\n\nMcLennan County District Attorney Josh Tetens, whose office advised the sheriff’s office before it secured the search warrant, said he thinks the issue now is “moot” since the money was returned to the woman and is no longer in possession of the sheriff’s office.\n\nMcNamara said the disputed issue is no different than his agency recovering stolen cars, guns or four-wheelers and returning them to their rightful owners.\n\n“As soon as we possibly can, we return those stolen items to the victims, and that’s what we did in this case,” McNamara said.\n\nThe lawsuit contends that the owners of the Bitcoin Depot were not the scammer, they did nothing wrong and the money the woman put into their machine now belongs to them.\n\nMcNamara said he would like to say that the investigation is ongoing. However, he claims Bitcoin “will not work with any law enforcement.” He said officers believe the scammer in this case is in another country.\n\nMacVane, Bitcoin Depot’s attorney, disputed McNamara’s claims, saying the company “pledged to cooperate in any way possible” to assist the investigation into “catching the bad actor and recovering the Bitcoin.”\n\n“We also immediately notified law enforcement of our policy to refund our fees on this transaction to the customer,” MacVane said. “Unfortunately, in response, the McLennan County Sheriff’s Office seized the cash from Bitcoin Depot’s machine even though Bitcoin Depot had already transferred the Bitcoin as the customer instructed.\n\n“This essentially made Bitcoin Depot suffer the entire loss despite its extensive efforts and warnings to prevent this type of fraudulent activity,” he said.\n\nMacVane said in a statement that “Bitcoin Depot operates a nationwide network of Bitcoin ATM kiosks to provide crypto‐financial services and products to the community—including those who have been historically underserved by traditional financial institutions.” He said the company’s operations are heavily regulated, and it has extensive compliance and consumer protection policies to prevent fraud and illicit activity.\n\n“For example, Bitcoin Depot’s terms and conditions—which all customers must agree to—prohibit customers from sending Bitcoin to unknown digital wallets,” he said in the statement. “The company also provides numerous scam warnings at its machines in nearly every stage of a consumer transaction to prevent individuals falling victim to frauds and scams.”\n\nCopyright 2023 KWTX. All rights reserved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luYmFzZS5jb20vaW5zdGl0dXRpb25hbC9yZXNlYXJjaC1pbnNpZ2h0cy9yZXNlYXJjaC9tb250aGx5LW91dGxvb2svYml0Y29pbi1oYWx2aW5ncy1hbmQtbGlxdWlkaXR5LXByb2JsZW0tanVuZS0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Halvings and the Liquidity Problem - Coinbase",
        "content": "Introduction The economic relevance of bitcoin’s block reward halving is often viewed positively , as the event promises to enhance bitcoin’s prospective scarcity and support its supply-demand technicals. However, with only three recorded halving events in bitcoin’s history, actual evidence of how markets have reacted to these milestones is still limited. Specifically, the challenge with judging the significance of these events is that it’s difficult to disentangle the idiosyncratic nature of the halving from exogenous factors like global liquidity, interest rates and moves in the multilateral USD index. Previous bitcoin halving episodes occurred alongside some important historical monetary and fiscal developments, for example. In 2012, the Fed started to buy mortgage-backed securities and long-dated Treasuries as part of QE3. In 2016, Brexit may have stoked fiscal concerns in the UK and Europe and provided a catalyst for bitcoin buying. In 2020, global central banks and governments responded to the COVID-19 pandemic with unprecedented levels of stimulus, driving liquidity sharply higher. Detrending bitcoin price action from the movements in such factors helps elucidate the situation somewhat. However, outside of the third halving, evidence that these halving events supported bitcoin price action is not entirely clear cut. Moreover, global liquidity appears to have peaked in the near term, which further obfuscates what the net effect on bitcoin’s price behavior might ultimately be.\n\nPeak global liquidity Lower liquidity has been observed across all asset classes in recent weeks, in part due to a 3.5% decline in global central bank balance sheet holdings over the last two months. Among the Federal Reserve, European Central Bank, People’s Bank of China, Bank of Japan, Bank of Canada and Bank of England, tightening conditions have reduced this broad measure of global liquidity to $29.2 trillion as of end-May. Recall that global liquidity peaked in mid-February 2022 near $33.1 trillion, contracted by $3.8 trillion through end-2022 and subsequently picked up in 1Q23. See chart 1. Cryptocurrency performance has been tracking the movements in global liquidity more closely after the deleveraging events that took place in this space during May-June 2022. In fact, the relative differential between the drain in global central bank liquidity and reduction in the crypto market cap around that time suggests that those idiosyncratic events had around a $724B impact on the asset class. At the moment, the total crypto market cap currently represents 3.6% of our broad measure of global liquidity, in line with the average year-to-date. Part of why global liquidity increased in 1Q23 was because of the drawdown in the US Treasury General Account (TGA) balance (which we’ve previously discussed here ). That began around end-January after the US government breached its debt ceiling limit – forcing it to rely on the TGA to pay expenses without new debt issuance. That consequently lent support to a broad swathe of assets, crypto included. With a fiscal deal agreed in early June to resolve the debt ceiling, the question now becomes whether we could see market liquidity drained and markets suffer, as the Treasury rebuilds the TGA. To replenish its standing balance, the government will likely need to issue $700B on top of rolling over its existing debt, bringing the potential liquidity impact to a little over $1T over the next six months. In isolation, we estimate that that could potentially represent net losses of as much as 18-20% for the crypto asset class. However, the market impact ultimately depends on who absorbs the newly issued debt. If US banks buy these short-dated T-bills, for instance, that would drain bank reserves, reduce liquidity and strengthen the USD - hurting crypto as the price currency. If, on the other hand, money-market funds step in, the flow from their reverse repo facility (RRP) with the Fed to Treasuries would be characterized as liability transfers on the balance sheet that have limited bearing on the USD. Of course, the reality is that it’s not likely to be an “either-or” situation, and there may be other potential buyers like households and corporate treasuries that could also reduce available market liquidity by pursuing Treasuries in lieu of riskier assets. But through March to May, aggregate bank reserves with the Fed have been stable to higher despite the decline in commercial bank deposits (translating to a higher bank reserve ratio), which earn more than what they can earn in T-bill yields. We think that leaves money market funds as the biggest potential buyer here, which suggests the actual USD impact and thus the impact on cryptocurrency price behavior could be constrained.\n\nDetrending the liquidity effect If we remove the influence of global liquidity trends from bitcoin’s price behavior, it reveals a compelling narrative about how bitcoin has performed within different economic regimes. Our multivariate linear regression model is based on a rolling 6-month window, fitted against daily changes in global liquidity, interest rates and the multilateral USD index. We then extract the residual between observed bitcoin spot prices and our model-fitted values to determine if there are any discernible patterns in the “detrended” series. Factor analysis suggests that bitcoin unsurprisingly underperformed our model last year, with the greatest deviation having occurred in late June – amid solvency concerns for entities like Celsius, Three Arrows Capital (3AC) and Voyager. Bitcoin has since outperformed our model year-to-date, in part reflecting (1) its relative discount to its estimated fitted value as well as (2) improved supply-side technicals and (3) demand for its “store of value” properties as an alternative to the points of failure witnessed in the existing financial system earlier this year. See chart 3. Looking further back, this exercise is also useful for disentangling the effect of liquidity from bitcoin’s block reward halving events, which have often coincided with major episodes of central bank bond buying. Bitcoin halvings occur about every four years (or more accurately, every 210,000 blocks) as a way to manage the supply of new bitcoins in circulation, notably by halving the block reward. The next halving is expected in April or May 2024 when the block reward will be reduced from 6.25 bitcoins per block to 3.125 bitcoins per block. The first bitcoin halving occurred on November 28, 2012, which followed the Fed’s implementation of QE3 (September 2012), the third round of quantitative easing. Unlike previous rounds, QE3 involved the purchase of mortgage backed securities and longer-dated Treasuries. Around the same time (August 2012), the ECB initiated its “Outright Monetary Transactions” program in response to the financial headwinds caused by the European debt crisis, which had been ongoing since late 2009. If we examine bitcoin behavior six months prior to and six months following the first halving compared to our model, we notice that the impact of that liquidity boost had little effect. But the model residual doesn’t reflect a significant impact from the halving either, which could have been due to (1) the inefficiency of this market back then and/or (2) uncertainty over the halving’s market implications. While bitcoin prices did pick up in late 2012, they only started to appreciate in earnest in early 2013 after the US debt ceiling crisis began in January that year escalating into a budget sequestration in March. At that time, we think bitcoin’s price better reflected its value as a hedge against fiscal uncertainty. See chart 4. The second bitcoin halving occurred on July 9, 2016, which immediately followed the Brexit referendum (June 23, 2016) that led the Bank of England to resume its bond buying program. While that black swan event itself may not have unlocked significant liquidity, it’s possible that bitcoin prices may have swelled in response to the economic upheaval and volatility that it represented. Brexit also came after the ECB’s decision months earlier to extend the Expanded Asset Purchase Programme (EAPP), which had been initiated in March 2015 and scheduled to end in 2016. If we remove the effect of liquidity on bitcoin prices, our model residual does still reflect a noticeable increase during the month preceding and following the second bitcoin halving. Note that unlike the first halving, this second halving was both well-telegraphed and highly anticipated, which may have factored into the market reaction. While it’s possible that bitcoin’s fundamentals contributed to its strength at this time due to global events, we think it’s very likely that the halving had some impact on performance by enhancing bitcoin’s prospective scarcity. The third halving occurred on May 11, 2020 which followed extraordinary measures taken globally among central banks and governments in response to the COVID-19 pandemic. In late March 2020, the Fed began large-scale and open-ended bond purchases ( QE Infinity ) to support financial market stability, while the US government enacted a fiscal stimulus package known as the CARES Act . At the same time, the ECB bought bonds as part of its Pandemic Emergency Purchase Program (the European Union also introduced the Next Generation EU recovery plan - including a €750 billion recovery fund - but only in July 2020). Between March and early May 2020, bitcoin recovered the losses that it had incurred at the onset of the pandemic, converging to the fair value implied by our model. That was reflected in a declining net negative residual, which suggests that the retracement was due almost exclusively to the rise in liquidity at that time. Subsequently, that residual spiked two weeks prior to the third halving, which we believe suggests that this event did have a significant impact on bitcoin’s price action and likely accounts for the difference between the observed vs model value."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNi8xNC9iaXRjb2lucy1sYWNrLW9mLWxheWVyLTJzLWlzLWEtYmxlc3NpbmctaW4tZGlzZ3Vpc2Uv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA2LzE0L2JpdGNvaW5zLWxhY2stb2YtbGF5ZXItMnMtaXMtYS1ibGVzc2luZy1pbi1kaXNndWlzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin’s Lack of Layer 2s Is a Blessing in Disguise - CoinDesk",
        "content": "The solution to the problem with L2s is forgetting why they are needed. And it's the same reason why everyone knows about Diet Coke and only a few know about the Diet Coke supply chain or how Henry Ford got an automobile in everyone's driveway with just a few workers on the moving assembly line. In the next 10 years, we will still know about Bitcoin, Ethereum and others, but we will not know about all the L2 solutions powering their mainstream usage."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wNi0xMy9yZWd1bGF0b3JzLWhhdmUtbm8tbG92ZS1mb3ItYml0Y29pbi1vci1jcnlwdG8tc2F5bG9yLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Regulators Have No Love for Bitcoin or Crypto: Saylor - Bloomberg",
        "content": "00:00\n\nI feel like we already have clarity in terms of the US regulatory regime for now. Gary Gensler at the S.E.C. seems to want to stop any crypto companies in their tracks and either have them close their businesses down completely or move offshore. How do you think how do you think it's all playing out? Well, I think MicroStrategy is view since 2020 has been that the only institutional grade investable assets in the crypto space is bitcoin. Bitcoin is the universally, globally acknowledged digital commodity in this industry. I think it's pretty clear that the regulators don't see a legitimate path forward for crypto currencies like the stable coins, crypto securities, like the tokens mentioned. They don't they don't have any love for crypto derivatives. They don't have any love for crypto tokens. And and they have a view of crypto exchanges, which is of far constrained. I mean, their view is crypto exchanges should change, which should trade and and hold a pure digital commodities like Bitcoin. And so the entire industry is kind of destined to be rationalised down to a bitcoin focused industry with maybe a half a dozen to a dozen other other proof of work tokens. So, Michael, what happens then to the exchanges in the US, at least it seems? You know, if they're only going to offer trading in Bitcoin or other, you know, clearly pure commodity tokens, that's not going to be a great business model. Do exchanges in the US just go away? I take a different point of view there. I think there's been a lot of confusion because of the 25000 other cryptos and because of of all of the crypto securities that have been angling to position himself as the next bitcoin or a better bitcoin. So now I think that the public is beginning to realize that bitcoin is the next Bitcoin. The next logical step is for bitcoin to 10x from here and then 10x again. So eventually I have confidence that the crypto exchanges will come around to realizing that Bitcoin really is the dominant asset in this space and their business models are fine. When bitcoin goes up by a factor of 10 and you know, we can see that the dominance of bitcoin and the crypto economy as measured by coin market cap has moved from 40 to 48 percent this year alone. But I think that is the stable coins and the tokens go away that long term dominance is headed for 80 percent. And I think what you got to remember is the reason that we don't have mega institutional money flowing into this space is confusion and anxiety. When that disappears, you're going to see mega amounts of money flow into space and the business models will be just fine focused on Bitcoin. Michael, I want to ask what the future of some of these centralized exchanges does look like right now, because to your point that maybe once that confusion clears up, more institutions will come in. When you have a company like Coinbase, obviously there's a big regulatory overhang right now for normal investors in the space, not the big institutions. Do you see them moving away from these sort of centralized exchanges, maybe gravitating more towards cold wallets from here? Well, you know, I I think that there is a massive need for exchanges to help people acquire Bitcoin in custody, bitcoin, especially as the pension funds, the insurance companies, the banks, the institutional investors get into the space. Companies like grayscale need to have a custodian. So. So I see a lot of bullish things for bitcoin on the horizon. I think the accounting treatment, the upcoming having the explosion and the half hour hash rate and also the clarity that has come out of the S.E.C. of late is actually laying the foundation for the next bull run. And and there is a place for crypto exchanges to help people buy bitcoins, sell bitcoin, custody, bitcoin, and. And I don't think that's going away. I think that's going to be a great business. Michael, how does MicroStrategy actually accumulate its bitcoin and has that process changed at all? We use a variety of of institutional grade bitcoin companies, we work with Coinbase and we have work with Coinbase. We have a number of institutional grade custodians as well. MicroStrategy has been kind of special in this regard because unlike, say, an ETF or the like, we're able to access the Bitcoin spot markets and hold Bitcoin. And we're also able to access the equity in the debt markets as we pursue our Bitcoin acquisition strategy. How is. I mean, you've outperformed Beto and Gray Scale and other, you know, ETF exchange traded products year to date. How how is your strategy, though, in your company different from one of these, you know, products that just hold large amounts of bitcoin? Well, we're an operating company, so we have a profitable software business and so we can sweep the cash flows of our software business into Bitcoin. Our aim is, is to allow institutional investors to get bitcoin exposure, but without charging them a fee and generating a yield when we can. And because we're able to tap the debt markets, we're able to issue debt. We're also able to refinance or pay back our debt like when we retire our silver gate loan earlier this year. We're able to issue equity when it's a creative we're able to purchase bitcoin with with cash flows when it's a creative. So those are our flexibilities you have as an operating company. If you were in FCC 40 company like an ATP or like grayscale as a trust, you can't really do those things. And I mean, the result is, you know, Bitcoin is up 55 percent this year to date. MicroStrategy is up 92 percent this year to date."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8xNC9iaXRjb2luLW1pbmVyLWNydXNvZS1lbmVyZ3ktc2VjdXJlcy01MC1idGMtb24tbmV3bHktbGF1bmNoZWQtbGlxdWlkaXR5LXBsYXRmb3JtLWJsb2NrLWdyZWVuL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8xNC9iaXRjb2luLW1pbmVyLWNydXNvZS1lbmVyZ3ktc2VjdXJlcy01MC1idGMtb24tbmV3bHktbGF1bmNoZWQtbGlxdWlkaXR5LXBsYXRmb3JtLWJsb2NrLWdyZWVuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Crusoe Energy Secures 50 BTC on Newly Launched Liquidity Platform Block Green - CoinDesk",
        "content": "The platform currently hosts 40% of the largest publicly traded bitcoin miners and is onboarding more every week, said Hess. It is also working on a sustainability evaluation framework for miners' operations. There is a \"growing demand for green BTC among LPs, who are even willing to pay a premium for it,\" said Hess."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQvYml0Y29pbi1zaW5rcy10by0yNTVrLWFsdGNvaW5zLXR1bWJsZS1hcy1pbnZlc3RvcnMtc2hydWctb2ZmLWZlZC1yYXRlLWhpa2UtcGF1c2Uv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQvYml0Y29pbi1zaW5rcy10by0yNTVrLWFsdGNvaW5zLXR1bWJsZS1hcy1pbnZlc3RvcnMtc2hydWctb2ZmLWZlZC1yYXRlLWhpa2UtcGF1c2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Sinks Below 25K, Altcoins Tumble, as Investors Shrug Off Fed Rate Hike Pause - CoinDesk",
        "content": "Still, in an email to CoinDesk, Markus Levin, co-founder of blockchain geospatial oracle system XYO Network, struck an upbeat note, writing that “the global macro setup is shifting significantly,” with the “rate-hike pause the clearest indication yet of this shift. Inflation is falling fast. Global central banks are injecting liquidity to stimulate their economies. And now the focus is on growth and whether we’ll actually experience a broad-based and deep recession.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTMvYml0Y29pbi1taW5lcnMtdHJhbnNmZXItMTc0bS13b3J0aC1vZi1jb2lucy10by1leGNoYW5nZXMtaW4tdHdvLXdlZWtzL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTMvYml0Y29pbi1taW5lcnMtdHJhbnNmZXItMTc0bS13b3J0aC1vZi1jb2lucy10by1leGNoYW5nZXMtaW4tdHdvLXdlZWtzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Transfer $174M Worth of Coins to Exchanges in Two Weeks - CoinDesk",
        "content": "Further, increased miner transfers are often taken to represent confidence in bitcoin's price prospects. The logic here is that miners' profitability is closely tied to bitcoin's price and so they step up their sales when they feel the market is strong enough to absorb extra supply. This is akin to a central bank of a current account deficit nation buying U.S. dollars in the open market when the greenback is on the offer across the board. That way it is able to build reserves without risking local currency depreciation."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzE0L2ZlZC1sZWF2ZXMtcG9saWN5LW9uLWhvbGQtZW5kaW5nLWxvbmctc3RyaW5nLW9mLXJhdGUtaGlrZXMv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDYvMTQvZmVkLWxlYXZlcy1wb2xpY3ktb24taG9sZC1lbmRpbmctbG9uZy1zdHJpbmctb2YtcmF0ZS1oaWtlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Fed Leaves Policy on Hold, Ending Long String of Rate Hikes - CoinDesk",
        "content": "Speaking at his post-meeting press conference, Fed Chair Jerome Powell reiterated the central bank's commitment to bringing inflation down to its 2% target and said nearly all FOMC members – despite today's pause – expect more rates hikes this year. However, he noted, the full effects of the Fed's previous tightening have yet to be felt in the economy. Concerning the chances of rate hikes resuming at the July FOMC meeting, Powell said no decision has yet been made."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzEzL3VzLWNwaS1pbmZsYXRpb24tc2xvd3MtdG8tMDEtaW4tbWF5LWJpdGNvaW4tcmlzZXMv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDYvMTMvdXMtY3BpLWluZmxhdGlvbi1zbG93cy10by0wMS1pbi1tYXktYml0Y29pbi1yaXNlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "U.S. CPI Inflation Slowed to 0.1% in May; Bitcoin Rises - CoinDesk",
        "content": "This latest news on inflation comes one day ahead of the results of the U.S. Federal Reserve's monetary policy meeting. Prior to this morning's numbers, market participants had priced in about a 76% chance the Fed will end up pausing what's become an historic string of rate hikes dating back to March 2022. In the few minutes after the news hit, the chance of a pause has risen to 79%."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LndidXIub3JnL25ld3MvMjAyMy8wNi8xMy9ibG9ja2NoYWluLWZpbmFuY2UtbW9uZXktaW52ZXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Why Boston financial giants are still into crypto despite rocky times - WBUR News",
        "content": "It’s been a tumultuous time for cryptocurrencies. Just this month, the Securities and Exchange Commission filed charges against two prominent crypto trading sites, Binance and Coinbase. In November, the second largest exchange, FTX, collapsed after allegations of fraud.\n\nInvestors lost billions of dollars when the value of their digital coins dipped after recent crypto crashes. So understandably, many investors and spectators have soured on crypto.\n\nBut cryptocurrency and its underlying technology, blockchain, still have a lot of fans in the Boston area. That includes big financial players such as Fidelity Investments and State Street Corporation, which are continuing to invest in digital assets, including cryptocurrencies.\n\n\"We believe that there's value in this technology,\" said Ramine Bigdeliazari, director of product at Fidelity Digital Assets, a Fidelity subsidiary. \"We've heard from our clients that they want access to this,\" he said, and Fidelity aims to give them a more reliable way to dip into crypto.\n\nFidelity Digital Assets Director of Product Ramine Bigdeliazari, at Fidelity's offices on Summer Street in Boston. (Robin Lubbock/WBUR)\n\nFidelity was an early investor in crypto. The company started mining the most popular cryptocurrency, Bitcoin, in 2014 — and still mines it to this day.\n\nDespite all the recent negative news about cryptocurrency, Fidelity Digital Assets last year added the option to hold and trade a second digital coin, Ether. It's the second most popular cryptocurrency.\n\n\"In order for us to understand it, we have to use it and have to be in the industry,\" Bigdeliazari said. \"We're starting to see more and more of the large participants in the existing financial markets start to do the same. I don't think you can ignore it.\"\n\nAnother large Massachusetts participant that isn't ignoring the more than $1 trillion crypto market, State Street, is also increasing its investment.\n\n\"We've actually made more investment, I think, in the last few months than we did in the first few years I was here,\" said Jay Biancamano, who leads the digital funds team at State Street.\n\nBiancamano said last year’s FTX meltdown slowed some investors down. But many clients are still crypto-curious. That's why, Biancamano said, State Street is planning to increase options to invest in crypto by the end of this year.\n\nThe top of the State Street Financial Center in downtown Boston. (Jesse Costa/WBUR)\n\nBig companies like State Street are betting this type of tech will one day transform the financial industry. Biancamano envisions a future where blockchain and digital currency are part of daily life — and it's much easier to move between different types of investments.\n\nImagine walking into a Starbucks, he said, \"and you are actually able to pay for your Starbucks coffee by liquidating a portion of your Apple stock.\"\n\nUltimately, large financial firms want to offer more investments for their clients. That's how they make money. Going digital opens up a whole world of new possibilities. In addition to cryptocurrencies, there are now investments like digital art, digital real estate and new companies building on blockchain.\n\nBut working with a group of largely unregulated assets has been challenging for legacy companies, and an onslaught of investor losses and fraud has underscored the riskiness of these investments. According to a recent Pew poll, 75% of Americans who’ve heard of cryptocurrency said they don’t trust it.\n\nCrypto has also earned the ire of powerful skeptics, such as Massachusetts U.S. Sen. Elizabeth Warren, a Democrat, who called this type of digital money a \"potential threat to financial stability.\"\n\nLynne Marlor, chair of the Boston Blockchain Association, said unlike new, nimble startups that have been able to \"fly under the radar,\" legacy companies can't avoid scrutiny from regulators and investors. \"These financial institutions cannot fall under the radar,\" she said.\n\nBut Marlor added the slower, more careful approach to crypto and other digital investments could be an advantage for companies like Fidelity and State Street.\n\n\"In my mind, they are the best prepared because they have taken the traditional financial markets, and they understand them,\" she said. \"Now they're taking them and creating innovative ways [of doing business].\"\n\nAfter all, she acknowledged, the \"average consumer\" still doesn't understand digital investments. Companies with long track records have earned a level of trust among the general public. They may be in a good position to help broaden the appeal of digital assets.\n\nEditor's note: This story has been updated to include the full corporate names of both companies and to clarify that Fidelity added the option to hold and trade Ether through its digital assets subsidiary, Fidelity Digital Assets."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTMvYml0Y29pbi1zZWVzYXdzLWJhY2stdW5kZXItMjZrLWFmdGVyLWNwaS1hcy1pbnZlc3RvcnMtYXdhaXQtZmVkLXJhdGUtaGlrZS1kZWNpc2lvbi_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8xMy9iaXRjb2luLXNlZXNhd3MtYmFjay11bmRlci0yNmstYWZ0ZXItY3BpLWFzLWludmVzdG9ycy1hd2FpdC1mZWQtcmF0ZS1oaWtlLWRlY2lzaW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Seesaws Back Under $26K After CPI, as Investors Await Fed Rate Hike Decision - CoinDesk",
        "content": "“The technical definition of a recession is two consecutive quarters of negative growth,” he wrote. “As such, if GDP growth continues declining in Q2, the U.S. will find itself on shaky ground. The Central Bank will be forced to divert its mission from reducing inflation to avoiding a recession, especially with the start of the 2024 US presidential election campaign just around the corner. With interest rates at current levels, we believe this is a realistic goal, but higher rates could end up being the last straw.”"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZS1hcHAtc3RvcmUtc2F5cy1kYW11cy0xNDExMTg1NDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Apple App Store Says Damus Has 2 Weeks to Cut Bitcoin Tipping or Get Booted - Yahoo Finance",
        "content": "Decentralized social networking app Damus was today warned by Apple’s App Store that it has fourteen days to bring its tipping feature into compliance or it will face removal from the app store, according to a tweet by Damus on Tuesday.\n\nDamus’s tipping function—known as \"zaps\"—lets users send Bitcoin to their favorite content creators via the blockchain’s second-layer Lightning Network, but the feature appears to have fallen foul of Apple’s terms by not using the tech giant’s in-app purchase mechanism.\n\nApple has given Damus until June 27 to bring its app into compliance or it will be removed from the store.\n\nDamus will be removed from the app store in 14 days, apple says zaps are not allowed on their platform because they *could* be used by content creators to sell digital content. This is right before we’re about to give our talk at the oslo freedom forum on how decentralized social… pic.twitter.com/uAK1U0UBet — Damus⚡️ (@damusapp) June 13, 2023\n\nDamus described the move as “pretty sus” given the timing: right before the team appears at Oslo’s Freedom Forum to talk about how Bitcoin and decentralized social media can help bring about financial freedom.\n\n\"They are trying to make the argument that since zaps potentially enable content creators to sell digital content with Lightning, this would be against their guidelines,\" Damus developer William Casarin told Decrypt. \"This threatens any app on the app store that interacts with Lightning in any way.”\n\nHe further explained that while Damus was not explicitly enabling the sale of digital content through Bitcoin, today’s clampdown on peer-to-peer payments means that “any app that allows users to post lightning invoices may suffer from the same line of reasoning.\"\n\nApple’s 30% slice on NFTs\n\nThis isn’t the first time that Apple’s app store has found itself at loggerheads for control over emerging technology.\n\nStory continues\n\nAt the end of 2022, the iPhone maker began charging its standard 30% commission on in-app NFT sales, a move which industry Epic Games CEO Tim Sweeney at the time called “grotesquely overpriced.”\n\nApple’s hefty cut once again made headlines this year. This time in connection with OpenAI’s famous ChatGPT chatbot. The machine learner’s progenitors opted to remain compliant with the App Store’s terms, opting for the in-house in-app purchase mechanism rather than setting up a separate subscription site.\n\nOpenAI may not mind playing ball, but federal law appears to partially be in Apple critics’ favor.\n\nEpic Games filed a lawsuit against Apple over its 30% tax back in 2020. Recently, the U.S. federal appeals court ruled that while Apple breached California’s Unfair Competition Law by forbidding alternative payment methods, it did not break U.S. antitrust laws.\n\nBoth parties last week asked the court to reconsider its ruling."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi10cmFkZXJzLWF3YWl0LWZlZC1kZWNpc2lvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC)Traders Await Federal Reserve Decision - CoinDesk",
        "content": "Bitcoin supply on crypto exchanges has slipped to its lowest levels since February 2018, data from on-chain analytics firm Santiment shows. The decline has been particularly considerable since the SEC’s lawsuits against Coinbase and Binance earlier this month, with 6.4% of supply leaving exchanges in the past week. Supply has been steadily falling since 2020, when it peaked in the depths of the then-bear market, the data shows. This action suggests traders and investors have been continually taking their bitcoin off exchanges in favor of self-custody, said Santiment."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE1L2ZpcnN0LW1vdmVyLWFzaWEtbGFyZ2UtYml0Y29pbi1ob2xkZXJzLWNvbnRlbnQtdG8taG9sZC1sb25nLXBvc2l0aW9ucy1hbWlkLXJlZ3VsYXRvcnktdHVybW9pbC_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8xNS9maXJzdC1tb3Zlci1hc2lhLWxhcmdlLWJpdGNvaW4taG9sZGVycy1jb250ZW50LXRvLWhvbGQtbG9uZy1wb3NpdGlvbnMtYW1pZC1yZWd1bGF0b3J5LXR1cm1vaWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Large Bitcoin Holders Content to Hold Long Positions Amid Regulatory Turmoil - CoinDesk",
        "content": "BTC was recently trading at about $25,171, off 3.1% over the past four hours, part of a wider crypto selloff. The largest cryptocurrency in market value had been traveling comfortably just below $26,000 for much of the past five days as markets awaited the latest interest rate decision by the U.S. central bank and continued to chew over last week's U.S. Securities and Exchange lawsuits against crypto exchanges Binance and Coinbase."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTMvY2hhdGdwdC1zdHlsZS1jcnlwdG8tYXBwLXNldHMtYWktbG9vc2Utb24tZmVkLXJhdGUtYml0Y29pbi1wcmljZS1yZWxhdGlvbnNoaXAv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8xMy9jaGF0Z3B0LXN0eWxlLWNyeXB0by1hcHAtc2V0cy1haS1sb29zZS1vbi1mZWQtcmF0ZS1iaXRjb2luLXByaWNlLXJlbGF0aW9uc2hpcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "ChatGPT-Style Crypto App Sets AI Loose on Fed Rate-Bitcoin Price Relationship - CoinDesk",
        "content": "“We add in our own datasets and signals,” he said in an interview with CoinDesk. “When looking at [the] bitcoin price the day after the last 10 Fed rate announcements, I can then ask what else impacts the price. So that could be indicators of social sentiment around bitcoin and whale transactions over $100,000, for example.”"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzEzL2JpdGNvaW4taW5mcmFzdHJ1Y3R1cmUtZmlybS1ibG9ja3N0cmVhbS10by11bnZlaWwtaXRzLWxvbmctYXdhaXRlZC1taW5pbmctcmlnLWluLTNxLW9mLTIwMjQv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMTMvYml0Y29pbi1pbmZyYXN0cnVjdHVyZS1maXJtLWJsb2Nrc3RyZWFtLXRvLXVudmVpbC1pdHMtbG9uZy1hd2FpdGVkLW1pbmluZy1yaWctaW4tM3Etb2YtMjAyNC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Infrastructure Firm Blockstream to Unveil Its Long-Awaited Mining Rig in 3Q of 2024 - CoinDesk",
        "content": "In January 2023, Blockstream raised $125 million to expand mining operations, and says it plans to raise even more capital to fund its mining business. The new ASIC was originally slated for a 2022 launch but Back now anticipates having the miner available in the latter half of 2024."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXRvcC0xMC1jcnlwdG8tMDA1MTI5NzM0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether, top 10 crypto in red amid thinner trading, Fed warning of more rate hikes - Yahoo Finance",
        "content": "Bitcoin fell in Thursday morning trading in Asia, dropping below US$25,000 at one stage for the first time since mid-March. Ether also retreated with other top 10 non-stablecoin cryptocurrencies as trading volumes dipped and the U.S. Fed left interest rates unchanged as expected, but warned of more hikes this year to tackle inflation. Ripple’s XRP token fell despite the release of documents this week that were expected to help the company’s defense in an SEC lawsuit.\n\nCrypto in red\n\nBitcoin fell 2.94% over the last 24 hours to US$25,062.60 at 6:30 a.m. in Hong Kong, losing 4.69% in the last week, according to CoinMarketCap data. The world’s largest cryptocurrency, with a market capitalization of about US$490 billion, dipped below the US$25,000 support line to as low as US$24,902 earlier in the morning.\n\nEther fell 4.74% to US$1,652.25, posting a 9.70% loss for the week. All other top 10 non-stablecoin cryptocurrencies fell, according to CoinMarketCap.\n\nCardano dropped 4.10% to US$0.2624, losing 18.57% of its value in the past seven days. Solana fell 3.18% to US$14.44 and posted a weekly loss of 22.52%.\n\nThe two tokens have been on a downtrend since being named in the SEC’s lawsuit filed last week against the Binance.US and Coinbase exchanges, where the federal agency categorized the two — along with many other altcoins — as financial securities.\n\nBenjamin Stani, the director of business development and sales at crypto trading platform Matrixport, said the declines are mostly the overhang from the SEC suing Binance and Coinbase.\n\n“It’s been predominantly the altcoins that have been dropping,” said Stani. “BTC and, to some extent, ETH as well have been holding up better and that I think is mostly attributable to the fact that the SEC named a lot of [altcoins] as securities and that has this chilling effect.”\n\nThe U.S. Federal Reserve left interest rates unchanged as expected on Wednesday at 5% to 5.25% after ten consecutive hikes to curb inflation.\n\nStory continues\n\nBut in another negative for investors, Fed chair Jerome Powell said it may take years to get inflation under control, dousing expectations for rate cuts later this year and raising the likelihood of higher interest rates ahead. Stocks ended mixed.\n\nRipple’s XRP token led the losers in the crypto top 10 by market capitalization, falling 7.48% to US$0.4793 on the day for a weekly loss of 7.19%.\n\nThe declines came despite the release of the so-called “Hinman documents,” this week, a collection of previously sealed emails and pages from former U.S. Securities and Exchange Commission director William Hinman. The notes indicate that Ether should not be categorized as a financial security.\n\nRipple Labs Inc. was sued by the SEC in December 2020 on allegations XRP was sold as an illegal unregistered security. Ripple wanted the Hinman documents made public, arguing they show the SEC itself was sending mixed and confused signals over whether cryptocurrencies were securities and failing to offer clear guidance to the industry, which is part of Ripple’s fair notice defense in the case.\n\nHowever, XRP’s price hasn’t benefited from the release of the documents. Gabriel Shapiro, a U.S.-based attorney and the general counsel at blockchain firm Delphi Labs, wrote on Twitter Tuesday — “​​Hinman emails are a nothingburger though great for Ether. No idea why Ripple thinks these emails help Ripple’s case.”\n\nShapiro added that the documents were not the bombshell compared to the “huge hype” given to them.\n\nThe total cryptocurrency market cap lost 2.76% to US$1.02 trillion in the last 24 hours, and the daily crypto trading volume fell 5.37% to US$31.89 billion, according to CoinMarketCap data.\n\nNFT on downtrend\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index lost 0.86% to 2,912.74 in the 24 hours to 7:30 a.m. in Hong Kong. The index is down 10.64% for the week.\n\nTotal NFT transactions rose 0.13% to US$23.7 million, while sales on Ethereum, the leading blockchain by volume, fell 4.78% over the last 24 hours to US$13.52 million, according to CryptoSlam data.\n\nThe Bitcoin network was the second largest NFT network in terms of transactions, rising 6.95% to US$4.1 million in the last 24 hours.\n\nThe recent buzz in the NFT community is around ERC-6551, according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News. ERC-6551 is the latest NFT standard for the Ethereum network that went into effect on May 7 this year.\n\n“ERC-6551 is introducing a standard for NFTs by unlocking their ability to be a smart wallet that can interact with different decentralized apps in the Ethereum ecosystem,” Petscher explained. “With ERC-6551, when you transfer an NFT, the wallet and the tokens that the NFT holds also goes with it. Basically wallets within wallets.”\n\nAbout 196 million of Blur tokens worth around US$62 million, 40% of the circulating supply, are being unlocked and distributed to investors and contributors on Wednesday, U.S. time. Blur is the native utility and governance tokens of the Blur NFT marketplace.\n\n“[This] will almost definitely cause a crash in price, which will impact NFT prices,” Petscher said. “Basically, if the token is devalued, will people still want to farm for it via trading NFTs?”\n\nTransactions of Uncategorized Ordinals — unique digital assets on the Bitcoin network that are not identified as part of one established collection — topped sales by collection, selling US$3.14 million in the last 24 hours.\n\nEthereum-based BoringPunks marked second with US$1.63 million in sales, with over 20,000 transactions in the past day.\n\nU.S. equity futures edge down\n\nImage: Envato Elements\n\nU.S. stock futures edged down as of 11:00 a.m. in Hong Kong after a mixed regular trading day on Wednesday. Dow Jones Industrial Average futures fell 0.09%, S&P 500 futures edged 0.06% lower and Nasdaq Futures lost 0.09%.\n\nThe U.S. central bank left interest rates unchanged at 5% to 5.25% after its meeting on Wednesday. The rate is at its highest since 2006 after ten consecutive hikes that started in March 2022 to slow the pace of inflation that surged to 40-year highs at one stage last year.\n\nHowever, post-meeting comments from Powell hinted at two more rate hikes by the end of this year, while stating that rate cuts will not happen unless inflation is under control. That didn’t go down well with some business leaders.\n\n“The battle against inflation is being won. This is now the time for the Fed to stop – not pause – interest rate hikes,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an email statement.\n\n“The time lag for monetary policies is notoriously long — it typically takes about 18 months to two years for the full effect of rate hikes to filter fully into the economy,” Green said, adding that excessive rate hikes could lead to a recession in the U.S.\n\nThe next Federal Open Market Committee meeting is scheduled for July 25 to 26.\n\nThe CME FedWatch Tool predicts a 30.6% chance the Fed will leave rates as is at July’s meeting, while 69.4% says the Fed will raise interest rates by 25 basis points.\n\n(Updates with equities section)"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvcmVhbC1iZWRmb3JkLXNvY2Nlci10ZWFtLXB1dHMtYml0Y29pbi1vbi10aGUtbWFwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Peter McCormack's Real Bedford Football Club puts Bitcoin on the map - Cointelegraph",
        "content": "Buying a small-town soccer club with the aim to propel it into the Premier League — the world’s most popular football league — is a script suitable for a Netflix series.\n\nIn fact, actor Ryan Reynold’s bid to revitalize lower-league Welsh soccer team Wrexham FC has already caught the attention of Disney+ writers.\n\nIt’s a quaint, quintessentially British underdog story of how an ultra-rich Hollywood actor can do something different with his wealth. However, Reynolds has no connection to Wrexham; he flies in for most games, and he’s unlikely to live out the rest of his days building out the deprived historic mining town.\n\nThe story has netted mainstream media attention from the likes of the BBC, the Guardian and Sky News.\n\n\n\nIn the Bitcoin world, a similar story is unraveling. However, it’s spearheaded by a local boy who’s using Bitcoin not only to boost the Real Bedford Football Club but his hometown as well.\n\nMcCormack holding a trophy.\n\nIn the Bitcoin world, Peter McCormack is a familiar face, hosting the popular podcast What Bitcoin Did. According to the Guardian and the BBC, he is a blogger and “crypto guru” invariably betting on Bitcoin.\n\nOver the past two years, he has strived to turn around the beleaguered Bedford FC by using Bitcoin. Real Bedford reached promotion in May, buoyed by new uniforms, new logos and, crucially, a new legion of fans.\n\nHowever, Real Bedford is also what McCormack calls the “Bitcoin football team.” Not only does he achieve his boyhood dream of running a successful football team, but it also seeks to discretely encourage fans and onlookers to engage with the world’s largest digital currency, Bitcoin.\n\nBut does the club have the legs to make it into the Premier League? And what’s the point of putting the Bitcoin logo on the shirt, hosting Bitcoin meet-ups before every game, and inviting key opinion leaders of the Bitcoin world to games? And what on earth must the locals think of the “orange-pilled” takeover?\n\nMcCormack bought Bedford FC in 2021 during the heady highs of the bull run when BTC was comfortably above $40,000 and talk of the Bitcoin price hitting six figures dominated Cointelegraph headlines. Propelled by the high Bitcoin prices, the club secured half a million dollars in sponsorship for the first year.\n\nMedia treatment\n\nDespite buying the club being a boyhood dream, most people thought McCormack was mad to take on the running of a football club with the fanbase garnered from a volatile digital currency:\n\n“I think this is one of these projects whereby I don’t think anyone really understood at the start. They’re like, ‘Whatever doesn’t make any sense.’”\n\nLocal media thought McCormack was crazier still. The BBC and other British mainstream media caught wind of the story, characterizing it as the latest crypto bro to splash out on a self-indulgent purchase.\n\nJeff Booth, the author of the Bitcoin book The Price of Tomorrow, tells Magazine that even if it is a wealthy Bitcoin investor splurging on a passion, it’s a non-issue — particularly becasue Bitcoin is part of the project:\n\n“Through his interests, he infects others through so other people that like football. Other people that want to follow his interests to take this to a championship, Premier League and everything else, now have an impression that they can join the ride and be part of it.”\n\nUltimately, Booth explains, “I couldn’t care less what he wants to do. […] He’s using this vehicle to be able to advance a whole bunch of other stuff, which is really cool.”\n\nDespite the critical treatment in the media, two years on, McCormack and his team are still wiping down tables in the clubhouse bar, traveling to away games, hosting Bitcoin meet-ups and even washing the Real Bedford’s uniforms in his home — all while the price per BTC has crashed and Bitcoin continues to take a beating in popular media. Plus, the club will sport a women’s team with plans to expand into disabled and youth teams.\n\nReal Bedford commentator Will Roberts compares McCormack to a “pantomime villain […] who sort of comes in and radicalizes everything, changes everything, and everyone automatically goes against it.” It’s only natural that it ruffles a few feathers:\n\n“But the closer you get, the more you understand what a good person he is and what a good organization he’s running because it is an organization — not just a football club.”\n\nBitcoin branding\n\nThe club’s Bitcoin branding isn’t very subtle. The strips are bright orange with the Bitcoin logo on the abdomen. The club was established during a block height as opposed to a date, and almost everything can be bought or paid for in satoshis. Why bother? Why go to great lengths to advertise a volatile digital currency that’s understood by a select group of Brits?\n\nMcCormack is a marketer by profession, and Bitcoin is one of the most recognizable brands worldwide. There are now Real Bedford supporters clubs in Ghana, Tanzania and even Malaysia. The supporter base for Real Bedford rivals teams five divisions higher, and matches are live-streamed and enjoyed by Bitcoin advocates worldwide.\n\nSatoshi’s name and a nod to the maximum number of Bitcoin, 21 million, on the team’s kit.\n\nGandalf (not his real name), who is part of the marketing team at Bitcoin mining company Braiins, tells Magazine:\n\n“If you just bought Bedford and called it Bedford and it was just the local team, we wouldn’t all be here. Like, he’s been very clever about making it a Bitcoin thing, and then that gets new support and new attention into the club.”\n\nA local elected councilor for the Liberal Democrats, Jake Simpson attends the last game of the season. He explains to Magazine that, thanks to the Bitcoin takeover, Bedford is gaining “international attention, which is bringing international money. And you know, when your business and you accept cryptocurrencies, your customer base expands massively.”\n\n“You know, you’re attracting more people, which is why there are so many international people here already because they’re interested in cryptocurrency — they’re interested in Bitcoin, which is bringing them here to Bedford.”\n\nBitcoin puts places on the world map — from Bitcoin Beach in El Zonte to Bitcoin Lake in Guatemala or Bitcoin Jungle in Costa Rica. In doing so, it can raise up less economically advantaged communities and regions around the world. That’s the second part of the Real Bedford story, as McCormack says he wants to “raise up his town.”\n\nWhat do the locals think?\n\nOver the course of 30 street interviews conducted in Bedford, the overarching sentiment toward Bitcoin is negative. One Christian preacher says that the surveillance element to digital currencies was unnerving — before realizing that he might be confusing CBDCs, or central bank digital currencies, and Bitcoin.\n\nThere’s a huge sentiment gap between the Bitcoin believers and the Bedford locals. One Bedfordian simply says, “Avoid”; others call it an outright scam and that they wouldn’t want to lose their money in such a scheme. Some locals have heard of the Real Bedford takeover; others knew of McCormack’s story.\n\nFew locals can accurately explain what Bitcoin is or what it does — highlighting that some of the criticism could come from a position of ignorance or an unwillingness to engage with the currency frequently labeled a threat to the environment or a “dark tool” by mainstream media.\n\nMcCormack is aware of the negative views that cloak Bitcoin. There is no desire to “force Bitcoin” onto the people of the town — it’s about using the team as a Trojan horse for greater levels of Bitcoin adoption:\n\n“I don’t want people buying it and losing money and don’t force it on people who come to the ground. They can see it, they can come to our meetups, but it’s a soft touch.”\n\nThe Real Bedford website, for example, shows a statement saying, “Why you shouldn’t buy Bitcoin.”\n\nReal Bedford’s reasons not to buy Bitcoin.\n\nSome of the locals are converts, however. Sampson says, “It’s great to see Bitcoin come into my town. […] It’s massive, and it just makes me feel really proud to be from Bedford and makes me really excited, to be honest.”\n\n“I think they’ve still got to be a lot of education around it. On how, you know, my mom or my dad can go to a coffee shop and buy Bitcoin. They wouldn’t feel comfortable about doing that yet. But that sort of thing happening in the town can only boost an economy in a way.”\n\nWhat’s the score so far?\n\nAs opposed to bleating about Bitcoin to Bedfordians, McCormack has firmly stuck a flag in the ground and called Bitcoin advocates around the world to visit:\n\n“I don’t talk about Bitcoin much here because Bedford’s a deprived town, and I don’t want people thinking, ‘Oh my God, there’s that guy who’s made some money on Bitcoin.’”\n\n\n\nHowever, that hasn’t stopped fans — of Bitcoin or the team — from taking Bitcoin adoption into their own hands.\n\nFrom the trunk of a car in the Real Bedford parking lot, Chris Gordon of Bitcoin payments service Bridge 2 Bitcoin shows a local Bedfordian how to accept Bitcoin. He tells Magazine:\n\n“So, it was a business owner who’s interested in accepting Bitcoin payments, and it’s a completely new concept to him. So, it so happens that I happen to have a point-of-sale device in the back of the car.”\n\nGordon talks the local fan through the options in the hope that a “few businesses in Bedfordshire start to accept Bitcoin soon.” Bitcoin is already the payment of choice in the clubhouse, and for Real Bedford merchandise — and given that paying in Bitcoin looks different from paying with Visa or cash — it can raise some eyebrows.\n\nMoreover, the mingling of both Bitcoin and soccer fans in a relaxed, pitchside environment is an opportunity for those unfamiliar with the cryptocurrency to ask questions. Matches can be long, drawn-out affairs of 0-0 draws lasting 90 minutes with a 15-minute break. Asking about the giant B on the players’ shirts or the fact that the club was founded at a block height — not on a date — could pass the time.\n\nCrypto own goal?\n\nBitcoin’s market cap is roughly half a trillion dollars. Crypto, however, has a far greater fanbase and is worth over $1 trillion.\n\n\n\nReal Bedford, however, is a Bitcoin-only club. Its Twitter page is against fan tokens, NFTs and DAOs — the entirety of the crypto world outside Bitcoin.\n\nCommentator Roberts, who knew “nothing” about Bitcoin prior to working at Real Bedford, explains that the people of Bedford are “getting there.”\n\n“A lot of people are made further aware of potentially the differences between not just grouping cryptocurrencies tougher — and that Bitcoin is definitely a separate entity to that.”\n\nThe crypto distractions at the club are sponsors. Gemini, Casa and other crypto company logos are displayed on billboards around the stadium, which McCormack hopes to expand and renovate through Bitcoin sponsorship. Despite his devotion to Bitcoin, he’s aware that taking advantage of the speculation in crypto could benefit the club:\n\n“If I did a shitcoin, I could raise a billion, and I would get this club in the Premier League in nine years because you have the money to do it. I could build a 200-million-pound stadium if I did a shitcoin. It’s really tempting.”\n\nUltimately, Real Bedford is a Bitcoin-only club. McCormack only holds Bitcoin and is focused on building Bedford with Bitcoin in mind. However, getting Real Bedford into the Premier League is a long-term, perhaps lifelong commitment. With the first promotion out of the way, it’ll be the 2030s before Bedford has a team in the most prestigious football league.\n\n\n\nMcCormack shares a joke with Cointelegraph.\n\nMcCormack’s undeterred, however. “I’m going to be here for the rest of my life here in Bedford at every game I can possibly be at trying to lift up my town.” And the way to get this lower-league team into the Premier League?\n\n“It requires hard work, a bit of luck and for Bitcoiners to get behind it.”"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE0L2JpdGNvaW4tY29ycmVsYXRpb25zLWNvbnRpbnVlLW9uLWFnYWluLW9mZi1hZ2Fpbi1yZWxhdGlvbnNoaXAtd2l0aC10cmFkaXRpb25hbC1maW5hbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Correlations Continue On-Again, Off-Again Relationship With Traditional Finance - CoinDesk",
        "content": "A look onchain offers few signs that volatility will increase, as balances of bitcoin on centralized exchanges have declined. Analysts usually view declining coin balances on exchanges as a bullish signal, as they suggest investors are holding onto their assets. Increases often occur in preparation for asset sales."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzEzL2JpdGNvaW4tZXRoZXItcmVtYWluLXJlc2lsaWVudC1hZnRlci1iaW5hbmNlLWNvaW5iYXNlLXN1aXRzLWFuZC1hbWlkLWxvbmctcnVubmluZy1jcnlwdG8taW5kdXN0cnktdHVybW9pbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether Remain Resilient After Binance, Coinbase Suits, and Amid Long-Running Crypto Industry Turmoil - CoinDesk",
        "content": "Similar to last year, the crypto world’s fortunes seem intertwined with the fortune of two entities. Last year, Three Arrows Capital and Celsius were in the limelight. Now crypto exchange giants Binance and Coinbase hold that position. Investors see the fate of many cryptos depending on the outcome of the suits and a determination about whether tokens are securities, commodities or otherwise. Prices of many of the 19 cryptos mentioned by the SEC plunged more than 20% last week before stabilizing."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQvYml0Y29pbi1zdXBwbHktb24tZXhjaGFuZ2VzLXNsaWRlcy10by10aHJlZS15ZWFyLWxvdy_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE0L2JpdGNvaW4tc3VwcGx5LW9uLWV4Y2hhbmdlcy1zbGlkZXMtdG8tdGhyZWUteWVhci1sb3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Supply on Exchanges Slides to Three-Year Low - CoinDesk",
        "content": "Supply has been steadily falling since 2020 when it peaked in the depths of a then-bear market, the data shows. This suggests traders and investors have been continually taking their bitcoin off exchanges in favor of self-custody, as per Santiment."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTEzL29uY2UtaGlnaC1mbHlpbmctY3J5cHRvLXJlbGF0ZWQtZnVuZHMtYXJlLXN0cnVnZ2xpbmctdG8tZHJhdy1hbnktYXR0ZW50aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Crypto’s Falling PR Image Hurts Interest in Bitcoin, ETFs - Bloomberg",
        "content": "The cryptoverse has seen what seems like a lifetime of ups and downs already this year, yet activity in products linked to the industry have been nearly nonexistent, with analysts saying that investors have abandoned the sector without plans to come back anytime soon.\n\nNearly $172 million exited from global exchange-traded products tracking everything from Bitcoin to Cardano in the first six months of 2023 amid an industry wide rally, following outflows of just $37 million in 2022. That compares to record cash inflows of nearly $10 billion in 2021 and $6.7 billion in 2020, Bloomberg data show."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tcmlzZXMtYWJvdmUtdXMyNjAwMC_SATVodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLXJpc2VzLWFib3ZlLXVzMjYwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin rises above US$26,000; all other top 10 cryptos gain - Forkast News",
        "content": "Bitcoin rose to trade above US$26,000, recovering some of the ground it lost in the week since the U.S. Securities and Exchange Commission (SEC) filed lawsuits against two of the world’s largest crypto exchanges. The U.S. regulator accuses Binance.US and Coinbase of breaking securities rules. All other top 10 non-stablecoin cryptocurrencies also gained, with Binance’s native token BNB leading the gains.\n\nSee related article: Crypto industry reacts to SEC’s lawsuit against Binance\n\nCryptos rise\n\nBitcoin gained 1.00% to US$26,074 in the 24 hours to 4 p.m. in Hong Kong. The world’s largest cryptocurrency by market capitalization is up 1.32% on the week, according to CoinMarketCap data.\n\nEther, the world’s second biggest cryptocurrency after Bitcoin, rose 0.64% to US$1,748 in the past 24 hours. However, it is down 3.60% over the last seven days.\n\nBNB, the native token of the world’s biggest cryptocurrency exchange Binance, climbed 5.10% to US$235, although it posted 15.11% weekly losses. The gains come after U.S. Republican Congressman Warren Davidson tweeted on Monday that he had filed a bill to restructure the SEC and remove its current chairman Gary Gensler.\n\n“U.S. capital markets must be protected from a tyrannical Chairman, including the current one. That’s why I am introducing legislation to fix the ongoing abuse of power and ensure protection that is in the best interest of the market for years to come,” Davidson said.\n\nSEC chairman Gary Gensler reemphasized the agency’s determination to strictly regulate the crypto sector in a tweeted repost of his statement made last week.\n\nThere's nothing about the crypto securities markets that suggests that investors & issuers are less deserving of the protections of our securities laws.\n\n\n\nCongress could have said in the 1930s that the securities laws applied only to stocks & bonds.\n\n\n\nFor more, read my remarks: — Gary Gensler (@GaryGensler) June 12, 2023\n\nSolana, Polygon and Cardano – three of the crypto tokens named by the SEC as securities – all gained on Tuesday afternoon. However, all three have recorded losses of over 20% in the week since the SEC clampdown started.\n\nSolana gained 2.14% to US$15.42 in 24 hours, while Cardano rose 0.28% to US$0.2795. Polygon climbed 2.39% to US$0.6459.\n\n“The recent lawsuits filed by the SEC against Binance and Coinbase indicate a significant shift in regulatory approach towards the digital asset industry,” Mahin Gupta, founder of Liminal, a wallet infrastructure and custody solutions platform, said in an emailed statement.\n\n“While these measures may ultimately contribute to legitimizing the Web3 industry in the long run, it is important to acknowledge that such strong actions could potentially stifle innovation,” Gupta added.\n\nThe increasing regulatory clampdown on cryptocurrency exchanges in the U.S. is creating opportunities in the field of digital finance in Asia.\n\nIn the same week that the U.S. SEC announced it would sue Coinbase and Binance.US, stablecoin operator Circle announced that it had received a Major Payment Institution license from the Monetary Authority of Singapore (MAS), the city state’s central bank.\n\nSimilarly, digital assets bank Sygnum said Tuesday that MAS had granted it an in-principle approval for its Major Payment Institution Licence. The bank now plans to expand its regulated operations in Singapore, including its crypto brokerage service.\n\nIn the last 24 hours, the global crypto market capitalization rose 1.17% to US$1.06 trillion, and total market volume strengthened 5.57% to US$28.83 billion.\n\nEthereum NFTs dip\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 1.54% to 2,964.53 in the 24 hours to 5 p.m. in Hong Kong. The index recorded losses of 9.78% over the past seven days.\n\nThe Forkast ETH NFT Composite dropped 0.99% to 1,049.57 in 24 hours, while dropping 5.42% for the week.\n\nTotal NFT sales volume on the Ethereum blockchain dropped 18.19% to US$11.86 million over the past 24 hours, according to CryptoSlam data. Bored Ape Yacht Club, the largest Ethereum-based NFT collection by sales volume, dropped 6.03% to US$1.38 million in 24 hours.\n\n“The market is struggling due to low ETH volume, lowering prices, etc. The SEC filings are really beginning to impact the market,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nDespite the negative outlook elsewhere, NFT sales volume on the Bitcoin network gained 82.66% to US$3.9 million. Sales of uncategorized Ordinals — Bitcoin NFTs that are not part of an established collection — climbed 1.15% to US$1.65 million.\n\nAsian, European equities rise; U.S. futures gain\n\nStock market display board. Image: Envato Elements\n\nAsian equity markets gained on Tuesday after China’s central bank cut its seven-day reverse repurchase rate by 10 basis points to 1.9% from 2%. The move comes as the world’s second biggest economy struggles to recover from three years of pandemic-induced disruptions. U.S. markets also showed gains amid hopes that the U.S. Federal Reserve will leave interest rates unchanged this week.\n\nThe Shanghai Composite gained 0.15% and the Shenzhen Component Index rose 0.76%. Hong Kong’s Hang Seng Index climbed 0.60% and Japan’s Nikkei 225 strengthened 1.80%.\n\n“Global stock markets are likely to experience a wide boost this week – not just the mega cap tech stocks – as the U.S. Federal Reserve is expected to pause interest rate hikes,” said Nigel Green, founder and chief executive of financial management firm deVere, in an emailed statement.\n\nThe U.S. central bank is expected to keep interest rates unchanged at its meeting on June 13 and 14. Current interest rates in the U.S. are between 5% and 5.25%, the highest level since 2006, after 10 consecutive raises starting in March last year.\n\nThe U.S. is also scheduled to release its latest consumer price index data later on Tuesday. Inflation in the world’s biggest economy likely slowed to 4.1% in May, from 4.9% in April and 5% in March, according to Trading Economics.\n\nU.S. stock futures mostly rose as of 7 p.m. in Hong Kong. The Dow Jones Industrial Average futures dropped 0.02% while S&P 500 futures rose 0.13%. Nasdaq 100 Futures also gained 0.30%.\n\nEuropean bourses traded flat on Tuesday, as investors await policy decisions from both the European Central Bank (ECB) and the U.S. Fed. The ECB is scheduled to meet on Thursday and implement another 25 basis point interest rate hike to 3.5% in an attempt to curb inflationary pressures.\n\nThe benchmark STOXX 600 rose 0.03% and Germany’s DAX 40 gained 0.09% during afternoon trading hours in Europe.\n\nThe eurozone reportedly slipped into recession in the first three months of 2023.\n\n“High inflation, rising interest rates and treacherous periods of volatility have defined much of the past 12 months – all of which have made for extremely difficult trading conditions,” Daniela Hathorn, Senior Market Analyst at trading platform Capital.com, said in an emailed statement.\n\n“The challenging market is hitting everyone at present, but one way to try and slow the tide is by diversifying your investments. It’s better to spread the risk across different asset classes, companies and investments than to pursue profits from one single area that could quickly go south,” Hathorn added."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDYvMTQvYml0Y29pbi1qdW1wcy1iaW5hbmNlLWVtZXJnZW5jeS1mdW5kLWZsdWN0dWF0aW9uLXBvc3Qtc2VjLWNoYXJnZXMtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin moves higher after Fed decision, and Binance addresses emergency fund - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin moves higher after Fed decision, and Binance addresses emergency fund: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Bittrex Global CEO Oliver Linch weighs in on the recent SEC charges against several crypto companies, including Bittrex, and what the regulatory crackdown means for the industry as a whole."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDYvMTMvZmNhLXJpZ2h0LXRvLXByb3Bvc2Utc3RvcC10by1tYXJrZXRpbmctY3J5cHRvLWFzLWluZmxhdGlvbi1yZXNpc3RhbnQtdWstaW5kdXN0cnktbWVtYmVycy1zYXkv0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8xMy9mY2EtcmlnaHQtdG8tcHJvcG9zZS1zdG9wLXRvLW1hcmtldGluZy1jcnlwdG8tYXMtaW5mbGF0aW9uLXJlc2lzdGFudC11ay1pbmR1c3RyeS1tZW1iZXJzLXNheS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "FCA Right to Propose Stop to Marketing Crypto as ‘Inflation Resistant,’ UK Industry Members Say - CoinDesk",
        "content": "“To the extent that people bought into crypto during the bull run on the back of rising inflation and then lost money in the subsequent crypto winter, then one could say that the inflation narrative has been harmful,” Shea said, adding that cryptocurrencies are not designed to move one-to-one against inflation. “The inflation narrative is more medium-to-long term and is driven by the expectation [of] the large increase in fiat money supply witnessed over the past several years.”"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL21pY2hhZWwtc2F5bG9yLXNheXMtYml0Y29pbi1kb21pbmFuY2UtaXMtaGVhZGVkLWZvci04MC1pbi10aGUtbG9uZy10ZXJtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Michael Saylor says Bitcoin dominance is headed for 80% in the long term - CryptoSlate",
        "content": "Bitcoin’s (BTC) dominance is set to reach 80% in the long term as regulators crack down on other assets, MictraStrategy co-founder Michael Saylor told Bloomberg TV on June 13. MicroStrategy is the largest public holder of BTC.\n\nCurrently, Bitcoin’s crypto market dominance is around 48%, meaning BTC accounts for nearly half of the over $1 trillion market, per CryptoSlate data.\n\nSaylor said:\n\n“MicroStrategy’s view since 2020 has been that the only institutional-grade investable asset in the crypto space is Bitcoin. Bitcoin is the universally, globally-acknowledged digital commodity in this industry.”\n\nSaylor believes regulators do not see a “legitimate path forward” for stablecoins, crypto securities, and crypto derivatives. This month, the U.S. Securities and Exchange Commission (SEC) designated 19 crypto assets as securities in its lawsuits against Binance and Coinbase.\n\nU.S. regulators have a view of crypto exchanges that is “far constrained,” Saylor said. As per the regulators, exchanges should only trade and hold “pure digital commodities” like Bitcoin, he said, adding:\n\n“So, the entire industry is kind of destined to be rationalized down to a Bitcoin-focussed industry with half a dozen to a dozen other proof-of-work tokens.”\n\nThere are over 25,000 tokens tracked across CryptoSlate, CoinMarketCap, and CoinGecko, and Saylor said that the abundance of cryptocurrency tokens had created confusion in the industry. Most of these tokens have been trying to position themselves as the “next Bitcoin or better Bitcoin,” Saylor said.\n\nBut as regulators crack down on tokens, investors will realize that only “Bitcoin is the next Bitcoin,” Saylor remarked. Therefore, he predicted that the Bitcoin price is set to increase. He stated:\n\n“The next logical step is for Bitcoin to 10x from here, and then 10x again.”\n\nSaylor also communicated that he sees a few bullish signs for Bitcoin on the horizon. The change in accounting standards, the upcoming Bitcoin halving, the explosion of hash rate, and the “clarity” that has come from the SEC’s recent moves are “laying the foundation for the next bull run.”\n\nU.S. crypto exchanges will be ‘fine’ focusing on just Bitcoin\n\nSaylor said that “mega institutional money” is not currently flowing into the crypto space due to “confusion and anxiety.” He believes that when this confusion and anxiety goes away with regulatory clarity, institutional money will flood the space.\n\nEventually, U.S. crypto exchanges will realize that Bitcoin is the “really dominant asset.” With Bitcoin’s price increasing ten-fold, the business model of the exchanges “will be just fine” while focusing only on Bitcoin, he added.\n\nSimilarly, crypto exchanges have a “massive need” to help people and institutions buy, sell, and hold Bitcoin. This need is not “going away,” Saylor said. In fact, he thinks it will be a “great business” for the exchanges.\n\nMentioned in this article"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktYml0Y29pbi1yZXNpc3RhbmNlLXRvLXJldGVzdGluZy0yNS1rLXN1cHBvcnQtaXMtZnV0aWxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Why Bitcoin's resistance to retesting the $25K support could be futile - Cointelegraph",
        "content": "Bitcoin has been trading in a narrow 3.4% range for the past three days after successfully defending the $25,500 support on June 10. In this time, investors’ attention has shifted to the macroeconomic area as the United States Federal Reserve will announce its interest rate decision on June 14.\n\nCryptocurrencies might work independently from the traditional finance markets, but the cost of capital impacts almost every investor. Back in May, the Fed raised its benchmark interest rate to 5–5.25%, the highest since 2007.\n\nAll eyes will be on Fed Chair Jerome Powell's media speech 30 minutes after the rate announcement as markets are pricing in 94% odds of a pause at the June meeting, based on the CME FedWatch tool.\n\nCrypto fears more than just an FOMC meeting\n\nThe upcoming Federal Open Market Committee meeting isn’t the only concern for the economy, as the U.S. Treasury is set to issue more than $850 billion in new bills between now and September.\n\nAdditional government debt issuance tends to cause higher yields and, thus, higher borrowing costs for companies and families. Considering the already-restrained credit market due to the recent banking crisis, odds are that gross domestic product growth will be severely compromised in the coming months.\n\nAccording to on-chain analytics firm Glassnode, miners have been selling Bitcoin (BTC) since the start of June, potentially adding further pressure to the price. Among the potential triggers are reduced earnings from a cooldown in Ordinals activity and the mining hash rate reaching an all-time high.\n\nInvestors now question whether Bitcoin will test the $25,000 resistance, a level unseen since mid-March, and for this reason, they are closely monitoring Bitcoin futures contract premiums and the costs of hedging using BTC options.\n\nBitcoin derivatives show modest improvement\n\nBitcoin quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, BTC futures contracts in healthy markets should trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nBitcoin 2-month futures annualized premium. Source: Laevitas\n\nThe demand for leveraged BTC longs has slightly increased, as the futures contract premium increased to 3% from 1.7% on June 10, although it is still far from the neutral 5% threshold.\n\nTraders should also analyze options markets to understand whether the recent correction has caused investors to become more optimistic. The 25% delta skew is a telling sign of when arbitrage desks and market makers overcharge for upside or downside protection.\n\nIn short, if traders anticipate a Bitcoin price drop, the skew metric will rise above 7%, and phases of excitement tend to have a negative 7% skew.\n\nRelated: ​​Crypto fund outflows reach $417M over 8 weeks as investor caution persists\n\nBitcoin 30-day options 25% delta skew. Source: Laevitas\n\nThe 25% delta skew metric entered “fear” mode on June 10 as Bitcoin’s price faced a 4.5% correction. Currently at 4%, the indicator displays balanced pricing between protective puts and neutral-to-bullish call options.\n\nThe crypto bear trend looks set to continue\n\nNormally, a 3% futures basis and a 6% delta skew would be considered bearish indicators, but that is not the case given the extreme amount of uncertainty regarding the economic conditions and the recent charges against Binance and Coinbase. The Securities and Exchange Commission (SEC) alleges those exchanges held unregistered offerings and sales of tokens and failed to register as brokers.\n\nU.S. lawmakers have criticized the SEC for its heavy-handed approach to crypto enforcement. On June 12, Rep. Warren Davidson proposed a bill aimed at restructuring the SEC by firing Chair Gary Gensler and redistributing power between the commissioners.\n\nThe uncertain crypto regulatory environment remains a hurdle to attracting institutional investors. Furthermore, the recession risk for the U.S. economy limits the demand for risk-on assets such as Bitcoin, increasing the odds of the $25,000 support being tested.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZXh0ZW5kLWxvc3Nlcy14cnAtZHJvcHMtbW9zdC_SAURodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWV4dGVuZC1sb3NzZXMteHJwLWRyb3BzLW1vc3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether extend losses; XRP drops most - Forkast News",
        "content": "Both Bitcoin and Ether fell in Wednesday afternoon trade in Asia, with Ripple’s XRP leading losses among the other top 10 non-stablecoin cryptocurrencies. Other tokens in the top 10 traded mixed, with crypto exchange Binance’s BNB token leading the gains amid its ongoing lawsuit with the U.S. Securities and Exchange Commission (SEC). Investors are looking forward to the U.S. central bank’s decision on interest rates to be announced later on Wednesday, with the Federal Reserve expected to keep rates unchanged at 5%-5.25%.\n\nSee related article: How American courts have become central to crypto law\n\nXRP leads losses, BNB gains\n\nBitcoin fell 0.69% to US$25,894 in the 24 hours to 4 p.m. in Hong Kong, according to CoinMarketCap data. The world’s biggest cryptocurrency by market capitalization has lost 3.40% in the past week following lawsuits brought by U.S. regulators against two of the world’s biggest crypto exchanges, Binance and Coinbase.\n\nEther, the world’s second biggest cryptocurrency, fell 0.42% to US$1,741 over the past 24 hours, bringing its weekly losses to 7.18%.\n\n“Last week and the weekend were tumultuous days for cryptocurrency markets, marked by significant declines in valuations across the board,” Robert Quartly-Janeiro, Chief Strategy Officer of crypto exchange Bitrue, said in an emailed statement.\n\n“The challenges faced by Binance and Coinbase in the United States hold significant weight. Binance, commanding over 60% of the global market, and Coinbase, with 70% market share in the USA, are major participants so what happens to them naturally affects global sentiment,” Quartly-Janeiro added.\n\nBNB, the native token of the world’s largest crypto exchange Binance, gained 4.93% to US$246 over the past 24 hours. That reduced its weekly losses to 10.95%.\n\nThe gains came after a U.S. federal judge on Tuesday denied the SEC’s request to freeze the assets of Binance.US. The decision allows Binance.US to continue operating while it battles a lawsuit filed against it by the regulator last week. The SEC alleges that Binance.US failed to register as a securities exchange while offering and selling unregistered securities.\n\nThe SEC also sued Coinbase, the largest crypto exchange in the U.S., on similar charges.\n\n“Outflows from Coinbase and Binance reached US$4 billion during the week. Crypto traders, spooked by SEC lawsuits, are withdrawing assets from exchanges en masse,” Alex Kuptsikevich, senior market analyst at online brokerage firm FxPro, said in emailed comments.\n\nIn a parallel development involving the SEC and crypto, Ripple’s XRP token was the biggest loser, dropping 5.36% to US$0.5013 in 24 hours and 4.93% on the week. The drop came after the so-called “Hinman documents” were released, named after former SEC corporate finance director William Hinman.\n\nRipple Labs Inc. was sued by the SEC in December 2020, for allegedly selling US$1.3 billion in unregistered securities. The company asked to unseal documents in which Hinman said Bitcoin and Ether should not be categorized as financial securities. The comments are a major point of contention in the legal battle between the SEC and Ripple as Ripple seeks to bolster its fair notice defense.\n\nRipple’s chief legal officer Stuart Alderoty tweeted on Tuesday, “Hinman’s speech should never again be invoked in any serious discussion about whether a token is or is not a security. Unelected bureaucrats must faithfully apply the law within the constraints of their jurisdiction.”\n\n14/ And finally, Hinman’s speech should never again be invoked in any serious discussion about whether a token is or is not a security. Unelected bureaucrats must faithfully apply the law within the constraints of their jurisdiction. They can’t – as Hinman tried – create new law. — Stuart Alderoty (@s_alderoty) June 13, 2023\n\nMarkus Thielen, Head of Research & Strategy at digital asset service platform Matrixport, feels that the crypto crackdown by the U.S. SEC opens up new opportunities for other parts of the world including Asia.\n\n“I think the key difference is that in the U.S., derivatives are not really offered; only the spot market. And the derivatives market is 11 times bigger than the spot market,” Thielen told Bloomberg on June 13.\n\n“So a lot of the trading already happens outside of the U.S. and I think this is why Binance got into trouble because a lot of U.S. institutions appear to be trading on the platform according to the allegations. I think to really offset the pressure from the U.S., I think Hong Kong needs to do more and I think Hong Kong can actually step into this void now,” Thielen added.\n\nEven in the decentralized finance (DeFi) sector, which gained momentum after multiple centralized finance (CeFi) collapses throughout 2022, institutional investors are looking at Asia and the Middle East.\n\n“Growth is returning to DeFi, albeit slower than last year, but interest is coming back as institutions and investors evaluate the landscape,” Robert Alcorn, chief executive and Co-Founder of DeFi credit marketplace Clearpool, said in a statement.\n\n“Indeed, the main obstacle for traditional institutions remains regulatory clarity and compliance. Significant progress has been made in this regard across Asia and the Middle East, which is likely to encourage investor participation, and we expect these regions to become the main crypto lending hubs as confidence builds,” Alcorn added.\n\nIn Asia, Hong Kong’s new rules for the cryptocurrency industry came into effect from June 1, as part of the city’s ambition to become a global hub for digital assets.\n\nThis week, Hong Kong-based Bank of China International Holdings (BOCI) issued US$28 million worth of fully digital structured notes in the form of tokens on Ethereum blockchain. That makes it the first Chinese financial institution to issue a tokenized security in Hong Kong, according to a statement from investment banking firm UBS.\n\nThe product was developed by UBS and is available to its clients in the Asia Pacific region.\n\n“Working together with UBS, we are driving the simplification of digital asset markets and products for customers in Asia Pacific through the development of blockchain-based digital structured products, designed specifically for customers in Asia Pacific,” Ying Wang, deputy chief executive officer at BOCI, said in the statement.\n\n“We are encouraged by the evolution of Hong Kong’s digital economy and are committed to promoting the digital transformation and innovative development of Hong Kong’s financial industry,” Wang added.\n\nThe global crypto market capitalization fell 0.46% to US$1.06 trillion, while total market volume gained 8.59% to US$31.3 billion in the last 24 hours.\n\nNFT markets slump, Snoop Dogg releases collectibles\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 0.63% to 2,942.34 in the 24 hours to 6.45 p.m. in Hong Kong, registering losses of 10.43% over the last seven days.\n\nThe Forkast ETH NFT Composite dropped 1.24% to 1,037.33, down 6.37% on the week.\n\n“The NFT market is finally reacting to the U.S. SEC’s stepped-up attacks against the cryptocurrency industry,” according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“Either way, it’s pretty clear we’re entering another new phase of the NFT market, and traders are being cautious. How low we can go, nobody knows,” Petscher added.\n\nTotal NFT sales volume on the Ethereum blockchain dropped 3.07% to US$13.09 million in 24 hours. In stark contrast, sales volume gained 95.59% to US$5.41 million on the Bitcoin network, according to CryptoSlam data.\n\nSales of uncategorized Ordinals — Bitcoin NFTs that are not part of an established collection – recorded the highest sales volume in 24 hours, climbing 87.32% to US$3.10 million.\n\nAmong other developments in the sector, entertainment icon Snoop Dogg has launched The Snoop Dogg Passport Series, a digital tour collectible. The passport series includes behind-the-scenes video and images uploaded by the rapper, a public relations spokesperson for the project said in an emailed statement.\n\nThe collection will also include visual works from NFT artists like Coldie, Terrell Jones, and Alien Queen.\n\nAsian equities, U.S. futures mixed; European bourses rise\n\nImage: Envato Elements\n\nAsian equities traded mixed on Wednesday as China is expected to cut its headline policy interest rate on Thursday, due to slower-than-expected economic recovery. Senior Chinese officials are reportedly seeking inputs from economists and business leaders on how to revive the world’s second largest economy after three years of Covid-19 related disruptions.\n\nThe Shanghai Composite dropped 0.14% while the Shenzhen Component Index gained 0.26%. Hong Kong’s Hang Seng Index lost 0.58% but Japan’s Nikkei 225 strengthened 1.47%.\n\nU.S. stock futures were mixed as of 8 p.m. in Hong Kong. The Dow Jones Industrial Average futures dropped 0.26%, and S&P 500 futures gained 0.11%. Nasdaq 100 Futures also rose 0.14%.\n\nThe U.S. central bank is expected to keep interest rates unchanged at its meeting on June 13 and 14. Current interest rates in the U.S. are between 5% and 5.25%, the highest level since 2006, after 10 consecutive raises that started in March last year.\n\n“The market has all but moved on to what happens in the [Fed’s] following meeting in July,” DBS Bank said in a research note on June 12.\n\n“Given the economy’s slow but steady state of affairs, the chance of a hike in that meeting is non-trivial, in our view. In our forecasting horizon, we see both headline and core inflation in the 3-4% range this year and next, which may justify a prolonged pause than a number of additional hikes by the Fed,” DBS said.\n\nTuesday’s U.S. Consumer Price Index (CPI) report, a key inflation indicator, showed that inflation in the world’s biggest economy grew at a 4% annual rate in May, compared to 4.9% in April. The CPI was the lowest yearly inflation rate since March 2021, but is still higher than Fed’s target of 2%.\n\nEuropean bourses strengthened on Wednesday, as investors look forward to the European Central Bank’s decision on interest rates on Thursday. The central bank is expected to announce another 25 basis point rate hike to 3.5%.\n\nThe benchmark STOXX 600 rose 0.57% and Germany’s DAX 40 gained 0.52% during afternoon trading hours in Europe."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xNDQ0NjUvYml0Y29pbi13aWxsLTEweC13aXRoLXJlZ3VsYXRvcnktY2xhcml0eS1zYXlzLW1pY2hhZWwtc2F5bG9y0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NDQ2NS9iaXRjb2luLXdpbGwtMTB4LXdpdGgtcmVndWxhdG9yeS1jbGFyaXR5LXNheXMtbWljaGFlbC1zYXlsb3I_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Will ‘10X’ With Regulatory Clarity, Says Michael Saylor - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFaced with an onslaught of regulatory enforcement actions, MicroStrategy’s Michael Saylor believes the United States crypto industry is poised for a “Bitcoin-focused” future.\n\nIn an interview with Bloomberg on Tuesday, the executive chairman of the business intelligence software firm claimed that recent declarations from the U.S. Securities and Exchange Commission (SEC) are “laying the foundation” for the next Bitcoin bull run.\n\n“Regulatory clarity is going to drive Bitcoin adoption by eliminating the confusion and anxiety that has been holding back institutional investors,” said Saylor. Much of that confusion stems from other “crypto securities” for which regulators “don’t see a legitimate path forward” in the United States.\n\nAD\n\nAD\n\n“They have a view of crypto exchanges which is far constrained,” he added. “Their view is crypto exchanges should trade and hold pure digital commodities like Bitcoin.”\n\nThe SEC sued Coinbase—the largest crypto exchange in the US—last week, alleging that the company had listed over a dozen securities on its platform without registering as a securities exchange. The agency had generally been hesitant to comment on whether a specific token classifies as security until filing a lawsuit, for which it's been criticized by the industry and Congress alike.\n\nThe SEC has ruled out Bitcoin from being a security, however, deeming it sufficiently decentralized to be called a commodity. As such, Saylor believes the regulatory crackdown on stablecoins and other tokens will likely send Bitcoin's long-term dominance back above 80% of the total crypto market.\n\n“The public is beginning to realize that Bitcoin is the next Bitcoin,” said Saylor. “The next logical step is for Bitcoin to 10x from here, and then 10x again.”\n\nSaylor’s company is one of the world’s largest holders of Bitcoin, now possessing 140,000 BTC bought at an average price of $29,803 per coin. It hasn’t touched any other crypto tokens, deeming Bitcoin the “only institutional grade investable asset in the crypto space.”\n\nAD\n\nAD\n\nMichael Saylor has previously argued that Ethereum (ETH)—the second-largest cryptocurrency by market cap—is a security, due to having an ICO, pre-mine, and management team."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wNi0xMy9tYXJhdGhvbi1kaWdpdGFsLWNlby1leHBlY3RzLW1vcmUtYml0Y29pbi1taW5lci1kZWFscy12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Marathon Digital CEO Expects More Bitcoin Miner Deals - Bloomberg",
        "content": "00:00\n\nYou have a lot of crypto companies saying that they're looking overseas, that they're looking to get out of the US. What's Marathon's view? Are you looking at offshore opportunities here? Well, we recently announced a new project in the UAE where we're building one of the largest digital asset operations or mining in Abu Dhabi. We're also looking in other places. Our goal, a longer term is to be about 50 percent offshore, 50 percent onshore. Bitcoin is treated a little bit differently than broader crypto. The SCC and the CFTC have both given it clarity that Bitcoin is a commodity. It's not a security. So Bitcoin is being treated a little bit differently and I think the situation around Bitcoin is different. That being said, clearly, you know, all the way up to the top at the White House, the economic report that they issued in January had a very different tone than the one they issued prior year. So clearly this is coming from the top that crypto is bad in their views. But we're very hopeful that the legislation that is going through Congress now will hopefully add some market structure guidelines and alleviate some of the lack of clarity that exists today so that the regulators can operate in a more friendly way towards the industry that will allow people to innovate, build businesses in the US as opposed to just moving offshore. Is there any hope, Fred, in kind of fighting this crackdown from the S.E.C. in the court of public opinion? I mean, you mentioned legislation. Obviously, that's, I guess, the main mechanism through which you you would change the FTSE mandate, because so many of these coins, you can argue that they're a commodity and not a security. So I think part of the challenge is that with no clear legal rules, legislation around this, the FCC mandate is seemingly a little broader than it should be. There have been some mentions of overreach. I think there is a Republican member of the House that has put forth a bill that essentially would restructure the FCC. So I think momentum is building towards people really starting to pay attention to this at the end of the day. Congress needs to provide very clear legislation. And then I think the FCC and the CFTC have to come to terms regarding how this is all going to be regulated. But, you know, a lot of this is definitely potentially a bit of strong arming. You think about what the FCC is doing by essentially scaring people enough. They will achieve the end that they're looking for, which is to move all this off shore. You look at all these coins that have been delisted by exchanges. You look at Robinhood Hood listing all coins and stopping trading in crypto. You know, essentially the S.E.C. is achieving its end without having to take all these people were caught. So it's a matter of who gets to the finish line first and what happens come next year. You we have three presidential candidates who have come out on the Republican side that are pro bitcoin. And I think momentum, again, is building for at least a more positive environment for bitcoin in the US. But we'll have to see what Congress can do to really rein things in and get everybody aligned around how things should operate so people can get back to business. You mentioned Robin Hood. We've also seen E Toro stop new purchases of these tainted 19 coins, so to speak. Are you also avoiding any any tokens that the S.E.C. has deemed securities? Well, we're a pure Bitcoin company. So in our case, we focus on Bitcoin. It's been declared a commodity by both the SCC and the CFTC. So we're continuing just business as usual. And Fred, I'd love to get your thoughts on the mining industry. Take a step back and talk about the state of Bitcoin mining, because obviously Bitcoin had a great 20 twenty three up well over 50 percent, but still down dramatically from its peaks. What does that mean for your margins? What is your current break even rate look like and how does that compare to the rest of the industry? The industry has been going through a big upgrade cycle. There's some recent reports that have been issued that show that energy consumption is maintaining at the same level. But at the same time, the global hash rate or the amount of compute power that's applied to bitcoin mining has increased substantially. We've grown substantially. We've doubled our capacity year to date over the end of last year and will continue to grow at more throughout this year. We're using the most modern, most energy efficient machines. What we're seeing is miners that had older machines have been upgrading those to more energy efficient machines, which is making the overall industry more energy efficient. So I think people are continued to grow. Margins are essentially staying flat to a little bit lower because as global hash rate grows, the difficult. The increases, but Bitcoin prices obviously moved in the right direction this year. So I think what we're going to see is a slow uptick in the price of Bitcoin over the balance of this year leading into the having next year. At that point, there's a big impact to margins because companies cost to mine will essentially double. Right. So it'll be very interesting to see, you know, miners are very focused now on becoming more energy efficient. We have one of the most energy efficient fleets in the industry operating at somewhere around 24 jewels for terror, harsher. What's what's a hash for the average industry or the industry average, rather, is in the 40s. So I think it's going to be a bit of a period of people continue to upgrade and then there'll be some sort of cleansing post to having next year. I'm glad you brought up the having, because if we take a look forward at that, hypothetically, when we do get to that point, what would you expect the mining industry to look like? Will they? Will there be fewer miners after we get through the how long? I think what's going to happen is the larger miners that have most modern fleets, the best energy costs and are the most efficient are going to thrive. While the smaller miners that either can't raise capital, can't upgrade their machines and can't get out of generally more expensive energy contracts are either going to have to consolidate or essentially go away as well. You're seeing more miners moving offshore. There's some great stranded energy opportunities in Latin America, Asia and Africa that are coming to market at very low energy prices. And I think you're going to see this industry continue to chase the lowest cost of energy. You'll also see miners focus more on starting to own energy generation, because instead of being parasitic load on the grid, you're going to see miners move behind the meter. This is what we do. We sit behind the meter at wind farms typically. So we get to use that stranded energy and not take it off the grid. But at the same time, you're going to see miners start owning and investing in energy projects to develop their own energy, whether that's methane flare, whether that's landfill methane, whether that's solar or wind, et cetera. And I think the miners, together with the renewable energy companies, are going to be the largest investors in renewable energy projects in the US because we have a very big problem in the U.S. There is a lack of transmission capacity to shift the energy from the renewable energy farms to the consumer. And the only way you can get these projects financed is there has to be a customer for the energy and bitcoin miners make the ideal customer for that. All right. I think you're going to continue to see a lot of progress there."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1tYXJrZXQtc2hhcmUtc2VjLXJlZ3VsYXRvcnMtY3J5cHRvY3VycmVuY2llcy1iaW5hbmNlLW1pY3Jvc3RyYXRlZ3ktbWljaGFlbC1zYXlsb3ItMjAyMy020gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin's Dominance to Almost Double As Regulators Limit Other Crypto - Markets Insider",
        "content": "Bitcoin's market dominance will nearly double, MicroStrategy's Michael Saylor said.\n\nThat's as the regulatory crackdown will remove a number of other tokens, he told Bloomberg TV.\n\n\"Now I think that the public is beginning to realize that bitcoin is the next bitcoin.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe regulatory crackdown on cryptocurrencies could be a windfall for bitcoin, which will nearly double its market share, MicroStrategy co-founder Michael Saylor told Bloomberg TV.\n\nIn this year alone, bitcoin's share of the crypto industry's overall market capitalization has gone from 40% to 48%, he said. But with regulators targeting other tokens, bitcoin's dominance will to grow to 80%, he added.\n\n\"Now I think that the public is beginning to realize that bitcoin is the next bitcoin,\" Saylor said. \"The next logical step is for bitcoin to 10x from here and then 10x again.\"\n\nHe has been a long-time bitcoin bull, and his enterprise software company has bet heavily on the token, amassing a stockpile of about 140,000 bitcoin.\n\nAdvertisement\n\nMeanwhile, the Securities and Exchange Commission asserted new pressure onto the crypto scene earlier this month, charging top exchange Binance with 13 violations of US law. Alongside this, it sued rival crypto exchange Coinbase with a failure to register under the SEC.\n\nIn the SEC's view, tokens worth $120 billion are unregistered securities, making it illegal for the exchanges to offer them.\n\nIn its lawsuits, the regulator laid out 19 tokens under scrutiny. In response, other trading platforms such as Robinhood and eToro removed a number of them.\n\nThe industry has interpreted the regulatory moves as reaffirmation that bitcoin is not considered a security and won't fall under the crackdown.\n\nAdvertisement\n\n\"I mean, their view is crypto exchanges should trade and hold pure digital commodities like bitcoin,\" Saylor said of the SEC. \"And so the entire industry is kind of destined to be rationalized down to a bitcoin-focused industry, with maybe a half a dozen to a dozen other other proof-of-work tokens.\"\n\nSaylor's comments are an extension of his previous take at the end of May, when he said bitcoin had bottomed out and was at the start of a significant bull run.\n\nBitcoin is expected to receive another tailwind next year. The so-called halving, which is due next in April 2024, will cut in half the rate at which new coins are released as well as the reward given to miners for their work in processing transactions.\n\nIt's done to eventually cap the token's total supply at 21 million units and is considered bullish for the price."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mZWQtcGF1c2VzLWludGVyZXN0LXJhdGVzLWJ1dC1iaXRjb2luLW9wdGlvbnMtZGF0YS1zdGlsbC1wb2ludHMtdG8tYnRjLXByaWNlLWRvd25zaWRl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Fed pauses interest rates, but Bitcoin options data still points to BTC price downside - Cointelegraph",
        "content": "Bitcoin's price has been pinned below $26,300 since June 10, reflecting a 14.8% correction in two months. Meanwhile, the Nasdaq tech stock market index gained 13.6% in the same period, indicating that investors are not exactly fleeing to the safety of cash and short-term debt. In fact, the demand for United States government bonds has been declining for the past six weeks.\n\nU.S. 2-year government bond yield. Source: TradingView\n\nThe yield on two-year U.S. Treasurys, for example, increased from 3.80% on May 4 to 4.68% on June 14. Lower demand for debt instruments increases payouts, resulting in a higher yield. If the investor thinks that inflation will continue above target, the tendency is for those participants to demand a higher yield when trading bonds.\n\nThe U.S. Treasury is set to issue more than $850 billion in new bills between June and September. As additional debt issuance tends to cause higher yields, the market expects increased borrowing costs for families and businesses. Still, that does not explain why investors have been flocking to tech companies but avoiding Bitcoin (BTC), as depicted by the past two-month performance.\n\nEight consecutive weeks of crypto fund outflows\n\nAccording to CoinShares' latest “Digital Asset Fund Flows Report,” the sector’s investment product outflows amounted to $88 million in the week ending on June 10. The substantial drawdown added to the ongoing eight-week streak of outflows, which now total $417 million.\n\nThe eight-week cumulative outflows for Bitcoin reached $254 million, representing approximately 1.2% of the total assets under management. Analysts at CoinShares have attributed this trend to monetary policy considerations, as interest rate hikes show no signs of slowing down, prompting investors to remain cautious.\n\nBitcoin has been trying to reclaim the $27,500 support for the past two weeks, but that might be harder than expected given the upcoming $600 million weekly options expiry on June 16.\n\nA brief Bitcoin pump above $27,000 made bulls giddy\n\nIt is worth noting that the actual open interest for the options expiry will be lower since bulls concentrated their bets above $27,000. These traders likely got excessively optimistic after Bitcoin’s price gained 8% on June 6, erasing the losses that drove BTC down to $25,400.\n\nBitcoin options aggregate open interest for June 16. Source: Deribit\n\nThe 0.73 put-to-call ratio reflects the imbalance between the $350 million in call (buy) open interest and the $250 million in put (sell) options.\n\nHowever, if Bitcoin’s price remains near $26,000 at 8:00 am UTC on June 16, only $27 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $27,000 or $28,000 is useless if BTC trades below that level on expiry.\n\nRelated: Bitcoin ‘far larger’ than Binance or Coinbase, says Jan3 CEO: BTC Prague 2023\n\nBulls need Bitcoin price at $26,500 to avoid a $100 million loss\n\nBelow are the three most likely scenarios based on the current price action. The number of options contracts available on June 16 for call (bull) and put (bear) instruments varies depending on the expiry price.\n\nThe imbalance favoring each side constitutes the theoretical profit:\n\nBetween $24,000 and $25,000: 0 calls vs. 6,100 puts. Bears are in total control, profiting $145 million.\n\n0 calls vs. 6,100 puts. Bears are in total control, profiting $145 million. Between $25,000 and $26,500: 1,000 calls vs. 4,400 puts. The net result favors the put (sell) instruments by $100 million.\n\n1,000 calls vs. 4,400 puts. The net result favors the put (sell) instruments by $100 million. Between $26,500 and $27,000: 2,200 calls vs. 2,800 puts. The net result is balanced between call and put instruments.\n\nThis crude estimate considers the call options used in bullish bets and the put options exclusively in neutral-to-bearish trades. This oversimplification disregards more complex investment strategies.\n\nStill, traders should be cautious as the bears are currently in a better position for Friday’s weekly options expiry, favoring negative price moves. Thus, an eventual sharp correction below $25,000 should not be discarded.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTEzL21hcmF0aG9uLW1hcmEtc2F5cy1jaGFsbGVuZ2VzLXdpbGwtcHV0LW1vcmUtYml0Y29pbi1taW5lcnMtb3V0LW9mLWJ1c2luZXNz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Marathon Digital CEO Sees More Bitcoin Miners Forced Out as Challenges Mount - Bloomberg",
        "content": "A range of challenges will essentially drive some Bitcoin miners out of the market, according to Fred Thiel , chief executive officer of Marathon Digital Holdings Inc., one of the biggest US-based participants in the sector.\n\nStagnant Bitcoin prices, high power costs, persistent competition along with a preprogrammed event that cuts mining reward in half have compressed miners margins and prompted them to make their power-hungry operations more efficient, Thiel said during an interview on Bloomberg Television."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQvYmluYW5jZS1jZW8taGl0cy1iYWNrLWF0LXJ1bW9ycy1vZi1leGNoYW5nZS1zZWxsaW5nLWJpdGNvaW4tZm9yLWJuYi1jb2luL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQvYmluYW5jZS1jZW8taGl0cy1iYWNrLWF0LXJ1bW9ycy1vZi1leGNoYW5nZS1zZWxsaW5nLWJpdGNvaW4tZm9yLWJuYi1jb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Binance CEO Hits Back at Rumors of Exchange Selling Bitcoin for BNB Coin - CoinDesk",
        "content": "“USDT reserves have been pumped into BNB aggressively since 27th May. BNB is being sold off for BUSD to suppress volatility in BTC,” @52kskew tweeted. “BUSD is pumped into BTC to suppress downside volatility so BTC can be swapped out for USDT.”"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMTQvYXBwbGUtcmVqZWN0cy1iaXRjb2luLXdhbGxldC16ZXVzLWEtZGF5LWFmdGVyLXRocmVhdGVuaW5nLXRvLWRlbGlzdC1kYW11cy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzE0L2FwcGxlLXJlamVjdHMtYml0Y29pbi13YWxsZXQtemV1cy1hLWRheS1hZnRlci10aHJlYXRlbmluZy10by1kZWxpc3QtZGFtdXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Apple Rejects Bitcoin Wallet Zeus a Day After Threatening to Delist Damus - CoinDesk",
        "content": "The prior version of Zeus is still in the App Store. It’s not clear what changes Kaloudis made to the new version. CoinDesk reached out to Kaloudis, Damus founder William Casarin, and Apple, but none had responded at the time of reporting."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zb3V0aC1rb3JlYW4tYml0Y29pbi1sZW5kaW5nLXBsYXRmb3JtLWRlbGlvLXBhdXNlcy13aXRoZHJhd2Fsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "South Korean Bitcoin lending platform Delio pauses withdrawals - Cointelegraph",
        "content": "Delio, a virtual asset manager and lending platform based in South Korea, has announced the temporary suspension of customer withdrawals “in order to safely protect the assets of customers currently in custody.”\n\nThe company made the decision in response to the recent suspension of digital asset deposits and withdrawals at Haru Invest, which has led to heightened market volatility and increased confusion among investors within the region. According to Delio, the suspension will remain in effect until “the situation and its aftermath are resolved.” A translation of the announcement read:\n\n“In order to safely protect the assets of customers currently in custody, Delio will inevitably suspend withdrawals temporarily as of June 14, 2023, 18:30.\"\n\nDelio has reassured its clients that it will do its best to protect their assets “while quickly grasping the facts and aftermath related to this situation.” The company also pledged to provide regular updates through announcements regarding the forthcoming facts, measures taken to safeguard customer assets and other related developments.\n\nRelated: SEC lawsuit against Binance stalls Gopax acquisition deal in South Korea\n\nOn June 13, South Korean yield platform Haru Invest announced the suspension of deposits and withdrawals due to concerns over potentially false information provided by a consignment operator during an internal inspection. The challenges faced by Haru Invest have the potential to create a ripple effect on other platforms in South Korea, as Delio is already experiencing.\n\nFounded in 2018, Delio reportedly holds an estimated $1 billion in Bitcoin (BTC), $200 million in Ether (ETH) and approximately $8.1 billion in altcoins, data from its website revealed.\n\nMagazine: Binance humiliated, HK needs 100K crypto workers, China’s AI unicorn: Asia Express"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8taW5kdXN0cnktZGVzdGluZWQtYml0Y29pbi1mb2N1c2VkLTA5MDIxMjA3MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Crypto Industry Destined to Be Bitcoin Focused After SEC Actions: MicroStrategy Founder Michael Saylor - Yahoo Finance",
        "content": "Business-intelligence firm MicroStrategy's (MSTR) Founder and Executive Chairman Michael Saylor has said recent enforcement actions by U.S. regulators have made it clear that the crypto industry is destined to be rationalized down to a bitcoin (BTC)-focused industry.\n\n\"MicroStrategy's views since 2020 have been that the only institutional grade asset is bitcoin,\" said Saylor in an interview with Bloomberg on Tuesday. \"It's pretty clear that the regulators don't see a legitimate path forward for cryptocurrencies ... And so the entire industry is kind of destined to be rationalized down to a bitcoin-focused industry with maybe half a dozen to a dozen other proof of work tokens.\"\n\nLast week, the U.S. Security and Exchange Commission (SEC) filed lawsuits against Binance and Coinbase, the two largest crypto exchanges by market cap. A total of 19 tokens have been mentioned in the filings. Bitcoin isn't one of them. Previously, SEC chair Gary Gensler has said that bitcoin (BTC) is a commodity.\n\nSaylor's MicroStrategy began buying bitcoin in 2020 while calling the cryptocurrency a million times better store of value than gold. The company now holds approximately 140,000 bitcoin worth about $4 billion. In March 2023, Saylor lost a bid to dismiss claims that he failed to pay personal income taxes, interest and penalties due for Washington, D.C. However, the court dismissed claims that Saylor and MicroStrategy had conspired to violate the law.\n\nRegulatory clarity is going to drive #Bitcoin adoption by eliminating the confusion & anxiety that has been holding back institutional investors. Bitcoin dominance will continue to grow as the #Crypto industry rationalizes around $BTC and goes mainstream. pic.twitter.com/Foq4lpderj — Michael Saylor⚡️ (@saylor) June 13, 2023\n\nSaylor said that since 25,000 other cryptocurrencies (approximately) have been angling to position themselves as bitcoin or a better bitcoin, the public now understands that bitcoin is the next bitcoin. He said the \"next logical step\" is for bitcoin to multiply 10 times in value to $250,000.\n\nStory continues\n\n\"Eventually, I have confidence that the crypto exchanges will come around to realising that bitcoin really is the dominant asset in this space, and their business models are fine when bitcoin goes up by a factor of 10,\" Saylor said.\n\nRead More: MicroStrategy Founder Michael Saylor Loses Court Bid to Dismiss DC Tax Evasion Claims\n\n\n\n\n\n\n\n"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pbmR1c3RyeS13aWxsLWZvY3VzLW9uLWJpdGNvaW4tZHVlLXRvLXJlZ3VsYXRvcnMtbWljaGFlbC1zYXlsb3LSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Crypto industry 'destined' to be BTC-focused due to regulators: Michael Saylor - Cointelegraph",
        "content": "Enforcement actions on cryptocurrency firms by regulators in the United States could result in a Bitcoin (BTC)-focused industry that will push its price over $250,000, according to MicroStrategy co-founder Michael Saylor.\n\nIn a June 13 Bloomberg interview, the Bitcoin bull explained recent enforcement actions from the Securities and Exchange Commission would eventually play in favor of Bitcoin— the only crypto excluded from being a security by SEC Chair Gary Gensler.\n\nSaylor added that U.S. regulators “don’t see a legitimate path forward for cryptocurrencies,” adding “they don't have any love” for stablecoins, crypto-tokens or crypto-based derivatives.\n\nSaylor said crypto exchanges would be the catalysts behind the significant price surge:\n\n“[The SEC’s] view is crypto exchanges should trade and hold pure digital commodities like Bitcoin and so the entire industry is kind of destined to be rationalized down to a Bitcoin-focused industry with maybe a half a dozen to a dozen other proof of work tokens.”\n\n“The next logical step is for Bitcoin to 10x from here and then 10x again,” he claimed.\n\nRegulatory clarity is going to drive #Bitcoin adoption by eliminating the confusion & anxiety that has been holding back institutional investors. Bitcoin dominance will continue to grow as the #Crypto industry rationalizes around $BTC and goes mainstream. pic.twitter.com/Foq4lpderj — Michael Saylor⚡️ (@saylor) June 13, 2023\n\nSaylor noted Bitcoin’s market share increased from 40% to 48% in 2023, which may be attributed in part to the SEC’s enforcement activity and the agency labeling 68 cryptocurrencies as securities — none of which are proof-of-work.\n\nIn the future, Saylor believes this dominance will increase to 80% as “mega institutional money” will flow into crypto after “confusion and anxiety” over crypto disappears.\n\nSaylor and other Bitcoin-centric advocates have been met with considerable criticism, however.\n\nAnthony Sassano, host of The Daily Gwei, recently called out “Bitcoiners” who are pleased to see the SEC file lawsuits against Coinbase and other exchanges that list tokens that the agency considers to be unregistered securities.\n\nIncredibly embarrassing to see how many Bitcoiners who self-identify as \"cypherpunks\" are absolutely salivating at the fact that the SEC is going after Coinbase.\n\n\n\nNo company in this industry has done more for Bitcoin adoption than Coinbase. — sassal.eth (@sassal0x) June 7, 2023\n\nThe team behind Ethereum-based wallet MetaMask and many others also believe a “multichain future” is inevitable because different blockchains serve different purposes.\n\nRelated: Bitcoin price can ‘easily’ hit $20K in next 4 months — Philip Swift\n\nMike McGlone, a senior macro strategist at Bloomberg Intelligence, explained in early May that a “deflationary bust” is impacting the commodities market and bank deposits — and that crypto may be the next domino to fall.\n\nCryptos Could Be the Next Assets to Drop in Deflation Dominoes - It's been a year of rebounds for just about everything that fell in 2022, with #cryptos tops among high-beta performers, but a deflationary bust may be gaining fuel as seen in plunging #commodities and bank deposits pic.twitter.com/H871jqA5xc — Mike McGlone (@mikemcglone11) May 3, 2023\n\nIn January, economist Lyn Alden told Cointelegraph there is “considerable danger ahead” for Bitcoin in the second half of 2023, stating that when the U.S. resolves its debt issue, significant liquidity will be pulled out of markets:\n\n“At that point, both the Treasury and Fed will be sucking liquidity out of the system, and that would create a vulnerable time for risk assets in general, including BTC.”\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJhZ3VlLTIwMjMtc2Ftc29uLW1vdy1pbnRlcnZpZXfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "'There's no more exciting time than now' for Bitcoin: BTC Prague 2023 - Cointelegraph",
        "content": "In recent weeks, the cryptocurrency market has faced bearish trends, driving crypto market capitalization down to its lowest level in over two months.\n\nHowever, according to some market analysts, Bitcoin (BTC) and other altcoins are still resilient despite the overall market climate. But, it’s not only the market analysts still holding onto the bullish sentiment.\n\nAt the BTC Prague 2023 conference, Jan3 CEO Samson Mow spoke with Cointelegraph about how he sees the current state of the Bitcoin market and why he’s bullish for the near and long-term future.\n\nCointelegraph reporter Joe Hall with Jan3 CEO Samson Mow. Source: Cointelegraph\n\nIn terms of price, Mow said that anything under $30,000 is “massively undervalued” and bound to make a rebound sometime soon. The last time BTC hit that price point was in April 2023, for the first time in 10 months.\n\nNonetheless, Mow said he’s not bearish at all and believes BTC will hit six figures.\n\n“I’m bullish because everyone needs Bitcoin.”\n\nHe highlighted that this is becoming more apparent worldwide as traditional financial systems continue to face turmoil.\n\n“The banking system is failing. The legacy financial system is failing. Money is not money anymore and stopped being money some time ago, payments can be frozen. Nothing works. Only Bitcoin works.”\n\nMow told Cointelegraph that he expects to see a wave of Bitcoin adoption within the next five years.\n\nRelated: BTC Prague 2023: ‘Anyone can produce value in the Bitcoin ecosystem’\n\nIn terms of the technology behind Bitcoin, Mow said, “there’s no more exciting time than now.”\n\n“We’re seeing more people talking about new Bitcoin layers, new protocols, ARK, and I think liquid is getting more traction again.”\n\n“I think people are just now understanding that maybe we should look into liquid,” he said. “It’s a very exciting time if you’re paying attention to the technical part of Bitcoin, so pay attention, everyone.”\n\nMagazine: BitCulture: Fine art on Solana, AI music, podcast + book reviews"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNsb3Nlci01MS1hdHRhY2stYWx0Y29pbi1jcnlwdG9jdXJyZW5jeS1tYXJrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin gets closer to '51% attack' on altcoin market - Cointelegraph",
        "content": "Bitcoin’s (BTC) percentage share in the crypto market has risen to nearly 50% in the aftermath of last week’s altcoin market rout.\n\nOn June 13, the Bitcoin Dominance Index (BTC.D), which tracks BTC's weight against other cryptocurrencies, reached 49.29%, slightly down from its two-year highs of 49.66% seen earlier this week.\n\nBTC.D daily price chart. Source: TradingView\n\nBTC not an “unregistered security”\n\nThe surge in Bitcoin dominance comes in the aftermath of the United States Securities and Exchange Commission’s lawsuit against crypto exchanges Binance and Coinbase. In the court filings, the commission accuses many leading altcoins, including Cardano’s ADA (ADA) and Solana’s SOL (SOL), of being “unregistered securities.”\n\nRelated: SEC’s Gensler says BTC, ETH ‘not securities’ in a newly surfaced video\n\nBitcoin’s market share typically rises during high market stress, given that traders view it as the least volatile non-stablecoin crypto asset. For instance, at the height of the banking crisis in March 2023, Bitcoin’s dominance versus altcoins also rebounded to 50%.\n\nAltcoins’ 7-day performance versus the U.S. dollar and Bitcoin. Source: Messari\n\nThere are also other cues suggesting Bitcoin's dominance could grow further to finally break 50%.\n\nFor instance, crypto market maker DWF Labs has reportedly sent millions of dollars worth of non-Bitcoin tokens to exchanges, potentially adding selling pressure for certain altcoins.\n\nIndependent market analyst Stack Hodler also suggested that most crypto hedge funds would first and foremost abandon their altcoin exposure.\n\nBut not everyone is bullish on BTC dominance. Fellow analyst Moustache, for example, argued that the altcoin market may have bottomed once again, with Bitcoin unable to break the 50% mark.\n\n#Bitcoin\n\n\n\nIs the USDT-Dominance about to fall?\n\n\n\nIf so, we're in for a massive Altseason.\n\n\n\n-Head and Shoulders pattern forming (W)?\n\n-Stoch RSI heavily overbought.\n\n\n\nIn the last 3 years this has led to an Altseason 4 out of 5 times.\n\n\n\n+ Sentiment is in the basement for most = Good. pic.twitter.com/odU5jg8srF — ⓗ (@el_crypto_prof) June 12, 2023\n\nBitcoin dominance risks pullback in June\n\nChart technicals suggest that Bitcoin’s dominance can indeed drop in the coming weeks as altcoins rebound.\n\nRelated: ‘There’s no more exciting time than now’ for Bitcoin: BTC Prague 2023\n\nMost notably, BTC.D has failed to close decisively above the 50% mark since April 2021, often reversing its gains due to an overbought weekly relative strength index (RSI).\n\nBTC.D weekly performance chart. Source: TradingView\n\nBitcoin now faces a similar scenario with a retest of the 50% level for the first time since last summer. Meanwhile, its RSI hangs just two points below its overbought level of 70.\n\nTherefore, if history repeats, Bitcoin’s dominance will decline toward 39% by late 2023 or early 2024.\n\nOn the other hand, a breakout here will be key for BTC to possibly reach levels not seen in over two years. For example, analyst Crypto Rover sees a classic bullish continuation setup, with 52% being the next major hurdle if such a scenario pans out.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctcGV0ZXItbWNjb3JtYWNrLWlzLXR1cm5pbmctYW4tdW5rbm93bi10b3duLWludG8tYS1iaXRjb2luLWh1YtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "How Peter McCormack is turning an unknown town into a Bitcoin hub - Cointelegraph",
        "content": "Can a football team backed by Bitcoin (BTC) really raise up a town? In the latest Cointelegraph documentary, reporter Joe Hall investigates the impact of a Bitcoin football club, Real Bedford, on the small commuter town of Bedford in the United Kingdom.\n\nPeter McCormack, the renowned host of the What Bitcoin Did podcast, bought Real Bedford Football Club in 2021 during the peak of the Bitcoin bull run.\n\nWhile many questioned his decision, McCormack saw an opportunity to revive a football club and promote Bitcoin adoption in his hometown. Two years later, Real Bedford F.C. has gained promotion, secured significant sponsorships, and attracted a legion of local and international fans.\n\nAs the video demonstrates, the club’s bright orange jerseys proudly display the Bitcoin logo, symbolizing its close association with the world’s largest digital currency. Before each game, Bitcoin meetups are organized and influential figures from the Bitcoin world are invited to attend.\n\nNaturally, the manager’s unconventional approach has sparked curiosity and criticism, with some locals skeptical of the Bitcoin branding and its implications. Hall asks locals in street interviews and pitchside conversations how much influence the club has had on the town. Some are familiar with the club’s Bitcoin takeover and others had never heard of McCormack, but the overarching sentiment was negative.\n\nMcCormack, however, aims to dispel misunderstandings and facilitate greater Bitcoin adoption through the football club. Rather than forcing the currency on the town’s residents, he believes in using the team as a Trojan horse to gradually introduce them to Bitcoin. The Real Bedford website even features a statement titled “Why you shouldn’t buy Bitcoin,” emphasizing the importance of education and responsible investment.\n\nWhile Real Bedford remains a Bitcoin-only club, McCormack acknowledges the allure of other cryptocurrencies and crypto-related projects:\n\n“If I did a shitcoin, I could raise a billion, and I would get this club in the Premier League in nine years because you have the money to do it. I could build a £200 million stadium if I did a shit coin. It’s really tempting.”\n\nNonetheless, McCormack is committed to Bitcoin’s principles. He is convinced that through hard work and the support of the Bitcoin community, Real Bedford can reach the Premier League in the 2030s.\n\nFeaturing interviews with Jeff Booth, Ben Arc, fans and locals, The Real Bedford documentary will shed light on the team’s story, showcasing the transformative power of Bitcoin in sports and local communities.\n\nAs the United Kingdom government warms up to central bank digital currencies — despite the Bitcoin community’s warnings — Bitcoin could lose a foothold in the country. In such an environment, Real Bedford is increasingly a beacon for Bitcoin adoption in the United Kingdom.\n\nRelated: Bitcoin soccer club Real Bedford FC wins the league\n\nOverall, to pinch Barcelona’s motto, Real Bedford is “mes que un club” or “more than a club.” It’s a symbol of resilience, rebellion and a real-world example of Bitcoin’s ability to raise up areas.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LnN0YXRpc3RhLmNvbS9zdGF0aXN0aWNzLzY2NTA5Ni9udW1iZXItb2YtYml0Y29pbi1hdG0taW5zdGFsbGF0aW9ucy1pbi1iZWxnaXVtLWFuZC10aGUtbmV0aGVybGFuZHMtYnktY2l0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Belgium, Netherlands: Bitcoin ATMs, by city 2020 - Statista",
        "content": "Strategy and business building for the data-driven economy:\n\nThe best of the best: the portal for top lists & rankings:\n\nGet quick analyses with our professional research service\n\nDirectly accessible data for 170 industries from 150+ countries and over 1 Mio. facts.\n\nDetailed information for 39,000+ online stores and marketplaces\n\nBusiness information on 100m+ public and private companies\n\nInsights on consumer attitudes and behavior worldwide\n\nMarket forecast and expert KPIs for 1000+ markets in 190+ countries & territories\n\nAll key figures about countries and regions\n\nDetailed information about political and social topics\n\nConsumer and brand insights and preferences in various industries\n\nKey figures and rankings about companies and products\n\nIndustry and market insights and forecasts\n\nOverview and forecasts on trending topics\n\nNumber of apps available in leading app stores Q3 2022\n\nQuarterly smartphone market share worldwide by vendor 2009-2023\n\nFacebook: quarterly number of MAU (monthly active users) worldwide 2008-2023\n\nNumber of Bitcoin ATM installations in Belgium and the Netherlands in 2020, by city Published by Statista Research Department Read more Total number of Bitcoin ATM installations in Belgium and the Netherlands as of June 2020, by city table column chart Characteristic Number of Bitcoin ATMs Amsterdam (NL) 22 Rotterdam (NL) 7 Brussels (BE) 5 Antwerp (BE) 4 Enschede (NL) 4 Maastricht (NL) 4 Ghent (BE) 2 Alkmaar (NL) 2 Eindhoven (NL) 2 Bastogne (BE) 1 Kortrijk (BE) 1 Amersfoort (NL) 1 Apeldoorn (NL) 1 Arnhem (NL) 1 Bavel (NL) 1 Breda (NL) 1 Groningen (NL) 1 Hulst (NL) 1 Oudenbosch (NL) 1 Roermond (NL) 1 The Hague (NL) 1 Tilburg (NL) 1 Utrecht (NL) 1 Venlo (NL) 1 Loading statistic... Expand statistic Download for free Download PDF + XLS + PNG + PPT + Source Show detailed source information? Register for free Already a member? Log in Source Show sources information Show publisher information Use Ask Statista Research Service Release date June 2020 More information Region Belgium, Netherlands Survey time period October 2020 Citation formats Citation formats View options Other statistics on the topic\n\nPlease create an employee account to be able to mark statistics as favorites. Then you can access your favorite statistics via the star in the header. Register now\n\nCurrently, you are using a shared account. To use individual functions (e.g., mark statistics as favourites, set statistic alerts) please log in with your personal account. If you are an admin, please authenticate by logging in again. Login\n\nStatista Accounts: Access All Statistics. Starting from $2,388 USD / Year\n\nBasic Account Get to know the platform You only have access to basic statistics. Starter Account The ideal entry-level account for individual users Instant access to 1m statistics\n\nto 1m statistics Download in XLS, PDF & PNG format\n\nin XLS, PDF & PNG format Detailed references $199 USD / Month * Professional Account Full access Business Solutions including all features. * Prices do not include sales tax.\n\nStatista Accounts: Access All Statistics. Starting from $2,388 USD / Year Learn more about how Statista can support your business. Request webinar\n\nCoin ATM Radar. (June 26, 2020). Total number of Bitcoin ATM installations in Belgium and the Netherlands as of June 2020, by city [Graph]. In Statista . Retrieved March 14, 2024, from https://www.statista.com/statistics/665096/number-of-bitcoin-atm-installations-in-belgium-and-the-netherlands-by-city/\n\nCoin ATM Radar. \"Total number of Bitcoin ATM installations in Belgium and the Netherlands as of June 2020, by city.\" Chart. June 26, 2020. Statista. Accessed March 14, 2024. https://www.statista.com/statistics/665096/number-of-bitcoin-atm-installations-in-belgium-and-the-netherlands-by-city/\n\nCoin ATM Radar. (2020). Total number of Bitcoin ATM installations in Belgium and the Netherlands as of June 2020, by city . Statista . Statista Inc.. Accessed: March 14, 2024. https://www.statista.com/statistics/665096/number-of-bitcoin-atm-installations-in-belgium-and-the-netherlands-by-city/\n\nCoin ATM Radar. \"Total Number of Bitcoin Atm Installations in Belgium and The Netherlands as of June 2020, by City.\" Statista , Statista Inc., 26 Jun 2020, https://www.statista.com/statistics/665096/number-of-bitcoin-atm-installations-in-belgium-and-the-netherlands-by-city/\n\nCoin ATM Radar, Total number of Bitcoin ATM installations in Belgium and the Netherlands as of June 2020, by city Statista, https://www.statista.com/statistics/665096/number-of-bitcoin-atm-installations-in-belgium-and-the-netherlands-by-city/ (last visited March 14, 2024)\n\nTotal number of Bitcoin ATM installations in Belgium and the Netherlands as of June 2020, by city [Graph], Coin ATM Radar, June 26, 2020. [Online]. Available: https://www.statista.com/statistics/665096/number-of-bitcoin-atm-installations-in-belgium-and-the-netherlands-by-city/"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcHBsZS10by1kZWxpc3Qtbm9zdHItYmFzZWQtZGFtdXMtYXBwLWZvci1iaXRjb2luLXRpcC1mZWF0dXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Apple to delist Nostr-based Damus app over Bitcoin tip feature - Cointelegraph",
        "content": "Decentralized social media app Damus could face the axe from the Apple App Store over its Bitcoin (BTC) tipping feature.\n\nOn June 13, the creators behind Damus shared a warning letter from Apple, which stated the app would be removed from the platform because of the “Zaps” feature allowing people to tip users and content creators in Bitcoin. The feature was made possible by integrating the Lighting Network widget to make Bitcoin payments and tips on the platform.\n\nIn its warning, Apple said the Zaps feature violates its policy prohibiting any form of tipping feature other than in-app purchases. The tech giant stated that even though the tipping feature may be optional, “if they [users] are connected to or associated with receiving digital content, they must use in-app purchase in accordance with guideline 3.1.1.“\n\nThe Damus team called it a watershed moment with huge implications for platforms with peer-to-peer (P2P) support. The team also clarified that Damus doesn’t sell digital goods or provide features for selling digital goods. It simply has tip buttons for facilitating P2P transactions like Venmo or Cash App.\n\nDamus will be removed from the app store in 14 days, apple says zaps are not allowed on their platform because they *could* be used by content creators to sell digital content. This is right before we’re about to give our talk at the oslo freedom forum on how decentralized social… pic.twitter.com/uAK1U0UBet — Damus⚡️ (@damusapp) June 13, 2023\n\nBitcoin and crypto tipping has become quite popular on social media platforms, with Twitter and Reddit enabling the feature. The crypto tipping feature makes way for P2P transactions that don’t require an intermediary to process. Apple itself approved the “Game of Birds” app with Bitcoin tipping in 2015.\n\nZaps on Twitter good ✅\n\nZaps on @damusapp bad ❌\n\n\n\nDamus is being forced to remove this feature, whats up with that? pic.twitter.com/nnq6ytna1I — Damus⚡️ (@damusapp) June 13, 2023\n\nOne Nostr creator, who goes by the Twitter name, Walker, highlighted that Apple’s issue with Zaps was wrongly placed because Damus is not selling any digital content, and the creator requested the tech giant to rectify its mistake.\n\nRelated: Bitcoin self-custody advocate explains why on-ramps are key to adoption\n\nMany other crypto proponents also questioned how tips on Twitter are acceptable, but the same feature on Damus violates Apple’s policies. Others accused Apple of protecting the interests of Silicon Valley.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXZzLWJpbmFuY2UtY29pbmJhc2UtYnRjLXByYWd1ZS1pbnRlcnZpZXfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin 'far larger' than Binance or Coinbase, says Jan3 CEO: BTC Prague 2023 - Cointelegraph",
        "content": "Amid the panic over lawsuits against major cryptocurrency exchanges, one Bitcoin (BTC) advocate argued that the BTC market is much bigger than the one tracked by exchanges.\n\nThe total Bitcoin market is not limited to Binance, Coinbase or any other crypto exchange, Jan3 CEO Samson Mow told Cointelegraph at the BTC Prague 2023 conference on June 9.\n\n“Whereas I think for Bitcoin, it’s much harder to quantify how much of the market it is. It’s because a lot of Bitcoin trades are block trades,” Mow said.\n\nIn mentioning Bitcoin block trades, Mow referred to private trading channels that allow investors to privately negotiate and proceed with large BTC buy or sell orders. Some of the channels include peer-to-peer (P2P) or over-the-counter (OTC) deals, he noted, adding:\n\n“You kind of have this black box around Bitcoin. You don’t really know how much the market is total. If Bitcoin functions as P2P, you’re not going to quantifiably measure how much Bitcoin is traded.”\n\nPrivate Bitcoin trading channels like P2P or OTC are not included in total BTC trading volumes on major crypto tracking websites like CoinGecko. That means Bitcoin’s daily trading volume is more extensive than the $9.6 billion recorded at the time of writing.\n\n“CoinGecko only tracks trades happening on crypto exchanges and does not track trades happening on P2P platforms and brokerages,” CoinGecko co-founder and chief operating officer Bobby Ong told Cointelegraph.\n\n“P2P platforms include places such as Binance P2P, Huobi P2P, Paxful, Remitano and so on,” the executive noted. CoinGecko has no plans to track such platforms in the near future, Ong added.\n\nRelated: Binance.US halts trading for dozens of USDT, BTC, BUSD pairs amid SEC lawsuit\n\nApart from P2P, CoinGecko also doesn’t record institutional trades on OTC, Ong said, adding:\n\n“Institutional trades that happen on exchanges that we track are recorded. OTC trades are not recorded as it’s like a P2P trade but between large entities.”\n\nThe new remarks from the Jan3 CEO may imply that cryptocurrency exchange moguls like Binance or Coinbase might not dominate the Bitcoin market as much as some think.\n\nIn January 2023, the Norwegian crypto research firm K33 Research — formerly Arcane Research — said that Binance handled 92% of the Bitcoin spot market in 2022. “No matter how you look at it in terms of trading activity, Binance is the crypto market,” the firm wrote at the time.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItYm5iLWNyeXB0by1taXhlZC_SAThodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWJuYi1jcnlwdG8tbWl4ZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether retreat; BNB leads gainers, top 10 crypto mixed - Forkast News",
        "content": "Bitcoin fell in Wednesday morning trading in Asia, remaining stuck under the US$26,000 resistance line. Ether also lost ground, while other top 10 non-stablecoin cryptocurrencies by market capitalization were mixed. The BNB token of the Binance crypto exchange marked the biggest gains among the top 10 after a U.S. court denied the financial regulator’s request to freeze the assets of the Binance.US exchange.\n\nFear & Greed\n\nBitcoin fell 0.38% over the last 24 hours to US$25,835.15 at 7:00 a.m. in Hong Kong, losing 4.87% in the last week and repeatedly failing to break through resistance at US$26,000 following the lawsuits filed last week against U.S. crypto trading platforms by the Securities and Exchange Commission (SEC).\n\nEther dipped 0.49% to US$1,734.63, posting a 7.87%% loss for the week.\n\nBitcoin is struggling to move above $26,000 because of the fear in the crypto market and despite the optimism in equities, Alex Kuptsikevich, senior market analyst at online brokerage firm FxPro said in emailed comments.\n\n“The cryptocurrency Fear & Greed Index is in the Fear territory at 45 (-2 points overnight), whereas the Fear & Greed index for the stock market is at 79 (extreme greed),” Kuptsikevich noted. “Technically, to break the downtrend, Bitcoin needs to overcome $27K, and a drop below $26.5K is required to confirm the downtrend. The second scenario seems more likely.”\n\nOther top 10 cryptocurrencies were mixed. Binance’s BNB token led winners with 4.67% rise to US$241.36, reducing its weekly loss to 14.41%.\n\nThe BNB gains came after a U.S. federal judge on Tuesday denied the SEC request for a temporary restraining order that would have frozen the assets of Binance.US, the U.S. arm of the world’s largest cryptocurrency exchange.\n\nThe judge’s decision allows Binance.US to continue operating while it negotiates with the SEC over its compliance with securities laws. Last week, the federal agency accused Binance.US of failing to register as a securities exchange and of offering and selling unregistered securities. The SEC also filed a lawsuit against the U.S.-based Coinbase exchange. Both exchanges have rejected the allegations.\n\n“According to CryptoQuant, bitcoin reserves on US crypto exchanges have fallen below the 50% – levels last seen in 2017. Assets are flowing to overseas exchanges due to regulatory uncertainty and recent SEC actions against Binance and Coinbase,” said Kuptsikevich.\n\nIn other developments involving the SEC and crypto, Ripple’s XRP token lost 0.87% to US$0.5197 for a weekly decline of 2.25% after Tuesday’s long-awaited unveiling of the so-called “Hinman documents,” named after former SEC corporate finance director William Hinman.\n\nRipple Labs Inc. was sued by the SEC in December 2020, which alleged XRP was offered and sold as an unregistered security. The company had sought the unsealing of the documents which reveal that Hinman said Bitcoin and Ether should not be categorized as financial securities. The comments are a major point of argument between the SEC and Ripple as Ripple seeks to bolster its fair notice defense.\n\nRipple’s chief legal officer Stuart Alderoty wrote on Twitter Tuesday that the documents show: “Hinman ignored multiple warnings that his speech contained made-up analysis with no basis in law” and showed the SEC flip-flopped and overstepped the boundaries of its jurisdiction.\n\n“Unelected bureaucrats must faithfully apply the law within the constraints of their jurisdiction. They can’t – as Hinman tried – create new law,” Alderoty said.\n\nThe total cryptocurrency market cap lost 0.12% to US$1.054 trillion in the last 24 hours, while daily trading volume increased by 10.62% to US$33.75 billion, according to CoinMarketCap data.\n\nNFT market on downtrend\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index lost 1.76% to 2,919.17 in the 24 hours to 7:30 a.m. in Hong Kong. The index is down 10.92% for the week.\n\n“The Forkast 500 NFT index is now down nearly 11% in seven days as we continue to find new lows,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“Thinking about what it will take to recover seems pretty daunting, as traders are pretty unsure that a recovery will even mean existing assets regain value. History tells us that it’s new projects that a majority of investors’ funds will go into.”\n\nTotal NFT buy/sell transactions rose 3.42% to US$22.1 million, but sales on Ethereum, the leading blockchain by volume, fell 3.94% over the last 24 hours to US$12.87 million, according to CryptoSlam data.\n\nThe Bitcoin network was the second largest NFT network in terms of buy/sell transactions, jumping 76.67% to US$3.8 million in the last 24 hours.\n\nTransactions of Uncategorized Ordinals — unique digital assets on the Bitcoin network that are not identified as part of one established collection — rose 69.42% to US$1.39 million.\n\nBored Ape Yacht Club sales gained 25.14% to US$1.3 million.\n\n“Art is still hot, with multiple Fidenzas selling for six figures recently and plenty of hype leading up to the Sotheby’s grails auctions coming this week,” Petscher added. Fidenza refers to a collection of 999 NFTs created by the artist Tyler Hobbs using computer algorithms.\n\nSotheby’s is auctioning the Grails digital art collection on Wednesday. The collection consists of NFT artwork that belongs to the bankrupt crypto hedge fund Three Arrows Capital and its NFT-purchasing fund Starry Night Capital.\n\nU.S. stock futures mixed\n\nFederal Reserve Board Chairman Jerome Powell (Left), Securities and Exchange Commission Chair Gary Gensler (Right) | Image: Getty Images\n\nU.S. stock futures were mixed as of 9:30 a.m. in Hong Kong after equities gained for the fourth consecutive day during regular trading on Tuesday. Dow Jones Industrial Average futures fell 0.24%, S&P 500 futures edged 0.034% lower while Nasdaq Futures gained 0.028%.\n\nDuring Monday’s regular trading, the Dow climbed 0.43%. The S&P 500 added 0.69%, and the Nasdaq Composite gained 0.83%.\n\nTuesday’s U.S. Consumer Price Index (CPI) report showed that inflation grew at a 4% annual rate in May, compared to 4.9% in April. The CPI was the lowest yearly inflation rate since March 2021, leaving investors hopeful for a pause in the Federal Reserve’s run of interest rate hikes to curb price inflation.\n\n“It’s a feel-good headline figure that will cheer investors as it will add further pressure on the Fed to pause its interest rate hike agenda,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an email statement.\n\n“The U.S. central bank is now 15 months and 10 consecutive rate increases into its battle to cool red-hot inflation, but markets will be expecting that the latest CPI report will now be enough to convince officials to hit the pause button,” Green said.\n\nThe U.S. central bank is expected to leave interest rates unchanged when it meets on Wednesday, according to TradingEconomics. U.S. rates are at 5% to 5.25%, the highest since 2006 after ten consecutive hikes that started in March 2022 to slow the pace of inflation that surged to 40-year highs at one stage.\n\nThe CME FedWatch Tool predicts a 94.2% chance the Fed will leave rates as is at this week’s meeting, up from 80.4% the previous day.\n\nHowever, Green of deVere Group warned of more hikes this year — “Inflation is certainly coming down so far, but it is very, very gradual. It remains sticky and a long way from the 2% target, largely due to a tight labor market.”\n\nFormer Fed vice chair Roger Ferguson also told CNBC last Friday that the central bank may raise rates later in the year even if it skips this time.\n\n(Updates with equities section)"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZsYXQtMjYtay1wcGwtZGF0YS1tYXJrZXRzLWZlZC1wb3dlbGzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin stays flat at $26K after PPL data as markets await Fed's Powell - Cointelegraph",
        "content": "Bitcoin (BTC) stuck to $26,000 on June 14 as fresh United States macroeconomic data prints failed to move cryptocurrency markets.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nPPI offers Bitcoin bulls little fuel\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD staying stubborn as Producer Price Index (PPI) data showed U.S. inflation continuing to slow.\n\nUS PPI just came in:\n\n\n\n-0.3% vs 0.2% previously\n\n-0.1% was predicted\n\n\n\nJust like yesterday, was lower than the predictions, furthering the likelihood of a pause at tomorrows #FOMC meeting. https://t.co/SymSTWwHSS — Decentrader (@decentrader) June 14, 2023\n\nIn line with its reaction to the Consumer Price Index (CPI) print the day prior, the pair failed to offer traders volatility, sticking to a familiar range between various moving averages.\n\nMarket commentators thus turned to the day’s upcoming Federal Reserve decision on interest rates, as well as subsequent comments from Chair Jerome Powell, for a source of inspiration.\n\nBig Day!\n\n\n\n8:30am ET PPI Data should trigger some volatility. #TradFi and #Crypto markets want to see PPI trending down, but the BIG story of the day is the 2pm FED Decision and longer range interest rate projections.\n\n\n\nRegardless of the 2pm Decision, #JPow's comments at 2:30pm… pic.twitter.com/osrjCiAgcr — Material Indicators (@MI_Algos) June 14, 2023\n\n“Happy hawkish pause day!” financial commentator Tedtalksmacro wrote in part of the day’s analysis.\n\nTedtalksmacro referenced major U.S. bank projections for the Fed to halt its rate hike cycle in place since late 2021.\n\nThe latest data from CME Group’s FedWatch Tool continued to fall in line with the forecast, showing 92% odds of a rate hike pause at the time of writing.\n\nFed target rate probabilities chart. Source: CME Group\n\nBeyond the rate decision, U.S. dollar strength formed a topic of debate among Bitcoin analysts, with Crypto Ed eyeing a potential bounce from support that could cause problems for BTC/USD.\n\n“DXY reached green box and bouncing a bit,” he commented alongside a chart of the U.S. dollar index (DXY).\n\n“If this means its correction is finished and it continues its way up, I’m expecting pressure on BTC.”\n\nU.S. Dollar Index (DXY) charts. Source: Crypto Ed/Twitter\n\nNearly three months of BTC price “falling wedge”\n\nWhen it comes to BTC price action overall, popular trader and analyst Rekt Capital adopted a more optimistic view.\n\nRelated: SEC, CPI and a ‘strong rebound’ — 5 things to know in Bitcoin this week\n\nDespite the tense atmosphere on the back of negative catalysts, specifically the U.S. legal onslaught against major exchanges, he noted that BTC/USD had fallen less than 20% below its local highs of $31,000 from April.\n\n#BTC has only retraced -19% since its mid-April local top\n\n\n\nWith all the negative catalysts and FUD, one would've instinctively felt that the retrace was so much deeper than that$BTC #Crypto #bitcoin — Rekt Capital (@rektcapital) June 14, 2023\n\nFellow trader Moustache likewise adopted a positive take on the current scenario, arguing that on longer timeframes, recent events had left BTC price action little changed.\n\n#Bitcoin - Update\n\n\n\nToday FOMC takes place and $BTC still looks like this.\n\n\n\n- In a Falling Wedge for 2.5 months\n\n- Above the EMA 21 (bull market line) pic.twitter.com/dWjLbJ3VMZ — ⓗ (@el_crypto_prof) June 14, 2023\n\nMagazine: Tornado Cash 2.0: The race to build safe and legal coin mixers\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJhZ3VlLXVuY2xlLXJvY2tzdGFyLWJpdGNvaW4taW50ZXJ2aWV30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Developer Uncle Rockstar shares the key to Bitcoin adoption: BTC Prague 2023 - Cointelegraph",
        "content": "BTC Prague 2023 highlighted that there remain many places in the world where Bitcoin (BTC) adoption is still in its early stages, but the community is optimistic it can onboard more BTC supporters despite the challenges that come its way.\n\nIn an interview with Cointelegraph reporter Joseph Hall, pseudonymous Bitcoin developer Uncle Rockstar, the head of Bitcoin at payment platform Strike, shared his thoughts on Bitcoin adoption and his most pressing concerns within the Bitcoin ecosystem in 2023.\n\nThe developer said the BTC Prague event allowed him to talk about his story. He said that while he had less time, he allowed people to catch “tiny bits” that he believes will let people “do the same for themselves.” He explained:\n\n“At the end of the day, that’s what it’s all about. Like, how can we have more people that individually are uplifted by Bitcoin, and then can contribute to Bitcoin? And then, we increase Bitcoin adoption.”\n\nThe developer encouraged people to explore Bitcoin and reach out to him or Strike to see how they can collaborate.\n\nUncle Rockstar speaks with Cointelegraph reporter Joseph Hall at BTC Prague. Source: Cointelegraph\n\nWhen asked about his most pressing concerns in the Bitcoin ecosystem in 2023, the developer spoke about what he describes as the “Bitcoin derangement syndrome” and distractions with “shitcoins and the SEC [Securities and Exchange Commission]” that could cause some infighting.\n\nRelated: BTC Prague 2023: ‘Anyone can produce value in the Bitcoin ecosystem’\n\nHe further explained that community members with the so-called derangement syndrome have started to make things all about themselves. Rockstar said:\n\n“It’s like ‘me, me, I have done this. I have done that.’ Even if you look at block size wars, it was like, ‘I know what should be done!’ And then you have a number of people who are more simply better suited and know more.”\n\nAccording to Rockstar, these issues reduce the focus on what should be done within the ecosystem. The developer also said he’s grateful to those who continue fighting against these bad actors within the space.\n\nHe added that everyone has a role to play in the space, and if more people join the community, Bitcoin can stay on its course.\n\n“As long as we keep getting more quality Bitcoiners in Bitcoin, and they create a network, they’re all individual nodes. And they support each other, and they communicate with each other, and they collaborate. Bitcoin will keep rising,” Rockstar explained.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmZpbmV3cy5jb20vbmV3cy9lbmdsaXNoLW5ld3MvNTc3ODgtYml0Y29pbi1zdWlzc2UtcHJvZml0cy1waGlsaXBwLXJvZXNsZXItcm9nZXItc3R1ZGVyLW1hcmNvLW1lbm90dGktZGlyay1rbGVl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Suisse's Profits Crash Amid Crypto Slump - finews.com",
        "content": "Bitcoin Suisse saw profits plunge in 2022, making it all the more urgent for the crypto start-up to restructure its business model. At the same time, it is bringing on prominent people to its board of directors as it sets the path to become an institution as finews.com found out.\n\nBitcoin Suisse’s operating income fell to 37 million Swiss francs from 84 million Swiss francs in 2022 from the previous year, its CEO Dirk Klee, said in an interview with finews.com, adding that trading collapsed in the face of various scandals in the crypto industry.\n\nThe results, leaked to «Inside Paradeplatz,» ahead of the company’s annual general meeting at the end of the month, represent a «complete reversal» from 2021, which was a bumper year. The drop in profit-making was partially due to large individual customers selling mass amounts of tokens and coins, Klee said, while adding that overall, the company had attracted net new money.\n\nImpairment Losses\n\nThe market correction also impacted Bitcoin Suisse own holdings, deposited across trading centers worldwide, which fell by around 23 million Swiss francs. «Proprietary trading» category is not proprietary trading in the conventional sense, but rather corresponds to current assets used for operational business, Klee said.\n\n(Image: Bitcoin Suisse)\n\nAlthough the setback was also due to the large drops in the value of altcoins (alternative digital assets), Bitcoin Suisse will continue to maintain these holdings, Klee said. Admitting these were not «pretty numbers,» for Klee they show the volatility in crypto brokerage.\n\nFurthermore, the company can stomach the results which were expected due to the market situation. Bitcoin Suisse continues to be solidly financed and «very well prepared» for a possible upturn in the crypto industry, he added.\n\nJob Cuts\n\nBitcoin Suisse has had to cut one in four jobs at the company since the end of 2021. Overall, the headcount has fallen from over 300 to around 220 full-time positions during this period. A major round of layoffs took place last January, but Klee says that some of the measures were cushioned by natural employee turnover.\n\nThe recent market turmoil that followed the lawsuits filed by the US Securities and Exchange Commission against leading crypto exchanges Binance and Coinbase has even led to many inquiries from customers, Klee said. «We expect that the turmoil could prove positive for solid and Swiss-based providers like us,» he added.\n\nNew Members\n\nPhilipp Roesler, (pictured below) the former leader of the German Free Democratic Party (FDP), who also served as a finance minister and vice chancellor under Angela Merkel, is joining Bitcoin Suisse’s board of directors according to Klee.\n\n(image: Brainloop)\n\nThe crypto company is hoping to gain from Roesler's international network. The 50-year-old former politician, who lives in Zurich, has a strong affinity for crypto and is active in Switzerland’s crypto scene, Klee said.\n\nMarco Menotti, worked for 15 years at UBS, before moving to the Swiss stock exchange SIX’s executive board in 2018. He left SIX in mid-2022 to pursue various mandates at smaller companies.\n\n(Image: Helveteq)\n\nRoger Studer\n\nBoth Roesler and Menotti will stand for election at the annual general meeting on June 29. The Zug-based crypto broker has undoubtedly scored a coup with Roesler's candidacy on Bitcoin Suisse’s board. However, Roesler’s candidacy is not about gathering celebrities on the board of directors - but about helping the crypto startup on its way to becoming an institution, Klee said.\n\nFurthermore, Roger Studer (pictured above) is leaving the board after a three-year term to concentrate on various other mandates. Studer headed investment banking at Zurich-based Vontobel and led a financing round for Bitcoin Suisse as an investor in 2020, before becoming an entrepreneur.\n\nSteady Earnings\n\nBitcoin Suisse is currently preparing to apply for a Swiss banking license after withdrawing its previous application in 2021. Part of these preparations include the commissioning of a crypto-compatible core banking system and strengthening of governance and compliance, Klee told finews.com\n\nBitcoin Suisse, which has had a strong trading focus, is aiming to position itself as an asset manager going forward. A shift that could also result in more steady earnings.\n\nStaking, a service whereby the entity - in this case, Bitcoin Suisse - holds tokens and coins to validate blockchain transactions and gives customers token rewards in return, is also in focus.\n\nThe Zug-based company says it is already among the five largest providers worldwide of staking services."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qYWNrLWRvcnNleS1yZWxpZWYtZnVuZC1kb25hdGlvbi1iaXRjb2luLW5vbnByb2ZpdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Jack Dorsey's relief fund pledges $5M donation to Bitcoin-focused nonprofit - Cointelegraph",
        "content": "Brink, a nonprofit organization aimed at supporting Bitcoin developers, has announced a $5 million donation from Block CEO Jack Dorsey and his Start Small funding group.\n\nIn a June 14 tweet, Brink said Dorsey and Start Small pledged to make $1 million in donations annually for the next five years as part of “developer funding efforts.” Prior to his departure as CEO of Twitter, Dorsey launched the fund in April 2020 in an effort to fight the COVID-19 pandemic. At the time, the Twitter CEO said he had seeded the fund with $1 billion.\n\nAccording to Start Small’s website, the fund had more than $1.4 billion in funding at the time of publication, with more than $500 million distributed to projects, including the Tor Project — the nonprofit behind the anonymous Tor Browser — the Signal Technology Foundation backing the Signal messaging app, and the Calyx Institute, a digital privacy education platform.\n\nHonored to receive a very generous $5,000,000 pledge to our developer funding efforts from @jack and #startsmall\n\n\n\nBrink will receive $1,000,000 per year for the next 5 years.\n\n\n\nThank you for supporting #bitcoin developers! — Brink (@bitcoinbrink) June 14, 2023\n\nFounded in 2020, Brink offers fellowship and grant programs to support open-source Bitcoin (BTC) developers and engineers. Aside from crypto supporters like Dorsey, digital asset firms such as Nexo have previously made donations to the group as part of efforts to support BTC developers.\n\nRelated: US share of global crypto developers fell 26% in 5 years — a16z\n\nDifferent firms within the crypto and blockchain space have made similar efforts to start funds encouraging developers to come out of the woodwork. Dogecoin (DOGE) started a fund for core developers in December 2022 with $360,000, and metaverse developer Animoca Brands reportedly planned a billion-dollar fund for startups.\n\nMagazine: Crypto is changing how humanitarian agencies deliver aid and services"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRoZXBsYWlkaG9yc2UuY29tLzIwMjMvMDYvMTMvc2hvdWxkLWktYnV5LWJpdGNvaW4tb3ItZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Should I Buy Bitcoin or Ethereum? - The Plaid Horse",
        "content": "Bitcoin and Ethereum are two of the most well-known cryptocurrencies in the market, each with its unique features and potential for growth. As the cryptocurrency market continues to expand, investors may wonder which digital asset is the better investment. In this article, we’ll compare Bitcoin and Ethereum by examining their advantages, risks, and personal considerations to help you make an informed decision and finally buy Ethereum with credit card without any stress.\n\n\n\nExplanation of Bitcoin and Ethereum\n\nBitcoin is the first and most well-known cryptocurrency, launched in 2009. It operates on a decentralized network and uses blockchain technology to facilitate transactions. Ethereum, launched in 2015, is a blockchain platform that enables developers to build and deploy decentralized applications (dApps) and smart contracts. Its native cryptocurrency, Ether (ETH), is used to power these applications and facilitate transactions within the network.\n\n\n\nBrief Overview of the Cryptocurrency Market\n\n\n\nThe cryptocurrency market has grown significantly in recent years, with thousands of digital assets available for investment. While Bitcoin and Ethereum are the most well-known, other cryptocurrencies offer unique features and potential for growth.\n\n\n\nAdvantages of Bitcoin\n\n\n\nBitcoin offers several advantages, including:\n\n\n\nEstablished and Widely Recognized\n\nAs the first cryptocurrency, Bitcoin has established itself as a recognizable brand and a dominant player in the market. Its widespread adoption and recognition can provide a level of stability and liquidity that can be attractive to investors.\n\n\n\nLarger Market Cap\n\nBitcoin has a larger market capitalization than Ethereum, making it a more established and stable investment option.\n\n\n\nLimited Supply\n\nBitcoin has a limited supply of 21 million coins, which can increase its value over time as demand grows.\n\n\n\nAdvantages of Ethereum\n\nEthereum offers several advantages, including:\n\n\n\nSmart Contract Functionality\n\nEthereum’s smart contract capabilities have led to a growing number of use cases, from decentralized finance (DeFi) to non-fungible tokens (NFTs). This functionality can drive innovation and increase the platform’s value over time.\n\n\n\nFaster Transaction Times\n\nEthereum’s transaction times are faster than Bitcoin’s, making it a more efficient option for transactions.\n\n\n\nGrowing Ecosystem of Decentralized Applications\n\nEthereum’s growing ecosystem of dApps and smart contracts can provide a level of versatility and potential for growth that can be attractive to investors.\n\nRisks and Concerns\n\n\n\nBoth Bitcoin and Ethereum come with risks and concerns, including:\n\n\n\nVolatility of the Cryptocurrency Market\n\nThe cryptocurrency market is known for its volatility, with prices often experiencing significant fluctuations. This volatility can lead to potential losses for investors who are not prepared to weather market downturns.\n\n\n\nRegulatory Uncertainty\n\nAs the cryptocurrency market continues to grow, it may face increased regulatory scrutiny from governments worldwide. Changes in regulations could impact Bitcoin’s and Ethereum’s value and their ability to operate in certain jurisdictions.\n\n\n\nSecurity Concerns\n\nCryptocurrencies are vulnerable to security breaches and hacks, which can lead to potential losses for investors.\n\n\n\nConclusion\n\n\n\nWhen deciding between Bitcoin and Ethereum, personal considerations should be taken into account. Consider your investment goals, risk tolerance, and market conditions to determine which digital asset aligns with your objectives. Ultimately, the decision to buy Bitcoin or Ethereum should be based on a thorough analysis of the advantages, risks, and personal considerations involved. Remember, investing in cryptocurrencies comes with risks, and it’s essential to conduct thorough research and consider multiple perspectives before making any investment decisions."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaW5hbmNlLWNlby1jaGFuZ3Blbmctemhhby1kZW5pZXMtcnVtb3JzLXNlbGxpbmctYml0Y29pbi10by1ib2xzdGVyLWJuYtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Binance CEO Changpeng Zhao denies rumors of selling Bitcoin to bolster BNB - Cointelegraph",
        "content": "Binance CEO Changpeng “CZ” Zhao has refuted accusations that Binance has been secretly selling Bitcoin (BTC) to artificially stabilize the price of its BNB (BNB) token.\n\nThe rumors have come from several market commentators, including analyst Dylan LeClair and Swan Bitcoin CEO Cory Klippsten, who have accused Binance of intentionally manipulating the market to artificially inflate the value of BNB.\n\nIn a June 13 tweet, CZ said that Binance had not sold any of its BTC or BNB, adding that the crypto exchange still held “a bag” of FTX Token (FTT) — the native token of the now-defunct crypto exchange FTX.\n\n4. Binance have not sold BTC or BNB. We even still have a bag of FTT.\n\n\n\nIt is amazing they can know exactly who sold based on just a price chart involving millions of traders. FUD. ‍♂️ pic.twitter.com/M3MUH2bFRE — CZ Binance (@cz_binance) June 13, 2023\n\n“It is amazing they can know exactly who sold based on just a price chart involving millions of traders. FUD,” he added.\n\nCZ’s post was a direct response to a June 14 post from technical analysis platform Skew, which accused Binance of manipulating the market through a series of trades involving BTC, BNB and Tether (USDT):\n\n“Binance is definitely up to something here to prevent BNB from crashing as well as BTC.”\n\nIn the same thread, Bitcoin analyst LeClair claimed that “BNB is clearly a fake market,” trading with less realized volume than BTC.\n\nIn a June 13 tweet, Klippsten also alleged that Binance was engaging in “wash trading” and claimed that Binance is “trying to pretend” there’s support for BNB:\n\nWash trading like craaaaaazzzzyyyyy on Binance right now trying to pretend there’s support for BNB. This looks sooooooo bad for CZ.https://t.co/qCHjQCSXwD — Cory Klippsten ️ Swan.com #Bitcoin (@coryklippsten) June 12, 2023\n\nWash trading is a market manipulation tactic where a trader sells an asset and then buys it shortly after to inflate its demand or make it look like there’s more activity in the marketplace.\n\nAnalyst Joe Consorti from The Bitcoin Layer also described BNB’s price action as “unusual” with the “$220 level” being “staunchly defended.” He suggested that it may be a liquidation level for a BNB-collateralized loan.\n\nUnusual price action on Binance.\n\n\n\nLoads of selling pressure on bitcoin not present on other exchanges.\n\n\n\nMore cannon fodder that they may be selling spot BTC to prop up BNB.\n\n\n\nThe $220 level is being staunchly defended — may be a liquidation level for a BNB-collateralized loan. https://t.co/EYfLJ1KIcX pic.twitter.com/7XGNLlzcpf — Joe Consorti ⚡ (@JoeConsorti) June 13, 2023\n\nIn response to CZ’s post, Consorti asserted that Binance should publish an audited statement proving that Binance has no BNB-collateralized liabilities in order for the “FUD” to end.\n\nRelated: 70% of unregulated exchange transactions are wash trading: NBER study\n\nThe United States Securities and Exchange Commission sued Binance.US on June 5 for allegedly breaking securities laws in addition to engaging in wash trading through its “primary undisclosed ‘market making’ trading firm Sigma Chain,” which is owned by CZ.\n\nCZ and Binance.US have denied any wrongdoing and say they will “vigorously” defend the charges laid against them in the U.S. District Court in Washington, D.C.\n\nMagazine: US and China try to crush Binance, SBF’s $40M bribe claim: Asia Express"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJlamVjdHMtY3BpLWJvb3N0LW1hcmtldC1mZWQtcmF0ZS1wYXVzZS1vZGRzLW5lYXItOTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price rejects CPI boost as market Fed rate pause odds near 95% - Cointelegraph",
        "content": "Bitcoin (BTC) fell back in line at the June 12 Wall Street open after a brief macroeconomic data jolt failed to shift the status quo.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nMarkets expect first Fed pause since 2021\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD continuing to circle $26,000, avoiding major volatility.\n\nThe largest cryptocurrency saw a brief spike toward $26,500 on the back of the latest United States Consumer Price Index (CPI) print, which came in below expectations.\n\nWhile ostensibly a boon to risk assets, crypto markets remained cautious on the day, with comments from the Federal Reserve and further macro prints due in the coming days.\n\nEquities: Full Bull.\n\nCrypto: Can't even muster a small pop for us to get short.\n\n\n\nWhat a shame lol — Crypto Chase (@Crypto_Chase) June 13, 2023\n\nBets on the Fed pausing its rate hike cycle on June 14 after the meeting of the Federal Open Market Committee (FOMC), meanwhile, climbed following the CPI event. At the time of writing, per CME Group’s FedWatch Tool, the odds stood at over 90%, having started the day at 75%.\n\nFed target rate probabilities chart. Source: CME Group\n\n“Disinflation continues!” financial commentator Tedtalksmacro reacted.\n\n“Headline CPI prints at +4.0% YoY, which now takes the 3-month annualised rate to +2.21%. The Fed have long targeted 2.0%. PAUSE.”\n\nTrading firm QCP Capital likewise believed that “consensus has it right” — that the Fed would not raise rates further — at least this time.\n\n“Based on high frequency indicators, US inflation is falling rapidly, which will enable the FOMC to make this week’s meeting their first pause in more than a year,” it wrote in a market update on the day.\n\nQCP acknowledged that subsequent FOMC meetings may yield different results, in order to “appease” more hawkish committee members.\n\n“Furthermore we think the easing of financial conditions as a result of this massive melt-up equity rally will play at the back of their minds,” it added.\n\nBTC price: Where’s the volatility?\n\nMultiple commentators, meanwhile, noted that BTC/USD had closed the gap in CME Bitcoin futures from the weekend.\n\nRelated: SEC, CPI and a ‘strong rebound’ — 5 things to know in Bitcoin this week\n\n#Bitcoin Last weekend's CME Gap has been closed. pic.twitter.com/wcathiQPUU — Daan Crypto Trades (@DaanCrypto) June 13, 2023\n\nAnalyzing what could come next, Michaël van de Poppe, founder and CEO of trading firm Eight, was torn, nonetheless flagging $25,000 as a potential downside entry point.\n\nCME gap closed of #Bitcoin.\n\n\n\nDump into FOMC as FOMC hikes 25bps and then bounce back up as Powell states that they'll pause or unemployment claims come in higher than expected?\n\n\n\nAll on the cards as a scenario.\n\n\n\nIn that case, bidding around $25K makes sense or flip $26.5K — Michaël van de Poppe (@CryptoMichNL) June 13, 2023\n\nData from the Binance order book uploaded to social media by monitoring resource Material Indicators, meanwhile, showed a lack of liquidity near spot price prior to the print, with clearly defined support and resistance.\n\nHere's how the #BTC order book on @binance is setup just ahead of the U.S. Economic Reports.\n\n\n\nFED watchers want to see inflation numbers continuing to cool. #TradFi #Crypto #FED #FireCharts pic.twitter.com/ShhAO42GxS — Material Indicators (@MI_Algos) June 13, 2023\n\n“Bulls are looking for a boost from the Economic Data coming today and tomorrow to reclaim the range,” part of a prior post commented about daily timeframes.\n\nMagazine: Tornado Cash 2.0: The race to build safe and legal coin mixers\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtZm9jdXNlcy1vbi0yNmstYXMtYml0Y29pbi10cmFkZXJzLWJyYWNlLWZvci1jcGktdm9sYXRpbGl0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "BTC price focuses on $26K as Bitcoin traders brace for CPI volatility - Cointelegraph",
        "content": "Bitcoin (BTC) returned above $26,000 on June 13 as analysts eyed resistance overhead.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nBitcoin price inches between trend lines\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD attempting to reclaim $26,000 support after the daily close.\n\nThe pair had seen a curiously uneventful start to the week despite ongoing fallout from United States legal action and markets preparing for a slew of macroeconomic data releases.\n\nThus, Bitcoin remained in a narrow range, which has been in place since midway through the weekend.\n\n“Risky day for any deep trades,” popular trader Crypto Tony wrote in part of the day’s Twitter analysis, considering upside potential should the support flip occur.\n\n$BTC / $USD - Update\n\n\n\nRisky day for any deep trades, but trying this out if we can flip the current supply zone into support ✅ pic.twitter.com/Is00mDPXfV — Crypto Tony (@CryptoTony__) June 13, 2023\n\nMeanwhile, the trading suite DecenTrader flagged multiple resistance levels to overcome next. It noted that funding rates were climbing, indicating a potential trend reversal already entering.\n\n#Bitcoin Funding rates are starting to climb to 0.01% which typically has been a level for either a pause or a reversal. https://t.co/816f26dDoz pic.twitter.com/6TejFcI7tM — Decentrader (@decentrader) June 13, 2023\n\nOther traders, including Moustache; and Michaël van de Poppe, founder and CEO of trading firm Eight, noted BTC/USD still holding trend lines which could be cause for optimism — specifically, the 21-week and 200-week exponential moving averages (EMAs).\n\n#Bitcoin - Update$BTC is still holding above the (W) EMA 21 line.\n\n\n\nAnyone who has been in crypto long enough, knows how significant this line is.\n\n\n\n- Falling wedge still active✅\n\n\n\nCPI and FOMC this week.\n\nI think we'll see a lot of volatility. pic.twitter.com/Pgi6qRSQkM — ⓗ (@el_crypto_prof) June 12, 2023\n\n“Ultimately, we’ll see coming few days whether that’s going to sustain or whether we’ll continue this downwards slope,” Van de Poppe commented the day prior about the 200EMA.\n\nCPI day arrives\n\nMacroeconomic data prints for the week center on the Consumer Price Index (CPI) due June 13, just a day before the Federal Reserve announces interest rate changes.\n\nRelated: SEC, CPI and a ‘strong rebound’ — 5 things to know in Bitcoin this week\n\nThe Fed is expected to pause interest rate hikes, which would follow a full 10 consecutive hikes and mark a long-awaited turning point in policy.\n\nWhile a potential boon for risk assets, including crypto, not everyone was upbeat about the impact of a rates freeze.\n\n“The Fed will likely still sound hawkish but the more important question is if they will hold rates where they are (effectively tightening policy) if inflation falls further,” analytics account The Long View wrote in part of its latest Twitter commentary.\n\nAccording to CME Group’s FedWatch Tool, market odds of a freeze stood at around 75% at the time of writing.\n\n“I think they will as they are highly attuned to the fact that if they start to cut like past cycles they will be helping to reignite rate sensitive sectors effectively undermining the work they have done.“\n\nFed target rate probabilities chart. Source: CME Group\n\nMagazine: Tornado Cash 2.0: The race to build safe and legal coin mixers\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTMvYXBwbGUtd2ViMy1zb2NpYWwtbmV0d29yay1kYW11cy1hcHAtc3RvcmUtYml0Y29pbi10aXBwaW5nL9IBZGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTMvYXBwbGUtd2ViMy1zb2NpYWwtbmV0d29yay1kYW11cy1hcHAtc3RvcmUtYml0Y29pbi10aXBwaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Apple threatens to remove Web3 social network Damus from App Store if it doesn’t end Bitcoin tipping - Fortune",
        "content": "The Web3 social network Damus has two weeks to remove Bitcoin tipping functionality from its app or it will be banished from the App Store, the company said in a Tuesday tweet.\n\nScreenshots of a message sent to Damus by Apple show that the latter raised an objection over tips in the app called “zaps,” where users can send cryptocurrency directly to creators using the Bitcoin Lightning Network. Apple said in the message posted by Damus that the tips must use Apple’s in-app purchase mechanism, which takes a 30% cut of each transaction.\n\n“Although tips or donations may be optional, if they are connected to or associated with receiving digital content, they must use in-app purchase…” the company wrote to Damus.\n\nIn a follow-up tweet Tuesday, Damus said Apple had reached out to schedule a call “to discuss the role of zaps in more detail.”\n\nDamus will be removed from the app store in 14 days, apple says zaps are not allowed on their platform because they *could* be used by content creators to sell digital content. This is right before we’re about to give our talk at the oslo freedom forum on how decentralized social… pic.twitter.com/uAK1U0UBet — Damus⚡️ (@damusapp) June 13, 2023\n\nSeveral crypto advocates rushed to support Damus, including Jack Dorsey, the CEO of Block (formerly Square), who tagged Tim Cook in a tweet and asked the Apple CEO to reconsider the decision.\n\n“This seems to be a misunderstanding by @apple of how this feature works and what it’s for. It’s a critical part of the future of the internet. It has the capacity to bring people around the world into the economy without the traditional gatekeepers,” Dorsey wrote in the tweet.\n\nApple did not immediately respond to Fortune’s request for comment.\n\nApple has been in a continuous battle with blockchain-based applications for pushing its 30% fee onto cryptocurrencies and NFTs. In October, Apple updated its iOS app rules and welcomed NFT-based apps to the App Store but also rejected calls to exempt non-fungible tokens from its fee.\n\nIn December, Coinbase said Apple was blocking its latest update to its digital wallet on iOS until the crypto exchange shared 30% of gas fees from NFT transfers or disabled the ability to send them. Coinbase caved, removing the ability for Coinbase Wallet users to send NFTs between each other.\n\nDespite the conflict with Web3 companies, Apple seemed to compromise a bit in recent dealings. In April, the National Football League partnered with video game company Mythical Games to release NFL Rivals, a game on iOS that allows users to buy, collect, and trade NFTs like digital player cards.\n\nAt the time of release, Mythical Games CEO John Linden told Fortune that the game was reviewed and supported by Apple. “They’ve approved. They’ve been in discussion with us,” Linden said. “They’ve been playing the game, they’re definitely in this build.”\n\nSky Mavis, the parent company of Web3 game Axie Infinity, also worked with Apple to launch the mobile game Axie Infinity: Origins, which was released last month in Latin America and Asia on the App Store.\n\nThe game uses Axie Infinity’s Ethereum-based Ronin blockchain and allows players to use NFTs in the game, even if they were purchased from third-party exchanges, Decrypt reported. Still, several parts of the game’s functionality, including crafting recipes, must be done on the desktop or Android versions."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmljZWxhbmRyZXZpZXcuY29tL25hdHVyZS10cmF2ZWwvYml0Y29pbi1taW5pbmctYS1ncm93aW5nLXdhc3RlLW9mLWVuZXJneS1pbi1pY2VsYW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Mining a Growing “Waste of Energy” in Iceland - IcelandReview",
        "content": "Neither Icelandic authorities nor data centres in Iceland will reveal how much energy is used to mine Bitcoin or other digital currencies in Iceland, Snæbjörn Guðmundsson of nature conservation organisation Náttúrugrið told Vísir. Data centres use 30% more energy in Iceland than all Icelandic homes put together, and while the percentage of this energy that goes toward Bitcoin mining is not public knowledge, it could be as high as 90%.\n\nIceland’s abundance of renewable energy and cheap power has had both data centres and Bitcoin mining operations flocking to the country in recent years to set up shop. Iceland’s cool climate is another benefit, as data centres produce a lot of heat that would require additional energy to cool if located in a warmer climate. Both politicians and environmental activists have questioned the benefit of Bitcoin and digital currency mining operations for the Icelandic nation as well as their impact on the environment.\n\nNew hydropower plant could be used to mine Bitcoin\n\nA 2018 report by KPMG stated that around 90% of energy used by data centres in Iceland had gone toward mining Bitcoin. In a column in Vísir, Snæbjörn refers to a recent analysis by Bitcoin expert Jaran Mellerud, who estimates that Bitcoin mining in Iceland uses around 120 MW of power, or around 85% of the 140 MW of power used by the country’s data centres in 2022. These figures have not changed much in recent years despite assertions from Iceland’s National Power Company (Landsvirkjun) that they would reduce the sale of Iceland’s energy to Bitcoin mining operations.\n\nSnæbjörn is concerned that the proposed Hvammsvirkjun hydropower plant in South Iceland’s Þjórsá river would be used to power further Bitcoin mining in Iceland, although the National Power Company has stated that power plants would not be built solely for the energy needs of Bitcoing mining centres.\n\nNew York-based Bitcoin mining company told the Wall Street Journal last month that they would expand their operations in Iceland in response to an impending tax on Bitcoin mining in the United States. At the same time, Icelandic energy companies have stated there is no capacity for increased digital currency mining in the country.\n\n“This is a waste of energy that should not be happening in a society like the one we live in today,” Snæbjörn stated."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJhZ3VlLXVnYW5kYS1iaXRjb2luLWludGVydmlld9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Ugandan Bitcoiner dreams of the secular economy: BTC Prague 2023 - Cointelegraph",
        "content": "A Ugandan Bitcoiner embarked on a community-funded trip from East Africa to Central Europe after winning tickets to BTC Prague for his adoption-driving efforts in his home country.\n\nBrindon Mwiine, the founder of Ugandan-based Bitcoin (BTC) platform Gorilla Sats, set off on a whirlwind journey from Uganda’s capital Kampala to the heart of Europe on the back of a Twitter competition he never thought he would win.\n\nI still don’t believe it\n\n\n\nThank you to everyone who voted and contributed to my Fundraising.\n\n\n\nI made it to @BtcPrague\n\n\n\nSpecial Thanks to @BitcoinEkasi and @BitcoinBeachBR #Bitcoin https://t.co/k951Pgajhc pic.twitter.com/k0aBQFwDNo — Brindon⚡ (@BrindonMwiine) June 8, 2023\n\nThe official BTC Prague Twitter profile called for individuals to share their stories of building circular economies in their respective countries, with tickets to the BTC Prague conference as the prize for the would-be winner.\n\nMwiine, who hopes to build a budding Bitcoin community among Uganda’s student population, quickly found his pitch garnering plenty of attention from Bitcoin Twitter users across East Africa.\n\nRelated: How Bitcoin mining saved Africa’s oldest national park from bankruptcy\n\nSpeaking to Cointelegraph journalist Joe Hall at BTC Prague, Mwiine explained how his short Twitter pitch paved the road for a trip across the world.\n\n“I saw all my community members come together, not just from Uganda. People from Kenya were voting, people from Tanzania were voting, it was overwhelming.”\n\nMwiine won the competition, which is when the real work began. What followed was a series of firsts for the Ugandan, who managed to secure flights, visas and arrange other logistics in just three weeks.\n\n“I had to figure out a way to get from Uganda to Prague, and this is where the fun began. I had to create a pitch and a budget, I’d never flown before, never been on a plane, never been in Europe.”\n\nThe wider Bitcoin community also came to the party, donating sats to help fund Mwiine’s travels through BTC-based crowdfunding platform Geyser Fund:\n\n“It’s one of the most interesting implementations of Lightning [Network] whereby people can crowdfund for you to do something. Ideally, you make a pitch to the public, and if they find that your project is worth it, they’ll send you some sats.”\n\nWith flights and costs checked off the list, Mwiine finally made his way to Europe for what would be his first-ever Bitcoin conference and his first-ever airport experience, which added some stress to the trip when he nearly missed a connecting flight in Dubai but for the help of a fellow Ugandan airport worker.\n\nIf all #bitcion conferences end like this, I will be fundraising to attend all of them\n\n\n\nThank you @BtcPrague - The idea alone changed my life pic.twitter.com/iX7erwgytK — Brindon⚡ (@BrindonMwiine) June 10, 2023\n\nAttending BTC Prague allowed Mwiine to rub shoulders with Bitcoin community members he’s looked up to in recent years, including BTC proponent Michael Saylor. Perhaps more importantly, Mwiine took some valuable lessons away from his interactions and experiences at different booths at the conference:\n\n“What I’m trying to do back at home is create a circular economy. I’ve learned a lot just by being at the booth of circular economies. What they’re saying is exactly what I need. It’s surreal.”\n\nUganda’s central bank recently welcomed cryptocurrency businesses operating in the country to participate in its regulatory sandbox. This is set to include consultation with the Blockchain Association of Uganda to help create a framework for the industry in the East African nation.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdXNjYXRob2xpYy5vcmcvYXJ0aWNsZXMvMjAyMzA2L2RvZXMtY3J5cHRvY3VycmVuY3ktaGF2ZS1hLWZ1dHVyZS1pbi10aGUtY2F0aG9saWMtY2h1cmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Does cryptocurrency have a future in the Catholic Church? - U.S. Catholic magazine",
        "content": "Some believe that the technology behind cryptocurrency has the potential to reshape not just the economy, but also the church.\n\nGiven its name, it seems only natural that cryptocurrency and the suite of other blockchain-based technologies associated with it would have an enduringly opaque, mysterious, and frequently shady reputation that stretches all the way back to its creation. In 2007, Satoshi Nakamoto—a pseudonym for a software engineer (or perhaps a group of engineers) who to this day remains unidentified—began work on Bitcoin, a digital currency built on a previously theorized but never-before-implemented decentralized database called the blockchain. In the decade and a half since, cryptocurrencies have exploded in popularity.\n\nIn its early days, many transactions using Bitcoin or the numerous other cryptocurrencies it spawned were centered around illicit, illegal, or otherwise questionable goods and activities, ranging from drugs to prostitution to weapons. Even as recently as 2018, a study conducted by the Review of Financial Studies found that as much as 46 percent of all Bitcoin transactions were associated with illegal activity. But today cryptocurrencies have also acquired a different but similarly shady connotation, becoming heavily associated with get-rich-quick speculation, massive boom-and-bust cycles, and outright fraud and Ponzi schemes.\n\nDespite this, there are many who still see cryptocurrency and other blockchain technologies as vital innovations poised to reinvent and revitalize the structure of economies, societies, and—for some—even the church.\n\nMatthew Pinto, the founder and former owner of Ascension Press, is one such person. In November 2022, he assembled the first Catholic/Crypto Conference, bringing together technologists, enthusiasts, and other interested Catholics for a dialogue on the ways the church might make use of and perhaps even be changed by this nascent technology.\n\nAdvertisement\n\n“There’s a lot of people who believe that [this technology] has the ability to touch all aspects of life, that this could really be important,” Pinto says of his reason for organizing the conference. “I don’t know what’s going to happen with it, but we want the church there.”\n\nBrantly Millegan, one of the keynote speakers at the Catholic/Crypto Conference and a director of the Ethereum Name Service, which uses blockchain technology to secure users’ personal information for use across the internet, agrees that it is essential for Catholics to get involved in the crypto space.\n\n“If [Catholics] want the new blockchain world to reflect Catholic values, now is the time to be involved, because people are setting up the technology now,” he says. “And the way things tend to go is once you set up a technology, or a protocol, it gets network effects, and then it gets hard to change over time.”\n\nWhile Pinto and others are distinctly optimistic that the church’s crypto-future is bright and fruitful, others urge cautious discernment. Levi Checketts, a professor at Hong Kong Baptist University who specializes in the intersection of theology and technology, notes that “technologies change moral frameworks entirely by opening new moral possibilities and new moral obligations, and sometimes foreclosing other ones.”\n\nAdvertisement\n\n“The question is, how are these technologies changing what our moral options and requirements are?” he says. “Each technology creates its own constellation of moral variables.”\n\nCryptonomics\n\nCryptocurrencies have become a favorite asset for many speculators in part due to the volatility of their valuation. When Bitcoins first became available in 2009, they were generally valued at $0.0008. In 2021, that valuation reached an all-time high of $61,837 per coin. Since then, the value of a single Bitcoin has continued to fluctuate wildly, falling as low as $16,000 in late 2022 and rising to about $27,000 in May 2023. Much of this Bitcoin is held by only a few individuals: According to the Wall Street Journal, as of 2021, approximately 0.01 percent of all Bitcoin users hold 27 percent of the coins in circulation.\n\nFor Anthony Annett, an economist and author of the book Cathonomics (Georgetown University Press), this is a natural outcome of a neoliberal approach to economics that places profit ahead of the common good—an approach he says has led\n\nto the massive rise in global wealth inequality.\n\n“Neoliberalism basically says that the market leads to greater efficiency, greater productivity, greater wealth, and the government is only impeding that wealth creation and should get out of the way,” he says. “But even though we had a lot of economic growth over the past 40 years, that growth has only benefited the top echelons of society. It hasn’t benefited ordinary people. This is a major moral failure.”\n\nAdvertisement\n\nIs there a way to square the frequently speculative use of cryptocurrency with an economy oriented toward the common good? Pinto believes that cryptocurrency can provide access to key financial services such as long-distance money transfers to those who would otherwise be unable to access them without steep costs.\n\n“There are about two and a half billion people who are unbanked in the world; they just need a smartphone and [using cryptocurrency] they can send money without paying Western Union transmission fees or losing two days of life to go from the village into the city,” he says. “There are serious social justice ramifications to this, and I actually think that this could be a great equalizer.”\n\nChecketts notes, however, that cryptocurrency has also been used to prop up many exploitative business practices and industries in developing nations. Much of the work that pays in cryptocurrency and is available in poorer countries, he says, is in the form of data tagging—identifying and categorizing images and other content—through services such as Amazon’s Mechanical Turk (or MTurk) platform, which enables businesses to crowdsource tasks such as data tagging, transcription, and copyediting, usually paying little more than a few cents per task.\n\n“It’s not just exploitative in terms of timing and the way people have to compete for jobs, but also they just have to sift through some of the nastiest stuff, because [the jobs involve] filtering content that is marked mature and such,” he says. “Then there are other types of work that are fairly exploitative such as cam girls. They can do this kind of work in [developing] countries and get paid through electronic means, but it’s very exploitative and very detrimental to not only their own well-being, but also to their families and society.”\n\nAdvertisement\n\n“It becomes this whole other structure of exploitation and neocolonialism,” he says. “I think the problem is that we’re trying to solve the question of poverty and poor distribution of resources by creating a technology that’s not inherently directed to that goal.”\n\nMore than money\n\nFor many, the real promise of blockchain technologies is not cryptocurrency itself, but its numerous other uses, primarily in the realms of ownership and privacy.\n\nAdvertisement\n\nDeacon Rich Napoli recently retired from his position as chief executive officer of Relevantz, a software engineering company that makes regular use of blockchain technology, after spending almost 45 years in the software business. For him, cryptocurrency is better understood as a proof-of-concept for other, more viable blockchain technologies. “I think it has real potential,” he says. “But cryptocurrency as it exists today? Not so much. I think it proved the capability, the technology, but it’s been abused, and it’s not necessarily useful in reality.”\n\nOne non-cryptocurrency blockchain technology that has been gaining increasing attention is non-fungible tokens, or NFTs. Unlike cryptocurrencies, each NFT is a verifiably unique entry on the blockchain, certifying ownership of a specific, one-of-a-kind item, digital or otherwise. Similar to cryptocurrency, however, the initial rise in the popularity of NFTs was also buoyed by speculation, this time in the form of a digital art market. Digital art that has been registered on the blockchain (or “minted as an NFT”) frequently fetches massive sums of money at auction. The most expensive recorded sale was of The Merge, a collection of digital images created by an artist known as Pak, which fetched a whopping $91.8 million.\n\nAdvertisement\n\nSome, like Checketts, see NFTs as a misguided attempt to bring properties of the real world into a digital space. “There’s an irony here, because I think one of the great advances and positive benefits of digital technology is the way that certain information is easily, nearly perfectly transcribed from one place to another,” he says.\n\n“Walter Benjamin has this interesting essay on art and reproduction: He says the function of modern technology is about perfect reproduction and, because of this, it removes what he calls the aura of artwork,” Checketts says. “[NFTs] are, in a way, trying to bring that back, but the problem is that defeats the whole purpose of this kind of [digital technology].”\n\nNapoli, however, believes that the blockchain has the potential to democratize the creative landscape and to empower both artists and fans, as it offers the opportunity to do away with gatekeeping institutions such as record labels. “With the blockchain, you don’t need an intermediate,” he says. “An artist can put their music on the blockchain and sell it directly to you and me without a middleman. They get the full value of the song, and we get to enjoy the song at probably a lower price than if we had to pay a record label.”\n\nTune.FM, a blockchain-based music streaming platform started in 2022, is one platform seeking to implement this vision. Every song hosted on the platform is minted as an NFT, and, according to a whitepaper issued by Tune.FM describing the platform, artists can supposedly earn 90 percent of the revenue generated by each stream.\n\nAdvertisement\n\nThis kind of democratization and decentralization of the digital world is the driving force behind what has come to be known as Web3. According to Pinto, Web3 is the next logical step in the continuing evolution of the internet.\n\n“Web1 is basically passive one-way communication. Say someone sells wicker chairs—he puts up a website and a phone number, and maybe a means by which people can order them,” he says. “Web2 enables two-way communication: It’s Twitter, it’s Facebook, you’re now communicating with the world, and the world is communicating back to you. Web3 enables you to own the assets you publish—they’re no longer owned by Facebook or another platform.”\n\nAnnett says, however, that this prioritization of decentralization is actually a misreading of the principle of subsidiarity. “I think subsidiarity is the most misunderstood and misinterpreted principle of Catholic social teaching,” he says. “Subsidiarity basically says, you want to do things at the lowest level possible, but the highest level necessary. It’s not an excuse for libertarianism, for hands-off government, or for free market ideology.”\n\nTrustless societies\n\nA key term that frequently resurfaces in conversations about blockchain technologies is that they are trustless. In other words, the problem they aim to solve is transferring value peer-to-peer without a trusted middleman. But what does it look like for a society—or even just an organization—to function without the need for trusted human relationships?\n\nOn one level, this emphasis on trustlessness is pragmatic: In a highly globalized society, many if not most of the relationships that keep society and the economy afloat are almost unavoidably built without the high level of interpersonal knowledge needed to make trust a reality. As polls continue to show trust in American institutions—governmental, religious, and otherwise—collapsing, perhaps removing trust from the equation altogether is a viable way forward.\n\nSome corporations are already beginning to take advantage of this aspect of blockchain technology to solve large-scale coordination problems, such as those that affect supply chains. Take Walmart for example: The retail chain has already incorporated the blockchain into its produce supply chain, allowing for reliable, farm-to-table tracing of all of its products. “[Walmart] had a big issue five years ago with a farm selling tainted lettuce, and they couldn’t track down where it went,” Napoli says. “They had to pull every romaine lettuce off the shelf throughout the entire country.” But now, with the implementation of blockchain technology in their chain of custody, Walmart is capable of only pulling produce known to be tainted from stores, preventing massive amounts of food waste.\n\nPinto sees a number of parallel use-cases for the blockchain in the life of the church, including having a secure back-up of sacramental records (which, since they are stored on paper in parish files, are vulnerable to loss and damage) and keeping an immutable record of priest assignments in order to prevent the cover-up of abuse or other bad behavior. “For those concerned about past transgressions regarding reassigning clergy or religious who have engaged in bad actions, putting a record of clergy or religious assignments on a blockchain would show the sequence of locations where someone engaged in ministry,” he says.\n\nLeaning heavily on this type of trustless organization may, however, have unintended consequences. Take Millegan’s case, for example. When one of his tweets from 2016 that condemned LGBTQ people, abortion, and numerous other issues resurfaced in 2022, he was quickly removed from many of the positions he held in the Ethereum Name Service except for his role as director of the Ethereum Name Service Foundation. This was possible thanks to the fact that the organization itself was governed through the blockchain as a decentralized autonomous organization, or DAO.\n\nAdvertisement\n\nDAOs take the emphasis on trustlessness to the organizational level: They are designed, at least in theory, to promote transparency and accountability by making use of predefined smart contracts, which automatically carry out organizational functions based on the votes of their members. Thanks to this structure, a vote of all the DAO’s members determined whether Millegan would remain in his role or be removed for propagating rhetoric viewed as hateful or discriminatory. Forty-three percent voted that he remain, while 37 percent voted that he be removed. Nineteen percent abstained.\n\nThere are those who maintain that DAOs can be a boon for organizing mass movements. In an interview with crypto-industry news source Cointelegraph, Rhodri Davies, head of the UK-based Charities Aid Foundation, said, “We have already seen a growing trend for such movements to take the form of loose networks rather than traditional centralized organizations (e.g. Black Lives Matter, #MeToo, the climate strikes). Often these movements face challenges in terms of maintaining focus and momentum, or carrying out practical action, and the additional structure provided by a DAO might enable them to overcome these challenges without having to adopt traditional approaches.”\n\nUpon this blockchain\n\nAlthough the institutional church has a reputation for, as the old adage goes, “thinking in centuries,” it has already begun to make a few small forays into making use of blockchain technology.\n\nThe Vatican itself has recently begun using NFT technology to track and archive its extensive collections of books, manuscripts, and artifacts in the Vatican Library. Partnering with NTT DATA, a Tokyo-based IT firm, the library will also begin providing NFTs of various items it holds to supporters, allowing them to own a part of their extensive archives, according to a February 2023 NTT DATA press release.\n\nOn the diocesan level, the Archdiocese of Washington announced in August 2022 that it would begin accepting charitable donations in cryptocurrency, a first for any diocese. “An important aspect of fostering the culture of philanthropy is to take the mystery out of many ways the faithful can support the church—in short, make supporting the good works of the church as easy as possible and meeting supporters where they are in terms of a preferred method of giving,” says Joseph Gilmer, executive director of development for the archdiocese. “Crypto now stands alongside other giving options such as stocks and bonds, mutual funds, direct transfers from traditional IRAs, and donor-advised funds that may appeal to some donors and possibly enable them to be even more generous for their favorite charitable program or ministry.”\n\nWhile these are certainly not enormous, world-changing initiatives, they do point to the institutional church’s openness to embrace these new technologies, potentially paving the way for greater uses in the future. Though Napoli notes that this kind of slow, careful exploration of new technologies may be at times frustrating, he also sees it as the prudent way forward for the church.\n\n“As a business leader, I’m used to doing everything really quickly, but the church, in its wisdom, is not fast to adopt things in general,” he says. “There is this notion that it’s better to be safe and slow than fast and realize that you did something wrong, something that looked like it was consistent with the faith but turns out not to be.”\n\nWhile the institutional church takes its time, however, Pinto and others are keeping busy organizing laypeople to discuss further use cases of blockchain technology in the life of the church. As of May, recordings of the 2022 Catholic/Crypto Conference session have begun to be released on YouTube, and according to Pinto there are plans underway for a second conference in April 2024. In addition, a whitepaper based on the first conference’s proceeds is due to be released in the summer of 2023, detailing further proposed use cases for blockchain technology in the church, including maintaining Catholics’ sacramental records more securely and accessibly as well as tracking the chain of custody and authenticity of relics.\n\nAdvertisement\n\nBut even as this work continues and blockchain technology gradually makes its way into the life of the church, the question remains as to whether this—or any—technology will be the solution to what ails the church and the world.\n\n“It’s not a question of creating new philosopher’s stones or new magic technologies that will [solve our problems],” says Checketts. “It’s a question of putting our own selfish motivations behind us.”\n\nThis article also appears in the July 2023 issue of U.S. Catholic (Vol. 88, No. 7, pages 20-25). Click here to subscribe to the magazine.\n\nImage: Pexels/Alesia Kozik"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDYvMTQvZW9zLXZzLWJpdGNvaW4td2hpY2gtY3J5cHRvY3VycmVuY3ktaXMtcmlnaHQtZm9yLXlvdS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "EOS vs. Bitcoin: Which Cryptocurrency is Right for You? - Crypto Times",
        "content": "In the world of cryptocurrencies, there are two titans that stand above the rest: EOS and Bitcoin. Both have their own unique strengths and weaknesses, and investors are constantly debating which one is the better investment.\n\nBoth have their own unique advantages and disadvantages, so it’s important to weigh your options carefully before deciding which one is right for you. So invest in them using an automated trading bot. Visit https://quantum-code.app/ and get started now!\n\nHere’s a closer look at EOS and Bitcoin:\n\nEOS: The Scalable Upstart\n\nEOS is a blockchain-based platform that was designed to be a more scalable and user-friendly alternative to Bitcoin. It uses a delegated proof-of-stake (DPoS) consensus mechanism, which allows for faster transaction processing and lower fees. EOS is also designed to be more developer-friendly, with a built-in set of tools and services that make it easier to build and deploy decentralized applications (dApps).\n\nEOS was launched in 2018 and quickly gained attention from investors and developers alike. Its market capitalization grew to over $10 billion within months of its launch, making it one of the top cryptocurrencies in terms of market value.\n\nSome experts believe that EOS could be the future of cryptocurrency, while others believe that it is simply a flash in the pan. Only time will tell which side is correct, but EOS is certainly worth keeping an eye on.\n\nHere are some of the advantages of EOS:\n\nScalability: EOS is designed to be highly scalable, meaning that it can handle a large number of transactions per second. This makes it ideal for use in applications such as decentralized finance (DeFi) and decentralized applications (dApps).\n\nUser-friendliness: EOS is designed to be user-friendly, making it easy for anyone to use. This could make it more accessible to a wider range of users, which could lead to increased adoption.\n\nDevelopment Potential: EOS is a very developer-friendly platform, making it easy for developers to build and deploy dApps. This could lead to a Cambrian explosion of dApps being built on EOS, which could further increase its adoption.\n\nBitcoin: The Established Veteran\n\nBitcoin is the first and most well-known cryptocurrency. It uses a proof-of-work (PoW) consensus mechanism, which is slower and more energy-intensive than EOS’s DPoS mechanism. However, Bitcoin is also more secure, as it is more difficult to attack a PoW network.\n\nBitcoin has emerged as the leading cryptocurrency, with a market capitalization that dwarfs most of its competitors. As a decentralized digital currency that operates on a blockchain network, Bitcoin promises to provide a secure, fast, and low-cost means of transferring value across borders. Its supply is limited to 21 million coins, which gives it a scarcity that some investors find attractive.\n\nHere are some of the advantages of Bitcoin:\n\nSecurity: Bitcoin is a more secure cryptocurrency than EOS. This is because Bitcoin uses a more robust consensus mechanism, which makes it more difficult to attack the network.\n\nEstablished: Bitcoin is a more established cryptocurrency than EOS. This means that it has a larger user base and a more mature ecosystem.\n\nBrand Recognition: Bitcoin has a higher brand recognition than EOS. This means that it is more likely to be accepted by merchants and other businesses.\n\nSo, which one should you choose EOS or Bitcoin?\n\nThe answer depends on your individual needs and preferences. If you’re looking for a cryptocurrency that is scalable, user-friendly, and has the potential for significant growth, then EOS is a good option. However, if you’re looking for a more secure and established cryptocurrency, then Bitcoin is a better choice.\n\nUltimately, the decision of which cryptocurrency to invest in is up to you. Do your research, weigh the risks and rewards, and make the decision that’s right for you.\n\nHere is a table that summarizes the key differences between EOS and Bitcoin:\n\nFeature EOS Bitcoin Consensus mechanism DPoS PoW Scalability More scalable Less scalable User-friendliness More user-friendly Less user-friendly Development potential More developer-friendly Less developer-friendly Security Less secure More secure Potential for growth More potential for growth Less potential for growth\n\nHere are some additional things to consider when choosing between EOS and Bitcoin:\n\nYour Investment Goals: If you’re looking for a cryptocurrency to hold for the long term, then Bitcoin may be a better option. However, if you’re looking for a cryptocurrency to trade for short-term profits, then EOS may be a better option.\n\nYour Risk Tolerance: Bitcoin is a more established cryptocurrency, so it is less risky than EOS. However, EOS has the potential for significant growth, so it could be a good investment for investors who are willing to take on more risk.\n\nYour Technical Expertise: EOS is a more complex cryptocurrency than Bitcoin, so it may be a better option for investors who have some technical knowledge.\n\nAlso Read: Top 10 Cryptocurrencies to invest in 2023\n\nConclusion:\n\nThe decision of whether to invest in Bitcoin or EOS ultimately depends on the investor’s risk appetite, investment goals, and market outlook. Both cryptocurrencies offer unique value propositions and investment opportunities, but also come with risks and uncertainties. By understanding the strengths and weaknesses of each cryptocurrency, investors can make more informed decisions and build a diversified portfolio that aligns with their financial goals."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yNTkwMC1ibmItc2hpYmEtaW51LXJpc2UtdXAtdG8tNi9hcnRpY2xlc2hvdy8xMDA5ODc4OTIuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWZhbGxzLWJlbG93LTI1OTAwLWJuYi1zaGliYS1pbnUtcmlzZS11cC10by02L2FtcF9hcnRpY2xlc2hvdy8xMDA5ODc4OTIuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $25,900; BNB, Shiba Inu rise up to 6% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed on Wednesday ahead of the Federal Reserve policy meeting which concludes later on in the day. Bitcoin, XRP , and Solana were trading with cuts, while BNB , Polygon, and Shiba Inu were trading with cuts.Bitcoin (BTC) fell 0.88% to $25,881, whereas Ethereum (ETH) was below the $1,750 level. BTC volume stood at approximately $13.02 billion, rising 12.48% in the last 24 hours.\"The crypto market remained upbeat as a crypto community is anticipating a breather from continuous rate hikes in today’s FOMC meeting. The crypto market may react sharply to the outcome of the FOMC meeting today as any relaxation in monetary policies will prove beneficial for the financial markets in the long term,\" Shivam Thakral, CEO of BuyUcoin, said.The global cryptocurrency market cap was trading lower around $1.06 trillion, falling 0.49% in the last 24 hours.The total volume in DeFi is currently $2.05 billion, 6.57% of the total crypto market 24-hour volume. The volume of all stablecoins is now $30.11 billion, which is 96% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $502 billion. Bitcoin’s dominance is currently 48%, a decrease of 0.17% over the day, according to CoinMarketCap.\"BTC continues to trade above the psychological support at $25k, it is struggling to move above $26k. If BTC keep trading above $25k and global market capitalization holds above $1 trillion, we should soon be able to see a rally in crypto markets. Breaking those levels, however, can take the markets into deep red,\" Shubham Hudda, Senior Manager at CoinSwitch Markets Desk, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 42, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 25 and 27, respectively, further indicating a Neutral market.\"The MACD Level (12, 26) at -385 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 37 with a Neutral indicator, while the Williams Percent Range (14) at −70 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.14 hours, IST on June 14, 2023)Bitcoin $25,881 -0.88%Ethereum $1,740 -0.72%Tether $1.00 -0.01%BNB $248 5.66%XRP $0.512 -3.43%Cardano $0.2745 -2.05% Dogecoin $0.0618 -0.22%Polygon $0.6481 0.27%Solana $15.12 -2.08% Litecoin $77.61 -1.12%Polkadot $4.63 -0.01%Tron $0.07227 0.32%Avalanche $11.82 1.10%Shiba Inu $0.000006806 1.14%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1wcmljZS1yZWNvcmRzLW1hc3NpdmUtaW5jcmVhc2VzLXJlbGF0aXZlLXRvLWNydWRlLW9pbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price records massive increases relative to crude oil - Finbold - Finance in Bold",
        "content": "Although Bitcoin (BTC) has been going through a bit of a rough patch in recent days and weeks, at the same time, it has been steadily demonstrating significant strength against the energy sector, particularly crude oil, since the beginning of the year.\n\nSpecifically, the price of Bitcoin denominated in barrels of West Texas Intermediate (WTI) crude oil has increased by over 85% year-to-date (YTD) to stand at 383.5 BTC per barrel, according to the findings of the blockchain analytics platform Glassnode shared in a tweet on June 13.\n\nBitcoin price per Barrel of WTI Crude Oil. Source: Glassnode\n\nAs per the platform’s analysts, such price advance of the flagship decentralized finance (DeFi) asset compared to crude oil indicates that the value of Bitcoin has been increasing relative to the price of energy. That said, there is still room for growth, as the platform noted that “the current value remains -63.5% below the ratio’s peak of 1049.4 BTC / BBL experienced across the 2021 primary Bull Market.”\n\nBitcoin price analysis\n\nAs things stand, Bitcoin is currently changing hands at the price of $25,988, demonstrating a decrease of 1.39% in the last 24 hours, as well as declining 3.21% across the previous seven days and losing 5.02% on its monthly chart, as per data retrieved on June 14.\n\nBitcoin 24-hour price chart. Source: Finbold\n\nMeanwhile, Bitcoin has been imitating a chart pattern from 2016 that had occurred right before the beginning of a “mega bull run” and then on a smaller scale following the Covid-19 crash in 2020, indicating the same could happen again, as Finbold reported on June 13.\n\nOn the other hand, the WTI Crude price at press time amounted to $69.85 per barrel, recording an increase of 0.72% compared to the previous day but nearly a 5% decrease over the past week and around a 3% loss across the last 30 days, as per Investing.com data.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy1uZXctd2F2ZS1vZi1kZW1hbmQtaXMtbm90LW91dC1vZi1xdWVzdGlvbi1oZXJlcy13aHkv0gFXaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW5zLW5ldy13YXZlLW9mLWRlbWFuZC1pcy1ub3Qtb3V0LW9mLXF1ZXN0aW9uLWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin’s new wave of demand is not out of question – Here’s why - AMBCrypto News",
        "content": "Bitcoin’s SOPR could repeat history, helping investors stay profitable\n\nELR indicated renewed interest in opening BTC derivative contracts\n\nExpecting a short-term Bitcoin [BTC] recovery is something that many market participants may not hope for. However, a pseudonymous CryptoQuant analyst Crazzyblockk has opined that it is not impossible.\n\nHow much are 1,10,100 BTCs worth today?\n\nAccording to the analyst, the position of the Spent Output Profit Ratio (SOPR) offers this potential. As a macro market sentiment indicator, the SOPR measures the degree of realized profits moved on-chain.\n\nBTC: Offering an advantage to holders\n\nValues over 1 of the SOPR suggest that investors are selling at a profit. On the other hand, SOPR values below 1 indicate average selling at a loss. And, at press time, the value of the metric was above.\n\nHowever, Crazzyblockk’s argument is the longevity that the metric has had in its current position. In fact, the datasets revealed that Bitcoin’s SOPR has stayed above the value since March.\n\nThis led the analyst to compare the state in 2017 and 2019 with the SOPR at press time.\n\nBetween 2015 and 2016, the SOPR consistently maintained its value above 1. Thus, this led BTC’s price to hit $20,000 in 2017. The analyst also mentioned that the SOPR condition in 2019 was vital to the BTC All-Time High (ATH) in 2021. Crazzyblock added,\n\n“When the number 1 of this data maintain for consecutive months, and the pocket value of these holders moves above this level is a sign of a strong interest in staying in the market and gaining profitability. 2015 and 2019 price cycles are good examples.”\n\nAccording to the analyst, there is strong interest in the market. Additionally, the current demand is enough to withstand any heavy selling pressure, the analyst added.\n\nBig bets on which direction?\n\nMeanwhile, BTC continued its consolidation over the last 24 hours. Despite that, the Estimated Leverage Ratio (ELR) has been rising.\n\nTypically, the ELR shows how much leverage is used by users. And, it’s calculated by dividing the Open Interest (OI) by the coin reserves. Lower values of the ELR suggest that investors are being cautious of the leverage used.\n\nHowever, when the ELR hikes, it means that participants are taking big bets on their derivative traders.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nWhether long or short, the increase also aligns with the aforementioned discussion around the strong interest in the market.\n\nAdditionally, oinonen_t, another CryptoQuant analyst, noted that the liquidity collapse in the market has not negatively affected Bitcoin’s strength. Citing rising accumulation and active addresses, the analyst highlighted,"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8xNDQ2MDEvdGhpcy1tb2JpbGUtcHV6emxlLWdhbWUtZWFybnMteW91LWJpdGNvaW4tZXRoZXJldW0tcGxheWluZ9IBWmh0dHBzOi8vZGVjcnlwdC5jby8xNDQ2MDEvdGhpcy1tb2JpbGUtcHV6emxlLWdhbWUtZWFybnMteW91LWJpdGNvaW4tZXRoZXJldW0tcGxheWluZz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "This Mobile Puzzle Game Earns You Bitcoin or Ethereum for Playing - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf you’re on the hunt for a casual, free-to-play mobile game that pays you cryptocurrency along the way, Ethereum Blast might do the trick.\n\nWhile I wouldn’t go so far as to say I had a “blast” playing through the simplistic color-matching puzzle stages, it’s a decently fun diversion that can put a little bit of Ethereum or Bitcoin into your wallet while you play.\n\nBling Financial’s free iOS and Android game is a simple color-matching puzzle game with a vibe that’s best described as “sci-fi meets Ethereum.” All that really means is that you’ll see the familiar Ethereum symbol floating around the menus and interface here and there, and people who aren’t crypto die-hards shouldn’t be turned off by that modest window dressing.\n\nAD\n\nAD\n\nEthereum Blast is a straightforward puzzler, tasking you with tapping two or more connected, like-colored stones to clear them from the board. As you clear stones, new ones fall from above to fill the space and potentially sets up larger matches that can earn you power-ups in the process. Each level provides certain targets of stones or items to clear within a limited number of moves.\n\nScreenshots from Ethereum Blast on iOS. Image: Decrypt\n\nIt’s all easy to grasp and control, with simple taps used to clear blocks or activate power-ups. But it’s also largely unchallenging and mostly mindless, and you'll earn plenty of power-ups to get you out of any binds. I played through nearly 50 stages and only lost once along the way. But as a simple on-the-go distraction, it’s pleasant enough—much like Tetro Tiles, another mobile puzzler with crypto rewards.\n\nHow much can you reasonably earn by playing? Your mileage may vary, but I earned about $0.20 worth of crypto in about two hours of play. Bling’s games reward you with Bling points that you can then convert into Ethereum or Bitcoin, and then cash out to a Coinbase or PayPal account. I cashed out in ETH, but it would’ve been the same USD value in Bitcoin too.\n\nIt’s not much—but it’s more than I earned playing Bling’s Bitcoin Solitaire, which earned me about $0.09 worth of Bitcoin in a two-hour span. However, your earning potential in Ethereum Blast diminishes the more you play, as the amount of Bling points offered for playing each stage appears to dwindle over time. The game may not hold your interest for long anyway.\n\nAnd to be clear, the amount of ads you’ll watch to earn even pennies’ worth of crypto is pretty overwhelming. You’ll face a full-screen video ad after nearly each completed level, and these typically last for a minute or more before you’re able to tap your way out of them. Given how short the levels are, that means you’ll spend about as much time playing as watching ads.\n\nAD\n\nAD\n\nIs that worth it to make about $0.10 per hour? Honestly, I’d rather spend my time playing a more engaging mobile puzzler without crypto rewards—like Threes or Grindstone, or my on-and-off guilty pleasure, Candy Crush Saga. But if you’re intent on “stacking sats” or eking out ETH while playing games, Ethereum Blast is a solid option."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMizgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTQtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwODk0MNIB0gFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTQtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwODk0MC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Litecoin See Losses As Injective Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $25,000 and $17,00 marks, respectively, on early Wednesday morning. However, in terms of percentage-wise performance, BTC witnessed a loss of 0.08 percent. Other popular altcoins — including the likes of Ethereum (ETH), Litecoin (LTC)— landed in the negative as overall prices saw minor losses across the board. Injective (INJ) emerged to be the biggest gainer, seeing a 24-hour jump of over 8.41 percent. WOO Network (WOO), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.06 trillion, registering a 24-hour gain of 0.37 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $25,993.61 seeing a 24-hour loss of 0.08 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.26 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,744.02, marking a 24-hour loss of 0.05 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.57 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 0.37 percent as per CoinMarketCap data, currently priced at $0.06198. As per WazirX, Dogecoin price in India stood at Rs 5.5434.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 0.23 percent. At the time of writing, it was trading at $77.92. LTC price in India stood at Rs 6,965.03.\n\nRipple (XRP) price today\n\nXRP price stood at $0.5157, seeing a 24-hour loss of 1.96 percent. As per WazirX, Ripple price stood at Rs 46.0000.\n\nSolana (SOL) price today\n\nSolana price stood at $15.21, marking a 24-hour loss of 0.15 percent. As per WazirX, SOL price in India stood at Rs 1,410.00.\n\nTop crypto gainers today (June 14)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nInjective (INJ)\n\nPrice: $6.16\n\n24-hour gain: 8.41 percent\n\nBNB (BNB)\n\nPrice: $251.05\n\n24-hour gain: 8.06 percent\n\nFantom (FTM)\n\nPrice: $0.2637\n\n24-hour gain: 6.79 percent\n\nInternet Computer (ICP)\n\nPrice: $3.96\n\n24-hour gain: 5.63 percent\n\nPancakeSwap (CAKE)\n\nPrice: $1.44\n\n24-hour gain: 5.48 percent\n\nTop crypto losers today (June 14)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nWOO Network (WOO)\n\nPrice: $0.1651\n\n24-hour loss: 2.82 percent\n\nMonero (XMR)\n\nPrice: $135.98\n\n24-hour loss: 2.32 percent\n\nXDC Network (XDC)\n\nPrice: $0.03252\n\n24-hour loss: 2.17 percent\n\nRipple (XRP)\n\nPrice: $0.5153\n\n24-hour loss: 2.03 percent\n\nCronos (CRO)\n\nPrice: $0.05236\n\n24-hour loss: 1.94 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzQ4MDAwLW5ldy1jcnlwdG8tbWlsbGlvbmFpcmVzLW1pbnRlZC1ieS1taWxsaW9uYWlyZS1nYW1lLWNvaW4tbWctYW5kLWJpdGNvaW4taW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "48,000 New Crypto Millionaires Minted by Millionaire Game Coin (MG) and Bitcoin in 2023 - Analytics Insight",
        "content": "As we cross the mid-year mark of 2023, Bitcoin (BTC) has weathered a tumultuous journey. Bitcoin’s value has surged by over 55% since the year’s outset, bestowing millionaire status on nearly 48,000 individuals. But opportunities abound even for those who missed the boat on buying Bitcoin at its multi-year low. In the vibrant meme coin sector, MillionaireGame Coin (MG) stands ready to launch its unique millionaire-making venture.\n\nWhat is “minting” millionaires?\n\nMillionaireGame Coin (MG) is a meme coin on Ethereum, currently conducting its presale campaign. MillionaireGame Coin (MG) focuses on one thing: creating millionaires among its token holders. Once the presale stage is complete and the Millionaire Game begins, one lucky token holder will be randomly chosen every month to receive its millionaire prize. Buying MillionaireGame Coin (MG) thus directly increases one’s chance of becoming a crypto millionaire.\n\nJust like Ethereum, which emphasizes technical prowess, the MillionaireGame Coin (MG) game will be run by smart contracts to ensure transparency and fairness. Meanwhile, a sustainable tokenomics has been designed, which can, as claimed by the team, continue the Millionaire Game for more than 50 years as long as the token market value is above $40 million and the price grows by 2%. If this happens, tons of millionaires will be born from the MillionaireGame Coin (MG) game, and MillionaireGame Coin (MG) is bound to become the next powerful whale club on the Ethereum network.\n\nRelated Reading: Game for Creating New Millionaires?\n\nHow many Bitcoin millionaires are there?\n\nWithout question, 2022 has etched its mark in the annals of cryptocurrency history as a period of turbulence. A string of project failures culminated in a severe market slump, leading to a widespread departure of investors. At its nadir, Bitcoin dwindled to a low of around $15,000. Yet, in retrospect, it is unsurprising that this bearish phase did not extend into 2023.\n\nThe early part of 2023 witnessed a remarkable rebound in Bitcoin’s fortune. The tally of addresses holding a million or more soared from 28,084 in January to a whopping 47,994 at present. This equates to a stunning growth rate of 170.89% within a few short months, demonstrating a dramatic revival in the crypto landscape.\n\nDrivers of the New Crypto Millionaires\n\nThe generation of new crypto millionaires can be attributed to the turbulence in the cryptocurrency market, investors’ expectations for the Federal Reserve’s monetary policy, and the progress of MillionaireGame Coin (MG)’s presale. The increase in the number of Bitcoin millionaires and the meteoric rise of meme coins caught off guard only those who envisioned the bearish trend lingering long beyond the market upheavals of 2022.\n\nMillionaireGame Coin (MG) has just announced the price for the stage two of its presale, with the token about to experience an 18% surge. Investors interested in the Millionaire Game should keep a close watch.\n\nMillionaireGame (MG) Mainnet: https://www.millionairegame.net/\n\nJoin Presale Stage 2: https://www.millionairegame.net/claim-discount\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vdGhlcHJpbnQuaW4vcG9saXRpY3MvY29uZ3Jlc3MtZ292dC1pbi1rYXJuYXRha2Etd2lsbC1wcm9iZS1ianAtZXJhLWJpdGNvaW4tc2NhbmRhbC10YWtpbmctYWxsLWNhc2VzLW91dC8xNjI2MzQ5L9IBfGh0dHBzOi8vdGhlcHJpbnQuaW4vcG9saXRpY3MvY29uZ3Jlc3MtZ292dC1pbi1rYXJuYXRha2Etd2lsbC1wcm9iZS1ianAtZXJhLWJpdGNvaW4tc2NhbmRhbC10YWtpbmctYWxsLWNhc2VzLW91dC8xNjI2MzQ5Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Congress govt in Karnataka will probe BJP-era ‘bitcoin scandal’ — ‘Taking all cases out’ - ThePrint",
        "content": "“We are in government and are taking it all (cases) out… bitcoin… I am reexamining the bitcoin case… we are doing all this,” Parameshwara told reporters in Bengaluru on Wednesday.\n\nKarnataka Minister for Home Affairs G. Parameshwara said he will seek details of the case and take appropriate action.\n\nBengaluru: The Congress-led Karnataka government has said that it will investigate the “bitcoin scandal”, in which the Congress, while it was in the Opposition, had alleged the involvement of BJP leaders during the party’s previous term in government (2019-2023).\n\n“It has been just 15-20 days since the government was formed.”\n\nThe statement comes a day after BJP MP Prathap Simha challenged the Congress government to prove its allegations against the erstwhile Basavaraj Bommai government.\n\nThe Congress has promised to investigate allegations of scandals and misappropriation of funds, including in public works, that emerged during the tenure of the erstwhile BJP government.\n\nThe bitcoin case refers to the alleged laundering of ill-gotten money by senior government officials and top leaders of the state BJP through cryptocurrencies. The alleged scandal hit front pages soon after Basavaraj Bommai replaced B.S. Yediyurappa as chief minister in July 2021.\n\nBommai has in turns described the case as a “non-issue” and as a “serious” matter the government had asked the Enforcement Directorate (ED) to look into.\n\nFormer CM Basavaraj Bommai could not be reached for comment for this report.\n\nIn November 2021, All India Congress Committee General Secretary Randeep Singh Surjewala alleged that “influential politicians” were involved in the case.\n\nThe case gained traction after a Bengaluru-based hacker, Srikrishna or Sriki, was apprehended by city police in November 2020 and Rs 9 crore worth of bitcoin seized.\n\nSriki is accused of hacking into government portals, sourcing drugs through the dark net and paying for it through cryptocurrency. The Congress had alleged that the hacker was used by officials to launder money.\n\n“Bitfinex (bitcoin exchange) was my first big bitcoin exchange hack; the exchange was hacked twice, and I was the first person to do so,” read his description of the 2016 hacking in his statement to the police, which was released to the media.\n\n“Around 120,000 bitcoins, which was about $72 million at the time, were stolen from Bitfinex in August 2016,” Sriki said in his statement.\n\n“The second instance was a simple spear-phishing attack that led to two Israeli hackers working for the army getting access to the computers of one of the employees, which gave them access to the AWS cloud account,” he added.\n\nThere were also allegations that several senior BJP leaders had illegally procured around 5,000 bitcoins to launder money.\n\nProbing BJP government\n\nThe ruling Congress has indicated that it will reinvestigate several alleged scandals under the Bommai government, which it termed the ‘40 percent sarkar” in the run-up to the May Karnataka assembly elections, in a bid to suggest that BJP ministers took up to 40 percent in commission from contractors given public works.\n\nRevenue Minister Krishna Byre Gowda had said Friday that the state government will review all land granted to individuals, organisations and associations by the previous BJP government to check for any irregularities.\n\nThe Congress has also said it will review the controversial hijab order, and the erstwhile BJP government’s anti-conversion and anti-cattle-slaughter laws, among others. Another promise is reviewing content of school textbooks to remove “distorted history” that was inserted by the BJP as part of its “Hindutva agenda”, according to Congress leaders.\n\nOn 22 May, senior Congress leader and cabinet minister M.B. Patil had also said all cases against the BJP government will be probed.\n\n(Edited by Sunanda Ranjan)\n\nAlso Read: What is the bitcoin scam & who is the 25 yr-old that has put the BJP govt in Karnataka in a spot"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1yZXBlYXRzLXBhdHRlcm4tZnJvbS0yMDE2LXN1Z2dlc3RpbmctbWVnYS1idWxsLXJ1bi1vbi10aGUtaG9yaXpvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin repeats pattern from 2016, suggesting 'mega bull run' on the horizon - Finbold - Finance in Bold",
        "content": "As Bitcoin (BTC) is starting to witness modest gains in recent days, during which the cryptocurrency industry is struggling under the pressure of lawsuits that the United States Securities and Exchange Commission (SEC) has filed against two crypto exchanges, a bullish run could be ahead judging by a repeating trend.\n\nSpecifically, Bitcoin is currently moving above its exponential moving average (EMA) on 20 observed time periods and is demonstrating two bars in its Bollinger Band width percentile (BBWP), as observed by the pseudonymous crypto analyst el_crypto_prof a.k.a. Moustache, in a tweet shared on June 13.\n\nBy comparison, the same chart pattern had emerged seven years before, in 2016, right before a “mega bull run” began for the flagship decentralized finance (DeFi) asset, during which its price had soared as much as 3,200%, ultimately reaching the top at $19,033, from the mere $580.\n\nBitcoin price action analysis. Source: el_crypto_prof\n\nAccording to the cryptocurrency expert’s Bitcoin chart analysis, a similar pattern occurred following the Covid-19 crash in 2020, after which the maiden crypto asset saw a bull run of more than 600% to its price, culminating at $56,031, up from around $7,800.\n\nBitcoin price analysis\n\nAs things stand, Bitcoin is currently trading at the price of $26,196, demonstrating an increase of 0.91% on the day and 1.59% over the past week, whereas, on its monthly chart, it is writing down a loss of 2.44%, as per the latest data retrieved on June 13.\n\nBitcoin 7-week price chart. Source: Finbold\n\nDespite occasional struggles, Bitcoin has still managed to increase its price by nearly 60% since the year’s turn, turning almost 48,000 crypto investors into millionaires, and recently, the accumulating behavior of its largest holders has indicated a possibility of a strong rebound.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vYml0Y29pbmlzdC5jb20vd2h5LWxhY2stb2YtYml0Y29pbi1mb2xsb3dpbmctc3RvY2tzLW5vdGhpbmctZmVhci_SAU1odHRwczovL2JpdGNvaW5pc3QuY29tL3doeS1sYWNrLW9mLWJpdGNvaW4tZm9sbG93aW5nLXN0b2Nrcy1ub3RoaW5nLWZlYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Why A Lack Of Bitcoin Following Stocks Is Nothing To Fear | Bitcoinist.com - Bitcoinist",
        "content": "The crypto Twitter sentiment echo chamber’s best bearish argument currently is the fact that Bitcoin isn’t immediately following the Nasdaq and the rest of the stock market ripping higher.\n\nHowever, when zooming out, the long-term correlation remains “very strong” and BTCUSD could just have a little catching up to do.\n\nAll of crypto Twitter right now: “#Bitcoin is showing such weak correlation with the Nasdaq” Meanwhile, the correlation coefficient remains at a “very strong” 0.85 positive correlation on the monthly chart There is just a little catching up to do pic.twitter.com/AbaJPhNx8U — Tony “The Bull” (@tonythebullBTC) June 13, 2023\n\nStock Market Makes 52-Week High, Leaves Crypto Behind\n\nThis week, the S&P 500 made a new 52-week high, following the Nasdaq 100 and tech stocks. One asset that isn’t following along, is Bitcoin. And crypto bears want to make sure you know it.\n\nIt quickly became a hot topic among crypto Twitter. But when removing red-colored glasses and any bias related to the ongoing SEC drama, the facts are simple: the correlation between BTCUSD and the NDX remains “very strong” according to the 1M correlation coefficient.\n\nThe correlation coefficient measures the strength and direction of the relationship between to assets. Correlations could be weak or strong, positive or negative. Portfolio managers look for negatively correlated assets to diversify risk since these assets do not move together. In contrast, positively correlated assets do move together.\n\nThe correlation is very strong at 0.85 | BTCUSD on TradingView.com\n\nBitcoin And Nasdaq Correlation Remains “Very Strong,” Likely To Continue\n\nThe chart above highlights the fact that the correlation between BTCUSD and the NDX gives a “very strong” reading of 0.85. A perfect positive correlation would be 1, making the top cryptocurrency and basket of tech stocks as tight as most asset relationships get.\n\nFurthermore, the chart demonstrates that each time the NDX outperforms Bitcoin and there is a lag in crypto, the market more than makes up for it with a massive catch-up move."
    }
]