[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmR3LmNvbS9lbi9pbWYtd2FybnMtZWwtc2FsdmFkb3Itb2YtYml0Y29pbi1yaXNrcy9hLTY0Njc2NTg40gFHaHR0cHM6Ly9hbXAuZHcuY29tL2VuL2ltZi13YXJucy1lbC1zYWx2YWRvci1vZi1iaXRjb2luLXJpc2tzL2EtNjQ2NzY1ODg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "IMF warns El Salvador of Bitcoin 'risks' - DW (English)",
        "content": "The Central American country became the first worldwide to adopt Bitcoin as a legal currency in 2021. The IMF said the government should be more transparent.\n\nThe International Monetary Fund has urged the government of El Salvador to exercise greater transparency with its Bitcoin transactions, highlighting the cryptocurrency's \"risks.\"\n\nIn September 2021, El Salvador became the first country worldwide to introduce Bitcoin as a legal tender alongside the US dollar. El Salvador's Congress passed a law last month to regulate the issuance of other digital assets by the state and private entities.\n\nIn a report on Friday, the IMF once again warned the government regarding Bitcoin following a visit to the country.\n\n\"While risks have not materialized due to the limited bitcoin use so far,\" the IMF report said, the use of the cryptocurrency could grow, given new legislative reforms adopted to encourage its use.\n\nThe IMF noted that \"underlying risks to financial integrity and stability, fiscal sustainability, and consumer protection persist.\"\n\nHow has El Salvador embraced Bitcoin?\n\nPresident Nayib Bukele, reputed to be a tech enthusiast, is attempting to get more of the country's residents to use traceable ways of exchanging goods and money. Many Salvadorians do not have bank accounts.\n\nThe country rolled out a digital wallet, called Chivo, in September 2021, parallel to adopting Bitcoin as a legal currency. Many Salvadorans have since protested against the move and Bukele's policies in general.\n\nBukele then announced last November that the country's treasury would start buying a Bitcoin every day.\n\nThe Reuters news agency has calculated nearly 2,470 coins were acquired by the government for about $106.4 million (€99.4 million) since the announcement. The Salvadoran government doesn't officially disclose purchases, holdings or where the coins are kept.\n\nIn its statement, the IMF stressed the importance of \"greater transparency over the government's transactions in Bitcoin and the financial situation of the state-owned Bitcoin-wallet (Chivo).\"\n\nDespite the warnings, the IMF report applauded the growth of the Salvadoran economy by 2.8% in 2022. It cited the government's effective pandemic response, the \"unprecedented\" crime reduction and the strong tourism revenues as the reasons.\n\nAt the same time, IMF officials warned that Salvadoran exports and remittances could be affected by a pronounced slowdown in the US.\n\nBitcoin is now legal tender in El Salvador To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nrmt/dj (AFP, Reuters)"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDIvMTAvYW4tb2RlLXRvLWxvY2FsYml0Y29pbnMtYW5kLWEtbGVzc29uLWFib3V0LW1haW50YWluaW5nLWJpdGNvaW5zLXB1YmxpYy1nb29kcy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAyLzEwL2FuLW9kZS10by1sb2NhbGJpdGNvaW5zLWFuZC1hLWxlc3Nvbi1hYm91dC1tYWludGFpbmluZy1iaXRjb2lucy1wdWJsaWMtZ29vZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "An Ode to LocalBitcoins (and a Lesson About Maintaining Bitcoin's Public Goods) - CoinDesk",
        "content": "Ethereum is not perfect, but its community of developers has experimented with new models of distributed organization and protocol maintenance – to greater and lesser success. I say this amid a period of debate in Bitcoin Land, where, following the creation of Bitcoin NFTs [non-fungible tokens], a non-financial use case that is generating more fees for miners that has been seen in years, some are questioning the correct use of an open protocol. Bitcoin itself seems destined to reliably provide a way for peers to interact indefinitely. But community – nay, the world! – also needs a platform where peers can find one another. (Because, not everyone wants to set up a Telegram chatbot.)"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAyLzExL2NhdGhpZS13b29kLXRoaW5rcy1iaXRjb2luLWdvaW5nLW92ZXItMS1taWxsaW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Cathie Wood Thinks Bitcoin Is Going to $1.48 Million. Is She Right? - The Motley Fool",
        "content": "With Bitcoin (BTC 1.61%) turning in its best January performance since 2013, it's no surprise that analysts are ratcheting up their price targets for this suddenly hot crypto. Bitcoin was up nearly 40% in January, and that has led to a completely revised outlook for just how high this crypto could fly in coming years.\n\nCathie Wood of Ark Invest -- known for her previously controversial $1 million price target for Bitcoin -- has just ratcheted up her Bitcoin price prediction. She now thinks Bitcoin could skyrocket to $1.48 million by 2030. But just how feasible is that prediction?\n\nThe long-term growth story for Bitcoin\n\nAccording to Wood, the case for Bitcoin at these stratospheric levels is really a story of enormous growth on a global scale. Over time, the story goes, Bitcoin will account for a larger and larger share of global assets held by institutions. It will continue to scale globally as more nations accept it as legal tender, and as more people use Bitcoin to carry out online transactions.\n\nThis story gets more interesting when Ark Invest lays out the specific numbers behind its assumptions. Ark Invest suggests there will be eight primary market segments (e.g., \"emerging market currency\" and \"remittance asset\") where Bitcoin will see growth. Based on estimates about the penetration rate for Bitcoin in each of those markets, it is possible to develop a bearish, a base case, and a bullish scenario for Bitcoin's price.\n\nHow fast can Bitcoin grow?\n\nSo, for example, Ark Invest suggests that Bitcoin could account for up to 10% of the M2 money supply of emerging market countries. Thus far, there are only two nations that have adopted Bitcoin as legal tender -- El Salvador and the Central African Republic -- so this seems a bit optimistic. According to some economists, nations that struggle with hyperinflation or devalued currencies could decide to embrace Bitcoin.\n\nArk Invest also suggests that Bitcoin could capture 25% of the \"remittance asset\" market, and 50% of the \"digital gold\" market. So, imagine one in four migrants around the world sending money back to family and loved ones in the form of Bitcoin, and one in two central banks around the world deciding to build their Bitcoin reserves instead of their physical gold reserves. In addition, Ark Invest suggests that Bitcoin will soon account for 6.5% of institutional investor portfolio holdings.\n\nAll of these numbers are aggressive, but not entirely unthinkable. It really depends on how you view global growth, and how much faith you have in fiat currency.\n\nFrom my perspective, the \"base case\" estimates provided by Ark Invest make a lot more sense than the \"bullish case\" numbers. For example, in a base case scenario, Bitcoin will only account for 3% of the M2 money supply of emerging market countries. And Bitcoin will only account for 2.5% of institutional investor portfolios. The problem here is that even Ark Invest acknowledges that these \"base case\" assumptions only support a future price of $682,800 for Bitcoin, well below the pie-in-the-sky figure of $1.48 million.\n\nDo the numbers make sense?\n\nMoreover, it's helpful to stress-test these assumptions about Bitcoin against current asset values in global markets. Given that Bitcoin has a fixed coin supply of 21 million, a target price of $1.48 million implies a total market capitalization of $31 trillion.\n\nJust how big of a number is that? Well, the total value of the world's physical gold supply is estimated to be worth about $12 trillion, so Bitcoin would be worth more than 2.5x all the gold in the world today. Moreover, the total value of the S&P 500 is approximately $32 trillion. So, Bitcoin would be worth almost the same as the 500 largest publicly traded companies in America today.\n\nFor that reason, I don't think $1.48 million is a reasonable price target for Bitcoin. Even a $1 million price target seems to be a bit of wishful thinking on the part of the Bitcoin bulls. That would imply a market cap of $21 trillion, which is nearly 10x the current market cap of Apple. Would you rather own all the Bitcoin in the world, or all the equity in 10 different Apple corporations?\n\nWhile I'm long-term bullish on Bitcoin, I also think it's important to have a sense of scale here. If Warren Buffett thinks the value of all the Bitcoin in the world isn't even $25, and Cathie Wood thinks the value of all the Bitcoin in the world is $31 trillion, a rational person would say that the real value of Bitcoin is somewhere in the middle. I'm bullish that Bitcoin will eventually regain its $1 trillion market cap -- I just think it will take longer than some people think."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2JpdGNvaW4tbWluZXJzLWFzLWVuZXJneS1idXllcnMtZXhwbGFpbmVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin miners as energy buyers, explained - Cointelegraph",
        "content": "Why does mining crypto use energy? The energy consumption of cryptocurrency mining is a trade-off for the security and decentralization of blockchain networks. However, through the use of sustainable energy sources and effective mining algorithms, there are ongoing efforts to make the process more energy-efficient and sustainable. Mining crypto uses energy because it is a process that requires computers to perform complex mathematical calculations in order to validate transactions and add new blocks to a blockchain. These calculations use a lot of computer resources, which results in high energy usage. The main sources of energy consumption are the CPUs and GPUs, as well as the cooling systems necessary to keep mining rigs cool. The first step in mining cryptocurrency is to confirm the transactions on the blockchain network using a consensus algorithm such as proof-of-work, which calls for miners to solve challenging mathematical puzzles. Miners use specialized software and hardware, such as ASICs, to perform these calculations at high speeds. The first miner to solve the puzzle adds the following block to the blockchain and receives a specific quantity of Bitcoin (BTC) in return. In order to increase their odds of becoming the first to solve the puzzle, miners are motivated to employ as much computer power as they can. As more miners join the network and competition heats up, the need for energy rises, resulting in increased electricity usage. According to some estimates, the entire energy use of the Bitcoin network alone might be comparable to that of a small nation. The energy consumption of cryptocurrency mining is a concern because it has an environmental impact. The majority of the power required for mining is generated from fossil fuels, which cause the release of greenhouse gases such as carbon dioxide. The cost of electricity for mining can be rather high in some areas, which makes it less economical for miners.\n\nDo Bitcoin miners use renewable energy resources to mine? While a sizable fraction of Bitcoin mining currently uses non-renewable energy sources, there is a growing tendency among miners to power their operations with renewable energy sources. It is likely that more miners will use renewable energy as it becomes more affordable to power their operations. As already noted, Bitcoin mining uses a lot of energy for miners to validate transactions and add them to the blockchain by using powerful computers to solve challenging mathematical puzzles. Initially, the majority of Bitcoin mining took place in China, which is also the biggest generator of coal-based electricity in the world. As a result, non-renewable energy sources accounted for a sizable amount of the energy utilized to mine BTC. When comparing Bitcoin mining by nation, the United States ranks the highest, making it a legal activity after Bitcoin mining was outlawed in China. The use of renewable energy sources by miners, such as hydroelectricity, is an increasing trend, though. This is especially true in areas with a wealth of renewable energy sources, such as Quebec and Iceland. Additionally, due to a fall in the price of renewable energy sources, mining companies are beginning to use them to power their operations. Moreover, in order to fuel their mining operations, several businesses are also investing in their own renewable energy initiatives, such as solar and wind farms.\n\nHow do Bitcoin miners act as energy buyers? To power their mining operations, Bitcoin miners either purchase electricity from conventional and renewable energy sources or develop and run their own renewable energy facilities, turning them into energy consumers. Miners typically purchase electricity from energy providers, such as utility companies or independent power producers, to mine BTC. They then use that electricity to power their mining equipment. This can include both traditional energy sources, such as coal or natural gas, as well as renewable energy sources, such as solar or wind energy. Hydro-Quebec, a Canadian utility company that sells electricity to Bitcoin miners, is a real-world example of how Bitcoin miners act as energy buyers. In order to take advantage of the low electricity prices in the province, the firm has been actively courting Bitcoin miners to establish operations there and utilize excess hydroelectric power to mine BTC. In some circumstances, miners might also sign long-term agreements with energy suppliers, which could provide them access to a more reliable and consistent source of electricity. Large-scale miners can benefit the most from this, as it enables them to plan and budget for their energy requirements in advance. By establishing and running their own renewable energy facilities, such as solar or wind farms, Bitcoin miners can also take on the role of energy users and function as energy purchasers. By doing this, they support the switch to sustainable energy sources as well as securing energy for their mining activities. For instance, a Bitcoin miner called Genesis Mining has established operations in Iceland and is running them using geothermal and hydroelectric energy. This allows the miner to benefit from Iceland’s plentiful renewable energy resources and lessen its environmental impact. Additionally, one of the largest Bitcoin mining facilities in the world, KnCMiner, is powered by a wind farm that the company developed on its own land in Sweden. To make use of extra energy that would otherwise be wasted, miners may also choose to locate their mining operations next to existing renewable energy facilities, such as hydroelectric dams or geothermal plants. For instance, the Bitcoin miner Greenidge Generation in upstate New York, U.S. generates electricity for its mining operations using extra natural gas from a local power plant. The company also constructed a 7-megawatt solar farm to help meet its energy requirements.\n\nHow do renewable energy resources benefit Bitcoin mining in rural areas? Renewable energy sources offer a more reliable power supply for Bitcoin mining operations since they are less prone to experiencing power disruptions. Additionally, using sustainable energy for Bitcoin mining can support job growth and economic expansion in rural areas. In the context of Bitcoin, gridless computing, which refers to the usage of alternative computing resources such as edge devices, can encourage the use of renewable energy resources to mine BTC in Africa. That said, gridless computing offers an alternative to the centralized electrical grid, which is often unreliable or unavailable in many parts of the continent. This can enable miners to operate in remote or off-grid locations using locally generated renewable energy sources, such as solar or wind power. The lack of electrical infrastructure in many rural parts of Africa makes it challenging to establish and run conventional mining operations. Gridless computing, on the other hand, enables miners to power their mining machinery with portable, decentralized renewable energy sources like solar or wind turbines. This enables miners to establish operations in remote locations and make use of the region’s abundant renewable energy resources. Gridless computing can also promote the growth of community-based mining operations, which can assist nearby areas economically by generating jobs and sources of income. By offering education and training on sustainable energy methods, these community-based mining companies can also encourage the adoption of renewable energy sources."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1zbHVtcHMtaW4tYnJvYWQtc2VsbC1vZmYtYW1pZC1zZWMtY2hhcmdlcy1hZ2FpbnN0LWtyYWtlbi1yZWd1bGF0aW9uLXdvcnJpZXMv0gF1aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvbWFya2V0cy1iaXRjb2luLXNsdW1wcy1pbi1icm9hZC1zZWxsLW9mZi1hbWlkLXNlYy1jaGFyZ2VzLWFnYWluc3Qta3Jha2VuLXJlZ3VsYXRpb24td29ycmllcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin slumps in broad sell off amid SEC charges against Kraken, regulation worries - Forkast News",
        "content": "Bitcoin sank below US$22,000 in Friday morning trading in Asia after the U.S. Securities and Exchange Commission slapped a fine on the Kraken exchange, sparking concerns that regulators are set to take a tougher line on cryptocurrency trading. The move adds to existing investor worries about macroeconomic trends, such as higher interest rates. Ether fell along with all other top 10 non-stablecoin cryptocurrencies.\n\nSee related article: Coinbase CEO Brian Armstrong says SEC has ‘terrible’ idea to ban crypto staking for U.S. retail customers\n\nFast facts\n\nBitcoin fell 4.93% in the past 24 hours to US$21,815 at 8 a.m. in Hong Kong, and lost 7% over the past calendar week, according to data from CoinMarketCap. Ether dropped 6.32% to trade at US$1,547, logging a 5.86% weekly loss.\n\nSolana, the biggest loser among the top 10, slid 11.81% in the past 24 hours, pushing its weekly loss to 15.69%. Shiba Inu dipped 11.66% in the last 24 hours, reversing gains over the past week to remain little changed.\n\nOn Thursday, the U.S.-based crypto exchange Kraken said it shut its on-chain staking services for U.S. users to settle charges from the Securities and Exchange Commission (SEC). The SEC said in a Thursday statement that two Kraken subsidiaries failed to register the offer and sale of their staking programs, and that the exchange had agreed to pay US$30 million to settle the charges.\n\nBrian Armstrong, chief executive officer of Coinbase Global Inc., the largest crypto exchange in the U.S., said on Wednesday that the SEC may be considering a broad ban on crypto staking for U.S. retail users, which he called a “terrible” idea.\n\nStaking refers to the process of crypto investors depositing tokens into certain blockchains to receive rewards, typically more tokens — a practice widely used on various “proof-of-stake” blockchains including Ethereum, the second biggest.\n\n“Today’s action should make clear to the marketplace that staking-as-a-service providers must register and provide full, fair, and truthful disclosure and investor protection,” SEC Chair Gary Gensler said in the statement.\n\nU.S. equities fell on Thursday, as traders assessed earnings and job data. The Dow Jones Industrial Average lost 0.73%. The S&P 500 Index slipped 0.88% and the Nasdaq Composite Index closed down 1.02%. Trading this week has been choppy, with several U.S. Federal Reserve governors stating more interest rate increases are coming and rates may stay higher for longer to beat back inflation.\n\nAnalysts at the CME Group predict a more than 90% chance the Fed will raise interest rates by a further 25 basis points at its next meeting in March. U.S. interest rates are currently at 4.5% to 4.75%, the highest in 15 years, and Fed officials have repeatedly indicated they could raise rates to as high as 5%.\n\nFigures released Thursday showed that U.S. initial jobless claims, or applications for unemployment benefits, rose to 196,000 last week. While that is higher than the 183,000 in the previous week, the claims are still at historically low levels and indicate labor demand remains high. More people in work would typically be good news for an economy, but with the Fed focused on slowing inflation, strong economic indicators can indicate more interest rate hikes will follow.\n\nSee related article: Robinhood aims to buy-back its shares seized by Department of Justice in FTX failure"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9sb2NhbGJpdGNvaW5zLWdvbmUtcDJwLWJpdGNvaW4tZXhjaGFuZ2VzLTIwNDIxODE1NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "LocalBitcoins Is Gone—But These P2P Bitcoin Exchanges Are the Next Best Thing - Yahoo Finance",
        "content": "LocalBitcoins, one of the oldest and best-known Bitcoin exchanges, is closing after a decade of service, with the peer-to-peer platform citing the “ongoing very cold crypto-winter” as the reason for stopping operations.\n\nThe marketplace, which launched in 2012, allows users from 189 countries to trade Bitcoin by matching buyers with sellers and holding the cryptocurrency in escrow until both parties confirm the transaction—assuring no funny business with dodgy traders.\n\nBut now with it shutting up shop, what other P2P exchanges can you use? A P2P service means that the two parties interact directly with each other on their own terms without the need for third-party involvement.\n\nAlthough LocalBitcoins is remarkably efficient and easy-to-use, other platforms exist. The following platforms provide a similar service that will allow you to interact directly with buyers or sellers to get a good price for your sats (or other digital assets.)\n\nBinance\n\nThe world’s biggest crypto exchange has a P2P section where users can buy or sell a number of cryptocurrencies—including Bitcoin, Ethereum, Tether, and Binance Coin. Just like LocalBitcoins, the prices of the assets are labeled lowest to highest and users can interact directly with sellers from over 40 countries.\n\nThe service is very easy to use and quick—just like when spot trading on the platform, and the service offers more payment methods than LocalBitcoins (though it lacks some of what LocalBitcoins offers, such as PayPal.)\n\nPaxful\n\nPaxful is one of the most popular P2P Bitcoin exchanges. The platform offers over 350 ways to buy and sell Bitcoin, and offers users a Bitcoin wallet.\n\nThe exchange also allows buyers and sellers to choose the location they want to shop in, the amount they want to spend, and if they want to make a transaction using another cryptocurrency (LocalBitcoins does not allow users to use cryptocurrency to buy Bitcoin.)\n\nStory continues\n\nUsers can buy Bitcoin using a number of digital assets on Paxful's P2P platform.\n\nPaxful’s platform currently offers Bitcoin and stablecoins Tether and USD Coin and sign-uping up to the website is quick and easy.\n\nHuobi\n\nLike Binance, Singapore-based Huobi is another giant cryptocurrency exchange which also offers a P2P service. And just like LocalBitcoins, it’s not complicated for even beginners to use.\n\nThe platform lists an impressive number of payment methods—including, surprisingly, some banks which have said they don’t allow customers to buy or sell crypto. But note that a trader using the P2P service must use the same details which match their Huobi account details.\n\nBisq\n\nBisq is a private, open-source P2P platform that allows users to buy and sell Bitcoin—and only Bitcoin—using fiat currency without know your customer (KYC) procedures. That means you don’t have to hand over personally identifiable information, such as your name and address, before making a trade.\n\nYou have to download Bisq's desktop app to get started.\n\nFor those wanting complete decentralization, this is the platform: Most cryptocurrency trading platforms now require documentation to sign up, especially if fiat money is involved.\n\nDeposits are held in multisig wallets—meaning the wallet is secured by various private keys, not just one—to protect buyers and sellers. User data is not stored anywhere but traders have to download the desktop app to use it.\n\nOKX\n\nSeychelles-based crypto exchange OKX also has a P2P service where users can buy and sell Bitcoin, Tether, Ethereum, USD Coin, and some other digital assets in their local currency.\n\nLike other services on this list, OKX offers lots of payment methods and users are able to search through the long-list of currencies to find the best offers.\n\nBut users can only use fiat currency to make or receive payments—not crypto."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzQ4YjFhN2MxLTJhMmYtNDdhYi04NTEyLTBjNzE5YmU2OWMwN9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Crypto's humanitarian sales pitch in Turkey and Syria - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the latest edition of the FT’s Cryptofinance newsletter. This week, we’re asking whether crypto donations really make a difference in times of crisis.\n\nAfter the devastating earthquake that hit Turkey and Syria at the start of this week, the crypto industry has tried to do its part by rounding up millions in donated tokens.\n\nBlockchain records show wallet addresses shared by AHBAP, a local non-profit, have received more than $3mn in donations this week. Blockchain analytics firm Chainalysis estimates that more than $5mn in crypto donations have been sent to Turkey and Syria.\n\n“Many people around the world want to help with cryptocurrency,” AHBAP founder and local artist Haluk Levent wrote on Twitter.\n\nChainalysis rival Elliptic has also been crunching donation numbers, finding more than $10mn worth of crypto tokens pledged by a host of crypto firms, most notably Binance which has promised a total of $5mn in donated funds.\n\nIn many ways, Turkey’s economic strife even before the earthquake means the country is tailor-made to embrace crypto. An era of soaring prices and falling interest rates plays into the hands of crypto evangelists who claim digital assets such as bitcoin are a store of wealth and a hedge against inflation.\n\n“If you ask people, they are so eager on crypto,” one Ankara local named Tolga told me. The FT’s new Turkey correspondent — and my old boss — Adam Samson spotted a coin store in his first week in Ankara.\n\nA coin store in Ankara, spotted by the FT’s Turkey correspondent Adam Samson © FT montage / Adam Samson\n\nFor an industry scarred by scandal, it’s a great sales pitch to paint crypto as the go-to tool for financial relief in times of crisis. But is it true?\n\n“You can’t use crypto in daily life,” Tolga explained, adding that locals need to convert their crypto to the Turkish lira and withdraw newly converted fiat to their bank account. Hardly the type of financial gymnastics needed in the aftermath of a natural disaster.\n\nAnother local — who I’ll refrain from naming but who traded cryptocurrencies before the earthquake — has struggled since the disaster to release funds from a popular exchange. “I am really sad, I have nothing left to do but wait for [the exchange to help],” they told me via Twitter.\n\n“Some of our friends are under the rubble . . . we can’t hold back our tears.”\n\nThe intent on behalf of crypto’s advocates may be admirable, but the simple fact is where crypto succeeds in enabling near-real-time transactions, it fails in real-world utility.\n\n“If the goal is to get grandma money quickly and simply, there is a strong economic argument that a countertrade swap through a crypto asset isn’t going to be any cheaper than traditional mechanisms,” software engineer and crypto critic Stephen Diehl told me via text. “Ultimately, the recipient doesn’t have much use for bitcoin because they can’t spend it.”\n\nThat’s not to say crypto can’t serve a humanitarian purpose. I’d be remiss not to point out that more than $50mn worth of crypto tokens were donated to Ukraine’s war effort in the aftermath of Russia’s full-scale invasion last year.\n\nWeeks after the invasion, Ukraine’s deputy minister for digital transformation Alex Bornyakov said crypto was “extremely helpful” when it came to sending vital supplies to armed forces. “Each and every helmet and vest bought via crypto donations is currently saving Ukrainian lives,” he said.\n\nThat may be true, but before Christmas Bornyakov also told me that Russian use of crypto to evade sanctions was set to become a “huge issue”. So there are always two sides to the coin in crypto land.\n\nWhat’s your take on crypto’s utility in times of crisis? Let me know at scott.chipolina@ft.com\n\nWeekly highlights\n\nAnother week, another crypto platform bites the dust. LocalBitcoins, one of the world’s oldest crypto exchanges, announced it will discontinue its service after 10-plus years of activity. The company blamed the “ongoing very cold crypto-winter” for its closure and apologised to users for “any inconvenience this may cause”.\n\nThe bad news for crypto exchanges continues: late on Thursday Kraken ended its staking programme for US customers and paid $30mn in a settlement with the US Securities and Exchange Commission. The settlement is the latest in a number of enforcement actions targeting actors the SEC says violated securities rules. Check out my story with Stefania Palma here.\n\nMy colleague Joshua Oliver published a fascinating FT Magazine piece on the final hours of FTX, written during his recent trip to New York. Check it out here.\n\nFormer Coinbase employee Ishan Wahi pleaded guilty to two counts of conspiracy to commit wire fraud. You may recall the 32-year-old’s case from July last year, when the former product manager was charged with sharing tips on tokens due to be listed on Coinbase. “Wahi is the first insider to admit guilt in an insider trading case involving the cryptocurrency markets,” said US attorney Damian Williams.\n\nDays before cracking down on Kraken, the SEC laid out its priority for the year ahead. Among other areas, the regulator pointed to emerging technologies and crypto assets as one sector that may pose risks to investors or financial markets. That much is obvious to anyone who has followed crypto for more than a day, but if you thought the SEC was tough on this industry in 2022, my advice would be to buckle up.\n\nSoundbite of the week: ‘Shameless’ crypto founder\n\nThree Arrows Capital co-founders Su Zhu and Kyle Davies oversaw one of the highest-profile crypto collapses of 2022 not named FTX.\n\nEarlier this year both men announced a new exchange, named GTX. The idea behind GTX is to offer impatient folks the chance to trade bankruptcy claims before the slow wheels of justice settle claims for themselves. No, I’m not kidding.\n\nThree Arrows’ liquidators, who have long complained about the co-founders’ lack of willingness to engage in the bankruptcy process, slammed Davies for his newest project.\n\n“Since January 5, 2023, Mr Davies has been active on social media, having ‘tweeted’ or ‘retweeted’ dozens of times . . . Shamelessly, while ducking his obligations to his failed company, Mr Davies has been recently active in an effort to raise tens of millions to start a new crypto exchange.”\n\nData mining: A word on darknet market share\n\nIf you follow the ever-evolving nexus of cryptocurrency and crime, you will recognise Hydra Market — at its height the largest darknet market in the world.\n\nEarlier this year the US Department of Justice took action against the founder of Bitzlato, a little-known crypto exchange that allegedly acted as a conduit for laundered money. Its largest trading counterparty, Hydra Market, was shut down in April last year.\n\nFresh data shared by Chainalysis shows that despite having only a third of the year to play with, Hydra crushed the competition.\n\nCryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com.\n\nYour comments are welcome"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmlleHBhdHMuY29tL2Jvb20tb3ItYnVzdC1iaXRjb2luLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Boom Or Bust: Bitcoin In 2023 - iExpats.com",
        "content": "Estimated reading time: 6 minutes\n\nCryptocurrency scams and bankruptcies have seen the value of Bitcoin and other cryptos plummet as investors have rushed to dump their stakes.\n\nBut investors hoping for a market rebound may have to wait until the spring for prices to rise again.\n\nBitbank, one of the leading exchanges, expects Bitcoin to recover to between $20,000 and $30,000 after the second quarter, and only if the US Federal Reserve stops hiking interest rates and starts cutting them early next year.\n\nStandard Chartered bank takes the opposite view.\n\nAnalysts are warning investors that more crypto failures are on the way, driving prices down up to 70 per cent to bottom out at around $5,000.\n\nPlagued By Fraud And Bankruptcies\n\nBitcoin started the year at $16,605 and has followed an upwards path to reach the current price of $18,116.\n\nHowever, the cryptocurrency price is far from reaching the heady levels of the 12-month high of $47,454 in March or the record high of $66,400 in November 2021.\n\nThe latest round of fraud and bankruptcies that plague Bitcoin and the cryptocurrency world have provoked American regulators to issue a severe wealth warning to investors.\n\nIn an unprecedented move, the US Federal Reserve, Federal Deposit Insurance Corporation and the Office of the Comptroller of the Currency, issued a joint statement revealing they are monitoring the crypto activities of leading banks.\n\n“The events of the past year have been marked by significant volatility and the exposure of vulnerabilities in the crypto-asset sector,” the statement said.\n\nUS Regulators Issue Crypto Warning\n\nThe regulators added that issuing or holding crypto tokens stored on public decentralised networks was “highly likely to be inconsistent with safe and sound banking practices”.\n\nBanks were also encouraged to take steps to avoid problems in the digital asset market spreading to the broader financial system.\n\n“Risks related to the crypto-asset sector that cannot be mitigated or controlled mustn’t migrate to the banking system,” the statement continued.\n\nThe announcement followed months of hesitancy by US financial watchdogs to set guidelines on cryptocurrencies despite calls from the banks for straightforward advice.\n\nFourteen years of fraud and scandal have rocked the cryptocurrency market, but the sad truth is that the crypto system works fine – when people step in, everything seems to go wrong.\n\nThe weak point of the market are cryptocurrency exchanges.\n\nNo One Controls Crypto\n\nExchanges regularly go to the wall with millions of dollars of missing funds. Moreover, as US regulators point out, crypto has no rules, no one is responsible for policing the market and fraudsters can easily run scams with little fear of detection.\n\nThat’s why governments are unlikely to adopt cryptocurrency as day-to-day spending money. In addition, a lack of trust in the accountability of the market’s people has put the brakes on a wider take-up of virtual currencies.\n\nInstead of the Bitcoin dollar or pound, many countries have their central banks working on digital currencies under government control.\n\nSo where does that leave cryptocurrency? One comment economists tend to make about financial bubbles is they are formed by investors making irrational decisions.\n\nTo illustrate this, the story goes that one day an economist noticed the price of tins of sardines was inexplicably rising, but no one understood why. The economist resolved to open the tin to see what was inside and found it was full of sardines. Another economist told him he should not be surprised as the tins were for buying and selling, not opening.\n\nSardines And Bubbles\n\nYou can swap out sardines for any bubble, from tulips to cryptocurrency.\n\nPredicting the future of cryptocurrency is notoriously difficult.\n\nTaking a view at what’s happening at Coinbase, the world’s second largest exchange behind Binance, may throw some light on what the market expects. Coinbase has announced a third round of job losses, cutting 950 posts – roughly a fifth of the company’s global workforce.\n\nCoinbase is restructuring to cope with the sharp downturn in cryptocurrency values blamed on fraudsters, higher interest rates and a slowing global economy.\n\n“In 2022, the crypto market trended downwards along with the broader macroeconomy. We also saw the fallout from unscrupulous actors in the industry, and there could still be further contagion,” said a blog on the company website.\n\nOffshore Rogues Hold Back Crypto\n\nThe blog is designed to promote trust in the exchange and blames loose regulation for leaving an offshore hole crooks can exploit.\n\n“We believe that what’s happening now is yet another example of why strong, clear regulatory standards are so important,” said the blog.\n\n“Fragmented, opaque regulatory frameworks in the U.S. are driving crypto to offshore unregulated exchanges, where looser regulations can put customers at risk. Congress needs to provide clear, national rules for crypto — and make those rules workable so companies aren’t rewarded for building outside the U.S.\n\n“That’s why Coinbase has leaned into regulation from the very beginning. While it may feel somewhat burdensome at times, it means our customers can trust that their assets are safe.”\n\nTaking an overview of the market, crypto will remain around current values until regulators act – and that’s unlikely to happen due to the offshore nature of the industry.\n\nCryptocurrency 2023 FAQ\n\nWhat is cryptocurrency? Cryptocurrency is a decentralised digital currency that only exists online. The underlying technology that runs crypto is called a blockchain. What is a blockchain? Essentially, a blockchain is a tamper-proof ledger or database of cryptocurrency transactions. A cryptocurrency can run on a dedicated blockchain or share a blockchain with other cryptos. The blockchain lists any change of ownership of a token. What are tokens? Tokens are specific virtual currencies, such as Bitcoin, Ether or XRP. How do public and private keys work? Keys appl;y security toIs my money safe in a crypto e the blockchain. Public keys identify the tokens in a transaction, while private keys authorise the user access to an account. Is my money safe in a crypto exchange? Crypto exchanges are like banks. Regardless of how sophisticated the security, a robber can walk in the door and hold up the staff. A hacker is the crypto equivalent of a robber. This example highlights the weakness in crypto security and shows investors cannot eliminate the risk of fraud.\n\n\n\nOther types of security exist – hot systems use computers and drives linked to the internet, while cold systems only connect to the internet to carry out transactions. Who is responsible for policing cryptocurrency? The sad answer is no one. A country’s police is responsible for policing incidents happening within the country’s borders, but because crypto is not resident in any country, no police or regulator has overall responsibility or control of the system.\n\n\n\nThis was perceived as a strength by the originators of Bitcoin but has turned out to be a weakness holding back the general take-up of cryptocurrencies.\n\nRelated Information\n\nBelow is a list of related articles you may find of interest."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzEwL2JpdGNvaW4tbWluZXItYml0bmlsZS1wdWxscy02NTAwLXJpZ3MtZnJvbS1mb3JtZXItY29tcHV0ZS1ub3J0aC1zaXRlL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzEwL2JpdGNvaW4tbWluZXItYml0bmlsZS1wdWxscy02NTAwLXJpZ3MtZnJvbS1mb3JtZXItY29tcHV0ZS1ub3J0aC1zaXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner BitNile Pulls 6,500 Rigs From Former Compute North Site - CoinDesk",
        "content": "About one month prior to the Compute North bankruptcy filing, BitNile had signed an agreement with Compute North to host its machines. The mining rigs now have begun being shipped to another location, said BitNile in a Friday statement. Ault Executive Chairman Milton “Todd” Ault III called the situation \"very frustrating.\""
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wYXlwYWwtaGVsZC02MDRtLWluLWJpdGNvaW4tYW5kLW90aGVyLWNyeXB0by1ieS10aGUtZW5kLW9mLTIwMjLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "PayPal held $604M in Bitcoin and other crypto at the end of 2022 - Cointelegraph",
        "content": "Global payment giant PayPal holds a significant part of its financial liabilities in cryptocurrencies such as Bitcoin (BTC) offered to its customers.\n\nAs of Dec. 31, PayPal held a total of $604 million in various cryptocurrencies, including Bitcoin, Ether (ETH), Litecoin (LTC) and Bitcoin Cash (BCH), according to the annual report filed with the United States Securities and Exchange Commission on Feb. 10.\n\nBitcoin has the largest share in PayPal’s crypto assets, accounting for $291 million in the firm’s asset breakdown, while $250 million is held in ETH. The remaining $63 million includes Litecoin and Bitcoin Cash combined.\n\nThe amount of PayPal’s crypto holdings accounts for 67% of the company’s total financial liabilities, amounting to $902 million as of Dec. 31. PayPal’s total financial assets stood at more than $25 billion, according to the filing.\n\nDespite introducing cryptocurrencies onto its platform more than two years ago, PayPal did not include a similar breakdown of crypto holdings in its previous annual financial report.\n\n“Due to the unique risks associated with cryptocurrencies, including technological, legal, and regulatory risks, we recognize a crypto asset safeguarding liability to reflect our obligation to safeguard the crypto assets held for the benefit of our customers,” PayPal wrote in the recent filing.\n\nRelated: PayPal Xoom adds cross-border remittance on debit card deposit\n\nPayPal stores customers’ cryptocurrencies through a third-party custodian, the company noted in the filing. PayPal stressed that it contractually requires the custodian to segregate customer assets and not mix them with proprietary or other assets, adding:\n\n“We cannot be certain that these contractual obligations, even if duly observed by the custodian, will be effective in preventing such assets from being treated as part of the custodian’s estate under bankruptcy or other insolvency law.”\n\nAs previously reported, PayPal debuted its hold-and-sell service for Bitcoin in the United States in November 2020. The company has been doing its best to bring all possible blockchain and crypto integrations to its services, including central bank digital currencies, according to vice president Richard Nash."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXJldHJlYXRzLWJlbG93LXVzMjIwMDAtcmVjb3JkLWphbnVhcnktc3Ryb25nLXN0YXJ0LTIwMjMtcmV2ZXJzaW5nL9IBdmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXJldHJlYXRzLWJlbG93LXVzMjIwMDAtcmVjb3JkLWphbnVhcnktc3Ryb25nLXN0YXJ0LTIwMjMtcmV2ZXJzaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin retreats below US$22,000 after a record January. Is the strong start to 2023 - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, fell 3.92% in the week from Feb. 3 to Feb. 10, trading at US$21,848 at 6 p.m. on Friday in Hong Kong. Ether lost 5.32% in the same period, to change hands at US$1,547.\n\nColin Johnson, chief executive officer and co-founder of Freeport, a platform bringing fine art investment on-chain, said he sees two price points critical for the market’s direction.\n\n“Key price levels to watch are a $19k floor and $25k ceiling. If you see a breakout to either side, it’s likely due to significant macro news – as the driest powder is currently in the hands of highly risk-sensitive parties,” he said in a LinkedIn response to questions.\n\nJonas Betz, a crypto analyst based in Germany, agreed with the US$25,000 key price ceiling that could help the world’s biggest cryptocurrency return to levels seen before the series of failures and bankruptcies that befell the industry last year.\n\n“If Bitcoin is able to reclaim and hold this price level on the weekly chart the next resistance level is around US$29,000, which corresponds to the price of Bitcoin before the Terra-Luna collapse.”\n\nPolygon’s Matic was the week’s biggest gainer among the 10 largest non-stablecoin cryptocurrencies, up 8.34% on the weekly chart, trading at US$1.28.\n\nThe global crypto market cap stood at US$1.02 trillion on Friday at 6 p.m. in Hong Kong, down 5.55% from US$1.08 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$421 billion represented 41.4% of the market, while Ether accounted for 18.6%.\n\nFreeport’s Johnson said macroeconomic factors will continue to drive sentiment, helped by signs of inflation easing and a smaller increase in interest rates by the U.S. Federal Reserve in February. However, he said “that trend is not guaranteed,” pointing to spoilers such as rising U.S.-China tensions following the spy balloon incident and developments in the Ukraine conflict.\n\nKasper Vandeloock, chief executive officer of quantitative trading firm Musca Capital, said the appetite for crypto investment is still strong, adding that some investors were surprised on the upside when more skeletons did not emerge after the FTX/Celcius/3AC shenanigans.\n\n“There is an appetite for crypto, venture capitalists want in and there is a lot of demand. Shorts are being covered, FOMO (fear of missing out) is being created,” wrote Vandeloock, in an email to Forkast.\n\nHowever, Betz warned that traditional financial markets are still driven by a fear of a global recession and higher inflation: “If this comes true, further de-risking will take place and markets will plummet.”\n\nThe fear of U.S. entities excluding exchanges and other actors in the crypto industry from the banking system is currently driving uncertainty. Binance has already announced it will suspend USD bank transfers starting Feb. 8, wrote Betz.\n\nMarket concern also grew after crypto exchange Kraken announced Thursday that it will shut down its on-chain staking services to settle charges from the Securities and Exchange Commission (SEC), which had alleged that two of the exchange’s subsidiaries failed to register the offer and sale of their staking program. Kraken also agreed to pay US$30 million.\n\nSEC Commissioner Hester Peirce has publicly criticized the agency’s fines against Kraken, calling the approach “paternalistic and lazy,” adding that “using enforcement actions to tell people what the law is in an emerging industry is not an efficient or fair way of regulating.”\n\nAI coins rally\n\nSingularityNet’s AGIX token was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. SingularityNet is the world’s first decentralized artificial intelligence (AI) network enabling the creation and monetization of AI services.\n\n\n\nAGIX rallied over 119% to change hands at US$0.434. The token started its pick-up on Jan. 23, soon after Microsoft confirmed its US$10 billion investment in OpenAI.\n\nThe gains reignited after SingularityNet announced a partnership with Cardano to leverage the blockchain’s programming language, Haskell, for developers using MeTTA, an Artificial Intelligence Domain Specific Language (AI-DSL) focused on autonomous interoperability between AI services.\n\nThe Graph’s GRT was the second biggest gainer, up over 60% to trade at US$0.16. The Graph is an indexing protocol to publish open APIs with data. The Graph’s technology promotes AI capabilities, as its databases show the relationships between data, which cannot be communicated using standard databases.\n\nVandeloock attributes this to the success of ChatGPT, which has created demand for AI among venture capitalists.\n\n“People are realizing how important AI is now that they can finally interact with it through websites like ChatGPT. The importance of AI has always been there, we use machine learning and AI daily but it’s not something we are aware of. Now that we can interact with it and see how powerful AI can be, people want a piece of the pie and will buy anything as long as it is AI related,“ wrote Vandeloock.\n\nJohnson attributed the rally to the value of blockchain and AI. “People see two incredibly powerful technological advancements and believe that combining them must create a god-like technology. In a future where AI is able to replace human output and capture a huge amount of value, we will need blockchain to allow for the proper distribution of that massive output,” wrote Johnson.\n\n“AI will also help increase the speed at which cryptocurrency infrastructure is built, and the companies that are able to capture the value output from that will see obscene revenue growth over the next five years,” he added.\n\nSee related article: JPMorgan report shows institutional trader interest shifting to AI from blockchain after crypto slump\n\nBut Betz held a different view. “The AGIX rally is fueled by the current hype surrounding AI, as programs like ChatGPT gained mainstream media attention. However, I expect this to be a short-lived pump-and-dump, as blockchain and AI technology are far from compatible with each other, given the current state of the art,” wrote Betz.\n\nNext week?\n\n“The most likely outcome for the crypto market next week will be a continued crab walk through the doldrums,” wrote Johnson. “Some up days and some down days, and the potential for a breakout on either side based upon China’s economy re-opening, any inclination of the Ukraine war resolving, or inflation data,”\n\nBetz also anticipates a crab walk sideways. “I expect the next week will show a sideways [market] with a slight downtrend. Investors should be mindful of a possible U.S. crypto de-banking operation led by the Fed and Office of the Comptroller of the Currency (OCC), which according to speculations have prepared measures that are deemed draconian and are aimed to kill crypto,” wrote Betz.\n\nJohnson said that while major cryptos like Ethereum are “by default in growth mode,” macroeconomic challenges are weighing down potential.\n\n\n\n“We can expect the technology and associated brainpower to continue driving demand via novel use cases. Fighting that growth is real, daunting macro challenges – inflation, international trade disputes, pandemics shutting down countries, wars, and other persistent risk factors,” wrote Johnson.\n\nVandeloock anticipates bearish momentum for some altcoins. “After this run, I still am expecting a price drop to happen on major altcoins.”\n\n“A lot of players are getting in at a late time and players are getting greedier. I’m expecting AI projects to still do amazing, however many are already at a high market cap such as $FET. I would look at new projects that started building a crypto-AI business before the AI craze started,” wrote Vandeloock.\n\nSee related article: Blockchain developers have taken a decentralized interest in cloud storage – will it shake up the industry?"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzEwL3BheXBhbC1oZWxkLTYwNG0tb2YtY3VzdG9tZXJzLWNyeXB0by1hcy1vZi15ZWFyLWVuZC0yMDIyL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzEwL3BheXBhbC1oZWxkLTYwNG0tb2YtY3VzdG9tZXJzLWNyeXB0by1hcy1vZi15ZWFyLWVuZC0yMDIyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "PayPal Held $604M of Customers' Crypto as of Year-End 2022 - CoinDesk",
        "content": "The payments company has been allowing customers to buy and sell crypto since October 2020, though has only recently begun to disclose specific holdings of different coins in its SEC filings. This granularity is now required by the SEC as per Staff Accounting Bulletin No. 121 (SAB 121), introduced in March last year."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWlzLWFscmVhZHktaW4taXRzLW5leHQtYnVsbC1tYXJrZXQtY3ljbGUtcGFudGVyYS1jYXBpdGFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin is already in its 'next bull market cycle' — Pantera Capital - Cointelegraph",
        "content": "Bitcoin (BTC) is beginning its “seventh bull cycle,” and investors should not be scared of crypto post-FTX, Pantera Capital believes.\n\nIn its latest “Blockchain Letter” on Feb. 8, the asset management firm’s CEO, Dan Morehead, predicted that 2023 would be a “year for rebuilding trust.”\n\nMorehead: Crypto assets have “seen the lows” this cycle\n\nWith BTC price action retracing slightly after gaining 40% in January, some market participants still insist that new macro lows are due across crypto assets.\n\nWhile the timing for such a scenario varies, consensus remains absent when it comes to how the market will rebound.\n\nFor Morehead, however, the time to flip bullish on crypto is already here.\n\n“Pantera has been through ten years of Bitcoin cycles and I’ve traded through 35 years of similar cycles,” he noted.\n\n“I believe that blockchain assets have seen the lows and that we’re in the next bull market cycle – regardless of what happens in the interest-rate-sensitive asset classes.”\n\nThat perspective differs from the majority in casting aside the debate over crypto price correlation with risk assets such as equities. As Cointelegraph continues to report, this forms the backbone of some other prognoses for 2023.\n\nMorehead argued that the drawdown from Bitcoin’s latest all-time highs had placed the market well within the historical context, despite dipping below its previous bull market all-time high after the FTX debacle in November 2022.\n\n“The decline from November 2021 to November 2022 was the median of the typical cycle. This is the only bear market to more than completely wipe out the previous bull market. In this case, giving back 136% of the previous rally,” he wrote, alongside accompanying data.\n\n“The median downdraft has been 307 days and the previous bear market was 376. The median drawdown has been a -73% downdraft and the latest bear market ended at -77%.”\n\nGoing forward, a trend change will ensue, with Bitcoin on its way to fresh record highs.\n\n“I think we’re done with that and beginning to grind higher,” Morehead added.\n\nBitcoin price cycles chart (screenshot). Source: Pantera Capital\n\nA “jurisdiction-by-jurisdiction” recovery\n\nSimilar optimism was directed at the decentralized finance space, with Pantera nonetheless positioning for a year of “rebuilding trust” in centralized finance (CeFi) first and foremost.\n\nRelated: Bitcoin price taps 3-week lows as SEC fears liquidate $250M of crypto longs\n\nThis would be necessary, Morehead claimed, in light of last year’s multiple corporate failures, which precipitated the crypto bear market.\n\n“2022 was a year of booms and major busts, especially as it pertains to CeFi. In the span of a few months, the world saw Three Arrows Capital collapse, Do Kwon’s LUNA disintegrate, Voyager Digital go bankrupt, and Sam Bankman-Fried’s (SBF) FTX empire shatter,” he explained.\n\n“What did all these events have in common? The headlines like to suggest that it was crypto or Web3 that failed. But, in fact, it was a combination of bad actors skirting lines in jurisdictions without clear regulations. If 2022 was the year of breaking rules and failing, I believe 2023 is the year that entities instead follow the rules and enjoy the rewards of doing so.”\n\nWhile the letter did not mention the current regulatory battle involving the United States Securities and Exchange Commission, it foresaw CeFi reclaiming its clout worldwide “on a jurisdiction-by-jurisdiction level.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNvcnJlY3Rpb24td2FzLW92ZXJkdWUtYW5hbHlzdHMtb3V0bGluZS13aHktdGhlLWVuZC1vZi0yMDIzLXdpbGwtYmUtYnVsbGlzaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price correction was overdue — analysts outline why the end of 2023 will be bullish - Cointelegraph",
        "content": "Bitcoin (BTC) price and the wider crypto market corrected at the start of this week, giving back a small portion of the gains accrued in January, but it’s safe to say that the more experienced traders expected some technical correction.\n\nWhat was unexpected was the SEC’s Feb. 9 enforcement against the Kraken exchange and the regulator’s announcement that staking-as-service programs are unregulated securities. The crypto market sold off on the news and given Kraken’s decision to shut down its staking services, traders are concerned that Coinbase will eventually be forced to do the same.\n\nWhile the events of this week triggered sharper than expected downside, the real question is, does the correction reflect a change in the trend of bullish momentum seen throughout January, or is the “staking services are unregistered securities” news a simple blip that traders will disregard in the coming weeks?\n\nAccording to analysts at Delphi Digital, crypto is set up for a “roller coaster ride in 2023.” Analysts Kevin Kelly and Jason Pagoulatos explained January’s price action as being fueled by “recent increases in global liquidity,” which are favorable to risk assets, but both agree that macroeconomic headwinds will continue to negatively impact markets until at least the third quarter of 2023.\n\nMajor asset classes year-to-date normalized % change. Source: Delphi Digital\n\nBeyond the negative news of this week and its impact on crypto prices, a handful of metrics provide some insight into how the rest of the year could be for the crypto market.\n\nDXY comes back to life\n\nThe U.S. Dollar Index has rebounded from its recent lows, a point highlighted by Cointelegraph newsletter author Big Smokey.\n\nIn a recent post, Big Smokey said:\n\n“December’s below expectation CPI print and the upcoming February FOMC and interest rate hike clearly provided the necessary investor sentiment boost to push prices through what had been a sticky zone for months. But, as shown below, BTC’s inverse correlation with the U.S. Dollar Index (DXY) says it all. Recently, DXY has been losing ground, pulling back from a September 2022 high at 114 to the current 101. As is custom, as DXY pulled back, BTC price amped up.”\n\nBTC and DXY weekly price action. Source: Trading View\n\nLooking at DXY this week, one will note that DXY rebounded off its Jan. 30 low at 101 and reached a five-week high near 104. Like clockwork, BTC topped out at $24,200 and began to roll over as DXY surged.\n\nDXY. 1-week chart. Source: TradingView\n\nAccording to JLabs analyst JJ the Janitor:\n\n“How DXY fares after retesting the 50-, 100-, and 200-day MAs in the weeks to come will provide us much insight into the market’s next move…If it breaks through and holds above its 200-day MA (currently at ~106.45), asset markets will indeed become bearish again, and we could expect November’s lows to be threatened. However, should this DXY back-test fail, either now (at the 50-day) or later, we can take it as confirmation that we have entered into a new macro environment. One where the strong dollar that terrorized us in 2022 is now a neutered beast.”\n\nThe Fed pivot takes way longer than investors expect\n\nFor months retail and institutional traders have prophesied an eventual pivot from the United States Federal Reserve on its interest rate hike and quantitative tightening policies. Some seem to interpret the shrinking size of the recent and future rate hikes as confirmation of their prophecy, but in the last post-Federal Open Market Committee (FOMC) presser, Powell hinted at the need for future rate hikes and while speaking to David Rubenstein during an open interview at the Economic Club of Washington. Powell said:\n\n“We think we are going to need to do further rate increases,” primarily because according to Powell, “The labor market is extraordinarily strong.”\n\nAccording to Delphi Digital analysis, market participants are “playing chicken with the Fed trying to call their bluff.” The analysts suggest that data shows the bond market is signaling that the Fed’s policy is too firm.\n\nGenerally, equities and crypto markets have rallied when FOMC decisions on rate hikes align with the expectation of market participants and anyone who was following crypto markets in 2022 will remember that everyone and their mother was waiting for Powell to pivot before going ultra long on large-cap cryptocurrencies.\n\nFrom the vantage point of technical analysis, BTC’s price pullback was also expected, with a possible retest of underlying support in the $20,000 zone, especially after a 40%+ monthly rally in January.\n\nBased on historical data and fractal analysis, Delphi Digital analysts suggest that there is room for further upside from BTC as “there isn’t a lot of overhead supply for BTC in the $24K - $28K range” and earlier reporting from Cointelegraph highlighted the importance of Bitcoin’s recent golden cross.\n\nWhile this is all encouraging in the short-term, the reality of certain Consumer Price Index components remaining sticky and Powell seeing a need for further interest rate hikes due to the labor market’s strength should be a reminder that crypto is not yet in bull market territory. Interest rate hikes increase operational and capital costs for businesses, and these increases always trickle down to the consumer. Another consistent and alarming development is the continuance of layoffs in Big Tech companies.\n\nBanks and major U.S. brokerages continue to spin down their earnings estimates and Big Tech has a way of being the canary in the coal mine for equities markets. The high correlation between equities markets and Bitcoin and concerning macroeconomic hurdles suggest an expiration date on crypto’s recent mini bull market. Investors would do well to keep this front of mind.\n\nIf the long-awaited “Fed pivot” continues to remain elusive, certain realities will come to the forefront that is bound to have a stronger impact on pricing in the crypto and equities markets.\n\nRelated: SEC enforcement against Kraken opens doors for Lido, Frax and Rocket Pool\n\nLooking deeper into 2023\n\nDespite the bearish nature of the challenges listed above, Delphi Digital analysts issued a more positive outlook for the bottom half of 2023. According to their analysis:\n\n“The need for liquidity expansion will become more pressing as the year progresses. Cracks in the labor market will also become more apparent, which will give the Fed cover for a shift toward more accommodative policy. The reversal in Global Liquidity we cited at the end of last year will start to accelerate in response to a weaker growth outlook and concerns over growing fragilities in sovereign debt markets, acting as support for risk assets in 2H 2023. The impact of changes in global liquidity on financial markets tends to lag anywhere from 6-18 months, setting up a more optimistic outlook for 2024-2025.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxvZ28taW1wZXJmZWN0aW9uLWZvdW5kLW9uLW9yaWdpbmFsLWFydHdvcmstYWZ0ZXItMTIteWVhcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin logo imperfection found on original artwork after 12 years - Cointelegraph",
        "content": "While Satoshi Nakamoto is credited as the anonymous creator of Bitcoin (BTC), what often goes unnoticed are the selfless contributions of the community members — miners, developers, designers, hodlers and investors — that help materialize the original vision. However, one such significant contribution was found to carry an imperfection for over 12 years, invisible to the naked eye.\n\nOn Nov. 12, 2010, bitcointalk.org member bitboy (not related to YouTuber BitBoy Crypto) posted the vector files of the iconic Bitcoin logo, which has been widely accepted worldwide. While Bitcoiners preach the “zoom out” narrative during crypto bear markets, zooming in on the original Bitcoin logo shows a small orange line from the background going into the white colored “₿.”\n\nA small design detail that has stayed with many iterations of the original #bitcoin logo since its inception in 2010 pic.twitter.com/nYElwD2S6v — Doc (@_Bosch_) February 9, 2023\n\nThe information was first revealed by Crypto Twitter member @_Bosch_, who then shared an updated Bitcoin logo after removing the mark and improving the stylistic proportions. On further investigation, community member @skyler_fs found that one of the curvatures of the ₿ logo was not smooth either.\n\nCointelegraph’s investigation of the above claims confirmed the imperfections sported by the original Bitcoin vectors. The image below shows the two locations where the microscopic design issues exist.\n\nTwo imperfections found in the Bitcoin logo after 14 years. Source: Cointelegraph\n\nThe revelation does not impact how Bitcoin operates and community members have not shown any concerns about it. Even if someone were to create new vectors after fixing the flaws, it would not gain mainstream acceptance unless the community decides otherwise.\n\nRelated: Is it possible to achieve financial freedom with Bitcoin?\n\nAs markets maintain a positive trajectory toward recovery, Bitcoin mining firm CleanSpark continues to amass equipment from distressed mining companies.\n\nCleanSpark’s chief financial officer Gary Vecchiarelli said that the company envisions “explosive growth” in 2023 through mergers and acquisitions.\n\n“With respect to our strategy regarding M&A, we have been one of the most active miners to date in acquiring infrastructure and machines, and we will continue to be active,” he added."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXRhcHMtMy13ZWVrLWxvd3MtYXMtc2VjLWZlYXJzLWxpcXVpZGF0ZS0yNTBtLW9mLWNyeXB0by1sb25nc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price taps 3-week lows as SEC fears liquidate $250M of crypto longs - Cointelegraph",
        "content": "Bitcoin (BTC) fell to bearish target zones on Feb. 10 as bulls failed to hold important support above $22,000.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nCrypto wipeout mounts as BTC price loses $22,000\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD dropping to $21,633 on Bitstamp.\n\nThe pair reacted badly to regulatory fears from the United States but had already faced days of bearish sentiment, with traders expecting a retest of $21,000 or even lower.\n\nAt the time of writing, Bitcoin traded at around $21,800, down around 7% in February so far.\n\n“Bear market back or are we just having a slight correction?” Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, queried on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nSome were busy with short positions as BTC price action conformed to expectations, with popular trader Crypto Tony eyeing $21,400 as a potential bounce zone should losses continue to materialize.\n\n“Profit coming in nice on the short and my next target is the support cluster at $21,400. If we see a retest of $22,300 then this could be your chance to get in, upon a failed retest,” he wrote in part of commentary alongside an explanatory chart.\n\nThose remaining in long positions thus felt intense pain overnight. According to data from data resource Coinglass, long liquidations for Bitcoin alone totaled $64.6 million for Feb. 9.\n\nBTC liquidations chart. Source: Coinglass\n\nOn-Chain College, a contributor at analytics platform CryptoQuant, noted that these included $24.3 million in a single hourly candle — the most since the FTX crash in early November 2022.\n\nBTC/USD annotated chart. Source: On-Chain College/ Twitter\n\nFeb. 9 liquidated $254 million in longs, including altcoins.\n\nAnalyst looks for $16,000 bottom “confirmation”\n\nLooking beyond immediate price performance, fellow CryptoQuant contributor Venturefounder focused on whether the macro bottom was really in for Bitcoin.\n\nRelated: Arthur Hayes bets on Bitcoin, altcoin surge in H1 2023 as he buys BTC\n\nIf BTC/USD were to preserve the 200-day moving average (DMA) near $20,000 — or even $19,000 — as support, he argued on the day, it may be more significant implications for price action.\n\nBTC/USD saw two-year lows just under $16,000 in the FTX aftermath, levels which at the time sparked mass calls for a trip to $12,000.\n\n“A retest of $19-$20k Bitcoin (200DMA zone) would be very appropriate here,“ Venturefounder wrote in a Twitter thread.\n\nA further post argued, “Holding the $19-20k during this correction would be the first confirmation that $16k was the Bitcoin cycle bottom.“\n\nBTC/USD annotated chart. Source: Venturefounder/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhY2VzLWtleS1tb3ZpbmctYXZlcmFnZS1zaG93ZG93bi0zLXdlZWtzLWFmdGVyLWJyZWFrb3V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price faces key moving average showdown 3 weeks after breakout - Cointelegraph",
        "content": "Bitcoin (BTC) saw no relief at the Feb. 10 Wall Street open as United States equities dipped further.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n“All eyes” on 200-day moving averages\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it tracked sideways following a volatile 24 hours of trading.\n\nExisting market weakness was compounded by an announcement from U.S. regulators concerning Ether (ETH) staking, with major crypto exchange Kraken forced to suspend its staking operations and pay a $30-million fine.\n\nBitcoin fell to three-week lows as a result, with traders eyeing potential retests of $20,000 and even $19,000 to come.\n\nOn the day, stocks offered little by way of comfort to risk asset traders, with the S&P 500 opening down to cross a significant line in the sand left over from late last year.\n\nU.S. dollar strength also bided its time, with a hopeful take from investment research resource Game of Trades eyeing resistance, which it may fail to overcome.\n\n“USD has been rejected from its macro uptrend line that’s now turned to resistance. Confirmation is key though,” it summarized on Twitter.\n\nU.S. dollar index (DXY) annotated chart. Source: Game of Trades/Twitter\n\nScott Melker, known as “The Wolf Of All Streets,” meanwhile, saw cause for optimism on four-hour timeframes when it came to Bitcoin. A comeback could still materialize if it were accompanied by a rebound in relative strength index (RSI) values.\n\n“This looks ripe for a bounce. RSI oversold with potential bullish divergence,” he told Twitter followers in a fresh update.\n\n“Need to wait until the next candle close and see if we get an ‘elbow up’ on RSI. Testing 200 MA for first time since Jan 6th. $21,646 is also key support, exactly where price bounced.”\n\nAn accompanying chart showed spot price proximity to the 200-day moving average (MA) mentioned. This remains a key trend line that Bitcoin only recently reclaimed after trading below it since late 2021.\n\nBTC/USD annotated chart. Source: Scott Melker/Twitter\n\n“All eyes on Bitcoin’s 200-day moving average cloud,” Caleb Franzen, senior market analyst at Cubic Analytics, continued on the topic.\n\nBTC/USD 1-day candle chart (Bitstamp) with 200MA. Source: TradingView\n\nAnalyst predicts 2021-style energy price surge\n\nCasting a longer-term view, Alasdair Macleod, head of research at precious metal investment company Goldmoney, had a further shock in store.\n\nRelated: Arthur Hayes bets on Bitcoin, altcoin surge in H1 2023 as he buys BTC\n\nIn his latest research piece released on the day, Macleod warned that macroeconomic conditions were apt to repeat behavior from a year earlier, at the start of the Russia–Ukraine conflict.\n\nThis specifically would involve a rerun of the commodity and energy price increases still being felt by consumers — but also a bull run for gold.\n\n“At this time last year, gold began a rapid rise to $2070 and oil traded up from $85 to $120 when Russia attacked,” he wrote.\n\n“It is amazing that markets are ignoring the very clear signals that the conditions which led to commodity and energy prices soaring last February are in place to happen again.”\n\nXAU/USD vs. BTC/USD chart. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGVjcnlwdC5jby8xMjEwNzcvbG9jYWxiaXRjb2lucy1iZXN0LXAycC1iaXRjb2luLWV4Y2hhbmdlc9IBSGh0dHBzOi8vZGVjcnlwdC5jby8xMjEwNzcvbG9jYWxiaXRjb2lucy1iZXN0LXAycC1iaXRjb2luLWV4Y2hhbmdlcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "LocalBitcoins Is Gone—But These P2P Bitcoin Exchanges Are the Next Best Thing - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLocalBitcoins, one of the oldest and best-known Bitcoin exchanges, is closing after a decade of service, with the peer-to-peer platform citing the “ongoing very cold crypto-winter” as the reason for stopping operations.\n\nThe marketplace, which launched in 2012, allows users from 189 countries to trade Bitcoin by matching buyers with sellers and holding the cryptocurrency in escrow until both parties confirm the transaction—assuring no funny business with dodgy traders.\n\nBut now with it shutting up shop, what other P2P exchanges can you use? A P2P service means that the two parties interact directly with each other on their own terms without the need for third-party involvement.\n\nAD\n\nAD\n\nAlthough LocalBitcoins is remarkably efficient and easy-to-use, other platforms exist. The following platforms provide a similar service that will allow you to interact directly with buyers or sellers to get a good price for your sats (or other digital assets.)\n\nBinance\n\nThe world’s biggest crypto exchange has a P2P section where users can buy or sell a number of cryptocurrencies—including Bitcoin, Ethereum, Tether, and Binance Coin. Just like LocalBitcoins, the prices of the assets are labeled lowest to highest and users can interact directly with sellers from over 40 countries.\n\nThe service is very easy to use and quick—just like when spot trading on the platform, and the service offers more payment methods than LocalBitcoins (though it lacks some of what LocalBitcoins offers, such as PayPal.)\n\nPaxful\n\nPaxful is one of the most popular P2P Bitcoin exchanges. The platform offers over 350 ways to buy and sell Bitcoin, and offers users a Bitcoin wallet.\n\nAD\n\nAD\n\nThe exchange also allows buyers and sellers to choose the location they want to shop in, the amount they want to spend, and if they want to make a transaction using another cryptocurrency (LocalBitcoins does not allow users to use cryptocurrency to buy Bitcoin.)\n\nUsers can buy Bitcoin using a number of digital assets on Paxful's P2P platform.\n\nPaxful’s platform currently offers Bitcoin and stablecoins Tether and USD Coin and sign-uping up to the website is quick and easy.\n\nHuobi\n\nLike Binance, Singapore-based Huobi is another giant cryptocurrency exchange which also offers a P2P service. And just like LocalBitcoins, it’s not complicated for even beginners to use.\n\nThe platform lists an impressive number of payment methods—including, surprisingly, some banks which have said they don’t allow customers to buy or sell crypto. But note that a trader using the P2P service must use the same details which match their Huobi account details.\n\nBisq\n\nBisq is a private, open-source P2P platform that allows users to buy and sell Bitcoin—and only Bitcoin—using fiat currency without know your customer (KYC) procedures. That means you don’t have to hand over personally identifiable information, such as your name and address, before making a trade.\n\nYou have to download Bisq's desktop app to get started.\n\nFor those wanting complete decentralization, this is the platform: Most cryptocurrency trading platforms now require documentation to sign up, especially if fiat money is involved.\n\nDeposits are held in multisig wallets—meaning the wallet is secured by various private keys, not just one—to protect buyers and sellers. User data is not stored anywhere but traders have to download the desktop app to use it.\n\nOKX\n\nSeychelles-based crypto exchange OKX also has a P2P service where users can buy and sell Bitcoin, Tether, Ethereum, USD Coin, and some other digital assets in their local currency.\n\nAD\n\nAD\n\nLike other services on this list, OKX offers lots of payment methods and users are able to search through the long-list of currencies to find the best offers.\n\nBut users can only use fiat currency to make or receive payments—not crypto."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiKGh0dHBzOi8vbmZ0cGxhemFzLmNvbS9iaXRjb2luLW5mdHMtc29hci_SASxodHRwczovL25mdHBsYXphcy5jb20vYml0Y29pbi1uZnRzLXNvYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs Soar Despite Polarizing Reception - NFT Plazas",
        "content": "Bitcoin NFTs Soar Despite Polarizing Reception\n\nNFTs and Bitcoin are rarely mentioned in the same breath; after all, the network doesn’t support kind of smart contracts that have allowed the likes of Ethereum to handle non-fungible tokens. However, this has changed rapidly over the last month, ever since the Ordinals project appeared on January 21. The platform essentially allows users of the Bitcoin network to inscribe JPEGs and other data on satoshis, the smallest unit of Bitcoin.\n\nThis deviation was made possible by the Bitcoin Taproot upgrade in November 2021, which allowed the storage of arbitrary data to a Satoshi’s Witness. Ordinals has proven controversial within the Bitcoin space, with various factions debating the benefits and drawbacks to inscribing JPEGs and other data on its blockchain.\n\nBitcoin maxis see this as stupidity, given that it has increased bitcoin’s block size, thus skyrocketing the transaction fees. According to research published by BitMEX on Wednesday, the sudden influx of JPEGs and other media files on the Bitcoin network has led to the consumption of 526 megabytes (MB) of block space, in addition to costing inscribers approximately 6.77 BTC, or $155,000, to date.\n\nOrdinals Data Up until 7 February 2023, we have identified: * Over 13,000 Ordinals transactions\n\n* 526MB of Bitcoin blockspace usage\n\n* 6.77 BTC of Ordinals related spendhttps://t.co/cSNHSPIEs3 — BitMEX Research (@BitMEXResearch) February 8, 2023\n\nBitcoin NFTs Are Splitting Opinions\n\nRene Pickhardt, a longtime Bitcoiner, had stern words for Ordinals, accusing the project of spamming Bitcoin with JPEGs. Adam Back is also against Bitcoin NFTs, deeming them as a “sheer waste and stupidity of an ecoding.” He can’t help but wonder why people inscribing NFTs on Bitcoin can’t do “something efficient.” However, he realizes nothing can be done to stop them as Bitcoin is built to be censorship-resistant.\n\nOn-chain data expert, Data_Always, agrees, highlighting the rate at which blockspace consumption increases with every new Ordinals NFT inscription. In a tweet, he notes that “Spending to inscribe Ordinals is climbing every day. Still only 12% of total fees and 0.3% of the subsidy, but the rise remains exponential. Biggest mempool backlog since FTX and 3AC collapses.”\n\nHowever, others see Bitcoin NFTs as a good thing. Long-term Bitcoin supporter Dan Held says that the “Ordinals is good for Bitcoin.” Alex Adelman, cofounder and CEO of Lolli, seems to agree too. He sees the Ordinals as a “milestone for Bitcoin.”\n\nHal Finney would like Bitcoin NFTs. pic.twitter.com/z4cO468pcA — Dan Held (@danheld) February 6, 2023\n\nBitcoin NFTs May Inspire Solutions To The Network’s Problems\n\nDespite the fact that Bitcoin continues to lag behind Ethereum and Solana in terms of investment and talent dedicated to innovating and developing new applications, Bitcoin NFTs should attract a new wave of interest and capital. This will create opportunities for developers to build new solutions that aid with scalability and efficiency.\n\nThat said, since launch a few weeks ago, Ordinals has seen over 47,000 inscriptions as of press time, according to Dune Analytics. February 9 represented the busiest day, with over 22,000 inscriptions, with JPEG images, text, video, applications, and audio files are among the types of data that is being inscribed.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZ2l6bW9kby5jb20vY2FzaC1jbG91ZC1iaXRjb2luLWF0bS1jcnlwdG9jdXJyZW5jeS1nZW5lc2lzLWJhbmtydXB0LTE4NTAwOTYwOTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Cash Cloud, the Bitcoin ATM Maker, Is Broke Amid Crypto Winter - Gizmodo",
        "content": "Over the past several years, crypto ATMs have crept into America’s less glamorous places, popping up in city truck stops, gas stations, and convenience stores. Between September 2020 and September 2022, the number of machines in the U.S. more than tripled, driving the total number up to at least 63,000 machines, Axios writes. However, boom times for the little bitcoin dispensers may soon be at an end because, in addition to the crypto industry’s recent downtown, one of the biggest U.S. operators of the machines is broke.\n\nWhy Should Crypto Currencies be Called Securities? | Gizmodo Interview CC Share Subtitles Off\n\nEnglish view video Why Should Crypto Currencies be Called Securities? | Gizmodo Interview\n\nCash Cloud—which supplies some 7.9 percent of the bitcoin ATM machines in the U.S.—filed for Chapter 11 bankruptcy in Nevada bankruptcy court on Tuesday, Cointelegraph reports. The company’s bankruptcy comes mere weeks after Cash Cloud’s biggest financial supporter, the crypto lender Genesis Global, also filed for bankruptcy, yet another victim of cryptocurrency’s massive downturn over the past nine months.\n\nAdvertisement\n\nThe Las Vegas-based ATM vendor, which sells its line of Coin Cloud crypto machines in both the U.S. and Brazil, has only $50 million to $100 million in assets but has liabilities between $100 million to $500 million, according to its bankruptcy filing. The filing also says that the company has between 5,001 and 10,000 creditors. I’m no Goldman Sachs intern, but I’d say that seems bad.\n\nAdvertisement\n\nGizmodo reached out to Coin Cloud for comment and will update this story if it responds. In a statement provided to Cointelegraph, Chris McAlary, the founder and CEO of the company, said that the bankruptcy would allow it to “rework our debt, protect the interests of our creditors, and emerge as a stronger, more financially stable company.” McAlary added that he was still “optimistic about the future of the cryptocurrency industry.”\n\nAdvertisement\n\nOf the many crypto ATMs scattered throughout the U.S., Coin Cloud has played an important role, representing a 7.9% share of the nation’s market overall, Axios writes. Of course, crypto’s glowup is decidedly over now, replaced by a crypto winter, and it appears that Coin Cloud is one more victim of its long and destructive reach."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDIxMDAwNTEzOS9lbi9BdWx0LUFsbGlhbmNlLUluYy4tU3Vic2lkaWFyeS1CaXROaWxlLUluYy4tTW92aW5nLTY1NzItQml0Y29pbi1NaW5lcnMtT3V0LW9mLVRleGFzLUhvc3RlZC1GYWNpbGl0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Ault Alliance, Inc. Subsidiary BitNile, Inc. Moving 6572 Bitcoin Miners Out of Texas Hosted Facility - Business Wire",
        "content": "LAS VEGAS--(BUSINESS WIRE)--Ault Alliance, Inc. (NYSE American: AULT), a diversified holding company (“Ault Alliance” or the “Company”) announced today that its subsidiary, BitNile, Inc. is currently moving Bitcoin mining equipment out of the Wolf Hollow hosting facility in Texas as a result of the September 2022 Compute North bankruptcy filing.\n\nBitNile, Inc. entered into a hosting agreement securing 20 megawatts of power announced on August 16, 2022 with Compute North, LLC. As a result of this agreement BitNile, Inc. moved 6,572 Bitcoin miners to Compute North’s Wolf Hollow hosting facility in Texas. Compute North’s Chapter 11 bankruptcy filing initiated a series of events including transfer in ownership of the Wolf Hollow hosting facility in Texas. BitNile, Inc. determined that the site is no longer economically viable and therefore began making weekly shipments to move the equipment to a safe and secure location for future deployment.\n\nMilton “Todd” Ault, III, the Company’s Executive Chairman, stated, “Although this situation is very frustrating, we are moving through the legal process with Compute North and have control over our equipment. We believe the decision to relocate our mining equipment provides us the ability to best execute our future deployment plans.”\n\nAs previously disclosed, the Company has entered into purchase agreements with Bitmain Technologies Limited for a total of 23,065 Bitcoin miners, including 4,600 environmentally friendly S19 XP Antminers that feature a processing power of 140 terahashes per second (“TH/s”), 17,325 S19j Pro Antminers that feature a processing power of 100 TH/s and 1,140 S19 XP Hydro Antminers that feature a processing power of 255 TH/s. Once all of the miners are fully deployed and operational, the Company expects to achieve a mining production capacity of approximately 2.66 exahashes per second.\n\nThe Company notes that all estimates and other projections are subject to the actual delivery and installation of Bitcoin miners, the volatility in Bitcoin market price, the fluctuation in the mining difficulty level, the ability of Agora Digital Holdings Inc. to raise the required capital and to build out and provide the necessary power to its facility in Texas, with whom the Company has contracted, and other factors that may impact the results of production or operations.\n\nFor more information on Ault and its subsidiaries, Ault recommends that stockholders, investors, and any other interested parties read Ault’s public filings and press releases available under the Investor Relations section at www.ault.com or available at www.sec.gov.\n\nAbout Ault Alliance, Inc.\n\nAult Alliance, Inc. is a diversified holding company pursuing growth by acquiring undervalued businesses and disruptive technologies with a global impact. Through its wholly and majority-owned subsidiaries and strategic investments, Ault Alliance owns and operates a data center at which it mines Bitcoin and provides mission-critical products that support a diverse range of industries, including oil exploration, crane services, defense/aerospace, industrial, automotive, medical/biopharma, consumer electronics, hotel operations and textiles. In addition, Ault Alliance extends credit to select entrepreneurial businesses through a licensed lending subsidiary. Ault Alliance’s headquarters are located at 11411 Southern Highlands Parkway, Suite 240, Las Vegas, NV 89141; www.Ault.com.\n\nForward-Looking Statements\n\nThis press release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended These forward-looking statements generally include statements that are predictive in nature and depend upon or refer to future events or conditions, and include words such as “believes,” “plans,” “anticipates,” “projects,” “estimates,” “expects,” “intends,” “strategy,” “future,” “opportunity,” “may,” “will,” “should,” “could,” “potential,” or similar expressions. Statements that are not historical facts are forward-looking statements. Forward-looking statements are based on current beliefs and assumptions that are subject to risks and uncertainties. Forward-looking statements speak only as of the date they are made, and neither Ault Alliance nor Ecoark undertake any obligation to update any of these statements publicly in light of new information or future events. Actual results could differ materially from those contained in any forward-looking statement as a result of various factors. In addition to risks relating to the continuation of high oil prices and state regulation of bitcoin mining, investors should review risk factors, that could affect either or both of the Ault Alliance’s and Ecoark’s respective businesses and financial results which are included in Ault Alliance’s and Ecoark’s respective filings with the U.S. Securities and Exchange Commission, including, but not limited to, their respective Forms 10-K, 10-Q and 8-K. All such filings are available at www.sec.gov and on the companies’ websites at www.Ault.com and www.ecoarkusa.com, respectively."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDIvMTAvc2VjLWRpZC1ub3QtY29uc3VsdC1pbmR1c3RyeS1iZWZvcmUta3Jha2VuLWNyeXB0by1zdGFraW5nLXNldHRsZW1lbnQtY29tbWlzc2lvbmVyLXBlaXJjZS_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAyLzEwL3NlYy1kaWQtbm90LWNvbnN1bHQtaW5kdXN0cnktYmVmb3JlLWtyYWtlbi1jcnlwdG8tc3Rha2luZy1zZXR0bGVtZW50LWNvbW1pc3Npb25lci1wZWlyY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "SEC Did Not Consult Industry Before Kraken Crypto Staking Charges: Commissioner Peirce - CoinDesk",
        "content": "She took particular umbrage at the restrictive terms of Kraken’s settlement. It has vowed to never relaunch its staking business for U.S. customers, she said, meaning it can not even go through the motions of operating above board, in the SEC’s view, if it wanted to."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0xMC1jcnlwdG9jdXJyZW5jaWVzLWZvci1mZWJydWFyeS0xMS0yMDIzLWJpdGNvaW4tYXQtdXMyMWsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Top 10 Cryptocurrencies for February 11 2023; Bitcoin At US$21K - Analytics Insight",
        "content": "The crypto market melt down does not seem to cool as Bitcoin dipped at US $21K according to our list of top 10 cryptocurrencies for February 11 2023.\n\nPeople need a monetary asset that cannot be debased running on a network that cannot be censored governed by a protocol that cannot be corrupted. Only #Bitcoin meets these requirements. — Michael Saylor⚡️ (@saylor) February 1, 2023\n\nThe top crypto, Bitcoin (BTC) is currently trading at US $21,694.40 after dropping by 1.00% in the past 24 hours. As a result, the market capital of Bitcoin, too, suffered and went down at US$418 billion.\n\nThe second most top cryptocurrency, Ethereum(ETH) is trading at US$1,522.17. Just like BTC, ETH too went down by 1.93% in the past 24 hours. The global cryptocurrency market capital is now US$1.01 Trillion, and has gone down by 0.89% in the past 24 hours.\n\nNote that the meltdown first started off when on Feb 09, Bitcoin dipped below $22,000 after the crypto exchange giant Kraken agreed to close its crypto staking operations which spread FUD amongst investors.\n\nHere is the list of 10 best cryptocurrencies for 11 February, 2023:\n\nCryptocurrency Trading Price(in USD) Past 24 hour Bitcoin (BTC) $21,694.40 down by 1.00% Ethereum (ETH) $1,522.17 down by 1.93% Tether (USDT) $1.00 down by 0.01% BNB $308.60 up by 0.01% USD Coin (USDC) $1 up by 0.00% XRP $0.3821 down by 0.97% Binance USD (BUSD) $1 up by 0.04% Cardano (ADA) $0.3605 down by 1.04% Polygon(MATIC) $1.24 down by 4.02% Dogecoin (DOGE) $0.08149 down by 0.97%\n\nTrending cryptocurrencies for today are Fetch.ai(FET), Taboo Token (TABOO) and OxAI.com(OXAI). FET is trading at US$0.4045 after witnessing a drop of 5.99% in the past 24 hours. TABOO is trading at US$0.001612 after it grew by 8.08% in the past 24 hours. OXAI is trading at US$0.00001239 after a drop of 3.56% in the past 24 hours\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tZHJvcHMtdG8tMjEtNjAwLWRlc3BpdGUtbmV3LWFsbC10aW1lLWhpZ2gtaW4tbWluaW5nLWRpZmZpY3VsdHktaXMtdGhpcy1hLXNpZ24tdG8tc2hvcnQtYnRjLTIwMjMwMjEwMDcyMtIBogFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLWRyb3BzLXRvLTIxLTYwMC1kZXNwaXRlLW5ldy1hbGwtdGltZS1oaWdoLWluLW1pbmluZy1kaWZmaWN1bHR5LWlzLXRoaXMtYS1zaWduLXRvLXNob3J0LWJ0Yy0yMDIzMDIxMDA3MjI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin drops to $21,600 despite new all-time high in mining difficulty, is this a sign to short BTC? - FXStreet",
        "content": "Share:\n\nBitcoin mining difficulty hit a record high at 39 trillion hashes, hash rates near the peak level.\n\nBTC price slumped 4% overnight, hitting a local low of $21,600, after the US financial regulator’s crackdown on crypto staking services.\n\nBitcoin traders’ short positions exceed longs on top derivatives exchanges dYdX, Kraken and OKX.\n\nBitcoin price wiped out its recent gains, dropping to a local low at $21,600. Mining difficulty hit a new all-time high at 39 trillion hashes, increasing the pressure on miners in the Bitcoin ecosystem. Volume of short positions on top derivatives exchanges exceeded longs as BTC price plummeted.\n\nAlso read: Is Bitcoin price out of the woods? Derivatives traders bet on massive rally in BTC\n\nBitcoin mining difficulty hits record high\n\nBitcoin network’s difficulty has hit its highest level at 39.35 trillion hashes. Mining difficulty has hit peak levels, implying that it is harder than ever for miners to secure the next block. BTC miners must perform 39.35 trillion hashes to find the next Bitcoin block. Difficulty is the measure of the competition between miners on the network to produce a block.\n\nBitcoin Miner Difficulty\n\nBitinfocharts reported a hash rate of 300 exahashes per second EH/s, just shy of its late January peak of 316 EH/s. These developments have hit mining profitability and the metric plummeted to multi-year lows. Since February 2022, mining profitability has tanked 66% to current levels.\n\nBitcoin bleeds under regulatory crackdown and selling pressure\n\nBitcoin price is negatively influenced by US financial regulator Securities and Exchange Commission’s regulatory crackdown on Kraken for its crypto-as-a-staking product. Colin Wu, a Chinese reporter shared details of the SEC’s charges against the cryptocurrency exchange platform.\n\nThe U.S. SEC charged Kraken with failing to register the offer and sale of their crypto asset staking-as-a-service program and advertise annual investment returns of as much as 21 percent. Kraken agreed to immediately cease staking products and pay $30 million penalties. — Wu Blockchain (@WuBlockchain) February 10, 2023\n\nSelling pressure on the asset increased, sending BTC to a local low at $21,600. Short positions have overtaken longs on derivatives exchanges.\n\nBased on data from Coinglass, there is a massive increase in short positions on dYdX, Kraken and OKX.\n\nExchange BTC Long/Short ratio\n\nThe high percentage of short positions versus longs indicate the bearish bias towards Bitcoin, among derivatives traders on cryptocurrency exchange platforms.\n\nIs this the right time to short Bitcoin?\n\nCrypto traders on Twitter shared their profitable BTC short setups as Bitcoin price dropped to local low at $21,600. Akash Girimath, cryptocurrency analyst at FXStreet shared his setup for a profitable BTC short of 316%. The expert opened the short at an entry price of $23,383 and tooke profits when BTC nosedived to $21,857.\n\nTraders at a trading group “Castillo Trading” booked 40% profits with Bitcoin’s decline from $23,663 to $21,827.\n\nBitcoin price has sustained above the $21,000 level, trading at $21,700. The leading cryptocurrency is in a short term downtrend, it is therefore expected to continue declining in the short term.\n\nThe pair has declined below the support zone between $22,351 and $23,362. A break above $22,351 would imply a bounce is in progress with a likely run up to the top of the support zone at $22,362.\n\nBased on the Bitcoin 1D price chart, $21,286 is a key support level for the asset and a decline to this level could be followed by a recovery and an attempt to break into the support zone that starts at $22,351.\n\nBTC/USDT price chart\n\nWith derivatives traders exhibiting a bearish bias, the asset’s uptrend has come to a grinding halt. There is a likelihood of recovery in the short-term if BTC price sustains above the $21,286 level."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vbmZ0ZXZlbmluZy5jb20vb3JkaW5hbC1uZnRzLWFyZS1iaXRjb2luLW5mdHMtdGhlLWhvdHRlc3QtbmV3LXRyZW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Ordinal NFTs: Are Bitcoin NFTs the Hottest New Trend? - NFTevening.com",
        "content": "Bitcoin NFTs are all the rage right now, due to the launch and massive success of the ‘Ordinals’ protocol. Ordinals provide a novel way to mint NFTs on the Bitcoin blockchain. The latest rise in the Bitcoin assets is due to the launch of the Bitcoins equivalent CryptoPunks (Ethereum-based NFT) collection. Although all the buzz and hype is met with mixed reactions from the web3 community. So, what are Bitcoin Ordinals? Find out more below\n\nWhat are Ordinal NFTs on Bitcoin?\n\nOn January 21, software engineer Casey Rodarmor launched the Ordinals protocol on the Bitcoin blockchain. Each Bitcoin can be broken down into 100,000,000 units termed “sats” (short for Satoshi). This new protocol allows users and builders to inscribe each ‘sat’ with data, known as Ordinals. This data can also be smart contracts, and hence NFTs can be minted on them. In essence, the Ordinal protocol allows builders to create NFTs on the Bitcoin blockchain.\n\nMoreover, one of the core distinctions between Ethereum-based NFTs and Bitcoin is that Ethereum NFTs usually point to off-chain data on the IPFS system. With this protocol, all the data is inscribed on-chain. “An Ordinal is intended to reflect what NFTs should be, sometimes are, and what inscriptions always are, by their very nature,” says Rodarmor. This new ecosystem may be a boon to the NFT industry overall, improving upon the very concept of digital collectibles. To add to this, due to the entirely on-chain inscription of data for Ordinals, Rodarmor refers to them as something beyond NFTs, calling them Digital Artifacts.\n\nHow Will Ordinal Punk NFTs Change the Game?\n\nIn many ways, Ordinal Punks means a new wave of Bitcoin NFTs, digital collectibles, and marketplaces. The 100-pixel pfp avatars are tradeable digital artifacts inscribed on the Bitcoin blockchain. The project is allegedly a clone of a derivative project “Mutant Punks”, a clone of the original CryptoPunks on Ethereum. Though founder Rodarmor claims that the project uses “an open-source algorithm and CC0 Punk sprite sheet to generate new Punks.”\n\nThe entire 10K collection is already off the shelf, with one Ordinal Punk (#620) selling for 9.6 BTC (~$214,766.50). However, one of the problems with the project at the moment is that there simply isn’t a marketplace to buy and sell the crypto art once minted. But this, of course, does not stop the web3 community from buying and selling the digital pieces.\n\nMore than 40,000 Ordinals have been inscribed on the Bitcoin blockchain so far. There has also been a backlash against the whole protocol by Bitcoin maximalists. According to them, the whole idea of Bitcoin NFTs are against Bitcoin as a financial asset. Some even claim the Ordinals are just a waste of network space.\n\nHow to Actually Buy Bitcoin NFTs?\n\nTo buy an Ordinal NFT, one must first download a Bitcoin compatible wallet. Once done, the user then has to follow a detailed GitHub guide to make the BTC wallet compatible to Ordinals. After this, the user must run their own Bitcoin node and inscribe an ordinal (which wouldn’t be possible now since the project is minted out). So there are two other options available for people to purchase a BTC Ordinal NFT.\n\nThe simple way is to find an Ordinal owner and purchase it from them. Owners can be found on the official Discord server. Navigating to the link-your-project channel on their discord allows users to explore what Bitcoin projects are out there. This is, obvious to say, a huge risk to potential customers, as the sites and discords may be completely botched. Moreover, unless there is a trust between project buyers and sellers, it may lead to scams and frauds. Moreover, BTC Ordinals may take hours or even days before they show up inside your BTC wallet.\n\nMoving on, if one wishes to create/inscribe an Ordinal themselves, there are services out there that allow for this. The services allow users to inscribe them without actually running a node themselves. For example, popular Bitcoin project Satoshibles have created an Ordinal Bot, that allows users to inscribe NFTs to their Bitcoin wallets."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3ByaWNlLXByZWRpY3Rpb25zLWZvci1iaXRjb2luLWV0aGVyZXVtLWFuZC1iaWctZXllcy1jb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Price Predictions For Bitcoin, Ethereum And Big Eyes Coin - Analytics Insight",
        "content": "In this article, we will examine some of the different cryptocurrencies and their fundamentals to predict whether their price will go up to the moon, or plummet to rock bottom. We will look at Bitcoin (BTC), Ethereum (ETH) and Big Eyes Coin (BIG).\n\nThough it is impossible to guess with certainty the price of many different cryptocurrencies, what we can do is look at the fundamentals of the cryptocurrencies and their price movements in the past to try to predict their potential price movements in the future.\n\nBitcoin: The Original Cryptocurrency\n\nBitcoin is becoming more and more popular as an investment choice because of its long-term development potential as a store of value. Having been released in 2009, Bitcoin has grown to become the most valuable cryptocurrency. Due to its potential for substantial long-term financial gains, many view Bitcoin as a promising long-term investment.\n\nBitcoin is very tempting for investors because it is decentralised, which means that no single body has authority over it or the ability to change its value. This makes it a viable replacement for traditional investments, which are frequently subject to influences like those of the government.\n\nFrom its price movements in the past, we can see Bitcoin continuing its upward momentum in the long term. Though volatility is to be expected, in the long run, Bitcoin is likely to outlast the rest of the competition, being one of the original cryptocurrencies.\n\nEthereum: Digital Silver\n\nInvestors are increasingly turning to Ethereum (ETH) as a viable investment choice. With good cause, too! Ethereum provides a secure, decentralised framework for building blockchain applications. Smart contracts can run on the platform, giving it a lot of utility in the blockchain space, and allowing developers to build dApps (decentralised applications) on the platform.\n\nIt is a popular choice for investors looking to diversify their portfolios since it provides several advantages and features.\n\nEthereum is likely to maintain its position as one of cryptocurrency’s leaders due to its low transaction costs, rapid transaction speeds, and tremendous scalability. Aside from better security, increased returns on investment, and improved liquidity, investing in Ethereum can provide investors with several benefits.\n\nIn the future, Ethereum is most likely to maintain its position as one of the leading cryptocurrencies, and we can see its price retaining a steady position in keeping with Bitcoin.\n\nBig Eyes Coin: The New Meme Coin King?\n\nBig Eyes Coin (BIG) is one of the hottest new meme coins on the market right now. It has raised $24.5 million and counting!\n\nIt was developed on the Ethereum network and works to raise consumer awareness of the DeFi market while promoting DeFi to boost the amount of money coming into the DeFi ecosystem.One of Big Eyes Coin’s key goals is protecting the seas. To benefit organisations that promote ocean conservation, Big Eyes Coin retains 5% of all tokens in an open charity wallet.\n\nWant to carry out your price prediction? On the Big Eyes Coin website, there is a calculator to look at your potential ROI if you invested now and what your returns could be if Big Eyes Coin increased in price!\n\nWe can easily see this coin skyrocketing, as it already has an incredible amount of momentum, and it champions a social cause that people are looking to get involved in.\n\nFinal Thoughts\n\nThough no price prediction is certain, we can see all of these coins increasing in value due to their solid fundamentals and promising communities built around their respective cryptocurrencies. As always, ensure that you carry out thorough research before investing in any asset. Happy investing!\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWhvdy10aGUtZnR4LWNvbnRhZ2lvbi1yZWR1Y2VkLWV4dGVybmFsLWZhY3RvcnMtaW1wYWN0LW9uLWJ0Yy_SAV9odHRwczovL2FtYmNyeXB0by5jb20vYml0Y29pbi1ob3ctdGhlLWZ0eC1jb250YWdpb24tcmVkdWNlZC1leHRlcm5hbC1mYWN0b3JzLWltcGFjdC1vbi1idGMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin: How the FTX contagion reduced external factors’ impact on BTC - AMBCrypto News",
        "content": "Many BTC left exchange storage since the FTX exchange crashed in November.\n\nThe king coin continues to drift away from macroeconomic policies but is still stuck to traditional correlation.\n\nBitcoin [BTC] holders felt the impact of the FTX collapse in the last quarter of 2022 but have stayed to the aftereffect related to the unfortunate event. Twitter’s famous on-chain analyst Ali_charts opined that the incident was a blessing in disguise for Bitcoin.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nThe analyst based his inference on the manner the king coin exited exchanges and how holders resorted to avoidance of CEXes. Information derived from Santiment showed that about 260,000 BTC had left the exchanges’ shores since November. Also, 350,000 BTC have been kept out.\n\n$FTX collapse was bad for the industry but great for #Bitcoin! Since Nov. 2022, data from @santimentfeed shows that 260,000 #BTC were withdrawn from #crypto exchanges and more than 350,000 $BTC have been kept out of exchanges. Not your keys, not your coins. It's that simple! pic.twitter.com/kc7iQ9KVYx — Ali (@ali_charts) February 9, 2023\n\nBTC now cares less about macro?\n\nRecall that it was during this period that the BTC price fell below $16,000. However, Messari’s Bitcoin fourth quarter (Q4) report showed that the macroeconomic factors had minimal impact on the coin’s price.\n\nDespite the unfavorable conditions, Bitcoin gained some positives from the collapse. For example, active addresses increased by 2% from the preceding quarter while transactions followed through in advancement. All these happened in the face of a 4.50% interest hike by the U.S. Federal reserve.\n\nFurther, BTC showed evidence of detachment from its reaction to the 9 February FOMC meeting. Although Bitcoin may be exiting its bond with the macro factors, it still correlated with the trends of the traditional markets.\n\nHow much are 1,10,100 BTCs worth today?\n\nAccording to Santiment, the Bitcoin trend matched the one displayed by the S&P 500 Index [SPX] and gold.\n\nAt the time of writing, the BTC price was still in its weekly decline. SPX was down to 4081 while gold traded at 1877.\n\nIn the instance where the stock and gold prices continue the decline, there could be a chance that Bitcoin finds it hard to repeat its January bullish performance.\n\nAn impending endless disconnect\n\nIn a related development, the New York Fed Research released a research paper explaining the Bitcoin disconnect from the macroenvironmental elements.\n\nGianluca Benigno and Carlo Rosa, authors of the research, described the unhook as puzzling since most speculative assets were subject to U.S monetary policies. The authors concluded that,\n\n“Our analysis instead shows that, while other US asset prices respond to both the target and the path of monetary policy news, Bitcoin is unresponsive to unexpected changes in the short-term rate while its reaction to news about the future path of policy is not robust.”\n\nBut the conclusion might sound too hasty. Nonetheless, the happenings in the last four months, coupled with the BTC reaction to future policies might determine if the correlation would continue to exist or not."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC01LW5hdGlvbnMtd2l0aC10aGUtaGlnaGVzdC1udW1iZXItb2YtYml0Y29pbi1hdG1zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "Top 5 Nations with the Highest Number of Bitcoin ATMs - Analytics Insight",
        "content": "Watch out for the top 5 nations with the highest number of Bitcoin ATMs\n\nThe rise in popularity of cryptocurrencies like Bitcoin in recent years has resulted in an increase in the number of Bitcoin ATMs installed worldwide. Users may quickly and securely purchase and trade Bitcoin and other cryptocurrencies using these ATMs. In this post, we’ll examine the top 5 nations with the greatest concentration of Bitcoin ATMs.\n\nUnited States – With more than 17,000 machines dispersed around the nation, the United States boasts the most Bitcoin ATMs worldwide. This is not surprising given that the United States is known for its high level of technological innovation and a significant number of cryptocurrency early adopters.\n\nCanada – Canada comes in second on our list with over 4,000 Bitcoin ATMs. The nation has supported cryptocurrencies, and in recent years, the number of ATMs has steadily increased.\n\nUnited Kingdom – The number of Bitcoin ATMs in the United Kingdom exceeds 1,500, making it the third-highest country on our list. In particular, London is a centre for cryptocurrencies and offers a sizable number of Bitcoin ATMs for use.\n\nAustria – Austria is one of the biggest marketplaces for cryptocurrencies in Europe with over 900 Bitcoin ATMs. The nation’s robust economy and pro-cryptocurrency regulatory environment have helped the number of Bitcoin ATMs increase.\n\nSpain – Spain is one of the markets for cryptocurrencies in Europe that is expanding the fastest, with over 800 Bitcoin ATMs. Young and tech-savvy citizens of the nation have embraced cryptocurrencies, which has fueled the expansion of Bitcoin ATMs.\n\nIn conclusion, the development of Bitcoin ATMs is evidence of the escalating acceptance of cryptocurrencies worldwide. These ATMs give users an easy option to purchase and trade Bitcoin and other cryptocurrencies, and the fact that they are becoming more common in many nations indicates that people are accepting these digital assets on a widespread basis.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC10by1leHBsYWluLWJpdGNvaW4tbGlrZS1hLTE5MjBzLW1vYnN0ZXItdGhlLXJlc3VsdC1pcy1oaWxhcmlvdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "We asked ChatGPT to explain Bitcoin like a 1920s mobster; The result is hilarious - Finbold - Finance in Bold",
        "content": "The text-based artificial intelligence (AI) platform ChatGPT is all the rage these days, as people are discovering they can use it for writing all sorts of things, including jokes, poems, stories, predictions on cryptocurrency prices, or even to explain Bitcoin (BTC) as would, for instance, a 1920s mobster.\n\nIndeed, to bring some light after the most recent blow to the crypto sphere in the form of the United States Securities and Exchange Commission (SEC) forcing the crypto trading platform Kraken to shut down its staking services in the U.S., Finbold asked ChatGPT to explain Bitcoin in the style of a mobster from the 1920s.\n\nAs it happens, the AI did a very good job, deploying the vocabulary, phrasing, content, and sentence style that resembles that of the movies and shows featuring organized crime syndicates from the ‘roaring twenties’ era that marked the American landscape at the time.\n\nTelling it like a mobster\n\nFirst, ChatGPT artfully introduced the topic, making it difficult not to read the text in a 1920s gangster voice:\n\n“Alright boss, let me break it down for you. Bitcoin is like this stash of cash we got hidden away, see. Only instead of being in a physical place like a safety deposit box, it’s all digital, get it? And just like regular money, you can use it to buy things, but there’s a few key differences.”\n\nLike a skillful storyteller, the AI continued to explain the main benefits of this kind of money, using relatable and simple terms for a mobster:\n\n“First off, it’s completely anonymous. No one knows who’s makin’ the transactions, which makes it a pretty sweet setup for us. Second, it’s decentralized, which means there ain’t no one person or bank in charge of it, it’s all run by the people usin’ it, get it? And the best part? It’s completely untraceable. No government, no bank, no one can track where the bitcoins are comin’ from or where they’re going. It’s like we’re runnin’ our own little shadow economy.”\n\nFinally, in the manner of a careful 1920s mobster, ChatGPT warns his imaginary boss about the importance of understanding the potential risks of dealing with Bitcoin, while at the same time reiterating its advantages:\n\n“Now, the value of a bitcoin can change just like the stock market, so you gotta keep an eye on it. But if you play your cards right, you could end up with a real nice payout. Just remember, it’s a risky game and you gotta be careful, or you could end up losin’ everything.”\n\nConclusion\n\nDespite the comedic value of having ChatGPT role-play as a crook from the beginning of the last century while describing a very modern concept, its educational purpose can easily be recognized as well, thanks to the humorous and simple approach to explaining Bitcoin to someone who knows nothing about it."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDIvMTAvYml0Y29pbi1ldGhlcmV1bS1tYXJrZXQtYW5hbHlzaXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum market analysis - The Cryptonomist",
        "content": "Traders are reminded of a major development in the cryptocurrency world. Coinbase CEO Brian Armstrong expressed concerns about the possible elimination of cryptocurrency staking for retail clients by the SEC.\n\nLater, it was announced that Kraken, one of the longest-running crypto exchanges, reached a $30 million settlement with the SEC on the issue.\n\nIn recent hours, information has also emerged regarding regulators’ persecution of large centralized stablecoin issuers.\n\nThese events come shortly after the White House’s statement regarding its concerns about cryptocurrencies. Ironic situation when considering that several US regulators in recent years have received funding from the FTX exchange, and now find the future of cryptocurrencies in their hands.\n\nFunding that after the exchange goes bankrupt could be part of the bankruptcy recovery action and be returned.\n\nScrolling down the Top 30 list, only one green sign stands out.\n\nIt is that of Polygon (MATIC), which from last Friday’s levels is registering a rise that exceeds 6%. The token, which plays an important role in the Polygon platform ecosystem, is on its way to ending its 6th consecutive upward week. After about 10 months, the MATIC digital token recovers $1.3, gaining more than 70% since the beginning of the year.\n\nAnalysis of Bitcoin (BTC)\n\nAfter sustained gains in January, Bitcoin (BTC) is set to close the week down for the 2nd consecutive time, with prices hovering around $21,800.\n\nShould these levels hold until Sunday’s close, there would be a decline from the $22,900 with which the week began.\n\nScenario that should not surprise readers of these pages who follow the cryptocurrency market. As hypothesized in my last update published on Tuesday, an imminent close of the monthly cycle, expected between the end of this week and the beginning of next week, was being reported, which would be characterized by a continuation of the bearish trend.\n\nThe cyclical structure is taking shape confirming a final phase of a major cycle, such as the monthly cycle, in which prices are subject to downturns.\n\nHowever, the presence of an ongoing monthly cycle and its conclusion could be an important factor to consider when analyzing future market trends.\n\nTechnically, it is important that any continuation of the descent does not push prices too far down and in any case below $20,600. This level coincides with the last valid support built in mid-January during the last bullish run.\n\nEthereum (ETH) performance\n\nThe move backwards brings Ethereum (ETH) prices back to test the crucial $1,520 USD support. A level that has been an opportunity for a rebound several times since mid-January.\n\nRebounds that have been unsupported by new buying that has so far failed to confirm momentum beyond the $1,620 resistance, previous to the November highs.\n\nOver the weekend, it is important for ETH to confirm the holding of current support. A breakout of $1,500 could result in the stimulation of bearish speculation that would find space for a descent down to the $1,420 USD area, caused by the lack of validly built supports during the last ascent in January.\n\nIn the coming days or weeks, only an overtaking of $1,650 accompanied by volumes would create the conditions for a new bullish extension with the next target in the $1,750 USD area."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYm9sZC5jb20vYnRjLWFpLXNldHMtYml0Y29pbi1wcmljZS1mb3ItdmFsZW50aW5lcy1kYXktMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "BTC: AI sets Bitcoin price for Valentine's Day 2023 - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) is again under pressure as the leading cryptocurrency sank to a four-week low below $22,000. This decline follows Bitcoin’s impressive performance in January, during which BTC rose about 40% since the beginning of the year, leading some to predict a fresh bull run.\n\nFinbold has analyzed the potential performance of BTC on Valentine’s Day using artificial intelligence (AI) to see if any more significant price moves could be on the cards ahead of the holiday after the recent drop in the wake of the U.S. Securities and Exchange Commission (SEC) announcing a settlement with cryptocurrency exchange Kraken for alleged securities laws violations.\n\nIn particular, the machine learning algorithms at the crypto monitoring platform PricePredictions have projected the price of BTC will trade at $21,632 on February 14, 2023, according to the data retrieved on February 10.\n\nBTC 7-day forecast. Source: PricePredictions\n\nThe AI aggregates the latest technical analysis (TA) indicators, including moving averages (MA), the moving average convergence divergence (MACD), relative strength index (RSI), Bollinger Bands (BB), and more, to come to the price estimate for Bitcoin.\n\nBitcoin technical analysis\n\nBitcoin sentiment via TradingView’s technical analysis indicators on 1-day gauges, is rather bearish, with the summary pointing at a ‘sell’ at 9, as summarized from oscillators being in the ‘neutral’ zone at 8, and moving averages suggesting ‘sell’ at 8.\n\nBTC 1-day technical analysis. Source: TradingView\n\nCurrently, Bitcoin is changing hands at $0.388, down 2.35% in the last 24 hours and down a further 3.94% across the previous seven days. A support level exists at $21,249, while the next significant resistance level is located at $22,649.\n\nBTC 1-day chart. Source: Finbold\n\nIn total, $40 billion has fled the crypto market cap in a day as anxiety grows over SEC’s actions. After agreeing to pay a $30 million fine to resolve the accusations with the SEC, the Kraken decided to shut down its staking services in the United States.\n\nAdditionally, the SEC accused the cryptocurrency exchange of marketing unregistered securities, which led to enormous withdrawals from the market cap of cryptocurrencies with $18 billion leaving Bitcoin’s market cap which currently stands at $419 billion.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC10by1leHBsYWluLWJpdGNvaW4taW4tYS1yYXAtc29uZy1hbmQtaXRzLWRvcGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "We asked ChatGPT to explain Bitcoin in a rap song and it's dope - Finbold - Finance in Bold",
        "content": "The ChatGPT chatbot continues to gain prominence over its ability to handle different tasks by providing detailed responses and clear answers across various fields of expertise.\n\nSome of the emerging roles of the text-based artificial intelligence (AI) tool include offering specific crypto price predictions and writing songs with lyrics covering diverse themes and genres.\n\nIndeed, Finbold tasked ChatGPT with the role of explaining Bitcoin (BTC) in the form of rap music. As it stands, the tool did not disappoint by compressing all information about Bitcoin to align with the features of rap music.\n\nIn its explanation, ChatGPT incorporated elements such as rhyme schemes, repetition to emphasize certain points, and storytelling to creative wordplay.\n\nRapping about Bitcoin\n\nAt the start, the AI tool made it clear it was about to tell a story about Bitcoin, stressing that the asset is a real deal and not just a ‘game’:\n\n“Listen up, y’all I got a story to tell About a currency that’s making waves doing well It’s called Bitcoin, and it’s changing the game A decentralized system with no one to blame”\n\nFor the chorus, ChatGPT summed up Bitcoin as secure, with no possibility of third-party interference, while noting that the maiden crypto is the ‘future of gains’.\n\nChatGPT Bitcoin rap lyrics. Source: ChatGPT\n\nUnder the second verse, the AI tool opted to offer a history lesson on the emergence of Bitcoin, highlighting the year of creation and the anonymity around the asset’s innovator:\n\n“It started in 2009, with a mysterious creator Satoshi Nakamoto, the name of the innovator The idea was simple, create a new coin A digital currency that can easily be joined”\n\nFurthemore, ChatGPT used its lyrical prowess to give a word of caution for investors hoping to get rich quickly by buying Bitcoin. The tool warned that crypto markets remain highly volatile and caution should be observed:\n\n“But it’s not all sunshine, it’s a volatile ride It can go up and down, you gotta hold on tight But it’s a long-term play, not a get-rich-quick scheme Invest wisely, and you can make your dreams come true, it seems”\n\nFinally, for the outro, ChatGPTs’ Bitcoin rap sums up everything by advising on investing in the crypto and joining the revolution:\n\n“So that’s the story of Bitcoin, a currency of the future, Join the revolution, don’t be a loser, Invest wisely, and see your wealth grow, Bitcoin, Bitcoin, it’s the way to go”\n\nConclusion\n\nAlthough ChatGPT rap lyrics appear entertaining, the tool does not miss the opportunity to educate about Bitcoin. From the lyrics, it’s clear that the AI tool understands the potential benefits to risks associated with Bitcoin.\n\nThese attributes also play out when the tool is tasked with describing Bitcoin in other forms. For example, ChatGPT remained educational and comical when we asked to explain Bitcoin like a 1920s monster."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vbWFjc291cmNlcy5jb20vaG93LXRvLW1pbmUtYml0Y29pbi1hdC1ob21lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Feb 2023 08:00:00 GMT",
        "title": "How To Mine Bitcoin At Home - MacSources",
        "content": "Many people assume that mining Bitcoin requires a significant investment in expensive equipment, but that is not entirely accurate. Although the chances of earning a profit from mining Bitcoin at home are slim, it can serve as an excellent learning opportunity about the cryptocurrency. Additionally, there is always a chance, however small, of finding a block and receiving the 6.25 BTC block reward. This guide will explain the concept of Bitcoin mining, its mechanics, and how to mine at home.\n\nWhat is Bitcoin Mining?\n\nBitcoin mining is the process of using specialized computer hardware to verify and record transactions on the Bitcoin blockchain, and in return, miners are rewarded with newly minted bitcoins. When a user initiates a transaction on the Bitcoin network, it is broadcast to the network and grouped with other transactions into a block. Miners then compete to solve a complex mathematical puzzle to validate the block and add it to the blockchain. The first miner to solve the puzzle and validate the block is rewarded with newly minted bitcoins and transaction fees. This process of solving the puzzle and validating transactions is known as “mining.”\n\nCan Bitcoin Be Mined at Home PC?\n\nIt is possible to mine Bitcoin using a home PC, but it is not profitable. The process of mining Bitcoin requires significant computational power, and as the network has grown, the difficulty of mining has increased. This means that miners need to invest in specialized hardware, known as ASICs (Application-Specific Integrated Circuits), in order to have a chance of earning a profit. A home PC is not powerful enough to compete with specialized mining hardware, and the electricity costs associated with running a PC for an extended period of time would likely exceed any potential profits. It is still possible to mine Bitcoin using a home PC, but it would not be profitable and it’s not recommended.\n\nHow to Set Up A Bitcoin Mining at Home\n\nSetting up a Bitcoin mining operation at home can be a complex and costly process. Here are the basic steps that you would need to take:\n\nPurchase mining hardware: In order to mine Bitcoin, you will need to invest in specialized mining hardware known as ASICs (Application-Specific Integrated Circuits). These devices are specifically designed to mine Bitcoin and are much more powerful than a typical home PC. Set up a mining rig: A mining rig is a computer that is dedicated to mining Bitcoin. It typically consists of several ASICs, a power supply unit, and cooling system. You will need to assemble the rig and connect the ASICs to your computer. Join a mining pool: Mining Bitcoin alone can be difficult, as the chances of finding a block and earning the block reward are slim. Joining a mining pool allows you to combine your computing power with other miners, increasing your chances of earning a reward. Install mining software: Once your rig is set up, you will need to install mining software on your computer to connect to the mining pool and begin the process of mining Bitcoin. Monitor your progress: Keep track of your progress by monitoring the number of hashes per second your rig is producing, and the amount of Bitcoin you are earning. Calculate the cost: Take into account the cost of electricity, and make sure that the revenue from the mined bitcoin is covering the cost of electricity and the hardware.\n\nNote that, in order to make a profit, you will need to have a significant investment in specialized mining hardware and to be in a location with low cost electricity. Due to the high competition and the difficulty of mining, it’s not recommendable to mine Bitcoin at home for profit.\n\nSo, Can I Make Money While Mining Bitcoin At Home?\n\nIt is possible to make money as an at-home miner, but it can be difficult due to the high cost of electricity and the need for specialized equipment. Additionally, the difficulty of mining for cryptocurrency has increased significantly in recent years, making it more difficult for individual miners to compete with large mining operations. However, if you have access to low-cost electricity and are willing to invest in specialized equipment, it may be possible to make a profit as an at-home miner. It’s always better to do your own research (DYOR) and calculate the profitability before starting any mining operation.\n\nAnd Where Can I Sell Bitcoins That I’ve Mined at Home?\n\nThere are several places where you can sell bitcoins that you’ve mined at home. But the most popular option is – Cryptocurrency exchanges. Well-known exchanges such as Binance, Coinbase, and Redot allow you to sell your bitcoins for fiat currency (e.g. USD, EUR) or other cryptocurrencies."
    }
]