[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVjaC9iaXRjb2luLXZzLWJpdGNvaW4tY2FzaC13aGF0cy1kaWZmZXJlbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin vs. Bitcoin Cash: What's the Difference? - Investopedia",
        "content": "Bitcoin vs. Bitcoin Cash: An Overview\n\nBitcoin was the first cryptocurrency that achieved public awareness. It began as a payment method outside the control of governing bodies or other third parties. Bitcoin Cash is a cryptocurrency created from a Bitcoin blockchain fork, which occurs when users resist change or reprogram a blockchain to operate the way they want it to. Bitcoin cash forked in 2017 after developer and user disagreements about the direction Bitcoin was heading.\n\nKey Takeaways Bitcoin is limited by transaction processing time, an issue that has caused rifts among factions within the Bitcoin mining and developing communities.\n\nBitcoin Cash was started by Bitcoin miners and developers concerned about the future of Bitcoin and its ability to scale effectively.\n\nThough Bitcoin blocks are limited to 1 MB, BCH blocks can be up to 32 MB.\n\nBitcoin\n\nIn July 2017, mining pools and companies representing roughly 80% to 90% of Bitcoin computing power voted to incorporate a technology known as segregated witness (SegWit). This fix made the amount of data needing verification in each block smaller by removing signature data from the block that needs to be processed in each transaction and attaching it in an extended block. Signature data was estimated to account for up to 65% of data processed in each block, so this was not an insignificant technological shift.\n\nIn September 2017, research released by cryptocurrency exchange BitMEX showed that SegWit implementation had helped increase the block size amid a steady adoption rate for the technology.\n\nBitcoin Cash\n\nBitcoin Cash is a different story. Bitcoin Cash was started by Bitcoin miners and developers equally concerned with the future of the cryptocurrency and its ability to scale effectively. However, these individuals had their reservations about the segregated witness feature. They felt that SegWit did not address the fundamental problem of scalability meaningfully, nor did it follow the roadmap initially outlined by Satoshi Nakamoto, the anonymous party who first proposed the blockchain technology behind cryptocurrency.\n\nIn August 2017, some miners and developers initiated a hard fork, effectively creating a new blockchain and currency: Bitcoin Cash (BCH). BCH has its own blockchain and specifications, including one crucial distinction from Bitcoin: it has an increased block size of 8 MB to accelerate the verification process. This block size has an adjustable size level, which ensures transaction verification speeds, regardless of the number of miners supporting it. This limit was increased to 32 MB in 2018.\n\nBitcoin Cash is thus—theoretically—able to process transactions more quickly than the Bitcoin network, meaning that wait times should be shorter and transaction processing fees could be lower. The Bitcoin Cash network is also believed to be able to handle many more transactions per second than the Bitcoin network. However, this claim has yet to be tested, as the blockchain only averages more than 115,000 daily transactions.\n\nSpecial Considerations\n\nThe debate about scalability, transaction processing, and blocks has continued beyond the fork that led to Bitcoin Cash. In November 2018, for example, the Bitcoin Cash network experienced its own hard fork, resulting in the creation of yet another derivation of Bitcoin called Bitcoin SV. Bitcoin SV was created in an effort to stay true to the original vision for Bitcoin that Satoshi Nakamoto described in the Bitcoin white paper while making modifications to facilitate scalability and faster transaction speeds.\n\nBitcoin remains the most popular cryptocurrency in the world as well as the largest by market capitalization, so BCH users may find that liquidity and real-world usability are lower than they are for Bitcoin.\n\nEven with an increased block size implemented to decrease transaction times and improve usability, BCH doesn't experience near the popularity and volume of Bitcoin. BCH block sizes on Nov. 1, 2023, ranged from a few hundred bytes to about 7 MB, while BTC blocks ranged consistently from 1.1 MB to about 1.8 MB.\n\nHow Does the Market Capitalization of Bitcoin Cash Compare With Bitcoin's? On Nov. 1, 2023, Bitcoin Cash had a market capitalization of $4.7 billion, ranking it No. 18 among cryptocurrencies by this measure, while Bitcoin was the largest cryptocurrency by far, with its market cap of $673 billion.\n\nWhat Is the Total Supply of Bitcoin Cash? Like Bitcoin, the total supply of Bitcoin Cash will never exceed 21 million coins. The rate at which new coins are added to the circulating supply gradually decreases along a defined schedule, with the issuance rate cut in half about every four years. As of Nov. 1, 2023, the circulating supply of Bitcoin Cash was 19,547,438 BCH or about 93% of the total supply. Bitcoin's circulating supply was 19,530,375 BTC or 93% of the total supply.\n\nWhat Are the Features That Make Bitcoin Cash an Effective Medium of Exchange? Bitcoin Cash enables peer-to-peer payments between individuals, like cash, but in digital form. Fees for sending Bitcoin Cash are typically a fraction of a cent, while settlement occurs almost instantly regardless of the physical location of the participants in the transaction. These features make Bitcoin Cash useful for daily transactions as well as microtransactions.\n\nThe Bottom Line\n\nBitcoin and Bitcoin Cash are two cryptocurrencies that evolved from the original Bitcoin release. Bitcoin Cash forked from Bitcoin in 2017 after the community disagreed on how to fix scalability and speed issues. Bitcoin remains the top cryptocurrency by price and market capitalization, but Bitcoin Cash has a significant user base as well.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own cryptocurrency.\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMzEvYml0Y29pbi1jb3VsZC1oaXQtMTUwMDAwLWJ5LTIwMjUtcHJlZGljdHMtYmVybnN0ZWluLmh0bWzSAVxodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMC8zMS9iaXRjb2luLWNvdWxkLWhpdC0xNTAwMDAtYnktMjAyNS1wcmVkaWN0cy1iZXJuc3RlaW4uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin could hit $150,000 by 2025, predicts Bernstein - CNBC",
        "content": "The price of bitcoin could rise to $150,000 by 2025, Bernstein said Tuesday in a note citing optimism about a bitcoin exchange-traded fund.\n\nBernstein analyst Gautam Chhugani said the firm expects the U.S. Securities and Exchange Commission to approve a bitcoin ETF by the first quarter of 2024.\n\nThe bullish estimate is about five times the current price of around $34,000 and more than double bitcoin's all-time high of more than $67,000 set in November 2021.\n\nBernstein also expects that ETF approval would shift up to 10% of bitcoin's circulating supply toward ETFs. The approval would allow conventional investors to get bitcoin exposure directly from their investment portfolios. The only similar product is Grayscale's Bitcoin Trust , or GBTC, which presently holds around 3% of outstanding bitcoin, according to the note.\n\n\"You may not like Bitcoin as much as we do, but a dispassionate view of Bitcoin as a commodity, suggests a turn of the cycle,\" Chhugani wrote. \"A good idea is only as good as its timing - SEC approved ETFs by world's top asset managers (BlackRock, Fidelity et al), seems imminent.\"\n\nThe prediction came in a note where Chhugani initiated coverage on several bitcoin mining firms, saying that the bitcoin \"halving\" in April 2024 — in which bitcoin rewards will be halved as part of a planned and recurring event baked into the currency's underlying code — will force \"losing miners\" to be \"washed out,\" paving the way for big gains by the survivors.\n\nLast week, the price of bitcoin reached $35,000, its highest level since May 2022. Investors have said they remain hopeful for a green light on the ETF by the end of the year after the SEC declined to appeal a key court ruling in Grayscale's lawsuit against it.\n\nHowever, the court ruling does not guarantee the SEC will approve a bitcoin ETF. SEC Chair Gary Gensler has long criticized the crypto industry as being rife with \"fraudsters and scam artists,\" so whether the regulator will continue to fight against crypto ETFs is an open question.\n\nThe crypto industry has faced recent struggles, including the SEC's lawsuit against Binance for securities violations earlier this year. Last year, crypto exchange FTX filed for bankruptcy and its former CEO Sam Bankman-Fried is currently on trial for fraud.\n\n\n\nDon't miss these CNBC PRO stories:"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzMxL2JpdGNvaW4tc2F3LTI3LW9jdG9iZXItc3VyZ2UtYXMtdHJhZGVycy1wYW5pYy1ib3VnaHQtYW1pZC1iaXRjb2luLWV0Zi1lbnRodXNpYXNtLWlzLTQwMDAwLW5leHQv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMzEvYml0Y29pbi1zYXctMjctb2N0b2Jlci1zdXJnZS1hcy10cmFkZXJzLXBhbmljLWJvdWdodC1hbWlkLWJpdGNvaW4tZXRmLWVudGh1c2lhc20taXMtNDAwMDAtbmV4dC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Saw 27% October Surge as Traders 'Panic Bought' Amid Bitcoin ETF Enthusiasm. Is $40,000 Next? - CoinDesk",
        "content": "ETFs would be a big deal for bitcoin because they're far easier for the average investor to buy than the cryptocurrency itself or existing bitcoin investment products, like the Grayscale Bitcoin Trust (GBTC) with $21 billion assets under management. The U.S. Securities and Exchange Commission rejected GBTC's conversion into one, but courts have eviscerated that decision, boosting the odds the SEC will have to approve that shift – and likely also bless ETF applications from the likes of BlackRock, the world's largest asset manager."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAxL21pY3Jvc3RyYXRlZ3ktbXN0ci1wb3N0cy1hZnRlci10YWtpbmctd3JpdGVkb3duLW9uLWJpdGNvaW4tYnRjLWhvbGRpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "MicroStrategy (MSTR) Posts After Taking Writedown on Bitcoin (BTC) Holdings - Bloomberg",
        "content": "MicroStrategy Inc., the enterprise-software maker that is the largest publicly-traded holder of Bitcoin, posted a third-quarter loss after taking a writedown because of a decline in the value of the cryptocurrency.\n\nThe Tysons Corner, Virginia-based company’s net loss widened to $143.4 million, or $10.09 a share, from $27 million, or $2.39, in the year-ago period. Revenue from the software business rose about 3% to $129.5 million, above the average forecast of $125.8 million of analysts surveyed by Bloomberg."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tYW5uaXZlcnNhcnktc2F0b3NoaS1uYWthbW90b9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin white paper turns 15 years old - Blockworks",
        "content": "Fifteen years ago today, Satoshi Nakamoto — whose true identity remains a mystery — published their seminal white paper titled “Bitcoin: A Peer-to-Peer Electronic Cash System.”\n\nSpanning just nine pages, this document offered up a blueprint that reimagined the way we perceive and transfer value in a digital age. It delved into the intricacies of cryptographic hashing, the architecture of blocks and the timing mechanisms that would be used to sustain them.\n\nOne of the white paper’s main innovations was its proposed proof-of-work system. While not Satoshi’s invention, its application in the context of a decentralized cryptocurrency was novel. Building upon ideas like Adam Back’s “Hashcash,” the author adapted the preexisting proof-of-work concept in order to address the double-spending problem. This ensured that every transaction on the network was verified through consensus, without relying on a central authority.\n\n“Once the CPU effort has been expended to make it satisfy the proof-of-work, the block cannot be changed without redoing the work. As later blocks are chained after it, the work to change the block would include redoing all the blocks after it,” Nakamoto wrote in the whitepaper.\n\nRead more: Proof-of-work vs. proof-of-stake: Which is better?\n\nThe CEO of Luxor, a firm that provides firmware for bitcoin mining machines and a hashrate derivatives trading platform, called what Nakamoto envisioned “magical.”\n\n“The Bitcoin blockchain is somewhat magical in that it grows stronger as time goes on…which is somewhat against the laws of the universe. As things get older, generally they degrade and break down,” Nick Hansen told Blockworks.\n\n“I think Satoshi probably envisioned that,” Hansen added.\n\nAt present, the bitcoin blockchain has surpassed 522 GB in size, essentially making any attempt at tampering with the distributed ledger a fool’s errand.\n\nHansen said he thinks Nakamoto likely also saw a future where institutions and large companies would be the ones dominating the effort to mine bitcoin, especially as the network grew larger and the computational need grew with it.\n\n“Since Satoshi early on did design this to be a global payment rail, I think it would be foolish to assume that the mining portion of that ecosystem [wouldn’t] probably need to be done by massive institutional grade companies,” Hansen said. “I would say that yes, he probably figured that bitcoin mining would become a massive commodity business.”\n\nNakamoto drew a parallel to gold mining in the “incentive” section of the whitepaper, which detailed how bitcoins would initially circulate. Essentially, “mining” refers to the process of verifying transactions on the network.\n\n“The steady addition of a constant of [sic] amount of new coins is analogous to gold miners expending resources to add gold to circulation. In our case, it is CPU time and electricity that is expended,” Nakamoto wrote.\n\nWhat Nakamoto may or may not have envisioned was how bitcoin could be used to aid those suffering under the reign of dictators.\n\nThe Human Rights Foundation (HRF), a nonprofit championing human rights, views bitcoin as a pivotal weapon against despotism. Its decentralized nature allows those under autocratic regimes to transact outside the confines of government-controlled fiat currency.\n\nFurther championing this cause, the HRF’s Bitcoin Development Fund extends grants to innovators working to improve the bitcoin network. One notable beneficiary was the developer behind lnp2pBot, an initiative that bolsters privacy by enabling users to exchange dollars for bitcoin without the need for KYC (know your customer) identification.\n\nThe HRF’s chief strategy officer Alex Gladstein told Blockworks he’s “much more bullish” on bitcoin these days because of how much easier it is to use it since 2013, when the HRF first started working with bitcoin.\n\n“The apps are better, they have better UX,” Gladstein said. “We have the Lightning Network, which we didn’t have then, so we don’t have to wait around 10 minutes for confirmation and you can send bitcoin (BTC) instantly. We have much better privacy tools than we used to have back then, which is really important for activists.”\n\nGladstein also noted Nakamoto’s curious choice to release the bitcoin whitepaper on Oct. 31. That was the same date Martin Luther nailed his revolutionary 95 theses to a church’s door in protest of Catholicism over 500 years ago.\n\nLuther’s arguments against the church had the first whisperings of the concept of separating religion from the state, whereas the bitcoin white paper argued for the separation of money from the state, Gladstein said.\n\nAnother explanation for the publication date could be that Halloween is quite befitting for someone who later became the most famous masked anonymous figure in all of crypto.\n\nOr, the specific date of Oct. 31 may not have been chosen for any particular reason other than perhaps being timed right around some of the worst declines in the traditional stock market in history.\n\nEither way, Nakamoto’s thoughts, motives and intentions will likely be fertile ground for speculation for years to come.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMDEvY29pbmJhc2UtYml0Y29pbi1ldGhlcmV1bS1idGMtZXRoLWZ1dHVyZXMtdW5pdGVkLXN0YXRlcy_SAWJodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzAxL2NvaW5iYXNlLWJpdGNvaW4tZXRoZXJldW0tYnRjLWV0aC1mdXR1cmVzLXVuaXRlZC1zdGF0ZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Coinbase now lets smaller investors in the U.S. trade Bitcoin and Ethereum futures - Fortune",
        "content": "The largest crypto exchange in the U.S. announced on Thursday that smaller investors, otherwise known as retail traders, are now be able to trade Bitcoin and Ethereum futures on its U.S. platform.\n\nCustomers can access the two new financial products through Coinbase Advanced, an offshoot of the exchange’s main platform that lets investors trade more financially complex crypto products. As opposed to CME, a U.S. derivatives exchange that also sells Bitcoin and Ethereum futures, Coinbase’s offering targets shallower-pocketed traders.\n\n“These contracts offer lower upfront capital requirements and can be an affordable investment option for a broader range of retail customers,” the company wrote in a blog post announcing the products.\n\nCoinbase’s unveiling of a futures contract in the U.S. for both Bitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, comes as the exchange looks to diversify its products to compete with the likes of Binance, the largest cryptocurrency exchange in the world.\n\nFutures allow traders to not only speculate on the future price of an asset but to gamble with more assets than they actually own. Customers can front, for example, $100 as collateral and trade $200 worth of crypto, magnifying their losses and gains as a cryptocurrency’s price waxes and wanes.\n\nBy most estimates, the global trading volume of the crypto derivatives markets, which include futures, far outpaces that of crypto spot markets, or the simple purchase or sale of cryptocurrencies. As of Wednesday, the 24-hour trading volume of crypto derivatives was approximately $37 billion on Binance compared with just about $9 billion in spot, according to CoinMarketCap.\n\nBinance dominates the crypto derivatives market. The 24-hour trading volume of its nearest competitors OKX and BitMart was a little more than a fourth of Binance’s. If its recent product announcements are any indication, Coinbase, which has historically been more willing than Binance to play nice with regulators and avoid risky crypto financial instruments, is looking for a slice of that pie.\n\nIn April, the publicly traded crypto exchange announced that it had obtained a regulatory license in Bermuda. In May, it then launched a Bermuda-based offshore exchange, which specializes in futures. And then, in late September, it opened up its offshore exchange to retail investors.\n\nThe exchange’s most recent unveiling of crypto futures, however, is in the U.S., where it obtained a license to sell the risky financial instruments earlier this year."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTMxL3Nob3VsZC1pLWJ1eS1iaXRjb2luLXByaWNlLWdhaW5zLWZ1ZWwtZW5kb3JzZW1lbnRzLWZyb20tZmluYW5jaWFsLXBsYW5uZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Should I Buy Bitcoin? Price Gains Fuel Endorsements from Financial Planners - Bloomberg",
        "content": "Bitcoin’s climb to $35,000 is helping to restore its reputation in the world of investment advice.\n\nThe world’s largest cryptocurrency has more than doubled from last year’s epic collapse, a significant development when stocks have dropped and bond yields are surging. With the Federal Reserve planning to keep interest rates high, and geopolitical tensions threatening financial stability, some advisors say adding Bitcoin to an investment portfolio can be a good way to diversify."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAxL2JpdGNvaW4tYm91bmNlcy1vZmYtMzUtMDAwLWFmdGVyLXRvcHBpbmctdGhlLW1vc3QtcmVjZW50LWhpZ2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Bounces Off $35000 After Topping the Most Recent High - Bloomberg",
        "content": "Bitcoin rose back to a more than 17-month high amid hopes the Federal Reserve is done with interest-rate hikes and expectations that a fresh source of demand is brewing in the exchange-traded fund industry.\n\nThe largest digital token added 4% in the past 24 hours and traded at $35,840 as of 10:53 a.m. in Singapore on Thursday. Some smaller coins climbed, including the Solana network’s SOL token, which is up 142% to $42 since mid-September."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMTAvMzEvMTUteWVhcnMtYWZ0ZXItdGhlLWJpdGNvaW4td2hpdGUtcGFwZXItYml0Y29pbi1idWlsZGVyLWN1bHR1cmUtZmxvdXJpc2hlcy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzEwLzMxLzE1LXllYXJzLWFmdGVyLXRoZS1iaXRjb2luLXdoaXRlLXBhcGVyLWJpdGNvaW4tYnVpbGRlci1jdWx0dXJlLWZsb3VyaXNoZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "15 Years After the Bitcoin White Paper, Bitcoin Builder Culture Flourishes - CoinDesk",
        "content": "While many are celebrating the arbitrary movement of time that has passed since the document was sent loose, today I want to reflect on how Satoshi could have known that we needed this invention and how to carry on his legacy."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDEvZmVkZXJhbC1yZXNlcnZlLWxlYXZlcy1yYXRlcy11bmNoYW5nZWQtYml0Y29pbi1mbGF0LWF0LTM0NWsv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8wMS9mZWRlcmFsLXJlc2VydmUtbGVhdmVzLXJhdGVzLXVuY2hhbmdlZC1iaXRjb2luLWZsYXQtYXQtMzQ1ay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Federal Reserve Leaves Rates Unchanged; Bitcoin Flat at $34.5K - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzAyL2JpdGNvaW4tcHV0LW9wdGlvbnMtd2hpY2gtb2ZmZXItZG93bnNpZGUtcHJvdGVjdGlvbi1sb29rLXVudXN1YWxseS1jaGVhcC13aWxsLXRoZS1zaXR1YXRpb24tbGFzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Put Options, Which Offer Downside Protection, Look Unusually Cheap. Will the Situation Last? - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcGVyZm9ybWFjZS1vY3RvYmVyLWJ1bGxpc2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin golden cross appears following largest monthly gain in 9 months - Blockworks",
        "content": "Bitcoin has snapped off its second-largest monthly gain this year as the asset begins a new phase of upward momentum, analysts speculate.\n\nThe world’s largest digital asset is trading at $34,545 — up less than 1% on the day after clawing back losses from a swing low from $34,000, exchange data shows.\n\nBitcoin’s performance for October is one of the year’s best month’s after rising more than 28% following a period of low volatility in the third quarter. Only the month of January — a 40% increase — stands out as a better performer in 2023.\n\n“Volatility levels for bitcoin (BTC) and ether (ETH) have shown signs of maturation for the asset class, as the typical investor profile steadily shifts to be more institutional and less retail-oriented,” Pedro Lapenta, head of research at Hashdex said.\n\n“BTC has historically rewarded investors that have allocated to the asset when its volatility is low.”\n\nIn a notable development for traders and analysts, October’s upward trajectory in the market has culminated in a technical “golden cross” on the daily chart.\n\nRead more: A crypto perfect storm? Bond yields, ETF news collide with bitcoin rally\n\nThe bullish signal occurs when a short-term moving average, such as the 100-day, crosses above a long-term moving average, such as the 200-day.\n\nHistorically, a golden cross is viewed as a strong indicator of a looming upward trend and is often accompanied by increased trading volumes.\n\nMatteo Greco, research analyst at publicly listed digital asset and fintech investment firm Fineqia International noted bitcoin’s outperformance relative to other digital assets.\n\nWith its dominance climbing by 1.7% over the last seven days, marking the fifth consecutive week of growth, bitcoin ended the week at over 54%.\n\nBTC’s strong influence is also evident in the total digital assets market cap, which currently stands at $1.33 trillion. This is similar to the figure recorded in mid-July at $1.22 trillion, Greco added.\n\nRead more: Financial pros mull allocation boosts to ‘chaos-resilient’ BTC: Bitwise\n\n“Despite the current price increase, the total market cap remains comparable to when BTC price peaked at around $31,500, signaling that the recent surge in BTC price is more about a shift of capital from altcoins to bitcoin rather than a net inflow,” Greco said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LnRhaG9lZGFpbHl0cmlidW5lLmNvbS9uZXdzL2dvb2QtYml0Y29pbi1uZXdzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Good bitcoin news | TahoeDailyTribune.com - Tahoe Daily Tribune",
        "content": "David Vomund\n\n\n\nLong-time readers know that I don’t like crypto currencies. Never have. I am not a fan and don’t recommend (or own) volatile securities that are all “perceived value” and backed by nothing. Plus, it’s not easy to buy them, though that may be about to change.\n\nWhen you buy a crypto currency you are putting your trust in an unregulated business (hello FTX), you’d better not forget your password, and you or your holding company better not get hacked. There is no FDIC or SIPC protection.\n\nAlternatively, one can invest in a bitcoin exchange-traded fund (ETF) like ProShares Bitcoin Strategy ETF (BITO). But that fund invests in bitcoin futures contracts instead of bitcoin and rolling over futures contracts as they expire is expensive. As an example, the S&P 500 is where it was one year ago. But the ProShares Short S&P 500 (SH), which also uses futures contracts, has lost 8 percent over the same period. Shouldn’t it be unchanged as well?\n\nHere’s the good news for those who own or want to buy bitcoin: The SEC may be close to approving bitcoin ETFs that will track the spot price instead of the futures price. Several ETF providers have already submitted applications. They include BlackRock, the world’s largest asset manager, Invesco, ARK, and others.\n\nWhat will happen to bitcoin’s price if/when a spot bitcoin ETF is approved? With bitcoin rallying above $35,000 it is already getting priced in. But this could be early innings if bitcoin ETFs are approved.\n\nOnce there are spot bitcoin ETFs then any investor with a brokerage account can buy bitcoin just as they would a stock or an index fund. Many will choose to do so with a portion of their money. More demand means higher prices. Those that own bitcoin now will welcome the news.\n\nIt is ironic that cryptocurrencies began as a way to avoid large financial institutions and regulations, but soon enough the world’s largest financial companies, all of which are highly regulated, will dominate the bitcoin marketplace.\n\nThe introduction of spot bitcoin ETFs should boost prices as more people participate. Eventually, however, investors will realize that there is nothing but perceived value backing the holdings. It has no earnings and it pays no dividends. Those who buy simply hope to sell it later to someone at a higher price. That’s the Greater Fool Theory. Owning bitcoin as a trade based on potential new ETFs is fine. But long term you can count me out.\n\nDavid Vomund is an Incline Village-based Independent Investment Advisor. Information is found at http://www.VomundInvestments.com or by calling 775-832-8555. Clients hold the positions mentioned in this article. Past performance does not guarantee future results. Consult your financial advisor before purchasing any security."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMTAvMzEvYml0Y29pbi0yMDA4LXNhdG9zaGktbmFrYW1vdG9zLWJ1c3ktZmV3LW1vbnRocy1idWlsZGluZy10aGUtcmV2b2x1dGlvbmFyeS1wMnAtZWxlY3Ryb25pYy1jYXNoLW5ldHdvcmsv0gGhAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMC8zMS9iaXRjb2luLTIwMDgtc2F0b3NoaS1uYWthbW90b3MtYnVzeS1mZXctbW9udGhzLWJ1aWxkaW5nLXRoZS1yZXZvbHV0aW9uYXJ5LXAycC1lbGVjdHJvbmljLWNhc2gtbmV0d29yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin 2008: Satoshi Nakamoto’s Busy Few Months Building the Revolutionary 'P2P Electronic Cash' Network - CoinDesk",
        "content": "Bitcoin abstracted away the trust that is inherent in the modern money system, where banks and other financial institutions keep track of all the transactions that flow through and ultimately decide which were valid and who could use the system. Bitcoin is as much a public broadcast system as it is a currency network, which allows anyone, anywhere to validate and verify the blockchain on their own."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2FiZDQyODNkLWVlN2QtNDFhMi05NDI2LTQyYjlkM2UxMjljZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin: trial of SBF is no match for ETF enthusiasm - Financial Times",
        "content": "Print this page\n\nThe collapse of cryptocurrency exchange giant FTX marked the depths of the crypto downturn. Yet the ensuing trial of founder Sam Bankman-Fried, accused of defrauding customers, has not dragged crypto prices down further. Despite negative publicity, the price of bitcoin has doubled in the past year.\n\nThis has been attributed to two things. In early 2024, rewards for bitcoin miners are expected to drop by 50 per cent. The result is a tightening of supply that could lift prices. At the same time, the US could be on the cusp of regulatory action that confers new legitimacy on to digital assets.\n\nNext year, bitcoin buyers expect the US Securities and Exchange Commission to give BlackRock and other financial companies permission to launch exchange traded funds that invest directly in bitcoin. This, they believe, could spur more adoption by institutional investors and act as a challenge to nefarious, unregulated crypto platforms.\n\nBoth assumptions are wrong, even if the SEC grits its teeth and grants approval. ETFs may be more appealing than setting up wallets and buying tokens directly from unregulated exchanges, but their existence does not eliminate scams and volatility that investors find off-putting. When ProShares launched the first ETF that tracked contracts speculating on the future price of bitcoin in late 2021, bitcoin prices rose. The ETF finished its first day of trading at close to $42. It now trades at $17.50.\n\nThe global cryptocurrency market cap has fallen from a $3tn market cap to about $1.3tn. Elon Musk, an outspoken supporter of digital assets, has not opted to expose his electric car company Tesla to further price swings. Tesla invested $1.5bn in bitcoin in early 2021 to “maximise returns on our cash”. At the last count, its digital assets were just $184mn.\n\nLiquidity is in short supply. Remaining platforms are under pressure from regulators. Trading volumes at Coinbase, the largest US digital asset platform, fell 55 per cent in the first six months of the year. Without a supply of new money, the latest price rally is unsustainable."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0xMC0zMS9iaXRjb2luLXMtYnRjLWV0Zi1tb21lbnR1bS1pcy1zcHVycmluZy10aGUtYmlnZ2VzdC1tb250aGx5LWdhaW5zLXNpbmNlLWphbnVhcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's ETF Momentum is Spurring the Biggest Monthly Gains Since January - Bloomberg",
        "content": "Fifteen years after the unofficial launch of Bitcoin, digital-asset enthusiasts are touting the cryptocurrency as finally being on the verge of mainstream acceptance.\n\nBitcoin has rallied about 27% in October, the biggest monthly increase since January, on surging expectations that the US Securities and Exchange Commission may soon approve exchange-traded funds that invest directly in the cryptocurrency after more than a decade of deliberation. Bitcoin was trading at around $34,450 on Tuesday, compared with $16,540 at the end of last year."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmRhbGxhc25ld3MuY29tL25ld3Mvd2F0Y2hkb2cvMjAyMy8xMS8wMS90ZXhhcy13ZWFycy10aGUtY3Jvd24tYXMtdGhlLWJpdGNvaW4tbWluaW5nLWNhcGl0YWwtb2YtdGhlLXdvcmxkL9IBhAFodHRwczovL3d3dy5kYWxsYXNuZXdzLmNvbS9uZXdzL3dhdGNoZG9nLzIwMjMvMTEvMDEvdGV4YXMtd2VhcnMtdGhlLWNyb3duLWFzLXRoZS1iaXRjb2luLW1pbmluZy1jYXBpdGFsLW9mLXRoZS13b3JsZC8_b3V0cHV0VHlwZT1hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Texas is Bitcoin mining capital of the world but apprehension exists - The Dallas Morning News",
        "content": "Congratulations, Texas! Forget your poor rankings compared to other states for education, health services and environmental quality.\n\nYou are now number one!\n\nAdvertisement\n\nIt’s official. Texas is the bitcoin mining capital not only of the United States, but also of the entire world.\n\nAdvertisement\n\nAbout half of all bitcoin mining in the U.S. is Texas-based, and that’s enough to propel Texas to the No. 1 world leader.\n\nWatchdog Alert Are you a taxpayer in Texas? The Watchdog has your back. SIGN UP Or with: Google Facebook By signing up you agree to our Terms of Service and Privacy Policy\n\nFor some reason, many Texans are not celebrating. Rather, they’re confused, wondering if this is a good thing, especially with its impact on our fragile ERCOT-run electricity grid.\n\nThey are fearful of grid strain and anxious about the lack of transparency in the new industry. They are baffled by the millions of dollars of profit some mining companies earn when they sell electricity back. Companies can also earn millions of dollars in energy credits by voluntarily shutting down in a crisis.\n\nAdvertisement\n\nHere’s a sampling of The Watchdog’s mail:\n\n“Watchdog, we have heard nothing about these enormous electricity consumers being asked and complying with closing their operations during this 2023 exceptionally hot summer. Many of us have been asked to conserve electricity.” — Sid Harris of Richardson.\n\n“[Bitcoin miners earning millions by selling back unused power, often at a profit] is inexcusable while we Texans are faced with skyrocketing electric bills. How about using millions to shore up the system for all of us, rather than lining the pockets of energy hogs?” — Janice White of Southlake.\n\nAdvertisement\n\n“[I’m worried about] all the mining companies pouring into Texas and draining the electrical power we have, as well as overloading our power grid. ERCOT just seems to be wheeling and dealing with these companies.” — Charles Coleman of Euless.\n\nAdvertisement\n\n‘Undue attention’\n\nRecent headlines about companies making big profits “attracted undue attention,” says Lee Bratcher, president of the Texas Blockchain Council, the trade group for the new industry.\n\n“Bitcoin miner pockets $7 million. Firm rewarded for cutting power during heat wave.” – The Dallas Morning News\n\nAdvertisement\n\n“Texas paid a Bitcoin miner $31.7 million to use less electricity during the state’s hottest month.” – Texas Monthly\n\nStory behind headlines\n\nYes, ERCOT paid Riot Platforms $7.4 million for reserves for cutting power in August. This was done, I’m told by members of the industry, to support grid reliability during the summer heat wave. The company also sold about $24 million of pre-purchased unused energy back to its provider, TXU.\n\nFor power shutdowns in September, the company received $2.5 million. Plus, the company earned $11 million in energy credits for future bills.\n\nAdvertisement\n\nThe Colorado-based company makes public disclosures because it’s a publicly traded company. Riot’s biggest plant in Texas is in Rockdale. It’s building another data center in Corsicana.\n\nHere is what’s fascinating about this. By voluntarily curtailing its power usage during the heat wave in September, Riot said it doubled the revenue it would have received from mining.\n\nAs Dallas Morning News staffer Irving Mejia-Hilario reported, “Riot mined 362 bitcoin [in September], but the money it earned from its deals with ERCOT and TXU equates to approximately 511 bitcoin, the company said.”\n\nBratcher says, “These market mechanisms are not unique to bitcoin miners. Bitcoin miners do not receive any special treatment or subsidies from the state of Texas, ERCOT or anyone else.”\n\nAdvertisement\n\nHe says all industrial and commercial industries can sell back unused power. One difference is where it might take a manufacturing facility hours to shut down in an emergency, a bitcoin miner can pull the plug in several minutes.\n\nHe says reliable, constant power usage by bitcoin miners brings stability to the grid, especially during low-demand times of day.\n\nBitcoin mining accounts for about 2-3% of industrial power usage in the state. That’s why Bratcher says those headlines flabbergasted him.\n\nFor all industrial usage, ERCOT’s payouts were close to $1 billion for August, he said, with bitcoin mining a very small part of that.\n\nAdvertisement\n\nMining, he said, brings to a community tax revenue, jobs and power consumption that electricity companies possibly couldn’t sell.\n\nLee Bratcher is President of the Texas Blockchain Council. (WATCHDOGSUN_2023_1105 / Courtesy of Texas Blockchain Cou)\n\nThe China concern\n\nU.S. and Texas growth in mining has China to thank. China banned bitcoin operations, causing companies and investors to find new locales.\n\nAdvertisement\n\nTexas, with its permissive regulatory environment, tax incentives and cheap power available to miners, launched a successful campaign to lure miners here.\n\nThe New York Times found that Chinese nationals are among the owners of U.S.-based companies. In Texas, two companies — Bitdeer and Poolin — are Chinese-owned, the Times reported.\n\nI asked Bitdeer about this. A spokesman said Bitdeer is not a Chinese company. “Bitdeer was founded in and is headquartered in Singapore,” he said. “We are a company with global operations, and we are glad to have had a presence in Texas since 2018. Also, as a Nasdaq-listed company we are subjected to the same regulatory scrutiny as any other company listed in the United States.”\n\n“Any indication that we are influenced by or connected to the Chinese government is false and wrong.”\n\nAdvertisement\n\nThe Times reported an owner of the company left China to set up shop in Singapore.\n\nThe Texas Infrastructure Protection Act prohibits citizens of China, Iran, North Korea and Russia from any connection with critical infrastructure. Bratcher cited a 2022 Texas attorney general ruling that said as long as foreigners from those countries do not have “direct or remote access to or control of critical infrastructure” there’s no violation of the act.\n\nThe law was signed by Gov. Greg Abbott in 2021.\n\nI wrote to the governor’s office asking if he is concerned about Chinese ownership in relation to the law. The Watchdog didn’t hear back.\n\nAdvertisement\n\nLack of transparency\n\nWhen Denton Municipal Electric signed a contract with Core Scientific to lease space at its plant for a small-scale mining operation, city officials expected millions of dollars for city coffers.\n\nCore Scientific filed for bankruptcy. While it’s still operating in Denton, expected earnings have dropped.\n\nI criticized the secrecy of the contract between city and company. Details of the plan were redacted.\n\nAdvertisement\n\nI don’t know what the kWh rate Core Scientific pays DME for electricity. But during my research for this Watchdog report, I found that some mining companies have long-term contracts with their electricity providers to pay as low as 2 cents a kWh. Must be nice.\n\nIn the city of Denton's 2021 agreement with crypto mining company Core Scientific, key details are redacted.\n\nScrutiny? What scrutiny?\n\nHere’s proof how unregulated the industry is: It wasn’t until September that bitcoin companies were even required to register with the state.\n\nAdvertisement\n\nThat’s a long time to get such a free ride from regulatory scrutiny. Oh, no. Wait. What scrutiny?\n\nWhat’s next?\n\nERCOT has convened a task force to consider rule changes that could beef up requirements for all industrial and commercial customers, including bitcoin miners.\n\nUsers would have to disclose information about their energy usage and power shutdowns. Bratcher says the rule change could make the shutdown process “more methodical.”\n\nAdvertisement\n\nReader Bob Gibson of Carrollton tells me, “As much as I am glad to see new methodology for grid reliability with these developments, I don’t see any way the consumer is going to be getting any break in their rates because of it.”\n\nEnergy analyst company Wood Mackenzie writes in a report that “by our calculations, bitcoin mining already raises electricity costs for non-mining Texans by $1.8 billion per year or 4.7%. These figures are conservative.”\n\nStill to be decided: Will consumers benefit?\n\nIf matters go as they have been in this long-running state electricity crisis, who will pay the biggest cost?\n\nAdvertisement\n\nYou will.\n\nBecome a citizen of Watchdog Nation.\n\nJoin Dave Lieber and learn to be a super-consumer.\n\nAdvertisement\n\nWatchdog newsletter: Sign up for The Watchdog’s FREE weekly newsletter to keep up: click here.\n\nSubscribe: PLEASE support The Watchdog’s brand of straightforward journalism designed to save you time, money and aggravation. Treat yourself to a digital subscription (and make him look good!) by visiting https://dallasnews.com/subscribe\n\nWatchdog Home Page: You can’t afford to miss The Watchdog’s two reports each week. Follow our latest reporting always at The Watchdog home page which features all recent columns.\n\nWatch this free training video from Dave: https://youtu.be/uhUEUCNKGjc\n\nAdvertisement\n\nFacebook: Connect with The Watchdog on our Facebook group. Search for “DallasNews Watchdog Posse.”\n\nThe Dallas Morning News Watchdog column is the 2019 winner of the top prize for column writing from the National Society of Newspaper Columnists. The contest judge called his winning entries “models of suspenseful storytelling and public service.”\n\nRead his winning columns:\n\n* Helping the widow of Officer J.D. Tippit, the Dallas police officer killed by Lee Harvey Oswald, get buried beside her late husband\n\nAdvertisement\n\n* Helping a waitress who was harmed by an unscrupulous used car dealer"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzAxL2JpdGNvaW5zLXNhZmUtaGF2ZW4tc3RhdHVzLWJvbHN0ZXJlZC1ieS10cmVhc3VyeS11bmRlcnBlcmZvcm1hbmNlLW1vaGFtZWQtZWwtZXJpYW4tc2F5cy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8wMS9iaXRjb2lucy1zYWZlLWhhdmVuLXN0YXR1cy1ib2xzdGVyZWQtYnktdHJlYXN1cnktdW5kZXJwZXJmb3JtYW5jZS1tb2hhbWVkLWVsLWVyaWFuLXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin’s Safe Haven Status Bolstered by Treasury Underperformance, Mohamed El-Erian Says - CoinDesk",
        "content": "At 4.9%, the yield on the U.S. 10-year Treasury note is at least ten basis points higher than where it was a day before Hamas attacked Israel on Oct. 7. In other words, the price of the 10-year note has declined, a sign of investors seeking safety in other assets. Bitcoin has risen 23% to $34,460 since Oct. 7."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY291bGQteW91LWhhdmUtd29uLTEwMDAwLWJpdGNvaW4tYWxleC1qb25lcy1taXNzZXMtb3V0LW9uLSQzNDRtLXByaXplLWluLW1heC1rZWlzZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Could You Have Won 10000 Bitcoin? Alex Jones Misses Out On $344M Prize In Max Keiser's Crypto Quiz - Nasdaq",
        "content": "Infowars host Alex Jones failed to answer any of the questions in a Bitcoin (CRYPTO: BTC) quiz, missing out on a chance to win 10,000 BTC, equivalent to $344 million.\n\nWhat Happened: The quiz, set by Bitcoin maximalist and Orange Pill podcast host Max Keiser, aimed to test Jones’ knowledge about the leading cryptocurrency.\n\nDuring the Bitcoin challenge, Jones failed to provide accurate responses to any of the five questions posed by Max Keiser. The difficulty became apparent from the outset as Jones stumbled through each question.\n\nAfter Jones passed on the first question, Keiser said, “You’ve lost this quiz already; you can’t even get a simpler question than that.”\n\n🔥🔥🔥 @MaxKeiser gives Alex Jones a simple 5 question #Bitcoin quiz for 10,000 #BTC's ($350,000,000 USD) 🤯 pic.twitter.com/3XL6DXJQbk\n\n— Crypto News Alerts 🔥🎙 (@CryptoNewsYes) October 31, 2023\n\nThe questions presented by Keiser during the Bitcoin challenge encompassed key aspects of the cryptocurrency landscape.\n\nThey included questions about the total number of Bitcoins in existence, the frequency of difficulty adjustments, the core hashing algorithm’s name, the average block formation rate, and whether Craig Wright is Satoshi Nakamoto — the pseudonymous creator of Bitcoin.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Jones disclosed in 2021 that he had lost the laptop containing the generous gift of 10,000 Bitcoins given to him by Keiser. During an appearance on the Flagrant 2 show with Andrew Schulz and Akaash Singh, Jones confessed that Keiser had presented him with the laptop containing 10,000 BTC a decade ago.\n\nEarlier in September, Keiser made critical remarks about crypto influencer Ben Armstrong. “My advice to crypto boy is to get to a shi*coiners Anonymous (SA) meeting and get off the shi*coin crack pipe as soon as you can. It doesn’t get better. If you keep OD’ing on shi*coins your life can only get worse. SHI*COINS ARE POISON. Look what they did to this poor guy.”\n\nPrice Action: At the time of writing, Bitcoin was trading at $34,281 up 0.20% in the last 24 hours, according to Benzinga Pro.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\nImage created via photos on Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provideinvestment advice All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAxL3NheWxvci1zLW1pY3Jvc3RyYXRlZ3ktbXN0ci1xdWVzdGlvbnMtb3duLWJpdGNvaW4tcHJlbWl1bS13aXRoLWV0ZnMtbG9vbWluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Proxy MicroStrategy Questions Own 'Premium' With ETFs Looming - Bloomberg",
        "content": "MicroStrategy Inc. Chairman Michael Saylor’s strategy of buying Bitcoin may be coming into question as the advent of exchange-traded funds holding the largest cryptocurrency appears imminent.\n\nSaylor has turned the once struggling software company into a Bitcoin proxy for equity investors by accumulating more than $5.5 billion of the cryptocurrency since the middle of 2020. During that time, shares of MicroStrategy have more than tripled as Bitcoin surged in value. The benchmark Standard & Poor’s 500 Index gained about 40% during the same period."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLW91dGxvb2stMTUwMDAwLXNwb3QtZXRmLWhhbHZpbmctY3ljbGUtY3J5cHRvLW1pbmluZy0yMDIzLTEw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Will Soar 337% to $150,000 by Mid-2025 Amid New Cycle: Bernstein - Markets Insider",
        "content": "Bitcoin could soar 337% to hit $150,000 by mid-2025, according to analysts at Bernstein.\n\nWhile April's halving will reduce supply, demand will jump on the potential approval of spot bitcoin ETFs.\n\n\"You may not like bitcoin as much as we do, but a dispassionate view of bitcoin as a commodity suggests a turn of the cycle.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin will soar 337% to $150,000 by mid-2025 as the world's largest cryptocurrency begins a new cycle, according to analysts at Bernstein.\n\nIn a note initiating coverage of crypto miners, Bernstein said bitcoin is on the brink of potentially big industry market moves, including bitcoin's upcoming halving and the likely approval of the first spot bitcoin ETFs.\n\n\"You may not like bitcoin as much as we do, but a dispassionate view of bitcoin as a commodity suggests a turn of the cycle,\" the report, led by Global Digital Senior Analyst Gautam Chhugani, said. \"A good idea is only as good as its timing.\"\n\nAccording to the note, bitcoin historically has rallied whenever there's a halving, a predetermined event in which the amount of bitcoin received for mining the crypto is slashed. This happens every four years, with the next halving set for April 2024.\n\nAdvertisement\n\nAs halving essentially cuts down on bitcoin supply, crypto miners are less likely to sell accumulated tokens, because they anticipate higher future prices. Already, 70% of bitcoin tokens have not sold in the last 12 months, Bernstein pointed out.\n\nAt the same time, the currency is undergoing increased demand from new buyers, especially with the Securities and Exchange Commission expected to approve spot bitcoin ETFs soon.\n\nThough the SEC originally tried to block such efforts, its rejection of a Grayscale crypto ETF was defeated in court in August, potentially paving the way for a regulatory turnabout.\n\n\"We expect US regulated ETFs to be the watershed moment for crypto and we expect a SEC approval by late 2023/Q1, 2024,\" Chhugani wrote. \"Post halving, we expect the bitcoin spot demand via ETFs to outstrip miner selling by 6-7 times at peak. We expect bitcoin ETFs to be equivalent to 9-10% of spot bitcoin in circulation by 2028.\"\n\nAdvertisement\n\nAnalysts expect bitcoin to rally into the ETF approvals and the initial post-approval response, followed by some profit-taking going into halving, then a \"major inflection\" after halving.\n\nHalving will also have implications on the crypto mining industry, leading to more consolidation. As the amount of rewarded tokens drops, high-cost miners will face the most pressure, and the least efficient of them will likely not survive, leading to consolidation.\n\nInstead, Chhugani points investors towards two miners worth paying attention to: Riot and CleanSpark.\n\nCalling them a \"high-beta way to gain exposure,\" the note cited their low power cost in mining tokens, high liquidity, and unlevered balance sheets. Both were given outperform ratings."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2lucy1wcmljZS1yYWxsaWVkLTI4cGVyY2VudC1pbi1vY3RvYmVyLWFzLWNyeXB0by1yYWxseS13aWRlbmVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin's Price Rallied 28% in October as Crypto Rally Widened - CoinDesk",
        "content": "Bitcoin gained roughly 28% in October. Its strongest showing since January as the crypto rally widened. Joining us now to discuss this coin desk indices. Head of research, Todd Groth, welcome back, Todd October. Indeed for Bitcoin historically, it's been a very seasonally positive month for for the crypto assets, Bitcoin up 28 Ethereum up eight broad CM I coin desk market index of about 21. So it was really out performance of a Bitcoin um underperformance on a relative basis of Ethereum, but pretty broad gains indeed across the market. Let's take a look at some of the sectors we break down this coin desk coin desk breaks down into roughly six sectors. Here. Talk about that. Uh Yeah, so uh on a relative basis, uh again, had uh uh Bitcoin and with that, it's in the currency sector uh that uh that was the outperformer as well as the computing. That was I apologize. Uh Bitcoin is the largest component of that currency sector. Correct? Exactly. So these sectors are market cap weighted and because of the market capitalization of Bitcoin relative to others in the currency sector, it really has a large impact on that sector which, which, which drove it to be the relative performance gainer of across the sectors. Computing was up 23 as well. The biggest component there is chain link which was also up 41 on the on the month as well. Where is that on currencies or computing? Uh No, that's a smart contract platform that was a relative under performer only up nine and then D five D five sector as well was up one digitization slightly slightly negative down to really almost all sectors positive for the month. So if you think about it broadly, the gains were shared across the whole space but definitely currency and computing holding larger gains due to the presence of Bitcoin and chain link within computing, correct me if I'm wrong. But I think this is one of the first times in a while that we've seen so much green when we look at these sectors, how does this compare to previous months? Uh Yeah, it's, it's uh the correlations across across tokens have uh have have have tightened a bit. So really we're having much more trading like the like a whole sector up and down. And that's, that's partially because of Bitcoin. Bitcoin being the largest. If you look at from market cap weighted lens, it's going to contribute more. But it's also it's a bit of the gravity of the whole market as what we see across the cycle. Generally. Bitcoin leads tokens upwards through a cycle, then once you get to closer to the peak of the cycle, then you have investors make some side bets away from Bitcoin into the alt coin season as it's referred to. So it's just seeing that the strong upward upside correlation Bitcoin sort of dragging up the space currently. 11 alt coin Solana, formerly known as Sam's coin. Yeah, I mean, it's not, it was never actually the name, of course, but that was definitely the nickname. Uh It, it's, it's been rallying for a while now. Not just in October September 2. I there have been some times here where uh we, we're, we're seeing kind of AAA resurrection of Solana even though it's far down from where it was at its peak. So can you explain what's going on here? Is it a dead cat bounce or what's the excitement now around Solana? If there is any real excitement? Yeah, it's, it's, it's just been, it's a combination of sentiment getting better because sentiment was so bad earlier. It started last year, for instance, with the F TX collapse last fall. I can't believe it's been a year now. So initially it was, oh, here's, here's some of FX tokens, here's a Sams Token. It, it's going to be an orphaned project that no one will build on. Well, in January, February, we saw a fairly big rebound as people were selling off at the end of the year to harvest some of those losses. And then, so you had sort of a reversal initially. And then over time, it's the network, the community is still building, it is still growing. And I think the combination of showing that there is underlying support, the community is still thriving. It's not what it used to be, but it is, it continues to build. And II, I almost think that this, what happened in October was with the FTX trial, there was a bit of a, as a risk premium, you know, sort of like what, you know, what, what if there was something that was disclosed during the, during the process that might have a negative impact on the token? I think as we've kind of gotten to near the end of the trial, investors are realizing that that sort of the F TX SBF Association with Salon is a bit of a thing of the past and, and with that, they are still holding developer conferences, people are still building on it and it doesn't seem to be going away. It's almost, it's almost better now because in itself being an orphan project, it doesn't have an association anymore going forward. So I think that's actually to the benefit of the community. If we zoom out now, how would you characterize the broader macroeconomic environment? Sure. Yeah, it's challenging out there in the equity market was down for the month, both the S and P the tech heavy NASDAQ bonds down too. Uh You know, I just searched this morning. I like to, I like to look at what a balanced equity bond portfolio would do since a lot of investors, most investors, if you don't, if you don't configure your 401 by default, you're put into a balanced stock bond fund. That's been down 2% this month, down 7% over the last three months. It's this idea of this traditional stock bond portfolio mix. It's a bit broken now with rising yields with valuations fairly high across the equity market. So investors are looking for what, what real assets can I can I can I put my money into gold for the month. Gold was up nine. So you know, Bitcoin, Bitcoin up multiples of that, but both in a similar direction. Um also positive that Bitcoin is decoupling from both equities and interest rates. I know earlier earlier this year when we saw interest rates rise be, oh no, that's going to be bad for Bitcoin or are the dollars rising? That's bad for Bitcoin. It seems like now we coupled from both equities and equity risk sentiment as well as interest rates. So that's a very positive development as well. Is that long term though, I mean, is it or is this, has this been a short term change in in correlation for at least uh due to other factors that might not necessarily be interest rate related? And at the end of the day, crypto remains particularly Bitcoin. The market cap of Bitcoin is smaller than many companies on the S and P 500. So, are there other factors involved in how people invest in crypto that might not be macro related that might be very specific to moving money around, for instance, has been charged? And um I is this is sort of trying to read too much into the risk uh into whether or not the risk is no longer the, the story with crypto. That, that, that's a great question. You know, we, we are all, all the price sectors has been on fairly low volume. I think what we really tell as whether or not we've decoupled is if, you know, unfortunately, if we have a big risk off event, where will the, where will that knee jerk response go of investors? Where will they flee to? Will it be crypto? It could be the volatility of crypto has decreased again, similar similar to the off of low volume. So you take that with a grain of salt. Um But yeah, I think that's, that's, that's a great question. I think with the, with the, with the Israeli Gaza conflict that was showing a bit of event risk, which was positive for gold and Bitcoin did rally sort of during that and after that on that. But it's also, it's also been clouded with the, with the, uh with the spot ETF the, the, the march towards the spot ETF also more, more shoutouts from large investors in TRD, Larry Fink, Mohammed El Arian was even saying Bitcoin is an alternative to bonds. Stanley Druckenmiller also, I don't own Bitcoin, but I should. Um so he, he said that and, and I look at that and I'm like, well, OK, as an investor, you, you, you try to remove your bias of previous uh returns because you have to kind of always look forward into what the investment will bring in the future. So for him to say that and not act, what would the Stanley but in all seriousness, what would, what would stop him from looking forward and saying there's too much risk on the table and, and, and I think the other thing too, as you mentioned, some of the the factors there are major players that you just mentioned, Iran and Russia, notably uh players in, in crypto, whether whether we like to admit it or not that are involved at least on some level with uh uh with the price of, of things such as Bitcoin is that, do, do you think that that's kind of a thought that some investors have uh kind of ghoulishly if you will, that these players will, will act in Bitcoin? Oh A as as in because some state actors that are, are have less than stellar reputations are also in Bitcoin. They don't want to be associated as investors, they do want to be associated because you know, people are degenerates. Um um, and that's a badge of honor and crypto. Uh But, but it's this idea that, you know what if these, if these guys are going to, if they're going to try to fund some of their uh war using Bitcoin, let's jump in on that train. Oh, yeah. Well, I mean, it, it does bring up because Bitcoin gold, there are only a few ways to kind of invest in non sovereign and non sovereign denominated assets. So in, in that sense, it is a bit of a of an escape valve from, from what continues to be kind of increasing debt and debt interest rate burdens in the developed economies. Yeah, it is, it is back to your comment. It is interesting that, you know, someone like Dr and Miller who I it it's, you know, I would put pass to easily be able to invest in Bitcoin, but just sort of that passing comment I should is interesting. Um But yeah, I think as unfortunately, uh if, if political strife increases more uncertainty increases, it's going to be viewed as a, as a, as a a fungible global hedge is to to at least have some in crypto. We've seen that in Argentina Turkey, any, any sort of country with a weak, weaker currency has is having greater Bitcoin adoption. So it is in some sense that sort of that passport, international passport of value as gold is. But you know, if it's gold physical. Well, you got to lug those bars around. So it makes a little less than ideal of moving money across borders, Todd. We just saw the Bitcoin trend indicator. While you were speaking, we also have the ether trend indicator to throw up on the screen, talk about, talk to us about what we are seeing here. So most most of October, we saw a strong positive indication from Bitcoin trends and that's just on the back of the strong price action of the asset. Well, we had a bit of a neutral, initially, initially negative, a slight negative, neutral. Now it's a slight positive on Ether. So it's interesting that we are seeing that Bitcoin kind of run away from Ethereum over the last few weeks. Now both have positive trends, albeit Bitcoin has a stronger trend currently. So it would be interesting to see that sort of that bit e spread to see if we, if we come back to kind of more more average average levels. Um kind of with that Bitcoin dominance is now even even higher than it was over the summer. We're now 40 54% in October in the previous high over the last two years was 52 in June. So increased, increased enthusiasm on a relative basis for Bitcoin. And I think really, it's on the back of much more, much more, much more shout outs across, across the traditional financial markets and that enthusiasm for this body"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9iaXRjb2luLXByaWNlLXRvLTQwMDAwLWFmdGVyLWZlZC1yYXRlLWFubm91bmNlbWVudC1rZXktaW5kaWNhdG9ycy0xMzg1NDY40gFlaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2JpdGNvaW4tcHJpY2UtdG8tNDAwMDAtYWZ0ZXItZmVkLXJhdGUtYW5ub3VuY2VtZW50LWtleS1pbmRpY2F0b3JzLzEzODU0Njg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Price to $40,000 After Fed Rate Announcement? —Key Indicators - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXdoaXRlLXBhcGVyLWFubml2ZXJzYXJ5LWNyeXB0by1zYXRvc2hpLW5ha2Ftb3RvLXNwb3QtZXRmLTIwMjMtMTDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "The Bitcoin White Paper Is 15 Years Old. Here's What It Is. - Markets Insider",
        "content": "The bitcoin white paper was published 15 years ago by Satoshi Nakamoto.\n\nThe paper outlined the blockchain technology that would underpin a decentralized payment system.\n\nThe pseudonymous author has never been identified, though there are theories as to their identity.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nAt the end of October 2008, an unidentified individual or group on people under the pseudonym Satoshi Nakamoto published a paper to a mailing list called Metzdowd titled, \"Bitcoin: A Peer-to-Peer Electronic Cash System.\"\n\nThe paper introduced bitcoin as a currency and explained the foundations of blockchain technology. It was a short paper, just nine pages long, written in an academic style, with an abstract, introduction, and conclusion — but it introduced the world to what would become the biggest cryptocurrency by market value today and laid the groundwork for the cashless payment system that is underpinned by the blockchain.\n\n\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution,\" the paper reads.\n\nThe paper has made its mark, but intriguingly, nobody today has figured out who Satoshi Nakamoto is.\n\nAdvertisement\n\nTheories say that Nakamoto is probably from the UK because they used British English spelling for words like \"favour\". It is also assumed that Nakamoto is a billionaire, by tracing the amount of bitcoin presumably held in wallets linked to Nakamoto.\n\nThe last time Nakamoto was heard from was in April 26, 2011, when they sent an email to fellow bitcoin developers, Mike Hearn and Gavin Andresen.\n\nOther rumored identities have also cropped up over the years. Newsweek in 2014 claimed someone named Dorian Nakamoto was the crypto's creator, though he denied this. Australian computer scientist Craig Wright meanwhile has publicly stated that he is bitcoin's inventor, though this has been disputed. Programmer Nick Szabo has also been proposed as the author's true identity.\n\nNo one individual has been proven to be Satoshi Nakamoto and other theories claim they are most likely a group of people who collectively came up with the idea for what would eventually become the world's largest cryptocurrency by market cap.\n\nAdvertisement\n\nIn 2014, Nakamoto made their final post on a forum saying, \"I am not Dorian Nakamoto.\"\n\nWhat's in the white paper\n\nWhile bitcoin was officially launched in January 2009, in the 2008 paper Satoshi Nakamoto laid out the fundamental framework of the blockchain-based payment system.\n\n\"What is needed is an electronic payment system based on cryptographic proof instead of trust, allowing any two willing parties to transact directly with each other without the need for a trusted third party.\"\n\nTrust was the biggest issue the electronic transaction system was supposed to solve. Instead of relying on a central authority to verify transactions, Nakamoto wanted to create a decentralized system, in which verification did not rely on a single entity.\n\nAdvertisement\n\nNakamoto proposed a currency where a coin would be defined by a \"chain of digital signatures.\" Every time a transaction took place, the payer had to \"sign\" off on it. Each transaction would be broadcasted to a network of receivers and payers, who would verify the order of the transactions, which is done via complex and energy-intensive cryptographic computer work. Whoever verifies a certain transaction first would post their \"block\" in the chain of other verified \"blocks,\" and be rewarded with bitcoin.\n\nIt wasn't written in the white paper, but the system is designed so that there are only 21 million bitcoins that will ever exist. Because the amount of coins that enter circulation is finite, every four years, the amount of bitcoins a miner is rewarded with is reduced by half. The next halving event will occur around the middle of 2024, which will reduce the reward to miners to 3.125 bitcoins for each verified transaction block.\n\nThere are currently 19.5 million tokens in the market. As more bitcoin is mined, verifying the transactions requires more and more time, energy, and power. Experts predict that the last bitcoin will be mined in 2140.\n\nSince the white paper's publication, the crypto market has surged in value and cultural relevance, and the total market value of all crypto coins is about $1.2 trillion.\n\nAdvertisement\n\nThe market is currently awaiting on the approval from regulators of the first ever ETF that would track the spot price of bitcoin.\n\nBitcoin on Wednesday was trading around $34,300."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9vY3RvYmVyLXdhcy11cHRvYmVyLWZvci1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "October Was 'Uptober' for Bitcoin | Video - CoinDesk",
        "content": "We're having much more trading like the like a whole sector up and down. And that's partially because of Bitcoin. Bitcoin being the largest. If you look at from market cap weighted lens, it's going to contribute more. But it's also, it's a bit of the gravity of the whole market as what we see across the cycle. Generally, Bitcoin leads their tokens upwards through a cycle. Then once you get to closer to the peak of the cycle, then you have investors make some side bets away from Bitcoin into the alt coin season as it's referred to."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJleW9uZC0zNWstY2hyaXN0bWFzLXRoYW5rLWplcm9tZS1wb3dlbGzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin beyond 35K for Christmas? Thank Jerome Powell if it happens - Cointelegraph",
        "content": "Historically, a Santa rally happens in the weeks leading up to Christmas when a collective sense of goodwill bleeds into equity markets. This is typically a seasonal blip and nothing to write home about. But this year, we could see a far more significant rally as the United States Federal Reserve, the Securities and Exchange Commission and BlackRock line up to deliver a bonanza of holiday cheer.\n\nThe Federal Open Market Committee (FOMC) finished its penultimate meeting of 2023 on Wednesday, and it decided to hold interest rates steady. As we know, U.S. inflation has been tamed from a high of 9.1% in June 2022 to its current level of 3.7% thanks to the Fed’s aggressive interest rate hiking cycle that brought the Federal Funds Rate to 5.25-5.5% — its highest level since 2001.\n\nHowever, while this campaign has been unquestionably successful, markets remain deeply concerned about the potential of higher rates, or even rates sustained at this level, to trigger a recession in the U.S. The Fed also now shares these concerns as it softens to some degree against inflation.\n\nRelated: Bitcoin is evolving into a multiasset network\n\nShould the next Bureau of Labor Statistics inflation reading on Nov. 14 show a move downward, we can expect to see money flooding into risk assets as investors anticipate the next interest rate decision to be a cut. This will, of course, have a positive impact on equity markets, and even bond markets as yields fall and the back end of the yield curve flattens.\n\nGUNDLACH: THINK CPI WILL COME DOWN BASED ON INFLATION MODEL — *Walter Bloomberg (@DeItaone) November 1, 2023\n\nCrypto markets will follow suit, with Bitcoin (BTC) remaining strongly correlated to main markets. What will provide an extra shot in the arm, though, will be the approval of the first U.S.-based Bitcoin spot ETF — which is likely to come before Jan. 10, as J.P. Morgan predicts. This is underlined by the excitement that rumors of the approval of BlackRock’s application have generated over the past few weeks, which sent Bitcoin back up to $35,000: a level it hasn’t enjoyed since the pre-Terra Luna days of 2022.\n\nEventual approval will provide further impetus for Bitcoin, Ether (ETH), and large swathes of altcoin markets. However, if investors are following the old adage, “buy the rumor, sell the fact”, it may not be huge. We might even see a small dip before a more sustained rally. There is little doubt, however, that approval will be positive for cryptocurrency. Indeed, longer-term it has the potential to be the greatest driver of crypto markets since the conditions created by the Covid pandemic saw BTC top $60,000 in 2021.\n\nRelated: Sam Bankman-Fried’s trial is telling a story of classic financial deceit\n\nPotential spanners in the works include higher inflation in the U.S. before the end of the year, and potentially a ramping up of tensions between Israel and Palestine. Either of these could put the brakes on an end-of-year Santa rally — but that does not seem to be the direction of travel right now.\n\nIndeed, Bitcoin has already enjoyed quite a rally this year. While the fallout from the FTX crash in November 2022 saw BTC fall to the $15,000 range and start 2023 at a paltry price of slightly more than $16,000, its level today of $34,000 to $35,000 represents growth of more than 100%. Of course, it’s only the very smart or lucky traders who ever manage to take advantage of Bitcoin’s extreme volatility. Year-on-year, many crypto investors are still nursing losses.\n\nFor FTX investors, for example, while there are now hopes some will get their Bitcoin, Ether, and other tokens back, most will face somewhat of a Pyrrhic victory as they stare down the barrel of 60% to 70% losses. This accounts for the generally pessimistic mood in the crypto market, which would otherwise look like the winner of 2023.\n\nAs we approach the end of the year, then, it would do all of us well to take a step back and view Bitcoin and crypto markets with fresh eyes. Even if we don’t get a much anticipated and, perhaps, deserved Santa rally, we can celebrate the fact that crypto has survived another challenging year and is ending on a high.\n\nLucas Kiely is chief investment officer of Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaWYteW91LWludmVzdGVkLSUyNDEwMDAtaW4tYml0Y29pbi13aGVuLXdhcnJlbi1idWZmZXR0LWNhbGxlZC1pdC1yYXQtcG9pc29uLXNxdWFyZWQtaGVyZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "If You Invested $1000 In Bitcoin When Warren Buffett Called It 'Rat Poison Squared,' Here's How Much You'd Have Now - Nasdaq",
        "content": "Leading investor Warren Buffett is well-known for his sharp investment eye and buying companies and acquiring stock and watching values rise over the years.\n\nOne sector that Buffett has shied away from is cryptocurrency. Here's a look at Buffett's thoughts on cryptocurrency and how investors may have wanted to avoid the Oracle of Omaha's advice in this particular case.\n\nWhat Happened: Buffett has been a vocal critic of the leading cryptocurrency Bitcoin (CRYPTO: BTC) for many years. The bearish position of the Berkshire Hathaway Inc (NYSE:BRK)(NYSE:BRK) CEO even made him named Bitcoin enemy number one by entrepreneur Peter Thiel previously.\n\nIn January 2018, Buffett warned investors about investing in cryptocurrency.\n\n\"In terms of cryptocurrencies, generally, I can say with almost certainty that they will come to a bad ending,\" Buffett said at the time. \"If I could buy a five-year put on every one of the cryptocurrencies, I'd be glad to do it but I would never short a dime's worth.\"\n\nRelated Link: Exclusive – Scaramucci On What Warren Buffett Gets Wrong About Bitcoin\n\nA few month later, Buffett took his feelings on Bitcoin further during an interview with CNBC.\n\nReiterating Berkshire Vice Chairman Charlie Munger's thoughts that Bitcoin is \"rat poison,\" Buffett told CNBC anchor Becky Quick that the cryptocurrency is \"probably rat poison squared.\"\n\nBuffett has said that he wouldn't buy Bitcoin even if it dropped to $25.\n\nWhile the billionaire investor has not bought cryptocurrencies and has continued to speak out against them, he does own shares of a company that has bet on Bitcoin and other leading cryptocurrencies.\n\nAs Benzinga previously reported, Buffett and Berkshire Hathaway are shareholders in Nu Holdings (NYSE:NU), a Latin American digital bank. Nu Holdings is a crypto-friendly bank and has launched several cryptocurrency products along with allocating a portion of its cash to Bitcoin.\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nInvesting $1,000 in Bitcoin: While Buffett said he wouldn't invest in Bitcoin even if it hit $25, some investors have chosen to allocate a portion of their investments or holdings in the leading cryptocurrency.\n\nBitcoin traded between $9,695.12 and $9,964.50 on May 5, 2018 — the day of Buffett's \"rat poison squared\" comment.\n\nAn investor could have purchased 0.1004 BTC at the coin's high price of that day.\n\nThe $1,000 investment would be worth $3,462.82 today based on a price of $34,490.19 for Bitcoin at the time of writing. This represents a return of 246.3% since Buffett's comments.\n\nFor comparison, shares of Berkshire Hathaway are up 76.2% over the same time period, based on a starting price of $294,720 each.\n\nThe SPDR S&P 500 ETF Trust (NYSE:SPY), which tracks the S&P 500 Index, is up 56.8% over the same time period, based on a starting price of $266.89.\n\nAs investors can see, Bitcoin has outperformed both the S&P 500 and Berkshire Hathaway since Buffett's now famous quote about the leading cryptocurrency.\n\nWhile Buffett has said he wouldn't touch cryptocurrency even if it hit $25 per coin, investors who bought when the legendary investor made his quote would be glad that they did.\n\nReady to win big? Discover the #1 strategy for trading options in today's unpredictable market… with potential gains of 44%, 125% and even 411% every month on average. Starting at only $1 a day. Click here now.\n\n© 2023 Benzinga.com. Benzinga does not provideinvestment advice All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy81LWNyeXB0b2N1cnJlbmN5LXN0b2Nrcy13YXRjaC1iaXRjb2luLTExNDEwMDE0Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "5 Cryptocurrency Stocks to Watch as Bitcoin Resumes Rally - Yahoo Finance",
        "content": "The price of Bitcoin (BTC), which got rangebound over the past two-and-a-half months, is up again. Bitcoin has been on a rally over the past couple of weeks, surging more than 25%. The cryptocurrency jumped over 14% last week itself and briefly crossed the $35,000 mark.\n\nSince then, it has been hovering over $34,500. The sudden surge comes as expectations that the Securities and Exchange Commission (SEC) will approve a Bitcoin exchange-traded fund (ETF) in the coming days.\n\nThe anticipated green light from the SEC for a Bitcoin ETF is expected to boost demand. This is likely to enable more traditional investors to hold Bitcoin and other cryptocurrencies through conventional stock markets.\n\nMoreover, it is predicted to draw fresh investments into the crypto industry, potentially leading to an increase in demand.\n\nHowever, that’s not the only reason behind the recent Bitcoin rally. The rally comes amid mixed earnings results from a spate of big tech companies. Investors have lately been ditching the stock market to invest in cryptocurrencies.\n\nDuring uncertain times, investors tend to gravitate towards safer, less speculative options. Bitcoin, being the most trusted among all cryptocurrencies, has been benefiting the most from this situation.\n\nAlthough the cryptocurrency market is not generally regarded as stable or secure, even within this sphere, investors often seek refuge in Bitcoin during periods of surges or rallies in the crypto market.\n\nStocks in Focus\n\nBlackRock, Inc. BLK is one of the world’s largest investment managers and is publicly owned. BLK was one of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023.\n\nBlackRock’s expected earnings growth rate for the current year is 2.2%. The Zacks Consensus Estimate for current-year earnings has improved 1.9% over the last 60 days. BlackRock presently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nStory continues\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence, and the mining or production of cryptocurrencies.\n\nNVIDIA’s expected earnings growth rate for the current year is 221.6%. The Zacks Consensus Estimate for current-year earnings has improved 0.7% over the last 60 days. NVIDIA presently sports a Zacks Rank #1.\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nCoinbase Global’s expected earnings growth rate for the current year is 84.6%. The Zacks Consensus Estimate for current-year earnings has improved 1.1% over the last 60 days. Coinbase currently has a Zacks Rank #3.\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 69% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.6% over the last 60 days. SQ currently carries a Zacks Rank #2 (Buy).\n\nInteractive Brokers Group, Inc. IBKR is a global automated electronic broker. IBKR executes, processes and trades in cryptocurrencies, which include Bitcoin.\n\nInteractive Brokers Group has an expected earnings growth rate of 41% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 1.2% over the last 60 days. IBKR currently carries a Zacks Rank #2.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nInteractive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0by1zdG9ja3MtYnV5LXF1aWNrLTE5MTgwMjI4Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "3 Crypto Stocks to Buy for a Quick Double if Bitcoin Touches $50,000 - Yahoo Finance",
        "content": "With a renewed rally, Bitcoin (BTC-USD) has surged by almost 23% in the last month. This is not unusual, with cryptocurrencies having a reputation for skyrocketing in quick time. Bitcoin is likely to trade above $50,000 in the next few months. Besides exposure to quality cryptocurrencies, consider buying some of the best crypto stocks for robust returns.\n\nThe news of the possibility of a spot ETF for Bitcoin will likely be a key upside catalyst. Additionally, Bitcoin’s halving is due in 2024 and will have a positive impact on the digital asset.\n\nFurther, the rise in geopolitical tensions has supported the flow of funds into Bitcoin. If these factors were insufficient, I would add that potential rate ruts are due next year. A weak dollar is positive for all risky asset classes.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLet’s discuss three crypto stocks to buy at current levels.\n\nCoinbase Global (COIN)\n\nA Bitcoin rests on top of a computer with the Coinbase (COIN) logo and a trading chart.\n\nSource: Nadezda Murmakova / Shutterstock.com\n\nCoinbase (NASDAQ:COIN) stock has already surged by 129% year-to-date. However, the rally from oversold levels does not make COIN stock expensive. I would bet on another 100% returns if Bitcoin touched $50,000.\n\nIt’s worth noting that Coinbase is among the top five centralized exchanges globally. The company stands to benefit if there is a cryptocurrency bull market. Trading and speculation will likely increase, translating into higher income for Coinbase.\n\nIn March 2023, Coinbase initiated an international expansion drive in six continents. This is important to mention as the company has been making steady business progress during the cryptocurrency bear market. Global expansion and the continued addition of new digital assets to the platform are other factors that will boost trading volumes.\n\nCoinbase ended Q2 2023 with cash and equivalents of $5.5 billion. With adjusted EBITDA turning positive, the company has high financial flexibility to make aggressive investments for growth.\n\nStory continues\n\nRiot Platforms (RIOT)\n\nIn this photo illustration, the Riot Platforms (RIOT) logo is displayed on a smartphone screen.\n\nSource: rafapress / Shutterstock.com\n\nRiot Platforms (NASDAQ:RIOT) is possibly the best Bitcoin mining stock to consider at current levels. After touching highs of $20.7 in July, RIOT stock has corrected to $9.8. This presents a good accumulation opportunity. If Bitcoin touches $50,000 in the next few quarters, RIOT stock will likely triple.\n\nFrom a fundamental perspective, Riot is attractive, with $510 million in cash and digital assets. Further, the company has a zero-debt balance sheet that provides high financial flexibility.\n\nRiot also has ambitious expansion plans. As of Q3 2023, the company reported a hash rate capacity of 10.7EH/s. The company expects to expand capacity to 20.1EH/s by Q4 2024 and further to 35.4EH/s in 2025.\n\nThis will likely translate into robust revenue and cash flow upside if Bitcoin remains in an uptrend. As the company’s financial flexibility increases further, there is a strong case for diversification-driven growth.\n\nBitfarms (BITF)\n\nBitcoin and crypto mining farm. Big data center. High tech server computers at work. Bitfarms (BITF) mines crypto.\n\nSource: PHOTOCREO Michal Bednarek / Shutterstock.com\n\nI am also tempted to talk about a penny crypto stock to buy as Bitcoin trends higher. Bitfarms (NASDAQ:BITF) is another attractive Bitcoin miner that seems poised to deliver multibagger returns. On a very conservative basis, BITF stock will double from current levels. However, I would not be surprised with 3x to 5x returns if Bitcoin is at $50,000.\n\nAs of September, Bitfarms reported a mining capacity of 6.1EH/s with a year-on-year growth of 45%. The important point to note is that Bitfarms reported a liquidity buffer of $65 million for Q2 2023. Additionally, the company expects to be debt free by February 2024. Therefore, there is high financial flexibility to pursue aggressive expansion.\n\nAnother positive is that the company is a low-cost Bitcoin miner. For Q2 2023, Bitfarms reported direct cost of production at $15,700 per Bitcoin. Assuming a scenario where Bitcoin trades above $50,000, the company will be positioned to report healthy EBITDA and cash flows. A big rally from current levels, therefore, seems entirely likely.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe post 3 Crypto Stocks to Buy for a Quick Double if Bitcoin Touches $50,000 appeared first on InvestorPlace."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8zMS9ibGFja3JvY2tzLWJpdGNvaW4tZXRmLW1pZ2h0LWhhdmUtdHJhZGluZy1zdXBwb3J0LW9mLWhlYXZ5d2VpZ2h0cy1saWtlLWphbmUtc3RyZWV0LWp1bXAtYW5kLXZpcnR1LXNvdXJjZS_SAZoBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTAvMzEvYmxhY2tyb2Nrcy1iaXRjb2luLWV0Zi1taWdodC1oYXZlLXRyYWRpbmctc3VwcG9ydC1vZi1oZWF2eXdlaWdodHMtbGlrZS1qYW5lLXN0cmVldC1qdW1wLWFuZC12aXJ0dS1zb3VyY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "BlackRock's Bitcoin ETF Might Have Trading Support of Heavyweights Like Jane Street, Jump and Virtu: Source - CoinDesk",
        "content": "One of the best examples of why such a create-and-redeem structure is important actually comes from crypto. Grayscale Investments offers a product called the Grayscale Bitcoin Trust (GBTC) whose price has over the past few years wandered dramatically far away from the billions of dollars worth of bitcoin (BTC) that it owns. Unlike an ETF, shares of this trust cannot be redeemed for BTC. Grayscale (which, like CoinDesk, is owned by Digital Currency Group) has applied to convert GBTC into an ETF."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3Qvd2h5LWJpdGNvaW4taXMtdXAtd2hpbGUtaW52ZXN0b3ItZmVhci1pcy1wcmVzZW50LWluLW1hcmtldHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Why Bitcoin is soaring in one of the scariest market environments in years - DLNews",
        "content": "Investors have plenty to worry about in markets lately.\n\nBitcoin’s strong performance despite the worries is counterintuitive to some, says eToro analyst Callie Cox.\n\nShe explains why the cryptocurrency has rallied even as macro investors see it as a risky asset.\n\nHappy Wednesday!\n\nCrypto is volatile, illiquid, and risky — and yet in an environment rife with signs of fear, investors are flocking to it. Why?\n\nCallie Cox, investment analyst at financial services company eToro, explained the situation to DL News.\n\nLet’s dig into it.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nBitcoin as a store of value\n\nThe Israeli-Palestinian conflict — and the threat of escalation from the US and Iran — is keeping investors on their toes.\n\nBut Bitcoin is trading at about $34,400, 24% higher than when Hamas launched an attack on Israel on October 7. The top cryptocurrency has more than doubled this year.\n\nBitcoin has typically tracked the tech-heavy Nasdaq, rising and falling in line with investors’ risk sentiment. The Nasdaq is up 30% this year.\n\n“Traditional-minded investors may see Bitcoin as a risky investment because they’re lining it up against stocks and bonds. And in that light, Bitcoin — and crypto — are especially risky,” Cox told DL News.\n\nJoin the community to get our latest stories and updates\n\nAnd yet data from The Block Research tracking Bitcoin’s correlation to gold since October 12 shows the link between the two assets has strengthened.\n\nGold has moved 6% since then, while the Nasdaq and the S&P 500 have slipped about 5.6% and 3.8%, respectively, during that period.\n\n“For the crypto-focused investor, Bitcoin could be seen as a stable store of value, as well as a hedge against the traditional financial system,” Cox said.\n\n“Your view of Bitcoin depends on the narrative you ascribe to, and there’s a significant crowd on both sides,” she added.\n\nMarket fears aren’t manifesting the way they ordinarily do, said Cox.\n\n“Gold is creeping back to record highs, the dollar is soaring versus other currencies, stocks are sliding,” she said. “Yields are surging,” as interest rates rise, she said.\n\n“And the VIX isn’t reflecting fear like it used to.”\n\n“I was surprised that Bitcoin got going,” billionaire investor Stanley Druckenmiller told Paul Tudor Jones last week at the Robin Hood Investors Conference. “It’s clear that the young people look at it as a store of value because it’s a lot easier to do stuff with” than gold.\n\nBitcoin rallied “directly” after President Joe Biden made the case that the US should provide wartime aid to both Israel and Ukraine, BitMEX co-founder Arthur Hayes noted in a blog post on October 25.\n\n“Gold, and most importantly, Bitcoin, will begin rising on true fears of global war-time inflation,” Hayes wrote.\n\n“Bitcoin could be in an interesting position,” Cox said. “It’s the benefactor of yield fears within crypto, and it seems to be at the helm of industry momentum.”\n\nCrypto market movers\n\nBitcoin remained flat over the last 24 hours and is trading for $34,400.\n\nEthereum is down 0.2% in the same period of time and trades at $1,796.\n\nSolana is up 8%, and Chainlink is down 5.5%.\n\nWhat we’re reading\n\nTom Carreras is a Markets Correspondent at DL News. Got a tip? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zYXRvLXRlY2hub2xvZ2llcy1jb3JwLWFubm91bmNlcy1vY3RvYmVyLTEzMjgwMDc5MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "SATO Technologies Corp. Announces October 2023 Bitcoin Mining Operational Update - Yahoo Finance",
        "content": "Toronto, Ontario--(Newsfile Corp. - November 1, 2023) - SATO Technologies Corp. (TSXV: SATO) (OTCQB: CCPUF) (the \"Company\", or \"SATO\"), a digital asset mining organization, announces October 2023 Bitcoin Production and Efficiency, all powered by renewable energy.\n\nOctober Mining Update (unaudited)\n\nIn October, the mining network hashrate increased by 8.60% month over month.\n\nKey Metrics October 2023 September 2023 August 2023 Total Hashrate capacity installed 0.54 EH/s 0.54 EH/s 0.54 EH/s Average operating Hashrate 0.533 EH/s 0.524 EH/s 0.526 EH/s Total BTC Mined on site 36 36 39 Mining revenue (US$) $1,073,306 $954,016 $1,078,161 Avg. monthly Network Hashrate 442 EH/s 407 EH/s 386 EH/s BTC Sold 33 36 47* BTC HODL 38 35* 35* Cash Position (US$)1 $1,314,895 $1,737,979 $1,707,703\n\nFurthermore, SATO is providing historical financial data for analysts and investors to compare us with our peers. This will highlight our strong performance relative to the largest publicly traded mining companies.\n\nBTC produced per Eh/s Month Jan Feb March April May June July Aug Sept Oct Ratio 108.7 90.3 90.7 80.2 91.2 75.3 74.7 74.1 68.7 67.5\n\nElectrical price per BTC (USD) Month Jan Feb March April May June July Aug Sept kWh cost $6,484 $6,997 $8,105 $9,542 $8,662 $9,488 $10,202 $10,100 $10,577 All-in electric cost $9,971 $11,089 $12,207 $14,550 $13,211 $14,455 $15,780 $15,311 $16,632\n\nOctober L2's services Update\n\nOn October 26th, Hordes Wallet - a non-custodial Bitcoin Taproot wallet developed by SATO for storing ordinals - added another art collection to its repertoire. This collection, consisting of 500 pieces from the artist Takeru Amano, represents the first step towards generating more fees for SATO.\n\nThe pieces can be viewed here: https://magiceden.io/ordinals/marketplace/vnus. SATO inscribed this collection on Uncommon sats and sats from the satoshi blocks.\n\nMore information about L2 services developed at https://www.bysato.com/L2.\n\nOn behalf of the board,\n\nRomain Nouzareth,\n\nSATO CEO and Chairman\n\nAbout SATO\n\nSATO, founded in 2017, is a publicly listed company positioned for ongoing success in deploying and infrastructures via proprietary data centers designed to provide efficient compute power tailored for the digital ecosystem for Bitcoin Mining, High Performance Computing (\"HPC\"), Artificial Intelligence (\"AI\"), and L2's. Listed on TSX.V:SATO & OTCQB:CCPU.F since 2021, the Company prides itself on outstanding performance, financial stability, and a top-tier team. Around 65% of securities (on a fully diluted basis) owned by Officers, Directors, Insiders and Shareholders above 7% with long term vision. To learn more about SATO's distinct vision, ambitious goals and meet the team, visit www.bysato.com.\n\nStory continues\n\nFor additional information, please contact:\n\nRomain Nouzareth\n\ninvest@bysato.com\n\nPhone: +1 (450) 756-3636\n\nFull Disclaimer https://corp.bysato.com/documents/disclaimer.html.\n\nNEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.\n\nCautionary Statement Regarding Forward-Looking Information\n\nThis news release contains certain forward-looking statements, including statements relating to the future performance of the Company, and other statements that are not historical facts. These statements reflect management's current beliefs and are based on information currently available to management as at the date hereof.\n\nForward-looking statements involve significant risk, uncertainties and assumptions. Many factors could cause actual results, performance or achievements to differ materially from the results discussed or implied in the forward-looking statements. These factors should be considered carefully and readers should not place undue reliance on the forward-looking statements. Although the forward-looking statements contained in this press release are based upon what management believes to be reasonable assumptions, the Company cannot assure readers that actual results will be consistent with these forward-looking statements. These forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update or revise them to reflect new events or circumstances, except as required by law.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/185904"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzAxL2ZlZC1zZWVuLWhvbGRpbmctcmF0ZXMtc3RlYWR5LWJ1dC1wb2xpY3ktc3RhdGVtZW50LWFuZC1wcmVzcy1jb25mZXJlbmNlLXdpbGwtYmUta2V5LWZvci1iaXRjb2luL9IBkAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzAxL2ZlZC1zZWVuLWhvbGRpbmctcmF0ZXMtc3RlYWR5LWJ1dC1wb2xpY3ktc3RhdGVtZW50LWFuZC1wcmVzcy1jb25mZXJlbmNlLXdpbGwtYmUta2V5LWZvci1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Fed Seen Holding Rates Steady, but Policy Statement and Press Conference Will Be Key for Bitcoin - CoinDesk",
        "content": "Bitcoin's strong October breakout from the $27,000 area has been stalled in the $34,000-$35,000 area for the past week, perhaps awaiting fresh fuel. While any dovish signal from the Fed could provide a push out of that range, few are expecting it. “We still see another U.S. rate increase as unlikely in the current cycle,” Matthew Ryan, head of market strategy at Ebury, told CNBC. \"As a compromise, we think that the Fed will stress that rate cuts are not on the cards anytime soon, with easing to begin no sooner than the second half of 2024.\""
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvMTUteWVhcnMtb2YtYml0Y29pbiUzQS1mcm9tLXNhdG9zaGlzLXZpc2lvbi10by0lMjQ0MDBiLXJlYWxpdHktaGVyZXMtd2hhdC1leHBlcnQtYmVsaWV2ZS1pc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "15 Years Of Bitcoin: From Satoshi's Vision To $400B Reality — Here's What Expert Believe Is Next In Store For King ... - Nasdaq",
        "content": "Today marks the 15th anniversary of the release of the Bitcoin (CRYPTO: BTC) whitepaper by Satoshi Nakamoto, the pseudonymous creator of Bitcoin.\n\nWhat Happened: On October 31, 2008, Nakamoto shared the whitepaper, titled “Bitcoin: A Peer-to-Peer Electronic Cash System,” to a mailing list of cryptographers.\n\n\"I've been working on a new electronic cash system that's fully peer-to-peer, with no trusted third party,\" Satoshi famously said in the opening sentence before linking the document titled: \"Bitcoin: A Peer-to-Peer Electronic Cash System.\"\n\nJust two months later, on January 3, 2009, the first Bitcoin block was mined, marking the launch of the world’s most valuable cryptocurrency. Nakamoto’s breakthrough came after being influenced by Wei Dai’s b-money, an earlier electronic peer-to-peer cash system.\n\nMohammed AlKaff AlHashmi, co-founder of HAQQ Network, a blockchain network that issues Islamic Coin, its native cryptocurrency, emphasized the monumental milestone the whitepaper represents. “The Bitcoin whitepaper’s 15th anniversary is a monumental milestone, not just for the crypto industry but also for the broader financial landscape.\"\n\nHe wrote in a note to Benzinga. \"..the paper laid the groundwork for decentralized finance, challenging the traditional financial systems that have been in place for centuries. Bitcoin has become a store of value.”\n\nReiterating AlHashmi's stance, Robert Quartly-Janeiro, CSO at Bitrue crypto exchange said, \" Bitcoin itself has emerged as the world’s most valuable cryptocurrency, boasting a market capitalization exceeding $400 billion.\"\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Looking ahead to the future, Ryan Lee, Bitget Research Chief Analyst, predicts various factors that could influence the Bitcoin market.\n\nLee explains that market expectations for the future movement of Bitcoin primarily rely on key factors such as the Federal Reserve’s interest rate decisions, Bitcoin ETF approvals, the Bitcoin halving, and regulatory developments. “There is less than half a year remaining until Bitcoin halving. U.S. monetary policy may gradually ease next year and currently, the Federal Reserve’s interest rate hike may peak in the short term. The likelihood of Bitcoin spot ETF approval has significantly increased.”\n\nAs we move into 2024, Lee suggests that after a period of ranging market conditions, the market fundamentals are expected to gradually improve with clear regulatory stances. \"The FOMC meetings in November and December will also set the tone for decisions regarding interest rate hikes and the duration of elevated interest rates. \"\n\nHe added, \"Bitcoin has the potential to break above its recent high of around $32,000 in early 2024, with key levels to watch above at $34,000, $38,000, and $42,000.\"\n\nPrice Action: At the time of writing, Bitcoin was trading at $34,318.16, up 0.10% in the last 24 hours, according to Benzinga Pro.\n\nPhoto by Oier Aso on Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90di91bmNoYWluZWQvaG93LW11Y2gtbW9uZXktd2lsbC1mbG93LWludG8tYml0Y29pbi1ldGZzLWhlcmVzLW9uZS1wcm9qZWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "How Much Money Will Flow Into Bitcoin ETFs? Here's One Projection - CoinDesk",
        "content": "Bitcoin Price Index XBX\n\nThe CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk ."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMzEvYml0Y29pbnMtdHJpYW5ndWxhci1jb25zb2xpZGF0aW9uLWlzLWJ1bGxpc2gtdGVjaG5pY2FsLWFuYWx5c2lzL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMzEvYml0Y29pbnMtdHJpYW5ndWxhci1jb25zb2xpZGF0aW9uLWlzLWJ1bGxpc2gtdGVjaG5pY2FsLWFuYWx5c2lzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's 'Triangular Consolidation' Is Bullish: Technical Analysis - CoinDesk",
        "content": "Note that while triangles usually resolve in the direction of the preceding trend, they can sometimes end with a downside breakout, indicating a bearish trend reversal. Hence, it's imperative traders closely follow the price action over the next few days."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzMxL3F1YWxpdHktYml0Y29pbi1taW5pbmctc3RvY2tzLW9mZmVyLWEtZ29vZC13YXktdG8tZ2Fpbi1leHBvc3VyZS10by10aGUtbmV4dC1idWxsLXJ1bi1iZXJuc3RlaW4v0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMzEvcXVhbGl0eS1iaXRjb2luLW1pbmluZy1zdG9ja3Mtb2ZmZXItYS1nb29kLXdheS10by1nYWluLWV4cG9zdXJlLXRvLXRoZS1uZXh0LWJ1bGwtcnVuLWJlcm5zdGVpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's Heading to $150K and Quality Mining Stocks Offer a Good Way to Gain Exposure: Bernstein - CoinDesk",
        "content": "Riot and CleanSpark are “counter-cyclically investing in bitcoin self-mining capacity, unlike some miners who pivoted capacity to AI/high performance computing,” the report said, adding that it expects this “counter-cyclical BTC capacity to pay off” as the cycle turns."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFkZHJlc3Nlcy1pbi1wcm9maXQtbmV3LXJlY29yZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "There are now nearly 40M Bitcoin addresses in profit — A new record - Cointelegraph",
        "content": "Bitcoin (BTC) has more wallet addresses in profit than ever before despite BTC’s price being 50% below all-time highs.\n\nThe latest data from on-chain analytics firm Glassnode shows a record number of addresses “in the black.”\n\n$34,000 BTC price returns over 80% of Bitcoin addresses to profit\n\nBitcoin may be nearing 18-month highs, but its recent gains were already enough to spark significant changes in investor profitability.\n\nPer Glassnode data, the number of addresses in profit as of Oct. 30 was 39.1 million.\n\nThis is the highest number ever recorded for Bitcoin and beats the previous peak of 38.1 million seen in November 2021.\n\nAt that time, BTC/USD itself traded at all-time highs, and thus 100% of addresses in existence with a non-zero balance were in profit.\n\nWhile the current spot price remains 50% lower than those levels, total non-zero addresses now number 48.3 million.\n\nBitcoin addresses in profit chart. Source: Glassnode\n\nIn percentage terms, in-profit addresses have yet to match their performance in absolute numbers but are nevertheless at 18-month highs of 81.1%.\n\nThe tally has gone from 60% to 80% over the past two months, Glassnode additionally shows.\n\nBitcoin % addresses in profit chart. Source: Glassnode\n\nBy contrast, addresses at a loss currently stand at just over 9 million. At their peak in December 2022, following the FTX meltdown, the total was over 20 million.\n\nBitcoin addresses in loss chart. Source: Glassnode\n\nLong-term holders see “minimal” profit-taking\n\nAs Cointelegraph reported, the past week has seen BTC price action pass multiple resistance levels while returning both long-term (LTH) and short-term (STH) holders to profit.\n\nRelated: Bitcoin restarting 2023 uptrend after 26% Uptober BTC price gains — Research\n\nThis, in turn, sparked profit-taking at the more speculative end of the hodler spectrum — especially as the market passed $34,000.\n\nFor James Van Straten, research and data analyst at crypto insights firm CryptoSlate, this underscores the difference in mentality between cohorts.\n\n“Bitcoin has shown remarkable strength above $34k for the past five days while witnessing one of the strongest profit-takings in the past two years, from STHs,” he argued on Oct. 29.\n\n“LTHs have barely budged, the sixth largest profit-taking this year, but minimal in the grand scheme of things.”\n\nAccompanying charts from Glassnode tracked inflows to exchanges from LTHs and in-profit STH entities.\n\nBitcoin exchange inflows composite chart. Source: James Van Straten/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1kZXRlcm1pbmVzLXRoZS1wcmljZS1vZi1iaXRjb2luLTLSAUlodHRwczovL2RlY3J5cHQuY28vcmVzb3VyY2VzL3doYXQtZGV0ZXJtaW5lcy10aGUtcHJpY2Utb2YtYml0Y29pbi0yP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "What Determines the Price of Bitcoin? - Decrypt",
        "content": "In brief Bitcoin prices are driven by the same principles of supply and demand that govern the cost of goods and services, exchange rates, etc.\n\nPrice discovery is now determined primarily on centralized crypto exchanges (CEXs).\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEarn a free on-chain NFT by taking our free course, Crypto Investing:Fundamentals First. Decrypt will cover gas fees for the first 10,000 mints!\n\nThe Bitcoin blockchain went live on January 3rd, 2009. At its inception, the Bitcoin network started releasing its own eponymous currency or money. Every ten minutes, the network released 50 BTC to a tiny community of cryptography enthusiasts. Although starting from humble beginnings, its creator Satoshi Nakamoto had an ambitious goal for Bitcoin to be a “peer-to-peer version of electronic cash” for the world.\n\nAt first, Bitcoin didn’t have a set monetary value because there wasn’t a marketplace for BTC. Without goods and services being offered for Bitcoin, it was difficult—if not impossible—to determine its price in a fiat currency such as the U.S. dollar (USD).\n\nAD\n\nAD\n\nMarket Forces Determine Prices\n\nThe cost of goods, fiat exchange rates (USD to EUR for example), and the spot price of commodities (such as corn and oil) are determined by the laws of supply and demand. When in-demand supplies are created in surplus, prices typically go down when demand remains constant. Likewise, a supply shortage tends to make prices appreciate (assuming demand remains constant). This dynamic also holds true for BTC and other cryptocurrencies.\n\nBitcoin Price Markets: Then and Now\n\nOn May 22, 2010, 10,000 BTC were exchanged for two pizzas in what is widely considered the first BTC purchase (at the time, one BTC was worth $0.004). Subsequently, others started accepting goods and services in exchange for Bitcoin which created a market big enough for robust price discovery — which is simply the free market method for determining an asset’s price. Since then, people have purchased everything from luxury goods to real estate using BTC.\n\nSince 2010, the price has risen dramatically as demand has typically outpaced supply. From July 2020 onwards, the Bitcoin price has remained above $10,000 and reached an all-time high price of $69,990.90 in November 2021. Eschewing BTC-to-pizza markets, price discovery is now determined primarily on centralized crypto exchanges (CEXs) where BTC is traded for fiat (USD, EUR, KRW) and a variety of other cryptocurrencies such as ether (ETH) and litecoin (LTC).\n\nWhy Is BTC in Demand?\n\nPut simply, many who purchase and use BTC view it as a fiat currency and payment system alternative. With its limited supply and decentralized nature, some purchase it as an inflation hedge, store of value, or as an investment. Others who have lost confidence in their banking system or national currency prefer an asset that is difficult to confiscate and doesn’t need a trusted third party to make transactions.\n\nBitcoin Price Predictions Vary Widely\n\nFrom being called a “global reserve currency” to “absolutely worthless,” Bitcoin price forecasts vary from zero to over $1 million. Ultimately, the opinions of Bitcoin proponents and detractors won’t determine the price. Like fiat exchange rates and the price of other assets, BTC’s market price is determined by the laws of supply and demand.\n\nAD\n\nAD"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLXByaWNlLWlzLWRvd24tYWdhaW5zdC1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "3 reasons why Ethereum price is down against Bitcoin - Cointelegraph",
        "content": "The price of Ethereum’s native token, Ether (ETH) is trading around a 15-month low versus Bitcoin (BTC), and the lowest since Ethereum switched to proof-of-stake (PoS).\n\nCointelegraph takes a closer look at some of the reasons for the continuous drop of the ETH/BTC pair.\n\nEther’s historical price action has changed\n\nIn previous market cycles, Ethereum often outperformed BTC during bullish market trends, but this relationship began to change at the start of 2023. Ether and numerous altcoins struggled as the narrative around altcoins use within Web3, DeFi and NFTs came under pressure in 2022 and 2023.\n\nStringent regulations against the crypto industry, severely muted inflows from retail and institutional investors, an uptick in investors seeking shelter in US-dollar-pegged stablecoins also impacted sentiment for Etheruem.\n\nBitcoin dominance rises\n\nIn addition to a change in Ether’s performance in its BTC pair, ETH was negatively impacted by the steady rise in Bitcoin dominance. As reported by Cointelegraph,\n\n“Bitcoin’s market dominance has reached 54%, its highest in the last 30 months, indicating the top cryptocurrency is strengthening just before the halving event scheduled for April 2024.”\n\nBitcoin market dominance chart. Source: TradingView\n\nBitcoin dominance is a measure of BTC’s market capitalization relative to the overall crypto market and it highlights the assets’s strength and if often used by investors as a sentiment gauge. With the Bitcoin halving fast approaching (April 2024) and investors’ belief that a spot BTC ETF is imminent, the drop in Ether’s value in its BTC pair suggests that investors feel more bullish about BTC and possibly allocating less money to Ether investments.\n\nRelated: Bitcoin dominance hits 54% — Highest in 2.5 years as BTC halving approaches\n\nEthereum price breaks below critical support vs. Bitcoin\n\nThe ETH/BTC pair dropped to 0.050 BTC on Oct. 23 and has remained in a downtrend since then. A notable occurrence was the pair’s fall below its 200-week exponential moving average near 0.058 BTC,which raises the possibility for further downside in the short-term.\n\nAccording to Cointegraph contributor Yashu Gola,\n\n“The 200-week EMA has historically served as a reliable support level for ETH/BTC bulls. For instance, the pair rebounded 75% three months after testing the wave support in July 2022. Conversely, it dropped over 25% after losing the same support in October 2020.”\n\nThese factors are likely to continue impacting Ethereum's price relative to Bitcoin. The multifaceted market dynamics, investor sentiment and staunch regulatory environment could remain the dominant headwinds against the ETH/BTC pair for the foreseeable future.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9jbG9zaW5nLWFyZ3VtZW50cy1zdGFydC1pbi1zYW0tYmFua21hbi1mcmllZHMtdHJpYWwtY291bGQtYml0Y29pbi1yZWFjaC1kb2xsYXIxNTBrLWJ5LTIwMjUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Closing Arguments Start in Sam Bankman-Fried's Trial; Could Bitcoin Reach $150K by 2025? - CoinDesk",
        "content": "Sam Bateman Fried's trial winds down and circle phases out retail service. You're watching Coindesk Daily, I'm your host, Jen Sani. Let's take a look at the markets. The coin desk, Bitcoin price XX index is currently trading around $34,200. The price is up slightly as investment research firm Bernstein reportedly predicts that Bitcoin could hit 100 and $50,000 by 2025. According to C NBC, the prediction came in a note to clients on Tuesday. It hinges on the sec approving a spot. Bitcoin ETF Bernstein predicts that will happen in the first quarter of 2024. Sam Bateman Fried's five week criminal trial could be reaching its end with closing arguments expected to begin today. They are expected to take around one day. That means the case could go to the jury as soon as Thursday. Binman Fried was the last witness to take the stand. The FT X founder defense has so far tried to suggest that the exchange grew too quickly without sufficient oversight or risk planning. However, prosecutors have worked to poke holes in that narrative. The commodity futures Trading Commission has paid out $16 million to whistleblowers. This year, most of the 1530 tips involved crypto. According to Commissioner Christie Goldsmith Romero, the CFTC regulates derivatives markets in the US. In a statement, she said, quote, with the rise of crypto, more retail customers have come under the CFTC'S jurisdiction making even more critical the efforts of the cftc's whistleblower program. End quote. U DC issuer circle says it's curbing service for individual accounts to mint Stablecoins. The action represents a move towards main competitor. Tether's practice to limit access for retail users. A spokesperson told Coindesk quote circle is phasing out support for legacy consumer accounts and has notified individual consumers of this decision account. Closures do not apply to business or institutional circle. Mint accounts end quote. That's a wrap for coin desk daily, get more updates on coindesk dot com and we'll see you next time."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDEvYml0Y29pbi1yZXRha2VzLTM1ay1hZnRlci1mb21jLWFzLXNvbGFuYXMtc29sLWxlYWRzLXNoYXJwLWFsdGNvaW4tcmFsbHkv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8wMS9iaXRjb2luLXJldGFrZXMtMzVrLWFmdGVyLWZvbWMtYXMtc29sYW5hcy1zb2wtbGVhZHMtc2hhcnAtYWx0Y29pbi1yYWxseS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Retakes $35K After FOMC as Solana's SOL Leads Sharp Altcoin Rally - CoinDesk",
        "content": "\"​​BTC is a hedge against loose monetary policies and so lower yields would strengthen that value proposition and investors' willingness to buy and hold crypto,\" Justin d'Anethan, head of business development at crypto market maker Keyrock, said in an email. \"Should the hint of a change in rate policy become more pronounced, one would expect crypto markets to rise.\""
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8taG9ycm9ycy10YWxlcy1vZi1sb3N0LWJpdGNvaW4td2FsbGV0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Crypto horrors: Tales of lost Bitcoin wallets - Cointelegraph",
        "content": "In the shadowy corners of the digital world, where the glow of computer screens illuminates faces with eerie light, there exist tales of lost fortunes. These tales act as a terrifying reminder of the unpredictable nature and volatility present in the cryptocurrency markets and the need to adopt stringent security measures.\n\n1. James Howells and the lost 7,500 BTC\n\nA British man named James Howells unintentionally threw away a hard drive in 2013 that contained 7,500 Bitcoin (BTC), currently valued at over $258 million. The hard disk is still buried; he can’t figure out where it is, even after making several desperate attempts to retrieve it from the landfill in New Port, Wales. Howell’s story serves as a reminder that digital gold could be turned into digital dust.\n\nJames Howells makes a fresh plea to excavate the landfill site where his discarded hard drive containing 7,500 #Bitcoin likely resides. https://t.co/93AYMQEnrn — Cointelegraph (@Cointelegraph) January 14, 2021\n\n2. Stefan Thomas and the 7,002 BTC conundrum\n\nSan Francisco-based programmer Stefan Thomas (formerly the chief technology officer at Ripple) was plunged into a Kafkaesque nightmare after he lost the password to his digital wallet. Thomas was left with just two password attempts before the security system would encrypt his fortune forever, rendering them unusable and unreachable, with 7,002 BTC at stake.\n\nThe hard drive, named the Iron Key, boasts an impenetrable design engineered to withstand all types of attacks. Users are granted only ten wrong password attempts before the drive permanently locks out.\n\n“I would just lay in bed and think about it,” Thomas told The New York Times. “Then I would go to the computer with some new strategy, and it wouldn’t work, and I would be desperate again.”\n\nOn Oct. 25, crypto recovery firm Unciphered extended an open letter, offering to unlock an IronKey hard drive owned by Thomas, which holds 7,002 BTC. Despite the offer, Thomas has not taken any action on this matter yet.\n\nA painful memory. I hope others can learn from my mistakes. Test your backups regularly to make sure they are still working. An ounce of foresight could have prevented a decade of regret.\n\n\n\nThat said, I'll do what I always do which is focus on building things, e.g. @Interledger. https://t.co/pCgObeAf4Z — Stefan Thomas (@justmoon) January 12, 2021\n\n3. Mt. Gox’s mysterious 850,000 BTC vanishing act\n\nMt. Gox — the largest Bitcoin exchange in the world at the time — declared bankruptcy in 2014 after a hacker stole 850,000 BTC, estimated to be worth $450 million at the time. The catastrophic collapse, veiled in intrigue, sent shockwaves throughout the crypto community, making investors and enthusiasts fearful and hopeless.\n\nThe unexplained circumstances surrounding the loss further added mystery to the story of Mt. Gox’s collapse. For a very long time, it was unknown exactly how the Bitcoin was stolen and who was behind the hack. The incident sparked investigations, legal disputes and rampant speculation within the crypto community.\n\nOn Oct. 9, the United States Justice Department charged Russian nationals Alexey Bilyuchenko and Aleksandr Verner with laundering around 647,000 BTC from the Mt. Gox hack. Bilyuchenko is also charged with operating the illicit exchange BTC-e from 2011 to 2017.\n\nAlmost 10 years later, the victims of Mt. Gox are still waiting for compensation.\n\n4. Gerald Cotten and the $215 million puzzle\n\nIn December 2018, Gerald Cotten, the CEO of QuadrigaCX, embarked on his honeymoon in India with his wife — a trip that would take a tragic turn. While in India, Cotten, who suffered from Crohn’s disease, faced complications from his illness and passed away, leaving the crypto world in shock.\n\nCotten was the only individual who held the keys to QuadrigaCX’s crypto vault, meaning he had sole access to millions of dollars worth of customer funds.\n\nUnlike other cryptocurrency exchanges, Cotten had not set up a fail-safe mechanism to ensure the transfer of these assets to others in case of his demise. This meant that, when he died, users were left with their funds stranded in the exchange’s wallets.\n\nThe public remained unaware of Cotten’s death for 36 days until January 2019, when the news surfaced. Following Cotten’s death, QuadrigaCX filed for creditor protection, acknowledging the exchange’s dire financial situation, with debts totaling $215 million in cash and Bitcoin owed to its 115,000 investors. Investors, already concerned about their investments, were now faced with a grim reality: their funds might be irretrievably lost due to the lack of access to the exchange’s holdings.\n\nAs investigations unfolded, suspicions regarding the authenticity of Cotten’s death arose. However, the emerging truth was equally shocking: the Ontario Securities and Exchange Commission revealed that before his demise, Cotten had depleted most of the funds through fraudulent trades. This revelation shattered investor trust.\n\n5. The enigmatic journey of the $1.06 billion Bitcoin heist\n\nIn 2018, the seventh-largest Bitcoin wallet at that time, containing a substantial 69,000 BTC, was unexpectedly discovered in a less explored corner of the internet.\n\nThe Bitcoin had been dormant since April 2013. The wallet’s origins were traced back to the shuttered Silk Road darknet market. The marketplace was closed in late 2013 due to illicit activities, and in 2015, its founder, Ross Ulbricht, received a double life sentence plus 40 years with no chance of parole.\n\nNotably, the funds had remained inactive for years after their initial deposit. Then, for the first time in seven years, the billion-dollar worth of BTC witnessed movement in 2018 out of the Bitcoin address 1HQ3Go3ggs8pFnXuHVHRytPCq5fGG8Hbhx.\n\nAccording to Tom Robinson, chief scientist and co-founder at Elliptic, an encrypted file had been circulating on hacker forums since its discovery, purportedly containing the cryptographic keys required to seize the BTC at this address. If genuine, cracking the password on this file would have allowed the BTC to be moved.\n\nApart from this movement, 101 BTC were sent to BTC-e in 2015, a cryptocurrency exchange notorious for being favored by money launderers that was subsequently taken down by U.S. law enforcement in 2017.\n\nAccording to Robinson, the transfer of the BTC could have been initiated by Ulbricht or a Silk Road vendor accessing their funds. However, the possibility of Ulbricht conducting a Bitcoin transaction from prison seemed unlikely. Alternatively, the encrypted wallet file might have been genuine, and the password could have been successfully cracked, enabling the BTC to be moved.\n\nUpon deeper scrutiny of the Bitcoin address, the United States Attorney’s Office and Internal Revenue Service criminal investigation agents discovered its connection to Individual X (individual’s identity known to concerned authorities), who was found to have hacked funds from Silk Road. Subsequently, following the investigation into the hack, law enforcement confiscated several thousand Bitcoin on Nov. 3, 2020, valued at around $1.06 billion at that time.\n\n6. The cryptocurrency conundrum of Brad Yasar\n\nBrad Yasar, an entrepreneur residing in Los Angeles, has spent numerous hours trying to regain access to his wallets that contain thousands of Bitcoin he mined during the technology’s early days, now valued at hundreds of millions of dollars. Unfortunately, he lost the passwords long ago and has stored the hard drives in vacuum-sealed bags, keeping them out of sight.\n\n“Through the years I would say I have spent hundreds of hours trying to get back into these wallets,” Yasar told The New York Times. “I don’t want to be reminded every day that what I have now is a fraction of what I could have that I lost,” he said.\n\n7. Gabriel Abed’s 800 Bitcoin loss in a laptop mishap\n\nIn 2011, Gabriel Abed, founder and chairman of Abed Group and co-founder of Bitt, suffered a significant loss when a colleague accidentally reformatted his laptop. This laptop held the private keys to a Bitcoin wallet, resulting in the loss of approximately 800 Bitcoin.\n\n“The risk of being my own bank comes with the reward of being able to freely access my money and be a citizen of the world — that is worth it,” Mr. Abed told The New York Times.\n\nMr. Abed said that the incident had discouraged him, stating that the transparent nature of Bitcoin granted him complete access to the digital financial realm for the very first time.\n\nLike many in the industry, I have made a lot of mistakes with my keys in the early days. In this latest New York Times article about persons who lost their keys, I recap a story of how a reformatted computer would result in a loss,…https://t.co/VNGtRDrPAI https://t.co/cmzxufUWsi — Gabriel Abed (@Gabriel__Abed) January 12, 2021\n\n8. The unfortunate erasure of Davyd Arakhmia’s cryptocurrency fortune\n\nDavyd Arakhmia, a Ukrainian politician, accidentally deleted an encrypted file from his hard drive containing 400 BTC, unknowingly discarding his private key. Before his political career, Arakhmia ran a business that accepted Bitcoin payments. In an attempt to create more storage space on his hard drive, he deleted the file along with a few movies.\n\nCryptocurrency security: The key to digital wealth protection\n\nIn the volatile cryptocurrency world, digital asset protection is critical. The tales of lost Bitcoin fortunes highlight how important it is to implement strong security measures. Safeguarding cryptocurrency holdings and ensuring private key accessibility should be top priorities for all investors.\n\nEssentials include secured connections, frequent backups and a trustworthy, self-custodial wallet. Moreover, two-factor authentication provides an additional line of protection, while distributing assets among several wallets protects against losses. Also, it is equally important to remain vigilant against phishing efforts and keep up with the latest developments in security procedures."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDEvcmFnaW5nLWJpdGNvaW4tYnVsbC1tYXJrZXQtYWhlYWQtYWNjb3JkaW5nLXRvLWtleS1pbmRpY2F0b3Iv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8wMS9yYWdpbmctYml0Y29pbi1idWxsLW1hcmtldC1haGVhZC1hY2NvcmRpbmctdG8ta2V5LWluZGljYXRvci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Raging Bitcoin Bull Market Ahead, According to Key Indicator - CoinDesk",
        "content": "A reading above 70 is often erroneously taken to represent overbought conditions and a sign of an impending bearish reversal. However, per technical analysis textbooks, an above-70 RSI, especially on longer duration charts, suggests bullish momentum is strong and the asset could continue to rally in the weeks ahead, similar to what happened in 2019 and 2020."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZ1dHVyZXMtaGlnaGxpZ2h0LWludmVzdG9ycy1idWxsaXNoLXZpZXctYnV0LXRoZXJlcy1hLWNhdGNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin futures data highlight investors' bullish view, but there's a catch - Cointelegraph",
        "content": "Bitcoin (BTC) price surged by 26.5% in October, and several indicators hit a one-year high, including the BTC futures premium and the Grayscale Bitcoin Trust (GBTC) discount.\n\nFor this reason, it’s challenging to present a bearish thesis for BTC as data reflects the post-FTX-Alameda Research collapse recovery period and is also influenced by the recent increase in interest rates by the United States Federal Reserve.\n\nDespite the positive indicators, Bitcoin price remains around 50% below its all-time high of $69,900, which was hit in November 2021. In contrast, gold is trading just 4.3% below its $2,070 level from March 2022. This stark difference diminishes the significance of Bitcoin’s year-to-date gains of 108% and highlights that Bitcoin’s adoption as an alternative hedge is still in its early stages.\n\nBefore deciding whether the improvement in Bitcoin futures premium, open interest and the GBTC fund premium signal a return to the norm or the initial signs of institutional investors’ interest, it’s essential for investors to analyze the macroeconomic environment.\n\nThe U.S. budget issue sparks Bitcoin’s institutional hope\n\nOn Oct. 30, the U.S. Treasury Department announced plans to auction off $1.6 trillion of debt over the next six months. However, the key factor to watch is the auction size and the balance between shorter-term Treasury bills and longer-duration notes and bonds, according to CNBC.\n\nBillionaire and Duquesne Capital founder Stanley Druckenmiller criticized Treasury Secretary Janet Yellen’s focus on shorter-term debt, calling it “the biggest blunder in the history of the Treasury.“ This unprecedented increase in the debt rate by the world’s largest economy has led Druckenmiller to praise Bitcoin as an alternative store of value.\n\nThe surge in Bitcoin futures open interest, reaching its highest level since May 2022 at $15.6 billion, can be attributed to institutional demand driven by inflationary risks in the economy. Notably, the Chicago Mercantile Exchange (CME) has become the second-largest trading venue for Bitcoin derivatives, with $3.5 billion notional of BTC futures.\n\nMoreover, the Bitcoin futures premium, which measures the difference between two-month contracts and the spot price, has reached its highest level in over a year. These fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are requesting more money to delay settlement.\n\nBitcoin two-month futures annualized premium. Source: Laevitas\n\nThe demand for leveraged BTC long positions has significantly increased, as the futures contract premium jumped from 3.5% to 8.3% on Oct. 31, surpassing the neutral-to-bullish threshold of 5% for the first time in 12 months.\n\nFurther bolstering the speculation of institutional demand is Grayscale’s GBTC fund discount, narrowing the gap to the equivalent underlying BTC holdings. This instrument was trading at a 20.7% discount on Sept. 30 but has since reduced this deficit to 14.9% as investors anticipate a higher likelihood of a spot Bitcoin exchange-traded fund (ETF) approval in the United States.\n\nNot everything is rosy for Bitcoin, and exchange risks loom\n\nWhile the data seems undeniably positive for Bitcoin, especially compared to previous months, investors should take exchange-provided numbers with caution, particularly when dealing with unregulated derivatives contracts.\n\nThe U.S. interest rate has surged to 5.25%, and exchange risks have escalated post-FTX, making the 8.6% Bitcoin futures premium less bullish. For comparison, the CME Bitcoin annualized premium stands at 6.8%, while Comex gold futures trade at a 5.5% premium, and CME’s S&P 500 futures trade at 4.9% above spot prices.\n\nRelated: Will weakness in Magnificent 7 stocks spread to Bitcoin price?\n\nThe Bitcoin futures premium, in the broader context, is not excessively high, especially considering that Bloomberg analysts give a 95% chance of approval for a spot Bitcoin ETF. Investors are also mindful of the general risks in cryptocurrency markets, as highlighted by U.S. Senator Cynthia Lummis’s call for the Justice Department to take “swift action” against Binance and Tether.\n\nThe approval of a spot Bitcoin ETF could trigger sell pressure from GBTC holders. Part of the $21.4 billion in GBTC holdings will finally be able to exit their positions at par after years of limitations imposed by Grayscale’s administration and exorbitant 2% yearly fees. In essence, the positive data and performance of Bitcoin reflect a return to the mean rather than excessive optimism.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sZWdlbmRhcnktaW52ZXN0b3Itc3RhbmxleS1kcnVja2VubWlsbGVyLXdhbnRzLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "'I don't own Bitcoin, but I should' — Legendary investor Druckenmiller - Cointelegraph",
        "content": "Billionaire investor Stanley Druckenmiller praised Bitcoin (BTC) for establishing a “brand” over the last decade and a half, admitting that while he doesn’t own any Bitcoin, he ought to.\n\nThe billionaire shared his latest thoughts on Bitcoin in an Oct. 30 interview with hedge fund manager Paul Tudor Jones, where he made comparisons between Bitcoin and gold as a store of value.\n\n“I’m 70 years old. I own gold. I was surprised that Bitcoin got going, but you know, it’s clear that the young people look at it as a store of value because it’s a lot easier to do stuff with. 17 years, to me, it’s a brand. I like gold because it’s a 5,000-year-old brand.” He added:\n\n“So, I like them both. I don’t own any Bitcoin, to be frank, but I should.”\n\nStanley Druckenmiller is one of the most successful hedge fund managers on Wall Street and is worth $6,200,000,000.\n\n\n\nHe says, “Young people look at #bitcoin as a store of value. It’s a brand. I like it. I dont own any, but I should”pic.twitter.com/DXjrnvE1Qc — Documenting ₿itcoin (@DocumentingBTC) October 30, 2023\n\nDruckenmiller previously held Bitcoin. However, in a September 2022 interview, he revealed he had sold it in light of central banks imposing tightening measures.\n\nHe did, however, say the digital asset sector would flourish in the event that people lose faith in the central banking system, making an example of the Bank of England after the British pound plummeted in mid-2022.\n\n“I could see cryptocurrency having a big role in a Renaissance because people just aren’t going to trust the central banks.”\n\nDruckenmiller founded Duquesne Capital Management in 1981 and closed the fund in 2010. During that time, he achieved an average annual return of 30% and never experienced a down year.\n\nHis investment philosophy revolved around holding a group of stocks long, a group of stocks short and using leverage to trade futures in times of rising and falling markets.\n\nHe’s also praised blockchain technology, predicting that a ledger-based system could replace the United States dollar as the world’s reserve currency in the future.\n\nIn 2021, Druckenmiller said Ethereum is like “Myspace before Facebook” and predicted that Ether (ETH) would eventually flip BTC.\n\nRelated: ‘Bitcoin is an international asset' — BlackRock CEO’s bullish remarks\n\nSentiment toward Bitcoin among Wall Street firms has warmed up over the last year, most notably evidenced by a wave of proposed Bitcoin exchange-traded fund filings from major financial firms.\n\nThe cryptocurrency industry still has its fair share of critics, though.\n\nCharlie Munger has called bitcoin Rat Poison.\n\n\n\nWarren Buffett has called it Rat Poison Squared.\n\n\n\nBut here's the thing.\n\n\n\nIf Rat Poison is a BIG *negative* (eg, -1,000,000), shouldn't Rat Poison Squared be an EVEN BIGGER *positive* (eg, +1,000,000,000,000)?\n\n\n\nIt's just math, folks! pic.twitter.com/UYobxYU08L — 10-K Diver (@10kdiver) July 2, 2021\n\nWell-known veteran investors Warren Buffett and Charlie Munger have long referred to Bitcoin and cryptocurrencies as “rat poison” and an asset class that produces no value.\n\nMagazine: Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vbmJjbW9udGFuYS5jb20vbmV3cy9kb2luZy1iZXR0ZXItYnVzaW5lc3MvZG9pbmctYmV0dGVyLWJ1c2luZXNzLWJld2FyZS1iaXRjb2luLWJvbnVz0gFgaHR0cHM6Ly9uYmNtb250YW5hLmNvbS9hbXAvbmV3cy9kb2luZy1iZXR0ZXItYnVzaW5lc3MvZG9pbmctYmV0dGVyLWJ1c2luZXNzLWJld2FyZS1iaXRjb2luLWJvbnVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Doing Better Business: Beware Bitcoin Bonus - NBC Montana",
        "content": "The BBB says it's received more than 170 complains and references to Bitcoin Bonus, that might also go by the name Bitcoin Mining, supposedly running out of Oregon City, Oregon, but is not registered with that state.\n\n\"They're telling these people that they've joined this program 364 days ago, and their initial investment has grown to this great pot of money, but they need to act within 24 hours to retrieve the funds before the account is closed out permanently and those funds are lost,\" said Logan Hickle of the BBB. \"So they're saying, you opened this account a year ago and it's about to close, so you only have 24 hours to get this money out. \"\n\nHowever, the BBB warns that that money doesn't exist at all, with no record of it.\n\n\"Typically, what people report to us, including people in Montana, is that they're told they must pay a small fee to convert the Bitcoin into U.S. currency, to transfer out those funds. They're usually told it's about $64,\" Hickle said.\n\nOne victim ended up paying a number of fees for the nonexistent payout. Another even looked Bitcoin Bonus up, didn't find anything, and assumed that meant other people profiting from it wanted to keep it under wraps.\n\n\"Scammers try to extend out these scams for as long as possible to get as much money as possible, hence, why people are paying those fees multiple times,\" Hickle said.\n\nA red flag is that somebody is reaching out about an account you don't remember opening.\n\n\"You also shouldn't give into these scare tactics If you've already sent them funds, and they are a legitimate business, your money won't just disappear,\" Hickle said. \"In previous scenarios, we've also seen threats of legal action if you don't pay their fees. In any case, just don't give into their scare tactics.\"\n\nFor more information, visit .\n\n\n\n\n\n\n\n"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvY3J5cHRvY3VycmVuY2llcy1iaXRjb2luLWZpbmlzaGVzLW9jdG9iZXItdXAtMjkv0gFdaHR0cHM6Ly93d3cuZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9jcnlwdG9jdXJyZW5jaWVzLWJpdGNvaW4tZmluaXNoZXMtb2N0b2Jlci11cC0yOS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Cryptocurrencies: Bitcoin Finishes October Up 29% - ETF Trends",
        "content": "This weekly update tracks some of the largest cryptocurrencies by market share: bitcoin and ether. We’ve also included XRP, as it was one of the largest cryptocurrencies when this series began. According to Wikipedia, a cryptocurrency is “a digital asset designed to work as a medium of exchange that uses cryptography to secure its transactions, to control the creation of additional units, and to verify the transfer of assets.” Cryptocurrency is a young asset class that has developed a reputation for price volatility; however, there are ETFs that could help mitigate risk for those investors seeking crypto exposure.\n\nBitcoin was the world’s first cryptocurrency and decentralized digital currency. The first bitcoin transaction occurred in early 2009 and has since grown worldwide. Ether is another cryptocurrency run on the Ethereum blockchain platform and has the second largest market share, despite being the newest of the three with its launch in July 2015. XRP, which is owned by Ripple and launched in 2012, was one of the larger cryptocurrencies for some time until new coins joined the market. We’ve included it here for reference.\n\nThe third-largest market share of cryptocurrency, tether, is a token “backed by actual assets.” It includes one U.S. dollar, one euro, or loans to affiliate companies and is controlled by the owners of Bitfinex. It’s a controversial cryptocurrency due to its alleged manipulation of crypto pricing. It is called a “stable coin” because it was designed to always be worth $1.00. We do not chart it because its price rarely changes.\n\nFor a better understanding of crypto market cycles, read more here.\n\nThe Latest Crypto Data (through October 31, 2023)\n\nBitcoin finished October up ~29% from September and is now up ~107% year to date.\n\nXRP finished October up ~16% from September and is now up over 70% year to date.\n\nEther finished October up ~9% from September and is now up ~50% year to date.\n\nAn index has been created to chart these three cryptocurrencies together, considering their significantly different pricing histories. Ether tops the chart, i.e., the price of an ether has changed the most out of all three cryptocurrencies.\n\nETFs associated with cryptocurrencies include: ProShares Bitcoin Strategy ETF (BITO), ProShares Short Bitcoin Strategy ETF (BITI), VanEck Ethereum Strategy ETF (EFUT), and Bitwise Ethereum Strategy ETF (AETH).\n\nOriginally published on Advisor Perspectives.\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtMzZrLWZvbWMtdGFyZ2V0LWJpdGNvaW4tdXB0b2JlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "BTC price gets $36K FOMC target as Bitcoin prints 29% 'Uptober' gains - Cointelegraph",
        "content": "Bitcoin (BTC) has seen its highest monthly close since May 2022 after “Uptober” delivered near 30% BTC price gains.\n\nBTC/USD 1-month chart. Source: TradingView\n\nMonthly close boosts Bitcoin bull market hopes\n\nData from Cointelegraph Markets Pro and TradingView confirms Bitcoin bulls successfully held on to upside into Nov. 1.\n\nAfter navigating a choppy mid-month trading environment, hodlers were treated to a finale similar in character to October’s initial breakout.\n\nMonitoring resource CoinGlass thus put October as the second best-performing month of 2023. Bitcoin gained 28.5%, trailing only January’s 39.6%.\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nReacting, popular trader Bluntz cautioned over discounting what amounts to a “high timeframe weekly range breakout.”\n\n“I believe this current one will be akin to the oct 2020 ones and the april 2019 one,” he wrote in part of an X post around the monthly close.\n\nIn both scenarios, BTC/USD entered a new bullish phase, with straight upside lasting several months.\n\nBTC/USD comparison. Source: Bluntz/X\n\nStriking a similar note, fellow social media trading personality Moustache eyed the TK Crossover indicator for a rare bull market trigger.\n\nTK Crossover, which gets its name from a trading signal on the Ichimoku Cloud and involves two of its trendlines, Tenkan-sen and Kijun-sen, produced a once-in-a-cycle bull flag at the monthly close, he said.\n\n#Bitcoin\n\n\n\nThe monthly close for October is only a few hours away.\n\n\n\n-The last 3 times $BTC has closed above the Conversion Line () in the TK Cross-Indicator, we have seen a bull run in the following months (for at least ~300 days).\n\n\n\nSend it higher. pic.twitter.com/pvWrwm0XG7 — ⓗ (@el_crypto_prof) October 31, 2023\n\nOn a slightly more conservative note, on-chain monitoring resource Material Indicators suggested that bullish momentum, while still present, is waning compared to last month.\n\n“Still waiting for a retest of $33k, although we may not see it until after an attempt at $36k,” it told X subscribers alongside data from one of its proprietary trading tools.\n\nTrader eyes $36,000 BTC price after FOMC “fakeout”\n\nVolatility, meanwhile, remains on the menu for market participants, with the week’s main macroeconomic event due later in the day.\n\nRelated: There are now nearly 40M Bitcoin addresses in profit — A new record\n\nThis comes in the form of the United States Federal Reserve announcing its interest rate policy amid a testing inflation environment. Fed Chair Jerome Powell will also deliver a speech and hold a press conference.\n\nAs Cointelegraph reported, market expectations are for the Federal Open Market Committee (FOMC) to keep rates at current, albeit elevated, levels.\n\nAccording to the latest data from CME Group’s FedWatch Tool, the odds of that eventuality currently lie at nearly 98%.\n\nFed target rate probabilities chart. Source: CME Group\n\nCommenting on the potential knock-on effects for BTC price action, popular trader Crypto Tony looked to “more volatility and more movements as the talk begins and data is released.”\n\n“I personally expect a pause and no hikes, so I expect we see a $36,000 hit on this data following a fake out down first,” he added, joining calls for a tap of the $36,000 mark.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92YWxreXJpZS1hbWVuZHMtc3BvdC1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Crypto asset manager Valkyrie amends spot Bitcoin ETF filing - Cointelegraph",
        "content": "Digital asset manager Valkyrie Investments is the latest firm to amend its spot Bitcoin (BTC) exchange-traded fund (ETF) filing with United States securities regulators.\n\nValkyrie filed an updated spot Bitcoin ETF with the U.S. Securities and Exchange Commission (SEC) on Oct. 30, according to the SEC database.\n\nThe updated form S-1 registration statement for the Valkyrie Bitcoin Fund aims to offer investors an opportunity to invest in common shares backed by Bitcoin. The shares represent units of fractional undivided beneficial interest and ownership of the trust and are expected to be traded under the ticker symbol “BRRR” on the Nasdaq Stock Market.\n\n“The information in this prospectus is not complete and may be changed,” Valkyrie stated in the filing, adding that the firm is not allowed to sell BRRR securities until the registration statement is effective.\n\nThe amended filing comes about a month after the SEC delayed its decision on the Valkyrie Bitcoin Fund in late September.\n\nValkyrie’s updated spot Bitcoin ETF joins at least six other recently amended spot BTC ETF filings made by Bitwise, BlackRock, Fidelity, Grayscale, VanEck and ARK Invest.\n\nRelated: Are Bitcoin ETFs headed for one epic Gensler ‘rugpull?’ Analysts weigh in\n\nAccording to online crypto ETF analysts, the ongoing Bitcoin ETF amendments could be translated as a “good sign” of progress and impending approvals. Valkyrie’s latest spot Bitcoin ETF update is yet another evidence of movement happening behind the scenes, Bloomberg ETF analyst James Seyffart believes.\n\nUPDATE: @ValkyrieFunds joins the prospectus amendment train for their spot #Bitcoin ETF. Things still moving behind the scenes. pic.twitter.com/z5WAvZtFwE — James Seyffart (@JSeyff) October 30, 2023\n\nFollowing the recent amendments, at least five of the rest of the known spot Bitcoin ETF filers have not updated their filings, including firms like WisdomTree, Invesco and Galaxy, Global X, Hashdex and Franklin Templeton.\n\nThe SEC currently has eight to 10 filings of possible spot Bitcoin ETFs waiting for the regulator’s consideration, SEC chair Gary Gensler reportedly said in late October.\n\nMagazine: 6 Questions for Adelle Nazarian on crypto, journalism and the future of Bitcoin"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jYmMuY2EvZG9jdW1lbnRhcmllcy90aGUtcGFzc2lvbmF0ZS1leWUvc2VhcmNoaW5nLWZvci1zYXRvc2hpLXRoZS1teXN0ZXJpb3VzLWRpc2FwcGVhcmFuY2Utb2YtdGhlLWJpdGNvaW4tY3JlYXRvci0xLjcwMTM5OTLSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNzAxMzk5Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Searching for Satoshi: The Mysterious Disappearance of the Bitcoin Creator - CBC.ca",
        "content": "On January 3, 2009, a secretive software engineer with the pseudonym \"Satoshi Nakamoto\" launched the world's newest monetary invention: a cryptocurrency called bitcoin.\n\nJust over two years after bitcoin was introduced, Nakamoto vanished, with over one million bitcoin to his name. The mystery inventor's worth has reached as high as $70 billion, but not a single one of those bitcoins has ever traded hands or moved from Nakamoto's online wallet.\n\nAfter sending a few cryptic emails stating he \"may not be around,\" Nakamoto went silent and has not been heard from since early 2011.\n\nWhy did Nakamoto disappear? Some have speculated that he may have taken his own life. Or maybe he wanted to wash his hands of his bitcoin project, walking away from it all and maintaining his anonymity.\n\nIn this film, director and producer Paul Kemp goes on a worldwide journey to piece together the most compelling case yet for who Satoshi Nakamoto was and why he disappeared."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1nb3YtbWlzc2VkLWJpdGNvaW4tZ2FpbnMtdG90YWwtNmLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "'Sodl' too soon: US gov't missed Bitcoin gains now total $6B - Cointelegraph",
        "content": "Bitcoin (BTC), worth over $7.2 billion, is still controlled by the United States government — but its losses are mounting.\n\nData from on-chain analytics firm Glassnode shows that Washington’s seized Bitcoin total 210,429 BTC as of Oct. 31.\n\n195,000 BTC sold, $6.3 billion down\n\nThe U.S. Department of Justice (DOJ) and Internal Revenue Service (IRS) are well known — perhaps accidentally — as being one of the world’s largest Bitcoin whales.\n\nThrough various legal proceedings, lawmakers have confiscated vast amounts of BTC over the years, and only a small percentage of its takings have been resold at auction.\n\nThose who opted to buy the proceeds have profited considerably, and adding to the irony, the DOJ — more like a Bitcoin newbie than a whale — has been guilty of selling too soon.\n\nAccording to statistics compiled by Jameson Lopp, co-founder of Bitcoin custody firm Casa, the government has so far missed out on a grand total of over $6 billion in potential gains from its 195,092 BTC sell-off.\n\nLargest national and corporate Bitcoin holdings (screenshot). Source: BitcoinTreasuries\n\nNo single entity other than Satoshi Nakamoto owns more BTC than the DOJ. The largest corporate BTC treasury, for example, owned by MicroStrategy, currently consists of 158,245 BTC ($5.43 billion), per data from monitoring resource BitcoinTreasuries.\n\nHeavy Bitcoin bag\n\nGlassnode shows the DOJ stash growing in step with announcements of confiscations.\n\nRelated: There are now nearly 40M Bitcoin addresses in profit — A new record\n\nIn early 2022, its inventory increased by nearly 100,000 BTC — at the time worth $3.6 billion — thanks to legal action against individuals accused of attempting to launder the proceeds of a 2016 hack of major crypto exchange Bitfinex.\n\nU.S. government BTC balance chart. Source: Glassnode\n\nMeanwhile, billionaire Tim Draper, one of the original BTC auction bidders, recently accused the U.S. government of suppressing crypto growth.\n\nHaving previously predicted a $250,000 BTC price tag for 2022, Draper subsequently claimed that policy failures were “killing the golden goose of Silicon Valley.”\n\n“Regulations smother innovators,” part of an X post from May reads.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8xMDAtYnRjLXByaWNlLWJpdGNvaW4tb3ZlcnZhbHVlZC1zdG9ja3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "100%+ BTC price gains? Bitcoin faces 'massively overvalued' stocks - Cointelegraph",
        "content": "Bitcoin (BTC) will “reassert” itself to deliver over 100% annual BTC price gains, says one of the crypto industry’s major proponents.\n\nIn an interview with CNBC airing Oct. 5 and published Oct. 31, Dan Morehead, CEO of hedge fund Pantera Capital, predicted continued crypto expansion.\n\nMorehead: “We could easily see” 40% stocks meltdown\n\nBitcoin closed October up 29%, seeing its second-best month of 2023 and returning to 18-month highs in the process.\n\nEyeing macroeconomic conditions, however, Pantera’s Morehead and others are concerned about another risk asset class — what he describes as “massively overvalued” stocks.\n\n“Equities are overvalued because the P/E is the same level it was when rates were falling, but now rates are much higher and rising,” he told CNBC.\n\n“If you took the 50-year average equity risk premium with a 5.00% 10-year note, equities should be 23% lower than today.”\n\nMorehead referred to changing macro conditions in the United States, with interest rates at their highest in over 2 years.\n\n“I’m not saying -43% is going to happen overnight, but we have to keep in mind there have been two 13-year periods where equities were flat – in the 2000s and in the 70’s, 80’s,” he continued on the topic.\n\n“We could easily see that again.”\n\nDespite the grim prognosis, Morehead was complimentary of both Bitcoin and the largest altcoin, Ether (ETH), predicting the former to more than double every year, in line with average performance to date.\n\n“Bitcoin has a 14-year trend growth of 145% a year,” he stated.\n\n“That’s my generic forecast – it will re-assert its trend and will more than double every year.”\n\nBitcoin, Ether quarterly returns (screenshot). Source: CoinGlass\n\nBTC price risks prehalving collapse\n\nThe good times for BTC price performance may only follow a fresh bout of pain for hodlers.\n\nRelated: Bitcoin beats S&P 500 in October as $40K BTC price predictions flow in\n\nPrior to the 2024 block subsidy halving, some are concerned that a major retracement could enter.\n\nFor Filbfilb, co-founder of trading suite DecenTrader, the timing will likely focus on a month before the halving — around March next year.\n\nA month before or so seems the meta. — filbfilb (@filbfilb) November 1, 2023\n\nShould this come as a result of an equities comedown, the scenario is not clear cut.\n\nAs Cointelegraph reported, Bitcoin has nonetheless managed to ditch its positive correlation to stocks, something which research firm Santiment this week called a classic early bull market signal.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nYXJ5LWdlbnNsZXItcG9zdHMtaGFsbG93ZWVuLXRpbmdlZC0xNzQ5NTk3NTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Gary Gensler Posts Halloween-Tinged Wishes for Bitcoin White Paper Anniversary - Yahoo Finance",
        "content": "At times, it seems like Gary Gensler enjoys playing a cartoon villain version of himself, taunting crypto and taking the industry's backlash in return.\n\nHe's back at it today, wishing a \"happy 15th anniversary to Satoshi’s famous white paper that started crypto.\"\n\nThe SEC chair added Halloween spice to his comments on X, asking, \"if Satoshi Nakamoto went as Satoshi Nakamoto for Halloween, would we be able to tell?\"\n\nCrypto Twitter took the bait. One of the many replies came from X user by the name of @crypto_rand and said, \"if you went as Mr Burns, would we be able to tell?\"\n\nA picture of Gary Gensler next to Simpson's villain Mr. Burns\n\nThe continued back and forth between Gensler and the crypto community seems almost playful, except the Chair's antagonism has very real consequences to businesses and users.\n\nHe ends the post recommending crypto companies that are \"tricking\" investors, to start \"treating\" them to \"compliance with the securities laws.\"\n\nHilarious.\n\nTo continue reading this as well as other DeFi and Web3 news, visit us at thedefiant.io"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9uby1jb25jZXJucy1vdmVyLWJpdGNvaW4taGFsdmluZy1zdXBwbHktc2hvY2stc2F5cy1iaXR2YXZvLWNlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "No concerns over Bitcoin halving supply shock, says Bitvavo CEO - Cointelegraph",
        "content": "Supply and demand dynamics could mitigate concerns of a potential Bitcoin (BTC) market supply shock during the upcoming mining reward halving in 2024, according to Bitvavo CEO Mark Nuvelstijn.\n\nThe co-founder of the Netherlands-based cryptocurrency exchange weighed in on Bitcoin-related market movements in conversation with Cointelegraph during the European Blockchain Convention held in Barcelona.\n\nRelated: There are now nearly 40M Bitcoin addresses in profit — A new record\n\nNuvelstijn expressed his belief that exchanges would likely have sufficient Bitcoin supply to meet the demand from users:\n\n“If there’s more demand, the price will increase, and it will keep increasing until there’s a match between price and demand.”\n\nThe Bitvavo CEO added that the potential booming demand for Bitcoin would increase prices until demand cools and prices stabilize. As a result, Nuvelstijn is not concerned that exchanges like his would run out of BTC to meet trading demands:\n\n“As a platform, we’re agnostic to that. We are just matching buy and sell orders to make trades possible. If there’s a lot of demand for Bitcoin, it’s only a good thing for the sector.”\n\nNuvelstijn also weighed in on Bitcoin exchange-traded fund (ETF) applications filed in the United States over the past year and the potential impact their approval could have on the value of Bitcoin:\n\n“We’ve seen more attention, more interest in the crypto market. You saw how steeply the Bitcoin price increased over the past two weeks. It was up 20 or 30 percent, which is a massive jump.”\n\nBitvavo has seen an increase in web traffic, as well as customers visiting their platform and using their app. The exchange has onboarded new customers as well, while Nuvelstijn added that these numbers were still short of the levels it saw in 2021:\n\n“As you mentioned, the ETFs are not yet approved, right? So this is, let’s say, a pre-event. The event itself still needs to happen.”\n\nNuvelstijn also explained that while Bitvavo’s core markets remain the Netherlands and Belgium, it is eyeing steady expansion into jurisdictions including France, Spain and Italy. He also believes that the European Union’s Markets in Crypto-Assets (MiCA) will drive market maturity and ease of doing business:\n\n“It will open up the European market, so you no longer need a license per country. The regulation will become more harmonized, meaning you can easily do cross-border business.”\n\nNuvelstijn also sees MiCA laying the foundation for cryptocurrency companies to offer more financial services, drawing comparisons to conventional financial regulations:\n\n“It will be easier for crypto companies to offer financial services and for financial services to offer crypto services. I think you will see those kinds of business models being more commingled.”\n\nA report from a Standard Chartered analyst in July 2023 suggests that growing institutional demand for Bitcoin could drive the price of BTC to around $120,000 by the end of the year, driven by increased mining profitability, which will ease the need to sell mined coins.\n\nMagazine: The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMzEvYml0Y29pbi1qdXN0LWZvcm1lZC1hLWJ1bGxpc2gtZ29sZGVuLWNyb3NzLXdoYXQtbm93LWFmdGVyLXRoZS1yYWxseS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin just formed a bullish 'golden cross' signal. What it means after the cryptocurrency's recent rally - CNBC",
        "content": "The bitcoin price chart just flashed a bullish signal that typically heralds a big rally is on the horizon. On Monday, the cryptocurrency formed a \"golden cross,\" a pattern that's drawn when the 50-day moving average crosses through, and above, an ascending 200-day moving average. Traders and analysts use it as an indicator that a market trend is about to turn more positive. The opposite, or so-called death cross, indicates a bearish change. \"Golden and dark crosses tend to develop during overbought or oversold environments respectively,\" Rob Ginsberg, an analyst at Wolfe Research, told CNBC. \"They help to reinforce the improving or deteriorating trend but, by definition, they lag the price action that has already occurred, which is why you tend to see modest consolidation after such a signal.\" Bitcoin has already turned higher, as growing optimism around the likelihood a bitcoin exchange-traded fund will debut in coming months pushed its price to $35,000 last week. The cryptocurrency finished the week up 10%, its best week since June, according to Coin Metrics. While it wouldn't surprise analysts to see the price pull back after a rally of that size, bitcoin is still near its latest peak. Ari Wald, a chart watcher at Oppenheimer, sees the golden cross as a confirmation of the recent uptrend rather than an actionable price signal because the pattern occurs after the price has already moved. \"Every big price move starts with a positive cross, but not every positive cross leads to a big move,\" he told CNBC. Investors are closely watching the outcome of the Federal Reserve's policy meeting that wraps up Wednesday, and Chair Jerome Powell's language on the future direction of interest rates. Historically, a high rate environment has hurt bitcoin, and some traders are expecting current central bank policy to cast a shadow over crypto even in the face of two positive catalysts: the regulatory approval of an ETF and the Bitcoin halving. Bitcoin's 50-day moving average last closed above the 200-day average on Sept. 11. However, the last \"golden cross\" with an ascending 200-day moving average took place Feb. 11, according to Coin Metrics. The slope of the 200-day moving average should continue to point higher as long as the breakout above the second-quarter peaks hold, Wald said. — CNBC's Nick Wells contributed reporting."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aWxsLXdlYWtuZXNzLWluLW1hZ25pZmljZW50LTctc3RvY2tzLXNwcmVhZC10by1iaXRjb2luLXByaWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Will weakness in 'Magnificent 7' stocks spread to Bitcoin price? - Cointelegraph",
        "content": "The mega-cap tech stocks, which saw a robust start in 2023, are now grappling with massive trillion-dollar losses, leaving their shareholders concerned. Wall Street’s unease over surging bond yields and higher interest rates has cast a shadow on these companies. Traders are now pondering the potential impact on Bitcoin (BTC) if the S&P 500 downtrend continues.\n\nConsequently, investors must investigate the correlation between Bitcoin and the S&P 500 and consider whether cryptocurrencies can thrive in an environment of high interest rates.\n\nBloomberg Magnificent 7 index vs. S&P 500 equal weight index. Source: Bloomberg\n\nThe seven-largest tech companies, including Apple, Microsoft, Alphabet, Amazon, Nvidia, Meta and Tesla, collectively constitute a staggering 29% of the S&P 500, marking the highest concentration ever recorded in this stock market index. However, since the end of July, these tech giants have witnessed a substantial erosion in their market value, with a staggering $1.2 trillion loss.\n\nReal Money’s James DePorre notes that “73% of stocks in the market are more than 20% below their highs,” which technically defines a bear market. This underscores growing worries in the broader economy apart from the top seven stocks.\n\nIn its endeavor to regain credibility in combating inflation, the United States Federal Reserve has indicated its intention to maintain higher interest rates for an extended period. Crescat Capital warns that a significant decline in the S&P 500, coupled with a widening of corporate credit spreads, could elevate the likelihood of an economic downturn.\n\nHigher interest rates impact stocks and commodities\n\nCrescat Capital has also raised concerns about the wave of corporate and sovereign debt maturing in 2024, which will necessitate refinancing at substantially higher interest rates. They recommend exposure to commodities due to their historical resilience during inflationary periods, exacerbated by the challenge faced by commodity producers in investing in fixed assets.\n\nDespite the vast difference in market capitalization, totaling $10.5 trillion for Apple, Microsoft, Google, Meta, Nvidia and Tesla, compared to cryptocurrencies (excluding stablecoins), which fall short by over nine times, there are some intriguing parallels.\n\nFirst, both markets exhibit a scarcity quality that correlates with the monetary base. In essence, both react similarly to the actions of the Fed, where increased circulation benefits scarce assets, while a restrictive policy with high interest rates favors fixed-income investments.\n\nAdditionally, the trend toward digitalization has transformed the way people use apps and mobile services, particularly in financial services. Given the limited adaptability of traditional providers, often due to regulatory constraints, it’s not surprising that the public is embracing cryptocurrencies, even in the form of stablecoins. The growing demand for fully digital services is a secular trend that positively influences both the crypto and tech sectors.\n\nDecoupling of the S&P 500 and cryptocurrencies\n\nThe performance of the top seven S&P 500 stocks can decouple from cryptocurrencies regardless of the time frame. Currently, Bitcoin is trading approximately 50% below its all-time high, while Apple and Microsoft are down 13% and 7% from their peaks, respectively. This discrepancy is partly due to investor concerns about a looming recession or a preference for companies with substantial reserves, whereas cryptocurrencies, excluding stablecoins, lack cash flow or earnings.\n\nHistorical 30-day correlation between Bitcoin/USD and S&P 500 futures. Source: TradingView\n\nFrom an investment standpoint, stocks and cryptocurrencies inhabit different realms, but this contrast underscores how Bitcoin can grow independently of retail adoption and spot exchange-traded funds (ETFs), as evident by MicroStrategy’s $5.4 billion direct investment in the cryptocurrency.\n\nRelated: ‘Sodl’ too soon: US gov’t missed Bitcoin gains now total $6B\n\nThe top seven tech companies hold a combined $596 billion in cash and equivalents, enough to purchase the entire circulating supply of Bitcoin, assuming 3.7 million coins are lost forever. Furthermore, these companies are projected to generate $650 billion in earnings within the next five years. So, even if those companies continue to decline, their cash position could eventually shift to commodities including Bitcoin.\n\nMeanwhile, the U.S. housing market, another pinnacle of savings for the economy, is facing problems of its own due to record-high mortgage rates. Sales of previously owned homes in September dropped to the slowest pace since October 2010, according to the National Association of Realtors.\n\nUltimately, a downturn in the S&P 500, whether driven by mega-cap tech stocks or other factors, may not necessarily spell doom for cryptocurrencies. Investors often seek diversification to mitigate risk, and Bitcoin’s low correlation with traditional markets, along with early signs of trouble in the real estate sector, offers an attractive condition for alternative hedges, as signaled by legendary investor Stanley Druckenmiller.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJnby1ibG9ja2NoYWluLXJlcG9ydHMtMzUtbG93ZXItYml0Y29pbi1wcm9kdWN0aW9uLWluLWRlY2VtYmVyL9IBc2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJnby1ibG9ja2NoYWluLXJlcG9ydHMtMzUtbG93ZXItYml0Y29pbi1wcm9kdWN0aW9uLWluLWRlY2VtYmVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Argo Blockchain Reports 35% Lower Bitcoin Production in December - Finance Magnates",
        "content": "Argo Blockchain (NASDAQ:ARBK), a publicly-listed crypto mining Crypto Mining Cryptocurrency mining is defined as the process through which the transactions of a digital currency are authenticated then published to blockchain. For every crypto transaction conducted, a crypto miner is in charge of authenticating the information which, if approved, is then updated in the blockchain. Currently, the most popular cryptocurrencies being mined are Bitcoin, Litecoin, Ethereum Classic, Monero, and DASH. How is Cryptocurrency Mined?The process of crypto mining itself involves the s Cryptocurrency mining is defined as the process through which the transactions of a digital currency are authenticated then published to blockchain. For every crypto transaction conducted, a crypto miner is in charge of authenticating the information which, if approved, is then updated in the blockchain. Currently, the most popular cryptocurrencies being mined are Bitcoin, Litecoin, Ethereum Classic, Monero, and DASH. How is Cryptocurrency Mined?The process of crypto mining itself involves the s Read this Term company, published its December 2022 operational update on Wednesday, showing a significantly lower Bitcoin (BTC) production amidst the mining operations halt at the Texan mine.\n\nArgo Reports Lower Bitcoin Production Due to Harsh Winter\n\nAccording to Argo's trading update, the company mined 147 Bitcoins during the month of December, compared to 198 BTC produced a month earlier. Seasonal conditions triggered the slump of 35% month over month (MoM): the miner halted its operations at the Helios facility in Dickens County, Texas, due to the severe winter that hit the United States and caused additional load on the electric network.\n\n\"During the winter storm, Argo joined other Texas Bitcoin miners in reducing power usage by an estimated 1,500 MW, according to the Texas Blockchain Council. Argo has always committed to being a good community partner, and the company is proud to have contributed to the stability of the Texas power grid during the winter storm,\" the company commented in the press release.\n\nArgo's Bitcoin digging revenue in December came in at $2.49 million, slipping 39% MoM from the $3.456 million reported in November. At year-end, the publicly listed miner held 141 Bitcoins in its vault, most of which (116) were \"Bitcoin Equivalents.\" The company's total hash rate remained at 2.5 EH/s.\n\nKeep Reading TradingView Enhances DeFi Tools on Polygon via QuickSwap Partnership\n\nAhead of the US cash market opening on Wednesday, Argo shares reacted to the trading update rising 1.04% to $27.09. They are now growing more than 40% from last year's lows set in October.\n\nGalaxy Saves Argo from Bankruptcy\n\nAt the end of last year, Argo Blockchain was facing potential bankruptcy Bankruptcy Bankruptcy or insolvency constitutes a legal term and refers to being unable to repay debts. A business and a person can declare bankruptcy. When a person or company claims bankruptcy, it is described as a voluntary bankruptcy, and when your debtors force you into bankruptcy, it is referred to as involuntary. A voluntary bankruptcy occurs when the debtor or borrower, the party that owes the money files with the courts. Involuntary bankruptcy happens when your credits file a petition with the co Bankruptcy or insolvency constitutes a legal term and refers to being unable to repay debts. A business and a person can declare bankruptcy. When a person or company claims bankruptcy, it is described as a voluntary bankruptcy, and when your debtors force you into bankruptcy, it is referred to as involuntary. A voluntary bankruptcy occurs when the debtor or borrower, the party that owes the money files with the courts. Involuntary bankruptcy happens when your credits file a petition with the co Read this Term. However, the company dismissed the Chapter 11 bankruptcy grim vision due to a strategic deal with Galaxy Digital Holdings, Ltd, a financial firm focused on digital assets, owned by Mike Novogratz.\n\nArgo decided to sell its Texas-based crypto mine Helios for $65 million and use a new loan from Galaxy to refinance its current debt obligations take out to finance the development of its ongoing business.\n\n\"This transaction with Galaxy is a transformational one for Argo and benefits the company in several ways. It reduces our debt by $41 million (£34 million) and provides us with a stronger balance sheet and enhanced liquidity to help ensure continued operations through the ongoing bear market,\" Peter Wall, the Chief Executive of Argo Blockchain, said.\n\nNot Everyone Was So Lucky\n\nAlthough Argo Blockchain was able to save itself from bankruptcy, not every company in the crypto space was as fortunate. The prolonged crypto winter fueled by the collapse of FTX cryptocurrency exchange led to the collapse of BlockFi, a popular cryptocurrency lender and caused Midas Investment, a digital assets company from the DeFi space, to declare bankruptcy in late December.\n\nMeanwhile, the insolvency of the Terra ecosystem in May caused the bankruptcy of Three Arrows Capital, a crypto hedge fund, and two lenders, Celsius Network and Voyager Capital."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi10by1tb3JlLXRoYW4tZG91YmxlLWZyb20tYWxsLXRpbWUtaGlnaC10by0kMTUwMDAwLWJ5LTIwMjUtYmVybnN0ZWluLWZvcmVjYXN0czrSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin To More Than Double From All-Time High To $150000 by 2025, Bernstein Forecasts: Report - Nasdaq",
        "content": "Bitcoin (CRYPTO: BTC) prices could surge to $150,000 by 2025, global asset management firm Bernstein forecasted amid positivity surrounding the spot Bitcoin ETF approval, as cited by CNBC.\n\nBernstein analyst Gautam Chhugani believed the approval was likely to come by the first quarter of 2024.\n\nThese estimates come on the heels of Benzinga’s Future Of Digital Assets Event in New York scheduled on Nov.14. Attend and learn more about the Bitcoin price rally and the optimistic sentiment surrounding the industry. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\nPrice Action: Bitcoin prices at the time of writing are trading sideways after peaking at $34,971 at noon ET on Wednesday.\n\nThe ETF approval should lead to a shift of up to 10% of Bitcoin’s circulating supply toward ETFs as conventional investors will get Bitcoin exposure directly from investment portfolios.\n\nAlso Read: Bitcoin's Supply Crunch: 'Shock' Looms As Exchange Balances Hit Record Lows — Is This The Next Bull Run?\n\n“You may not like Bitcoin as much as we do, but a dispassionate view of Bitcoin as a commodity, suggests a turn of the cycle,” Chhugani added.\n\nThe estimate for Bitcoin prices comes in a note where the analyst has initiated coverage on several Bitcoin mining firms, saying that the Bitcoin halving event in April 2024 will lead the losing miners to move out of the industry thereby leading the survivors to gain big.\n\nIt is optimistic about Riot Platforms and CleanSpark citing Bitcoin mining as a high-beta strategy for gaining exposure to the market.\n\nLast week, Bitcoin prices cams close to breaching $35,000 amid optimism of a spot ETF approval, included in the eligibility list of DTCC listing. The current prediction is around five times the current price levels and more than double its all-time high of $68,789.63 in November 2021.\n\nIndustry titans BlackRock, DTCC, OCC, State Street, Société Générale, Hedera, Citi, BMO, Northern Trust, Citibank, Amazon, S&P Global, Google, Invesco, and Moody’s will join Benzinga on Nov. 13 for Fintech Deal Day and Nov. 14 for Future of Digital Assets. Secure a spot here to join them and learn more about Bitcoin and its performance.\n\nRead Next: Here's Why Bitcoin's Bullish Momentum Is Far From Over: The Factors Driving King Crypto's Surge\n\nPhoto: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pbnZlc2NvLWdhbGF4eS1zcG90LWJpdGNvaW4tZXRmLWFkZGVkLXRvLWR0Y2Mtd2Vic2l0ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Invesco Galaxy spot Bitcoin ETF joins BlackRock on DTCC site - Cointelegraph",
        "content": "The ticker for Invesco and Galaxy’s spot Bitcoin (BTC) exchange-traded fund (ETF) — BTCO — has appeared on the Depository Trust and Clearing Corporation’s (DTCC) website, marking a step forward in the application process for the two asset managers.\n\nInvesco Galaxy Bitcoin ETF listed on the DTCC’s site. Source: DTCC\n\nThe ETF has been added to the list sometime in the last six days, with the web archiver Wayback Machine showing no listing under the ticker BTCO was present on Oct. 25.\n\nA ticker added to the list of “ETF Products” on the DTCC’s site is not a guarantee of future approval for that product.\n\nA DTCC spokesperson said it is standard practice for the DTCC to add securities to the NSCC security eligibility file “in preparation for the launch of a new ETF to the market.”\n\n“Appearing on the list is not indicative of an outcome for any outstanding regulatory or other approval processes,” the spokesperson added.\n\nThe application for the joint spot Bitcoin ETF managed by global investment firm Invesco and crypto asset fund Galaxy Digital was reactivated on June 21.\n\nAnd now Invesco has reactivated their 19b-4 for their spot ETF https://t.co/D2zTpqrqJH — Eric Balchunas (@EricBalchunas) June 20, 2023\n\nThe move to re-lodge the application with the Securities and Exchange Commission came amid a tidal wave of similar filings for spot Bitcoin ETF products — brought about by investment giant BlackRock lodging its landmark application for a spot Bitcoin ETF on June 15.\n\nMagazine: Beyond crypto — Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZGVjcnlwdC5jby8yMDM3MjEvZG8tYml0Y29pbmVycy1ldmVuLXdhbnQtYW4tZXRm0gE-aHR0cHM6Ly9kZWNyeXB0LmNvLzIwMzcyMS9kby1iaXRjb2luZXJzLWV2ZW4td2FudC1hbi1ldGY_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin ETF: What Could Go Wrong? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA Bitcoin exchange-traded fund (ETF) is on its way to Wall Street, if market prognosticators are to be believed, and this will be great for the crypto industry.\n\nThat’s not as universally believed as recent price rallies might suggest.\n\nAnalysts from CryptoQuant said that the approval of such a product—which investors have been waiting on for over 10 years—will mean institutions flood the space with cash, in turn leading the price of Bitcoin to rocket.\n\nThis may—or may not—be true. Others, like Hayden Hughes, co-founder of social-trading platform Alpha Impact, who spoke to Bloomberg, have posited that the approval of a Bitcoin ETF has already been priced in, meaning there’s a low chance the price will sustain any massive gains.\n\nBut even if the market cap and price of Bitcoin does go through the roof and the entire crypto industry thrives, will it be a good thing? Privacy-focused Bitcoiners have even said that such a product goes against everything that Bitcoin stands for.\n\nExperts like those at Nym Technologies and Wasabi Wallet previously told Decrypt that Wall Street interest in the cryptocurrency could lead governments to strongarm crypto users into restriction, penalties, or taxes.\n\nThe reasoning is that lawmakers are already cracking down on the crypto industry and are increasingly focused on anti-money laundering (AML) procedures—as seen with major crypto brands like Coinbase and Binance.\n\nOthers have argued that with Wall Street titans barging in on the market, the cryptocurrency will become more centralized and correlated with traditional stocks. Bitcoiners have been waiting and hoping for years that the coin would decouple from securities.\n\nAD\n\nAD\n\nBob Bodily, CEO of Ordinals marketplace Bioniq, told Decrypt that a Bitcoin ETF could ruin Bitcoin’s original censorship resistant promise.\n\n“The worry with a Bitcoin ETF is that we’ll have so much Bitcoin locked up in ETFs that now we have compromised the original vision for Bitcoin where we have tons of Bitcoin in ETFs that are highly correlated to stocks, behave like stocks, people buy and sell them like stocks and in the large majority of cases we’re going to have central custodian ownership,” he said.\n\nBodily was referring to Bitcoin’s quality of allowing anyone to use the network and make transactions—without getting shut down by a government or authority. The idea is that anyone who can download Bitcoin wallet software, run a node, and complete transactions can do so without being stopped. And typically it’s hard to stop that.\n\nBut if Bitcoin ETFs on Wall Street and centralized custodians become the norm—and perhaps the only known way—for people to get exposure to Bitcoin, users could eventually get banned from the network.\n\n“As long as you can self-custody, then you can be a unique, individual participant in the Bitcoin network,” added Bodily. “If Bitcoin ETFs become the only legal way to access Bitcoin, and self-custody is illegal (like Gold was back in the 70s), then this would compromise Bitcoin’s core value proposition because people couldn’t legally self-custody their assets.”\n\nCraig Raw, developer of the Bitcoin Sparrow Wallet, added that privacy and profits don’t always go hand-in-hand. While the cypherpunks, advocates who want social change via cryptographic tools, want people to have private interactions. Institutions care about their bottom line, “Sometimes these goals will align, sometimes they will not,” Raw said.\n\n“What is key to the cypherpunks is that individuals can continue to find privacy in the tools regardless of institutional adoption,” he explained. Such tools already exist in the Bitcoin and wider crypto world. There are apps, like CoinJoin, which people use to obfuscate Bitcoin transactions.\n\nThere are already tensions between privacy advocates in the crypto world and authorities: feds last year banned U.S. citizens from using the Tornado Cash app, a ‘coin mixer’ which allows users make private transactions on the Ethereum network; America’s biggest crypto exchange Coinbase then slammed the government’s reasoning for doing so and has since funded a lawsuit against the Treasury department.\n\nAD\n\nAD\n\nLarry Fink, BlackRock CEO, says crypto \"is digitizing gold\" and \"#Bitcoin is an international asset.\" pic.twitter.com/et1nT4c3FZ — Real Vision (@RealVision) July 6, 2023\n\nThe idea that traditional finance entering the crypto world isn’t necessarily good is not a new one.\n\nCustodia Bank CEO Caitlin Long said back in 2018 that while such a product could be good for the industry, the financialization of the crypto world could be bad if it leads to too much liquidity from leveraged traders wanting quick, short-term gains entering the market.\n\nThis in turn could push long-term HOLDers to “resist it simply by keeping their coins away from the financial system.”\n\nAnalysts right now say that—for better or worse—it’s now just a matter of time before a Bitcoin ETF hits Wall Street. JP Morgan has even said it could happen before Christmas. The product is likely to lead to a ton of money flooding into the space—but will Bitcoin keep its original qualities?\n\nEdited by Stacy Elliott."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93YXJyZW4tYnVmZmV0dC1jcnlwdG8tbnUtc3RvY2stYXBwbGUtYW1hem9uLTIwMjMtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Warren Buffett's 'crypto stock' beats Apple and Amazon — but not Bitcoin - Cointelegraph",
        "content": "Warren Buffett may still view cryptocurrencies and Bitcoin (BTC) as “rat poison squared,” but he is generating big profits from his position in a crypto-friendly bank in 2023.\n\nWarren Buffett’s “crypto bet” up $130 million in 2023\n\nThe “Oracle of Omaha” purchased 107 million shares of Nu Holdings, a Brazil-based fintech company and owner of the crypto-friendly Nubank, via his firm, Berkshire Hathaway, in two separate rounds in 2021.\n\nBerkshire invested $500 million in Nu Holdings in June 2021 and raised its stake by another $250 million in December 2021. The firm has not sold a single share since, according to its second quarter 2023 earnings report.\n\nNu’s share price is currently up nearly 106% year-to-date (YTD), meaning Buffett’s $750 million position is now worth around $879.50 million, assuming Berkshire has still not sold any of its Nu shares. However, at its peak in February 2022, the position was worth over $1 billion.\n\nNu daily price chart. Source: TradingView\n\nWhy is Nubank crypto-friendly?\n\nNubank has been dubbed crypto-friendly because some of its divisions offer crypto-related services to over 1.35 million users. Therefore, investing in Nubank can be seen as having indirect exposure to the cryptocurrency industry.\n\nThat includes Easynvest, a trading platform that offers a Bitcoin exchange-traded fund (ETF) product, and Nubank, a digital financial services platform that offers BTC and Ether (ETH) trading. Nubank also launched a loyalty token on the Polygon blockchain.\n\nMoreover, Nu Holdings allocated 1% of its cash holdings to Bitcoin in May 2022.\n\n“This move reinforces the company’s conviction in Bitcoin’s current and future potential in disrupting financial services in the region,” Nubank stated at the time.\n\nNubank is the largest fintech bank in Latin America, with over 80 million customers in Brazil.\n\nNu crushes Apple and Amazon stocks\n\nUnderperforming Nu stocks are Buffett’s other top holdings, Amazon and Apple, which have gained 54.65% and 36%, respectively. Apple is by far the biggest holding of Berkshire Hathaway, comprising roughly 45% of its $354 billion investment portfolio as of September 2023.\n\nRelated: Bitcoin continues to outperform Warren Buffett’s portfolio, and the gap is set to widen\n\nNu has also outperformed Berkshire Hathaway’s stock, which has risen 9.25% YTD.\n\nNu vs. Amazon, Apple and Berkshire Hathaway YTD performance chart. Source: TradingView\n\nBitcoin price performance catches up with Nu stock\n\nNevertheless, Bitcoin has finally caught up to the price performance of Nu stock this year. In fact, BTC price is now also up 106% YTD amid “Uptober” and recent Bitcoin ETF euphoria.\n\nNu vs. BTC/USD YTD performance chart. Source: TradingView\n\nInterestingly, Bitcoin’s rapid rise to catch up with Nu over the past weeks has coincided with BTC decoupling from the stock market in October.\n\nBut while this is generally seen as a bullish sign, some commentators argue that Bitcoin ETF “hopium” is the driver of BTC price gains presently.\n\nIndeed. Lots of historical data that shows bitcoin is tightly correlated to the stock market. The recent “decoupling” is driven imo by hopium over the ETF. But a significant downturn in stocks will bring BTC back to earth. pic.twitter.com/5hk523j3Gp — Joe Carlasare (@JoeCarlasare) October 26, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yaXNpbmctbTItc3VwcGx5LWNyeXB0by1zdXBlcm1hc3NpdmUtYmxhY2staG9sZS1yYW91bC1wYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Rising M2 money supply will see crypto become 'supermassive black hole' — Raoul Pal - Cointelegraph",
        "content": "The rising total money supply (M2) could propel crypto into another bull rally and help it outperform the traditional markets, according to Raoul Pal, co-founder and CEO of financial media platform Real Vision. Pal’s X post highlighted the correlation between the rising fiat market supply and the start of the crypto bull run.\n\nPal, in an X (formerly Twitter) post, shared a graph comparing Bitcoin’s (BTC) yearly performance against the global M2 money supply, indicating the simultaneous rise of Bitcoin and global M2 supply. Historically, the Bitcoin and cryptocurrency markets have started outperforming the traditional financial markets with a rise in global M2 supply.\n\nBitcoin vs. global M2 supply. Source: Global Macro Investor\n\nThe chart above shows that Bitcoin’s price is on the verge of decoupling from the traditional market with a rising M2 supply, which has been the case historically, as evident from the spike in BTC’s performance in 2021, 2017 and 2014.\n\nBitcoin/NDX vs. global M2 supply. Source: Global Macro Investor\n\nPal said he “loves Global M2... this is when BTC outperforms the NDX and crypto becomes the Super Massive Black Hole.”\n\nThe M2 is the amount the United States Federal Reserve estimates to be in circulation; it comprises all cash that people own and all money placed in savings accounts, checking accounts and other short-term savings instruments like certificates of deposit.\n\nRelated: First Bitcoin ETF trades $1.5B as GBTC ‘discount’ echoes $69K BTC price\n\nA Bitcoin bull run is often linked to the block reward halving every four years, with the next one scheduled for April 2024, as it reduces the market supply of BTC against growing demand. However, the halving is not the sole factor behind the surge, as several macroeconomic factors also play a key role.\n\nOver the past decade, Bitcoin’s price has made significant gains during the fast growth of M2, owing to a reduction in interest rates, quantitative easing and fiscal stimulus. On the contrary, during times of monetary tightening by central banks, the cryptocurrency market has struggled to gain bullish momentum. The 2021 bull market coincided with 6% or higher aggregate M2 growth at the Fed, European Central Bank, Bank of Japan and People’s Bank of China.\n\nMagazine: Beyond crypto — Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy13aGl0ZXBhcGVyLXR1cm5zLTE1LXNhdG9zaGktbmFrYW1vdG_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin white paper turns 15 as Satoshi Nakamoto's legacy lives on - Cointelegraph",
        "content": "Today marks 15 years since the pseudonymous creator of Bitcoin, Satoshi Nakamoto, shared the Bitcoin white paper to a mailing list of cryptographers on Oct. 31, 2008 — a date also annually celebrated as Halloween.\n\n“I’ve been working on a new electronic cash system that’s fully peer-to-peer, with no trusted third party,” Satoshi famously said in the opening sentence before linking the document titled “Bitcoin: A Peer-to-Peer Electronic Cash System.”\n\nSatoshi’s email notifying other cypherpunks about their release of the Bitcoin white paper. Source: Satoshi Nakamoto Institute\n\nThe white paper proposed a decentralized system that could facilitate peer-to-peer transactions, which could solve the “double spending” problem often associated with digital currency.\n\nIt proposed to achieve this via a network of nodes to validate and record transactions through a proof-of-work consensus mechanism, launching just two months later on Jan. 3, 2009.\n\nHow Bitcoin was brought to life\n\nSatoshi’s computer science breakthrough came on the back of other impressive developments in the cryptography and e-money spaces.\n\nThe first reference cited in the Bitcoin white paper is Wei Dai’s invention of B-money, an electronic peer-to-peer cash system that never launched but nonetheless played a key role in Satoshi’s plans for Bitcoin.\n\nLike Bitcoin, B-money proposed that participants in the system maintain a database of account balances, which keep track of the ownership of money. Transactions would be initiated and completed by a broadcast message to all participants, which would update the account balances of those involved in a specific transaction.\n\nIn many ways, it could be seen as a precursor to the nodes of Bitcoin’s protocol, which keep a record of the constantly growing blockchain.\n\nThis process requires proof-of-work, a form of cryptographic proof in which one party proves to others that a certain amount of a specific computational effort has been expended.\n\nSatoshi implemented this into Bitcoin, citing Adam Back’s invention of Hashcash in 1997, which incorporated proof-of-work to limit email spam and denial-of-service attacks.\n\nThe Cypherpunks and Fathers of #Bitcoin:\n\n\n\n• Hal Finney: Reusable PoW\n\n• Adam Back: Hashcash\n\n• Wei Dai: B-money\n\n• David Chaum: DigiCash\n\n• Nick Szabo: BitGold\n\n• Phil Zimmermann: PGP\n\n• Bram Cohen: BitTorrent\n\n• Tim May: Crypto Anarchist Manifesto\n\n\n\nAnd Satoshi Nakamoto: Bitcoin — Crypto Leroy (@TheBitLeroy) June 27, 2020\n\nTimestamps are another core property of Bitcoin, which was successfully implemented by Satoshi.\n\nBitcoin’s timestamp server works by taking a hash — akin to a unique serial number — of a block of transactions and timestamping it when the block is added to Bitcoin’s blockchain.\n\nThe hashes cryptographically link one block to the next, ensuring the integrity of Bitcoin data. Timestamps also prevent double spending on Bitcoin, making the network tamper-proof and immutable.\n\nSatoshi cited work from Henri Massias, Scott Stornetta, Stuart Haber and Dave Bayer in implementing timestamping into Bitcoin’s protocol.\n\nMeanwhile, Merkle trees were implemented into Bitcoin to verify transaction data through digital signatures. Satoshi cited Ralph Merkle’s work on developing public-key cryptosystems.\n\nDavid Chaum - \"DigiCash\" 1995\n\nR.C Merkle - \"Protocols for public key cryptosystems\" 1980\n\nAdam Back - Hashcash - \"A Deniel of Service Counter-Measure\" 2002\n\nNick Szabo - \"Bit Gold\" 2005\n\nWei Dai - \"b-money\" 1998\n\nSatoshi Nakamoto - \"Bitcoin: A Peer-to-Peer Electronic Cash System 2008 pic.twitter.com/EjfVsE4pDc — Crypto Shaman (@CryptoShaman256) September 10, 2022\n\nBitcoin advocate and cyperphunk Jameson Lopp previously told Cointelegraph that credit should be given to the preliminary projects that paved the way for Bitcoin.\n\nHowever, the genius in Satoshi was the puzzling of all these pieces into a fully functional system, said Lopp:\n\n“There’s no single piece of the puzzle that I think is more important than the others. Nakamoto’s genius was not any of the individual components of Bitcoin, but rather the intricate way in which they fit together to breathe life into the system.”\n\nWhat Bitcoin did\n\nBitcoin was, at the time, one of the first inventions to use cryptography to successfully separate money from the state. Satoshi’s invention enabled users to effectively bypass banks and financial institutions to transact with others — all around the world.\n\nThe first real-world transaction paid for in Bitcoin (BTC) came from Laszlo Hanyecz in May 2010, who bought two pizzas for 10,000 BTC.\n\nMainstream media highlighted Bitcoin’s increased use by criminals to launder funds, among other things, in the early days, but that narrative has continued to change.\n\nIt has become increasingly adopted around the globe. It was made legal tender in El Salvador in September 2021.\n\nPresident Bukele just announced that a new #Bitcoin City will be built in El Salvador.\n\n\n\nBitcoin will be legal tender. There will be 0% income, capital gains and property tax.\n\n\n\nA 10% VAT will serve as a key source of city revenue.\n\n\n\nThe city will be financed by a “bitcoin bond”. pic.twitter.com/CvCPvXvPIq — Peter Young (@petermiyoung) November 21, 2021\n\nFinancial institutions have also recently applied to offer spot Bitcoin exchange-traded funds (ETFs) in the United States, while others have launched their own Bitcoin ETFs in Europe.\n\nSeveral developments have been implemented to help Bitcoin scale and bring more use cases to the network.\n\nThe Lightning network was launched in 2018 to increase Bitcoin’s transaction speed by taking computation off-chain.\n\nRelated: BlackRock’s Bitcoin ETF: How it works, its benefits and opportunities\n\nNonfungible token-like Ordinals were launched on Bitcoin in January, which was made possible by the Taproot soft fork in November 2021.\n\nBitcoin’s price has also been on a wild ride.\n\nStarting out as cheap as a penny in 2009, BTC has endured several bull and bust cycles, with its price volatility swinging as large as 88% in some instances.\n\nBitcoin’s price since April 2013. Source: CoinGecko\n\nBTC is currently priced at $34,350, down 50% from its all-time high price of $69,000 on Nov. 10, 2021.\n\nMagazine: Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8yMDM5MTkvYml0Y29pbi0xNTAwMDAtYnktMjAyNS1iZXJuc3RlaW4td2FsbC1zdHJlZXTSAUxodHRwczovL2RlY3J5cHQuY28vMjAzOTE5L2JpdGNvaW4tMTUwMDAwLWJ5LTIwMjUtYmVybnN0ZWluLXdhbGwtc3RyZWV0P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Could Hit $150,000 by 2025, Says Formerly Bearish Wall Street Firm - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin's price could surge to $150,000 by 2025, according to a new prediction by investment research firm Bernstein.\n\nIn a note to clients on Tuesday, Bernstein analyst Gautam Chhugani cited optimism around the potential approval of a Bitcoin exchange-traded fund (ETF) by the Securities and Exchange Commission (SEC) in the next two years.\n\nAD\n\nAD\n\nAccording to a report from CNBC, Chhugani wrote in the note that he believes the SEC will likely approve a Bitcoin ETF in the first quarter of 2024. His prediction echoes that of JP Morgan analysts, who say there's a 90% chance investors get an BTC fund before January 10.\n\nBernstein, along with most other Wall Street firms, had ruled out BTC as an investment asset in 2018. But the company was still paying attention by tracking Bitcoin mining companies and publishing its own take on the contagion that spread from firm to firm in mid-2022.\n\nNow, the firm says, a Bitcoin ETF would allow mainstream investors to gain exposure to BTC directly from their portfolios for the first time via an SEC-regulated investment product. Currently, the only similar product is the Grayscale Bitcoin Trust (GBTC), which holds around 3% of outstanding BTC supply.\n\nThe $150,000 target is nearly five times Bitcoin's current price of around $34,000 and more than double its all-time high of $67,000 from November 2021. If realized, Bernstein's lofty prediction would signify a massive turnaround for the cryptocurrency from its steep sell-off last year.\n\nBitcoin has rallied recently, reaching $35,000 last week for the first time since May 2022. Investors are increasingly hopeful the SEC will approve a Bitcoin ETF after declining to appeal a court ruling in Grayscale's lawsuit. However, SEC Chair Gary Gensler has been highly critical of the crypto industry, so whether regulators will embrace a Bitcoin ETF remains uncertain.\n\nBernstein also noted the upcoming \"halving\" event in 2024 will help boost BTC's price by forcing out inefficient miners. The firm initiated coverage on several BTC mining stocks, expecting the survivors to see significant gains.\n\nAD\n\nAD\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Stacy Elliott."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluaW1pemUuY29tL2NvbnRlbnQvdGhlcmVzLWEtZnJlYWt5LWZyaWRheS10aGluZy1oYXBwZW5pbmctd2l0aC1iaXRjb2luLWFuZC1ldGhlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 16:22:07 GMT",
        "title": "Bitcoin and ether are in a 'freaky Friday' moment - Finimize",
        "content": "Something unusual is happening in the crypto world, and it feels a bit like that classic old body-swap movie trope: ether is suddenly less volatile than bitcoin – both on an implied, forward-looking basis and on a realized, historical basis. The T3 Ether Volatility Index – a measure of implied 30-day swings in the price of Ethereum’s coin, derived from options prices – is trailing a comparable gauge for bitcoin by a margin not seen since at least 2021. That's unusual because ether and alternative cryptocurrencies generally tend to be more volatile than bitcoin.\n\nAt the same time, the difference between the 180-day realized volatility (or historical volatility) of ether and bitcoin is at its smallest since 2020.\n\nWhat’s driving the trend?\n\nSome investors point to ether’s staking yield, which has been increasing this year and is now in an attractive spot: high-single-digits. A higher yield could suppress volatility as it encourages more traders to “stake” their ether. (Staking is when users lock up their existing coins for a fixed period to help operate the blockchain network and earn rewards). Bitcoin’s blockchain, meanwhile, has recently been roiled by an explosion of NFTs (something that used to be chiefly Ethereum’s domain) and meme coins after an upgrade allowed the two to be deployed on the network for the first time.\n\nWhy should you care?\n\nWell, according to some prominent crypto watchers, ether’s relatively tame behavior could spell good news for the world’s second-biggest cryptocurrency by attracting more long-term investors. That’s because lower volatility typically encourages big institutional investors to allocate more capital to the crypto, by making it cheaper to buy protection on it via options contracts and making it easier to manage overall risk exposures. Time will tell whether these dynamics prove to be the catalyst that pushes ether to break out above $2,000…"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMDEvMy1ncmVlbnNob290LXNlY3RvcnMtaW4tdGhlLWJsb2NrY2hhaW4tc3BhY2Uv0gFaaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8xMS8wMS8zLWdyZWVuc2hvb3Qtc2VjdG9ycy1pbi10aGUtYmxvY2tjaGFpbi1zcGFjZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "3 Greenshoot Sectors in the Blockchain Space - CoinDesk",
        "content": "Modularity is where different layers of the blockchain stack (consensus, execution, data availability etc.) are operated by different providers. This idea allows for increased composability in the form of lego-like “plug-and-play” blockchain architectures. This means that projects can customize their blockchain tech stack according to the specific demands of a consumer-facing application. Furthermore, increased smart-contract composability using general-purpose languages such as Rust allows for increased developer familiarity, reducing the barriers to entry for Web3 developers."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3VzLWZlZC1pbnRlcmVzdC1yYXRlLXByZXZpZXctdHdvLXNjZW5hcmlvcy1mb3ItYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2VzLTIwMjMxMDMxMTMxNNIBigFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy91cy1mZWQtaW50ZXJlc3QtcmF0ZS1wcmV2aWV3LXR3by1zY2VuYXJpb3MtZm9yLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcy0yMDIzMTAzMTEzMTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "US Fed interest rate preview: Two scenarios for Bitcoin and Ethereum prices - FXStreet",
        "content": "Bitcoin and Ethereum prices are close to key psychological levels, $34,400 and $1,800, ahead of the Federal Reserve’s interest rate decision.\n\nCryptocurrencies in the top 10 by market capitalization noted an increase in their prices in the week leading up to the Fed’s decision.\n\nTraders foresee a 98.2% probability that the US Federal Reserve will leave interest rates unchanged on Wednesday.\n\nBitcoin price rallied throughout October 2023, marking another profitable month for BTC holders. The upcoming US Federal Reserve interest rate decision has the potential to make or break Bitcoin’s price rally.\n\nAltcoins like Ethereum will probably follow Bitcoin’s coattails. A vast majority of market participants expect the interest rate to remain unchanged and a small percentage anticipate a rate cut by the US central bank.\n\nAlso read: Federal Reserve Preview: Powell set to lift US Dollar by leaving door open to more hikes\n\nUS Fed interest rate preview: Two scenarios for Bitcoin and cryptocurrency prices\n\nScenario 1: US Fed leaves rates unchanged\n\nAccording to the CME Fed Watch Tool, there is a 98% probability that the US Ccentral bank will leave interest rates unchanged on November 1. In September 2023, Bitcoin price noted no stark movements as the Fed left interest rates unchanged. A similar outcome is expected, in response to the Federal Reserve’s November 1 decision.\n\nCME Fed Watch tool and expectation of interest rate hike\n\nBitcoin price could witness short-term volatility, with BTC hovering close to the $34,400 level. BTC is likely to momentarily retrace its weekly gains of 4.33%, a recovery in the asset’s price could follow soon after.\n\nBitcoin’s rally is largely driven by the anticipation of a spot BTC ETF approval by the US financial regulator Securities and Exchange Commission (SEC). The SEC’s decision could therefore influence BTC price directly, as opposed to unchanged interest rates.\n\nScenario 2: US Fed cuts interest rates\n\nMarket participants believe that there is a 1.8% probability of an interest rate cut. In the event of a rate cut, risk assets like Bitcoin and altcoins are expected to rally. Typically, a rate cut makes it cheaper to borrow funds and engage in leveraging risk assets like Bitcoin for gains. An increase in demand and inflow of funds to the asset likely drive prices higher.\n\nIt is important to note that the interest rate cut is highly unlikely. Investors are focused on Fed Chair Jerome Powell’s speech to identify whether more interest rate hikes are on the horizon.\n\nExpert analysis on likelihood of further rate hikes\n\nYohay Elam, lead analyst at FXStreet analyzed the Fed’s interest rate decision and the possibility of future rate hikes in his post here. Elam notes that the Federal Reserve's overnight rate stands at a range of 5.25%-5.50%, above both measures of inflation. The US Central bank has slowed the pace of its rate hikes and settled for one interest rate increase in the past three meetings.\n\nWhile market participants expect another “no change” decision from the US Fed, the Central bank left room for another hike in 2023. Elam says,\n\n“The bank's dot plot showed a target of 5.6% by year-end, leaving the door open to another move. With no new forecasts at this juncture, Fed Chair Jerome Powell will likely insist on another move, leaving his options open. One reason to do that is the buoyant jobs market.”\n\nBitcoin and Ethereum prices hover at crucial levels\n\nBitcoin and Ethereum, the two largest cryptocurrencies by market capitalization are hovering around crucial levels, ahead of the bank’s decision on Wednesday. Bitcoin price sustained above $34,400 while Ethereum is trading above its $1,800 psychological level."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wYXlwYWwtc2NvcmVzLXVrLWNyeXB0by1saWNlbnNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "PayPal scores UK crypto license after brief local Bitcoin buy halt - Cointelegraph",
        "content": "Global payment giant PayPal has received approval from the Financial Conduct Authority (FCA) to offer crypto services in the United Kingdom.\n\nAccording to official FCA data, PayPal has been registered to offer “certain crypto asset activities” in the U.K. since Oct. 31, 2023.\n\nAccording to the register, PayPal has requirements or restrictions placed on the financial services activities that it can operate.\n\n“This includes, but is not limited to, ceasing on-boarding new customers and restricting existing customers to hold and sell functionality,” the information on the FCA register reads.\n\n“The firm cannot expand its current offering in crypto assets,” the register notes, adding that it’s “including, but not limited” to crypto exchange services, participation in initial coin offerings, staking, peer-to-peer exchange and decentralized finance activities such as lending and borrowing.\n\nPayPal UK status. Source: FCA\n\nPayPal reportedly became the fourth firm to receive the FCA’s crypto registration in 2023 after Interactive Brokers, Bitstamp and Komainu. The license acquisition comes shortly after PayPal briefly paused the ability for its U.K. customers to buy cryptocurrencies like Bitcoin in early October. The firm told Cointelegraph in August that it was working to comply with new regulations in the country.\n\nRelated: UK publishes plans for stablecoins regulation\n\nThe United Kingdom has been noticeably emerging as a major cryptocurrency economy. According to an October 2023 report by blockchain analytics firm Chainalysis, the U.K. is the biggest crypto country in terms of raw transaction volume in Central, Northern and Western Europe. According to a study by the crypto tax platform Recap, London was the world’s most crypto-ready city for business in February 2023.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMzEtb2N0b2Jlci0yMDIzL2FydGljbGVzaG93LzEwNDg0OTA4MC5jbXPSAcEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTMxLW9jdG9iZXItMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTA0ODQ5MDgwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $34,200 ahead of Fed interest rate decision; Solana jumps 10% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe major cryptocurrencies traded higher on Tuesday ahead of the US Federal Reserve's decision on interest rates scheduled for tomorrow.Bitcoin was trading 0.18% lower at $34,278, while its largest peer, Ethereum, was trading at $1,797, up 0.44% at around 12.49 p.m.Bitcoin is up 27% in October and looks to close the month above $34,000 with substantial gains. Based on 2019, the previous year before halving, November might encounter a brief pullback to keep the market healthy. $33,200 is the strong support level that Bitcoin must hold to surge ahead. Bitcoin dominance has experienced a minor decline this week as Solana, Polkadot and XRP register gains on the daily, said Vikram Subburaj, CEO of Giottus Crypto Platform.Edul Patel, Co-Founder & CEO of Mudrex, said, \"Bitcoin has been hovering at the $34,300 level over the past 24 hours as traders anticipate the US Federal Reserve's decision on interest rates scheduled for Wednesday. For Bitcoin to maintain its upward trajectory, it will need to overcome the $34,700 resistance, or it may risk seeking support near $34,000.\"Meanwhile, the global cryptocurrency market cap surged 0.37% to around $1.27 trillion in the last 24 hours.Other popular altcoins, including Solana and Chainlink, rose 9.9% and 5.13%, respectively. Also, XRP, Tron, Cardano, Toncoin, Polygon, Polkadot, and Litecoin traded higher.The total volume in DeFi is currently $4.17 billion, 10.2% of the total crypto market 24-hour volume. The volume of all stablecoins is now $36.65 billion, which is 89.63% of the total crypto market 24-hour volume.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, declined to $667 billion. Bitcoin's dominance is currently 52.7%, according to CoinMarketCap. BTC volume in the last 24 hours surged 35.8% to $17.2 billion.\"Bitcoin posted a robust 15% weekly gain, it faces resistance around $35,000, with Ethereum hovering just above $1,765. The coming week is marked by macroeconomic events that could affect the crypto market, including the Federal Reserve meeting and the US jobs report. Despite the rising trend, Bitcoin volatility requires careful analysis by traders, said Sathvik Vishwanath, Co-Founder & CEO of Unocoin.(You can now subscribe to our ETMarkets WhatsApp channel (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times)"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5kYWlseWZ4LmNvbS9uZXdzL2JpdGNvaW4tYnRjLXVzZC10ZWNobmljYWwtb3V0bG9vay1nb2xkZW4tY3Jvc3MtcGF0dGVybi1mYWlscy10by1pbnNwaXJlLWhpZ2hlci1wcmljZXMtd2hhdC1uZXh0LTIwMjMxMDMxLmh0bWzSAY4BaHR0cHM6Ly93d3cuZGFpbHlmeC5jb20vbmV3cy9iaXRjb2luLWJ0Yy11c2QtdGVjaG5pY2FsLW91dGxvb2stZ29sZGVuLWNyb3NzLXBhdHRlcm4tZmFpbHMtdG8taW5zcGlyZS1oaWdoZXItcHJpY2VzLXdoYXQtbmV4dC0yMDIzMTAzMS5odG1sL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC/USD) Technical Outlook: Golden Cross Pattern Fails to Inspire Higher Prices, What Next? - DailyFX",
        "content": "BITCOIN, CRYPTO KEY POINTS:\n\nBitcoin Remains Below the $35k Mark and May Need a Catalyst for a Move Higher.\n\nSentiment Around the Crypto Industry Continues to Improve.\n\nTo Learn More About Price Action , Chart Patterns and Moving Averages ,Check out the DailyFX Education Series.\n\nREAD MORE: Gold (XAU/USD) Prices Flirt with $2000 Level, Eyeing the FOMC Meeting for Fresh Impetus\n\nBitcoin prices have taken a bit of a breather since the expansive rally that broke above the $35k mark last week Tuesday. Since then, it appears to be a case of uncertainty and rangebound trade but Bitcoin remains underpinned by hopes of the BlackRock Spot Bitcoin ETF approval.\n\nSupercharge your trading prowess with an in-depth analysis of gold's outlook, offering insights from both fundamental and technical viewpoints. Claim your free Q4 trading guide now!\n\nRecommended by Zain Vawda Get Your Free Bitcoin Forecast Get My Guide\n\nA sign of the strength and confidence from bulls is the lack of a significant pullback despite a resurgence in the DXY. The resurgence which has see many FX pairs and Gold lose ground to the Greenback has had very little impact on the price of Bitcoin. There has been a sizeable shift in market sentiment around Crypto markets and Bitcoin in particular over the past month or so. This is reflected in the image below as the crypto fear and greed index has risen from 48 a month ago to 66 today, which keeps it in “Greed” territory.\n\nSource: FinancialJuice\n\nThe world's largest cryptocurrency ad crypto markets faced calls that it was dying toward the back end of 2022 before becoming the best performing asset of 2023. It does appear however that Crypto and blockchain technology are on their way to mainstream adoption. This is evidenced by the countless number of global institutions like JPMorgan, BNP Paribas and Santander are among those who are currently involved in various blockchain projects.\n\nThe hype around the ETF is justified as we have heard comments from many asset managers and CEOs confirming they are fielding many enquiries and calls regarding diversification into Crypto. This hype seems to be underpinning Bitcoin right now so if we do have a rejection of the BlackRock Bitcoin ETF then we could be in for a deeper retracement. Right now, it does appear that that markets are leaning on the side of an approval, will we get it though?\n\nSource: TradingView\n\nREAD MORE: HOW TO USE TWITTER FOR TRADERS\n\nRecommended by Zain Vawda Get Your Free Introduction To Cryptocurrency Trading Get My Guide\n\nTECHNICAL OUTLOOK AND FINAL THOUGHTS\n\nFrom a technical standpoint BTCUSD is currently stuck in a 2k range between the $33.3k and $35.3k. Price action is choppy as we appeared ready to make a new high before a bearish doji candle close yesterday hinting at a fresh low. However today we have seen the $34177 support area hold firm with the daily candle looking likely too close as a hammer candlestick. The question will be whether we can push on to make a fresh high above the $35.3k.\n\nOf course, we have the US FOMC meeting tomorrow evening which could stoke some volatility. However, looking at the resilience in Bitcoin today, I’m hesitant to say that a hawkish Fed will push Bitcoin prices lower. Today saw a sizeable rally in the DXY and still Bitcoin prices have held the high ground, a sign of the buying pressure still present.\n\nKey Levels to Keep an Eye On:\n\nResistance levels:\n\n35000\n\n35300\n\n37500\n\nSupport levels:\n\n34177\n\n32528\n\n31493\n\nBTCUSD Daily Chart, October 31, 2023.\n\nSource: TradingView, chart prepared by Zain Vawda\n\nRecommended by Zain Vawda Get Your Free Top Trading Opportunities Forecast Get My Guide\n\n--- Written by Zain Vawda for DailyFX.com\n\nContact and follow Zain on Twitter: @zvawda"
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMS1ub3ZlbWJlci0yMDIzL2FydGljbGVzaG93LzEwNDg4MjQyNS5jbXPSAcEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTEtbm92ZW1iZXItMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTA0ODgyNDI1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin trades above $34,400; Solana, XRP rise up to 6% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMajor crypto tokens were trading mixed in Wednesday's trading amid jitters among investors ahead of the Federal Reserve's interest rate decision.Bitcoin was mildly firm and moved towards the $34,500 level. Its biggest peer, Ethereum regained the $1,800 mark.Other crypto tokens, such as XRP , Solana, tron, and Toncoin traded higher, while BNB , Cardano, Dogecoin , Chainlink, Polygon, Polkadot, Litecoin , and Shiba Inu traded in the red.Broader markets are looking forward to the Fed meeting expected to happen today. Any interest rate change is expected to change the tone of crypto market performance. Though, investors are particularly excited about spot BTC ETFs in the U.S.; the SEC may respond to the BTC ETF applications before the winter holiday season this year, said Parth Chaturvedi, Investments Lead at CoinSwitch Ventures.Meanwhile, CoinDCX Research Team said, \"BTC concluded this month with a remarkable 29% surge, partly attributed to the growing speculation about the approval of BTC spot ETFs. Additionally, the approaching halving event is drawing nearer, further piquing investor interest.\"\"Over the last few days, BTC has been relatively stable, trading in a sideways pattern as investors anticipate significant macro announcements today, on November 1st. The focus will primarily be on the FOMC statement and press conference, as these events can directly impact crypto prices,\" it said.Meanwhile, the global cryptocurrency market cap surged marginally by 0.05% to around $1.27 trillion in the last 24 hours.The total volume in DeFi is currently $4 billion, 9.94% of the total crypto market 24-hour volume. The volume of all stablecoins is now $35.37 billion, which is 88.02% of the total crypto market 24-hour volume.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, declined to $672 billion. Bitcoin's dominance is currently 52.8%, according to CoinMarketCap. BTC volume in the last 24 hours declined 11.5% to $15.3 billion.On the 4-hour chart, Bitcoin faces significant price levels: immediate resistance at $35,250, followed by $36,100 and $37,010, while support lies at $33,138 with further levels at $32,466 and $31,795.Technical indicators such as RSI at 57 indicate neutral market sentiment with a slight bullish bias. The 50-day EMA at $33,500 suggests a balance between bullish and bearish forces. Bitcoin is currently trading in a sideways channel between $33,800 and $35,000, reflecting market indecision.Overall, the trend is cautiously bullish above $33,500, but a break above immediate resistance or a drop below support could indicate potential price moves.(You can now subscribe to our ETMarkets WhatsApp channel (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times)"
    }
]