[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI3L2FsbHVyZS1vZi1iaXRjb2luLW9yZGluYWxzLWRlZmktZHJpdmVzLWNyeXB0by1mdW5kcy10by1iaXRjb2luLWxheWVyLTItdG9rZW4tc3RhY2tzL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI3L2FsbHVyZS1vZi1iaXRjb2luLW9yZGluYWxzLWRlZmktZHJpdmVzLWNyeXB0by1mdW5kcy10by1iaXRjb2luLWxheWVyLTItdG9rZW4tc3RhY2tzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Allure of Bitcoin Ordinals, DeFi Drives Crypto Funds to Bitcoin Layer 2-Token Stacks - CoinDesk",
        "content": "Stack’s STX tokens have jumped 23% in the past 24 hours, adding to a 50% surge over a seven-day rolling period, CoinGecko data shows. Demand for the tokens has increased since the arrival of the Ordinals protocol, which went live on Jan. 21 and allows users to inscribe references to digital art into small transactions on the Bitcoin blockchain. The token's market cap topped $1.2 billion as of Monday."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLXJlbWFpbi1pbi1jaGFyZ2UtZXZlbi1pbi10aGUtZmFjZS1vZi1pbmNyZWFzaW5nLXJlZ3VsYXRvcnktZnVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bulls remain in charge even in the face of increasing regulatory FUD - Cointelegraph",
        "content": "Bitcoin (BTC) price broke above $25,000 on Feb. 21, accruing a 53% year-to-date gain. At the time, it made sense to expect the rally to continue after U.S. retail sales data from the previous week vastly surpassed the market consensus. This fuelled investors’ hope for a soft landing and a possible averted recession in the U.S. economy.\n\nThe apex of the U.S. Federal Reserve’s strategy success would be increasing interest rates and scaling back its $9 trillion balance sheet reduction without significatively damaging the economy. If that miracle happens, the outcome would benefit risk assets, including stocks, commodities and Bitcoin.\n\nUnfortunately, the cryptocurrency markets took a hit after the $25,200 level was rejected and Bitcoin price plunged 10% between Feb. 21 and Feb. 24. Regulatory pressure, mainly from the U.S., partially explains investors' rationale for the worsening market conditions.\n\nIn a Feb. 23 New York Magazine interview, Securities and Exchange Commission Chair Gary Gensler claimed “everything other than Bitcoin” is potentially a security instrument and falls under the agency’s jurisdiction. However, multiple lawyers and policy analysts commented that Gensler’s opinion is “not the law.” Hence, the SEC had no authority to regulate cryptocurrencies unless it proved its case in court.\n\nAdditionally, at a G20 meeting, U.S. Treasury Secretary Janet Yellen stressed the importance of implementing a strong regulatory framework for cryptocurrencies. Yellen’s remarks on Feb. 25 followed International Monetary Fund managing director Kristalina Georgieva pointing out that “if regulation fails,” then outright banning “should not be “taken off the table.”\n\nLet's look at Bitcoin derivatives metrics to better understand how professional traders are positioned in the current market conditions.\n\nAsia-based stablecoin demand is stagnant\n\nTraders should refer to the USD Coin (USDC) premium to measure the demand for cryptocurrency in Asia. The index measures the difference between China-based peer-to-peer stablecoin trades and the United States dollar.\n\nExcessive cryptocurrency buying demand can pressure the indicator above fair value at 104%. On the other hand, the stablecoin's market offer is flooded during bearish markets, causing a 4% or higher discount.\n\nUSDC peer-to-peer vs. USD/CNY. Source: OKX\n\nAfter peaking at 4% in late January, the USDC premium indicator in Asian markets has declined to a neutral 2%. The metric has since stabilized at a modest 2.5% premium, which should be interpreted as positive considering the recent regulatory FUD.\n\nBTC’s futures premium stuck even after price rejected at $25,000\n\nBitcoin’s quarterly futures are the preferred instruments of whales and arbitrage desks. Due to their settlement date and the price difference from spot markets, they might seem complicated for retail traders. However, their most notable advantage is the lack of a fluctuating funding rate.\n\nThese fixed-month contracts usually trade at a slight premium to spot markets, indicating that sellers are requesting more money to withhold settlement longer. Consequently, futures markets should trade at a 5% to 10% annualized premium on healthy markets. This situation is known as contango and is not exclusive to crypto markets.\n\nBitcoin 2-month futures annualized premium. Source: Laevitas\n\nThe chart shows traders flirting with the neutral sentiment between Feb. 19 and Feb. 24 as the Bitcoin price held above $23,750. However, the indicator failed to enter the neutral-to-bearish 0% to 5% area as additional regulatory uncertainty was added, especially after Gensler’s remarks on Feb. 23. As a result, it became clear that pro traders were not comfortable with Bitcoin price breaking above $25,000.\n\nRelated: Is the SEC’s action against BUSD more about Binance than stablecoins?\n\nWeak economic data shifted control to the bulls\n\nSince Feb. 25, Bitcoin price has gained 4.5%, indicating that the impact of the regulatory newsflow has been limited. More importantly, the global stock market reacted positively on Feb. 27 after the U.S. Commerce Department reported durable goods orders down 4.5% in January versus the previous month. This data added pressure for the Fed to reduce its interest rate hike program earlier than expected.\n\nSince Bitcoin's 50-day correlation with the S&P 500 futures presently stands at 83%, cryptocurrency traders are more inclined to support risk asset prices strengthening throughout the week. A correlation indicator above 70% indicates that both assets are moving in tandem, meaning the macroeconomic scenario is likely playing a pivotal role in determining the overall trend.\n\nUnless there’s added pressure from regulators or conflicting economic data, odds favor Bitcoin bulls considering the BTC futures and Asian stablecoin metrics.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1vcmRpbmFscyUzQS13aGF0LWludmVzdG9ycy1zaG91bGQta25vd9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals: What Investors Should Know - Nasdaq",
        "content": "By Landon Manning\n\nA new project has appeared on the crypto scene, creating a new use case for Bitcoin; a system for tracking individual satoshis on the Bitcoin blockchain, effectively enabling Bitcoin NFTs.\n\nThis project, led by a former Bitcoin Core developer Casey Rodarmor, is essentially a protocol for assigning numbers to specific satoshis that can allow them to be tracked and specifically transferred. Representing one hundred-millionth of a single bitcoin, the satoshi is the smallest unit of bitcoin that can be used in transactions. By using the Ordinal protocol, users can assign content to a satoshi that they please, essentially opening the door for NFTs to run directly on Bitcoin’s blockchain.\n\nNFTs (non-fungible tokens) can be a contentious issue, not only in the greater world of traditional finance but also among crypto advocates and Bitcoiners in general. The launch of this program immediately saw pushback from within the Bitcoin community, with people claiming that such an asset has little to do with Bitcoin adoption or daily usage for most people, and might even take up valuable resources. Still, there has been significant interest in Ordinals, as more than 90,000 inscriptions have been minted over the course of about a month.\n\nFor many, the purpose of an NFT is to create a speculative financial instrument, allowing users to provide a specific tracker for a piece of code, typically a piece of artwork, that cannot be replicated even if the art itself is copied. The first generation of NFTs, largely based on Ethereum’s blockchain, bubbled to widespread popularity in 2022 before popping spectacularly in the year’s subsequent crypto crash. If NFTs are to slowly return, finding use cases in things like online stores for video games or social media, it seems reasonable to believe that a Bitcoin infrastructure will provide many distinct advantages over an Ethereum one. Because each Ordinal inscription is tied to a satoshi, this will make their verification system “on-chain” at a fundamental level, instead of previous attempts that have a third-party workaround to merely align with an existing blockchain.\n\nAlthough there is certainly skepticism about the viability of Ordinals in the long term, the buzz of excitement from its nascent community can definitely be seen as a positive for Bitcoin. As Fortune pointed out, bitcoin’s price bounce in early 2023 is largely correlating with the emergence of Ordinal. It quotes Jon Wong from the Solana Foundation as saying, “As Ordinal mints have increased, the minters have been willing to pay the miners, the computers that run and secure Bitcoin’s blockchain, more and more in transaction fees.” In other words, then, the increased frenzy could be one of the reasons behind bitcoin’s recent price increase.\n\nAlthough the long-term staying power of Ordinals is unclear at the moment, it can’t be denied that ideas like this are a prime example of the endless iterations and innovations made by a strong Bitcoin community. The emergence of new ideas and technologies like Ordinals have provided many of the great use-cases of Bitcoin over the years, and both successful and failed projects can stimulate interest and activity in Bitcoin itself. Potential investors will have to choose carefully before deciding to put money into this new project, but for those who already have exposure to NFTs, it seems a no-brainer to bet on Bitcoin.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG92ZXJzZS1iaXRjb2luLW1vdmVzLXRvd2FyZHMtc2F0b3NoaXMtMDYxODA5OTM3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Cryptoverse: Bitcoin moves towards Satoshi's payment dream - Yahoo Finance",
        "content": "By Medha Singh and Lisa Pauline Mattackal\n\n(Reuters) - Satoshi Nakamoto would be proud. Adolescent bitcoin may finally be repaying its creator's faith.\n\nThe 15-year-old cryptocurrency has filled many roles - from source of speculation to hedge against inflation - but has struggled to find a clear identity. Now there are growing signs it's edging towards its intended purpose: payments.\n\n\"The development in terms of building out crypto payments has continued apace, even if it's gone somewhat unnoticed because of the volatility in the broader market,\" said Richard Mico, U.S. CEO of Banxa, a payment-and-compliance infrastructure provider.\n\nThe amount of bitcoin stored on the Lightning Network - a payment protocol layered on top of the blockchain - has jumped by two-thirds over the past year to hit an all-time high of 5,580 coin, according to crypto data firm The Block.\n\nCrypto payment specialists have also seen strong volumes.\n\nGraphic: Record capacity on the lightning network https://www.reuters.com/graphics/FINTECH-CRYPTO/WEEKLY/gkplwldyrvb/chart.png\n\nU.S.-based BitPay said transaction volumes jumped 18% last year versus 2021. CoinsPaid said volumes in the fourth quarter of 2022 rose 32% compared with a year before.\n\nBITCOIN AND BRAZILIAN REAL\n\nSo why has crypto failed to fulfill pseudonymous inventor Nakamoto's dream, spelt out in a famed 2008 white paper titled \"Bitcoin: A Peer-to-Peer Electronic Cash System\"?\n\nPrice volatility, slow processing speeds and persistent regulatory uncertainty are among the factors that have rendered cryptocurrencies unwieldy as a means of payment. Few merchants price good or services in crypto.\n\nNonetheless, proponents say bitcoin offers lower transaction costs and quicker speeds than traditional cash, especially for cross-border transfers.\n\nAside from bitcoin, other cryptocurrencies including stablecoins, which are pegged to the value of traditional currencies, have emerged as popular options, particularly for cross-border payments, remittances, plus in emerging markets where the value of local currencies have been hit by inflation.\n\nStory continues\n\nStellar, a blockchain that enables cross-border payments, saw the number of trades on its platform increase to 103.4 million last month from 50.6 million in January 2022.\n\nVolumes for trades across exchanges between bitcoin and Turkey's lira and Brazil's real increased by 232% and 72%, respectively, CryptoCompare data showed.\n\nCAN YOU HANDLE THE STRESS?\n\nIt's not all smooth sailing for the widespread adoption of crypto for payments; for one thing, there's the question of whether blockchains are ready to handle the stress of processing thousands of transactions at a time, especially without a simultaneous jump in transaction fees.\n\nEfforts by some of the world's largest economies, including Japan, China and India, to create their own digital currencies (CBDCs) could also choke crypto payments growth, say some market players. For others, though, growing interest in CBDCs is evidence that blockchain payments tech is here to stay.\n\nTraditional finance firms looking to embrace crypto payments have also shrugged off recent market volatility. One, Visa inking a deal this month with crypto firm WireX to directly issue crypto-enabled debit and prepaid cards.\n\n\"Crypto is evolving into a viable alternative for more and more people around the world,\" said Mico at Banxa.\n\n(Reporting by Lisa Pauline Mattackal and Medha Singh in Bengaluru; Editing by Tom Wilson and Pravin Char)"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1wcmljZS1sYXRlc3QtYnVsbC1tYXJrZXQtMjAyMy1iMjI5MDI5Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price set for second month-on-month rise for first time since 2020 - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThe price of bitcoin is looking to close February up more than 40 per cent since the start of the year, marking the most positive start to a year for the cryptocurrency since the record-breaking 2021.\n\nBitcoin is currently trading at just above $23,000, having dipped slightly from the eight-month highs of $25,000 last week.\n\nIt is a significant price increase from last November, when BTC hit two-year lows of below $16,000 – down more than 70 per cent from its record high from November the previous year.\n\nIt has given hope that bitcoin is finally transitioning from a bear market to a bull market, and that the so-called “crypto winter” is coming to an end.\n\nDespite the recent price gains, bitcoin remains a long way off its former peak and continues to face resistance at around the $25,000 level.\n\nWhether the move into a bull market can be achieved will depend on whether this price can be surpassed over the coming days, according to Mike McGlone, a senior macro strategist at Bloomberg Intelligence.\n\n“Headwinds remain strong,” he wrote on Twitter. “$25,000 resistance may prove significant for all risk assets.”\n\nCrypto market analysts warned on Monday that further interest rate rises in the US could prove detrimental to bitcoin and the broader cryptocurrency space.\n\n“While still markedly above their lows, the crypto market is looking tentative in the face of the possibility of stickier than expected inflation and labour market in both the US and elsewhere,” said Simon Peters, an analyst at the online trading platform eToro.\n\n“This macro data is key in central banks’ thinking around rate hikes with main markets now pricing in no rate cuts in 2023. While bitcoin and ether don’t seem to be in full on fear, there is most certainly an element of jitters among market participants watching for fresh updates, and this is showing in the price movement of the past week.”\n\nOther analysts remained hopeful that bitcoin could continue its upward momentum, with popular commentator Kaleo claiming that $30,000 is “still a magnet”."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yOC9iaXRjb2luLWNvcmUtZGV2ZWxvcGVyLWx1a2UtZGFzaGpyLWNhbGxzLW91dC11bmF1dGhvcml6ZWQtb3JkaW5hbC1uZnQtd2l0aC1oaXMtbmFtZS_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMjgvYml0Y29pbi1jb3JlLWRldmVsb3Blci1sdWtlLWRhc2hqci1jYWxscy1vdXQtdW5hdXRob3JpemVkLW9yZGluYWwtbmZ0LXdpdGgtaGlzLW5hbWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Core Developer Luke Dashjr Calls Out Unauthorized Ordinal NFT With His Name - CoinDesk",
        "content": "Dashjr also said on Twitter that someone – again, not identified – purportedly with Scarce.City reached out to him to “donate” to him 90% of its value. He has been a vocal critic of the Ordinals protocol, telling CoinDesk in a previous statement that it was an “attack” on Bitcoin."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tbGF3eWVycy1mbGFtZS1nZW5zbGVyLW92ZXItY2xhaW1zLXRoYXQtYWxsLWNyeXB0by1hcmUtc2VjdXJpdGllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Crypto lawyers flame Gensler over claims that all crypto are securities - Cointelegraph",
        "content": "Cryptocurrency lawyers have rebuffed comments made by the head of the United States securities regulator, who claimed in a recent interview that every cryptocurrency except Bitcoin (BTC) is a security that falls under its jurisdiction.\n\nIn a wide-ranging Feb. 23 New York Magazine interview discussing crypto, Securities and Exchange Commission Chair Gary Gensler claimed “everything other than Bitcoin” falls under the agency’s remit.\n\nHe added other crypto projects “are securities because there’s a group in the middle and the public is anticipating profits based on that group,” which he said is not the case with Bitcoin.\n\nGensler in @NYMag on crypto:\n\n\n\n-everything is a security except bitcoin\n\n-every company out there is in violation\n\n-crypto is pointless but blockchain is kinda neat\n\n\n\nHard to argue you’re acting in good faith if admittedly trying to stamp out an entire industry. pic.twitter.com/Ozw8ZJ3ETO — Alexander Grieve (@AlexanderGrieve) February 26, 2023\n\nJake Chervinsky, a lawyer and policy lead at the crypto advocacy group the Blockchain Association, argued however in a Feb. 26 tweet that Gensler’s “opinion is not the law” despite his claimed command over the crypto sector.\n\nChair Gensler may have prejudged that every digital asset aside from bitcoin is a security, but his opinion is not the law. The SEC lacks authority to regulate any of them until and unless it proves its case in court. For each asset, every single one, individually, one at a time. — Jake Chervinsky (@jchervinsky) February 26, 2023\n\nHe added “until and unless” the SEC “proves its case in court” for its jurisdiction over each individual token “one at a time” then it “lacks authority to regulate any of them.”\n\nLawyer Logan Bolinger also chimed in, tweeting on Feb. 26 “that Gensler’s opinions on what is or isn’t a security are not legally dispositive” — meaning it’s not the final legal determination.\n\nFriendly reminder that Gensler’s opinions on what is or isn’t a security are not legally dispositive.\n\n\n\nIn this country, judges - not SEC chairs - ultimately determine what the law means and how it applies.\n\n\n\nDoesn’t mean his thoughts are irrelevant. They’re just not dispositive. — Logan Bolinger (@TheWhyOfFI) February 26, 2023\n\n“Judges — not SEC chairs — ultimately determine what the law means and how it applies,” Bolinger added.\n\nThe policy lead at advocacy body Bitcoin Policy Institute, Jason Brett, said Gensler’s comments “shouldn't be celebrated, but feared” and stated, “there are ways to win other than via a regulatory moat.”\n\nThe Gary Gensler thing is no bueno. There are ways to win other than via a regulatory moat. And anytime this is the way, the script can be flipped and before you know it, everyone is crying due process. Gensler's comments in NY Magazine shouldn't be celebrated, but feared. — Jason Brett (@RegulatoryJason) February 26, 2023\n\nSEC needs 12,305 lawsuits: Delphi Labs counsel\n\nMeanwhile, Gabriel Shapiro, the general counsel at investment firm Delphi Labs, outlined in a series of tweets the seemingly impossible enforcement that the SEC would have to carry out on the industry to cement its rule.\n\nShapiro said that over 12,300 tokens worth around $663 billion are — according to Gensler — unregistered securities that are illegal in the U.S. and, as mentioned by Chervinsky, the agency would have to file a lawsuit against each token creator.\n\nRelated: Emojis count as financial advice and have legal consequences, judge rules\n\nThe SEC has handled crypto in two main ways, according to Shapiro: Either fining token creators and requiring the issuer to register, or fining them and ordering the created tokens to be destroyed and delisted from exchanges.\n\nso far, SEC has handled tokens in mainly 2 ways:\n\n\n\n(1) fine + registration requirement--this failed every time so far, with the companies becoming bankrupt\n\n\n\n(2) fine + order to destroy all premined tokens and delist tokens from all exchanges\n\n\n\nboth ways, tokens go to $0 — _gabrielShapir0 (@lex_node) February 26, 2023\n\n“SEC registration is not only too expensive for most token creators — there is also no clear path for registration of tokens,” Shapiro said, adding:\n\n“What is the plan here? Since registration is not feasible, it can only be [that] everyone pays huge fines, stops working on the protocols, destroys all dev premines, and delists [tokens] from trading. That would mean 12,305 lawsuits.”\n\n“What is the plan? We are all wondering, and billions of American [dollars] are at risk.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDIvMjcveXVnYS1sYWJzLWFubm91bmNlcy1nZW5lcmF0aXZlLW9yZGluYWxzLW5mdC1jb2xsZWN0aW9uLW9uLWJpdGNvaW4tYmxvY2tjaGFpbi_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vd2ViMy8yMDIzLzAyLzI3L3l1Z2EtbGFicy1hbm5vdW5jZXMtZ2VuZXJhdGl2ZS1vcmRpbmFscy1uZnQtY29sbGVjdGlvbi1vbi1iaXRjb2luLWJsb2NrY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bored Ape-Parent Yuga Labs' Next NFTs Will Live on Bitcoin Blockchain - CoinDesk",
        "content": "While Yuga Labs’ empire is built upon the success of its blue-chip Bored Ape Yacht Club collection, which recently expanded its ecosystem through its skill-based mint Dookey Dash, the company specified that its new collection does not come with extended utility or has any affiliation to its current Ethereum-based collections."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGV0YS1saWRvLWtsYXktYW5kLWVnbGQtZmxhc2gtYnVsbGlzaC1zaWducy1hcy1iaXRjb2luLXJlY2FwdHVyZXMtMjNr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "THETA, LIDO, KLAY and EGLD flash bullish signs as Bitcoin recaptures $23K - Cointelegraph",
        "content": "The cryptocurrency markets and the United States equities markets witnessed profit-booking this week as the macroeconomic data hinted toward continued rate hikes by the Federal Reserve. Bitcoin (BTC) is down more than 4% and the S&P 500 fell 2.7% to record its worst week of the year.\n\nThe CME FedWatch Tool shows a 73% probability of a 25 basis points rate hike by the Fed in the March meeting but after the hotter-than-expected inflation readings in two weeks, the probability of a 50 basis point rate hike has started to slowly gain traction.\n\nCrypto market data daily view. Source: Coin360\n\nDuring periods of uncertainty, some coins enter a deeper correction while a few buck the trend and continue to outperform. Hence, it becomes important to select the right coins to trade.\n\nA few coins that have witnessed a shallow correction or have bounced sharply off the support have been selected in this list. Let’s see their charts and determine the levels to watch out for.\n\nBTC/USDT\n\nBitcoin plunged below the 20-day exponential moving average ($23,391) on Feb. 24 but the bears could not build upon this advantage and sustain the price below the strong support at $22,800.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe price bounced off $22,800 on Feb. 25 and the bulls are trying to push the price above the 20-day EMA. If they manage to do that, it will indicate that the BTC/USDT pair may consolidate between $25,250 and $22,800 for a few days.\n\nThe flattening 20-day EMA and the relative strength index (RSI) near the midpoint also suggest a range-bound action in the near term.\n\nAlternatively, if the price slips below $22,700, the selling could intensify and the pair may plummet to the next strong support at $21,480.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe 20-EMA has turned down on the four-hour chart and the RSI is in the negative territory. This indicates an advantage to the bears. Sellers will try to protect the 20-EMA, and if the price turns down from this level, the likelihood of a break below $22,800 increases. If that happens, the selling may intensify and the pair may slide to $21,480.\n\nOn the contrary, if the price breaks above the 20-EMA, it will suggest that bulls are buying on dips. That could push the pair to the 50-simple moving average and keep the price stuck inside the range for some more time.\n\nLDO/USDT\n\nLido DAO (LDO) did not sustain below the 20-day EMA ($2.75) during the recent correction, which is a positive sign. Another bullish sign is the formation of the pennant near the local highs.\n\nLDO/USDT daily chart. Source: TradingView\n\nThe bulls will try to propel the price above the resistance line of the pennant. If they succeed, the LDO/USDT pair could start the next leg of the up-move. The pair may first rise to $3.90 and thereafter attempt a rally to $4.24.\n\nConversely, if the price turns down from the resistance line, it will suggest that bears are selling on rallies. That could keep the price inside the pennant for a while longer. The bears will have to sink the price below the pennant if they want to signal a short-term trend reversal.\n\nLDO/USDT 4-hour chart. Source: TradingView\n\nThe strong bounce off the support line of the pennant indicates aggressive buying on dips. Buyers will have to overcome the obstacle at the resistance line to regain control. If they do that, the pair may resume its uptrend.\n\nHowever, the bears are likely to have other plans as they will try to protect the resistance line. If the price turns down from this level, the state of equilibrium may continue for some more time.\n\nA break below the pennant could attract profit-booking by short-term traders. That may tug the price to $2.20 and later to $2.\n\nEGLD/USDT\n\nMultiversX (EGLD) turned down from the resistance line but an encouraging sign is that the bulls are trying to defend the 20-day EMA ($47).\n\nEGLD/USDT daily chart. Source: TradingView\n\nBoth moving averages are sloping up and the RSI is above 54, indicating that buyers have a slight edge. The bulls will try to push the price toward the resistance line where they are again likely to face strong opposition from the bears.\n\nThis bullish view could invalidate in the near term if the price turns down and plummets below the 20-day EMA. That will indicate selling by the bears on every minor rally. The EGLD/USDT pair could then tumble to the 50-day SMA ($44) and later to $40.\n\nEGLD/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the price is falling inside a descending channel pattern. Buyers purchased at lower levels and have pushed the price to the resistance line of the channel. If this resistance gives way, the pair could rise to the 50-SMA and thereafter attempt a retest of the strong barrier at $54.\n\nContrarily, if the price turns down from the resistance line, it will suggest that the bears have not given up. That could result in a drop toward the support line of the channel.\n\nRelated: How does the U.S. Dollar Index (DXY) impact cryptocurrencies? Watch Macro Markets\n\nTHETA/USDT\n\nThe bulls are trying to arrest Theta Network’s (THETA) pullback at the 20-day EMA ($1.15). Both moving averages are sloping up and the RSI is in the positive territory, indicating advantage to the bulls.\n\nTHETA/USDT daily chart. Source: TradingView\n\nIf buyers thrust the price above the downtrend line, the THETA/USDT pair could climb to the overhead resistance at $1.34. This is a formidable resistance and a break above it could open the gates for a possible surge to $1.70.\n\nInstead, if the price turns down and plunges below the 20-day EMA, it will suggest that the short-term bulls may be rushing to the exit. That may start a deeper correction to the 50-day SMA ($1.05) and then to the psychological support at $1.\n\nTHETA/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows the formation of a symmetrical triangle pattern. Both moving averages have flattened out and the RSI is oscillating near the center, indicating a balance between supply and demand.\n\nA break below the triangle could tilt the short-term advantage in favor of the bears. The pair could first fall to $1.12 and then to $1.\n\nIf bulls want to prevent the decline, they will have to quickly propel the price above the triangle. That could start a journey to $1.27 and later to $1.30.\n\nKLAY/USDT\n\nKlaytn (KLAY) is attempting to break out from a basing pattern. The price rebounded off the 20-day EMA ($0.26) on Feb. 25, indicating solid buying on dips.\n\nKLAY/USDT daily chart. Source: TradingView\n\nThe bulls will try to pierce the overhead resistance at $0.34. If they do that, the KLAY/USDT pair could pick up momentum and soar to the psychological resistance at $0.50. Such a move will signal a potential trend change.\n\nIf the price turns down from $0.34, it will indicate that bears are fiercely protecting the level. That could again pull the price down to the 20-day EMA. A break below this level could indicate that the pair may spend some more time in the basing pattern.\n\nKLAY/USDT 4-hour chart. Source: TradingView\n\nThe bulls arrested the pullback near the 61.8% Fibonacci retracement of $0.26 and started a recovery. There is a minor resistance at $0.32 but if this level is crossed, the pair could attempt a rally to $0.34 and thereafter to $0.37.\n\nOn the other hand, if the price turns down from the overhead resistance, it will suggest that bears are selling on rallies. That may enhance the prospects of a break below $0.26. If that happens, the pair may slide to $0.22.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8yNy9nYXJ5LWdlbnNsZXJzLXRha2Utb24tY3J5cHRvLWRvZXNudC1tYXR0ZXIv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAyLzI3L2dhcnktZ2Vuc2xlcnMtdGFrZS1vbi1jcnlwdG8tZG9lc250LW1hdHRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Gary Gensler’s Take on Crypto Doesn’t Matter - CoinDesk",
        "content": "Bitcoin market manipulation should be stomped out too, it’s not just a nonbitcoin crypto problem. It’s not like commodities are immune from market manipulation or anything like that (just ask gold and silver). Practically, from the perspective of a lawyer, trader or entrepreneur, it might matter if Gensler stands up and contends that some asset is a security."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1heS1vbmx5LW5lZWQtNC13ZWVrcy10by1oaXQtMzBrLWFzLWtleS1tb250aGx5LWNsb3NlLWxvb21z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin may only need 4 weeks to hit $30K as key monthly close looms - Cointelegraph",
        "content": "Bitcoin (BTC) sought to end the week above $23,000 into the Feb. 26 close as concerns heightened over stubborn resistance.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC price bulls keep faith in $30,000\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching $23,318 on the day, up $600 from its weekend lows.\n\nThe latest move marked a modest comeback after a grim week for risk assets, with United States equities suffering thanks to above-expected inflation data.\n\nDespite that, Bitcoin still remained below levels flagged by analysts as important to reclaim before the end of the month.\n\nOnly isolated voices remained optimistic, these including popular trader Kaleo, who maintained that $30,000 remained a BTC price “magnet.”\n\nCrypto trader Altcoin Sherpa meanwhile offered a reference period for hitting the $30,000 mark — “4-6 weeks.”\n\n“$BTC is still in a transition phase from bear -> bull , up only begins once the neckline is broke!” fellow trader and analyst Mags continued in part of a further summary.\n\nBTC/USD annotated chart. Source: Mags/Twitter\n\nBloomberg analyst on Bitcoin: “Trend remains downward”\n\nAlso looking ahead, meanwhile, Mike McGlone, senior macro strategist at Bloomberg Intelligence, voiced misgivings about bulls’ ability to overcome the $25,000 resistance zone.\n\nRelated: Bitcoin eyes 25% of world’s wealth in new $10M BTC price prediction\n\n“Headwinds Remain Strong; Markets Have Bounced - ‘Don't fight the Fed’ was the dominant headwind for markets in 2022, and remains so in 1Q,” he wrote in a Twitter summary of new research.\n\n“Bitcoin $25,000 resistance may prove significant for all risk assets.”\n\nThe research itself predicted that “the more tactically orientated are likely to focus on responsive selling” when it comes to BTC/USD, while it “may be a while before buy-and-hold types gain the upper hand.”\n\nThe week prior, hopes remained high that $25,000 would not pose a major hurdle and that BTC/USD would be able to dispatch it without too much effort.\n\nIn the event, however, the magnitude of the task became apparent — in addition to asks on exchange order books, key moving averages (MAs) lay above, notably Bitcoin’s 50-week and 200-week trend lines.\n\nThe declining 50-week MA itself led McGlone to conclude that “the trend remains downward.”\n\nBTC/USD 1-week candle chart (Bitstamp) with 50, 200 MA. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZGVjcnlwdC5jby8xMjIzMDIvYm9yZWQtYXBlLXlhY2h0LWNsdWItY3JlYXRvci15dWdhLWxhYnMtcmV2ZWFscy1maXJzdC1iaXRjb2luLW5mdC1wcm9qZWN00gFoaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMjMwMi9ib3JlZC1hcGUteWFjaHQtY2x1Yi1jcmVhdG9yLXl1Z2EtbGFicy1yZXZlYWxzLWZpcnN0LWJpdGNvaW4tbmZ0LXByb2plY3Q_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bored Ape Yacht Club Creator Yuga Labs Reveals First Bitcoin NFT Project - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYuga Labs, the $4 billion company behind dominant NFT collection Bored Ape Yacht Club, will debut its first-ever Bitcoin-based NFT project later this week, the company announced Monday.\n\nThe collection, TwelveFold, will consist of 300 limited-edition generative art pieces each inscribed to the Bitcoin blockchain. It’s one of the highest-profile launches to date via Ordinals, a recently-launched way of committing artwork and media to Bitcoin by permanently attaching each to an individual Satoshi, or 1/100,000,000 of a full Bitcoin (BTC).\n\nThe pieces, all 12x12 grids—an homage to the manner in which data is stored on the Bitcoin blockchain—will combine 3D graphics and hand-drawn features. The project was designed and created by Yuga’s in-house art team, and the company said that it has no connection to its Ethereum-based IP and will have no future interactions or utility in that regard.\n\nAD\n\nAD\n\nPromotional artwork for Yuga Labs' first Bitcoin NFT project. Image: Yuga Labs\n\nTwelveFold marks a departure from Yuga’s past offerings in a few key ways. Most notably, every other project under the Yuga banner currently lives on the Ethereum blockchain, the leading network for NFT projects.\n\nThat list includes the Bored Ape Yacht Club (BAYC), spinoff Mutant Ape Yacht Club (MAYC), and virtual land plots for the upcoming Otherside metaverse game. Yuga Labs also owns CryptoPunks and Meebits, two “blue chip” Ethereum NFT projects created by Larva Labs that Yuga purchased the IP rights to last year.\n\nTwelveFold also stands apart from those projects in terms of size. Whereas all other Yuga-owned collections boast 10,000 or more NFTs, TwelveFold will consist of only 300 pieces. It’s closer in approach to Autoglyphs, an influential Larva Labs generative art project on Ethereum that spans just 512 NFTs.\n\n“All of these choices are a departure from what’s expected from Yuga,” co-founder Greg Solano wrote in a blog post accompanying Monday's announcement. “But, you know. Fuck doing expected things.”\n\n“We’re excited about Ordinal inscriptions and what the future holds for digital artifacts on Bitcoin,” he continued. Yuga said that it will announce auction details later this week, and that the information will come 24 hours in advance of the actual sale.\n\nAD\n\nAD\n\nOne of the generative art pieces in Yuga Labs' TwelveFold series. Image: Yuga Labs\n\nOrdinals have commanded the attention of the NFT world over the past month, and while the idea of NFT-like assets imprinted on the blockchain has irked some Bitcoin maximalists, it’s catching on in a big way. More than 200,000 unique Ordinals have been minted as of today, including from notable projects like DeGods and OnChain Monkey. There are even CryptoPunks clones on Bitcoin now.\n\nYuga’s foray into Bitcoin NFTs also comes at a time when the company’s most stable revenue stream appears to be in jeopardy. NFT creators like Yuga depend on creator royalties—a fee typically between 5% and 10%—levied on secondary sales of NFTs on Ethereum marketplaces like OpenSea.\n\nEarlier this month, however, OpenSea stopped enforcing some royalties in an effort to stave off competition from its emergent rival, NFT trading platform Blur. Yuga Labs had previously criticized OpenSea for considering the move."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWdhaW4tc2hydWctb2ZmLTAyMjU0NDY2Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether gain, shrug off fall in U.S. equity markets; Solana bounces back - Yahoo Finance",
        "content": "Bitcoin and Ether rose on Monday morning in Asia along with all of the top 10 non-stablecoin cryptocurrencies by market capitalization, though most are still trading lower from prices a week ago. Solana led the gainers, bouncing back from a network glitch. The gains in crypto came despite the declines in equities on Wall Street on Friday following release of data showing inflation remains stubbornly high.\n\nSee related article: IMF releases crypto action plan, advises against legal tender status\n\nFast facts\n\nBitcoin rose 1.70% in the past 24 hours to trade at US$23,559 as of 8 a.m. in Hong Kong, but is still down 3.15% for the past seven days, according to CoinMarketCap data. Ethereum gained 2.87% to US$1,640, reducing its loss for the week to 2.5%.\n\nSolana bounced back 3.3% to US$23.25 after resolving a technical glitch on Saturday that had slowed transactions on the Solana blockchain, according to Solana monitoring site Solana Status. The token is still down 6.5% for the seven day period.\n\nShiba Inu gained 3.6% after developers announced over the weekend a beta version of Shibarium, which is expected to reduce transaction fees and improve the scalability of the Shiba Inu blockchain. However, like other crypto, the meme token is down for the week, posting a weekly loss of 4.0%.\n\nThe total crypto market capitalization edged 1.9% higher to US$1.08 trillion, while the total trading volume fell by 8.2% over the past 24 hours to US$34.35 billion.\n\nU.S. equities closed lower on Friday to post the worst week so far in 2023. The Dow Jones Industrial Average fell 1.02%, the S&P 500 dropped 1.05% and the Nasdaq Composite Index posted the biggest loss of 1.69%.\n\nThe losses in equities followed the release of the personal consumption expenditures price index for January, which rose 4.7% on year and 0.6% on month when excluding food and energy prices. The index is used by the Federal Reserve to track inflation, suggesting the central bank may be more likely to keep interest rates higher for longer to slow the pace of inflation.\n\nU.S. interest rates are now between 4.5% to 4.75%, the highest since October 2007. The January Fed meeting minutes released last Wednesday showed policymakers agreed to moderate the size of rate increases, but warned the tightening cycle is not over.\n\nAnalysts at the CME Group expect a 72.3% chance that the Fed will raise rates by another 25 basis points next month. They also predict a 27.7% chance of 50 basis point hike, which has increased from 18.1% last week. The next Fed meeting to decide on interest rates will be held on March 21 and 22.\n\nSee related article: Taiwan must mandate a central authority to oversee crypto by May 16, says lawmaker"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8yNy9pbGxpbm9pcy1vZmZpY2lhbHMtcHVzaGluZy1zdGF0ZS1jcnlwdG8tbGljZW5zaW5nLXRvLWVtdWxhdGUtbmV3LXlvcmtzLWJpdGxpY2Vuc2Uv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8yNy9pbGxpbm9pcy1vZmZpY2lhbHMtcHVzaGluZy1zdGF0ZS1jcnlwdG8tbGljZW5zaW5nLXRvLWVtdWxhdGUtbmV3LXlvcmtzLWJpdGxpY2Vuc2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Illinois Officials Pushing State Crypto Licensing to Emulate New York’s BitLicense - CoinDesk",
        "content": "A coordinated pair of bills has been introduced in both chambers of the Illinois General Assembly that would establish a crypto license for the state as well as consumer protections that would include disclosures and the safeguarding of customer assets. The Illinois Department of Financial and Professional Regulation (IDFPR), where DeCarlo works, has helped craft the new measures that could put Illinois in league with New York and eventually California in setting up comprehensive state-level crypto regulations."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtd2hhbGUtcG9wdWxhdGlvbi1zaHJpbmtzLXRvLWVhcmx5LTIwMjAtbGV2ZWxzLTUtdGhpbmdzLXRvLWtub3ctaW4tYml0Y29pbi10aGlzLXdlZWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "BTC whale population shrinks to early 2020 levels — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) keeps pushing for a bullish end to February as the monthly close starts another week’s price action.\n\nThe largest cryptocurrency looks set to preserve its gains as it closes the second month of 2023 — and keeps bulls’ hopes alive.\n\nCan the good times continue? The coming week could mean decision time for a key area of BTC price action around $25,000.\n\nAnalysts are eyeing a breakout toward $30,000 if support can become more permanent, while concerns remain that a trip back toward resistance reclaimed in January is still on the cards.\n\nAmid a quiet week for macroeconomic data, any catalysts for determining whether BTC/USD goes up or down may come from within Bitcoin itself.\n\nOne thing is for sure, on-chain data shows long-term Bitcoin hodlers are in no mood for selling yet, and at current prices, continue to add to their BTC exposure en masse.\n\nCointelegraph looks at some major factors that could impact Bitcoin in the coming week.\n\nBitcoin monthly close precludes March trend showdown\n\nIt looked touch-and-go into the weekend, but Bitcoin has managed to avoid a major retracement and reversed upward into the new week.\n\nA weekly close at around $23,500 was music to the ears of those keen to see a bullish rebound sooner rather than later.\n\n“BTC has managed to break back above the ~$23400 level which is the Range High of the macro Monthly Range,” popular trader and analyst Rekt Capital explained.\n\n“This is what BTC needs to keep doing for a bullish bias as February nears its end. Upcoming Monthly Close will be very interesting.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nAt current levels, BTC/USD is up around 1.25% in February 2023 — modest by historical standards but still conspicuous in preserving the year’s gains.\n\nFor Rekt Capital, March marks the real make-or-break month for BTC/USD as it approaches a long-term trend line, a break of which would signal a full trend reversal.\n\n“February nears its close & indeed not too much excitement for BTC, as has historically been the case for a pre-breakout Monthly Candle,” he continued.\n\n“Given how the Macro Downtrend is a sloping trendline, the breakout price for BTC will be a little lower in March at ~$24500.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nA further post reiterated $25,000 as the level to break to “confirm” a macro uptrend.\n\nFellow trader Crypto Chase was more definite about short-term price action. In a tweet overnight, he likewise flagged $25,000 as the line in the sand.\n\n“Perfect tag of 22.7 and bounce. Weekend move though.. I wouldn’t be surprised to see another retest of the 0.618 or a 3rd drive,” he commented about the weekend lows.\n\n“At that point, it becomes make or break for me. Hold and we can still see 25K+ liq, lose it and 20K next.”\n\n#Bitcoin\n\n\n\n4h chart - short term bullish reversal pic.twitter.com/ukjn3kOqIh — Stockmoney Lizards (@StockmoneyL) February 26, 2023\n\nTrading resource Stockmoney Lizards meanwhile described a “short-term bullish reversal” for both price and relative strength index (RSI) on the 4-hour chart as the weekend ended.\n\nMacro focus flips to central bank liquidity\n\nIn a refreshing change to the previous two weeks, United States macroeconomic data releases will be more subdued at the start of March.\n\nAs Cointelegraph reported, however, analysts are increasingly eyeing macro releases from Asia as a potential BTC price influencer.\n\nCentral bank liquidity injections — in contrast to the Federal Reserve — remain a key topic.\n\n“Global liquidity - projected to rise in 2023, but recently has pulled back,” popular commentator Tedtalksmacro tweeted on the day.\n\n“- China injected ~$450Bn into money markets during December + January - US liquidity has flat lined, government liquidity has outpaced Fed QT recently. Markets are a product of liquidity * risk appetite.”\n\nMacro liquidity comparison chart. Source: Tedtalksmacro/ Twitter\n\nTedtalksmacro nonetheless highlighted a potential countertrend in the form of Japan’s central bank, the Bank of Japan (BoJ), which he warned may yet resort to financial tightening to tame inflation.\n\n“On Friday last week, Japanese core inflation printed at the highest level since 1981 --> fueling speculation that the BOJ will need to tighten after years of extremely easy monetary policy,” he noted.\n\nComparing U.S. macro asset performance to crypto following the January Consumer Price Index (CPI) data print, meanwhile, he added that crypto assets remained “stubborn” despite others beginning to move higher.\n\nMacro asset comparison chart. Source: Tedtalksmacro/ Twitter\n\nAnalysis platform Mosaic Asset focused on the potential for the Fed to hike benchmark interest rates more than expected at its March meeting.\n\n“With no signs that the economy is slowing and yet another inflation report running hotter than expected last week…that’s ratcheting up pressure on the Federal Reserve to keep hiking rates quicker and longer than markets are expecting,” it wrote in the latest edition of its updates series, “The Market Mosaic,” on Feb. 26.\n\n“You can see that reflected in the odds of the next rate hike’s magnitude, where market implied estimates currently favor another 0.25% increase. But views are quickly shifting to the possibility of 0.50%, with more on the way while rates stay higher for longer.”\n\nAccording to CME Group’s FedWatch Tool, the odds of a 0.5% hike instead of the 0.25% in February currently stand at 27.7%.\n\nFed target rate probabilities chart. Source: CME Group\n\nSellers see first week of net losses in 2023\n\nWhile Bitcoin may be up over 40% year-to-date, the road to recovery for the average hodler remains fragile.\n\nThat is the conclusion of the latest data from research firm Santiment, which shows that last week’s mixed BTC price action still managed to deliver net realized losses among sellers.\n\nEther (ETH) saw the same phenomenon, marking the first week in 2023 when sellers lost out.\n\n“Bitcoin & Ethereum are both having more traders sell at a loss than at a profit this week, the first such week so far in 2023,” Santiment commented.\n\n“Historically, once the crowd is exiting their positions more frequently at a loss, bottoms are more likely to form.”\n\nBitcoin, Ethereum realized losses annotated chart. Source: Santiment/ Twitter\n\nSellers’ bad luck contrasts with the strategy still firmly in place for long-term holders, who continue to add to their BTC positions.\n\nAccording to on-chain analytics firm Glassnode, hodlers’ net position change reached a new four-month high this weekend, reflecting the rate at which accumulation occurs.\n\nBitcoin hodler net position change chart. Source: Glassnode/ Twitter\n\nIn addition, the percentage of the BTC supply, which has now been dormant for at least five years, is now higher than ever at 28.24%.\n\nBitcoin % supply last active 5+ years ago chart. Source: Glassnode/ Twitter\n\nBitcoin revenue hits 8-month high\n\nA broadly similar situation is currently being witnessed among Bitcoin miners.\n\nGlassnode data shows that on a rolling 30-day basis, miners are holding onto more BTC than they sell, but current prices are keeping the trend precarious.\n\nWhile it would not take much of a price decrease to flip it back to net selling, current conditions remain far healthier than those seen in previous months.\n\nBitcoin miner net position change chart. Source: Glassnode\n\nA silver lining comes in the form of miner revenue, which while modest, is nonetheless at its highest in eight months.\n\nBitcoin miner revenue chart. Source: Glassnode/ Twitter\n\nIncome was helped by ordinals fees, crossing the $1 million mark in February.\n\nOrdinal fees paid to Bitcoin miners cross $1M\n\n\n\nWhat is an Ordinal - its arbitrary data stored on BTC blockchain into a taproot address. BTC block sizes were raised to 4MB per block, allowing for the storage of data, such as NFTs in the form of images. pic.twitter.com/yz0RM9kBLt — Jack Levin (@mrJackLevin) February 18, 2023\n\nDespite ordinals resulting in a “fuller mempool” for Bitcoin, as the research noted last week, miners have still managed to clear it, Glassnode shows.\n\nBitcoin mempool chart. Source: Glassnode\n\nFor Bitcoin whales, it's early 2020\n\nThey may be responsible for some interesting events on exchange order books, but Bitcoin whale numbers are dwindling.\n\nRelated: Bitcoin may only need 4 weeks to hit $30K as key monthly close looms\n\nWith price action still a good 65% below all-time highs, the biggest Bitcoin investors have not yet decided that now is the time to return to the market.\n\nAccording to Glassnode, whale numbers are now at their lowest in three years — just 1,663 unique entities now control 1,000 BTC or more. Three years ago, in February 2020, Bitcoin traded at under $10,000.\n\nGlassnode defines a unique entity as “a cluster of addresses that are controlled by the same network entity.”\n\nAt their peak in February 2021, there were 2,161 whale entities.\n\nBitcoin whales chart. Source: Glassnode\n\n“Clusters” of whale transaction activity can offer insight into support and resistance, even with depleted whale numbers.\n\nAs monitoring resource Whalemap notes, $23,000 remains a key price focus thanks to that whale factor this month.\n\nBTC broke through bubble resistance\n\n\n\nNow it will be our support in case we start falling\n\n\n\n$27,100 seems to be the closest target according to onchain on the way up\n\n\n\nBeastly BTC performance today pic.twitter.com/fOcag9eBFX — whalemap (@whale_map) February 15, 2023\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2luZmxhdGlvbmFyeS12cy1kZWZsYXRpb25hcnktY3J5cHRvY3VycmVuY2llcy1leHBsYWluZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Inflationary vs. deflationary cryptocurrencies, Explained - Cointelegraph",
        "content": "What is an inflationary cryptocurrency? Some cryptocurrencies are inflationary because the supply of coins increases over time. Inflationary cryptocurrencies use a combination of predetermined inflation rates, supply constraints, and mechanisms for distributing tokens to maintain the supply and incentivize participation in the network. Looking at their monetary systems, cryptocurrencies have various coin-creation and supply mechanisms. Inflationary cryptocurrencies have a steadily increasing supply of coins entering the cryptocurrency market. Typically, there is a predetermined rate of inflation set, which specifies the percentage increase in the currency’s total supply over time. Moreover, the inflationary token’s maximum supply is usually fixed or variable, setting the total number of tokens that can be created. Once the maximum supply is reached, no more tokens can be minted. Nonetheless, different cryptocurrencies still have varying tokenomics, which may be adjusted over time. For instance, Dogecoin (DOGE) once had a hard cap of 100 billion tokens until the supply cap was removed in 2014. With this decision, DOGE now has an unlimited supply of coins. How does an inflationary cryptocurrency work? Inflationary cryptocurrencies distribute newly minted coins to network participants utilizing dedicated consensus mechanisms, such as proof-of-work (PoW) and proof-of-stake (PoS), through which new coins can either be mined into existence (Bitcoin (BTC)) or distributed to network validators (Ether (ETH)). Through Bitcoin’s PoW consensus mechanism, miners validate transactions and are rewarded based on who solves the puzzle first. In PoS, when a block of transactions is ready to be processed, the PoS protocol will choose a validator node to review the block. The validator checks if the transactions in the block are accurate. If so, the validator adds the block to the blockchain and receives ETH rewards for their contribution, generally proportional to the validator’s stake. In some cryptocurrencies, the distribution of new tokens can be influenced by governance decisions. For example, decentralized autonomous organizations (DAOs) may vote to release treasury funds, change staking rewards and set vesting periods, ultimately affecting the currency’s inflation rate and the distribution of new tokens.\n\nWhat is a deflationary cryptocurrency? Deflationary cryptocurrencies deflate over time because the supply decreases. Deflationary tokens use various mechanisms to reduce their supply, with coins usually destroyed through transaction fees and coin burning. Deflationary cryptocurrencies have a predetermined deflation rate coded in the protocol. This rate determines the percentage decrease in the currency’s total supply over time. For instance, a cryptocurrency might have an annual deflation rate of 2.5%, meaning that the currency’s total supply will decrease by 2.5% annually. Like many inflationary cryptocurrencies, deflationary cryptocurrencies can have a fixed or variable maximum supply that limits the total number of tokens created. Generally, no more units can be minted once the supply limit is reached, but this is not always the case. Notably, the economics of deflationary cryptocurrencies is influenced by stakeholders’ incentives, including miners, developers and users, who have varying motivations and goals that impact the cryptocurrency’s supply and demand. Miners mine new coins into existence and tend to hold newly mined coins in bull markets instead of selling them on the market. Likewise, supply caps can be removed, like in the case of DOGE, making some cryptocurrencies prone to manipulation. How does a deflationary cryptocurrency work? Deflationary cryptocurrencies may have direct or indirect mechanisms to destroy circulating coins. Some deflationary currencies may use transaction fees to facilitate burning to reduce the total number of coins in circulation. Coin burning may also involve sending a specific amount of coins to an inaccessible address, directly removing them from circulation. BNB (BNB) adopted two coin-burning mechanisms, reducing its supply by 50% over time. The first is burning a portion of the BNB spent as gas fees on the BNB Chain, and the second is quarterly BNB burning events. Deflationary cryptocurrencies also use other instruments to reduce token supply, including “halving.” Roughly every four years, the halving event cuts the ming rewards BTC miners receive for their work, directly affecting BTC’s scarcity.\n\nWhat is the difference between inflationary and deflationary cryptocurrencies? Inflationary and deflationary cryptocurrencies differ in their monetary mechanisms and supply dynamics. These distinctions have significant implications for the usage and value of each type of cryptocurrency. Both deflationary and inflationary cryptocurrencies can have unique tokenomics that impact their value and use. Deflationary cryptocurrencies typically have a fixed total coin supply limit, which results in increased purchasing power over time. Inflationary cryptocurrencies often have a flexible coin creation rate, arguably decreasing purchasing power over time. Inflationary cryptocurrencies offer some advantages over deflationary ones. They incentivize spending and discourage hoarding. Depending on the use case, they may allow for increased liquidity and rapid adoption, either due to their utility or functionality as a medium of exchange. Additionally, they arguably offer a more flexible monetary policy than deflationary cryptocurrencies and some fiat currencies. The token’s inflation can be adjusted to match the ecosystem’s needs, such as fund development, incentivizing participation or counteracting inflationary pressure from the fiat legacy systems. Deflationary cryptocurrencies incentivize holding and discourage spending, increasing scarcity and adoption of the currency as a store of value. Additionally, deflationary cryptocurrencies can hedge against inflation, hyperinflation and stagflation, preserving value over time. The decreasing token supply can counteract inflationary pressure caused by external factors, including government policies or economic events.\n\nIs Bitcoin inflationary or deflationary? The classification of Bitcoin (BTC) as either inflationary or deflationary depends on various factors. BTC is inflationary because new coins are continuously mined and enter the supply. However, disinflationary measures, such as halving, reduce inflation over time. The argument for BTC being deflationary is based on the fact that the supply of BTC is limited and inherently incorporates a disinflationary measure called halving. The halving event cuts the rewards for miners, affecting BTC’s scarcity and reducing inflation over time. As the mining reward continues to fall over time, it becomes increasingly difficult and expensive to mine BTC. The 21 million cap on supply means once all coins are mined, no more are added to the market. Once BTC’s hard cap is reached around the year 2140, inflation stops because no new coins will be added into circulation. Finally, as the adoption and demand for BTC continue to increase due to rising external demand and its internal disinflationary mechanics, its price could continue to increase. BTC can hedge against inflation due to its internal mechanics, which gradually reduce its inflation rate."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMjcvY3J5cHRvLWNvbi1hcnRpc3RzLWxlYXZlLXRyYWlsLW9mLXJpcC1kZWFsLXZpY3RpbXMtZnJvbS1hbXN0ZXJkYW0tdG8tcm9tZS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAyLzI3L2NyeXB0by1jb24tYXJ0aXN0cy1sZWF2ZS10cmFpbC1vZi1yaXAtZGVhbC12aWN0aW1zLWZyb20tYW1zdGVyZGFtLXRvLXJvbWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Crypto Con Artists Leave Trail of ‘Rip Deal’ Victims From Amsterdam to Rome - CoinDesk",
        "content": "Victims’ accounts of their interactions with what appear to be rip-deal gangs are uncannily similar: Scammers posing as investment agents meet their victims face-to-face at a restaurant or hotel lobby, and ask for proof of funds. The victims set up a crypto wallet that seems legitimate – but chosen by the scammers – and then fund the wallet. Once the funds are sent over, the scammers are somehow able to drain the wallets. The top working theories are that they get the victim’s private keys or exploit security flaws in the wallet."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL25mdC9hbi1pbnRyb2R1Y3Rpb24tdG8tYml0Y29pbi1vcmRpbmFscy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "An Introduction to Bitcoin Ordinals - Altcoin Buzz",
        "content": "Ordinals. Inscriptions. If you’re a crypto newbie, these terms may seem foreign to you. If you’ve been in crypto for long, it is also unlikely you know these terms. Yet, Ordinals have been all the rage this past month. So, what exactly are these? Today, we provide an introduction to Bitcoin Ordinals.\n\nTo do so, we’ll be summarizing an interview by Stephan Livera as shown below. Said interview is with Casey Rodarmor, the creator of Ordinals.\n\nWho Is Casey Rodarmor?\n\nThe interview starts off with Casey summarizing his own background. In short, he is a long-time Bitcoiner and software engineer. In his early days, he worked for big tech companies like Google and Meta. After discovering crypto, his accomplishments include:\n\nHelping Chaincode Labs as a Bitcoin core developer.\n\nCreating Agora. Agora allows users to sell files for $BTC lightning payments.\n\nHosting the San Francisco Bitcoin Developer’s meetup.\n\nTo date, his biggest achievement would be the creation of Ordinals. He began working on it since early 2022. Moving forward to August 2022, he created ORD. ORD comprises a wallet and block explorer, which you can access here. On 21 January 2023, Ordinals launches and immediately gains a large user base.\n\nWhat Are Bitcoin Ordinals?\n\nNext, Casey moves on to explain what Ordinals and Inscriptions are. In a nutshell, this is a dual-layer project. Ordinals make up the base layer, and Inscriptions make up the top layer. With this, users can create and store digital NFTs directly on Bitcoin’s blockchain.\n\n1) Ordinals\n\nOrdinals is arbitrary data stored in one satoshi (sat) on Bitcoin’s blockchain. A sat is a small fraction of a Bitcoin. To recap, 1 $BTC equals to 100,000,000 sats. Moreover, users can send/receive ordinals.\n\nAs Casey explains in his exact words, “Ordinals are a convention which anyone can opt into”. He states that it is “just a convention that does not exist on the Bitcoin layer”. With it, “you can do things like see a sat’s particular history, make sats rare and exotic, give sats names and other wacky stuff.” Again, he reiterates that “it’s just this thing that you can convention that you can view the blockchain and pretend that individual sats have an identity and individual sats can move from UTXO to UTXO.”\n\nSo, how do we modify sats? This brings us to the next layer – Inscriptions.\n\nInscriptions\n\nInscriptions refer to the addition of data to each Sat, to make it an Ordinal. Said data can be in various forms, such as:\n\nText.\n\nAudio.\n\nVideo.\n\nAudio.\n\nIn Casey’s own words, inscriptions are “another convention which allows you to stick content (any file returnable by a file server, or any content viewable by a browser). Content is assigned to one of the SATs in the output of the transaction.”. With this, “this turns the sats effectively into a “Digital Artifact”.\n\nNow, you can see that each Sat has the potential to exist as an NFT. Or a Digital Artifact, as Casey puts it. Each Ordinal is also immutable and secure. This is similar in nature to Ethereum’s NFTs.\n\nPros and Cons of Ordinals\n\nMoving on, Stephan and Casey went on to discuss the pros and cons of Ordinals. Starting with the bull case, Casey states the benefits of Ordinals:\n\nRepresenting art, culture and money. Casey explains that old forms of money were intertwined with art and culture. In the olden days, money was in the forms of carved beads and art. Ordinal inscriptions are its modern representation.\n\nCasey explains that old forms of money were intertwined with art and culture. In the olden days, money was in the forms of carved beads and art. Ordinal inscriptions are its modern representation. Filling market demand. Casey brings up the immense popularity of NFTs. He believes that Ordinals provide the right product-market fit.\n\nCasey brings up the immense popularity of NFTs. He believes that Ordinals provide the right product-market fit. Onboarding users to the Bitcoin network. Casey opines that Ordinals can attract more users to use Bitcoin.\n\nHowever, there’s a flip side as well. During the interview, Stephan brings up a few cons for Ordinals.\n\nFirstly, he says that Ordinals could make validating harder. Bitcoin nodes have to download more data in order to validate the blockchain. Casey acknowledges this concern. Secondly, Stephan brings up a concern if Ordinals gaining traction. More users on the Bitcoin network would equate to higher fees. Again, this is a valid point.\n\nThe Potential of Ordinals\n\nDespite the cons above, Casey provides a simple reply. NFTs are meant to be fun! Every person views NFTs differently. Some value it while others think that it’s garbage. Truth of the matter is: There is a thriving market for it. So, the Bitcoin network should improve to cater to increased volume instead. It makes no sense to stifle innovation just to keep Bitcoin fees low.\n\nThe discussion then segues into the consumption of blockspace. Now, what does this mean? Let’s find out more.\n\nConsumption of Blockspace\n\nCasey makes it clear that Ordinals are more secure compared to Ethereum’s NFTs. This is because Ordinals exist fully on-chain. Remember what we went through earlier? Data is inscribed directly onto a Sat. With that, an Ordinal is as secure as a Bitcoin.\n\nThis is in contrast to Ethereum’s NFTs. On Ethereum, NFT metadata could be stored off-chain. It could be stored on third party systems. For instance, an InterPlanetary File System (IPFS) or external servers. If such third parties go offline, you could lose access to your NFT.\n\nBitcoin is the most badass, resilient, immutable database on planet earth. Ordinal inscriptions are how you write files to that database. Stop asking \"why ordinals?\" if your pfp is stored in the AWS data center in Columbus, Ohio. — Leonidas.og (@LeonidasNFT) February 23, 2023\n\nWith Ethereum, NFTs also face smart contract risks. Your NFT could be lost if its smart contract is buggy or malicious. Bitcoin Ordinals and Inscriptions address both of these risks Ethereum NFTs face. Hence, an increase in blockspace consumption here does have its own benefits too!\n\nConclusion\n\nAll in all, the interview was very informative. The discussion skews toward the technical side at times. Even so, it provides a great overview of Casey’s project.\n\nWhat I do agree with Casey on is: Bitcoin Ordinals are here to stay. Whether you like it or not. Indeed, it’s a new use-case for Bitcoin. We should embrace such new innovations, rather than fight it.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91a3JhaW5lLW5ldHRlZC03MG0taW4tY3J5cHRvLWRvbmF0aW9ucy1zaW5jZS1zdGFydC1vZi1ydXNzaWEtY29uZmxpY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ukraine netted $70M in crypto donations since start of Russia conflict - Cointelegraph",
        "content": "Ukraine has received over $70 million in cryptocurrencies since the start of the Russian-Ukrainian conflict, providing the nation with funds for military equipment and humanitarian assistance.\n\nThe figures came from a Feb. 24 report by blockchain data platform Chainalysis, which found the majority of the funds to have come in the form of Ether (ETH) and Bitcoin (BTC).\n\nETH donors led the way with $28.9 million given, while donors of BTC and Tether (USDT) chipped in $22.8 million and $11.6 million, respectively.\n\nCryptocurrencies donated to Ukraine wallets provided by the Ukrainian government. Source: Chainalysis\n\nDonations have also come in the form of nonfungible tokens, such as UkraineDAO’s auction of a Ukrainian flag NFT thasold for $6.1 million.\n\nAround 80% of the total $70 million donated came in the first few months of the war, with the speed of cryptocurrency payments fast-tracking the country’s ability to respond to the Russian invasion, Ukrainian deputy digital minister Alex Bornyakov explained in an interview with Yahoo Finance on Feb. 24:\n\n“If we used the traditional financial system it was going to take days [...] We were able to secure the purchase of vital items in no time at all via crypto, and what is amazing is that around 60% of suppliers were able to accept crypto, I didn’t expect this.”\n\nBornyakov added that the Crypto Fund Aid For Ukraine was an “absolute success” and that he was blown away by not only the amount of donations that came through but the ease at which the digital ministry could access those funds for Ukraine’s defense.\n\nAlona Shevchenko, co-founder of Ukraine DAO, also explained to Yahoo Finance that cryptocurrencies provided a solution when restrictions were imposed on the Ukrainian central banking system:\n\n“The central bank introduced limits on foreign currency transfers in and out of Ukraine to stop the run on the hryvnia [...] Thanks to crypto we were able to cover some of our defenders’ immediate needs, there was literally no other way at the time.”\n\nAccording to an August tweet bMykhailo Fedorov, Ukraine’s vice prime minister and minister of digital transformation, much of the cryptocurrency payments to the digital ministry have been used to fund the country’s military equipment, armor clothing and a range of vehicles and medicine.\n\nWith $54 M raised by @_AidForUkraine, we've supplied our defenders with military equipment, armor clothes, medicines and even vehicles. Thanks to the crypto community for support since the start of the full-scale invasion! Donation by donation to the big victory. Report below. pic.twitter.com/lifHAP8R4f — Mykhailo Fedorov (@FedorovMykhailo) August 17, 2022\n\nThe increased reliance on cryptocurrencies in Ukraine looks to have increased adoption in the country, with a September report by Chainanalysis finding Ukrainians to be the third-highest adopters, behind Vietnam and the Philippines.\n\nRelated: What the Russia-Ukraine war has revealed about crypto\n\nHowever, pro-Russian military groups have also used cryptocurrency to crowdfund their war efforts, including using crypto donations to fund military purchases, spread disinformation and create pro-invasion propaganda, according to Chainalysis.\n\nTotal value received by Russian military groups since February 2021. Source: Chainalysis\n\nThe 100 groups have received a total of $5.4 million over the course of the war, however, incoming donations have fallen considerably since July.\n\nIt is unclear what impact sanctions had on this downtrend, but a 10th package of sanctions against Russia was introduced on Feb. 24.\n\nMeanwhile, a recent crime report by Chainalysis found that of the $456.8 million total ransomware payments in 2022, a majority of these funds were taken by “actors” believed to be based in Russia.\n\nChainalysis explained that such attacks are often utilized by bad actors for political agendas, such as that of Russia-based pro-conflict ransomware group Conti, which reeled in $66 million from victims in 2022 and has previously announced its “full support” of the Russian government."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbmdlZWsuY29tL29yZGluYWxzLW9uLWJpdGNvaW4td2l0aG91dC1zZWd3aXQtYW5kLXRhcHJvb3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ordinals on Bitcoin without SegWit and Taproot - CoinGeek",
        "content": "This post was first published on Medium.\n\nOrdinals has become a hot topic in BTC circles to create non-fungible tokens (NFTs). Its main feature is storing the NFT itself entirely on chain.\n\nWe show that the original Bitcoin protocol can already support it. No breaking changes, including both SegWit and Taproot, are needed for Ordinals to work. Actually, it works better on the original protocol: 100,000X cheaper and 12.5X bigger.\n\nHow Ordinals Works\n\nOrdinals is the latest manifestation of color coins, which marks individual satoshis (thus “coloring” them) such that they can carry extra information. More specifically, every satoshi is sequentially ordered based on the time it is mined, which was first proposed in the Bitcoin forum in 2012. Each satoshi will have an ordinal number between 0 and 2,100,000,000,000,000 (hence the term “ordinals”) assigned. Each unique satoshi can then be inscribed with some other information to create NFTs (aka inscriptions).\n\nWhen an Ordinal NFT is minted in a transaction, it is inscribed on the first satoshi of the first output of the transaction. The transaction contains some extra data: text, images, videos, etc. Afterward, it can be transferred just like regular bitcoins.\n\nConsider an example transaction with three inputs and two outputs.\n\nThere are six satoshis from three addresses in the inputs. The outputs contain five satoshis to two different addresses. The remaining one satoshi is used as a fee to pay the miner.\n\nOrdinals uses the first-in-first-out algorithm to assign each satoshi of the inputs to the outputs. Any missing ordinals go to the miner. In the example, Ordinals (and their represented NFTs, if any) A, B, C, and D go to the first output, F to the second, and F to the miner.\n\nCompare with other Bitcoin-based NFTs\n\nPrevious colored coins usually use OP_RETURN, an unspendable output with only 80 bytes of metadata maximally, which means a link/reference to NFT is stored.\n\nOrdinals stores the entire NFT image/content on-chain using these techniques.\n\nThe Taproot upgrade in 2021 removed the data limit entirely, as long as it fits inside a block. Segregated Witness (Segwit) software upgrade in 2017 allows up to 3MB of witness data to be stored ‘outside’ of the 1MB block limit. Together, they provide up to 4MB worth of storage space for the inscription content. Inscriptions are stored in an “envelope” between Opcodes OP_IF and OP_ENDIF. OP_FALSE precedes OP_IF to ensure that this data is never actually used in script execution and does not take up stack space. No OP_RETURN is used, and the output containing an inscription is spendable and thus unprunable. The following example inscribes the text “Hello, world!”:\n\nOrdinals on Bitcoin SV\n\nThe original Bitcoin protocol of today, Bitcoin SV (BSV), pioneered storing NFT entirely on chain as early as 2021. Since BSV and BTC share the same algorithm for issuing satoshis, they can assign satoshis ordinal numbers in the same way. Ordinals on BSV works overwhelmingly better than on BTC.\n\nCost: BTC fees are around 10 sat/byte, while BSV’s are only 0.05 sat/byte¹. Given the price of $25,000/BTC vs. $45/BSV as of today, minting the same NFT is >100,000X cheaper! Data size: BSV has restored the full Script after the Genesis upgrade, so the same envelope works. It also has more ways to embed the data in a transaction. For example, OP_RETURN can be used in a spendable output. Currently, up to 50MB of data can be included in a single transaction, 12.5X bigger than the 4MB limit on BTC. Here is a transaction of 27MB and another of 12MB. Data limit is expected to increase continuously as usage grows. More advanced NFT protocol on top has already stored NFT over 1GB, by breaking it up across multiple transactions.\n\nWe are thrilled to announce that in partnership with STAS and @Bitstocks_, we have minted the largest #NFT ever on a public blockchain. At 1.07 GB in size, this single NFT is ~1/300th the size of the #BTC blockchain. Relysia Infrastructure – It's time to upgrade! #BSV pic.twitter.com/0vAE3OziCF — Relysia (@Relysia_SV) October 7, 2021\n\nBSV does so without changing the protocol. No SegWit and Taproot is needed.\n\nReferences\n\n[1] https://docs.ordinals.com/\n\n[2] https://medium.com/coinmonks/ordinals-an-overview-of-bitcoin-nfts-795c39447e23\n\n[3] https://tara-annison.medium.com/a-comprehensive-explanation-of-ordinals-nfts-on-bitcoin-67b11868e74f\n\n[4] https://www.chain.com/blog/what-are-bitcoin-ordinals\n\n***\n\nNOTE:\n\n[1] We compare the average fee rate. In BTC, SegWit can bring 4X discount, and in BSV, some miners take 0.01 sat/byte, a 5X discount.\n\nWatch: Smart Contracts and Computation on BSV\n\nwidth=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDIvMjcvZHJha2UtbG9zZXMtNDAwMDAwLXdvcnRoLW9mLWJpdGNvaW4tYWZ0ZXItYmV0dGluZy1vbi1qYWtlLXBhdWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Drake Loses $400,000 Worth of Bitcoin after Betting on Jake Paul - Crypto Times",
        "content": "The five-time Grammy Award-winning rapper, Drake, lost $400,000 in bitcoin, about 17 BTC, after betting that Jake Paul would defeat British professional boxer Tommy Fury in the boxing matchup held in Diriyah, Saudi Arabia.\n\nYouTuber-turned-boxer Jake Paul becomes the latest victim of the infamous ‘Drake Curse,’ as the rapper has a history of supporting an individual or team for them to lose eventually.\n\nBefore this game, Paul had won six consecutive games. World heavyweight champion Tyson Fury’s half-brother Tommy Fury defeated Paul in the eight-round fight by split decision despite being knocked out in the final bout.\n\nDon’t judge me by my wins, judge me by my losses. Congrats to Tommy, his team and his family. Thank you to everyone that tuned in. Saudi Arabia thank you as well. I will be back. — Jake Paul (@jakepaul) February 27, 2023\n\nPaul’s biggest match to date took place as he had only faced MMA fighters, YouTubers, and ex-NBA players in the ring before his fight with Tommy Fury. Drake placed the bet on the crypto gambling platform Stake.\n\nPaul made light of Drake’s bet during the press conference that followed the fight saying “F***! This is Drake’s fault! Drake, bro, why did you do this to me? No, it’s my fault. $400,000 is nothing to him – he has won a lot more money betting on me before. He’s probably about even now. Sorry, Drake, I’ll get that win in the rematch.”\n\nDrake is known for placing various crypto bets. Last May, Drake lost more than $200,000 worth of bitcoin on a Spanish Grand Prix bet. The rapper previously bet $1.26 million worth of bitcoin on the Super Bowl match between the LA Rams and the Cincinnati Bengals."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tY291bGQtbWFrZS15b3UtYS1taWxsaW9uYWlyZS1qdXN0LWxpa2UtYml0Y29pbi1hbmQtZXRoZXJldW0tZGlkLXNvbWUteWVhcnMtYWdvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "Big Eyes Coin Could Make You A Millionaire, Just Like Bitcoin And Ethereum Did Some Years Ago - Analytics Insight",
        "content": "If you had invested in Bitcoin (BTC) when it launched in 2009, your returns could be in the millions or billions even though your initial capital was $0 because that was the cost of the coin at the time. If you got in a bit later, like when it was 10 cents in late 2010, and invested only $10, you would have been able to buy about 100 bitcoins.\n\nEven at its current low, those 100 bitcoins would be worth more than $2.4 million. Imagine if you had bought more back then.\n\nWe can do a similar calculation with Ethereum (ETH). When it launched in 2015, it first traded at $2.77 but quickly fell in value to $0.81 within 24 hours. Let’s play the “imagine” game again.\n\nSo, if you had spent a mere $100 on day one, you’d have about 36 ETH tokens, or if you bought on day two, you’d have about 123 tokens. At this moment, ETH is valued at $1664.8 per token. Do the math.\n\nWhile the possibility of repeating the success of Bitcoin millionaires is slim, it is not impossible if investors get in early with their investments. Hence, Big Eyes Coin is attracting a lot of interest from smart investors who see the potential for another millionaire-making move.\n\nBig Eyes is already worth over 390%\n\nWe have seen time and again that the earlier investors buy into a cryptocurrency, the greater the profit. For most coins, there is no earlier entry point than their presale journey.\n\nRight now, Big Eyes is making huge waves as a result of how successful its presale has been, which is an indicator of how well the coin can potentially perform when it is launched to the public.\n\nFor a cat-themed meme, BIG has managed to raise $30 million in its 12th stage of the presale and can be bought for a tiny amount of $0.00049. That is still a 390 percent increase from its price of $0.0001 at the first stage. This means that those who bought it at stage 1 will profit by more than 390% of those who buy at stage 12.\n\nThere is still time to take advantage of the opportunity that BIG presents, and getting in now will still be a huge advantage for investors seeing that the presale is typically the lowest amount any coin would be bought for.\n\nBitcoin – From Zero to thousands\n\nSince its launch in January 2009, the price of bitcoin has been on a roller coaster, but the long-term trajectory has been “up and to the right,” as they say. The advent of Bitcoin marked the beginning of the cryptocurrency era, but it took some time before the general public became aware of it.\n\nNonetheless, it appears that cryptocurrency, particularly Bitcoin, has emerged as the most intriguing trading opportunity in more than a decade.\n\nThe coin’s value has risen from $0 to $0.40, then to $1 after a few months, and then in 2011, it went to $8 before reaching $30 in the same year. At the time, this was exciting for investors, but even the most optimistic investor had no clue just how big things were going to get. Through a few ups and downs, in April 2013, the coin surpassed $100, and barely eight days later, it was trading at $230.\n\nOver the next few years, BTC flirted with different figures, and by December 2020, BTC was closing the year at $28,949. 2021 was probably the most successful year for Bitcoin investors as the coin rose to an all-time high of $68,789 before the great crash that saw the coin lose value and end at its current price.\n\nEthereum – another crypto fairytale\n\nAfter Bitcoin, Ethereum (ETH) is the second-largest cryptocurrency in the world. It was introduced in July 2015 and went on sale for $2.77 on August 7. The coin was worth $0.81 the following day. The price stayed below $1 until January 2016.\n\nRemember that the past few years have seen a tremendous increase in the price of digital currencies. In 2021, between January and April, the price of Ethereum increased by about 300%, and the coin surpassed $3000. Yet, even without that jump, you would still be doing well if you had purchased Ethereum at $2.77.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1idWxsLXJ1bi1vbi10aGUtaG9yaXpvbi1leHBlcnRzLWFuYWx5c2Utc3VyZ2UtcGFzdC0yNWstaW4tMjAyMy0xMDE2NzMzMS5odG1s0gGSAWh0dHBzOi8vd3d3Lm1vbmV5Y29udHJvbC5jb20vbmV3cy9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWJ1bGwtcnVuLW9uLXRoZS1ob3Jpem9uLWV4cGVydHMtYW5hbHlzZS1zdXJnZS1wYXN0LTI1ay1pbi0yMDIzLTEwMTY3MzMxLmh0bWwvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bull run on the horizon? Experts analyse surge past $25k in 2023 - Moneycontrol",
        "content": "Bitcoin, the world’s largest digital currency, surged last week, breaking past the $25,000 mark and reaching a new high for 2023. This was an almost 60 percent gain for the cryptocurrency from the low of $15,742 in 2022 following the FTX crisis in November. Bitcoin's value has been increasing steadily since then.\n\nThe last time Bitcoin was at a similar level was in mid-June of 2022, after which it stagnated for a prolonged period, with values hovering in the $19,000 to $21,000 range for several months. The cryptocurrency is still well below its peak of $68,992, which it reached in November 2021.\n\nStory continues below Advertisement Remove Ad\n\nExperts said that while the surge above $25,000 was a positive sign, the market remains susceptible to sudden changes. They advise investors to remain vigilant and prepared to react quickly to market movements.\n\nAccording to Ben Sharon, cofounder of LumiShare SRG, factors such as regulatory changes, geopolitical tensions, and the performance of major players like Bitcoin will all have an impact on the market, which looks positive at this stage. “The bull market will begin within the next two quarters,” Sharon told Moneycontrol.\n\nAlso Read: Top Cryptocurrency Prices Today February 27: Bitcoin, Ether in green as crypto mcap rises\n\nMatter of regulation\n\nAnother market analyst said Bitcoin is still largely misunderstood or misrepresented and the real question for investors is how regulatory authorities treat the cryptocurrency ecosystem.\n\nNathan Thompson, a lead tech writer at Bybit, noted that Bitcoin is currently traded as a risk asset and is affected by many macro factors. These include inflation, recession, and general discourse, which have a direct impact on the price of cryptocurrency.\n\nStory continues below Advertisement Remove Ad\n\nStory continues below Advertisement Remove Ad\n\nThompson emphasised that Bitcoin and other blockchain-based assets are a net gain in terms of access and efficiency and if allowed to flourish, they will increase productivity and growth worldwide. Sean K. August, CEO of The August Wealth Management Group, said crossing the $25,000 mark is a significant milestone for Bitcoin, which could potentially continue to rise in the short term.\n\nHowever, the future of Ethereum, the second-biggest cryptocurrency by market capitalisation, may depend on factors such as the adoption of the Ethereum blockchain and the launch of new projects and applications.\n\nAugust said the crypto market is highly volatile and subject to fluctuations, influenced by factors such as regulatory changes, adoption by institutional investors, and the macroeconomic environment. Modulus CEO Richard Gardner notes that the macroeconomy is only moving the market for the short term, and the real question for Bitcoin investors is how regulatory authorities will treat crypto.\n\nUntil there is regulation, the sector will be stuck in a holding pattern. Gardner predicts that crypto will truly break free in a meaningful way only when regulatory authorities provide oversight.\n\nIntergovernmental blockchain expert Anndy Lian said the recent surge in BTC price cannot be attributed solely to its intrinsic value – it is also heavily influenced by the current global economic climate. Bitcoin is viewed as a safe haven asset and its decentralised nature makes it an attractive option for those who are sceptical of traditional financial institutions.\n\nWhitney Setiawan, a research analyst at cryptocurrency exchange Bitrue, has predicted that the current market for Bitcoin and Ethereum could signal the start of a bull run in the near future. According to Setiawan, the crypto market is influenced by factors such as inflation slowing globally and the US Federal Reserve taking a slightly dovish tone.\n\nSetiawan cited the bottoming of crypto prices and the buy-on-the-dip mentality of traders as the main drivers for the recent price surge. Setiawan noted that historically, bear market rallies with a parabolic upward movement are quite common before a substantial decrease in price, and this could be the case this time as well."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS90YXhlcy9maWxpbmcvYml0Y29pbi1jcnlwdG8tdGF4ZXMtMjAyMy13aGF0LXlvdS1uZWVkLXRvLWtub3cv0gFgaHR0cHM6Ly93d3cuZ29iYW5raW5ncmF0ZXMuY29tL3RheGVzL2ZpbGluZy9iaXRjb2luLWNyeXB0by10YXhlcy0yMDIzLXdoYXQteW91LW5lZWQtdG8ta25vdy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin and Crypto Taxes in 2023: What You Need To Know - GOBankingRates",
        "content": "Since cryptocurrency exchanges are still in their infancy, you shouldn’t expect them to provide you with any year-end tax information regarding your crypto holdings or transactions. The same was true in the early days of stock brokerages. But whereas brokerage firms now provide customers with transaction data and gain/loss information regarding their holdings, most crypto exchanges still do not. This is scheduled to change in tax year 2023 when crypto exchanges will be required to send out a 1099 to customers. But for now, you should take care to record all of your transactions on your own, particularly when it comes to calculating taxable gains or losses."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vMzktb2YtZXRoZXJldW0tc3VwcGx5LWlzLWhlbGQtYnktd2hhbGVzLWNvbXBhcmVkLXRvLWJpdGNvaW5zLTExL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "39% of Ethereum supply is held by whales compared to Bitcoin's 11% - Finbold - Finance in Bold",
        "content": "In the world of cryptocurrency, Bitcoin (BTC) and Ethereum (ETH) remain the largest digital assets based on market capitalization and are known to dictate the trajectory of the entire market. However, the distribution of these cryptocurrencies is vastly different, with Ethereum having a significantly higher percentage of its supply held by whales compared to Bitcoin.\n\nIn particular, as of February 26, 2023, around 39% of the total supply of Ethereum is concentrated among large addresses, data by crypto market intelligence platform IntoTheBlock\n\nEthereum concentration by large holders. Source: IntoTheBlock\n\nThis is in stark contrast to Bitcoin, where large addresses hold only 11% of the total supply.\n\nBitcoin concentration by large holders. Source: IntoTheBlock\n\nIndeed, contraction by holders metric aggregates the share of circulating supply held by whale addresses, accounting for over 1% of the supply and investors or addresses holding between 0.1%-1%. The combination of the two metrics equates to the total concentration by large holders.\n\nEthereum’s onchain activity\n\nEthereum’s large address concentration coincides with the network’s increased development activity. The staking feature remains the main highlight for the decentralized finance ecosystem following the historical Merge upgrade.\n\nAfter months of testing, investors are set to start withdrawing their staked ETH in March after the Shanghai upgrade goes live.\n\nAlthough the high concentration of Ethereum whales has different implications, it could hint at the investors’ future price outlook for the asset. It is worth noting that as Ethereum undergoes significant developments, proponents still bet the asset might flip Bitcoin.\n\nAt the same time, it can be argued that Ethereum is relatively cheap compared to Bitcoin, making it affordable to amass in large amounts.\n\nImplication of whale addresses\n\nThe concentration of crypto wealth in the hands of a few large holders is a controversial topic in digital asset circles. Some argue that it is a natural outcome of the market and that wealthy individuals should be allowed to hold large amounts of digital assets.\n\nOthers, however, argue that this concentration of wealth goes against the decentralized ethos of cryptocurrency and could lead to market manipulation.\n\nRegardless of varied opinions on the matter, the fact remains that Ethereum’s supply is significantly more concentrated in the hands of a few large holders compared to Bitcoin. This could have important implications for the future of the Ethereum ecosystem and its price.\n\nBy press time, Ethereum was trading at $1,645 with daily gains of over 4%, while Bitcoin is trading at $23,657.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]