[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lmdsb2JhbHhldGZzLmNvbS9iaXRjb2luLXNjYXJjaXR5LWFuZC1zdG9yZS1vZi12YWx1ZS1hdHRyaWJ1dGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Scarcity and Store-of-Value Attributes – Global X ETFs - Global X",
        "content": "Within the fast-paced, ever-changing realm of digital assets stands a single, unchanging pillar. Bitcoin, the first cryptoasset, distinguishes itself by its decentralized nature, avoiding control by any singular entity. Supported by a finite supply and a high cost of production, scarcity is an integral component of bitcoin’s value proposition. In this blog post, we explore how the countervailing forces of supply and demand can influence perceptions of scarcity and ultimately have an outsized influence on market dynamics.\n\nThis piece is part of a series that dives deeper into this year’s iteration of our flagship research piece, Charting Disruption.\n\nKey Takeaways\n\nGold and bitcoin are defined by rigid supply constraints and a high cost of production, resulting in stable and predictable supply schedules.\n\nBitcoin’s scarcity is supported by the Halving which reduces bitcoin’s annual issuance rate by 50% approximately every four years. Historically, the Halving has resulted in significant price appreciation of bitcoin in the year following the Halving.\n\nWith the next Halving scheduled for April 2024, market participants expect a similarly strong reaction to bitcoin’s reduced supply.\n\nRelatively rigid supply constraints are one of the defining attributes of effective store-of-value assets. Gold, for example, has a finite total supply that exists on Earth. That supply has been determined by the laws of astrophysics and is not at risk of manipulation. Further, the costs and operational complexities associated with gold mining mean that the process of extracting the gold remaining under the Earth’s surface is slow, resulting in a relatively stable drip of new supply into the global market each year.\n\nBitcoin is subject to similar constraints, but in a digital format. Rather than being dictated by astrophysical laws, bitcoin’s maximum supply of 21M tokens was hardcoded into the protocol at inception and is protected from manipulation by the laws of proof-of-work (PoW) consensus. As with gold, the process of accessing untapped reserves of bitcoin is a financially intensive process, requiring significant capital investment and subject to the operational constraints of regular adjustments to the difficulty of bitcoin mining. Together, the confluence of a finite total supply with the technical and financial restraints on mining result in smooth and predictable supply schedules for both gold and bitcoin, directly supporting their scarcity.\n\nA key factor ensuring bitcoin’s scarcity is the “Halving.” Occurring every 210,000 Bitcoin “blocks,” or approximately every four years, the Halving reduces the annual issuance rate of bitcoin by 50%, bringing the network one step closer to reaching its terminal supply of 21m. While these regular reductions in supply are both highly anticipated and predictable, historical market behavior suggests that the impact of the Halving tends not to be fully reflected in the price of bitcoin until about a year after the event occurs.\n\nOne explanation for this significant time lag could simply be market inefficiencies resulting from the nascency of crypto markets and the relative lack of sophistication among market participants. As such, it may be that asset mispricings are not exploited as quickly as would otherwise be the case in more mature markets. While this may carry some explanatory power, another reason for the time lag is likely due to the behaviors of bitcoin miners which are among the largest and most active participants in bitcoin markets on a daily basis.\n\nThe majority of miner revenues come from newly issued or “mined” bitcoin. To raise the cash needed to cover operational expenses, standard procedure is for a miner to sell a portion of this bitcoin issuance and hold the remaining portion on their balance sheet as an investment. While this generally holds throughout the market cycle, historical data shows that in the period leading up to a Halving, miners tend to increase the amount of bitcoin transferred to exchange platforms—an indication of an intention to sell bitcoin reserves.1 This behavior is likely due to miners anticipating reduced bitcoin-denominated revenues following the Halving, incentivizing them to raise additional cash reserves while rewards are higher.\n\nAmong the largest structural sellers of bitcoin, the increased selling activity of bitcoin miners leading into the Halving seems to establish a price ceiling for bitcoin. It is only during the period following the Halving that miners revert to typical market behavior, ultimately allowing the market to move towards a higher equilibrium price that is reflective of bitcoin’s newly reduced supply.\n\nConclusion\n\nThe store-of-value properties of gold and bitcoin are highly influenced by perceptions of scarcity. In large part, these perceptions depend on a tightly controlled, unchanging supply, and a mechanism to control their rate of inflation. For bitcoin, history has shown that the supply shock caused by the Halving represents a significant catalyst for the price of bitcoin. With bitcoin’s fourth halving anticipated in early 2024, bitcoin will have yet another opportunity to demonstrate why it is one of the world’s most unique assets."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjgvYml0Y29pbi1ldGYtYXBwcm92YWwtdGlwcGVkLXRvLWJlLXNlbGwtdGhlLW5ld3MtZXZlbnQtY3J5cHRvcXVhbnQv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8yOC9iaXRjb2luLWV0Zi1hcHByb3ZhbC10aXBwZWQtdG8tYmUtc2VsbC10aGUtbmV3cy1ldmVudC1jcnlwdG9xdWFudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin ETF Approval Tipped to Be 'Sell The News' Event: CryptoQuant - CoinDesk",
        "content": "\"With Bitcoin up over 60% since ETF mania began a few months ago, and with every man and his dog on X.com expecting an approval on or around 10 January, we must start to anticipate much larger volatility events (up/down) in this region. Risk today is substantially higher for long Bitcoin positions than it was just a few weeks ago,\" Capriole wrote in a blog post."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMTIvMjUvdGVjaG5vbG9neS9iaXRydXNoLWJpdGNvaW4tY3J5cHRvY3VycmVuY3ktY2hpbmEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "This N.Y.U. Student Owns a $6 Million Crypto Mine. His Secret Is Out. - The New York Times",
        "content": "Jerry Yu has the trappings of what the Chinese call second-generation rich. He boasts a Connecticut prep-school education. He lives in a Manhattan condominium bought for $8 million from Jeffrey R. Immelt, the former General Electric chief executive. And he is the majority owner of a Bitcoin mine in Texas, acquired last year for more than $6 million.\n\nMr. Yu, a 23-year-old student at New York University, has also become — quite unintentionally — a case study in how Chinese nationals can move money from China to the United States without drawing the attention of authorities in either country.\n\nThe Texas facility, a large computing center, was not purchased with dollars. Instead, it was bought with cryptocurrency, which offers anonymity, with the transaction routed through an offshore exchange, preventing anyone from knowing the origin of the financing.\n\nSuch secrecy allows Chinese investors to avoid the U.S. banking system, and the accompanying oversight of federal regulators, as well as sidestep Chinese restrictions on money leaving China. In a more traditional transaction, a bank receiving the funds would know where they were coming from and would be required by law to report any suspicious activity to the U.S. Treasury."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMTIvMjgvY2F0aGllLXdvb2QtaXMtdHJpYWxsaW5nLWEtbmV3LWJpdGNvaW4tc3RyYXRlZ3ktZm9yLTIwMjQtaW5jbHVkaW5nLXNoZWRkaW5nLXNoYXJlcy1vZi1hLWZvcm1lci1mYXZvcml0ZS1ob2xkaW5nL9IBkwFodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMTIvMjgvY2F0aGllLXdvb2QtaXMtdHJpYWxsaW5nLWEtbmV3LWJpdGNvaW4tc3RyYXRlZ3ktZm9yLTIwMjQtaW5jbHVkaW5nLXNoZWRkaW5nLXNoYXJlcy1vZi1hLWZvcm1lci1mYXZvcml0ZS1ob2xkaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood is trialling a new Bitcoin strategy for 2024—including shedding shares of a former favorite holding - Fortune",
        "content": "One of Cathie Wood’s exchange-traded funds has executed a massive shake-up in its Bitcoin-related holdings as the cryptocurrency rounds out a blockbuster year.\n\nThe ARK Next Generation Internet ETF sold all of its remaining 2.25 million shares of the Grayscale Bitcoin Trust on Wednesday, according to data compiled by Bloomberg. The same day, it bought 4.32 million shares of ProShares Bitcoin Strategy ETF, according to Ark Investment Management LLC’s daily data, making it the second-biggest holder of the fund.\n\nWood has been trimming her holdings in the Grayscale Bitcoin Trust — which used to be ARK Next Generation Internet ETF’s top holding — in recent months, even as Bitcoin rose to its highest level since April 2022. The cryptocurrency has more than doubled in 2023, with much of the gains coming toward year-end amid speculation that the US Securities and Exchange Commission will approve spot Bitcoin ETFs early next month.\n\nWood touted the Grayscale Bitcoin Trust as her top pick at the Sohn Australia conference last month.\n\nAlso Wednesday, the ARK ETF bought 20,000 shares of the ARK 21Shares Active Bitcoin Futures Strategy ETF and sold 148,885 shares of crypto exchange Coinbase Global Inc., according to the fund’s report.\n\nThe ARK Next Generation Internet ETF is up 103% for the year, compared with a 55% advance in the Nasdaq 100 Index. However, the fund’s path has been volatile — it fell 19% and 67% in 2021 and 2022, respectively."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1vdXRsb29rLWNyeXB0by1oYWx2aW5nLWJsb2NrY2hhaW4tZmluYW5jZS1tYXJrZXRzLWV0aC1idGMtMjAyMy040gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Price Outlook: BTC Could Hit $100,000 by 2025 - Markets Insider",
        "content": "Bitcoin is set to top $100,000 by 2025, a crypto executive said.\n\nIts next halving is in April 2024, and the prior three halvings led to big rallies before and after them.\n\nA \"conservative\" estimate puts the token at $105,000 12 months after the event, he said.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nHistorical trends indicate bitcoin is on pace to blow past record highs and hit $100,000 by 2025, a blockchain executive said.\n\nJoe Kelly, a cofounder and the CEO of Unchained, a cryptocurrency financial-services firm with $2 billion in assets under management, said bitcoin's prior three \"halving\" events — or when the number of bitcoins rewarded to miners gets cut in half — suggest massive upside for the token leading up to and after the next halving, in April 2024.\n\nMiners' rewards will be reduced from 6.25 bitcoin to 3.125 per block, creating a scarcity effect, according to the original whitepaper authored by Satoshi Nakamoto.\n\nEach of the past three halvings correlated with new highs within 12 months.\n\nAdvertisement\n\n\"Taking a conservative view,\" Kelly wrote in a note in August, \"if bitcoin stays around $30K until the halving, even a 12-month post-halving increase of 250% — which, again, is conservative relative to previous halvings — would price bitcoin at $105K.\"\n\nThe exec pointed out that one year after the 2012, 2016, and 2020 halvings, the price of bitcoin was up 8,069%, 284%, and 559%, respectively.\n\nHe added that the world's biggest crypto by market cap had also experienced sharp rallies leading up to halving events.\n\nIn the 12 months before each of the past three halvings, bitcoin climbed 385%, 142%, and 17%, respectively.\n\nAdvertisement\n\nFundstrat, meanwhile, published a note to clients in July that said bitcoin could hit $180,000 before the next halving, largely on the back of momentum from a proposed crypto exchange-traded fund from BlackRock.\n\nThe bitcoin-ETF launch \"would bring daily demand to $125 million, while daily supply is only $25 million,\" the Fundstrat strategists wrote, adding: \"The implied equilibrium price would need to rise so daily supply matches daily demand. Equilibrium analysis suggests that a clearing price is $140,000 to $180,000, before the April 2024 halvening.\"\n\nBitcoin's total supply is capped at 21 million, and each halving brings the blockchain closer to that level. Halving happens every 210,000 blocks mined, or about every four years, with the most recent one occurring on May 11, 2020.\n\nBarring surprises, the final halving event should take place in 2140.\n\nAdvertisement\n\nBitcoin has surged more than 120% in 2023, recovering from last year's 65% sell-off. The rebound has coincided with historic interest-rate hikes from the Federal Reserve, as well as a series of bank failures that began with Silicon Valley Bank.\n\nSeparate from the halving event, recent speculation about whether the Securities and Exchange Commission will approve a spot bitcoin ETF has fueled bullish sentiment.\n\nMeanwhile, any easing of monetary policy in 2024, Kelly said, could provide a further boost for crypto.\n\n\"While past price activity suggests good odds, there is of course no guarantee that the next bitcoin halving will indeed drive\" a record high, Kelly said, adding: \"Mining rewards are not directly tied to market demand and other macroeconomic factors, including a rising interest rate environment, could deter investors from buying bitcoin.\"\n\nAdvertisement\n\nThis story was originally published in August 2023."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI4L2EtY2F0aGllLXdvb2QtZXRmLWp1c3Qtb3ZlcmhhdWxlZC1pdHMtYml0Y29pbi1yZWxhdGVkLWhvbGRpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "A Cathie Wood ETF Just Overhauled Its Bitcoin-Related (BTC) Holdings - Bloomberg",
        "content": "One of Cathie Wood ’s funds has executed a massive shake-up to its Bitcoin-related holdings, selling off its remaining position in the Grayscale Bitcoin Trust because of uncertainty over whether it will be able to successfully convert into an exchange-traded fund.\n\nThe ARK Next Generation Internet ETF sold all of its remaining 2.25 million shares of the Grayscale Bitcoin Trust on Wednesday, according to data compiled by Bloomberg. The same day, it bought 4.32 million shares of the ProShares Bitcoin Strategy ETF, which invests in Bitcoin futures, according to the investment firm’s daily data, making it the second-biggest holder of the fund."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdmFuZWNrLXJlbGVhc2VzLW5ldy1iaXRjb2luLWNvbW1lcmNpYWwtYWhlYWQtb2YtcG90ZW50aWFsLXNwb3QtYml0Y29pbi1ldGYtYXBwcm92YWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "VanEck Releases New Bitcoin Commercial, Ahead of Potential Spot Bitcoin ETF Approval - Nasdaq",
        "content": "VanEck, a prominent investment management firm, has unveiled a interesting new Bitcoin commercial, stirring excitement and speculation within the Bitcoin community. The release comes amidst mounting anticipation surrounding the possible approval of Spot Bitcoin Exchange-Traded Funds (ETFs) by the Securities and Exchange Commission (SEC).\n\nThe commercial, showcases a high-quality production recorded at PubKey, a Bitcoin bar in New York City. \"All Bitcoiners in NYC need to make the pilgrimage to PubKey if they haven’t checked it out yet,\" VanEck said.\n\nThis move by VanEck appears to be a prelude to the imminent decision on the much-anticipated Spot Bitcoin ETFs. Industry analysts interpret this release as an attempt to not only capture public attention but also to bolster confidence in Bitcoin-related financial products.\n\nThe commercial’s timing aligns with VanEck's continued efforts to secure regulatory approval for a Bitcoin ETF, signaling their readiness to enter the market should approval be granted. The SEC has been under increasing pressure to greenlight a Spot Bitcoin ETF, which would open the door for institutional and more retail investors to access Bitcoin exposure via traditional investment avenues.\n\nAs the Bitcoin community eagerly awaits the SEC’s decision, VanEck’s bold marketing move has ignited conversations, fueling optimism about the integration of Bitcoin into mainstream financial services. The commercial aims to resonate with both seasoned Bitcoin enthusiasts and newcomers, emphasizing the potential significance of BTC in reshaping global finance.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMi8yOS9iaXRjb2luLW1pbmVycy1vZmZsb2FkLTEyOW0tYnRjLWluLWRheS1zZW5kaW5nLXJlc2VydmVzLXRvLXRoZS1sb3dlc3QtcG9pbnQtc2luY2UtbWF5L9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMi8yOS9iaXRjb2luLW1pbmVycy1vZmZsb2FkLTEyOW0tYnRjLWluLWRheS1zZW5kaW5nLXJlc2VydmVzLXRvLXRoZS1sb3dlc3QtcG9pbnQtc2luY2UtbWF5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Miners Offload $129M BTC in Day, Sending Reserves to the Lowest Point Since May - CoinDesk",
        "content": "In a post on social-media platform X, AliCharts pointed out that miners have sold 3,000 bitcoin (BTC) over the past 24 hours, equating to around $129 million. The cryptocurrency is currently trading at $42,891, down from yesterday's high of $43,710."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI5L2JsYWNrcm9jay1uYW1lcy1qYW5lLXN0cmVldC1qcG1vcmdhbi1hcy1iaXRjb2luLWV0Zi1hdXRob3JpemVkLXBhcnRpY2lwYW50c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "BlackRock Names JPMorgan, Jane Street as Bitcoin ETF Brokers - Bloomberg",
        "content": "Jane Street, the firm where FTX’s Sam Bankman-Fried learned how to trade, is so far the broker-dealer of choice for issuers of proposed exchange-traded funds that aim to invest directly in Bitcoin.\n\nFidelity and WisdomTree named Jane Street Capital as their “authorized participant,” the industry’s term for the firm that’s responsible for steering cash into and out of ETFs. BlackRock also named Jane Street as well as JPMorgan Securities as its authorized participants should its proposed spot-Bitcoin fund receive regulatory approval, according to an amended prospectus Bloomberg Terminal filed with the Securities and Exchange Commission on Friday. Valkyrie said in its own filing Bloomberg Terminal that it also has engaged Jane Street Capital as well as Cantor Fitzgerald & Co. for the same role."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzI5L2pwbW9yZ2FuLWNlb3MtYml0Y29pbi1iYXNoaW5nLWlzLWEtZG8tYXMtaS1zYXktbm90LWFzLWktZG8tc2l0dWF0aW9uL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzI5L2pwbW9yZ2FuLWNlb3MtYml0Y29pbi1iYXNoaW5nLWlzLWEtZG8tYXMtaS1zYXktbm90LWFzLWktZG8tc2l0dWF0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "JPMorgan CEO's Bitcoin Bashing Is a 'Do as I Say, Not as I Do' Situation - CoinDesk",
        "content": "JPMorgan CEO's Bitcoin Bashing Is a 'Do as I Say, Not as I Do' Situation\n\nJamie Dimon's bank agreed to play a key role with BlackRock's proposed bitcoin ETF, just weeks after he told U.S. senators: \"I've always been deeply opposed to crypto, bitcoin, etc.\"\n\nBy Nick Baker Dec 29, 2023 at 10:38 p.m. UTC"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMi0yOC9jYXRoaWUtd29vZC1vbi1iaXRjb2luLWhvbGRpbmdzLXRlc2xhLTIwMjQtb3V0bG9vay12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood on Bitcoin Holdings, Tesla, AI, 2024 Outlook - Bloomberg",
        "content": "00:00\n\nWe're as optimistic about Bitcoin as we ever have been. But there were there are a few regulatory and tax uncertainties, and we had been waiting for the discount between BTC and NAV two to narrow. It was as high as 50% at one point last year when there was great uncertainty around all of the turmoil in crypto generally and now it's single digit and there are no other products out there that we can use to gain exposure to Bitcoin in this moment. And it's just a moment of uncertainty between now we think, and January, January 8th to 10th, somewhere in that range perhaps. But we will, out of an abundance of caution, didn't want to take any risk. And I mean, let's get a little bit specific here because we're talking about the ARK next generation Internet ETF. The ticker there is Ark W And I think what caught a lot of people's attention is that you completely sold down your remaining stake of the grayscale Bitcoin trust. Instead, on the same day you bought into the ProShares Bitcoin Strategy ETF, of course, that tracks Bitcoin futures. It doesn't actually hold the physical Bitcoin. Can you explain that shuffle? What was the thinking there? Sure. A couple of things. First of all, Bitto the ProShares is already approved. There's no regulatory uncertainty having to do with it. So we chose to maintain our exposure through BITTO for the time being. And as I mentioned before, there are some tax and regulatory uncertainties still as part of this process. We don't know exactly who's going to be approved and and whether they've met all the criteria that the SEC has put before us. We know we have, but we don't know if others, including Gbtc, have. We just we just don't know. So so again, out of an abundance of caution and Djibouti's discount again, it was as much as 50% relative to NAV. So not only have we enjoyed this year the run in bitcoin itself, but we've had the nice closing of that discount. So it's been, you know, double good news for us. Well, you've talked about January ten, Cathie. I think in another report. Is that possible, whether it's you or somebody else in terms of the first spot, Bitcoin ETF actually getting approval? Well, we think the probabilities have gone up because the SEC has been highly engaged compared to what was happening before. Before it was just denying approval, denying approval. And we just kept putting our filing in again, you know, try, try, try, you know, how good and determined. And so here we are. We think we're we're first in line. And that's why there is this January 10th deadline. But we like the idea that the SEC has been so engaged. And it's not just with us, it's others as well. We think a number of a number of funds could be approved at the same time. And they've been asking not only one set of questions, but follow up questions. And again, that's a very good sign. Well, speaking of engaged. Oh, go ahead, please. No, no, no. The last few questions have been very technical and and so more de rigueur. And, you know, you'd expect them to be asking these questions as we head toward an approval. No, it's not 100% certain. And so we want to make that clear as well. This is the SEC, and we never know, you know, what might happen along the way. Regulators can be tricky, that's for sure. Hey, listen, you mentioned engagement. Let's talk about engagement with your funds overall, and especially the Ark Innovation Fund, up 72% year to date, easily outperforming some of the major market benchmarks, still down 65% from the high back in February of 2021. For you, though, a lot of critics, we bring up your name, we bring up Ark, and you have a lot of fans and you have a lot of critics. Is a lot of discussion. Does it feel, though, a little bit like a victory lap this year? Well, you know, we are very happy that a couple of things have happened, that this idea that interest rates, we're going to continue moving higher has been proven incorrect. And I think even the Fed, while there is that small possibility, even the Fed is now starting to talk about the other side of the interest rate move. And so I do believe all we've seen so far is a reaction to that macro phenomenon or judgment call. We went through our flagship strategy and all of our strategies. Went through a very difficult time from February 21 through December of 22, as interest rates, first of all, were presumed to move up or forecasted to move up. And then when they did move up, so it was almost like a double discounting. And so we've seen the first installment of the the the correction there to the upside for our funds with this notion. And it's again, the forecast that interest rates will come down. And we would presume that if they do come down for the reasons we think they're going to come down, the most important one being deflation, then our funds will be in good shape because we are very our companies thrive on deflation. Technologically enabled innovation is deflationary. So, Cathie, a very good morning to you. It's madness. First time we've met on. So we're going to move to a deflationary environment. We'll come back to the big macro call in a moment. Just let let's squared away before I talk to you about the flows in the funds, which is how much interest rate cuts do you presume are you forecasting leave the forecast of everybody else aside? What what do you what do you presume will happen next year? Well, we put up a chart in one of our in the in the nose, which is a YouTube video that I do every every month. Employment Friday. And in that chart you will find a ratio it's the metals to gold ratio. So metals price to gold price. And there has been an extremely tight correlation between that ratio and long term interest rates. In October we we published it or early November. And what you will see is that there was a very wide gap that had developed the metals to gold ratio was near its low for the past 1215 years and interest rates were at their highs 5%. The correlation, if you just eyeballed that chart, the correlations suggested that rate should go to 2%. Now maybe they will go all the way to 2%. But we think that long term interest rates are way above where they're going to and because of deflation. Okay. Well, let's we'll come back to that and see whether we get to the 2% level. I've got to ask you about the flows into the funds, which is obviously, you know, is kind of just edgy. You've got a bit of a victory lap going on at the moment, but this is the first year of outflows. Have those outflows stopped? You've had a great performance in the back part of this year. Have the outflows stopped and has that bleed stopped? Yes. Well, we were very gratified at our asset retention in 21 and 22. In fact, we had net inflows. If you combine both years of more than 8 billion and this year one might expect that those who average down into the very steep declines that we were seeing in 22 especially might take some profit. So we have had I know for our flagship strategy, it's roughly $500 million in outflows, maybe for all of our strategies, 1.8 million. So maybe 10% of the inflows that we enjoyed during 21 and 22. So again, we're very gratified and grateful to our our clients for the support that we continue to receive. So has has the outflows stopped? We have had days of on balance very recently. Yes. And I think part of this is many people do tax management towards the end of the year. And so some of the outflows might have been associated with with clients who got in at a high cost base and we're just harvesting some tax losses, but I think we're through that. Do you find it a little surprising, though, Cathie, considering the run up or do you I'm curious about the conversations you do have with investors considering the year that you're having and then to see those flows, It's got to be a little disheartening. Yeah. Oh, no, no, no, no, not at all. Actually, we put out a piece for Resolute, our distributor, who and we basically showed them if you rebalance our strategy when there have been big moves one way or the other, if you rebalance regularly or based on a rule like when when the fund's up 15% relative to everything else, take some profits. And what it showed that studies showed that if you are disciplined that way, that over any rolling five year period, it is highly. Likely almost 100%. I'm not quite sure if it's quite that high, but that that it will beat the market. Meaning, as measured by the Nasdaq or the S & P over a rolling five year period. And so a lot of our funds are with advisors who are very sophisticated and responded somewhat, perhaps in this tech tax management part of the year to that message. I feel like we can't talk. We have to talk about Tesla and Elon Musk. I know you just had a conversation on Twitter X. This has been, I think from day one, right. In terms of you starting out that you've had this investment in Tesla. And I remember when we first talked and you were getting started, you talked about him being the next Thomas Edison and how his vehicles would turn the US economy upside down. Having said that, there's an evolution and the world has changed. How are you thinking? It's still a top holding? How are you thinking about the Tesla story right now? Well, first of all, Carol, thank you very much for letting me interview that time. That was nearly ten years ago. And Target is about to celebrate its 10th year anniversary. And you gave us that opportunity. So thank you. The world is evolving, actually, I think, even more closely to what we expected because we expected a lot of traditional auto manufacturers to see the writing on the wall and rush as quickly as they could into scaling big time into electric vehicles. And what has happened recently, both GM and Ford have said we're stepping back. We're not going to do this until it's profitable. The problem with that is in order to be profitable, they need to scale. That's how this works. These are learning curves that they are writing down and those are expressed in cost declines. So the fact that they're pulling back means they're more there's more share for Tesla and others who choose to go for it. And Kathy, I want to keep the conversation going on, Elon Musk, but I want to bring it to the Ark Venture Fund. Of course, it's not an ETF. You invest in private companies, etc., in there. And you take a look at the portfolio, you have Space X in there and you also have X formerly known as Twitter. And in July you had told the Wall Street Journal that you had written down your Twitter stake by 47%. Fill us in on the past couple of months. Have you written it down further or how is that changed? No, I think it's still there. You know, we have to be very careful. This is an interim fund. It is a 40 act fund, and we have to mark to market every day. The good news is our clients can get in and have access to these amazing companies for just $500 and they get quarterly liquidity. So so that's the good news. The markdowns are simply, you know, if we see in the secondary market employee stock trading at a steep discount, we have to take that into account. If we see others in the more traditional asset management world like Fidelity and others marking their holdings down, we need to take that into consideration during our daily mark to market. So it's an abundance of caution. We have a five year investment time horizon. Do we think that's where X belongs in terms of valuations? Absolutely not. Absolutely not. A roughly $20 billion valuation for what we believe truly will become the everything app. Think WeChat pay. Elon started his entrepreneurial career in the payments industry and he's been thinking about this for a long time. He now has money transmitter licenses in more than half of all of the states, which we learned on Twitter spaces or on X spaces, I should say the other day when we had our interview with him. So that's exciting. He's going for it. He's going for it. We'll see if that one lands. But let's talk a little bit more about the private markets, because obviously the private credit market has gotten a lot of attention right now. You're looking at the private markets through this interval fund that you have. When you think about the opportunities there on that five year horizon that you have, do you see more so in the public markets or in the private markets right now? Well, now that we've had this very nice run this year, we think the answer to that question is in the private markets, they're close. They're close. What's fascinating to us is that the public markets have been leading the private markets for the past three years as our funds were were falling in 21. Private evaluations were going through all time highs, along with the Nasdaq. They were taking their cues, I suppose, from the Nasdaq, but. Real innovation, if you looked at our portfolios, was starting to revalued to the downside and even more so in 2022. We are still seeing major down rounds taking place in the private markets. And I'm always surprised at this sort of thing because you would think that the private markets lead the public markets. That has not been the case in the last few years. Hey, Cathie, I got to be honest with you. I think whenever we think about Elon Musk, brilliant but also erratic, and I'm curious how you think about Elon, the individuals versus Elon, the companies he's creating, the things he's doing, because I think that there is time. Any other CEO of a major publicly held company would, I think it's safe to say, not be able to get away with a lot of what he has done. So help us educate us how you make sense of it if someone you have followed talked with for many years. Well, first of all, very often we just look at what he does, not exactly what he's saying, which can often be a distraction or it can be an advertisement for his cars or for X or or for space X and so forth. So. But we have a scoring system as we are evaluating companies and their founders and their management teams and their six metrics. And one of them is moat and barriers to entry. And I think Elon is a maestro of raising barriers to entry with innovation, which that is so much faster than anyone else. Why? Because he's so first principles physics driven in his analysis of how to approach a new idea, a big idea. So tell me this then, Cathie. I mean, if you look at the cohort of years of CEOs that you backed, Brian Armstrong, does he hit that bar? Does he is he above Elon or is he at the money? You've got Elon, you've got Brian, you've got Tony Wood at Rocco. Does anybody come close to Elon or is Brian Armstrong maybe even at the money with Elan or above? Well, we don't actually look at the world that way, one relative to the other. In terms of management teams, we do look from our scoring system at the scores, which include most management people and culture execution, a valuation that might surprise people and product and service leadership and thesis risk closer to six scores and both but but well, all three of them score very highly which one scores the highest? They are actually very close to one another, to be honest. They're very close to one another. So I mean, obviously Coinbase is one of your key holdings. We've talked a little bit about that. The other the other feature that we want to talk about is a I, I'm curious to know an open air, the valuations have ranged between 80 billion to 100 billion. Will you take a position in open air? Is that going to be part of your holdings as you explore the next development of AI in your holdings? Well, in our private portfolios, we are already exposed to anthrax traffic, which has been a major beneficiary of the drama around open air that we all witnessed a few months ago. But if you look at GPT four, which is the latest large language model that that open air has published, it is way above others in terms of performance. So there you have it, the pros and the cons. So we can't tell you what we're going to do in that portfolio. But we are so impressed at how open air has led the industry. We're also impressed, however, at the open source models and and we'd like to encourage more of that movement. We know that Metal platforms has helped with Lomita and it's working on others. It is moving very quickly and making great strides. So for much lower cost, open source is free. Companies can get close not not, not at GP 84, but close. So we want to see the open source movement in in the venture fund. We also own Cathie. We've got to it. Oh, sorry. No, no, no. We never have enough time with you. Can I ask you a really quick question? 5 seconds. Any new ETFs coming our way from you guys next year? Well, real quickly, as you may know, we bought a company in London. Yeah, they have some very interesting funds."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjkvYml0Y29pbi13b3J0aC0xYi1sZWF2ZXMtZXhjaGFuZ2VzLWluLWxhcmdlc3Qtc2luZ2xlLWRheS1vdXRmbG93LWluLTEyLW1vbnRocy_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzI5L2JpdGNvaW4td29ydGgtMWItbGVhdmVzLWV4Y2hhbmdlcy1pbi1sYXJnZXN0LXNpbmdsZS1kYXktb3V0Zmxvdy1pbi0xMi1tb250aHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Worth $1B Leaves Exchanges in Largest Single-Day Outflow in 12 Months - CoinDesk",
        "content": "The Nasdaq-listed Coinbase, which is the custodian for nine of the 12 proposed spot BTC exchange-traded funds (ETFs) in the U.S., alone saw an outflow of over 18,000 BTC on Wednesday, per analytics firm CryptoQuant. (Almost a day after this story was initially published, Coinbase CEO Brian Armstrong posted on X regarding this statistic: \"This is false. Way off from our internal data.\") That has the crypto community on social media platform X speculating about institutional activity ahead of an expected ETF launch in early January."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjkvY3J5cHRvLXN0b2Nrcy1iaXRjb2luLW1pbmVycy1zZWxsLW9mZi1hcy1wcm9maXQtdGFraW5nLWNhcHMtZXhwbG9zaXZlLXllYXItZW5kL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjkvY3J5cHRvLXN0b2Nrcy1iaXRjb2luLW1pbmVycy1zZWxsLW9mZi1hcy1wcm9maXQtdGFraW5nLWNhcHMtZXhwbG9zaXZlLXllYXItZW5kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Crypto Stocks, Bitcoin Miners Sell-Off as Profit-Taking Caps Explosive Year-End - CoinDesk",
        "content": "The sell-off was perhaps buoyed by investors locking in profits for 2023, capping an explosive year for the beaten-down asset class as bitcoin's price rally stuck below its yearly highs ahead of an expected spot-based ETF approval in the U.S."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzI5L2JsYWNrcm9jay1uYW1lcy1qcC1tb3JnYW4tamFuZS1zdHJlZXQtYXMtYXV0aG9yaXplZC1wYXJ0aWNpcGFudHMtZm9yLWJpdGNvaW4tZXRmL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMi8yOS9ibGFja3JvY2stbmFtZXMtanAtbW9yZ2FuLWphbmUtc3RyZWV0LWFzLWF1dGhvcml6ZWQtcGFydGljaXBhbnRzLWZvci1iaXRjb2luLWV0Zi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "BlackRock, Valkyrie Name Authorized Participants Including JPMorgan for Bitcoin ETF - CoinDesk",
        "content": "Both applicants filed an updated S-1 form with the Securities and Exchange Commission (SEC) on Friday – the last day that applicants can do so – being the only ones so far to do so. However, applicants aren’t required to name their authorized participants in their S-1 filing."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjgvYS1yZWNvcmQtMTFiLWNyeXB0by1vcHRpb25zLWV4cGlyeS1sb29tcy1hcy1idGMtc2hvd3MtbGl0dGxlLXZvbGF0aWxpdHkv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8yOC9hLXJlY29yZC0xMWItY3J5cHRvLW9wdGlvbnMtZXhwaXJ5LWxvb21zLWFzLWJ0Yy1zaG93cy1saXR0bGUtdm9sYXRpbGl0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "A Record $11B Crypto Options Expiry Looms as BTC Shows Little Volatility - CoinDesk",
        "content": "It also shows bitcoin's max pain point (MPP), or the level at which options buyers stand to lose the most on expiry. The theory is that options sellers, typically institutions with ample capital supply, look to push the underlying asset's spot price toward that level to make their counterparties, the buyers, suffer the most. In late 2020 and most of 2021, bitcoin saw volatility in the direction of the max pain point in the lead-up to the expiry, only to resuming the uptrend following the settlement."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1taW5lcnMtZXhwYW5kLW9wZXJhdGlvbnMtcGVuZGluZy0xNDU2NTA2NzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin miners expand operations on pending spot bitcoin ETF - Yahoo Finance",
        "content": "Shares of crypto mining operators Riot Blockchain (RIOT) and Marathon Digital Holdings (MARA) are popping off on the prospects of Securities and Exchange Commission (SEC) regulators approving a spot bitcoin ETF (BTC-USD).\n\nYahoo Finance Reporter Madison Mills joins the Live show to discuss bitcoin miners' plans to expand operations on this pending news and how their stocks have exponentially outperformed bitcoin and other digital asset companies in 2023.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\n[VIDEO LOGO]\n\nBRAD SMITH: Investors are trying to cash in to the crypto rush ahead of a possible Spot Bitcoin ETF approval next month by buying into Bitcoin mining stocks. So much so that miners are outperforming crypto exchanges and Bitcoin this year. For more on this, we've got Yahoo Finance's Madison Mills here. Maddie, what do we know about this and why this move is taking place right now?\n\nMADISON MILLS: Yeah, guys. I remember a few years ago, Dan Ives explaining to me that during a gold rush, you don't want to buy the gold. You want to buy the picks and shovels. And that's exactly what we're seeing in this Bitcoin miner stock outperformance. These gains are just remarkable here. You've got Marathon Digital Holdings up 800%, Riot Platforms up 400% year-to-date. Both of those obviously outperforming those digital currencies themselves given some of the gains there. Bitcoin itself having 160% increase in 2023.\n\nNow, what's interesting is this is an energy intensive process. It involves a lot of specialized computers. So miners are expanding their operations to boost Bitcoin production. That's of course, in anticipation of that regulatory approval of the Spot Bitcoin ETF, which could lead to a lot more demand for that Bitcoin itself.\n\nAnd as you can see here, a lot of firms on the street awaiting that approval. So these firms are anticipating that, and especially Marathon Digital and Riot anticipating that. And they're investing in the technology that would be needed to support that increase in demand so that they're ready when the time comes.\n\nStory continues\n\nBRIAN SOZZI: And this may not be an end of January thing or end of February in terms of the Spot Bitcoin ETF approval. I mean, we're getting ready to head out to the World Economic Forum in Davos. And a lot of folks that we're talking to in the lead up think this could happen within two weeks, Brad.\n\nBRAD SMITH: And I think the other thing is what could take place in April of 2024, which is the halving. And one of the huge things that I've been tracking is for all of these miners right now, the halving is going to create even more costs for them because you essentially look at the computing power. If you're looking at a reward that gets cut in half for the operation of mining, then you're essentially doubling the costs for mining.\n\nAnd so for a lot of these operators out there, there could be another inkling of a thought out there within the markets of which one of these miners looks most apt to be acquired by a larger player out there, perhaps a major bank, perhaps one of the firms that's applied for, a Spot ETF, Bitcoin ETF as well because then that would increase the number that they actually have in their own holdings as well here.\n\nSo I think that's one other thought that might be permeating out there or at least rumbling out there in the market as of right now, especially going into that halving that set to take place or expected in April of 2024 marathon, as you were mentioning then, as we were talking about them. They just made an acquisition about $179 million worth of Bitcoin mining operations. So that is one particular thought that struck me this morning that could come forward as well here that's perhaps pushing this play.\n\nBRIAN SOZZI: And if there's any positive here besides the obvious, at least this is being driven by a potential catalyst. This is not the broader stock market taking off trading at record highs on hopes for rate cuts, and that's dragging in like the likes of cryptocurrencies. There's some real potential here to unlock a lot of value with these names if that ETF is approved.\n\nMADISON MILLS: That's a great point. It's one of the only names that we've talked about this morning that's not going to be driven by what Jay Powell does, which can be an important thing for investors to think about in their portfolio mix."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy80LXN0b2Nrcy13YXRjaC1iaXRjb2luLWxvb2tzLTEzMTIwMDkwNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "4 Stocks to Watch as Bitcoin Looks Poised for a 2024 Rally - Yahoo Finance",
        "content": "The cryptocurrency market has been on a rally this year, further accelerating over the past two months. Investors' sentiments are high on hopes that the Federal Reserve will soon end its monetary tightening campaign, which is expected to boost the cryptocurrency market further.\n\nOn Dec 26, Bitcoin (BTC), the world’s most prominent and popular cryptocurrency, rallied above $43,000 after hitting $44,000 earlier this month. Other major cryptocurrencies like Ethereum (ETH), Cardano (ADA) and Dogecoin (DOGE) have also been on a rally.\n\nYear to date, Bitcoin, Ethereum, Cardano and Dogecoin have returned 157.2%, 86.5%, 146.7% and 31%, respectively.\n\nThis year has been full of positive news for the crypto market, although prices were rangebound for a couple of months as investors failed to gauge the Fed’s next move with its interest rates.\n\nHowever, the Federal Reserve hasn’t hiked interest rates in its past three policy meetings after raising rates by 525 basis points as inflation has shown signs of steep decline over the past year.\n\nThis has raised hopes that the Federal Reserve will soon end its interest rate hiking policy. The central bank has also hinted at multiple rate cuts in 2024, which could be as many as three.\n\nHigher interest rates negatively impact growth-oriented sectors, which include technology, consumer discretionary industries and cryptocurrencies.\n\nBesides, investors are confident about an imminent approval from the Securities and Exchange Commission (SEC) for a Bitcoin exchange-traded fund (ETF). The approval is expected to wield a substantial impact, bolstering the cryptocurrency market.\n\nStocks to Watch\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nStory continues\n\nCoinbase Global’s expected earnings growth rate for next year is 30.5%. The Zacks Consensus Estimate for current-year earnings has improved 45.7% over the last 60 days. Coinbase currently carries a Zacks Rank #2 (Buy).\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 53.7% for next year. The Zacks Consensus Estimate for current-year earnings has improved 16.6% over the last 60 days. SQ currently carries a Zacks Rank #2.\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence, and the mining or production of cryptocurrencies.\n\nNVIDIA’s expected earnings growth rate for next year is 61.5%. The Zacks Consensus Estimate for current-year earnings has improved 14.4% over the last 60 days. Currently, NVIDIA has a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here\n\nInteractive Brokers Group, Inc. IBKR is a global automated electronic broker. IBKR executes, processes and trades in cryptocurrencies. IBKR’s commodities futures trading desk also offers customers a chance to trade cryptocurrency futures.\n\nInteractive Brokers Group has an expected earnings growth rate of 5.1% for next year. The Zacks Consensus Estimate for current-year earnings has improved 0.5% over the last 60 days. IBKR currently has a Zacks Rank #3 (Hold).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nInteractive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMi8yOC9jYXRoaWUtd29vZHMtYXJrLWludmVzdHMtaW4tcHJvc2hhcmVzLWJpdGNvaW4tZXRmLWFmdGVyLWR1bXBpbmctZ3JheXNjYWxlLWhvbGRpbmdzL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMi8yOC9jYXRoaWUtd29vZHMtYXJrLWludmVzdHMtaW4tcHJvc2hhcmVzLWJpdGNvaW4tZXRmLWFmdGVyLWR1bXBpbmctZ3JheXNjYWxlLWhvbGRpbmdzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood's ARK Invests in ProShares Bitcoin ETF After Dumping Grayscale Holdings - CoinDesk",
        "content": "The ProShares exchange-traded fund, which started trading in October 2021 as the first U.S. bitcoin-linked ETF, now accounts for 5.03% of the ARK Next Generation Internet ETF (ARKW), its sixth-largest holding. The fund no longer holds any GBTC shares, with the last reported sale on Dec. 20. At just under 12%, Coinbase remains the fund's largest holding even after Wednesday's sale of 148,885 shares."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtY2VvLWZvcmVzZWVzLWJpdGNvaW4tcHJpY2UtMTUwMDAwNjQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Grayscale CEO Foresees Bitcoin Price Surging to $55k, Ethereum and Everlodge Poised for Substantial Growth - Yahoo Finance",
        "content": "News Direct NYC --News Direct-- Everlodge\n\nThe future for crypto still looks bright. Allied Market Research released a report that the cryptocurrency market value is about to triple by 2030, hitting a whopping $4.94 billion. What's fueling this crypto rocket? According to Allied, it's the focus of cryptocurrency on remittances and global payments taking the lead – put in one word, utility.\n\nFrom all indications, cryptocurrency is gearing up to be a big player in the future of global finance; but that's 7 years away from now according to the AMR. However, in the near term, investors are eager to know what lies ahead in 2024.\n\nNotably, Bitcoin (BTC), Ethereum (ETH), and the recently emerged presale utility-focused gem, Everlodge, have all demonstrated the potential for substantial returns. While the reasons behind their promising prospects are quite evident, let’s take a quick dive to see why these projects rank among the best crypto investments to consider ahead of 2024.\n\nGrayscale CEO Optimistic on Bitcoin While Crypto Wizard Target Remains $55,000 for Bitcoin in Q1 2024\n\nGrayscale CEO Michael Sonnenshein is seeing big potential for Bitcoin (BTC) once the U.S. Securities and Exchange Commission (SEC) gives the thumbs up to a spot market BTC exchange-traded fund (ETF).\n\nIn a recent CNBC interview, Sonnenshein, though not one to throw around price predictions, emphasizes the prevailing optimism in the market. According to him, a substantial number of investors are jumping on the Bitcoin bandwagon and integrating it into their portfolios. As we anticipate the potential approval of the ETF, he believes it will be a game-changer, unlocking opportunities for a significant portion of the investment community.\n\nAs per price predictions, analyst Crypto Wizard posted on X, talking about a potential dip in Bitcoin price below the $40k threshold in the weeks ahead. They note that in the event of any deviation from this prediction, a decisive break above $46k for Bitcoin would be the game-changer. Despite these short-term fluctuations, their overall target stands firm at $55k for Bitcoin price by the first quarter of 2024.\n\nStory continues\n\nEthereum Looks Bullish for 2024\n\nThe immense popularity of the Ethereum (ETH) network has positioned it among the leading altcoins in today's market. Its widespread appeal is not the only factor contributing to its positive sentiment; Ethereum also benefits from a history of resilience and market dominance.\n\nWith a current price of $2,230, Ethereum has experienced significant growth in the past month, reaching a peak of around $2,367 to mark the highest point of the year. While the overall bullish momentum in the cryptocurrency market may be waning, Ethereum price has managed to remain relatively stable, with a nearly 2% increase over the past week.\n\nHowever, considering the recent drop of over $100 from its peak, investors should be prepared for a potential further correction. Yet, given Ethereum's historical price resilience and strong market presence, it is reasonable to expect a more stable price trajectory leading up to the new year.\n\nEverlodge Has Lofty Plans To Take Charge in Q1 2024\n\nEverlodge (ELDG) emerged as a revolutionary force in the real estate realm, positioned to revolutionize the $280 trillion industry by tackling long-standing challenges. Traditionally, the prohibitively high entry costs, often reaching millions of dollars, combined with a lack of transparency and liquidity, have created barriers for numerous potential investors.\n\nEverlodge's DeFi property marketplace directly confronts these challenges within the travel property sector. Through the innovative approach of listing properties as NFTs on its platform, Everlodge introduces fractionalized ownership, allowing investors to purchase NFT fractions representing a percentage of a property. Imagine owning 25% of a property generating $6,000 monthly, resulting in a $1,500 passive income.\n\nIn essence, Everlodge not only breaks down barriers but also provides investors with the opportunity to access equity in some of the world's most luxurious travel properties and you can join in for only $0.027.\n\nFurthermore, industry experts predict a potential 10X surge in Everlodge's project valuation if the company successfully achieves crucial milestones. This projection highlights the anticipation surrounding Everlodge's transformative initiatives and underscores the potential for significant growth, positioning it as one of the best crypto investments leading up to 2024.\n\nLooking ahead, the probability of a positive upturn in cryptocurrency in 2024 is very much palpable and projects like Bitcoin, Ethereum, and Everlodge have everything to fight for to become the best coins to invest in 2024.\n\nFor more information about the ongoing Everlodge (ELDG) Presale, please visit their website.\n\nEverlodge provides you with a seamless approach to fractional investing in vacation rentals, eliminating the complexities associated with traditional real estate investment. Our innovative platform revolutionizes the way people invest in second homes.\n\nDigital currencies may be unregulated in your jurisdiction. The value of digital currencies may go down as well as up. Profits may be subject to capital gains or other taxes applicable in your jurisdiction.\n\nContact Details\n\nEverlodge group\n\nBrett Brown\n\nadmin@everlodge.io\n\nCompany Website\n\nhttps://everlodge.io/\n\nView source version on newsdirect.com: https://newsdirect.com/news/grayscale-ceo-foresees-bitcoin-price-surging-to-55k-ethereum-and-everlodge-poised-for-substantial-growth-871929946"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYnJjMjAuY29tLXJhaXNlcy0lMjQxLjUtbWlsbGlvbi10by1wcm92aWRlLWluZnJhc3RydWN0dXJlLWZvci1iaXRjb2luLXRva2Vuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "BRC20.com Raises $1.5 Million to Provide Infrastructure for Bitcoin Tokens - Nasdaq",
        "content": "Newly launched Bitcoin tokens platform BRC20.com has raised $1.5 million in funding led by UTXO Management, the asset management arm of Bitcoin Magazine’s parent company BTC Inc.\n\nThe round included support from Zanshin Capital Management, Unbroken Chain, One Block Capital, Sora Ventures, OWL Ventures, Bitcoin Frontier Fund, Hamble and New Tribe Capital.\n\nThe investment comes at a time of increased interest in the BRC-20 token standard, created in March 2023 to facilitate the creation and transfer of fungible tokens on Bitcoin through the Ordinals protocol.\n\n\"Today's news is an important milestone in the journey of BRC20.com as we announce some of the most active and strategic investors across the Bitcoin and Web3 ecosystems joining our mission of building the most user-friendly and comprehensive platform for discovering and interacting with BRC-20 tokens and other Bitcoin-based assets,\" the company said in a statement to Bitcoin Magazine.\n\nThe protocol has been criticized by some in the Bitcoin development community for its inefficient use of the Bitcoin protocol, as well as how the protocol has contributed to increasing the size of Bitcoin’s UTXO set, a crucial metric for Bitcoin’s scalability and decentralization.\n\nHowever, the investment is notable given the recent increase in market capitalization for Bitcoin tokens including SATS and ORDI, which have risen to be worth more than $1 billion each and have been listed on exchanges such as Binance and OKX.\n\nBRC20.com is best known for providing a CoinMarketCap style dashboard for Bitcoin tokens but plans to launch a mobile app that would allow users to bridge, trade and stake BRC-20 tokens with their phones. The company also plans to release a decentralized relayer network for new DeFi protocols powered by the .COM token.\n\nBitcoin Magazine is wholly owned by BTC Inc., which operates UTXO Management, a regulated capital allocator focused on the digital assets industry. UTXO invests in a variety of Bitcoin businesses, and maintains significant holdings in digital assets. Bitcoin Magazine does not endorse any tokens on bitcoin, including but not limited to BRC-20 tokens.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzI4L2NyeXB0by1mb3ItYWR2aXNvcnMtYml0Y29pbi1teXRoLWJ1c3Rpbmcv0gFaaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTIvMjgvY3J5cHRvLWZvci1hZHZpc29ycy1iaXRjb2luLW15dGgtYnVzdGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Crypto for Advisors: Bitcoin Myth Busting - CoinDesk",
        "content": "Unrealized losses - Unrealized losses are currently a unique benefit to crypto investors. For stocks, bonds, ETFs, and mutual funds investors are bound to what is known as the wash-sale rule. This means that if you sell one of these securities at a loss you must wait 30 days before you can repurchase it. This rule does not apply to cryptocurrencies yet. If you have a digital asset with an unrealized loss, it is an option to sell and rebuy immediately. Having that capital loss to carry forward (called tax loss harvesting) can be extremely beneficial even if you can’t offset it against a gain this year. Note that with exchange fees, slippage, and general market volatility you won’t guarantee you’ll have the same number of units when you re-buy. Until this rule is applied to cryptocurrency it is a benefit that only direct holders will have. Spot bitcoin ETF holders will be bound to wash-sale rules as they will hold a security, not a digital asset."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mdHgtZGVidG9ycy1iaXRjb2luLWNsYWltcy1iYW5rcnVwdGN50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "FTX debtors propose $16,871 Bitcoin price for creditor claims - Cointelegraph",
        "content": "The debtors for FTX have released estimates of the U.S. dollar value of cryptocurrency prices and foreign currency for customers holding claims with the defunct exchange.\n\nIn a Dec. 27 filing in United States Bankruptcy Court for the District of Delaware, the FTX debtors said they sought a “fair and reasonable value” for user claims based on digital assets when the exchange collapsed in November 2022. The proposal listed prices for roughly 500 assets in fiat and cryptocurrency, based on those at the time of FTX’s bankruptcy filing.\n\nAccording to the proposed prices, Bitcoin (BTC) claimants could receive $16,871 per coin, Ether (ETH) was priced at $1,258, and Binance Coin (BNB) at $286. The table excluded an estimated FTX Token (FTT) price but included prices for leveraged tokens, tokenized stocks, spot derivatives, and crypto futures.\n\n“[T]his Court has broad discretion to choose whatever method it deems best-suited to the particular circumstances to estimate the valuation of Claims based on Digital Assets,” said the filing. “[C]ourts consider all factors and circumstances surrounding the claims, but do not seek to estimate claims with mathematical precision.”\n\nThe debtors added:\n\n“[T]he Plan provides for Claims in respect of Digital Assets to be calculated by converting the value of the Digital Asset into Cash as of the Petition Date using the rates set forth in the Digital Assets Conversion Table, and making Distributions in Cash.”\n\nAccording to the filing, the debtors used data from Coin Metrics to estimate the digital asset prices. Parties with the bankruptcy case have until Jan. 11 to file objections, with a hearing on the matter scheduled for Jan. 25. The motion granting an order to estimate creditor claims based on the proposed pricing is pending approval by the court.\n\nRelated: FTX debtors propose separate deal with Sam Bankman-Fried over Embed acquisition\n\nMany X — formerly Twitter — users who claimed to be FTX users objected to the proposed plan. Customers of the defunct crypto exchange have not had access to their funds since November 2022, but some have been able to sell their claims to third parties for less than their total value.\n\n“What a scam, honestly,” said X user TrueDoodles in response to the motion. “But instead that the whole thing goes for another 10 years with unknown outcome and more billions in lawyer costs. I would rather take what they offer and multiple [sic] it in the market.”\n\nShould the court approve the plan, many crypto holders would miss out on the gains from certain tokens. The price of Bitcoin has risen more than 150% since FTX’s collapse to reach $42,452 at the time of publication. The price of Ether has surged more than 87%, from $1,258 to $2,354.\n\nMagazine: Can you trust crypto exchanges after the collapse of FTX?"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29pbmRlc2stbmV3cy8yMDIzLzEyLzI5L2ludmVzY28tZmlkZWxpdHktYmxhY2tyb2NrLW90aGVycy1kb3QtdGhlaXItYnVyZWF1Y3JhdGljLWlzLWFzLWxpa2VseS1zZWMtYWN0aW9uLW9uLXNwb3QtYml0Y29pbi1ldGYtbG9vbXMv0gGhAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb2luZGVzay1uZXdzLzIwMjMvMTIvMjkvaW52ZXNjby1maWRlbGl0eS1ibGFja3JvY2stb3RoZXJzLWRvdC10aGVpci1idXJlYXVjcmF0aWMtaXMtYXMtbGlrZWx5LXNlYy1hY3Rpb24tb24tc3BvdC1iaXRjb2luLWV0Zi1sb29tcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Amid Bitcoin ETF Race, Wall Street Giants Dot Their Bureaucratic I's as Likely SEC Action Looms - CoinDesk",
        "content": "Friday's filing rush suggests the firms aren't willing to take any chances on timing. Bloomberg analysts have said the SEC is likely to approve multiple issuers at once to avoid picking favorites. Thus, the eager issuers are getting all the ducks in a row so that they can be in the first group."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi4wFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTIyODM4OTExNi9lbi9WYW5FY2stQml0Y29pbi1pcy1hLSVFMiU4MCU5Q1NjcmVhbWluZy1CdXklRTIlODAlOUQtZm9yLTIwMjQtRmlybSVFMiU4MCU5OXMtREFQUC1FVEYtUGFzc2VzLTEwMG1tLWluLUFVTS1hcy1HbG9iYWwtQXNzZXRzLWluLVZhbkVjay1DcnlwdG8tTGlua2VkLUZ1bmRzLUFwcHJvYWNoLTEtQmlsbGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "VanEck: Bitcoin is a “Screaming Buy” for 2024; Firm's DAPP ETF Passes $100mm in AUM as Global Assets in VanEck ... - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--Having already named Bitcoin one of the firm’s “screaming buys” for 2024, VanEck is today sharing a number of other key updates around its views on digital assets and the growth in its global lineup of digital asset-linked funds.\n\nAs the first ETF provider to file for a Bitcoin-related ETF back in 2017, VanEck has played a leading role in bringing relevant related exposures to the marketplace for the past several years. Globally, assets in VanEck’s crypto-linked funds are fast approaching $1 billion and just yesterday (December 27) the firm’s VanEck Digital Transformation ETF (DAPP) surpassed $100 million in AUM.\n\n“Crypto is the hottest part of the investment market today, and a range of factors, not the least of which being potential movement on the introduction of a spot Bitcoin ETF in the U.S., has Bitcoin and the broader crypto space poised to break out in 2024,” said Jan van Eck, CEO of VanEck.\n\nAdded Matthew Sigel, Head of Digital Assets Research for VanEck: “DAPP provides an excellent window into the year that was in 2023 and an important lens through which to view the year to come. DAPP’s 2023 performance, which as of December 28 was at more than +300% year-to-date, has been driven by Coinbase and Bitcoin miners. Miners are earning solid margins as mining machine prices have lagged the price of the coin. Also, many on-chain fundamentals have improved in recent weeks as Bitcoin profits are redeployed into newer projects on the Bitcoin blockchain or on other open source chains like Solana.\n\n“Meanwhile, Coinbase, a large DAPP constituent, stands out for its market share gains, which we think are sustainable,” continued Sigel. “If we at VanEck are correct that Bitcoin will make an all-time high next year on the back of the Bitcoin halving, a more relaxed U.S. Federal Reseve, and continued crypto adoption in emerging markets, then 2024 may be another strong year for the universe of companies so well-captured by the DAPP ETF.”\n\nSigel and the VanEck team are prolific producers of digital assets-focused research, which can be accessed here.\n\nDAPP is but one of several crypto-related funds the firm has available in the U.S., beyond its offerings in Europe, including the VanEck Ethereum Strategy ETF ( EFUT), a unique actively managed ETF designed to seek capital appreciation by investing in Ether (ETH) futures contracts. EFUT is the only ETF providing focused exposure to ETH futures that is structured as a C-Corp., potentially offering a more efficient tax experience for long-term investors. EFUT does not invest in ETH or other digital assets directly. The firm’s lineup also includes the VanEck Bitcoin Strategy ETF (XBTF) which, like EFUT, is also structured as a C-Corp. XBTF does not invest in BTC or other digital assets directly.\n\nVanEck posts frequently on crypto-related news and trends on X (formerly Twitter) at @vaneck_us and will continue to share updates with investors in the weeks to come as new developments arise.\n\nAbout VanEck\n\nVanEck has a history of looking beyond the financial markets to identify trends that are likely to create impactful investment opportunities. We were one of the first U.S. asset managers to offer investors access to international markets. This set the tone for the firm’s drive to identify asset classes and trends – including gold investing in 1968, emerging markets in 1993, and exchange traded funds in 2006 – that subsequently shaped the investment management industry.\n\nToday, VanEck offers active and passive strategies with compelling exposures supported by well-designed investment processes. As of November 30, 2023, VanEck managed approximately $84.8B in assets, including mutual funds, ETFs and institutional accounts. The firm’s capabilities range from core investment opportunities to more specialized exposures to enhance portfolio diversification. Our actively managed strategies are fueled by in-depth, bottom-up research and security selection from portfolio managers with direct experience in the sectors and regions in which they invest. Investability, liquidity, diversity, and transparency are key to the experienced decision-making around market and index selection underlying VanEck’s passive strategies.\n\nSince our founding in 1955, putting our clients’ interests first, in all market environments, has been at the heart of the firm’s mission.\n\nImportant Disclosures\n\nDigital asset prices are highly volatile and the value of digital assets can rise or fall dramatically and quickly. If their value goes down, there’s no guarantee that it will rise again. As a result, there is a significant risk of loss of your entire principal investment.\n\nVanEck Digital Transformation ETF (DAPP) will not invest in digital assets (including cryptocurrencies) (i) directly or (ii) indirectly through the use of digital asset derivatives. The Fund also will not invest in initial coin offerings. Therefore the Fund is not expected to track the price movement of any digital asset.\n\nInvestors in the Fund should be willing to accept a high degree of volatility in the price of the Fund’s Shares and the possibility of significant losses. An investment in the Fund involves a substantial degree of risk. An investment in the Fund is not a deposit with a bank and is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency. Therefore, you should consider carefully various risks before investing in the Fund, each of which could significantly and adversely affect the value of an investment in the Fund.\n\nAn investment in the Fund may be subject to risks which include, among others, risks related to investing in digital transformation companies, special risk considerations of investing in European issuers, equity securities, small- and medium-capitalization companies, information technology sector, financials sector, foreign securities, emerging market issuers, market, operational, index tracking, authorized participant concentration, no guarantee of active trading market, trading issues, passive management, fund shares trading, premium/discount and liquidity of fund shares, non-diversified and industry concentration risks, all of which may adversely affect the Fund. Emerging market issuers and foreign securities may be subject to securities markets, political and economic, investment and repatriation restrictions, different rules and regulations, less publicly available financial information, foreign currency and exchange rates, operational and settlement, and corporate and securities laws risks. Small- and medium-capitalization companies may be subject to elevated risks.\n\nThe technology relating to digital assets, including blockchain, is new and developing and the risks associated with digital assets may not fully emerge until the technology is widely used. Digital asset technologies are used by companies to optimize their business practices, whether by using the technology within their business or operating business lines involved in the operation of the technology. The cryptographic keys necessary to transact a digital asset may be subject to theft, loss, or destruction, which could adversely affect a company’s business or operations if it were dependent on the digital asset. There may be risks posed by the lack of regulation for digital assets and any future regulatory developments could affect the viability and expansion of the use of digital assets.\n\nAn investment in the VanEck Ethereum Strategy ETF (EFUT) may be subject to risks which include, but are not limited to, risks related to market and volatility, investment (in ETH futures), ETH and ETH futures, futures contract, derivatives, counterparty, investment capacity, target exposure and rebalancing, borrowing and leverage, credit, interest rate, liquidity, investing in other investment companies, management, new fund, non-diversified, operational, portfolio turnover, regulatory, repurchase agreements, tax, cash transactions, authorized participant concentration, no guarantee of active trading market, trading issues, fund shares trading, premium/discount risk and liquidity of fund shares, U.S. government securities, debt securities, municipal securities, money market funds, securitized/mortgage-backed securities, sovereign bond, ETH-related company, ETH-related concentration, and equity securities risks, all of which could significantly and adversely affect the value of an investment in the Fund.\n\nThe value of Ethereum (ETH) and the Fund’s ETH Futures holdings, could decline rapidly, including to zero. You should be prepared to lose your entire investment. The Fund does not invest in ETH or other digital assets directly.\n\nThe further development and acceptance of the ETH network, which is part of a new and rapidly changing industry, is subject to a variety of factors that are difficult to evaluate, the slowing, stopping or reversing of the development or acceptance of the ETH network may adversely affect the price of ETH and therefore cause the Fund to suffer losses, regulatory changes or actions may alter the nature of an investment in ETH or restrict the use of ETH or the operations of the ETH network or venues on which ETH trades in a manner that adversely affects the price of ETH and, therefore, the Fund’s ETH Futures. ETH generally operates without central authority (such as a bank) and is not backed by any government, ETH is not legal tender and federal, state and/or foreign governments may restrict the use and exchange of ETH, and regulation in the United States is still developing.\n\nAn investment in the VanEck Bitcoin Strategy ETF (XBTF) may be subject to risks which include, among others market and volatility, investment, futures contract, derivatives, investments related to bitcoin and bitcoin futures, derivatives, counterparty, investment capacity, target exposure and rebalancing, borrowing and leverage, indirect investment, credit, interest rate, illiquidity, investing in other investment companies, management, new fund, non-diversified, operational, portfolio turnover, regulatory, repurchase agreements, tax, of cash transactions, authorized participant concentration, no guarantee of active trading market, trading issues, fund shares trading, premium/discount and liquidity of fund shares, U.S. government securities, debt securities, municipal securities, money market funds, securitized/asset-backed securities, and sovereign bond risks, all of which could significantly and adversely affect the value of an investment in the Fund.\n\nThe value of Bitcoin and the Fund’s Bitcoin Futures holdings, could decline rapidly, including to zero. You should be prepared to lose your entire investment. The Fund does not invest in bitcoin or other digital assets directly.\n\nThe further development and acceptance of the Bitcoin network, which is part of a new and rapidly changing industry, is subject to a variety of factors that are difficult to evaluate, the slowing, stopping or reversing of the development or acceptance of the Bitcoin network may adversely affect the price of bitcoin and therefore cause the Fund to suffer losses, regulatory changes or actions may alter the nature of an investment in bitcoin or restrict the use of bitcoin or the operations of the Bitcoin network or venues on which bitcoin trades in a manner that adversely affects the price of bitcoin and, therefore, the Fund’s Bitcoin Futures. Bitcoin generally operates without central authority (such as a bank) and is not backed by any government, Bitcoin is not legal tender and federal, state and/or foreign governments may restrict the use and exchange of Bitcoin, and regulation in the United States is still developing.\n\nVanEck Ethereum Strategy ETF (EFUT) and VanEck Bitcoin Strategy ETF (XBTF)\n\nFutures Contract Risk. The use of futures contracts involves risks that are in addition to, and potentially greater than, the risks of investing directly in securities and other more traditional assets. The market for Bitcoin and Ethereum Futures may be less developed, and potentially less liquid and more volatile, than more established futures markets. Bitcoin and Ethereum Futures are subject to collateral requirements and daily limits that may limit the Funds’ ability to achieve their target exposure. Margin requirements for Bitcoin and Ethereum Futures traded on the Chicago Mercantile Exchange (“CME”) may be substantially higher than margin requirements for many other types of futures contracts. Futures contracts exhibit “futures basis,” which refers to the difference between the current market value of the underlying bitcoin or ethereum (the “spot” price) and the price of the cash-settled futures contracts.\n\nThis risk may be adversely affected by “negative roll yields” in “contango” markets. The Funds will “roll” out of one futures contract as the expiration date approaches and into another futures contract on bitcoin or ethereum with a later expiration date. The “rolling” feature creates the potential for a significant negative effect on the Funds’ performance that is independent of the performance of the spot prices of bitcoin and ethereum. A market where futures prices are generally greater than spot prices is referred to as a “contango” market. Therefore, if the futures market for a given commodity is in contango, then the value of a futures contract on that commodity would tend to decline over time (assuming the spot price remains unchanged), because the higher futures price would fall as it converges to the lower spot price by expiration. Extended period of contango may cause significant and sustained losses.\n\nVanEck Absolute Return Advisers Corporation is registered with the CFTC as both commodity pool operator and commodity trading advisor, and is a member of the National Futures Association. EFUT and XBTF are speculative in nature and involves a high degree of risk. An investor may lose all or substantially all of an investment in EFUT and XBTF. Commodity futures generally are volatile and these Funds may not be suitable for all investors.\n\nInvesting involves substantial risk and high volatility, including possible loss of principal. An investor should consider the investment objective, risks, charges and expenses of a Fund carefully before investing. To obtain a prospectus and summary prospectus, which contain this and other information, call 800.826.2333 or visit vaneck.com. Please read the prospectus and summary prospectus carefully before investing.\n\n©️ Van Eck Securities Corporation, Distributor, a wholly owned subsidiary of Van Eck Associates Corporation"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLWZhY2VzLXJlamVjdGlvbi00MTU1MC_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvYml0Y29pbi1wcmljZS1mYWNlcy1yZWplY3Rpb24tNDE1NTAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Price Faces Another Rejection, Why BTC Is At Risk Before The New Year - NewsBTC",
        "content": "Bitcoin price failed again to clear the $44,000 resistance zone. BTC is declining and might be at risk of a downside break below the $41,500 level.\n\nBitcoin is slowly moving lower from the $43,800 resistance zone.\n\nThe price is trading below $43,000 and the 100 hourly Simple moving average.\n\nThere is a key bearish trend line forming with resistance near $42,550 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could continue to decline if it stays below the $43,000 level.\n\nBitcoin Price Takes Hit\n\nBitcoin price made a fresh attempt to gain pace above the $43,200 level. BTC climbed above the $43,500 level, but it struggled to reach the $44,000 resistance zone.\n\nA high was formed near $43,792 and the price started a fresh decline. There was a clear inverted V pattern formed and the price declined below the $43,200 level. The bears were able to push the price below the 50% Fib retracement level of the upward move from the $41,637 swing low to the $43,792 low.\n\nBitcoin is now trading below $43,000 and the 100 hourly Simple moving average. It is also consolidating below the 61.8% Fib retracement level of the upward move from the $41,637 swing low to the $43,792 low.\n\nOn the upside, immediate resistance is near the $42,500 level. There is also a key bearish trend line forming with resistance near $42,550 on the hourly chart of the BTC/USD pair. The first major resistance is $43,000. A close above the $43,000 level could send the price further higher.\n\nSource: BTCUSD on TradingView.com\n\nThe main hurdle sits at $43,250. A close above the $43,250 resistance could start a decent move toward the $43,800 level. The next key resistance could be near $44,000, above which BTC could rise toward the $45,000 level.\n\nMore Losses In BTC?\n\nIf Bitcoin fails to rise above the $43,000 resistance zone, it could continue to move down. Immediate support on the downside is near the $42,150 level.\n\nThe next major support is near $41,650. If there is a move below $41,650, there is a risk of more losses. In the stated case, the price could drop toward the $40,500 support in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now gaining pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level.\n\nMajor Support Levels – $42,150, followed by $41,650.\n\nMajor Resistance Levels – $42,550, $43,000, and $43,800.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTIvMjgvaW5kaWEtaXNzdWVzLWNvbXBsaWFuY2Utc2hvdy1jYXVzZS1ub3RpY2VzLXRvLTktb2Zmc2hvcmUtZXhjaGFuZ2VzLWluY2x1ZGluZy1iaW5hbmNlLWFuZC1rdWNvaW4v0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMi8yOC9pbmRpYS1pc3N1ZXMtY29tcGxpYW5jZS1zaG93LWNhdXNlLW5vdGljZXMtdG8tOS1vZmZzaG9yZS1leGNoYW5nZXMtaW5jbHVkaW5nLWJpbmFuY2UtYW5kLWt1Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "India to Block URLs of 9 Offshore Exchanges Including Binance After Issuing Compliance 'Show Cause' Notices - CoinDesk",
        "content": "\"The obligation is activity-based and is not contingent on physical presence in India,\" the FIU said. \"However, several offshore entities though catering to a substantial part of Indian users were not getting registered and coming under the Anti Money Laundering (AML) and Counter Financing of Terrorism (CFT) framework.\""
    }
]