[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjA4ODE3L2xpZ2h0bmluZy1uZXR3b3JrLXJlYWNoZXMtYWxsLXRpbWUtaGlnaC1pbi1iaXRjb2luLWNhcGFjaXR50gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjA4ODE3L2xpZ2h0bmluZy1uZXR3b3JrLXJlYWNoZXMtYWxsLXRpbWUtaGlnaC1pbi1iaXRjb2luLWNhcGFjaXR5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Lightning Network reaches all-time high in bitcoin capacity - The Block",
        "content": "Lightning Network, a Layer 2 payment network built on top of the Bitcoin blockchain, has reached an all-time high in terms of capacity, or the amount of bitcoin (BTC) locked in payment channels.\n\nThe payment channel capacity on the Lightning Network has grown 63% since the beginning of last year, according to data from The Block Research. Currently, the network has over 5,490 BTC ($128 million) in capacity, up from 3,350 BTC on Jan. 1, 2022. This is being seen as a positive sign for the adoption of Bitcoin transactions.\n\nThe Lightning Network is a second-layer payment protocol built on top of the Bitcoin blockchain, designed to enable fast and cheap micropayments by allowing participants to transact directly without the need for immediate settlement on the blockchain. It operates as a network of bi-directional payment channels between participants, allowing for off-chain transactions that are eventually settled on the Bitcoin blockchain.\n\nIt was designed to mitigate the issues seen on the Bitcoin mainnet, such as slow transaction speeds and high fees. The network achieves this by enabling users to open payment channels between themselves, which allows it to handle high amounts of low-value transfers without having to broadcast every transaction to the Bitcoin main network.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe network's ability to mitigate the issues seen on the Bitcoin mainnet has made it an attractive option for both businesses and individuals. For example, the integration of Bitcoin payments in El Salvador was made possible by Strike, a payment service based on the Lightning Network. Similarly, Twitter adopted the Lightning Network to enable Bitcoin tips on its platform in 2021.\n\nThe growth of the Lightning Network's capacity coincides with a short-term rally in Bitcoin's price. The cryptocurrency has increased by 38% since January 1, 2023, rising from $16,500 to $22,800 at the time of writing, per CoinGecko data. The price is still down 66% from an all-time high of $69,000 recorded in November 2021."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pcy1pdC1wb3NzaWJsZS10by1hY2hpZXZlLWZpbmFuY2lhbC1mcmVlZG9tLXdpdGgtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "Is it possible to achieve financial freedom with Bitcoin? - Cointelegraph",
        "content": "Over the last 14 years, investors have been attracted to Bitcoin (BTC) for many reasons — from being a potential solution to the economic woes of the existing fiat economic system to reaching the unbanked and diversifying portfolios. However, a large portion of the general public sees Bitcoin as a gateway to financial freedom amid growing fiat inflation and geopolitical uncertainties.\n\nTraditional banking systems have, time and again, served as a tool for centralized governments to dictate financial access, especially during emergencies. Most recently, the Ukraine-Russian war served as a case study for how cryptocurrencies helped the displaced and the unbanked access funds for basic necessities.\n\nAs intended by the creator Satoshi Nakamoto, Bitcoin seeks to bring power back to the people. No amount of regulations, sanctions or bans can stop people from using Bitcoin as money. Beyond that, a calculated investment in Bitcoin has the potential to bring people closer to attaining their dream of financial freedom. But how can people achieve that?\n\nHodl\n\nThe massive volatility of cryptocurrencies coupled with the restlessness of an investor is a recipe for an instant loss. Many fail to understand that Bitcoin — unlike other cryptocurrencies — is a long-term investment. Hence, Bitcoin veterans recommend holding the asset during bull markets and buying the dips during bear markets.\n\nAccording to data from UpMyInterest, setting aside a few off-years, Bitcoin holders witnessed a mean annual return of 93.8%, which in its best-performing year, spiked to 302.8%.\n\nHistorical summary of Bitcoin annual returns. Source: UpMyInterest\n\nAs simple as it sounds, hodling (crypto lingo for holding assets) has proved difficult for investors. Some factors that trigger abrupt Bitcoin selling include the spreading of FUD (fear, uncertainty and doubt) and price movements.\n\nWhile it makes sense in the short-term to earn profits off Bitcoin’s volatility, zooming out the price chart reveals a long-term greater incentive in holding. Moreover, investors owning Bitcoin will always have the option to utilize this spending across geographical boundaries without losing value.\n\nDollar-cost averaging\n\nConsidering Bitcoin as a viable long-term investment option, many investors tend to implement the dollar-cost averaging (DCA) strategy. This involves setting aside a predetermined dollar amount from a regular income to be reinvested in Bitcoin every day, week or month.\n\nWhile El Salvador was initially criticized for adopting Bitcoin as a legal tender amid crippling inflation, the country could repurpose the resultant unrealized gains to fund social projects, such as building hospitals and schools.\n\nWith the Bitcoin bull run running out by 2022, Salvadoran President Nayib Bukele followed a strategy similar to DCA, wherein the country would purchase 1 BTC every day.\n\nWe are buying one #Bitcoin every day starting tomorrow. — Nayib Bukele (@nayibbukele) November 17, 2022\n\nWhen Bukele announced his plan for buying Bitcoin, it was priced roughly at $16,600, as shown by data from Cointelegraph Markets Pro and TradingView.\n\nBitcoin price movement ever since Nayib Bukele announced plans to purchase 1 BTC every day. Source: TradingView\n\nSince then, BTC’s price has surged 40.46%, providing much-needed relief to Salvadorans. Investors looking for financial freedom must pursue a similar strategy while reacting to market changes and public sentiment.\n\nSelf-custody\n\nWhen it comes to the long-term holding of Bitcoin, the key is not to trust any other third-party entity with the assets' private keys. Investors who store Bitcoin on crypto exchanges unknowingly give away complete control of their assets.\n\nEver since the FTX fraud came to light, the case of self-custody grew stronger. Investors that suffered losses owing to the alleged misappropriation of funds realized the importance of self-custody. Maintaining ownership of the private key — via self-custodial wallets — becomes paramount for those that seek financial freedom in its truest sense.\n\nWill be sending an email every week strongly advising our people to never keep savings on any exchange, including @paxful This is the way ! Self custody your savings ALWAYS! pic.twitter.com/DI95Gaa5Y6 — Ray Youssef (@raypaxful) December 11, 2022\n\nThe FTX fallout also forced crypto exchanges to prove the existence and safety of users’ funds in order to avoid a low liquidity situation.\n\nBinance Releases Proof of Reserves System | Binance Support https://t.co/pdA2OdvAKG — CZ Binance (@cz_binance) November 25, 2022\n\nAlthough hardware alternatives for crypto self-custody require an upfront investment, it is up to the users to choose an ideal method of storing the private keys, even if it means writing the private keys on a piece of paper.\n\nThe three practices mentioned above — hodl, DCA and self-custody — form the main pillars of financial freedom. However, users are not limited from trying other strategies that suit their needs.\n\nAchieving financial freedom with Bitcoin is possible. Given the nascency of the crypto ecosystem, investors are advised to focus on the long-term benefits of Bitcoin while reaping short-term gains in the process."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vYml0Y29pbi1zY2FtLXRoYWlsYW5kLWtpdHRlbi1ob25nLWtvbmctd29tYW4tbG9zZS0yMDIzLTLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Hong Kong Executive Loses $764,000 in Bitcoin Scam for 3-Month Kitten - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nA fashion executive in Hong Kong who thought she was adopting a kitten from Thailand was tricked into giving scammers more than $764,000 in Bitcoin, local authorities said on Wednesday.\n\nThe would-be cat adopter, a 58-year-old vice-president of a fashion company, believed she had contacted someone looking to give away a three-month-old kitten, The South China Morning Post reported.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nShe got in touch online with the unnamed person in April and continued communicating with them over WhatsApp, per the outlet.\n\nThe executive was told she could receive the kitten for free, but that she would have to pay transport and insurance fees via cryptocurrency, per a case briefing the Hong Kong Police Force sent to Insider.\n\nAdvertisement\n\nShe complied, opening a cryptocurrency account and sending the funds to the accused scammer's e-wallet, the authorities said.\n\nThen, the woman was fed a tall tale that the cat had died during the shipping process. At the same time, another unnamed individual posing as a foreign bank employee contacted her, saying she would be compensated for the cat's death with an insurance payout of around $150,000, police said, per the briefing.\n\nThere was just one catch: The executive would have to make another payment, this time as a guarantee or administration fee, according to police.\n\nShe followed the instructions, and by the time she realized the entire interaction was a scam, she'd bought $764,574 worth of cryptocurrency and sent it all to the fraudster, the authorities said.\n\nAdvertisement\n\nThe total sum was transferred over 40 Bitcoin transactions between July and November. It was only in January that the executive thought something was amiss and reported her case to the police, the SCMP reported, citing an anonymous source familiar with the matter.\n\nNo one has been arrested in connection to the case yet, police said.\n\nCrypto scams have surged worldwide in the last few years, with losses in 2021 totaling almost 60 times that of losses recorded in 2018, the Federal Trade Commission reported in June. Scammers made off with around $1 billion in crypto in 2021 alone, per the FTC.\n\nBlockchain analysis firm Chainalysis reported a higher estimate for that year, saying $14 billion was taken by crypto scammers in 2021.\n\nAdvertisement\n\nPets are often in the mix, too. In April, New Zealand authorities warned of scammers selling puppies using photos they found online, asking potential buyers to transfer more than $1,200 in crypto for purchasing, transport, vaccination, or insurance fees.\n\nIn 2018, Bitcoin scammers targeted owners of lost dogs in North Carolina, demanding ransoms for the animals when they didn't have the pets in their possession."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmZvb2wuY29tL3RoZS1hc2NlbnQvY3J5cHRvY3VycmVuY3kvYXJ0aWNsZXMvaGVyZXMtd2h5LW5hc3NpbS1uaWNob2xhcy10YWxlYi1jYWxsZWQtYml0Y29pbi1hLW1hbGlnbmFudC10dW1vci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "Here's Why Nicholas Taleb Called Bitcoin a 'Malignant Tumor' - The Motley Fool",
        "content": "Black Swan author Nassim Nicholas Taleb lashed out at Bitcoin (BTC) in a recent interview. The well-known risk analyst compared the leading cryptocurrency to \"malignant tumors\" and said it’s a \"magnet for idiots.\"\n\nCredited with predicting the 2007/2008 financial crisis, Taleb, who writes about probability and risk, was once a fan of Bitcoin. He thought it could offer an alternative to centralized monetary policy at a time when he didn't agree with the Fed's decisions. But as time went on, he lost faith, as he explained in a recent interview with L'Express in France.\n\nHere are some of the reasons he now compares Bitcoin to cancer.\n\n1. It doesn't work as a currency\n\nTaleb says that Bitcoin hasn't managed to become a \"currency without government,\" in spite of the hype. He points out that it doesn't work as a store of value or guard against inflation -- two common selling points we hear from Bitcoin advocates. \"Worse than anything,\" he says, \"It does not remotely constitute a shield against government tyranny or a vehicle to protect against catastrophic episodes.\"\n\nThere are a lot of arguments around whether Bitcoin works as a currency. On the one hand, it's extremely volatile. If you're using Bitcoin to pay salaries or pay your rent, it becomes problematic if it gains or loses 50% of its value in a short space of time. It's also relatively slow in processing transactions and transaction fees can be expensive.\n\nOn the other, Bitcoin fans believe it could become the currency of the internet, or function as a form of digital gold, and say there are tech solutions that will reduce transaction times and costs. It's also been adopted by countries like El Salvador and the Central African Republic as legal tender (though there are questions about how successful those moves actually were.)\n\n2. It's part of a Disneyland-eque asset bubble\n\nTaleb believes the low interest rates we've seen in the past 15 years have distorted the way we see investments. \"Lowering rates creates asset bubbles without necessarily helping the economy,\" he argues. According to Taleb, Bitcoin has flourished in a speculative environment where people have lost any sense of what long-term investments really are. He goes further, claiming that young Bitcoiners do not understand finance. He says some young people who bought Bitcoin early \"got temporarily rich without knowing anything except computer programming.\"\n\n3. It attracts scammers\n\nThe idea that crypto is a hotbed for fraudulent activity is nothing new. Even Coinbase CEO Brian Armstrong said last year that the industry was suffering a black eye because of the numbers of fraudsters involved. Taleb says, \"I think the crypto universe attracts manipulators and scammers.\"\n\nBitcoin fans would argue it's not fair to slam the entire crypto industry just because Bitcoin has been used by bad actors -- in the same way that you can't you couldn't criticize the U.S. dollar because some criminals use it. Scammers have used crypto just as they would use any new technology where there are high expectations and a relatively low knowledge base. That said, the lack of regulation in terms of the functioning of individual cryptocurrencies and trading on crypto exchanges has opened the door to a disproportionate number of bad actors.\n\nIs he right?\n\nMany crypto investors have seen the value of their portfolios drop significantly in the past year, particularly those who bought for the first time during the frenzy of 2020/2021. It isn't surprising that some people regret their crypto purchases and wonder if Bitcoin still has long-term potential.\n\nThe difficulty is that nobody knows for sure. Taleb raises important questions about Bitcoin's utility, which is fundamental to its ability to do well in the coming 10 or 20 years. But the idea that it's an asset bubble or that it has attracted scammers doesn't necessarily rule out an eventual recovery.\n\nInvestors like Ark Invest's Cathie Wood still believe Bitcoin could reach $1 million by 2030. Ark cites several industries where it could take a portion of the market -- such as the international remittance market or working as a currency in emerging markets. But it's impossible to guess at the impact of increased regulation. Regulation is just one of several hurdles that crypto needs to cross. For example, right now, crypto isn't that easy to use, which stops it reaching new users.\n\nOne thing is clear. Bitcoin remains a high-risk investment and it is important to listen to critics like Taleb as well as advocates like Wood. If you do decide to buy Bitcoin, make sure it only makes up a small percentage of your portfolio. If you only invest money you can afford to lose in high-risk assets like crypto, you won't be knocked off course financially if they eventually fail."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDYvYml0Y29pbi1ob2xkcy1zdGVhZHktbmVhci0yM2stYXMtaW52ZXN0b3JzLXdlaWdoLXRoZWlyLW5leHQtc3RlcHMv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8wNi9iaXRjb2luLWhvbGRzLXN0ZWFkeS1uZWFyLTIzay1hcy1pbnZlc3RvcnMtd2VpZ2gtdGhlaXItbmV4dC1zdGVwcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Holds Steady Near $23K as Investors Weigh Their Next Steps - CoinDesk",
        "content": "“Bitcoin has had a few rough sessions but broadly speaking it still looks in good shape, sitting within the range it's traded in over the last couple of weeks and not far from the new year highs,” Craig Erlam, senior market analyst at forex services firm Oanda, wrote in a Monday note."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA2L3Jpb3QtcmlvdC1iaXRjb2luLW1pbmluZy1tYWNoaW5lcy1hcmUtb2ZmbGluZS1hZnRlci10ZXhhcy13aW50ZXItc3Rvcm3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Riot's Bitcoin Mining Still Crimped by December Storm in Texas - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2RhdGEtb24tdGFwcm9vdC1vcmRpbmFscy1wb2ludHMtdG8taGlnaGVyLWJpdGNvaW4tZmVlcy1jaGFpbi1ibG9hdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Data on Taproot Ordinals points to higher Bitcoin fees, chain bloat - CryptoSlate",
        "content": "A Taproot Wizard jpeg was mined into the Bitcoin blockchain on Feb. 1, sparking debate on the appropriate use of network resources, particularly inefficiencies due to increased block size.\n\nThis was possible thanks to the Ordinals protocol, which enables the storage of jpegs, videos, and other such data directly on the blockchain via Bitcoin-native digital artifacts, otherwise known as “Inscriptions.”\n\nCryptoSlate staff members Liam Wright, James Van Straten, and CommerceBlock CEO Nicholas Gregory discussed the matter, covering what this could mean for scaling and efficiency, during a recent episode of BitTalk.\n\nUsing Glassnode data, CryptoSlate noted that Taproot Inscriptions activity had skyrocketed recently, which coincided with a spike in fees.\n\nBitcoin Taproot adoption\n\nThe Taproot soft fork went live in November 2021, enabling executable commands and specific new scripts, among other updates. In essence, the upgrade laid the foundation for smart contracts and dApps.\n\nTaproot adoption refers to the number of transactions that spend at least one Taproot input against the overall number of transactions. At the same time, utilization refers to the number of spent Taproot inputs against the overall number of spent inputs.\n\nThe chart below shows a gradual increase in both adoption and utilization rates, leading to an explosion around November 2022. Both adoption and utilization have reached all-time highs, at 7.5% and 2.8%, respectively.\n\nSpent outputs\n\nAn unspent transaction output (UTXO) refers to the amount of digital currency that remains following a transaction. It is a type of accounting that keeps track of who owns what.\n\nFollowing the Taproot soft fork, a new type of spent output was introduced – P2TR (Pay to Taproot,) which can be thought of as a new script method to handle the sending of Bitcoin either through either Schnorr signatures or Merkelized Alternative Script Treesroot (MAST.)\n\nThe chart below shows P2TR outputs gradually building since their introduction in November 2021. Late January sees a significant jump in activity, taking the current total number of Taproot spent outputs to 2.8%, compared to just 1% two weeks prior.\n\nRecent coverage of the Ordinals controversy has likely given rise to the acceleration of Taproot activity on the chain. However, on-chain metrics only suggest a further acceleration of Taproot activity and cannot answer where this trend may lead.\n\nThe CEO of Instasize, Hector Lopez, pointed out that the Taproot Wizard block was the biggest to date, at 3.96 MB, which is taking up space and limiting the number of financial transactions.\n\nFollowing this train of thought, a possible future scenario may see fees increase, potentially leading to competition between financial transactions and jpegs, driving fees even higher. Also, bigger block sizes will increase chain bloat.\n\nData from Hashrate Index shows that Taproot activity has coincided with an increase in transaction fees as they pertain to block rewards.\n\nFurther, if each proceeding block were to be completely filled to the 4 MB limit, projections put a 4 TB size on the blockchain by 2040. This point reiterates what others have said regarding the inappropriate use of network resources.\n\nCommenting on the issue, Gregory said a potential solution lies in filtering out the jpegs, so the nodes do not store that data. Anyone wishing to view the complete chain can do so via specific software designed for that purpose."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMDYvYml0Y29pbi1zdHJ1Z2dsZXMtYXJvdW5kLTIzMDAwLWxldmVsLWFzLW5ldy15ZWFyLXJhbGx5LWxvc2VzLXN0ZWFtLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMi8wNi9iaXRjb2luLXN0cnVnZ2xlcy1hcm91bmQtMjMwMDAtbGV2ZWwtYXMtbmV3LXllYXItcmFsbHktbG9zZXMtc3RlYW0uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin struggles around $23,000 level as new-year rally loses steam - CNBC",
        "content": "Meanwhile, ether fell as low as $1,610.21 Monday. It was last higher by 1.7% at $1,646.12.\n\nFor the month, bitcoin is down 0.4%. However, it's still up 39.1% for 2023.\n\nBitcoin fell as low as $22,655 early Monday morning, its lowest level since Jan. 31, according to Coin Metrics, after breaking through the $24,000 on Thursday. It was last trading higher by less than 1% at $23,001.58.\n\nThe price of bitcoin dipped below $23,000 over the weekend as investors digested the latest U.S. employment numbers and looked toward a batch of Federal Reserve member speeches.\n\nA strong labor market\n\n\"Bitcoin continues to lose its momentum after the stronger-than-expected January jobs report forced the market to prepare for two more rate hikes,\" said Yuya Hasegawa, crypto market analyst at Japanese bitcoin exchange Bitbank.\n\n\"Bitcoin has survived a week packed with important events and economic data, while maintaining the price around $23,000, but the market may have exhausted reasons to buy the coin and could be subjected to profit-taking sell orders this week,\" he said.\n\nOn Friday, the Labor Department reported the strongest gain in nonfarm payrolls – 517,000, for the month of January, far higher than the 187,000 Dow Jones estimate – since July and a 53-year low in the unemployment rate. After the numbers were released, Treasury yields rose and the U.S. dollar index followed – both of which tend to move inversely to crypto.\n\nThe report \"delivered a blow to all those expecting the Fed to cut rates soon,\" said Noelle Acheson, economist and writer of the Crypto is Macro Now newsletter. \"The bump in employment, and the lowering of the official unemployment rate to the lowest in over 50 years, suggests that scenario is a way off still, and reminds the market that the Fed has no other reason to bring rates down.\"\n\n\"Expectations are shifting to more tightening, and higher rates for longer (what the Fed has been saying all along), which is not good for risk-on assets,\" she added.\n\nAwaiting a crypto pullback\n\nFor several investors and analysts, the crypto market is showing a bullish trend, and likely found a bottom at $17,000 in December, but is likely to pause at least once more before taking off on a more meaningful bull run.\n\nBitcoin is trading \"at the deepest overbought condition in over two years\" and is \"due for a brake check,\" according to Wolfe Research.\n\nMany believe that the macro environment will continue to be a big challenge for risk assets including crypto. In 2022, crypto's correlation with stocks was at its highest and that trend isn't likely to be over.\n\nFed chair Jerome Powell is scheduled to speak at the Washington D.C. Economic Club on Tuesday, and several other Fed members are slated to deliver speeches this week.\n\n\"Given last week's failure to fully suppress the market's optimistic rate outlook, the Fed members will likely continue to remind the market that the Federal Funds rate will climb above 5% and will be kept there throughout the year,\" Hasegawa said."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaGVyZXMtd2h5LW5hc3NpbS1uaWNob2xhcy10YWxlYi1jYWxsZWQtYml0Y29pbi1hLW1hbGlnbmFudC10dW1vctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "Here's Why Nassim Nicholas Taleb Called Bitcoin a 'Malignant Tumor' - Nasdaq",
        "content": "Black Swan author Nassim Nicholas Taleb lashed out at Bitcoin (BTC) in a recent interview. The well-known risk analyst compared the leading cryptocurrency to \"malignant tumors\" and said it’s a \"magnet for idiots.\"\n\nCredited with predicting the 2007/2008 financial crisis, Taleb, who writes about probability and risk, was once a fan of Bitcoin. He thought it could offer an alternative to centralized monetary policy at a time when he didn't agree with the Fed's decisions. But as time went on, he lost faith, as he explained in a recent interview with L'Express in France.\n\nDiscover: Best places to buy bitcoin\n\nMore: Check out our updated list of best crypto apps including one offer with a $100 crypto bonus\n\nHere are some of the reasons he now compares Bitcoin to cancer.\n\n1. It doesn't work as a currency\n\nTaleb says that Bitcoin hasn't managed to become a \"currency without government,\" in spite of the hype. He points out that it doesn't work as a store of value or guard against inflation -- two common selling points we hear from Bitcoin advocates. \"Worse than anything,\" he says, \"It does not remotely constitute a shield against government tyranny or a vehicle to protect against catastrophic episodes.\"\n\nThere are a lot of arguments around whether Bitcoin works as a currency. On the one hand, it's extremely volatile. If you're using Bitcoin to pay salaries or pay your rent, it becomes problematic if it gains or loses 50% of its value in a short space of time. It's also relatively slow in processing transactions and transaction fees can be expensive.\n\nOn the other, Bitcoin fans believe it could become the currency of the internet, or function as a form of digital gold, and say there are tech solutions that will reduce transaction times and costs. It's also been adopted by countries like El Salvador and the Central African Republic as legal tender (though there are questions about how successful those moves actually were.)\n\n2. It's part of a Disneyland-eque asset bubble\n\nTaleb believes the low interest rates we've seen in the past 15 years have distorted the way we see investments. \"Lowering rates creates asset bubbles without necessarily helping the economy,\" he argues. According to Taleb, Bitcoin has flourished in a speculative environment where people have lost any sense of what long-term investments really are. He goes further, claiming that young Bitcoiners do not understand finance. He says some young people who bought Bitcoin early \"got temporarily rich without knowing anything except computer programming.\"\n\n3. It attracts scammers\n\nThe idea that crypto is a hotbed for fraudulent activity is nothing new. Even Coinbase CEO Brian Armstrong said last year that the industry was suffering a black eye because of the numbers of fraudsters involved. Taleb says, \"I think the crypto universe attracts manipulators and scammers.\"\n\nBitcoin fans would argue it's not fair to slam the entire crypto industry just because Bitcoin has been used by bad actors -- in the same way that you can't you couldn't criticize the U.S. dollar because some criminals use it. Scammers have used crypto just as they would use any new technology where there are high expectations and a relatively low knowledge base. That said, the lack of regulation in terms of the functioning of individual cryptocurrencies and trading on crypto exchanges has opened the door to a disproportionate number of bad actors.\n\nIs he right?\n\nMany crypto investors have seen the value of their portfolios drop significantly in the past year, particularly those who bought for the first time during the frenzy of 2020/2021. It isn't surprising that some people regret their crypto purchases and wonder if Bitcoin still has long-term potential.\n\nThe difficulty is that nobody knows for sure. Taleb raises important questions about Bitcoin's utility, which is fundamental to its ability to do well in the coming 10 or 20 years. But the idea that it's an asset bubble or that it has attracted scammers doesn't necessarily rule out an eventual recovery.\n\nInvestors like Ark Invest's Cathie Wood still believe Bitcoin could reach $1 million by 2030. Ark cites several industries where it could take a portion of the market -- such as the international remittance market or working as a currency in emerging markets. But it's impossible to guess at the impact of increased regulation. Regulation is just one of several hurdles that crypto needs to cross. For example, right now, crypto isn't that easy to use, which stops it reaching new users.\n\nOne thing is clear. Bitcoin remains a high-risk investment and it is important to listen to critics like Taleb as well as advocates like Wood. If you do decide to buy Bitcoin, make sure it only makes up a small percentage of your portfolio. If you only invest money you can afford to lose in high-risk assets like crypto, you won't be knocked off course financially if they eventually fail.\n\nOur picks for the best credit cards\n\nOur experts vetted the most popular offers to land on the select picks that are worthy of a spot in your wallet. These best-in-class cards pack in rich perks, such as big sign-up bonuses, long 0% intro APR offers, and robust rewards. Get started today with our recommended credit cards.\n\nWe're firm believers in the Golden Rule, which is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. The Ascent does not cover all offers on the market. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.Emma Newbery has positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9oaXZlLWJsb2NrY2hhaW4tcHJvdmlkZXMtamFudWFyeS0yMDIzLTA2MDAwMDgxOC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "HIVE Blockchain Provides January 2023 Production Update and Bitcoin HODL Increase of 20% on Year-Over-Year Basis - Yahoo Finance",
        "content": "This news release constitutes a \"designated news release\" for the purposes of the Company's prospectus supplement dated September 2, 2022 to its amended and restated short form base shelf prospectus dated January 4, 2022.\n\nVancouver, British Columbia--(Newsfile Corp. - February 7, 2023) - HIVE Blockchain Technologies Ltd. (TSXV: HIVE) (Nasdaq: HIVE) (FSE: HBFA) (the \"Company\" or \"HIVE\") is pleased to announce the production figures from the Company's global Bitcoin operations for the month of January 2023, with 260 Bitcoin produced in January, plus USD $180,000 of income from grid balancing, and a current BTC HODL balance of approximately 2,430 Bitcoin mined with green energy, representing an approximate 20% year over year growth (2,043 Bitcoin HODL in Jan 2022). The Company notes its year over year monthly production in January 2023 is consistent, during a period where BTC mining difficulty has gone up approximately 60%. Additionally, HIVE does not have any equipment financing or BTC backed loans.\n\n\n\nFigure 1\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/5335/153904_841d0965f4f91ba0_001full.jpg\n\n\n\n\n\nFigure 2\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/5335/153904_841d0965f4f91ba0_002full.jpg\n\nSummary Overview:\n\nHIVE produced 260 Bitcoin in the month of January, from ASIC and GPU mining operations, representing an average of 110 Bitcoin Per Exahash. A 21% month over month increase, compared to December 2022 (214 Bitcoin produced).\n\nHIVE's year over year monthly Bitcoin production was consistent (260 Bitcoin in January 2023 and 264 Bitcoin in January 2022), during a period where the Bitcoin network difficulty increased approximately 60%.\n\nHIVE earned USD $180,000 in income from balancing the grid, in addition to Bitcoin produced in January. Based on the daily Bitcoin prices during the month of January, the income from grid balancing would equate to a mined value of 10 Bitcoin.\n\nHIVE deployed over 6,700 new generation ASIC miners in its data centers, representing one of the largest upgrades in the Company's history, to improve our gross mining margin and fleet efficiency.\n\nHIVE has deployed over 3,200 BuzzMiners in its facilities in Sweden and Canada. These miners are from the 5,655 BuzzMiners manufactured, tested, and received to date.\n\nHIVE has fully deployed all the 3,570 S19j Pro miners acquired in December 2022 into our New Brunswick and Lachute facilities. As a result of in-house software improvements by HIVE's technical team, we further increased our efficiency at our New Brunswick site by approximately 20% in average J/TH efficiency.\n\nHIVE expects to receive an additional 645 BuzzMiners in the next 2 months, representing a total production quantity of 6,300 BuzzMiners powered by the Intel Blockscale ASIC for the initial production run. HIVE is the first company in the world to commercially deploy thousands of its own Bitcoin ASIC miners powered by the Intel Blockscale ASIC.\n\nHIVE sells all of the Bitcoin earned from our GPU mining hashrate, with a focus to HODL the green Bitcoin mined from ASICs.\n\nStory continues\n\nJanuary 2023 Production Figures\n\nFrank Holmes, Executive Chairman of HIVE stated, \"We are very happy to have overcome several big headwinds over the past year such has Bitcoin prices falling 50%, the Global Difficulty surging 50% which means fewer coins mined unless you increase both the efficiency of ASIC chips and number of machines mining which HIVE has done. Even with huge headwinds like the FTX bankruptcy and contagion, the HIVE management team has stayed focused and increased its BTC production and our HODL Bitcoin position. Further we have pivoted with our GPU chips away from Ethereum after the Merge and are using Ai to mine alternative coins and convert into Bitcoin, thus we are able to generate Bitcoin revenue. We have decided to sell the BTC earned using GPU/Ai and strive to HODL our Bitcoins created from hydro and geothermal electricity. We have not been using our ATM since November 30, 2022, and have been able to create other sources of revenue from balancing the grid to selling back energy while deploying the new Intel BuzzMiners and purchased other highly efficient ASIC machines from internal cash management. Our financial success has been from our company's values, culture, and strategy to have propriety software and strong global partnerships. Finally and fortunately we never borrowed at predatory 12-18% interest rates or kept our Bitcoin in crypto exchanges and I am very proud of the team's agility to adapt thoughtfully and quickly to the many external crisis's through the crypto winter bear market of 2022.\"\n\nAydin Kilic, President & CEO of HIVE noted \"We are proud to be producing 260 Bitcoin while also earning over USD $180,000 this month from our grid balancing initiatives. Our team has deployed over 6,700 ASIC miners in our data centers, including over 3,200 HIVE BuzzMiners, powered by the Intel Blockscale ASIC and all of the 3,570 S19j Pros we acquired in December 2022. HIVE was the first public crypto mining company to realize income from its grid balancing program in Sweden. We view grid balancing as part of our core strategy, and whenever possible, we seek to hedge energy prices.\"\n\nMr. Kilic continued, \"We have increased our overall hashrate by 25% month over month from December 2022 to January 2023. We are continuously looking to optimize our allocation of energy as a resource, either to generate hashrate or sell energy back to the grid. Moreover, if unhedged spot prices are uneconomical in a specific jurisdiction, we quickly scale down our production. Additionally, our remaining GPU fleet is now generating approximately USD $80/MWHR in revenue, which is similar to the USD $/MWHR compared to Bitcoin ASIC miners in the current Bitcoin mining economics. We are constantly optimizing the deployment of our technology resources as a company to optimize profit. These advancements and agility allow us to generate positive gross mining margin during a crypto mining bear market. With a strong balance sheet of over USD $56 million of Bitcoin, HIVE is well positioned in the market today.\"\n\nThe Company's total Bitcoin production in January 2023 was:\n\n260 BTC produced;\n\n8.4 BTC produced per day on average;\n\n2.68 Exahash of BTC Hashrate (BTC ASIC hashrate plus BTC GPU Hashrate) as of January 31, 2023 comprised of 2.52 Exahash of ASIC BTC hashrate and 0.16 Exahash of GPU BTC Hashrate (the GPU fleet was curtailed to earn income for grid balancing) as of January 31 st ; and\n\nMonthly average of 2.37 Exahash, which is equal to 110 Bitcoin per Exahash, comprised of an average of 2.28 Exahash of ASIC mining capacity and an average of 90 PH/s of Bitcoin GPU mining capacity during the month.\n\nBitcoin HODL Update\n\nAs of the date of this press release, HIVE has approximately 2,430 Bitcoin, with a market value of over USD $56 million.\n\nBitcoin Global Network Mining Difficulty Is Volatile\n\nNetwork difficulty factors are a significant variable in the Company's gross profit margins. The Bitcoin network difficulty was 34.1T as at January 1, 2023 and increased to 39.4T as at January 31, 2023. Accordingly, Bitcoin mining difficulty ended the month about 15% higher than the beginning of the month.\n\nThe Bitcoin Network Difficulty is a publicly available statistic, that reflects the total number of Bitcoin miners online and is important in analyzing a company's gross profit margins, and number of Bitcoin produced. This data is available on many websites, here is one citation: https://www.blockchain.com/explorer/charts/difficulty\n\nAs more people mine Bitcoin (difficulty increases), the daily Bitcoin block reward which presently is fixed at 900 Bitcoin per day, gets split amongst more miners; thus each miner receives a smaller portion of the block reward. Conversely, as Bitcoin prices fall, many miners may lose money, and power down, thus taking their hashrate off the network, causing Network Difficulty to decrease.\n\nThose miners with the lowest costs of production; by virtue of having more efficient machines and/or lower energy costs, are able to continue their production during these volatile cycles. Not all miners will continuously mine during a given month. As a result, some miners will produce less Bitcoin than expected, relative to their advertised hashrate. For the foregoing reasons, HIVE will self-curtail part of its operations if the unhedged spot energy prices are uneconomical, thereby leaving part of its total gross hashrate unutilized.\n\nAll Bitcoin miners are striving to use the most efficient Bitcoin ASIC chips, and we are happy that we have been able to upgrade our global fleet during this crypto market downturn.\n\nATM Equity Program Update\n\nEffective as of the date hereof, the Company has terminated its at-the-market equity distribution agreement under which the Company had the option to sell up to USD $100 million of common shares of the Company at its discretion (the \"ATM Equity Program\"). The Company did not offer any shares under the ATM Equity Program after November 30, 2022. From inception of the ATM Equity Program to November 30, 2022, the Company issued 1,306,474 common shares (the \"ATM Shares\") for gross proceeds of USD $3,941,736. The ATM Shares were sold at prevailing market prices. A cash commission of USD $118,252 on aggregate gross proceeds from the ATM Equity Program was paid to the Company's sales agent.\n\nAbout HIVE Blockchain Technologies Ltd.\n\nHIVE Blockchain Technologies Ltd. went public in 2017 as the first cryptocurrency mining company with a green energy and ESG strategy.\n\nHIVE is a growth-oriented technology stock in the emergent blockchain industry. As a company whose shares trade on a major stock exchange, we are building a bridge between the digital currency and blockchain sector and traditional capital markets. HIVE owns state-of-the-art, green energy-powered data centre facilities in Canada, Sweden, and Iceland, where we endeavour to source green energy to mine digital assets such as Bitcoin on the cloud. Since the beginning of 2021, HIVE has held in secure storage the majority of its treasury of ETH and BTC derived from mining rewards. Our shares provide investors with exposure to the operating margins of digital currency mining, as well as a portfolio of Bitcoin. Because HIVE also owns hard assets such as data centers and advanced multi-use servers, we believe our shares offer investors an attractive way to gain exposure to the cryptocurrency space.\n\nWe encourage you to visit HIVE's YouTube channel here to learn more about HIVE.\n\nFor more information and to register to HIVE's mailing list, please visit www.HIVEblockchain.com. Follow @HIVEblockchain on Twitter and subscribe to HIVE's YouTube channel.\n\nOn Behalf of HIVE Blockchain Technologies Ltd.\n\n\"Frank Holmes\"\n\nExecutive Chairman\n\nFor further information please contact:\n\nFrank Holmes\n\nTel: (604) 664-1078\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.\n\nForward-Looking Information\n\nExcept for the statements of historical fact, this news release contains \"forward-looking information\" within the meaning of the applicable Canadian securities legislation that is based on expectations, estimates and projections as at the date of this news release. \"Forward-looking information\" in this news release includes, but is not limited to, business goals and objectives of the Company; the results of operations for January 2023; the HODL strategy adopted by the Company; the acquisition, deployment and optimization of the mining fleet and equipment; the continued viability of its existing Bitcoin mining operations; the results of the ATM Equity Program, and other forward-looking information concerning the intentions, plans and future actions of the parties to the transactions described herein and the terms thereon.\n\nFactors that could cause actual results to differ materially from those described in such forward-looking information include, but are not limited to, the volatility of the digital currency market; the Company's ability to successfully mine digital currency; the Company may not be able to profitably liquidate its current digital currency inventory as required, or at all; a material decline in digital currency prices may have a significant negative impact on the Company's operations; the volatility of digital currency prices; continued effects of the COVID-19 pandemic may have a material adverse effect on the Company's performance as supply chains are disrupted and prevent the Company from carrying out its expansion plans or operating its assets; and other related risks as more fully set out in the registration statement of Company and other documents disclosed under the Company's filings at www.sec.gov/EDGAR and www.sedar.com.\n\nThe forward-looking information in this news release reflects the current expectations, assumptions and/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about the Company's objectives, goals or future plans, the timing thereof and related matters. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to the inherent uncertainty therein. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/153904"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wMi0wNi9taWNyb3N0cmF0ZWd5LXMtc2F5bG9yLWV4cGVjdHMtYml0Y29pbi10by1vdXRwZXJmb3Jt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Watch MicroStrategy's Saylor Expects Bitcoin to Outperform - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8wNi9ob3ctYml0Y29pbi1uZnRzLW1pZ2h0LWFjY2lkZW50YWxseS1maXgtYml0Y29pbnMtc2VjdXJpdHktYnVkZ2V0L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8wNi9ob3ctYml0Y29pbi1uZnRzLW1pZ2h0LWFjY2lkZW50YWxseS1maXgtYml0Y29pbnMtc2VjdXJpdHktYnVkZ2V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "How Bitcoin NFTs Might Accidentally Fix Bitcoin's Security Budget - CoinDesk",
        "content": "There’s a good chance that ordinal NFTs alone do not increase transaction fees. Well, they could increase fees, but not in the way you might think. After all, they benefit from the SegWit data discount, so theoretically a block full of digital artifacts would actually carry fewer fees than one filled entirely with ordinary Bitcoin transactions.\n\nBut if enough users start inscribing ordinal NFTs so that they seriously compete for blockspace with ordinary transactions, the users broadcasting ordinary transactions would need to increase their own fees for inclusion. In this case, miners would likely prioritize as many ordinary transactions as possible, because they have a higher fee per byte of data and they can fit more of them into a block, thus maximizing fees."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pcy1idGMtcHJpY2UtYWJvdXQtdG8tcmV0ZXN0LTIway01LXRoaW5ncy10by1rbm93LWluLWJpdGNvaW4tdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Is BTC price about to retest $20K? 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts the second week of February in a newly bearish mood as multimonth highs fail to hold.\n\nIn what may yet bring vindication to those predicting a major BTC price come down, BTC/USD is back under $23,000 and making lower lows on hourly timeframes.\n\nFeb. 6 trading may not yet be underway in Europe or the United States, but Asian markets are already falling and the U.S. dollar is gaining — potential further hurdles for Bitcoin bulls to overcome.\n\nWith some macroeconomic data to come from the Federal Reserve this week, attention is mainly focused on next week’s inflation check in the form of January’s Consumer Price Index (CPI).\n\nIn the build-up to this event, the results of which are already hotly contested, volatility may gain a fresh foothold across risk assets.\n\nAdd to that those concerns mentioned above that Bitcoin is long overdue for a more significant retracement than those seen in recent weeks, and the recipe is there for difficult but potentially lucrative trading conditions.\n\nCointelegraph looks at the state of play on Bitcoin this week and considers the factors at play in moving the markets.\n\nBTC price disappoints with weekly close\n\nIt is very much a tale of two Bitcoins when it comes to analyzing BTC price action this week.\n\nBTC/USD has managed to retain the majority of its spectacular January gains, totaling almost 40%. At the same time, signs of a comedown are on the cards.\n\nWhile comparatively strong at just under $23,000, the weekly close still failed to beat the previous one and represented a rejection at a key resistance level from mid-2022.\n\n“BTC is failing its retest of ~$23400 for the time being,” popular trader and analyst Rekt Capital summarized about the topic on Feb. 5.\n\nAn accompanying weekly chart highlighted the support and resistance zones in play.\n\n“Important BTC can Weekly Close above this level for a chance at upside. August 2022 shows that a failed retest could see BTC drop deeper in the blue-blue range,” he continued.\n\n“Technically, retest still in progress.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nAs Cointelegraph reported over the weekend, traders are already betting on where a potential pullback may end up — and which levels could act as definitive support to further buoy Bitcoin’s newfound bullish momentum.\n\nThese currently center around $20,000, a psychologically significant number and the site of Bitcoin’s old all-time high from 2017.\n\nBTC/USD traded at around $22,700 at the time of writing, data from Cointelegraph Markets Pro and TradingView showed, continuing to push lower during Asia trading hours.\n\n“Some bids were filled on this recent push down (green box) but most of the remaining bids below have been pulled (red box),” trader Credible Crypto wrote about order book activity on Feb. 5.\n\n“If we continue lower here eyes still on 19-21k region as a logical bounce zone.”\n\nFor a quietly confident Il Capo of Crypto, meanwhile, it is already crunch time when it comes to the trend reversal. A supporter of new macro lows throughout the January gains, the trader and social media pundit argued that breaking below $22,500 would be “bearish confirmation.”\n\n“Current bear market rally has created the perfect environment for people to keep buying all the dips when the current trend reverses,” he wrote during a Twitter debate.\n\n“Perfect scenario for a capitulation event in the next few weeks.”\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nFed officials to speak as market eyes CPI\n\nThe week in macro looks decidedly calm compared to the start of February, with less data and more commentary set to define the mood.\n\nThat commentary will come courtesy of Fed officials, including Chair Jerome Powell, with any hint of policy change in their language potentially to shifting markets.\n\nThe week prior saw just such a phenomenon play out, as Powell used the word “disinflation” no fewer than fifteen times during a speech and questions and answer session accompanying the Fed’s move to enact a 0.25% interest rate hike.\n\nAhead of new key data next week, talk in analytics circles is on how and when the Fed might transition from a restrictive to an accommodative economic policy.\n\nAs Cointelegraph reported, not everyone believes that the U.S. will pull off the “soft landing” when it comes to lowering inflation and will instead experience a recession.\n\n“Don’t be surprised if the term “soft-landing” remains around for a while before the rug being pulled in Q3 or Q4 this year,” investor Andy West, co-founder of Longlead Capital Partners and HedgQuarters, concluded in a dedicated Twitter thread at the weekend.\n\nIn the meantime, further analysis argues that it may be a case of business as usual, with smaller rate hikes after Powell’s “mini victory lap” over declining inflation.\n\n“Personally, my belief is that the Fed will most likely raise by +0.25% in the upcoming two meetings (March and May),” Caleb Franzen, senior market analyst at CubicAnalytics, wrote in a blog post on Feb. 4.\n\n“Of course, all future actions by the Fed will be dependent on the continued evolution of inflation data & broader macroeconomic conditions.”\n\nFranzen acknowledged that while recession was not currently an apt description of the U.S. economy, conditions could still worsen going forward, referencing three such cases in past years.\n\nCloser to home, next week’s CPI release is already on the radar for many. The extent to which January’s data supports the waning inflation narrative should be key.\n\n“Post-FOMC, we have a heap of 2nd tier data releases including the important ISM services and NFP,” trading firm QCP Capital wrote in forward guidance mailed to Telegram channel subscribers last week.\n\n“However the decider will be the Valentine's Day CPI - and we think there are upside risks to that release.”\n\nU.S. Consumer Price Index (CPI) chart. Source: Bureau of Labor Statistics\n\nMiner “relief” contrasts with BTC sales\n\nTurning to Bitcoin, network fundamentals currently offer some stability amid a turbulent environment.\n\nAccording to current estimates from BTC.com, difficulty is stable at all-time highs, with only a modest negative readjustment forecast in six days’ time.\n\nThis could well end up positive depending on Bitcoin price action and a look at hash rate data suggests that miners remain in fierce competition.\n\nBitcoin miner net position change chart. Source: Glassnode\n\nA countertrend comes in the form of miners’ economic behavior. The latest data from on-chain analytics firm Glassnode shows that sales of BTC by miners continue to increase, with their reserves dropping faster over 30-day periods.\n\nReserves correspondingly totaled their lowest in a month on Feb. 6, with miners’ balance at 1,822,605.594 BTC.\n\nBTC miner balance chart. Source: Glassnode\n\nOverall, however, current price action has provided “relief” for miners, Philip Swift, the co-founder of trading suite Decentrader, said.\n\nIn a tweet last week, Swift referenced the Puell Multiple, a measure of the relative value of BTC mined, which has left its “capitulation zone” to reflect better profitability.\n\n“After 191 days in capitulation zone, the Puell Multiple has rallied. Showing relief for miners via increased revenue and likely reduced sell pressure,” he commented.\n\nBitcoin Puell Multiple annotated chart. Source: Philip Swift/ Twitter\n\nNVT suggests volatility will kick in\n\nSome on-chain data is still surging ahead despite the slowdown in BTC price gains.\n\nOf interest this week is Bitcoin’s network value to transaction (NVT) signal, which is now at levels not seen in nearly two years.\n\nNVT signal measures the value of BTC transferred on-chain against the Bitcoin market cap. It is an adaption of the NVT ratio indicator but uses a 90-day moving average of transaction volume instead of raw data.\n\nNVT at multiyear highs may be cause for concern — network valuation is relatively high compared to value transferred, a scenario which may prove “unsustainable,” in the words of its creator, Willy Woo.\n\nBitcoin NVT signal chart. Source: Glassnode/ Twitter\n\nAs Cointelegraph reported late last year, however, there are multiple nuances to NVT which make its various incarnations diverge from one another to provide a complex picture of on-chain value at a given price.\n\n“Bitcoin’s NVT is showing indications of value normalization and the start of a new market regime,” Charles Edwards, the CEO of crypto investment firm Capriole, commented about a further tweak of NVT, dubbed dynamic range NVT, on Feb. 6.\n\n“The message is the same further through history and more often than not it is good news in the mid- to long-term. In the short-term, this is a place we typically see volatility.”\n\nBitcoin dynamic range NVT ratio chart. Source: Charles Edwards/ Twitter\n\nSmall Bitcoin wallet show “trader optimism”\n\nIn a glimmer of hope, on-chain research firm Santiment notes that the number of smaller Bitcoin wallets has ballooned this year.\n\nRelated: Bitcoin, Ethereum and select altcoins set to resume rally despite February slump\n\nSince BTC/USD crossed the $20,000 mark once more on Jan. 13, 620,000 wallets with a maximum of 0.1 BTC have reappeared.\n\nThat event, Santiment says, marks the moment when “FOMO returned” to the market, with the subsequent growth in wallet numbers meaning that these are at their highest since Nov. 19, 2022.\n\n“There have been ~620k small Bitcoin addresses that have popped back up on the network since FOMO returned on January 13th when price regained $20k,” Twitter commentary confirmed on Feb. 6.\n\n“These 0.1 BTC or less addresses grew slowly in 2022, but 2023 is showing a return of trader optimism.”\n\nBitcoin wallet addresses vs. BTC/USD annotated chart. Source: Santiment/ Twitter\n\nA look at the Crypto Fear & Greed Index, meanwhile, shows “greed” still being the primary description of market sentiment.\n\nOn Jan. 30, the Index hit its “greediest” since Bitcoin’s November 2021 all-time highs.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wMi0wNi9iaXRjb2luLXJhbGx5LXN0YWxscy1qdXN0LXNoeS1vZi10cmFkaW5nLXNpZ25hbC1sYXN0LXNlZW4tYmVmb3JlLWl0cy1yZWNvcmQtcnVu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin's Rally Stalls Just Shy of a Trading Signal Last Seen Before the Token's Record Run - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLW1heS1yZXRlc3QtMjBrLW9uLXVzLWNwaS1hbWlkLWFic2VuY2Utb2Ytc29mdC1sYW5kaW5nLXRyYWRlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price may retest $20K on US CPI amid absence of soft landing — trader - Cointelegraph",
        "content": "Bitcoin (BTC) could face a retest of $20,000 and the United States will fail in its plans for a “soft landing” on inflation, a new analysis says.\n\nIn a YouTube update on Feb. 5, Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, warned that the tide is due to turn for risk assets.\n\nU.S. “probably” headed for recession — Van de Poppe\n\nAmid confusion over how incoming U.S. macroeconomic data may affect market sentiment, Van de Poppe says there is an increasing chance that the rebound seen in crypto and stocks this year may flip bearish.\n\nBitcoin, for example, saw 40% gains in January, but like some others, he believes that a disappointing February is a real possibility.\n\n“I think that people should understand that there is no soft landing, that there is likely a continuation of this downward trend on the markets,” he said about the longer-term status quo.\n\nThe U.S., Van de Poppe continued, would “probably have” a recession thanks to the extent of the Federal Reserve’s interest rate hikes.\n\nShould a comedown begin to show itself, for BTC/USD, a potential retest target lies between $20,000 and $21,000.\n\nMuch depends on the outcome of Consumer Price Index (CPI) data for January, due Feb. 14. Should it show that inflation is slowing less than expected or even disrupting that downtrend, the results could benefit the U.S. dollar while taking the wind out of the risk asset rally.\n\nThe U.S. Dollar Index (DXY), as Cointelegraph reported, is currently in the process of consolidating after dropping 13% since mid-2022, when it circled twenty-year highs.\n\n“In this case, the next week will probably bring a case of the dollar starting to rally, or the week after with CPI and PPI, so that’s why it’s very important to keep an eye on this chart,” Van de Poppe added.\n\nU.S. Dollar Index (DXY) 1-day candle chart. Source: TradingView\n\nBitcoin bears “stuck in cash”\n\nMeanwhile, others debated the potential for a BTC price pullback ahead of a less significant macroeconomic week.\n\nRelated: Bitcoin clings to $23.5K as trader says BTC ‘identical’ to 2020 breakout\n\nA higher low would provide a better entry point for longs, popular trader Crypto Tony suggested, arguing that the bear market remained in play\n\n“Even if this was the start of a bull market, and personally, I am still in the camp we are not. You can still get a good safer entry on the higher low pullback,\" he told Twitter followers on the day.\n\nSome familiar bullish voices were as active as ever, however, including crypto and market education, analysis and prediction tool, IncomeSharks.\n\n“People still seem to be confused as to why it’s been up only,” it summarized in a tweet on Feb. 3.\n\nBTC/USD traded at around $23,400 at the time of writing, according to data from Cointelegraph Markets Pro and TradingView, with around 15 hours until the U.S. weekly close.\n\n“Just remember majority of bulls are still holding and not selling. Bears are stuck in cash. Slowly but surely the bears are caving in and buying. The stubborn ones keep shorting driving price up further.“\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDYvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtY3J5cHRvLWxvbmctcG9zaXRpb25zLXN1cmdpbmctYW1vbmctYXNzZXQtbWFuYWdlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin BTC Price, Ether ETH Price Surge Casting Dark Days of 2022 to the Past - CoinDesk",
        "content": "The COT findings could also suggest that asset managers have reached an extreme that is likely to reverse. Upcoming COT reports will indicate whether asset managers continue to go all-in on BTC, or whether they’ve decided to reduce exposure by going short."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLWFuZC1zZWxlY3QtYWx0Y29pbnMtc2V0LXRvLXJlc3VtZS1yYWxseS1kZXNwaXRlLWZlYnJ1YXJ5LXNsdW1w0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum and select altcoins set to resume rally despite February slump - Cointelegraph",
        "content": "After the impressive rally in January, Bitcoin (BTC) seems to be taking a breather in February. This is a positive sign because vertical rallies are rarely sustainable. A minor dip could shake out the nervous longs and provide an opportunity for long-term investors to add to their positions.\n\nHas Bitcoin price bottomed?\n\nThe opinion remains divided, however, on whether Bitcoin has bottomed out or not. Some analysts expect the rally to reverse direction and nosedive below the November low while others believe the markets will continue to move up and frustrate the traders who are waiting to buy at lower levels.\n\nCrypto market data daily view. Source: Coin360\n\nIn an interview with Cointelegraph, Morgan Creek Capital Management founder and CEO Mark Yusko said “the crypto summer” could begin as early as the second quarter of this year.\n\nHe expects risk assets to turn bullish if the United States Federal Reserve signals that it will slow down or pause interest rate hikes. Another potential bullish catalyst for Bitcoin is the block reward halving in 2024.\n\nCould the altcoins continue their up-move while Bitcoin consolidates in the near term? Let’s study the charts of Bitcoin and select altcoins that may outperform in the next few days.\n\nBTC/USDT\n\nBitcoin has been gradually correcting since hitting $24,255 on Feb. 2. This indicates profit booking by short-term traders. The price is nearing the strong support zone between $22,800 and $22,292. The 20-day exponential moving average ($22,436) is also located in this zone, hence the buyers are expected to defend the zone with all their might.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day EMA and the relative strength index (RSI) in the positive territory indicate that bulls have the edge. If the price turns up from the support zone, the bulls will again attempt to catapult the BTC/USDT pair to $25,000. This level should act as a formidable resistance.\n\nOn the downside, a break below the support zone could trigger several stop losses and that may start a deeper pullback. The pair could first drop to $21,480 and if this support also fails to hold up, the next stop may be the 50-day simple moving average ($19,572).\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the price is trading inside an ascending channel but the RSI has been forming a negative divergence. This suggests that the bullish momentum may be weakening. A break and close below the channel could tilt the short-term advantage in favor of the bears. The pair could then fall toward $21,480.\n\nAlternatively, if the price rebounds off the support line of the channel, the bulls will again attempt to kick the pair above the channel. If they manage to do that, the pair may resume its uptrend.\n\nETH/USDT\n\nEther (ETH) has been trading near the $1,680 resistance for the past few days. Usually, a tight consolidation near an overhead resistance resolves to the upside.\n\nETH/USDT daily chart. Source: TradingView\n\nWhile the upsloping 20-day EMA ($1,586) indicates advantage to buyers, the negative divergence on the RSI suggests that the bulls may be losing their grip. If bulls want to assert their dominance, they will have to propel and sustain the price above $1,680.\n\nIf they do that, the ETH/USDT pair may rally to $1,800. This level may again act as a resistance but if bulls do not allow the price to dip below $1,680, the rally may stretch to $2,000.\n\nInstead, if the price turns down and plummets below the 20-day EMA, the ETH/USDT pair could tumble to $1,500. This is an important support level to monitor because a bounce here could keep the pair range-bound between $1,500 and $1,680. On the other hand, if the $1,500 support cracks, the pair may dive to $1,352.\n\nETH/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears have pulled the price below the 20-EMA. This is the first indication that the bulls may take a step back. There is minor support at the 50-SMA but if it fails to hold, the pair may slide to $1,550 and then to $1,500.\n\nConversely, if the price turns up from the moving averages, the bulls will again attempt to thrust the pair above the overhead resistance. If they succeed, the pair may resume the uptrend.\n\nOKB/USDT\n\nWhile most cryptocurrencies are well below their all-time high, OKB (OKB) hit a new high on Feb. 5. This suggests that bulls are in command.\n\nOKB/USDT daily chart. Source: TradingView\n\nSome traders may book profits near the overhead resistance of $44.35 as it may act as a formidable resistance. If the price turns down from the current level but rebounds off the 20-day EMA ($37), it will suggest that bulls continue to buy the dips.\n\nThat could increase the possibility of a break above $45. The OKB/USDT pair could first skyrocket to $50 and thereafter to $58.\n\nIf the price turns down and breaks below the 20-day EMA, it will indicate that the traders may be rushing to the exit. The pair could then drop to $34 and later to the 50-day SMA ($30).\n\nOKB/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are trying to protect the $44.35 level. The pair could turn down and reach the moving averages, which is an important support to keep an eye on. If the price bounces off the moving averages, the bulls will again try to overcome the barrier at $45 and start the next leg of the uptrend.\n\nContrarily, if the price breaks below the 50-SMA, the selling could intensify and the pair may slump to $36 and then to $34. Such a move could delay the resumption of the uptrend.\n\nRelated: Fantom’s 5-week winning streak is in danger — Will FTM price lose 35%?\n\nALGO/USDT\n\nAlgorand’s (ALGO) recovery reached the breakdown level of $0.27 on Feb. 3. The bears defended this level but the bulls have not given up much ground. This suggests that the bulls expect the relief rally to continue.\n\nALGO/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day EMA ($0.24) and the RSI in the positive territory indicate that bulls have the upper hand. If the price turns up from the 20-day EMA, the likelihood of a break above $0.27 increases. The ALGO/USDT pair could then travel to $0.31 where the bears may try to offer strong resistance.\n\nIf the price turns down from this level but bounces off $0.27, it will suggest that the downtrend could be over in the short term. The pair could then attempt a rally to $0.38.\n\nThis positive view could invalidate in the near term if the pair turns down from the current level and slides below $0.23. The pair could then dive to the 50-day SMA ($0.21).\n\nALGO/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are guarding the $0.27 level but a minor positive is that the bulls have not allowed the price to stay below the 50-SMA. If the price turns up from the current level, the bulls will again try to clear the overhead hurdle. If they do that, the pair could pick up momentum and surge toward $0.31.\n\nContrary to this assumption, if the price continues and breaks below the moving averages, the pair risks a drop to $0.23. The bears will have to smash this support to gain the upper hand.\n\nTHETA/USDT\n\nTheta Network (THETA) successfully completed a retest of the breakout level on Feb. 1, indicating that bulls have flipped the downtrend line into support.\n\nTHETA/USDT daily chart. Source: TradingView\n\nThe bulls will try to push the price to the overhead resistance at $1.20. This level may act as a minor hurdle but if bulls do not give up much ground from $1.20, the THETA/USDT pair could extend its up-move to $1.34. This is an important level for the bears to defend because if this resistance crumbles, the pair could soar to $1.65.\n\nIf bears want to stop the bulls, they will have to quickly pull the price back below the 20-day EMA. The pair could then fall to $0.97 and later to the 50-day SMA ($0.89).\n\nTHETA/USDT 4-hour chart. Source: TradingView\n\nThe pair bounced off the $0.97 level, which becomes an important level to watch out for on the downside. A breach of this level is likely to tilt the advantage in favor of the bears and open the doors for a possible drop to $0.85.\n\nThe rally is facing resistance near $1.20 but the upsloping 20-EMA and the RSI in the positive territory indicate that the path of least resistance is to the upside. If buyers push the price above $1.20, the momentum should pick up for a rally toward $1.34.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzAyLzA1L25qLW1hbi1oaXJlZC1oaXRtYW4tZm9yLTIway1pbi1iaXRjb2luLXRvLWtpbGwtYS0xNC15ZWFyLW9sZC_SAV9odHRwczovL255cG9zdC5jb20vMjAyMy8wMi8wNS9uai1tYW4taGlyZWQtaGl0bWFuLWZvci0yMGstaW4tYml0Y29pbi10by1raWxsLWEtMTQteWVhci1vbGQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "NJ man hired hitman for $20K in bitcoin to kill a 14-year-old - New York Post",
        "content": "A New Jersey man who admitted to paying a hitman $20,000 in cryptocurrency to have a 14-year-old child murdered may face up to 10 years behind bars.\n\nJohn Michael Musbach, 31, pleaded guilty to an indictment charging him with one count of “knowingly and intentionally using and causing another to use a facility of interstate and foreign commerce, that is the internet, with the intent that a murder be committed,” the Department of Justice said Thursday.\n\nThe Haddonfield man is accused of exchanging sexually explicit photographs and videos with the then-13-year-old victim during the summer of 2015. The victim lived in New York at the time.\n\nAfter the victim’s parents learned of the “inappropriate contact,” they notified law enforcement, who identified Musbach in the case.\n\nIn March 2016, Musbach was arrested on child pornography charges, the DOJ said.\n\nProsecutors allege that Musbach decided to have the victim killed so that the victim could not testify against him in the pending criminal case.\n\nMusbach repeatedly contacted the administrator of a murder-for-hire website on the dark web, which purported to offer contact killings or other acts of violence in exchange for cryptocurrency, from May 7, 2016, to May 20, 2016.\n\n“Musbach asked if a 14-year-old was too young to target, and upon hearing that the age was not a problem, paid approximately 40 bitcoin (approximately $20,000 at the time) for the hit,” prosecutors said.\n\nHe paid about $20,000 worth of bitcoin while trying to hire a hitman to kill the 14-year-old victim. Getty Images\n\nFollowing his payment, Musbach repeatedly messaged the website’s administrator to inquire about when the murder would occur. The administrator then requested an additional $5,000, which prompted Musbach to try and cancel the hit and get his $20,000 returned.\n\nThe website’s administrator then revealed to Musbach that the operation was a sham, and threatened to turn Musbach over to law enforcement.\n\nMusbach faces a maximum potential penalty of 10 years in prison and a fine “of the greater of $250,000, twice the gross profits to Musbach or twice the gross losses to the victim of his offense.”\n\nHe is scheduled to be sentenced on June 13."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZGVjcnlwdC5jby8xMjA2NzIvcmlvdC1qdXN0LW1pbmVkLW1vc3QtYml0Y29pbi1ldmVyLWhhcy1tb250aNIBS2h0dHBzOi8vZGVjcnlwdC5jby8xMjA2NzIvcmlvdC1qdXN0LW1pbmVkLW1vc3QtYml0Y29pbi1ldmVyLWhhcy1tb250aD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Riot Just Mined The Most Bitcoin It Ever Has in a Month - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDespite a reduction in its fleet of mining machines and hash rate capacity, Bitcoin mining company Riot today reported it produced 740 BTC last month, its new all-time high.\n\nThis is an increase of approximately 62% as compared to 458 BTC the Texas-based company produced in January 2022, and about 12% as compared to the 659 BTC generated in December 2022.\n\nThe record number of mined Bitcoin, worth $16.8 million in current prices, came despite the operational disruption the North America-based miners faced at the end of December due to extreme weather conditions.\n\nAD\n\nAD\n\nRiot Produces New All-Time High of 740 #Bitcoin in January 2023 and Provides Infrastructure Update. Read Riot's Monthly Production and Operations Press Release here: https://t.co/NeDPep6Nkf. — Riot Platforms, Inc. (@RiotPlatforms) February 6, 2023\n\nRiot, which recently dropped \"blockchain\" from its name to become Riot Platforms, was one of the companies affected by the extreme weather and was forced to temporarily close down its Rockdale facility in Texas.\n\n“Unfortunately, as a result of this damage, our previously announced target of reaching 12.5 EH/s in total hash rate capacity in Q1 2023 is expected to be delayed,” Riot CEO Jason Les said in a statement.\n\nThe company said the winter disruptions affected approximately 2.5 EH/s of its hash rate capacity, with a deployed fleet of 82,656 miners reaching a hash rate of 9.3 EH/s as of January 31, 2023.\n\nDecrypt didn’t hear immediately back from Riot Platforms.\n\nAD\n\nAD\n\nRiot eyes hash rate increase\n\nDespite recent headwinds, the company said it hopes to increase its hash rate capacity in the near future.\n\nLast month, Riot deployed 6,912 S19-series miners, while also receiving 5,130 new S19 machines, ending January with approximately 1,152 miners staged for deployment.\n\nOnce deployed, the company expects to increase its fleet of mining machines to a total of 83,808 with a hash rate capacity of approximately 9.4 EH/s.\n\nThis number, however, may rise further as Riot has 17,040 additional miners that are currently offline in Rockdale’s Building G which was damaged during December blizzards.\n\n“We are thankful for our team’s progress, despite difficult weather conditions, and are evaluating several options to bring online the approximately 1.9 EH/s of hash rate capacity still affected in Building G,” said Les.\n\nRiot also revealed that it held approximately 6,978 BTC as of January 31, 2023, all produced by the company’s mining operations. The company said it sold 700 BTC last month, generating net proceeds of about $13.7 million."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5zdGFsYmVydGdhemV0dGUuY29tL2xvY2FsLW5ld3MvaGVhcmluZy1kZWxheWVkLWZvci1jb21wYW55LWZhY2luZy1maW5lLXJlbGF0ZWQtdG8tc3R1cmdlb24tY291bnR5LWJpdGNvaW4tbWluaW5nLWZhY2lsaXR5LTY0NzIxMznSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "Hearing delayed for company facing fine related to Sturgeon County bitcoin mining facility - St. Albert Gazette",
        "content": "A hearing to determine the financial penalty and possible sanctions for the company ordered to shut down its unregulated bitcoin mining facility in Sturgeon County has been delayed for over a year due to the company facing a second investigation, and\n\nA hearing to determine the financial penalty and possible sanctions for the company ordered to shut down its unregulated bitcoin mining facility in Sturgeon County has been delayed for over a year due to the company facing a second investigation, and because the company has been unable to file audited financial statements with the provincial utility regulator.\n\nAfter receiving multiple noise complaints from residents of Greystone Manor in Sturgeon County through the fall of 2020, an investigation was opened by the Alberta Utilities Commission's (AUC) enforcement staff into a nearby bitcoin mining facility operated by Vancouver-based Link Global Technologies, which changed its' name to Green Block Mining Corp. in 2022.\n\nThe AUC is an independent agency mandated by the provincial government to regulate Alberta's utilities sector.\n\nNo regulatory approval\n\nIn 2021, AUC investigators found that Green Block hadn't acquired regulatory approval for the Sturgeon County facility, which was powered through a natural gas well owned by MAGA Energy; hadn't notified nearby residents or completed a noise assessment; and hadn't completed an environmental impact assessment prior to operating — which lead to the AUC ordering the facility, as well as another owned by Green Block in Kirkwall, Alberta, to shut down in August, 2021.\n\nFollowing the cease order, the commission was scheduled to take the next step in their enforcement proceeding process — hold an oral hearing between Green Block and the AUC to determine exact penalties and sanctions — in November 2021, but that hearing has been delayed ever since due largely to Green Block being unable to file audited financial statements with the AUC, as well as the AUC completing another investigation into Green Block for a third unregulated facility located in Westlock, Alberta.\n\nIn September 2021, CBC reported that Green Block could face a $7.1-million fine for the Sturgeon County and Kirkwall facilities. However, that fine, called a disgorgement penalty, was based on the estimated economic gain Green Block realized through operating the facilities, which was determinable only through un-audited financial statements the company filed with the AUC in the fall of 2021.\n\nThe commission's enforcement staff took issue with the un-audited financial statements Green Block filed because the company claimed to have no crypto-mining revenue between December 2020 and May 2021.\n\n\"The absence of reported crypto-mining revenues calls into question the completeness of the revenue reported for the six months ended May 31, 2021,\" enforcement staff wrote in a September 2021 proceeding filing.\n\nEnforcement staff suggested the commission should assign little weight to the interim financial statements, nothing that unless Green Block produces audited financial statements, the proposed disgorgement penalty of $7.1 million should be considered by the AUC as reasonable.\n\nIn response, Gavin Fitch, Green Block's legal representative in the proceeding, wrote a letter to the AUC saying that enforcement staff made a \"very serious allegation\" by claiming the company's financial statements were potentially incomplete, although Fitch did not give an explanation as to why the company had no reported mining revenue during the time period, despite the company reporting $854,962 in mining revenue in 2019 and 2020 combined.\n\nBetween Dec. 2020 and May 31, 2022, Green Block's un-audited financial statements say the company generated about $1.5 million through hosting, which is when a company rents a bitcoin mining facility like the one that operated in Sturgeon County to another company to actually mine bitcoin. In many cases the company that rents a facility pays for the energy used to operate the computers, while the company that owns the facility services and maintains the operation.\n\nThe Westlock facility and hearing delay\n\nPart of the reason why the hearing to determine the penalties for Green Block's operations in the county and Kirkwall has been substantially delayed is because just three weeks after enforcement staff presented their case to the commission, staff had opened a second investigation into Green Block and another facility the company was operating in Westlock, Alberta.\n\nIn an Oct. 29, 2021, letter to the AUC, Fitch requested that the second investigation be included in the original, as it was Green Block's opinion that both investigations were for the same issues, and should be tried in one proceeding.\n\nIn response, the AUC agreed, and the final hearing was delayed indefinitely so as to incorporate the second investigation into the first, and to allow enforcement staff and Green Block to each file written evidence submissions regarding the Westlock facility.\n\nAs part of AUC enforcement proceedings, the commission takes into consideration submissions from the relevant parties before issuing what's called a phase one ruling, which is then used as part of the hearing when fines and sanctions are imposed.\n\nOn May 25, 2022 the AUC released the phase one ruling in the case of Green Block's Westlock facility, which said Green Block contravened the Hydro and Electric Energy Act by operating the facility without regulatory approval, just as the company did with their Sturgeon and Kirkwall facilities.\n\n\"Green Block acknowledged that it did not conduct a noise impact assessment before starting up the Westlock Power Plant, nor did it take steps to determine the environmental effects of the Westlock Power Plant before operating,\" the ruling says adding the company didn’t take any steps to ensure the Westlock Power Plant was in regulatory compliance.\n\nFollowing the ruling, the AUC tentatively scheduled a hearing for Sept. 21-23, 2022, with the provision that Green Block file audited financial statements beforehand so that enforcement staff can recommend an updated disgorgement penalty for the AUC's consideration. Green Block was given a deadline of July 18, 2022 to file the financial statements.\n\nBut Fitch requested an extension to file the audited financial statements, which said the company’s auditors had finished the work but a third party company was now auditing Green Block’s power consumption and cryptocurrency wallets.\n\nThe ACU approved the original extension, and a Fitch went on to request multiple other extensions for filing financial documents to the AUC. An extension in August 2022 was requested as the audit of Green Blocks’ crypto-mining activity was nearly complete, but they had yet to audit former Green Block CEO Stephen Jenkins' cryptocurrency 'wallet'.\n\nPut simply, a cryptocurrency wallet can be thought of as a digital software that stores and protectors the owner's cryptocurrency.\n\n\"Mr. Jenkins is, for the most part, cooperating with this audit but perhaps not surprisingly does not share Green Block’s sense of urgency in relation to the completion of the audit,\" Fitch wrote.\n\nThe AUC said it would reschedule a hearing for the company after the audited financial statements have been submitted.\n\nIn an email to The Gazette on Jan. 16, Fitch said the company was expecting the statements \"shortly.\"\n\n\"Green Block expects to receive its audited financial statements shortly, following which the AUC proceeding will re-activate,\" Fitch said.\n\nIn turn, AUC spokesperson Geoff Scotton told The Gazette an update from Green Block had not been received since Nov. 7 last year.\n\n\"However, according to the commission’s October 6, 2022 ruling ... Green Block is under an ongoing obligation to keep the commission updated about the status of the auditing of the financials,\" Scotton said.\n\nOn Jan. 20, the AUC sent a letter to Green Block requesting an update on the audited financial statements, and implemented a requirement for Green Block to provide an update once a month, regardless of whether or not the situation has changed.\n\nFitch responded to the AUC in a letter dated Jan. 25 saying that Green Block had no updates to provide, and that the auditors had recently told the company they \"need a couple more weeks.\"\n\nThrough the commission's online filing system The Gazette accessed all of the files in the enforcement proceeding, which includes letters and reports sent by the AUC, enforcement staff, and Green Block."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnRoZWNlbnRlcnNxdWFyZS5jb20vcGVubnN5bHZhbmlhL2FydGljbGVfZTgzZDI3OTAtYTY1MC0xMWVkLWJjZDQtZTNiMTdjYzFlODk3Lmh0bWzSAWJodHRwczovL3d3dy50aGVjZW50ZXJzcXVhcmUuY29tL3Blbm5zeWx2YW5pYS9hcnRpY2xlX2U4M2QyNzkwLWE2NTAtMTFlZC1iY2Q0LWUzYjE3Y2MxZTg5Ny5hbXAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "First U.S. nuclear-powered data center, bitcoin mine coming to Pennsylvania - The Center Square",
        "content": "You have permission to edit this article.\n\nEdit Close"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5mb29sLmNvbS90aGUtYXNjZW50L2NyeXB0b2N1cnJlbmN5L2FydGljbGVzL3RoaXMtdG9wLWludmVzdG9yLXNheXMtcmVjZW50LWNyeXB0by1yaXNlLWlzLWEtc3Vja2Vycy1yYWxseS1pcy1oZS1yaWdodC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "This Top Investor Says Recent Crypto Rise Is a 'Sucker's Rally.' Is He Right? - The Motley Fool",
        "content": "After a woeful 2022, Bitcoin (BTC) has rallied a little this year. According to CoinMarketCap data, the granddaddy of crypto started 2023 at around $16,500 before rising to over $23,000. It has now fallen slightly and is nowhere close to its all time high of over $68,000, but it's still an almost 40% increase in five weeks.\n\nSome see the rally as a reason for optimism and hope the crypto winter might finally be thawing. But Peter Schiff, a popular economist and financial commentator, isn't convinced. On Jan. 18, Schiff tweeted: \"The #Bitcoin rally is providing cover for the #gold rally to continue unnoticed. As the financial media is distracted by the sucker's rally taking place in fool's gold, its (sic) paying no attention to the real rally going on in actual gold.\"\n\nWhy Schiff thinks this is a sucker's rally\n\nSchiff, who's known for predicting the 2008 economic crash, is also famous for his love of his gold and his criticism of Bitcoin. The founding member of Euro Pacific Asset Management, Schiff's main objection to Bitcoin is that it doesn't have any use. Unlike gold, which he believes is a hedge against inflation and could always be used in jewelry if nothing else, he argues Bitcoin is just a string of numbers. Schiff thinks gold is better than money, particularly as he isn't convinced the Fed will be able to curb inflation.\n\nIn a 2021 interview with RealVision, he labeled Bitcoin a \"fad\" and said, \"Bitcoin is not a currency -- it's not used as a medium of exchange really or a unit of account.\" He continued, \"It's just used for speculation, but it's not an investment asset like real estate, doesn't pay rent, it's not a stock, it doesn't pay dividends, it's not a bond, it doesn't pay interest.\"\n\nHe thinks that there are different forces behind the two price rallies. For him, Bitcoin has risen on speculation that various speculative assets that dropped significantly last year will now recover as the Federal Reserve relaxes its tightening measures and eases interest rate hikes. In contrast, he says people are buying gold because it's a hedge against both inflation and a potentially weakening dollar.\n\nIs Peter Schiff right about Bitcoin?\n\nInvestment decisions don't have to be either/or questions. Depending on the type of investor you are, it's about building a diversified portfolio of quality assets that you believe will perform well in the long term. As such, if you believe gold and Bitcoin could have value, you might own both of them.\n\nOur top crypto play isn't a token - Here’s why We’ve found one company that’s positioned itself perfectly as a long-term picks-and-shovels solution for the broader crypto market — Bitcoin, Dogecoin, and all the others. In fact, you've probably used this company's technology in the past few days, even if you've never had an account or even heard of the company before. That's how prevalent it's become. Sign up today for Stock Advisor and get access to our exclusive report where you can get the full scoop on this company and its upside as a long-term investment. Learn more and get started today with a special new member discount. Get started\n\nThat said, Schiff is almost certainly right to question whether Bitcoin can hold its recent gains. The crypto rally mirrors a rally in equities, which one Bloomberg article says is partly down to \"wishful thinking swirling that the inflation beast has been conquered.\" It is hard to believe that the Fed's economic tightening measures will end until it is confident inflation is under control. Some analysts think our inflation problems are far from over.\n\nIn addition, many economists warn that a recession could be in the cards. There's a lot of uncertainty, both about what is going to happen economically and what impact this would have on risky assets like crypto. On top of which, we don't know what impact increased crypto regulation will have, nor whether any other platforms will collapse in the ongoing fallout from FTX. The fact that Bitcoin is still nowhere close to erasing last year's losses is another reason for caution.\n\nRally aside, Schiff is not alone in arguing that Bitcoin has no intrinsic value. Warren Buffett thinks so, too. But there are plenty of Bitcoin fans who disagree, including Ark Invest's Cathie Wood, who point to its potential as a currency in emerging markets and the role it could play in the international remittance market, among other things.\n\nBottom line\n\nDeciding whether to buy Bitcoin, gold, or any other investments means looking at the fundamentals and deciding how it might perform in the future and how it might fit into your portfolio. In a way, it doesn't matter whether this rally will be short lived or not. What matters is whether Bitcoin can overcome the hurdles it faces and outperform other investments in the coming decade or more.\n\nCryptocurrency is a high-risk investment. This does mean there's the potential for big returns, but you could also lose everything. Bitcoin may achieve some of the things its fans believe it can, but there are no guarantees. If you're considering investing, make sure you understand the risks involved, use a reputable crypto exchange, and only spend money you can afford to lose."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDIvMDYvaXRhbHktc2V0dGluZy11cC1jcnlwdG8tZW52aXJvbm1lbnQtdGhhdC1tZWV0cy1ldXMtbmV3LWxhd3MtY2VudHJhbC1iYW5rLWdvdmVybm9yLXNheXMv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8wNi9pdGFseS1zZXR0aW5nLXVwLWNyeXB0by1lbnZpcm9ubWVudC10aGF0LW1lZXRzLWV1cy1uZXctbGF3cy1jZW50cmFsLWJhbmstZ292ZXJub3Itc2F5cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Italy Setting Up Crypto Environment That Meets EU's New Laws, Central Bank Governor Says - CoinDesk",
        "content": "A distinction ought to be made on crypto \"with no intrinsic value\" that \"divert resources from productive activities and collective wellbeing,\" the governor said. While these must be \"strongly discouraged,\" innovations that can help improve the efficiency of financial systems should be fostered, he added."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tbmVlZHMtYWR1bHQtc3VwZXJ2aXNpb24tYW5kLXR1cm1vaWwtdG8tZ3Jvdy11cC1taWNyb3N0cmF0ZWd5LWNvLWZvdW5kZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Crypto needs 'adult supervision' and turmoil to 'grow up' — MicroStrategy co-founder - Cointelegraph",
        "content": "High-profile crypto bankruptcies and a hearty price crash are necessary evils to help the industry grow, while greater regulation is a must, according to MicroStrategy co-founder Michael Saylor.\n\nIn a Feb. 3 interview on CNBC’s Squawk on the Street, Saylor opined on potential incoming United States crypto regulation after the bankruptcy of FTX, saying:\n\n“The crypto meltdown was painful in the short term, but it’s necessary over the long term for the industry to grow up.”\n\nHe added the industry “has some good ideas” — implying one was Bitcoin (BTC) Lightning Network — but added some in the space “implemented those good ideas in an irresponsible fashion.”\n\nToday’s interview with @MorganLBrennan covered the success of @MicroStrategy, global adoption of #Bitcoin and #Lightning⚡️, the evolution of the crypto industry, and the digital transformation of money. pic.twitter.com/bEnLOVbpiJ — Michael Saylor⚡️ (@saylor) February 3, 2023\n\nSaylor said the crypto space needs direction from entities long-involved in the traditional financial markets and input from regulators — in particular the United States Securities and Exchange Commission (SEC).\n\n“What [the industry] needs is adult supervision. It needs the Goldman Sachs and the Morgan Stanleys and the BlackRocks to come into the industry. It needs clear guidelines from Congress. It needs clear rules of the road from the SEC.”\n\nThis “meltdown,” according to Saylor, educated many on crypto while simultaneously revealing that it’s “time for the world to provide a constructive, transparent framework for digital assets” so the financial system can move “into the 21st century.”\n\nSaylor on Munger’s crypto criticism\n\nSaylor also responded to criticisms leveled by Charlie Munger, the vice chair of insurance and investment firm Berkshire Hathaway, saying the 99-year-old investment veteran should take time to study Bitcoin.\n\nOn Feb. 1, Munger opined that crypto is “not a currency, not a commodity and not a security” instead calling it “gambling” and arguing that the U.S. should “obviously” bring in laws to ban crypto.\n\nRelated: Film review: ‘Human B’ shows a personal journey with Bitcoin\n\nSaylor agreed Munger's crypto-criticism wasn’t “totally off” but there are “10,000 crypto tokens which aren’t gambling,” adding:\n\n“Charlie and the other critics, they’re members of the Western elite and they’re continually prodded for an opinion on Bitcoin and they haven’t had the time to study it.”\n\nHe added if Munger “spent 100 hours studying” Bitcoin then “he would be more bullish on Bitcoin than I am.”\n\nSaylor pointed to emerging markets such as Lebanon, Argentina and Nigeria which have high crypto-use rates and use cases spanning from inflation hedging to remittances.\n\n“I’ve never really met someone [...] that spent some time to think about it that wasn’t enthusiastic about Bitcoin.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vbWVkaXVtLmRhdGFkcml2ZW5pbnZlc3Rvci5jb20vYml0Y29pbi1wcmljZS10by10aGUtbW9vbi1lMWMwNzcwMDdhMDTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Price to The Moon.. But when is the right question? | by Alexandros Roumpos - DataDrivenInvestor",
        "content": "Bitcoin Price to The Moon.\n\nBut when is the right question? Alexandros Roumpos · Follow Published in DataDrivenInvestor · 3 min read · Feb 6, 2023 -- 1 Share\n\nBTC to the moon. Picture from DALL-E 2.\n\nWe will try to figure out what is going on in the market and if we are in a bull market right now. (2/5/2023)\n\nBTC is up about 44%. That is a fact.\n\nThe New Year started very well for the crypto market. BTC was traded at $16,500 at the beginning of the year and is now at $23,000 to $24,000. BTC is up about 44%. That is a fact.\n\nEthereum and altcoins are the same. When the King (BTC) is up, the followers are going up, but when the King is going down the same is true for all the altcoins.\n\nAs an investor, you probably wondering if we are done with the crypto winter and are in a bull run that will send the BTC price to the Moon soon. Definitely, we was-are in a Bull run. The increase of 44% in the price indicates that.\n\nBut is this rally continuing? Are the bears defeated? Will I finally drive the Lambo? I don’t think so.\n\nLet me explain. I am neither a magician nor a profit, I am a guy who is involved in the crypto market since 2017 and I have survived 2 crypto winters (the second one is still playing) and have experienced losses and wins.\n\nBut is this rally continuing? Are the bears defeated? Will I finally drive the Lambo? I don’t think so.\n\nIf we look at the past and use the data we have about the price of BTC (as an indicator) as a guide, we will see two things. First is the crypto market cycle has a duration of 4 years. The second one is the halving of BTC signals the end of the bear market and the beginning of the bull market, where a lot of bull runs occur driving the price to the moon.\n\nNeither the lifecycle of the market is completed nor the halving is near. The next halving will occur approx. at 28 March of 20224. That is in 417 days. That is a year and two months.\n\nNeither the lifecycle of the market is completed nor the halving is near.\n\nFurthermore, we must look at the bigger picture. How does the economy perform? What is the rate of unemployed people? Where is the inflation? Where are the interest rates…"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vY29pbmdlZWsuY29tL2JpdGNvaW4tc3YtbGlzdGVkLW9uLWNvaW5zdG9yZS1jb20v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin SV listed on Coinstore.com - CoinGeek",
        "content": "Zug Switzerland: The Bitcoin SV (BSV) token is now available to trade on the leading digital currency exchange Coinstore.com. The listing means users will have another way to buy, sell and trade BSV in several major regions worldwide.\n\nFounded in 2020 by experienced finance and technology professionals from some of the world’s most renowned crypto exchanges, Coinstore.com has amassed over 180 employees worldwide, serving more than 1.8 million registered users in 175 countries. As a leading global provider of financial infrastructure and technology in the field of the crypto economy, Coinstore.com aims to become the preferred cryptocurrency trading platform and digital service provider worldwide.\n\nBSV joins a selective list of digital assets available on Coinstore, with the new listing pointing to its continued growth in major regions such as the Philippines and India. With millions of daily transactions, a wave of application development, and scaling solutions which have taken the BSV blockchain to millions of transactions per second, the listing serves as another vital onramp for users.\n\nShawn Ryan, Director of Corporate Relationships – Exchanges, Wallets, for the Bitcoin Association for BSV said:\n\n“We are very excited to have the BSV token listed on the Coinstore.com exchange. This listing is the first of several planned for 2023, meaning that millions more people will have access to the BSV token in the coming months. This comes at a time when Bitcoin SV has reached a level of scalability that shows it is ready for global adoption.”\n\nAbout the Bitcoin Association for BSV\n\nBSV is the ideal blockchain for enterprise and government projects. With unbounded on-chain scaling, the Bitcoin SV blockchain meets the needs of large-scale technology applications: high transaction volumes, fast speed, predictable low fees, micropayment capabilities, and greater data capacity. Its powerful technical capabilities enable smart contracts, tokenisation, IoT device management, computation and more. As a public ledger, BSV also enables transparency, auditability and more honesty for governments, citizens and enterprises. Applications on BSV now span a wide array of industry sectors – media & entertainment, social media, online games, Metaverse/AR/VR, digital advertising, data integrity, ID management, government services, supply chain, accounting, RegTech, distributed network intelligence, Internet of Things, and financial.\n\nLightning Sharks on behalf of Bitcoin Association for BSV\n\nKey contact: Haris Khan\n\nEmail: [email protected]\n\nMobile: +44 (0) 7503 581 563\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lmxhd2dhemV0dGUuY28udWsvcHJhY3RpY2UvMmJuLWJpdGNvaW4tZmlkdWNpYXJ5LWR1dHktY2FzZS10by1nby10by10cmlhbC0vNTExNTAzNS5hcnRpY2xl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "£2bn bitcoin fiduciary duty case to go to trial - Law Gazette",
        "content": "A trial in London is the right place to decide a cryptocurrency dispute which could lead to a 'significant development' in the law of fiduciary duty, three Court of Appeal judges have ruled. They were overturning a decision by Mrs Justice Falk last year dismissing a claim by a Seychelles company against bitcoin developers based outside the UK.\n\nThe case, Tulip v Van der Laan and Others, was brought following a 2020 hacking attack on Dr Craig Wright (pictured below), the Australian computer scientist resident in the UK who claims to be bitcoin's inventor, 'Satoshi Nakamoto'. (In the lead judgment, Lord Justice Birss noted that the claim is 'hotly disputed' but is not relevant to the case.)\n\nWright contends that, because of the attack, he has lost the private keys to 111,000 bitcoin - currently worth £2.1bn - owned by his company Tulip Trading and held on networks controlled by developers of open source software. He claims the developers owe a fiduciary duty to implement a software 'patch' to safeguard the assets. It has never been suggested that they had anything to do with the hack.\n\nThe developers, Birss said, 'contend that they have nothing like the power or control Tulip alleges and that duties of the kind Tulip contend for would be highly onerous and unworkable'.\n\nTulip appealed the High Court's dismissal of the case on six grounds, including that the judge was wrong to hold that it had no real prospect of establishing the claimed fiduciary duties. The appellants also argued that 'this is a developing, complex and uncertain area of law' and therefore the point should go to trial. A hearing is expected early next year.\n\nGranting the appeal, in a decision supported by Lord Justice Lewison and Lord Justice Popplewell, Birss said: 'The conclusion is not that there is a fiduciary duty in law in the circumstances alleged by Tulip, only that the case advanced raises a serious issue to be tried.'\n\nThe substantive case would tackle issues including the governance of 'De-Fi' assets, he said. 'If the decentralised governance of bitcoin really is a myth, then in my judgment there is much to be said for the submission that bitcoin developers, while acting as developers, owe fiduciary duties to the true owners of that property.'\n\nHe acknowledged that for Tulip's case to succeed 'would involve a significant development of the common law on fiduciary duties'.\n\nFelicity Potter, partner at Wright's solicitors, specialist London firm Ontier LLP, said: 'This is a much-welcomed judgment. We asserted that it is inappropriate to summarily dismiss Tulip’s claims at an early jurisdiction hearing where the disputed underlying facts have not been assessed by the court, and the Court of Appeal agreed. The scope of developers’ duties must now be explored in detail at trial.'\n\nShe added that: 'The responsibilities owed by developers of digital assets to end users is of significant importance to all coin holders as the concept of digital assets becomes more mainstream.'\n\nJames Ramsden KC, who appeared for 14 of the developers, agreed on the potential importance of the case. 'The courts in this jurisdiction continue to lead the common law world in developing a legal structure for the De-Fi sector. This case will be the most important so far in maintaining that lead and continuing to establish this jurisdiction as the leader for De-Fi litigation. The outcome of this claim at trial will therefore have a profound impact and not just in the UK.'\n\nThe Tulip litigation is only one of a battery of cases brought by Wright over the past two years to secure cryptopassets and defend his reputation. In September the Court of Appeal in Oslo is due to hear his appeal against a Norwegian court's dismissal of a libel claim. The High Court in London is also due next year to hear a copyright dispute over Wright's claim to authorship of the seminal 'Satoshi' white paper. Meanwhile, Wright is due to appear before a divisional court in April to contest allegations that he broke an embargo on a London libel judgment.\n\nJohn Wardell KC, Bobby Friedman and Sri Carmichael, instructed by Ontier LLP, appeared for Tulip Trading. James Ramsden KC, instructed by Bird & Bird, for 14 developers; Alex Charlton KC and Daniel Khoo, instructed by Brett Wilson LLP, for two developers.\n\n\n\nThis article is now closed for comment."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYml0Y29pbmlzdC5jb20vbmV3LXJlY29yZC1oYWxmLW9mLWJpdGNvaW4tc3VwcGx5LWhhc250LWNoYW5nZWQtaGFuZHMtaW4tMi15ZWFycy_SAVxodHRwczovL2JpdGNvaW5pc3QuY29tL25ldy1yZWNvcmQtaGFsZi1vZi1iaXRjb2luLXN1cHBseS1oYXNudC1jaGFuZ2VkLWhhbmRzLWluLTIteWVhcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 12:58:38 GMT",
        "title": "New Record: Half Of Bitcoin Supply Hasn't Changed Hands In 2 Years | Bitcoinist.com - Bitcoinist",
        "content": "Bitcoin has experienced a bullish trend in 2022, which is reflected in the number of BTC held in storage. Savings or long-term storage of Bitcoin reached a new record in early February as holders anticipate a return to pre-2022 price levels.\n\n49% Of Bitcoin In Long-Term Holdings\n\nAccording to data from analytics firm Glassnode, 49% of the total Bitcoin supply has stayed in the same wallet for more than two years. This is equivalent to more than 9.45 million Bitcoins or about $220 billion at the time of writing.\n\nGlassnode further explained this trend with a graph that shows the previous peak came in the last quarter of 2020 and the beginning of 2021. The peak ended during the bull market of 2021 because holders began selling as the price of BTC went up.\n\nAfter the massive dip in the value of Bitcoin, the indicator dipped and remained stable for most of last year. This means that Bitcoin holders decided to wait for a price increase before moving their assets in the middle of the bear market.\n\nRelated Reading: Breaking: Bitcoin Breaks Above $24,000 For The First Time In 2023\n\nHowever, this trend has changed since December, with a significant increase driven by the consistent rise in the value of Bitcoin. Currently, 49% of Bitcoins have not been moved in two years, and investors are biding their time as we face a new bullish cycle for BTC.\n\nA Bullish Indicator For Bitcoin\n\nThe fact that investors have held steadfastly to their coins is a bullish indicator for Bitcoin and shows that there’s still a lot of confidence in the leading cryptocurrency.\n\nBitcoin is considered the primary market mover, and several institutions hold the asset on their balance sheet. It is also a legal tender in El Salvador and the Central African Republic, with several nations contemplating adding the digital currency to their list of national currencies.\n\nBTC has also been used as a means of donation in the ongoing Russian-Ukraine war, and the latest bullish cycle could create more inroads for adoption. Since the beginning of this year, Bitcoin is up by about 38% and recently hit the $23,000 price mark for the first time since August 2022.\n\nLong-term investors are likely preparing to take profits at higher levels as the price continues to hit new levels. Earlier in January, the amount of Bitcoin addresses in profit hit new levels, with 68% of addresses now in profit.\n\nThe last time this happened was in mid-2022, when the price of BTC was about $40,000 and in a sharp decline. So there’s a trend that we could be in for an extended bullish run in the coming months.\n\nRelated Reading: Bitcoin Derivatives Market Volumes Show Bullish Trend After 2022 Downturn\n\nNevertheless, some believe that the first quarter of the year will witness a consolidation in the price of BTC before a significant price boost in the second half of the year. It would be interesting to see if this is a temporary price spike or a major bull run.\n\nFeatured image from Unsplash.com/ chart from TradingView and Glassnode."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS13aXRoLTc1LWhpc3RvcmljYWwtYWNjdXJhY3ktc2V0cy1iaXRjb2luLXByaWNlLWZvci1mZWJydWFyeS0yOC0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Crypto community with 75% historical accuracy sets Bitcoin price for February 28, 2023 - Finbold - Finance in Bold",
        "content": "Disclaimer: The CoinMarketCap cryptocurrency community price estimate is based only on the votes of its users. Estimates do not guarantee end-of-month prices.\n\nBitcoin (BTC) investors are taking heart from encouraging macroeconomic data in 2023, with many hoping that the cryptocurrency will continue to climb in February.\n\nInterestingly, the machine learning algorithm system that employs AI technology predicts that Bitcoin’s price will be $24,342 at the end of February. Meanwhile, according to data gathered by Finbold on February 6, votes submitted by users of the crypto monitoring website CoinMarketCap predict that Bitcoin will change hands at an average price of $20,254 on February 28, 2023.\n\nShould the estimations of 15,258 member votes prove true, it would mean that the price of Bitcoin by the end of February will decline by -11.44% or -$2,615 compared to its current value.\n\nSocial Bitcoin price estimate for February 28, 2023. Source: CoinMarketCap\n\nTaking into consideration the performance of the crypto community’s projections for the six previous months, it has historically set the price of the flagship decentralized finance (DeFi) token with an accuracy rate of 75.55%, with January’s accuracy at 83.88%.\n\nBitcoin has 75% historical accuracy. Source: CoinMarketCap\n\nBitcoin price analysis\n\nAt press time, Bitcoin’s price was trading at $22,875, with a loss of about 2.13% in the last 24 hours. Bitcoin is back under $23,000 and reaching lower lows on hourly timescales, which may vindicate those who predicted a huge BTC price drop.\n\nBitcoin 1-day price chart. Source: Finbold\n\n\n\nBitcoin’s technical analysis on TradingView is mixed, with the summary aligning with the ‘buy’ sentiment at 10 while moving averages are for the ‘buy’ at 10. Oscillators are pointing at ‘sell’ with 2.\n\nBitcoin 1-day sentiment gauges. Source: TradingView\n\nWhile the Federal Reserve will release some macroeconomic data this week, the emphasis will be mostly on next week’s Consumer Price Index (CPI) for January.\n\nVolatility may find a new footing across risk assets in the run-up to this event, the outcome of which is already highly debated.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnB1YmxpY2ZpbmFuY2VpbnRlcm5hdGlvbmFsLm9yZy9ob3ctdG8tYnV5LWJpdGNvaW4taW4tc2luZ2Fwb3JlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "How to Buy Bitcoin In Singapore? - Public Finance International",
        "content": "If you are a resident of Singapore and want to buy bitcoin, we list step-by-step instructions for buying BTC with SGD (Singapore Dollars).\n\nCryptocurrencies are becoming more and more prominent in everyday life, including in Singapore. With the price of BTC hitting an all time high of ~US$64,895 (S$86,480) on 14 April 2021, many people started noticing and you might be one of them. If you would like to ride the cryptocurrency wave and want to get some exposure to Bitcoin, read on.\n\nAfter a filling with the U.S. Securities and Exchange Commission (SEC) revealed a Tesla purchase worth of $1.5 billion of Bitcoin and DBS (SGX: D05) announcing it will set up a digital exchange, cryptocurrencies and Bitcoin is here to stay.\n\nWe will go over how to buy and start trading Bitcoin in Singapore. Many trading platforms allow you to buy it directly and accept SGD.\n\nBuy Bitcoin in Singapore\n\nThere are two ways to invest in cryptocurrencies in Singapore. You can go online and buy from a bitcoin exchange or head to a local ATM where you can exchange SGD for Bitcoin. To buy or start trading, you need an exchange account, though safer storage practices are recommended.\n\nHere are the steps on how to buy BTC as a Singaporean:\n\nCompare crypto exchanges Choose an Bitcoin exchange Create an account Deposit SGD Click on “Buy” Enter the amount Review the transaction Click “Buy” Start Trading or Store it in a Crypto Wallet\n\nYou can either buy $100 worth of Bitcoin or even less. You don’t have to buy the full amount of 1 BTC, but just a fraction.\n\nWhere to Buy Cryptocurrencies in Singapore – Best Exchanges For Bitcoin in Singapore\n\nThe best platform to buy crypto In Singapore is Stormgain. They charge no deposit fees or have any additional fees. You can find the top exchanges to purchase Bitcoins and other popular cryptocurrencies below.\n\nExchange Fees Pro Account Supported Cryptocurrencies Deposit Fees Stormgain 0.095% (BTC) Yes BTC + others $0 Binance Singapore 0.1% spot trading fee; 0.5% Instant Buy/Sell fee / 300+ Deposit with Xfers is free Huobi Global N/A / N/A Varies Coinbase Variable percentage fee 1.49% – 3.99% / N/A Varies (3.99% + 7% of transaction fee)\n\nor\n\n$25 for SWIFT transfers\n\nStormgain- Best For Cryptocurrency Singapore Award-winning trading platform\n\n1 interest rate provider for cryptocurrency traders on CoinMarketCap\n\nMember of the Blockchain Association of the Financial Commission since 2019\n\nGreat Trading Platform\n\nMany Withdrawal Options Visit Stormgain >>\n\nThings to know before you buy\n\nWhen it comes to cryptocurrencies, bitcoin is the granddaddy of them all. Bitcoin is a digital currency that was created in January 2009 by Satoshi Nakamoto. It is the longest surviving cryptocurrency and has the largest market capitalization. This longevity, rapid growth and adoption makes bitcoin the best in terms of long-term investing. While bitcoin is in a category of its own, all other coins are known as Altcoins (alternative coin). The most popular altcoin being Ethereum, which serves as a platform for decentralized apps (dApps) and smart contracts.\n\nIs buying Cryptocurrency Legal in Singapore?\n\nYes, it is completely legal to buy crypto in Singapore. However, Bitcoin and cryptocurrencies are not regulated by the MAS (Monetary Authority of Singapore). They are not considered legal tender. There is no protection available if you lose money from investing in digital currencies such as Bitcoin.\n\nJust recently, El Salvador became the first country to adopt bitcoin as legal tender. In a nutshell, this means Salvadorans could use Bitcoin as an official form of payment in El Salvador.\n\nMAS (Monetary Authority of Singapore) Regulation on Cryptocurrencies in Singapore\n\nCryptocurrencies are new, and regulation is still in its infancy in Singapore. MAS classifies Cryptocurrencies as digital payment tokens (DPT) and some regulation comes with the Payment Services Act 2019. The act mainly tries to prevent money laundering and terrorism financing.\n\nThe Monetary Authority of Singapore doesn't safeguard your transaction or regulate them. In a nutshell, you are not protected.\n\nHowever, things are changing. In the beginning of 2021 (Jan 4) MAS announced enhancements to the Payment Services Act. Providers of storage or exchange of DPTs (cryptocurrencies) will have to comply with rules and regulations set by MAS.\n\nWhy invest in Bitcoin?\n\nBitcoin and cryptocurrencies in general appeal to supporters for a number of reasons. These are the most popular:\n\nSupporters are rushing to invest in cryptocurrencies because the technology is still in its infancy.\n\nThe supply is limited to 21 Million. It is a simple supply and demand mechanic.\n\nMany supporters like the fact that cryptocurrencies are decentralized and remove central banks.\n\nThe technology behind Bitcoin and other altcoins. The decentralized processing and recording system is more secure than current payment systems.\n\nSpeculators like it for its great returns and volatility. The ROI (return on investment) has been great for long term investors as well as day traders.\n\nRecent events and governments recognizing cryptocurrencies add to its adoption and acceptance.\n\nCapital Gains Tax – it depends on the country you live in, but generally it is less due to the lack of regulation.\n\nSome supporters view it as Gold 2.0 – as a store of value.\n\nShould you invest in Bitcoin – is it a good investment?\n\nBitcoin liquidity makes it a great investment if you are looking for short-term profits. Cryptocurrencies can also be a good long term investment because of high market demand and speculative nature.\n\nOther reasons why bitcoin is a good investment include:\n\nLow Inflation Risk – Bitcoin is immune to inflation, unlike many of the world's currencies, regulated by governments\n\nLiquidity – Bitcoin is one of the most liquid investment assets due to the number of trading platforms, exchanges and online brokers.\n\nStill early – Many believe cryptocurrencies are still in the very early stages and will continue to evolve and grow.\n\nCons of investing in Bitcoin\n\nHighly volatile – Price is notorious for always fluctuating back and forth. The cryptocurrency market is always changing and you should keep a close eye on the markets if you invest.\n\nProne to online hacking – There have been a couple of cyber attacks on exchanges in recent years. Investors that held their Bitcoin in those exchanges lost their investments. For example, this hack of Singapore headquartered exchange KuCoin that drained $280M from the exchange.\n\nRegulation – The bitcoin market is not regulated and is prone to scams and fraud.\n\nNot widely accepted – Bitcoin is still in early phases and not accepted by many companies as a form of payment.\n\nProne to theft or being lost – Private key can be lost or you hard drive can crash. You can go from a wealthy crypto millionaire to bankrupt in seconds.\n\nHow To Pay For Bitcoin in Singapore\n\nIt might be that the exchange you pick doesn’t accept your preferred payment method. Pick an online crypto broker that accepts your desired payment method.\n\nSingapore residents can purchase bitcoins by using one of the following methods: credit cards, debit cards, wire transfer, e-wallets or with other cryptocurrencies.\n\nBuy Cryptocurrency with a Credit Card\n\nThe easiest way is with a credit card is to use an exchange like Stormgain. Transactions are super fast and you get your bitcoin instantly.\n\nBuying With a Bank Account\n\nMost cryptocurrency exchanges support bank transfers as a form of payment. Payment services such as Xfers and PayNow are supported. Bank transfers are nearly instant and often free.\n\nIf you are using an exchange that is based outside Singapore, you will see an option of wire transfer or SWIFT payment. Wire transfers can take up to a week and are subject to fees. Fees are a lot higher and include currency exchange fees and bank transfer fees.\n\nBuy With Cash In Singapore\n\nYou might want to buy with cash. One of the ways is to find someone and exchange in-person, cash for BTC.\n\nWhile buying with cash might be convenient, it also has the highest fees of any methods we outline.\n\nCrypto ATM Singapore\n\nAnother option is to find a bitcoin ATM near you and simply deposit cash which is converted to Bitcoin. Singapore currently has 10 Bitcoin ATMs.\n\nThis is the list of crypto ATMs in Singapore:\n\nOperator's Name Location Opening Hours Fees Rating Bitcoin Exchange (Singapore) 531 Upper Cross St 03-11,\n\nSingapore 050531\n\n(link) 24/7 SGD 18.00 + 4.5% Good Coinunited.io 226 Upper Thomson Rd,\n\nSingapore 574363\n\n(link) Mon-Sat: 10:00 am – 9:00 pm SGD 10.00 + 9.1% N/A Bitcoin Exchange (Singapore) 1 Rochor Canal Rd,\n\nSingapore 188504\n\n(link) 24/7 SGD 18.00 + 4.5% Good Daenerys Crypto ATM 11 Collyer Quay #02-28,\n\nSingapore 049317\n\n(link) Mon-Fri: 7:00 am – 8:00 pm\n\nSat: 7:00 am – 7:00 pm\n\nSun: Closed N/A Ok Daenerys Crypto ATM 68 Orchard Road #01-59,\n\nSingapore 238839\n\n(link) Mon-Sun: 11:00 am – 7:00 pm N/A Ok Daenerys Crypto ATM 13 Stamford Rd,\n\nSingapore 178905\n\n(link) Mon-Sun: 5:30 am – 12:30 am N/A Ok Cryptonic 304 Orchard Road,\n\nSingapore 238863 (link)\n\nMon-Sun: 11:30 am – 7:00 pm N/A Good Daenerys Crypto ATM 109 North Bridge Rd, Singapore 179097 (link) Mon-Sun: 10:00 am – 10:00 pm N/A Ok Daenerys Crypto ATM 10 Paya Lebar Road,\n\nSingapore 409057 (link) Mon-Sun: 7:00 am – 11:00 pm N/A Ok Daenerys Crypto ATM 11 Collyer Quay #02-28,\n\nSingapore 049317 (link) Mon-Fri: 10:00 am – 6:00 pm\n\nSat-Sun: Closed N/A Ok\n\nBuying with PayPal in Singapore\n\nTo buy with Paypal, you need to use a trading platform like Stormgain which accepts Paypal. Once you create an account, you will need to deposit funds through Paypal and then buy BTC.\n\nOne problem of using Paypal is the risk of chargeback fraud. This is when someone buys with Paypal and then requests a chargeback. In theory they get to keep both their money and bitcoin.\n\nA workaround is to use a peer-to-peer exchange like Paxful or an exchange like Stormgain which accept Paypal. These p2p exchange platforms are great for trading, but not long term holding.\n\nAnother option is to use something like xCoins, which was specifically built to facilitate Paypal to BTC transactions. It is still a little rough around the edges, and doesn’t have the best security track record.\n\nP2P Exchanges (Peer-To-Peer)\n\nAnother option of buying bitcoin is to use a P2P crypto exchange like Binance P2P. This platform enables peer-to-peer buying and selling of cryptocurrencies.\n\nBuy with Another Crypto\n\nThe easiest way to buy BTC with another crypto is on an exchange. Make sure the desired pair is listed on the exchange. To buy with ADA for example, you need to find the pair BTC/ADA. Once you find the desired pair, you can buy by following these steps. Make sure the exchange rate on the pair is fair.\n\nCreate account Deposit the desired cryptocurrency Go to the desired pair Click Buy BTC or Sell ADA Enter the amount you want to buy or sell Create a limit or market order\n\nChoosing a Bitcoin Trading Platform\n\nYou should look for a well regulated trading platform that is safe and secure, has low trading fees, reasonable transaction limits, supports your currency, has great customer support, and reputation.\n\nHow to store your Bitcoin\n\nBitcoins are stored in a wallet, called a digital wallet.\n\nCold Wallets\n\nThe best place to store bitcoin is in a cold wallet, called the digital wallet. Digital wallets are web-based or hardware-based (like a USB stick). You can store bitcoin on a mobile device, desktop computer, hardware wallet and keep it safe with private keys.\n\nHot Wallets\n\nThe other option is a hot wallet. Most exchanges allow you to keep your bitcoins in a hot wallet to stay liquid for easy trading and withdrawals. Hot wallets are not as safe as cold wallets.\n\nHow to Sell Bitcoin in Singapore\n\nTo sell your Bitcoins in Singapore, you can do it on an exchange, in-person or at a local Bitcoin ATM.\n\nMany exchanges offer the trading pair SGD/BTC so you can easily cash out you bitcoins when the time comes.\n\nAnother option of selling your bitcoin is to use a service like LocalBitcoins. This peer-to-peer (P2P) platform allows you to buy and sell bitcoin with a variety of payment methods.\n\nTop Cryptocurrencies by Market Cap\n\nRank Cryptocurrency Price Circulating Supply Max. Supply Market Cap 1 Bitcoin (BTC) $34,114.18 18,741,143 BTC 21,000,000 $648,720,667,162 2 Ethereum (ETH) $2,000.80 116,407,814 ETH Unlimited and\n\n18,000,000/year $236,342,384,881 3 Tether (USDT) $1.00 62,699,736,754 USDT N/A $62,755,733,312 4 Binance Coin (BNB) $300.74 153,432,897 BNB 170,532,785 BNB $47,298,075,068 5 Cardano (ADA) $1.28 31,946,328,269 ADA 45 billion $41,661,873,716 6 Dogecoin (DOGE) $0.2369 130,143,355,580 DOGE N/A $31,324,106,547 7 XRP (XRP) $0.6452 46,244,517,593 XRP 1 billion $30,471,717,468 8 USD Coin (USDC) $1.00 25,293,863,495 USDC N/A $25,303,987,692 9 Polkadot (DOT) $16.30 954,345,815 DOT N/A $15,943,251,422 10 Uniswap (UNI) $18.47 575,202,575 UNI 1.000.000.000 UNI $10,621,963,744"
    }
]