[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvYml0Y29pbi1icmVha3MtMzAwMDAtZm9yLWZpcnN0LXRpbWUtaW4tYS15ZWFyL9IBXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvYml0Y29pbi1icmVha3MtMzAwMDAtZm9yLWZpcnN0LXRpbWUtaW4tYS15ZWFyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Breaks $30K Amid TradFi Push Into Crypto - CoinDesk",
        "content": "\"We’re experiencing a confluence of events that is shaping up to be bullish for Bitcoin and digital assets more generally,\" Mizuhara wrote. \"You now have institutions like BlackRock and Fidelity getting into the space in a significant way, and these moves appear not to have been priced in.\""
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjEvYml0Y29pbi1yYWxsaWVzLXRvLWhpZ2hlc3QtbGV2ZWwtaW4tb3Zlci1hLW1vbnRoLW9uLWV0Zi1uZXdzLmh0bWzSAWVodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNi8yMS9iaXRjb2luLXJhbGxpZXMtdG8taGlnaGVzdC1sZXZlbC1pbi1vdmVyLWEtbW9udGgtb24tZXRmLW5ld3MuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin rallies to touch highest level since April as traders get bullish on ETF news - CNBC",
        "content": "The value of bitcoin exceeded the threshold of $66,895 in October for the first time in history.\n\nBitcoin hit its highest level since April on Wednesday, as traders got excited about the prospects of a spot bitcoin ETF following a series of recent applications from companies including BlackRock .\n\nThe price of the flagship cryptocurrency touched a high of $30,749.45, its highest level since April 14, according to CoinMetrics. At 6:39 p.m. ET, the price was $29,988.46.\n\nInvestors are growing bullish about the prospects of BlackRock and other major institutional names getting involved in digital assets.\n\nThat's despite all the bad news that's been surrounding the crypto space of late, with the market still reeling from the scandal of FTX's collapse and the ensuing regulatory fallout.\n\n\"The slate of spot bitcoin ETF application announcements by larger institutions has definitely brought back bullishness into the crypto markets,\" Vijay Ayyar, head of international markets at CoinDCX, India's largest crypto exchange, told CNBC.\n\n\"We also hit major support at $25K for BTC, and we've seen this move be driven more by pure spot buying rather than a short liquidation type move which is quite healthy,\" Ayyar said."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYS1iaXRjb2luLXJlbmFpc3NhbmNlLWl0cy1ub3QtYWxsLWFib3V0LXRoZS1wcmljZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "A Bitcoin Renaissance: It's Not All About the Price - Nasdaq",
        "content": "To say OG blockchain Bitcoin has proven impervious to assassination attempts would be a stretch, but it’s certainly shown itself to be robust and resilient since Satoshi Nakamoto bequeathed it to the world nearly 15 years ago. Despite numerous attempts to undermine, ban, burn and bury it, it continues to operate as a highly efficient, highly secure settlement network and a beacon of hope for those who've become disillusioned by the traditional financial system.\n\nObsessively tracking the price movements of bitcoin (BTC) has turned into a favorite pastime of many, with detractors delighting in announcing Bitcoin’s demise only to crawl back under a rock when it inevitably rides out the rough spells. But continually sweating the value of one’s stack does a disservice to the slow, steady and unsexy work that continues to go into finessing Bitcoin’s operation. That said, a lot of developments have been happening at the blockchain level in recent months, to the extent that the price of bitcoin, for once, has become almost an afterthought.\n\nEven if the BTC price goes down – and it may well notch its first month of losses in 2023 – it’s possible that Bitcoin may, as a consequence of such developments, cement its status as the preeminent layer-1 chain by claiming its rightful place above a sea of imitators and competitors.\n\nFrom Ordinals to Mintlayer: Bitcoin’s Roaring 2023\n\nThese developments cannot have escaped your attention. Propelled by surging activity on Ordinals, the protocol that belatedly brought NFTs to Bitcoin, Satoshi’s network became the second biggest NFT blockchain in May. A fact made all the more staggering given Bitcoin NFTs didn’t exist prior to January.\n\nNFT sales on Bitcoin blew other blockchains out of the water as users started obsessively inscribing satoshis with data including Jpegs and text. The hype, for once, was real – even if many hardline Bitcoiners view Ordinals and the so-called BRC-20 token standard as a distraction. Indeed, Samson Mow told Cointelegraph that he expects the ‘unsustainable' hype around Ordinals and BRC20 tokens to fade away within a matter of months.\n\nThe success of Ordinals, not to mention subsequent bitcoin NFT support from the likes of Binance, can be set to one side: the blockchain’s 2023 renaissance is about more than just non-fungible tokens. We see it with Babylon, a project that wants to leverage the security of Bitcoin to augment and enhance the security of other chains, specifically those in the Cosmos ecosystem.\n\nEffectively, Babylon boosts the appeal of Bitcoin by functioning as a go-between between chains that need extra security and the gold-standard network. The project has ambitions to eventually get hundreds of chains using its service, since almost all will benefit from an extra layer of security. Just announced by its lead researcher, David Tse of Stanford University, a BTC staking protocol – the first of its kind, that allows BTC holders to participate in staking of other PoS networks. This new mechanism finally lends the famed security of the bitcoin blockchain for other, less secure PoS smart contract blockchain protocols.\n\nAnother project extending Bitcoin’s function and enhancing its reputation is a collaboration between Swiss non-profit ZeroSync Association and infrastructure firm Blockstream. The partners are planning to broadcast Bitcoin zero-knowledge proofs from Blockstream’s satellite, enabling the network’s nodes to sync quickly from anywhere on Earth.\n\nGiven that one weapon of FUD (Fear, Uncertainty, and Doubt) aimed at Bitcoin suggests an internet blackout could destroy it, this seems like a worthwhile endeavor. Favoring ZK-proofs frees nodes from the need to download Bitcoin’s 500GB of data and ensures expeditious syncing rather than a slow, methodical grind. The partnership has earmarked late 2023 for the first experimental broadcast from Blockstream’s satellite network.\n\nThe DeFi boom of a few years back, followed by the arrival of GameFi and NFTs, may have created the impression that Bitcoin was being left behind. Or perhaps left to its devices, the better to focus on its original raison d’etre as a store of value. Yet that impression is changing, and there is a growing sense that the single-function decentralized garden is opening up and coming into bloom. Forget the price of bitcoin for a second; the recent mood music may represent a new ascent of Bitcoin as a chain for all seasons.\n\nCan DeFi live on Bitcoin? It’s a question many have mulled since DeFi Summer began in earnest three years ago. Now that we have Bitcoin-based NFTs, as well as layer-2 solutions like Mintlayer which let users build a DeFi ecosystem rooted in Bitcoin, it’s no longer in the realms of the hypothetical.\n\nAs a Bitcoin sidechain supported by the Lightning Network, Mintlayer dispenses with the need for wrapped tokens or blockchain bridges (as well as their smart contract vulnerabilities), enabling users to directly exchange BTC using atomic swaps. Mintlayer can be used to create DEXs, lending platforms, marketplaces and much else besides, and the project counts Bitcoin Foundation founder Charlie Shrem as an advisor.\n\nAlthough launched in 2020, Mintlayer has found traction this year perhaps as a consequence of last year’s many bridge exploits, not to mention a growing desire among bitcoiners to use BTC directly for DeFi plays. In April, the project announced a $4 million grants initiative to aid the development of Bitcoin-centric DeFi tools and resources.\n\nWhile Mintlayer has grand visions of bringing DeFi to Bitcoin, EVM rollup platform Rollux is leveraging Bitcoin’s unrivaled security to facilitate fast, cheap, and secure transactions at scale. The brainchild of SYS Labs, Rollux’s mainnet is set to launch on June 28 with the goal of bridging the gap “between the existing capabilities of blockchain and the needs of users, developers, and enterprises,” to quote SYS Labs’ CEO Jagdeep Sidhu. It’s yet another example of a project distinct from Bitcoin tapping into its fundamental strengths.\n\nWhat Next?\n\nAt the time of writing, the SEC is cracking down on exchanges with both Coinbase and Binance in its crosshairs. And with regulatory concerns swirling (aren’t they ever?) talk has once again turned to the potential impact on bitcoin’s price. The more things change, the more they stay the same.\n\nAway from price chatter, the picks-and-forks work continues without the same fanfare (or doomsaying) that greets every price swing, and somewhere on the horizon, the fourth Bitcoin halving looms. The ramifications of the halving can be debated another day. For now, let’s raise a glass to the builders and believers, the passionate army quietly but very noticeably powering Bitcoin’s latest renaissance.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2RlZmktcG9zc2libGUtb24tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "DeFi is possible on Bitcoin, but does anybody want it? - Blockworks",
        "content": "DeFi has long been at home on smart contract-capable virtual machine protocols like Ethereum and Solana. Bitcoin has generally been perceived as a tool for storing value, at least until the recent Ordinals craze got people thinking about what it could become.\n\nThe DeFi realm that once existed outside of the Bitcoin domain has been made available through solutions that operate on top of the protocol, with the advantages of security and liquidity built into the Bitcoin network.\n\nRetro-fitting modern scaling mechanisms to the slow-moving “digital gold” blockchain has proven technically challenging. But do people really want DeFi on Bitcoin?\n\nDeFi apps with slick interfaces and robust smart contract options are commonplace elsewhere. But, according to Muneeb Ali, the most popular will inevitably find themselves on Bitcoin.\n\nThe co-creator of Stacks and CEO of Trust Machines spoke to Blockworks on the 0xResearch podcast (Spotify / Apple) about the “Bitcoin thesis” — the long-standing argument among loyalists that says any useful application on another chain will eventually come to Bitcoin.\n\nAnd any app or asset that makes its way to the network will also be more valuable, he says, “because they will benefit from the security of Bitcoin, the durability of Bitcoin, but above all the liquidity of Bitcoin.”\n\nI’m very confident in the ‘yet’\n\nAli says market data previously demonstrated a lack of interest in building for such use-cases on Bitcoin, but that’s changing. “This year, with Ordinals and more recently with BRC-20, part of the thesis is actually coming true.”\n\nThis is “literally the case” with NFTs, he says. Once inscribed on Bitcoin, the market assessed some previously Ethereum-based tokens with hefty prices earlier this year.\n\nTrailing Ethereum alone, “Bitcoin is now number two in terms of trading volumes of NFTs. And Solana is number three,” he says. “Six months ago, this would be unimaginable. Bitcoin was not even on the map.”\n\nIt hasn’t played out in DeFi — yet. “I’m very confident in the ‘yet’,” Ali says.\n\n“Bitcoin is the more pristine capital,” Ali says. More people have bought into the idea of bitcoin as money or as a potential reserve currency, he says.\n\nBut not for much else.\n\nThat’s not the fault of Bitcoin, according to Ali. It’s mostly due to lack of infrastructure — tooling, wallets, and the developer community around Bitcoin — as opposed to a lack of interest, he says.\n\nPeople will use Bitcoin\n\nAli argues there’s plenty of demand for smart contract solutions on Bitcoin. He gives the example of RSK, or Rootstock, a smart contract competitor to Stacks that’s been building on the network for years. “They did their fundraising in Bitcoin and I think 25,000 BTC came into that raise.”\n\nStacks differs from RSK in a few key ways, with its “novel consensus mechanism, ambitious plans for subnets,” and in particular, its “unique BTC bridge” that does not rely on “a trusted set of signers,” according to Blockworks Research.\n\nAli mentions examples of applications like privacy tumblers that have seen large volumes of bitcoin being used, despite them being “really clunky.”\n\n“It’s the best you can do on [layer-1],” he says, “but it’s nothing close to a zero-knowledge-based solution that has great UX” — something that is more likely to be found on Ethereum or Solana. For now, anyway.\n\n“If you start bringing those use cases,” he says, “it’s as obvious as putting two and two together that people will use Bitcoin.”\n\n“The challenge really is in the infrastructure tooling, devs, and UX wallets,” he says. “I think that needs to be much more mature than the state we are in today.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMjEvYml0Y29pbi0zMDAwMC1oaWdoZXN0LXByaWNlLWluLW1vcmUtdGhhbi1hLXllYXItc3BvdC1ldGZzL9IBZGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMjEvYml0Y29pbi0zMDAwMC1oaWdoZXN0LXByaWNlLWluLW1vcmUtdGhhbi1hLXllYXItc3BvdC1ldGZzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin soars past $30,000—notching the highest mark in more than a year—on ETF fever - Fortune",
        "content": "The most dominant cryptocurrency on the market is authoring a dramatic comeback.\n\nAfter a large dip last Thursday, when Bitcoin dropped below $25,000 in response to the U.S. central bank’s hawkish tone during an announced pause on interest rate increases, the cryptocurrency crossed the $30,000 mark on Wednesday.\n\nIn one day, the price of one Bitcoin increased more than 12%, rising from just above $27,000 to almost $30,700, the highest mark in over a year. The cryptocurrency had previously passed the $30,000 threshold in April at about $30,400, which was then the highest peak it had summited since it dropped to almost $16,000 just months earlier.\n\nThe crypto market has echoed the sudden surge, with Ether, the native token for the Ethereum blockchain, up 8.5% to about $1,900. And unsurprisingly, given Bitcoin’s dominance, the total market capitalization for all cryptocurrencies has jumped to approximately $1.17 trillion, a more than 8% increase over the past day. Bitcoin’s price rally is out of step with the broader stock market, as the S&P 500 and the Nasdaq are slightly down in the past 24 hours.\n\nThe surge in Bitcoin’s price follows a rush of recent interest from institutional investors in Bitcoin and the crypto market.\n\n“Investors are starting to see the massive scale of institutional and professional capital that’s going to enter the market over the next few years,” Matt Hougan, chief investment officer at Bitwise Asset Management, told Fortune. “They’re trying to get in early.”\n\nShortly after the Federal Reserve’s announcement last Thursday, BlackRock filed an application for a Bitcoin spot exchange-traded fund that, if approved, would be the first of its kind in the U.S. and expose the cryptocurrency to potentially trillions of dollars from retail investors and pension funds. The price of Bitcoin jumped after the news and stayed steady at around $27,000.\n\nOn Tuesday, further news of institutional investment buoyed the crypto market. EDX Markets, an exchange backed by TradFi titans Citadel, Charles Schwab, and Fidelity, announced its launch. Then two other asset managers joined the ETF application fray, as WisdomTree and Invesco filed separate applications for Bitcoin spot ETFs. “There is a greater recognition in the market that Bitcoin is becoming a mainstream asset class,” Paolo Ardoino, CTO of crypto exchange Bitfinex, told Fortune. “We’re seeing some of the biggest investment funds becoming interested once more in the asset.”\n\nSome analysts, however, are striking a more measured tone.\n\n“It will be interesting to see if this new wave of institutional buying is sustainable,” Michael Safai, managing partner at crypto trading firm Dexterity Capital, told Fortune in an email, “and whether these firms will join their hedge fund peers in looking beyond just the top two or three coins.”\n\nUpdate, June 21, 2023: This article has been updated with a comment from Bitwise and Dexterity Capital."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNi0yMC93aXNkb210cmVlLWZpbGVzLWZvci11cy1zcG90LWJpdGNvaW4tZXRmLW9uLWhlZWxzLW9mLWFwcGxpY2F0aW9uLWJ5LWJsYWNrcm9ja9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Jumps After BlackRock, WisdomTree Spot ETF Filings (BTC) - Bloomberg",
        "content": "BlackRock Inc.’s surprise filing for a US spot Bitcoin exchange-traded fund last week has led to a flurry of similar applications from rival issuers and speculation that the asset manager has key insights that will lead to approval of its application.\n\nBitcoin has jumped more than 20% since the filing to more than $30,000. On Tuesday, Invesco Ltd. renewed its application for the physically-backed Invesco Galaxy Bitcoin ETF within hours of WisdomTree’s filing with the Securities and Exchange Commission for the WisdomTree Bitcoin Trust Bloomberg Terminal . Days earlier, Bitwise submitted plans for a similar vehicle."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjAvYml0Y29pbi1oaXRzLW5ldy1oaWdoLWZvci1qdW5lLWFzLW1vcmUtZmluYW5jaWFsLWluY3VtYmVudHMtc2lnbmFsLWNvbW1pdG1lbnQtdG8tY3J5cHRvLmh0bWzSAYABaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDYvMjAvYml0Y29pbi1oaXRzLW5ldy1oaWdoLWZvci1qdW5lLWFzLW1vcmUtZmluYW5jaWFsLWluY3VtYmVudHMtc2lnbmFsLWNvbW1pdG1lbnQtdG8tY3J5cHRvLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin hits new high for June as more financial incumbents signal commitment to crypto - CNBC",
        "content": "A Bitcoin ATM, the largest cryptocurrency by market cap that operates free of any central control and that relies on a peer-to-peer software and cryptography, on the BitBase stand during the Mobile World Congress 2023 on March 10, 2023, in Barcelona, Spain.\n\nSentiment has been high in crypto since late last week, when BlackRock , the largest asset manager in the world filed an application for what would be the first ever spot bitcoin ETF in the U.S. The application came a week after the Securities and Exchange Commission sued two of the biggest crypto exchanges, Binance and Coinbase. Many have speculated about the timing of BlackRock's move, particularly with Coinbase as its crypto custody partner.\n\nBitcoin rose more than 5% to $28,002.18, its highest level since early May, according to Coin Metrics. Ether added 3.5% to trade at $1,782.99.\n\nThe price of bitcoin climbed on Monday as financial institutions continued to give their bitcoin blessing.\n\nThen Tuesday morning, a new crypto exchange backed by financial giants Charles Schwab, Fidelity Digital Assets and Citadel Securities announced that it has been live for several weeks trading bitcoin and ether.\n\nFidelity has been actively following along with crypto developments since 2014. In more recent years, the firm has opened the Fidelity Digital Assets division, created a commission-free retail investing app called Fidelity Crypto, and began offering 401(k) investors access to cryptocurrencies (an option that needs to be made available by employers).\n\nMany financial incumbents are keen to show enthusiasm for blockchain technology and the ways it can advance old financial infrastructure. Most are quieter, however, about their views on crypto investing.\n\nWith big names like BlackRock and Fidelity putting their crypto commitments on display, investors were optimistic Tuesday that some of the reputational risk of conducting any kind of crypto business – which for some investors has been a mental barrier to buying bitcoin – could start to fade.\n\nBitcoin has struggled to break out of a narrow trading range this quarter but has yet to fall meaningfully under $25,000. Tuesday's big move pushed its monthly gains into the green. It's now up 69% this year."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDYvMjEvYS1zdHJhaWdodGZvcndhcmQtZXhwbGFuYXRpb24tZm9yLXdoeS1maW5hbmNpYWwtZ2lhbnRzLXdhbnQtdG8taXNzdWUtYS1zcG90LWJpdGNvaW4tZXRmL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDYvMjEvYS1zdHJhaWdodGZvcndhcmQtZXhwbGFuYXRpb24tZm9yLXdoeS1maW5hbmNpYWwtZ2lhbnRzLXdhbnQtdG8taXNzdWUtYS1zcG90LWJpdGNvaW4tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "A Straightforward Explanation for Why Financial Giants Want to Issue a Spot Bitcoin ETF - CoinDesk",
        "content": "I, for one, don’t think that BlackRock would apply for this spot bitcoin ETF if it didn’t think that it, arguably the most powerful company on Wall Street, could get the ETF approved. If I had my tinfoil hat on, then maybe there is a secret plot to make bitcoin look completely unappetizing to the world since even BlackRock couldn’t get a spot ETF through. I don’t think this is the case."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTIwL2JpdGNvaW4tcy1ib29zdC1mcm9tLWJsYWNrcm9jay1ldGYtZmlsaW5nLWViYnMtbmVhci0yNy0wMDAtbWFya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC USD) Boost From BlackRock ETF Filing Ebbs Near $27,000 Mark - Bloomberg",
        "content": "Bitcoin climbed beyond $28,000 for the first time this month on the tailwind from BlackRock Inc.’s application to start a US exchange-traded fund.\n\nThe largest digital asset at one point added 5.3% to hit a more than two-week high of $28,142 during New York trading. Smaller coins such as Ether and BNB posted relatively small gyrations."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjAvY3J5cHRvLWV4Y2hhbmdlLWJhY2tlZC1ieS1zY2h3YWItYW5kLWZpZGVsaXR5LWdvZXMtbGl2ZS5odG1s0gFgaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDYvMjAvY3J5cHRvLWV4Y2hhbmdlLWJhY2tlZC1ieS1zY2h3YWItYW5kLWZpZGVsaXR5LWdvZXMtbGl2ZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "EDX crypto exchange goes live offering bitcoin and ether trading, backed by Schwab and Fidelity - CNBC",
        "content": "A crypto exchange backed by financial giants Charles Schwab , Fidelity Digital Assets and Citadel Securities has officially launched trading in four crypto assets, the company said Tuesday.\n\nEDX Markets first announced its launch plans for a \"non-custodial\" exchange in September, about two months before the collapse of FTX. Paradigm, Sequoia Capital and Virtu Financial are among the other early backers.\n\nThe announcement comes days after BlackRock filed an application to launch what would be the first spot bitcoin exchange-traded fund in the U.S., confirmation that despite the crypto industry's black eye from FTX and other bad actors in 2022, and the chill from U.S. regulators this year, long-term institutional interest has not diminished.\n\nThe EDX exchange allows trading of bitcoin , ether , litecoin and bitcoin cash , none of which were named \"crypto asset securities\" in the lawsuits the U.S. Securities and Exchange Commission brought against Binance and Coinbase two weeks ago.\n\nEDX has said it strives to \"meet the needs of the world's largest and most sophisticated financial institutions,\" many of which remain crypto curious but skeptical of centralized crypto services providers, if not because of the failures of many in 2022, then because of the regulatory uncertainty the remaining players now find themselves in.\n\nTo quell any fears about misuse of funds, EDX plans to operate as a \"non-custodial\" exchange, meaning that rather than handling customer assets directly, it will act as a platform on which a network of firms can execute and settle trades between crypto assets and fiat currencies.\n\nEDX also has plans to launch a clearinghouse business this year to facilitate the settlement process but will keep customer assets held at third-party banks and a crypto custodian.\n\nThe company also announced it has closed a second funding round with new investors, including the options-exchange operator Miami International Holdings and affiliates of proprietary trading firms DV Trading, GTS, GSR and Hudson River Trading."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvYml0Y29pbi1ldGhlci1mYWxsLW91dHNpZGUtaG93ZXktdGVzdC1jcml0ZXJpYS_SAV9odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzIxL2JpdGNvaW4tZXRoZXItZmFsbC1vdXRzaWRlLWhvd2V5LXRlc3QtY3JpdGVyaWEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether Fall Outside Howey Test Criteria - CoinDesk",
        "content": "This slight recovery in spot volumes has been accompanied by market depth. Orderbook depth, another critical liquidity metric, has improved since the beginning of May for BTC and ETH (more so for the latter than the former). This recovery is noteworthy because it follows extensive reports of two top crypto liquidity providers curtailing their U.S. trading activity, which would, all else equal, imply a deterioration of order book depth instead of the improvement we have seen.Among non-BTC and non-ETH assets, the market's focus on liquidity is related to the impact on some of the assets mentioned in the SEC charges against Coinbase and Binance. Two weeks since the news broke, trading volumes in the five most prominent assets by market capitalization (SOL, ADA, MATIC, FIL, and ATOM) have not changed significantly. The most notable shift in these assets has been how trading activity seems to have moved from the U.S. to international markets since the beginning of the year, as the chart below shows."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTIxL2JpdGNvaW4taGl0cy1hLXNpeC13ZWVrLWhpZ2gtYXMtZmluYW5jaWFsLXRpdGFucy1zdGVwLXVwLWNyeXB0by1pbml0aWF0aXZlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Hits a Six-Week High as Financial Titans Step Up Crypto Initiatives - Bloomberg",
        "content": "Bitcoin climbed to $30,000 for the first time since April, buoyed by crypto initiatives involving major players from the traditional financial sector.\n\nThe largest digital asset rose as much as 6.5% and traded at $29,927 as of 12:12 p.m. in New York on Wednesday, lifting the token’s rebound this year to around 80%. Smaller coins such as Ether , Cardano and Solana also posted gains."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvYml0Y29pbi1wcmljZS1zcGlrZXMtdG8tMTM4ay1vbi1iaW5hbmNldXMv0gFaaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8yMS9iaXRjb2luLXByaWNlLXNwaWtlcy10by0xMzhrLW9uLWJpbmFuY2V1cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Price Spikes to $138K on Binance.US - CoinDesk",
        "content": "The move was unlikely to have been caused by a trader wanting to pay a nearly 450% premium for bitcoin, which currently exchanges hands for just over $29,000 in European morning hours on Wednesday."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvYmxhY2tyb2NrLXBpdm90LWNvbnRpbnVlcy1hcy1iaXRjb2luLXJpc2VzLW9uLWluY3JlYXNlZC12b2x1bWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "'BlackRock Pivot' Continues, as Bitcoin Rises on Increased Volume - CoinDesk",
        "content": "The upswing follows what will likely rank as two of the most significant events in crypto this year – the Securities and Exchange Commission’s (SEC) lawsuits versus Binance and Coinbase on June 5 and 6, and financial services giant BlackRock’s filing for a spot Bitcoin ETF last week."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjAvYml0Y29pbnMtcmFsbHktdG8tMjhrLWNhdXNlcy10aGUtbGFyZ2VzdC1zaG9ydC1zcXVlZXplLXRoaXMtbW9udGgv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8yMC9iaXRjb2lucy1yYWxseS10by0yOGstY2F1c2VzLXRoZS1sYXJnZXN0LXNob3J0LXNxdWVlemUtdGhpcy1tb250aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin’s Rally to $28K Spurred by Largest Short Squeeze This Month - CoinDesk",
        "content": "“The bitcoin rally certainly is correlated with the news of all these larger traditional financial institutions looking to get serious exposure to the digital asset ecosystem,” Brent Xu, CEO and co-founder of decentralized finance (DeFi) bond market platform Umee. “It’s clear that BlackRock, Fidelity and the others have client bases that want to invest in BTC and other crypto assets by way of ETFs and other more traditional investment vehicles."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vYmxhY2tyb2NrLXNwb3QtYml0Y29pbi1ldGYtY3J5cHRvLXJlYWN0aW9ucy0yMDIzLTbSAVZodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuY29tL2JsYWNrcm9jay1zcG90LWJpdGNvaW4tZXRmLWNyeXB0by1yZWFjdGlvbnMtMjAyMy02P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "BlackRock's application for bitcoin ETF opens firm up to conspiracies - Business Insider",
        "content": "Crypto influencers seized on BlackRock's application to launch a bitcoin exchange-traded fund.\n\nSome said it sends a bullish sign to the wider crypto market; others spread conspiracy theories.\n\nThe attention underscores the relatively new scrutiny BlackRock faces in the mainstream.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThere are exceptional and very ordinary aspects of the application BlackRock filed with the US Securities and Exchange Commission last week to launch a exchange-traded fund that would track the price of bitcoin.\n\nBlackRock is a fund manager. It creates, manages, and distributes funds. It has 1,300 ETFs! This is literally what it does! And investors knew about the partnership BlackRock struck last year with Coinbase, the crypto exchange BlackRock said it would use as a bitcoin custodian on behalf of the iShares Bitcoin Trust if regulators approve it.\n\nThe effort to launch a spot bitcoin ETF, though, is a meaningful development in cryptoland. \"The future of crypto is more BlackRock and less Binance,\" Matt Hougan, chief investment officer of Bitwise Asset Management, tweeted, and Galaxy Digital CEO Michael Novogratz tweeted that BlackRock launching a bitcoin ETF \"would be the best thing that could happen\" to bitcoin.\n\nWall Street's top regulator has so far rejected other, smaller asset managers' applications to launch similar vehicles. The crypto money manager Grayscale even sued the SEC last year after it tossed out Grayscale's application to turn a bitcoin trust into a spot bitcoin ETF.\n\nAdvertisement\n\nAnd a renewed commitment between the world's largest asset manager and Coinbase, which the SEC accused of violating securities laws earlier this month, may give the crypto company a reputational boost. (Coinbase CEO Brian Armstrong said in a tweet on June 6 that \"the complaint filed against us is exclusively focused on what is or is not a security,\" and that \"we are confident in our facts and the law.\")\n\nI've covered BlackRock's path to embracing crypto. Here's part of my inside story with Morgan Chittum from last fall, below, and here's a separate rundown of the BlackRock employees involved in crypto initiatives at the firm.\n\nBut even as crypto enthusiasts found advocates internally, people left. There was a \"line in BlackRock to do the fun work\" of working on digital assets or blockchain research full time, another former employee said.\n\nIt \"looked impossible for BlackRock to do anything\" significant in the space in the near term, the person said. \"That's why I think many of us left.\"\n\nAdvertisement\n\nBlackRock is now working on its partnerships with Coinbase and Circle and focusing on the four parts of its crypto strategy: stablecoins, tokenization, permissioned blockchains, and crypto assets.\n\nBlackRock leadership is highlighting those efforts. While acknowledging the \"steep downturn\" in crypto assets, Fink said on an earnings conference call this summer that the firm was still seeing \"more interest from institutional clients about how to efficiently access these assets.\"\n\nThe price of bitcoin has rallied near its highest level of 2023 in the days since BlackRock filed its application, eclipsing $30,000 on Wednesday. Potential implications for the wider digital assets ecosystem aside, it's worth examining other reactions to the application.\n\nCrypto influencers have seized on BlackRock's new crypto efforts, underscoring the relatively new scrutiny BlackRock faces from the everyday investors and the general public. Enter the outlandish comments about BlackRock's position in the crypto market, another front in the scrutiny around the firm.\n\nAdvertisement\n\n\"So BlackRock, Citadel, Deutsche Bank and NASDAQ have all started to enter the crypto space in the last week. They've bullied out participants so they can scoop up cheap coins. The trajectory for crypto has never been more clear,\" one venture capitalist wrote to his 197,000 followers.\n\nA business podcast host tweeted to his 903,000 followers: \"They're not trying to kill crypto. They're trying to kill the current crypto industry and then hand it over to their cronies. Citadel, BlackRock, Schwab JPMorgan…\" (These tweets refer to Citadel, the hedge fund founded and led by billionaire Ken Griffin. But it is market maker Citadel Securities, also founded by Griffin, that backed a recently launched crypto exchange called EDX.)\n\nA BlackRock spokesperson declined to comment.\n\nOf course, the firm's sheer size has long been the subject of criticism from regulators and officials who take issue with its dominance in the ETF market. But the ESG investing-related scrutiny that ramped up last year has brought a new awareness of BlackRock to the mainstream. That's pushed BlackRock to get ahead of theories and videos that spread widely online; I spoke with Rich Latour, the firm's global head of content and media about that a year ago.\n\nAdvertisement\n\n\"We've certainly done research, and we know that there's a perception that a lot is going on in BlackRock that people don't necessarily understand,\" Latour said last June."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvaW52ZXNjby1yZWFwcGxpZXMtZm9yLWJpdGNvaW4tZXRmLWFkdm9jYXRlcy1mb3ItbW9yZS1jcnlwdG8taW52ZXN0bWVudC1wcm9kdWN0cy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8yMS9pbnZlc2NvLXJlYXBwbGllcy1mb3ItYml0Y29pbi1ldGYtYWR2b2NhdGVzLWZvci1tb3JlLWNyeXB0by1pbnZlc3RtZW50LXByb2R1Y3RzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Invesco Reapplies for Bitcoin ETF, Advocates for More Crypto Investment Products - CoinDesk",
        "content": "“The SEC is very concerned with market manipulation related to Bitcoin prices, and has cited this in almost, if not all, previous rejections,” Graeme Moore, Head of Tokenization, at the Polymesh Association, said earlier to CoinDesk. “This is because the SEC’s view is that Coinbase and others are not regulated as exchanges and therefore cannot be trusted to ‘prevent fraudulent and manipulative acts and practices’.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvYml0Y29pbi1wcmljZS1icmVha291dC1zdWdnZXN0cy1jb250aW51ZWQtcmFsbHktdG8tMzA0ay1hbmFseXN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Trendline Breakout Suggests Continued Rally to $30.4K: Analyst - CoinDesk",
        "content": "The falling trendline breakout in the daily chart indicates that the pullback from the April 14 high of $31,000 has run its course and the broader bullish trend has resumed."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDYvMjEvYml0Y29pbi1wb3BzLXdpc2RvbXRyZWUtaW52ZXNjby1qb2luLWJpdGNvaW4tZXRmLXJ1c2gtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin pops above $30,000 as WisdomTree and Invesco join the bitcoin ETF rush - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin pops above $30,000 as WisdomTree and Invesco join the bitcoin ETF rush: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Zac Townsend of Meanwhile, a life insurer that operates solely in cryptocurrency, weighs in on financial institutions moving forward with crypto projects despite the SEC's recent crackdown on exchanges."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yMC9iaXRjb2luLW1pbmVyLWlyaXMtZW5lcmd5LXJldml2ZXMtaGlnaC1wZXJmb3JtYW5jZS1jb21wdXRpbmctc3RyYXRlZ3ktYW1pZC1ib29taW5nLWludGVyZXN0LWluLWFpL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yMC9iaXRjb2luLW1pbmVyLWlyaXMtZW5lcmd5LXJldml2ZXMtaGlnaC1wZXJmb3JtYW5jZS1jb21wdXRpbmctc3RyYXRlZ3ktYW1pZC1ib29taW5nLWludGVyZXN0LWluLWFpL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Iris Energy Revives High-Performance Computing Strategy Amid Booming Interest in AI - CoinDesk",
        "content": "Given recent developments, \"the time may be right to expand into this sector,\" using either Iris Energy's existing sites or the ones under construction, the company said. The miner has procured items with long lead times to expand to build out another 100 megawatt (MW) facility, which would bring its mining hashrate to 13.6 EH/s if filled with mining rigs, said the press release."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpbmFuY2UtdXMtYml0Y29pbi1mbGFzaC1wdW1w0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Binance.US shows bitcoin 'flash pump' to $138K - Blockworks",
        "content": "The US arm of global crypto exchange Binance is under fire from markets watchdogs left and right. Now, it appears to be struggling with keeping some of its biggest bitcoin (BTC) order books running smooth.\n\nBinance.US displayed the price of bitcoin at more than $138,000 for its tether (USDT) market late Tuesday evening — almost 400% higher than spot prices shown elsewhere.\n\nThe sudden surge was only reported to have lasted for a few seconds, according to TradingView data reviewed by Blockworks.\n\nBinance.US’s website shows 62.22 BTC changed hands during that time, equal to about $1.8 million at current prices.\n\nThe dramatic upwards spike suggests someone market bought that amount in bitcoin with USDT.\n\nIf that’s the case, poor liquidity meant all available sale orders were immediately filled at realistic prices. With only sky-high ‘joke bids’ waiting, the price of bitcoin shot to fresh all-time highs.\n\nBlockworks has reached out to Binance.US for more information.\n\nA rare ‘flash pump’ is shown on Binance.US\n\nSituations like these are normally reflected in the opposite direction, with “flash crashes.” Such an event struck Binance.US in Oct. 2021, when the price of bitcoin collapsed 87% — from $65,000 to $8,200 — before quickly rebounding.\n\nBinance.US blamed that situation on a buggy trading algorithm.\n\nAnd in Dec. 2018, the price of ether tumbled from $100 to $13 on Coinbase Pro, only to return within minutes.\n\nIn any case, Binance.US has been dealing with poor liquidity for some time, amid struggles with its banking partners in light of its regulatory rumbles.\n\nLast month, traders were paying premiums of more than 3% on bitcoin and similar amounts for ether (ETH) compared to rival platforms.\n\nAnalysts similarly suggested that liquidity problems were to blame for the price discrepancies. Those premiums have since closed.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjAvYml0Y29pbi1pcy1iZWNvbWluZy1pbGxpcXVpZC1hdC0xNDdrLWEtbW9udGgtc2lnbmFscy1zdGVhZHktYWNjdW11bGF0aW9uL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjAvYml0Y29pbi1pcy1iZWNvbWluZy1pbGxpcXVpZC1hdC0xNDdrLWEtbW9udGgtc2lnbmFscy1zdGVhZHktYWNjdW11bGF0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Is Becoming Illiquid at 147K a Month in Signal of Steady Accumulation - CoinDesk",
        "content": "Glassnode's illiquid supply change metric, which measures the number of coins held by illiquid wallets on a specific date compared with the same day the previous month, rose to 147,351.58 BTC ($3.9 billion) on Monday, the most since Dec. 19. The total held by illiquid entities has jumped to a record high 15,207,843 BTC, with the tally increasing by 215,000 BTC in the past four weeks alone."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vc2Nod2FiLWJhY2tlZC1jcnlwdG8tZXhjaGFuZ2UtZWR4LWdvZXMtbGl2ZS1hbm5vdW5jZXMtZnVuZGluZy03NTUwMTAy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Schwab and Fidelity-Backed Crypto Exchange EDX Goes Live, Adds More Backers - Investopedia",
        "content": "EDX Markets, a cryptocurrency platform backed by Charles Schwab (SCHW), Fidelity and Ken Griffin's Citadel Securities, launched trading for bitcoin (BTC), ether (ETH), litecoin (LTC), and bitcoin cash (BCH).\n\nKey Takeaways Schwab and Fidelity-backed crypto-platform EDX Markets began trading for bitcoin, ether, litecoin, and bitcoin cash.\n\nEDX is a 'non-custodial' exchange, meaning it does not hold customer crypto and instead uses a third-party custodian.\n\nEDX plans to launch a clearinghouse later this year to help customers settle trades.\n\nEDX also announced new investors that include Miami International Holdings, DV Crypto, GTS, GSR Markets LTD, and HRT Technology.\n\nHow Is The EDX Platform Different?\n\nEDX's platform has avoided the \"crypto asset securities\" targeted in recent lawsuits by the SEC against Binance and Coinbase (COIN). By positioning itself as a \"non-custodial\" exchange, EDX aims to cater to the needs of major financial institutions seeking crypto exposure but harboring reservations about centralized crypto service providers.\n\nA non-custodial platform means it doesn't hold its customers' crypto-tokens and instead, it ensures that customer assets will be held at third-party banks that act as a crypto custodian, removing concerns regarding potential fund misappropriation.\n\nFor example, Coinbase acts as a custodian for their customer's crypto, unless they opt for a self-custody Coinbase wallet. While it's simple to start trading crypto with an exchange that holds your tokens, risks include losing your assets in case the exchange is hacked or lower profits due to custodial fees.\n\nThe exchange operates as a platform connecting a network of firms for executing and settling trades between crypto assets and fiat currencies. However, it does not help settle those trades just yet. EDX hopes to launch a clearinghouse business later this year, that will enable it to carry out settlements.\n\nThe launch of the exchange comes shortly after BlackRock's filing for the first spot bitcoin exchange-traded fund (ETF) in the United States, indicating sustained institutional interest in the long-term crypto market despite recent industry setbacks and regulatory concerns.\n\nEDX has also closed a second funding round, attracting new investors such as Miami International Holdings and affiliates of proprietary trading firms DV Trading, GTS, GSR, and Hudson River Trading.\n\n"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JsYWNrcm9jay1iaXR3aXNlLWJpdGNvaW4tZXRmLWZpbGluZ3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "BlackRock, then Bitwise — How the spot bitcoin ETF filings differ - Blockworks",
        "content": "One day after BlackRock made a splash last week by putting forward a plan to launch a spot bitcoin ETF, crypto-focused asset manager Bitwise re-upped its own similar bid.\n\nThe filings are the latest of their kind in a decade-long saga as the SEC has never allowed a spot bitcoin ETF to hit the US market — despite efforts from the Winklevoss twins, Fidelity and a slew of other would-be issuers.\n\nBut the latest proposed products by BlackRock and Bitwise are a bit different from one another.\n\nBitwise filed for a spot bitcoin ETF in October 2021 — a proposal ultimately rejected by the SEC in June 2022.\n\nThe Friday filing by NYSE Arca — the would-be listing exchange for the Bitwise product — added more legal analysis around the surveillance of bitcoin via the Chicago Mercantile Exchange (CME) futures markets, according to Bryan Armour, director of passive strategies research at Morningstar.\n\n“The timing of the filing seems likely to jump in the queue behind BlackRock should the SEC approve the first spot Bitcoin ETF,” Armour told Blockworks.\n\nBitwise Chief Investment Officer Matt Hougan told Blockworks in April that while a spot bitcoin ETF would be “wonderful” for investors in the long term, the firm would likely wait for more regulatory clarity before pursuing another.\n\nA Bitwise spokesperson on Tuesday confirmed the firm’s bid but declined to comment.\n\nSumit Roy, a senior analyst at ETF.com, said Bitwise’s move is “pretty clearly a direct response to the BlackRock filing.”\n\nBlackRock takes new step\n\n“Bitwise has emphasized in the past the idea that prices for bitcoin futures on the CME lead spot bitcoin prices, and therefore, having a surveillance-sharing agreement with the CME should satisfy the SEC’s requirements,” Roy said. “It did so again in this filing but with even more data to back up its case.”\n\nBoth the Nasdaq and NYSE filings — related to the BlackRock and Bitwise proposals, respectively — cite the SEC’s approval of a bitcoin futures fund by firm Teucrium.\n\nThat ruling noted that the CME “comprehensively surveils futures market conditions and price movements on a real time and ongoing basis in order to detect and prevent price distortions, including price distortions caused by manipulative efforts.”\n\nRead more: SEC ruling on Teucrium’s bitcoin futures ETF could impact spot funds\n\nIn BlackRock’s case, the listing exchange is willing to enter into a surveillance-sharing agreement with “an operator of a US-based spot trading platform for bitcoin,” the document states.\n\nThis would supplement its surveillance-sharing agreement with the CME.\n\n“Is that enough to get this ETF over the finish line?” Roy said. “Ordinarily, I would argue no, especially since the spot trading platform in question — if it’s Coinbase — is being sued by the SEC for operating as an unregistered exchange.\n\n“But because BlackRock is involved, there is hope that they have the inside scoop and will get this done,” he said. “Throw in the impending Grayscale verdict and things are getting pretty complicated.”\n\nA decision in Grayscale Investments’ case against the SEC — launched after the regulator blocked the company’s proposed conversion of its bitcoin trust (GBTC) to an ETF — is expected in the coming months.\n\nRead more: Grayscale win over SEC might not change much, industry watchers say\n\nIn the wake of the BlackRock and Bitwise filings, GBTC is up 30% in the last five days, and up roughly 14% on the day.\n\nIndustry watchers say they expect more to re-join the spot bitcoin ETF race. Though eyes have been on Fidelity — another TradFi giant that previously sought to launch a spot bitcoin ETF — the fund titan has not yet re-filed for such a fund.\n\nA Fidelity spokesperson declined to comment.\n\nArk Invest and 21Shares re-filed for their spot bitcoin ETF in April. Other hopeful issuers such as VanEck, Valkyrie, WisdomTree, Global X and Invesco could do the same, Bloomberg Intelligence analysts said last week.\n\n“There tend to be clusters of filings as issuers take a new approach or see increasing odds of acceptance by the SEC,” Armour said. “It’s critical to be among the initial ETFs on the market, so I would be surprised if more didn’t follow suit.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tZXRmLWludmVzY28td2lzZG9tdHJlZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "'Bitcoin market has matured': WisdomTree, Invesco file for spot ETFs - Blockworks",
        "content": "Investment firms Invesco and WisdomTree are making more attempts to secure approval to launch spot bitcoin exchange-traded funds (ETFs) following initial rejections.\n\nTheir renewed efforts come just days after the world’s largest asset manager BlackRock made its own bid to launch such a fund.\n\nIn its Tuesday filing, Invesco contends that the lack of a spot bitcoin ETF puts US investors at considerable risk, as they may resort to utilizing unreliable digital asset accounts, like many did with FTX, Celsius, BlockFi and Voyager.\n\nAvailability of a spot bitcoin ETP could have resulted in billions of dollars remaining invested in a regulated and well-understood structure, rather than being tied up in proceedings, it added. Invesco, one of the largest ETF issuers in the world, had $1.4 trillion assets under management as of April.\n\nInvesco is pursuing approval to list the “Invesco Galaxy Bitcoin ETF” on the Cboe BZX exchange, while WisdomTree is seeking to list the “WisdomTree Bitcoin Trust” on the same platform.\n\nInvesco previously filed for an ETF in partnership with Galaxy in 2021 but abandoned the endeavor a few months later.\n\nThe new applications come at a time of heightened scrutiny by US regulators regarding potential violations of securities laws within the crypto industry.\n\nWisdomTree confident in maturing bitcoin market\n\nWisdomTree said in its own Tuesday filing that “the bitcoin market has matured such that it is operating at a level of efficiency and scale similar in material respects to established global equity, fixed income and commodity markets.”\n\nWisdomTree had $90.7 billion in assets under management as of April. The SEC turned down WisdomTree’s first spot bitcoin ETF application in Dec. 2021 and rejected its second application in Oct. 2022, as it has done with mountains of bids over the years.\n\nThe SEC has previously dismissed such submissions on grounds that the issuer (in this case Fidelity) had not demonstrated the proposed fund is “designed to prevent fraudulent and manipulative acts” and to “protect investors and the public interest.”\n\nA futures-based bitcoin ETF is already approved in the US, mainly due to their reliance on futures contracts traded on the regulated Chicago Mercantile Exchange.\n\nBut while the approval of those products indicates progress and a growing acceptance of bitcoin-related investment products, each type of ETF is subject to its own set of regulatory considerations.\n\nA futures-based ETF derives its value from futures contracts, while a spot bitcoin ETF directly holds and tracks the price of physical bitcoin in the spot market.\n\nNot just Invesco: Loads more spot bitcoin ETFs filings\n\nBitwise also submitted a filing to offer a spot bitcoin ETF last week. According to Bitwise CEO Matt Hougan, BlackRock’s filing can be seen as the start of the mainstream era for crypto.\n\nIn April, Ark Invest and 21Shares also re-submitted their application for a spot bitcoin ETF.\n\nAnalysts from Bloomberg Intelligence mentioned that other potential issuers like VanEck, Valkyrie, WisdomTree, Global X, and Invesco might follow suit.\n\nSome observers predict that even more players will now jump back into the spot bitcoin ETF race.\n\nMeanwhile, Grayscale Bitcoin Trust (GBTC) persists as the largest BTC exchange-traded product, with 635,236 BTC ($18.4 billion) under management — nearly 3.3% of the circulating supply.\n\nBitcoin locked in GBTC is non-redeemable, as opposed to the recently proposed spot ETFs, which would be fully redeemable. GBTC’s closed-ended structure has led to a steep discount on its shares compared to its net asset value, at times around 50%.\n\nGrayscale’s application to convert GBTC into an ETF was denied last year, for which the DCG-owned firm sued the SEC in response. Still, markets have repaired the GBTC discount somewhat following the recent wave of ETF applications from Wall Street heavyweights, now at 33% compared to 42% at the start of June.\n\nDavid Canellis contributed reporting\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTIxL2JpdGNvaW4tbWluZXJzLXdlbnQtZGFyay1hcy10ZXhhcy1wb3dlci1ncmlkLXRlZXRlcmVkLW9uLWJyaW5r0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Went Dark as Texas Power Grid Teetered on Brink - Bloomberg",
        "content": "Bitcoin miners in Texas curbed operations, crimping power usage, as a heat wave drove electricity prices sky-high Tuesday and threatened to cripple the grid in the second-largest US state.\n\nThe extent of the intentional shutdown and the amount of power conserved for other uses — such as residential air conditioners, medical centers and municipal water systems — was not yet immediately clear. But the curtailments were confirmed by industry participants and grid manager the Electric Reliability Council of Texas, or Ercot."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzIyL2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1ob2xkcy1maXJtLWFib3ZlLTMwMWstYXMtaW52ZXN0b3JzLXJlbGlzaC1ibGFja3JvY2stb3RoZXItc3BvdC1idGMtZXRmLWZpbGluZ3Mv0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjIvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLWhvbGRzLWZpcm0tYWJvdmUtMzAxay1hcy1pbnZlc3RvcnMtcmVsaXNoLWJsYWNrcm9jay1vdGhlci1zcG90LWJ0Yy1ldGYtZmlsaW5ncy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Firm Above $30.1K as Investors Relish BlackRock, Other Spot BTC ETF Filings - CoinDesk",
        "content": "\"The last wave was a lot of retail speculators, and this fits a pattern of how new asset classes develop over time,\" he wrote. \"You have early believers, then more retail people, and then the third wave of more institutions getting into the fold. We’re starting to see the beginnings of the third wave now. And this wave will include the big institutions, but also 401Ks and other major types of funds like pension funds and university endowments.”"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvY2FyZGFuby1ldGhlci1zdXJnZS1hcy1iaXRjb2luLWxlZC1yYWxseS1zZWVzLXNob3J0LXRyYWRlcnMtbG9zZS0xMjVtL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvY2FyZGFuby1ldGhlci1zdXJnZS1hcy1iaXRjb2luLWxlZC1yYWxseS1zZWVzLXNob3J0LXRyYWRlcnMtbG9zZS0xMjVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Cardano, Ether Surge as Bitcoin-Led Rally Sees Short Traders Lose $125M - CoinDesk",
        "content": "“Blackrock’s ETF presents a statement or unique ‘solution’ if you will that makes it different from previous ETF filings,” shared Eitan Katz, CEO of Kima, in a Telegram message. “It includes a surveillance sharing agreement with Nasdaq, which means that Nasdaq will have access to the trading data, including customer IDs –all with the intention to make it significantly more immune to market manipulations by traders.”"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDYvMjEvb3B0aW9ucy1hY3Rpb24tdHJhZGVycy1mbG9jay10by1jb2luYmFzZS1hcy1iaXRjb2luLXJhbGxpZXMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Options Action: Traders flock to Coinbase as Bitcoin rallies - CNBC",
        "content": "In this video\n\nShare Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nOptions Action: Traders flock to Coinbase as Bitcoin rallies\n\nBrian Stutland, Equity Armor Investments, joins CNBC’s Melissa Lee and the Fast Money traders to discuss a jump in Coinbase shares off the back of the bitcoin rally."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWJvdmUtdXMyODAwMC1ldGhlci1nYWlucy_SATtodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWFib3ZlLXVzMjgwMDAtZXRoZXItZ2FpbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin surges above US$28,000 on institutional adoption; Ether gains - Forkast News",
        "content": "Bitcoin surged over 5% in Wednesday morning trading in Asia to breach the US$28,000 resistance level, leading a rally of the top 10 non-stablecoin cryptocurrencies except XRP. Bitcoin’s jump followed the Tuesday evening launch of EDX Markets, a cryptocurrency exchange backed by major Wall Street players such as Citadel Securities, Fidelity and Charles Schwab. Meanwhile, the U.S. equity futures edged lower as investors waited for the Federal Reserve Chair Jerome Powell’s Wednesday testimony to Congress, with economic data on Tuesday pointing to a recovery in the U.S. housing market.\n\nBitcoin leads crypto rally\n\nBitcoin jumped 5.65% over the last 24 hours to US$28,285 at 07:30 a.m. in Hong Kong, moving up 9.36% for the past seven days, according to data from CoinMarketCap. The world’s largest cryptocurrency breached the US$28,000 mark early Wednesday for the first time since May 30.\n\nEther also gained 2.94% to US$1,788 and added 3% for the week. Most top 10 non-stablecoin tokens traded higher in the past 24 hours as Bitcoin spearheaded the rally, with the exception of XRP, which dipped 0.34% over the same period.\n\nEDX Markets, a New Jersey-based crypto exchange, officially launched on Tuesday. Its investors include Fidelity Investment, an asset manager overseeing more than US$4 trillion in assets, and will offer Bitcoin, Bitcoin Cash, Ethereum and Litecoin trading services.\n\nThe launch of EDX Markets echoes BlackRock’s Bitcoin exchange-traded fund filing last week, which indicates institutional interest in cryptocurrencies despite the U.S. Securities and Exchange Commission’s crackdown on the industry.\n\n“The SEC’s probability of approving the Blackrock Bitcoin ETF is high,” said Markus Thielen, head of crypto research at digital asset service platform Matrixport, in an email. “The ETF might be approved by September/October 2023 and will attract US$10 billion within three months and US$20 billion within six months — materially supporting Bitcoin prices.”\n\nAdding to the signals of institutional adoption, German investment bank Deutsche Bank has reportedly applied for a license from German regulators to offer custody services for digital assets including cryptocurrencies, according to Bloomberg on Tuesday.\n\nOn the regulatory front, the U.K.’s Financial Services and Markets Bill, which proposes cryptocurrency regulation in the country, was approved by the Parliament’s upper house on Sunday, signaling that the bill is now in its final stage before being enacted into law.\n\n“[The bill] could essentially recognize cryptocurrencies as a regulated activity and stablecoins as a means of payment,” said investment fund Ark36 Chief Executive Officer Anto Paroian in an email. “If the bill is accepted and put into law, this could propel the cryptocurrency industry as a whole into a more mature and respected position within the global financial landscape while putting Britain on the map as a potential global hub for crypto.”\n\nThe total cryptocurrency market cap rose 3.70% to US$1.11 trillion in the last 24 hours, while crypto trading volume rose 47.78% to US$38.63 billion, according to CoinMarketCap data.\n\nNFT transactions rise across markets\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index rose 1.34% in the 24 hours to 10:00 a.m. in Hong Kong but was still down 1.10% for the week.\n\nNFT transactions on Ethereum dipped 0.81% in the past 24 hours to US$13.84 million, according to CryptoSlam data. Transactions on the Bitcoin, Solana and Polygon blockchains also logged gains for the past 24 hours.\n\nAzuki topped the 24-hour transactions on the Ethereum blockchain, which rose 3.33% to 1.21 million, while Bored Ape Yacht Clubs (BAYC) transactions gained 37.05% to US$1.15 million.\n\n“[The launch of EDX markets and Deutsche Bank applying for digital asset custody service license indicate] the future of crypto is beginning to take shape. This has implications for the NFT markets, though in the short term, not enough to reverse the recent market trends,” said Yehudah Petscher, NFT strategist at Forkast Labs, the parent company of Forkast.News.\n\nThe collaboration between Nike’s Web3 platform .SWOOSH and the online video game Fortnite was unveiled on Tuesday. The partnership introduced “Airphoria”, a Nike-themed game world, into Fortnite, where players can play to earn digital sneakers and outfits as in-game accessories. However, the collaboration did not introduce NFTs to Fortnite as some had expected.\n\n“While many were hopeful that NFTs would arrive in Fortnite directly, there are some NFT tie-ins, as gamers who link their Nike account to their Fortnite account will receive an NFT that provides access to a future .SWOOSH NFT drop, along with an achievement on Nike’s .SWOOSH platform,” said Petscher.\n\n“A secondary market for these digital collectible shoes still isn’t live, but it’s expected to launch at any time, and we’ll get to see how sales compare to other web2 facing mediums like Reddit Avatars,” Petscher added.\n\nYuga Labs, the developer of BAYC, announced on Wednesday that HV-MTL Forge, a game based on the BAYC-related HV-MTL NFT collection, would be launched on June 29, triggering a surge of HV-MTL transactions, which rose 287.07% in the past 24 hours to US$360,129, according to CryptoSlam data.\n\nMeanwhile, in Asia, a group of Rohingya photographers issued an NFT collection “Rohingyatographer” on the Ethereum blockchain on Tuesday. The collection features 50 photographs of Rohingya people’s life to commemorate Refugee Week, which will be open for auction on OpenSea from June 20 to June 27.\n\nU.S. futures flat\n\nU.S. stock futures traded flat to lower as of 11:15 a.m. in Hong Kong. Dow Jones Industrial Average futures and the S&P 500 futures both inched 0.01% lower, while Nasdaq futures dipped 0.03%.\n\nThe three major U.S. stock indexes closed lower on Tuesday as investors wait for the Federal Reserve Chair Jerome Powell’s semi-annual report to the U.S. Congress on Wednesday, which will provide further insights into the Fed’s next move on interest rates.\n\nAlthough the Fed paused the interest rate hikes on June 14, it projects the interest rate to reach 5.6% in 2023, indicating two more rate hikes within the year.\n\nAdding to investors’ caution, the U.S. transportation giant FedEx Corp. provided a worse-than-expected outlook in its fourth quarter report released Tuesday, citing “continued demand weakness,” according to Bloomberg.\n\nOn the economic data front, the U.S. housing starts — which measures new home constructions — reached 1.63 million in May, an increase of over 20% from April, according to the U.S. Census Bureau. The data is well beyond the analysts’ expectation of a 0.1% decrease, according to CNN on Tuesday, and points to strong demand in the U.S. housing market.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006. The Federal Reserve’s next meeting on rates is July 26. The CME FedWatch Tool predicts a 23.1% chance the Fed will keep rates unchanged in July, and a 76.9% chance for another 25-basis-point rate hike, up from 74.4% on Tuesday.\n\n(Updates with NFT and Equities section.)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vcm9tYW5pYS10by1zZWl6ZS1hc3NldHMtaW5jbHVkaW5nLTU2MGstYml0Y29pbi1mcm9tLWFuZHJldy10YXRlLTIwMjMtNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Andrew Tate: Romania Seeks Assets Including $560K Bitcoin in Rape Case - Business Insider",
        "content": "Romania formally charged Andrew Tate on Tuesday, on counts of rape and human trafficking.\n\nOfficials asked to seize 15 properties, 15 luxury cars, 14 watches and bitcoin worth $560,000.\n\nTate has been under house arrest since March.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nRomanian prosecutors asked to seize 15 properties, 15 luxury cars, 14 watches and bitcoin worth $560,000 from Andrew Tate as part of indictment on rape and trafficking charges.\n\nRomania's Directorate for the Investigation of Organized Crime and Terrorism announced Tuesday that Tate had been charged with rape and human trafficking, per a press release.\n\nThe announcement moved forward the case which burst into view in late last year with Tate's arrest. The requested asset seizures are a window into the wealth amassed by Tate, which is a key part of his online person and has loomed large in the criminal case against him.\n\nTate, a social media influencer best known for his misogynistic messaging, was arrested in December and placed in a Romanian jail while officials investigated human-trafficking and sexual assault allegations against him. He has been under house arrest since March.\n\nAdvertisement\n\nThe indictment includes Tate, his brother Tristan Tate, and two associates, all of whom face the same charges. The indictment also names seven victims who were recruited through the \"loverboy method,\" the BBC reported — the method of using promises of love and marriage to manipulate women into sex work. All four maintain their innocence.\n\nReports of charges against the group describe a bleak world in which women made pornography for Tate under duress, with Tate's associates, Georgiana Naghel and Luana Radu, threatening to beat the women if they did not comply. Per Reuters, a 61-page court file said Naghel and Radu took half the money the women made via OnlyFans accounts, and also fined the women if they were late or sniffled on camera.\n\nThe file, made by Romanian prosecutors, also allege these women were transformed \"into slaves,\" and one was raped by Tate twice.\n\nTate's assets that DIICOT has asked to seize includes just over 21 bitcoin, a DIICOT spokesperson confirmed to Insider. That amount of bitcoin is worth around $560,000 as of June 20. The assets could be used to compensate victims if he's convicted, Romanian authorities previously told Insider.\n\nAdvertisement\n\nSome auto-translate software, including Google Translate, erroneously suggested that a much larger amount of Bitcoin worth $384 million had been seized, due to an error in interpreting the original Romanian.\n\nTate's wealth has been part of the investigation since the beginning. He was denied bail by a judge several times between January and March, because he was deemed a flight risk.\n\nThe judge in the case explained his decision to force the Tates to stay in jail, arguing that their wealth meant it was possible they would try and escape.\n\n\"The possibility that the suspects would evade investigation, leave Romania and settle in countries that do not allow extradition given their financial possibilities and public comments to that regard cannot be ignored,\" the judge said, according to Euro News.\n\nAdvertisement\n\nTate's boasting about his money are just some of the public statements he's made that could work against him in court. Over the years he has willingly described his tactics recruiting women, came close to endorsing rape, and said he moved to Romania because \"corruption is far more accessible.\"\n\nWhile he was incarcerated, Tate continued communicating with his fans — most of whom are young boys and men — through his newsletter, complaining of poor conditions, including lice and cockroaches in his cell.\n\nThe BBC reported that the trial is expected to last several years, and a Romanian judge has 60 days to view all the evidence before then.\n\nTate's spokesperson told the BBC: \"We embrace the opportunity it presents to demonstrate their innocence.\""
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzIwL2Nhbi1iaXRjb2luLXJlYWNoLTUtbWlsbGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Can Bitcoin Reach $5 Million? - The Motley Fool",
        "content": "It may sound strange or even silly to ask this now, in the midst of a long and painful crypto winter, but it's still a fair question.\n\nCan Bitcoin ever reach the incredible price of $5 million per coin?\n\nThis is, of course, a question with a long and complex answer. Read on to see my detailed analysis. But the short answer is pretty simple: \"Maybe, but not anytime soon.\"\n\nWhat will it take to raise Bitcoin's price that high?\n\nRight now, Bitcoin prices are hovering around the $27,000 mark. The $5 million price target stands more than 18,000% away.\n\nThat's a long way off.\n\nMoreover, there are about 19.4 million Bitcoin tokens in circulation so far, out of a possible maximum of 21 million. If you multiply $5 million by 19.4 million, you get $97 trillion. By comparison, all the gold in the world is currently worth about $10 trillion. The U.S. gross domestic product reached a record high of $25 trillion last year, as part of a $104 trillion global economy.\n\nThe value of all cash and consumer-grade cash equivalents such as checking and savings accounts adds up to roughly $83 trillion . The only monetary figure that makes $100 trillion look small is the $300 trillion of global debt, including every country's national debt.\n\nIn other words, Bitcoin would need to become the de facto currency of record for a dominant chunk of the global economy. I'm talking about an economic revolution on a worldwide scale, probably involving political unrest and maybe even wars along the way.\n\nWhat stands in the way?\n\nExisting economic forces are putting up an active fight against Bitcoin and other crypto names. Nobody steals this massive lunch on a whim.\n\nThere is nothing wrong with that resistance. Central banks and regulators are responsible for the financial health of every citizen, corporation, and government agency. It makes sense to defend the status quo, even if cryptocurrencies might offer real advantages over gold-based or fiat currencies. At the very least, these economic gatekeepers must manage the transition from one monetary system to another in an orderly fashion. A crypto revolution that triggers economic crises around the world is not a pleasant idea, even for the most bullish cryptocurrency enthusiasts.\n\nOn a more practical level, there is no simple way to drop in Bitcoin as the replacement for every currency on the planet. Keep in mind that not even the most influential currencies, like the dollar or the euro, are legal tender in more than a handful of countries today. Standardizing everyone on a single monetary platform looks impossible.\n\nAnd Bitcoin's blockchain network is not set up to handle a worldwide system of payments and financial transactions. Layer 2 solutions like the Lightning Network can increase transaction processing speed to some degree, and the actual Bitcoin platform is always under active development, but the currency can only handle approximately seven transactions per second right now. That's nowhere near enough to support a worldwide economy with billions of Bitcoin users.\n\nHow long could it take to get there?\n\nSo there is no quick and easy way from $27,000 to $5 million per Bitcoin, but there may be some tricky backroads into that territory.\n\nThe oldest and largest cryptocurrency has gained 29% against the inflation-stricken U.S. dollar over the last year. It rose 180% in three years and has quadrupled since June 2018. Drop back to the summer of 2015, and the gain balloons to 10,500%.\n\nIf Bitcoin maintains its compound average growth rate (CAGR) from the last eight years, it could reach $5 million per coin in another nine years. That's a highly unlikely scenario, though. It is much easier to score enormous annual gains when you're starting from a smaller financial platform and a lower price, like the $248 price tag and $3.5 billion market cap Bitcoin sported in June 2015.\n\nLet's say the CAGR slows down to a (still fairly improbable) 35% instead. At that speed, it would take roughly 18 years to hit $5 million. And if I may remind you, the end of that rainbow is Bitcoin as the only currency on Earth that matters in any practical sense.\n\nThe calculation changes a little bit if you also account for inflation. Bitcoin is largely immune to that effect due to its lifetime cap of 21 million coins, only leaving room for an 8% increase in the token count over the next hundred years or so.\n\nThe dollar is not immune to inflation. Monetary policymakers generally aim for an annual inflation rate of roughly 2%, with the occasional dip or spike. Eighteen years from now, that effect would boost the effective dollar value of Bitcoin by approximately 40%. So if you're looking for a cash value of $5 million in 2041, that amounts to a $3.5 million price tag in 2023 dollars. In other words, Bitcoin could take over just half of the global money supply and reach $5 million per coin -- as long as we are looking at inflation-adjusted dollar values.\n\nTo be fair, Bitcoin could also hit that $5 million mark quickly if America experiences actual hyperinflation in the next decade or two. Fairly recent examples of hyperinflation include Yugoslavia in the 1990s, Zimbabwe in 2016, and the current crisis in Venezuela. Mirroring any of these examples would be enough to make Bitcoin worth $5 million or more -- but you'd also spend millions of hyperinflated dollars on everyday necessities like bread and eggs. Yes, Bitcoin's immunity to inflation is a major selling point for the cryptocurrency, but nobody wants or expects this ultragloomy future. In reality, this is not happening.\n\nBitcoin can go up, but $5 million is an unreasonable goal\n\nSo Bitcoin could perhaps be worth $5 billion per coin, but only if you are ready to wait two decades for an unrealistically optimistic scenario to play out, or adjusting a still-lengthy return period for dollar-based inflation. You're better off setting lower price targets and more modest expectations for Bitcoin, even in the long run.\n\nTo be clear, I expect Bitcoin to gain value over time, serving as a solid hedge against inflation. Just keep an eye out for signs of wider Bitcoin adoption, clearer cryptocurrency regulation, and technical upgrades to the underlying blockchain system. We Fools will keep you posted."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvYml0Y29pbi1jcm9zc2VzLTI5ay1mb3ItZmlyc3QtdGltZS1pbi1vdmVyLWEtbW9udGgv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8yMS9iaXRjb2luLWNyb3NzZXMtMjlrLWZvci1maXJzdC10aW1lLWluLW92ZXItYS1tb250aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Crosses $29K for First Time in Over a Month - CoinDesk",
        "content": "Bitcoin appears to have outperformed the majority of other digital assets following these advancements, gaining over 8% in 24-hours and pushing to a level it has not seen since May 6, 2022."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNjbi5jb20vY29pbmJhc2UtdXMtZ292ZXJtZW50LWJpdGNvaW4tY29uZmlzY2F0ZWQtYnRjLXNhbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "US Government Uses Coinbase to Sell Confiscated Bitcoin Despite SEC Charges Against the Exchange - CCN.com",
        "content": "Key Takeaways\n\nSEC used Coinbase to sell seized cryptocurrency worth millions of Dollars\n\nSEC files a lawsuit against Coinbase for operating illegally as an unregistered trader\n\nCoinbase’s IPO was approved by the SEC in 2021\n\nCoinbase CEO Brian Armstrong holds a strong stance in favor of legal crypto trading\n\nThe US Securities and Exchange Commission has filed a lawsuit against Coinbase, a major crypto trading platform, claiming an unregistered trader while listing registered securities, weeks after the second anniversary of Coinbase’s IPO being accepted by the SEC. Just two months prior, the US government used Coinbase to sell seized cryptocurrency tokens.\n\nSEC Vs Coinbase\n\nThe US Securities and Exchange Commission, chaired by Gary Gensler filed a lawsuit against Coinbase, pivoting their case on what is considered a security and what is not. SEC’s case against Coinbase states that the crypto trader is operating unlawfully while trading in registered securities. This raises a legal paradox as the SEC, back in 2021, had approved the crypto trader’s IPO (COIN). Now, two years later, the SEC attempts to flag the trading platform as unlawful while it struggles to define whether cryptocurrencies are considered securities.\n\nIn a tweet by Coinbase CEO Brian Armstrong, he addresses the lawsuit by mentioning that “The SEC reviewed our business and allowed us to become a public company in 2021.” He also added that “The SEC and CFTC have made conflicting statements, and don’t even agree on what is a security and what is a commodity.”\n\nRegarding the SEC complaint against us today, we’re proud to represent the industry in court to finally get some clarity around crypto rules. Remember:\n\n1. The SEC reviewed our business and allowed us to become a public company in 2021.\n\n2. There is no path to “come in and… — Brian Armstrong 🛡️ (@brian_armstrong) June 6, 2023\n\nA Friend In Need\n\nAdding to the mystery of the case is the fact that the US government had actually used Coinbase as a platform to sell off cryptocurrency tokens it had seized during a bust. The sale of sold 9,861.17 Bitcoin (BTC) took place on March 14th, 2023, and amounted to $216 million. These tokens were part of 50,000 bitcoins that were seized in what is known as the Silk Road bust. Silk Road was a black market that facilitated the sale of illegal substances over the internet using Bitcoin.\n\nThe listing, at the time, struck fear in the hearts of many crypto investors as they saw it as an omen that might lead to a drop in the value of Bitcoin. However, Bitcoin maintained its value and continued to rise. The government, in its filing, also mentioned that the remainder of the seized Bitcoin will be liquidated over time through public listings.\n\nConsidering that the US government has already utilized Coinbase as a trustworthy platform to sell cryptocurrencies for profit, it poses a dilemma when it comes to identifying the crypto trader as an illegal operator, questioning its own course of action.\n\nFriendly Fire\n\nSEC’s motion to sue Coinbase has not been popular among other governmental entities, unlike the case with Binance’s lawsuits. In the SEC vs Binance case, there has been no governmental pushback against addressing the alleged issue of commingling customer funds and defrauding US regulators. However, when it comes to Coinbase’s case, members of the US Congress have expressed their dismay at the SEC’s decision to sue Coinbase, claiming an unregistered trader 2 years after approving their IPO themselves.\n\nUS Senator Bill Hagerty tweeted “The SEC is weaponizing their role to kill an industry. Allowing a company to list publicly and then stonewalling their attempts to register is indefensible.”\n\nThe @SECGov is weaponizing their role to kill an industry. Allowing a company to list publicly and then stonewalling their attempts to register is indefensible. @GaryGensler , expect to hear from Congress.https://t.co/GdprSW1Yns — Senator Bill Hagerty (@SenatorHagerty) June 6, 2023\n\nIn a tweet by US Senator Cynthia Lummis, she stated that “The SEC has failed to provide a path for digital asset exchanges to register, and even worse has failed to provide adequate legal guidance on what differentiates a security from a commodity”.\n\nMy statement on the SEC suing Coinbase, inc. https://t.co/5KNEM0IPSV pic.twitter.com/EgRIxrIcjj — Senator Cynthia Lummis (@SenLummis) June 6, 2023\n\nCoinbase CEO Armstrong chooses to separate his company’s case from other battles SEC wages against crypto trading platforms such as Binance by stating that “the Coinbase suit is very different from others out there – the complaint filed against us is exclusively focused on what is or is not a security. And we are confident in our facts and the law.”"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMjEvYml0Y29pbi1jdXN0b2R5LWZpcm0tY2FzYS1yb2xscy1vdXQtZXRoZXJldW0tc3VwcG9ydC_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzIxL2JpdGNvaW4tY3VzdG9keS1maXJtLWNhc2Etcm9sbHMtb3V0LWV0aGVyZXVtLXN1cHBvcnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Custody Firm Casa Rolls out Ethereum Support - CoinDesk",
        "content": "“We've seen all the problems that come from using centralized custodians,” Neuman said. “We've seen how important it is to get the average person holding their own keys. We're just providing the software to make it easier to use those keys.”"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvYml0Y29pbi1taWFtaS0yMDIzLXNoaXRjb2lucy1mb3ItYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin 2023 in Miami comes to grips with 'shitcoins on Bitcoin' - Cointelegraph",
        "content": "Among the more memorable displays at Bitcoin 2023 is a real-life toilet with the logos of various non-Bitcoin cryptocurrencies. It’s an ad for a booth selling “buttwipes” that are “moistened with the tears of no-coiners.” The marketing message is clear: Bitcoin is the real thing — everything else is a shitcoin that belongs in the toilet.\n\nBut only a few steps away is another booth selling trading solutions for BRC-20 tokens, which some have labeled shitcoins for Bitcoin. Across the walkway are more booths slinging NFT minting software — also on Bitcoin. The conference even hosts a Bitcoin NFT art gallery.\n\nAs Miami hosts the largest Bitcoin conference for the third year in a row in May, the air feels markedly different. Though there are only 15,000 attendees compared to last year’s 35,000, the atmosphere has an energy and freshness that’s a world away from the gloom and bear-market blues that one might expect after the massive drops from the 2021 highs.\n\nBitcoin is the real thing — everything else belongs in the toilet (Elias Ahonen)\n\nWhat’s changed this year is the ordinal renaissance, brought on by the recent reality of not only NFTs but tokens being issued on the Bitcoin blockchain. There are certainly haters — with some calling for a fork to undo the Taproot updates that made “spam” possible on the chain.\n\nBut despite the Bitcoin community’s traditional hatred for NFTs, tokens and DeFi, however, things are surprisingly quiet. Despite the blowback online, almost no one Magazine encounters at Bitcoin 2023 has anything particularly bad to say about Ordinals — and some did not even realize they are related to Bitcoin.\n\nAmong old-school Bitcoiners — in circles where the cryptocurrency that starts with “E” can barely be mentioned without drawing comments of derision regarding “monkey pictures” and scam coins — the Ordinal NFT phenomenon is decisively met with a quiet acceptance or shrug. Most old-timers aren’t interested but appear to accept that this is what the “young people” want today — that Bitcoin needs to change with the times.\n\nAre Bitcoiners quietly accepting a new era where the network takes on a radically new role in the Web3 ecosystem, or is this the calm before the Bitcoin purist storm?\n\nBitcoin Ordinals: A new era\n\nWith the exception of the Lightning Network, which made fast and cheap Bitcoin payments possible so as to make mass payment feasible, the Bitcoin ecosystem has been relatively unchanging over the years from an outside perspective.\n\nMining, halvings every four years, the 21 million supply, hardware storage — beyond these core concepts, Bitcoin has lacked a certain dynamism that has placed it largely outside of the more colorful Web3 space of competing protocols, smart contracts, ICOs, NFTs, DAOs, stablecoins and myriad different tokens.\n\nIndeed, the Bitcoin community has so ardently held on to its core tenets — rejecting new iterations, interpretations and innovations — that it is unironically considered by some as a religion, and semi-ironically as such by multitudes more.\n\nBut is a reformation — or even renaissance — in the works?\n\nAuthor Elias Ahonen at Bitcoin 2023 (Elias Ahonen)\n\nA stroll through Bitcoin 2023 — the world’s largest Bitcoin conference held in May in Miami — suggests so. This is because in addition to the yearly fare of booths related to mining, physical art, exchanges, wallet solutions and various hardware, a new entrant is out in force: NFTs.\n\nWell, no — not NFTs. Bitcoiners call them “Ordinals.”\n\nThe word “ordinal” simply means a number used to put things in order: 5th, 6th, 7th, etc. Due to the November 2021 Taproot Bitcoin upgrade, individual satoshis, the smallest unit of Bitcoin, can now be individually numbered and thus made permanently identifiable.\n\nUniquely numbered satoshis — Ordinals — are nonfungible, meaning that they can no longer be substituted for another. Being (1) nonfungible and (2) tokens, they are NFTs by definition.\n\nIn Miami, perhaps the most visible landmark to this new phenomenon is Ordinal Alley, “the very first art gallery dedicated to Ordinal inscriptions” where various Bitcoin NFTs can be viewed.\n\nSubhan Syed, co-founder of YourFund Coin, tells Magazine that “Ordinal art — whether a JPEG or MP3 — may seem irrelevant today, but as time goes on, collectors will look towards unique pieces that have truly been immortalized on the blockchain.”\n\nThe system is new and experimental, with Syed explaining that “the way inscription works today might be completely different a few years from now,” adding that it’s feasible that one day, there might not be enough satoshis to fill everyone’s inscribing needs.\n\n“We might need a more robust solution in the long term that does not carry a load on the blockchain timestamp.”\n\nNFTs and shitcoins — Now on BTC\n\nIn March 2023, an anonymous developer named “domo” introduced the BRC-20 system, which uses Ordinals to enable users to mint and transfer tokens on Bitcoin, in a simplistic take on Ethereum’s ERC-20 standard.\n\nThere were plenty of merchants at Bitcoin 2023 (Elias Ahonen)\n\nAccording to BRC-20.io, at one point, the market cap exceeded $1 billion, although after the initial hype died down, the 187 tracked tokens fell to half a billion, and in the midst of the SEC-derived bear market, they’re worth around $132 million with a daily volume around $47 million (although the site is offline at the time of writing).\n\nWhile the conference has several booths related to Ordinals — mainly services for minting or “inscribing” them — few openly promote BRC-20 tokens beyond offering functionality to hold or trade them. While Ordinal NFT images appear to have become accepted by the mainstream Bitcoin community, it appears that BRC-20 tokens — viewed by many as shitcoins on Bitcoin — have not yet received quite the same level of acceptance.\n\nIt will be interesting to see how this changes next year when the conference moves to Nashville.\n\nWizards vs. laser-eyes\n\nAt a talk titled “The Great Ordinal Debate,” Bitcoin experts Udi Wertheimer and Eric Wall appeared in Taproot Wizard costumes as they made a dancing entrance. The Ordinals project celebrates the Magic Internet Money meme from the early Bitcoin days and welcomes the return of innovations being built on top of the protocol.\n\nThe Magic Internet Money meme\n\nCertain Bitcoin maximalists hate them and the “spam” of Ordinals, believing it undermines the true purpose of Bitcoin.\n\nWertheimer reported that “friends reached out and implored me to reconsider going to Bitcoin Miami, due to many public violent threats” from “laser eye podcasters” who believe NFTs have no place in the Bitcoin community.\n\nThe rift that Ordinals has caused in the Bitcoin community may well be summed as a conflict between the wizards and the laser-eyes — the former representing the experimental and fun-loving early ethos of Bitcoin, while the latter conveys intensity, seriousness and an unyielding focus on their vision for the greatest form of money known to man.\n\nEric Wall is a professional crypto investor (Twitter)\n\nAfter the conference, I connect with Logan Golema, who is firmly on the wizard side and has deployed a BRC-20 token for his project Galaxer, which is building a “space-based AR capture-the-flag” game to work on Apple’s Vision Pro artificial reality goggles.\n\nBelieving that Bitcoin and its Ordinals will exist “for eons” into humanity’s future, he argues that “Ordinals — whether art or money — will be important much further into the future than the deployer today may intend.”\n\nIf you could take the DeLorean back in time to buy cheap Bitcoin — or prevent the Taproot upgrade — would you? (Elias Ahonen)\n\nWhile some in the laser-eyes camp have raised the possibility of a fork to roll back the Taproot upgrade that enables Ordinals, Golema thinks it’s unlikely. Recalling the block-size wars that were a key driver in the Bitcoin Cash fork led by “Bitcoin Jesus” Roger Ver, Golema explains that while disagreement certainly exists, “it would take a lot for a chain fork to happen” again.\n\nAlthough various ways to remove what some core developers consider “spam” have been discussed, Golema believes the innovations will be broadly accepted and integrated — even if only begrudgingly because doing away with them may bring even more trouble.\n\nBut Ordinals come with benefits, too, says Golema, helping to ensure Bitcoin’s transaction fees can sustain the network after the block reward halves away to nothing in the future.\n\n“We’ve seen for one of the first times that the fee reward was bigger than the block reward — that’s very important for the future of Bitcoin’s security.”\n\nFor Bitcoin miners, the new age means more BTC coming into their collective coffers because the minting, deploying and transfer of Ordinals and Bitcoin-based tokens all require paying miners fees. This could help solve the issue of what happens when there’s no more BTC left to mine. “Direct mining rewards will end in the year 2140, so fees will be all that’s left to incentivize miners,” Golema notes.\n\nSimilar benefits may exist for BTC hodlers — the long-term Bitcoin faithful. It is easy to imagine that as Bitcoin gains Ethereum-like capabilities, it will gain market share in NFTs and tokens, which will translate to demand not only in absolute terms but relative to competitors.\n\nPerhaps by bringing NFTs and tokens to Bitcoin, the wizards can even prevent the flippening, the potential ascent of Etereum to the top market cap position, which until now has been theorized to happen one day as a result of Bitcoin falling behind technologically while Ethereum innovates.\n\nMajor crypto assets by percentage of total market cap. (CMC)\n\nBitcoin dominance is a metric that shows the relative values of various cryptocurrencies and is followed by many Bitcoiners. Starting the year at 40%, BTC has climbed to 48.1% of the market as of writing. Can JPEGs push Bitcoin back into the 60% range and herald a new bull market?\n\nThe Ordinals wizards\n\nSome Bitcoiners are starting to rationalize Ordinals into their worldviews.\n\nAccording to Aravind Sathyanandham, chief strategy officer at Bitcoin DeFi platform Velar, the Ordinals community is markedly different from the primarily Ethereum “ape” community, which has a bad reputation among the Bitcoin crowd.\n\n“These are Bitcoin guys — these are people who had to figure out how to run an entire node to ‘inscribe’ stuff on Bitcoin, the mother chain.”\n\nHe is referring to a kind of do-it-yourself hardiness — a rugged individualism emblematic of the money and tech conservatism of older stereotypical Bitcoiners as opposed to the also -stereotypical imagining of a more communal, liberal and younger Ethereum community.\n\n\n\nFrom this Bitcoiner perspective, Ethereum is viewed as little more than a sandbox for children, while Bitcoin is eternal. Ethereum, Sathyanandham says, is a “great experiment for NFTs and DeFi to take their first form,” and now it’s Bitcoin’s turn.\n\n\n\n“These Bitcoin wizards understood early on that the block space on Bitcoin is prime real estate — it’s forever immutable and censorship-resistant data,” he adds, not forgetting to add that Ethereum is “semi-centralized.”\n\nElias was invited to sign the Bitcoin Car, first auctioned for 1,000 BTC in 2013 (Elias Ahonen)\n\nThe phenomenon also appears to be growing the Bitcoin user base.\n\n“Ordinals have on-boarded so many individuals onto Bitcoin — new Bitcoin wallets like Hiro and Xverse that are akin to MetaMask have made it simple,” Sathyanandham explains, referring to the wider ecosystem being built entirely for Ordinals that mirrors Ethereum’s in many ways. He notes that “the Ethereum NFT community’s bleeding into the Bitcoin community is very evident on Crypto Twitter.”\n\nWhile Syed agrees with Ordinalist exceptionalism, he sees them more as technologists than strict Bitcoiners. “I’ve seen that BRC-20 and Ordinals early adopters are individuals who are slightly more tech-savvy digital collectible fans — it’s not like some virtual flood gates opened up to bring in loads of Bitcoin maxis,” he observes.\n\nSyed notes that “currently it’s the same people who collect ETH, Solana or BNB digital collectibles jumping in early. Early adopters always win and the bottom line is: We are all early.”\n\n“When the next bull run comes, perhaps correlated with the BTC halving, we might see everyone rush over the BRC-20 and Ordinal narrative.”\n\nIt certainly feels like magic internet money once again."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1yYWxsaWVzLWFzLXRyYWRmaS1wbGF5ZXJzLWp1bXAtaW50by1jcnlwdG8v0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8yMS9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLXJhbGxpZXMtYXMtdHJhZGZpLXBsYXllcnMtanVtcC1pbnRvLWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Rallies as TradFi Players Jump Into Crypto - CoinDesk",
        "content": "Investment management company Invesco, which has $1.4 trillion assets under management, reapplied for a spot bitcoin ETF. In 2021, Invesco first filed for a bitcoin ETF in conjunction with Galaxy Digital. It also filed for a bitcoin futures ETF, but dropped the effort in October 2021 after a futures ETF by ProShares was approved and began trading first. In its filing, Invesco argued that the lack of a spot bitcoin ETF pushes investors toward riskier alternatives, as seen in insolvencies like FTX, Celsius Network, BlockFi and Voyager Digital Holdings. Invesco also emphasized the need for investor protection, saying that approval for such a spot bitcoin ETF hinges on a surveillance sharing agreement with a significant, regulated market, not on the regulation of the spot bitcoin market itself."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vd3d3LmNjbi5jb20vdG9wLTEwLWJpZ2dlc3QtYml0Y29pbi1ob2xkZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Top 10 Biggest Holders of Bitcoin and the Billions they are Worth - CCN.com",
        "content": "Key Takeaways\n\nLaunched in 2009, Bitcoin is the first and remains the most successful blockchain-based cryptocurrency globally.\n\nThe creator of Bitcoin under the alias Satoshi Nakamoto is thought to be the largest Bitcoin holder.\n\nThe Winklevoss twins, institutional investors like MicroStrategy, and governments like the United States and China are just a few examples of other well-known Bitcoin millionaires.\n\nAs of June 6, 2023, Bitcoin (BTC) had a market capitalization of $498,85 billion, making it the largest cryptocurrency but who are the biggest Bitcoin holders and how much are they worth – was always interesting to the public.\n\nAt the height of the crypto boom in April 2021, there were more than 1.3 million active BTC-holding addresses, up from around 1,000 in July 2010. By 14 March 2023, there were more than one million BTC holders. However, it’s not only individuals who are hoarding Bitcoin for their private reserves.\n\nFor a long time, the notion that publicly traded firms would purchase Bitcoin for their reserves was ridiculed. The most popular cryptocurrency was viewed as being too unstable and fringe for any major firm to use.\n\nThe purchase of Bitcoin over the past two years by a number of significant institutional investors has effectively ended that taboo.\n\nSince 2009, Bitcoin’s meteoric rise has produced a surprise and diverse group of millionaires (and billionaires). Who, however, are the biggest Bitcoin holders? Since wallet addresses are anonymous in the sense that they are not linked to the name of the account owner, it is difficult to say with certainty who has the most Bitcoin. The only way to know is if the owner has made their assets known.\n\nIndividuals With the Largest Bitcoin Holdings (in no particular order):\n\nWinklevoss twins\n\nCameron and Tyler Winklevoss, also known as the Winklevoss twins, co-founded Gemini, a cryptocurrency exchange back in 2014. The exchange currently handles roughly $40 million in trades each day.\n\nTyler, who works as Gemini’s CEO, and Cameron, who works as its president, are famous for claiming that Mark Zuckerberg had stolen their concept for a social network.\n\nThey started hoarding Bitcoin using a portion of the $65 million court settlement they had with the Facebook CEO. Back in 2013, the twins stated that they had purchased 1% of the whole Bitcoin supply. The failure of the FTX cryptocurrency exchange in November 2022, however, caused the Winklevoss twins to lose more than 60% of their Bitcoin wealth.\n\nMichael Saylor\n\nMichael Saylor is the founder of business analytics software company MicroStrategy, and has served as its CEO until early August 2022 before becoming its chairman. Saylor, one of the most well-known Internet bubble executives, became a multibillionaire in the late 1990s as a result of his ownership of MicroStrategy. The SEC then filed accounting allegations against Saylor’s company, and fined it with $11 million in penalties. The company’s stock value crashed as a result of reissuing the accurate financial data, and Saylor’s net worth decreased by $6 billion.\n\n\n\nSaylor is a huge Bitcoin advocate calling it “a bank in cyberspace, run by incorruptible software, offering a global, affordable, simple, & secure savings account to billions of people that don’t have the option or desire to run their own hedge fund.” Recently he has become one of the few Bitcoin maximalists to publicly embrace Ordinals. Both, Saylor and MicroStrategy are huge Bitcoin investors.\n\nSatoshi Nakamoto\n\nSatoshi Nakamoto is the name of the person or organization who was credited with creating Bitcoin. The whole creator’s history is obscured by mystery as his identity has never been made public. However, information on a profile with The P2P Foundation indicates that they turned 48 on April 5.\n\n\n\nBefore the first Bitcoin was mined, Satoshi Nakamoto posted a white paper titled “Bitcoin: A Peer-to-Peer Electronic Cash System” to a cryptography mailing group. The article, which was released on October 31, 2008, described a decentralized peer-to-peer protocol that was secure in terms of cryptography. Satoshi Nakamoto, referred to Bitcoin as a “purely peer-to-peer version of electronic cash” that “would allow online payments to be sent directly from one party to another without going through a financial institution or any intermediary.” He is said to be the largest individual Bitcoin holder and was purportedly the first miner of the currency.\n\nTim Draper\n\nAmerican venture capitalist and founder of many companies under his name, Timothy Cook Draper, is known as a huge Bitcoin proponent. His most well-known investments are in FinTech firms like Twitter, DocuSign, Coinbase, Robinhood, Tesla, Hotmail, Skype, etc. He paid $18.7 million, or approximately $632 per coin, in 2014 to purchase 29,656 Bitcoins that U.S. Marshals had seized from the shuttered Silk Road black market. Draper supports decentralization and is against Government control.\n\n\n\nPublicly Traded Companies With the Largest Bitcoin Holdings (in no particular order):\n\nTesla (TSLA)\n\nAmerican multinational automotive and clean energy company Tesla , headed by multibillionaire Elon Musk, bought its first batch of Bitcoin back in February 2021. The company explained it bought the Bitcoin for “more flexibility to further diversify and maximize returns on cash.”\n\n\n\nAfterward, Tesla started accepting payments in Bitcoin in exchange for its products, becoming the first major automaker to do so. Nowadays, Tesla is investing in other cryptocurrencies as well, including Dogecoin.\n\nMicroStrategy (MSTR)\n\nIn August 2020, MicroStrategy purchased its first batch of Bitcoin, citing concerns that the epidemic, global financial stimulus programs, and political unpredictability would cause the U.S. currency to depreciate. In a statement , CEO Michael Saylor then said, “This investment reflects our belief that Bitcoin, as the world’s most popular cryptocurrency, is a dependable store of value and an attractive investment asset with more long-term appreciation potential than holding cash.”\n\n\n\nHut 8 Mining Corp (HUT)\n\nAn infrastructure firm for mining digital assets, Hut 8 Mining Corp (HUT) is situated in North America. The business runs cloud and colocation data center facilities in Canada and caters to business clients looking for computing services. Hut 8 Mining announced in February 2023 that it would join forces with US Bitcoin to become Hut 8 Corp., also known as “New Hut.” Following the acquisition, six facilities totaling about 825 megawatts will purportedly be available to the New Hut company for use in crypto mining and other operations. One of the biggest Bitcoin holders will have a self-mining capability of 5.6 exahashes per second (EH/s), and, therefore, encompass five sites in the Canadian provinces of Alberta, New York, and Texas.\n\n\n\nPrivate Companies With the Largest Bitcoin Holdings (in no particular order):\n\nBlock.one\n\nBlock.one is a software company that focuses on high-performance blockchain solutions. Following its launch in May 2017, its flagship project, EOSIO, an open-source blockchain technology created to facilitate secure data transfer and high-performance decentralized apps, has gained acclaim as the first effective blockchain platform for developers.\n\n\n\nIn 2018, Block.one carried out an ICO for EOS, its native cryptocurrency token, and raised a record of $4 billion.\n\nThe Tezos Foundation\n\nThe Tezos Foundation is a nonprofit organization that supports the growth and promotion of the Tezos (XTZ) blockchain network. It was established in 2018. The foundation, among other things, is in charge of managing and allocating the money acquired during the ICO to help the Tezos ecosystem continue to grow and be sustainable.\n\n\n\nIts CFO, Roman Schnider is a huge Bitcoin proponent and considers Bitcoin to be a “key store of value.”\n\nTether Holdings\n\nTether Holdings has a tight connection to the development and administration of the Tether (USDT) stablecoin. Tether Holdings conducts business by creating and administering Tether tokens that are based on several blockchain technologies, including Bitcoin, Ethereum, and others. One U.S. dollar is supposed to be represented by each Tether token.\n\n\n\nCountries With the Largest Bitcoin Holdings (in no particular order):\n\nUkraine\n\nThe amount of Bitcoin managed by the Ukrainian government has been collected mostly from donations from individuals and companies. The nation has benefited greatly from financial assistance in the form of cryptocurrencies throughout the conflict with Russia that began last year. Ukraine was quite open to the blockchain industry even before the war, establishing helpful crypto rules and making it simpler for crypto companies to conduct business there and, therefore is one of the biggest Bitcoin holders among countries.\n\n\n\nThe United States\n\nThe United States is the largest holder of Bitcoin among countries. Most of its Bitcoin holdings was seized in three cases – Silk Road, Bitfinex, and the seizure of James Zhong’s BTC. Bitcoin has been seized by numerous government organizations throughout the years. For the whole Bitcoin ecosystem, the lack of traceability for the government’s cache of bitcoins has major ramifications because it makes it challenging to determine and establish ownership of the cryptocurrency, which is predicated on principles of transparency.\n\n\n\nEl Salvador\n\nMost people are probably most familiar with El Salvador as a Bitcoin-owning nation. The nation of Central America, however, went above and above by adopting Bitcoin as legal cash in 2021, making it the first nation in the world to do so.\n\nWho Is the Biggest Bitcoin Holder?\n\nSatoshi Nakamoto – 1 million BTC\n\nBy being the first miner to produce blocks of transactions, Satoshi Nakamoto not only invented but also launched Bitcoin. On January 3rd 2009, Satoshi is thought to have mined over 22,000 blocks and earned a total of over one million Bitcoin in block rewards. As a result, Satoshi is thought to be the owner of the largest Bitcoin cache , which currently stands at more than 1 million BTC, or almost $23 billion making him one of the biggest Bitcoin holders. This Bitcoin is dispersed among 22,000 addresses rather than being kept in a single address. With the exception of a few test transactions, none of it was ever used. Since his departure from the project in 2010, Satoshi has gone silent.\n\nHowever, a year ago, over 100 BTC were moved from two dormant Bitcoin wallets from Satoshi era. Because the account had previously been dormant for more than ten years, it has stirred up controversy in the cryptocurrency world. Both addresses have earned 50 BTC for mining blocks back in June 2010. For several years, there was essentially no activity. There were two microtransactions that entered the wallet in the previous six months for the modest amount of 0.00000547 BTC. Due to the combination of two mining address outputs, it is believed that the coins that were moved belonged to the same owner just might be Satoshi himself.\n\nThe other 9 Biggest Bitcoin holders in order are:\n\nUnited States 205,515 BTC $5,566,414,878 Government Block.one 164,000 BTC $4,445,941,600 Private Company Microstrategy 140,000 BTC $3,795,316,000 Public Company Winklevoss Twins 70,000 BTC $1,897,658,000 Individual Tether Holdings 52,673 BTC $1,427,933,426 Private Company Ukraine 46,351 BTC $1,256,547,799 Government Tim Draper 29,656 BTC $803,956,366 Individual The Tezos Foundation 24,808 BTC $672,529,995 Private Company Michael Saylor 17,732 BTC $480,703,881 Individual\n\nWho is the largest Individual Bitcoin investor?\n\nMichael Saylor (MicroStrategy) – ~ $481 million\n\nOver time, Bitcoin has drawn a large number of unusual investors. But nobody embodies fire and enthusiasm like MicroStrategy Inc. (MSTR) CEO Michael Saylor who is definitely one of the biggest Bitcoin holders.\n\nBy purchasing $250 million worth of Bitcoin in August 2020, the company started accumulating cryptocurrencies. The company claimed at the time that it was purchasing the cryptocurrency in order to make better use of the cash it had on hand.\n\nSaylor has grown to be a fervent proponent of Bitcoin over time and has spoken at conferences for news and cryptocurrencies to promote its advantages and applications. MicroStrategy boosted its Bitcoin holdings to $3.5 billion by December 2021, jumping in to purchase the digital currency as its price fell.\n\nFollowing the acquisition of Bitcoin, MicroStrategy’s stock price soared by more than 337% (as of December 2021). As a result of his wager on Bitcoin, Forbes pegged Saylor’s net worth at $1.6 billion. Microstrategy bought 2,500 more Bitcoins in December 2022, increasing its holdings once more. Microstrategy had roughly 132,500 Bitcoin, or about $3.2 billion, as of February 2023.\n\nAccording to the latest data, MicroStrategy sits on a $3.8 billion BTC stash while Saylor holds $480 million worth of BTC in a personal capacity.\n\nConclusion\n\nThe number of people generating billions off the new asset class surged as cryptocurrency gained popularity. Cryptocurrency millionaires are a diverse group; some have made their billions by offering goods and services to the developing ecosystem, while others have done so by profiting from the volatility of the cryptocurrency market. It should be noted that the BTC is distributed more evenly than other cryptocurrencies.\n\nAccording to the National Bureau of Economic Research , the Bitcoin ecosystem “is still dominated by large and concentrated players, be they large miners, bitcoin holders, or exchanges,” The majority of the profits from increased adoption are expected to fall disproportionately to a small number of players because of bitcoin’s intrinsic concentration, which makes it prone to systemic risk. Keep in mind that there is a risk of loss in every trading. Before trading, always do your own research, taking a look at the most recent news, fundamental and technical analysis, and analyst opinion."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZ2FpbnMtZXRoZXItcmlzZXMv0gEzaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1nYWlucy1ldGhlci1yaXNlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin gains ground, Ether rises, Solana leads winners, BNB little-changed to lower - Forkast News",
        "content": "Bitcoin rose in Tuesday morning trading in Asia to hold above support at US$26,000. Ether also logged gains along with most other top 10 non-stablecoin cryptocurrencies. Binance’s BNB token was little changed to lower on signs the world’s largest crypto exchange may be winding down its expansion in Europe amid widespread regulatory woes. Equity futures in the U.S. edged lower after the long weekend break, recent mixed signals on the state of inflation, and speculation about more interest rate hikes by the Federal Reserve.\n\nCrypto\n\nBitcoin rose 1.41% over the last 24 hours to US$26,765 at 07:00 a.m. in Hong Kong, moving up 3.21% for the past seven days, according to data from CoinMarketCap. The world’s largest cryptocurrency reached a weekly high of US$26,984 early Tuesday to test resistance at US$27,000.\n\nEther gained 0.86% to US$1,734, but has flatlined over the past seven days to log a weekly loss of 0.48%. Solana led the winners in the top 10, rising 3.76% to US$15.95 and up 4.95% for the week.\n\nMost other top 10 non-stablecoin tokens moved higher in early morning trade. However, Binance’s BNB posted a dip of 0.25% to US$242.87, though the token is still holding onto a weekly gain of 5.38%. The Binance exchange seems to be reining in its global expansion plans amid growing regulation challenges.\n\nBinance Markets Ltd, the U.K. subsidiary of Binance, can no longer “provide regulated activities and products” for non crypto-related activities in the country, according to a Monday posting on the website of the country’s Financial Conduct Authority (FCA). According to reports, Binance had permission to provide such services in the U.K. but had requested to the FCA it be withdrawn as they were unlikely to be used.\n\nApart from the ongoing lawsuit with U.S. regulators, Binance is also facing challenges in Europe. The company on Friday said it will withdraw from the Netherlands after being unable to secure a virtual asset service provider registration in the country. The crypto exchange is also reportedly under an anti-money laundering probe in France.\n\nDigital asset investment products saw an outflow of US$5.1 million last week, according to data tracked by Europe-based cryptocurrency investment firm CoinShares on Monday. The data marks the ninth consecutive week of outflows, while the number is smaller than US$88 million in the previous week after the world’s biggest asset manager BlackRock filed for a spot Bitcoin ETF.\n\n“(BlackRock’s) move also conveys a compelling message to the SEC, implying a firm stand on the importance and role of cryptocurrencies in future financial innovation in the U.S,” Rachel Lin, the co-founder and chief executive officer of crypto derivatives exchange SynFutures, said in an emailed comment.\n\nBlackRock’s Bitcoin ETF efforts could be a sign of a major crypto trader migration, according to Markus Thielen, Head of Crypto Research & Strategy at digital asset service platform Matrixport.\n\n“There are now 420 million cryptocurrency holders; migrating them to regulated entities might be the most significant task in 2023 mainly because fighting those crypto companies with deep pockets is also very time-consuming for regulators,” said Thielen in an emailed comment. “Ripple Labs has spent $200m on its lawsuit with the SEC, while Coinbase, especially Binance, could spend billions. So why not approve the Blackrock ETF and let nature play is part?”\n\nCoinShares indicated the slump in prices of many tokens had brought in some bargain-hunting. “The prior week crash in altcoin prices prompted investors to add to positions (in altcoin-linked investment products),” wrote CoinShares in its Monday report, “with XRP, Cardano and Polygon being the focus.”\n\nThe total cryptocurrency market cap rose 0.86% to US$1.07 trillion in the last 24 hours, while crypto trading volume rose 35.69% to US$26.74 billion, according to CoinMarketCap data.\n\nNFT transactions rise\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.17% to 2,868.69 in the 24 hours to 09:20 a.m. in Hong Kong. The index is down 3.36% for the seven days.\n\nNFT transactions on Ethereum rose 6.74% in the past 24 hours to US$13.16 million, according to CryptoSlam data. Transactions on the Bitcoin blockchain surged 135.38% to US$3.43 million, while the Polygon and Cardano networks also logged two-digit gains in NFT transactions.\n\n“Forkast 500 NFT Index along with Ethereum, Solana, Polygon, and Cardano are all close to even, which may be a sign that the market has finished reacting to the SEC’s lawsuits against Binance and Coinbase,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“Sneakerhunt”, a teased collaboration between Nike’s NFT platform .SWOOSH and online video game Fortnite is set to be unveiled on Tuesday, which might bring more public exposure to NFTs.\n\n“This may be a huge week for NFTs after Nike’s tease about an incoming in-game sneaker event in Fortnite,” said Petscher. “Many speculate that it’s Nike’s .SWOOSH shoes that may be the prize at the end of the hunt, titled Airphoria. With Fornite’s 242+ million strong userbase, this could end up being another mass onboarding event for NFTs.”\n\nElsewhere, CryptoPunk #8611 of the Ethereum-based CryptoPunk NFT collection was sold for around US$95,000 on Saturday and immediately burned and “revived” as an Ordinal inscription on the Bitcoin network, with the process directed by NFT enthusiast NatanStein.\n\n“(The action) may be a vote of confidence in the value of assets existing on Bitcoin, but this asset now loses any potential benefits it would have received from Yuga Labs if they were to incorporate it in their Otherside Universe,” said Petscher. “Yuga Labs famously had thousands of $APE Coin claimable for each BAYC NFT, along with land in their Otherside game, and some have speculated that CryptoPunks may one day see their own rewards.”\n\nU.S. futures lower\n\nFederal Reserve Chair Jerome Powell|Image: Getty Images\n\nU.S. stock futures traded lower as of 11.00 a.m. in Hong Kong. Dow Jones Industrial Average futures fell 0.37%, while the S&P 500 and Nasdaq futures both lost 0.22%.\n\nAll the three major U.S. stock indexes logged gains last week as the Federal Reserve left interest rates unchanged at the June 14 meeting, but this was tempered by Fed Chair Jerome Powell, noting “nearly all Committee participants expect that it will be appropriate to raise interest rates somewhat further by the end of the year.”\n\nThe Fed projects the interest rate to reach 5.6% in 2023, indicating two more rate hikes within the year. New York Fed President John Williams will be speaking on Tuesday in the U.S. and may make further comments on the Fed’s fight with inflation.\n\nOn the economic data front, the U.S. housing market index, a measurement of homebuilder sentiment, reached an 11-month high of 55 in June to beat analysts’ expectations, according to Bloomberg on Monday. Readings above 50 indicate more housebuilders see the market condition good than bad.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006, and the Federal Reserve’s next meeting on rates is July 26. The CME FedWatch Tool predicts a 25.6% chance the Fed will keep rates unchanged in July, and a 74.4% chance for another 25-basis-point rate hike, up from 71.9% on Monday.\n\nChina’s central bank lowered its one-year and five-year loan prime rates to 3.55% and 4.2% on Tuesday as economists expected, as the country seeks to boost its slow post-Covid recovery, according to the Financial Times on Tuesday.\n\n(Updates with equities section.)"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzIxL2JpdGNvaW4tbWluZXItY2xlYW5zcGFyay10by1idXktMi1nZW9yZ2lhLWZhY2lsaXRpZXMtZm9yLTkzbS_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yMS9iaXRjb2luLW1pbmVyLWNsZWFuc3BhcmstdG8tYnV5LTItZ2VvcmdpYS1mYWNpbGl0aWVzLWZvci05M20vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Miner CleanSpark to Buy 2 Georgia Facilities for $9.3M - CoinDesk",
        "content": "With the industry still reeling from the sharp fall in bitcoin's valuation last year combined with rising costs from high electricity prices, mining firms are looking toward bitcoin's next halving, now less than a year away, which will reduce rewards for mining blocks, and challenge their profit margins even more."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8yMC91cy1hbmQtdWstZ292ZXJubWVudHMtY3JlYXRlZC1iaXRjb2luLXRvLWRlYWwtd2l0aC1mdXR1cmUtbW9uZXRhcnktY3Jpc2lzLWZvcm1lci1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS_SAY4BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDYvMjAvdXMtYW5kLXVrLWdvdmVybm1lbnRzLWNyZWF0ZWQtYml0Y29pbi10by1kZWFsLXdpdGgtZnV0dXJlLW1vbmV0YXJ5LWNyaXNpcy1mb3JtZXItZ29sZG1hbi1zYWNocy1leGVjdXRpdmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "US and UK Governments Created Bitcoin To Deal With Future Monetary Crisis: Former Goldman Sachs Executive - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal has a theory about the entities that could have created Bitcoin (BTC).\n\nIn a new interview with YouTuber Tom Bilyeu, the Real Vision CEO says he thinks Satoshi, the anonymous inventor of Bitcoin, might be the US and the UK governments.\n\nPal says he believes BTC’s pseudonymous founder was actually just groups of government employees in the US National Security Agency (NSA) and the UK’s Government Communications Headquarters (GCHQ) who were tasked with experimenting with possible solutions to game out future threats to the West’s international monetary dominance.\n\nThe former Goldman Sachs executive says he actually spoke with a Department of Defense (DoD) official in 2013 or 2014 about such threats.\n\n“They periodically reach out to people like me, thinkers about stuff, who are looking at crises and things like that, because their job is to assess risk. And I was talking to them about it… and he said, ‘We’re worried about debt, we’re worried about the system blowing up.’\n\nI said ‘Yes, obviously. Everybody is.’ Because that’s one of the things they need to game out, what happens if the West loses control of money and debt and everything else.\n\nAnd I said, ‘Well, I think the answer’s there, and I think it’s Bitcoin.’ And he said, ‘Yeah, tell me more.’ And I said ‘And I think the US government and the UK government invented it.’ Which is the NSA and the GCHQ in the UK, who are the two world centers of cryptography…\n\nAnd I asked the Department of Defense, they said, ‘Yeah, we’ve considered that too.'”\n\nAccording to Pal, Bitcoin’s release at the height of the 2008 financial crisis as well as its halving cycles give credence to the theory.\n\n“I don’t think it’s a coincidence it came out in the (2008) financial crisis. I don’t think it’s a coincidence that the halving cycle and all of this [are] related. It is the solution, always has been the solution. You just can’t go there tomorrow.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzIxL2JpdGNvaW4tanVuZS0yMDI0LWV4cGlyeS1mdXR1cmVzLWFuZC1vcHRpb25zLWluLWhpZ2gtZGVtYW5kLWR1ZS10by1taW5pbmctcmV3YXJkLWhhbHZpbmctZGVyaWJpdC_SAZEBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8yMS9iaXRjb2luLWp1bmUtMjAyNC1leHBpcnktZnV0dXJlcy1hbmQtb3B0aW9ucy1pbi1oaWdoLWRlbWFuZC1kdWUtdG8tbWluaW5nLXJld2FyZC1oYWx2aW5nLWRlcmliaXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin June 2024 Expiry Futures and Options in High Demand Due to Halving: Deribit - CoinDesk",
        "content": "Futures are financial derivative contracts that obligate parties to buy or sell an asset at a predetermined future date and price. Options are derivative contracts that give the purchaser the right but not the obligation to purchase the underlying asset at a predetermined price on or before a specific date. A call option gives the right to buy, while the put confers the right to sell."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJvcmVkb20tMTgtbW9udGhzLXJlc2VhcmNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price 'sideways boredom' may last 18 months — New research - Cointelegraph",
        "content": "Bitcoin (BTC) faces up to one-and-a-half years of “boredom” as the bull market gathers steam, a new prediction says.\n\nIn the latest edition of its weekly newsletter, “The Week On-Chain,” analytics firm Glassnode predicted an “arduous” period for BTC hodlers next.\n\nGlassnode: Bitcoin hodlers set for 12 months’ “gradual accumulation”\n\nAfter gaining 70% in the first quarter of 2023, but struggling to hold its ground recently, Bitcoin is dividing opinions when it comes to future price action.\n\nWith the 2024 block subsidy halving in sight, some believe a dramatic uptick will characterize the coming year, while others think it will take longer — perhaps until 2025 — for a new all-time high to hit.\n\nFor Glassnode, there are signs that a classic pre-bull market phase is playing out, but long-term holders will still need considerable patience.\n\nInvestigating the “liveliness” of the BTC supply, which it describes as “the propensity of Bitcoin holders to spend or hold their coins,” researchers revealed mass accumulation.\n\n“Currently, Liveliness is in a multi-year macro downtrend, having peaked in May 2021 when bear market first set in. We can see a similar structure has formed to the 2018-20 cycle, as coins slowly but surely migrate into cold storage and are removed from the market by the HODLer cohort,” it explained.\n\n“These HODLers are currently accumulating coins at a rate of around 42.2K BTC/month, suggesting that the price insensitive class are absorbing a non-trivial portion of the currently available supply. If we compare this behavior to prior cycles, we can see that this regime of steady and gradual accumulation commenced just over 2-years ago, and suggests that another 6 to 12-months may be ahead of us.”\n\nBitcoin hodler net position change annotated chart (screenshot). Source: Glassnode\n\nGlassnode added that decreasing exchange balances indicate the supply is becoming increasingly illiquid, that is, out of reach in private cold storage and not for sale.\n\nBitcoin wealth transfer “uninterrupted”\n\nAs Cointelegraph reported, the more speculative end of the hodler base — so-called short-term holders — is also in focus currently.\n\nRelated: Most ‘fear’ in 3 months as $26.4K becomes key — 5 things to know in Bitcoin this week\n\nThese investors have hodled coins for a maximum of 155 days, and their aggregate cost basis, which sits at around $26,400, is on the radar as a short-timeframe support zone.\n\nContinuing, Glassnode noted that based on wallet entity size, not everyone is in accumulation mode, with whales — the largest-volume cohorts — currently “net distributors.”\n\n“Overall, the market appears to be in a period of quiet accumulation, which suggests an undercurrent of demand, despite the regulatory headwinds of late,” it stated, referring to the recent United States regulatory pressures impacting major exchanges.\n\nBitcoin supply absorption rates chart (screenshot). Source: Glassnode\n\nFor a seismic trend shift to occur, researchers believe it will take another halving to come and go.\n\n“Across most measures of market energy, digital asset markets are displaying excitement in few of them. Volatility, volumes, and realized value are all at multi-year lows, as liquidity and excitement give way to investor apathy,” they concluded.\n\n“However beneath the surface, the classic pattern of wealth transfer towards the price insensitive HODLer cohort remains uninterrupted. If past cycles are any guide, it it suggests that a period of apathetic sideways boredom may well define the road ahead, potentially lasting between 8 to 18-months in duration.”\n\nBitcoin pre-halving price performance comparison (screenshot). Source: Glassnode\n\nMagazine: Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wNi0yMS9iaXRjb2luLWdldHMtYm9vc3QtZnJvbS1ibGFja3JvY2stZXRmLWZpbGluZy12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Gets Boost From BlackRock ETF Filing - Bloomberg",
        "content": "00:00\n\nFirst, our huge vote of confidence. When you look at Black Rock and its ability to try to do this after dozens of companies have come forward and tried to create a Bitcoin ETF with no avail from the S.E.C. in an approval for the process, we know grayscale has sued in this regard, trying to get. Conversion of BTC into an ETF. So what's different when it comes to BlackRock? One thing is a surveillance sharing agreement when it comes to NASDAQ and the ability to really monitor what's going on with this ETF in real time. Another thing that is really interesting is the custodians themselves, because not only do you have Bank of New York Mellon that you're looking at as one of the custodians here when you think about the cash holdings, but Coinbase as well when it comes to the Bitcoin holdings. So you have another vote of confidence, not just in Bitcoin, but in Coinbase. Also, Matt, really, just days after you saw the S.E.C. see Coinbase for another matter when it comes to the crypto world and the listing of certain assets. So this would be large for Bitcoin given how many people are on the sidelines that would want a spot Bitcoin ETF to gain exposure with the confidence of the likes of the NY Mellon and BlackRock behind it. Will the S.E.C. have more faith in a giant like BlackRock when you look at what Bloomberg intelligence is estimating, they expect? Kind of a 50/50 chance of approval by the end of the year and even more so when you think beyond this year alone. And then what would the implications for price prices actually be Chanel? Should we see this happen, which, of course, is no guarantee. Yeah. No guarantee at all given the stance the S.E.C. has had so far when it comes to Bitcoin ETF. But again, BlackRock is another game in town. So do they change the equation here with how many advisor assets are on the sidelines here? You would imagine that it could really encourage a lot more people to get in with a trusted really retirement provider, an ETF provider here like BlackRock. There's a sense that it will encourage more people to come in. But with the uncertainty, you don't see that massive price movement right now. And again, we're still talking about bitcoin here. We're not talking about all these other types of crypto assets that are still out there that are drawing more scrutiny from the S.E.C., of course. And I am sure you'll talk about it a lot. There's ether that there is a large question around as well when the S.E.C. will handle how they treat either and Bitcoin as assets relative to a lot of the other things we're seeing out there."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXVwLTM2LWFmdGVyLWNoaW5hLXdhcm5lZC1idGMtemVyb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin up 36% YoY after China warned BTC was 'heading to zero' - Cointelegraph",
        "content": "The government of China has tried hard to make people believe that Bitcoin (BTC) would become worthless, but its predictions to date have been far off the mark. The original cryptocurrency has gained around 36% since the Chinese government stated it would become worthless in 2022.\n\nAmid the bear market, China attempted to capitalize on a massive market decline, warning crypto investors that Bitcoin prices were “heading to zero.”\n\nIn June 2022, the Chinese national news media agency, Economic Daily, issued a warning about Bitcoin to assure citizens the asset was a worthless “string of digital codes.”\n\n“In the future, once investors’ confidence collapses or when sovereign countries declare Bitcoin illegal, it will return to its original value, which is utterly worthless,” the article read.\n\nWhile it’s yet to be seen whether Bitcoin is heading to zero one day, it has not lost any value since the Chinese government issued the warning. On the contrary, Bitcoin has significantly increased since the article was published.\n\nAccording to data from CoinGecko, Bitcoin traded at around $20,000 when the Economic Daily released the article in June 2022. Twelve months later, at the time of writing, BTC is trading at $28,852, up around 36%.\n\nBitcoin one-year price chart. Source: CoinGecko\n\nDespite posting notable gains, Bitcoin has seen its ups and downs over the past year. The largest cryptocurrency by market cap dropped to as low as $15,700 in November 2022. Then, in April 2023, Bitcoin briefly crossed the $30,000 price mark.\n\nRelated: Hong Kong’s regulatory lead sets it up to be major crypto hub\n\nChina was one of the first countries in the world to take regulatory action against crypto. In 2017, Chinese regulators banned cryptocurrency exchanges from providing services in the country. Despite the ban, Bitcoin continued to hit its all-time highs, surging 1,900% all the way up to $20,000 by the end of 2017.\n\nIn 2021, China’s central bank announced a new ban on crypto, uniting forces with various Chinese authorities to crack down on local crypto activity. Just a few months after the ban was announced, Bitcoin hit its all-time high at around $68,000 in November 2021.\n\nDespite “banning” crypto in 2021, China has remained the second-largest Bitcoin miner in the world. The Chinese government also seemingly allows citizens to own cryptocurrency and protects the rights of crypto investors.\n\nMagazine: Hall of Flame: Peter McCormack’s Twitter regrets — ‘I can feel myself being a dick’"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzIwL3doeS1iaXRjb2luLWNsZWFuc3BhcmstYW5kLWhpdmUtYmxvY2tjaGFpbi10ZWNobm9sL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Why Bitcoin, CleanSpark, and Hive Blockchain Technologies Rose Today - The Motley Fool",
        "content": "What happened\n\nCryptocurrencies and crypto mining companies moved higher today due to developments on the regulatory front and as mainstream financial companies continued to show support for digital assets.\n\nSince late afternoon yesterday, the price of the world's largest cryptocurrency, Bitcoin (CRYPTO:BTC), traded roughly 4.8% higher as of 4:20 p.m. ET today.\n\nMeanwhile, shares of the Bitcoin-mining companies CleanSpark (CLSK 3.76%) and Hive Blockchain Technologies (HIVE -0.32%) rose 12.1% and 11.2%, respectively, today.\n\nSo what\n\nBitcoin specifically seems to be benefiting as its market share increases. As of Tuesday, Bitcoin's market cap as a percentage of the market cap of all cryptocurrencies grew to 48.5% and briefly surpassed 50%, according to CoinMarketCap. That's the highest amount Bitcoin has consumed since May 2021.\n\n\"The Bitcoin dominance grows when investors do not feel confident about the short-term market trend and adjust their position toward a less speculative portfolio, increasing their exposure to Bitcoin, which is commonly known to be the less volatile digital asset,\" Fineqia International analyst Matteo Greco said, according to Barron's.\n\nOn the regulatory front, lawmakers in the United Kingdom have passed a bill that would further clarify how cryptocurrencies are regulated in the country, something that many proponents believe is needed to allow the industry to move forward.\n\nYesterday, Parliament's upper chamber approved the Financial Services and Markets Bill (FSMB), which would regulate cryptocurrencies and stablecoins, digital assets pegged to a commodity or currency, under Britain's payments laws, paving the way for regulators to potentially implement laws they have been considering. Now, the FSMB will enter the final stages before being officially approved and put into law. More specific crypto regulation could come over the next year.\n\n\"This bill delivers the outcomes of the future regulatory framework review, giving the regulators significant new rule-making responsibilities, while balancing that additional responsibility with clear accountability, appropriate democratic input, and transparent oversight,\" said Baroness Joanna Penn, a member of the House of Lords.\n\nIn other news, a new exchange called EDX Markets that trades Bitcoin and several other cryptocurrencies and is backed by Charles Schwab, Fidelity, and Citadel revealed this morning that it is live and has raised new funding. This comes just after BlackRock, the world's largest asset manager, recently submitted a proposal to the U.S. Securities and Exchange Commission (SEC) to launch a spot Bitcoin exchange-traded fund (ETF).\n\nWith some of the largest, most well-known crypto exchanges like Binance and Coinbase recently being sued by the SEC, this is welcome news for crypto investors to see mainstream financial companies further supporting the industry.\n\nNow what\n\nAll of this is good news for Bitcoin. Its dominance in the industry shows that investors are flocking to Bitcoin as a safe haven, and more regulatory clarity and acceptance among the mainstream financial system will only legitimize the world's largest token.\n\nBitcoin miners like CleanSpark and Hive are of course going to do well when Bitcoin goes up because that is the token they mine and hold, but overall they tend to be more volatile.\n\nUltimately, I prefer to own Bitcoin itself and believe it's worth having exposure to Bitcoin, as the token continues to become more legitimized."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vZXRmLXByaW1lL3RvZGQtcm9zZW5ibHV0aC1ibGFja3JvY2tzLWJpdGNvaW4tZXRmLWFjdGl2ZS1ldGZzLWV0Zi1wcmltZS_SAWVodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2V0Zi1wcmltZS90b2RkLXJvc2VuYmx1dGgtYmxhY2tyb2Nrcy1iaXRjb2luLWV0Zi1hY3RpdmUtZXRmcy1ldGYtcHJpbWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "ETF Prime: Todd Rosenbluth Talks BlackRock’s Proposed Bitcoin ETF, Active ETFs - ETF Trends",
        "content": "In the latest episode of ETF Prime, VettaFi’s head of research Todd Rosenbluth discusses iShares’ bitcoin ETF filing and the increasing number of launches and filings for active ETFs. Later, Charles Schwab’s senior investment portfolio strategist D.J. Tierney discusses ETF flows, standout ETFs, and their direct indexing platform. Plus, T. Rowe Price’s global head of ETFs Tim Coyne talks about the firm’s expanding actively managed ETF suite.\n\nThe Bitcoin ETF Saga Continues\n\nJust when you think the bitcoin ETF saga is dragging, something new comes along. That something new is BlackRock’s iShares arm filing for a bitcoin ETF . Rosenbluth admitted to podcast host Nate Geraci that the filing caught him by surprise.\n\n“I was surprised,” Rosenbluth said. “The SEC has been consistent with concerns about fraud and manipulation for a spot bitcoin ETF.” He cited the SEC’s battle against Grayscale as an example of the agency fighting against a spot bitcoin ETF.\n\nRosenbluth said the Nasdaq may do surveillance to support the effort but is unsure if that will make a difference. And while “BlackRock doesn’t launch products just to launch products,” Rosenbluth remains “skeptical that we’re going to see any spot bitcoin ETF in 2023.”\n\n“The regulatory environment isn’t favorable towards such a product,” he added.\n\nSo, why would BlackRock file if the idea is getting such pushback from the SEC? Rosenbluth agrees with Geraci that it feels like BlackRock may know something. Whether what they know will “lead to a spot bitcoin ETF being approved this year” remains to be seen. But if BlackRock is successful in getting the ETF approved, “it’ll be tremendously successful because it’s BlackRock.”\n\n“I think they’re smart to get in line early in case the SEC shifts their stance,” Rosenbluth said.\n\nSee more: “ VettaFi Honored As Finalist for 2023 “Wealthie” Award In Research Innovation ”\n\nAn Exciting Time for Actively Managed ETFs\n\nPrior to Geraci speaking with Coyne from T. Rowe Price, Rosenbluth discussed the firm’s newly launched T. Rowe Price Capital Appreciation Equity ETF (TCAF) and four additional active transparent funds. Unlike T. Rowe Price’s other launches, TCAF is not a clone . Rather, it’s a fully transparent equity-only portfolio with the same approach as the equity sleeve of the mutual fund.\n\nRosenbluth noted that, in addition to T. Rowe Price, Franklin Templeton, Fidelity Investments, and J.P Morgan have also thrown their hats into the active ETF ring.\n\n“It’s just really exciting to me when asset managers bring their best into the ETF space,” he added. “This is a really exciting time for actively managed ETFs.”\n\nGoldman Sachs Introducing Eagle Capital to the ETF Party\n\nEagle Capital is another issuer that’s thrown its hat into the active ETF ring. And it’s done this with the help of the Goldman Sachs ETF Accelerator business. The Eagle Capital Select Equity ETF will likely trade under the ticker EAGL in the second half of 2023. Per the filing, the ETF – the firm’s first – will be actively managed and fully transparent.\n\nBut the Goldman Sachs ETF accelerator is different than Alpha Architecture or Tidal. “What Goldman is doing is leveraging more of its institutional expertise,” Rosenbluth explained. Goldman Sachs is leveraging its new institutional expertise to set the new ETFs up for success. It’s acting more like a consultant than as a white labeling service.\n\n“Goldman is not helping manage the fund,” he said. “They are really using all of their relationships within the broader ETF ecosystem to support a firm like Eagle Capital.”\n\nOr, to put it another way: “If you’re showing up to a party 30 years late, it helps of have a friend introduce you around to the right people.”\n\nVettaFi Honored as Wealthies Finalist\n\nRosenbluth also gave a shout-out to the VettaFi team for being a finalist for WealthManagement.com’s 2023 Industry Awards (a.k.a. the “Wealthies”). VettaFi is one of two firms to be recognized for outstanding achievement in research innovation.\n\n“We’re really proud of the recognition,” Rosenbluth said. It’s an honor to be a finalist.”\n\nThe Wealthies honors companies, organizations, and individuals supporting financial advisor success.\n\nETF Flows, Active Funds\n\nLater in the episode, Charles Schwab’s Tierney kicks off his segment by talking about ETF flows so far this year.\n\n“I think we all have to take note of the large flows that we’ve seen into the fixed income category this year,” Tierney said. “They really are significant.”\n\nTierney added that overall, flows are a little lower, particularly within equity ETFs.\n\nFor Coyne’s segment, the global head of ETFs for T. Rowe Price discussed the firm’s rapidly expanding ETF suite. T. Rowe Price entered the ETF space about three years ago. Now, the firm has a lineup of 15 actively managed ETFs.\n\n“When we entered the active ETF market, we really committed to putting our best foot forward for our clients,” Coyne said. “We’re committed to developing a comprehensive suite within ETFs to really better service our clients.”\n\nListen to the entire episode of ETF Prime Featuring Todd Rosenbluth:"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNi0yMC9ibGFja3JvY2stcy1zdXJwcmlzaW5nLWJpdGNvaW4tZXRmLWZpbGluZy1oZWxwcy1yZXBhaXItZ3JheXNjYWxlLWdidGMtZGlzY291bnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "BlackRock's Surprising Bitcoin ETF Filing Helps Repair Grayscale GBTC Discount - Bloomberg",
        "content": "BlackRock Inc.’s surprise application for a spot-Bitcoin exchange-traded fund has a silver lining for Grayscale Investments LLC.\n\nThe $16.9 billion Grayscale Bitcoin Trust (ticker GBTC) has outperformed the cryptocurrency itself in the days since the world’s largest ETF issuer applied for the iShares Bitcoin Trust last week. As a result, GBTC’s discount to its underlying Bitcoin holdings has narrowed to about 37%, versus 44% a week ago."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stc3BvdC1iaXRjb2luLWV0Zi1uZXctc2VjLWZpbGluZ3Mtd2lzZG9tdHJlZS1pbnZlc2Nv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Blackrock's spot Bitcoin ETF renews optimism, sparks wave of new filings - Cointelegraph",
        "content": "At least two investment firms have made new filings for spot Bitcoin exchange-traded funds (ETF) following investment colossus BlackRock’s move to lodge a similar application for its own spot Bitcoin ETF on June 15.\n\nNew York-based asset management fund WisdomTree is the most recent investment firm to lodge a new filing for a spot Bitcoin ETF.\n\nAccording to a June 21 filing to the United States Securities and Exchange Commission (SEC), WisdomTree requested that the SEC allow it to list its “WisdomTree Bitcoin Trust” on the Cboe BZX Exchange under the ticker “BTCW.”\n\nWisdomTree has filed for spot bitcoin ETF h/t @NateGeraci pic.twitter.com/JwXj8rTs2X — Eric Balchunas (@EricBalchunas) June 20, 2023\n\nWisdomTree has applied for a spot Bitcoin ETF twice before. Its first application was rejected by the SEC in December 2021. Its second application was rejected once again in October 2022, with the financial regulator citing similar concerns of fraud and market manipulation. At the time of publication, WisdomTree oversees approximately $83 billion in assets.\n\nOne of the key differences with BlackRock’s recent filing to the SEC is that it intends to enter into a “surveillance sharing agreement” with the Chicago Mercantile Exchange (CME) futures markets.\n\nBlackRock’s proposal cites the SEC’s approval of a Bitcoin futures fund by investment advisory firm Teucrium. That ruling noted that the CME “comprehensively surveils futures market conditions and price movements on a real time and ongoing basis in order to detect and prevent price distortions, including price distortions caused by manipulative efforts.”\n\nThis has been echoed in WisdomTree’s filing as well, which states that it too is willing to enter into such a surveillance agreement with “an operator of a US-based spot trading platform for Bitcoin.”\n\nLess than four hours after WisdomTree filed its application, global investment manager Invesco “reactivated” its application for a similar product.\n\nAnd now Invesco has reactivated their 19b-4 for their spot ETF https://t.co/D2zTpqrqJH — Eric Balchunas (@EricBalchunas) June 20, 2023\n\nAccording to the 19b-4 document — which informs the SEC of a proposed rule change — Invesco requested that the financial regulator allow its “Invesco Galaxy Bitcoin ETF” product to be listed on the Cboe BZX exchange.\n\nThe filing notes that a spot Bitcoin ETF which uses “professional custodians and other service providers,” removes the need for investors to rely on “loosely regulated offshore vehicles” in turn, allowing for investors to more readily “protect their principal investments in Bitcoin.”\n\nWhile the SEC is yet to approve a single spot Bitcoin ETF product, Bloomberg senior ETF analyst Eric Balchunas said that “BlackRock breathed new life into the race” in response to his own tweet concerning the WisdomTree filing.\n\nFun fact: BlackRock's record of getting ETFs approved by the SEC is 575-1. That's another reason this is so big, they don't play around. https://t.co/f7YIhGRmLf — Eric Balchunas (@EricBalchunas) June 16, 2023\n\nAdditionally, Balchunas said that crypto investors may have good reason to be optimistic when it comes to BlackRock’s move, sharing that the investment firm has a “575-1” record of getting ETFs approved by the regulator.\n\nRelated: BlackRock’s Bitcoin ETF ‘is the best thing to happen’ to BTC, or is it?\n\nIn addition to the recent activity from WisdomTree and Invesco, rumors have begun circulating that the multi-trillion-dollar fund manager Fidelity Investments may also be looking to capitalize on the newfound frenzy for spot Bitcoin ETFs.\n\nAccording to a June 19 tweet from Arch Public co-founder AP_Abacus, Fidelity Investments — which manages some $4.9 trillion in assets — may look to file for its own spot Bitcoin ETF. Alternatively, Abacus notes that the investment firm could make an offer on Grasyscale’s GBTC ETF product.\n\nCointelegraph reached out to Fidelity for confirmation but did not receive an immediate response.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yMC9kZXV0c2NoZS1iYW5rLWFwcGxpZXMtZm9yLWRpZ2l0YWwtYXNzZXQtbGljZW5zZS1pbi1nZXJtYW55LWFzLXRyYWRmaS1wdXNoZXMtZnVydGhlci1pbnRvLWNyeXB0by_SAZEBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDYvMjAvZGV1dHNjaGUtYmFuay1hcHBsaWVzLWZvci1kaWdpdGFsLWFzc2V0LWxpY2Vuc2UtaW4tZ2VybWFueS1hcy10cmFkZmktcHVzaGVzLWZ1cnRoZXItaW50by1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Deutsche Bank Applies for Digital Asset License in Germany as TradFi Pushes Further Into Crypto - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFkb3B0aW9uLWluLW1leGljby1ib29zdGVkLWJ5LWxpZ2h0bmluZy1wYXJ0bmVyc2hpcC13aXRoLXJldGFpbC1naWFudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin adoption in Mexico boosted by Lightning partnership with retail giant - Cointelegraph",
        "content": "The world’s largest Bitcoin (BTC) conference, Bitcoin 2023, in Miami, Florida, passed without major fanfare this year. Past conferences announced nation-state adoption, massive crypto integrations in the United States, and islands and territories worldwide embracing Bitcoin.\n\nNonetheless, at Bitcoin 2023, one partnership with a potentially significant impact on the world’s 15th-largest economy flew under the radar.\n\nWe're thrilled to announce our partnership with Grupo Salinas. Looking forward to seeing the positive impact this collaboration will have.⚡️ #Bitcoin #bitcoiconference2023 https://t.co/rkAjWnmKsK pic.twitter.com/yWIWc6751B — IBEX ⚡️ (@PoweredbyIBEX) May 18, 2023\n\nJosé Lemus, the CEO of Ibex Mercado, closed out the Bitcoin 2023 Industry Day. He announced a partnership with Grupo Salinas, one of Mexico’s largest corporate conglomerates. In brief, the collaboration would allow millions of Mexicans to pay their internet bills at popular telecoms company Total Play using the Bitcoin Lightning Network.\n\nCrucially, the Salinas Group owns tens of businesses across Mexico. Its billionaire founder, Ricardo Salinas Pliego, is the third-richest person in the country and a well-known Bitcoin maximalist.\n\nNot only does the Bitcoin Lightning payments integration already deliver Bitcoin adoption to millions of Mexicans, but as Lemus explained to Cointelegraph, Total Play is one small retailer that’s part of the vast Salinas conglomerate:\n\n“Imagine if Best Buy, Bank of America, Fox News and an NFL team were all owned by the same individual. All of them will have Lightning capabilities in the future.”\n\nLemus explained it’s just the “tip of the iceberg of what will go on in Mexico,” as more Bitcoin and Lightning integrations, and on and off-ramps attract more Bitcoin business. Speaking via video link, Lemus explained that fiat and Bitcoin can interact more freely in Mexico:\n\n“Let’s say you have a wallet and you want to make Mexican pesos available in Mexico, or you have an exchange and you want to make the balances for your customers in Mexico. You can do that through CoinPro or through Grupo Salinas.”\n\nThe partnership is the beginning of Lightning functionality across Grupo Salinas. There will be a Lightning app “for employees, a super app for soccer teams to do something similar to what we have with the Perth Heat where we drive fan engagement with innovative ways.”\n\nThe Australian baseball team, Perth Heat, adopted a Bitcoin standard in 2021, with players earning salaries in Bitcoin and “Sats4Stats”, where players receive Bitcoin for hitting home runs. Plus, fan engagement activities use the Lightning Network. For example, during baseball games, “When a player steals a base, a QR flashes on screen and the first people that scan it get satoshis,” Lemus explained.\n\nPlayers can send satoshis to players directly during Perth Heat baseball games. Source: PerthHeat.com.au\n\nIn the first year of operation, the Perth Heat players earned an extra 1% through Bitcoin, Lemus said on stage at Bitcoin 2023. “It’s still early” for such a technology, but an extra 1% is already encouraging.\n\nGrupo Salinas owns the Mexican football clubs, Mazatlán and Club Puebla. Fans could soon get their hands on free money — in the form of Bitcoin or satoshis — for simply scanning the QR code on the stadium screen when a player scores, just like with Perth Heat.\n\nA snapshot of some of the Grupo Salinas brands spanning retail, banking, sports and advertising. Source: GrupoSalinas.com\n\nIbex Mercado understands the massive opportunity for financial inclusion offered by the Lightning Network. Lemus founded Ibex in neighboring Guatemala, and the company delivered the Lightning Network integration for El Salvador’s Chivo Wallet — which effectively banked millions of Salvadorans — two years prior.\n\nLemus explained that more Bitcoin adoption could improve the lives of unbanked and underserved populations. Moreover, financial inclusion goes beyond banking the unbanked:\n\n“It’s the ability to raise funds for your company. It’s the ability to open yourself to a broader market. And that is what, for me, true financial inclusion is.”\n\nFinally, Lemus highlighted the potential of Mexico as a Bitcoin destination: “I think that Mexico is going to be the place where this is going to take off.“ More broadly, 2022 was a promising year for Bitcoin and crypto adoption in the country, from crypto remittance companies establishing in Mexico to crypto exchange expansion.\n\nRelated: Bitcoin adoption of Guatemalan merchants grows one BTC tattoo at a time\n\nDoes this mean that crypto enthusiasts may soon be able to live on Bitcoin like they can in El Salvador? Lemus replied:\n\n“Let’s say you conduct most of your life in Bitcoin, I think 18 months is a reasonable target where you can do most of your life. But obviously, things like taxes and maybe rent will not run on Bitcoin yet.”\n\nSimilarly, the partnership with Grupo Salinas took 18 months of work and preparation, Lemus said. More partnerships and projects are on the horizon in Mexico, although it’s too early to share details, Lemus concluded.\n\nMagazine: Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9iaXRjb2luLWJ0Yy1oaXRzLW5ldy1hbGwtdGltZS1oaWdoLWhlcmVzLXdoYXQtaGFwcGVuZWTSAUpodHRwczovL3UudG9kYXkvYml0Y29pbi1idGMtaGl0cy1uZXctYWxsLXRpbWUtaGlnaC1oZXJlcy13aGF0LWhhcHBlbmVkP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Hits New All-Time High, Here's What Happened - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAccording to a report by on-chain data aggregator Glassnode, this week Bitcoin has hit a new all-time high related to the illiquid supply of BTC held in cold wallets off crypto exchanges.\n\nA tweet by the company's analytics team stated that there has been noted a divergence between Bitcoin balances on exchanges and the illiquid supply of BTC.\n\nThis week, the Bitcoin supply with no history of spending has reached an ATH of 15.2 million. As for balances on trading platforms, they have reached a bottom since early 2018. This figure stands at 2.3 million BTC at the time of writing.\n\nA divergence can be observed between exchange balances, and the volume of coins held in illiquid wallets, being those with little to no history of spending.\n\n\n\nIlliquid supply reached a new ATH of 15.2M BTC this week, whilst exchange balances have fallen to the lowest levels since… pic.twitter.com/qLW1Wto21t — glassnode (@glassnode) June 21, 2023\n\nHodlers accumulating Bitcoin fast and steadily\n\nGlassnode also wrote that BTC hodlers are buying Bitcoin by approximately 42,200 coins per month: \"the price insensitive class are absorbing a non-trivial portion of the currently available supply.\"\n\nThis process of active gradual buying started around two years ago, and Glassnode believes that investors may continue to buy BTC for another six months or even a year.\n\n\"Big players are jumping in\"\n\nProminent crypto trader and analyst Michael van de Poppe has reminded his followers that \"the big players are jumping in\" to buy Bitcoin.\n\nRecently, BlackRock fund management company submitted an application for a Bitcoin ETF, and Fidelity was rumored to do that soon too. Invesco and WisdomTree have both applied for a Bitcoin ETF as well. Deutsche Bank is striving to gain a license to provide crypto custodial services.\n\nBesides, Fidelity, Citadel and Schwab have joined forces to launch cryptocurrency exchange EDX. All this has pushed Bitcoin up over $28,000, and it is trading close to the $29,000 level now.\n\nPoppe added, \"The big players are jumping in, so should you.\""
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1yZWFjaC01MC1wZXJjZW50LW1hcmtldC1kb21pbmFuY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin reaches 50% market dominance for first time in 2 years - Cointelegraph",
        "content": "Bitcoin (BTC) dominance, the measure of how much Bitcoin makes up of the total crypto market cap, has breached the 50% mark.\n\nOn June 19 at 6 pm UTC, Bitcoin dominance hit just above 50% and has since settled to 49.9% at the time of publication, according to data from TradingView.\n\nThis means that Bitcoin alone accounts for half of crypto’s total $1.1 trillion dollar market capitalization. Bitcoin’s current market capitalization stands at $519 billion, according to data from Coingecko.\n\nNotably, Bitcoin’s market dominance has surged by more than 10.5% since Nov. 27, 2022, an increase driven in large part by investors looking to the flagship crypto asset as a safe haven in the wake of the FTX crisis and amid mounting regulatory scrutiny of crypto assets in the United States.\n\nBitcoin market dominance over the last 4 days. Source: TradingView.\n\nWhile Bitcoin dominance increased significantly over the last eight months, Ether’s (ETH) market dominance has been holding steady around the 20% mark for the better part of a year. Currently, the combined value of Bitcoin and Ether now accounts for roughly 70% of the entire crypto market.\n\nMicroStrategy co-founder and outspoken Bitcoin bull Michael Saylor believes that Bitcoin’s market dominance will top 80% in the coming years, as increasing regulatory pressure from the Securities and Exchange Commission causes stablecoins and the majority of other crypto assets to “go away.”\n\nRegulatory clarity is going to drive #Bitcoin adoption by eliminating the confusion & anxiety that has been holding back institutional investors. Bitcoin dominance will continue to grow as the #Crypto industry rationalizes around $BTC and goes mainstream. pic.twitter.com/Foq4lpderj — Michael Saylor⚡️ (@saylor) June 13, 2023\n\n“The entire industry is destined to be rationalized down to a Bitcoin-focused industry, with maybe half a dozen to a dozen other Proof of Work tokens.”\n\nAdditionally, Saylor blamed the lack of any “mega institutional money” entering the crypto space on the “confusion and anxiety” brought about the by the 25,000 other cryptocurrencies that have positioned themselves as alternatives to Bitcoin.\n\nRelated: Why Cathie Wood is bullish on Coinbase stock and believes Bitcoin will reach $1 million\n\n“Bitcoin is the universally, globally-acknowledged digital commodity in this industry,” Saylor added, making a nod to the fact that Bitcoin is the only cryptocurrency SEC Chair Gary Gensler has labeled a commodity. The SEC has now declared a total of 68 cryptocurrencies to be securities.\n\nBitcoin is currently changing hands for $26,746 an increase of 1.5% in the last 24 hours, according to data from Cointelegraph Price Index. The value of Bitcoin has grown more than 3% over the course of the last week despite “fear” in the crypto market reaching its highest point in three months.\n\nCrypto research firm Santiment also points to investment colossus Blackrock’s filing for a Bitcoin spot ETF as one of the major drivers of Bitcoin's upwards price action over the last few days.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2ludmVzY28tam9pbnMtYmxhY2tyb2NrLXdpc2RvbXRyZWUtaW4tZmlsaW5nLWZvci1zcG90LWJpdGNvaW4tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Invesco joins BlackRock, WisdomTree in filing for spot Bitcoin ETF - CryptoSlate",
        "content": "U.S.-based investment manager Invesco re-filed its spot Bitcoin ETF application with the Securities Exchange Commission (SEC) on June 20.\n\nIn conjunction with Galaxy Digital, the firm had previously filed for a spot Bitcoin ETF in September 2021. It also applied for a futures ETF product, named “The Invesco Bitcoin Strategy ETF,” in August 2021 – later dropping the application in October 2021, giving no specific reason for the turnaround.\n\nInvesco’s re-filing comes in quick succession to WisdomTree and BlackRock’s spot ETF applications. The BlackRock filing was made on June 15, when market sentiment was low due to heightened regulatory hostility.\n\nAlex Adelma, the chief executive of Bitcoin rewards app Lolli, said that as the world’s largest investment manager, BlackRock had reinvigorated institutional interest in Bitcoin – likely triggering a wave of institutional Bitcoin-related financial products to come.\n\nIn its current filing, Invesco pointed out that prior ETF approvals were made based on the listing exchange having a “surveillance sharing agreement” and not on the regulation covering the spot market – citing examples such as the existence of spot gold products when the spot gold market is “largely unregulated.”\n\nIt added that its product offers investor protection over and above buying Bitcoin directly, including protection against insolvency and cyber attacks. Also, hinting at investor harm caused by numerous CeFi bankruptcies last year, it stated that if a spot Bitcoin ETF were approved, U.S. investors would not use “loosely regulated offshore vehicles.”\n\nThe SEC has repeatedly rejected spot Bitcoin ETF applications, raising concerns about cryptocurrency volatility and market manipulation.\n\nGiven BlackRock’s standing and track record in ETF approvals, some hope this wave of applications will yield an alternative response from the regulator.\n\nMentioned in this article"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLWNvcmUtc2NpZW50aWZpYy1maWxlcy1pdHMtY2hhcHRlci0xMS1wbGFu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin miner Core Scientific files its Chapter 11 plan - Cointelegraph",
        "content": "Bankrupt Bitcoin (BTC) miner Core Scientific filed its Chapter 11 bankruptcy plan.\n\nThe plan was filed in the United States Bankruptcy Court for the Southern District of Texas Houston Division. The plan was negotiated with key stakeholders, and according to the filing, the firm is “seeking to build as much consensus as possible” about how a new Core Scientific would look after emerging from its bankruptcy proceedings.\n\nThe company said it had seen a boost in liquidity since filing for Chapter 11 bankruptcy and is focused on revamping its business plan to make a successful comeback. The company attributed its improved financial performance to higher Bitcoin prices, increased network hash rate and reduced energy costs.\n\nA Chapter 11 bankruptcy allows a firm to continue operating until stakeholders agree on a restructuring plan, which could involve measures such as downsizing business operations to reduce debt or liquidating assets to repay creditors. The Chapter 11 bankruptcy plan refers to the formal document that outlines how the company intends to reorganize itself and repay its creditors.\n\nThe bankruptcy plan explained that, on the effective date of the bankruptcy plan, holders of allowed debtor-in-possession (DIP) claims would receive full and final satisfaction of their claims. They will either receive full payment in cash or agreed-upon alternative treatment. Any liens granted to secure the DIP claims will also be terminated, removing the secured interest over the company’s assets.\n\nRelated: ‘Unjustly enriched’ — Core Scientific knocks back $4.7M claim from Celsius\n\nCore Scientific had received permission from the bankruptcy court to take out a loan of up to $70 million from investment bank B. Riley, one of the company’s biggest creditors. The loan would be used to pay off the bankrupt Bitcoin miner’s existing debtor-in-possession financing loan, which also came from B. Riley.\n\nCore Scientific filed for bankruptcy on Dec. 21, 2022, due to falling revenue amid low BTC prices. The filing came just after a creditor offered to help Core Scientific avoid possible bankruptcy.\n\nMagazine: Inside the Iranian Bitcoin mining industry"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy80LXRoaW5ncy1zcGFyay1uZXh0LWJpdGNvaW4tcHJpY2UtYnVsbC1jeWNsZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "4 things that can spark the next Bitcoin bull cycle - Cointelegraph",
        "content": "Bitcoin has dropped nearly 15% from its yearly high of around $31,000, with the recent regulatory crackdowns on crypto exchanges Coinbase and Binance and the Federal Reserve’s hawkish forward guidance accelerating its sell-off.\n\nStill, Bitcoin (BTC) is up 60% year-to-date, holding above a technical support level of $25,000. Moreover, there are a few reasons a new bull cycle could begin.\n\nBitcoin halving\n\nThe next Bitcoin halving, a preprogrammed event that slashes the cryptocurrency’s supply rate by half every four years, is coming up in April 2024.\n\nThe previous three Bitcoin halvings (in 2012, 2016 and 2020) have all preceded massive BTC price rallies and new all-time highs. For instance, BTC is up 276% since the previous halving in May 2020.\n\nBitcoin price performances since the last three halvings. Source: Glassnode\n\nThe market will likely be in an accumulation zone until the halving, according to analyst Lark Davis, who anticipates Bitcoin to test its record high of $69,000 in the next 18 to 24 months. One analyst even sees the price hitting $160,000 by April 2024.\n\nVolatility, volumes, and realized values are at multi-year lows, indicating that Bitcoin investor apathy is firmly in play.\n\n\n\nHowever, under the surface, HODLers continue their classic slow and steady accumulation, with the halving now less than 1yr away.\n\n\n\nTo find our more,… pic.twitter.com/1w2gMTRWCC — glassnode (@glassnode) June 19, 2023\n\nRelated: Why Cathie Wood is bullish on Coinbase stock and believes Bitcoin will reach $1 million\n\nBlackRock Bitcoin ETF\n\nBlackRock’s application with the United States Securities and Exchange Commission for a Bitcoin exchange-traded fund (ETF) has also boosted confidence in a potential BTC price rally in the days leading up to the halving.\n\nThe investment firm, which manages $8.5 trillion in assets, has a near-perfect ETF approval record with the SEC. The SEC’s deadline to respond to BlackRock’s application is around March 2024, a month before the halving.\n\nAn SEC approval could double Bitcoin's bullish prospects after the halving, several analysts argue.\n\n“Your are watching game theory at work,” analyst Crypto Tea stated, noting:\n\n“BlackRock understands the bitcoin halving is less than a year away. New supply will decrease while demand continues to increase from worldwide hyperinflation. They are asset managers and need to capture Bitcoin’s performance before their competitors do.”\n\nBitcoin dominance rising\n\nThe latest SEC crackdown on Binance and Coinbase has left many top altcoins under stress, particularly those deemed “unregistered securities.” That has coincided with the Bitcoin’s crypto market dominance crossing 50% for the first time in two years.\n\nBitcoin market dominance index. Source: TradingView\n\nIn other words, capital is moving from altcoins to Bitcoin, as the latter is not considered a security by the SEC. Therefore, BTC may be seen as the “safe” bet when compared with the 60-plus cryptocurrencies deemed securities by the regulator.\n\nMicroStrategy co-founder Michael Saylor has predicted this will push BTC’s market cap to 80% of the total crypto market in the coming years. He said:\n\n\"Regulatory clarity is going to drive Bitcoin adoption by eliminating the confusion & anxiety that has been holding back institutional investors. Bitcoin dominance will continue to grow as the #Crypto industry rationalizes around $BTC and goes mainstream.\"\n\nBTC price “bull flag”\n\nTechnicals show Bitcoin painting a clear bull flag pattern on its longer-timeframe charts, suggesting an upside continuation of its overall recovery rally.\n\nBTC/USD weekly price chart. Source: TradingView\n\nA bull flag gets resolved after the price breaks above its upper trendline and rises by as much as the height of the previous uptrend. As a result, Bitcoin’s bull flag target comes near $35,500 — a level that served as strong support in May 2021 and May 2022.\n\nStill, Bitcoin will need to close decisively above $35,500 to begin a bull cycle, given that it would still be a lower high compared with the cryptocurrency’s previous bear market peaks.\n\nInterestingly — and simultaneously to the bull flag pattern — BTC price could be on the cusp of a breakout in its prevailing inverse-head-and-shoulders (IH&S) pattern, as shown below.\n\nBTC/USD weekly price chart. Source: TradingView\n\nAn IH&S is a bullish reversal pattern, confirmed by the formation of three troughs under a common neckline resistance. The middle trough comes to be deeper than the other two, which have more or less the same height.\n\nAs a rule, an IH&S pattern is resolved after the price breaks above the neckline and rises by as much as the distance between the middle trough’s lowest point and the neckline. Sometimes, the price returns to retest the neckline as support after the first breakout attempt.\n\nRelated: 31% of young Aussies hold crypto despite being ‘risk averse’ — ASX survey\n\nThus, a rebound from the IH&S neckline could have BTC price rally toward $40,500, up more than 60% from current price levels and confirming a new bull cycle.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xNDU3MTQvbmV3LXlvcmstY2l0eS1zcGEtZ2V0cy1oZWF0LWZvci1oZWF0aW5nLXdpdGgtYml0Y29pbi1taW5pbmfSAVtodHRwczovL2RlY3J5cHQuY28vMTQ1NzE0L25ldy15b3JrLWNpdHktc3BhLWdldHMtaGVhdC1mb3ItaGVhdGluZy13aXRoLWJpdGNvaW4tbWluaW5nP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "New York City Spa Gets Heat for Heating with Bitcoin Mining - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA New York City bathhouse and spa sparked a bit of controversy when they revealed that they were operating a small-scale bitcoin mining operation that also heated their pools. The business, named Bathouse, posted yesterday on Instagram they are operating on a Bitcoin Standard.\n\nBathhouse is located in Brooklyn and accepts Bitcoin payments. The company took to social media yesterday to explain how the process actually works.\n\nThe heat generated by their mining heats their pools, with the water returning later in the process to cool the hardware. Their post read, “Enjoy a hot pool while supporting the Bitcoin network.”\n\nAD\n\nAD\n\nA Bitcoin mining rig is the physical infrastructure of the computers that execute the network’s computational process. These use a fair amount of electricity—regardless of source—as well as produce a lot of noise and heat. Mining also requires cooling methods, such as Bathhouse’s process, to not overheat and run efficiently.\n\nImage: Bathhouse on Instagram\n\nImplementing their unique heating process in March 2022, their founders “were interested in what this technology can do for humanity.” Bathhouse told Decrypt they were looking for an efficient engineering solution, and trying to find ways to conserve energy.\n\nAccording to the business, they have now “proven to themselves Bitcoin mining is a viable option.”\n\nBathhouse also explained that it “can see this being implemented into a lot of building solutions for creating heat, domestic hot water, et cetera,” and that they are “happy to share what they have learned with anyone interested.”\n\nBitcoin mining is the process in which specialized computers, known as ASICs, compete to find a specific number, which is found on average every ten minutes. Known as proof of work, the miner that finds the solution to the algorithm–known as SHA256–receives bitcoin as a reward for the energy spent in the process. At the moment, the reward is 6.25 BTC per block, although it is meant to be cut in half next year.\n\nAD\n\nAD\n\nMining is a controversial subject, as was made clear by some of the replies on the social media post.\n\n“This makes me like Bathhouse less,” said one user. “Now I'm concerned about who is mining this cryptocurrency, who is profiting from it, and whether I support that. We’re gonna need some transparency.”\n\nOthers had similar thoughts, one commenter adding, “In the year of our lord 2023… thinking bitcoin mining gives you cachet? Praying this is a poorly-conceived joke.”\n\nThe post, however, did gather steam–pun intended–among bitcoiners, with Bradley Rettler (commonly known as one of the “bitcoin philosophers” from the group Resistance Money) writing on Instagram: “Thank you for securing the network, helping resist authoritarianism, and bringing financial freedom to people while you heat your pools!”"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjEvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLWhhcy1pdHMtZXllcy1vbi0zMGstYW1pZC1zdGVhZGZhc3QtaW5zdGl0dXRpb25hbC1pbnRlcmVzdC_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8yMS9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4taGFzLWl0cy1leWVzLW9uLTMway1hbWlkLXN0ZWFkZmFzdC1pbnN0aXR1dGlvbmFsLWludGVyZXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Has Its Eyes on $30K Amid Steadfast Institutional Interest - CoinDesk",
        "content": "Bitcoin (BTC) traded little changed on Tuesday as China's first cut in benchmark lending rates in 10 months failed to lift the mood in traditional markets. Bannockburn Global Forex managing director and Chief Market Strategist Marc Chandler joined to discuss his crypto markets analysis. Plus, Ron Hammond from the Blockchain Association joined \"First Mover\" to discuss why the trade group had filed a Freedom of Information Act request with the SEC seeking records relevant to Prometheum, a crypto broker. And, Alchemy developer experience lead Elan Halpern shared how the blockchain developer platform aims to help Web3 developers access data faster and speed up product development."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGUtbW9vbi1jYXJsLXJ1bmVmZWx0LWJpdGNvaW4td2lsbC1uZXZlci1nby1iZWxvdy0xMGstYWdhaW4tMjAyMi1pbnRlcnZpZXcv0gFpaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3RoZS1tb29uLWNhcmwtcnVuZWZlbHQtYml0Y29pbi13aWxsLW5ldmVyLWdvLWJlbG93LTEway1hZ2Fpbi0yMDIyLWludGVydmlldy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Carl “The Moon” Runefelt: Bitcoin Will Never Go Below $10K Again (2022 Interview) - CryptoPotato",
        "content": "Carl Runefelt, better known within the crypto community and perhaps beyond it for his social media name – The Moon – is one of the most popular entrepreneurs in the field. He has over 500K subscribers on YouTube and has recently crossed the one million followers milestone on Twitter.\n\nFrom wild Bitcoin predictions to million-dollars NFT buys, to his recent payment app Kasta, and what he thinks about the criticism he received from his community after showing his new Bugatti while the market was starting to crash in December 2021.\n\nFrom Sorting Groceries to The Moon in Four Years\n\nRunefelt started his Youtube channel in 2017. Before diving into crypto, he was working at a groceries store in Sweden – where he’s originally from.\n\n“I was working at a groceries store in Sweden. I wasn’t very happy with my life – I thought it was a bit boring. I felt that I wasn’t doing what I was supposed to do.”\n\nIt was the Law of Attraction and how visualizing his goals helped him achieve the lavish lifestyle that he lives today – in Dubai.\n\nBefore getting into crypto, he was investing the money he had in physical gold and silver. As a 22-year old who was starting his career, it was the inefficient banking system that had him looking for an alternative.\n\n“I was looking for ways to make money on the stupidity and the corruption of the central bankers and I thought that was gold. But then I saw one YouTube video – someone had made a video about YouTube and I saw it and I just immediately thought it was extremely interesting.”\n\nThat’s when TheMoon’s channel was born. Now, he’s an investor in crypto, but he’s also doing anything imaginable in the industry, from providing liquidity and farming yields to investing in multiple projects, including Kasta, which is a payment app. Kasta comes as an alternative to traditional payment solutions that are part of the system that Runefelt wanted to stand against.\n\nBitcoin Will Never Go Back Below $10K\n\nIn December 2019, CryptoPotato had an interview with The Moon. He then predicted that BTC’s price would go to $200,000 as a great hedge against inflation. Back then, the price was hovering around $7,000.\n\nSince 2019, and especially around the COVID-19 March 20 crash, we saw Bitcoin trading heavily in correlation with the global markets, putting the narrative to question in many people’s view.\n\nNowadays, he maintains that Bitcoin is still a “fantastic hedge against inflation.”\n\n“Bitcoin is the scarcest asset in the whole universe. There is nothing out ther that can compete. However, in the short-term, if you have the stock markets completely collapsed, obviously everything will crash. It’s just how markets work. I think that long-term, Bitcoin is uncorrelated to the stock market and other markets out there.”\n\nDiscussing the possibility of bitcoin going to zero, TheMoon strongly refuted it and even said that he thinks BTC is “never going back down below $10,000.”\n\n“I would suggest that it’s very likely that Bitcoin is going way above a million dollars. I think that even $10 million is where BTC is going.”\n\nSpeaking on his 2019 prediction, Runefelt believes that $200K in the next three years is ‘very possible.’\n\nBuying a CryptoPunk Was a Stupid Mistake\n\nRunefelt has been very vocal about spending $1 million for his CryptoPunk NFT.\n\n“The CryptoPunk I did buy, kind of at the top of the market, and that was a stupid mistake. I kind of regret that I bought it because first of all, I paid a million dollars for it which is way too much for a JPEG, you can say. I have no clue of what its value is right now and I try to maximize its value by at least trying to do some promotion out of it.”\n\nThe Controversy and Criticism After Buying His Bugatti\n\nAt the end of 2021, while the crypto markets saw sharp declines, Runefelt shared on his Twitter profile that he bought a new Bugatti – his dream car – after selling some of his ETH. Many people criticized the move and hinted that it was done to brag.\n\nI just bought my dream Bugatti with #Ethereum 😍 pic.twitter.com/aPjFXaY9WX — The Moon (@TheMoonCarl) December 29, 2021\n\nIn response to this, he explained that the decision came after seeing how much money he made out of Ethereum and that it was time to take some profits and buy his dream car.\n\n“I had a bunch of money that was stored in Ethereum and I thought – why not take some profits, why not buy something that I’ve been dreaming of for years now?”\n\nHe argued that none of it is to brag but rather to inspire other people. Did he convince his followers? Time will tell."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kZXV0c2NoZS1iYW5rLWNyeXB0by1iaXRjb2luLXByaWNlLWp1bmUtMjfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Deutsche Bank crypto plans aid Bitcoin price trip to $27.5K June highs - Cointelegraph",
        "content": "Bitcoin (BTC) achieved new highs for the month after the June 20 Wall Street open as observers stayed cautious on market strength.\n\nBTC/USD 1-day chart. Source: TradingView\n\n“No meaningful trend shift” for Bitcoin yet\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching $27,499 on Bitstamp.\n\nThe pair saw its highest levels since May 31 as the return of United States market trading boosted its performance. Versus the prior day’s lows, gains totaled around 4.2%.\n\nDespite this, wary market participants stopped short of calling even a low-timeframe trend shift.\n\n“It's difficult to look for Daily breakout confirmation for BTC in the context of this blue Lower High diagonal resistance,” trader and analyst Rekt Capital commented alongside an explanatory chart.\n\n“Because $BTC has failed so many post-breakout retests on the Daily timeframe here. Better to watch out for Weekly timeframe confirmation.”\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nIn further Twitter coverage, Rekt Capital added that Bitcoin would have a “good chance” of exiting its current downtrend should strength hold out into the weekly close.\n\n“But no meaningful trend-shift has occurred just yet, despite all the excitement,” he reiterated.\n\nFellow trader Crypto Tony was slightly more optimistic, forecasting a return to $27,500.\n\n“Trend line being broken out as we speak, so let’s see if the bulls have what it takes to turn this into something special,” he commented alongside a chart.\n\n“Remember that $27,100 is a key level for the bulls to flip into support tonight.”\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nNew institutional crypto moves spark distrust\n\nThe uptick accompanied news that Germany’s largest bank, the $1.4 trillion lender Deutsche Bank, had applied for a license to custody crypto assets. This was the third similar announcement of the past week, following exchange-traded fund (ETF) applications from BlackRock and Fidelity Investments.\n\nRelated: Bitcoin price ‘sideways boredom’ may last 18 months — New research\n\nEDX Markets — a new crypto exchange with founding investors including Fidelity, Charles Schwab and Citadel Securities — opened its doors on the day.\n\n“We are committed to bringing the best of traditional finance to cryptocurrency markets, with an infrastructure built by market experts to embed key institutional best practices,” EDX CEO Jamil Nazarali commented in an accompanying press release.\n\nAgainst the backdrop of U.S. regulatory action against two of the biggest extant exchanges, suspicions over the timing of the new products and applications were easy to spot.\n\nI'm sorry, but after watching, Blackrock, Fidelity, Citadel, Schwab and now Deutsche Bank, all apply for #Bitcoin ETFs, spot exchanges, etc. only a few days after the SEC drops a TRO on Binance and sues Coinbase... how can't you think this entire past year was a giant inside job… — Preston Pysh (@PrestonPysh) June 20, 2023\n\nAsset management guru Larry Lepard additionally cited the repeated U.S. rejections of plans by the Grayscale Bitcoin Trust, the largest Bitcoin institutional investment vehicle, to convert to an ETF as food for thought.\n\nOthers were hopeful for the long-term positive impact on BTC price action.\n\n“Bitcoin is bullish. Everything has changed,\" trader and podcast host, Scott Melker, known as “The Wolf of All Streets,” wrote in part of the day’s social media commentary.\n\n“Whether you think the Wall Street intrusion is good or bad is irrelevant... it should help the price of Bitcoin.”\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdGhlZGVmaWFudC5pby9iaXRjb2luLWRvbWluYW5jZS1yaXNlcy10by1oaWdoZXN0LWxldmVsLWluLW92ZXItdHdvLXllYXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 17:26:51 GMT",
        "title": "Bitcoin Dominance Rises To Highest Level In Over Two Years - The Defiant - DeFi News",
        "content": "Whales Have Accumulated $3.5B Of BTC Since April: Santiment\n\nBy: Samuel Haig • Loading...\n\nMarkets\n\nBitcoin now represents more than half of the crypto market for the first time since April 2021, suggesting the most valuable cryptocurrency may be gearing up for a pre-halving bull market.\n\nAccording to TradingView, Bitcoin accounts for 50.06% of the combined market cap from the top 125 digital assets, evidence of BTC’s resilience amid the recent altcoin rout.\n\nBitcoin Dominance\n\nBitcoin’s share of the market crashed from nearly 70% at the start of 2021 and has since oscillated between 40% and 48%.\n\nBitcoin Halving Approaches\n\nBitcoin’s relative outperformance comes as its next halving looms in ten months’ time. The rate of new BTC issued to Proof of Work miners is cut in half every four years, with the event historically foreshadowing new all-time highs for Bitcoin and the broader cryptocurrency markets.\n\nThe Bitcoin network currently issues 6.25 BTC per block or roughly 900 BTC daily. After the next halving, predicted to take place in late April 2024, 3.125 new Bitcoin will enter circulation with each block.\n\nBTC is the 20th-best performing cryptocurrency among the top 100 digital assets by market cap over the past seven days, with a 2.7% gain. Only 29 of the top 100 cryptocurrencies gained more than 1% in a choppy week for markets.\n\nBTC is up 68% since the start of the year, according to The Defiant Terminal.\n\nBTC 2023 Price Action\n\nBlackRock Bitcoin ETF\n\nBitcoin’s price action also follows BlackRock's filing for a Bitcoin exchange-traded fund (ETF), a surge in on-chain activity surrounding digital tokens, and heavy accumulation from whales.\n\nBlackRock, the world’s largest asset manager with $8.6T in assets, filed for a Bitcoin ETF with the U.S. Securities and Exchange Commission on June 15. Coinbase, the top U.S.-based centralized exchange, would provide Bitcoin custody and price data services for the ETF, while BNY Mellon will be its cash custodian.\n\nShares in a Bitcoin ETF would be traded on a traditional exchange, offering retail investors exposure to BTC through a regulated platform. However, the SEC is yet to approve a Bitcoin ETF despite receiving numerous previous applications.\n\nBitcoin Activity Trends Higher\n\nIn April, the number of daily transactions processed by the Bitcoin network surged to all-time highs above 350,000 amid a spike of activity driven by interest in digital tokens.\n\nOrdinals, an inscription method used to create assets resembling NFTs, launched in January, followed in March by the BRC-20 token standard, which drew inspiration from Ethereum’s ERC-20 tokens, giving rise to new use cases for the Bitcoin blockchain.\n\nOn-chain activity peaked at more than 682,000 transactions per day in May and has since cooled off to 415,000 per day.\n\nBitcoin on-chain activity (blue) and BTC price (black)\n\nWhale Accumulation\n\nAccording to Santiment, wallets holding between 1,000 BTC and 10,000 BTC added 131,600 Bitcoin worth $3.5B since April 4. The sum of BTC held by these whales is now at a seven-month high.\n\nNumber of Bitcoin held by wallets containing between 1,000 and 10,000 BTC\n\nETH Posts Modest Inflationary Week\n\nETH posted a modest gain of 2.3% in the past seven daysafter dipping down to $1,630 on Friday. The price of ETH is up 44% since January.\n\nOn-chain activity remains low on Ethereum after the recent wave of memecoin trading appears to have subsided. NFT activity on Ethereum has also fallen 80% since March.\n\nEthereum’s burn rate fell just shy of offsetting new supply issuance over the past seven days, with 23 Ether added to ETH’s circulating supply, according to Ultra Sound Money. Ethereum’s supply is down 281,909 Ether ($487M) since The Merge went live 10 months ago."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZm9ya2FzdC5uZXdzL3dpc2RvbXRyZWUtZmlsZXMtbmV3LXNwb3QtYml0Y29pbi1ldGYtYXBwbGljYXRpb24tZm9sbG93aW5nLWJsYWNrcm9jay_SAV9odHRwczovL2Zvcmthc3QubmV3cy93aXNkb210cmVlLWZpbGVzLW5ldy1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uLWZvbGxvd2luZy1ibGFja3JvY2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "WisdomTree files new spot Bitcoin ETF application following BlackRock - Forkast News",
        "content": "New York-based asset manager WisdomTree has submitted a new application for a spot Bitcoin exchange-traded fund (ETF) in the U.S., less than a week after BlackRock filed its application for a similar spot Bitcoin ETF.\n\nSee related article: BlackRock files for spot Bitcoin ETF, taps Coinbase as custodian\n\nFast facts\n\nWisdomTree said in a Tuesday filing to the Securities and Exchange Commission (SEC) that it plans to launch the “WisdomTree Bitcoin Trust” to be listed on the Cboe BZX Exchange under the ticker “BTCW.”\n\nU.S. Bank National Association will serve as the custodian, according to the filing.\n\n“The bitcoin market has matured such that it is operating at a level of efficiency and scale similar in material respects to established global equity, fixed income and commodity markets,” WisdomTree said in the filing.\n\nThis is not WisdomTree’s first attempt to get a spot Bitcoin ETF approved. In December 2021, the SEC rejected its application, citing a lack of “surveillance-sharing agreements” and market manipulation concerns.\n\nWisdomTree’s application comes after BlackRock, which manages about US$10 trillion as the world’s biggest asset manager, filed last Thursday an application to launch a spot Bitcoin ETF.\n\nEarlier this month, the SEC sued Coinbase and Binance.US., two of the industry’s biggest crypto exchanges, for allegedly breaching securities rules. That adds to uncertainties the SEC will approve BlackRock’s ETF, given that a Coinbase unit would act as custodian for the product.\n\n“BlackRock breathed new life into the race,” Eric Balchunas, a senior ETF analyst at Bloomberg, tweeted Tuesday, reacting to WisdomTree’s ETF filing.\n\nBitcoin gained 7.1% over the past 24 hours to trade at US$28,808 at 10:00 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization has risen 74% so far this year but is still far below its peak at around US$64,000 recorded in November 2021.\n\nSee related article: Citadel, Fidelity, Schwab-backed crypto exchange launches amid U.S. crackdown"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xNDU3MDMvZmVkLWNoYWlyLXBvd2VsbC1zYXlzLWJpdGNvaW4taGFzLXN0YXlpbmctcG93ZXItYXMtYW4tYXNzZXQtY2xhc3PSAWFodHRwczovL2RlY3J5cHQuY28vMTQ1NzAzL2ZlZC1jaGFpci1wb3dlbGwtc2F5cy1iaXRjb2luLWhhcy1zdGF5aW5nLXBvd2VyLWFzLWFuLWFzc2V0LWNsYXNzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Fed Chair Powell Says Bitcoin Has 'Staying Power' as an Asset Class - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFederal Reserve Chair Jerome Powell said on Wednesday that the U.S. central bank should play a “robust federal role” in overseeing stablecoins, a sizable slice of the overall crypto market that legislators are trying to craft rules for. Powell also remarked that cryptocurrencies, like Bitcoin, have \"staying power.\"\n\nHis comments came on Capitol Hill during a semiannual hearing on monetary policy held by the Republican-led House Financial Services Committee and led by Patrick McHenry (R-NC).\n\nResponding to a question posed by Maxine Waters (D-CA) on stablecoins, Powell said the technology—where tokens pegged to the price of a sovereign currency like the dollar and issued by private companies—should have strong federal oversight.\n\nAD\n\nAD\n\n“We do see payments stablecoins as a form of money, and in all advanced economies, the ultimate source of credibility in money is the central bank,” Powell said. “We believe that it would be appropriate to have quite a robust federal role in what happens in stable coins going forward.”\n\nWaters raised concerns that the Fed would be “hamstrung” to do anything if stablecoin issuers could register directly with states—an option currently included in the draft legislation on stablecoins.\n\nPowell signaled the Fed thinks it’s an important part of the regulatory landscape for tokens collateralized by dollars and said, “leaving [the Fed] with a weak role and allowing a lot of private money creation at the state level would be a mistake.”\n\nIn 2021, Powell said before Congress that stablecoins could be a worthy part of the “payments universe,” as opposed to any other type of crypto asset. He went on to say that stablecoins should be regulated in a way that mirrors money market mutual funds and bank deposits.\n\nSince then, several bills that would address stablecoin regulation have stalled out. But after holding a session where lawmakers can iron out proposed changes in July, McHenry said the current stablecoin bill that’s in the works will be advanced to the Senate if a positive consensus is reached.\n\nAD\n\nAD"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tY2FzaC1qdW1wcy0yMS1mb2xsb3dpbmctZWR4LW1hcmtldHMtbGlzdGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Cash jumps 21% following EDX Markets listing - CryptoSlate",
        "content": "Bitcoin Cash (BCH) jumped 21% over the last 24 hours to $127.90 at press time, with analysts attributing the move to its recent listing on legacy-backed exchange EDX.\n\nBitcoin Cash\n\nBitcoin Cash soared as high as $142 on June 21 to mark a 16-week high. This was enough to lead the top 100, with Conflux and Flow taking second and third place.\n\nBCH has been caught in a macro downtrend since February, peaking at a year-to-date high of $154.20.\n\nIn line with market leader Bitcoin, BCH bounced around mid-March as several U.S. banks underwent a series of crises and failures. Still, it could not recapture previous highs, with the $140 zone proving to be strong resistance.\n\nFollowing rejections on March 14 and March 20 at $140, BCH slid lower to find a local bottom at $90.30 some two and a half months later on June 10.\n\nSince then, BCH had begun trending upwards, followed by a 29% swing on the daily June 21 candle that edged just above the previous $140 resistance level before being rejected once more.\n\nEDX Markets\n\nOn June 20, non-custodian cryptocurrency exchange EDX Markets launched, offering institutional users Bitcoin, Ethereum, Litecoin, and Bitcoin Cash trading.\n\nThe exchange caters to institutional clients and is backed by Citadel Securities, Fidelity Investments, and Charles Schwab. Currently, it is not registered with the Securities Exchange Commission (SEC) approved.\n\nThe SEC made headlines in recent weeks for enforcement actions against Binance and Coinbase over allegations of violating securities laws.\n\nOver the last 24 hours, Bitcoin, Ethereum, and Litecoin increased by 7.8%, 5.9%, and 9.4%, respectively, posting significantly fewer percentage gains than Bitcoin Cash.\n\nMentioned in this article"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNDU1NjYvd2lzZG9tdHJlZS1pbnZlc2NvLWZvbGxvdy1ibGFja3JvY2std2l0aC1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uc9IBZmh0dHBzOi8vZGVjcnlwdC5jby8xNDU1NjYvd2lzZG9tdHJlZS1pbnZlc2NvLWZvbGxvdy1ibGFja3JvY2std2l0aC1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9ucz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "WisdomTree, Invesco Follow BlackRock With Spot Bitcoin ETF Applications - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTwo more U.S.-based asset managers moved to file for spot Bitcoin exchange-traded funds (ETFs) in the wake of the investment giant BlackRock making a similar application last week.\n\nBitcoin ETFs are investment vehicles that track the price of the leading cryptocurrency, aiming to provide investors with exposure to the price movements of Bitcoin without requiring them to directly own and store the underlying asset. Instead of purchasing and holding Bitcoin themselves, investors can buy shares of the ETF, which represents ownership of a pool of Bitcoin held by the fund.\n\nETF provider WisdomTree re-submitted an application requesting regulatory approval for the launch of the WisdomTree Bitcoin Trust on Tuesday, June 20. The trust is intended to be listed on the Cboe BZX Exchange under the ticker symbol “BTCW.”\n\nAD\n\nAD\n\nAs stated in its filing, WisdomTree's primary investment objective is to achieve exposure to the price movements of Bitcoin while taking into account the expenses and obligations associated with operating the ETF. The trust plans to determine the daily value of the shares based on the CF Bitcoin US Settlement Price, which consolidates trading data from major Bitcoin spot exchanges.\n\nNew York-based WisdomTree, which currently holds around $93 billion in assets under management, has made two previous attempts to secure approval for a spot Bitcoin ETF. Both applications were rejected by the U.S. Securities and Exchange Commission (SEC) in December 2021 and October 2022, respectively.\n\nInvesco joins the race\n\nInvesco, another major investment company with as much as $1.49 trillion under its management as of May 2023, followed with its own application for a spot Bitcoin ETF later on Tuesday. Invesco initially teamed up with Mike Novogratz’s Galaxy Digital to file for the Invesco Galaxy Bitcoin ETF in September 2021, and now seeks to reintroduce the instrument.\n\nIn its filing, the Atlanta-based firm argues that the lack of a spot Bitcoin ETF “exposes U.S. investor assets to significant risk” as they “are forced to find alternative exposure through generally riskier means.”\n\n“For instance, many U.S. investors that held their digital assets in accounts at FTX, Celsius Network LLC, BlockFi Inc. and Voyager Digital Holdings, Inc. have become unsecured creditors in the insolvencies of those entities,” reads the filing.\n\nAD\n\nAD\n\nTo that end, approval of a spot Bitcoin ETF, according to Invesco, “would represent a major win for the protection of U.S. investors” seeking exposure to crypto assets.\n\nIn the past, the company also filed for a Bitcoin futures ETF, but pulled the plug on the effort in October 2021 after a futures ETF by ProShares was approved and began trading first.\n\nThe SEC has repeatedly denied or postponed decisions on a physical Bitcoin ETF, raising concerns over the cryptocurrency’s volatility and risk of market manipulation. The new wave of applications, spurred by BlackRock’s filing last week, can be seen as a sign of asset management giants acknowledging the growing demand for regulated investment vehicles in the crypto space.\n\nWhether this changes the regulator’s stance on the matter remains to be seen, though.\n\nThe price of Bitcoin continued its upward trajectory following the news, approaching $29,000 after breaking $28,000 for the first time since May 8."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzIwL25ldy1jcnlwdG8tZXhjaGFuZ2UtYmFja2VkLWJ5LWZpZGVsaXR5LXNjaHdhYi1hbmQtY2l0YWRlbC1sYXVuY2hlcy_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yMC9uZXctY3J5cHRvLWV4Y2hhbmdlLWJhY2tlZC1ieS1maWRlbGl0eS1zY2h3YWItYW5kLWNpdGFkZWwtbGF1bmNoZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Crypto Exchange Backed by Fidelity, Schwab and Citadel Launches With Additional Investors - CoinDesk",
        "content": "“What we’re seeing is that increasingly, investors want to trade through their trusted intermediaries and that’s especially true post FTX, which was supposed to be the leader in the digital market. If you can’t trust them, who can you trust?” Nazarali told CoinDesk in an interview in April. “So people are falling back on the firms that have been around for a really long time and that have really stood the test of time and that’s a really important tailwind for us.”"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzIxL3doeS1iaXRjb2luLWNhc2gtY2xlYW5zcGFyay1hbmQtaHV0LTgtbWluaW5nLWNvcnAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Why Bitcoin Cash and Shares of CleanSpark and Hut 8 Mining Are Rising Today - The Motley Fool",
        "content": "What happened\n\nCryptocurrencies and crypto-related stocks moved higher on Wednesday as more traditional financial companies are jumping into the space. The price of the world's largest cryptocurrency, Bitcoin, had blasted over $30,600 as of this writing.\n\nSince late afternoon yesterday, the price of Bitcoin Cash (or BCH, a cryptocurrency created in August 2017 in a hard-fork blockchain split from Bitcoin) was more than 21% higher as of 12:35 p.m. ET today. Meanwhile, shares of the Bitcoin-mining companies CleanSpark (CLSK 3.76%) and Hut 8 Mining (HUT) were up more than 13% and roughly 10.5%, respectively, on the day.\n\nSo what\n\nIn recent weeks, the Securities and Exchange Commission (SEC) has come down hard on the crypto industry, first suing Binance, the world's largest crypto exchange, and then Coinbase Global (COIN -1.72%). This comes after two crypto banks have gone down since the latter part of 2022.\n\nBut the scrutiny seems to have opened the door for more traditional financial firms to enter the fray. Yesterday, news outlets reported that a crypto exchange called EDX Markets, which is backed by Fidelity, Charles Schwab, and Citadel, is now up and running.\n\nAlso yesterday, news outlets reported that Deutsche Bank (DB -0.20%) is now seeking to become a crypto custodian in Germany. In the past, the bank has expressed interest in being a custodian so it could provide clients with \"institutional-grade hot/cold storage solution with insurance-grade protection.\"\n\nBitbank analyst Yuya Hasegawa wrote in a research note today, \"Expectations for the approval of BlackRock's [Bitcoin] Exchange Traded Fund (ETF) and rumors that Fidelity is preparing to apply for a similar ETF have led [Bitcoin] to move steadily since the beginning of the week.\"\n\nBitcoin Cash is leading cryptocurrencies in gains today, likely due to the fact that it is one of the select tokens EDX will offer on its platform to start.\n\nIn other news, CleanSpark announced in a press release today that it will purchase two turnkey Bitcoin mining campuses in Dalton, Georgia, with more than 6,000 mining machines for $9.3 million. The purchase is expected to boost the company's exahash-per-second (EH/S) rate by just under 1 EH/S.\n\nCEO Zach Bradford was quoted as saying: \"This acquisition ensures that we have more than enough infrastructure to reach our year-end target of 16 EH/S. It also continues to position us as one of the most power-efficient miners on an energy-per-hashrate basis.\"\n\nChief financial officer Gary Vecchiarelli said that the company continues to improve its operations in preparation for next year's Bitcoin halving, which many investors view as a catalyst.\n\n\"Importantly, this acquisition is fully paid for from our existing cash reserves, and we expect it to almost immediately start driving revenue to our bottom line,\" Vecchiarelli said.\n\nNow what\n\nThe crypto sector largely seems to be benefiting today from excitement over increased institutional interest in digital assets, which seems like it will be needed given the increased regulatory scrutiny.\n\nCleanSpark is certainly benefiting from its acquisition announcement today, but Bitcoin miners tend to do well when the price of the crypto rises because that is the asset they mine and hold.\n\nUltimately, I prefer to hold the largest, most established cryptocurrencies like Bitcoin over other plays in the space, like Bitcoin miners or altcoins. But I do think CleanSpark is well positioned among its peer group."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xNDU3MDgvYml0Y29pbi1ldGYtdmFsa3lyaWUtdXBkYXRlZC1zZWMtZmlsaW5nLWJycnItZnVuZNIBUWh0dHBzOi8vZGVjcnlwdC5jby8xNDU3MDgvYml0Y29pbi1ldGYtdmFsa3lyaWUtdXBkYXRlZC1zZWMtZmlsaW5nLWJycnItZnVuZD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin ETF Printer Goes ‘BRRR’ as Valkyrie Refiles With SEC - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe sweet, sweet sound of money printing: that’s what one Bitcoin fund captured with the ticker name “BRRR.”\n\nFinancial services firm Valkyrie Digital Assets updated its filing for the Valkyrie Bitcoin Fund on Wednesday with the Securities and Exchange Commission, a fresh prospectus reflecting today’s dominant crypto narrative.\n\nAs digital asset prices punch higher in the wake of BlackRock’s bid to establish America’s first spot-based Bitcoin ETF, and as a Wall Street-backed exchange executes its first trades, Valkyrie reenters the queue alongside other firms with applications for crypto-related, exchange-traded products on the SEC’s desk.\n\nAD\n\nAD\n\n“The shares are designed to provide investors with a cost-effective and convenient way to invest in Bitcoin,” Valkyrie’s filing states. “The shares represent units of fractional undivided beneficial interest in and ownership of the trust.”\n\nThe company says the goal of the Valkyrie Bitcoin Fund is to reflect the price of CME CF Bitcoin Reference Rate - New York Variant (BRRNY), a figure calculated based on trading data aggregated across a handful of major Bitcoin exchanges: Coinbase, Bitstamp, Gemini, itBit, Kraken, and LMAX Digital.\n\nThe filing notes that BRRNY is the same figure that Bitcoin futures contracts are settled on, which trade on the Chicago Mercantile Exchange.\n\nThe updated filing contains a series of changes compared to when it was initially filed in January 2021, including the addition of its cleverly-named ticker. Previously, Valkyrie proposed its fund be listed on NYSE Arca, but now it’s looking at the Nasdaq.\n\nIn past iterations, Valkyrie listed Coinbase Custody Trust Company as the custodian of Bitcoin associated with the fund. But Coinbase’s custody firm is no longer included in the updated prospectus.\n\nAD\n\nAD\n\nIf approved, Valkyrie would be able to issue an unlimited number of shares for the fund, which would have its price updated daily between 4:00 and 4:30 pm ET, when trading on Wall Street comes to a daily close. The fund notes, however, that its ability to gather Bitcoin is limited by the network’s cap of 21 million than can ever be mined.\n\nValkyrie Digital Assets did not immediately respond to a request for comment from Decrypt."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXRhcHMtMzAtay1maXJzdC10aW1lLXNpbmNlLWFwcmls0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price taps $30K for first time since April - Cointelegraph",
        "content": "Bitcoin (BTC) returned to $30,000 after the June 21 Wall Street open in a triumphant continuation of the week’s gains.\n\nBTC/USD 1-day chart. Source: TradingView\n\nBitcoin price destroys traces of multi-week downturn\n\nData from Cointelegraph Markets Pro and TradingView confirmed a new multi-month high of $30,340 on Bitstamp.\n\nBTC price action continued to heat up throughout the day as bulls made the most of strength, which had come thanks to various announcements of legacy finance applying to launch a Bitcoin exchange-traded fund (ETF).\n\nIn so doing, BTC/USD erased many weeks of downside, adding over 20% versus local lows below $24,800 seen on June 15.\n\n$32,000 #BITCOIN IS A MAJOR RESISTANCE ZONE ON BTC, SO THIS IS MY MAIN BITCOIN TARGET\n\n\n\nNO NEED TO GET GREEY ON THIS PUMP. WE KNOW HOW QUICK THINGS CAN CHANGE pic.twitter.com/mdj2YvnakW — Crypto Tony (@CryptoTony__) June 21, 2023\n\nAs traders lined up short-term targets, on-chain monitoring resource Material Indicators focused on $30,000 as an important level to overcome.\n\nUploading a print of the BTC/USD order book on Binance, it noted that “resistance at $30k is building.”\n\n“Watching to see how much bid liquidity moves in to the active trading range to serve as support,” it commented.\n\n“Don’t really expect #JPow to reveal any surprises with his testimony, but these events usually deliver some volatility.”\n\nBTC/USD order book data for Binance. Source: Material Indicators/Twitter\n\nMaterial Indicators referenced ongoing testimony from Jerome Powell, chair of the United States Federal Reserve, before the House Financial Services Committee.\n\nThe U.S. was already a focus for crypto market participants, with the ETF announcements fueling a return to accumulation during Western trading hours.\n\n“The Americans are buying,” Maartunn, a contributor at on-chain analytics platform CryptoQuant, continued.\n\n“The intense bidding on Coinbase that took place yesterday commenced at a similar time as it did today.”\n\nAn accompanying chart showed the premium for BTC/USD on U.S. exchange Coinbase versus largest global crypto exchange Binance, this signaling “strong buying pressure” on the day.\n\nBTC/USD Coinbase premium chart. Source: CryptoQuant\n\nPreviously, Cointelegraph noted the changing possession of the BTC supply from the U.S. to China throughout the past year.\n\n“The real deal”\n\nOthers turned their attention to what they considered more organic BTC price action compared to recent local highs.\n\nRelated: Bitcoin price ‘sideways boredom’ may last 18 months — New research\n\nIn line with popular trader and analyst Rekt Capital, Scott Melker, the trader and podcast host known as “The Wolf Of All Streets,” hoped for continuation.\n\n“This Bitcoin move is spot driven, with minimal liquidations and shorts STILL piling in. Further, spot volume today is as much as yesterday already with 10 hours left in the candle,” he told Twitter followers.\n\n“This is the real deal.”\n\nAn accompanying chart highlighted trading volume on the way up to $30,000.\n\nBTC/USD chart. Source: Scott Melker/Twitter\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vbWFyYXRob24tZGlnaXRhbC1zdG9jay1iaXRjb2luLXByaWNlcy0xNTUzMjAwNDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Marathon Digital stock up after Bitcoin prices surge - Yahoo Finance",
        "content": "Marathon Digital Holdings shares rise after Bitcoin prices surge. This comes following the launch of crypto exchange EDX Markets, backed by several Wall Street firms. Yahoo Finance Live takes a look at Marathon Digital's stock movement.\n\nVideo Transcript\n\n- All right, take a look at Marathon Digital shares up after Bitcoin prices surged above $28,000. The crypto buzz comes after the launch of EDX markets, a crypto exchange backed by Wall Street firms including Charles Schwab and Citadel Securities. Investors are feeling confident about the institutional interest in the crypto sector which could secure its future in US crypto stocks, some of which have been under pressure since the Securities and Exchange Commission charged Coinbase and its rival Binance for allegedly selling unregistered securities. Still, some investors worry that the crypto buzz might not last given the regulatory pressures that shape the industry."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzIwL2JpbmFuY2Utc2V0cy11cC1iaXRjb2luLWxpZ2h0bmluZy1ub2Rlcy10by1lYXNlLWRlcG9zaXRzLWFuZC13aXRoZHJhd2Fscy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yMC9iaW5hbmNlLXNldHMtdXAtYml0Y29pbi1saWdodG5pbmctbm9kZXMtdG8tZWFzZS1kZXBvc2l0cy1hbmQtd2l0aGRyYXdhbHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Binance Sets Up Bitcoin Lightning Nodes to Ease Deposits and Withdrawals - CoinDesk",
        "content": "In May, Binance said it would integrate the Lightning network to ease deposit and withdrawal activity for users. Binance had temporarily paused bitcoin withdrawals citing network congestion at the time – which led to concerns among users around the exchange’s reserve funds."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jbGVhbnNwYXJrLWJ1eXMtdHdvLWJpdGNvaW4tbWluaW5nLWNhbXB1c2VzLWdlb3JnaWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "CleanSpark buys two Bitcoin mining campuses for $9.3M - Cointelegraph",
        "content": "Update (June 22 at 14:27 UTC): This article has been updated to clarify that CleanSpark purchased the facilities for proprietary mining only.\n\nCrypto mining firm CleanSpark is moving forward with its aggressive infrastructure expansion in the United States by acquiring two Bitcoin (BTC) mining facilities in a $9.3 million cash deal.\n\nAccording to a June 21 announcement, the two facilities CleanSpark will purchase are turnkey Bitcoin mining campuses in Dalton, Georgia. The facilities will house 6,000 Antminer S19 XPs and S19J Pro+s, which are expected to add about 1 exahash per second (EH/s) to CleanSpark’s hash rate following the deal’s completion. According to Zach Bradford, CEO of CleanSpark, the newly acquired infrastructure will enable the company to reach its target of 16 EH/s by the end of the year.\n\nThe purchase follows several other acquisitions by CleanSpark in recent months, despite a slump in BTC mining profitability during the bear market. In April, the company announced the purchase of 45,000 Antminer S19 XP rigs for $144.9 million, which is expected to add 6.4 EH/s of mining power.\n\nIn February, CleanSpark added 20,000 new Antminer S19j Pro+ units to its portfolio for $43.6 million, expected to bring an additional 2.44 EH/s to its computing power. A few weeks earlier, the company announced a $16 million expansion at its Georgia facility, with 15,000 new rigs.\n\nThe profitability of Bitcoin mining has dropped to $0.066 per TH/s per day at the time of writing, down from its $0.40 peak in June 2019, according to data from Hashrate Index.\n\nBitcoin Hashprice over the past 5 years. Source: Hashrate Index\n\nWith the fast-paced miner expansion, CleanSpark said it anticipates being well-positioned for next year’s Bitcoin halving, expected between April and May 2024. The next halving will reduce Bitcoin block rewards to 3.125 BTC.\n\nBitcoin’s price has historically spiked post-halvings, as they reduce the cryptocurrency’s supply while demand generally remains steady. “We continue to make use of opportunities created by current market conditions to prepare for next year’s bitcoin halving,” CleanSpark chief financial officer Gary Vecchiarelli said.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNjbi5jb20vYml0Y29pbi13aW5uZXItZm9sbG93aW5nLXNlY3Mtd2FyLXdpdGgtYWx0Y29pbi1zZWN1cml0aWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Will Bitcoin be the Big Winner Following SEC's War with Altcoin Securities? - CCN.com",
        "content": "Key Takeaways\n\nBitcoin has been shielded from the SEC’s crusade\n\nWhy the SEC considers Bitcoin a commodity, unlike altcoins\n\nBitcoin, the last coin standing\n\nEver since the creation of Bitcoin in 2009, it has been the hallmark name for cryptocurrencies, rendering itself permanently present in any discussion. Bitcoin has also somehow avoided scrutiny throughout the regulatory debacle created by the US Securities and Exchange Commission. All factors considered, could Bitcoin emerge victorious following the SEC war against cryptocurrencies?\n\n“Bitcoin Is A Commodity”\n\nIn an interview with CNBC, SEC Chair Gary Gensler declared that Bitcoin, unlike Altcoins considered by previous SEC leaders, is a commodity. Gensler reported that “Some, like bitcoin, and that’s the only one, Jim, I’m going to say because I’m not going to talk about any one of these tokens [that] my predecessors and others have said [are] a commodity.” This could be in reference to previous SEC Director William Hinman’s speech that based his argument regarding the securities vs commodities argument on Ether.\n\nThere’s also a pattern worth noting; throughout the current war the SEC is waging against the crypto trading industry, the commission has mainly focused on altcoins, such as XRP, which is the central argument point in their case against US-based crypto exchange Ripple.\n\nMoreover, another major international crypto exchange, Binance, was also on the receiving end of the SEC’s attack on crypto. While the legal battle marginally influenced the price of Bitcoin, it took a much heavier toll on Binance’s own token, BNB.\n\nEven before being positioned as Chair of the SEC, Gary Gensler was seen in a presentation mentioning a handful of cryptocurrencies that he declared as “not securities”. Two of the four cryptocurrencies mentioned by Gensler during his presentation were Bitcoin and Bitcoin Cash. Perhaps the SEC Chair is regularly creating stricter rules on crypto trade, but Bitcoin has somewhat, so far, emerged virtually unscathed by the crossfire between crypto exchanges and their assigned regulating commission.\n\nWhy Bitcoin Specifically Though?\n\nCould it be that Bitcoin simply holds the First Mover advantage on the market? Being the first proof of concept, Bitcoin, created by Satoshi Nakamoto, showed what a truly decentralized currency would look like. And, although the currency has fluctuated in price over the years, it has maintained a much higher value than that of any altcoins in testimony to its popularity among any of its counterparts.\n\nIn an interview with Bloomberg, Business-intelligence firm MicroStrategy’s (MSTR) Founder and Executive Chairman Michael Saylor pointed out the struggles Altcoins deal with when it comes to SEC regulations, as opposed to Bitcoin. “I think it’s pretty clear that the regulators don’t see a legitimate path forward for cryptocurrencies like the stablecoins, crypto securities, like the tokens mentioned. They don’t have any love for crypto derivatives. They don’t have any love for crypto tokens.” He also added, “I mean their view is crypto exchanges should changes should trade and hold pure digital commodities like Bitcoin and so the entire industry is kind of destined to be rationalized down to a Bitcoin-focused industry with maybe a half a dozen to a dozen other proof of work tokens.”\n\nSaylor’s view summarizes the current situation with the SEC, which is adamant about combating crypto exchanges on any cryptocurrency besides Bitcoin. Proof of such a view can be seen when the government itself was seen selling Bitcoins on one of the crypto exchange platforms it’s currently in legal arms with, Coinbase. Whether this view would change with the potential leadership change at the SEC is something only time will tell."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy93aHktYml0Y29pbnMtY3J5cHRvLWRvbWluYW5jZS1pcy1hLXNpZ24tb2Ytd2lkZXItYWRvcHRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Why Bitcoin's dominance in crypto is a sign of wider adoption - DLNews",
        "content": "Bitcoin’s share of the total crypto market has risen alongside its price this year to date.\n\nThe cryptocurrency’s dominance and on-chain metrics are showing positive signals according to experts.\n\nInvestors are flocking to Bitcoin.\n\nThe top cryptocurrency has soared about 60% this year, fuelled in part by a flurry of big finance moves into crypto, most notably BlackRock’s plan to launch a Bitcoin exchange-traded fund.\n\nThat has led Bitcoin, or BTC, to strengthen its dominance in crypto markets. Bitcoin’s dominance, the market capitalisation of Bitcoin relative to the total crypto market cap, jumped past 50% this week, for the first time since 2018.\n\nNormally, this is a sign of a “weak market,” said macro analyst Noelle Acheson on Twitter, as investors pull out of riskier tokens leaving Bitcoin as the relatively safer dominant trade.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nIndeed, K33 research said that since the US Securities and Exchange Commission slapped lawsuits against exchanges Binance and Coinbase earlier this month, a shift to Bitcoin and stablecoins “has been a key trend” as investors scramble to relative safety.\n\nNOW READ: Bitcoin’s ‘digital gold’ narrative sees renaissance — even as pro traders balk\n\nBut this time, Acheson said of the Bitcoin dominance: “It signals the consolidation of an inflection point, with BTC leading the beginning of a rally as the main ‘onramp’ into the crypto-asset investing world.”\n\nShe noted, citing data firm Paradigm, that traders are piling into bullish June 30 call options that pay off when Bitcoin rallies.\n\nJoin the community to get our latest stories and updates\n\nAnd holders are putting their Bitcoin into wallets and keeping it there. Such “illiquid supply” reached a record 15.2 million Bitcoin this week. Around 146,000 Bitcoin a month is flowing into wallets with very little history of spending. Glassnode says that signals a steady and gradual accumulation by long-term holders.\n\nBitcoin “liveliness,” which shows the propensity of Bitcoin holders to spend or hold their coins, is currently at a multi-year macro downtrend. It peaked in May 2021 when the bear market first set in, Glassnode said.\n\nThe data analytics firm notes this is a trend that typically acts as a precursor to a bull cycle.\n\nBitcoin has been a bright spot in an otherwise grim year for crypto traders.\n\nWhat started with scandals and lawsuits after the collapse of FTX in November has snowballed. Trading volume hit a three-year low in May. The SEC’s crypto crackdown has led exchanges to de-list tokens.\n\nBitcoin users are looking to April when Bitcoin’s “halving” is expected to boost its price even further. The halving refers to when the reward for securing the Bitcoin blockchain will fall to 3.125 Bitcoin from 6.25. As a result, the amount of new Bitcoin being created every day will fall.\n\nCurrently around 144 blocks are mined a day, at 6.25 Bitcoin per block which equates to 900 new Bitcoin a day on average. Coinbase Institutional’s head of research, David Duong, said in a recent report that the halving could have a positive impact.\n\nJPMorgan analysts argue the halving could see Bitcoin’s price jump to between $40,000 and $45,000 given the cost of production’s tendency to act as a price floor for the asset. The cost of production for miners will increase as the reward drops, rising to around $40,000.\n\nBitcoin market price and average cost of production (JPMorgan)\n\nPaul Howard, head of sales at Standard Chartered’s Zodia Markets, and a former trading executive at Goldman Sachs and Morgan Stanley, told DL News that he expects crypto prices to trade in a range between $22,000 and $32,000 leading up to the halving.\n\nNOW READ: Deutsche Bank, Citadel Securities signal the crypto land grab is accelerating\n\nInvestors in other crypto assets are bracing for the rest of 2023 as Bitcoin users look ahead. What’s not helping: the Fed signalled two more interest rate hikes before the year is out. That spooked investors in riskier assets among broader financial markets.\n\nFederal Reserve Chair Jerome Powell is expected to push again his higher-for-longer message on Wednesday in his two days of congressional testimony on monetary policy.\n\nNo sure bet\n\nBitcoin’s halving is no sure bet. Bitcoin’s big supply-side event next year might not be the panacea crypto natives hope for.\n\nFor one, Duong questioned the speculative nature of the halving.\n\n“With only three halving events historically, we have yet to see a clear pattern fully emerge, particularly as previous events were contaminated by factors like global liquidity measures,” he said.\n\nThis time around it looks like global liquidity has peaked in the near term, Duong said, and with another nine months or so until the halving it is “unclear what the net effect on Bitcoin’s price behaviour might be.”\n\nOther alternatives\n\nStill, investors seeking Bitcoin alternatives are running out of options. Howard said that 98% of what he called “junk coins, are just that,” and “probably mostly worthless” by 2024.\n\nTether has gained, and its total circulating supply reached a record recently.\n\nTether circulating supply grows versus competitors\n\nThe stablecoin, which comes with its own potential problems, benefited from investors selling Circle’s USDC after it depegged in March and Binance USD slowly being removed from circulation.\n\nThe rotation into these cryptocurrencies leaves altcoins thin on liquidity — traders dumped Polygon, Cardano, and Solana because they were named in the SEC’s lawsuit.\n\nCelsius could allow creditors to swap their altcoins into BTC and ETH starting on July 1 — creating around $218 million in sell-side pressure.\n\nDuong said decisions like this have impacted altcoin liquidity. Meanwhile, big financial firms are piling into both the infrastructure and Bitcoin offerings. WisdomTree, Deutsche Bank and Citadel Securities all made big moves in the crypto space this week.\n\nNOW READ: BlackRock’s Bitcoin ETF surprise sets up battle with Gensler’s SEC\n\nThe overall ecosystem, with Bitcoin at the helm, is in uncharted territory, noted Bernstein analysts this week:\n\n”Multiple traditional institutions have remained engaged in their crypto strategy and build-out through this winter, which is unlike any other crypto bear market in the past.”\n\nTo share tips or information about Bitcoin or another story please contact the author at adam@dlnews.com."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi1mdWVscy0yOS1rLWJ0Yy1wcmljZS1icmVha291dNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin ETF impulse fuels 'fantastic' $29K BTC price breakout - Cointelegraph",
        "content": "Bitcoin (BTC) hit $29,000 on June 21 as large scale buying fueled a fresh sentiment boost.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nAnalyst: $29,000 becoming fakeout “very unlikely”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching $29,014 on Bitstamp — its highest since May 7.\n\nThe pair enjoyed continued buyer interest overnight, following multiple announcements concerning new Bitcoin-focused institutional investment products.\n\nThis is not a short squeeze, but someone(s) is just buying $BTC a lot.\n\n\n\nI repeat.\n\n\n\nThis is not a short squeeze, but someone(s) is just buying $BTC a lot.https://t.co/gkt9JiizM3 https://t.co/46KZRb0AMS pic.twitter.com/mPZzN317A8 — Ki Young Ju (@ki_young_ju) June 21, 2023\n\nFor analysts who were previously concerned about overall market strength, the latest action was cause for a modest rethink.\n\n“Fantastic BTC breakout beyond the multi-month downtrend,” popular trader and analyst Rekt Capital reacted.\n\n“Very unlikely this will end up as an upside wick like in previous months.”\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nThe day prior, with upside already in motion, Rekt Capital had cautioned that the weekly candle close was necessary to confirm a substantial trend change.\n\n“A BTC Weekly Candle Close beyond the multi-month downtrend would be a great breakout confirmation. That said, a $BTC dip into the downtrend for a successful retest would offer full confirmation of breakout,” he now added.\n\n“The retest area is ~$26800.”\n\nFellow trader Crypto Tony meanwhile continued that Bitcoin could hit his upside target “earlier than anticipated.“\n\n“As i said, if we did not lose the support zone on Bitcoin at $25,000, then there is no bearish control just yet,” he reasoned.\n\n“Soon as we saw the bulls step in, that was our cue to long. Plan and Execute.”\n\nOthers were more conservative, with both Daan Crypto Trades and Michaël van de Poppe, founder and CEO of trading firm Eight, revealing closed long positions at the $29,000 mark.\n\nVan de Poppe nonetheless stated that BTC/USD was now on its way to $38,000 or higher.\n\nShort-term holder support proves itself\n\nRegarding support levels, on-chain analytics firm Glassnode took the opportunity to underscore the significance of the short-term holder (STH) cost basis.\n\nRelated: Bitcoin price ‘sideways boredom’ may last 18 months — New research\n\nAt $26,400, the STH cost basis was now a formidable line in the sand, with BTC/USD rebounding strongly after placing STHs in unrealized loss territory.\n\n“26,550 remains a significant baseline in determining market trend,” Glassnode tweeted, referring to previous research covered by Cointelegraph.\n\n“The recent deviation below the STH-CB was not decisive, culminating in a reclamation of the prevailing uptrend.”\n\nBitcoin short-term holder data annotated chart. Source: Glassnode/Twitter\n\nThe 200-week moving average (MA), another key bear market support line, also sits near the mid-$26,000 zone.\n\nBTC/USD 1-day chart with 200-week MA. Source: TradingView\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNyb3NzZXMtMjlrLWZpcnN0LXRpbWUtMTI1MzE0NTEwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Crosses $29K for First Time in Over a Month - Yahoo Finance",
        "content": "Bitcoin (BTC), the world’s largest cryptocurrency by market value, has rallied above $29,000 for the first time in over a month. This comes following an uptick in bullish sentiment in the crypto market as traditional finance (TradFi) players push further into crypto.\n\nLast week, investment giant BlackRock (BLK) filed for a U.S. bitcoin exchange traded fund (ETF) and on Tuesday, Deutsche Bank said it had applied for a digital asset custody license in Germany.\n\nAdding to this, crypto exchange EDX Markets, which received funding from financial heavyweights including Charles Schwab (SCHW), Citadel Securities and Fidelity Digital Assets, started its trading services.\n\nBitcoin appears to have outperformed the majority of other digital assets following these advancements, gaining over 8% in 24-hours and pushing to a level it has not seen since May 6, 2022.\n\nSome traders see further gains ahead, with the cryptocurrency possibly approaching $30,400.\n\nRead more: Bitcoin Trendline Breakout Suggests Continued Rally to $30.4K: Analyst"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaW5hbmNlLWxpZ2h0bmluZy1uZXR3b3JrLW5vZGVzLWZvci1lbmhhbmNlZC1iaXRjb2luLXRyYW5zYWN0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Binance to implement Lightning Network nodes for enhanced Bitcoin transactions - Cointelegraph",
        "content": "On June 20, cryptocurrency exchange Binance announced that it had commenced operating nodes on the Bitcoin Lightning Network as a crucial step toward integrating it for deposits and withdrawals.\n\nIn a tweet, Binance acknowledged users who noticed their new Lightning nodes and confirmed their presence. However, Binance highlighted that additional technical work must be completed before the Lightning integration is fully implemented, promising to provide updates along the way.\n\n#Binance is working to integrate the #Bitcoin Lightning Network for deposits and withdrawals.\n\n\n\nSome eagle-eyed users spotted our new lightning nodes recently. Yes - that's us!\n\n\n\nHowever, there's still more tech work to be done. We'll update once Lightning is fully integrated. https://t.co/N0oN8561sN — Binance (@binance) June 20, 2023\n\nIn response to the congestion witnessed on the Bitcoin (BTC) network on May 7, Binance announced its plans to incorporate the Lightning Network to alleviate bottlenecks. In a tweet, Binance mentioned its ongoing efforts to enable BTC Lightning Network withdrawals, recognizing its potential in such situations. The increased congestion was primarily caused by a surge in BRC-20 transactions, with the popularity of memecoins being a contributing factor.\n\nThe Bitcoin Lightning Network is a layer-two protocol built on the Bitcoin blockchain to address scalability issues. It allows participants to create payment channels, conduct off-chain transactions quickly and inexpensively, and settle the channels on the Bitcoin blockchain when necessary. The Lightning Network aims to enhance the speed, scalability and privacy of Bitcoin transactions, making it more efficient for microtransactions while reducing fees and congestion on the main network.\n\nRelated: Binance’s BNB Chain introduces layer-2 testnet powered by Optimism\n\nRecently, Binance has been entangled in a legal battle with the United States Securities and Exchange Commission (SEC), causing a period of uncertainty for the company. However, there is a sense of relief after Judge Amy Berman Jackson of the U.S. District Court for the District of Columbia approved a consent agreement between Binance, Binance.US and the SEC. The agreement effectively dismissed a temporary restraining order filed by the SEC that would have frozen all Binance.US assets.\n\nMagazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL21hcmtldHB1bHNlLmNvbS9uZXdzZmVlZC9yaXNrLWF2ZXJzaW9uLXdlaWdoLW9uLW9pbC1hbmQtZ29sZC1iaXRjb2luLXJpc2VzLW9uLWJsYWNrcm9jay1wbGFubmVkLWV0Zi1hbmQtZWR4LWxhdW5jaC9lbW95YdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Risk aversion weigh on oil and gold, Bitcoin rises on BlackRock planned ETF and EDX launch - MarketPulse",
        "content": "Oil\n\nCrude prices are lower on disappointment with the size of cuts with China’s key lending rates. ​ Oil seems locked in on anything and everything that has to do with China. ​ Last week, oil was supported by improving Chinese refiner quotas. ​ This week, energy traders are seeing oil weakness emerge on disappointing stimulus efforts. ​ WTI crude looks like it is starting to find some decent support at the $68 region and that should hold as long the Fed does spook markets that they might be ready to deliver more than two additional rate hikes. ​\n\nGold\n\nThe gold bears are in control and momentum selling doesn’t seem to care that stocks are softer and as Treasury yields come down. ​ Wall Street is still thinking that the Fed will only deliver one more quarter-point rate rise but no one wants to be long gold before what will likely be a shortened week of hawkish Fed speak. ​ Fed Chair Powell will defend his FOMC performance. Fed’s Waller will stick to his stance of supporting further hikes. ​ Fed’s Goolsbee might be closer to supporting a pause. ​ A temporary rebound in housing data might push Fed’s Bowman might wait to see if that impacts the trend of lower rents. ​ ​ Fed’s Mester has been a true hawk and probably won’t say she sees a reason to pause rate hikes. ​ Fed’s Bullard will likely confirm he still supports two more rate hikes. ​\n\nIf gold selling accelerates, it could get ugly as major support won’t appear until the $1900 region. ​\n\nBitcoin\n\nBitcoin is slightly higher as the cryptoverse embraces BlackRock’s ETF filing and as EDX crypto exchange goes live. ​ Given the risk-off start to the trading week, Bitcoin’s slight gain is a positive sign. ​ Bitcoin still seems poised to consolidate here but it could start to muster up a rally if gold remains under pressure and if investors grow cautious with the potential headwinds for the stock market. ​ ​\n\nContent is for general information purposes only. It is not investment advice or a solution to buy or sell securities. Opinions are the authors; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. If you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please access the RSS feed or contact us at info@marketpulse.com. Visit https://www.marketpulse.com/ to find out more about the beat of the global markets. © 2023 OANDA Business Information & Services Inc."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xNDU1OTAvYml0Y29pbi1jYXNoLXN0YWNrcy1hbmQtb3RoZXItYWx0cy1qdW1wLWFzLWJpdGNvaW4tYnJlYWtzLWFib3ZlLTI5MDAw0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NTU5MC9iaXRjb2luLWNhc2gtc3RhY2tzLWFuZC1vdGhlci1hbHRzLWp1bXAtYXMtYml0Y29pbi1icmVha3MtYWJvdmUtMjkwMDA_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Cash, Stacks, and Pepe Lead Alts Parade as Bitcoin Breaks Above $29,000 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe rest of the market has caught the wave as Bitcoin today broke above $29,000—the first time since May—following a number of high-profile exchange-traded fund (ETF) filings in the States.\n\nThat means a couple of usually sleepy altcoins are surging.\n\nBitcoin Cash, a Bitcoin spin-off which has struggled to find a market since launching in 2017, is the third-best performing cryptocurrency in the past day: It's up 26% in 24 hours, trading for over $130, according to CoinGecko.\n\nAD\n\nAD\n\nBitcoin, the biggest cryptocurrency, is only up by about 10% in the past day.\n\nBitcoin Cash's price surge might have something to do with it being one of the assets offered by EDX Markets—a new exchange backed by Fidelity, Charles Schwab and Citadel Securities which launched yesterday.\n\nThe exchange is aiming to draw in institutional clients by \"bringing the best of traditional finance to cryptocurrency markets,\" in the words of its CEO Jamil Nazarali.\n\nAccording to CoinGecko data, a third of the Bitcoin Cash trading is taking place on the world's biggest crypto exchange, Binance, with investors primarily executing their BCH trades with stablecoin Tether.\n\nOther altcoins jumping in price include Stacks (STX), the native token powering the Bitcoin-adjacent Stacks blockchain, which is up more than 19%, trading for around $0.75.\n\nAD\n\nAD\n\nAnd recent degen darling Pepe, a meme coin which launched in April and experienced an explosion in price, is also one of the best performing cryptocurrencies: It's up more than 18% in 24 hours.\n\nThe global cryptocurrency market cap today is $1.19 Trillion, a 6.5% increase in 24 hours, according to CoinGecko.\n\nBitcoin surged past $30,000 per coin in April—the first time it had done so in 10 months. But it struggled to maintain its momentum as regulatory headwinds frightened away investors. The U.S. Securities and Exchange Commission has hit a number of major crypto companies with lawsuits this year, including Binance and Coinbase.\n\nBut the asset is now fast closing in on the $30,000 mark again, and was trading for $29,473 at the time of writing."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMisQFodHRwczovL3d3dy5saXZlbWludC5jb20vbWFya2V0L3N0b2NrLW1hcmtldC1uZXdzL2JpdGNvaW4tcHJpY2UtaGl0cy1zaXgtd2Vlay1oaWdoLW9uLWNyeXB0by1pbml0aWF0aXZlcy1ieS1maW5hbmNpYWwtdGl0YW5zLWV0aGVyZXVtLXVwLTQtb3RoZXItdG9rZW5zLXJhbGx5LTExNjg3MzI2MjA5MTk1Lmh0bWzSAbUBaHR0cHM6Ly93d3cubGl2ZW1pbnQuY29tL21hcmtldC9zdG9jay1tYXJrZXQtbmV3cy9iaXRjb2luLXByaWNlLWhpdHMtc2l4LXdlZWstaGlnaC1vbi1jcnlwdG8taW5pdGlhdGl2ZXMtYnktZmluYW5jaWFsLXRpdGFucy1ldGhlcmV1bS11cC00LW90aGVyLXRva2Vucy1yYWxseS9hbXAtMTE2ODczMjYyMDkxOTUuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price hits six-week high on crypto initiatives by financial titans; Ethereum up 4%, other tokens rally | Mint - Mint",
        "content": "Bitcoin price jumped to a six-week high as sentiment in the crypto market improved after interest from major players from the traditional financial sector.\n\nThe world’s largest digital asset gained over 7% to above $28,850. Its market value jumped to $559.5 billion. Bitcoin prices have rallied more than 70% this year so far.\n\nAmong smaller coins, Ethereum, the second largest virtual currency, rose nearly 5% to $1,813.79 with a market capitalisation of $218.3 billion. Cardano and Solana also traded over 7% and 4% higher, respectively.\n\nCrypto market was buoyed on the back of the start of EDX Markets, a digital-asset exchange backed by firms including Citadel Securities, Fidelity Digital Assets and Charles Schwab Corp.\n\nMoreover, BlackRock Inc. and WisdomTree Inc. have applied in quick succession to launch spot US Bitcoin exchange-traded funds, Bloomberg reported.\n\nRead here: BlackRock files paperwork for spot bitcoin ETF: Report\n\nThe entry of traditional institutions in the crypto market fuelled optimism among digital asset investors after the gloom caused by a US Securities and Exchange Commission’s crypto crackdown.\n\nEarlier, the US regulator had filed lawsuits against exchange operators Binance Holdings Ltd. and Coinbase Global Inc. and designated a raft of digital tokens as unregistered securities.\n\nA rout in crypto last year erased $1.5 trillion and contributed to blowups such as the bankruptcy of the FTX exchange. Bitcoin remains far below its pandemic-era, liquidity-fueled 2021 peak of almost $69,000, the Bloomberg report said.\n\nRead all Cryptocurrency market-related news here\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4taG9sZHMtMDIwODQ2MjY2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Firm Above $30.1K as Investors Relish BlackRock, Other Spot BTC ETF Filings - Yahoo Finance",
        "content": "Good morning. Here’s what’s happening:\n\nPrices: Bitcoin surged over $30.7K before settling nearer to $30K as investors savored news of multiple spot bitcoin ETF filings.\n\nInsights: Crypto has been \"going through a crisis of confidence, but recent filings for spot bitcoin ETFs have helped energize crypto markets, says eToro U.S. investment analyst Callie Cox.\n\nPrices\n\nCoinDesk Market Index (CMI)\n\n1,235\n\n+53.7 ▲ 4.5%\n\nBitcoin (BTC)\n\n$30,139\n\n+1368.5 ▲ 4.8%\n\nEthereum (ETH)\n\n$1,916\n\n+108.3 ▲ 6.0%\n\nS&P 500\n\n4,365.69\n\n−23.0 ▼ 0.5%\n\nGold\n\n$1,944\n\n+8.3 ▲ 0.4%\n\nNikkei 225\n\n33,575.14\n\n+186.2 ▲ 0.6%\n\nBTC/ETH prices per CoinDesk Indices, as of 7 a.m. ET (11 a.m. UTC)\n\nBitcoin Returns to Its Perch Above $30K\n\nAfter weeks of gloom, bitcoin surged for a second consecutive day as investors drew confidence from spot BTC ETF applications by BlackRock and other large asset management firms.\n\nThe largest cryptocurrency by market capitalization was recently trading at about $30,140, up nearly 5% over the past 24 hours. BTC last cracked the $30,000 threshold in April.\n\nBitcoin began rising Tuesday after the long, U.S. Juneteenth holiday weekend as markets more fully digested the impact of the BlackRock filing. Later in the day, spot bitcoin re-filings by Invesco and WisdomTree brightened the mood further, offering the latest evidence of institutional investors' growing interest in the crypto space even as markets have struggled amid an uncertain regulatory environment, pesky inflation and other macroeconomic woes.\n\nRead More: Invesco Reapplies for Bitcoin ETF, Advocates for More Crypto Investment Products\n\n“There is a wave of optimism in the crypto market now that big institutional players are working to take part in the industry in a big way,\" Nihar Neelakanti, the CEO and co-founder of carbon-backed digital collectibles Ecosapiens, wrote in an email to CoinDesk.\n\nStory continues\n\nNeelakanti also also noted \"rumors\" that Fidelity might also apply for an ETF. On Tuesday, a Fidelity spokesperson told CoinDesk that the firm had not publicly announced any plans to file. Invesco, which has $1.4 trillion in assets under management, filed its application in conjunction with digital asset manager Galaxy Digital. The Securities and Exchange Commission (SEC) rejected WisdomTree's first spot bitcoin ETF application in 2022.\n\n\"These players, among other big names, are obviously going to add a lot of liquidity to the market and make investors more confident to buy bitcoin again,\" Neelakanti wrote. \"And big institutions partnering with crypto are going to continue to be a catalyst for bitcoin for the foreseeable future, even as the U.S. regulatory situation continues to cause some hardship for the industry.\"\n\nEther enjoyed a similarly upbeat Wednesday to continue its momentum. The second largest crypto in market value was recently changing hands above $1,900 for the first time in three weeks, up more than 6% from Tuesday, same time. Other large cryptos spent the day in deep green territory with ADA and MATIC, the native cryptos of smart contract platforms Cardano and Polygon, each up more than 7%, along with popular memecoin DOGE. The CoinDesk Market Index, a measure of crypto markets performance, was recently up more than 5%.\n\nU.S. stocks veered from their weeks-long winning ways to tick down with tech stocks leading the decline. The technology heavy Nasdaq Composite and S&P 500, closed off 1.2% and 0.5%, respectively. Asia markets opened on a sour note with the Hang Seng and Shanghai indexes recently falling about 2% and 1.3%, respectively\n\nEcosapiens' Neelakanti believes that TradFi will take advantage of \"regulatory pressure on crypto\" to unveil new digital asset initiatives, although he is uncertain of these partnerships long-term benefit. He added, however that every crypto \"wave\" has drawn new participants.\n\n\"The last wave was a lot of retail speculators, and this fits a pattern of how new asset classes develop over time,\" he wrote. \"You have early believers, then more retail people, and then the third wave of more institutions getting into the fold. We’re starting to see the beginnings of the third wave now. And this wave will include the big institutions, but also 401Ks and other major types of funds like pension funds and university endowments.”\n\nBiggest Gainers\n\nBiggest Losers\n\nThere are no losers in CoinDesk 20 today.\n\nInsights\n\nCrypto's \"Crisis of Confidence\" and the Rush of Spot Bitcoin ETF Filings\n\nCryptos have been \"going through a crisis of confidence,\" yet the past week's \"rush of filings for spot bitcoin ETFs has returned \"some excitement\" into the markets, especially into \"well-known,\" quality coins like Bitcoin and Ethereum,\" Callie Cox, U.S. investment analyst for social investing platform eToro, told CoinDesk TV's \"First Mover\" program on Wednesday.\n\n\"Institutional lenders, where this industry grows, whether you like it or not, that's the history for many emerging markets,\" Cox said. \"And the fact that some of the largest issuers in the world are stepping in and saying, 'we want to offer this product,' tells you something about pent-up demand, or demand from investors who might not be comfortable trading spot crypto.\"\n\nLast Thursday, the iShares unit of fund management giant BlackRock (BLK) filed paperwork with the U.S. Securities and Exchange Commission (SEC) for the formation of a spot bitcoin (BTC) ETF. Earlier this week, investment management companies Invesco (IVZ) and WisdomTree refiled for spot ETFs.\n\nIVZ, which has $1.4 trillion assets under management, is working in conjunction with digital asset manager Galaxy Digital. It first filed for a spot bitcoin ETF in 2021. The Securities and Exchange Commission (SEC) denied WisdomTree's first application 2022, amid a flurry of rejections.\n\nThe surge in institutional interest followed closely after ongoing U.S. regulatory scrutiny seemed to reach new heights earlier this month with SEC lawsuits against exchanges Binance and Coinbase, leaving markets in a funk.\n\nAfter rising strongly over the first four months of the year, bitcoin, ether and most other major assets inched downward with BTC recently dropping below $25,000 for the first time since mid March as investors contemplated the SEC's increasing scrutiny, inflation and other macroeconomic uncertainties. But even as the wider environment clouded over, institutional interest has continued to percolate.\n\nCox views the ETFs as \"a positive sign,\" and believes the market is as well. \"It shows that Wall Street still believes in certain parts of crypto and that it's not like the price of Bitcoin is going to zero. We need to understand what the value is. There is value.\"\n\nImportant events.\n\n3:30 p.m. HKT/SGT(7:30 UTC) Swiss National Bank Interest Rate Decision\n\n7:00 p.m. HKT/SGT(11:00 UTC) England Monetary Policy Summary\n\n7:30 a.m. HKT/SGT(23:30 UTC) Japan National CPI ex-Fresh Food (YoY/May)\n\nCoinDesk TV\n\nIn case you missed it, here is the most recent episode of \"First Mover\" on CoinDesk TV:\n\nBitcoin Briefly Tops $29K as Invesco Reapplies for Bitcoin ETF; Jack Dorsey’s Block Bitcoin Wallet Plans\n\nBitcoin (BTC), the world’s largest cryptocurrency by market value, rallied over the past 24 hours after various traditional finance firms announced moves into the crypto market, indicating bullish sentiment. eToro US investment analyst Callie Cox shared her crypto markets analysis. Plus, Lindsey Grossman, the business lead at Bitkey, Block's bitcoin wallet, joined \"First Mover\" to discuss teaming up with Coinbase and Cash App, along with the launch of Bitkey’s external beta sign-ups. And, Axelar CEO and co-founder Sergey Gorbunov shared his reaction to the Uniswap Foundation's recent bridge assessment report.\n\nHeadlines\n\nBankrupt Hedge Fund 3AC's Return as a VC Stirring Up Crypto Community: 3AC co-founder Kyle Davies told CoinDesk that the new entity aims to provide support for projects that are building for a decentralized future, but skeptics have recalled the original firm’s tainted past.\n\nCircle Restarts U.S. Treasury Purchases in BlackRock-Managed USDC Reserve Fund: Repurchase agreements will keep being part of the reserve fund, Circle’s chief financial officer said Wednesday during a company call.\n\nMakerDAO Boosts U.S. Treasury Holdings by $700M to Back DAI Stablecoin With Real-World Assets: The purchase is the latest step to increase the role of real-world assets in the platform’s DAI stablecoin reserve.\n\n‘Storage Proofs’ Touted as Alternative to Hack-Prone Bridges in Multichain World: Storage proofs, a feature that could minimize cross-chain exploits by allowing users to keep their assets on one chain and prove that it's there on a different chain, will go live on Starknet soon.\n\nPolygon Introduces AI Interface Powered by ChatGPT to Aid App Developers: The artificial-intelligence interface, called Polygon Copilot, will help developers obtain analytics and insights for their applications on the Polygon blockchain."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvYnJlYWtpbmctYml0Y29pbi1wcmljZS1icmVhY2hlcy0zMC0wMDAtb24tYmluYW5jZS1pbi1tZWdhLXJhbGx5LTIwMjMwNjIxMTUzONIBf2h0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2JyZWFraW5nLWJpdGNvaW4tcHJpY2UtYnJlYWNoZXMtMzAtMDAwLW9uLWJpbmFuY2UtaW4tbWVnYS1yYWxseS0yMDIzMDYyMTE1Mzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price breaches $30,000 on Binance in mega rally - FXStreet",
        "content": "Share:\n\nBitcoin price crossed the $30,000 psychological level on Binance, as sentiment among crypto traders turns bullish.\n\nBitcoin halving is less than a year away, and experts have updated their targets for BTC price.\n\nBitcoin bulls are driving the asset’s price rally, in light of Blackrock, WisdomTree and Invesco’s spot BTC ETF applications.\n\nBitcoin price rallied past $30,000 on Wednesday, in the largest short squeeze in June. The largest asset by market capitalization climbed 12% from Tuesday’s low to $30,000, overnight. BTC’s move liquidated over $82.67 million in short positions according to Coinglass data. This marks the largest volume of shorts liquidated since May 2023.\n\nThe asset is less than a year away from its next halving event and bullish drivers in the ecosystem, like institutional adoption are fueling a recovery in Bitcoin. The break past $30,000 confirmed a bullish trend reversal in Bitcoin, after weeks of price decline in response to the regulatory crackdown.\n\nAlso read: Bitcoin Cash, Litecoin and Ethereum Classic reap gains from Bitcoin rally\n\nBitcoin price breaches $30,000 milestone on Binance\n\nBitcoin has rallied nearly 12.29% this week, ending its two-month long downtrend and breaking past $30,000, for the first time since April 2023. The bullish breakout has opened doors for BTC to rally towards $35,000, a target set by market analyst @tedtalksmacro.\n\nBTC/USD one day price chart on Binance\n\nThe move by the largest cryptocurrency is a key bullish signal that confirms the shifting sentiment in the crypto ecosystem. The 24-hour Bitcoin trade volume on Binance breached $30.29 billion, as the asset hit a new milestone on June 21.\n\nAs seen in the BTC/USD 1-day price chart, the asset is currently trading above its three Exponential Moving Averages (EMAs), 10, 50 and 200-day. At the time of writing, BTC is exchanging hands at $30,010. The next key resistance for Bitcoin price is the April 2023 high of $31,166.\n\nThere are three catalysts that are likely driving these gains in BTC, alongside crypto adoption and regulation across European Union nations and Southeast Asian countries like Singapore.\n\nInstitutional interest in Bitcoin peaked with giants applying for spot ETFs\n\nThe world’s largest asset manager, BlackRock, announced the filing of its Bitcoin spot Exchange Traded Fund (ETF) on June 15. Two large investment firms, WisdomTree and Invesco, followed in the giant’s footsteps and filed similar applications, as of June 21.\n\nAn ETF invests in crypto investment products offered by asset managers like Grayscale or futures and options. Prices of these products are linked to the performance of cryptocurrencies. While the US financial regulator, the Securities and Exchange Commission (SEC) has never approved a spot Bitcoin ETF till date, the series of filings by asset management giants signals an uptick in interest from their institutional or corporate clients.\n\nThis interest from financial institutions has acted as a catalyst, driving Bitcoin price higher in the short term.\n\nThe second catalyst is Bitcoin halving, a key event associated with BTC price rallies every four years.\n\nBitcoin halving is less than a year away, traders are gearing up for a new BTC cycle\n\nExperts consider halving events key to Bitcoin’s price trend. Every halving slashes the associated reward for miners by half and the scarcity of mined BTC is considered a driver of the asset’s price rally.\n\nIt is typically believed that halving events drive price rallies in Bitcoin and this has emerged as a trend over the past three halving events.\n\nBitcoin past three halving events and the upcoming fourth halving timeline\n\nBased on the above chart from Blockchain Center, the upcoming Bitcoin halving in 2024 is expected to drive BTC price to a new all-time high, between the $60,000 and $100,000 range. Nicehash.com’s countdown timer reveals that Bitcoin is 338 days away from its halving event and the tentative date is May 25, 2024.\n\nThe third catalyst is the launch of cryptocurrency exchange platforms by giants from traditional finance.\n\nGiants Charles Schwab, Fidelity and Citadel Securities join hands to launch crypto exchange\n\nEDX Markets, a crypto exchange platform backed by financial giants from the traditional finance industry has listed cryptocurrencies available for trade on its exchange. The giants’ plan was to roll out the non-custodial exchange in September 2022, however the regulatory uncertainty and tumultuous events like FTX exchange collapse resulted in a long wait.\n\nWithin days following BlackRock’s spot Bitcoin ETF filing, the exchange platform’s announcement shows that long-term institutional interest in cryptocurrencies has sustained in the US.\n\nEDX has listed Bitcoin (BTC), Ethereum (ETH), Litecoin (LTC), Bitcoin Cash (BCH) among cryptocurrencies that can be traded on the platform. It's important to note that none of these assets have been labeled as securities by the SEC.\n\nBullish targets for Bitcoin price rally\n\nIn light of the three catalysts, an expert @tedtalksmacro shared his targets for BTC price with his 105,500 followers on Twitter. The analyst argues that the first target is $35,000 and it is back in play with the recent developments in crypto. The second target according to the expert’s prediction is $46,500.\n\nBTC/USD one week price chart on Coinbase\n\nThe analyst notes that the Bitcoin price rally gained acceptance when BTC climbed above the $24,500 hurdle. This signaled that market participants have accepted the BTC price rally above August 2022 highs. BTC continued its climb breached the $30,000 target. The next hurdle is the $35,000 level, previously breached in April 2022."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL25ld3MvdGhpcy1sMS1uZXR3b3JrLWNyZWF0ZXMtYS1zZWN1cmUtYW5kLWVmZmljaWVudC1pbnRlcm9wZXJhYmxlLW5ldHdvcmstd2l0aC1iaXRjb2luLWV0aGVyZXVtLWFuZC1tb3Jl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "This L1 network creates a secure and efficient interoperable network with Bitcoin, Ethereum and more - Cointelegraph",
        "content": "In a world of different blockchains, interoperability is becoming an increasingly important issue. While many solutions are already connecting the numerous chains, they don’t come without risks.\n\nDifferent layer-1 blockchains aim to solve this interoperability problem by creating a network with integrated bridges between chains and asynchronous message passing. Using a cross-chain bridge, it’s possible to move value from one chain to another. However, this raises several issues for developers and users. One major issue is the potential for bridge hacks, which have caused billions of dollars in damage in recent years.\n\nIn addition, a fragmented blockchain landscape leads to inefficiencies and complexity, exposing additional vulnerabilities. Trading across chains can be costly with rising gas prices and slippage risks. What’s more, bridging solutions can take anywhere from minutes to hours to get a transaction through.\n\nAttacks on bridges account for 69% of total funds stolen in 2022. Source: Chainalysis\n\nOne blockchain to connect them all\n\nZetaChain, a decentralized layer-1 chain, compatible with the Ethereum Virtual Machine (EVM), aims to make the blockchain industry more interoperable by natively supporting cross-chain bridging of assets, data and liquidity.\n\nZetaChain’s approach makes it possible to build omnichain decentralized applications (DApps) that allow users to access all of their assets and data from a single platform, regardless of the blockchain they were created or stored on. The increased interoperability and ability to create omnichain DApps could improve user experience, which could, in turn, benefit the adoption of blockchain technology in general.\n\nFurthermore, ZetaChain not only supports smart contract chains like Ethereum but can also integrate non-smart contract blockchains like Dogecoin and Bitcoin using the cross-chain toolkit for developers. The network effectively allows for Bitcoin smart contracts giving developers the tools and infrastructure to merge their BRC-20 projects, for example. Overall, however, the network is blockchain agnostic.\n\nSource: ZetaChain\n\nGaining momentum\n\nZetaChain is a new project and therefore is working hard to gain a foothold within the crypto industry. The project recently published its white paper, available in 17 different languages. The document highlights the focus on interoperability between chains and developers worldwide.\n\nThe blockchain’s testnet has attracted more than 1.5 million users from over 100 countries while its community continues to grow. In addition, ZetaChain’s social media channels have built a follower base of over 1.7 million people in the short time they have been live.\n\nOn the developer side, the momentum is visible as well. The project has partnered with many big names in the crypto industry, including an infrastructure provider for the BNB Chain ecosystem Ankr, blockchain security company Halborn, and bug bounty and security services platform Immunefi. DApp development ranges from decentralized exchanges (DEXs) to NFTs and universal and private identity platforms, all to expand the reach of the ecosystem.\n\nDevelopers interested in building DApps on top of ZetaChain can apply for funding through the ZetaChain Grants Program. Hundreds of developer teams have already applied for this funding, hoping to receive a kick-start from the project.\n\n📢 Announcing $5 million in ZetaChain grants to power the next generation of Omnichain dApps. Learn about the program and apply here:https://t.co/ISA1vorcbP — ZetaChain (@zetablockchain) April 13, 2023\n\nNot stealing from other chains, but growing with them\n\nA key aspect of ZetaChain’s mission is to grow with other networks rather than at their expense. Brandon Truong, chief product officer at ZetaChain, emphasized this aspect: “ZetaChain is in a unique position as a new L1 that connects other chains agnostically. Instead of trying to steal liquidity and users from other ecosystems and chains, it can grow with them. The growth of ZetaChain goes hand in hand with the growth of crypto in general.”\n\nThe project’s founders began their journey by exploring the different types of architecture that exist to connect other chains. They quickly discovered many issues, from the aforementioned vulnerabilities to async messaging-based and centralized approaches. By developing an EVM-compatible layer-1 blockchain, ZetaChain aims to be a solution that works for users and developers while keeping security concerns in mind.\n\nZetaChain empowers developers to create easy-to-use DApps that onboard non-crypto natives to the crypto space. Moreover, the network allows developers to create DApps that are cross-chain by default and take out the unnecessary burden of reworking code to make a product work on several chains. With its comprehensive omnichain interoperability features, ZetaChain connects all blockchains, including non-smart contract chains, lowering the barriers to building cross-chain applications to interact with any chain.\n\nLearn more about ZetaChain"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8xNDU1MjgvYml0Y29pbi1hYm92ZS0yODAwMC1maXJzdC10aW1lLXNpbmNlLW1heS0yMDIz0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NTUyOC9iaXRjb2luLWFib3ZlLTI4MDAwLWZpcnN0LXRpbWUtc2luY2UtbWF5LTIwMjM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Breaks $28K for the First Time Since May - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of Bitcoin broke above $28,000 on Tuesday, the first time the number one cryptocurrency has done so since May 8, according to CoinMarketCap.\n\nAt the time of writing, Bitcoin is up 5.23% with a price of $28,144 per coin, with a high of $28,211 for the day.\n\nBitcoin's market capitalization rose 50% on Monday after news broke of the world's largest asset management firm BlackRock filing a new Bitcoin Exchange Traded Fund (ETF) this coming Thursday. Grayscale Bitcoin Trust also saw a 12% bump after the BlackRock news surfaced.\n\nAD\n\nAD\n\nIt's been a busy spring for Bitcoin, after largely recovering from the broad market collapse following the FTX debacle at the start of the year and with the explosive popularity of Ordinals. But the overall cryptocurrency market has otherwise slumped thanks to recent actions by the U.S. Securities and Exchange Commission towards giant cryptocurrency exchanges Binance and Coinbase. Still, the news of BlackRock's Bitcoin ETF has revived hope that a Bitcoin ETF will finally be approved.\n\nNo stranger to the crypto market, BlackRock has been working with Coinbase, which BlackRock would use to custody the ETF. In 2022, BlackRock partnered with Coinbase to launch an investment management platform dubbed Aladdin for trading digital assets.\n\nIn a case of a rising tide lifting all boats, ETH is trading at $17.80 per coin, up 2.64%, Dogecoin at $0.06, up 0.58%, and SOL is trading at $16.46, up 3.62%, according to data from Coin360.\n\nWhile the upward momentum of Bitcoin may be a cause for celebration for some, it is nowhere near the all-time high of $68,789, which the digital asset hit on November 10, 2021."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vYml0Y29pbi1wcmljZS0wLTY1LXllc3RlcmRheS0wOTI1Mzk5NTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin's price up 1.50% on yesterday - Yahoo Finance UK",
        "content": "(REUTERS)\n\nAs of 8:11am today, the price of Bitcoin (BTC) is £20,952, according to CoinMarketCap. That’s up 1.50% on yesterday’s figure of £20,639, and down 0.85% on one month ago.\n\nThe 24-hour trading volume is around £11.6 billion, and it has a market cap of about £406.6 billion.\n\nThe 52-week high of Bitcoin is £24,742, while the 52-week low is £13,195.\n\nBitcoin ROI\n\nIf you purchased a single Bitcoin at the 52-week low of £13,195 and sold it at today’s price of £20,952, you’d earn £7,757 for a positive return of 58.78%.\n\nAlternatively, if you purchased a single Bitcoin at the 52-week high of £24,742 and sold it at today’s price, you’d have a negative return of 15.32%, or minus £3,790.\n\nADVERTISEMENT\n\nIf you want to start investing in Bitcoin, you’ll need a crypto exchange to do so. Keep in mind you may owe taxes on any gains you realise. Past performance is not a predictor of future results. Purchasing Bitcoin is speculative and you may lose all of your investment.\n\nBitcoin Price Over Time\n\nBitcoin has moved up by 1.50% within the last 24 hours. Overall, BTC’s price today is above its 52-week low of £13,195.\n\nOver the past week, Bitcoin has hit a high of £21,204 and a low of £19,587.\n\nThe cryptocurrency, overall, has moved down during the past three months. Over the past 90 days, it has fallen to its current price of £20,952.\n\nHow Many Bitcoins (BTC) Are There?\n\nAs of now, a total of 19,407,156 Bitcoins have been mined. Several million Bitcoins are thought to be inaccessible, due to holders having lost network keys or wallet passwords. There is a total maximum limit of 21 million Bitcoins that can ever be created. Given the total number of mined coins and the maximum limit, only 1,592,844 Bitcoins are left to be produced.\n\nAnalysts project that the last Bitcoin will be mined sometime around 2140. No new Bitcoins will enter circulation after this point.\n\nAbout Bitcoin"
    }
]