[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vbW9uZXkudXNuZXdzLmNvbS9pbnZlc3RpbmcvYXJ0aWNsZXMvdGhlLWhpc3Rvcnktb2YtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "The History of Bitcoin, the First Cryptocurrency | Investing | U.S. News - U.S News & World Report Money",
        "content": "Cryptocurrency has had a short, but volatile and exciting history. It continues to be one of the most hotly debated global financial topics, with 2023 adding more marquee news headlines. Some key moments in the crypto's timeline include:\n\n\n\nIn the earliest days, the FBI was working to shut down crypto-funded darknet black markets.\n\nIn 2013, Forbes named Bitcoin (BTC) the year's best investment.\n\nIn 2014, Bloomberg countered with its proclamation of Bitcoin being the year's worst investment.\n\nIn October 2021, the Securities and Exchange Commission approved ProShares Bitcoin Strategy (ticker: BITO), the first U.S. Bitcoin futures exchange-traded fund.\n\nIn November 2022, FTX – the leading cryptocurrency exchange by trading volume – declared bankruptcy, creating some of the darkest days in the crypto history timeline.\n\nHow Bitcoin Started\n\nBitcoin was the first cryptocurrency created and is now the most valuable and well known. It was first launched in January 2009 by a computer programmer or group of programmers under the pseudonym Satoshi Nakamoto, whose actual identity has never been verified.\n\nA 2008 white paper by Bitcoin's mysterious creator revealed the blockchain system that would be the backbone of the cryptocurrency market. A blockchain is a digital ledger of transactions that is replicated and distributed across a network of computer systems to secure information.\n\nBitcoin Core Concepts\n\nBlock. A block is a group of Bitcoin transactions over a certain period of time. The transactions are verified by \"miners,\" who are rewarded for verifying the transactions with newly created BTC.\n\nBitcoin units. Each Bitcoin is divisible to eight decimal places. A millibitcoin (mBTC) is 1/1,000th of a Bitcoin. The smallest unit is a satoshi (sat), which is 1/100,000,000th of a Bitcoin.\n\nTransaction. A computer directive styled as \"payer X sends Y Bitcoin to receiver Z.\"\n\nBlockchain. Each transaction forms an unbroken link on the chain. This transparent, public chain is what allows Bitcoin to exist and be usable. All blocks of transactions are linked to previous blocks of transactions, forming the etymology for the word \"blockchain.\"\n\nMining. Independent individuals or groups complete intensive and costly computer calculations to create a block.\n\nBlock hash. Mining activities incorporate a record-keeping service that keeps the blockchain consistent, complete and unalterable. The hashes validate available Bitcoin and serve as a means of uniformly rewarding the miners.\n\nBlockchain address. A sequence of 25 to 34 alphanumeric characters. This is the information that is given to other parties so they know where to send the coins. They are considered pseudonymous because, while the blockchain itself is public, the address shields personally identifiable information. Cryptocurrency exchanges may be required by law to collect personally identifiable information, but each transaction can be associated with a different Bitcoin address to maintain privacy.\n\nWallet. Any individual or entity wishing to exchange Bitcoin (and not store them on an exchange, in someone else's custody) must create a digital collection of the credentials, known as a wallet, necessary to transact coins.\n\n\n\nFull clients. This is a wallet that includes a full copy of the entire blockchain. This is the safest form of storage other than offline, or \"cold storage,\" but it requires substantial digital space.\n\nLightweight clients. This is a wallet that includes a more limited version of the blockchain to enable it to be portable on devices, such as a smartphone. Since the entire blockchain is not available, a party using a lightweight wallet must trust intermediaries who have full wallets.\n\nKeys. These are the credentials stored in the wallet. Like a safe-deposit box, there are two keys necessary for each transaction.\n\n\n\nPublic. This is the technology necessary to encrypt and decrypt transactions. It is \"one way,\" meaning that it easily unlocks transactions, but it can't be used to reverse the transaction. This key enables the blockchain to be uninterrupted.\n\nPrivate. This is the passcode that transacting parties initiate so that the transaction is unique to themselves. To spend Bitcoin, one must know their own private key and digitally sign the transaction. The party's signature is verified by the public key without revealing the private key.\n\nIf the party loses its key, the Bitcoin in the wallet becomes essentially worthless, as it is unrecognizable and inaccessible to anyone. According to Chainalysis, a blockchain analytics company, roughly 20% of Bitcoins have been lost by parties who misplaced the private key. Additionally, if the private key is revealed in a security breach, the value of Bitcoins can be stolen. In 2022, cryptocurrency investors lost a record $3.8 billion to hackers.\n\nCold storage. Private keys are stored offline to help avoid losing them or exposing them to a security breach.\n\n\n\nBitcoin Adoption and Controversy\n\nBitcoin supporters also note that more and more institutions, countries and platforms are accepting the digital currency. They continue to hold hopes for Bitcoin to become a global reserve currency.\n\nSome countries, most notably China, have banned Bitcoin and other cryptocurrencies. However, others are embracing it fully:\n\n\n\nEl Salvador adopted Bitcoin as its legal tender in 2021 to resolve deep economic woes. Public adoption has been painfully lackluster due to limited internet access, inconsistent technology capabilities and a lack of enforcement by municipalities. The country has lost an estimated $40 million of its total investment in Bitcoin since adoption, leading many to question its value as legal tender given that the country is still struggling to meet its debt obligations and public health needs. Officials are doubling down, mandating cryptocurrency literacy courses in their public schools beginning in 2024.\n\nUkraine posted two crypto wallets at the beginning of the Russian invasion to raise funds, attracting more than $10.2 million within the first week to fund both humanitarian needs and military support. Ukraine anticipates rebuilding its economy using blockchain technology. Kuna, an exchange led by Michael Chobanian, has emerged as the most popular cryptocurrency exchange in Ukraine with about 60,000 active traders and over $100 million in assets. In February 2022, Kuna partnered with Ukraine's Ministry of Digital Transformation, a governmental agency formed in 2019 to create a universal access point for all electronic governmental services provided to Ukrainian citizens.\n\n\n\nIran has found Bitcoin to be an effective method to bypass U.S. financial sanctions on the country. Because of its abundant natural resources, Iran has been able to easily pivot to producing electricity for Bitcoin mining when the U.S. clamped down on its oil and gas operations. However, illegal Bitcoin mining activities have created significant electrical outages in the country during peak usage periods. All mined Bitcoin, currently valued at approximately $1 billion, must be sold to Iran's central bank. Iran also began accepting imports using cryptocurrency, placing its first international order worth $10 million immediately after the announcement in August 2022.\n\nBitcoin has also attracted controversy due to its climate change implications. Mining Bitcoin requires significant electricity use and is responsible for 0.1% of global greenhouse gas emissions. The University of Cambridge publishes the Cambridge Bitcoin Electricity Consumption Index (CBECI), which provides estimates on the greenhouse gas emissions related to Bitcoin. Its calculations show that about 70 metric tons of carbon dioxide equivalent are released annually by Bitcoin miners. Many rural, low-income communities have been selected for additional mining centers due to few zoning laws. The mining centers often bring a small handful of new jobs, but they create intense pressure on local resources and significant, 24-hour noise pollution.\n\nThe greatest drama in Bitcoin history has been the aggressive rise and subsequent collapse of FTX. Here's a brief timeline:\n\n\n\nFTX grew aggressively through high-profile acquisitions and splashy marketing campaigns, including celebrity and social media influencer endorsements. The marketing message was focused on higher yields than typical bank accounts.\n\n\n\nFTX was led by Sam Bankman-Fried, colloquially known as SBF, and operated in conjunction with Alameda Research, another SBF-founded entity run by Caroline Ellison, SBF's romantic partner at the time.\n\n\n\nIn November 2022, CoinDesk published an article detailing FTX's precarious financial risks, lack of accounting oversight and potential criminal use of customer assets. Shortly thereafter, FTX went into bankruptcy as it could not create enough liquidity to cover an $8 billion shortfall from panicked customers and the collapse of the FTT digital token on which Alameda Research relied for its operations.\n\n\n\nOn Dec. 12, 2022, SBF was arrested and indicted by the U.S. District Court on eight criminal charges, including money laundering, wire fraud, campaign finance violations and securities fraud. His $250 million bond was the largest in history.\n\n\n\nOn Nov. 2, 2023, SBF was convicted on seven federal counts and will be sentenced in March 2024.\n\n\n\nFTX was assigned a new CEO named John J. Ray III, an attorney who specializes in recovering failed corporate assets and whose most notable case was the aftermath of the Enron collapse in the early 2000s. Ray is working to claw back assets from diverse sources such as crypto exchange Bybit and SBF's parents, Joe Bankman and Barbara Fried, both tenured Stanford University law professors.\n\n\n\nAs of early September 2023, over $7 billion in cash and liquid assets of the estimated $8 billion total assets missing have been recovered.\n\n\n\nFTX investors have filed a class action civil lawsuit against FTX, its celebrity/influencer endorsers and significant venture capital investment firms, which is still pending.\n\nBitcoin Price Trajectory\n\nThe Bitcoin supply was capped from the beginning by Nakamoto. The maximum number of coins stipulated to be in existence was 21 million. As of Nov. 12, 2023, there were 19.53 million Bitcoins in existence with 1.46 million left to be mined. However, the Bitcoin mining operators regularly cut in half the rewards for mining each block in a process known as Bitcoin halving, leading experts to believe that it will take until the year 2140 before the supply cap of 21 million is reached.\n\nAfter Nakamoto rolled out Bitcoin in 2009, he mined about 1.1 million Bitcoins and disappeared in 2010. He ceded the responsibility of development to Gavin Andresen, formerly known as Gavin Bell, who worked to see Bitcoin's decentralized vision realized. This meant that there was no central authority, server, storage or administrator. All the parties were peer-to-peer and the blockchain was distributed to all. The network existed merely to legitimize and confirm the transactions. The price of Bitcoin dropped with the new uncertainty surrounding these actions.\n\nHowever, control issues emerged when GHash.io, a cryptocurrency mining pool, exceeded 51% hashing power for the first time. One of Bitcoin's tenets is that power cannot be accumulated in too few hands, and GHash's popularity meant that coins could be double-spent, or counterfeited, and they could push other miners out of being rewarded for their activity. Fortunately for the Bitcoin industry, the parties voluntarily enacted provisions that redistributed hashing power to acceptable, sustainable limits.\n\nThe first real-world Bitcoin transaction occurred on May 22, 2010, a date known to Bitcoin enthusiasts now as Bitcoin Pizza Day. Laszlo Hanyecz paid 10,000 BTC to have two Papa John's pizzas delivered to him. The pizzas retailed for about $25. At the peak of Bitcoin's pricing in 2021, the two pizzas would have cost north of $680 million. Due to Bitcoin's extreme volatility, the pizzas would currently be worth about $250 million.\n\nPart of Bitcoin's volatility comes from the Gartner Hype Cycle, a life cycle common among new and innovative technologies. The five stages include the innovation trigger, the peak of inflated expectations, the trough of disillusionment, the slope of enlightenment and the plateau of productivity. Many individuals created and then lost vast fortunes in Bitcoin, causing eight Nobel Prize winners in economic sciences to call Bitcoin a bubble, much like the oft-cited Dutch tulip mania in the 1600s. However, Bitcoin supporters point out that although Bitcoin has crashed several times, it has also returned to its previous price each time, while other bubbles have not recovered their value.\n\nBitcoin values sank with the implosion of purported stablecoin TerraUSD, a catalyst for the market failures that precipitated the 2022 FTX collapse. However, on Nov. 9, 2023, Bitcoin hit a new 2023 high on the news of the FTX convictions. Additionally, BlackRock made a one-two-punch announcement with a surprise Ethereum spot ETF filing, closely following Grayscale Investments' landmark legal victory against the SEC regarding it's application for a spot of Bitcoin ETF.\n\nThe questionable strength of the economy has also been a huge factor in Bitcoin pricing. In what has been called the 2022 \"crypto winter,\" sharp declines occurred in Bitcoin pricing as the Federal Reserve began aggressively increasing interest rates to stave off inflation. Investor appetite for risk all but disappeared and liquidity became a major issue among the exchanges.\n\nThe FTX collapse exacerbated the liquidity issue as investors began pulling funds, while $16 billion of assets were frozen within FTX. FTX's woes also depressed non-fungible token, or NFT, weekly trading volume by half. Venture capital firms' activity dropped over 60% for crypto startups, as their attention shifted to artificial intelligence. Many crypto operations shifted to more crypto-friendly locales abroad, such as the U.K., the European Union and Singapore. Many are hoping that the Bitcoin and Ethereum spot ETF announcements will restore badly needed liquidity to the crypto market.\n\nIntense regulatory scrutiny was another byproduct of the FTX collapse. Just as founders are seeking international destinations, Dubai and Hong Kong are openly courting investors with the message that they are poised to operate new hubs with an emphasis on disrupting the failing behavior exhibited by FTX.\n\nThe fallout may be felt for quite a while, and Congress will consider what regulations are needed for Bitcoin going forward. It remains to be seen whether the industry can stay true to its decentralization goal.\n\nBitcoin's value decreased more than 70% from its all-time high of $68,789 in November 2021 to lows in the $16,000 range in December 2022. In late 2023, Bitcoin finally broke through resistance barriers to reach the $30,000 to $35,000 range.\n\nAnticipating the Future of Bitcoin\n\nDespite the shocking headlines around FTX and Alameda Research, as well as a dearth of smaller exchanges buckling under the liquidity strain, the allure of cryptocurrencies continues.\n\nNouriel Roubini is an economist who was one of the few to correctly predict the 2008 subprime mortgage crisis. Dubbed \"Dr. Doom,\" due to his consistently pessimistic outlook on the economy, Roubini has been a frequent critic of cryptocurrencies in general and Bitcoin in particular. In 2018, he testified to the U.S. Congress that cryptocurrency is the most corrupt industry. However, after years of aggressive bashing, Roubini is now launching the Atlas Climate Token, a blockchain-based stablecoin, through his firm, Atlas Capital.\n\nInnovation is likely to continue with ETFs and NFTs on the Ethereum blockchain, as evidenced by the enthusiastic response to BlackRock's recent announcement. The regulatory focus from the FTX fallout has generated greater attention on decentralized finance, or DeFi, in the Web3 space with a continued focus on gaming applications.\n\nSome think artificial intelligence can be used to optimize cryptocurrency trading, but AI is currently sorting out its myriad issues, such as content ownership in large language models. Blockchain technology may be the key to determining what content is AI driven versus uniquely human, a differentiator that could have a great effect on the overall public adoption of AI."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjMvMTEvMTQvYml0Y29pbi13YWxsZXQtcGFzc2NvZGUtZmxhdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "A lost bitcoin wallet passcode helped uncover a major security flaw - The Washington Post",
        "content": "SAN FRANCISCO — After a tech entrepreneur and investor lost his password for retrieving more than $600,000 in bitcoin and hired experts to break open the wallet where he kept it, they failed to help him. But in the process, they discovered a way to crack enough other software wallets to steal $1 billion or more.\n\nOn Tuesday, the team released information about how they did it. They hope it’s enough data that the owners of millions of wallets will realize they are at risk and move their money, but not so much data that criminals can figure out how to pull off what would be one of the largest heists of all time.\n\nTheir start-up, Unciphered, has worked for months to alert more than a million people that their wallets are at risk. Millions more haven’t been told, often because their wallets were created at cryptocurrency websites that have gone out of business.\n\nAdvertisement\n\nThe story of those wallets’ vulnerabilities underscores the enormous risk in experimental currencies, beyond their wild fluctuations in value and fast-changing regulations. Many wallets were created with code containing profound flaws, and the companies that used that code can disappear. Beyond that, it is a sobering reminder that underneath software infrastructure of all kinds, even ones explicitly dedicated to securing funds, are open-source programs that few or no people oversee.\n\n“Open-source ages like milk. It will eventually go bad,” said Chris Wysopal, a co-founder of security company Veracode who advised Unciphered as it sorted through the problem.\n\nThe company shared its process and conclusions with The Washington Post before going public.\n\nThe risk of bad open-source code was laid bare in 2021 when it was discovered that Log4j, a ubiquitous tool used by software servicers that few consumers were even aware of, could be used to execute malicious code. The revelation panicked companies worldwide and made open-source security a top priority for the Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency, which is now pushing companies to map out all the programs they depend on.\n\nAdvertisement\n\n“Every man-made technology contains flaws that originate within its creators,” Unciphered co-founder Eric Michaud said.\n\nStefan Thomas, the technologist who created the software used to create the wallets, told The Post that he had done so as a hobby and had taken the key part of the code from a program published on a Stanford University student’s page, not checking to see if it was sound.\n\n“Instead, I was obsessed about making sure that I didn’t make any mistakes in my own code,” Thomas said. “I’m sorry to anyone affected by this bug.”\n\nUnciphered is calling the flaw “Randstorm,” because it stems from wallet programs that created cryptographic keys that weren’t random enough. Instead of crafting electronic keys that were one in a trillion and therefore very hard for an outsider to forge, they made keys that were one in some number of thousands — a randomness factor easily hacked.\n\nAdvertisement\n\nThe person who set the ball in motion is investor Nick Sullivan, an early bitcoin believer who used the site Blockchain.info, since renamed Blockchain.com, to make a wallet in 2014. Not long after, he wiped his computer’s memory without realizing that he had not saved to his password manager the blob of letters and numbers that would give him access to his crypto account.\n\n“It was a pretty frustrating set of circumstances,” Sullivan told The Post. At the time, he was out around $18,000. That amount is now worth more than $600,000 — enough to make it worthwhile for him to hire the hackers and National Security Agency veterans at Unciphered to try to recover it.\n\nUnciphered, one of a handful of outfits dedicated to recovering trapped electronic funds for a fee, began searching for Sullivan’s money in January 2022.\n\nAdvertisement\n\nIt turned out that the information Sullivan had about how he had created the account wasn’t enough to let Unciphered’s experts crack the wallet. But in studying the problem, the Unciphered team uncovered a bigger issue: Thomas’s code, known as BitcoinJS, which was supposed to create wallets with random keys, didn’t always make them random enough.\n\nCompounding the problem, Thomas’s BitcoinJS was used not only by Blockchain.info but also by many other sites from 2011 on, including the main source of wallets for the former joke currency dogecoin, Dogechain.info. An executive at that site’s owner, Block.io, did not respond to an email from The Post seeking comment.\n\n“BitcoinJS is terribly broken up till March 2014,” Michaud said. “Anyone directly using it is on the very high end of risk to attack.”\n\nAdvertisement\n\nCryptographers discovered weaknesses in how most of the major browsers created randomness in 2014, and they improved afterward. Blockchain.info and some other sites also added more randomness, making wallets harder to crack. Unciphered has not found any wallets created after 2016 that are vulnerable because of weak randomness.\n\nBut that still leaves millions of wallets vulnerable.\n\nThe easiest to crack would be wallets made before March 2012, which hold about $100 million and could be hacked by a home computer user, Michaud said.\n\nAnother $50 billion worth of bitcoin is stored in wallets created between then and the end of 2015. Most of those are not vulnerable, but at least 2 percent of them are, for about another $500 million, Unciphered said. Then there are other currencies with wallet services that borrowed from BitcoinJS, including dogecoin and litecoin.\n\nAdvertisement\n\nDiscovering the vulnerability was only half the challenge. Unciphered still had to figure out how to tell millions of people to move their funds, without giving away the existence of a huge vulnerability.\n\nUnfortunately, many of the crypto sites that had used the flawed program were out of the business, as was Thomas.\n\nUnciphered legal adviser Stewart Baker, a former general counsel at the National Security Agency, trying to determine the right thing to do, even broached the idea in a column a year ago of having a “white knight” steal everything that was vulnerable to a hypothetical crypto flaw and hold onto it while sorting through who truly owned what.\n\nHe noted that a precedent of sorts had been established in 2021, when a hacker stole a whopping $600 million in virtual currency from lending platform Poly Network and returned it for a fee of $500,000 and a promise that he would not be prosecuted.\n\nAdvertisement\n\nBut no one wanted to risk prosecution or civil liability by stealing from many people at once, and in the end “what we decided to do,” Baker recalled, \"was find the company that was in a position to fix or notify as many people as possible, in the hope we could get a lot of this fixed before the exact nature of the problem leaks.”\n\nEventually, Michaud realized that the biggest old user of the wallet program still around was the one Sullivan had used, Blockchain.com.\n\nThe first interaction between the two companies was fraught with suspicion. Each wanted the other side to sign a nondisclosure agreement, but neither would themselves.\n\n“In crypto, you need to be pretty skeptical of people who call with something that sounds dramatic, because there are so many scammers,” Blockchain.com President Lane Kasselman recalled. “It was unclear who they were and what the scope of it was.”\n\nAdvertisement\n\nBut their references checked out, and Baker joined a group call to explain that the Unciphered hackers were well-meaning security whizzes, not extortionists. Blockchain.com agreed to help. It worked out a way to automatically update wallets of those who visited its site, changed its app, and sent out emails to the holders of more than 1.1 million affected wallets beginning Oct. 10, less than 2 percent of the 90 million wallets it has created.\n\nOf course, many of those who were notified were suspicious too. One of them posted the notice in a chat for crypto enthusiasts and asked for guesses about what was going on. Security expert Dan Guido saw that and posted on X, and someone responded by pointing to a notice on Unciphered’s site saying that it would have something wallet-related to announce in the future.\n\nGuido then asked the people at his security engineering company, Trail of Bits, to see what Unciphered might have been referring to. They figured out the issue in days, but they agreed to keep quiet at Unciphered’s request.\n\n“They’ve been able to keep this under wraps for 20 months, which is insane, and that’s what’s required,” Guido said. \"The ability for people to take advantage of it is extremely high.”\n\nConsumers can check whether their wallets are vulnerable at www.keybleed.com.\n\nUnfortunately, Sullivan’s wallet wasn’t among those that suffered from the security flaw — mainly because he created his wallet in 2014, after Blockchain.info had improved the randomness of its wallets. If the security had been worse, he would have been able to get his money back when Blockchain.info notified clients with vulnerable accounts.\n\nHe is done with crypto anyway, after starting three companies in the industry and winding up a bit poorer than when he began. Now he is working on artificial intelligence.\n\n“Crypto is a pretty hostile place, to be honest, full of people attacking what you’re building, whether they are trying to hack it, or challenges from regulators, or other people interested in seeing bitcoin being taken down,” the former true believer said.\n\nBut he said he was happy that he ended up helping a large number of strangers who are still invested emotionally as well as financially: “I honor those still fighting that fight.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTE1L3NlYy1kZWZlcnMtZGVjaXNpb25zLW9uLXNwb3QtYml0Y29pbi1ldGYtZXRoZXItZnV0dXJlcy1maWxpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "SEC Defers Decisions on Spot Bitcoin ETF, Grayscale Ether Futures Filings - Bloomberg",
        "content": "The US Securities and Exchange Commission yet again has deferred making a decision on whether to approve the first US exchange-traded fund that invests directly in Bitcoin, despite speculation building that approval is just around the corner.\n\nThe primary US securities regulator deferred on a filing from Hashdex to convert its existing Bitcoin futures ETF into a spot fund, according to a document posted on its website Wednesday."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTQvYml0Y29pbi1zcG90LWV0ZnMtd2lsbC1pbnRyb2R1Y2UtY3J5cHRvLXRvLWJyb2FkZXItaW52ZXN0b3ItYmFzZS1jb2luYmFzZS_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzE0L2JpdGNvaW4tc3BvdC1ldGZzLXdpbGwtaW50cm9kdWNlLWNyeXB0by10by1icm9hZGVyLWludmVzdG9yLWJhc2UtY29pbmJhc2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Spot ETFs Will Introduce Crypto to Broader Investor Base: Coinbase - CoinDesk",
        "content": "\"The U.S. Treasury bond market has been shaken up and the U.S. banking sector remains highly vulnerable,\" which makes bitcoin all the more attractive heading into 2024 as an \"alternative to the traditional financial system,\" the report added."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE1L2JpdGNvaW4tc2hvdWxkLXlvdS1idXktdGhlLW5leHQtZGlwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin: Should You Buy the Next Dip? - The Motley Fool",
        "content": "Bitcoin (BTC -3.59%), which recently broke through the $37,000 price level, has been on a wild ride over the past two years. After collapsing by 65% last year, it is now up 122% this year and has been outperforming all but a handful of top cryptocurrencies. As a result, analysts and traders have been rushing to put out wildly optimistic price targets for Bitcoin in 2024.\n\nBut dig a bit deeper, and there are plenty of reasons it might be headed for a pullback sooner than anyone thinks. It's easy to argue that it is wildly overheating and is now primed for a market correction, especially if the economy shows signs of weakness. But don't worry about the dip too much. Two key factors make the crypto a fantastic long-term investment.\n\nInstitutional investor flows\n\nThe biggest factor supporting a higher price for Bitcoin is the potential for an enormous flow of funds from institutional investors into new spot Bitcoin exchange-traded funds (ETFs), which will likely be approved by the Securities and Exchange Commission (SEC) in the first quarter of 2024.\n\nThese new spot ETFs provide institutional investors with a way to get exposure to the digital currency without owning it directly. If institutional investors decide to allocate even 1% of their portfolios to crypto, it could have an enormous impact on the price of Bitcoin for the foreseeable future.\n\nAs a result, some analysts are projecting Bitcoin to smash through its all-time high of $69,000 and continue on an ascent to $100,000 and beyond, driven by this fresh infusion of institutional investor money. Just keep in mind, though, JPMorgan Chase (NYSE: JPM) recently warned that this impact might be less than originally thought, because institutional investors could simply rotate their money out of other existing Bitcoin investment products and into these new ETFs.\n\nThe halving\n\nThe other key factor supporting a higher price for Bitcoin is the halving, now scheduled for April 2024. This event, which takes place only once every four years, results in the reward paid out to Bitcoin miners being cut by one-half.\n\nThat event creates a \"scarcity effect\" that drives up the price of the crypto over time. It also has a deflationary impact on it, since the rate of new Bitcoin creation is being reduced, and that makes it more attractive as a hedge against inflation. There have been three previous halvings, and all of them have led to Bitcoin hitting new highs.\n\nArguably, the impact of the Bitcoin halving seems to be diminishing over time. And, of course, past performance is no guarantee of future performance. Just because the halving has resulted in three previous bullish market cycles, there's no inherent reason it has to happen a fourth time.\n\nThat being said, it's undeniable that the halving is a cornerstone feature of just about any Bitcoin price forecast for 2024. Standard Chartered Bank, for example, has raised its previous $100,000 price target to $120,000, in part based on new bullishness around the halving.\n\nDo you believe in efficient markets?\n\nThe big question is just how much these two events -- the arrival of the first spot Bitcoin ETF and the halving -- are already priced into the hefty $37,000 price. According to the efficient market hypothesis, which argues that asset prices reflect all available information, they should be.\n\nBitcoin is a digital asset, but it is still an asset. Since we know the date of the halving, and we know the approximate date of the spot ETF approval, then these events should be reflected in the current price.\n\nAs a result, JPMorgan Chase argues that much of the impact of the spot Bitcoin ETF has likely been priced in. Coinbase Global (NASDAQ: COIN), too, seems to agree. And there are plenty of investors who think Bitcoin is poised for a recalibration in price, as the market makes sense of all available information.\n\nIn fact, Bitcoin bear Peter Schiff is now arguing that the pending approval of the first spot Bitcoin ETF product could be a perfect \"buy the rumor, sell the news\" opportunity.\n\nSo that's why you need to be ready for the next big dip in Bitcoin. If you don't prepare now, you could be blindsided if it happens later. I'm long-term bullish on the cryptocurrency, and based on the two catalysts described above, I'm convinced that any dip will provide a unique opportunity to buy Bitcoin at a bargain price before it continues its steep upward ascent."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTUvZWwtc2FsdmFkb3ItcmVtYWlucy1pbi10aGUtcmVkLW9uLWJpdGNvaW4taG9sZGluZ3MtYnV0LWxvc3Nlcy1hcmUtbmFycm93aW5nL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTUvZWwtc2FsdmFkb3ItcmVtYWlucy1pbi10aGUtcmVkLW9uLWJpdGNvaW4taG9sZGluZ3MtYnV0LWxvc3Nlcy1hcmUtbmFycm93aW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "El Salvador Remains in the Red on Bitcoin Holdings, But Losses Are Narrowing - CoinDesk",
        "content": "As to whether the populace is rushing to adopt a bitcoin standard, questions remain. One place to check would be remittances from outside the country, given the economy's reliance on those payments. According to central bank data, of $7 billion in remittances from abroad in 2022, just 1.2% used cryptocurrency wallets."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE1L3doeS1iaXRjb2luLWFuZC1vdGhlci1jcnlwdG9zLXdlcmUtYm91bmNpbmctaGlnaGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Why Bitcoin and Other Cryptos Were Bouncing Higher Today - The Motley Fool",
        "content": "Will the current cryptocurrency rally ever end? Investors could be forgiven for thinking that it won't, on Wednesday, as prices of the leading asset in that class, Bitcoin (BTC -3.59%), and a large pack of altcoins continued to trade well in positive territory.\n\nIn addition to Bitcoin's 6% advance over the preceding 24 hours, the oft-maligned meme cryptos Dogecoin (DOGE 2.37%) and Shiba Inu (SHIB -0.19%) were up a respective 4.9% and 5.6%. Not to be left behind, Algorand (ALGO -5.06%) was surging more than 11% higher, and Lido DAO (LDO -8.02%) was defying gravity by 5.5%.\n\nThe crypto spot ETF saga continues\n\nThere was no news of great substance affecting the crypto market that day, and when that occurs in the midst of a rally, the rally tends to extend. However, one fresh development to watch, as it ties into a big reason for the market's sunny bullishness these days, is a regulatory announcement on spot crypto ETFs handed down on Hump Day.\n\nOn Wednesday, the U.S. Securities and Exchange Commission (SEC) said it was delaying a decision by a company called Hashdex to convert its Bitcoin futures exchange-traded fund (ETF) into a spot ETF.\n\nThe latter instruments are a hot item just now, as they would allow companies to invest directly in cryptocurrencies. At present, they are prevented from doing so and thus can only do their best to mimic crypto price movements using various methods. Spot crypto ETFs would be appealing for a great many investors who don't want the considerable hassle that is often involved with owning cryptos themselves.\n\nAt the moment, there is a clutch of financial-services companies jostling to list spot crypto ETFs on exchanges. Some are conversions, like Hashdex, and others are newly established securities. One example of the latter is Grayscale Investment's proposed Ethereum vehicle, the Grayscale Ethereum Futures Trust. On Wednesday, the SEC said it was also postponing its decision on green-lighting this ETF.\n\nNo trepidation on inflation\n\nA postponement isn't a \"no,\" plus the SEC's moves on Hashdex and Grayscale keep spot crypto ETFs alive as watercooler conversation and topics of discussion on influential crypto forums online. They also serve as a reminder that there are well-capitalized, ambitious companies clamoring for such assets to finally receive approval.\n\nOn top of that, investors continue to be encouraged by the October consumer price index (CPI) data published by the government's Labor Department last Friday. This indicated that inflation was cooling more than economists anticipated, leading pundits and investors to believe that this will discourage the Federal Reserve from raising interest rates (as has been its wont over the past few years).\n\nLevel interst rates -- or perhaps even lower ones if inflation continues to lose heat -- benefit cryptocurrencies and related assets. That's because investors tend to take on more risk when they feel that competing \"safe\" assets (such as the U.S. government's treasury notes) aren't going to pay out more."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTE1L2JpdGNvaW4tYnRjLXN0b2Nrcy1jb3JyZWxhdGlvbi1ub3ctbW9zdC1uZWdhdGl2ZS1zaW5jZS1jb3ZpZC1vbnNldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin-Stocks Correlation Now Most Negative Since Covid's Onset - Bloomberg",
        "content": "The buy-everything wave that just swept across global markets has bypassed Bitcoin , which is down since a soft US inflation print rolled across trading screens and stirred a bout of wider risk taking.\n\nThe drop since the US data were published on Tuesday morning compares with a 2% jump in an index of global shares on bets that the Federal Reserve is done with interest-rate hikes and will pivot to cuts next year."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzE0L2NyeXB0by1idWxscy1oaXQtYnktMzAwbS1pbi1saXF1aWRhdGlvbnMtYXMtYml0Y29pbi1ldGhlci1idWNrbGUtb24tZml6emxpbmctZXRmLW1vbWVudHVtL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzE0L2NyeXB0by1idWxscy1oaXQtYnktMzAwbS1pbi1saXF1aWRhdGlvbnMtYXMtYml0Y29pbi1ldGhlci1idWNrbGUtb24tZml6emxpbmctZXRmLW1vbWVudHVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Crypto Bulls Hit by $300M in Liquidations as Bitcoin, Ether Buckle on Fizzling ETF Momentum - CoinDesk",
        "content": "The large amount of liquidations suggests that the sudden decline in prices caught most investors off-guard, with 88,667 traders getting flushed, CoinGlass shows. Bitcoin traders suffered the most liquidations at $133 million, followed by ETH traders with some $70 million."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0xNC9jYXRoaWUtd29vZC1vbi1jcGktcmVwb3J0LWZlZC1wb2xpY3ktYml0Y29pbi1ldGZzLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood on CPI Report, Fed Policy, Bitcoin ETFs - Bloomberg",
        "content": "00:00\n\nKathy, obviously CPI, you saw it cool across the board in October, both on headline and on core. And to say the least, the market reaction has been pretty swift. Curious to hear your thoughts, though, when you think about what this means for the Fed. Is it safe to say that we've seen the last Fed rate hike of this cycle? Well, first of all, I'll say I agree with almost everything Ken Griffin just said except his comments about the Fed. For some time now, we've been saying that the Fed has overdone it and that the greater risk here is deflation. Yes, the CPI did not surprise us at all, although there were rumors that revisions would take it higher than many people thought. And so we believe we're beginning to see deflationary trends in many more sectors. Now, it started with commodities. Now we're seeing airline prices coming down, auto prices coming down, and we're seeing staples prices. They have been sticky. But what's happened to Staples volumes, they have gone down. That's not how you run Mac manufacturing plants. So we think that they will be forced into cutting prices as well. You heard Home Depot today, -3.8% comp store sales here in the United States. And if you look at the S & P 500, I think a third of all companies in the S & P 500 are reporting negative revenue growth. What we have characterized the last two years as a rolling recession, some measures of housing are down 40%. That's a recession. How? Autos, 15 million units in the US. That's kind of punk. It's recession like. And we're seeing these volume declines in staples. Right. You've got consumers pulling back. So I think the Fed's overdone it. I think we're going to see a lot more deflation going forward. We are going to hit that two handle and we will go below it and would not be surprised to see CPI inflation negative at some point next year. Well, Kathy, is that materializes? Let's talk about how the Fed responds, because as we've been talking about, you have seen traders really pull forward their pricing for rate cuts next year. Add to that, what do you think this translates to in terms of magnitude of rate cuts that the Fed will have to deliver? Well, if we're right and they've gone way too far, they'll have to cut fairly significantly. I tweeted, although I don't know if I use the word tweet anymore on x I, I put a chart which showed the ratio of metals prices to gold prices and charted it against long term interest rates. We've never seen this big of a gap. The the metals to gold price indicator is saying deflation is the risk. It's down near the low end of a range. And the the long term treasury yield is way, way above where it should be. In fact, this metric would suggest if you just eyeballed the chart and it's not perfect, 2% would be the right level of rates. So I actually said that in my last in the no YouTube video, you know, 2% rate. That was the reason. Just looking at price signals that the Fed does not seem to be paying attention to. I'm curious, Kathy, about that. I mean, based on that and I remember seeing that chart and I've looked at that same ratio, I mean, that would imply that basically where we're at right now, you know, in the mid to high fours, I'll close to the 5% that we need to get back down somewhere around 2% here. And I can't really see how that happens without either a significant economic downturn or just what would just be an unprecedented pivot by the Fed. I think that I think we're in a rolling recession and it will continue. I think consumers are basically saying no mas when it comes to pricing. We're seeing that in volume numbers. And so if companies can no longer get pricing, what's going to happen? Their margins, which have held up, are going to get crushed. And we do think that's the case. Now, they've held on to employees who were very difficult to get during the rebound from COVID, reluctant to let them go because it was such a struggle to bring them on. I think that's going to change. They're going to be responding to margin pressures. And we do think you're going to see more unemployment during during the next three, six, nine months in an election year. So it will really get a lot of attention. Well, I'm curious as to what this means for our financial markets. I mean, let's just kind of go with this, that this is the hypothetical that the Fed remains behind the curve. They don't react enough and the economic consequences are severe even if it's not a recession. But they are severe enough that it significantly limits consumer spending and for that matter, even business spending. How does that sort of factor in, I guess, to the growth story with a lot of the stocks that I think so many people have embraced this year based on this idea that there was a longer term structural story in a lot of those names. How does that change, if at all? Well, I mean, I don't know if you're referring to our ilk of stock, where we're very focused on innovation platforms that are evolving today. And they're not immune from recession, but they are recession resistant and they're actually gaining more traction during tough times because they're better, cheaper, faster, more productive, more creative in terms of new products and services. So they gain more traction in tough times and then come out of a period like this flying. That has been the history in terms of strategies like ours that I think we've paid our dues 21 and 2221 our strategies were down just and the idea that interest rates might move up. And then in 22 they were crushed because interest rates moved up 22 fold more than they ever have in history, over little more than a year's time. And so we've paid our dues. I think the beginning of this year, the market started to say, okay, inflation is coming down. It peaked at nine, we're coming down. And we were coming down. We had a great year through July and a little bit of a setback as inflation fears picked up again. But I think today's report is very important in terms of look through there and see the price declines. You'll see a number of them. And this idea that deflation is spreading, I think is going to gain more currency during the next few months. And Kathy, to that point, take a look at the ARK Innovation ETF, currently up about 33% or so year to date. I want to switch gears here and talk about what everyone wants to hear about, and that is a potential US spot Bitcoin ETF. I know that you can't say too much about an active filing, but when you think about the process thus far and you think about potential timelines here, do you think that we're going to see spot Bitcoin approval spot Bitcoin ETF approval in the US by year end, or is that a 2024 possibility? Well, we're looking at a change in the SEC's behavior. First and foremost, you know, when we put in our first few filings, they were rejected really out of hand. We got no questions. We had no interaction. That changed this year. And the SEC asked some really good questions. We know that the SEC, as certainly the research staff, is highly sophisticated in terms of understanding what could go right and what could go wrong. The questions were great. We answered those questions. So that was a change in behavior and we believe other other firms had the same experience. That was a change. And our deadline and we're the first in line, I would say, is January 10th. At that point, this is the final deadline. Either they approve or they deny. What we think could happen. And I'll give one caveat in a moment, is that by that time they will prove, but not just one. It will be a number of us because they don't want to pick winners. So so the caveat here is there is grayscale is out there. And there was some thought that the SEC would allow grayscale to convert from a grantor trust for Bitcoin to an ETF. Now, I don't know if that was grayscale's thought or conventional wisdom. There are rumblings that that might not be the case. Grayscale is public in saying that it will sue the SEC again if it is denied. So I don't know if that would hold to hold the timeline up, but if that were not to happen, I think we're getting close. And so, Kathy, just to make sure I'm understanding that. So if grayscale were to come out and sue the SCC again, that could actually maybe delay the process before that January 10th potential final deadline. It may or may not. You know, the SEC may feel it is standing its ground and this is these are the processes and procedures and grayscale needs to hew to them and just keep going or it may not you know, it is an uncertainty out there and just it's anyone's guess. And Kathy and talking about the ETF industry in September the news came about that Ark was buying rise ETFs. Now that is a European based ETF business and I've been wanting to ask you this basically since I wrote up that story. Why buy another asset manager to establish a European presence versus just going out and launching ARK ETFs organically? Well, a couple of things. First of all, the reason we did it was 25% of our subscriber base. Now we give our research away, but 25% of the readers are from Europe. We can we can see that. And the number one question probably for the last five or six years is why can't we? Why can't you issue a UCITS ETF in Europe? And so we started studying that as a strategic option and we realized Europe is a very complicated market. There is no way an American company, even a well-known brand in our space, can go into Europe and understand all the cultural nuances, all of the regulatory nuances, especially because sustainability in Europe is so important and they have Article nine, article age, their categories, and many companies declared themselves Article nine. So, you know, they were at the top of the heap in terms of sustainability. They 70% of them had to downgrade to Article eight. So there are new regulatory nuances. This company Ries now arc Europe, same DNA as ARC, very thematic in their focus, very future oriented. They self index their fund. So these are index strategies, but they know their stocks, unlike another index manager. Very often they won't know what's in the portfolio or if they do know, they won't know the management teams. This one is different and very similar DNA and did very well through the sustainability downgrades. Not one of their their funds was downgraded in that way."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTUvYml0Y29pbi1ib3VuY2VzLTYtdGhyZWF0ZW5zLTM4ay1nb29kLXRpbWVzLWFyZS1oZXJlLWFuYWx5c3Qtc2F5cy_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzE1L2JpdGNvaW4tYm91bmNlcy02LXRocmVhdGVucy0zOGstZ29vZC10aW1lcy1hcmUtaGVyZS1hbmFseXN0LXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Bounces 6%, Threatens $38K; 'Good Times Are Here,' Analyst Says - CoinDesk",
        "content": "SOL has been a leader of altcoins for weeks now, nearly tripling in price over the past month, as concerns about FTX dumping its tokens subsided and demand among institutional investors increased. AVAX perhaps benefitted from a recent announcement that traditional-finance giants JPMorgan and Apollo used the network to demonstrate a \"proof of concept\" for how asset managers could tokenize funds, a red-hot trend in crypto."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzE0L2JpdGNvaW4tZHJvcHMtNC10by0zNWstZGVzcGl0ZS1zb2FyaW5nLXRyYWRmaS1tYXJrZXRzLWJ1dC1hbmFseXN0cy1yZW1haW4tb3B0aW1pc3RpYy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8xNC9iaXRjb2luLWRyb3BzLTQtdG8tMzVrLWRlc3BpdGUtc29hcmluZy10cmFkZmktbWFya2V0cy1idXQtYW5hbHlzdHMtcmVtYWluLW9wdGltaXN0aWMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Drops 4% to $35K Despite Soaring Tradfi Markets, But Analysts Remain Optimistic - CoinDesk",
        "content": "\"ETF speculation is front and center for now, but the store of value narrative still holds and will give the asset a resilient and increasing floor,\" Noelle Acheson, author of the Crypto Is Macro Now newsletter, noted in an email to CoinDesk. \"I very much doubt that [the recent sell-off] means the rally is done for now.\""
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTQvdXMtY3BpLXVuZXhwZWN0ZWRseS1mbGF0LWluLW9jdG9iZXItYml0Y29pbi1hZGRzLW5lYXJseS0xL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTQvdXMtY3BpLXVuZXhwZWN0ZWRseS1mbGF0LWluLW9jdG9iZXItYml0Y29pbi1hZGRzLW5lYXJseS0xL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "U.S. CPI Unexpectedly Flat in October; Bitcoin Adds Nearly 1% - CoinDesk",
        "content": "Prior to this morning's report, traders were pricing in about an 86% chance the Fed would hold rates steady at its next meeting in mid-December, and there's roughly a 75% chance of a continued pause at the January meeting, according to the CME FedWatch Tool. Shortly after the data, the odds of a December pause rose to 99.5% and for a January pause to 95.6%."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTEvMTUvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1oYXNoZGV4LWJpdGNvaW4tc3BvdC1ldGYtYXBwbGljYXRpb24tZ3JheXNjYWxlLWV0aGVyLWZ1dHVyZXMtZmlsaW5nL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTEvMTUvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1oYXNoZGV4LWJpdGNvaW4tc3BvdC1ldGYtYXBwbGljYXRpb24tZ3JheXNjYWxlLWV0aGVyLWZ1dHVyZXMtZmlsaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "SEC Delays Decision on HashDex Bitcoin Spot ETF Application, Grayscale Ether Futures Filing - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzE0L2JpdGNvaW4tbWluZXItaHV0LTgtcTMtbmV0LWxvc3MtbW9yZS10aGFuLWRvdWJsZXMtYXMtcHJvZHVjdGlvbi1zbHVtcHMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTEvMTQvYml0Y29pbi1taW5lci1odXQtOC1xMy1uZXQtbG9zcy1tb3JlLXRoYW4tZG91Ymxlcy1hcy1wcm9kdWN0aW9uLXNsdW1wcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Hut 8 Q3 Net Loss More Than Doubles as Production Slumps - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2JpdGNvaW4tdnMtYml0Y29pbi1jYXNoLWtleS1kaWZmZXJlbmNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin vs. Bitcoin Cash: Understanding the 6 Key Differences - CCN.com",
        "content": "Key Takeaways\n\nBitcoin’s smaller 1 MB block size limits its transaction capacity, while Bitcoin Cash’s larger 32 MB block size enhances transaction speed and reduces fees.\n\nBitcoin Cash was created from Bitcoin in 2017 to address scalability issues, opting for a larger block size that differs from Bitcoin’s original focus on decentralization.\n\nDespite sharing a common origin, Bitcoin and Bitcoin Cash operate on separate blockchains and serve different purposes, making them non-interchangeable.\n\nBitcoin emphasizes security and decentralization with its smaller block size, whereas Bitcoin Cash focuses on efficiency with faster transactions, potentially compromising some aspects of decentralization.\n\nBitcoin and Bitcoin Cash are two similar digital assets in terms of their foundational structure. However, both cryptocurrencies hold unique traits that make them differ from each other.\n\nWhat Is The History Of Bitcoin And Bitcoin Cash?\n\nThe origins of Bitcoin (BTC) and Bitcoin Cash (BCH) can be traced back to the inception of Bitcoin with its genesis block in 2009, and the significant fork in 2017 that led to the creation of Bitcoin Cash. The following narrative delves into the detailed history of these two prominent cryptocurrencies:\n\nBitcoin: The Genesis Of First Cryptocurrency (2009)\n\nBitcoin, the first cryptocurrency, was created by an individual or group of individuals using the pseudonym Satoshi Nakamoto. It was introduced in 2009 as a decentralized digital currency, operating on a peer-to-peer network without the need for a central authority.\n\nThe idea was to enable direct digital transactions between parties, secured by blockchain technology. Bitcoin’s creation was partly in response to the 2008 financial crisis, aiming to provide a transparent, tamper-proof, and a decentralized financial system.\n\nBitcoin Cash: A Response To Bitcoin Scalability Issues (2017)\n\nAs Bitcoin gained popularity, it faced scalability issues. The Bitcoin network could only handle a limited number of transactions per second due to its 1 MB block size limit. This limitation led to slower transaction times and higher fees, especially during periods of high demand.\n\nBitcoin’s debate on scalability in 2017, resulted in the Bitcoin community being divided over how to address scalability issues. One faction advocated for keeping the block size small to maintain decentralization and security, while another group pushed for increasing the block size to process more transactions and to reduce fees.\n\nUnable to reach a consensus, the latter group initiated a hard fork of the Bitcoin blockchain on August 1, 2017. This fork led to the creation of Bitcoin Cash (BCH), a new cryptocurrency with an increased block size limit (initially 8 MB, later further increased), aimed at providing faster transaction speeds and lower fees.\n\nBitcoin Vs Bitcoin Cash: How They Are Different\n\nBitcoin Cash was designed to be used more as a medium of exchange for daily transactions, in contrast to Bitcoin, which is a modern day store of value or “digital gold” over the last decade.\n\nThe Bitcoin fork to Bitcoin Cash was not just technical but also ideological, reflecting differing visions for the future of cryptocurrencies. While Bitcoin continues to be the most recognized and valued cryptocurrency, Bitcoin Cash has also established\n\nBitcoin vs Bitcoin Cash: 6 Key Differences\n\nThe cryptocurrency world is vast and varied, with Bitcoin and Bitcoin Cash being two of its most prominent players. Aside from the name, the differences between the two cryptocurrencies are significant, as explained below.\n\n1.0 Price And Market Capitalization\n\nAt the outset, the most noticeable difference between Bitcoin and Bitcoin Cash lies in their market value. Currently, Bitcoin stands at around $37K with a market capitalization exceeding $750 billion. In contrast, Bitcoin Cash is priced at $220 , with a market cap of over $4.7 billion as per CoinMarketCap data. This stark difference in value and market presence sets the stage for further differences.\n\n2.0 Transaction Speed And Fee\n\nBitcoin, governed by predefined rules like a capped supply of 21 million coins and the halving events every four years, faces limitations in transaction speed, processing only 3-7 transactions per second (TPS).\n\nThe network’s 1 MB block size means each block can contain about a thousand transactions, leading to increased competition and higher transaction fees.\n\nBitcoin Cash, born out of a hard fork from Bitcoin, addresses these issues with a larger block size of 32 MB (up from an initial 8 MB), allowing for around 100 TPS. This enhancement not only speeds up transactions but also reduces costs significantly, making Bitcoin Cash a more efficient alternative at the expense of its decentralization.\n\n3.0 Block Size: A Core Technical Difference\n\nThe block size is a fundamental technical difference between the two cryptocurrencies. Bitcoin’s 1 MB block size is dwarfed by Bitcoin Cash’s 32 MB.\n\nThis increase not only boosts transaction speed (up to 200 TPS) but also reduces transaction costs when compared to a fraction of Bitcoins cost. However, this apparent strength has not translated into significant growth for the Bitcoin Cash network.\n\n4.0 Security: The Trade-Off\n\nBitcoin’s network is renowned for its decentralization and security, with nodes spread worldwide. This extensive distribution enhances its security. Bitcoin Cash, while faster and cheaper, potentially sacrifices some degree of decentralization and security due to its larger block size and faster processing capabilities.\n\n5.0 Smart Contracts And DeFi\n\nBitcoin was designed for peer-to-peer transactions and does not natively support smart contracts and decentralized applications (dApps). However, with developments such as the integration of layers like Stacks and RSK, Bitcoin developers are actively working to support smart contracts on the Bitcoin network, challenging the notion that Bitcoin cannot accommodate these functions.\n\nIn contrast, Bitcoin Cash readily supports smart contracts and DeFi services, allowing for more complex functions through languages like Cashscript.\n\n6.0 Token Issuance And NFTs\n\nBitcoin’s Omni Layer, a software layer built on top of the Bitcoin blockchain enhances the features of Bitcoin through its own additional characteristics. By providing smart contract capabilities, Omni Layer enables developers to create customized cryptocurrencies. Developers\n\nhold the power to build cryptocurrencies with specific features and rules. Essentially, Omni Layer helps expand the Bitcoin network beyond its own currency in a decentralized and transparent way.\n\nBitcoin Cash uses the Simple Ledger Protocol (SLP) for token issuance, supporting NFTs and unique, non-fungible tokens (NFTs). Both networks, however, still lag in widespread adoption in this area.\n\nThe Decentralization Vs. Transaction Efficiency Debate\n\nWhen critically analyzing the philosophical divide between Bitcoin and Bitcoin Cash, investors will need to identify an important function to safeguard. Being the protection of the decentralization of Bitcoin, or the prioritization of transaction efficiency in Bitcoin Cash.\n\nDecentralization (Bitcoin’s Key Focus)\n\nBitcoin’s main focus is decentralization, which was a key aspect of Satoshi’s vision because it emphasizes financial democracy. Bitcoin maximizes decentralization via small block sizes, as this allows for widespread participation in network maintenance.\n\nHowever, as mentioned prior, this limits transaction capacity and causes slower processing and results in higher fees. Despite these challenges, Bitcoin enthusiasts accept these limitations, valuing its role as a secure, inflation-resistant digital asset.\n\nTransaction Efficiency (Bitcoin Cash’s Key Focus)\n\nAs explained, Bitcoin Cash was created with an emphasis on transaction efficiency. By raising the block size limit, more transactions can be handled in a single block. By lowering transaction costs and speeding up processing, this method becomes feasible for regular transactions, such as purchasing coffee.\n\nBoth networks continue to evolve. For instance, the Lightning Network aims to increase transaction speed and reduce costs without compromising its decentralization. Bitcoin Cash continues to explore ways to optimize its larger block strategy.\n\nConclusion\n\nThe differences between Bitcoin and Bitcoin Cash centers around a fundamental debate whereby the Bitcoin community prioritizes decentralization, a choice that upholds the principles surrounding financial democracy and security but at the cost of transaction speed and scalability.\n\nOn the other hand, Bitcoin Cash, emerging from the limitations of Bitcoin, opts for larger block sizes to enhance transaction efficiency and usability, potentially compromising on the degree of decentralization.\n\nAs both cryptocurrencies continue to develop and adapt, they will continue to offer distinct paths for users and investors, each with its own set of advantages, challenges, and potential for future growth.\n\nFAQs\n\nWhat are the main differences between Bitcoin and Bitcoin Cash?\n\nBitcoin and Bitcoin Cash differ primarily in block size, transaction speed, and fees. Bitcoin focuses on decentralization with a smaller block size, leading to slower transactions and higher fees. Bitcoin Cash increases block size for faster, cheaper transactions, which potentially compromises decentralization.\n\nHow did Bitcoin Cash originate from Bitcoin?\n\nBitcoin Cash was created in 2017 through a hard fork of Bitcoin, in response to scalability issues. It increased the block size limit to improve transaction speed and reduce fees, diverging from Bitcoin’s original framework.\n\nCan Bitcoin and Bitcoin Cash be used interchangeably?\n\nNo, Bitcoin and Bitcoin Cash are separate cryptocurrencies with different blockchains. They cannot be used interchangeably as they operate on different networks and have distinct technical and philosophical frameworks.\n\nWhat are the implications of the block size difference between Bitcoin and Bitcoin Cash?\n\nBitcoin’s smaller block size limits transaction capacity, leading to slower processing and higher fees, but ensures greater decentralization. Bitcoin Cash’s larger block size allows for faster, cheaper transactions but may compromise some decentralization aspects."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy9zdG9jay1tYXJrZXQvbWFya2V0LXNlY3RvcnMvZmluYW5jaWFscy9jcnlwdG9jdXJyZW5jeS1zdG9ja3MvdHlwZXMtb2YtY3J5cHRvY3VycmVuY2llcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "What Are All the Different Types of Cryptocurrency? - The Motley Fool",
        "content": "Since its creation in 2009, Bitcoin (BTC -3.59%) has become a revolutionary digital currency. Because it enables peer-to-peer payments without a third party (like a bank), it has set off a tidal wave of other cryptocurrencies and digital assets making use of blockchain technology. Blockchain is a digital public ledger where information on each transaction receives a unique \"hash\" (or identity) and is added to the end of the ledger. Bitcoin's success has put blockchain on the map and put its potential to decentralize and improve the digital economy on a path to disrupting the status quo.\n\nImage source: The Motley Fool\n\nCrypto coins vs. tokens Crypto coins vs. tokens First things first: Know the difference between a coin and a token. When discussing cryptos, you may hear the terms \"coin\" and \"token\" frequently used. Although they may sound like interchangeable terms, there is a difference. It's important to keep them straight. A digital coin is created on its own blockchain and acts in much the same way as traditional money. It can be used to store value and as a means of exchange between two parties doing business with each other. Examples of coins include Bitcoin and Litecoin (LTC -2.81%). Tokens, on the other hand, have far more uses than just digital money. Tokens are created on top of an existing blockchain and can be used as part of a software application (like to grant access to an app, to verify identity, or to track products moving through a supply chain). They can represent digital art (like with NFTs, or \"non-fungible tokens\" that certify something as unique). There has even been experimentation using NFTs with physical assets, such as real-life art and real estate. Ether is an example of a token, which is used to make transactions on the Ethereum (ETH -3.48%) network.\n\nWhy so many? Why are there so many types of cryptocurrency? Blockchain technology is open source, meaning any software developer can use the original source code and create something new with it. Developers have done just that. There are estimated to be more than 10,000 different cryptocurrencies in circulation at the time of this writing, and the figure keeps increasing. For reference, the number of cryptos surpassed 1,000 only four years ago. Part of the reason for the surge is the relative ease with which new cryptocurrencies can be created. The source code of one can be used to build another. For example, the Ethereum network could be used to create your own personal digital coins. Sometimes there are \"forks\" in the software code that change the rules about how a crypto is governed, which can lead to the creation of a new crypto. Bitcoin Cash (BCH -0.11%) was created in 2017 as a result of a Bitcoin fork allowing more transactions to be recorded on a single block of the blockchain. Surging crypto prices have led many developers to try getting a cut of the action. And blockchain technology has usefulness beyond just digital currencies. So, while some cryptos might be a bubble that will eventually pop, the decentralized nature of the technology and the broad scope of how it can be applied in the software world are two reasons why there are so many cryptos. Main types Main types of cryptocurrency Bitcoin is considered the first cryptocurrency created, and other individual cryptocurrencies are known as \"altcoins\" (a combo word derived from \"alternative coin\"). It's difficult to say which cryptos are the best ones, but Bitcoin and some of the largest altcoins out there are top-tier options because of their scalability, privacy, and the scope of functionality they support.\n\nTable by author. Data source: coinmarketcap.com. Data as of October 27, 2023. Coin Total Market Value* Bitcoin (CRYPTO:BTC) $656 billion Ethereum (CRYPTO:ETH) $212 billion Tether (CRYPTO:USDT) $84.5 billion Binance Coin (CRYPTO:BNB) $62.6 billion USD Coin (CRYPTO:USDC) $24.9 billion XRP (CRYPTO:XRP) $29.1 billion Terra (CRYPTO:LUNA) $249.5 million Solana (CRYPTO:SOL) $13.3 billion Cardano (CRYPTO:ADA) $10.1 billion Avalanche (CRYPTO:AVAX) $3.7 billion\n\nThere really isn't one \"best\" cryptocurrency since each has different features built in based on what the developer designed it for. Here's an overview of some of the most popular digital coins and how each is being used. 1. Bitcoin Bitcoin is regarded as the first decentralized cryptocurrency using blockchain technology to facilitate payments and digital transactions. Instead of using a central bank to control the money supply in an economy (like the Federal Reserve in tandem with the U.S. Department of the Treasury) or third parties to verify transactions (such as your local bank, credit card issuer, and the merchant's bank), Bitcoin's blockchain acts as a public ledger of all transactions in the history of Bitcoin. The ledger allows a party to prove they own the Bitcoin they're trying to use and can help prevent fraud and other unapproved tampering with the currency. A decentralized currency can also make peer-to-peer money transfers (like those between parties in two different countries) faster and less expensive than traditional currency exchanges involving a third-party institution. 2. Ether (Ethereum) Ether is the token used to facilitate transactions on the Ethereum network. Ethereum is a platform that uses blockchain technology to enable the creation of smart contracts and other decentralized applications (meaning the software doesn't have to be distributed on app exchanges like Apple's (AAPL 0.88%) App Store or Alphabet's (GOOGL 1.5%)(GOOG 1.8%) Google Play Store, where they might have to give a 30% cut of any revenue to the tech giants). Ethereum is both a cryptocurrency (the actual coins are measured in units called Ether) and a software development sandbox. 3. Tether Tether is a stablecoin, or a currency tied to a fiat currency -- in this case, the U.S. dollar. The idea behind Tether is to combine the benefits of a cryptocurrency (such as no need for financial intermediaries) with the stability of a currency issued by a sovereign government (versus the wild price fluctuations inherent with many cryptos).\n\n4. Binance Coin Binance Coin is available on the Binance cryptocurrency exchange platform, along with other digital coins that are available for trading. Binance Coin can be used as a type of currency, but it also facilitates tokens that can be used to pay fees on the Binance exchange and to power Binance's DEX (decentralized exchange) for building apps. 5. USD Coin USD Coin is another stablecoin, and, like Tether, it is pegged to the U.S. dollar. Also like Tether, USD Coin is hosted on the Ethereum blockchain. The idea behind USD Coin was to create a \"fully digital\" dollar, one that has the stability of U.S. fiat currency but doesn't require a bank account or that the holder live in a particular country. Rather than an investment, USD Coin is envisioned as everyday money that can be spent with merchants on the internet.\n\nCrypto trading Are there different types of cryptocurrency trading? Investing in cryptocurrencies is a little different than investing in shares of a company. Stock represents ownership of a business and a claim to profits the company generates. Purchasing coins of a cryptocurrency, though, is a speculative bet on the price movement of that digital currency -- which can be highly volatile and is subject to the law of supply and demand since digital currency by itself is not a dynamic asset. Cryptocurrencies can be exchanged for other digital currencies or for fiat currencies like the U.S. dollar using a digital wallet on a trading app. But there are other ways to make money besides trading. Certain cryptocurrencies can be \"staked\" to earn rewards. Once an investor has purchased a crypto, it can be held in account and used to verify transactions occurring on the blockchain network. This method of powering a blockchain network is known as \"proof of stake,\" and the owner of the crypto can earn a type of dividend by staking their holdings, which are usually paid in additional coins or tokens. In addition to trading digital currencies, derivatives contracts are also available on Bitcoin and Ethereum from leading derivatives exchange CME Group (CME -0.55%). Derivatives such as futures and options are primarily used as a hedge against price fluctuations in the underlying asset.\n\nRelated investing topics\n\nWhere to buy Where to buy all types of cryptocurrency With so many cryptocurrencies out there right now, there is no single place that grants access to all of them. However, Coinbase Global (COIN -8.57%) is one of the largest trading platforms and currently supports more than 100 cryptocurrencies (including most of the top 10 largest cryptos by market cap). Binance is another top trading platform and is where Binance Coin and tokens can be traded. If you're looking to buy company stock and cryptocurrency from a single place, here are the apps worth checking out: Robinhood\n\nWebull\n\nBlock 's ( SQ -5.27% Cash App\n\n's ( Cash App SoFi\n\nThese trading apps don't support all account types like a full-service stock broker, but they have lots of functionality that combines basic crypto and stock trading with digital banking capabilities. This is just the tip of the cryptocurrency iceberg. There are thousands of different digital currencies utilizing blockchain technology being used for an incredibly diverse list of applications within the digital economy. Bitcoin is far and away the most popular crypto because it has picked up momentum among a young generation of consumers, but developers are always innovating new blockchain tech and uses for it. The developments give other platforms such as Ethereum a lot of value since they are used to build new software. For investors trying to peer into the future, that could hold a lot of appeal since decentralized blockchain could remove third parties from business transactions and make payments around the world more efficient."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmstd29vZC1zZWVzLTIwdC1iaXRjb2luLTIxMjMzNzkxNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "ARK's Wood Sees $20T Bitcoin 'Ecosystem' by 2030 - Yahoo Finance",
        "content": "Famed investor and ARK Invest CEO Cathie Wood expects trillions of investor dollars will flow into spot bitcoin ETFs and the digital-asset industry at large in the next decade.\n\nWood predicts about $20 trillion in the bitcoin market and $5 trillion in ethereum potentially by 2030, pointing to an increase in institutional investment in bitcoin, as well as a wider acceptance of use cases for digital assets by traditional financial firms.\n\n“Right now, we’re somewhere between one and one-and-a-half trillion [dollars] for the ecosystem,” said Wood while speaking on a panel for a New York press event on Tuesday. “We see that scaling to $25 trillion in the next five to 10 years.”\n\nAlthough the cryptocurrency industry has been plagued by fraud and companies imploding, firms pursuing the launch of a spot bitcoin ETF are banking on broader adoption of bitcoin and ethereum by the traditional financial markets.\n\nSo far, the Securities and Exchange Commission has rejected all bids for a spot bitcoin ETF, but the agency is currently in talks with firms to work toward a potential approval. The discussions follow the SEC’s loss of a watershed court case to Grayscale Investments in August, when judges ruled the agency had been wrong to block Grayscale’s application to convert its bitcoin trust into an exchange-traded fund.\n\nWood Predicts Investor Enthusiasm for Bitcoin ETF\n\nIn an interview with etf.com Tuesday, Wood said she believes institutional investors will turn toward bitcoin when they see its value.\n\n“Typically, institutions will tiptoe in with one percent…then they’ll get more educated and intrigued and build their positions the more they understand,” she explained. Wood expects between 2% and 6.5% of institutional allocation into bitcoin in this time frame.\n\nShe also noted that investors can use bitcoin as a hedge against both inflation and deflation, pointing to investors looking towards bitcoin in reaction to the regional banking crisis this past spring.\n\nStory continues\n\nContact Lucy Brewster at lucy.brewster@etf.com.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvMy1jcnlwdG8tc3RvY2tzLXRvLWJ1eS1iZWZvcmUtdGhlLTIwMjQtYml0Y29pbi1oYWx2aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "3 Crypto Stocks to Buy Before the 2024 Bitcoin Halving - Nasdaq",
        "content": "According to crypto experts, the ongoing bear market has come to an end after almost two years. Bitcoin (BTCUSD) prices have more than doubled year-to-date, while Ethereum (ETHUSD) has surged close to 70% in 2023. Moreover, two key near-term drivers could drive cryptocurrency prices higher in the next 12 months.\n\nFirst is the Bitcoin halving event, which is expected to take place in April 2024. The total number of Bitcoin that can be mined is limited to 21 million, and the halving process reduces the rewards for mining - which is intended to control the supply of cryptocurrency on the market and limit inflation. The halving typically acts as a positive catalyst for Bitcoin. For instance, between November 2015 and November 2017, BTC prices surged by 2,000%, while they spiked almost 600% between November 2019 and November 2021.\n\nAnother significant event for cryptocurrencies could be the upcoming launch of multiple spot Bitcoin exchanged traded funds (ETFs). Several investment managers, including BlackRock (BLK) and Invesco (IVZ), have applied to introduce their own version of a spot Bitcoin ETF, which seems increasingly likely to be approved by the SEC in the next six months. BlackRock has close to $10 trillion in assets under management, and even if it allocates 1% of funds toward Bitcoin, it could result in inflows worth $100 billion.\n\nIt seems the time is ripe to invest in Bitcoin and related crypto assets right now. While you can purchase BTC and other cryptocurrencies directly from exchanges like Coinbase (COIN), another way to gain exposure to this area of the market is by investing in BTC mining companies. Here are three crypto stocks to consider buying before the 2024 Bitcoin halving event.\n\nTeraWulf Stock\n\nValued at $222 million by market cap, TeraWulf (WULF) develops, owns, and operates Bitcoin mining facility sites in New York and Pennsylvania. In Q3 of 2023, TeraWulf self-mined 611 BTC and realized another 13 BTC via hosting profit share. Its revenue rose to $19 million in Q3, up from $15.5 million in the year-ago period.\n\nThe total value of the self-mined Bitcoin stood at $27.9 million, while the power cost per Bitcoin rose 29% to $9,322 due to a 13% increase in network difficulty. TeraWulf reported adjusted EBITDA (earnings before interest, tax, depreciation, and amortization) of $9 million, an increase of 19% year over year.\n\nOut of the five analysts tracking WULF, four recommend “strong buy,” and one recommends “moderate buy.” The average target price for WULF is $3.65, which is 244% above the current trading price.\n\nwww.barchart.com\n\nHive Digital Technologies Stock\n\nHive Digital Technologies (HIVE) is another Bitcoin mining company, valued at $249 million by market cap. HIVE reported revenue of $22.8 million in Q3 and mined 801 BTC. Its gross operating profit stood at $4.6 million, indicating a margin of 20%.\n\nThe number of BTC mined during the quarter fell by 6.6% year over year. Similar to TeraWulf, HIVE's revenue was impacted by increased mining network difficulty, which means more miners were competing with better equipment for the opportunity to mine the maximum number of Bitcoin. HIVE recently purchased 4,800 Bitmain S19k Pro ASIC miners, allowing it to upgrade a portion of its fleet to improve mining efficiency.\n\nOut of the three analysts tracking HIVE, two recommend “strong buy,” and one recommends “moderate buy.” The average target price for HIVE is $6.83, which is 127% above the current trading price.\n\nwww.barchart.com\n\nRiot Blockchain Stock\n\nThe final Bitcoin mining stock on my list is Riot Blockchain (RIOT), valued at $2 billion by market cap. Among the largest BTC mining companies in the world, Riot reported revenue of $51.9 million in Q3, as it mined 1,106 Bitcoin during the quarter.\n\nThe company has mined a total of 4,996 BTC in 2023 with an average cost of just $5,537 per Bitcoin, which indicates Riot is a leading low-cost producer of the digital asset. Riot ended Q3 with $290 million in cash and 7,327 BTC worth $500 million, providing it with the liquidity to ride out an uncertain macro environment.\n\nOut of the eight analysts tracking RIOT, six recommend “strong buy,” one recommends “moderate buy,” and one recommends “strong sell.” The average target price for RIOT is $16.78, which is 65% above the current trading price.\n\nwww.barchart.com\n\nOn the date of publication, Aditya Raghunath did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1pbXBhY3QtZXRmLWNvbnZlcnNpb25zLWNvdWxkLTE3NDYxNDkyNy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin: The impact ETF conversions could have on investors - Yahoo Finance",
        "content": "As the January 10 deadline for the SEC to decide on a spot Bitcoin (BTC-USD) ETF approaches, investors are watching closely for any new details on how it will affect the market. Yahoo Finance's Julie Hyman sat down with ARK Invest Founder, CEO, and CIO Cathie Wood to discuss her stance on bitcoin, the crypto market, and digital assets in general. During the interview, Woods enthusiastically elaborated on her interactions with the SEC: \"We were thrilled to get questions back [from the SEC] because it means they're engaged now. We have met a number of the research people at the SEC... they know what they're talking about and the level of sophistication of their questions suggested okay now they're moving deeply into this.\"\n\nMore questions are arising on what the SEC's decision could mean for markets and investors if regulators convey positive sentiment. Lance McGray, Advisors Asset Management Head of ETF Product, joins Yahoo Finance to give insights on the impacts of the SEC decision and how successful these ETFs could be.\n\nMcGray explains how successful ETFs have already been just in the last year: \"We've seen in the last year or so about 50 conversions come to market and about $75 billion dollars of assets that have come over from other wrappers, specifically the mutual fund wrapper into what is perceived to be a more cash efficient, more flexible, a more transparent wrapper, the ETF wrapper.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\nRACHELLE AKUFFO: Well, investors in the crypto space are keeping their eyes on the SEC's spot bitcoin decision with the January 10th deadline quickly approaching. Our very own Julie Hyman spoke with ARK investment's Cathie Wood about movement in the space, and the potential for SEC approvals. Take a listen to what she had to say.\n\nCATHIE WOOD: This summer, we got questions back from the SEC. Now normally when you get questions from the SEC, you're just saying, oh my goodness. We were thrilled to get questions back because it means they're engaged now. Now we have met a number of the research people at the SEC on the research side, and they are extremely sophisticated. They know what they're talking about and the level of sophistication of their questions suggested, OK, now they're moving deeply into this.\n\nStory continues\n\nJULIE HYMAN: As part of our ETF report brought to you by Invesco QQQ, let's bring in advisors asset management head of ETF product, Lance McGray to discuss more. Thank you for joining us this morning. So first want to start with what we heard from Cathie Wood about the optimism that we're seeing in the momentum towards a potential spot bitcoin ETF approval here.\n\nIn terms of the likelihood, are we liking this momentum and perhaps how soon could we see it?\n\nFirst off, thanks for having me. I think the-- there is plenty of optimism out there. At the end of the day, you're talking about a-- you're talking about a $700 billion market cap universe that has been rather untouched from the ETF industry. So Cathie is extremely optimistic on the conversations that they've been having with the SEC but let's not get too far ahead of ourselves.\n\nThese conversations go all the way back to 2017 when the SEC essentially rejected its first bitcoin-- spot bitcoin ETF. So again, while the SEC is coming back with conversations, and that's good news for investors that are looking for a spot bitcoin ETF, let's not forget the mandate of the SEC and that's really to protect the investors with products like this.\n\nSo I anticipate things to be moving smoothly, things to continue moving, but quite honestly, I would-- I would be shocked if something happens in 2023, probably looking at more back half of 24 than anything else.\n\nAKIKO FUJITA: Now back half of 2024, well, we only have a few months left or one month almost left in 2023. Lance, you know, this has always been seen as a catalyst, that next leg for crypto what's the interest been like among your clients? What are you hearing?\n\nLANCE MCGRAY: There's interest specifically around the spot bitcoin because right now, there are futures-based ETFs. The SEC has got comfortable with futures-based products because these are securities, these are on exchange where there is regulation. Their concern is really around the manipulation and the fraud tied to the underlying spot market.\n\nSo there is appetite. There's been a recent poll that came out last year that says if there's a spot bitcoin product that comes out, there's a 72% appetite for investors to get into that product rather than the current futures product. And we talk about the futures products, yes, it is essentially tracking bitcoin, but it's important to remember that these futures products wouldn't operate the same as A-- as a true spot bitcoin product.\n\nThere's going to be-- there's going to be role costs, there's carry costs, there's contango, there's different costs that come into this and at the end of the day, what the investors are telling us is that they're looking for a spot bitcoin ETF rather than a futures-based ETF which we currently have in the marketplace.\n\nRACHELLE AKUFFO: And we are expecting that if this does get approved, there will be a wave of these. But one of these in the mix here is also Grayscale trying to convert its fund to an ETF. Not a lot of known is about this process. I know Cathie Wood was saying she wasn't sure if Grayscale would be able to do that. What do people need to know about that conversion process and what that opens up?\n\nLANCE MCGRAY: Yeah, well, that's a big thing in the ETF industry right now. I know we're talking about bitcoins, but let's just look at mutual fund ETF conversions. This is something that's just recently come to market over the last few years, and we've seen, in the last year or so, about 50 conversions come to market and about $75 billion of assets that have come over from other wrappers specifically the mutual fund rapper into what is perceived to be a more tax efficient, a more flexible, a more transparent wrapper the ETF wrapper.\n\nSo we fully expect that we're going to see these, we're going to see this continue to roll out. We think there's a major trend on the active management side, whether it's crypto or fixed income or equity. There's going to continue to be these mergers or conversions from one wrapper to the next. And when we specifically talk about mutual fund ETF conversions, there's-- from an issuer perspective, let's talk about the benefits.\n\nThe first and foremost is that the track record from the mutual fund. If you have a mutual fund that has a track record of 10, 20, 30 years, that track record can come over to the ETF so that's fantastic news. The other thing in the ETF space is getting scale on day one. If you can bring over assets in from a mutual fund into an ETF.\n\nThe hardest thing for us to do as an ETF issuer is to get that first $100 million, and when we're doing these conversions, you can get that scale on day one. And then finally, you have improved tax consequences of the mutual-- or of the ETF over other vehicles like the mutual fund. So this is something we're going to see a lot of in the coming years, and I think it's one area that's really going to take the world of ETFs to the next step is active management and conversions of other wrappers into ETFs.\n\nAKIKO FUJITA: There's certainly a lot to consider in a growing industry to your point. Advisors Asset Management, Head of ETF Product, Lance McGray. Good to talk to you today. Really appreciate the time.\n\nLANCE MCGRAY: Thanks for having me."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaG9uZy1rb25nLWJhc2VkLWJveWFhLXBsYW5zLXRvLWJ1eS0lMjQ0NS1taWxsaW9uLXdvcnRoLW9mLWJpdGNvaW4tYXMtdHJlYXN1cnktcmVzZXJ2ZS1hc3NldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Hong Kong Based Boyaa Plans to Buy $45 million Worth of Bitcoin As Treasury Reserve Asset - Nasdaq",
        "content": "Boyaa Interactive, a Hong Kong-based gaming company, revealed plans for a potential investment in cryptocurrencies, including Bitcoin, as this endeavor seeks to enhance the Group's asset allocation strategy.\n\nFollowing an earlier voluntary announcement in August 2023, Boyaa's Board views BTC and crypto acquisition as pivotal for its business expansion and asset allocation strategy. The company aims to seek shareholders' approval to authorize a $100 million acquisition mandate for purchasing Bitcoin, crypto, and stablecoins within a 12-month period.\n\nThe proposed mandate outlines the key parameters:\n\nMandate Period: The acquisition mandate spans 12 months post the ordinary resolution's approval at the Extraordinary General Meeting. Maximum Amount: An aggregate limit of $100 million has been set, with a specific focus on purchasing BTC, ETH, Tether USD (USDT), and USD Coin (USDC). Allocating $45 million each to acquiring BTC and ETH, with the remainder of no more than $10 million on USDT and USD Coin. Types of Cryptocurrencies: Boyaa says it is acquiring cryptocurrencies aligning with its business strategy, primarily BTC and ETH. Acquisition Consideration: Purchases will be based on open market bid and ask prices, with a maximum premium of 10% on the market price. The funding will derive from the Group's idle cash reserves. Authorization Scope: The Board will exercise discretion concerning transaction volume, timing, and cryptocurrency selection, conducting acquisitions on licensed trading platforms like HashKey Exchange.\n\nThe company anticipates dispatching a circular to shareholders by November 30, 2023, detailing the mandate's specifics and the proposed acquisitions.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vY2F0aGllLXdvb2Qtb2Rkcy1zcG90LWJpdGNvaW4tMjIzNzAxMzAwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood: Odds of spot bitcoin ETF approval have gone up - Yahoo Finance",
        "content": "ARK Invest is teaming up with 21shares to launch new crypto-focused ETFs. ARK Invest Founder and CEO Cathie Wood says the partnership made sense given how complementary the firms' areas of expertise are. Wood says that bitcoin (BTC-USD) is \"the first global, digital, private rules based monetary system in history\" adding that global monetary policy is \"unhinged, it's not hinged to anything except human decision-making\" and that \"the monetary system is bitcoin.\"\n\nArk is one of the several firm trying to launch a spot bitcoin ETF. Wood says \"something has changed,\" noting that the Securities and Exchange Commission has responded to their application with questions instead of just rejecting it. Wood believes this means that the odds of approval have gone up. Overall, Wood is still bull on bitcoin, saying her base case for the cryptocurrency is $600,000-$650,000. However, she thinks it could go higher, given the currency's scarcity and the potential for more institutional investment if a spot bitcoin ETF is approved.\n\nClick here to see the full interview with ARK Invest's Cathie Wood.\n\nVideo Transcript\n\nJULIE HYMAN: One of the assets that perhaps surprisingly was not rising today was bitcoin, even though it has rallied as of late today, falling by some 3.4%. And it's on this day that Cathie Wood announced or ARK Invest announced in cooperation with 21shares. It's going to be launching a new suite of digital asset ETFs. They will be actively managed.\n\nAnd I had the chance to talk to her about digital assets, broadly about these products specifically, and, of course, about her still bullish stance on cryptocurrency.\n\nCATHIE WOOD: This is the first global, digital, private, rules-based monetary system in history. It's a very big idea. When we wrote the paper in collaboration with Art Laffer-- you know Art Laffer supply-side economics, Laffer curve-- he said, I've been waiting for this since they closed the gold window in 1971. So he's been waiting 50 years for this, right? And he's so excited about everything crypto, but especially bitcoin, because he believes, and it is true, monetary policy around the world is unhinged. It's not hinged to anything except human decision making.\n\nStory continues\n\nAnd this is going to put discipline, rigor back into--\n\nJULIE HYMAN: These particular products you're talking.\n\nCATHIE WOOD: Well, bitcoin is. The monetary system is bitcoin. And so, yes, the-- why now for these? We've been working with 21shares since I met Ophelia at an ETF confab in 2018. They had really just started their business. And I said, you know, we want to move towards crypto. You are completely crypto. They were focused on the infrastructure, the regulations, really blazing a trail. They had to invent things in order to make this happen.\n\nAnd we knew that was not our core competency. And so we-- but we did start talking. Our core competency is research on disruptive innovation. And they do research. They do deep technical research on the market. Our research is on the disruptive innovation that it represents. And we've just been coming together for five years. It was a natural for us to come together.\n\nThey are or 21shares is the largest crypto ETP provider in the world, $1.5 billion. They have 35 different funds. Most of them in Europe in and around Europe. They were looking for a US entry. And we were looking for infrastructure. And, you know, we're just delighted to be partnering with them given how much groundwork they had to lay for this to happen.\n\nJULIE HYMAN: Speaking of groundwork, on another product that you're working on, of course, the spot bitcoin ETF, which you are also partnering with them on. And you've got your filing in. There's a lot of filings in. Every day, seemingly, there is a new rumor about approval of one of these things. What are you hearing from the SEC at this point? Are-- you know, there's a January deadline I know that people have been looking to. How confident are you that you're going to get approval?\n\nCATHIE WOOD: Well, something has changed. So we had put in a number of times a filing. And we were just denied. Never got any questions really, never got any response. This time, this summer, we got questions back from the SEC. Now, normally, when you get questions from the SEC, you're just saying, oh, my goodness. We were thrilled to get questions back, because it means they're engaged now.\n\nNow, we have met a number of the research people at the SEC on the research side. And they are extremely sophisticated. They know what they're talking about. And the level of sophistication of their questions suggested, OK, now they're moving deeply into this. And we answered those questions. We have not heard back. That's a good sign, too. They never tell you that-- tell you that you've satisfied them. But if you don't hear from them, they-- that usually means that you have satisfied the answers to the requests.\n\nSo that was new. And we also know that BlackRock got questions. We put our answers in first. I think they have followed. And I'm not sure about anyone else. That was different. And it says, OK, there's movement. And we are the first in line, just because we kept refiling. Others gave up. And so-- but we just kept re filing. We just kept-- and we became first in line. So David against Goliath, right?\n\nAnd that's January 10th is the final deadline. They've been able to push it. It's a very orchestrated. Push it, push it, but the final, they either approve or deny on January 10th.\n\nJULIE HYMAN: What do you think?\n\nCATHIE WOOD: Well, again, I mentioned something has changed.\n\nJULIE HYMAN: Right.\n\nCATHIE WOOD: That's good. The odds have gone up. There is only one wrinkle just occurred to us in the last couple of days. They will approve a number at once. It won't be just one. That would be choosing a winner given the way ETFs work.\n\nBut we know Grayscale wants to convert to an ETF. I don't know how practical that is, or if the SEC will let them, or if they need a special dispensation. I just don't know the rules. Grayscale has said it will sue the SEC again if it denies the conversion. If they were to do that before January 10th, I don't know if that would throw everything up in the air again.\n\nJULIE HYMAN: For the others as well.\n\nCATHIE WOOD: For everyone.\n\nJULIE HYMAN: Right.\n\nCATHIE WOOD: Yeah. I just don't know. I don't know.\n\nJULIE HYMAN: So there's still a lot of unknowns out there. You mentioned you guys bought into bitcoin at 250 way back when. So the return from 250 to 35, 36 looks pretty good. But it's not 100,000 that I think you and I have talked about at various points or even loftier numbers. Where are we in that cycle?\n\nCATHIE WOOD: I think-- so if we look at the reasons that bitcoin will scale, so our base case is today 600 to 650-- $650,000, and our bull case, based on the scarcity that is now developing, we're at roughly 19.5 million bitcoin out there, there will only be 21 million ever. And we do believe that.\n\nWe think that institutions, if the SEC blesses a bitcoin ETF, institutions will feel like the coast is clear for them to pursue. And we know a lot of institutions have been researching crypto assets for a while and do agree that it is a new asset class. Bitcoin was the first in a new asset class. We wrote-- we wrote a paper in 2000-- I think it was '16, ringing the bell for a new asset class. And our director of digital assets said to me, do you realize that happened today? We rang the bell for a new asset class. I said, oh, I didn't make that connection.\n\nAnyway, so institutions understand when there is a new asset class, it's-- there's an opportunity to diversify and increase returns per unit of risk. That's very important. They've also learned that bitcoin, in particular, can be a hedge against both inflation and deflation."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTUvY3J5cHRvLWZ1dHVyZXMtZnVuZGluZy1yYXRlcy1ub3JtYWxpemUtYWZ0ZXItYml0Y29pbi1kcm9wcy10by0zNTZrL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTUvY3J5cHRvLWZ1dHVyZXMtZnVuZGluZy1yYXRlcy1ub3JtYWxpemUtYWZ0ZXItYml0Y29pbi1kcm9wcy10by0zNTZrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Crypto Futures Funding Rates Normalize After Bitcoin Drops to $35.6K - CoinDesk",
        "content": "Large liquidations can signal the local top or bottom of a steep price move. As such, funding rates are back to normal levels of an average of 0.01% on most exchanges as of Wednesday morning."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLW91dGxvb2stYmVhci1jYXNlLXJhbGx5LWhhbHZpbmctc3BvdC1ldGYtcmVndWxhdG9ycy0yMDIzLTEx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Price Outlook: the Bear Case That Could Stall 120% Rally - Markets Insider",
        "content": "Bitcoin has climbed roughly 117% in 2023.\n\nBullishness around a spot bitcoin ETF and 2024's halving event have fueled gains.\n\nFrom regulators to stubborn inflation, experts shared what could derail the rally.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin, the world's largest cryptocurrency by market capitalization, has climbed roughly 117% this year, handily beating the returns in most other asset classes.\n\nOn Wednesday, the token hovered at $36,080. Its supporters have been bullish all year on regulators' potential approval of a spot bitcoin ETF, the 2024 halving event, easing monetary policy, and falling inflation.\n\nHowever, industry veterans caution that headwinds remain that could mute the enthusiasm and derail the rally.\n\nHere's the bear case for the world's biggest crypto as the market heads into year-end.\n\nAdvertisement\n\n'Overdone' optimism for spot ETFs\n\nJPMorgan strategists said the latest rally in crypto market is \"rather overdone,\" and bitcoin may not gain as much as anticipated on spot ETFs or the upcoming halving.\n\nRather than new institutional products ushering in more investors, JPMorgan maintained they would merely attract flows from existing bitcoin products, like Grayscale's bitcoin trust or mining companies, basically having the effect of shuffling investment around rather than attracting new inflows.\n\n\"We envisage this shift as a relative value trade as several of the above bitcoin products trade at a premium or much reduced discount relative to the past,\" the strategists said.\n\nEven if the SEC approves spot bitcoin ETFs, that doesn't guarantee a lasting change of tune from regulators in favor of crypto, in the bank's view.\n\nAdvertisement\n\nTo that point, Alonso de Gortari, chief economist at Mysten Labs, told Business Insider that any regulatory updates that restrict access or opportunities for bitcoin could crimp gains for investors.\n\nWhile Europe and Asia have come out with more accommodative policies in recent months, the US has yet to follow suit, he explained. It would be surprising if Gary Gensler and the Securities and Exchange Commission deny the approval of all spot ETF applications, but the move could send bitcoin — as well as ether and other tokens — tumbling.\n\n\"The reason ETF issuance is so important for the industry is that it would sideline many of the custody and security issues inherent to crypto that many investors would like to avoid,\" de Gortari said. \"An ETF would show that blockchain has matured as an infrastructure layer, being the rails that serve digital assets in the backend, while letting investors access these assets through a mature middleware layer.\"\n\nMacro headwinds\n\nJames Butterfill, the head of research at CoinShares, told Business Insider that bitcoin's climb could falter if inflation doesn't fall as expected in the new year.\n\nAdvertisement\n\nWhile Bank of America said Tuesday October's year-over-year CPI reading of 3.2% officially puts an end to the Fed's hiking cycle, any resurgence for inflation would send money from bitcoin into alternatives, and would make it more likely that Fed policy stays tight longer before the central banks shifts to a more accommodative stance.\n\n\"This would push treasury yields higher, making them look more attractive relative to bitcoin,\" he said, noting that he anticipates the US economy to continue heading for a recession in 2024.\n\nDespite some bearish macro developments posing a threat, there is still a strong bull case in 2024's halving event, sources say. Some experts forecast that the halving—which reduces rewards for mining bitcoin by half—could push the token to new record highs above the six-figure mark. The last three halving events have each been followed by record highs within 12 months.\n\nMysten Labs' de Gortari said over the last two years, innovation has ramped up not just for bitcoin but across the digital asset space, and an increasing number of retail investors are recognizing the upside."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8xNS9ob25nLWtvbmctZ2FtaW5nLWNvbXBhbnktYm95YWEtaW50ZXJhY3RpdmUtc2Vla3MtYXBwcm92YWwtdG8tYnV5LTEwMG0taW4tY3J5cHRvLXRvLWJvb3N0LXdlYjMtc3RyYXRlZ3kv0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzE1L2hvbmcta29uZy1nYW1pbmctY29tcGFueS1ib3lhYS1pbnRlcmFjdGl2ZS1zZWVrcy1hcHByb3ZhbC10by1idXktMTAwbS1pbi1jcnlwdG8tdG8tYm9vc3Qtd2ViMy1zdHJhdGVneS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Hong Kong Gaming Company Boyaa Interactive Seeks Approval to Buy $100M in Crypto to Boost Web3 Strategy - CoinDesk",
        "content": "\"In view of the virtual assets’ attraction to global investors and the future opportunities that will be opened up as virtual assets move into the field of Web3, the Hong Kong Government has been committed to providing a facilitating environment for promoting the sustainable development of virtual asset transactions, \" the company said in the filing."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYXJrLWludmVzdHMtY2F0aGllLXdvb2Qtc2F5cy10aGUtcHJpY2Utb2Ytb25lLWJpdGNvaW4tY291bGQtcmlzZS10by0kMS41bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ark Invest's Cathie Wood Says The Price Of One Bitcoin Could Rise To $1.5M - Nasdaq",
        "content": "Ark Invest's Cathie Wood has long been bullish on the cryptocurrency space. She's still optimistic that Bitcoin (CRYPTO: BTC) could trade somewhere between $1 million and $1.5 million.\n\nWhat To Know: Bitcoin has more than doubled since the start of the year as optimism surrounding a potential spot Bitcoin ETF continues to rise. Wood believes the rally in Bitcoin is just getting started.\n\nIn an interview with the Wall Street Journal this week, Wood predicted that Bitcoin would trade up to $650,000 per coin, but that's just her base case. In a bull case scenario, the world's largest cryptocurrency could be worth between $1 million and $1.5 million per coin, she said.\n\n\"Last year, a lot of people thought that the bankruptcy of FTX, Celsius and Three Arrows was going to be the end of Bitcoin. And quite the opposite happened,\" Wood said.\n\nMore and more people are starting to understand that FTX was a centralized organization, lacking transparency. Bitcoin is the exact opposite of that, she said.\n\nBitcoin is decentralized and has a network of developers watching over it, preventing fraud like what we saw with FTX, she explained.\n\n\"When FTX went down, the bitcoin blockchain didn’t skip a beat, the Ethereum (CRYPTO: ETH) network didn’t skip a beat. It was as though it didn’t happen,\" Wood told the Journal.\n\nCheck This Out: EXCLUSIVE: Crypto Industry Insider Predicts Bitcoin Spot ETF In Early 2024 — Why It's 'Not Entirely Priced In'\n\nThe Ark Invest CEO suggested that a spot Bitcoin ETF could help push prices higher. It would make it easy for the average person to gain exposure to the asset, she said.\n\nAn ETF would be regulated and offer protection. It would also be much less complicated than using Coinbase Global Inc (NASDAQ: COIN) to buy Bitcoin, she said.\n\nCoinbase is one of Ark's biggest holdings. At the time of writing, it was actually the top holding in the Ark Innovation ETF (ARCA:ARKK) with a 9.06% weighting.\n\nThe crypto exchange is currently facing an SEC lawsuit claiming the company is an unregistered broker, but Wood isn't worried.\n\nThe SEC has been on the losing side of several similar cases and if Coinbase were to lose, she believes the company would appeal the ruling all the way to the Supreme Court, given its importance.\n\n\"We need real legislation if this truly is a new asset class, so that’s really what the question is here,\" Wood told WSJ.\n\n$BTC Price Action: Bitcoin is up approximately 119% year-to-date. It was last up 0.64% over a 24-hour period at $36,386 at the time of writing, per Benzinga Pro.\n\nRead Next: Cathie Wood Slams Portfolio Managers' Index-Based Investing As She Highlights Existential Threat Google, A Top Holding, Faces From LLMs\n\nWatch Cathie Wood’s recent interview on “The Raz Report” below.\n\nPhoto: Ark Invest and Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0xNS9zY2FyYW11Y2NpLXNheXMtYml0Y29pbi1ldGhlcmV1bS1wcmljZXMtdG8tdHJlbmQtaGlnaGVyLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "SkyBridge's Scaramucci Says Bitcoin, Ethereum Prices to Trend Higher - Bloomberg",
        "content": "00:00\n\n[CC may contain inaccuracies] I want to get your thoughts initially on what do you think the economic and investment environment will be like in the US over the next 12 months? Do you think the Fed's done hiking rates? I do think the Fed is done hiking. And good morning to you guys. I think that the the inflation data was very positive and it's likely to go lower over the next quarter. And so Rick Rieder, a personal friend of mine, actually gave a presentation in Park City at Governor Romney's conference about a month ago and explained the the churning down of inflation. And I think that's very, very good for stock prices, very good for assets. But, of course, what do people want for Christmas in America? They want a low interest rate mortgage. And if you look at housing data in the United States right now, those markets are quite sluggish. I think the Fed is going to respond to that. You'll probably see cuts in interest rates before the end of the first quarter. And so that's very positive for asset prices across the board. Okay. You mentioned last time Bloomberg spoke with you about, you know, you had a great October for your fund. I think it's the best month you've had in the history of SkyBridge. A lot of it was crypto, which I'll get to later. But what what's the other part of that? I mean, is there any parts of that of your portfolio that really kind of benefit from maybe either higher for longer or a less sort of tightening environment? I guess who else, unfortunately, versus the bets that hurt us last year? We we left on for this year. And so unfortunately in investing, sometimes you can get the timing wrong. But we made the case in the fourth quarter of last year in the early part of 2023, that the Fed would start cutting rates more quickly, that inflation would come down more quickly once the supply chain had reconnected. And you saw all of this induction of new technology like A.I., robotic technology, etc., bringing down prices. And so we got the timing wrong. But if you're a long term investor, if you were patient with us, you did quite well. And and last year at this time here at this all conference, as I mentioned during the commercial break, I think Bitcoin was about 16 or 17,000. We have a 10% position in Bitcoin in our portfolio and of course that's gone up to 35, 36,000 in the last year. And I think that went up contrary to institutional sentiment at the time. Over the last year people were quite negative. I was in Davos, Switzerland, being interviewed by some of your colleagues. January of this year, everyone had written off Bitcoin. Of course, it went up about 115% since then. So it's a combination of a couple of different factors, but it's mostly about being bullish about the return of the global economy and global growth. post-COVID. It just took longer than people expected, but we're there now. Yeah, from 6000 to 35. Now, you mentioned 10% weighting. How are you managing your exposure to crypto? What do you suspect the changes will be over the next couple of months? Anthony? Well, I mean, I think one of the things we're very proud of is we're we were the first outside capital into the BlackRock Bitcoin Trust. And so as you guys know, they filed for a formal application with the SCC, the deadline for that application at least for the Ark application, Cathie Wood's is January 10th. It appears likely that these things will get approved if that happens. I think there's an induction of a tremendous amount of demand for Bitcoin and of course you have a happening in Bitcoin, which basically means the supply is going to get cut in half in April. So having lower supply, more demand, we think prices are going to trend higher for Bitcoin, Etherium and a few other currencies. And for those reasons we're going to stay long in the portfolio. And you know what? Well, you know, it's a concentrated bet for us, but we like it. It's a macro overlay. And I guess you guys will remember the beginning part of the year with the Silicon Valley bank crises. Bitcoin was quite resilient and it seems to also do what you'd want an alternative investment to do is go contra into carry indicatori to the overall market. And I think it's safe to say you're still deep into crypto. And of course, obviously your name was mentioned during those SBF trials. Well, I want to get your take on the verdict now that we have one here as well. And overall the future of FDX 2.0. Would you invest in it? Would I invest in it? Well, depends on who's running it. I think number one, I think if you read Michael Lewis's book, there was a business there. He had 12 and a half percent of the cryptocurrency market. So I think the sloppiness and the indiscretion and the eventual fraud obviously ruined the the business and ruin the reputation of that business. But there is a good. Underlying business of you. Tell me who's managing it. I would be open minded to that. But since you're mentioning FDA, I think it's important to point out to people last year at this time at this conference, Sam Bankman-fried had just declared bankruptcy and he was about to be arrested. And so it's a full year later. He's already been convicted for the fraud. His sentencing comes it comes in March. I think it was fair. You know, I spoke at an event here for the Singapore Monetary Authority yesterday and explained that a good regulatory process is clear, transparent rules. But if there are bad actors, they've got to get convicted and have to pay the price for the crimes that they're committing. And I think we're seeing that in the United States. I think that sending a message of deterrence to people, but it's also sending a message of greater safety in these markets for investors. So there's a combination of positive things happening this year. And of course, if you interviewed me last year at this time, there was less than positive things happening. So, Anthony, just everyone was asking about 2.0. Just a quick update, please. If you could give us a timeline on 1.0. They still have a stake in you guys. Do you still plan on buying them, taking that stake back? You have a timetable for that? Yes. So unfortunately, we're waiting for the bag. We've created a data room for the bankruptcy estate to look at and to make a decision on when they'll give us the opportunity to buy back those assets. I still think that's likely a year or two away, and we're in no rush because, of course, there was no controlling stake and there's no voting interest or even economic preference in that stake. So we're running the business just like we've run it before with no interruption. But you're asking about tax. If that's going to go alive, it'll probably be the back half of 2024. My prediction is that they'll eventually sell those assets and that technology to somebody that will restart that exchange. And so we'll have to see what happens. But I think that's very likely. How much time. So I've got to ask you about, you know, we have a U.S. election that's coming up as well. Do you do you have any sort of projection here? Are we going to back this time? Give me of course, you had a short stint in the White House. I'm in the I'm in the ABC camp. You know, anybody but anybody but Trump. And so if it's Trump versus Biden, I will be actively advocating for President Biden. I have supported Governor Christie, and I'm hopeful that he can have a good showing in New Hampshire. If that doesn't happen and the president does get the nomination. President Trump, I think it's just too big of a threat to the American democracy. And if you listen to him very carefully, he wants to put up refugee camps. He wants the poor people from the country. It's very un-American. It'll be very disruptive for business continuity globally and in the U.S. So I'll be with President Biden if it's a Trump versus Biden case. But if it isn't, I'm a long term Republican, so we'll see."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMTUvYml0Y29pbnMtb3B0aW9ucy1tYXJrZXQtaGFzLW92ZXJ0YWtlbi1pdHMtZnV0dXJlcy1tYXJrZXQv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8xNS9iaXRjb2lucy1vcHRpb25zLW1hcmtldC1oYXMtb3ZlcnRha2VuLWl0cy1mdXR1cmVzLW1hcmtldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's Options Market Has Overtaken Its Futures Market in a Sign of Growing Sophistication - CoinDesk",
        "content": "Traditionally, options are used to mitigate risk, although some speculators use them like futures to amplify returns. Bulls typically buy puts to protect against a potential downside, while bears use call options to protect from a sudden upswing in prices. Efficient use of options is contingent on a thorough understanding of key metrics, the so-called Greeks – delta, gamma, theta and rho, that affect the price of an options contract."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZ2VybWFueXMtZm91cnRoLWxhcmdlc3QtYmFuay1jb21tZXJ6YmFuay1ncmFudGVkLWJpdGNvaW4tYW5kLWNyeXB0by1jdXN0b2R5LWxpY2Vuc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Germany's Fourth Largest Bank Commerzbank Granted Bitcoin And Crypto Custody License - Nasdaq",
        "content": "Commerzbank, Germany’s fourth-largest bank, announced its become the first among its peers to secure the Crypto Custody License under Article 1 Section 1a Sentence 1 No 6 German Banking Act (KWG).\n\nThe newly acquired license empowers Commerzbank to forge ahead in establishing a comprehensive range of digital asset services, with a specific emphasis on Bitcoin and crypto assets. The initial step involves the creation of a robust, secure, and fully compliant platform, designed to cater to institutional clients seeking secure custody solutions for their crypto assets.\n\n“Now that we have been granted the licence, we have achieved an important milestone,” said Dr. Jörg Oliveri del Castillo-Schulz, Chief Operating Officer of Commerzbank. “This highlights our ongoing commitment to applying the latest technologies and innovations, and it forms the foundation for supporting our customers in the areas of digital assets.”\n\nBy obtaining this license, the bank aims to build a secure environment that not only fosters trust but also serves as a catalyst for further advancements in the digital asset domain.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy80LWNyeXB0by1zdG9ja3MtZm9jdXMtYml0Y29pbi0xNDExMDAxNTcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "4 Crypto Stocks in Focus as Bitcoin Rallies Past $35,000 - Yahoo Finance",
        "content": "Cryptocurrencies rebounded in November after remaining rangebound over the past couple of months. Bitcoin (BTC) particularly staged a solid comeback as it neared $38,000 last week. On Nov 14, the cryptocurrency traded above $35,490.\n\nBitcoin has hit new yearly highs in each of the past three weeks and is on track to hit the $40,000 mark after having more than doubled by 119.9% year to date. Experts believe this could happen anytime in the last two months of the year.\n\nLast week, Bitcoin hit $37,900 as news that the Securities and Exchange Commission (SEC) is set to approve a Bitcoin exchange-traded fund (ETF) once again raised investors’ optimism.\n\nThe expected approval of a Bitcoin ETF by the SEC is likely to boost demand by providing traditional investors with a pathway to access Bitcoin and other cryptocurrencies through regular stock markets. Moreover, this development is expected to attract new investments into the crypto industry, potentially leading to increased overall demand.\n\nAlso, the Fed’s decision to keep interest rates unchanged in its current range of 5.25-5.5% has made market participants believe that the central bank may be done with its interest rate hikes.\n\nMarket participants now expect the Federal Reserve to start cutting interest rates next year. Higher interest rates often exert a negative influence on growth sectors like technology, consumer discretionary and cryptocurrency.\n\nThe decision by the Federal Reserve to pause rate hikes is viewed positively for the cryptocurrency space. The pause in rate increases is expected to mitigate potential adverse effects on cryptocurrencies, fostering a more favorable environment for their growth and performance.\n\nOur Choices\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nStory continues\n\nCoinbase Global’s expected earnings growth rate for the current year is 91.7%. The Zacks Consensus Estimate for current-year earnings has improved 45.6% over the last 60 days. Coinbase currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nInteractive Brokers Group, Inc. IBKR is a global automated electronic broker. IBKR executes, processes and trades in cryptocurrencies. IBKR’s commodities futures trading desk also offers customers a chance to trade cryptocurrency futures.\n\nInteractive Brokers Group has an expected earnings growth rate of 41.7% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 2.1% over the last seven days. IBKR currently has a Zacks Rank #2.\n\nPayPal Holdings, Inc. PYPL provides digital wallet services that enable users to purchase, transfer, and sell various cryptocurrencies, such as Bitcoin, Ethereum, Bitcoin Cash, and Litecoin. Through PYPL, users can use cryptocurrencies to pay for goods and services from online merchants. Additionally, PayPal’s mobile wallet platform, Venmo, also allows users to engage in cryptocurrency buying and selling activities.\n\nPayPal Holdings’ expected earnings growth rate for the current year is 20.3%. Shares of PYPL have gained 0.4% in the past 30 days. PayPal presently carries a Zacks Rank #3.\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 88% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 16.8% over the last 60 days. SQ currently carries a Zacks Rank #2.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nInteractive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report\n\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zdG9jay1tYXJrZXQtbmV3cy10b2RheS1kb3ctbGVhZHMtc3RvY2tzLWhpZ2hlci1hcy1vaWwtZmFsbHMtYml0Y29pbi1zb2Fycy0yMTA4MjU2MDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Stock market news today: Dow leads stocks higher as oil falls, bitcoin soars - Yahoo Finance",
        "content": "Wall Street stocks continued their rally on Wednesday with investors embracing the idea that abruptly cooling inflation will put interest rate hikes on ice.\n\nThe Dow Jones Industrial Average (^DJI) led gains, rising about 0.5%. The benchmark S&P 500 (^GSPC) rose about 0.2%, while the Nasdaq Composite (^IXIC) barely finished above the flat line. The Dow has now risen four straight days and is at its highest levels since Aug. 14.\n\nMeanwhile, cryptocurrencies also extended their recent rally. The world's largest cryptocurrency, bitcoin (BTC-USD), rose more than 6% to above $37,000 per coin.\n\nIn commodities, oil prices fell with West Texas Intermediate (CL=F) hitting $76.51 per barrel while Brent Crude (BZ=F) fell to just below $81 a barrel.\n\nThe jump in stocks was juiced by the surprise easing in US price pressures, which spurred bets the Federal Reserve will keep rates steady and could start cutting them early next year. Data out Wednesday reiterated this narrative as October wholesale prices saw the largest monthly decline in two and a half years.\n\nMeanwhile, October's retail sales report revealed the first monthly decline in sales since March, though the 0.1% drop still topped Wall Street's estimates.\n\nShares in Target (TGT) surged more than 16% after its third quarter earnings clobbered estimates. The big box retailer pointed to the resilience of the US consumer in the face of higher borrowing costs."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jYXRoaWUtd29vZC1pcy1zdGlsbC1hbGwtaW4tb24tYml0Y29pbi1tb3JuaW5nLWJyaWVmLTExMDAzMjQwOC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood is still all-in on bitcoin: Morning Brief - Yahoo Finance",
        "content": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:\n\nThe chart of the day\n\nWhat we're watching\n\nWhat we're reading\n\nEconomic data releases and earnings\n\nThe monster move downward in Treasury yields yesterday was a giant risk-on signal for markets.\n\nIncluded in that enthusiasm was the ETF that became synonymous with growthy, disruptive tech during the pandemic: Cathie Wood’s Ark Innovation ETF (ARKK). The ETF jumped 5.2% on Tuesday and is now up over 37% this year, clawing back at least some of a dismal 2021 and 2022 where the fund was one of the hiking Fed’s many victims.\n\nMany tech investors and leaders — including the likes of Elon Musk — have said rates need to stabilize or decline to unlock further gains. Wood seems to be in the same camp, as she told me in a conversation yesterday.\n\n“I don't think the Fed's going any further,” she said. “If the market can feel comfortable that that is indeed the case, we don't have to have rates even come down. We think they will. But we think that our strategy has discounted the worst.”\n\nMeanwhile, the maverick investor isn’t changing her strategy. She’s been remarkably steadfast in her bets and investing philosophy. Even as ARKK plunged 67% last year, she was traveling, speaking to clients and the press as usual. And her message was consistent, even when her returns weren’t: Disruptive innovation is a good investment in the long run.\n\nHas she been proven right? The jury’s still out. Wood says she focuses on a five-year investment horizon. ARKK’s five-year return is -2.5%. Since its inception about nine years ago, it has just about doubled, half the gain in the Nasdaq Composite. Her much smaller Ark Autonomous Tech and Robotics ETF rallied 162% over the same period. (Ark has a suite of eight in-house ETFs).\n\nWood’s steadfast bet on fintech and crypto, however, is very much on the table. She has been making the rounds in support of a suite of new actively managed digital asset ETFs introduced by Ark in partnership with 21Shares, a creator of crypto exchange-traded products sold overseas.\n\nStory continues\n\nWood told me that Ark first bought bitcoin at $250 and her firm’s base case is still $600,000 to $650,000. And she said the odds are improving that the Securities and Exchange Commission will approve Ark and others’ spot bitcoin ETF filings by a January deadline. That, she and other bitcoin bulls believe, could unlock more gains.\n\nThis isn’t just a bet on a crypto renaissance and a new product for Wood’s firm. It could also provide the juice the ARKK ETF needs to get out of its current trough, 71% down from its 2021 all-time high. The current largest holding in Wood’s flagship ETF? Coinbase.\n\nmorning brief image\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRyaXBsZS1kaWdpdHMtZXRmcy1mb2N1cy0xODAwMDAzMDYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Up Triple-Digits This Year: ETFs in Focus - Yahoo Finance",
        "content": "The cryptocurrency market has experienced a resurgence in November. In the past one month (as of Nov 10, 2023), bitcoin price has surged 37.4%. This notable price increase has renewed interest and excitement in the crypto space after a period of relative stagnation.\n\nMarket analysts and experts are optimistic about the crypto market's outlook for the remaining two months of the year. This renewed bullish sentiment follows a robust recovery during the first seven months of the year, which had helped erase the disappointment of the previous year. Bitcoin is up 124% so far this year.\n\nFactors Behind the Rally\n\nSeveral key factors have contributed to the renewed rally in the cryptocurrency market:\n\nPause in Interest Rate Hikes: The Fed's decision to maintain its benchmark interest rates between 5.25% and 5.5% in both its September and November Federal Open Market Committee (FOMC) meetings has had a significant impact on crypto rally. Despite inflation levels exceeding the Fed's 2% target, recent labor market data suggesting a slowing job market has raised the possibility that the Federal Reserve may halt its ongoing monetary tightening campaign. This has instilled confidence in investors, particularly those in the cryptocurrency space, as higher interest rates typically have a dampening effect on growth sectors like technology, consumer discretionary, and cryptocurrency.\n\nPositive Impact on Cryptocurrency: The cryptocurrency market's response to the Federal Reserve's decision has been positive. The pause in interest rate hikes has created a favorable environment for cryptocurrencies to flourish, as it removes a potential hurdle to their growth. The rally is not limited to Bitcoin alone. Other major cryptocurrencies, including Ethereum (ETH), Cardano (ADA), Dogecoin (DOGE), and Binance Coin (BNB), have all experienced a resurgence in value during the same period. This broad market recovery underscores the strength of the current crypto rally.\n\nStory continues\n\nExpectations of SEC Okaying a Bitcoin ETF\n\nAnother significant driver of investor optimism is the expectation that the U.S. Securities and Exchange Commission (SEC) is close to approving a Bitcoin exchange-traded fund (ETF). The approval of such an ETF would be a milestone for the cryptocurrency market, as it would provide traditional investors with a regulated and convenient avenue to invest in Bitcoin and other cryptocurrencies through regular stock markets. This development is expected to increase demand for cryptocurrencies and attract new investments, potentially fueling further market growth.\n\nContinued Growth Expected\n\nGiven the current momentum and positive developments, the cryptocurrency market is poised for continued growth. Bitcoin's impressive performance, with its price more than doubling year-to-date, indicates that the ongoing rally is likely to persist, generating increased interest and enthusiasm among investors.\n\nETFs to Gain\n\nAgainst this backdrop, below-mentioned ETFs should be in focus for stellar gains.\n\nValkyrie Bitcoin Strategy ETF BTF – Up 109.9% Past Year; Up 39.6% Past Month\n\nValkyrie Bitcoin Strategy ETF is an actively managed ETF available through Nasdaq. It invests in bitcoin futures contracts and does not provide direct exposure to the price of bitcoin. BTF charges 95 bps in annual fees.\n\nHashdex Bitcoin Futures ETF DEFI – Up 109.2% Past Year; Up 35.5% Past Month\n\nThe HDEFI - Hashdex U.S. Bitcoin Futures Fund Benchmark Index is average of the closing settlement prices for the first to expire and second to expire Bitcoin Futures Contracts listed on the CME. The fund charges 90 bps in fees.\n\nVanEck Bitcoin Strategy ETF XBTF – Up 106.8% Past Year; Up 35.6% Past Month\n\nThe Vaneck Bitcoin Strategy ETF seeks capital appreciation by investing in bitcoin futures contracts. The fund charges 66 bps in fees.\n\nSimplify Bitcoin Strategy PLUS Income ETF MAXI – Up 103.3% Past Year; Up 35.8% Past Month\n\nThe Simplify Bitcoin Strategy PLUS Income ETF (MAXI) seeks capital gains and income by providing investors with exposure to bitcoin while simultaneously generating income by selling short-dated put or call spreads on the most liquid global equity indices. The fund charges 97 bps in fees.\n\nProShares Bitcoin Strategy ETF BITO – Up 99.6% Past Year; Up 36.2% Past Month\n\nThe ProShares Bitcoin Strategy ETF is bitcoin-linked ETF offering investors an opportunity to gain exposure to bitcoin returns in a convenient, liquid and transparent way. The fund charges 95 bps in fees.\n\n(Disclaimer: This article has been written with the assistance of Generative AI. However, the author has reviewed, revised, supplemented, and rewritten parts of this content to ensure its originality and the precision of the incorporated information.)\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nProShares Bitcoin Strategy ETF (BITO): ETF Research Reports\n\nValkyrie Bitcoin and Ether Str (BTF): ETF Research Reports\n\nVanEck Bitcoin Strategy ETF (XBTF): ETF Research Reports\n\nHashdex Bitcoin Futures ETF (DEFI): ETF Research Reports\n\nSimplify Bitcoin Strategy PLUS Income ETF (MAXI): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zd2FuLWJpdGNvaW4tdGVybWluYXRlcy1jdXN0b21lci1hY2NvdW50cy1jcnlwdG8tbWl4aW5nLXNlcnZpY2Vz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Swan Bitcoin to terminate customer accounts that use crypto-mixing services - Cointelegraph",
        "content": "Bitcoin (BTC) services platform Swan Bitcoin warned its customers that it would be forced to terminate accounts found interacting with crypto-mixing due to the regulatory obligations of its partner banks.\n\nCustomers were informed about the policy in a letter suggesting the changes are due to the United States Financial Crimes Enforcement Network (FinCEN) proposed rule establishing new responsibilities on firms processing transactions from mixing services.\n\nOn Nov. 12, the co-founder of the firm, Yan Pritzker, took to X (formerly Twitter) to explain that although the firm is not against the use of privacy mixing tools and services, it has to adhere to the obligations of its partner banking institutions.\n\nPritzker said that the proposed FinCEN rule is poorly written and covers a huge amount of Bitcoin-related activities, such as using BTC addresses only once, mixing funds and prohibiting the use of any programmable transactions, such as on Lightning Network channels.\n\nHe added that mixing services are painted with a scary brush instead of what they are: a common way to break large amounts of Bitcoin into small ones with privacy in focus.\n\nFinancial regulators in the U.S. have portrayed crypto-mixing services as a route for illicit activities and have sought to curb the services. Regulators have sanctioned such activities and have also prosecuted and jailed the creators of Tornado Cash. Pritzker added:\n\n“In fact, we have written and published privacy guides that encourage mixing and promoted companies like Wasabi and Samourai. We believe that mixing is normal, privacy is not a crime, and that using unmixed Bitcoin is similar to bringing your whole paycheck to the grocery store to pay for an apple.“\n\nPritzker stated that the current political climate has put a lot of fear into the banking sector, with most banks simply refusing to do business with anything in crypto. Thus, for them to continue their Bitcoin on-ramp services, their custody partner has to interact with banking services governed by FinCEN regulations.\n\nIn its letter to customers, Swan Bitcoin also suggested ways such policies can be opposed and said educating the masses on Bitcoin is the first step toward that.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL2JpdGNvaW4tc3Bpa2luZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "We Regret to Inform You That Bitcoin Is Spiking - Futurism",
        "content": "Buckle up.\n\nBitcoin Boomlet\n\nCrypto bros rejoice. Bitcoin has increased in value to nearly $38,000 as of Wednesday, its highest valuation in a year — though, for those keeping score, nowhere near its halcyon days of November 2021 when it crested over $65,000 — and one that notches startling gains of more than 38 percent over the past month.\n\nThe recent price increase is likely due to some combination of softening federal interest rates, a general sense that Sam Bankman-Fried's conviction over his misdeeds at FTX serves as a reset for the beleaguered industry, and the Securities and Exchange Commission approving a bitcoin exchange-traded fund (ETF).\n\nAsset management firm BlackRock had filed for a bitcoin ETF back in June, and then took the first steps towards an ETF for rival cryptocurrency ether earlier this month, which has sparked optimism in the cryptocurrency world after months of low prices.\n\nAn ETF is basically a package of securities that track an index or commodity. In the case of the bitcoin ETF, investors would not own the bitcoin directly but the ETF would be pegged to its value. But most importantly, a bitcoin ETF recognized by the SEC would mark a milestone because it signals institutional approval.\n\nBitcoin Bust\n\nBut facts remain that bitcoin and other cryptocurrencies are incredibly volatile assets, and mining them is still harmful to the environment, despite some efforts to make the process more green.\n\nIt remains to be seen whether bitcoin will ever reach the heights it once had back in 2021, when people were flush with stimulus money, bored from the grinding impact of the pandemic, and bombarded by bitcoin mania in the form of Super Bowl advertisements.\n\nAnd while some are excited about a bitcoin resurgence, the crypto is an utter failure in terms of its intended use as a decentralized form of digital money. It still largely remains a speculative asset among normal investors, transaction fees remain high, and it's a channel for illegal activities. So think twice before entrusting it with your hard-earned retirement assets.\n\nMore on bitcoin: Guy Who Stole Billions in Bitcoin Lived a Sad Life"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvY3J5cHRvY3VycmVuY2llcy1iaXRjb2luLTM3MDAwLWZpcnN0LXRpbWUtbWF5LTIwMjIv0gFgaHR0cHM6Ly93d3cuZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9jcnlwdG9jdXJyZW5jaWVzLWJpdGNvaW4tMzcwMDAtZmlyc3QtdGltZS1tYXktMjAyMi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrencies: Bitcoin Hits $37,000 for First Time Since May 2022 - ETF Trends",
        "content": "This weekly update tracks some of the largest cryptocurrencies by market share: bitcoin and ether. We’ve also included XRP, as it was one of the largest cryptocurrencies when this series began. According to Wikipedia, a cryptocurrency is “a digital asset designed to work as a medium of exchange that uses cryptography to secure its transactions, to control the creation of additional units, and to verify the transfer of assets.” Cryptocurrency is a young asset class that has developed a reputation for price volatility however there are ETFs that could help mitigate risk for those investors seeking crypto exposure.\n\nBitcoin was the world’s first cryptocurrency and decentralized digital currency. The first bitcoin transaction occurred in early 2009 and has since grown worldwide. Ether is another cryptocurrency run on the Ethereum blockchain platform and has the second largest market share, despite being the newest of the three with its launch in July 2015. XRP, which is owned by Ripple and launched in 2012, was one of the larger cryptocurrencies for some time until new coins joined the market. We’ve included it here for reference.\n\nThe third-largest market share of cryptocurrency, tether, is a token “backed by actual assets” which includes one US dollar, one euro, or loans to affiliate companies and is controlled by the owners of Bitfinex. It’s a controversial cryptocurrency due to its alleged manipulation of crypto pricing. It is called a “stable coin” because it was designed to always be worth $1.00. We do not chart it because its price rarely changes.\n\nFor a better understanding of crypto market cycles, read more here.\n\nThe Latest Crypto Data (through November 14, 2023)\n\nBitcoin’s price hit $37,000 this past week for the first time since May 2022. BTC is now up ~120% year to date. Some crypto market observers believe this year’s rally is the start of something even greater and that Bitcoin could continue this momentum over the next few years.\n\nFind out more about what’s going on in the Bitcoin Ecosystem.\n\nXRP’s price fell slightly this week and is now up ~90% year to date.\n\nEther posted its highest close in over seven months during the past week, finishing just above $2,100. ETH is now up ~71% year to date.\n\nAn index has been created in order to chart these three cryptocurrencies together, considering their significantly different pricing histories. Ether tops the chart, i.e., the price of an ether has changed the most out of all three cryptocurrencies.\n\nETFs associated with cryptocurrencies include: ProShares Bitcoin Strategy ETF (BITO), ProShares Short Bitcoin Strategy ETF (BITI), VanEck Ethereum Strategy ETF (EFUT), and Bitwise Ethereum Strategy ETF (AETH).\n\nWhat’s next in the crypto ETF market? Find out here.\n\nOriginally published on Advisor Perspectives.\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdS5zLi1wcmVzaWRlbnRpYWwtY2FuZGlkYXRlLXZpdmVrLXJhbWFzd2FteSUzQS10aGUtZ292ZXJubWVudC1pcy10aHJlYXRlbmVkLWJ5LWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "U.S. Presidential Candidate Vivek Ramaswamy: 'The Government Is Threatened By Bitcoin' - Nasdaq",
        "content": "In a recent interview on the Coin Stories podcast hosted by Natalie Brunell, U.S. Presidential candidate Vivek Ramaswamy discussed his views on Bitcoin, why the government should leave Bitcoin alone, and the BlackRock spot Bitcoin ETF.\n\nThe presidential candidate said Bitcoin \"is an opt out from the broken financial architecture created by by the U.S. Federal Reserve system. And I say this as someone who wants to fight for the dollar to remain the reserve currency of the world.\"\n\nDuring the interview, Ramaswamy asserted that the government perceives Bitcoin as a potential threat to its control over monetary policy. \"Part of it is that they're threatened by the existence of Bitcoin. They don't want people mining for more bitcoin, because that could make bitcoin more popular. Which in turn, creates a threat to the incumbent status of the U.S. Federal Reserve itself,\" he stated.\n\nHe argued that the decentralized nature of Bitcoin challenges the traditional power dynamics of centralized financial systems, causing unease among government institutions. The presidential candidate says he will \"by far be the most Bitcoin or crypto or any other decentralized finance president we've ever had,\" because he thinks \"it is good to decentralize power away from the federal government.\"\n\nHe also addressed the concerns around the BlackRock spot Bitcoin ETF, stating that BlackRock is \"a tentacle of the government.\" He says the money they manage comes from government actors pushing them to adopt agendas, and that it is a \"farce\" to think BlackRock is applying for this ETF in a free market way. Ramaswamy said this is \"the government trying to masquerade as Bitcoin friendly, but in fact it's just a captured system.\"\n\nAs the 2024 presidential race looms closer, Ramaswamy's stance on emerging financial technologies like Bitcoin could become an even bigger focal point of his campaign. Earlier this year, Ramaswamy announced at Bitcoin 2023 in Miami that he had begun accepting campaign donations in Bitcoin over the Lightning Network, making him one of the first U.S. presidential candidates to ever do so.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE1L3doaWNoLWJpdGNvaW4tbWluaW5nLXN0b2NrLWlzLWEtYmV0dGVyLWJ1eS1yaW90LW9yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Which Bitcoin Mining Stock Is a Better Buy: Riot or Marathon? - The Motley Fool",
        "content": "Although the Bitcoin (BTC -3.27%) mining industry continues to grow, two companies currently lead the way: Riot Platforms (RIOT -9.12%) and Marathon Digital (MARA -10.23%). As the most valuable companies by market cap, Riot and Marathon have ascended to the top by means of differing strategies. While both have built a track record of success, which one is worthy of a spot in your portfolio?\n\nTo gain a better understanding of what separates one from the other, we need to take a comprehensive look at recent financial statements, long-term strategy, and competitive advantages unique to each company. In doing so, it will become clear which company is the true leader of the Bitcoin mining industry.\n\nMarathon continues at a record pace\n\nMarathon is a clear leader in terms of hash rate, a metric that quantifies a company's computational power to mine Bitcoin. Based on third-quarter earnings, Marathon's installed hash rate hit a new all-time high of 23.1 exahashes per second (EH/s), good enough to produce nearly 3,500 Bitcoins. Should equipment installments and expansion plans be fulfilled in the coming months, Marathon expects to hit a hash rate of 26 EH/s by the end of the year and increase its mining capabilities by 30% in 2024.\n\nWith a soaring hash rate placing it at the top of the industry, Marathon had an impressive Q3 as it raked in $97.85 million in revenue. Add in the fact that expenses declined significantly, and Marathon turned a profit to the tune of $64 million. That's a refreshing improvement, considering that last quarter, the company posted a net loss of more than $19 million.\n\nLikely the most beneficial development to occur for Marathon was its restructuring of long-term debt. With debt totaling more than $780 million before Q3, Marathon completed a note exchange in September that reduced long-term debt by 56% and captured a total savings of approximately $101 million in cash. For the first time since 2021, Marathon's cash and Bitcoin holdings exceeded debt at the quarter's end.\n\nRiot's misleading setback\n\nNotching its own all-time high hash rate just shy of 11 EH/s, Riot produced 1,106 Bitcoins over the past three months. Yet, while hash rate increased, Riot's total production took a serious hit. Last quarter, Riot produced 1,775 Bitcoins. But as a result of it mining 600 fewer Bitcoins in Q3, total revenue fell nearly one-third, causing the company to post a net loss of more than $45 million.\n\nThere are likely a handful of reasons why production declined even though hash rate increased. The most plausible is related to Riot's power strategy, where it turns miners off when the cost of electricity exceeds mining profitability, a luxury it can afford thanks to its location in Texas. When this situation occurs, as it often does during peak summer months, Riot sells electricity back to the grid and receives power curtailment credits. In Q3, Riot obtained nearly $50 million in credits, but due to accounting practices, power curtailment credits are not included in revenue.\n\nThe tale of the tape\n\nWhile hash rate and total production are commonly used metrics in comparing Bitcoin mining companies, there is much more to consider. If we were to only use production, Marathon would be a clear winner.\n\nHowever, while Marathon is nearly twice as productive as Riot, its exorbitant debt could hinder profits. While the recent debt restructuring was badly needed and a step in the right direction, there is still a hefty chunk left over. And when compared to Riot, which has virtually zero long-term debt, Marathon's liabilities become magnified.\n\nRiot's absence of debt is what makes it particularly suited to thrive in the volatile Bitcoin mining industry. Not to mention, the company has plans to expand its hash rate to more than 20 EH/s by next year as it builds its Corsicana Facility, a project fully funded independent of external financing.\n\nThe cherry on top is Riot's unique power strategy that has led to some of the lowest costs in the industry. As it currently stands, the average cost it takes for Riot to mine one Bitcoin is just $14,400. For Marathon, this number sits closer to $24,000.\n\nAt first glance, Riot's Q3 was extremely dismal compared to Marathon's. However, only comparing hash rate and revenue doesn't paint the full picture. Even though this quarter was less than ideal for Riot, the company is in a much stronger financial position and will continue to benefit from its expansion plans and unique energy strategy.\n\nWhile Marathon's production is at the top of the industry, Riot is a more well-rounded company that will help it succeed in the long haul. And that is why Riot Platforms may be a better fit for your portfolio than Marathon Digital."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1vcmUtNS1uZWFyLW9uZS0yMDA5MDQ1ODkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin up more than 5% near one-week high - Yahoo Finance",
        "content": "FILE PHOTO: A bitcoin is seen in an illustration picture taken at La Maison du Bitcoin in Paris\n\n(Reuters) - Bitcoin, the world's largest cryptocurrency, rose more than 5.3% on Wednesday to $37,978, near a one-week high. It has risen about 125% so far this year.\n\nWhile bitcoin remains far from the investment fever pitch it hit in late 2021, the crypto sector has enjoyed a rally in recent weeks as the expected end of central bank rate-hiking cycles draws cash back into high-risk assets.\n\n(Reporting by Hannah Lang in Washington; Editing by Chris Reese)"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTM3ay1yZXNpc3RhbmNlLWZhaWxlZC10by1icmVha9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "3 reasons why Bitcoin price failed to break $37K - Cointelegraph",
        "content": "Bitcoin (BTC) recently surged above $37,000 between Nov. 10 and 12, only to falter and undergo a correction toward $35,000 on Nov. 13.\n\nThis abrupt movement triggered the liquidation of $121 million worth of long futures contracts, and while Bitcoin’s price stabilized around $35,800 on Nov. 14, investors are left pondering the underlying factors behind this downturn.\n\nBitcoin 12-hour price index, USD. Source: TradingView\n\nU.S. inflation, gov’t shutdown impact on BTC price\n\nPart of the catalyst behind this movement was the unexpected softening of United States inflation data on Nov. 14. The U.S. Consumer Price Index (CPI) showed a 3.2% increase in October compared to 2022, leading to a decline in yields on U.S. short-term Treasurys.\n\nThis triggered buying activity in traditional assets, potentially reducing the demand for alternative hedge instruments like Bitcoin. If the Federal Reserve’s strategy to curb inflation successfully without causing a recession pans out, Bitcoin may lose some of its appeal as a hedge.\n\nEven Moody’s rating agency lowering its outlook on the U.S. credit to negative from stable on Nov. 11 did not sway favorably toward Bitcoin and other alternative hedges. Instead, investors sought refuge in short-term 5.25% fixed-income instruments, explaining why gold struggled to surpass $2,000 despite escalating debt levels and global economic challenges.\n\nIn China, October’s retail sales data indicated a 7.6% increase — the fastest since May. However, this apparent recovery conceals underlying issues, notably a 9.3% decline in property sector investments in the first 10 months of the year. China’s economic stimulus measures, including policy support and liquidity injections, have yielded only modest benefits.\n\nGiven that China is the world’s second-largest economy, its economic situation might contribute to investors’ cautious stance on riskier assets like Bitcoin, particularly when viewed within the broader global economic context. Additionally, recent political developments surrounding U.S. government shutdown threats could also influence Bitcoin’s performance.\n\nThe U.S. House of Representatives passed a bill on Nov. 14 to keep the government operational through the holiday season, temporarily averting a fiscal crisis. However, this measure sets the stage for potential spending disputes in the coming year, including a provision to cut federal spending by 1% across the board in 2024 if no agreement is reached.\n\nSpot Bitcoin ETF expectations, regulatory scrutiny\n\nThe cryptocurrency market experienced a negative reaction to a fraudulent BlackRock XRP trust filing on Nov. 13. Although it initially sparked hopes for an XRP (XRP) spot exchange-traded fund (ETF) in the U.S., the $9 trillion asset manager swiftly dismissed the claim.\n\nWhile this event is not directly linked to Bitcoin, it has drawn regulatory scrutiny to the crypto sector at a sensitive time when numerous spot Bitcoin ETF applications await review by the U.S. Securities and Exchange Commission (SEC). Consequently, irrespective of the parties involved, the outcome represents a net positive for the cryptocurrency market.\n\nRelated: Tether credits USDT growth surge to ETF excitement, emerging markets\n\nOn Nov. 13, Bloomberg ETF analyst James Seyffart emphasized that approval for a spot Bitcoin ETF should not be expected before January. This statement came amid heightened market anticipation surrounding upcoming SEC decisions scheduled for Nov. 17 and Nov. 21.\n\nHeightened fear of global economic recession\n\nIn essence, the drop in Bitcoin’s price after flirting with the $37,000 level cannot be attributed to a single event. Investors may have reassessed their positions, considering Bitcoin’s substantial $725 billion market capitalization. For comparison, Berkshire Hathaway, a major conglomerate, boasts a $760 billion valuation while posting profits of $76.7 billion in the past year.\n\nBitcoin’s stringent monetary policy ensures scarcity and predictability, but major global corporations can repurchase their own stocks using earnings, effectively reducing the available supply. Furthermore, during economic downturns, these trillion-dollar companies can leverage their strong balance sheets during economic downturns to acquire competitors or expand their market dominance.\n\nUltimately, Bitcoin’s challenge in maintaining momentum above $37,000 is influenced by factors such as data supporting the Federal Reserve’s strategy for a soft economic landing and concerns over global economic growth. These elements continue to create an unfavorable landscape for Bitcoin’s value, especially if the SEC delays decisions on spot BTC ETFs, aligning with market expectations.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJvdW5jZXMtY3BpLWluZmxhdGlvbi1zbG93cy1iZXlvbmQtZm9yZWNhc3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin bounces at $36.2K lows as CPI inflation slows beyond forecasts - Cointelegraph",
        "content": "Bitcoin (BTC) targeted $37,000 at the Nov. 14 Wall Street open as the latest United States inflation data undercut expectations.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nCPI offers Bitcoin, stocks a pleasant surprise\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price strength returning as the Consumer Price Index (CPI) reflected slowing inflation in October.\n\nCPI came in 0.1% below market forecasts both year-on-year and month-on-month. The annual change was 3.2% versus 4.0% for core CPI.\n\n“The all items index rose 3.2 percent for the 12 months ending October, a smaller increase than the 3.7-percent increase for the 12 months ending September,” an official press release from the U.S. Bureau of Labor Statistics confirmed.\n\n“The all items less food and energy index rose 4.0 percent over the last 12 months, its smallest 12-month change since the period ending in September 2021.”\n\nU.S. CPI data. Source: U.S. Bureau of Labor Statistics\n\nCompared with October, where CPI was just one inflation metric, which overshot versus market consensus, the situation was palpably different. Stocks immediately offered a warm reaction at the Wall Street open, with the S&P 500 up 1.5% on the day.\n\n“This is the 31st consecutive month with inflation above 3%. But, inflation seems to be back on the DECLINE,” financial commentary resource The Kobeissi Letter wrote in part of a reaction.\n\nKobeissi, traditionally skeptical of Fed policy in the current inflationary environment, nonetheless called the print a good result.\n\nIn line with other recent CPI releases, meanwhile, Bitcoin reacted only modestly, revisiting an intraday low before rising toward $37,000 while still rangebound.\n\nAnalyzing market composition, however, on-chain monitoring resource Material Indicators noted that liquidity was overall thin — a key ingredient for aiding volatility.\n\nWith whales quiet on exchanges, it added, retail investors were increasing BTC exposure.\n\n“It’s no coincidence that the 2 smallest order classes are buying,” it commented alongside a print of BTC/USDT order book liquidity on the largest global exchange, Binance.\n\n“Upside liquidity around the active trading zone is so thin, whales can’t make large orders without major slippage. Watching the smaller order classes on the FireCharts CVD bid BTC up as support strengthens above $36k.”\n\nBTC/USDT order book data from Binance. Source: Material Indicators/X\n\nAnalyst: Accept BTC price retracements\n\nDown around 4% from the 18-month highs seen earlier in the month, BTC price action still impressed market participants, who argued that comedowns within the broader uptrend were not only standard but appropriate.\n\nRelated: Bitcoin institutional inflows top $1B in 2023 amid BTC supply squeeze\n\n“Bitcoin already down 4.5% from the highs; bull market corrections are normal and healthy,” James Van Straten, research and data analyst at crypto insights firm CryptoSlate, told X (formerly Twitter) subscribers on the day.\n\n“Could see up to 20% drawdowns, from profit-taking or liquidations. This is a normal occurrence and has been seen in previous cycles.”\n\nVan Straten precised CryptoSlate analysis from Nov. 13, which suggested that deeper BTC price corrections could still come, given BTC/USD was up 120% year-to-date.\n\n“It is important to note that market corrections are a normal part of any financial cycle, contributing to the overall health of the market,” he stressed.\n\nIn an interview with Cointelegraph, Filbfilb, co-founder of trading suite DecenTrader, likewise predicted that Bitcoin could see a significant drawdown before the April 2024 block subsidy halving event.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tY29tcGFuaWVzLWV4Y2l0ZWQtYml0Y29pbnMtaGFsdmluZy1leHBlY3Qtc29tZS1mYWls0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Expect some crypto companies to fail in the wake of Bitcoin's halving - Cointelegraph",
        "content": "As we approach Bitcoin's (BTC) halving in April, a phenomenon that historically triggers significant market shifts, companies within the space are at a critical juncture. This event is surrounded by speculation and strategic planning, and for some, a sense of uncertainty. While it's laden with opportunities, it's vital for businesses to adopt a balanced approach, integrating a long-term perspective rather than catering to market euphoria.\n\nHistorically, Bitcoin halving events — which reduce mining rewards by half — have triggered substantial changes in the crypto landscape. These changes often lead to increased market activity and heightened investor interest. However, basing an entire business strategy on the outcomes of the halving can be a double-edged sword. Focusing solely on short-term gains could lead to missed opportunities or strategic errors that endanger a company's future viability.\n\nThe recent layoffs by layer-2 blockchain Avalanche underscore the volatility and unpredictability inherent to the crypto sector. Such developments highlight the necessity of robust risk management strategies. Companies must be prepared for any eventuality, ensuring their survival beyond the halving event. This calls for a focus on sustainable growth, solid financial planning and a reluctance to overextend in pursuit of fleeting opportunities.\n\nRelated: History tells us we’re in for a strong bull market with a hard landing\n\nIn light of this, crypto companies are increasingly channeling their efforts into product development and halting marketing efforts. The goal is to diversify offerings and cater to an evolving customer base, which is expected to expand post-halving. This strategy is not only about capitalizing on the immediate upsurge in halving-related interest but also about building a foundation that can withstand market fluctuations.\n\nA possible consequence for some companies? Products will be rushed to release — without adequate cybersecurity preparations. The crypto industry, by its very nature, is a prime target for cyberattacks. History has repeatedly shown what happens to projects that fail to learn from our long list of predecessors who have fallen to hackers.\n\nThe 4th Bitcoin halving will happen in 2024.\n\n\n\nThe 1st halving in 2012 resulted in a 10,000% increase ($11 -> $1,150)\n\n\n\nThe 2nd halving in 2016 resulted in a 3,000% increase ($650 -> $20,000)\n\n\n\nThe 3rd halving in 2020 results in a 630% increase ($8,800 -> $64,000)\n\n\n\nNotice a pattern? pic.twitter.com/zaqkEJUWmC — legen (@legen_eth) November 13, 2023\n\nMoreover, the current landscape of venture capital in the crypto sector presents a complex picture. The AI hype and the recent crypto winter led to a drying up of funds. However, there's a renewed interest as investors look to capitalize on the halving event. This resurgence of investment must be navigated with caution. Expansion and investment should be backed by a solid financial plan, especially in a market known for its volatility.\n\nAnother aspect to consider is the marketing and public perception surrounding the halving. While it's important to generate awareness and excitement, overhyping the event can backfire. Setting realistic expectations is key to maintaining credibility and trust with the user base. The industry has seen its fair share of backlashes due to unmet, overambitious projections.\n\nAnother crucial and often overlooked aspect that crypto companies should consider: the rapidly changing regulatory landscape. Crypto is increasingly coming under the scrutiny of global regulators, particularly in Europe, where discussions about comprehensive crypto regulation are intensifying.\n\nThe shift toward stricter regulatory oversight is indicative of a global trend where governments are seeking to balance innovation in the crypto space with investor protection and financial stability. This change isn't just a matter of compliance. It represents a fundamental shift in how crypto businesses must operate. Companies need to stay abreast of these developments as new regulations could be implemented before the halving in April. Companies that focus on the halving without regard for impending legislative changes may suffer quick consequences.\n\nRelated: WSJ debacle fueled US lawmakers’ ill-informed crusade against crypto\n\nInnovation in compliance can be a competitive advantage. As regulations become more complex and expansive, crypto companies that proactively integrate compliance into their business models and technology infrastructures will likely find themselves ahead of the curve. This involves investing in compliance and regulatory technology, which can provide efficiencies and help navigate the intricacies of varying jurisdictional requirements. For crypto companies, the challenge is to innovate while adhering to these new rules, turning regulatory adherence into a strategic asset rather than a burden.\n\nBitcoin’s halving and the intensifying regulatory climate herald a pivotal moment for the crypto industry. This dual challenge will inevitably lead to a significant shake-up, where only the most adaptable and forward-thinking companies will survive. Those who take a merely reacting approach risk falling behind or failing altogether.\n\nSuccess in this new era demands being proactive — integrating innovative strategies that align with regulatory frameworks and harness the halving's potential. The companies that emerge stronger will be those that view these challenges not as obstacles but as opportunities to redefine and solidify their position in a rapidly maturing market. This shift from mere survival to strategic evolution is what will distinguish the leaders in the post-halving, regulated crypto landscape.\n\nDaniele Servadei is the 20-year-old founder and CEO of Sellix, an Italian e-commerce platform that has processed more than $75 million in transactions for more than 2.3 million customers worldwide. He's attending the University of Parma for a degree in computer science.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zb2xhbmEtc29sLWF2YWxhbmNoZS1hdmF4LWFuZC1keWR4LXByb2R1Y2UtZG91YmxlLWRpZ2l0LWdhaW5zLWFzLWJpdGNvaW4tcmVjbGFpbXMtMzdr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana (SOL), Avalanche (AVAX) and dYdX produce double-digit gains as Bitcoin reclaims $37K - Cointelegraph",
        "content": "On Nov. 15, several altcoins continued to show strength alongside Bitcoin (BTC), which notched an intra-day high at $37,400. Leading into the week, DYDX, Solana’s SOL (SOL) and Avalanche’s AVAX (AVAX) currently reflect double-digit gains, with each chasing after new year-to-date highs.\n\nThe sustained bullish price action from altcoins has led some analysts to declare the arrival of an altcoin season, and at the time of writing, the total market capitalization of the altcoin market has hit a 2023 high at $659.5 billion.\n\nAltcoin price rallies typically involve a slew of factors, some being sentiment-based and others based on project fundamentals. Let’s look at a few of this week’s top market performers to see what catalysts underlie their growth.\n\ndYdX fee switch boosts price\n\nThe platform behind the DYDX token is dYdX, a decentralized exchange that offers futures contracts on Ethereum Virtual Machine blockchain tokens like Ether (ETH). On Oct. 27, dYdX launched its layer-1 blockchain with the creation of its genesis block, which operates using native DYDX tokens. The launch allowed for the on-chain distribution of all fees received to validators and stakers. The protocol update has been fantastic for DYDX’s price, sending it up over 110% in the past 30 days.\n\nDYDX price. Source: TokenTerminal\n\nRelated: Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers\n\nIn addition to token price appreciation, the dYdX platform is posting substantial user numbers, including increased fees and revenues. Both metrics have witnessed 77.5% increases to $8.67 million in 30 days. Annualized, this could mean $105.5 million in fees for validators and stakers.\n\nDYDX fees and revenue. Source: TokenTerminal\n\nSOL price hits another 2023 high\n\nSolana’s SOL token has had an impressive 30-day return profile, gaining over 166%. Despite reaching a 2023 high on Nov. 10, Solana’s price is still over 4x below its all-time high of $259.96.\n\nSolana price. Source: TokenTerminal\n\nSolana’s price growth has been powered by an uptick in users, which is led by the top-performing decentralized application on the blockchain, Jito, a liquidity staking platform. Solana’s daily active users also hit a 2023 high on Nov. 10, reaching 200,000. Coinciding with the increase in users, Solana’s revenue has eclipsed $1 million in 30 days, recording a 78.2% increase.\n\nSolana daily active users and revenue. Source: TokenTerminal\n\nAvalanche’s AVAX token picks up steam\n\nAvalanche is a layer-1 blockchain similar to Solana, where validators process transactions and receive tokens. Compared with Solana and dYdX, Avalanche brings in less revenue, but that hasn’t stopped its token from going on a double-digit run this week.\n\ndYdX, Solana and Avalanche fees. Source: TokenTerminal\n\nDespite being relatively smaller, AVAX has been performing well. In the past seven days, AVAX reached above 59% in gains, and it hit an impressive 118% growth in 30 days. AVAX’s price is still more than 7x below its all-time high.\n\nRelated: Is it altseason? Altcoin 30-day performance and total market cap flash bullish\n\nAVAX price. Source: TokenTerminal\n\nWhile these three altcoins are performing well, Bitcoin continues to dominate the overall market, with its dominance rate hovering above 50% since Oct. 16. When Bitcoin dominance decreases, those funds typically flow into altcoins, which is generally the start of an altseason.\n\nBitcoin dominance. Source: Coinglass\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtMS13ZWVrLWxvd3MtYml0Y29pbi13aGFsZXMtc2VsbC0zNWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "BTC price bounces at 1-week lows as Bitcoin whales sell into $35K - Cointelegraph",
        "content": "Bitcoin (BTC) tested $35,000 support into the Nov. 14 daily close as sell-side pressure sparked multiday lows.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price sheds $1,000 in an hour\n\nData from Cointelegraph Markets Pro and TradingView tracked a swift retreat for BTC price action, which fell over $1,000 in a single hourly candle.\n\nThe largest cryptocurrency found support at the $35,000 mark, forming a springboard to recover to around $35,600 at publication.\n\nThe volatility came hours after what at first looked like a positive news event for Bitcoin and crypto, with United States inflation slowing beyond expectations.\n\nAt the same time, however, analysts noted that beyond smaller retail investors, there was little appetite for buying BTC at prior levels around 18-month highs.\n\n$BTC\n\nonce again spot buying on long liquidations & deleveraging\n\n\n\noverall though still want to see more of a spot premium\n\n\n\nspot premium & spot driven uptrend is what you want to see pic.twitter.com/VoXrWQDGMc — Skew Δ (@52kskew) November 14, 2023\n\n“On November 3, Bitcoin whales started booking profits as the $BTC price rose from $35,000 to nearly $38,000,” one such take from popular social media commentator Ali noted.\n\n“More than 15 wallets with over 1,000 BTC sold or redistributed their holdings.”\n\nAn accompanying chart from on-chain analytics firm Glassnode showed that the cohort of whale wallets is now at its lowest number in around one month.\n\nBitcoin wallets with a balance of 1,000 BTC or more. Source: Glassnode\n\nUploading prints of the Binance BTC/USDT order book to X (formerly Twitter) following the inflation data, meanwhile, monitoring resource Material Indicators reiterated the need to expect periods of downside within a broader Bitcoin uptrend.\n\n“Market seemed to like the Core Inflation Report, but don’t let that fool you into thinking ‘up only’ will be sustainable,” part of the previous commentary read.\n\n“There are no straight lines. The market is testing your patience and conviction.”\n\nA subsequent post showed bid support moving closer to spot price — from $33,000 to $34,500 — while whales sold off.\n\n#FireCharts shows all order classes selling #BTC as price breaks below the $35.5k range.\n\n\n\nMeanwhile ~$9M in #BTC bid liquidity has just moved up from $33k to $34.5k. pic.twitter.com/DIfayNHYC7 — Material Indicators (@MI_Algos) November 14, 2023\n\nLong liquidations hit highest in months\n\nTraders themselves appeared to be caught unaware by the BTC price reversal.\n\nRelated: $48K is now ‘reasonable’ BTC price target — DecenTrader’s Filbfilb\n\nData from on-chain monitoring resource CoinGlass showed the highest volume of daily long BTC liquidations in several months.\n\nThese totaled $120 million for Nov. 14, roughly equal to the short BTC liquidations, which accompanied Bitcoin’s spike to $38,000 last week.\n\nCross-crypto longs were liquidated to the tune of nearly $300 million.\n\nCrypto liquidations chart (screenshot). Source: CoinGlass\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTEvMTQvY2F0aGllLXdvb2Qtc3BlY3VsYXRlcy1nYXJ5LWdlbnNsZXJzLXBvbGl0aWNhbC1hbWJpdGlvbnMtYXJlLWFmZmVjdGluZy1zcG90LWJ0Yy1ldGYtanVkZ2VtZW50L9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTEvMTQvY2F0aGllLXdvb2Qtc3BlY3VsYXRlcy1nYXJ5LWdlbnNsZXJzLXBvbGl0aWNhbC1hbWJpdGlvbnMtYXJlLWFmZmVjdGluZy1zcG90LWJ0Yy1ldGYtanVkZ2VtZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood Speculates Gary Gensler's Political Ambitions Are Affecting Spot BTC ETF Judgement - CoinDesk",
        "content": "Irregardless, Wood continues to be a major bull on crypto, predicting that a spot ETF would eventually be approved and that this would be among the catalysts for taking the cryptocurrency market cap from the current $1 trillion to a $25 trillion opportunity by 2030."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzExLzE1L2NhdGhpZS13b29kLXNheXMtdGhlLWdyYXlzY2FsZS1iaXRjb2luLXRydXN0LXdpbGwtbG9zZS10aGlzLWVkZ2Utd2hlbi1hLWJpdGNvaW4tZXRmLWlzLWFwcHJvdmVkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood says the Grayscale Bitcoin Trust will lose this edge when a bitcoin ETF is approved - CNBC",
        "content": "Competition is set to heat up for the popular Grayscale Bitcoin Trust once the Securities and Exchange Commission approves a spot bitcoin ETF in the U.S. The trust, known better by its ticker GBTC , may be the easiest way for institutions to get exposure to crypto today, but that's likely to change in a big way once at ETF is approved, ARK Invest CEO Cathie Wood told CNBC Pro. \"We had to own a security, so the only way we could [buy into bitcoin] … was through GBTC and that became the most liquid way to gain exposure,\" she said on the latest PRO Talks on Tuesday. \"We think that's going to change completely. There are going to be lot more liquid ways to gain exposure when we see some of these approvals.\" ARK in partnership with 21 Shares is in a long line at the SEC to get its application to launch a spot bitcoin ETF approved. It would be the first product of its kind in the U.S., though similar products exist already in Canada and Europe. It would also compete with GBTC, of which ARK is a big holder. Grayscale has been fighting with the SEC to convert GBTC into an ETF. Many investors expect an ETF approval in the U.S. to usher a wave of new investors into crypto and help send prices higher. \"I'm sure some investors have taken positions in anticipation saying institutions are just going to push this up,\" Wood said. \"We're at roughly 19.5 million units of bitcoin out there and the top is going to be 21 million. So if there's going to be scarcity value and if institutions start pushing in, the price could go parabolic.\" However, she warned, \"when you get a lot of anticipatory investing like this sometimes you don't get that right away. There could just be profit-taking especially if it settles down a bit.\" The drumbeat for a bitcoin ETF has been growing louder since this summer. More recently, reports of better cooperation by the SEC with the funds attempting to launch an ETF has has helped propel the price of bitcoin higher – an event benefiting much of the crypto market. \"We were very happy to get questions from the SEC, having filed a number of times and been rejected out of hand,\" Wood said. \"Getting questions was a big step forward. We have gotten to know the research team at the SEC and we're very impressed … so we look forward to getting questions from them on the spot ETH ETF as well.\" Bitcoin doubled for the year on Oct. 24, giving a lift to crypto-related stocks and other cryptocurrencies. This week, ARK sold $6 million of GBTC shares, which Wood cited as a routine profit-taking event."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZ2xvYmFsbmV3cy5jYS9uZXdzLzEwMDkxMDA3L2JpdGNvaW4tdXNkLXByaWNlLTIwMjMv0gE_aHR0cHM6Ly9nbG9iYWxuZXdzLmNhL25ld3MvMTAwOTEwMDcvYml0Y29pbi11c2QtcHJpY2UtMjAyMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin’s price has quietly doubled this year. Why? - Global News",
        "content": "After seeing its value crater for much of 2022, bitcoin has quietly seen its price double over the past year.\n\nThe price of the popular cryptocurrency hit an 18-month high of US$37,344 this past week, with its value up more than 100 per cent year-to-date. Despite the surge, BTC hasn’t returned to its all-time highs of US$67,617 seen in November 2021.\n\nAnalysts who spoke to Global News say the cryptocurrency space is settling after a year of both scandal and tough market pressures, and hopes for more mainstream adoption for bitcoin and its peers in the months to come are fuelling a run-up for the asset.\n\nGreg Taylor, chief investment officer at Purpose Investments, says there was a “pretty big washout” for crypto in 2022 with many investors cashing out of the asset after its run-up in value towards the end of 2021.\n\nStory continues below advertisement\n\nCentral banks around the world were also ramping up their interest rate tightening cycles in 2022.\n\nAlex Tapscott, managing director of the digital asset group at Ninepoint Capital, says this prompted a flood of exits from the stock market into relative safe havens such as the U.S. dollar. As equity markets took a hit amid the swirling uncertainty of rising interest rates, cryptocurrencies were not immune to the pressure, he says.\n\n“Bitcoin and the asset class as a whole really didn’t stand a chance,” he says.\n\nCrypto also faced existential challenges with the folding of numerous exchanges and cryptocurrency tokens, as well as the high-profile collapse of FTX. That exchange, once valued at a peak of US$32 billion and hailed as a leader in the industry, was at the centre of a trial that most recently saw founder Sam Bankman-Fried convicted of defrauding investors.\n\n2:05 Sam Bankman-Fried’s FTX crypto empire ‘built on lies’: prosecutors\n\nIn the wake of the FTX collapse, Tapscott says regulators started sharpening their knives with an “aggressive” approach to the sector, which further weighed on growth prospects.\n\nStory continues below advertisement\n\nBut he says the negative impact from FTX’s unravelling was baked in at the time of the collapse, and the fraud conviction marked a “punctuation point” for the chapter of crypto’s history and a chance to “move on” for the industry.\n\n“Markets are forward-looking,” he says. “So after the collapse of FTX, I think a lot of people felt, ‘What more could go wrong here?’”\n\nBitcoin ETFs in the U.S. could bring crypto to mainstream\n\nAs much as FTX left a stain on the crypto industry, Taylor says the removal of “bad actors” and speculative forces in the industry is now helping to stabilize the space.\n\nFinancial news and insights delivered to your email every Saturday.\n\nFinancial news and insights delivered to your email every Saturday.\n\n“The system is getting healthier,” he says. “The increase in regulation, I think at the end of the day, will be positive as you get more trust in the system.”\n\nThe U.S. side of the industry may soon take another step towards the mainstream as well with the rumoured launch of bitcoin ETFs south of the border.\n\nStory continues below advertisement\n\nExchange-traded funds allow investors to get exposure to an entire basket of securities like stocks, bonds, and other assets without having to own them outright.\n\nBitcoin ETFs have been approved for years in Canada as well as in Europe. However, Canada’s securities regulator has warned investors – particularly non-professional or retail investors – about the risk involved in cryptocurrency.\n\n“The Canadian Securities Administrators (CSA) is warning investors that trading in crypto assets comes with elevated levels of risk that may not be suitable for many investors, in particular retail investors,” it said in a Nov. 2022 reminder. “Generally speaking, the value and liquidity of crypto assets are highly volatile.”\n\nBitcoin ETFs have been approved for years in Canada launched in Amsterdam earlier this year for a European first. Purpose Investments launched the first bitcoin ETF in the world in 2021, and Taylor says that it’s seen strong demand from investors.\n\nETFs can be an attractive way to invest in the crypto market because it doesn’t involve any of the technical onboarding that comes with directly owning bitcoin or other tokens, he explains.\n\n5:27 How to protect your money from crypto scams\n\nNinepoint, too, has launched a bitcoin ETF in Canada. Tapscott says having an ETF for crypto is similar to investors wanting exposure to gold assets, but not wanting to store gold bars in a safety deposit box.\n\nStory continues below advertisement\n\nWhen the first gold ETF launched in the U.S. nearly 20 years ago, the price of gold surged, he notes.\n\nTaylor says there has been pushback about launching bitcoin ETFs from the Securities Exchange Commission in the U.S. for years, but recent signals that BlackRock, the largest ETF provider in the world, is filing to launch such a product are lending legitimacy that approval may be on the horizon.\n\n“When you see an ETF in the space come and someone the size of BlackRock involved, I think that’s caused a lot of excitement as potentially when they do get one of these proofs you could see a lot of buying as the sector becomes more mainstream,” Taylor says.\n\nWhat is the bitcoin 'halving'?\n\nTapscott says there’s another force bearing down on the crypto industry that’s making bitcoin feel especially scarce.\n\nStory continues below advertisement\n\nThe crypto industry relies on “miners” who take on the job of producing more tokens like bitcoin through an energy-intensive computational process. The amount these miners will be paid per BTC token is going to be cut by 50 per cent in an event dubbed the “halving” expected in April 2024.\n\n“That is, by proxy, going to reduce the supply of new bitcoin by about half,” Tapscott explains.\n\nBitcoin prices have typically rallied in the past following halvings, according to Reuters. Six months after the first halving in 2012, the price jumped to $126 from $12. After the second halving in 2016, it went to $1,000 from $654 within seven months and in 2020 it shot up to $18,040 from $8,570 in the same time period. (All figures USD.)\n\nWhile traditional equity markets have continued to face a correction as of late as central banks warn interest rates might need to stay higher for longer, these same forces that pushed crypto assets down in value last year might turn into a boon, Taylor says.\n\nHigher inflation and interest rates can push market players outside of the “traditional banking system” into physical assets like energy and gold, he explains, as investors seek a safe haven from central bank rates.\n\nThere are some arguments that cryptocurrencies could fit into this real asset group and benefit in a higher interest rate environment.\n\nStory continues below advertisement\n\n3:09 U.S. Fed holds interest rates steady amid ‘strong’ economy: Powell\n\nTapscott says he expects that the crypto industry will be a hot topic during the upcoming 2024 presidential election, after which the space should benefit from increased clarity on how regulators will approach these assets.\n\nThere could still be “volatility” in cryptocurrencies, but he notes the same is true of technology stocks and other higher-risk assets. But the more mainstream adoption the market sees, and the more use cases for blockchain-backed technologies become widespread, the better the future for bitcoin and its crypto counterparts.\n\n“Is bitcoin risky? Yeah, I mean, I think any investment carries its form of risk,” he says.\n\n“You can talk about interest rates and halvings and ETFs all you want, but if you want an industry or a technology to be successful, it needs to be widely adopted and become economically impactful.”\n\nStory continues below advertisement\n\n— with files from Reuters"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE0L3Nob3VsZC15b3UtYnV5LWV0aGVyZXVtLXdoaWxlLWl0cy11bmRlcnBlcmZvcm1pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Underperforming the Market? - The Motley Fool",
        "content": "At first glance, Ethereum (ETH -3.48%), the world's second-most valuable cryptocurrency, seems to be having a banner year. Ethereum is up 57% and appears to be gaining momentum heading into the final weeks of the year. Over the past 30 days, Ethereum is up more than 20%.\n\nBut context matters, and right now, Ethereum is badly underperforming the crypto market. Bitcoin (BTC -3.59%), for example, is up a spectacular 112% this year. And other top cryptocurrencies are similarly posting triple-digit gains in 2023. All of this has complicated the decision-making calculus around Ethereum, which now looks like a market laggard. If you are thinking about buying Ethereum, this is what you need to know.\n\nWhy is Ethereum underperforming?\n\nWhat's particularly puzzling about Ethereum this year is that it's just so hard to pinpoint exactly why it's underperforming Bitcoin and other top cryptos. Heading into 2023, Ethereum seemed to be riding a wave of momentum after pulling off The Merge, which was widely hailed as one of the greatest technical achievements ever in the blockchain world. As a result of The Merge, Ethereum changed its overall blockchain infrastructure, all with the goal of reducing transaction fees, boosting transaction processing speeds, and improving overall efficiency.\n\nBut a number of issues have popped up throughout this year. For one, overall activity on the Ethereum blockchain seems to be down and that's not a good sign for future growth. Case in point: Bitcoin recently passed Ethereum for the first time ever in terms of 24-hour non-fungible token (NFT) sales volume, an area Ethereum has always dominated. And Total Value Locked (TVL), which measures activity on the blockchain, also recently reached a 12-month low, a potential sign of Ethereum's weakening position in decentralized finance. These might just be short-term blips on the radar, but they are still concerning.\n\nThere have been regulatory concerns, too, such as those related to staking activity on Ethereum's brand-new proof-of-stake blockchain. The primary concern is that the SEC's willingness to go after major cryptocurrency exchanges for their staking activity, as we saw earlier this year, will eventually erode the attractiveness of Ethereum as an investment option.\n\nMoreover, The Merge is not having the sort of breakthrough impact it was supposed to have, as measured by transaction fees and transaction processing speeds. For example, transaction fees for relatively straightforward activities, such as buying a new NFT, can sometimes run into the hundreds of dollars. And the main Ethereum blockchain can still only handle 20 to 30 transactions per second, a far cry from the 1 million transactions per second promised years ago.\n\nEthereum vs. Bitcoin\n\nPerhaps the best explanation, though, might be that investors are almost single-mindedly focused on Bitcoin at the moment. Just about everyone seems to be looking ahead to the imminent launch of the first-ever spot Bitcoin exchange-traded fund (ETF), and what that could mean for the broader crypto market. Ethereum almost feels like an afterthought right now.\n\nPerhaps as a result, the longtime strong correlation between Ethereum and Bitcoin appears to be weakening. Until mid-March, the correlation between Bitcoin and Ethereum was nearly 0.95. That's almost a perfect 1-to-1 match in terms of performance. But now the 90-day correlation between the two has dipped to the 0.8 level.\n\nEthereum vs. other altcoins\n\nIn addition, many other cryptos appear to be passing Ethereum right now. That's of particular concern in the case of Solana (SOL 4.66%), which is arguably Ethereum's greatest rival right now in the Layer-1 blockchain space. Solana is up a stunning 325% year to date. While Solana has its own fair share of regulatory and technical issues, investors have largely been willing to shrug them off due to Solana's perceived growth prospects. Solana's new \"crypto phone\" is just one of the most exciting projects.\n\nThese shifting investor perceptions of Ethereum are having an impact on institutional money flows. Quite simply, large institutional investors appear to be taking their money out of Ethereum and moving it into Solana. In 28 of 32 weeks this year, Solana has seen net positive inflows, according to CoinShares, which tracks inflows and outflows into different cryptocurrencies. In contrast, Ethereum has seen outflows. And that has led to CoinShares calling Solana \"the altcoin of choice\" for institutional investors right now.\n\nCan Ethereum bounce back?\n\nAt the end of the day, the decision whether or not to invest in Ethereum comes down to your view of its long-term growth prospects. Ethereum is still the clear leader in just about every niche or sector of the blockchain world and it's one of the few cryptos that seems to have the implicit support of federal regulators. Notably, SEC Chair Gary Gensler has always stopped short of calling Ethereum a \"security.\" And it's not like analysts have completely given up on Ethereum. Standard Chartered Bank, for example, just put out an aggressive $8,000 price target for Ethereum.\n\nGoing forward, I'm keeping a close eye on how Ethereum fends off the threat from rival Solana. This one factor could end up having the greatest impact on Ethereum's long-term growth prospects. If Ethereum is unable to keep up with Solana and other Layer-1 blockchains, that could have a huge impact on my decision of whether or not to invest in Ethereum going forward."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lmdsb2JlbmV3c3dpcmUuY29tL2VuL25ld3MtcmVsZWFzZS8yMDIzLzExLzE0LzI3ODAwNDMvMC9lbi9CaXRjb2luLVdlbGwtUmVwb3J0cy0yMDIzLVEzLUZpbmFuY2lhbC1SZXN1bHRzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Well Reports 2023 Q3 Financial Results - GlobeNewswire",
        "content": "EDMONTON, Alberta, Nov. 14, 2023 (GLOBE NEWSWIRE) -- Bitcoin Well Inc. (“Bitcoin Well” or the “Company”) (TSXV: BTCW; OTCQB: BCNWF), the non-custodial fintech business which future-proofs money by making bitcoin useful to everyday people, today announced financial and operating results for the third quarter ended September 30, 2023.\n\n\n\nKey highlights\n\nGross profit of $1.1 million for the 3-months ended September 30, 2023 ($1.2 million - 2022) and $3.4 million for the 9-months ended September 30, 2023 ($3.2 million - 2022).\n\nAdjusted EBITDA of negative $0.1 million for the 3-months ended September 30, 2023 (negative $0.4 million - 2022) and negative $0.7 million for the 9-months ended September 30, 2023 (negative $3.6 million - 2022). Improvements to Adjusted EBITDA are a result of significant cost containment in areas across the business, including a significant reduction in the number of full time employees, achieved through efficiencies and automation in many operational processes.\n\nOver 8,800 unique users in the Online Bitcoin Portal in Q3 2023 (3,800 - Q1 2023, 6,000 - Q2 2023) an improvement of 132% and 47% over Q1 2023 and Q2 2023, respectively. Associated online revenues exceeded $3.4 million for the 3-months ended September 30, 2023 ($2.0 million - Q2 2023, $0.9 million - Q1 2023), maintaining continued growth in the Online Bitcoin Portal since launched in Q4 2022.\n\n\n\n\n\n\n\n“We are continuing to navigate the balance between profit and growth effectively,” said Adam O’Brien, Founder & CEO of the Company. We are approaching the 10,000 user mark on our platform during one of the deepest bear markets in bitcoin’s history. At the same time, we have managed to increase our Bitcoin ATM gross margins and lower costs. That said, this is only the beginning as we continue to set our sights on responsible growth and rewarding our loyal shareholders.”\n\nFinancial overview\n\nFor the three months ended, For the nine months ended, Sept 30, 2023 Sept 30, 2022 Sept 30, 2023 Sept 30, 2022\n\n\n\nRevenue $ 13,412,337 $ 14,354,002 $ 40,941,790 $ 48,469,160 Gross Profit 1,110,325 1,177,780 3,398,365 3,208,329 Adjusted EBITDA(1) (73,694 ) (357,976 ) (664,522 ) (3,574,315 ) Total comprehensive loss (2,208,561 ) (772,518 ) (4,038,470 ) (8,392,389 )\n\n(1) See Non-IFRS Measures.\n\nOverall revenue in Q3 2023 was $13.4 million, compared to $14.4 million in Q3 2022 (-7%). The decrease of $1.0 million was driven by a decline in Bitcoin Well Infinite (OTC) volumes of $4.9 million, as the Company transitioned these services into the Online Bitcoin Portal in Q3 2023.\n\n“Our Bitcoin Well Infinite processes weren’t able to scale with the needs of the mass market,” said Adam O’Brien. “We heard we needed to be faster and more price competitive. As a result, we have integrated large bitcoin transactions into the Online Bitcoin Portal to give a more streamlined experience.”\n\nThe decrease in Bitcoin Well Infinite (OTC) volume was partially offset by an increase in ATM sales of $1.3 million (+18%) and increased Online Bitcoin Portal revenues of $2.6 million (+346%). This change in product mix resulted in gross profit decreasing slightly to $1.1 million in Q3 2023, from $1.2 million in Q2 2022 (-8%), which can be attributed to a slight decrease in margin due to a now competitive online fee charged in the Online Bitcoin Portal.\n\nTotal operational expenses were $2.2 million in Q3 2023 compared to $2.3 million in Q3 2022, an improvement of $0.1 million year over year (6% improvement). Excluding financing fees, operating expenses declined by $0.4 million to $1.5 million (21% improvement) in Q3 2023 due to significant cost containment in areas across the business, including a significant reduction in the number of full time employees.\n\nAdjusted EBITDA was negative $0.1 million in Q3 2023, reflecting a $0.3 million improvement over Q3 2022 adjusted EBITDA of negative $0.4 million (88% improvement). The improved adjusted EBITDA was due to the lower operating expenses discussed above.\n\nExecutive Updates\n\nBitcoin Well would like to welcome back Jason Vandenberg, CPA, CA who has been re-appointed as the Company’s Chief Financial Officer, effective November 13, 2023. Jason brings over 20 years of experience across diverse financial leadership positions and has an established record of leading multiple companies through substantial growth, both organically and through business acquisitions. Jason has experience with the Company as he was the acting CFO when Bitcoin Well listed on the TSXV in 2021. Jason is a Chartered Professional Accountant and holds a Bachelor of Commerce, with Distinction, from the University of Alberta.\n\n\n\n\n\nMr. Vandenberg replaces Allen Stephen who has resigned as Chief Financial Officer and as a director, effective November 13, 2023. The Company extends sincere appreciation for Mr. Stephen’s contributions to the Company over the past couple years.\n\nShare Issuance\n\nBitcoin Well also announces, subject to TSX Venture Exchange approval, the issuance of 1,333,333 common shares at a deemed price of $0.03 per share to an arm’s length party as payment for past services rendered to the Company.\n\nLoans Payable – Cryptocurrency\n\nBitcoin Well confirms that in March and May 2023, the Company was loaned a total of 60 additional Bitcoins, valued at $2,252,300, from certain arm’s length parties, which are unsecured and incur interest at an annual rate of 10.0% per annum, calculated based on the value of the underlying cryptocurrency at the time the loan was originated. In addition, during the nine months ended September 30, 2023, all of the cryptocurrency loans of the Company were amended to extend the terms of each loan and amend the interest rate applicable. At September 30, 2023, the Company’s cryptocurrency loans consisted of 230 Bitcoins and 100 Ethereum with a fair value of $8,682,447. The cryptocurrency loans now only become due after 12 months of a written notice request received from the holder, are unsecured, and bear interest at fixed rates ranging from 6.0% to 10.0% per annum or at a variable rate equal to bank prime plus 5% per annum.\n\nPursuant to amendment agreements entered into on September 1, 2023, the Company also agreed to prepay certain interest owing on the cryptocurrency loans. For additional details, please see the Company’s press release dated September 1, 2023 and the Company’s financial statements for the nine months ended September 30, 2023.\n\nNon-IFRS measures\n\nThe Company uses certain terms in this news release, such as ‘Adjusted EBITDA’, which do not have a standardized or prescribed meaning under International Financial Reporting Standards (IFRS), and accordingly, these measurements may not be comparable with the calculation of similar measurements used by other companies.\n\n\n\nSee the table below for a reconciliation of each non-IFRS measure to its nearest IFRS measure or refer to the \"Non-GAAP Measures” and “Selected Financial Information” sections in the Company’s Management Discussion & Analysis for period ended September 30, 2023 (“MD&A”) for applicable definitions, calculations, rationale for use and reconciliations to the most directly comparable measure under IFRS. Non-IFRS measures are provided as supplementary information by which readers may wish to consider the Company's performance, but should not be relied upon for comparative or investment purposes.\n\nReconciliation of Adjusted EBITDA to net loss\n\nThree months ended Nine months ended Sept 30, 2023 Sept 30, 2022 Sept 30, 2023 Sept 30, 2022 Net loss $ (1,843,108 ) $ (983,495 ) $ (6,819,735 ) $ (4,139,552 ) Fair value change – cryptocurrency(1) (779,823 ) 223,229 3,079,971 (4,691,913 ) Financing fees 621,964 355,777 1,555,302 775,930 Depreciation and accretion 350,136 403,269 1,119,798 1,798,267 Share based compensation 332,330 92,843 503,063 203,686 Income tax expense (recovery) 1,263,808 (301,594 ) 241,707 (595,154 ) Realized gain on digital assets - - (374,958 ) - Restructuring - (120,000 ) - 3,188,022 Gain on debt settlement - (36,534 ) 3,924 (123,298 ) Business acquisition costs - 7,947 - 7,947 Other (19,001 ) 582 26,406 1,750 Adjusted EBITDA $ (73,694 ) $ (357,976 ) $ (664,522 ) $ (3,574,315 )\n\n(1) Non-cash, fair value change on the revaluation of cryptocurrency loans, which are more than offset by a revaluation loss on digital assets recorded in Other Comprehensive Income.\n\nThis news release should be read in concert with the full disclosure documents. The Bitcoin Well consolidated financial statements and MD&A for the three and nine months ended September 30, 2023 will be available on the Bitcoin Well website ( www.bitcoinwell.com ), via SEDAR+ ( www.sedarplus.ca ) or can be requested from the Company.\n\nAbout Bitcoin Well\n\nBitcoin Well is on a mission to enable independence. We do this making bitcoin useful to everyday people to give them the convenience of modern banking and the benefits of bitcoin. We like to think of it as future-proofing money. Our existing Bitcoin ATM and Online Bitcoin Portal business units drive cash flow to help fund this mission.\n\nJoin our investor community and follow us on Nostr , LinkedIn , Twitter and YouTube to keep up to date with our business.\n\nBitcoin Well contact information\n\nTo book a virtual meeting with our Founder & CEO Adam O’Brien please use the following link: https://bitcoinwell.com/meet-adam\n\nFor additional investor & media information, please contact:\n\nTel: 1 888 711 3866\n\nir@bitcoinwell.com\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nForward-looking information\n\nCertain statements contained in this news release may constitute forward-looking information. Forward-looking information is often, but not always, identified by the use of words such as \"anticipate\", \"plan\", \"estimate\", \"expect\", \"may\", \"will\", \"intend\", \"should\", or the negative thereof and similar expressions. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking information. Bitcoin Well actual results could differ materially from those anticipated in this forward-looking information as a result of regulatory decisions, competitive factors in the industries in which Bitcoin Well operates, prevailing economic conditions, and other factors, many of which are beyond the control of Bitcoin Well.\n\nBitcoin Well believes that the expectations reflected in the forward-looking information are reasonable, but no assurance can be given that these expectations will prove to be correct and such forward-looking information should not be unduly relied upon. Any forward-looking information contained in this news release represents Bitcoin Well expectations as of the date hereof, and is subject to change after such date. Bitcoin Well disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable securities legislation. For more information, see the Cautionary Note Regarding Forward Looking Information found in the Bitcoin Well quarterly Management Discussion and Analysis.\n\nPhotos accompanying this announcement are available at:\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/0dacba85-9dc2-4644-b9d0-892d43761861\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/e4df4a5e-cdd2-4b0b-910b-f6bf6cda6192\n\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/eb995971-940f-45a6-a9e0-9ad19acbc0a1"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG92ZXJzZS1iaXRjb2luLW1pbmVycy1tYWtlLW1vbmV5LWFoZWFkLW9mLWhhbHZpbmcvYXJ0aWNsZXNob3cvMTA1MjA1OTM1LmNtc9IBhwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG92ZXJzZS1iaXRjb2luLW1pbmVycy1tYWtlLW1vbmV5LWFoZWFkLW9mLWhhbHZpbmcvYW1wX2FydGljbGVzaG93LzEwNTIwNTkzNS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Cryptoverse: Bitcoin miners make money ahead of 'halving' - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZ2l6bW9kby5jb20vb2xkLWJpdGNvaW4td2FsbGV0cy1zZWN1cml0eS1mbGF3cy1yYW5kc3Rvcm0tdW5jaXBoZXJlZC0xODUxMDIwNDcw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Millions of Old Bitcoin Wallets Have Critical Security Flaws, Experts Say - Gizmodo",
        "content": "Bitcoin wallets older than 2016 could have a vulnerability that puts over $1 billion worth of cryptocurrency at risk, according to a report in the Washington Post.\n\n\n\nWhy Should Crypto Currencies be Called Securities? | Gizmodo Interview CC Share Subtitles Off\n\nEnglish view video Why Should Crypto Currencies be Called Securities? | Gizmodo Interview\n\nAccording to Unciphered, a cryptocurrency recovery company, an untold number of crypto wallets were designed with baked-in flaws that leave a backdoor in the code that hackers could easily break open. Encrypted software systems like crypto wallets often rely on random number generators, but the company found that a significant number of wallets were built on open-source software that used numbers that aren’t nearly random enough. These vulnerable wallets use keys with numbers that are one in several thousand instead of one in a trillion, making them susceptible to brute-force attacks.\n\nAdvertisement\n\nUnciphered told the Post its staff has contacted over a million people to let them know about the issue, nicknamed “Randstorm,” but millions more are likely affected. You can check whether your wallet is affected at the website keybleed.com.\n\nAdvertisement\n\nThe issue reportedly stems from a piece of software called BitcoinJS used to create wallets from a number of popular crypto outlets, including Blockchain.info (renamed Blockchain.com), Dogechain.info (the main source of wallets used for Dogecoin), and many other websites.\n\n\n\nAdvertisement\n\nAnyone using a wallet built with BitcoinJS “is on the very high end of risk to attack,” Unciphered co-founder Eric Michaud told the Post.\n\n\n\nWallets created before March 2012 are particularly unsafe, according to Unciphered. Most wallets created between then and the tail end of 2015 are fine, but at least two percent could be vulnerable. The random number generators used in the crypto community have since improved, and any new wallets should be safe—at least from this particular issue. Unciphered hasn’t found any wallets created after 2016 that contain the Randstorm flaw.\n\n\n\nAdvertisement\n\nBlockchain.com, which is the most popular site that’s still in business that harnessed the flawed software, found a way to automatically update users’ wallets when they visit the platform and sent emails to 1.1 million affected customers. The company says the problem was only present in two percent of the 90 million wallets it created over the years. But millions of other people out there may still be open to the vulnerability, and if they got their wallets from companies that since shut down, there may be no way to notify them directly.\n\nCorrection 2:41 PM: A previous version of this article identified the wrong piece of software responsible for the flaw. The software is called BitcoinJS. We regret the error.\n\n"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmZpbmV4dHJhLmNvbS9ibG9ncG9zdGluZy8yNTE5NC9jb21wZXRpdGl2ZS1hZHZhbnRhZ2UtaG93LXRoZS1iaXRjb2luLWV4dHJhY3Rvci1taWdodC1zZXQtYnVzaW5lc3Nlcy1hcGFydNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Competitive Advantage: How the Bitcoin Extractor Might Set Businesses Apart - Finextra",
        "content": "In the ever-shifting landscape of technology and finance, businesses are always on the lookout for innovative ways to stay ahead of the competition. One avenue that's been gaining attention is the use of cutting-edge technology, and in this context, the Bitcoin Extractor has emerged as a potentially groundbreaking tool. Bitcoin, the trailblazing cryptocurrency, has captured the imagination of both businesses and individual investors. As a decentralized digital currency, it boasts numerous benefits, including financial flexibility, reduced transaction costs, and enhanced security.\n\nAt the core of the cryptocurrency ecosystem lies the practice of Bitcoin mining, which serves as the method for generating new Bitcoins and validating transactions. In this article, we will explore how the Bitcoin Extractor, an idea gaining traction in the mining industry, might set businesses apart in the fiercely competitive realm of cryptocurrency.\n\nBitcoin Mining: A Cornerstone of the Cryptocurrency World\n\nBefore we dive into the potential competitive advantage of the Bitcoin Extractor, it's crucial to grasp the significance of Bitcoin mining within the cryptocurrency ecosystem. Bitcoin functions on a decentralized ledger known as the blockchain, which records all transactions in a secure and immutable manner. To uphold the integrity of this ledger, new transactions must be validated, and new Bitcoins need to be generated to incentivize miners for their contributions.\n\nBitcoin mining involves miners utilizing high-powered computers to tackle intricate mathematical puzzles. These miners compete amongst themselves to discover the solution, and the one who successfully accomplishes this task is duly rewarded with a block of newly created Bitcoins. Additionally, they receive compensation in the form of transaction fees for their role in verifying and processing transactions. This mechanism, known as proof of work (PoW), is fundamental for the security and proper operation of the Bitcoin network.\n\nThe Bitcoin Extractor: A Game Changer in Bitcoin Mining\n\nThe Bitcoin Extractor introduces a potential evolution in the realm of Bitcoin mining. Traditional miners have long relied on specialized hardware called Application-Specific Integrated Circuits (ASICs) to mine Bitcoins efficiently. However, these machines come with a hefty price tag, consume substantial amounts of electricity, and require regular upgrades to remain competitive. As a result, Bitcoin mining has become increasingly centralized, dominated by large mining pools and corporations.\n\nThe Bitcoin Extractor, on the other hand, seeks to disrupt this status quo by introducing a novel approach to mining that's more accessible, cost-effective, and environmentally friendly. It leverages Field-Programmable Gate Arrays (FPGAs), which are programmable hardware devices. FPGAs can be adapted to perform specific tasks, making them highly versatile and energy-efficient. Unlike ASICs, which are designed for a single purpose, FPGAs can be repurposed for various applications, including Bitcoin mining.\n\nThe primary advantage of the Bitcoin Extractor lies in its adaptability and efficiency. Businesses can deploy FPGAs for Bitcoin mining without the need for constantly upgrading expensive ASICs. This not only reduces the initial investment required but also decreases operational costs, making it an appealing option for businesses looking to enter the cryptocurrency mining arena.\n\nCompetitive Advantages of the Bitcoin Extractor\n\nReduced Costs: The Bitcoin Extractor significantly lowers the barriers to entry for businesses interested in Bitcoin mining. Traditional mining operations demand substantial capital for the purchase and maintenance of expensive ASIC hardware. In contrast, FPGAs are more budget-friendly and versatile, allowing businesses to kickstart their mining journey with a smaller initial investment.\n\nEnergy Efficiency: Field-Programmable Gate Arrays (FPGAs) are widely recognized for their exceptional energy efficiency, resulting in reduced power consumption when compared to ASICs. This efficiency leads to cost savings in electricity bills and contributes to a more environmentally friendly footprint.\n\nAdaptability: FPGAs are programmable and adaptable, enabling businesses to switch between different cryptocurrencies or utilize the hardware for other computing tasks when not mining Bitcoin. This flexibility is a valuable asset in a rapidly changing cryptocurrency landscape.\n\nDecentralization: The Bitcoin Extractor fosters a more decentralized mining ecosystem. By reducing the dominance of large mining pools and corporations, it contributes to the broader distribution of mining power, in line with the decentralized ethos of Bitcoin.\n\nRisk Mitigation: The cryptocurrency industry is known for its fast pace, where mining hardware can quickly become outdated. With FPGAs, businesses can adapt to changes in the mining landscape without the need for costly hardware upgrades, reducing the risk of technological obsolescence.\n\nEco-Friendly Image: Embracing environmentally friendly mining practices can enhance a company's image and appeal to socially conscious consumers and investors. The Bitcoin Extractor's energy-efficient approach positions businesses as responsible stewards of resources.\n\nInnovation Potential: The adaptable nature of FPGAs opens up opportunities for innovative applications beyond mining. Businesses may find creative uses for this technology, enhancing their overall operations and diversifying revenue streams.\n\nChallenges and Considerations\n\nWhile the Bitcoin Extractor offers numerous competitive advantages, it's essential to acknowledge the challenges and considerations associated with this technology:\n\nTechnical Expertise: Businesses venturing into Bitcoin mining with FPGAs need the technical expertise to set up and maintain the hardware effectively. This may entail additional training or hiring skilled personnel.\n\nRegulatory Environment: The regulatory landscape for cryptocurrencies and mining can be complex and subject to change. Businesses must stay informed about legal requirements and compliance in their respective regions.\n\nMarket Volatility: The cryptocurrency market is known for its price volatility. Businesses must be prepared for fluctuations in the value of mined Bitcoins and their impact on profitability.\n\nCompetition: While the Bitcoin Extractor may reduce barriers to entry, competition in the mining space remains fierce. Businesses must be ready to compete with other miners for block rewards and transaction fees.\n\nIn Closing: Bitcoin Extractor Has A Huge Potential\n\nThe Bitcoin Extractor represents a potential paradigm shift in Bitcoin mining. Its utilization of FPGAs offers businesses an array of competitive advantages, including lower costs, energy efficiency, adaptability, and the potential for a more environmentally friendly image. By adopting this technology, businesses have the opportunity to establish themselves as forward-thinking and conscientious participants in the cryptocurrency landscape.\n\nNonetheless, it is imperative for businesses to take into account the technical and regulatory hurdles connected to Bitcoin mining and the utilization of FPGAs. The competitive advantage offered by the Bitcoin Extractor must be weighed against these factors and the dynamic nature of the cryptocurrency market.\n\nAs the cryptocurrency industry continues to evolve, businesses must be prepared to adapt and innovate to stay competitive. The Bitcoin Extractor is one of the tools available to those seeking a foothold in the world of cryptocurrency, and its potential to set businesses apart depends on their ability to leverage it effectively while addressing the associated challenges.\n\nIn summary, the Bitcoin Extractor presents an enticing opportunity for businesses to gain a competitive edge in the dynamic world of cryptocurrency. It opens the door to more accessible and environmentally friendly Bitcoin mining, providing businesses with the means to participate in this growing market without the substantial barriers traditionally associated with mining. While challenges and risks exist, embracing innovative technologies like the Bitcoin Extractor may pave the way for a brighter and more sustainable future for businesses in the cryptocurrency space."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vbWFzaGFibGUuY29tL2FydGljbGUvY3J5cHRvLWhhcmR3YXJlLXdhbGxldC10cmV6b3Itc2FmZS0z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "How to keep your bitcoin safe from hackers with Trezor Safe 3 - Mashable",
        "content": "There's a saying in crypto: Not your keys, not your coins.\n\nWhile this is true, it's also worth considering what \"your\" means, exactly. If, for example, you keep your cryptocurrency private key in an unprotected text file residing on your hard drive, your coins may be \"yours,\" but they are fairly easy for hackers to steal.\n\nWith a hardware wallet, it's another matter.\n\nWhy use a hardware wallet?\n\nA hardware wallet is a device designed specifically to keep your cryptocurrency safe. Typically, it's a small gadget with no other use case than to store your BTC, ETH, or whichever digital asset you fancy.\n\nHardware wallets almost always have a \"secure element,\" which includes a chip designed to guard your data from malicious apps and attacks. They also typically have a passphrase that lets you access the data stored on the wallet.\n\nYes, you can choose to gain access to your bitcoin via an app on your computer or phone. But these devices do a million other things besides securing crypto. You probably have dozens of apps installed, and as well as access to a variety of websites and services, thereby increasing the chance of something malicious sneaking in.\n\nConversely, crypto hardware wallets only have one app for the following purposes: send, receive, and secure your crypto. That's it. Nothing else goes in or out.\n\nTesting the Trezor Safe 3\n\nFor the purpose of this article, I've used the newly launched Trezor Safe 3 (Bitcoin Edition), a $79 wallet from Trezor. This particular hardware wallet is interesting because it's even more straightforward to understand and use than other devices; it's specifically designed to secure your bitcoin. No fuss, no complications: You guard your bitcoin with Trezor Safe 3, keep it somewhere safe (no pun intended), and never touch it until you need to access it.\n\nThe Trezor Safe has two buttons and a tiny, 0.96-inch, monochromatic OLED display. It's connected to your computer via a USB-C port. It's a simple device with a singular purpose — and many users will appreciate that.\n\nSetting up Trezor Safe 3\n\nSetting it up is easy. Download and install Trezor's software, crack open the packaging on the device itself, and connect it to your computer via a USB-C cable. The software will recognize the device, updated its firmware, and launch a tutorial on how to use it.\n\nAfter initialising the device, you'll be asked to create a recovery seed. This is basically your crypto key, expressed as a string of English words (typically 12 words). Write these words down on paper (Trezor supplies two handy pieces of paper for that purpose). Don't show them to anyone; store them somewhere very safe.\n\nAn optional step you can do is to create a PIN for your Trezor. You should definitely do that. If you don't, anyone with physical access to the device can breach your crypto. Choose a PIN that you won't forget, and preferably something that only you know.\n\nMoving your bitcoin to the hardware wallet\n\nSay you've purchased bitcoin on a crypto exchange, and now, you want to move them somewhere safer (That's a good idea, by the way. In the world of cryptocurrencies, exchanges have been known to get hacked or go bankrupt.)\n\nOnce you've set up your Trezor Safe 3, connect it to your computer and open the Trezor app. Go to \"Accounts - Receive\" and confirm that the address on the computer screen matches the one on the device itself. Don't neglect this part. If your computer or Trezor software gets compromised, a malicious software may try to scam you into sending the coins to the wrong address.\n\nHit Receive to see your receiving address. Always double check the address in the software and on the device itself before sending or receiving coins. Credit: Trezor\n\nThen, depending on where you're sending the bitcoins from, you can either scan the generated QR code with your phone, or copy and paste the address when the exchange you're sending from asks you to (check that the address is accurate one more time at this point).\n\nAfter you've sent your bitcoin to the hardware wallet, it will typically take a few minutes for them to show up in your Trezor software. Once they're there, you're done. You can disconnect your wallet and keep it somewhere safe.\n\nSending coins is the opposite of this process. Connect your Trezor, run the Trezor software, hit \"Accounts - Send\", pick the amount you want to send, make sure you have the right receiving address, review all the data one more time, and click \"Send.\"\n\nThings you should never do\n\nWhile hardware wallets are among the most secure methods for securing crypto, they only work if you keep certain precautions. Here's a list of things you should never do:\n\n1. Keep your private key in an unsecure manner or share it with anyone.\n\nYour private key, which is a long string of characters, or the recovery seed, typically a gaggle of randomized words, give you full control of your bitcoin and other cryptocurrencies. While setting up your hardware wallet, you'll be prompted to write that list of words down as backup. But it must be stored securely, for example, in a safe. If you just keep it on your desk or store it on a computer file, you've compromised the security you get from a hardware wallet.\n\nYou can write your recovery seed down on a piece of paper, or you can get Trezor's Keep, an analog device made of metal which lets you store your recovery seed without worrying about fire damage. Credit: Trezor\n\n2. Lose your backup\n\nSecurely storing your private key may sound like an unnecessary hassle. Isn't your hardware wallet enough? Well, in theory it is, but it can be misplaced, stolen, or simply malfunction. You need to have a backup. And yes, you need to store it securely; see point number one.\n\n3. Misplace your hardware wallet (especially with no PIN)\n\nLosing your physical device is terrifying, but it's not the end of the world. if you've set up a PIN to protect your coins. If it's PIN-protected, someone that finds the device won't easily access it. And if you've taken precautions and stored your backup safely, you can recover your coins. The recovery process on the Trezor is simple and consists of punching in those 12 words from your recovery seed. It will take a few minutes, given the Trezor has no keyboard, but fortunately, it's probably not something you'll be doing very often.\n\nIs that it?\n\nWell, pretty much. There's nothing too glamorous about securing your crypto with a hardware wallet. It's akin to storing gold and jewellery in a safe. Every now and then, you should connect your wallet to your computer and run the accompanying software to see if the device requires some important updates. But if you don't plan to send, receive, or use your crypto, you should mostly leave your hardware wallet be — until it's needed."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZ2VvZ3JhcGhpY2FsLmNvLnVrL3NjaWVuY2UtZW52aXJvbm1lbnQvdGhlLWhpZGRlbi1jb3N0cy1vZi1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "The hidden costs of Bitcoin go beyond its carbon footprint - Geographical Magazine",
        "content": "The environmental impact of Bitcoin and other cryptocurrencies is higher than their virtual nature might suggest\n\nBetween their inception in 2009 and early 2022, digital currencies witnessed an extraordinary rise in value, attracting huge investments from wealthy individuals and corporations. At their peak in 2021, the combined value of all cryptocurrencies surpassed US$3 trillion, with the price of a single Bitcoin – still the best-known cryptocurrency – reaching around US$60,000. The same year, El Salvador became the first country to make Bitcoin legal tender (alongside the US dollar, which replaced its own currency, the colón, in 2001).\n\nToday, amid rising interest rates and numerous industry scandals (in November 2023, Sam Bankman-Fried, founder of the now bankrupt cryptocurrency exchange company FTX, was convicted of multi-billion dollar fraud), the cryptocurrency market has all-but collapsed. However, a considerable amount of money remains in the sector, a concern for experts who say the market has a hidden dark side.\n\nBitcoin may be a virtual currency, but using it is energy intensive. Simply put, for a Bitcoin transfer to take place, a piece of hardware called an ‘application specific integrated circuit’ (ASIC) has to solve a mathematical puzzle. This process is known as Bitcoin mining and can take place on a huge scale in cryptocurrency ‘farms’ where hundreds of ASICs solve riddles at the same time. Crucially, this uses a great deal of computing capacity.\n\nIn 2019, a group of researchers at the Technical University of Munich (TUM) released what was then the most comprehensive analysis of the environmental impact of Bitcoin to date. Christian Stoll, who conducts research at both TUM and MIT, explains that to determine the electricity consumption in the network, you need to know the efficiency of the mining devices that are out there. ‘Using the IPO filings of three major hardware companies, we could calculate a pretty accurate number for the efficiency of the hardware that miners actually use.’ Through this analysis, the researchers determined the annual electricity consumption of Bitcoin, as of November 2018, to be about 46TWh – equivalent to that of the entirety of Portugal. They were then able to determine how much CO2 is emitted as a result of this electricity consumption.\n\nThey concluded that, in 2018, the use of the currency released around 22 megatons of CO2 emissions – comparable to the total emissions of cities such as Hamburg or Las Vegas. A new study from researchers at the United Nations University Institute for Water, Environment and Health (UNU-INWEH) estimates that during the 2020–2021 period, the use of Bitcoin emitted over 85 megatons of CO2. Moreover, UNU-INWEH scientists say that the cryptocurrency sector has other, majorly overlooked environmental impacts.\n\nDuring the same period (2020-2021), the study reveals that Bitcoin’s water footprint was similar to the amount of water required to fill over 660,000 Olympic-sized swimming pools, or enough to meet the current domestic water needs of more than 300 million people in rural sub-Saharan Africa. Its land footprint was more than 1,870 square kilometres – 1.4 times the area of Los Angeles.\n\nThese striking figures highlight the heavy reliance of the Bitcoin network on fossil fuels and natural resource-intensive energy sources, prompting researchers to call for urgent regulatory intervention and the development of new technology to mitigate the environmental impacts – the greenhouse gas emissions of Bitcoin mining alone could be sufficient to push global warming beyond the Paris Agreement’s goal of holding anthropogenic climate warming below 2°C."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNpdHlhbS5jb20vY29vbGluZy1jcnlwdG8tbWFya2V0cy1zZWUtYml0Y29pbi1hbmQtZXRoZXJldW0tcmV0cmFjZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Cooling crypto markets see Bitcoin and Ethereum retrace - CityAM - City A.M.",
        "content": "Cooling crypto markets see Bitcoin and Ethereum retrace\n\nBitcoin is down more than 3% on the day while Ethereum, in the red by 3.8%, is following the same pattern. Many other large-caps are also in the negative at the time of writing, with the exception of Avalanche, which has gained more than 8% overnight.\n\nThe Relative Strength Index (RSI) has dropped significantly from above 70 to 56, reflecting the pullback in many crypto markets this morning.\n\nYesterday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\n🔵 $1.37 trillion\n\n🔻 2.09%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $36,744\n\n🔻 Daily low $34,984\n\nBitcoin market capitalisation\n\n🟠 BTC $698.566 billion\n\n🟡 Gold $13.037 trillion\n\n💳 Visa $510.88 billion\n\nBitcoin volume\n\nTotal spot trading volume $24.14 billion\n\n🔺 31.32%\n\nEthereum staking entry queue\n\n59 minutes\n\nSP500\n\n🔺 1.91%\n\nFTSE/JSE Top 40\n\n🔺1.78%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n51.87\n\nRelative Strength Index (RSI)\n\n56.10\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\n“Much like Bitcoin, a spot ETF approval for ETH would also signal a positive stance by regulators and the US government towards Ethereum.” Adam Blumberg, co-founder at Interaxis\n\nCrypto AM: Editor’s picks\n\nKraken appoints crypto entrepreneur and fintech consultant Bivu Das to drive next chapter of UK growth story\n\nTransformBase initiative set for launch in November\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tc3VkZGVubHktdHJhZGluZy1pbi1kaWZmZXJlbnQtZGlyZWN0aW9ucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum suddenly trading in different directions - CityAM - City A.M.",
        "content": "Bitcoin and Ethereum suddenly trading in different directions\n\nBitcoin is trading in the negative today, down by one per cent over 24 hours, while Ethereum seems to be going the other way and still trading above the key $2,000 level.\n\nAmong the third-gen cryptocurrencies, Polygon continues to rally with 5% gains overnight while others such as Solana pull back. The cryptocurrency known for its speedy throughput is in the red by more than 5%.\n\nXRP saw a 10% surge in price yesterday, following on the heels of a now debunked rumour that BlackRock is also planning to launch an XRP ETF. The price of XRP quickly corrected after the asset manager quashed the rumours.\n\nYesterday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\n🔵 $1.4 trillion\n\n🔻 0.69%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $37,404\n\n🔻 Daily low $36,358\n\nBitcoin market capitalisation\n\n🟠 BTC $718.23 billion\n\n🟡 Gold $12.856 trillion\n\n💳 Visa $506.18 billion\n\nBitcoin volume\n\nTotal spot trading volume $18.38 billion\n\n🔺 39.26%\n\nEthereum staking entry queue\n\n0 minutes\n\nSP500\n\n🔻 0.084%\n\nFTSE/JSE Top 40\n\n🔺0.76%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n52.19\n\nRelative Strength Index (RSI)\n\n70\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\nThis week's big data report is the October CPI\n\n\n\nWall Street forecasters expect the core index rose 0.34% from September, raising the 12-month rate to 4.2% from 4.1%\n\n\n\nThey see the headline index up 0.1% from September, lowering the 12-month rate to 3.3% from 3.7% pic.twitter.com/wADwEXGOTn — Nick Timiraos (@NickTimiraos) November 13, 2023\n\nCrypto AM: Editor’s picks\n\nKraken appoints crypto entrepreneur and fintech consultant Bivu Das to drive next chapter of UK growth story\n\nTransformBase initiative set for launch in November\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    }
]