[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vYmxhY2tyb2NrLWZpbGVzLWZvci1hLXNwb3QtYml0Y29pbi1ldGYtNzU0NzYwOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock Files for a Spot Bitcoin ETF - Investopedia",
        "content": "Investment giant BlackRock (BLK) filed an application for a Bitcoin exchange-traded fund (ETF) on Thursday using the crypto exchange Coinbase (COIN) for custody and market pricing, in what would be the first product of its kind in the U.S. if approved.\n\nKey Takeaways BlackRock filed an SEC application on Thursday for a Bitcoin ETF.\n\nThe application lists Coinbase as the custodian for assets and pricing data.\n\nIf approved, it would be the first product of its kind in the U.S.\n\nWhile the SEC has previously approved Bitcoin futures ETFs, it denied multiple spot ETF applications for the coin.\n\nThe new iShares Bitcoin Trust will be listed on the Nasdaq exchange and pricing will be calculated daily based on the CF CME Bitcoin Reference Rate, which “aggregates the notional value of Bitcoin trading across major Bitcoin spot exchanges,” according to the prospectus. All shares in the ETF will be fully backed by BTC and no new shares can be issued without delivery of the corresponding value of tokens.\n\nHowever, the BlackRock offering still requires approval from the SEC, which has so far pushed back against multiple spot-based ETF applications.\n\nThe SEC is currently involved in a court battle with digital asset management firm Grayscale over its plans to convert its Grayscale Bitcoin Trust (GBTC) from a futures-backed index to spot, and may not approve BlackRock’s application until a court ruling is due later this year.\n\nIn its first oral arguments against Grayscale, the SEC cited the “fragmented and unregulated” spot market as the reason for its stance, arguing that the regulated futures market provided more security for investors and pointed to \"surveillance sharing\" agreements that protect against market manipulation.\n\nRegulatory approval for the iShares Bitcoin Trust would be a boost for Coinbase after suffering deposit outflows after a separate legal action from the SEC. The regulator accused the company of operating an \"unlawful exchange.\"\n\nBlackRock shares finished 2.71% higher on Thursday, while Coinbase shares edged up 0.65%.\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTUvYmxhY2tyb2NrLWZpbGVzLWZvci1iaXRjb2luLWV0Zi1jb2luYmFzZS1hbmQtbmFzZGFxLWxpc3RlZC1hcy1wYXJ0bmVycy_SAXFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA2LzE1L2JsYWNrcm9jay1maWxlcy1mb3ItYml0Y29pbi1ldGYtY29pbmJhc2UtYW5kLW5hc2RhcS1saXN0ZWQtYXMtcGFydG5lcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock files to launch Bitcoin ETF with Coinbase and Nasdaq listed as partners - Fortune",
        "content": "In a potential game changer for crypto markets, asset management giant BlackRock is moving to launch an exchange-traded fund for Bitcoin. In an application filed on Thursday, the company sought permission to sell the currency through a vehicle called the iShares Bitcoin Trust.\n\nThe move is significant because of BlackRock’s enormous reach, and because it would allow retail investors to buy Bitcoin as shares of an ETF from an ordinary brokerage account. Likewise, it would make it easier for institutional investors, including pension funds, to hold the asset.\n\nThe ETF application states that Coinbase would be tasked with holding the trust’s underlying Bitcoin as a custodian. It also states that Nasdaq would oversee the pricing data that informed the spot market price—a potentially critical factor since the Securities and Exchange Commission has so far refused to permit a Bitcoin ETF, citing fears of market manipulation.\n\nThe price of Bitcoin, which has been slumping in the face of regulatory pressures and hawkish monetary policy from the Federal Reserve, jumped around 3% on news of the BlackRock application.\n\nWhile it has become increasingly easy to buy Bitcoin in recent years—with everyone from Coinbase to PayPal to Robinhood offering it—there is still no easy way to obtain it in the form of traditional shares. This has proved an impediment for large institutions, which are subject to bylaws that limit what sort of asset they may hold on behalf of their customers.\n\nCurrently, the most popular option to acquire Bitcoin in the form of shares is the Grayscale Bitcoin Trust, which does not trade on a major stock exchange. The Grayscale trust also charges a management fee of around 2% a year, which is viewed as too high by many investors.\n\nBlackRock is hardly the first to seek to offer Bitcoin as an ETF, where fees are typically well under 0.5%. Grayscale and a number of funds have also sought permission, but have been denied by the SEC.\n\nAccording to a source familiar with the BlackRock application, the company believes it will be able to succeed where other applicants have failed, in part because of its pedigree, but also because Nasdaq will be overseeing the pricing data—a situation the person believes will ease concerns about the ETF manager manipulating the asset price on which the ETF is based.\n\nThe SEC last year finally granted permission for a crypto ETF, but only for futures markets—a product that is significantly more complicated than a spot market ETF, and one that is more expensive for investors. Grayscale has sued the agency over this decision, saying it is arbitrary, and based on a recent federal court hearing, analysts have said the company has a good chance to prevail.\n\nThis story was updated with additional details."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzE2L2JsYWNrcm9jay1tYXktaGF2ZS1mb3VuZC13YXktdG8tZ2V0LXNlYy1hcHByb3ZhbC1mb3Itc3BvdC1iaXRjb2luLWV0Zi_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8xNi9ibGFja3JvY2stbWF5LWhhdmUtZm91bmQtd2F5LXRvLWdldC1zZWMtYXBwcm92YWwtZm9yLXNwb3QtYml0Y29pbi1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock May Have Found Way to Get SEC Approval for Spot Bitcoin ETF - CoinDesk",
        "content": "BlackRock May Have Found Way to Get SEC Approval for Spot Bitcoin ETF\n\nThe asset management giant included a surveillance-sharing agreement in its proposal, which could eliminate the risk of market manipulation related to bitcoin."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMTUvYmxhY2tyb2NrLWZpbGVzLWZvci1zcG90LWJpdGNvaW4tZXRmLXdpdGgtY29pbmJhc2UtYXMtYS1jcnlwdG8tY3VzdG9kaWFuLmh0bWzSAXFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNi8xNS9ibGFja3JvY2stZmlsZXMtZm9yLXNwb3QtYml0Y29pbi1ldGYtd2l0aC1jb2luYmFzZS1hcy1hLWNyeXB0by1jdXN0b2RpYW4uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock files for spot bitcoin ETF, with Coinbase as a crypto custodian - CNBC",
        "content": "Asset management giant BlackRock took the first steps Thursday to launch a spot bitcoin exchange-traded fund, which has long been a point of contention between crypto advocates and federal regulators.\n\nThe firm filed an application with the U.S. Securities and Exchange Commission to launch the iShares Bitcoin Trust. If approved, the ETF would allow easy access for investors to get exposure to crypto in a product from one of Wall Street's largest companies.\n\n\"The Shares are intended to constitute a simple means of making an investment similar to an investment in bitcoin rather than by acquiring, holding and trading bitcoin directly on a peer-to-peer or other basis or via a digital asset exchange,\" the filing said.\n\nThe SEC has so far resisted allowing the launch of a spot bitcoin ETF in the U.S. The regulator is currently in a legal battle with Grayscale over whether the firm will be allowed to convert its Grayscale Bitcoin Trust into an ETF. A decision in that case is expected later this year.\n\nSeveral other firms have filed and later pulled applications to launch spot bitcoin funds. If the SEC relents, there could be a flood of those products on the market.\n\nETFs typically take months to launch after an initial filing, if they ever begin trading. The proposed BlackRock fund will likely face heavy resistance from the SEC, and the filing could be pulled before an ETF is ever launched, said Aisha Hunt, principal at asset management law firm Kelley Hunt & Charles.\n\nBlackRock's move comes during a time when crypto prices remain well below their all-time highs and the industry faces increasing scrutiny in Washington, D.C.\n\nThe SEC recently sued Coinbase and Binance for allegedly running unregistered securities exchanges. The SEC also accused Binance of commingling customer funds with its own.\n\nCoinbase is listed as the bitcoin custodian for the proposed BlackRock ETF. BlackRock has an existing strategic partnership with Coinbase. The companies announced last year that Aladdin, BlackRock's institutional investment platform, would be connected to Coinbase Prime for crypto trading and custody.\n\nThe SEC did not immediately respond to CNBC's request for comment on the new filing.\n\nThe entrance of BlackRock into the bitcoin ETF space could be a boost to a sector that has had a rocky start over the past two years.\n\nBitcoin futures ETFs first launched in 2021, but the ProShares Bitcoin Strategy ETF (BITO) is the only one that has grown to a substantial size, with about $800 million in assets. The fund has lost more than 40% on a total return basis since the launch, according to FactSet. The price of bitcoin hit an all-time high shortly after BITO launched and is down more than 60% since its peak."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzQ5OTYzOTE2LTU3MmItNDU5MS04YmI2LTdlZmQwNmVjMDk2MdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock delves deeper into crypto with push for bitcoin ETF - Financial Times",
        "content": "Print this page\n\nBlackRock pushed further into cryptocurrencies on Thursday by filing an application with the US Securities and Exchange Commission to offer a spot bitcoin exchange traded fund.\n\nIf the SEC approves the application, the fund would trade on the Nasdaq stock market, making it the first publicly traded spot bitcoin ETF in the US.\n\nThe $9tn money manager already runs a private spot bitcoin trust that it launched last year. The ETF marks a further expansion of its partnership with embattled crypto exchange Coinbase, which would be the custodian of the fund’s bitcoin.\n\nThe launch of a spot bitcoin ETF by the world’s largest money manager could be a shot in the arm for cryptocurrencies after a run of bad news including the collapse of FTX last year and the SEC’s decision earlier this month to sue both Coinbase and the world’s largest crypto exchange, Binance, alleging securities violations.\n\nBut it is not clear that the SEC will approve BlackRock’s application. It has already turned down several earlier proposals from other asset managers on the grounds that the tokens trade on unregulated exchanges with surveillance and manipulation risks.\n\nThe watchdog is being sued by Grayscale over its refusal to allow the conversion of what was then the world’s largest crypto investment vehicle into a listed ETF. The lawsuit contends that the SEC’s decision was arbitrary, particularly because it has allowed the launch of ETFs based on bitcoin futures.\n\nBlackRock’s move also comes at a time when the SEC has proposed new custody rules that would place additional responsibilities on asset managers to make sure that customer assets are kept in properly segregated accounts.\n\nThe price of bitcoin is down more than 60 per cent from its 2021 peak, but it has also bounced significantly from the lows it hit last year after FTX went bust.\n\n“BlackRock’s increasing engagement shows Bitcoin continues to be an asset of interest for some of the world’s largest financial institutions,” said Sui Chung, CEO of CF Benchmarks, which provides the bitcoin price that BlackRock plans to use.\n\n“An estimated 20 per cent of Americans have now owned bitcoin at some point. BlackRock’s proposed ETF potentially offers the other 80 per cent an option that is altogether more familiar and accessible.”\n\nBlackRock declined to comment beyond the filing. But founder Larry Fink, who was once openly sceptical of cryptocurrencies, wrote in his annual letter to investors in March that “very interesting developments are happening in the digital asset space . . . At BlackRock we continue to explore the digital assets ecosystem.”\n\nAnd during its investor day earlier this week, executives touted the group’s ability to launch new ETFs and offer clients a wide range of asset classes. It currently has more than 1,300 different ETFs."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTE1L2JsYWNrcm9jay10cmllcy1mb3Itc3BvdC1iaXRjb2luLWV0Zi13aXRoLWZyZXNoLXNlYy1maWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock Tries for Spot-Bitcoin ETF With Fresh SEC Filing - Bloomberg",
        "content": "BlackRock Inc. is trying its hand at potentially getting the first spot-Bitcoin exchange-traded fund launched in the US.\n\nThe world’s largest asset manager on Thursday applied for the iShares Bitcoin Trust, according to a filing Bloomberg Terminal with the US Securities and Exchange Commission. Coinbase Global Inc., the biggest crypto exchange in the US, would act as custodian. The ETF, should it launch, would trade on Nasdaq."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LnVzbmV3cy5jb20vbmV3cy90ZWNobm9sb2d5L2FydGljbGVzLzIwMjMtMDYtMTUvYmxhY2tyb2NrLWNsb3NlLXRvLWZpbGluZy1mb3ItYS1iaXRjb2luLWV0Zi1jb2luZGVza9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock Files for Bitcoin ETF in Push Into Crypto - U.S. News & World Report",
        "content": "(Reuters) -BlackRock, the world's biggest asset manager, on Thursday filed for a bitcoin exchange-traded fund (ETF) that would allow investors to get exposure to the cryptocurrency, as the asset class comes under intense regulatory scrutiny.\n\nBlackRock's iShares Bitcoin Trust will use Coinbase Custody as its custodian, according to a filing with the U.S. Securities and Exchange Commission (SEC). The U.S. regulator has yet to approve any applications for spot bitcoin ETFs.\n\nLast year, BlackRock launched a spot bitcoin private trust for institutional clients in the United States.\n\nThe move comes at a time when the global cryptocurrency industry has been caught in the crosshairs of the U.S. securities regulator on alleged violations of securities laws.\n\nEarlier this month, the regulator sued major exchanges Coinbase and Binance in high-profile lawsuits that reverberated through the digital assets industry.\n\n\"The fact that BlackRock, a well-respected and established asset management company, has filed for a Bitcoin ETF could be seen as a positive development in the quest for regulatory approval,\" said Joshua Chu, group chief risk officer at blockchain technology group XBE, Coinllectibles and Marvion.\n\n\"It also shows resilience of the public's interest in crypto.\"\n\nA spot bitcoin ETF would track bitcoin's underlying market price. Proponents say an ETF would give investors exposure to bitcoin without directly buying it.\n\nThe SEC rejected Grayscale Investment LLC’s application last year to convert its flagship spot Grayscale Bitcoin Trust into an ETF.\n\nGrayscale sued the SEC, claiming that the regulator was acting arbitrarily in rejecting applications for spot bitcoin ETFs when it had previously approved bitcoin futures ETFs.\n\nThe SEC has also rejected proposals for spot bitcoin ETFs from firms including Fidelity, Cboe Global Markets and NYDIG.\n\nBitcoin prices closed up 2% on Thursday after the announcement. They were last at $25,506 on Friday. The largest cryptocurrency is up 54% in the year.\n\nPlans for BlackRock's ETF were reported by CoinDesk earlier in the day.\n\n(Reporting by Manya Saini and Niket Nishant in Bengaluru; Ankur Banerjee and Rae Wee in Singapore; Editing by Devika Syamnath and Pooja Desai)"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzE1L2Nhbi1iaXRjb2luLXJlYWNoLTEwMDAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Can Bitcoin Reach $100,000? - The Motley Fool",
        "content": "Thus far in 2023, Bitcoin (CRYPTO: BTC) has been one of the top performing cryptocurrencies, up more than 57%. Bitcoin trades for about $26,000 after briefly breaking through the $30,000 price level earlier this year.\n\nBut Bitcoin is still nowhere near its all-time high of $68,789, which it reached in November 2021. Nonetheless, a growing number of analysts, investors, and crypto enthusiasts still think that Bitcoin will break through the $100,000 level sometime in 2024. While that price trajectory might sound outrageous, there are three compelling reasons it might just happen.\n\nBitcoin as digital gold\n\nThe core argument around Bitcoin is that it functions as \"digital gold,\" making it a good store of value, especially amid volatile economic conditions. Thus, during the banking crisis that kicked off earlier this year, investors looking for a safe-haven asset outside of the traditional banking and financial system turned to Bitcoin. And, indeed, the correlation between Bitcoin and gold has increased in 2023.\n\nIf you buy into the argument that Bitcoin is digital gold, then it's possible to make a number of forward-looking price assumptions. For example, noteworthy Bitcoin investor Michael Saylor first calculated the value of the total physical supply of gold in the world (now about $13 trillion) and then proposed a similar valuation for Bitcoin. If you divide the market cap of gold by the maximum number of Bitcoins that will ever be in circulation (21 million), it is possible to come up with a $500,000 price target for Bitcoin. And Wall Street investment bank Goldman Sachs used roughly the same methodology back in January 2022 to come up with a $100,000 price target for Bitcoin.\n\nInstitutional adoption\n\nOK, but what if you got burned by Bitcoin in 2022 and are still skeptical? Gold, after all, does not lose 65% of its value in one year. Fair enough. There's another route to the magical $100,000 price level, and it involves the long-term growth story around institutional adoption. Bitcoin, after all, is more than just a store of value. It is also a form of payment and a potential replacement for various building blocks of the modern financial system, including the U.S. dollar.\n\nNoted investor Cathie Wood of Ark Invest, for example, has analyzed eight different use cases for Bitcoin in the global economic system. For example, Bitcoin is becoming part of the money supply of emerging market nations. And Bitcoin is also accounting for a larger and larger share of cross-border remittances. By taking a closer look at each of these eight areas, and then extrapolating growth rates going forward, Wood came up with a $1.48 million price target for Bitcoin.\n\nThe Bitcoin halving\n\nFinally, there's one technical event that could influence the price of Bitcoin, known as the halving. This event occurs only once every four years, and is highly anticipated by the Bitcoin community. In a halving event, the reward paid to Bitcoin miners for mining a new block on the blockchain falls by one-half.\n\nThis might not sound like a big deal (unless you happen to be a Bitcoin miner), but it has tremendous consequences for the supply and demand of Bitcoin. For one, it slows the rate of Bitcoin's supply increase over time. Secondly, it increases the relative scarcity of Bitcoin. Theoretically, the combination of these two factors should help to push up the price of Bitcoin.\n\nAnd, indeed, that is what has happened in three previous halving events. In the last halving, which took place in 2020, Bitcoin's price exploded by 688% and eventually neared its all-time high. Well, guess what? The next Bitcoin halving is scheduled for April 2024, and investors are already putting out aggressive price targets north of $100,000 for Bitcoin. For example, Standard Chartered Bank thinks Bitcoin will hit that figure by the end of 2024.\n\nThe path to $100,000\n\nAs can be seen, there are various paths that Bitcoin can take to reach $100,000. Although the price target might sound absurdly high, especially given the current macroeconomic environment, the potential is certainly there. Of course, there are wildcard factors, such as the Securities and Exchange Commission (SEC), which could move to regulate Bitcoin at any moment. And don't forget about the Federal Reserve, which has shown the ability to hammer the price of Bitcoin simply by hiking interest rates.\n\nThat said, I remain bullish on Bitcoin both short-term and long-term. While it is certainly a volatile digital asset, it has a long track record of market-beating performance that dates back nearly a decade. From my perspective, it is no longer a question of if Bitcoin will reach a price of $100,000, but when."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNi8xNi9ibGFja3JvY2tzLWJpdGNvaW4tZXRmLXdvdWxkLWJlLWEtYmlnLWRlYWwv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA2LzE2L2JsYWNrcm9ja3MtYml0Y29pbi1ldGYtd291bGQtYmUtYS1iaWctZGVhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock’s Bitcoin ETF Would Be a Big Deal - CoinDesk",
        "content": "First, exchanges should be a bit fearful. If new investors want price exposure to bitcoin and don’t care about the aspect of it that makes it cool (like using it), then those investors will look to pay as little as possible for that bitcoin. Why would an investor pay a 1% fee at an exchange when they could pay a tiny fraction of that through an ETF when they aren’t interested in actually using bitcoin?"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMTYvY3J5cHRvY3VycmVuY2llcy1jbGltYi10by1lbmQtdGhlLXdlZWstYXMtaW52ZXN0b3JzLWRpZ2VzdC1ibGFja3JvY2tzLWJpdGNvaW4tZXRmLXBsYW5zLmh0bWzSAYABaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDYvMTYvY3J5cHRvY3VycmVuY2llcy1jbGltYi10by1lbmQtdGhlLXdlZWstYXMtaW52ZXN0b3JzLWRpZ2VzdC1ibGFja3JvY2tzLWJpdGNvaW4tZXRmLXBsYW5zLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Cryptocurrencies climb to end the week as investors digest BlackRock's bitcoin ETF plans - CNBC",
        "content": "Bitcoin still closed the week slightly negative, for the second week in a row, by 0.21%. Ether also posted a second consecutive weekly decline. It fell 10.84%. Coin Metrics measures a week in crypto, which trades 24 hours a day, from the 4:00 p.m. ET stock market close one Friday to the next.\n\nEven altcoins rose, with the tokens tied to Solana and Cardano gaining 4.5% and 2%, respectively. Binance Coin was 2.75% higher, litecoin gained 3% and the Uniswap token advanced 4%.\n\nCrypto prices climbed to end the week Friday, a day after the largest asset manager in the world jumped into the race to launch the first spot bitcoin exchange-traded fund in the U.S.\n\nInvestors were weighing the latest development in the crypto industry's battle with the U.S. Securities and Exchange Commission for regulatory recognition and guidance. After the bell Thursday, BlackRock — the largest asset manager in the world — filed for spot bitcoin ETF, with Coinbase as its crypto custodian.\n\n\"One of the big purposes bitcoin serves as an asset class is really diversification. It just has a different risk profile than traditional financial markets,\" Gustavo Schwenkler, associate professor at the Leavey School of Business at Santa Clara University said. \"If this were to get approved, then I could anticipate a lot more institutional investors adding bitcoin to their investment to their portfolios … it would institutionalize the market in a way that is not possible right now.\"\n\nIf allowed to move forward, the iShares Bitcoin Trust would become the first approved ETF in the U.S. to track the price of bitcoin, versus the futures contracts tied to the cryptocurrency. It's been about 10 years since the first filing for a potential spot bitcoin ETF. Since then, every application that has gone through the SEC has been rejected.\n\nThe filing comes about a week after the SEC sued its crypto custody partner, Coinbase, for violating securities laws, leaving many questioning the timing of BlackRock's application.\n\n\"That apparent commitment to Coinbase is almost as important near term as their commitment to bitcoin is in the long term,\" said Mark Connors, head of research at 3iQ. \"It's a big deal.\"\n\n—CNBC's Gina Francolla contributed reporting."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTUvYml0Y29pbi1kaXBzLWJlbG93LTI1MDAwLWFzLWZlZC10YWtlcy1oYXdraXNoLXRvbmUtYWZ0ZXItcGF1c2luZy1pbnRlcmVzdC1yYXRlLWhpa2VzL9IBf2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTUvYml0Y29pbi1kaXBzLWJlbG93LTI1MDAwLWFzLWZlZC10YWtlcy1oYXdraXNoLXRvbmUtYWZ0ZXItcGF1c2luZy1pbnRlcmVzdC1yYXRlLWhpa2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin dips below $25,000 as Fed takes hawkish tone after pausing interest rate hikes - Fortune",
        "content": "The price of the world’s largest cryptocurrency by market capitalization dropped below $25,000 on Wednesday for the first time since March, as the U.S. central bank announced that it would pause increases in interest rates since hiking them up consecutively for more than a year.\n\nThe dip happened dramatically late Wednesday afternoon, according to data from CoinMarketCap, and in roughly an hour, the price of Bitcoin plummeted from approximately $25,868 to about $24,902. As of Thursday morning, the price has stabilized, with one Bitcoin hovering around $24,900, an approximate 4% decline since Wednesday afternoon.\n\nEther, the native cryptocurrency for the Ethereum blockchain and second-largest token by market cap, also dropped from about $1,728 to $1,635, about 5%, per CoinMarketCap. And the total market cap for all cryptocurrencies dropped from about $1.06 trillion to now $1.02 trillion, roughly 4%.\n\n“The biggest reason for [Bitcoin’s] sudden plunge yesterday was likely the Fed, where, despite pausing, it took a more hawkish tone than expected and indicated that more rate hikes are still on the table,” Brian Rudick, a senior strategist at crypto trading firm GSR, told Fortune. “In addition, there’s a lot of uncertainty in the market due to the U.S. regulatory posture.”\n\nRudick noted that Ether dropped before Bitcoin and the market downturn was “ETH-led.”\n\nThe downswing of the cryptocurrency market mirrored the immediate decline of the major stock indexes after the Federal Reserve announced the pause on rate increases. The S&P 500 immediately dropped about 1%. (It then quickly rebounded before markets closed.) The Nasdaq, which is comparatively dominated by the tech stocks that Bitcoin has been previously said to mirror, also had a brief drop and rebound.\n\nThe decline in Bitcoin’s price reflects how the cryptocurrency tends to react quickly to news of the Fed’s decision to increase, decrease, or hold steady interest rates.\n\nIn May, for example, its price rocketed above $29,000 following the Fed’s announcement that it would continue to raise rates. However, Bitcoin has since fallen more than $4,000, an approximate 14% decrease, as the U.S. government has continued to crack down on crypto, including blockbuster lawsuits against Binance and Coinbase, two of the world’s largest crypto exchanges."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzE1L2JsYWNrcm9ja3MtaXNoYXJlcy1maWxlcy1wYXBlcndvcmstZm9yLXNwb3QtYml0Y29pbi1ldGYv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDYvMTUvYmxhY2tyb2Nrcy1pc2hhcmVzLWZpbGVzLXBhcGVyd29yay1mb3Itc3BvdC1iaXRjb2luLWV0Zi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock's iShares Files Paperwork for Spot Bitcoin ETF - CoinDesk",
        "content": "The move comes at a time when crypto industry is reeling from U.S. regulatory crackdown, which recently saw the SEC suing crypto exchange Coinbase and Binance. The market sentiment, following the filing of the ETF application by a TradFi giant, seem to have gotten a slight boost as the price of bitcoin is gained a bit on the news, rising to just shy of $25,600."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMTUvYml0Y29pbi1kcm9wcy1iZWxvdy0yNTAwMC10ZXRoZXJzLXN0YWJsZWNvaW4tZmFsbHMtYmVsb3ctaXRzLWRvbGxhci1wZWcuaHRtbNIBcGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA2LzE1L2JpdGNvaW4tZHJvcHMtYmVsb3ctMjUwMDAtdGV0aGVycy1zdGFibGVjb2luLWZhbGxzLWJlbG93LWl0cy1kb2xsYXItcGVnLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin briefly drops below $25,000, Tether's stablecoin falls under its dollar peg - CNBC",
        "content": "Standard Chartered predicts bitcoin could fall to $5,000 in 2023 as part of its research on potential market surprises next year.\n\nCryptocurrency prices fell after the Federal Reserve's June meeting, with bitcoin falling below $25,000 for the first time since March.\n\nOn Thursday, bitcoin was lower by more than 1% at $25,439.77, according to Coin Metrics. Earlier, it fell as low as $24,766.52. Ether fell more than 3% to $1,667.56.\n\nAltcoins tumbled too. Solana's token was down 2.3%, Polygon's fell 8.3% and Cardano's lost %3.5.\n\nAnd selling pressure weighed on Tether (USDT), which lost its peg to the U.S. dollar on most exchanges Thursday, falling to 99 cents in its biggest drop since November.\n\nBitcoin cut most of its Thursday morning losses in the afternoon as traders mulled the possibility of the first spot bitcoin ETF in the U.S., following a CoinDesk report that BlackRock, the world's largest asset manager, is close to filing an application for a bitcoin ETF. The report was light on detail, however, and didn't specify how it would get exposure — whether by tracking spot bitcoin or bitcoin futures.\n\nThe initial slide began late Wednesday, after the Federal Reserve ended its June meeting and decided to leave interest rates unchanged for now, but said two more may be in store by yearend.\n\nFor cryptocurrencies, \"this has little to do with the FOMC, and more to do with thinner liquidity and weak sentiment,\" said Michael Safai, managing partner at Dexterity Capital. \"Given how thin trading volumes are at the moment, a sizable (but not massive) sell order is enough to set off liquidations.\"\n\n\"Traders are more inclined to keep their money off the table in the midst of this regulatory backlash, especially when it comes to altcoins, so there isn't going to be much new capital flowing in to buoy prices so readily,\" he added."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE1L2JpdGNvaW4tcmVnYWlucy1ncm91bmQtdG8tcmVhY2gtMjUyay1idXQtaW52ZXN0b3JzLXJlbWFpbi1qaXR0ZXJ5LWFib3V0LXVzLWVjb25vbXktbW9uZXRhcnktcG9saWN5L9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE1L2JpdGNvaW4tcmVnYWlucy1ncm91bmQtdG8tcmVhY2gtMjUyay1idXQtaW52ZXN0b3JzLXJlbWFpbi1qaXR0ZXJ5LWFib3V0LXVzLWVjb25vbXktbW9uZXRhcnktcG9saWN5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Regains Ground to Reach $25.2K, but Investors Remain Jittery About U.S. Economy, Monetary Policy - CoinDesk",
        "content": "He sounded a cautious note about rate hike uncertainties, declining economic growth and potential challenges for the banking sector – a toxic combination that could continue to unsettle crypto markets. “It’s not hard to imagine a scenario in which the markets essentially have to get juiced again,” he wrote. “For most market participants, then, the strategy is likely one of survival until the macro turns and during what will inevitably be a volatile half year or so.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1hcy1hLWhlZGdlLWZvci1pbmZsYXRpb24taXMtaXQtc3RpbGwtYS1nb29kLW9wdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin as a Hedge for Inflation – Is It Still a Good Option? - Nasdaq",
        "content": "The financial landscape continues to be redefined by the advent of digital currencies, despite the skepticism of some investors. Among these new-age assets, Bitcoin – the world's leading cryptocurrency – emerges as an intriguing option for those seeking an inflation hedge.\n\nBitcoin's design, characterized by its fixed supply of 21 million coins, safeguards it from the inflationary pressures that traditional currencies succumb to. By nature, Bitcoin cannot undergo dilution through inflation - a compelling factor that makes it enticing to discerning investors. Moreover, the decentralized architecture of Bitcoin disentangles it from any form of manipulation or control by central banks and governments. This intrinsic freedom lends an additional layer of security to investors wary of government interventions.\n\nHowever, the unique design of Bitcoin doesn't guarantee its viability as an inflation hedge in every circumstance. It's crucial to note that the value of Bitcoin is primarily driven by market demand and supply, with no tangible asset backing it up. Thus, the price can be volatile, experiencing dramatic rises and falls over short periods, even more so than traditional investments. For example, between late 2017 and early 2018, Bitcoin's price swung from nearly $20,000 down to just above $3,000. This level of volatility poses a risk for investors who may need to liquidate their holdings in times of market stress.\n\nWhen using Bitcoin as an inflation hedge, one must also consider its relatively short history compared to traditional investment vehicles like gold. With just over a decade in existence, Bitcoin's performance in a diverse range of economic scenarios is not entirely known. Its behavior during inflationary periods, in particular, remains largely untested. Given that inflation tends to occur over long timeframes, Bitcoin's longevity and stability in such conditions are yet to be fully evaluated.\n\nThe regulatory landscape surrounding cryptocurrencies is another critical factor in assessing Bitcoin's feasibility as an inflation hedge. Despite gaining wider acceptance, cryptocurrencies are still subjected to legal and regulatory uncertainties across different jurisdictions. There have been instances where governments, including China and India, have restricted or banned the use of cryptocurrencies, impacting their value and liquidity.\n\nThese factors do not undermine Bitcoin's potential but reflect the complexities and risks that come with investing in it. When considering Bitcoin as a hedge against inflation, it is advisable to incorporate it as part of a diversified portfolio. By spreading investments across a range of asset types, investors can leverage Bitcoin's potential benefits while mitigating its risks.\n\nFurthermore, it's essential to keep in mind that hedging against inflation is a long-term strategy. Therefore, patience and discipline are key. Although Bitcoin's price may experience dramatic fluctuations in the short term, its overall trajectory since inception suggests a positive trend. Yet, investing in Bitcoin should not be based solely on historical performance, but rather, on thorough research and understanding of the asset and the broader cryptocurrency market.\n\nBitcoin has potential as an inflation hedge due to its fixed supply and decentralized nature. However, the inherent volatility, regulatory uncertainties, and relatively short historical record compared to traditional hedges add a level of risk. Thus, a careful, well-researched approach and diversification are crucial when considering Bitcoin as part of an inflation-hedging strategy.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc. and Nasdaq® is a registered trademark of Nasdaq, Inc. The information contained above is provided for informational and educational purposes only, and nothing contained herein should be construed as investment advice, either on behalf of a particular security or an overall investment strategy. Neither Nasdaq, Inc. nor any of its affiliates makes any recommendation to buy or sell any security or any representation about the financial condition of any company. Statements regarding Nasdaq-listed companies or Nasdaq proprietary indexes are not guarantees of future performance. Actual results may differ materially from those expressed or implied. Past performance is not indicative of future results. Investors should undertake their own due diligence and carefully evaluate companies before investing. ADVICE FROM A SECURITIES PROFESSIONAL IS STRONGLY ADVISED. © 2023. Nasdaq, Inc. All Rights Reserved.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTYvYml0Y29pbi1zaG9ydHMtbG9zZS0xNm0tYXMtYmxhY2tyb2NrLWV0Zi1maWxpbmctc3BhcmtzLWJ1bGxpc2gtb3V0bG9vay_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE2L2JpdGNvaW4tc2hvcnRzLWxvc2UtMTZtLWFzLWJsYWNrcm9jay1ldGYtZmlsaW5nLXNwYXJrcy1idWxsaXNoLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Shorts Lose $16M as BlackRock ETF Filing Sparks Bullish Outlook - CoinDesk",
        "content": "As such, the market strength of bitcoin impacted shorts – or bets against the currency – the asset with BTC-tracked futures seeing over $16 million in short liquidations in the past 24 hours. This figure was smaller than usual due to large declines in the past week, causing some traders to risk less capital than they normally would."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzE2L2JsYWNrcm9ja3Mtc3BvdC1iaXRjb2luLWV0Zi1ub3QtdGhlLXNhbWUtYXMtZ3JheXNjYWxlcy1wcm9kdWN0LWV4cGVydHMtc2F5L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzE2L2JsYWNrcm9ja3Mtc3BvdC1iaXRjb2luLWV0Zi1ub3QtdGhlLXNhbWUtYXMtZ3JheXNjYWxlcy1wcm9kdWN0LWV4cGVydHMtc2F5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock’s Spot Bitcoin ETF Not The Same As Grayscale’s Product, Experts Say - CoinDesk",
        "content": "The key distinction is that an ETF for spot bitcoin “would be able to buy bitcoin at the end of the trading day to bring the fund's assets in line with its trading price. A trust does not have the ability to do this,” Joe Consorti, market analyst at The Bitcoin Layer said."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTYvYml0Y29pbi1yZWNyb3NzZXMtMjYzay10by1oaXQtaGlnaGVzdC1sZXZlbC1pbi1hLXdlZWstYW1pZC1ibGFja3JvY2stb3B0aW1pc20v0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8xNi9iaXRjb2luLXJlY3Jvc3Nlcy0yNjNrLXRvLWhpdC1oaWdoZXN0LWxldmVsLWluLWEtd2Vlay1hbWlkLWJsYWNrcm9jay1vcHRpbWlzbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Recrosses $26.3K to Hit Highest Level in a Week Amid BlackRock Optimism - CoinDesk",
        "content": "“The Fed's job is to use monetary policy to achieve its dual mandate, and right now that means raising rates to fight inflation,” Waller said at an economics conference in Norway. “It is the job of bank leaders to deal with interest rate risk, and nearly all bank leaders have done exactly that. I do not support altering the stance of monetary policy over worries of ineffectual management at a few banks.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9pc2hhcmVzLWZpbGVzLWZvci1zcG90LWJpdGNvaW4tZXRmL9IBUGh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvaXNoYXJlcy1maWxlcy1mb3Itc3BvdC1iaXRjb2luLWV0Zi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "iShares Files For Spot Bitcoin ETF - ETF Trends",
        "content": "BlackRock’s iShares arm on Thursday filed for an ETF that will hold physical bitcoin. Numerous issuers have thrown their hat into the same ring, and none succeeded in launching a product. However, given its status in the ETF industry at a global level, if successful, BlackRock has the potential to dominate the space, even if it doesn’t achieve first-to-market status.\n\n“The SEC has been consistently against spot-based bitcoin ETFs trading. They have concerns about fraud and manipulation. However, if a product were to go to market, it would be a huge success given BlackRock’s industry leadership and connections with advisors,” said VettaFi Head of Research Todd Rosenbluth.\n\nA Long Wait\n\nCertainly, the wait for a physical Bitcoin ETF has been long and tumultuous. More than a decade ago, Cameron and Tyler Winklevoss filed with the SEC to launch the Winklevoss Bitcoin Trust. It has been a long line of rejections ever since.\n\nFirms like Fidelity, WisdomTree, and VanEck have all seen their applications to launch such a product go nowhere. And Grayscale is currently suing the SEC to be allowed to convert its $15.9 billion Grayscale Bitcoin Trust into an ETF. The firm argues that the fund’s large discount would disappear if it could do so, benefiting its investors.\n\nIn October 2021, ProShares scored a major victory when the SEC approved its ProShares Bitcoin Strategy ETF (BITO), the first ETF to invest in bitcoin futures. For many investors, that was the next best thing to a physical Bitcoin ETF. The fund quickly accumulated $1 billion in assets under management over the course of a couple of days. That said, nearly two years later, that amount has fallen to $823.2 million. The cryptocurrency currently trades well off the highs that it reached in 2021.\n\nThe SEC has long maintained that cryptocurrencies could be subject to manipulation and that there are not enough protections for investors. SEC Chair Gary Gensler has been adamant that those issues must be addressed for the SEC to approve a physical Bitcoin ETF. But BlackRock is the largest asset manager in the world and could mount a compelling campaign for approval."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTYvZmlyc3QtbW92ZXItYW1lcmljYXMtYmxhY2tyb2NrLWZpbGVzLWZvci1hLXNwb3QtYml0Y29pbi1ldGYv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8xNi9maXJzdC1tb3Zlci1hbWVyaWNhcy1ibGFja3JvY2stZmlsZXMtZm9yLWEtc3BvdC1iaXRjb2luLWV0Zi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "First Mover Americas: BlackRock Files for a Spot Bitcoin ETF - CoinDesk",
        "content": "Binance, the world’s largest cryptocurrency exchange, is leaving the Netherlands, after failing to persuade the Dutch regulator to issue a virtual asset service provider (VASP) license, which attests that it meets anti-money laundering (AML) guidelines. As of July 17, Dutch residents will only be able to withdraw their funds from the platform, according to a statement from the exchange. “We regret to announce that Binance is leaving the Dutch market,” Binance said on its website. “This unfortunately means that no new users residing in the Netherlands will be accepted as of today … No further purchases, trades or deposits will be possible. We encourage those users to take appropriate action by withdrawing assets from their accounts.”"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvYmxhY2tyb2NrLWZpbGVzLWZvci1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock files for bitcoin ETF - ETF Stream",
        "content": "BlackRock, the world’s largest exchange-traded fund issuer, is seeking permission from a US regulator to offer a bitcoin ETF in partnership with the cryptocurrency exchange Coinbase Global.\n\nBlackRock, also the world’s largest asset manager, filed Thursday with the Securities and Exchange Commission (SEC) to launch a fund tracking the price of bitcoin, which is currently not permitted by the agency.\n\nThe fund, titled the iShares Bitcoin Trust, will store bitcoin with Coinbase’s Custody Trust unit.\n\nBlackRock’s filing comes as the SEC blocked similar efforts to launch so-called spot bitcoin ETFs. Grayscale Investments has sued the SEC as the crypto investment firm seeks to convert its bitcoin trust into the first spot bitcoin ETF listed in the U.S.\n\nThe SEC is increasingly cracking down on crypto platforms and brokers, including Coinbase.\n\nThe regulator earlier this month sued Coinbase, the largest US crypto platform, and Binance, the world’s largest crypto exchange, leveling a variety of charges including operating as an unregistered securities exchange.\n\n“This is [a] shocker,” Bloomberg senior ETF analyst Eric Balchunas said in a tweet. “There's been no signs at all [the] SEC [is] willing to approve, but BlackRock is [a] very connected co[mpany] so maybe they know something?”\n\nA handful of bitcoin ETFs currently trade, and several more companies have sought permission to offer them this year, although spot bitcoin ETFs are not permitted.\n\nBlackRock currently operates an ETF that invests in bitcoin’s supporting technology, the iShares Blockchain Technology UCITS ETF (BLKC), which soared 75% this year.\n\nDespite the lawsuits, crypto and blockchain ETFs have been among the best-performing funds this year. The Global X Blockchain UCITS ETF (BKCH) has risen by 71.4% since the year began.\n\nNew York-based BlackRock currently employs Coinbase to provide institutional clients of its Aladdin investment management platform, with services including crypto trading and storage, under terms of a deal announced in August.\n\nThis article was originally published on ETF.com"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTUvZmlyc3QtbW92ZXItYW1lcmljYXMtYnRjLWJpdGNvaW4tdHVtYmxlcy1iZWxvdy0yNWsv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8xNS9maXJzdC1tb3Zlci1hbWVyaWNhcy1idGMtYml0Y29pbi10dW1ibGVzLWJlbG93LTI1ay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Tumbles Below $25K - CoinDesk",
        "content": "Paying interest on or surcharges for using a digital euro would be banned under a draft law seen by CoinDesk, and set to be proposed by the European Commission on June 28. The proposed central bank digital currency (CBDC) would have to be available for cash-style offline payments from day one, and users shouldn’t be able to program it to limit onward use, the leaked bill said. “The digital euro shall be available for both online and offline digital euro payment transactions as of the first issuance of the digital euro,” said the text viewed by CoinDesk. The level of privacy for offline, face-to-face use should be “comparable” to withdrawing banknotes at an ATM, it said."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmRhbGxhc2NvbGxlZ2UuZWR1L25ld3MvcGFnZXMvbmV3c2l0ZW0uYXNweD9BcnRpY2xlSWQ9MjI50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Dallas College and Texas Blockchain Council Join Forces To Offer Certificate in Blockchain Technology and ... - Dallas College",
        "content": "Media Contact: Debra Dennis; DDennis@DallasCollege.edu\n\nFor immediate release — June 15, 2023\n\n(DALLAS) — Dallas College and the Texas Blockchain Council (TBC) have announced a partnership that will make the college a leading innovator in technology education for the digital economy while encouraging students to seek careers in blockchain and cryptocurrency fields. The collaboration emphasizes hands-on learning and will allow participating students a chance to earn a new Blockchain and Cryptocurrency Advanced Technical Certificate through Dallas College.\n\n“Our collaboration with the Texas Blockchain Council positions Dallas College as a leader in technology education for the digital economy,” said Dallas College Chancellor Justin Lonon. “Dallas College has always been committed to providing our students with the most relevant and valuable educational experiences. This unique partnership with the TBC will allow us to stay at the forefront of technological innovation and prepare our students for the digital economy.”\n\nThe partnership comes at a time when Texas is becoming a leader in bitcoin mining. Under the partnership, Dallas College will also host a unique bitcoin miner installation at Richland Campus.\n\nSteve Kinard, director of bitcoin mining for the Texas Blockchain Council, said, “Our collaboration with Dallas College isn’t just about installing a bitcoin miner; it’s about creating an environment where students can immerse themselves in cutting-edge technology. The digital economy demands a workforce with a deep understanding of high-performance computing and blockchain concepts, and we’re here to ensure that Dallas College students are ready to meet that demand.”\n\nAs the future of the economy shifts towards digitalization, Dallas College is stepping up to ensure its students are prepared for the technological changes that are revolutionizing industries worldwide and working alongside industry partners.\n\nThe installation of a bitcoin miner at Richland Campus allows students to gain firsthand experience with the technology that powers the world’s first and largest cryptocurrency. Key technical supporters of the initiative include Luxor Technologies and Bentaus Mining. The Texas Blockchain Council donated the hardware at no cost to Dallas College. And 100% of the bitcoin proceeds from the operation will go to Dallas College Foundation to support its mission.\n\n“It is exciting to team up with Dallas College and the Texas Blockchain Council to continue to bring education and awareness of how bitcoin really works,” said Bob Davidoff, founder of Bentaus Mining. “It all starts at the academic level to provide real information regarding the technologies of the future.”\n\nEthan Vera, COO of Luxor Technologies, said, “Dallas College is leading the way when it comes to forward-thinking adoption of bitcoin mining and the benefits it brings to the Texas grid and society. Luxor is pleased to support this institution with our full suite of software products.”\n\nThe mining installation is being facilitated through a relationship with Coinbase Institutional. Anthony Basili, head of asset allocators for Coinbase Institutional, said, “Coinbase is a global leader in providing trusted and compliant access to digital assets and custody solutions. I am proud to be able to support this initiative and see my hometown of Dallas leading the way.”\n\nThe Blockchain and Cryptocurrency Advanced Technical Certificate is available at all seven Dallas College campuses. For more information, visit the Blockchain Certificate webpage.\n\n# # #"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMTUvamFjay1kb3JzZXktYmFja2VkLWJpdGNvaW4td2FsbGV0LWJpdGtleS10by1pbnRlZ3JhdGUtd2l0aC1jb2luYmFzZS1hbmQtY2FzaC1hcHAv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8xNS9qYWNrLWRvcnNleS1iYWNrZWQtYml0Y29pbi13YWxsZXQtYml0a2V5LXRvLWludGVncmF0ZS13aXRoLWNvaW5iYXNlLWFuZC1jYXNoLWFwcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Jack Dorsey-Backed Bitcoin Wallet Bitkey to Integrate With Coinbase and Cash App - CoinDesk",
        "content": "Coinbase is the largest cryptocurrency exchange in the U.S. by trading volume and Cash App is Block’s own financial services platform that offers payments, stocks and bitcoin in a single app. With the new integrations, Bitkey users will be able to buy and sell bitcoin (BTC) via Cash App and Coinbase directly from within the wallet’s app."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stYml0Y29pbi1ldGYtdHJ1c3QtZ29vZC1vci1iYWQtZm9yLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock's Bitcoin ETF 'is the best thing to happen' to BTC, or is it? - Cointelegraph",
        "content": "BlackRock’s latest filing for a spot Bitcoin (BTC) trust will drive investors’ confidence in Bitcoin and may even be “the best thing that could happen” to BTC, according to some crypto industry observers — but others warn of a hidden cost.\n\nDuring an interview on June 16, Galaxy Digital CEO Mike Novogratz said the approval of BlackRock’s ETF application would be “the best thing that could happen to $BTC.”\n\n“I say a Hail Mary every night that Larry Fink and @blackrock pull off a @bitcoin ETF,\" Novogratz said on the Fox News segment, according to a tweet by host Liz Claman.\n\nFun being on @LizClaman show!! And yes, @BlackRock getting a $BTC ETF through would be the best thing that could happen to $BTC. https://t.co/2fFBeB9eyo — Mike Novogratz (@novogratz) June 16, 2023\n\nMeanwhile, cryptocurrency analyst James Edwards of Finder.com — a financial product comparison website — told Cointelegraph that the timing of BlackRock’s filing should provide “confidence” in both Bitcoin as an asset and also Coinbase in its upcoming legal battle fight with the SEC:\n\n“BlackRock’s willingness to press on with a Bitcoin ETF at a time when the SEC is on a warpath against crypto is very telling. It shows confidence in Bitcoin’s status as a commodity — rather than a security,” he said, adding:\n\n“It’s unlikely that BlackRock would push forward with an ETF of this nature without serious consultation with regulators and confidence in Bitcoin's future legal status.”\n\nBlackRock’s intention to use Coinbase Custody to control funds should also be seen as a massive confidence booster for Coinbase as it prepares its legal defense, Edwards explained.\n\nHe added that BlackRock — the world’s largest asset manager — likely wouldn’t partner with Coinbase had they not been “confident” in Coinbase’s legal position.\n\nThe downside\n\nOthers argue that the traditional investment giant's latest moves undermine the \"ethos\" of decentralized cryptocurrencies, or, that the company may find a way to profit from retail investors.\n\nInvestor Scott Melker explained in a June 16 interview that such an approval would be a disservice to crypto-native innovators who built the industry:\n\n“As good as this may be for institutional adoption of the space, it kind of violates the ethos, it is a bit of a dishonest push away from the people who built the industry in the United States.”\n\nCinneamhain Ventures partner and Ethereum bull Adam Cochran believes that BlackRock will swoop in on the “discounted coins” of retail investors, a theory also shared by Melker.\n\nBlackrock ETF… https://t.co/3g77QNdAun — The Wolf Of All Streets (@scottmelker) June 15, 2023\n\nSteven Lubka, a managing director at Swan Bitcoin, shared a similar view, predicting that BTC will reach $1 million, but few retail investors would reap the rewards because the bulk of BTC will be owned by BlackRock, Goldman Sachs and other ETF issuers.\n\nMelker added that Wall Street firms will continue to move into the space and that U.S. regulators will likely “choose them” over incumbent platforms.\n\nRelated: Bitcoin ETFs: A beginner's guide to exchange-traded funds\n\nARK Invest, Grayscale, Fidelity, Galaxy Digital, VanEck, Valkyrie Investments, NYDIG, SkyBridge and WisdomTree are among the other investment firms that have applied to the SEC for similar Bitcoin and cryptocurrency ETFs.\n\nSince the news was first reported, the price of BTC has increased 2.2% to $25,584 at the time of writing.\n\nInterestingly, the Fear & Greed Crypto Index increased from 41 to 47 — leaving the fear zone — following the news of BlackRock’s filing.\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LnNhbnRhbmRlci5jb20vZW4vc3Rvcmllcy9saWdodG5pbmctbmV0d29yay1ibG9ja2NoYWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "The Lightning Network: introduction to layer 2 solutions - Santander",
        "content": "A decentralised system to process high volumes of instantaneous micropayments and provides a solution to the scalability problem as it can support millions of transactions per second.\n\nA criticism related to Bitcoin is its inability to execute a high volume of transactions in a short time frame. Given that a block is added to the Bitcoin network every ten minutes and that the block size is limited, Bitcoin is only able to execute 5–7 transactions per second, whereas VISA executes more than 20,000 in the same time frame. The Lightning Network however is a solution to this problem.\n\nThe Lightning Network protocol was introduced by Joseph Poon and Thaddeus Dryja in a paper published in January 2016, and pointed to this protocol as the solution to Bitcoin's scalability problem. The Lightning Network is a Layer 2 communication and payment protocol built on Bitcoin blockchain. In other words, the Lightning Network is a decentralised network for high volumes of instantaneous micropayments, which would allow the user to make immediate transactions with very low fees. The solution allows transactions to be processed off-chain, taking the load off the main network and improving network scalability.\n\nFor example, Bitcoin adds transactions to blocks spaced approximately every ten minutes. Moreover, as blockchain networks gain popularity, the number of transactions is growing exponentially, which means an increase in demand for space in each block, thus driving up transaction costs. This issue of time and cost means that Bitcoin blockchain is essentially unviable for micropayments. Imagine waiting ten minutes at a coffee shop counter to confirm your coffee purchase.\n\nThe Lightning Network resolves these issues. Payments on this network do not require block confirmations and are therefore instantaneous. It also allows payments for small amounts, with much lower fees compared to those using blockchain validation. Another major advantage of this network is its scalability – as it can support millions of transactions per second. Ultimately, this network eliminates the risk of delegating custody to third parties.\n\nThe Lightning Network works somewhat differently to the blockchain network and operates through payment channels. Parties open a payment channel between each other by sending funds in an initial transaction to a multi-signature address, which is managed by both involved parties and requires the signatures of both these parties to create new transactions. This initial transaction is then propagated to blockchain and the channel is left open. To pay each other, the parties create transactions from the multi-signature address. Once all transactions still pending in the chain have finalised, off-chain transactions can then be performed. When the channel closes, the final balance is recorded in the blockchain.\n\nToday, several companies are at the forefront of Lightning Network development. Blockstream, Lightning Labs and Acinq are just some examples of startups offering their own Lightning Network solution in order to issue their own digital assets through their network and instantly execute cryptocurrency transactions.\n\nNot only are there new companies offering this service – increasingly more companies, which we could catalogue as traditional, are jumping on the bandwagon to implement their own payment systems. Here are some examples:\n\nShopify, an e-commerce company, has an agreement with Strike to receive payments (via the Lightning Network) in bitcoin, as well as US dollars, from customers around the world. They hope to use this technology to lower fees and streamline international transfers.\n\nMcDonald’s (a fast-food franchise) now accepts bitcoin in El Salvador through the Lightning Network. This has all been possible thanks to Stripe's association with Shopify, NCR and Blackhawk. As payments over Lightning Networks continue to grow, it is expected that more and more shops will accept bitcoin (BTC) micropayments.\n\nAt the sovereign level, El Salvador's use of the Lightning Network for remittances was one of the main reasons why the country incorporated Bitcoin as legal tender. Remittances are an important component of El Salvador's GDP, so the country wants to lower costs for receiving such payments.\n\nThis technology, however, has its disadvantages, namely:\n\nPayments can only be made to users who are connected to a payment channel, i.e., the user must be active and connected to the channel. By contrast, traditional cryptocurrency transactions are not affected by this limitation. The Lightning Network is a protocol that is still constantly developing. The fact that even its creators don't recommend using Lightning for transactions involving large sums of money is testament to this. The protocol limits the channel's liquidity for all cryptocurrencies supported by all parties. This is another situation that undermines high-value transactions, as it makes users to have to split their funds in order to have liquidity on normal blockchain and Lightning Networks.\n\nTo summarise, Lightning Networks pose a solution to a problem that not only affects the Bitcoin network (scalability), but also other cryptocurrencies and, what's more, it even has the potential to streamline and reduce costs for fiat-currency payments."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTUvYml0Y29pbi1oYWx2aW5nLWhpc3RvcnktcHJvdmlkZXMtbGl0dGxlLWd1aWRhbmNlLW9uLW91dGNvbWUtY29pbmJhc2Uv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8xNS9iaXRjb2luLWhhbHZpbmctaGlzdG9yeS1wcm92aWRlcy1saXR0bGUtZ3VpZGFuY2Utb24tb3V0Y29tZS1jb2luYmFzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Halving History Provides Little Guidance on Outcome: Coinbase - CoinDesk",
        "content": "Still, with only three recorded halving events in the past, evidence of how markets react is limited, the note added. It is difficult to see a clear pattern, particularly as the events were “contaminated by factors like global liquidity measures,” the report said."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTYvZ2J0Yy1kaXNjb3VudC1uYXJyb3dzLWFmdGVyLWJsYWNrcm9ja3MtZmlsaW5nLWZvci1zcG90LWJpdGNvaW4tZXRmL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTYvZ2J0Yy1kaXNjb3VudC1uYXJyb3dzLWFmdGVyLWJsYWNrcm9ja3MtZmlsaW5nLWZvci1zcG90LWJpdGNvaW4tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "GBTC Discount Narrows After BlackRock’s Filing for Spot Bitcoin ETF - CoinDesk",
        "content": "Grayscale – a subsidiary of Digital Currency Group, CoinDesk's parent company – is currently in a legal standoff with the SEC, after the firm appealed the agency’s decision to deny converting its closed-end GBTC fund into an ETF. The so-called “GBTC discount” developed because the fund doesn’t allow redemptions, so investors can only sell their shares on secondary markets."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWluLWN1YmEtaW50ZXJ2aWV3LWJ0Yy1hZHZvY2F0ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin in Cuba: Why some Cubans are adopting BTC to escape 'The Matrix' - Cointelegraph",
        "content": "Bitcoin adoption could swell in Cuba, particularly if private businesses understand the upside to accepting Bitcoin (BTC) as currency. That’s according to a Cuban businessperson and Bitcoin advocate, Erich Garcia Cruz.\n\nA recent emigrant to the United States, Cruz is a vocal proponent of Bitcoin adoption in Cuba. Cruz leads the remittance and money transfer services BitRemesas and QvaPay, and has been outspoken in supporting Cuban citizens using Bitcoin since 2020.\n\nIn an interview with Cointelegraph as part of an upcoming documentary, Cruz explained that Cubans can use Bitcoin “as a tool.”\n\nPhoto of Erich and Joe during the interview. Source: Cointelegraph\n\nWhile some Cubans use Bitcoin as a store of value, a means of exchange or a remittance tool, ultimately, it’s about getting “out from the Matrix,” he explained. Cruz referred to the country’s centrally planned and officially communist economy.\n\nCuba has no independent press, while the historic United States trade embargo makes it very hard for Cubans to access U.S. products, services and even applications. Bitcoin, on the other hand, is money independent of the state, and has no leader or central party.\n\nCruz explained that during a visit to El Salvador in 2022, one of his friends asked, “How do you teach about Bitcoin in Cuba if Cuba is run by a communist party?” Surely the party would be against Bitcoin?\n\n“I don’t know if the government doesn’t know just how powerful Bitcoin is; they don’t know, and they are just thinking I’m teaching the people about coins in the casino, or if they are afraid of the hyper-Bitcoinization of the Cuban society.”\n\nCruz hints that the government may already understand how Bitcoin works, and maybe, “They can bypass some sanctions worldwide” using internet-based money.\n\nAdditionally, since 2021, the government has been warming up to cryptocurrencies, as private businesses can legally accept cryptocurrencies such as Bitcoin for goods and services. Cruz explains that more and more private companies should accept cryptocurrency instead of the Cuban peso (CUP) or moneda libremente convertible (MLC) — freely convertible currency:\n\n“If you get paid with CUP or MLC, you are solving the customer’s problem, but you are creating a problem for you because owners are saying that then or later they will try to convert the CLP or MLC into international currency.”\n\nThe Cuban peso has devalued by more than 800% since its inception. If a Cuban bought Bitcoin at its all-time high of $69,000, they would still have more value in Bitcoin than pesos. Moreover, the MLC is a government-backed stablecoin used for purchases in state-run supermarkets. Cubans looking to save money typically do so in the U.S. dollar and, increasingly, Bitcoin.\n\nMLC price movement as compared to U.S. dollars and euros since 2015.\n\nCruz shares the example of his father, who bought a small amount of Bitcoin with his Cuban peso pension fund three years ago. The pension fund has dramatically lost value as the Cuban peso continues to devalue, while Bitcoin has not only retained but increased in purchasing power:\n\n“It’s not financial advice, but it’s better to store your value in Bitcoin than the CUP — a government-issued shitcoin.”\n\nNonetheless, despite the huge currency devaluation, Bitcoin suffers from a bad reputation in Cuba. Cruz was scammed by a crypto project before learning what Bitcoin is:\n\n“We have no internet [in Cuba] until five years ago, and Bitcoin is 14 years old. The first contact with Bitcoin in our society was through scams.”\n\nCuba has a highly educated population and university education is free; however, the island is sheltered from Western influences, and the internet is a relatively new tool. The internet, as Cruz points out, only began to penetrate the country in a meaningful way over the past five years.\n\nRelated: Cuba Bitcoin community hosts BTC-only meetup\n\nCruz’s work, and that of the Cuban Bitcoin community, targets private businesses in Cuba, making it an area in which Bitcoin adoption could thrive:\n\n“You have to teach the people who have the power to embrace that solution. And that’s the private sector. Okay? There is no law. There is no law that forbids the business from accepting Bitcoin. Not yet.”\n\nCruz’s interview will feature in an upcoming documentary about Bitcoin in Cuba.\n\nMagazine: Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItY3J5cHRvLXhycC1yaXBwbGUtc29sYW5hLWNhcmRhbm8tZmVkL9IBTGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItY3J5cHRvLXhycC1yaXBwbGUtc29sYW5hLWNhcmRhbm8tZmVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether, top 10 crypto in red, Fed warning of more rate hikes - Forkast News",
        "content": "Bitcoin fell in Thursday morning trading in Asia, dropping below US$25,000 at one stage for the first time since mid-March. Ether also retreated with other top 10 non-stablecoin cryptocurrencies as trading volumes dipped and the U.S. Fed left interest rates unchanged as expected, but warned of more hikes this year to tackle inflation. Ripple’s XRP token fell despite the release of documents this week that were expected to help the company’s defense in an SEC lawsuit.\n\nCrypto in red\n\nBitcoin fell 2.94% over the last 24 hours to US$25,062.60 at 6:30 a.m. in Hong Kong, losing 4.69% in the last week, according to CoinMarketCap data. The world’s largest cryptocurrency, with a market capitalization of about US$490 billion, dipped below the US$25,000 support line to as low as US$24,902 earlier in the morning.\n\nEther fell 4.74% to US$1,652.25, posting a 9.70% loss for the week. All other top 10 non-stablecoin cryptocurrencies fell, according to CoinMarketCap.\n\nCardano dropped 4.10% to US$0.2624, losing 18.57% of its value in the past seven days. Solana fell 3.18% to US$14.44 and posted a weekly loss of 22.52%.\n\nThe two tokens have been on a downtrend since being named in the SEC’s lawsuit filed last week against the Binance.US and Coinbase exchanges, where the federal agency categorized the two — along with many other altcoins — as financial securities.\n\nBenjamin Stani, the director of business development and sales at crypto trading platform Matrixport, said the declines are mostly the overhang from the SEC suing Binance and Coinbase.\n\n“It’s been predominantly the altcoins that have been dropping,” said Stani. “BTC and, to some extent, ETH as well have been holding up better and that I think is mostly attributable to the fact that the SEC named a lot of [altcoins] as securities and that has this chilling effect.”\n\nThe U.S. Federal Reserve left interest rates unchanged as expected on Wednesday at 5% to 5.25% after ten consecutive hikes to curb inflation.\n\nBut in another negative for investors, Fed chair Jerome Powell said it may take years to get inflation under control, dousing expectations for rate cuts later this year and raising the likelihood of higher interest rates ahead. Stocks ended mixed.\n\nRipple’s XRP token led the losers in the crypto top 10 by market capitalization, falling 7.48% to US$0.4793 on the day for a weekly loss of 7.19%.\n\nThe declines came despite the release of the so-called “Hinman documents,” this week, a collection of previously sealed emails and pages from former U.S. Securities and Exchange Commission director William Hinman. The notes indicate that Ether should not be categorized as a financial security.\n\nRipple Labs Inc. was sued by the SEC in December 2020 on allegations XRP was sold as an illegal unregistered security. Ripple wanted the Hinman documents made public, arguing they show the SEC itself was sending mixed and confused signals over whether cryptocurrencies were securities and failing to offer clear guidance to the industry, which is part of Ripple’s fair notice defense in the case.\n\nHowever, XRP’s price hasn’t benefited from the release of the documents. Gabriel Shapiro, a U.S.-based attorney and the general counsel at blockchain firm Delphi Labs, wrote on Twitter Tuesday — “​​Hinman emails are a nothingburger though great for Ether. No idea why Ripple thinks these emails help Ripple’s case.”\n\nShapiro added that the documents were not the bombshell compared to the “huge hype” given to them.\n\nThe total cryptocurrency market cap lost 2.76% to US$1.02 trillion in the last 24 hours, and the daily crypto trading volume fell 5.37% to US$31.89 billion, according to CoinMarketCap data.\n\nNFT on downtrend\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index lost 0.86% to 2,912.74 in the 24 hours to 7:30 a.m. in Hong Kong. The index is down 10.64% for the week.\n\nTotal NFT transactions rose 0.13% to US$23.7 million, while sales on Ethereum, the leading blockchain by volume, fell 4.78% over the last 24 hours to US$13.52 million, according to CryptoSlam data.\n\nThe Bitcoin network was the second largest NFT network in terms of transactions, rising 6.95% to US$4.1 million in the last 24 hours.\n\nThe recent buzz in the NFT community is around ERC-6551, according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News. ERC-6551 is the latest NFT standard for the Ethereum network that went into effect on May 7 this year.\n\n“ERC-6551 is introducing a standard for NFTs by unlocking their ability to be a smart wallet that can interact with different decentralized apps in the Ethereum ecosystem,” Petscher explained. “With ERC-6551, when you transfer an NFT, the wallet and the tokens that the NFT holds also goes with it. Basically wallets within wallets.”\n\nAbout 196 million of Blur tokens worth around US$62 million, 40% of the circulating supply, are being unlocked and distributed to investors and contributors on Wednesday, U.S. time. Blur is the native utility and governance tokens of the Blur NFT marketplace.\n\n“[This] will almost definitely cause a crash in price, which will impact NFT prices,” Petscher said. “Basically, if the token is devalued, will people still want to farm for it via trading NFTs?”\n\nTransactions of Uncategorized Ordinals — unique digital assets on the Bitcoin network that are not identified as part of one established collection — topped sales by collection, selling US$3.14 million in the last 24 hours.\n\nEthereum-based BoringPunks marked second with US$1.63 million in sales, with over 20,000 transactions in the past day.\n\nU.S. equity futures edge down\n\nImage: Envato Elements\n\nU.S. stock futures edged down as of 11:00 a.m. in Hong Kong after a mixed regular trading day on Wednesday. Dow Jones Industrial Average futures fell 0.09%, S&P 500 futures edged 0.06% lower and Nasdaq Futures lost 0.09%.\n\nThe U.S. central bank left interest rates unchanged at 5% to 5.25% after its meeting on Wednesday. The rate is at its highest since 2006 after ten consecutive hikes that started in March 2022 to slow the pace of inflation that surged to 40-year highs at one stage last year.\n\nHowever, post-meeting comments from Powell hinted at two more rate hikes by the end of this year, while stating that rate cuts will not happen unless inflation is under control. That didn’t go down well with some business leaders.\n\n“The battle against inflation is being won. This is now the time for the Fed to stop – not pause – interest rate hikes,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an email statement.\n\n“The time lag for monetary policies is notoriously long — it typically takes about 18 months to two years for the full effect of rate hikes to filter fully into the economy,” Green said, adding that excessive rate hikes could lead to a recession in the U.S.\n\nThe next Federal Open Market Committee meeting is scheduled for July 25 to 26.\n\nThe CME FedWatch Tool predicts a 30.6% chance the Fed will leave rates as is at July’s meeting, while 69.4% says the Fed will raise interest rates by 25 basis points.\n\n(Updates with equities section)"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8xNS9iaXRjb2luLWZyaWVuZGx5LW1pYW1pLW1heW9yLWZyYW5jaXMtc3VhcmV6LWp1bXBzLWludG8tcHJlc2lkZW50aWFsLXJhY2Uv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA2LzE1L2JpdGNvaW4tZnJpZW5kbHktbWlhbWktbWF5b3ItZnJhbmNpcy1zdWFyZXotanVtcHMtaW50by1wcmVzaWRlbnRpYWwtcmFjZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Friendly Miami Mayor Francis Suarez Jumps Into Presidential Race - CoinDesk",
        "content": "In a 2022 CoinDesk interview, Suarez said that despite MIA's struggles, he remained a believer in crypto. \"People ask me the same thing about bitcoin, the fact that it's lost more than 50% of its value, but that doesn't change my feelings about the fundamental technology,\" Suarez said."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JsYWNrcm9jay1jbG91dC1iaXRjb2luLWV0Zi1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Is BlackRock's clout enough to get its bitcoin ETF past the SEC? - Blockworks",
        "content": "Asset management BlackRock has a strong record in getting its products approved.\n\nIssuers seeking to launch a spot bitcoin ETF in the US have a terrible one.\n\nSuch a fund has never been permitted, as the SEC has cited fraud and manipulation in the underlying spot market among its concerns.\n\nDavid Hirsch, chief of the SEC enforcement division’s crypto assets and cyber unit, said at a crypto conference Wednesday “there has not been an adequate system of surveillance” in the spot bitcoin market comparable to trading on a registered exchange.\n\nStill, BlackRock proposed the launch of an iShares Bitcoin Trust Thursday, an ETF that would tap Coinbase as its bitcoin custodian.\n\nThe firm’s decision to seek the launch of a spot bitcoin ETF could signal that BlackRock saw a window for approval, some industry watchers said, while others believe it could simply reflect wishful thinking.\n\nA BlackRock spokesperson declined to comment “due to regulatory filing restrictions.”\n\nBloomberg Intelligence analysts James Seyffart and Eric Balchunas said in a research note that BlackRock’s record for ETF application approvals stands at roughly 575-1. The one denial was for a nontransparent ETF in 2014 — a controversial structure at the time that, unlike traditional ETFs, don’t disclose their holdings daily.\n\n“We’ve been pessimistic about the potential for a spot bitcoin ETF launch with Gary Gensler at the SEC’s helm, but BlackRock likely didn’t make the decision lightly and is used to working with regulators,” Seyffart and Balchunas wrote.\n\nThe next step after the registration statement is a 19b-4 filing, which would start the approval-seeking process. That filing, which begins a 240-day clock for the SEC to approve the product (or not) could come in the next few weeks, the Bloomberg Intelligence analysts said.\n\nBig name’s involvement a ‘game-changer’\n\nThe filing comes amid the SEC’s apparent crackdown on the crypto industry.\n\nLast week, the agency took legal action by initiating lawsuits against Binance and Coinbase, bringing various charges that included alleged unregistered securities violations.\n\nBut Nate Geraci, president of the ETF Store, called the filing a potential “game-changer,” noting there isn’t another asset manager in the world as well-connected to government officials and regulators as BlackRock.\n\n“The fact that BlackRock is filing now speaks volumes,” Geraci told Blockworks. “BlackRock typically isn’t in the business of making unforced errors, and betting on a spot bitcoin ETF if they weren’t confident in approval seems like an unnecessary gamble.”\n\nProponents of spot bitcoin ETFs have said the SEC allowing crypto investments in a regulated way would protect investors who may try to invest in crypto outside the fund wrapper — an arena daunting to many, particularly after the collapse of crypto exchange FTX.\n\nAccording to a statement from Matt Zhang, the founder and managing partner of crypto investment firm Hivemind, the approval of BlackRock’s proposed spot bitcoin ETF would provide institutional investors with a proper way to get bitcoin exposure through a household name.\n\n“There is no better combination than BlackRock and Coinbase,” he argued. “They will give family office investors confidence to use ETFs in crypto.”\n\nRead more: Interest in crypto plummets among family offices, survey says\n\nAn April 2022 survey of 500 financial advisors by Nasdaq found that 72% would be more likely to invest client assets in crypto if a spot bitcoin ETF were offered in the US.\n\nMore recently, a survey in January by Bitwise and VettaFi found that 32% of financial professionals cited “lack of easily accessible investment vehicles like ETFs and mutual funds” as a barrier to crypto allocation.\n\nRic Edelman, founder of the Digital Assets Council of Financial Professionals (DACFP), compared the SEC’s spot bitcoin ETF denials to Prohibition, which he said chased people into speakeasies.\n\nDuring his conversation with the SEC’s Hirsch at the DACFP Vision conference in Austin on Wednesday, he said that financial advisers and other investors would welcome the opportunity to access bitcoin exposure through a prominent financial brand, citing Merrill Lynch as an example.\n\nHirsch — noting he was sharing personal views that weren’t necessarily those of the SEC — acknowledged there would likely be an upswing in adoption if such a large financial player got involved in the space.\n\n“But also you’re going to have some people…who were never going to go into a speakeasy, but as long as there’s this brightly-lit pub, say maybe I’ll go in there,” the SEC leader said. “To the extent that bitcoin is subject to manipulation, you have some additional group of investors who are open to potentially more harm than they otherwise might have experienced.”\n\nMaybe no big deal?\n\nGrayscale Investments launched a suit against the SEC last year for denying its planned conversion of its Bitcoin Trust (GBTC) to an ETF. That case is ongoing, and a ruling is expected in the coming months.\n\nThough some said oral arguments in March suggested Grayscale could win the case, certain industry watchers noted a favorable ruling for the firm wouldn’t necessarily open a clear path for spot bitcoin ETF approvals.\n\nDave Nadig, financial futurist at VettaFi, said he isn’t reading too much into the BlackRock filing and its timing.\n\n“There’s really nothing new here, so at best this can be seen as jockeying for position in line on the belief that perhaps Grayscale wins its lawsuit,” he said. “Historically, who the issuer is hasn’t mattered all that much on who gets [to be] first on products like this.”\n\nWhile spot bitcoin ETF applications go back a decade — the first being a 2013 attempt by the Winklevoss twins — only one other is active.\n\nArk Invest and 21Shares re-filed for their spot bitcoin ETF in April.\n\nSeyffart and Balchunas said BlackRock’s filing Thursday could spur others who had previously tried to launch a bitcoin ETF — such as Bitwise, VanEck and Fidelity — to also re-file.\n\n“I still think it’s extraordinarily unlikely that a spot bitcoin ETF is trading in the US in this calendar year,” Nadig said. “And probably even in 2024.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stYXBwbHktc3BvdC1iaXRjb2luLWV0Zi1zZWMtbmFzZGFx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock applies for spot Bitcoin ETF — a US first if approved - Cointelegraph",
        "content": "BlackRock has filed an application for a Bitcoin spot exchange traded fund (ETF). The investment company is the world’s largest and it would be the first crypto spot ETF in the United States, if it receives approval.\n\nAccording to a filing by the Nasdaq stock exchange with the U.S. Securities and Exchange Commission, Coinbase Custody Trust Company would be the custodian of the fund’s Bitcoin holdings, and Bank of New York Mellon would custody its fiat. BlackRock’s iShares Bitcoin Trust would be traded as Commodity-Based Trust Shares.\n\nAccording to the application filed on June 15:\n\n“The Shares have been designed to remove the obstacles represented by the complexities and operational burdens involved in a direct investment in bitcoin.”\n\nThe Bitcoin price will be updated “at least” every 15 seconds during regular market trading using the CF Benchmarks Index.\n\nThe Blackrock ETF filing is live, and it’s * SPOT *\n\n\n\n“The assets of the Trust consist primarily of bitcoin held by a custodian on behalf of the Trust.” — Swan.com (@Swan) June 15, 2023\n\nThe document notes that previously approved spot exchange traded products in the commodities and currency markets “are generally unregulated and […] the Commission relied on the underlying futures market” as “the basis for approving” trust shares in the past. Thus:\n\n“As such, the regulated market of significant size test does not require that the spot bitcoin market be regulated in order for the Commission to approve this proposal.”\n\nThe SEC has not approved a spot Bitcoin ETF so far, despite numerous applicants. Grayscale took the SEC to appeals court to argue for the soundness of the Bitcoin futures after the SEC rejected its application to create a spot Bitcoin ETF.\n\nRelated: GBTC approval could return a ‘couple billion dollars’ to investors: Grayscale CEO\n\nCathie Wood’s ARK Invest and European investment firm 21Shares have also been pressing for spot Bitcoin ETF approval, filing their third applications in April.\n\nThe world’s first spot traded Bitcoin ETF was Canada’s Purpose Bitcoin ETF, set up in early 2021.\n\nMagazine: AI Eye: 25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDYvMTYvYmxhY2tyb2NrLXNwb3QtYml0Y29pbi1ldGYtYmluYW5jZS1leGl0LXRoZS1uZXRoZXJsYW5kcy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock files to launch spot bitcoin ETF, and Binance to exit the Netherlands - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBlackRock files to launch spot bitcoin ETF, and Binance to exit the Netherlands: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Gustavo Schwenkler of Santa Clara University's Leavey School of Business discusses BlackRock's proposal for a spot bitcoin ETF."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNi0xNS9iaXRjb2luLXRpZ2h0ZW5zLWl0cy1ncmlwLW9uLXRoZS1jcnlwdG8tbWFya2V0LWFzLXRyYWRlcnMtYXZvaWQtc21hbGxlci10b2tlbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BItcoin (BTC) Tightens Grip on Crypto Market as Traders Shun Altcoins - Bloomberg",
        "content": "Bitcoin’s share of total crypto market value is the highest in about 20 months, a sign of the cautious mood in digital assets.\n\nThe token wavered near $25,000 on Thursday, giving it a capitalization of $484 billion — or 45.8% of the value of the more than 10,000 coins tracked by CoinGecko. That’s the highest percentage since October 2021."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvYmxhY2tyb2NrLXNldC10by1maWxlLWZvci1iaXRjb2luLWV0Zi13aXRoLXNlYy1yZXBvcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock set to file for bitcoin ETF with SEC – report - ETF Stream",
        "content": "The world’s largest asset manager, BlackRock, is reportedly on the cusp of filing an application for a bitcoin ETF in the US.\n\nBlackRock will work with Coinbase Custody, which will provide spot market data for pricing and hold the underlying assets of the ETF, a person familiar with the matter told Coindesk.\n\nBlackRock declined to comment on the filing.\n\nThe US asset manager first partnered with Coinbase last August to offer its institutional clients the ability to buy bitcoin through its Aladdin platform.\n\nIn the same month, BlackRock launched a spot bitcoin trust for its US institutional clients – the firm’s first structured vehicle wrapping direct crypto exposure.\n\nBoth announcements were accompanied by statements from BlackRock detailing “significant interest” in the asset class from its clients.\n\nLast March, the firm’s founder, chairman and CEO Larry Fink said his firm was “studying digital currencies, stablecoins and the underlying technologies to understand how they can help us serve our clients”.\n\nBlackRock previously told ETF Stream it had “no plans” to launch an exchange-traded crypto product.\n\nA spokesperson said: “It is worth noting that the Securities and Exchange Commission (SEC) has yet to approve an application for a spot bitcoin ETP.\n\n“In general, any decision as to whether to launch iShares exchange-traded products (ETPs) is based on an array of factors including market and asset dynamics, regulatory considerations and client demand.”\n\nIt is unclear whether its anticipated bitcoin ETF filing will be for a spot or synthetically replicated product – or whether the firm anticipates the SEC to remove its current ban on spot crypto ETFs.\n\nSpeaking on the possibility of a BlackRock crypto ETF, Athanasios Psarofagis, ETF analyst at Bloomberg Intelligence, previously said: “It may not be far off given they are now committed. It seems like the next logical step.”\n\nBlackRock’s signalled entry into the space would mark just the latest large asset manager tapping wrapped digital asset exposures.\n\nInvesco and Fidelity already have crypto ETPs in Europe. This year, DWS partnered with digital asset manager Galaxy with the intention of launching crypto ETPs in due course.\n\nLast month, Matteo Andreetto, head of SPDR EMEA at State Street Global Advisors (SSGA) told attendees of ETF Stream’s ETF Ecosystem Unwrapped his firm are “looking at” tokenised ETFs and private assets and believe the technology “will be game-changing”."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWFuZC10ZXRoZXItc2FnLWFzLWNyeXB0by1tYXJrZXRzLWZhY2UtbW91bnRpbmctcHJlc3N1cmVzLTE3MTEwODQyNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin and tether sag as crypto markets face mounting pressures - Yahoo Finance",
        "content": "Major cryptocurrencies faced renewed pressure Thursday as the industry grappled with new challenges on numerous fronts.\n\nBitcoin (BTC-USD), the largest digital coin, slipped 4% and fell to its lowest level in the past three months. Other major cryptocurrencies dipped, with ether (ETH-USD) and BNB (BNB-USD) falling more than 5% and a stablecoin called tether going below its crucial $1 price.\n\nThose drops dragged the total market value for all crypto assets to its lowest level since the banking turmoil began in March, according to Coinmarketcap.\n\nPublicly traded crypto companies also fell, including the stock of Coinbase Global (COIN). Other crypto stocks including MicroStrategy (MSTR), Riot Platforms (RIOT), and Marathon Digital (MARA) sold off as well.\n\nThe new price pressures follow assurances from the Federal Reserve that it isn’t done hiking interest rates this year along with reports that crypto lending platforms Delio and Haru paused withdrawals after facing heightened requests from customers.\n\nRegulators also are turning up the heat on the industry with two new lawsuits filed by the Securities and Exchange Commission last week against crypto exchanges Coinbase and Binance, alleging that 19 specific cryptocurrencies are securities and thus should be registered with the SEC.\n\nThose tokens — which include BNB, SOL, ADA, and MATIC — have fallen 10-14% since the lawsuits.\n\n\"Until the regulatory environment is better, cryptos might struggle here,\" Oanda market analyst Edward Moya said Thursday.\n\n'Markets are edgy'\n\nThe multiple pressure points leave the industry with another problem: a lot of sellers and not enough buyers. Major trading firms that once might have acted as market makers have retrenched over the last year.\n\nIn the last week trading volumes have fallen on Coinbase and Binance. Liquidity is also lower on Binance's US-affiliated platform, Binance.US. The amount of money available for trading on Binance's US-affiliated platform fell 75% following last week's SEC charges, according to Kaiko Research.\n\nStory continues\n\n\"Everything is coming together all at once and we have thin liquidity in markets now,\" crypto investor and entrepreneur Thomas Dunleavy told Yahoo Finance.\n\nAnother sign of increased stress is the pressure on tether (USDT), the market’s largest dollar-pegged stablecoin by market capitalization and trading volume.\n\nIt fell as much as 0.20% between Wednesday and Thursday, its biggest one-day drop since November.\n\nAs of Thursday at 2:00 AM New York time, the $83 billion stablecoin, which isn’t supposed to fluctuate below its crucial $1 price, fell to $0.9958. It is issued by a company called Tether.\n\n“Markets are edgy in these days, so it's easy for attackers to capitalize on this general sentiment,” Tether’s chief technology officer Paolo Ardoino said over Twitter earlier Thursday.\n\nMarkets are edgy in these days, so it's easy for attackers to capitalize on this general sentiment.\n\nBut at Tether we're ready as always. Let them come.\n\nWe're ready to redeem any amount. — Paolo Ardoino 🍐 (@paoloardoino) June 15, 2023\n\nTether tokens are collateralized by other assets the company holds in reserves, including 85% in cash and cash equivalents such as US Treasuries, 6.5% in secured loans, and 4% in precious metals according to its March 31 reserve report.\n\nWhen the stablecoin slips below its $1 peg, \"verified\" market participants also can make a profit by buying the token and redeeming it for other currencies.\n\nHowever, in periods of heightened selling, the redemption process does not always keep up with the market.\n\nIn May 2022, the so-called “algorithmic stablecoin” terraUSD collapsed after slipping too far below its $1 peg, causing a rapid shift in sentiment that led to a loss in confidence for the coin by the market leading to its ultimate collapse.\n\nDuring the month of terra’s collapse, Tether’s Ardoino told Yahoo Finance that Tether faced heightened withdrawals as investors rushed to liquidate $10 billion worth of holdings in 11 days.\n\nDespite temporarily slipping as low as 95 cents during the period, it gradually regained its $1 price over the following weeks.\n\nToday, Ardoino struck a defiant tone on Twitter.\n\n“We're ready as always. Let them come. We're ready to redeem any amount,” Ardoino said in his tweet.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMTUvYmxvY2stYml0a2V5LXB1YmxpYy1iZXRhLWNvaW5iYXNlLWNhc2gtYXBwLWJpdGNvaW4tamFjay1kb3JzZXkv0gFpaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wNi8xNS9ibG9jay1iaXRrZXktcHVibGljLWJldGEtY29pbmJhc2UtY2FzaC1hcHAtYml0Y29pbi1qYWNrLWRvcnNleS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Block to open public beta of self-custody wallet and integrate it with Coinbase and Cash App - Fortune",
        "content": "Payments giant Block announced on Thursday that it will finally give the general public a taste of its Bitcoin self-custody wallet, Bitkey, in an external beta. (The company, headed by former Twitter CEO Jack Dorsey, previously conducted an in-house beta open only to Block employees.)\n\nBitkey will partner with Cash App, another Block product, as well as the U.S.-based crypto exchange Coinbase to enable users to transfer Bitcoin directly into customers’ wallets.\n\nUsers will be able to buy crypto from the two platforms when the Bitcoin-only wallet is formally launched outside beta, Lindsey Grossman, the business lead for Bitkey, told Fortune.\n\n“Our strong belief is that self-custody is the best place to hold and manage your Bitcoin,” she said, adding later: “If anything goes wrong with a custodial platform, you know that—this industry has had a lot of ups and downs—you’re protected.”\n\nThe step forward in the development and eventual launch of Bitkey is part of the payments giant’s larger bet on Bitcoin and Web3.\n\nIn 2018, Dorsey, a Bitcoin evangelist, integrated Bitcoin buying and selling into Cash App. Formerly called Square, the company then said in 2021 that it would rebrand itself as Block, emphasizing its new focus on Bitcoin and blockchain. In 2022, the payments firm unveiled that it was developing a Bitcoin hardware wallet, with a developer sharing images of the device a month later.\n\nOn a video call with Fortune, Grossman briefly flashed the wallet, a flat hexagonal device with a fingerprint scanner that fits into one’s palm. Bitkey’s hardware component is one-third of a “multisig,” or multisignature, setup.\n\nBlock’s self-custody wallet consists of a mobile app as well as a hardware device. Courtesy of Bitkey\n\nLike multifactor authentication, where platforms like Google ask users to provide a password as well as enter a code sent to their cell phones to access their accounts, multisignature wallets require sign-offs on multiple keys to approve any transaction. To be valid, the majority of keys require sign-offs.\n\nBitkey has three keys. One is on users’ cell phones, another is stored on the hexagonal piece of hardware, and Block holds the final key. To pay for coffee with, say, Bitcoin, a user needs to sign off on the transaction on both their hardware device and cell phone.\n\n(Bitkey allows wallet holders to set a floor for when they’ll need to use their hardware device, Grossman, the business lead, told Fortune. In other words, only with transactions above $100, for example, will users need both their cell phone and the Bitkey device to authorize the payment.)\n\nBlock holds the final key to circumvent the tricky problem with self-custody: As with cash, if users lose their keys, they lose their crypto. (See, for example, the man searching for a key to hundreds of millions of dollars in Bitcoin in a garbage dump.)\n\n“We are able to help you recover your wallet and recover both your mobile key through a cloud backup and then also help you get a new piece of hardware and create a new hardware key,” Grossman told Fortune.\n\nTo test out Bitkey in the external beta, interested users need to fill out a short application. While Grossman declined to specify in which quarter Block plans to release the wallet, she did say the firm is aiming for later this year."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDYvMTUvYml0Y29pbi1zaW5rcy1iZWxvdy0yNWstYW5kLXVzLXB1bnRzLW5ldy1jaGFyZ2VzLXNiZi1jYXNlLXRvLTIwMjQtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin sinks below $25,000, and U.S. withdraws new charges in SBF case for now - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin sinks below $25,000, and U.S. withdraws new charges in SBF case for now: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Jeffrey Janson, a senior wealth manager with Summit Wealth Partners, explains what people interested in crypto should know before investing in the asset class from DACFP VISION 2023, a crypto investing conference for financial advisors in Austin, Texas."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYmxhY2tyb2NrLXNlZWtzLWFwcHJvdmFsLWZvci1hLXNwb3QtYml0Y29pbi1ldGYtaW4tdGhlLXVzL9IBbWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYmxhY2tyb2NrLXNlZWtzLWFwcHJvdmFsLWZvci1hLXNwb3QtYml0Y29pbi1ldGYtaW4tdGhlLXVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock Seeks Approval for a Spot Bitcoin ETF in the US - Finance Magnates",
        "content": "BlackRock, the world's largest fund manager, filed for a spot Bitcoin exchange-traded fund (ETF) yesterday (Thursday). The application came when the Securities and Exchange Commission (SEC) brought lawsuits against Coinbase and Binance, two big crypto exchange brands.\n\nBlackRock Files for a Bitcoin ETF\n\nThe permission for the spot Bitcoin ETF is being sought by BlackRock's iShares unit. The ETF, to be named as iShares Bitcoin Trust, will use the custodian services offered by crypto exchange Coinbase.\n\n\"The Bitcoin Custodian is responsible for safekeeping the Bitcoin owned by the Trust. The Bitcoin Custodian is appointed by the Trustee,\" the filing with the SEC stated.\n\nAccording to the official filing, BlackRock will use CME CF Bitcoin Reference Rate to track the Bitcoin prices. CF Benchmarks, a subsidiary of the crypto exchange Kraken, takes price data from reputed cryptocurrency exchanges around the world.\n\nKeep Reading South Africa Navigates Crypto Regulations: To License 60 Firms This Month\n\n\"The Shares have been designed to remove the obstacles represented by the complexities and operational burdens involved in a direct investment in Bitcoin,\" Blackrock stated in the SEC filing.\n\nThe SEC has adamantly refused to approve a spot bitcoin ETF for years, a view so entrenched that it's litigating the issue against Grayscale right now.\n\n\n\nKnowing the SEC disagrees, Blackrock—BLACKROCK—wants to list a bitcoin ETF on NASDAQ.\n\n\n\nEveryone gets how big this is, right? https://t.co/IiRnKd5O4N — Jake Chervinsky (@jchervinsky) June 16, 2023\n\nThe SEC Rejected Spot Bitcoin ETFs\n\nSeveral other cryptocurrency and traditional finance companies, including Grayscale, VanEck, and WisdomTree, have applied for the SEC's approval for a spot Bitcoin ETF. However, despite repeated applications, the US securities regulator is reluctant to approve any.\n\nHowever, there are a few futures-based Bitcoin ETFs listed on US exchanges.\n\nThe entrance of BlackRock to seek approval for a spot Bitcoin ETF might change the regulatory stance towards the crypto investment vehicle. BlackRock is the largest asset management firm globally and manages more than $10 trillion in assets under management (AUM).\n\nThe interest of BlackRock in Bitcoin is not new. The company launched a spot Bitcoin private trust for institutional clients in the United States last year. Now, if its spot Bitcoin ETF is approved, it will open and ease Bitcoin investments for regular retail investors."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmZyZWV0aGluay5jb20vc3BvbnNvcmVkL2JpdGNvaW4tbWluaW5n0gE4aHR0cHM6Ly93d3cuZnJlZXRoaW5rLmNvbS9zcG9uc29yZWQvYml0Y29pbi1taW5pbmc_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Building the world’s greenest Bitcoin mine - Freethink",
        "content": "Cryptocurrency has the potential to revolutionize our monetary system. Bitcoin — the largest cryptocurrency — could provide people with a decentralized financial system that is more secure and streamlined and difficult to counterfeit.\n\nBut as bullish as people are on Bitcoin, there’s been a difficult-to-ignore shadow looming over the industry: its perceived energy consumption. All cryptocurrency transactions are recorded through a process called mining. This process requires many verified crypto miners to validate a transaction by solving incredibly difficult mathematical puzzles. This acts as a way to verify all transactions in a decentralized manner, but because Bitcoin mining requires a lot of computing power, it uses a decent amount of energy.\n\nNow, a new data center is moving away from users to harness renewable energy at its source: West Texas."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wNi0xNS9zdHJpa2UtY2VvLW9uLWJpdGNvaW4tdGlnaHRlbmluZy1ncmlwLW9uLWNyeXB0by12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Strike CEO on Bitcoin Tightening Grip on Crypto - Bloomberg",
        "content": "00:00\n\nTRANSACTIONS AND ALLOWS USERS TO SEND MONEY WITHOUT FEES. I'M INTERESTED IN YOUR OWN MOVE AS OF LATE. IS THIS ABOUT PRODUCING COUNTERPARTY RISK? I UNDERSTAND THERE ARE A LOT OF BENEFITS, BUT HOW MUCH DOES NOT REFLECT SOME OF THE WORRY IN THE ECOSYSTEM AT LARGE? > > FIRST OF ALL, HELLO. NICE TO SEE YOU. DIVISION OF THE COMPANY, WE BELIEVE STRICTLY IN BITCOIN. WE BELIEVE THAT BITCOIN IS THE INNOVATION OF DIGITAL CURRENCY, OF BLOCK CHAIN. US AS A COMPANY, WE ARE LASER FOCUSED ON BEING A BITCOIN PROVIDER AND PROVIDING IMPRESSIVE TOOLS. WE MADE A MOVE TO TAKE ALL OF OUR CUSTODY, A LOT OF OUR PROCESS, IN-HOUSE. WE DO NOT WANT TO WORK WITH OTHER PARTIES. IT IS A REALLY LONG PROCESS TO COMPLY WITH REGULATION. WE ARE REALLY PROUD TO TAKE ALL OF THAT IN-HOUSE AND BE THE BEST IN THE WORLD AT BITCOIN, NOT CRYPTO. WE THINK WE CAN DO IT OTHER THAN ANYBODY ELSE. ED: GOOD MORNING FROM SAN FRANCISCO. OUR CRYPTO TEAM WAS RIDING OVERNIGHT THAT CRYPTO SHARE -- THEY ARE AT A 20 MONTH HIGH AND THERE IS A LOT OF CAUTION ABOUT THE BROADER MARKET AWAY FROM BITCOIN. WHAT DOES THAT TELL YOU? > > IT TELLS ME THAT MARKETS ARE EFFICIENT IN THE WORLD IS FIGURING OUT WHERE TRUE VALUE IS. IF I'M BEING HONEST WITH YOU GUYS, CRYPTO IS WORTH ZERO. IT TAKES TIME. THIS IS A NEW INDUSTRY AND A NEW TECHNOLOGY, BUT EVERYONE IS WAKING UP TO THE FACT THAT THE ONLY THING TO DELIVER AND MAKE CONSCIOUS GROUND FORWARD IS BITCOIN. REGULATORS ARE REALIZING THAT. BUSINESSES ARE REALIZING THAT. THE NUMBER STILL SEEMS A LITTLE BIT OFF, BUT I THINK THE WORLD CAN TAKE ITS TIME. CAROLINE: MANY PEOPLE WOULD LIKE IF SOME OF THE SMALLER COINS ARE UNDER SOME CONCERNS OVER REGULATORY IMPACT. LIKE MANY WOULD SAY, WHERE IS THE REAL USE CASE AT THE MOMENT IN OTHER AREAS OF CRYPTO? HOW MUCH ARE WE SEEING THAT BEING ADOPTED BY THE EMERGING MARKETS, WHERE MANY DO SEE RAPID INFLATION? > > WE USE THE TECHNOLOGY FOR PAYMENTS. THERE IS A DIGITAL PUBLIC INFRASTRUCTURE FOR PAYMENTS. LET'S GET A MOMENT OF SILENCE FOR THAT. THAT IS INSANE. LISA IS NOT PUBLIC INFRASTRUCTURE FOR THE WORLD. IT IS LIKE A PUBLIC UTILITY THAT WE ALL GET TO UTILIZE. IT IS OWNED BY NO ONE, ACCESSIBLE TO EVERYONE. THINK OF IT LIKE THE INTERNET. THE INTERNET IS GLOBAL, PUBLIC INFRASTRUCTURE FOR THE WORLD TO COMMUNICATE. A REALLY POWERFUL THING. IT REALLY CHANGED LIVES AND IT EMPOWERS HUMAN RIGHTS AND REGIONS. BITCOIN IS VERY SIMILAR FOR PROPERTY RIGHTS. WE USE DIGITAL PUBLIC INFRASTRUCTURE TO MAKE IT CHEAPER, AND MORE INCLUSIVE. I DO NOT THINK IT IS THAT COMPLICATED. I THINK IT IS SUPER SOUND AND THAT IS EXACTLY WHAT WE DO. ED: WE DO NOT HAVE TIME FOR MOMENTS OF SILENCE ON THIS PROGRAM. THE COMPETITIVE RAN -- I KNOW THAT COIN BASE ANNOUNCED A PARTNERSHIP. IT IS ABOUT THE USE OF SELF CUSTODY. HE RECOGNIZED THAT AS COMPETITION? WHAT DO YOU MAKE OF THAT? > > THE WAY THAT WE THINK ABOUT THE NEXT 20 TO 50 YEARS OF THIS INDUSTRY IS THAT IT IS NOT A WINNER TAKE ALL OR WINNER TAKE MOST. IF THEY ARE TO BE DEVELOPED, IT IMPLIES THAT A NETWORK HAS MORE THAN ONE. I LOVE TO SEE OTHER BUSINESSES AND COMPANIES JOIN US. IT MAKES OUR SERVICES MORE VALUABLE. I AM A HUGE IS GREAT. MORE PEOPLE WILL BE ABLE TO BUY CAROLINE: THAT CLAIM. HE IS A FELLOW BITCOIN MAXIMAL LIST. THE OVERALL REGULATORY OVERHANG, PARTICULARLY IN THE U.S., YES, YOU HAVE MOVED TO SELF CUSTODY, BUT MANY WOULD SAY IT HAPPENED IN TANDEM AND THERE WERE RUMORS OF YOUR FORMER CUSTODIAN. THESE ISSUES AND WEAKNESSES, DOES THAT ADOPTION IN THE LONG TERM? > > DAMAGE WHICH ADOPTION? CAROLINE: THEY CLAIM BECAUSE THEY ARE CAUGHT UP IN THE SAME NARRATIVE. > > TOTALLY. I THINK THEIR JOB IS TO THEORETICALLY -- I'M JUST EXPLAINING WHAT IS GOING ON. THEIR JOB IS TO PROTECT THE ETHICS AND MORALITY IN THE U.S. FINANCIAL MARKETS. THE NOTION THAT THEY WOULD HAVE AN ISSUE WITH EVERYTHING BUT BITCOIN DOES A LOT. IT DOES NOT SEEM LIKE AN ETHICAL, MORAL -- IT IS A PROBLEM. HOW DO WE FIX THAT, WE GO THROUGH WHAT WE ARE NOW. GIVING PROPER TRANSPARENCY TO THE AMERICAN PUBLIC. I THINK WHERE THIS LEAVES US, VALUE IS GOING TO ACCRUE WHERE IT IS REAL. WHERE I THINK IT IS MORAL, ETHICAL, INNOVATIVE, BETTER, FASTER AND CHEAPER IS BITCOIN. THE PATH IS ALWAYS GOING TO BECOME LOCATED AND THAT IS PART OF FREE MARKETS, WHICH AMERICA LOVES DEEPLY. YOU'RE GOING THROUGH FREE-MARKET DISCOVERY. WE HAVE BEEN THROUGH IT BEFORE WITH THE INTERNET AND WE ARE SEEING MORE PATTERNS NOW. IT IS ABUNDANTLY CLEAR THAT IT IS BITCOIN."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idXlpbmctYml0Y29pbi1pcy1wcmVmZXJhYmxlLXRvLWJ0Yy1taW5pbmctaW4tbW9zdC1jaXJjdW1zdGFuY2VzLWFuYWx5c2lz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Buying Bitcoin is preferable to BTC mining in most circumstances — Analysis - Cointelegraph",
        "content": "While, intuitively, mining Bitcoin may appear like a highly profitable endeavor, research suggests otherwise.\n\nAfter discovering Bitcoin (BTC), most users go down the rabbit hole and consider whether it is better to mine or buy Bitcoin directly. They usually give up on mining due to the cost and rigor of running ASIC miners, regulatory uncertainty and the lack of technical expertise.\n\nHypothetically, if people overcome the above challenges, they could enjoy advantages such as full autonomy over their operations and diversification of their crypto investment via physical hardware instead of directly purchasing Bitcoin, but the entire venture can be risky and labor intensive.\n\nTo mine, or not to mine BTC?\n\nAn analysis by Bitcoin mining data firm Hashrate Index suggests that “buying bitcoin is preferable to mining it in most circumstances.”\n\nJaran Mellerud, a Bitcoin mining analyst at Hashrate Index, calculated the projected earnings of miners in the next five years under various bullish and bearish scenarios. Mellerud found that miners will likely incur a loss even in optimistic Bitcoin price projections.\n\nMining is a dynamic business where hardware usually gets outdated within five years due to the introduction of more efficient machines in the market.\n\nFor instance, in the 2016-2017 bull market, the Bitmain S9 models were the most efficient miners. However, as more models entered the market, the S9s were phased out completely by the end of 2022, according to a recent finding by Coin Metrics analyst Karim Helmy.\n\nTwo Bitmain models in the S19j Pro and S19 XP class have dominated the mining sector in 2023. Mellerud calculated the returns assuming that the current batch of miners will be scrapped five years from now, around the 2028 Bitcoin halving.\n\nThe analysis used a constant cost of electricity of $0.07 per kWh and varied the price of Bitcoin and the network’s hash rate to estimate the profit margins of the machines.\n\nIn his report, Mellerud wrote, “Hashrate tends to follow the hashprice, albeit with a lag during rapid bitcoin price increases.”\n\nNotably, the electricity cost varies worldwide, and miners can also establish exclusive deals with energy generation companies that lock their costs for months, which may also entail a discount. Figures from a New York Times investigation revealed that Riot Platforms, a public Bitcoin miner, paid around $0.03 per kWh in Texas, while other industries paid around $0.07.\n\nMellerud said, “Mining is a no-brainer if you have access to electricity prices below $0.04 per kWh.”\n\nFive-year projections for Bitcoin miner returns\n\nBitcoin miners are profitable only if they can recoup 100% of their capital spent in buying the machines, excluding operational costs. Any additional BTC that hardware brings to its owner is an additional gain.\n\nFor instance, if a Bitcoin-denominated investment of 1 BTC in mining rigs returns 0.9 BTC at the end of five years, buying BTC is preferable to mining.\n\nHashrate Index’s analysts found that miners will return north of 1 BTC only in the most bullish scenarios, where the Bitcoin price goes on to $500,000 per token by 2028 while the network’s hash rate grows 10% slower than its price.\n\nEven in situations where Bitcoin reaches $250,000 by 2028 with a modest increase in its hash rate, the miners would only recoup 83% of the initial cost at best.\n\nReturn on investment from Bitcoin miners denominated in BTC over the next five years. Source: Hashrate Index\n\nRelated: $160K at next halving? Model counts down to new Bitcoin all-time high\n\nWhile Hashrate Index’s analysis relied on future projections, River Financial, a financial services firm specializing in Bitcoin mining research, looked at historical data to find out whether mining was a better option than directly purchasing BTC. River Financial’s analysts found that in the last five years, owning miners was preferred 53.6% of the time.\n\nThe basis of the River Financial analysis is similar to that of Hashrate Index’s report — miners make a profit if Bitcoin’s price increases faster than the network’s hash rate over time or if the price decreases at a slower rate than the network’s hash rate.\n\nTimes when Bitcoin mining was preferred (in gray) over direct BTC purchases (in white). Source: River Financial\n\nHowever, one caveat of this analysis is that even during times when Bitcoin’s price is rising faster than the hash rate, the miners may still incur a loss due to the actual price being low.\n\nBearish periods have been particularly tough on Bitcoin miners. For instance, the period toward the end of 2022 is marked as preferable, while Bitcoin miners recorded the lowest revenue levels in two years with a significant wave of miner capitulations during that time.\n\nBoth reports appear to agree that mining Bitcoin only makes the most sense right before parabolic bullish periods, with direct Bitcoin purchases being more profitable at all other times.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWxmLWN1c3RvZHktYml0Y29pbi1hbW91bnQtdW5tZWFzdXJhYmxlLXNhbnRpbWVudC1leGVj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Self-custody Bitcoin amount unmeasurable so far — Santiment exec - Cointelegraph",
        "content": "There is no way to measure the amount of Bitcoin (BTC) that is being sent to self-custody wallets so far, according to one industry executive.\n\nAmid the ongoing fear, uncertainty and doubt, or FUD, over lawsuits against major cryptocurrency exchanges, investors have been increasingly offloading their Bitcoin from crypto trading platforms.\n\nAs of mid-June, Bitcoin’s exchange supply fell to its lowest level since February 2018, according to data from the crypto intelligence platform Santiment. The massive exchange outflows have been triggered by self-custody growth fueled by uncertainty around Binance and Coinbase, Santiment said.\n\nBTC supply on exchanges since June 2017. Source: Santiment\n\nThe growing self-custody trend has a massive impact on cryptocurrency markets, Santiment’s head of marketing Brian Quinlivan told Cointelegraph on June 15.\n\nOne of the most notable results of self-custody is that it tends to decrease circulation, thereby reducing the market capitalization tracked by websites like CoinGecko and CoinMarketCap.\n\n“Circulation does tend to dry up as coins are moved off of exchanges,” Quinlivan said, adding that the increasing self-custody trend has a downside in the form of stagnant coins.\n\n“This stagnancy can have a negative impact on market cap due to the lowered utility of the network as a whole,” the exec noted, adding:\n\n“However, as long as there is still a healthy amount of exchange activity, which there has been, this generally should be enough to cancel out the negative impact of this current phenomenon.”\n\nQuinlivan stated that coins moving off exchanges have more of a long-term impact on markets. “Traders sometimes assume that if a massive amount of tokens is suddenly moved off exchanges by whales, prices will immediately rise,” he said, adding that the firm has seen that it was usually a much more gradual rise.\n\nThe Santiment executive noted that Bticoin’s supply on exchange has plummeted from 16.1% on Black Thursday in March 2020 to 9.8% today. “Prices are still up 283% during this time span,” Quinlivan added.\n\nWhile the self-custody trend continues to expand, it’s not quite possible to find out how much BTC is sitting on cold wallets, according to Quinlivan. He said:\n\n“Assuming we have every exchange address in existence, which nobody does, then we would be able to measure precisely how much is moving to cold wallets at any given time just by subtracting out all of these known exchange addresses.”\n\nThe executive went on to say that, for now, blockchain analysts can only give their best estimation.\n\n“It is why our exact number of 9.8% of BTC on exchanges may vary slightly compared to other data out there. The longer time goes on, though, the more accurate data we are able to capture,” Quinlivan noted.\n\nRelated: Binance CEO CZ responds as data points to billions in exchange outflows\n\nThe news comes amid Bitcoin’s market capitalization continuing to shrink, according to data from CoinGecko.\n\nBitcoin’s market cap since April 2023. Source: CoinGecko\n\nSince mid-April, Bitcoin’s market value has dropped more than 15%, amounting to $494 billion at the time of writing. As previously reported by Cointelegraph, the BTC market cap reached its highest point of $1.28 trillion in November 2021, when the BTC price hit an all-time high of $68,000."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9ibGFja3JvY2stYml0Y29pbi1ldGYtdGhlLWZpcnN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Analysis: Why BlackRock's Bitcoin ETF might be the first - Ledger Insights",
        "content": "Yesterday BlackRock’s iShares filed with the US Securities and Exchange Commission (SEC) to launch a spot Bitcoin exchange traded fund (ETF) after the asset manager unveiled a private Bitcoin Trust in August last year. Numerous spot Bitcoin ETF applications by various asset managers have been rejected by the SEC. The only Bitcoin ETFs that have been approved are linked to the futures markets.\n\nWe believe that BlackRock might have done enough to address the SEC’s concerns about spot Bitcoin ETFs.\n\nBased on previous ETF rejections, the SEC wants to see two things. Firstly, it wants the pricing to be linked to a regulated exchange, which for now would be a futures market. Secondly, it wants the futures exchange (CME) to have a surveillance sharing agreement with the ETF exchange, which is Nasdaq for the BlackRock Bitcoin ETF.\n\nThat surveillance agreement must already exist because the Valkyrie Bitcoin Strategy ETF is listed on Nasdaq and based on CME Bitcoin futures.\n\nSo how can the futures market provide a price for a cash market? If the spot ETF uses the price used to settle futures when they mature. BlackRock plans to use the CF Benchmarks Index, created by a UK FCA-regulated firm. That same benchmark is used by the CME to settle Bitcoin futures.\n\nOther spot Bitcoin ETF rejections\n\nThe crux of the SEC’s objections has related to the perception that cryptocurrency prices are manipulated.\n\nThe second iteration of the Ark/21Shares Bitcoin ETF application was rejected this January, though it’s still trying. Ark’s most recent application analyzed why Bitcoin prices are becoming more reliable.\n\nThe Ark ETF used the S&P Bitcoin Index for pricing which sounds pretty credible. In turn, the S&P index is based on data from the startup Lukka. It uses pricing from a dozen exchanges, including Binance and Bitfinex. Another rejected ETF, the VanEck spot Bitcoin ETF used the MVIS CryptoCompare Bitcoin Benchmark Rate. Both were trying to list on the Cboe BZX Exchange.\n\nIn the case of Grayscale’s failed attempt to convert its Bitcoin Trust into an ETF, the pricing index is supplied by TradeBlock. Both Grayscale and TradeBlock are part of the Digital Currency Group.\n\nIn contrast, the CF Benchmarks Index in BlackRock‘s application uses half the number of exchanges compared to the S&P index. Those exchanges are Bitstamp, Coinbase, Gemini, ItBit (Paxos), Kraken and LMAX.\n\nMeanwhile, the BlackRock ETF will use Coinbase Custody as custodian, and Coinbase as prime broker, extending its existing relationship with the crypto exchange. The question is whether Coinbase’s role could hold up the ETF given the SEC is suing the exchange."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnRoZXRyYWRlbmV3cy5jb20vYmxhY2tyb2NrLWRpdmVzLWRlZXBlci1pbnRvLWNyeXB0by1hcy1pdC1maWxlcy1mb3ItYml0Y29pbi1ldGYtd2l0aC10aGUtc2VjL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock dives deeper into crypto as it files for bitcoin ETF with the SEC - The TRADE News",
        "content": "BlackRock has filed an application for a bitcoin exchange-traded fund (ETF) to the US Securities and Exchange Commission (SEC), which would allow investors to get exposure to the cryptocurrency.\n\nIf the SEC approves the application, it would be the first publicly traded spot bitcoin ETF in the US.\n\nBlackRock currently operates a spot bitcoin private trust for institutional clients which it launched in August last year. The trust tracks the performance of bitcoin, offering direct exposure to the price of the digital currency, according to the asset manager.\n\nCoinbase Custody will be used by BlackRock’s iShares Bitcoin Trust as its custodian, according to a filing with the SEC – building upon an already existing relationship between the two firms.\n\nIn August last year, BlackRock expanded its crypto offering through a partnership with Coinbase. The two firms created new access points for institutional crypto adoption through the connection of their Coinbase Prime and Aladdin platforms.\n\nIf the SEC was to approve BlackRock’s filing, the launch of a spot bitcoin ETF by a large asset manager could help rebuild confidence in digital assets, which has been deflated by news including the collapse of FTX last year.\n\nRead more: Wild West in action: FTX’s fall from grace\n\nIt is still unclear whether the SEC will approve BlackRock’s filing. However, given that earlier this month, the regulator sued Coinbase alleging securities violations – as well as previous rejections for similar filings from other asset managers such as Grayscale – the SEC might exercise reluctance once again."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1kaXBzLWJlbG93LTI1ay1maXJzdC10aW1lLTMtbW9udGhz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin dips below $25K for the first time in 3 months - Cointelegraph",
        "content": "The price of Bitcoin (BTC) has fallen below the $25,000 mark for the first time since March 17 following a hawkish Fed announcement amid another turbulent week for the crypto industry.\n\nWithin the span of 30 minutes on June 15, the price of Bitcoin fell 4% from $25,867 to $24,819, according to data from TradingView. At the time of publication, Bitcoin had regained ground and was holding just above $25,000.\n\nBitcoin price from June 12 to June 15. Source: TradingView.\n\nOver the past week, Bitcoin had been holding around the $26,000 region as the market came to grips with the Securities and Exchange Commission’s legal action against crypto exchange heavyweights Coinbase and Binance, as well as increasing macroeconomic uncertainty around interest rate signals from the United States Federal Reserve.\n\nThe sharp drop in price arrived roughly three hours after the Federal Reserve announced a pause on interest rate hikes following a 15-month-long campaign of rate increases to combat surging inflation.\n\nWhile the market was almost unanimously expecting a rate pause, the Federal Open Markets Committee statement hinted at further rate hikes in the future, which typically blunts investor excitement for risk assets like cryptocurrencies.\n\nAccording to eToro market analyst Josh Gilbert, Federal Reserve Chair Jerome Powell has made it quite clear that this is only a temporary pause, something that could spell further trouble for Bitcoin in the long term.\n\n\"Much of the positivity we’ve seen from risk assets this year, including Bitcoin, is built on the expectation that inflation will fall and interest rates will peak, and then begin to be cut,\" Gilbert said.\n\n\"Inflation is moving in the right direction but the comments from Jerome Powell signify that rates could stay higher for longer, which would put Bitcoin on the back foot.\"\n\nRelated: SEC, CPI and a ‘strong rebound’ — 5 things to know in Bitcoin this week\n\nThe second largest cryptocurrency by market cap, Ether (ETH), also took a hit, falling more than 5% from $1,727 to $1,631 in the same time frame. Altcoins were not spared from the bearish sentiment either, with many of the tokens labeled as securities in the SEC’s lawsuits stumbling another than 3%.\n\nCardano (ADA) is currently down 3.4% in the last 24 hours, while Polygon (MATIC) and Solana (SOL) fell 3.3% and 2.8% respectively.\n\nAccording to Cointelegraph analyst Marcel Pechman, current options data for Bitcoin suggests a further slide to the downside, especially when considering the regulatory hostility towards the crypto industry on U.S. soil combined with the likelihood of further rate increases from the Fed in the coming months.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nUpdate (June 15, 1:40am UTC): This article has been updated to include comments from eToro market analyst Josh Gilbert."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaW5hbmNlLWxhdW5jaGVzLWJpdGNvaW4tbWluaW5nLWNsb3VkLXNlcnZpY2VzLWFtaWQtc2VjLWNyYWNrZG93bi1pbi10aGUtdXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Binance launches Bitcoin mining cloud services amid SEC crackdown in the US - Cointelegraph",
        "content": "Crypto exchange Binance announced the launch of new subscription-based could mining products dedicated to Bitcoin (BTC) mining.\n\nStarting June 15, users that are interested in Bitcoin mining but lack the equipment can subscribe to Binance’s cloud mining services and purchase hashrates for the same. Hashrate is the computing power required for confirming and legitimizing Bitcoin transactions over the blockchain.\n\nBinance is currently selling 1 Terahash per second (Th/s) at $10.7280, which is split between the hashrate and electricity costs at $1.17 and $9.558 respectively. A higher number of hashrate increases the probability of a higher income in terms of the Bitcoin earned through mining.\n\nBinance offers Bitcoin mining service via cloud. Source: Binance\n\nBinance’s BTC mining subscription service will be active for 180 days, or roughly six months. For each TH/s purchased, users will be able to earn 0.0004338 BTC during the timeline.\n\nAs the product is launched on Binance’s global website, the service is not available for crypto investors residing in the United States. In a previous statement to Cointelegraph about the recent Securities and Exchange Commission crackdown in the U.S., Binance clarified that “Binance.com is a separate entity and our users will not be impacted by issues at Binance.US.\"\n\nRelated: Binance applies to deregister in Cyprus, says focus is on ‘larger markets’\n\nTo fight against the allegations of SEC, Binance.US hired former SEC enforcement co-director George Canellos as part of its legal team.\n\nReacting the alleged development, “Binance is clearly preparing for a criminal prosecution and continuing to hire the best defense attorneys in the world,” said former SEC internet enforcement chief John Reed Stark on Twitter.\n\nThe legal scrutiny began when SEC alleged that Binance’s U.S. arm was operating as an unregistered exchange, broker and clearing agency. Following the SEC’s actions, on June 9, Binance.US announced the suspension of the U.S. dollar deposits and potentially pausing fiat withdrawals starting as early as June 13.\n\nMagazine: Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItY3J5cHRvLXBvbHlnb24tc29sYW5hLWNhcmRhbm8tYm5iL9IBSWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItY3J5cHRvLXBvbHlnb24tc29sYW5hLWNhcmRhbm8tYm5iL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin edges up after slump, Ether little-changed, other top 10 tokens mixed - Forkast News",
        "content": "Bitcoin rose in Friday morning trading in Asia, after falling below US$25,000 overnight and overall posting a losing week, a trend mirrored by Ether. The rest of the top 10 non-stablecoin cryptocurrencies were mixed after finding little impetus from the U.S. Fed decision in the week to leave interest rates unchanged. Polygon’s Matic token had the biggest decline in the top 10 amid sharp falls in altcoins since the U.S. regulator last week labeled many of them illegally issued financial securities.\n\nBumpy week\n\nBitcoin added 2.05% over the last 24 hours to US$25,573.56 at 6:30 a.m. in Hong Kong, but lost 3.83% in the last seven days, according to CoinMarketCap data. The world’s largest cryptocurrency, with a market capitalization of about US$497 billion, slipped to US$24,797.17 at around 8:00 p.m. on Thursday, the lowest since March 16.\n\nEther traded little changed at US$1,665.73, up a slight 0.78%, but posting a weekly loss of 10.06%.\n\nSolana led gains among the top 10 tokens by market capitalization, rising 3% to US$14.88, but still down 21.58% for the past seven days. The Solana community on Twitter is throwing around the idea of a hard fork to avoid further scrutiny from U.S. regulators, but such an idea is not being discussed among Solana developers, according to Decrypt.\n\nPolygon’s Matic was the biggest loser out of the top 10, dropping 4.06% to US$0.5952 to bring the week’s loss to 24.06%.\n\nMost of the top 10 have been on a roller-coaster ride since the U.S. Securities and Exchange Commission’s (SEC) filed lawsuits against crypto exchanges Binance.US and Coinbase in the week of June 5. The SEC also named dozens of altcoins as financial securities, including Solana, Cardano, Polygon and BNB.\n\nThose four tokens combined had a market capitalization of US$57.5 billion as of Friday morning in Asia, which is a sharp 26.5% slump from the US$78.27 billion prior to the SEC’s lawsuits.\n\n“Many notable altcoins, such as Matic, were listed as securities in recent SEC lawsuits, so venture capital firms have been selling their altcoin holdings to capture the little liquidity left and lessen the blow to their portfolios,” said Nick Ruck, the chief operating officer of blockchain venture studio ContentFi Lab, in a Telegram message to Forkast.\n\n“Institutions are managing portfolio risk and preparing for a continued downtrend amid less market liquidity and tighter regulations,” he said.\n\nIn related moves, U.S.-based trading platform Robinhood delisted Cardano, Polygon and Solana, while the eToro platform halted user purchases of Polygon, Decentraland, Algorand and Dash — which were all named in the SEC’s legal filings.\n\nThe crypto market seemed to find little relief in the move this week by the Federal Reserve to pause interest rate increases.\n\n“This pause, or skip seems to be a more tactical move, but the fight against inflation is not over yet,” said Michiel Janssen, trader and analyst at crypto hedge fund AltTab Capital, in an email statement shared with Forkast.\n\n“For crypto this means in the short term that there is less money flowing into the crypto markets. In the longer run, higher inflation and further problems in the banking sector can be a positive for crypto.”\n\nThe total cryptocurrency market cap increased 1.21% to US$1.04 trillion in the last 24 hours, while crypto trading volume fell 18.55% to US$37.82 billion, according to CoinMarketCap data.\n\n“Grails” sales hit US$17 million\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index lost 1.39% to 2,884.87 in the 24 hours to 7:30 a.m. in Hong Kong. The index is down 10.46% for the week.\n\nTotal NFT transactions fell 25.96% to US$18.58 million. Transaction on Ethereum, the leading NFT blockchain, dropped 10.50% to US$13.2 million.\n\nTransactions on the Bitcoin network, the second largest NFT blockchain, plunged 72.91% to US$1.12 million.\n\nOn Thursday, global auction house Sotheby’s finished its second round of sales of NFTs from the “Grails” collection. “Grails” consists of non-fungible token (NFT) artwork that belongs to the bankrupt crypto hedge fund Three Arrows Capital and its NFT-purchasing fund Starry Night Capital.\n\nSingapore-based Three Arrows Capital, a crypto hedge fund that once managed as much as US$10 billion, filed for Chapter 15 bankruptcy in July 2022, which protects assets of insolvent foreign debtors from U.S. creditors.\n\nIn February this year, Three Arrows Capital’s U.S.-based liquidator Teneo said that it plans to sell NFTs owned by the company with an estimated value of US$22 million at the time of the bankruptcy filing.\n\nThe second auction brought in nearly US$11 million in sales, including Dmitri Cherniak’s “The Goose” or Ringers #879, which was sold for US$6.2 million alone. The collection has raised a running total of US$17 million in Sotheby’s sales.\n\n“While the NFT community is excited by today’s major art sales from the Sotheby’s auction, that isn’t money that will flow back into NFTs,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News. “These were seized NFTs from 3AC and that money will go to recouping losses.”\n\nIn other transactions, the NFT staple Bored Ape Yacht Club topped sales by collection, selling US$1.11 million in the last 24 hours.\n\nMythos chain-powered DMarket game NFTs came second with US$899,694 in sales, with over 51,000 transactions in the past day.\n\nU.S. stock futures drop after Thursday rally\n\nImage: Envato Elements\n\nU.S. stock futures fell as of 10:00 a.m. in Hong Kong after rallying during the regular trading day on Thursday. Dow Jones Industrial Average futures fell 0.15%, S&P 500 futures edged 0.21% lower and Nasdaq Futures lost 0.33%.\n\nThe Dow rose 1.26% on Thursday, S&P gained 1.22% and the Nasdaq Composite added 1.15% as optimism grew that the Federal Reserve’s interest rate hikes are near the peak, according to Trading Economics.\n\nThe U.S. central bank left interest rates unchanged at 5% to 5.25% after its meeting on Wednesday. The rate is at its highest since 2006 after ten consecutive hikes that started in March 2022 to slow the pace of inflation that surged to 40-year highs at one stage last year. The central bank warned of two more rate hikes by the end of 2023.\n\nThe European Central Bank raised its interest rates for the eighth consecutive time on Thursday, adding 25 basis points.\n\nThe next Federal Open Market Committee meeting is scheduled for July 25 to 26.\n\nThe CME FedWatch Tool predicts a 28.1% chance the Fed will leave rates as is at July’s meeting, while 71.9% says the Fed will raise by 25 basis points.\n\n(Updates with equities section.)"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLW1ldHJpY3Mtc2ltaWxhcml0aWVzLTIwMjAtYnJlYWtvdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "3 Bitcoin price metrics showing 'insane' similarities to 2020 breakout - Cointelegraph",
        "content": "Bitcoin (BTC) is copying the prelude to its 2020 breakout to an “insane” extent, the co-founders of Glassnode have said.\n\nIn a tweet on June 15, Yann Allemann and Jan Happel highlighted three BTC price metrics that are anything but bearish.\n\nMetrics echo Bitcoin’s “major reversals and rallies”\n\nBTC/USD reached local highs of $31,000 in April but, since then, has dipped around 20%. Sentiment has taken a beating in the process, with downward price predictions becoming the norm in the intervening weeks.\n\nWhile recent events have placed additional pressure on the market, Allemann and Happel see at least three good reasons for optimism.\n\nSeveral on-chain indicators, they revealed, now look uncannily like they did in Q3 2020, just before BTC/USD beat its old 2017 all-time high of $20,000.\n\n“The resemblance to Sep 04, 2020, is insane…,” they wrote in part of commentary.\n\nLeading the line-up is the classic relative strength index (RSI), which measures how overbought or oversold BTC/USD is at a specific price point.\n\nDaily RSI currently measures 35, data from Cointelegraph Markets Pro and TradingView confirms. This is its lowest reading since early March, just before Bitcoin’s most recent uptick, which resulted in the $31,000 peak a month later.\n\n“RSI is at levels that led to major reversals and rallies,” the post explained.\n\nBTC/USD 1-day candle chart on Bitstamp with RSI. Source: TradingView\n\nContinuing, Allemann and Happel flagged the Cipher B readings for Bitcoin, these coming from a collection of algorithms that converge to offer signals of, among other things, when to buy dips during bull markets.\n\n“Cipher b wave trends are at levels that led to major reversals and rallies,” they repeated.\n\nFinally, the appropriately named Bitcoin Risk Signal is back at its Sept. 4, 2020 position. Risk Signal predicts the likelihood of a major BTC price drawdown and, at that time, saw a spike to “high risk” before receding.\n\nWhat happened next was a flat Risk Signal reading for successive months, while BTC/USD broke higher.\n\nBitcoin Risk Signal chart. Source: Glassnode\n\nHodlers big and small increase BTC exposure\n\nElsewhere, Glassnode flagged encouraging signs suggesting investors keeping the faith long term.\n\nRelated: ‘Pick your targets’ — Bitcoin analyst believes Fed will favor bulls\n\nFor lead on-chain analyst Checkmate, accumulation among existing hodlers remained impressive.\n\n“Pretty doomy out there,” he tweeted about sentiment on June 15."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYmVsb3ctdXMyNTAwMC1hbGwtdG9wLTEwLWNyeXB0b3MtZmFsbC_SAUdodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWJlbG93LXVzMjUwMDAtYWxsLXRvcC0xMC1jcnlwdG9zLWZhbGwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin below US$25,000; all top 10 cryptos fall - Forkast News",
        "content": "Bitcoin traded below US$25,000 on Thursday afternoon in Asia for the first time since March 17 this year, when it stood at US$24,973. Ether, alongside all other top 10 non-stablecoin cryptocurrencies, also dropped amid lawsuits by the U.S. Securities and Exchange Commission (SEC) against two of the world’s biggest crypto exchanges, Binance and Coinbase. As widely expected, the U.S. Federal Reserve left interest rates unchanged on Wednesday. However, the Fed warned of more rate rises to come later in the year as the central bank attempts to bring inflation down to its 2% target level.\n\nSee related article: Hong Kong? Singapore? Tokyo? Seoul? Dubai? The race is on for the Web3 hub of Asia | Part 1\n\nBitcoin continues slide; SEC-targeted coins drop\n\nBitcoin, the world’s biggest cryptocurrency by market capitalization, dropped 3.82% to US$24,909 in the 24 hours to 4 p.m. in Hong Kong. That brought its weekly losses to 5.80%, according to CoinMarketCap data. The dip took Bitcoin below US$25,000 for the first time in the week since the U.S. SEC filed lawsuits against Binance.US and Coinbase.\n\nEther, the second biggest cryptocurrency after Bitcoin, lost 6.10% to US$1,635 in 24 hours, and has dropped 11.24% on the week. Ether dropped below US$1,700 on Thursday afternoon in Asia for the first time since March 17 when it stood at US$1,667.13.\n\nSolana, Cardano and Polygon – the top three cryptocurrencies named as securities by the U.S. SEC in its lawsuits against both Binance.US and Coinbase – each dropped more than 20% over the past week.\n\nCardano’s ADA token lost 5.76% to US$0.2561 in the past 24 hours. Its market capitalization was also down 7.10% in the last 24 hours to US$8.88 billion. On June 5 — the day the SEC filed a legal complaint against Binance.US claiming crypto tokens including ADA, Solana and Polygon’s Matic are securities requiring registration and regulation — that figure stood at US$13.02 billion.\n\nSolana dropped 1.87% in the past 24 hours to US$14.78. Its market cap declined 2.75% to US$5.88 billion in the same period, down from US$8.15 billion on June 5.\n\nPolygon’s Matic token also dived 4.94% to US$0.6151 in the past 24 hours. Its market cap lost 5.92% to US$5.70 billion in that period, down from US$8.01 billion on June 5.\n\n“The status of individual cryptocurrencies has led some exchanges in specific markets to contemplate delisting some of the larger and widely followed altcoins such as ADA, SOL, and MATIC,” said Robert Quartly-Janeiro, Chief Strategy Officer of crypto exchange Bitrue, in an emailed statement.\n\n“What sets the current situation apart is the regulatory focus shifting from market-providing exchanges to scrutinizing individual altcoins: that’s a step change. In raw numbers, the affected coins have experienced bearish performances, with Cardano dropping by 24%, Solana down by 28%, and Polygon shedding 27% in the past week. Other altcoins witnessed similar declines,” Quartly-Janeiro added.\n\nRipple’s XRP token led the losers in the crypto top 10. It fell 6.45% in 24 hours to US$0.4697, posting a weekly loss of 9.87%.\n\nThose losses came despite the release of the so-called “Hinman documents” this week. The documents suggests that cryptocurrencies liker Ether are not in fact securities, as claimed by the SEC. Its release was therefore widely expected to prove favorable for Ripple in its own ongoing legal battle with the regulator, which began December 2020.\n\nBNB, the native token of the world’s biggest crypto exchange Binance — whose U.S. operations are now the target of the SEC’s regulatory clampdown — lost 4.49% in the 24 hours to US$235.83, and is down 9.66% on the week.\n\nThe global crypto market capitalization dropped 3.53% to US$1.02 trillion, while total crypto market volume gained 22.04% to US$38.21 billion in the last 24 hours.\n\nNFT sales drop; Sotheby’s to host auction in New York\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 0.88% to 2,904.24 in the past 24 hours, after losing 10.77% in the last seven days.\n\nThe Forkast ETH NFT Composite also dropped 1.04% to 1,029.13, and is down 6.73% on the week. Similarly, sales on Ethereum, the leading blockchain by volume, dived 6.77% to US$13.47 million over the last 24 hours.\n\nEthereum-based Bored Ape Yacht Club topped sales by collection in the past 24 hours, rising 95.90% to US$1.32 million. But, according to Yehudah Petscher, NFT Strategist at Forkast Labs, trading in the market is now so thin that little can be read into even such a large swing.\n\n“In general, volume is just so low, so on any given day it can be up or down a big percentage just from typical trading,” he explained.\n\nAmong other developments in the industry, Sotheby’s, the world’s largest art auctioneer, will host Grails: Part II, a live digital art auction in New York, on Thursday. The auction will feature some of the most renowned generative artists in the NFT space. As much as US$10 million is expected to change hands over the course of the auction. Featured artists will include Art Blocks founder Snowfro, Tyler Hobbs, creator of Fidenzas, and Dmitri Cherniak, creator of Ringers.\n\n“The holy grail is the Ringers #879 (The Goose) by Dmitri Cherniak that is rumored to have bidders willing to pay well over the projected US$1-3 million sale price,” Petscher said about the auction.\n\nElsewhere, SuperRare, a curated NFT marketplace for digital artworks, has introduced “Fragments of The Dreams: A Surrealist Vision,” a new exhibition that showcases a collection of surrealist photography from SuperRare artists including Ben Zank, Brooke DiDonato, and Cowboy Killer.\n\nFounded in 2018, SuperRare has recorded over US$300 million in total sales and over US$180 million earned by artists to date, according to an emailed statement by the public relations spokesperson for the company.\n\nMeanwhile, Be., a subsidiary of Animoca Brands, and the Australian Football League (AFL) has announced the Throwbacks series. The group of AFL collectible NFTs feature well-known moments from the sport’s past, highlights, and player profiles.\n\nSimilarly, Mocaverse, the Animoca Brands membership NFT collection, has partnered with Rarible, an NFT platform for creators and brands, to launch Mocaverse Marketplace. The Mocaverse Marketplace will offer 0% platform fees on native listings of its collection to the Mocaverse community, the company said in an emailed statement.\n\nAsian equities rise; European bourses, U.S. futures drop\n\nImage: Envato Elements\n\nAsian equities mostly rose on Thursday, after the People’s Bank of China lowered medium term lending rates to some financial institutions. The central bank reduced roughly US$33.1 billion worth of one-year medium-term loans by 10 basis points to 2.65% from 2.75%..\n\nThe Shanghai Composite gained 0.74% and the Shenzhen Component Index rose 1.81%. Hong Kong’s Hang Seng Index rose 2.17% but Japan’s Nikkei 225 fell slightly by 0.05%.\n\nU.S. stock futures dropped as of 8.30 p.m. in Hong Kong. The Dow Jones Industrial Average futures fell 0.16%, and S&P 500 futures lost 0.36%. Nasdaq 100 Futures also dropped 0.66%.\n\nU.S. retail sales unexpectedly rose 0.3% month-on-month in May, after a 0.4% increase in April, beating the expected 0.1% decline.\n\nOn Wednesday, the U.S. Federal Reserve kept its interest rates unchanged at 5% to 5.25% but signaled it may raise rates later in the year.\n\n“Both core and headline inflation are coming down, but core is still pretty high. The target of 2% is still way off,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an emailed statement.\n\n“And the Fed is obsessing over the tightness of the labor market as, despite the 15-month-long inflation battle, unemployment is still near record lows. As such, I wouldn’t be surprised at all if rates were hiked to 6% by the end of 2023,” Green added.\n\nThe European Central Bank raised interest rates by an expected 25 basis points on Thursday to 3.5%, the highest rate since the financial crisis of 2008.\n\nThe benchmark STOXX 600 dropped 0.59% and Germany’s DAX 40 lost 0.86% during afternoon trading hours in Europe.\n\n“With inflation coming back as a key threat, coupled with the Fed’s focus now firmly on bringing inflation back to the 2% target, the case for including commodities in portfolios grows stronger,” Oliver Taylor, multi-asset fund manager, and Joven Lee, multi-asset strategist, at Schroders, said in a note on Thursday.\n\n“Multi-asset investors should re-consider commodities as a strategic holding in portfolios. An arbitrary 10% allocation to commodities could provide a pickup of ~0.3% expected returns for portfolios with 10% expected volatility,” Taylor and Lee added."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xNDQ3ODYvYml0Y29pbi13aGFsZS1tb3Zlcy1taWxsaW9uLWFmdGVyLTEzLXllYXJz0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NDc4Ni9iaXRjb2luLXdoYWxlLW1vdmVzLW1pbGxpb24tYWZ0ZXItMTMteWVhcnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Whale Moves $1.2 Million After 13 Years of Inactivity - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMore than $1.2 million in Bitcoin that had not budged for over 13 years just moved.\n\nA whale transferred the stash—50 BTC in total—to another wallet on Thursday, according to blockchain data.\n\nThe coins were mined back in June 2010 and had been sitting still ever since.\n\nAD\n\nAD\n\nPreviously untouched Bitcoin has been making movements lately: In April, a holder who hadn’t touched their coins for a decade moved $7.8 million-worth of Bitcoin to new wallets.\n\nJust days later, another long-term investor (or investors) moved $11 million in so-called digital gold after 11 years of inactivity.\n\nBitcoin “whales” are investors who hoard huge amounts of cryptocurrency, many of whom don’t touch it for years. It is not clear from blockchain data whether they are individuals, companies, or other entities.\n\nKirill Kretov, a developer of tools for automated trading, told Decrypt that Bitcoin mined back in 2009-2010 was mainly “IT geeks” but added that it was also possible “some commercial entity acquired those wallets from individuals in some later years, preserving the status of those addresses in blockchain.”\n\nLong-term “HODLers” are the most successful investors, while inexperienced retail investors who buy and sell crypto in the short-term largely lose out, according to research.\n\nAD\n\nAD\n\nThis is because over the long-term, Bitcoin—despite its volatility—has significantly increased in value. A decade ago, the asset was priced at under $100 per coin.\n\nIf you're a short-term investor, Bitcoin has taken a beating today—it’s priced at $25,028 per coin, down 3.7% in the past 24 hours, according to CoinGecko, and nearly 7% in the past week. The asset has taken the rest of the crypto market with it and major altcoins like Ethereum and Cardano have plunged in price as investors weigh up what to do with the Federal Reserve’s latest decision to not hike interest rates.\n\nBut the biggest cryptocurrency by market cap is still up nearly 25,000% in 10 years, making the long-term hold strategy a winner for investors."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aGljaC1hbHRjb2lucy13aWxsLXN1cnZpdmUtdGhlLXNlYy1iaXRjb2luLW9nLWV4cGxhaW5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Which altcoins will survive the SEC crackdown? Bitcoin OG explains - Cointelegraph",
        "content": "Proof-of-work coins that had a fair distribution at their launch are the most likely to avoid being labeled as securities by the United States Securities and Exchange Commission (SEC), according to Bitcoin OG and educator Dan Held.\n\nLast week, the SEC sued Binance and Coinbase, accusing them of offering a number of altcoins as unregistered securities. As a result, many of the tokens mentioned in the lawsuit were delisted by major trading platforms, which tanked their prices.\n\nAccording to Held, Tokens that “had fair or transparent launches,” such as Litecoin (LTC), Dogecoin (DOGE) and Monero (XMR), do not match the definition of a security that the SEC is following and are likely to avoid the current crackdown.\n\nRelated: SEC charges against Binance and Coinbase are terrible for DeFi\n\n“It definitely seems like the SEC has carved that out as something that they won’t be going after,” he said in an exclusive interview with Cointelegraph.\n\nAccording to Held, the vast majority of the tokens classified as securities by the SEC in its lawsuit against Coinbase and Binance were proof-of-stake coins, or tokens with a pre-mined distribution, meaning they have more centralized ownership.\n\nHeld also said the current crackdown is mainly carried out by a single government entity, the SEC, which means the level of pressure on the industry is still far from reaching the maximum level.\n\nHeld also stated that only Bitcoin (BTC) and a few other decentralized cryptocurrencies would survive in the long run, as they are the only ones that can endure an all-out government attack.\n\nTo find out more about which cryptocurrencies can resist the ongoing SEC crackdown, watch the full video on our YouTube channel and don’t forget to subscribe!"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90di9maXJzdC1tb3Zlci9iaXRjb2luLWRyb3BzLWJlbG93LTI1ay1iYW5rcnVwdC1jcnlwdG8tZXhjaGFuZ2UtYml0dHJleC11cy1zZXQtdG8tYWxsb3ctd2l0aGRyYXdhbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Drops Below $25K; Bankrupt Crypto Exchange Bittrex U.S. Set to Allow Withdrawals - CoinDesk",
        "content": "Emily Parker was CoinDesk's executive director of global content. Previously, Emily was a member of the Policy Planning staff at the U.S. State Department, where she advised on Internet freedom and digital diplomacy. Emily was a writer/editor at The Wall Street Journal and an editor at The New York Times. She is the co-founder of LongHash, a blockchain startup that focuses on Asian markets. She is the author of \"Now I Know Who My Comrades Are: Voices From the Internet Underground\" (Farrar, Straus & Giroux). The book tells the stories of Internet activists in China, Cuba and Russia. Mario Vargas Llosa, winner of the Nobel Prize for Literature, called it \"a rigorously researched and reported account that reads like a thriller.\" She was chief strategy officer at Silicon Valley social media startup Parlio, which was acquired by Quora. She has done public speaking all over the world, and is currently represented by the Leigh Bureau. She has been interviewed on CNN, MSNBC, NPR, BBC and many other television and radio shows. Her book has been assigned at Harvard, Yale, Columbia, Tufts, UCSD and other schools. Emily speaks Chinese, Japanese, French and Spanish. She graduated with Honors from Brown University and has a Masters from Harvard in East Asian Studies. She holds Bitcoin, Ether and smaller amounts of other cryptocurrencies."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzE2L3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1odXQtOC1taW5pbmctY29ycC1hcmUtcmlzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Hut 8 Mining Stock Are Rising Today - The Motley Fool",
        "content": "What happened\n\nSeveral cryptocurrencies and crypto stocks rose today after BlackRock (BLK -0.43%), the largest asset manager in the world, filed to launch a spot Bitcoin exchange-traded fund (ETF).\n\nSince late afternoon yesterday, the price of Bitcoin traded 4.5% higher as of 3:42 p.m. ET today. The price of the world's second-largest cryptocurrency, Ethereum, traded 3.9% higher, while shares of the Bitcoin miner Hut 8 Mining (HUT) were up 14.5%.\n\nSo what\n\nBitcoin and other cryptocurrencies have struggled this week, dipping after the Federal Reserve indicated Wednesday that it thinks it will need to raise interest rates two more times this year.\n\nRiskier assets like Bitcoin typically don't perform well in a rising-rate environment because investors can get higher yields in safer assets. Cryptocurrencies have rallied this year on the belief that the Fed would soon be done with its aggressive rate-hiking.\n\nToday, though, investors seemed to overlook these concerns as BlackRock submitted a filing to the Securities and Exchange Commission (SEC) to launch a Bitcoin ETF, which would be the first spot crypto ETF if approved.\n\nDespite the plan's rejections in the past, some experts believe the proposal has a chance because BlackRock wants to enter a \"surveillance-sharing agreement,\" meaning it would share data about trading activity and their customers, in an effort to prevent market manipulation."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLWJ0Yy11c2QtZmVkLWludGVyZXN0LXJhdGVzLXJlZ3VsYXRpb24tYmluYW5jZS1jb2luYmFzZS0yMDIzLTbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Falls Below $25,000 Amid Hawkish Fed, Tighter Regulation - Markets Insider",
        "content": "Bitcoin fell below $25,000 on Thursday, as monetary policy adds to pressure from regulators.\n\nCentral bankers held interest rates steady but signaled more rate hikes to come.\n\nCrypto markets have been reeling from SEC lawsuits targeting Binance and Coinbase.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin fell below $25,000 early on Thursday, as digital assets take a hit from an aggressive crackdown by US regulators and hawkish signals from the Federal Reserve.\n\nThe world's biggest cryptocurrency by market value traded lower to $24,897 on Thursday morning, down around 4% from $25,930 on Wednesday. Ethereum, meanwhile, fell to $1,636, down nearly 6% from Wednesday's levels.\n\nThe slump came shortly after the Fed kept interest rates steady at the conclusion of its two-day policy meeting, but signaled that more interest rate hikes could come later this year as central bankers continue to wage war against inflation.\n\nThe central bank's dot-plot of projected rate moves and Chairman Jerome Powell's \"hawkish pause\" spooked traders, who had been thinking going into the meeting that the Fed could be about to signal its rate-hike campaign was over.\n\nAdvertisement\n\nMarkets are currently pricing in a 65% chance that the Fed will raise rates another 25 basis-points in July.\n\nTighter monetary policy is adding to pressures being exerted by regulators, with bitcoin and ethereum prices stumbling as the Securities and Exchange Commission looks to police the sector more tightly.\n\nBinance and Coinbase were sued this month by the SEC. The regulator's complaint states that both firms are operating illegally in the US and that they have broken rules by offering their customers unregulated securities.\n\nThe suits are part of the SEC's siege against the wider crypto industry, Binance said in a statement last week while denying the allegations. Experts told Insider that the lawsuits could set a precedent for how crypto firms are treated in the US, potentially leading to an existential crisis for the crypto industry at large."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9ibGFja3JvY2stZmlyc3Qtc3BvdC1iaXRjb2luLWV0Zi1idGMtY29pbmJhc2Utc2VjLW1pa2Utbm92b2dyYXR6LTIwMjMtNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock's Planned ETF Would Be 'the Best Thing' for Bitcoin: Novogratz - Markets Insider",
        "content": "BlackRock is seeking to launch the first spot bitcoin exchange-traded fund in the US, per an SEC filing.\n\nThe world's largest asset manager filed an application Thursday to launch the iShares Bitcoin Trust.\n\nBillionaire crypto investor Mike Novogratz said the ETF, if successful, would be the \"best thing\" for bitcoin.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBlackRock is pushing to launch the first spot bitcoin exchange-traded fund in the US, even as the crypto sector faces a regulatory crackdown in the country.\n\nThe world's biggest asset manager filed an application with the Securities and Exchange Commission on Thursday to create the iShares Bitcoin Trust, using Coinbase as its custodian.\n\nIf approved, the ETF would trade on the Nasdaq exchange and allow investors easy exposure to the crypto market through one of the top names of the investment world. That could be a watershed moment for the digital-asset industry in the US - and would be a great boost for bitcoin, according Galaxy Digital CEO Mike Novogratz.\n\n\"The Shares are intended to constitute a simple means of making an investment similar to an investment in bitcoin rather than by acquiring, holding and trading bitcoin directly on a peer-to-peer or other basis or via a digital asset exchange,\" the filing said.\n\nAdvertisement\n\nThe move comes at a time when the crypto industry faces intense scrutiny from US regulators, following the collapse of Sam Bankman-Fried's FTX. Coinbase itself, along with Binance, the two largest crypto players in the industry, were both recently sued by the SEC for allegedly operating unregistered securities.\n\nBillionaire crypto bull Novogratz hailed BlackRock's move as a potential win for bitcoin, should it be successful.\n\n\"@BlackRock getting a $BTC ETF through would be the best thing that could happen to $BTC,\" he said in a tweet.\n\nBlackRock is a global leader in the ETF industry, with its funds among the most-watched funds across asset classes - the company's largest iShares Core S&P 500 ETF IVV holds $325.75 billion in assets. Should the money manager be successful in its crypto foray, that could be seen as a major vote of confidence for the crypto industry from institutional investors.\n\nAdvertisement\n\nBitcoin was trading 2.8% higher on the day at $25,565, as of last check on Friday."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JsYWNrcm9jay1maWxlcy1mb3Itc3BvdC1iaXRjb2luLWV0Zi10YXBzLWNvaW5iYXNlLWFzLWN1c3RvZGlhbi_SAVlodHRwczovL2Zvcmthc3QubmV3cy9ibGFja3JvY2stZmlsZXMtZm9yLXNwb3QtYml0Y29pbi1ldGYtdGFwcy1jb2luYmFzZS1hcy1jdXN0b2RpYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock files for spot Bitcoin ETF, taps Coinbase as custodian - Forkast News",
        "content": "BlackRock, which manages about US$10 trillion as the world’s biggest asset manager, has filed to launch the first publicly traded spot Bitcoin exchange-traded fund (ETF) in the U.S., even as regulators in the country file lawsuits against cryptocurrency platforms for alleged violations of securities laws.\n\nBlackRock said in a Thursday filing to the Securities and Exchange Commission (SEC) it intends to launch the “iShares Bitcoin Trust” with Coinbase Custody Trust Co. as the custodian for the Bitcoin. The ETF, if approved, will be listed on Nasdaq.\n\nThe application comes after the SEC last week sued Coinbase and Binance.US., two of the industry’s biggest crypto exchanges, for allegedly breaching securities rules. That adds to uncertainties the SEC will approve the ETF, given that a Coinbase unit would act as custodian for the product.\n\nEric Balchunas, a senior ETF analyst at Bloomberg, tweeted Thursday that the BlackRock filing is a “shocker.”\n\n“There’s been no signs at all SEC willing to approve, but BlackRock is very connected so maybe they know something?” Balchunas said.\n\nApproval of a spot-traded Bitcoin ETF in the world’s biggest economy and largest financial market is seen by many investors as a stamp of approval for the digital currency and would likely unlock significant amounts of institutional investment in Bitcoin.\n\nChokepoint?\n\nHowever, some in the crypto industry reacted negatively to the BlackRock development, raising “Operation Chokepoint” theories that suggest governments and traditional finance aim to derail the industry because it poses a threat to their interests.\n\n“If BlackRock’s spot ETF application gets approved, it is undeniable that Operation Chokepoint 2.0 was orchestrated to drive out crypto native companies and bring in large traditional firms that are buddy-buddy with the U.S. [government] to try and control Bitcoin [and] crypto,” Will Clemente, co-founder of digital asset research firm Reflexivity Research, said Thursday on Twitter to his 683,700 followers.\n\nIn the SEC filing, BlackRock said: “The Shares are intended to constitute a simple means of making an investment similar to an investment in bitcoin rather than by acquiring, holding and trading bitcoin directly on a peer-to-peer or other basis or via a digital asset exchange,”\n\nThe SEC has previously rejected similar applications for spot Bitcoin ETFs filed by Grayscale, WisdomTree and VanEck. In June 2022, Grayscale sued the SEC for rejecting its application, saying the regulator failed to apply consistent treatment to similar investment vehicles.\n\nThe securities regulator, however, has approved a number of Bitcoin futures-based ETFs.\n\nComplex\n\nTraditional retail exchanges and brokers, such as Robinhood and eToro, are “navigating complex terrain when venturing into crypto,” Jeff Feng, co-founder of Sei Labs, the company behind the Sei trading blockchain, told Forkast via email.\n\n“The absence of explicit regulatory guidelines has caused setbacks, leading to some tokens being delisted resulting in crypto market volatility,” said Feng, a former Goldman Sachs analyst. “Nonetheless, these teething issues are part of the broader industry’s evolutionary process.”\n\nBalchunas at Bloomberg added that the BlackRock filing lists the factors that could adversely affect the price of Bitcoin, and “they list the exchanges, which ‘are largely unregulated and may be subject to manipulation’ which is the SEC’s issue with approving ETF.”\n\nBitcoin gained 1.89% over the past 24 hours to trade at US$25,541 at 11:50 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization has risen 54.5% so far this year, but is still far below its peak at around US$64,000 recorded in November 2021."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jZWxzaXVzLXNlZWtzLXRvLWNvbnZlcnQtYWx0cy10by1iaXRjb2luLWFuZC1ldGhlci11bmRlci1yZW9yZ2FuaXphdGlvbi1wbGFu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Celsius seeks to convert alts to Bitcoin and Ether under reorganization plan - Cointelegraph",
        "content": "Defunct crypto lender Celsius has revised its bankruptcy filing, awaiting approval from a bankruptcy court in New York after a successful acquisition deal with the Fahrenheit crypto consortium. The crypto lender filed its reorganization plan on June 15.\n\nUnder the revised plan, Celsius will convert all altcoins from customers, with the exception of “Custody and Withhold accounts,” to Bitcoin (BTC) and Ether (ETH) starting from July 1.\n\nCelsius will be selling all altcoins from all customers (except Custody and Withhold accounts) starting July 1st and will be converting them into Bitcoin and Ethereum. — Celsians (@CelsiansNetwork) June 15, 2023\n\nThe new reorganization plan proposes to deal with the claims of retail borrowers through the set off treatment. The term “set off treatment” refers to comparing losses against profits in a given year. Losses that are not offset against income can be carried over and offset against income in later years. A Twitter user explained how the set off treatment would work for borrowers depending on the portion of the loan they have returned:\n\nIn your example, the customer took a $25k loan secured by 2 #BTC — let’s say the customer has paid 20% back and thus has $20k outstanding principal.\n\n\n\nIf the set-off counts the BTC at 7/13/22 prices, the collateral would be valued at about $40k.\n\n\n\nSubtract the $20k principal from… pic.twitter.com/ZCKC1xYegm — Cam Crews (@camcrews) June 10, 2023\n\nDavid Adler from the law firm McCarter & English tweeted that the restructuring proposal by Celsius could face opposition from the borrowers. He noted that the debtor (Celsius) is demanding repayment of the loans, yet it has no intention of fulfilling its contractual obligations, such as returning the collateral to the borrowers. This could be something borrowers would object to, he added.\n\n“This proposed ‘treatment’ violates every consumer lending law out there (state, federal) and the ad hoc Borrower group will be opposing this plan.“\n\nAdditionally, Celsius has asked permission to appoint Chris Ferraro as the foreign representative in connection with a British court’s Cross-Border Insolvency Regulations in the United Kingdom. In this way, the company’s U.K. assets would be safeguarded, and the United States Chapter 11 would be acknowledged as the “foreign main proceedings” to organize a global resolution.\n\nRelated: Celsius adds over 428K stETH to Lido’s lengthening withdrawal queue\n\nOn May 25, the Fahrenheit crypto consortium, which comprises venture capital firm Arrington Capital and miner US Bitcoin Corp, won the bid to acquire Celsius assets. At the time, Celsius assets were estimated to be worth roughly $2 billion. Under the new deal, the new company is expected to receive about $450–500 million worth of liquid cryptocurrency, while US Bitcoin Corp plans to construct a 100-megawatt Bitcoin (BTC) mining plant.\n\nCelsius paused withdrawals on June 13, 2022, after the firm became entangled in bad investments and crypto contagion following the collapse of the Terra ecosystem.\n\nMagazine: Tiffany Fong flames Celsius, FTX and NY Post: Hall of Flame"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLXBsdW5nZXMtMjRrLW5leHQv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvYnRjL2JpdGNvaW4tcHJpY2UtcGx1bmdlcy0yNGstbmV4dC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Price Plunges Further Post Fed Decision, $24K Next? - NewsBTC",
        "content": "Bitcoin price started a fresh decline below the $25,500 support. BTC is now at a risk of more losses toward the $24,000 support zone.\n\nBitcoin is gaining bearish momentum below the $25,500 support.\n\nThe price is trading below $25,500 and the 100 hourly Simple moving average.\n\nThere was a break below a key rising channel with support near $25,800 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could correct higher but upsides might be limited above $25,500.\n\nBitcoin Price Extends Decline\n\nBitcoin price failed to start a fresh increase above the $26,200 resistance zone. BTC failed to remain in a positive zone after the Fed interest rate decision and declined below the $25,500 support.\n\nThe price declined below the $25,400 support to trade to a new weekly low. Besides, there was a break below a key rising channel with support near $25,800 on the hourly chart of the BTC/USD pair. There was a move below the $25,000 support zone.\n\nA low is formed near $24,818 and the price is now consolidating losses. It is trading near the 23.6% Fib retracement level of the recent decline from the $26,063 swing high to the $24,818 low.\n\nBitcoin price is now trading below $25,500 and the 100 hourly Simple moving average. Immediate resistance is near the $25,200 level.\n\nSource: BTCUSD on TradingView.com\n\nThe first major resistance is near the $25,500 level. It is close to the 50% Fib retracement level of the recent decline from the $26,063 swing high to the $24,818 low. A clear move above the $25,500 resistance might start a fresh increase. The next major resistance is near the $26,000 level, above which the bulls might send BTC toward the $26,500 resistance zone.\n\nMore Losses in BTC?\n\nIf Bitcoin’s price fails to clear the $25,500 resistance, it could continue to move down. Immediate support on the downside is near the $24,800 level and the recent low.\n\nThe next major support is near the $24,500 level, below which the price might gain bearish momentum. In the stated case, the price could drop toward the $24,000 support in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now gaining pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level.\n\nMajor Support Levels – $24,800, followed by $24,500.\n\nMajor Resistance Levels – $25,200, $25,500, and $26,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluaW5nLWRpZmZpY3VsdHktcmlzZXMtMi0xOC10by1yZWNvcmQtYW1pZC1pbmNyZWFzaW5nLWNvbXBldGl0aW9uLWFtb25nLW1pbmVycy_SAXFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LXJpc2VzLTItMTgtdG8tcmVjb3JkLWFtaWQtaW5jcmVhc2luZy1jb21wZXRpdGlvbi1hbW9uZy1taW5lcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin mining difficulty rises 2.18% to record amid increasing competition among miners - Forkast News",
        "content": "Bitcoin’s mining difficulty level rose 2.18% on Wednesday to an all-time high. The level changes every two weeks and measures the additional computing power a miner has to use to verify transactions on a block. A higher difficulty indicates it is more competitive to mine Bitcoin, reducing profit. The network’s hashrate also increased to a record high.\n\nSee related article: What’s next for crypto miners after US debt ceiling deal?\n\nFast facts\n\nThe mining difficulty reading came in at 52.35 trillion at block height 794,304 in Wednesday’s adjustment. That follows a 3.4% rise in the previous adjustment on June 1, according to data from BTC.com.\n\nThe difficulty of mining Bitcoin typically rises when more miners are active, which increases the competition for rewards in Bitcoin in return for validating transactions on the network. The higher the difficulty, the less chance a miner has to secure an entire block on the chain, which in turn can reduce a miner’s profitability.\n\nMining difficulty adjustments are correlated to changes in hashrate, the level of computing power used for mining.\n\n“In short, difficulty follows hashrate up or down, and hashrate is driven by the overall profitability of building and operating bitcoin data centers,” Andrew Webber, chief of Digital Power Optimization that works with power producers to deploy Bitcoin mining operations, told Forkast in an emailed response earlier this month. “If Bitcoin spot price goes higher, it means larger profits for miners.”\n\nBitcoin’s hashrate was at around 392.6 exahashes per second on Wednesday, an increase from the 375.4 exahashes recorded during the previous adjustment on June 1, data from Blockchain.com shows.\n\nBitcoin fell 3.63% to US$25,045 in the last 24 hours to 11:10 a.m. in Hong Kong, but it was up about 51% so far this year, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization lost 5.01% in value over the past seven days.\n\nSee related article: Tether stablecoin issuer taps Uruguay for Bitcoin mining using renewable energy"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZGVjcnlwdC5jby8xNDUwMDAvYmxhY2tyb2NrLWJpdGNvaW4tZXRmLXJlYWwtZGVhbNIBP2h0dHBzOi8vZGVjcnlwdC5jby8xNDUwMDAvYmxhY2tyb2NrLWJpdGNvaW4tZXRmLXJlYWwtZGVhbD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock Bitcoin ETF Is the ‘Real Deal’—Is This Finally the One? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf you think something is out of the ordinary when one of the world’s most prestigious financial institutions applies for a cryptocurrency investment product during a tough regulatory crackdown, you wouldn’t be the only one.\n\nBlackRock, which manages $9.5 trillion in assets, rocked the crypto world yesterday when it applied to the U.S. Securities and Exchange Commission for a Bitcoin exchange-traded fund (ETF). Though the product is technically a trust, as several eagle-eyed observers on Crypto Twitter have pointed out, it is functionally the same as a true blue ETF, experts say.\n\nIt’s the “real deal,” according to Senior ETF Analyst at Bloomberg Eric Balchunas, who defended the “ETF” label yesterday on Twitter. Balchunas also pointed out that BlackRock is nearly undefeated when going up against the SEC, at 575-1, with nearly every single one of its ETF applications receiving the Commission’s blessing. Other Bitcoin ETF applicants over the years can’t say the same.\n\nAD\n\nAD\n\nTo all those saying the BlackRock filing is a trust and not an ETF. Do you consider $GLD to be an ETF? Well, this is same thing. Lot of structures under “ETF” umbrella. Nothing like $GBTC. This is the real deal. pic.twitter.com/p75ZKHGxK0 — Eric Balchunas (@EricBalchunas) June 16, 2023\n\nMany investment firms have applied for a Bitcoin ETF since 2013, only to face rejection from Wall Street’s top regulator—which cites concerns about market manipulation as reasons for not allowing such a product to exist in the States. An ETF is an investment vehicle that tracks the value of an underlying asset, like gold, foreign currencies, or Bitcoin.\n\nAsset managers VanEck, Ark Invest, and Bitwise have all been rejected by the regulator. The issue is so contentious, Grayscale Investments last year hit the SEC with a lawsuit after it said “no” to its application to convert its Grayscale Bitcoin Trust (GBTC) to an ETF.\n\nBut BlackRock’s application is different—and it comes at a strange time: The SEC this year has ramped up a fierce crackdown on the digital asset industry, hitting crypto firms with lawsuit after lawsuit and even hinting that the space isn’t welcome on U.S. shores at all.\n\nBlackRock, though, is no ordinary investment manager—it’s the world’s biggest. Not only that, it wants to work with Coinbase as a custodian (a company BlackRock has worked with before). The SEC last week sued the San Francisco-based exchange for allegedly offering and selling unregistered securities via its staking service.\n\nAD\n\nAD\n\n“I would say this is a total shocker,” Balchunas told Decrypt, adding that BlackRock’s move “has definitely breathed new life into the whole Bitcoin ETF race and new optimism.”\n\nHe went on to say that although he hadn’t seen anything that indicates that the SEC has changed its position, the fact that it was BlackRock applying makes this situation different.\n\n“It’s just that it’s BlackRock—it should give some hope, for sure,” he said.\n\nBlackRock is a serious institution. And the application says that Bank of New York Mellon would be the custodian for the Trust’s cash holdings—another reputable financial institution. According to Balchunas, BlackRock has been very successful in the past with getting ETFs approved.\n\n“BlackRock is just such an impressive, powerful, big, connected company,” added Balchunas. “And for them to see something here, I have to just sort of give them a lot of, I just give them a lot of respect. And so that's where I'm like, do they know something? What do they see?”\n\nFun fact: BlackRock's record of getting ETFs approved by the SEC is 575-1. That's another reason this is so big, they don't play around. https://t.co/f7YIhGRmLf — Eric Balchunas (@EricBalchunas) June 16, 2023\n\nThe debate on Twitter as to how BlackRock’s product, should it be approved, ought to be labeled is much ado about nothing, said Balchunas. He points out that the application states that the product would be grantor trust, which would make its structure similar to GLD Gold Trust, which everyone considers an ETF.\n\nBlackRock did not file for a bitcoin ETF. — Pomp 🌪 (@APompliano) June 15, 2023\n\nAD\n\nAD\n\n“You can try to be technical, but we’re okay with it just being called an ETF, because it really is in the spirit of the ETF or the structure. It really qualifies as an ETF,” he said.\n\nIs BlackRock finally the one that brings Bitcoin to the big dance? The current regulatory environment may prove difficult to manage, but the Wall Street giant certainly has the best odds yet."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDYxMjkwMjMxOS9lbi9PbkNoYWluTW9ua2V5LUxhdW5jaGVzLU9DTS1EaW1lbnNpb25zLXRoZS1Hcm91bmRicmVha2luZy1HZW5lcmF0aXZlLUFydC1Db2xsZWN0aW9uLW9uLUJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "OnChainMonkey Launches OCM Dimensions, the Groundbreaking Generative Art Collection on Bitcoin - Business Wire",
        "content": "REDMOND, Wash.--(BUSINESS WIRE)--OnChainMonkey (OCM) has announced the launch of its next NFT collection, OCM Dimensions. This significant milestone brings together art, engineering, technology, and innovation to enshrine a historic first-of-its-kind generative art collection on Bitcoin. Crafted entirely from code, OCM Dimensions showcases a groundbreaking way high-quality art can be inscribed on Bitcoin while using limited block space, a challenge that others have not overcome.\n\nThese iconic designs offer a stunning view of code on each satoshi, with detailed renderings of lighting, movement, and vibrancy. These NFTs are designed specifically for Bitcoin, as they are inscribed on satoshis from January 2009 (the month Bitcoin went live). Meticulously crafted by Metagood’s world-class art and engineering team, the OCM Dimensions NFTs are 3-dimensional, interactive, and dynamic, and the inscription technology used to generate them on-chain will set the standard for generative art on Bitcoin. Crafted entirely from code, OCM Dimensions showcases a groundbreaking way high-quality art can be inscribed on Bitcoin while using limited block space, a challenge that others have not overcome.\n\nBy bringing this groundbreaking collection to the Bitcoin blockchain, OnChainMonkey solidifies the platform as the undisputed home for high-value digital assets, offering groundbreaking artistic expression and true digital ownership.\n\n\"Metagood's vision for the OnChainMonkey community and the entire OCM project is to create a prosperous global nation that prioritizes financial enrichment, physical health, social connection, and purposeful impact,” said Danny Yang, co-founder and CEO of Metagood, the company behind the OnChainMonkey collection. \"Our latest collection offers community members the opportunity to become early adopters of not only historic, high-quality Bitcoin NFTs, but also the most efficiently inscribed Bitcoin NFTs available today.\"\n\nOCM Dimensions is one of the first 3D NFT collections on Bitcoin and demonstrates that these engaging pieces can be issued in an efficient way that does not impact the performance of the Bitcoin blockchain. Bitcoin miners and Bitcoin users will not be affected by the launch given our efficient way of inscribing. However, bitcoin HODLERs and miners will benefit from the launch of OCM Dimensions, as it secures even more high-value assets onto the increasingly valuable Bitcoin blockchain.\n\nMetagood, the creator of the OnChainMonkey collection, is a consistent leader in NFT technological innovation. Its first collection, OCM Genesis, minted the entire 10,000-strong collection on the Ethereum blockchain in a single transaction. This had never been done before and marked a milestone in NFT scalability. In February 2023, the OCM Genesis collection became the first-ever 10,000 PFP (profile picture) collection to also be inscribed on Bitcoin. In April 2023, Metagood partnered with Asprey Studio on the upcoming Asprey Bugatti Egg Collection. Metagood will be the digital asset partner inscribing digital counterparts of their luxury objets on the Bitcoin blockchain. Once again, OnChainMonkey and its partner company Metagood are revolutionizing NFTs with their groundbreaking OCM Dimensions collection, which will become the world-first 3D NFT collection to be fully inscribed on-chain on the Bitcoin network. The collection will utilize the Ordinals protocol.\n\nThe first 300 OCM Dimensions will be minted directly on Bitcoin, then the remaining collection (up to 2,000) will be minted on Bitcoin via burnable Ethereum NFTs that the first OCM Genesis NFT collection can consume over time to generate its respective OCM Dimensions on Bitcoin. Hiro Wallet and Xverse are official wallet partners of the collection.\n\nOnChainMonkey will soon be announcing an amazing new collection with the generative artist, Alexis André.\n\nTo learn more about the OCM Dimensions collection, click here.\n\nAbout OnChainMonkey\n\nLaunched by the NFT company Metagood, OnChainMonkey is the first non-fungible token (NFT) profile picture collection created on-chain in a single transaction on Ethereum. Recently OnChainMonkey marked history again, becoming the first 10k PFP NFT collection inscribed on Bitcoin in a single inscription.\n\nThe collection of 10,000 randomly generated NFTs is led by an experienced team, including Danny Yang, who founded Taiwan’s largest cryptocurrency exchange; Amanda Terry, who served as a digital media business development executive at Twitter and NBC; and Bill Tai, a legendary venture capitalist who was the first investor in Zoom and early investor in Canva, Dapper Labs as well as over 20 companies that have become publicly listed. The OnChainMonkey community is building businesses in Web3 and aims to “do well and do good,” creating value for token holders and promoting social good. To learn more about OnChainMonkey, visit onchainmonkey.com.\n\nAbout Metagood\n\nMetagood is a leader in blockchain technology and digital assets, setting a new standard for innovation in the crypto industry. In 2021, Metagood launched the first 10k on-chain profile picture NFT collection in one transaction on Ethereum. This year, the company was the first to inscribe a 10k NFT collection on Bitcoin. Metagood was recognized in Fast Company’s 2022 Best World Changing Ideas Awards for Impact Investing.\n\nMetagood strives to build a better future for Web3. Through its innovative NFT collection OnChainMonkey (OCM), Metagood has created value and contributed to important causes. Those causes included funding the successful evacuation of Sharbat Gula (known as “Afghan Girl” from the iconic 1984 National Geographic cover) and her family from Afghanistan, donations to humanitarian aid in Ukraine, and more.\n\nMetagood was founded by veterans with decades of business experience. Its chairman, Bill Tai, a legendary venture capitalist, has been at the forefront of the crypto space since 2010. Danny Yang, the CEO, founded both Maicoin, Taiwan's largest cryptocurrency exchange, and Blockseer, a blockchain technology company providing services to customers like the FBI, US Secret Service, and the DHS. He also founded the Stanford Bitcoin Meetup in 2013. Amanda Terry, the COO, is a former business development executive at Twitter, NBC and the co-founder of ACTAI Ventures, where she serves as its managing partner.\n\nTo learn more about Metagood, visit metagood.com."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvdmFsb3VyLWxhdW5jaGVzLWNhcmJvbi1uZXV0cmFsLWJpdGNvaW4tZXRw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Valour launches carbon-neutral bitcoin ETP - ETF Stream",
        "content": "Valour has extended its range of crypto ETPs with the launch of a carbon-neutral bitcoin exchange-traded product.\n\nThe Valour Bitcoin Carbon Neutral ETP (1VBT) is listed on the Deutsche Boerse with a total expense ratio (TER) of 1.49%.\n\nThe goal of 1VBT is to invest in bitcoin, the largest cryptocurrency by market cap, in a climate-friendly way through the funding of carbon removal and offset initiatives.\n\nValour will work with climate action infrastructure provider Patch to consider various inputs including the efficiency of mining equipment, distribution of hash power and ‘nation level’ carbon emission data.\n\nPatch will select carbon offset projects from qualified organisation including Gold Standard, Climate Action Reserve, Verified Carbon Standard, BCarbon, American Carbon Registry and Puro.Earth.\n\nThe launch takes Valour’s crypto ETP range to 12. Last October, the firm launched the Valour Digital Asset Basket 10 Index (VDAB10) with a TER of 1.90%.\n\nThe launch of crypto ETPs has picked up in recent months, following the crypto winter, with the launch of the 21Shares Lido DAO ETP (LIDO) earlier this week and the DDA Select 10 ETP (SLCT) last month."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vc2F0b3NoaS1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "A beginner's guide to Satoshi: The smallest unit of Bitcoin - OKX",
        "content": "Bitcoin (BTC) was the first cryptocurrency to ever be created, and is now the largest by market cap. You can find it on almost any digital currency exchange. While Bitcoin was intended to act as a currency, its technological flaws make it better suited to be an investment asset. The problem with this is that 1 BTC costs a lot of money, therefore very few people can afford to buy a whole Bitcoin.\n\nLuckily, they don’t have to, as Bitcoin can be broken down into smaller units. Similar to how the US dollar has a cent, Bitcoin has a satoshi — its smallest unit. This guide will tell you everything there is to know about them.\n\nWhat is a satoshi?\n\nA satoshi is the smallest unit of Bitcoin. It represents one-hundred-millionth of 1 BTC, and it was named after the mysterious creator of the Bitcoin protocol, Satoshi Nakamoto. Obviously, when Bitcoin first appeared, it didn’t have the need for a smaller denomination of its currency. In the early days of Bitcoin, the price of BTC was measured in cents. However, these days, when each BTC costs thousands of dollars, it is very useful to divide it into satoshis.\n\nFortunately, even with Bitcoin’s massive price appreciation, satoshis are still very affordable for crypto users. In fact, even if BTC price reached $1 million per coin, 1 satoshi would still only cost $0.01. Whether or not Bitcoin can or will ever reach that height remains to be seen.\n\nBut, the fact remains that a whole Bitcoin is still too expensive for the majority of traders. Because of that, satoshis come in quite handy, as they allow everyone to still use portions of BTC. Otherwise, Bitcoin would simply not be affordable for anyone other than the wealthy and institutional investors.\n\nHistory of satoshi\n\nThe history of satoshi starts with Bitcoin, and the Bitcoin Protocol itself. Back in 2008, when the world was struck with a financial crisis, an unknown entity called Satoshi Nakamoto emerged. To this day, it is unknown if Nakamoto was an individual, a group, a company, or something else entirely.\n\nHowever, on October 31st, 2008, Nakamoto published the Bitcoin whitepaper. This was the document that presented a decentralized network running on blockchain technology. It introduced Bitcoin as its digital currency, establishing all aspects of the project.\n\nSeveral months later, on January 3rd, 2009, Nakamoto mined Bitcoin’s Genesis Block. This was, and still is, the first block in Bitcoin’s blockchain. He created BTC so that it can be divided into smaller units. The smallest unit is one hundred millionth of 1 BTC. This unit was then named satoshi, in honor of Bitcoin’s creator.\n\nThe name ¨satoshi¨ was actually first mentioned by ribuck, a member of the BitcoinTalk forum. The user first proposed this on November 15th, 2010. Ribuck’s initial idea was to use this name for one-hundredth of a BTC. However, later, he changed his mind, proposing to use the name for the smallest unit. Other members of the forum agreed, and started using the name.\n\nHow does the satoshi work?\n\nGiven that a satoshi is just a small amount of Bitcoin, it behaves exactly like BTC. It runs on Bitcoin’s decentralized network, and can be used for bitcoin transactions, payments, trading, and alike. Sometimes, people don’t even use the name satoshi, but instead they say the amount in BTC.\n\nFor example, if you were to buy $250 worth of BTC, you can say that in two ways. You can refer to it as 0.00912295 BTC (based on the price at the time of writing). Alternatively, you can just say 912,295 satoshis. It means the same thing, and it is entirely up to the user to choose how to explain this amount. On exchanges, you will have to type it as the value of Bitcoin, since satoshi is not officially supported.\n\nHow can you use satoshis?\n\nSince a satoshi is Bitcoin, only of a different denomination, you can use them interchangeably. Satoshis do not have any advantages or flaws in comparison to BTC. The only advantage comes from the fact that a satoshi is more affordable. A whole Bitcoin is too expensive for most traders, investors, or people who use BTC for payments.\n\nAs for the actual use cases for satoshis, they can include the following:\n\nBuying and selling on nearly any digital currency exchange\n\nTrading it for other cryptocurrencies\n\nBuying products or paying for services where Bitcoin is accepted\n\nSpeculative investing\n\nBuying satoshis is also very simple. All you need to do is go to any crypto exchange, and purchase any amount of Bitcoin. To refer to our example, by buying BTC for $250, you will own 0.00912295 BTC or 912,295 satoshis. Satoshi in Bitcoin and US dollar Let's compare it to BTC and US dollars to make it easy to understand how much a satoshi is worth.\n\n1 BTC consists of 100,000,000 satoshis, and it costs $27,378 at the time of writing\n\n1 satoshi represents 0.00000001 BTC\n\nIn US dollars, the value of 1 satoshi is $0.00027\n\n$1 is (currently) worth 0.00003653 BTC, or 3,653 satoshis\n\n$10 is (currently) worth 36,526 satoshis, and $100 is worth 365,255 satoshis\n\n1 million satoshis is the same as 0.01 BTC, and is (currently) worth around $273\n\nNote that the price of Bitcoin changes constantly, which means that the dollar value of satoshi does too. In other words, 1 BTC will always be equal to 100,000,000 satoshis. However, the two will not always have the same value in USD or other fiat currencies.\n\nHow does satoshi differ from other digital denominations?\n\nMany currencies, crypto and fiat, use denominations to break down the value of the base currency. In crypto, the denominations are specific to the preferences of the cryptocurrency’s designer. Bitcoin uses satoshis, as we have established. Ethereum, on the other hand, has several denominations of its own. It’s similar to the penny, nickel, dime, and quarter\n\nThis makes it easier for users to trade amounts that do not require a full coin/token. Of course, their differences could be confusing for new investors, who have yet to get used to smaller denominations.\n\nWhen it comes to fractions of Bitcoin, there are several denominations to consider, including:\n\n1 satoshi, which is 0.00000001 BTC\n\n100 satoshi, called microbitcoin (µBTC), which is 0.000001 BTC\n\n100,000 satoshi, called millibitcoin (mBTC), which is 0.001 BTC\n\nIn the case of Ethereum, we have wei, which is the smallest unit of Ether.\n\n1 wei = 0.000000001 Gwei = 0.000000000000000001 ETH\n\n1,000,000,000 wei = 1 Gwei = 0.000000001 ETH\n\n1,000,000,000,000,000,000 wei = 1000000000 Gwei = 1 ETH\n\nLegacy of Satoshi Nakamoto\n\nSatoshi Nakamoto created Bitcoin after the financial crisis of 2008, when the banks once again failed their users. To Nakamoto, they have proven that they could not be trusted with money, so he created a decentralized system. This was supposed to be an alternative for fiat currency and banking systems. Today, Bitcoin is growing into something more than just a currency. However, thanks to its design and code, it can still be used as a currency.\n\nBut, since 1 BTC is extremely expensive today, and most people cannot afford it, we turn to satoshis. The smallest unit of BTC is still affordable, being only a fraction of a cent. As of 2023, it’s been over 12 years since Satoshi Nakamoto disappeared. However, his invention is still alive and conquering the world as we speak. It even kickstarted a massive industry that is growing larger and more disruptive every year. As such, BTC, as well as Satoshi, represent Nakamoto’s legacy. And, with that being the case, it is quite appropriate that his name is being used for Bitcoin’s smaller units.\n\nFAQs\n\nWhat does satoshi mean?\n\nSatoshi is the smallest unit of Bitcoin, representing 0.00000001 BTC. Each Bitcoin contains 100 million satoshis. This ensures that anyone can purchase any amount of Bitcoin, regardless of their budget.\n\nHow many dollars is 1 satoshi?\n\nAccording to the BTC price at the time of writing, 1 satoshi equals $0.00027. Note that, just like Bitcoin, satoshi value changes over time. This means that satoshi will not keep this value indefinitely, it will grow or drop with the market.\n\nHow many is 1000 satoshi?\n\nAs of May 2023, 1000 satoshis is worth $0.27, or 0.00001 BTC. Once again, satoshi’s value changes alongside Bitcoin. 1,000 satoshis will always be worth 0.00001 BTC, but its USD value is as volatile as Bitcoin’s."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yNTQwMC1wb2x5Z29uLXBvbGthZG90LWV4cGVyaWVuY2UtZGVjbGluZS9hcnRpY2xlc2hvdy8xMDEwMzkxMzguY21z0gGhAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXJpc2VzLWFib3ZlLTI1NDAwLXBvbHlnb24tcG9sa2Fkb3QtZXhwZXJpZW5jZS1kZWNsaW5lL2FtcF9hcnRpY2xlc2hvdy8xMDEwMzkxMzguY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $25,400; Polygon & Polkadot experience decline - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed in Friday's trade. Bitcoin, Ethereum, and Litecoin were trading with gains, while XRP , Polygon, and Polkadot were trading with cuts.Bitcoin (BTC) rose 2% to $25,472, whereas Ethereum (ETH) was above the $1,650 level. BTC volume stood at approximately $15.42 billion, rising 4% in the last 24 hours.\"The crypto market recovered from yesterday’s dip as selling pressure showed signs of cooling down. The rate hike pause announced by the Fed failed to cheer the market as the Fed made it clear that it will not refrain from taking tough steps in the coming months to tackle inflation. We can expect the market to remain choppy if the hawkish stance on monetary policy continues,\" Shivam Thakral, CEO of BuyUcoin, said.The global cryptocurrency market cap was trading around $1.04 trillion, rising 1.22% in the last 24 hours.The total volume in DeFi is currently $2.59 billion, 7.27% of the entire crypto market's 24-hour volume. The volume of all stablecoins is now $37 billion, which is 104% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $494 billion. Bitcoin’s dominance is currently 48%, an increase of 0.28% over the day, according to CoinMarketCap.\"Bitcoin traded above the US $25,500 level in the past 24 hours after hitting a three-month low on Wednesday. BTC’s support now lies at the US$25,200 and resistance at the US $25,700 level. Even though BTC is down by 6% in the month-to-date, it is up by 53% from year-to-date,\" Edul Patel, Co-founder and CEO at Mudrex, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 41, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 24 and 30, respectively, further indicating a Neutral market.\"The MACD Level (12, 26) at -477 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 22 with a Neutral indicator, while the Williams Percent Range (14) at −72 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.14 hours, IST on June 14, 2023)Bitcoin $25,472 1.90%Ethereum $1,668 1.51%Tether $0.999 0.01% BNB $237 0.79%XRP $0.48 -0.78%Cardano $0.263 0.90% Dogecoin $0.06179 2.91%Polygon $0.5892 -5.08%Solana $14.84 0.47%Litecoin $74.99 2.95%Polkadot $4.37 -3.46%Tron $0.07032 -2.10%Avalanche $11.46 0.21%Shiba Inu $0.00000676 2.03%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTI2ay1hY2NlbGVyYXRpb24tYmluYW5jZS1mZWFyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price eyes $26K 'acceleration' zone as Binance fears fade - Cointelegraph",
        "content": "Bitcoin headed toward a “crucial area” after the June 16 Wall Street open, as a recovery from three-month lows continued.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin reinforces rebound from multi-month lows\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD nearing $26,000 on Bitstamp.\n\nThe Bitcoin (BTC) price built on an overnight rebound from its lowest levels since early March amid ongoing regulatory and macroeconomic pressures.\n\nFor Michaël van de Poppe, founder and CEO of trading firm Eight, $26,000 represented a key level for bulls to flip next.\n\n“Long weekend is coming up with the bank holiday on Monday,” he told Twitter followers, referencing the Juneteenth holiday in the United States.\n\n“For Bitcoin, crucial area to break is $26K. If that breaks, we’ll have some acceleration. I’m still long, would still long if we reach $24.4K too.”\n\nThat $24,400 downside area of interest was already in focus for various popular traders.\n\nAmong them was Daan Crypto Trades, who predicted a return closer to $26,000 as part of a narrowing wedge structure in place on lower timeframes.\n\n#Bitcoin Low timeframe:\n\n\n\nStruggling to break the Weekly VWAP so far.\n\n\n\nYou can clearly see how it's rejecting price every time we've touched it.\n\n\n\nA break above, should lead to a next leg into the May lows around 25.8-25.9K.\n\n\n\nSupport sits at $25.3K. pic.twitter.com/kIjeRdaMiN — Daan Crypto Trades (@DaanCrypto) June 16, 2023\n\n“This dip into $24,000 is a great opportunity,” fellow trader Jelle wrote in part of the day’s tweets, adding that the Twitter user was “ready for the bull market.”\n\nMy game plan remains unchanged.\n\n\n\nI started buying around $16,500, and so long as we trade below $30,000 - I will continue to buy on pullbacks.\n\n\n\nThis dip into $24,000 is a great opportunity.\n\n\n\nBought more #Bitcoin - ready for the bull market. pic.twitter.com/R78ZUu7SPI — Jelle (@CryptoJelleNL) June 16, 2023\n\nMarket joins Binance CEO in dismissing France “FUD”\n\nJune 16, meanwhile, marked another test for major exchange Binance, with France launching investigative proceedings hours after an announcement that Binance would quit the Netherlands altogether over regulatory difficulties.\n\nRelated: 3 Bitcoin price metrics showing ‘insane’ similarities to 2020 breakout\n\nMarkets appeared immune to the news, however, and in characteristic fashion, Binance CEO Changpeng Zhao, known as CZ, called the France episode “FUD” — fear, uncertainty and doubt.\n\n“France, surprise (no advanced notice) on-site inspections of regulated businesses are the norm, for banks, and now for crypto too. The surprise visit for Binance France happened a couple of weeks ago. It's not ‘news.’ Binance France cooperated fully,” he tweeted on the day.\n\n“Binance also isn’t the only crypto business inspected. This happened to other well known crypto businesses in Paris too. Binance France continues to be our flagship center in Europe.”\n\nBNB/USD 1-hour chart. Source: TradingView\n\nBinance’s in-house token, BNB (BNB), appeared similarly resilient, climbing to $240 on the day.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vZ3VpZGVzL2hvdy10by1idXktYW5kLXNlbGwtYml0Y29pbi1pbi1pbmRpYS5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "How To Buy And Sell Bitcoin In India? - Cryptonews",
        "content": "How to Buy and Sell Bitcoin in India?\n\nRegulatory concerns are not to be taken lightly, and India is no different: for example, the Indian government has said that Bitcoin can’t be used as a part of the payments system. However, nobody expressly forbid people from trading in…\n\nRegulatory concerns are not to be taken lightly, and India is no different: for example, the Indian government has said that Bitcoin can’t be used as a part of the payments system. However, nobody expressly forbids people from trading in cryptocurrencies, as long as they’re not treated as legal tender.\n\nThanks to all the hype surrounding cryptocurrencies lately, understanding how to buy and sell Bitcoin in India is critical for everyone who wants to take part in it.\n\nThere are several ways to buy, sell, or spend Bitcoin in India:\n\nOn a local or international exchange (read more about choosing one here)\n\nBy finding a local dealer on a marketplace like Localbitcoins.com and buying bitcoins from them with cash, credit card, via PayPal, etc.\n\nBy buying or selling goods or services for bitcoins.\n\nIf you would like to buy Bitcoin with cash, this can also be done by visiting the nearest Bitcoin ATM. However, at the moment there are no Bitcoin ATMs operating in India (according to CoinATMRadar.com).\n\nHow to buy or sell bitcoin in India using an exchange\n\nUsing a cryptocurrency exchange is one of the most popular and convenient ways to buy and sell bitcoin. However, due to bank-imposed (RBI) restrictions, you might not be able to fund your crypto exchange account using Indian banks. The situation has significantly affected the country’s crypto landscape, even forcing to shut down some native cryptocurrency exchanges. Despite the RBI crackdown, it is still possible to buy and sell bitcoins in India.\n\nUncoin exchange in India.\n\nThe leading Indian Bitcoin exchanges are Bitbns, WazirX,Unocoin, and Koinex. Unfortunately, Unocoin does not allow for INR deposits and withdrawals at the moment, but it is possible if you use Koinex and Bitbns.\n\nIf you’re going to use Bitbns, you will need to verify your account with Aadhar and PAN card to connect your bank account and deposit or withdraw cash to/from your Bitbns wallet. With Koinex, all you need to do is register on the exchange, verify your account and fund it via Loop – an Indian platform for P2P INR trades.\n\nOnce you have bitcoin, you can also use other international exchanges to trade it or sell it. The most popular ones include:\n\nBuy or sell bitcoin in India via peer-to-peer platforms (P2P)\n\nNot every bitcoin user is satisfied with the level of anonymity and security provided by online crypto exchanges. Despite their convenience, bitcoin trading remains largely popular in the peer-to-peer platforms, as they tend to offer their users more in terms of privacy and freedom.\n\nLocalBitcoins trading volume in India. Source: Coin.dance\n\nThe most popular P2P platform is LocalBitcoins. It serves as a local advertisement board for everyone who wants to buy and sell bitcoin. Once you register on the platform, you post an ad or search for local people/institutions who want to buy or sell bitcoins via your preferred methods and for your preferred price. Once you find a suitable buyer/seller, you agree on the terms of the transaction (bank transfer, Paypal, face-to-face meeting, cash, etc.). Note that not every seller is trustworthy, so be sure to check their history and reviews beforehand.\n\nPaxful trading volume in India. Source: Coin.dance\n\nPaxful is another alternative to LocalBitcoins. It works in a similar manner.\n\nBesides LocalBitcoins and Paxful, you can try decentralized P2P Bitcoin exchanges like Bisq and Cryptonex.\n\nBisq decentralizing trading platform.\n\nBisq stands out from other exchanges mentioned above, as it is a decentralized crypto exchange that allows you to buy and sell cryptocurrencies (including bitcoin) without registration.\n\nCryptonex is another P2P crypto platform that lets you instantly exchange cryptocurrencies, INR, and other currencies using your credit/debit card. However, unlike Bisq, the service is not anonymous, and the onboarding process plus KYC/AML verification takes more time.\n\nLast but not least, you can try to buy and sell bitcoins in India using a service like WazirX. Although the platform is still in beta, it includes both crypto-to-crypto exchange and peer-to-peer trading service which lets trade INR for Tether (USDT) cryptocurrency.\n\nBuying or selling goods and services for bitcoin in India\n\nIf you don’t want to or can’t purchase or sell bitcoin using the methods mentioned above, you can obtain or use your bitcoins for goods and services. Although you won’t be able to spend your bitcoins wherever you like, you can check websites like Coinmap.org to discover bitcoin-friendly services.\n\nBitcoin-friendly merchants in India. Source: Coinmap.org\n\nOtherwise, you can offer goods and services for bitcoin yourself. But don’t forget to check with legal authorities how you can do so according to the law.\n\nSee our other guide for more information about how to accept bitcoin as a business.\n\nThese are the methods you can use to buy and sell Bitcoin (BTC) in India. Although currently there are no Bitcoin ATMs in the country, there are plenty of alternatives for how you can get BTC.\n\nDespite the unwelcome regulatory climate, more and more innovative Indian Bitcoin trading platforms are emerging, thus sparking a new wave of financial freedom, censorship-resistance, and entrepreneurship in India."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZGVjcnlwdC5jby8xNDQ4MjUvamFjay1kb3JzZXlzLWJsb2NrLWJpdGNvaW4td2FsbGV0LW9wZW5zLWJldGEtYW5ub3VuY2VzLWNvaW5iYXNlLXN1cHBvcnTSAWdodHRwczovL2RlY3J5cHQuY28vMTQ0ODI1L2phY2stZG9yc2V5cy1ibG9jay1iaXRjb2luLXdhbGxldC1vcGVucy1iZXRhLWFubm91bmNlcy1jb2luYmFzZS1zdXBwb3J0P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Jack Dorsey's Block Bitcoin Wallet Opens Beta, Announces Coinbase Support - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJack Dorsey’s payments company Block announced an open beta program on Thursday for its self-custodial Bitcoin wallet, Bitkey.\n\nThe beta already includes special integrations with Coinbase and CashApp, letting users safely withdraw Bitcoin to the wallet from either platform “without the friction of standard 'copy and paste.”\n\nbuy bitcoin from an exchange and move it to a hardware key you control https://t.co/JdWU10UJKb — jack (@jack) June 15, 2023\n\nAD\n\nAD\n\nThe previous beta was only available to employees of Block, which trades on the NYSE under the SQ ticker. The new, open beta program will allow the public to try out the company’s hardware device and accompanying software free of charge. SQ rose roughly 4% on the news Thursday.\n\n“You’ll be asked to try out the product with your own bitcoin, and share your feedback with us via interviews and surveys, which will help us shape the product,” wrote Bitkey on its website. “You’ll get to keep your free Bitkey hardware device to continue using with future versions of the app.”\n\nThe beta version of the hardware wallet will include basic functions like sending and receiving BTC, and include both PIN code and fingerprint authentication options to unlock the device. Later on, the mobile app will incorporate 3rd party exchange partners to allow users to buy Bitcoin directly through the app – CashApp and Coinbase included.\n\nAccording to Coinbase’s announcement, its partnership with Bitkey will include a “joint offer” for both Coinbase One and Bitkey customers later this year. They also plan to make it easier to convert Bitcoin into local fiat currencies through its integration.\n\n\n\n“We're passionately aligned with Bitkey's vision of making self-custody more accessible and empowering individuals to take true ownership of their bitcoin,” wrote the company.\n\nCashApp has allowed users to buy Bitcoin through its platform for years, and includes options to be paid in BTC, or receive coins through the lightning network. Bitkey’s wallet, however, while including multi-signature functionality, will only support transactions on the main blockchain.\n\nAD\n\nAD\n\nJack Dorsey’s companies are continuing to develop infrastructure for Bitcoin, including mining tools and global on-ramps. Earlier this week, the billionaire’s relief fund Start Small pledged $5 million to the Bitcoin non-profit Brink to support the network’s developers.\n\n\n\nDorsey is far more supportive of Bitcoin than other crypto networks like Ethereum, which he considers an unregistered security."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xNDQ3ODIvYmxhY2tyb2NrLWZpbGluZy1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbi1zb29uLXJlcG9ydHPSAVVodHRwczovL2RlY3J5cHQuY28vMTQ0NzgyL2JsYWNrcm9jay1maWxpbmctYml0Y29pbi1ldGYtYXBwbGljYXRpb24tc29vbi1yZXBvcnRzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock Files Bitcoin ETF Application With the SEC - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlackRock, the world’s largest asset manager, filed an application on Thursday afternoon to register a spot Bitcoin exchange-traded fund (ETF) with the United States Securities and Exchange Commission.\n\nThe move was anticipated earlier in the day due to a report from CoinDesk suggesting that a filing was imminent.\n\nBlackRock, which had $9.5 trillion in assets under management in the first quarter of 2023, is working together with Coinbase (COIN), the largest US cryptocurrency exchange. The ETF would use Coinbase Custody for the ETF, and rely on the exchange's spot market data for pricing, while BNY Mellon will be the cash custodian.\n\nAD\n\nAD\n\nBlackRock previously sealed a partnership with Coinbase last August to enable clients using BlackRock's investment management platform Aladdin to possess and trade in digital assets, starting with Bitcoin. The deal gives BlackRock clients access to Coinbase’s trading, custody, prime brokerage and reporting services.\n\nRegistering a Bitcoin ETF with the SEC has been a difficult task, especially for funds dealing with spot market trading. To date, not a single application for such a spot ETF has been approved by the SEC over concerns about potential fraud or manipulation in the spot market. In contrast, the SEC has approved four Bitcoin ETFs for futures trading.\n\nAn ETF is a type of investment product tied to commodities, currencies, stocks or bonds. It allows investors to have skin in the game without actually owning a particular asset. A Bitcoin ETF allows investors to invest in the world's oldest and largest cryptocurrency without having to hold it themselves—rather, they just buy shares that track the asset’s price.\n\nThe SEC’s reluctance to green light an ETF for the Bitcoin spot market has been a sore point for would-be applicants.\n\nIn 2016, asset manager Grayscale submitted an application for a Bitcoin spot market ETF with the SEC, but was rejected by the SEC in June 2022, prompting Grayscale to respond with a lawsuit.\n\nAD\n\nAD\n\nIn March, a federal judge cast doubt on the SEC's claims that data provided by Grayscale for its proposed ETF was insufficient for determining whether fraud or manipulation in the spot markets impacts futures markets in the same way.\n\nEditor's note: This article was updated after publication to reflect that the application has now been filed."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmFuZHJvaWRhdXRob3JpdHkuY29tL2hvdy10by1idXktc2VsbC1iaXRjb2luLW9uLWNhc2gtYXBwLTMzMzYyNTkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "How to buy and sell Bitcoin on Cash App - Android Authority",
        "content": "Are you ready to invest in Bitcoin? There are plenty of great crypto exchanges to do it from, but why sign up for something new if you can get it from an app you already use, know, and love? Let’s show you how to buy and sell Bitcoin on Cash App.\n\nQUICK ANSWER To buy Bitcoin on Cash App, launch the application and go to Money > Buy bitcoin > Buy. Select the amount you want to buy and hit Next. Take a look at the transaction details and select Confirm. You can also use Auto Invest or Custom Purchase Order, which we'll discuss later in this guide. If you want to sell your Bitcoin, launch Cash App and go to Money > Bitcoin > Sell. Select how much you want to sell and hit Next. Go through the transaction details and tap on Confirm. JUMP TO KEY SECTIONS Who can buy Bitcoin on Cash App?\n\nHow to buy Bitcoin on Cash App\n\nHow to sell Bitcoin on Cash App\n\nWhat are the fees for buying and selling Bitcoin on Cash App\n\nWarning: We are not financial advisors, and cannot tell you if investing in Bitcoin is a good or bad idea. Bitcoin is considered a high-risk asset and is susceptible to high fluctuations in value. Do your own research and make your own decisions before buying or selling Bitcoin.\n\nEditor’s note: We used a Google Pixel 7 running Android 13 to develop these instructions. We also verified all steps using an Apple iPhone 12 Mini Running iOS 16.5 to ensure the steps are the same on iOS and Android. Remember that some menus may look slightly different depending on your device and software version. By the way, we had to use iPhone screenshots, as the Android app doesn’t allow taking screenshots of key pages. The steps are identical, though.\n\nWho can buy Bitcoin on Cash App?\n\nEdgar Cervantes / Android Authority\n\nAnyone with a verified Cash App account should be able to invest in Bitcoin. You will need to live somewhere in the USA and be at least 18 years of age, or whatever is considered the age of majority in your State.\n\nAdditionally, different states require more information. You will definitely need to provide your personal information, though. This will include your name, address, birthday, and in many cases, your social security number. You might also need to verify your identity by taking pictures of your ID and face.\n\nHow to buy Bitcoin on Cash App\n\nEdgar Cervantes / Android Authority\n\nOnce you have your account ready and verified, buying Bitcoin is super simple. You must know about the different types of Bitcoin purchases you can make on Cash App, though. There are three types of Bitcoin purchases. Let’s talk about them before moving forward.\n\nBitcoin order types: Standard Order: Buy Bitcoin on spot, using the current price.\n\nBuy Bitcoin on spot, using the current price. Custom Purchase Order: Set a specific price for your order to be fulfilled.\n\nSet a specific price for your order to be fulfilled. Auto Invest: You can trigger automatic Bitcoin purchases daily, weekly, or bi-weekly.\n\nHow to buy Bitcoin on Cash App: Launch Cash App. Tap on the Money tab. It looks like a bank building, or your balance, if you have any. Select the Buy bitcoin option. This will show up as Bitcoin if you already have Bitcoin. Tap on the Buy button. By default, the purchase will be a Standard Order. Tap on the Change Order Type option to switch to Custom Purchase Order or Auto Invest and follow the instructions. Ignore this step if you want to simply buy Bitcoin right away. Select how much, in dollars, you want to invest in Bitcoin. Then hit Next. Check the Bitcoin purchase details and hit Confirm. Select Done.\n\nCash App will finish the purchase, and you’ll have your Bitcoin in your wallet. If you don’t have enough money in your Cash App balance to cover the purchase, the app will pull the remaining funds from your linked debit card. This will be reflected in the purchase details, before confirming the transaction.\n\nHow to sell Bitcoin on Cash App Seling Bitcoin is just as easy as buying it! Let’s show you how to cash out Bitcoin on Cash App\n\nHow to sell Bitcoin on Cash App: Launch Cash App. Tap on the Money tab. It looks like a bank building, or your balance, if you have any. Go into the Bitcoin option. Tap on the Sell button. By default, the purchase will be a Standard Order. Tap on the Change Order Type option to switch to a Custom Sell Order and follow the instructions. Ignore this step if you want to simply sell Bitcoin right away. Select how much, in dollars, you want to sell. Then hit Next. Check the Bitcoin sell details and hit Confirm. Select Done.\n\nYour money will go straight to your Cash App balance. You can use it for transfers, spend it on your Cash Card, or use the Cash Out feature to send it to your bank account.\n\nWhat are the fees for buying and selling Bitcoin on Cash App\n\nEdgar Cervantes / Android Authority\n\nNothing is free, especially in the world of crypto. Buying and selling Bitcoin on Cash App has a cost. That said, Cash App’s fees are considered pretty fair compared to its main competitors. The bad news is Cash App isn’t very clear about its Bitcoin fees.\n\nAs of the time of this writing, the fees start at about 3% for purchasing $1 of Bitcoin, and get reduced the more you purchase. For example, We checked how much the fees would be for purchasing $100, $1,000, and $10,000. These would be $2.25, $17.50, and $75.20, accordingly. This would mean you’re paying 2.25% for buying $100, 1.75% for $1,000, or 0.75% for $10,000.\n\nOf course, these fees can change in the future. And you should also take into account that there is a margin, also known as spread, applied to the purchase. Exchanges compare prices across multiple exchanges and adjust the price accordingly. This is mostly to ensure the company doesn’t lose money if the Bitcoin price changes during the time your transaction takes.\n\nFAQs\n\nCan you send Bitcoin from Cash App to another wallet? Yes! You can send the Bitcoin you have in your Cash App to any other Bitcoin wallet. We actually have a full guide on how to send Bitcoin on Cash App, if you need some help.\n\nIs Cash App a Bitcoin wallet? Cash App offers a Bitcoin wallet. More specifically, it is a custodian of your Bitcoin wallet. You just don’t get access to your Bitcoin address private keys.\n\nWhat happens if I sell my Bitcoin on Cash App? When you sell your Bitcoin on Cash App, all the money will go straight to your balance in the app. You can then transfer it to other users, spend it using the Cash Card, or send it to your bank.\n\nIs buying Bitcoin on Cash App safe? Buying Bitcoin on Cash App is very safe. The company is well-established and regulated. You have to be careful of possible scammers trying to get you to send them BTC, but that applies to any crypto exchange. What may not be so safe is keeping your Bitcoin on Cash App. Most experts and enthusiasts suggest moving your Bitcoin to a cold wallet for long-term storage. This is because Cash App is a company that could go bankrupt, suffer from hacks, and more. And since Bitcoin is not regulated, it is not FDIC-insured or protected in any way.\n\nWhere is my Bitcoin address on Cash App? To find your Bitcoin address on Cash App, launch the app and go to Money > Bitcoin > Send or receive > Receive bitcoin. Tap on the QR code to see your addresses for the Bitcoin Network and Lightning Network.\n\nComments"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kZXhvcmRpLXJldm9sdXRpb25pemluZy1kZWNlbnRyYWxpemVkLXRyYWRpbmctYml0Y29pbi0xMjE1MDA2NTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "DexOrdi: Revolutionizing Decentralized Trading on the Bitcoin Network with Advanced AMM Technology - Yahoo Finance",
        "content": "NEW YORK, NY / ACCESSWIRE / June 15, 2023 / DexOrdi, the pioneering decentralized finance (DeFi) platform on Bitcoin Network, is driving innovation in the DeFi landscape on the Bitcoin network. Leveraging advanced Automated Market Maker (AMM) technology, DexOrdi is revolutionizing decentralized trading with its focus on efficiency, liquidity provision, security, and user accessibility. By paving the way for a new era of decentralized finance based on the BRC-20 standard, DexOrdi is empowering traders to unlock the full potential of decentralized trading on Bitcoin Network.\n\nDexOrdi, Thursday, June 15, 2023, Press release picture\n\nThe BRC-20 standard is an experimental token standard designed to facilitate the creation and transfer of fungible tokens on the Bitcoin blockchain through the Ordinals protocol. Inspired by Ethereum's token standards, BRC-20 tokens offer unique mechanisms and functions. Although BRC-20 tokens gained considerable popularity in the first half of 2023, it is important to note that they are still in the experimental phase, requiring users to exercise utmost caution.\n\nDexOrdi is at the forefront of integrating BRC-20 tokens into its decentralized trading platform. By enabling direct trading of BRC-20 tokens with Bitcoin on dexordi and vice versa, DexOrdi provides seamless interoperability between Bitcoin-based assets and BRC-20 tokens. Moreover, BRC-20 tokens inherit the robust security features of the Bitcoin network, offering protection against double-spending and 51% network attacks.\n\nThe creation of BRC-20 tokens emerged from the introduction of Non-Fungible Tokens (NFTs) on Bitcoin's protocol in January 2023. This development spurred the exploration of fungible tokens on the network. In March 2023, a pseudonymous programmer named Domo established the BRC-20 token standards, enabling the minting of fungible tokens on Bitcoin. The first deployed BRC-20 token, named \"ordi,\" gained swift integration support from Bitcoin wallets. Subsequently, numerous other BRC-20 tokens were launched, some experiencing significant market capitalization and price surges by May 2023. The increasing demand for BRC-20 tokens contributed to a surge in Bitcoin transaction fees and notable congestion on the Bitcoin network.\n\nStory continues\n\nIt is crucial to acknowledge that the BRC-20 token standard is experimental, carrying inherent uncertainties and risks. Users are advised to exercise caution and conduct thorough research before engaging with BRC-20 tokens, considering their limited utility and the dynamic nature of their future prospects.\n\nAs the DeFi ecosystem continues to evolve, DexOrdi remains committed to providing traders with a reliable and transformative platform. DexOrdi's vision is to empower users by embracing cutting-edge technologies and ensuring the security and efficiency of decentralized trading on the Bitcoin network.\n\nFor more information about DexOrdi, please visit www.dexordi.com or follow on Twitter: https://twitter.com/dexordi\n\nJoin on Telegram: https://t.me/dexordi\n\nFollow on Medium: https://medium.com/@dexordi\n\nAbout DexOrdi\n\nDexOrdi is a leading decentralized finance platform on the Bitcoin network, pioneering innovative solutions for decentralized trading. With its advanced AMM technology and focus on efficiency, liquidity provision, security, and user accessibility, DexOrdi is transforming the decentralized trading landscape. By leveraging the BRC-20 standard, DexOrdi empowers users to unlock the full potential of decentralized finance.\n\nPress Contact:\n\nJohn Cho\n\nHead of Delivery\n\nhello@dexordi.com\n\n+17840345804\n\nSOURCE: DexOrdi\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/761443/DexOrdi-Revolutionizing-Decentralized-Trading-on-the-Bitcoin-Network-with-Advanced-AMM-Technology\n\n\n\n"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC10by13cml0ZS1hLXJhcC1zb25nLWFib3V0LWJpdGNvaW4tYnktc2Vjcy1nYXJ5LWdlbnNsZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "We asked ChatGPT to write a rap song about Bitcoin by SEC's Gary Gensler - Finbold - Finance in Bold",
        "content": "Gary Gensler, the chair of the United States Securities and Exchange Commission (SEC), has faced scrutiny recently for his approach to regulating cryptocurrencies. He has been accused of not providing clear guidelines for digital assets while his agency takes action against prominent crypto entities such as Coinbase and Binance for listing potentially unregistered securities.\n\nCritics argue that Gensler’s approach is stifling the crypto industry’s growth, with opinions varied over his approach. To capture Gensler’s perspective on Bitcoin (BTC), Finbold sought insights from the artificial intelligence (AI)-powered platform, ChatGPT, which presented Gensler’s views as a rap song.\n\nInterestingly, the rap lyrics supported Bitcoin, which partly contradicts the SEC and Gensler’s stance on the cryptocurrency market. In the first verse, Gensler emphasized the song’s supposed theme by acknowledging that Bitcoin has made the market go wild.\n\nThe chorus stressed Bitcoin’s status as digital gold, highlighting its comparison to the precious metal as a potential store of value and hedge against inflation.\n\nIt also acknowledges that Bitcoin has made investors wealthy, but it cautions about the associated risks and the importance of regulating the asset.\n\n“Bitcoin, Bitcoin, the digital gold, But it’s a wild ride, so I gotta be bold. Investors getting rich, but risks are high, Gotta regulate this game, gotta give it a try,” the chorus reads.\n\nBitcoin’s revolutionary nature\n\nIn the second verse, ChatGPT proposes that Gensler would rap about Bitcoin’s decentralized nature and the revolutionary approach but also delves into its associated risks. The verse addresses issues such as market manipulation and fraud while emphasizing the importance of safeguarding investors.\n\nMoving to the fourth verse, Gensler would purportedly raps about the crucial need for transparency in the crypto sector and the necessity of regulations. However, the verse also acknowledges the significant innovations brought about by the industry.\n\n“Transparency is key, we need regulations in place, AML and KYC, gotta maintain the pace. I’m all for innovation, but let’s not forget, We need safeguards in this crypto asset,” the fourth verse reads.\n\nIn the final verse, the emphasis is on Gensler’s mission to educate the masses about Bitcoin and cryptocurrencies. It is suggested that Gensler would rap about the importance of this mission. The verse would also touch upon the role of lawmakers in shaping rules that promote fairness in the crypto sector, according to the tool’s analysis.\n\nFor the bridge, ChatGPT envisions a Gensler rap song on Bitcoin that provides a general overview of the sector. The lyrics highlight the immense potential of blockchain technology and call for unity among players in the crypto industry to create a safer space while embracing innovation and protecting investors.\n\nCrypto is here to stay\n\nIn the outro, ChatGPT suggests that Gensler would emphasize the permanence of the crypto space, reinforcing the idea that it is here to stay.\n\n“So remember, my friends, crypto’s here to stay, But we must proceed with caution, every single day. Gary Gensler and the SEC, we’re on the case, To ensure a thriving market with a solid embrace,” reads the outro.\n\nIndeed, Gensler’s approach to crypto regulation has also caught the attention of lawmakers. As reported by Finbold back in April, Gensler was grilled by the US House of Representatives Financial Services Committee over practices in the sector.\n\nHere’s the full rap song ‘by Gary Gensler’:\n\n(Verse 1)\n\nYo, it’s Gensler, SEC regulator in control,\n\nBitcoin’s on the rise, but there’s risks untold.\n\nDecentralized gold, disrupting the game,\n\nBut market manipulation is causing some pain.\n\n(Chorus)\n\nBitcoin, the digital gold of the town,\n\nBut we gotta regulate, put the wild ride down.\n\nInvestors getting rich, but risks are high,\n\nI’m here to protect, so let’s give it a try.\n\n(Verse 2)\n\nTransparency’s crucial, regulations in sight,\n\nAML and KYC, keeping things right.\n\nWe need safeguards, this market needs care,\n\nEducating the masses, leveling the playing square.\n\n(Chorus)\n\nBitcoin, the digital gold of the town,\n\nBut we gotta regulate, put the wild ride down.\n\nInvestors getting rich, but risks are high,\n\nI’m here to protect, so let’s give it a try.\n\n(Verse 3)\n\nInnovation’s fantastic, but let’s not forget,\n\nFrauds and scams lurk, causing regret.\n\nCollaborating with lawmakers, shaping the rules,\n\nEnsuring fairness, protecting investors like jewels.\n\n(Chorus)\n\nBitcoin, the digital gold of the town,\n\nBut we gotta regulate, put the wild ride down.\n\nInvestors getting rich, but risks are high,\n\nI’m here to protect, so let’s give it a try.\n\n(Verse 4)\n\nBlockchain’s potential, a revolution it brings,\n\nBut we must address the dark side it swings.\n\nCreating a safer space, where trust can thrive,\n\nBalancing innovation and keeping markets alive.\n\n(Chorus)\n\nBitcoin, the digital gold of the town,\n\nBut we gotta regulate, put the wild ride down.\n\nInvestors getting rich, but risks are high,\n\nI’m here to protect, so let’s give it a try.\n\n(Outro)\n\nTogether we’ll build a robust crypto land,\n\nWhere investors are secure, and scams are banned.\n\nGary Gensler and the SEC, leading the way,\n\nEnsuring a prosperous market, day by day.\n\n-The End-\n\nFeatured image via Bloomberg YouTube."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDYvMTYvYml0Y29pbi1ub2Rlcy12cy1iaXRjb2luLW1pbmVycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "How Bitcoin Nodes and Bitcoin Miners Differ - Crypto Times",
        "content": "Bitcoin Nodes and Miners are two fundamental components that work in unison to ensure the functionality, security, and integrity of the network. Despite being interchangeably used at times, these terms denote distinct entities with separate roles.\n\nNodes function as communication hubs, storing the blockchain, validating transactions, and relaying information. Conversely, miners provide computational power to create new blocks, validate transactions, maintain consensus, and secure the network.\n\nThis article elucidates the differences between Bitcoin nodes and miners, spotlighting their unique contributions to the network.\n\nBitcoin Nodes: The Backbone of the Network\n\nBitcoin nodes, the bedrock of the decentralized network, function as essential communication hubs. These are computers running Bitcoin software, performing crucial roles to sustain the network’s operation. Let’s delve into the key characteristics and responsibilities of nodes:\n\n1. Storing the Blockchain:\n\nNodes store a complete copy of the blockchain, the public ledger that records all Bitcoin transactions. By maintaining this local copy, nodes contribute to the network’s overall resilience and accessibility.\n\n2. Transaction and Block Validation:\n\nNodes play a crucial role in validating transactions and blocks. They enforce the consensus rules of the Bitcoin protocol, ensuring that transactions adhere to the specified format and include valid signatures. This verification process helps maintain the integrity of the network.\n\n3. Relaying Information:\n\nNodes actively participate in the dissemination of information within the Bitcoin network. When a new transaction or block is verified, nodes relay this information to other nodes, propagating it across the network. This efficient distribution of data helps maintain network synchronization.\n\n4. Supporting Wallet Functionality:\n\nSome nodes also provide wallet functionality, enabling users to create and manage Bitcoin addresses, sign transactions securely, and interact with the blockchain. These nodes act as a bridge between users and the broader network, facilitating Bitcoin transactions and enhancing user experience.\n\nBitcoin Miners: Powering the Network and Securing Consensus\n\nBitcoin miners are specialized nodes that contribute computational power to safeguard the network and uphold consensus. Their primary tasks involve solving complex mathematical problems and appending new blocks to the blockchain. Let’s explore the unique roles miners play:\n\n1. Block Validation:\n\nMiners, like regular nodes, validate transactions before incorporating them into new blocks. They ensure adherence to network rules and confirm the presence of sufficient computational work, known as proof-of-work, attached to each transaction.\n\n2. Block Creation Through Mining:\n\nMiners gather validated transactions and engage in the process of mining. They use substantial computational power to find solutions to cryptographic puzzles. The first miner to solve the puzzle creates a new block, which is then added to the blockchain.\n\n3. Consensus Mechanism:\n\nMiners provide the decentralized consensus mechanism that governs the Bitcoin network. Through their collective computational effort, miners agree on the order of transactions and append them to the blockchain. This agreement ensures a reliable transaction history and prevents double spending.\n\n4. Network Security:\n\nThe computational power expended by miners in the mining process strengthens the network’s security. It makes it economically costly for malicious actors to attack the network or attempt to rewrite transaction history. This aspect highlights the importance of miners in maintaining the network’s robustness and integrity.\n\nOne critical aspect of Bitcoinmining is the creation of new Bitcoin. Miners, through the process of mining, not only validate transactions but also compete to decipher cryptographic puzzles, resulting in the creation of new Bitcoin as block rewards. These block rewards comprise newly minted bitcoins, which incentivize miners to continue contributing their computational power to the network’s security and operation.\n\nHere is a table that summarizes the key differences between Bitcoin nodes and miners:\n\nFeature Bitcoin Node Bitcoin Miner Role Verifies transactions and blocks, relays information about the network Adds new blocks to the blockchain, secures the network Equipment Regular computer Specialized hardware Reward None Newly created bitcoins and transaction fees Importance Essential for the network to function Essential for the network to be secure\n\nIt’s important to note that while every miner is a node, not all nodes are miners. For instance, light nodes, which do not store a full copy of the blockchain, are unable to verify transactions or blocks. However, they can still relay information about the network to other nodes.\n\nConclusion:\n\nGrasping the differences between nodes and miners provides insights into the complex workings of the Bitcoin ecosystem. Their collaboration ensures the smooth operation, security, and decentralized nature of the world’s leading cryptocurrency.\n\nAs Bitcoin continues to gain popularity and showcases its potential for financial gains, many individuals are exploring Bitcoin trading as a promising investment opportunity. Apps like the bitqt app have introduced automated trading features to attract these individuals. However, it’s critical to remember that trading in cryptocurrencies involves risks, and individuals should conduct comprehensive research and seek professional advice before partaking in any investment activities."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8xNS9ldXMtbGVha2VkLWRpZ2l0YWwtZXVyby1iaWxsLW91dGxhd3MtaW50ZXJlc3QtbGFyZ2UtaG9sZGluZ3MtcHJvZ3JhbW1hYmlsaXR5L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8xNS9ldXMtbGVha2VkLWRpZ2l0YWwtZXVyby1iaWxsLW91dGxhd3MtaW50ZXJlc3QtbGFyZ2UtaG9sZGluZ3MtcHJvZ3JhbW1hYmlsaXR5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "EU’s Leaked Digital Euro Bill Outlaws Interest, Large Holdings, Programmability - CoinDesk",
        "content": "The text also sets out measures to stop people using digital euro accounts as alternatives to commercial bank savings. Holdings cannot bear interest, and the ECB will be able to impose further controls. Panetta has already said individuals should be limited to holding about 3,000 euros ($3,250) to ensure it is primarily used for day-to-day payments."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZ2l6bW9kby5jb20vbWlhbWktYml0Y29pbi1tYXlvci1mcmFuY2lzLXN1YXJlei1ydW5uaW5nLXByZXNpZGVudC0xODUwNTQzNTY40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Miami 'Bitcoin Mayor' Francis Suarez Is Running for President - Gizmodo",
        "content": "Miami “bitcoin mayor” Francis Suarez has a new pitch to potential voters and investors: Bitcoin President. The 45-year-old mayor released a brief video announcing his candidacy on Thursday and filed FEC paperwork officially entering him into an increasingly crowded 2024 Republican primary field. Suarez, who bills himself as an energetic, tech-friendly futurist was one of several prominent US mayors who emphatically boosted Bitcoin and other cryptocurrencies in the lead-up to the industry’s disastrous collapse last year.\n\nHe Tossed His Bitcoin, Now He Wants It Back CC Share Subtitles Off\n\nEnglish view video He Tossed His Bitcoin, Now He Wants It Back\n\nSuarez’s announcement video shows him literally “running” for president through Miami’s lush city streets, making pit stops along the way at his parent’s home and former elementary school. “I have always been a runner,” Saurez says moments before dramatically staring into the camera.\n\nAdvertisement\n\nAdvertisement\n\nThe Miami mayor spent the remainder of the video taking a victory lap, noting an uptick in the city’s economy, a “historic” lowering of taxes, and lessening unemployment during his two terms. Suarez made a point to emphasize Miami’s recent attraction of tech companies and investors, some of which decamped in the city after fleeing former hubs during the pandemic.\n\n\n\nAdvertisement\n\n“Today, our city is a major technology hub,” Suarez notes while weaving his way through traffic. “Because we chose to embrace innovation.” Suarez’s office did not immediately respond to Gizmodo’s request for comment.\n\nAdvertisement\n\n\n\nWhat about crypto?\n\n\n\nOne area notably absent from Suarez’s announcement video, however, was his embrace of cryptocurrency. Suarez was among the most vocal US politicians in 2021 singing crypto’s praises, with a stated goal of transforming Miami into the world’s first Web3 city. The mayor briefly explored paying residents dividends from a municipal “bitcoin yield.” At one point, Suarez even proposed giving municipal workers in the city the option to get paid and pay their taxes in Bitcoin. Suarez himself also revealed he would accept 100% of his own government salary in bitcoin.\n\nAdvertisement\n\n“My wife asked me if that was a good idea, but certainly when governments are spending that kind of money that they are, when you have inflation at the point that it is, when you have rampant overspending in government and deficit spending, all of that pushes in favor of an increase in the price of Bitcoin,” Suarez told Fox News in a November 2021 interview.\n\n\n\nAdvertisement\n\nThough it’s hard to say what effect those antics had on driving up actual cryptocurrency adoption in the city, it did lead to a hefty inflow of new campaign donations sent by wealthy tech investors. The pandering also led to an influx of boom-time crypto capital into the city. In maybe the clearest example of this, Miami-Dade officials in 2021 signed a 19-year $135 million naming rights agreement with FTX to make the now disgraced cryptocurrency exchange the face of the Miami Heat’s basketball stadium. The stadium revoked that name last year following FTX’s sudden collapse and its founder’s criminal indictment.\n\nSaurez hasn’t disavowed cryptocurrencies, but he also isn’t mentioning it with the same level of frequent glee as he once did. The cryptocurrency industry experienced possibly the worst downturn in its brief history last year thanks to the collapse of multiple exchanges, criminal indictments, and more than a handful of lost fortunes. Suarez’s own Bitcoin salary took a plunge last year when the price of Bitcoin tanked by as much as 40% in a two-month span. The mayor still stands by the salary decision but he, like other crypto evangelists politicians, has since taken his foot off the Bitcoin hype accelerator.\n\nAdvertisement\n\n“My salary is actually up,” Suarez assured CNBC in January. “It’s actually been a pretty good investment!”\n\nSuarez enters the 2024 Republican presidential primary race less than one week after the front runner, former President Donald Trump, was indicted by a federal grand jury on criminal charges related to his improper storage of classified White House documents. So far, the list of contenders hoping to steal Trump’s chokehold on the party is already a dozen strong and includes Florida Governor Ron DeSantis, former South Carolina governor Nikki Haley, former New Jersey governor Chris Christie, former Vice President Mike Pence, and South Carolina Senator Tim Scott along with a handful of wishful longshots."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS90ZWNoL3RlY2hub2xvZ3kvYmxhY2tyb2NrLWNsb3NlLXRvLWZpbGluZy1mb3ItYS1iaXRjb2luLWV0Zi1yZXBvcnQvYXJ0aWNsZXNob3cvMTAxMDIzODUxLmNtc9IBfGh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS90ZWNoL3RlY2hub2xvZ3kvYmxhY2tyb2NrLWNsb3NlLXRvLWZpbGluZy1mb3ItYS1iaXRjb2luLWV0Zi1yZXBvcnQvYW1wX2FydGljbGVzaG93LzEwMTAyMzg1MS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "BlackRock close to filing for a bitcoin ETF: Report - The Economic Times",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9ibGFja3JvY2stZmlsZXMtZm9yLWJpdGNvaW4tZXRmLWluLXB1c2gtaW50by1jcnlwdG8tMTY5NTI0NTEuaHRt0gFsaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L2JsYWNrcm9jay1maWxlcy1mb3ItYml0Y29pbi1ldGYtaW4tcHVzaC1pbnRvLWNyeXB0by0xNjk1MjQ1MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "BlackRock files for bitcoin ETF in push into crypto - CNBCTV18",
        "content": "BlackRock, the world's biggest asset manager, on Thursday filed for a bitcoin exchange-traded fund (ETF) that would allow investors to get exposure to the cryptocurrency, as the asset class comes under intense regulatory scrutiny.\n\nBlackRock's iShares Bitcoin Trust will use Coinbase Custody as its custodian, according to a filing with the U.S. Securities and Exchange Commission (SEC). The U.S. regulator has yet to approve any applications for spot bitcoin ETFs.\n\nLast year, BlackRock launched a spot bitcoin private trust for institutional clients in the United States.\n\nThe move comes at a time when the global cryptocurrency industry has been caught in the crosshairs of the U.S. securities regulator on alleged violations of securities laws.\n\nEarlier this month, the regulator sued major exchanges Coinbase and Binance in high-profile lawsuits that reverberated through the digital assets industry.\n\n\"The fact that BlackRock, a well-respected and established asset management company, has filed for a Bitcoin ETF could be seen as a positive development in the quest for regulatory approval,\" said Joshua Chu, group chief risk officer at blockchain technology group XBE, Coinllectibles and Marvion.\n\n\"It also shows resilience of the public's interest in crypto.\"\n\nA spot bitcoin ETF would track bitcoin's underlying market price. Proponents say an ETF would give investors exposure to bitcoin without directly buying it.\n\nThe SEC rejected Grayscale Investment LLC’s application last year to convert its flagship spot Grayscale Bitcoin Trust into an ETF.\n\nGrayscale sued the SEC, claiming that the regulator was acting arbitrarily in rejecting applications for spot bitcoin ETFs when it had previously approved bitcoin futures ETFs.\n\nThe SEC has also rejected proposals for spot bitcoin ETFs from firms including Fidelity, Cboe Global Markets and NYDIG.\n\nBitcoin prices closed up 2 percent on Thursday after the announcement. They were last at $25,506 on Friday. The largest cryptocurrency is up 54 percent in the year."
    }
]