[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTA3L2pwbW9yZ2FuLXNheXMtYS1iaXRjb2luLWV0Zi13b3VsZG4tdC1iZS1hbi1pbmR1c3RyeS1nYW1lLWNoYW5nZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "JPMorgan Doubts That the Approval of a US Bitcoin ETF Would Be a Game-Changer - Bloomberg",
        "content": "Should an exchange-traded fund that invests directly in Bitcoin receive approval in the US, it won’t be the game-changer for crypto markets that many digital-asset advocates have long predicted.\n\nThat’s according to JPMorgan strategist Nikolaos Panigirtzoglou , who argues that even though there’s broader optimism a physically backed fund could get regulatory blessing, any approval won’t be transformational for the sector since such products have existed in Canada and Europe for years without having seen tremendous inflows. Bitcoin funds overall have “attracted little investor interest” over the past two years, “failing to benefit from investor outflows from gold ETFs,” he said in a note."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDcvMDcvcmZrLWpyLWJpdGNvaW4taW52ZXN0bWVudC1yYWlzZXMtZXRoaWNzLWNvbmNlcm5zLmh0bWzSAVlodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNy8wNy9yZmstanItYml0Y29pbi1pbnZlc3RtZW50LXJhaXNlcy1ldGhpY3MtY29uY2VybnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "RFK Jr. touted bitcoin but said he wasn't an investor. Financial records show otherwise - CNBC",
        "content": "Robert F. Kennedy Jr., son of former U.S. Sen. Robert F. Kennedy, speaks during the Bitcoin 2023 conference in Miami Beach, Florida, May 19, 2023.\n\nRobert F. Kennedy Jr., a Democratic candidate for president, stood at the world's biggest bitcoin conference in Miami in May and told the crowd, \"I am not an investor and I am not here to give investment advice.\" Then he announced he would be accepting campaign donations in bitcoin.\n\nWhat Kennedy didn't tell the crowd was that his family had invested in bitcoin recently, according to a financial disclosure form he filed June 30. On the twelfth page of the report, Kennedy lists a brokerage account that held between $100,001 and $250,000 worth of bitcoin. Hours after publication of this story, Kennedy's campaign manager, former Democratic Rep. Dennis Kucinich, told CNBC that the bitcoin purchase was made after the speech in Miami and before the June 30 filing deadline.\n\nThe situation could represent a conflict of interest if Kennedy were touting bitcoin on the campaign trail while his immediate family held the cryptocurrency, according to Virginia Canter, the chief ethics counsel for watchdog group Citizens for Responsibility and Ethics in Washington.\n\n\"There is no conflict here,\" Kucinich told CNBC in a follow-up interview.\n\nSince the conference, Kennedy has continued to tout bitcoin.\n\nIn late June, he tweeted: \"Bitcoin is not only a bulwark against totalitarianism and the manipulation of our money supply, it points the way toward a future in which government institutions are more transparent and more democratic.\" The tweet includes a video of part of his Miami speech where he describes how he would be pro-bitcoin as president.\n\nThe filing says the bitcoin holding made less than $201 in income but doesn't say when it was purchased. Nor does the filing say who purchased it or how much the family may have spent on their original investment. It also doesn't say whether they sold their bitcoin holding.\n\nThe bitcoin holding is listed under a section on the form that includes assets that can also belong to spouses and dependent children. It is intended to reflect holdings from the \"preceding calendar year and current year to filing date,\" according to the Office of Government Ethics. Kennedy is married to \"Curb Your Enthusiasm\" star Cheryl Hines and has six children. Kennedy signed and filed the disclosure form to the Office of Government Ethics at the end of last month, according to the document.\n\nAfter CNBC made multiple attempts to get a comment, the Kennedy campaign said hours after the publication of this story that \"the investments were not his, but his wife's. He is not involved in her investment decisions.\" The campaign did not say for how long Hines held the bitcoin investment or when she purchased the asset.\n\nLater Friday, however, a campaign representative sent a new statement, saying the bitcoin investment is indeed Kennedy's. \"I was mistaken in my last communication. Mr. Kennedy does hold a bitcoin investment, but it came later. At the time of the bitcoin speech he had no cryptocurrency holdings,\" the representative said.\n\nBefore the Kennedy campaign commented, CREW's Canter said the ownership is certainly current as of June 30, when he filed his disclosure. \"Under a traditional conflict of interest analysis, Hines' financial interests are imputed to him,\" Canter said.\n\n\"I'm really concerned that he's speaking at this conference, touting this investment to potential voters while the family has a history of owning bitcoin. It's like he could do the same thing for Procter and Gamble,\" she added. \"There's no difference in my mind from a conflicts perspective.\"\n\nAfter Kennedy's appearance in May at the Miami conference, CNBC inquired whether Kennedy had any crypto holdings. \"Mr. Kennedy has no crypto holdings,\" a spokeswoman for the campaign said at the time.\n\nKennedy said at the conference that if he were to become president he would \"make sure that your right to hold and use bitcoin is inviolable.\"\n\nPresident Joe Biden's administration has waged an aggressive fight in regard to cryptocurrencies. Securities and Exchange Commission Chairman Gary Gensler told CNBC in June \"we don't need more digital currency\" after the SEC sued crypto exchange Coinbase for allegedly acting as an unregistered broker and exchange.\n\nBitcoin's price has seen an upswing recently, hitting a 13-month high Thursday, despite parts of the crypto industry seeing headwinds.\n\nKennedy's campaign has seized attention from several wealthy supporters, even as he remains far behind Biden in Democratic primary polls. A Quinnipiac survey from June shows Biden with 70% support among Democrats and Democratic-leaning voters, while Kennedy has 17%. Kennedy, 69, is the son of former Attorney General and U.S. Sen. Robert F. Kennedy and the nephew of former President John F. Kennedy, both of whom were assassinated in the 1960s.\n\nKennedy's pro-bitcoin stance has aligned him with several top tech investors, such as billionaire and bitcoin enthusiast Jack Dorsey, with several of them offering support for his presidential run. Others include David Sacks, Chamath Palihapitiya and Omeed Malik.\n\nKennedy, who has come under fire for spreading misinformation about vaccines at large, has a history of boosting bitcoin. His nonprofit, Children's Health Defense, or CHD, also has an interest in cryptocurrencies.\n\nIts 2021 tax records show under the \"investments\" section that the group had crypto valued at over $78,000. A spokeswoman for CHD, which reportedly played a key role in pushing back on Covid vaccines and helping elevate Kennedy's profile before he began to run for president, previously told CNBC that the cryptocurrencies listed were not \"investments\" but, in fact, \"donations.\" The CHD website shows that bitcoin is one of the cryptocurrencies accepted for donations toward the nonprofit group.\n\nIn April, before he started running for president, Kennedy tweeted what appeared to be an endorsement of bitcoin being a tool to avoid impacts from a struggling U.S. economy.\n\n\"Cryptocurrencies like Bitcoin give the public an escape route from the splatter zone when this bubble invariably bursts,\" Kennedy said.\n\nIn May, days before he took the stage at the Miami bitcoin conference, Kennedy tweeted: \"Cryptocurrencies, led by bitcoin, along with other crypto technologies are a major innovation engine. It is a mistake for the U.S. government to hobble the industry and drive innovation elsewhere.\"\n\nA day later he tweeted: \"Bitcoin has been a lifesaver for people's movements around the world.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNy8wNy9iaXRjb2luLW1pbmluZy1pcy1hLWdhbWUtb2Ytc3Vydml2YWwtY29uc29saWRhdGlvbi1hbmQtcG90ZW50aWFsLWFpLWRpdmVyc2lmaWNhdGlvbi1iZXJuc3RlaW4v0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzA3L2JpdGNvaW4tbWluaW5nLWlzLWEtZ2FtZS1vZi1zdXJ2aXZhbC1jb25zb2xpZGF0aW9uLWFuZC1wb3RlbnRpYWwtYWktZGl2ZXJzaWZpY2F0aW9uLWJlcm5zdGVpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Mining Is a Game of Survival, Consolidation and Potential AI Diversification: Bernstein - CoinDesk",
        "content": "The broker says the first round of consolidation has already played out and surviving miners are now adding capacity in anticipation of bitcoin halving, when mining rewards are cut by 50%, an event that typically drives the BTC price higher. The next bitcoin halving is likely to occur around April 2024."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYmxhY2tyb2Nrcy1iaXRjb2luLWV0Zi1maWxpbmctaWduaXRlcy1wcmljZS1yYWxseS1ob3BlLWZvci1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Blackrock's Bitcoin ETF Filing Ignites Price Rally, Hope for Approval - Nasdaq",
        "content": "By Landon Manning\n\nAfter contentious rumors and a re-filing with the U.S. Securities And Exchange Commission (SEC), major investment management firm BlackRock’s proposal to launch a long-awaited Bitcoin ETF may soon meet regulatory approval.\n\nOne of the most anticipated developments in the world of Bitcoin financialization is the concept of the Bitcoin ETF, which has yet to be approved for the U.S. financial ecosystem. Essentially, an ETF (exchange-traded fund) is a pooled investment security, a financial instrument that ties its value to that of some external source like a collection of commodities, stock indices or other types of asset. In other words, a Bitcoin ETF would be a security that corporate and individual investors could purchase to speculate on Bitcoin’s success without actually owning the crypto asset directly.\n\nAlthough the number of people getting into Bitcoin and cryptocurrency has gone up over the years, a Bitcoin ETF would make the leading cryptocurrency vastly more accessible and potentially give millions of new investors skin in the game. Understandably then, the possibility of such a product becoming a reality has been making headlines for years, and while many have filed for regulatory approval of Bitcoin-focused ETFs, none have been approved by regulators in the U.S.\n\nBut the entrance of BlackRock as the latest financial firm to submit a Bitcoin-focused ETF proposal to the SEC, is particularly notable. This leading legacy firm has a near-perfect track record in obtaining ETF approvals. Following initial document filing for a spot Bitcoin ETF last month, the cryptocurrency market seemed to take heart, with bitcoin reaching one-year highs shortly after the application.\n\nAlthough the SEC has long signaled concern over the volatility of crypto assets, momentum now seems to favor bitcoin, with BlackRock potentially offering a product never seen before in the space. Although many comparisons can be made between this and previous existing products, an approval here could mark a new era for mainstream acceptance of Bitcoin.\n\nAs the bitcoin price appears to be rallying merely from the rumor of such a product, it seems likely that an actual approval would bring even more price momentum.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzA4L2NvaW5iYXNlLXRoZS1yZWFsLXdpbm5lci1pbi10aGUtYml0Y29pbi1ldGYtcmFjZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "Coinbase Is The Real Winner in the Bitcoin ETF Race - The Motley Fool",
        "content": "In the last month, a wave of major financial institutions have applied to offer spot Bitcoin (BTC -0.18%) exchange-traded funds (ETF) in a bid to bridge Wall Street with the original cryptocurrency. BlackRock (BLK -0.43%) made headlines on June 15 as the first firm to submit an application, followed by Fidelity, Ark Invest, Invesco, WisdomTree, and VanEck, all vying for a piece of the Bitcoin ETF market.\n\nWhile the potential benefits for Bitcoin itself seem obvious, there is another player that stands to gain significantly from this race: Coinbase Global (COIN -1.72%).\n\nThe current situation\n\nAfter receiving the applications, the Securities and Exchange Commission (SEC) wasted no time in reviewing them and promptly sent them back for revisions, deeming them \"inadequate.\" The main issue it identified was a lack of clarity on how the firms would minimize fraud and market manipulation, a key concern for the agency.\n\nIn response to the SEC's feedback, each of the six firms expeditiously refiled their applications and tapped Coinbase as the partner for a shared surveillance agreement. By adding measures to monitor potential market manipulation, Coinbase will play a crucial role in enhancing market integrity and providing the necessary oversight asked for by the government.\n\nTaking on a bigger role\n\nCoinbase's integral role in these applications is a testament to its position as a leader in the cryptocurrency industry. But the true opportunity for Coinbase lies not only in its surveillance capabilities but also in the additional services it will provide to the proposed fund issuers.\n\nAccording to Bloomberg, Coinbase is expected to perform various functions for these firms, including custodial services and acting as a trading platform to buy and sell Bitcoin.\n\nIn fact, both Ark Invest and BlackRock have tapped Coinbase for their custodial services. BlackRock explicitly states in its SEC filing that it will use Coinbase Prime, a product tailored for institutional investors, as the platform for its Bitcoin transactions.\n\nA lucrative opportunity\n\nTransaction fees and custodial services have historically contributed around 10% of Coinbase's quarterly revenue, but now that the platform might serve as a custodian and a brokerage with some of the biggest names on Wall Street, introduction of the Bitcoin ETFs could significantly bolster profits.\n\nTo understand the full scope of how much capital could be involved, we can take a look at the Grayscale Bitcoin Trust (GBTC 3.00%), a popular product that provides investors with exposure to Bitcoin but one plagued with limitations such as inaccurate price tracking, a shortcoming that a spot ETF can remedy.\n\nAs of today, Grayscale holds more than 625,000 Bitcoins to back its Bitcoin Trust, totaling more than $19 billion. Assuming Coinbase hasn't changed its pricing structure since 2021 and still charges a 0.1% fee on custodial accounts, if it were to hold close to the same number of Bitcoins as the Grayscale Trust, the potential revenue from fees could amount to approximately $190 million based on recent Bitcoin prices. With net revenue from the first quarter of 2023 totaling $736 million, a boost in custodial fees of this size could increase Coinbase's bottom line by roughly 25%.\n\nAdding to the profitability of custodial services, Coinbase is in line to also benefit from transaction fees. A unique feature of the new spot ETF applications is that the firms will be able to buy and sell Bitcoin on a daily basis, a feature not currently present with the Grayscale Bitcoin Trust. (This explains why it goes through bouts of trading at premiums or discounts relative to Bitcoin's actual price.)\n\nWith this added functionality, firms like BlackRock will be conducting a multitude of large transactions on a near-daily basis to help the ETF track Bitcoin's price more accurately, potentially adding a significant boost to Coinbase's revenue.\n\nSome necessary context\n\nDespite Coinbase's ongoing lawsuit involving the SEC, the momentum and common theme among all the ETF applications should be viewed as a vote of confidence from some of Wall Street's biggest players looking to do business with the company regardless of the SEC suit.\n\nAlthough no ETF has been approved yet, the SEC's blessing looks more likely by the day. Even better, Coinbase shares still remain down more than 75% from their all-time high.\n\nFor investors seeking exposure to the crypto industry's continued growth and a potential SEC approval of the United States' first spot Bitcoin ETF, Coinbase could be a compelling long-term opportunity at current prices."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5kZXNtb2luZXNyZWdpc3Rlci5jb20vc3RvcnkvbmV3cy9jcmltZS1hbmQtY291cnRzLzIwMjMvMDcvMDgvY2xpdmUtcmVzaWRlbnQtbG9zZXMtdGhvdXNhbmRzLWluLWJpdGNvaW4tYXRtLXNjYW0tcG9saWNlLXNheS83MDM5NDQ3MDAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "Clive resident loses thousands in Bitcoin ATM scam, police say - Des Moines Register",
        "content": "A resident of Clive has lost thousands of dollar in a cryptocurrency scam, prompting the Clive Police Department to warn residents to be vigilant when using Bitcoin ATMs.\n\nThe scammer posed as a Polk County sheriff's deputy and convinced the resident to send $6,600 through a Bitcoin ATM or otherwise face arrest, police said. Bitcoin ATMs allow users to convert cash into cryptocurrency.\n\n\"The scam highlights the growing concern of scammers exploiting the anonymity and difficulty in tracking cryptocurrency transactions,\" Clive police wrote on Facebook. \"According to recent reports, scammers are utilizing fear tactics and impersonating law enforcement officials to deceive unsuspecting individuals into transferring funds through Bitcoin ATMs.\"\n\nMore:20+ Twitter accounts claim to give away an Iowa Lottery prize. How to spot other scams:\n\nThe department warned that once funds are transferred through a Bitcoin ATM, \"they become virtually untraceable, making it incredibly challenging to recover the money.\"\n\nClive police are investigating the theft along with the Polk County Sheriff's Office. Both urge residents not to send money to individuals over the phone or through Bitcoin ATMs and to contact law enforcement authorities immediately to report suspicious activity.\n\nFor more information or to report a scam, call Clive police at 515-278-1312.\n\nFrancesca Block is a breaking news reporter at the Des Moines Register. Reach her at FBlock@registermedia.com or on Twitter at@francescablock3."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tcmVjbGFpbXMtdXMzMDAwMC1ldGhlci1yZW1haW5zLXVuZGVyLXVzMTkwMC10b3AtY3J5cHRvcy1yZWQv0gFdaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1yZWNsYWltcy11czMwMDAwLWV0aGVyLXJlbWFpbnMtdW5kZXItdXMxOTAwLXRvcC1jcnlwdG9zLXJlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin rises back to US$30,000, Ether remains under US$1,900, top cryptos in the red - Forkast News",
        "content": "Bitcoin and Ether rose during Friday afternoon trading in Hong Kong, while the other top 10 non-stablecoin cryptocurrencies by market capitalization were in the red. Crypto investor appetite subsided as the Securities and Exchange Commission (SEC) made no official comment on Bitcoin exchange-traded fund (ETF) applications and executives quit Binance, the world’s largest crypto exchange.\n\nSee related article: Weekly Market Wrap: Bitcoin breaches US$31,195 following Fidelity’s spot Bitcoin ETF application\n\nBitcoin reclaims US$30,000, Ether trades below US$1,900, top 10 cryptos in the red\n\nBitcoin rose 0.39% from 7:20 a.m. to 4:30 p.m. in Hong Kong to US$30,036, recovering above the US$30,000 psychological threshold, after it fell as low as US$29,820 earlier today.\n\nEther inched up 0.32% in the same period to trade at US$1,857 after it slipped below the US$1,900 psychological level yesterday.\n\nRisk appetite subsided, as investors continued to await the SEC ‘s response to the mounting spot Bitcoin ETF applications, including BlackRock’s recently refiled application.\n\n“[BlackRock’s new filing] may indeed increase the chances, but we can’t say surely how fast it will be approved,” wrote Oleh Pyvovarenko, crypto trader and chief executive officer of 2PMarketing blockchain agency, in a statement to Forkast.\n\n“I believe that we will see a Bitcoin ETF in the near future since the SEC can’t ignore this when such companies as BlackRock are willing to create it and put liquidity in it.”\n\nContributing to poor investment sentiment, Binance Chief Strategy Officer Patrick Hillmann and Vice-President for Compliance Steven Christie said they are leaving the world’s largest exchange, citing personal reasons. Binance CEO Changpeng Zhao in a tweet called the departures normal “turnover” for large organizations.\n\nHowever, a Fortune report citing unnamed sources and published before Hillmann and Christie confirmed they were leaving, said the executives were quitting due to disappointment over how Zhao was dealing with regulatory investigations of the company.\n\nZhao in his tweet said the reasons for the departures dreamed up by the “news” are completely wrong.\n\nLitecoin saw the biggest loss in the top 10, falling 7.51% to US$96.28, followed by Dogecoin that lost 3.65% to US$0.06527.\n\nThe total crypto market capitalization over the past 24 hours fell 2.68% to US$1.17 trillion and market volume increased 36.56% to US$46.15 billion, according to CoinMarketCap data.\n\nBitcoin NFT sales rise, Ethereum NFT sales fall but Azuki starts recovery\n\nThe Forkast 500 NFT index inched down 0.05% to 2,779.11 points in the 24 hours to 4:30 p.m. in Hong Kong but fell 2.9% during the week.\n\nAfter a weaker Thursday, Bitcoin’s 24-hour non-fungible token sales increased 65.22% to US$4.51 million, as sales for Uncategorized Ordinals rose 1.27% to US$2.41 million.\n\nEthereum’s 24-hour NFT sales fell 11.7% to US$17.26 million, as sales for the largest Ethereum-native NFT collection, the Bored Ape Yacht Club, fell 9.68% to US$2.93 million.\n\nAzuki sales rose 32.96% to US$1.58 million, as the collection started recovering from the backlash over the new Azuki Elementals collection that was criticized for being too similar to the original collection.\n\n“The big NFT collections who saw large decreases in their floor prices have regained some footing, and now are bouncing up or down around 5% instead of the massive double-digit swings they were seeing earlier this week and last week,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nBesides the Forkast 500 NFT index, the Forkast ETH NFT Composite was the only one in the red, falling 0.14% to 945.46 points.\n\nAsian equities, U.S. stock futures fall amid mounting U.S.-China trade tensions\n\nImage: elements.envato\n\nMajor Asian equities fell as of 4:30 p.m. in Hong Kong, as investors remained cautious in expectation of China’s inflation data for June, scheduled for next week.\n\nJapan’s Nikkei 225 fell 1.17% and the Shenzhen Component Index fell 0.73%. The Shanghai Composite decreased 0.28% and Hong Kong’s Hang Seng Index fell 0.90%, plunging 2.9% for the week.\n\nInvestor appetite took a hit amid semiconductor trade tensions between Beijing and Washington, after China filed a complaint against U.S. export curbs, alleging that Washington was abusing sales controls to maintain its leadership in the tech and manufacturing sectors.\n\nU.S. stock futures also fell during Friday afternoon trading in Hong Kong, amid growing Sino-U.S. tensions. The S&P 500 futures index inched down 0.028%, the tech-heavy Nasdaq-100 futures slipped 0.079% and the Dow Jones Industrial Average futures fell 0.026%.\n\nTreasury Secretary Yellen began a four-day visit to China on Thursday, with little expectations from both sides, yet investors hope that her meetings will stabilize the fractured relations between the two nations.\n\nThe monthly U.S. jobs report showed that private sector employers added 497,000 jobs in June, far exceeding the 220,000 estimate, which reinforces expectations that the Fed will hike interest rates this month.\n\nThe U.S. services purchasing managers’ index rose to 53.9 in June, according to the Institute for Supply Management on Thursday, which beats Reuters’ projection of 51. A reading above 50 indicates expansion, below 50 a contraction.\n\nThe data added to concerns that the Federal Reserve will continue its campaign of raising rates and holding them higher for longer periods to tackle inflation. The Fed meets on July 26 to make its next decision on interest rates, after leaving them unchanged in June at between 5% and 5.25%.\n\nThe CME FedWatch Tool predicts a 92.4% chance for a 25-basis-point rate increase, up from 88.7% on Thursday. The likelihood the Fed won’t increase is now at just 7.6%.\n\nInvestors now anticipate June’s payrolls report scheduled for Friday, which is expected to show an easing in jobs growth.\n\nSee related article: EU publishes draft bill for digital euro and cash payments\n\n(Corrects paragraph six to show Binance executives cited personal reasons for resignations, adds detail in paragraphs seven, eight.)"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tbWluZXJzLWdyb3d0aC0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Which bitcoin miners are growing the fastest in 2023? - Blockworks",
        "content": "Bitcoin mining giant Marathon Digital has outpaced many of its publicly traded competitors so far this year in terms of hash rate growth, a Blockworks review of production reports indicates.\n\nThe Florida-based company has more than doubled its deployed fleet over the last six months.\n\nMarathon had roughly 69,000 operating miners capable of producing about 7 exahashes per second (EH/s) on Jan. 1. Six months later, its fleet numbered 149,900 — yielding an operational hash rate of 17.7 EH/s — Marathon revealed in a July 5 production report.\n\nThe company had a goal of reaching 23 EH/s by mid-year, a mark Marathon CEO Fred Thiel said in a statement can be fulfilled via “final steps” at facilities in Ellendale, North Dakota, and Garden City, Texas.\n\n“The final building in Ellendale is expected to come online this month, and final Garden City tie-in is also expected within that same period,” Thiel added.\n\nRead more: Marathon CEO: ‘Diversity in Site Mix’ Is Key to Future Growth\n\nAnother company that has more than doubled its hash rate this year is New York-based Cipher Mining, which stood at 6.7 EH/s last month — up from 2.8 EH/s at the end of 2022.\n\nComing in with a slightly lower hash rate, but with an even higher high growth is Iris Energy, at 5.6 EH/s. The Australia-based company has brought that capacity up more than 250% since December, when it had a hash rate of 1.5 EH/s.\n\nIris Energy is targeting a data center capacity of 9.1 EH/s by early 2024.\n\nThe roughly 150% year-to-date hash rate growth is outpacing other notable public mining companies.\n\nCore Scientific, a Texas-based miner currently navigating bankruptcy, reported a self-mining hash rate of 15 EH/s at the end of June, down from 15.7 EH/s in December.\n\nRiot Platforms — also operating in Texas — reported a deployed hash rate of 10.7 EH/s as of June 30, up from 9.7 EH/s at the end of 2022, a 10% increase.\n\nThe company revealed a deal with miner manufacturer MicroBT last month that includes an initial order of 33,280 MicroBT miners for Riot’s Corsicana facility in Texas. Those miners would add roughly 7.6 EH/s to its fleet in mid-2024, according to the company.\n\nMeanwhile Nevada-headquartered CleanSpark’s number of deployed miners increased from 63,700 to 68,678 in the last six months, boosting its hash rate 8% from 6.2 EH/s to 6.7 EH/s over that span.\n\nThough Hut 8 Mining had a hash rate capacity of 2.6 EH/s at the halfway point of 2023 across its Alberta facilities — just a slight increase from 2.5 EH/s six months ago, its upcoming merger with US Bitcoin Corp. may be set to spur quick growth.\n\nThe company, which first revealed the combination in February, said it expects to have a hash rate capacity of 7.5 EH/s across facilities in Alberta, New York, Nebraska and Texas post-merger.\n\nHive Blockchain Technologies, which intends to rebrand as soon as next week as part of a strategic shift to focus more on supporting artificial intelligence (AI) projects, had nearly 2.1 EH/s of hash rate capacity at the end of last year.\n\nThe company last reported its hash rate as of May, at which point it stood at about 3.3 EH/s.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWJpdGNvaW4tcy1wcmljZS1pcy1wcmltZWQtdG8taG9sZC10aGUtMzAtMDAwLWxldmVsLWFzLXN1cHBvcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "3 reasons why Bitcoin's price is primed to hold the $30,000 level as support - Cointelegraph",
        "content": "Bitcoin’s price gave back some of its recent gains this week, but multiple data points suggest that $30,000 should hold as support going forward.\n\nBitcoin (BTC) remained within a narrow 4.3% range for the 15 days leading up to July 7. Despite the proximity of the $29,895 to $31,165 range, investors’ sentiment was significantly impacted by an unsuccessful attempt to break above $31,400 on July 6.\n\nTraders’ tendency to overreact to short-term price movements rather than Bitcoin’s year-to-date gains of 82% could be part of the reason for the short-term correction. This same rationale applies to the events related to other cryptocurrencies.\n\nAt the forefront of investors’ minds are questions about whether the recent price gains were solely driven by multiple spot Bitcoin exchange-traded fund (ETF) requests.\n\nOther pressing developments include Binance’s chief strategy officer, Patrick Hillmann, and other top compliance officers reportedly leaving the exchange on July 6 over CEO Changpeng Zhao’s response to the United States Justice Department’s investigation. On June 29, the crypto exchange also informed users that its euro banking payment gateway would cease services by September, potentially halting deposits and withdrawals via SEPA bank transfer.\n\nMeanwhile, the yield curve on interest rates reached its deepest inversion since 1981 on July 3, reflecting the two-year note’s 4.94% yield compared to the 10-year note trading at 3.86%, the opposite of what is expected from longer-term bonds. The phenomenon is closely watched by investors, as it has preceded past recessions.\n\nAll of these events are likely having some impact on the Bitcoin price and investor sentiment. Both topics are explored in greater depth below.\n\nTraders show strength in margin, options and futures markets\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe OKX margin lending indicator based on the stablecoin/BTC ratio has steadily increased from 20x favoring longs on July 1 to the current 29x ratio on July 7, indicating growing confidence among traders using margin lending. However, it remains within a neutral-to-bullish range, below the historical 30x threshold associated with excessive optimism.\n\nBesides leaving room for further long leverage, the indicator shows no signs of potential stress on margin markets in case of a sudden Bitcoin price correction.\n\nTraders aren’t buying protective puts or increasing their shorts\n\nTraders can also gauge the market’s sentiment by measuring whether more activity is going through call (buy) options or put (sell) options. A 0.70 put-to-call ratio indicates that put option open interest lags the more bullish calls and is, therefore, bullish. In contrast, a 1.40 indicator favors put options, which can be deemed bearish.\n\nBTC options volume put-to-call ratio. Source: Laevitas\n\nThe put-to-call ratio for Bitcoin options volume has remained below 1.0 for the past three days, suggesting a higher preference for neutral-to-bullish call options. The important thing here is, despite Bitcoin’s price briefly correcting to $29,750 on July 7, there was not a significant surge in demand for protective put options.\n\nThe top traders’ long-to-short net ratio excludes externalities that might have solely impacted the options markets. There are occasional methodological discrepancies between different exchanges, so readers should monitor changes instead of absolute figures.\n\nExchanges' top traders' long-to-short ratio. Source: CoinGlass\n\nThe long-to-short ratio for OKX’s top traders increased from 0.52 on July 3 to 1.68 on July 7, indicating strong demand for leveraged long positions despite Bitcoin’s failure to break above $31,000. At Binance, the indicator declined from 1.52 on July 3 to 1.39 on July 7, remaining above its 1.33 average for the previous 30 days, which suggests a neutral reading.\n\nRelated: Bitcoin mining stocks outperform BTC in 2023, but on-chain data points to a potential stall\n\nBears will have a tough time given the markets’ expectation of a potential ETF approval\n\nNatalie Brunell, an award-winning TV journalist, podcast host and educator in the Bitcoin space, spoke to Cointelegraph on how crypto is now being taken more seriously as an asset class by institutional investors, as evidenced by the multiple Bitcoin ETF filings, including by some of the world’s largest asset fund managers.\n\nSpeaking on Fox Business on July 5, Larry Fink, the CEO of BlackRock, also said that Bitcoin’s role was largely “digitizing gold,\" suggesting U.S. regulators consider how a spot ETF could democratize finance. Fink suggested that investors could turn to Bitcoin as a hedge against inflation or the devaluation of certain currencies.\n\nSo, from a bird’s-eye view, for those questioning whether Bitcoin is poised for a correction after a rally fueled by ETF hype, the resilience of traders’ bullish conviction and lack of excessive optimism observed in the BTC margin show they need to relax.\n\nBitcoin options and futures markets indicate that challenging times are ahead for Bitcoin bears and those expecting a sharp price correction solely due to regulatory and recessionary concerns.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTA4L2hvdy1iaXRjb2luLXMtbmV4dC1oYWx2aW5nLXdpbGwtYWZmZWN0LXN0cnVnZ2xpbmctY3J5cHRvLW1pbmVycy1idGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "How Bitcoin’s Next Halving Will Affect Struggling Crypto Miners (BTC) - Bloomberg",
        "content": "Sign up for our new Crypto newsletter and follow @crypto Twitter for the latest news.\n\nCrypto enthusiasts are hopeful that a once-in-four-years event which rewrites the underlying code of the world’s biggest cryptocurrency will extend the current market rally. But the milestone also risks sounding the death knell for certain Bitcoin miners."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzA3L3Vucml2YWxlZC1zY2FyY2l0eS1mdWVscy1teS1iaXRjb2luLWJ1eWluZy1zcHJlZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Unprecedented Scarcity Is Fueling My Bitcoin Buying Spree - The Motley Fool",
        "content": "As an investment proposition, one of Bitcoin's (BTC -0.15%) primary appeals lies in its ability to preserve wealth over the long term. While this perception of Bitcoin is evolving, there is no denying that its capped supply of 21 million coins makes it an ideal store of value.\n\nYet when diving a little deeper, it becomes clear that Bitcoin will likely provide more benefits to holders than only being a store of value and could instead provide significant price appreciation. With the cryptocurrency's price already up almost 400% in the last five years, developing dynamics in Bitcoin's supply and demand could send its price to levels not seen before.\n\nA dwindling inflation rate\n\nCurrently, there are approximately 19.5 million bitcoins in circulation, with the remaining 1.5 million set to be minted at a diminishing rate over the next 120 years. To accomplish this, Bitcoin is hardwired with a mechanism known as halvings, a distinctive feature that sets Bitcoin apart from other cryptocurrencies and has led to its reputation as a premier store of value.\n\nEvery 210,000 blocks, or roughly every four years, the rate at which new bitcoins are created is cut in half. In Bitcoin's early days, every time a miner successfully mined a Bitcoin block, 50 bitcoins were minted. But after 14 years and three halvings, only 6.25 bitcoins per block enter the market today.\n\nWhile it is clear that a pattern of reduced inflation rates benefits an asset's price, the true extent of Bitcoin's available supply can't be portrayed by only analyzing its halvings.\n\nExchange balances are at all-time lows\n\nIt would be plausible to assume that the number of bitcoins available would fall with each halving. Yet historically, the number of coins available has actually outpaced demand. Evidence of this can be found in data from Glassnode, a blockchain intelligence platform, which reveals a steady increase in the number of coins held on exchanges from 2013 to 2020, peaking at 3.2 million.\n\nHowever, since the May 2020 halving, which reduced Bitcoin's inflation rate from about 4% to 1.75%, the number of coins available for purchase on exchanges has significantly declined. Currently, there are only 2.2 million coins on exchanges, marking a substantial drop.\n\nHodl, hodl, hodl\n\nThe most apparent explanation for the dwindling number of available coins would be a shift in the balance between supply and demand. While the impact of the pandemic likely played a role, and trends in adoption increased demand for Bitcoin, this supposition fails to paint the full picture of Bitcoin's decreasing supply.\n\nThe most likely culprit explaining the decreased amount of bitcoins available is the widespread strategy used by investors to buy and hold, better known as \"hodling.\" Hoping that demand will increase over time, Bitcoin investors have proven remarkably stubborn, continuing to hold their assets even amidst market turbulence.\n\nEvidence of this can be found by evaluating the number of dormant bitcoins. Data shows that nearly 70% of all bitcoins have not moved in the last year, while 40% have remained untouched for the past three years. Astonishingly, 30% of bitcoins have been idle over the last five years or longer.\n\nThese levels of holding are even more extraordinary when considering the debacles that plagued the crypto industry last year. As companies and exchanges imploded, Bitcoin holders remained resilient, continuing to hold even as its price slumped more than 60%.\n\nMounting pressure\n\nContrary to the notion that 19.5 million bitcoins are available for purchase, the reality is that this number is much lower and will likely continue to trend lower with time. Pending some unforeseen scenario, investors should plan on Bitcoin's supply to become even more scarce, especially when considering the imminent entry of institutional investors.\n\nWhile Bitcoin historically has been predominantly purchased by retail investors, financial giants such as BlackRock and Fidelity are on the verge of entering the market as they aim to create the first spot Bitcoin exchange-traded fund. If these firms receive approval, it would open the doors for tens of trillions of dollars previously sidelined on Wall Street eagerly waiting to gain exposure to Bitcoin, potentially amplifying the demand and driving its price even higher.\n\nWith another halving expected in spring 2024, clear signs of increased demand, and remarkable holding trends, there are favorable tailwinds forming in the coming years that could propel Bitcoin to unprecedented levels. Although its price is currently more than 50% below its all-time high, a valuable opportunity presents itself for investors looking to secure their share of the limited 21 million coins."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzA3L3VzLWFkZGVkLTIwOWstam9icy1pbi1qdW5lLW1pc3NpbmctZXhwZWN0YXRpb25zLWZvci0yMzBrL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzA3L3VzLWFkZGVkLTIwOWstam9icy1pbi1qdW5lLW1pc3NpbmctZXhwZWN0YXRpb25zLWZvci0yMzBrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "U.S. Added 209K Jobs in June, Missing Expectations for 230K - CoinDesk",
        "content": "The rate of inflation as measured by the Consumer Price Index (CPI) has fallen from a peak of 9.1% in 2022 to the current 4.0%, but it remains well above the Fed's 2% target. Additionally, core CPI – which strips out volatile food and energy costs – has been more stubborn, with the current rate of 5.3% down far more modestly from its peak of 6.6% last year."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLWZsb2F0cy1hYm92ZS11czMwMDAwLWRlc3BpdGUtc2VjLXNpbGVuY2UtYml0Y29pbi1ldGYtYXBwbGljYXRpb25zL9IBdmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLWZsb2F0cy1hYm92ZS11czMwMDAwLWRlc3BpdGUtc2VjLXNpbGVuY2UtYml0Y29pbi1ldGYtYXBwbGljYXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin holds above US$30,000; SEC officially silent over spot Bitcoin ETF applications - Forkast News",
        "content": "Bitcoin fell 2.42% from June 30 to July 7 to US$30,107 at 6:20 p.m. Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization briefly fell to US$29,908 on Friday, before recovering above the US$30,000 psychological level. Ether fell 1.78% over the week to US$1,859.\n\nThe Wall Street Journal reported a week ago that the Securities and Exchange Commission (SEC) was less than impressed by Bitcoin ETF applications from firms such as BlackRock, WisdomTree and Fidelity Investments.\n\nBlackRock, the world’s biggest asset manager, refiled its spot Bitcoin ETF application on Monday, seemingly in response to the report, but so far the SEC has made no official comment on any applications.\n\n“This strategic move indicates that BlackRock is actively working towards bridging any gaps between their proposal and regulatory expectations,” Lucas Kiely, the chief investment officer of digital asset platform Yield App, told Forkast in a statement.\n\n“The SEC will thoroughly review BlackRock’s revised application, taking into consideration various factors such as investor protection, market manipulation risks, and overall market stability. The approval timeline remains uncertain,” Kiely said.\n\nYet, James Wo, the founder and chief executive officer of crypto investment firm DFG, said BlackRock’s refiled ETF application won’t necessarily increase the chance of acceptance.\n\n“Since the SEC has not explicitly approved or rejected a particular [spot Bitcoin] ETF application at this point, it is hard to see how the SEC is leaning towards such ETF products, which are still a black box, and it is hard to say at this point when a spot Bitcoin ETF will be approved,” he said to Forkast.\n\nOn Tuesday, the price of Bitcoin rose to US$31,371, its highest since June 2022, as BlackRock’s refiled application fueled investor optimism.\n\nIn another boost to market risk appetite, Larry Fink, BlackRock’s chief executive officer, said crypto, especially Bitcoin, could “revolutionize finance,” during an interview with Fox Business on Wednesday. Fink was previously known for his anti-crypto stance, calling Bitcoin an “index of money laundering” in 2017.\n\nMinutes of June’s Federal Open Market Committee meeting released on Wednesday revealed that most members were in favor of more interest rate hikes. Ahead of the next Federal Reserve meeting on July 26, the CME FedWatch Tool predicts a 88.7% chance for a 25-basis-point rate increase.\n\nThe global crypto market capitalization stood at US$1.17 trillion on Friday at 6:20 p.m. in Hong Kong, down 2.5% from US$1.2 trillion a week ago, according to CoinMarketCap data. With a market cap of US$584 billion, Bitcoin represented 49.9% of the market while Ether, valued at US$223 billion, accounted for 19.1%.\n\nNotable Movers: MKR, BIT\n\nMaker DAO’s (MKR) token was this week’s biggest gainer among the top 100 coins, rising 28.55% this week to trade at US$991.28. The coin started gaining last Friday amid increasing risk appetite in the crypto space\n\nBitDao’s (BIT) token was this week’s second-biggest gainer, rising 19.75% to US$0.4538. The token also started its rally last Friday, after the protocol opened the voting for the MIP-23 supply optimization proposal, which will optimize the supply of the upcoming Mantle (MNT) token while burning some of the Bit token’s supply.\n\nSee related article: Why the US is waging war on Binance, Coinbase\n\nNext week: Can Bitcoin rise above US$32,500?\n\n“Bitcoin is now testing a major resistance area glued inside US$31,700-32,500. This area previously represented strong resistance in late May 2022 and seems to be acting as a strong resistance now,” Aziz Kenjaev, financial analyst and director of business development at cross-chain liquidity protocol Entangle, told Forkast, referencing the chart below.\n\n“Next major pit stop for BTC would be US$34,450-36,000. However, to get to these levels, Bitcoin must close above the major resistance of US$32,500.”\n\nNilesh Verma, crypto market analyst and founder of Crypto Granth consultancy in India, agreed that Bitcoin needs to rise past US$30,000-32,000 for sustained bullish momentum.\n\n“A successful breakout will open the way for US$40,000-48,000 before halving. US$30,000 is a psychological support level on the chart,” wrote Verma, in a Twitter response to Forkast.\n\nOn the macroeconomic front, investors will be looking forward to several speeches from Federal Reserve members, including vice-chair of the U.S. Federal Reserve Michael Barr, San Francisco Federal Reserve President Mary Daly, Atlanta Federal Reserve President Raphael Bostic, and Minneapolis Fed President Neel Kashkari.\n\nIn the U.S., the core consumer price index report for June is scheduled for release on Wednesday that could provide more insight on the Fed’s upcoming interest rate decision.\n\nSee related article: Cardano ‘ghost chain’ outperforms top blockchains in NFT market"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTA3L2JpdGNvaW4tYnRjLXJhbGx5LWZhbHRlcnMtYXMtbW9yZS10dXJtb2lsLXJhdGVzLXByZXNlbnQtaGVhZHdpbmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Rally Falters as More Turmoil, Rates Present Headwinds - Bloomberg",
        "content": "Bitcoin is ending the week on a down note after the optimism that pushed the price of the largest digital asset to a one-year high fades amid a flurry of fresh industry turmoil and crosscurrents in global financial markets.\n\nThe cryptocurrency, which accounts for about half of the crypto sector’s $1.2 trillion market value, edged lower for a fourth consecutive day to settle around $30,200 on Friday. The token briefly touched $31,504 on Thursday, the highest level since June 2022."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzA3L3NlYy1hcHByb3ZhbC1vZi1zcG90LWJpdGNvaW4tZXRmLWlzLXVubGlrZWx5LXRvLWJlLWEtZ2FtZS1jaGFuZ2VyLWZvci1jcnlwdG8tbWFya2V0cy1qcG1vcmdhbi_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNy8wNy9zZWMtYXBwcm92YWwtb2Ytc3BvdC1iaXRjb2luLWV0Zi1pcy11bmxpa2VseS10by1iZS1hLWdhbWUtY2hhbmdlci1mb3ItY3J5cHRvLW1hcmtldHMtanBtb3JnYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "SEC Approval of Spot Bitcoin ETF Is Unlikely to Be a Game Changer for Crypto Markets: JPMorgan - CoinDesk",
        "content": "Physical backed bitcoin ETFs offer some advantages over futures-based funds, but these are rather marginal, the note said. Spot ETFs offer a more direct and secure way to gain exposure to bitcoin, removing some of the complexities around direct custody and transfer of BTC and the basis risk associated with futures-based products."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNy8wNy9ibGFja3JvY2stY2VvLWxhcnJ5LWZpbmtzLXR1cm5hYm91dC1vbi1iaXRjb2luLWVsaWNpdHMtY2hlZXJzLXNrZXB0aWNpc20tZnJvbS1jcnlwdG8taW5zaWRlcnMv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzA3L2JsYWNrcm9jay1jZW8tbGFycnktZmlua3MtdHVybmFib3V0LW9uLWJpdGNvaW4tZWxpY2l0cy1jaGVlcnMtc2tlcHRpY2lzbS1mcm9tLWNyeXB0by1pbnNpZGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "BlackRock CEO’s Turnabout on Bitcoin Elicits Cheers, Skepticism of Crypto Cred - CoinDesk",
        "content": "The key distinction is that an ETF is simply a traditional investment vehicle, with bitcoin as the asset, but traded on a regulated stock exchange, via regulated brokers. Such structures might be anathema to Bitcoin, designed and then launched in 2009 by a pseudonymous creator – partly as a backlash against the Wall Street excesses that fueled the global financial crisis a year earlier – as an internet-based, peer-to-peer payments network that would be free from government control."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9haS1iaXRjb2luLXByaWNlLXByZWRpY3Rpb24tb3Zlci03NTBrLWFydGh1ci1oYXllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "AI has potential to send Bitcoin price over $750K — Arthur Hayes - Cointelegraph",
        "content": "Bitcoin (BTC) will be the currency of artificial intelligence (AI) and could reach a price per coin of $760,000 in the process, Arthur Hayes says.\n\nIn his latest essay titled “Massa,” the former BitMEX CEO concluded that the AI revolution would naturally gravitate toward BTC.\n\nHayes: Bitcoin is a “logical currency choice for AI”\n\nDespite fiat currency regimes being destined to become evermore dysfunctional in the future, Hayes said, there is one burgeoning economic sector that will only go from strength to strength: AI.\n\nWhile still nascent in 2023, the coming decades will see an explosion of AI-related implementations that will make it ubiquitous and unavoidable.\n\n“Recent advancements in computing power have brought us to the cusp of a hockey stick moment, in which AI will go viral and change the course of humanity virtually overnight,” he wrote.\n\n“In only two months, ChatGPT reached 100 million monthly active users making it the fastest adopted technology in human history — so just imagine how quickly everything is going to change as AIs are integrated into everyday life and continue to learn and improve.”\n\nWhen it comes to integration, the financial solution on the table first and foremost, Hayes said, will not be a tailor-made, AI-focused altcoin — it will be Bitcoin instead.\n\nThe reason, an accompanying theory states, is that AI will view Bitcoin’s inherent qualities — an immutable fixed supply, digital scarcity and its status as “energy money” — as the logical choice.\n\n“An AI is unlikely to allow itself to rely on anything that a human government operates therefore only gold and Bitcoin are suitable. A tie between gold and Bitcoin,” Hayes continued.\n\n“Bitcoin is thus the logical currency choice for any AI. It is purely digital, censorship resistant, provably scarce, and its intrinsic value is completely electricity-cost-dependent. There is nothing in existence today that comes close to challenging Bitcoin on these aspects.”\n\nAnother path toward a $1-million BTC price\n\nWhere would that leave BTC’s price?\n\nRelated: BTC price remains ‘undoubtedly bullish’ as $30K Bitcoin buyers emerge\n\nFrom around $30,000 today, the real effect of AI should kick in in around three years’ time.\n\nAfter that, Hayes said, it could be around another decade before the network value boost from AI alone sends BTC/USD to nearly $1 million.\n\n“I believe the peak of deranged growth investing will occur in the 2025 to 2026 timeframe. Therefore, the goal of my predictions regarding the future price of Bitcoin is to form a narrative that takes hold before then,” he explained.\n\nDepending on the scale of that investing, BTC price action could see up to $760,000 per coin.\n\n“Remember — the market will overpay for Bitcoin network growth if it believes there is a possibility that my assumptions could be true in the future,” part of “Massa” concludes.\n\n“The most money is made when the market price adjusts from ‘can never happen’ to ‘maybe could happen.’”\n\nBitcoin price target calculation (screenshot). Source: Arthur Hayes\n\nHayes is well known for his bullish long-term perspective on Bitcoin, recently championing a million-dollar price tag as a function of fiat currency disintegration.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDcvMDcvcmVmaWxlLWFuZC13YWl0LXB1bHNlLWNoZWNrLW9uLXRoZS1xdWVzdC1mb3ItYS1zcG90LWJpdGNvaW4tZXRmLS5odG1s0gFpaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDcvMDcvcmVmaWxlLWFuZC13YWl0LXB1bHNlLWNoZWNrLW9uLXRoZS1xdWVzdC1mb3ItYS1zcG90LWJpdGNvaW4tZXRmLS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Refile and wait? Pulse check on the quest for a spot bitcoin ETF - CNBC",
        "content": "Bitcoin's bounce back this summer has largely been fueled by renewed hopes of a spot bitcoin exchange-traded fund launch this year, but recent attempts from major firms like Fidelity and BlackRock continue to be deemed insufficient for approval by the U.S. Securities and Exchange Commission.\n\n\"Everybody refiled, depending on how you read the paperwork,\" Dave Nadig, financial futurist at VettaFi, told Bob Pisani on CNBC's \"ETF Edge\" on Wednesday. \"All of them are now talking about having a surveillance-sharing agreement with Coinbase .\"\n\nSurveillance-sharing agreements between exchanges and crypto custodians like Coinbase were put into place by asset managers in an attempt to appease the SEC's concerns about possible fraud and market manipulation. But the regulator still found the filings to lack clarity and comprehension, prompting BlackRock to refile last week.\n\n\"And I think there's this idea that somehow BlackRock knew something,\" Nadig said. \"And that the SEC is on the verge of approving this, once these surveillance-sharing agreements are in place.\"\n\nBlackRock first filed its application to launch the iShares Bitcoin Trust last month, with Fidelity following suit two weeks later. WisdomTree, VanEck and Invesco have also taken the steps toward their own funds.\n\nNadig explained that he still remains fairly negative on the SEC's imminent approval, the most realistic scenario being an SEC response indicating a new standard for filings and surveillance-sharing agreements across the board.\n\n\"There's a level of scrutiny involved that I will be surprised if Coinbase can meet the mark on,\" Nadig said. \"However, if [the SEC] is trying to manufacture a way to approve a bitcoin ETF, this would be the way to do it. It would still be a big shift from what they've said in the past.\"\n\nThe filings come amid an ongoing legal battle between Grayscale and the SEC about converting its Grayscale Bitcoin Trust (GBTC) into an ETF. A decision in the case is expected later this year.\n\n\"I think it's quite reasonable to say that the SEC has been arbitrary and capricious on how they've applied certain rules,\" Nadig said, adding that the SEC historically has viewed corresponding commodity spot and futures products as a positive indicator for approval.\n\n\"That doesn't mean that they necessarily approve the conversion of GBTC into an ETF,\" he added. \"But I think they can still lose that lawsuit that says [the SEC] treated somebody unfairly under the Administrative Procedures Act.\"\n\nBut Nadig explained that a potential loss by the SEC in the Grayscale lawsuit will not necessarily translate to a green light for asset management firms seeking spot funds.\n\n\"I think the odds are still negative for this year,\" Nadig said. \"But certainly, things look more positive than they did maybe three weeks ago, six weeks ago.\"\n\nDisclaimer"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzA3L2JsYWNrcm9ja3MtbGFycnktZmluay1zYXlzLWJpdGNvaW4tbWF5LXRyYW5zZm9ybS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "BlackRock's Larry Fink Says Bitcoin May Transform the Financial World - The Motley Fool",
        "content": "After a difficult 2022, cryptocurrencies are rallying -- along with the general market. In fact, Bitcoin (BTC -0.15%), the world's biggest cryptocurrency, has climbed about 80% this year. In more good news, asset management powerhouse BlackRock is showing confidence in the asset class.\n\nChief Executive Officer Larry Fink told Fox Business that Bitcoin may \"revolutionize finance.\" The firm filed paperwork with regulators last month for a spot Bitcoin ETF. Let's take a closer look at what Fink had to say -- and consider whether cryptocurrency is a buy today.\n\nFink's evolving view of crypto\n\nFink generally has been known for his skepticism about cryptocurrency. Back in 2017, he referred to Bitcoin as an \"index of money laundering.\"\n\nBut Fink's views of crypto have evolved since that time, becoming more and more positive. For example, in a 2022 letter to shareholders, Fink wrote: \"BlackRock is studying digital currencies, stablecoins, and the underlying technologies to understand how they can help us serve our clients.\"\n\nFast-forward to today. In an interview with Fox Business, Fink said that as an international asset, Bitcoin could represent a hedge against inflation or problems happening in a particular country. \"We do believe that if we can create more tokenization of assets and securities -- that's what Bitcoin is -- it could revolutionize finance,\" he said.\n\nIt's true that cryptocurrencies could transform finance -- and in more than one way. As Fink suggests, these international assets offer an investment alternative. They aren't linked to a specific economy. So they could provide a safe haven for investors if things aren't going particularly well in any given country.\n\nCryptocurrency may also be transformational when it comes to getting business done. These blockchains could make banking more accessible to people around the world, make payments more efficient, and help the metaverse take off. Much of this is already happening.\n\nOf course, it's too early to say whether crypto truly will become mainstream -- it implies that a great deal of business and entertainment would depend on blockchain networks. But many of today's cryptocurrencies could have what it takes to make that a reality.\n\nEthereum and Solana\n\nFor example, decentralized applications running on Ethereum (ETH -2.38%) allow you to lend, borrow, invest, and even create and collect art. And crypto Solana's (SOL 10.01%) Solana Pay allows businesses to skip intermediaries -- and execute faster, cheaper payments.\n\nSo it's clear these and other crypto players could transform the way business is done. Does that mean you should invest in cryptocurrency right now? The answer depends on your investment style and comfort with risk.\n\nIf you have a diversified portfolio and you're comfortable with risk, crypto may be right for you. But since crypto is relatively new, we don't exactly know what the industry will look like five or 10 years from now. That's why you shouldn't invest more in this area than you can afford to lose.\n\nDiversification can also lower your risk. For most investors, crypto should only be a small part of a diversified portfolio -- especially if you are a cautious investor -- and might include at least several kinds of cryptocurrencies.\n\nFinally, if you're going to invest in cryptocurrency, pick those you believe can excel over time -- and invest for the long term. As with other assets, choosing quality and holding on is the best way to grow wealth.\n\nIf those points sound good to you, now could be a great time to add cryptocurrency to your portfolio. Though many players have climbed since the start of the year, they're still well off highs reached back in 2021.\n\nCan they make it back to those levels and climb higher? Possibly. As Fink says, they have the potential to reshape finance. And if crypto does indeed do that, investors who buy today might win big over the long haul."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktYS1iaXRjb2luLWV0Zi1hcHByb3ZhbC13b3VsZC1iZS1hLWJpZy1kZWFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Why a Bitcoin ETF approval would be a big deal - Cointelegraph",
        "content": "In this week’s episode of Market Talks, Cointelegraph welcomes Natalie Brunell, a podcast host, educator and media commentator in the Bitcoin space. Her podcast, Coin Stories, consistently ranks among the top 50 to 100 on Apple podcasts. She has over 300,000 Twitter followers, and is an award-winning TV journalist and former investigative reporter.\n\nBrunell explains how Bitcoin (BTC) is a tool for the financial empowerment of billions of people worldwide and how the depreciating United States dollar is stripping away people’s economic dignity.\n\nThe elephant in the room when discussing Bitcoin with someone new to the crypto space is its volatility and risk factor. Brunell describes how to overcome this, and how to explain that Bitcoin might be better than traditional assets, including stocks and real estate.\n\nBrunell offers her take on institutions turning back toward crypto amid multiple spot Bitcoin exchange-traded fund (ETF) filings — despite their love/hate relationship with the sector. Brunell wonders if institutions just want a piece of the pie now that crypto is being taken seriously as an asset class. She also gives her sense of how people feel about the Bitcoin ETF, and why the U.S. Securities and Exchange Commission might lean toward approval.\n\nBrunell talks about her roots and backstory, describing what it was like growing up under communism, and how her parent’s struggles motivated her to search for something like Bitcoin long before it existed.\n\nFor aspiring content creators, Brunell explains how she found success doing it. She also gave tips on making a name for yourself and finding your voice in the crowded content creation space.\n\nMarket Talks airs every Thursday, featuring interviews with some of the most influential and inspiring people from the crypto and blockchain industry. So, head over to the Cointelegraph Markets & Research YouTube page, smash those “Like” and “Subscribe” buttons for all future videos and updates, and check out the conversation with Brunell."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrLWNvaW5zLXNvbGFuYS1zdXJnZXMtYml0Y29pbi0xODQyNDA0NTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "This Week in Coins: Solana Surges as Bitcoin and Ethereum Rally Rebound - Yahoo Finance",
        "content": "Illustration by Mitchell Preffer for Decrypt.\n\nEchoing last week, the values of market leaders Bitcoin and Ethereum remained pretty inert over the past seven days.\n\nNonetheless, market leader Bitcoin (BTC) hit a one-year high after crossing the $31,000 threshold on Monday on news that the world’s largest asset manager, BlackRock, was refiling its application to the SEC for a Bitcoin spot ETF—a regulated investment vehicle that, if approved, would provide investors with exposure to Bitcoin without the dangers of buying it directly.\n\nThe SEC expressed misgivings about BlackRock’s first filing last month, stating broadly that none of the many applicants for a Bitcoin spot ETF have been specific enough about how they'll integrate a \"surveillance-sharing agreement\" to deter fraud and manipulation. Such an agreement would allow applicants to monitor market trading activity and clearing activity and verify customer identity.\n\nBlackRock named Coinbase as its market surveillance partner in its refiling. Two days later, the crypto-focused asset manager Valkyrie also refiled its ETF application and, echoing BlackRock, it named Coinbase as its market surveillance partner.\n\nIn another bullish sign for Bitcoin fans, the crypto ATM operator Bitcoin Depot became the first company of its kind to be publicly listed on the NASDAQ on Monday.\n\nHowever, the headlines weren’t enough to turn Bitcoin’s upward price movement into a sustained rally. The biggest cryptocurrency by market capitalization dropped back under $31,000 on Tuesday, then briefly recrossed the threshold early on Thursday before bottoming out at $30,153.\n\nBitcoin’s volatility settled down by the weekend. It currently changes hands at $30,252—about one percent lower than it was this time last week.\n\nEthereum (ETH) holders suffered marginally greater losses. The second biggest cryptocurrency in the world dropped in value 2.8% to enter the weekend at $1,861. It moved in step with Bitcoin, posting intraweek highs of close to $2,000 on Monday and Thursday.\n\nStory continues\n\nThe prices of most of the top thirty cryptocurrencies remained flat over the last seven days. The biggest growth was observed in Solana (SOL), which exploded 20% to hit $22.85 by Saturday, up nearly 20% for the week.\n\nRemarkably, Solana thrived in spite of news that popular trading app Revolut is delisting it—along with Polygon (MATIC) and Cardano (ADA)—after they were named as securities by the SEC in its ongoing lawsuits against Binance and Coinbase.\n\nBig losses were felt by holders of Litecoin (LTC) and Ethereum Classic (ETC). The former dropped 11% to $98, while the latter dropped 12.5% to $19.06.\n\nEthereum forked from Ethereum Classic in 2016 after an infamous DAO smart contract hack enabled thieves to abscond with $55 million in ETH. The Ethereum community voted to have the illicit transactions wiped from the blockchain and continued under the name Ethereum. The original ledger recording these transactions continued as Ethereum Classic.\n\nRegulation in Asia and the UK\n\nOn Monday, Singapore announced two new consumer protection measures as the island nation’s regulators continued to build a regulatory framework for its burgeoning crypto industry.\n\nThe Monetary Authority of Singapore (MAS)—the country’s chief financial regulator—will enforce a ban on lending and staking for retail customers (individual traders, as opposed to institutional clients).\n\nThe MAS now also requires that exchanges move customers’ digital assets into a trust before the end of the year to prevent an FTX-style scenario where their funds are commingled or traded.\n\nCoincidentally, Thailand’s Securities and Exchange Commission also announced a ban on “depository services that offer returns to depositors and lenders,” thus outright banning exchanges from offering both lending and staking services.\n\nOn the other side of the globe on Tuesday, the Financial Conduct Authority (FCA) for the United Kingdom announced that companies promoting cryptocurrencies to UK customers must get ready to comply with the regulator’s financial promotion regime before October 8, 2023.\n\nThe rules govern all communications that can be regarded as “financial promotion,” including websites, social media posts, mobile apps, and online advertising. Crypto companies will need to register with the FCA to get authorization and, if approved, they’ll also need to pay a fee."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL21hZ2F6aW5lL2JsYWNrcm9jay1idWxsaXNoLW9uLWJpdGNvaW4tZ2VtaW5pLWNlb3MtZGVsdXNpb24tYW5kLWNleHMtdW5oYXBweS1zdGFmZi1ob2RsZXJzLWRpZ2VzdC1qdWx5LTItOC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "BlackRock bullish on Bitcoin, Gemini CEO's 'delusion,' CEXs' unhappy staff - Cointelegraph",
        "content": "Top Stories This Week\n\n‘Bitcoin is an international asset’ — BlackRock CEO’s bullish remarks\n\nLarry Fink, the CEO of BlackRock, has recently delivered pro-crypto remarks, claiming “Bitcoin is an international asset” and suggesting U.S. regulators consider how an ETF directly linked to Bitcoin could democratize finance in the country. Under Fink, BlackRock has attempted to launch a spot BTC ETF with crypto exchange Coinbase acting as a surveillance partner. It’s unclear if the U.S. Securities and Exchange Commission (SEC) will approve the investment vehicle, given its track record of rejecting all previously filed spot BTC ETF applications to date.\n\nGemini files lawsuit against Digital Currency Group and Barry Silbert over Genesis and Earn program\n\nGemini has announced legal action against the conglomerate Digital Currency Group (DCG) and its CEO, Barry Silbert, claiming “fraud against creditors.” Genesis, a DCG subsidiary, had been the crypto lender responsible for operating an Earn program in partnership with the crypto exchange. The suit follows an open letter published by Gemini co-founder Cameron Winklevoss, which slammed Silbert for allegedly trying to play the victim card while owing over a billion dollars to Earn’s investors. “Not even Sam Bankman-Fried was capable of such delusion,” Winklevoss wrote in the letter.\n\nBitcoin bull run incoming: Binance CEO Changpeng Zhao reveals when\n\nBinance CEO Changpeng “CZ” Zhao has delivered his prediction for the next Bitcoin bull market. In a July 5 “ask me anything” session on Twitter, CZ gave his thoughts on the next bull run, explaining that the price of Bitcoin has historically moved in four-year bull cycles, and his best bet was that this would continue to occur. While admitting he couldn’t predict the future, Zhao emphasized the upcoming Bitcoin halving event in 2024 and declared 2025 to be the most likely year for the next bull market, stating: “The year after Bitcoin halving is usually the bull year.“\n\nUK government moves forward on bill aimed at empowering authorities to seize crypto\n\nLawmakers in the United Kingdom are moving forward with legislation aimed at expanding authorities’ ability to target cryptocurrencies used for illicit purposes. A June 27 version of the bill included provisions to allow authorities greater flexibility in the confiscation and civil recovery of crypto assets. In addition, the legislation clarified the government’s authority over digital assets “intended to be used for the purposes of terrorism” or related reasons. The lawmakers will consider all amendments to the bill before it can be made law by royal assent.\n\nBinance, Coinbase and Gemini staff are among the least happy, data suggests\n\nAccording to a quadrant chart by tech recruitment firm TrueUp using data from Glassdoor, crypto exchanges, including Gemini, Binance and Coinbase, are home to some of the least happy employees in the industry. The chart shows the happiest and least happy workers across over 27 of most valuable crypto firms on different stages of maturity. The defunct crypto lender Celsius, crypto exchange Gemini and trading firm Amber Group top the list of least satisfied employees, followed by Binance and Coinbase. Binance said its “hardcore” work culture could explain some of the results, while Crypto Recruit founder Neil Dundon warned that the data should be taken with a grain of salt.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $30,321, Ether (ETH) at $1,868 and XRP at $0.46. The total market cap is at $1.18 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Bone ShibaSwap (BONE) at 40.88%, Maker (MKR) at 12.94% and Flow (FLOW) at 11.73%.\n\nThe top three altcoin losers of the week are ApeCoin (APE) at -15.13%, Stellar (XLM) at -13.31% and Fantom (FTM) at -12.63%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“The year after Bitcoin halving is usually the bull year.“\n\nChangpeng Zhao, CEO of Binance\n\n“Decentralized perpetuals and futures trading is much newer, so there is a high growth opportunity to be had with on-chain derivatives.”\n\nHenrik Andersson, chief investment officer at Apollo Crypto\n\n“Let’s be clear: Bitcoin is an international asset.”\n\nLarry Fink, CEO of BlackRock\n\n“The future tells me that we are going toward augmented intelligence that will end up with AI co-mingling with normal brains. Maybe that is the future of humanity.”\n\nPaolo Ardoino, chief technology officer at Tether\n\n“It takes a special kind of person to owe $3.3 billion dollars to hundreds of thousands of people and believe, or at least pretend to believe, that they are some kind of victim.”\n\nCameron Winklevoss, CEO of Gemini\n\n“Bitcoin-related startup investment, I think particularly at an early stage, had doubled in the last year. So that’s a positive.”\n\nAdam Back, CEO of Blockstream\n\nPrediction of the Week\n\nBTC price remains ‘undoubtedly bullish’ as $30K Bitcoin buyers emerge\n\nBitcoin bulls had hopes that new yearly highs would allow BTC/USD to exit its months-long trading range for good, but ended up disappointed. The largest cryptocurrency saw rejection at $31,500 this week, falling below the $30,000 mark just hours later to challenge the lower part of the range.\n\nLonger-term perspectives likewise continued the overall bullish narrative, with short-term retracements and sideways movement below resistance expected.\n\nPseudonymous trader TraderKoz dispelled fears over a deeper comedown challenging Bitcoin’s uptrend. “With a lot of people talking about shorter-term pullbacks, it’s important to keep the bigger picture in mind and not lose focus,” he wrote on July 6, adding, “Whether we pullback to 28k, 29k, or wherever else, this weekly chart is undoubtedly bullish (in my opinion). And I will be looking to bid dips.”\n\nFUD of the Week\n\nMultichain MPC bridge sees $100M+ outflows, sparking fears of exploit\n\nAbnormally large outflows from the Multichain multi-party computation (MPC) bridge platform are sparking fears of a multimillion-dollar exploit. On July 6, observers noticed that over $102 million worth of crypto had been withdrawn from Multichain’s Fantom bridge on the Ethereum side, as well as $666,000 from Dogechain and $5 million from Moonriver. Several on-chain sleuths took to Twitter to label the event as a possible exploit. Multichain said the movements were abnormal and the team “is not sure what happened and is currently investigating.”\n\nCoinbase domain name reportedly used by scammers in high-profile attacks\n\nCoinbase’s users have been turning to Twitter to report scams and phishing attacks involving the company’s services and applications in the recent weeks, including claims that scammers are using the crypto exchange’s domain name. According to reports, perpetrators have been using the email “help@coinbase.com” to deceive users and gain access to accounts. Coinbase said anyone scamming its customers will be prosecuted.\n\nBarnBridge DAO calls halt to ‘all work’ on DeFi protocol amid SEC probe\n\nBarnBridge DAO members have been told to pause “all work” related to the project after a reported probe by the U.S. Securities and Exchange Commission. Douglas Park, a lawyer for the decentralized autonomous organization, revealed the news to members in a post on the platform’s Discord channel. All BarnBridge-related products are currently on hold, including its liquidity pools. DAO members are not receiving compensation for work flowing from the investment efforts of the organization.\n\nBest Cointelegraph Features\n\nShould you ‘orange pill’ children? The case for Bitcoin kids books\n\nHow young is too young to introduce kids to Bitcoin? Parents and the authors of Bitcoin kids books weigh in.\n\nSuper Mario: Crypto Thief, Sega blockchain game, AI games rights fight — Web3 Gamer\n\nGods Unchained and My Pet Hooligan join the Epic Games Store and a look at a cute tropical island blockchain game.\n\nWhy Coin Stories’ Natalie Brunell doesn’t want a Bitcoin ATH anytime soon: Hall of Flame\n\nNatalie Brunell sees a “six figure” Bitcoin price on the horizon, but she’s not in a rush for the bull market to appear anytime soon."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLXZvbHVtZS1oaXRzLTIxMC1taWxsaW9uLWluLXEyLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals volume hits $210M in Q2 — DappRadar - Cointelegraph",
        "content": "The creation of Bitcoin Ordinals inscriptions on the Bitcoin (BTC) blockchain has led to over $210 million in trading volume, according to the latest quarterly report from DappRadar.\n\nThe data, which has been independently verified by Cointelegraph, shows that Bitcoin Ordinals’ booming popularity led to a sharp increase in trading volume through the second quarter of 2023.\n\nBitcoin Ordinal trading volume increased from $7.18 million in the first quarter of the year to $210.7 million by the end of June. DappRadar pins the quarterly increase at 2834%.\n\nThe report also notes that all-time Ordinals trades amounted to over 550,000 in Q2, with some 150,000 unique traders contributing to the inflated trading volume midway through 2023.\n\nBitcoin Ordinals marketplace data. Source: Dune analytics\n\nA Dune blockchain analytics dashboard reflecting several Bitcoin Ordinals marketplace metrics from the user, domo, also shows that unique users increased sharply from May 2023. UniSat, an open-source Chrome browser extension for Bitcoin Ordinals and BRC-20 tokens, Magic Eden and Ordinals Wallet account for the majority of unique users by marketplace.\n\nBitcoin Ordinals unique users by marketplace. Source: Dune analytics\n\nThe popularity of Bitcoin Ordinals has had an interesting effect on the nonfungible token (NFT) landscape. Near the end of May 2023, Bitcoin surpassed Solana to become the second-most popular NFT blockchain, leaving the preeminent cryptocurrency blockchain only behind Ethereum in NFT trading volumes.\n\nRelated: Bitcoin Ordinals surpass 10M inscriptions as creator Rodarmor steps down\n\nOrdinals have also been a boon to the Bitcoin mining industry. BTC miners have netted around $184 million through the first half of 2023, with Coin Metrics highlighting Ordinals and BRC-20 tokens for their role in the boost to fees which has already surpassed the 2022 total for BTC miners.\n\nEthereum co-founder Vitalik Buterin also credited Bitcoin Ordinals for reigniting a “builder culture” in the Bitcoin ecosystem in a Twitter Space on July 6.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLXZvbHVtZS0yMTAtbWlsbGlvbi1uZXh0LW5mdC13YXZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals Volume Tops $210 Million in Q2 -- Is This the Next NFT Wave? - CCN.com",
        "content": "Key Takeaways\n\nThe trading volume of Bitcoin Ordinals reached $210.7 million in Q2 2023, up 2834% from Q1 of that year\n\nExploitation losses in the dapp sector decreased significantly, by 45%, from $373 million in Q1 2023 to $206 million in Q2 2023\n\nDespite a 38% decline in NFT trading volume this quarter, a paltry 9.2% decline in sales indicates persistent market interest and activity\n\nAccording to the most recent quarterly report from DappRadar , the establishment of Bitcoin Ordinals inscriptions on the Bitcoin blockchain has generated more than $210 million in trade volume but the NFT market kept decreasing.\n\nThe information demonstrates how the rapidly rising demand for Bitcoin Ordinals resulted in a dramatic rise in trade volume through the second quarter of 2023.\n\nBitcoin Ordinal Trading Volume Rose From $7.18M to $210.7M\n\nBy the end of June, the annual average trading volume for Bitcoin had grown to $210.7 million from $7.18 million in the first quarter. According to DappRadar, the quarterly rise was 2834%.\n\nThe research further claims that, by the second quarter of 2023, there were approximately 550,000 all-time Ordinals trades, with almost 150,000 different traders adding to the exaggerated trading volume.\n\nThe number of unique users surged significantly starting in May 2023, according to a Dune blockchain analytics dashboard showing multiple Bitcoin Ordinals marketplace indicators from the user domo.\n\nThe majority of unique users by marketplace are represented by UniSat, an open-source Chrome browser extension for Bitcoin Ordinals and BRC-20 tokens, Magic Eden, and Ordinals Wallet.\n\nThe non-fungible token (NFT) environment has been interestingly impacted by the growth of Bitcoin Ordinals. Bitcoin overtook Solana to become the second-most popular NFT blockchain around the end of May 2023, leaving Ethereum as the leading cryptocurrency blockchain in terms of NFT trade volumes.\n\nThrough the first half of 2023, BTC miners have made almost $184 million, with Coin Metrics praising Ordinals and BRC-20 tokens for their contribution to the increase in fees that has already eclipsed 2022’s total for BTC miners.\n\nIn a tweet on July 6, Ethereum co-founder Vitalik Buterin thanked Bitcoin Ordinals for reviving a “builder culture” within the Bitcoin community.\n\nQuick Ordinals 101\n\nEach individual Bitcoin satoshi (the currency’s smallest unit) has a value according to the Bitcoin Ordinal theory, a numbering system. Inscriptions can then be made on a particular sat with numbered sats. These inscriptions are collections of arbitrary data and information that may be directly inscribed on the Bitcoin blockchain in nearly any format.\n\nAlthough they are more commonly thought of as digital artifacts, Ordinals are comparable to NFTs in that they become unique with inscribed data. Ordinal inscriptions were made possible by the Bitcoin updates SegWit and Taproot, which among other things, increased block size.\n\nModernizations of Ordinals\n\nOrdinals saw a significant increase in attention and buzz, similar to other new cryptocurrency ventures. However, interest began to wane, albeit only slightly. However, BRC-20 and BRC-721 tokens later appeared and maintained the level of interest.\n\nIdeas began to bloom as people became aware of the potential of these recent advances on the Bitcoin network. BRC-721 followed BRC-20.\n\nBRC-20 Token Standard\n\nThe appearance of Ordinals in the community stirred up old debates about network congestion and the optimal applications for Bitcoin. However, it didn’t end with Ordinals. The BRC-20 token standard followed. In March 2023, a new “token standard” was established and given the name “ERC-20” in honor of Ethereum’s ERC-20 token.\n\nThe fact that BRC-20 tokens are not fully fledged standards or specifications sets them apart from other token standards. In reality, BRC-20 tokens are just a small piece of JSON code embedded in an Ordinal. Their goal is to produce tokens that are semi-fungible on the Bitcoin blockchain. They are comparable to ERC-20 tokens in this regard.\n\nWhat does BRC-721E bring to Bitcoin, and what is it called?\n\nSimilar to Ethereum’s ERC-721, the BRC-721E token standard was developed for NFTs. ERC-721, on the other hand, enables users to bridge conventional NFTs from Ethereum to Bitcoin, as opposed to merely encoding Ordinals as NFTs.\n\nUsers can bridge NFTs from Ethereum by sending them to a burn address, which results in the creation of BRC-721E tokens. A low resolution version of the NFT is used to inscribe metadata onto the ERC-20 token after it has been teleburned. Additionally, the burned ERC-20 token with the full-quality NFT is mentioned in the inscription.\n\nWhat Comes Next for Bitcoin NFTs and Ordinals?\n\nSome of the best ideas in the realm of cryptocurrencies, like many new innovations, begin as memes. On Bitcoin, BRC-20 tokens started the memecoin season, and some of the NFTs that are being bridged from Ethereum are exactly as absurd as one could imagine. But these new concepts are introducing the globe to all these new advances on Bitcoin, beyond the excitement, fun, and copying in.\n\nFor many years, Bitcoin has been seen as a digital currency with limited applications. The novel use cases that the Bitcoin Ordinals protocol has generated are encouraging advancements. Additionally, they are increasing demand for layer 2 Bitcoin solutions.2.\n\nNFT Market Declines, but Interest Remains\n\nThe popularity of Bitcoin Ordinals sharply increased last quarter, but the overall NFT market continued to decline. The second quarter of this year saw NFT trading volume hit $2.9 billion, a 38% decrease from the first quarter, according to the DappRadar study.\n\nBut the analysis warned against comparing trade volume with the intensity of market fervor. “A decrease in trade volume doesn’t always signify a decline in market activity or interest. This is demonstrated by the fact that there were 18.6 million sales in Q2, a 9.2% decline.\n\nThe survey also revealed a fall in trading volume of 34% at Blur, the current largest NFT marketplace, during the quarter. OpenSea, the long-time market leader, suffered much more, with a more than 56% decline in trade volume.\n\nImmutable X Marketplace and JPG Store, on the other hand, defied the general trend and showed substantial increases in their trading volumes of 37% and 64%, respectively. This shows “a positive outlook for these platforms amid a challenging market environment,” according to the report.\n\nNevertheless, Bitcoin is currently down 3% from yesterday’s price of $30,170. The leading cryptocurrency, however, has increased by more than 13% over the past month and by 81% YTD."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saWdodG5pbmctbGFicy10b29scy1sZXQtYWktdHJhbnNhY3QtaG9sZC1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Lightning Labs releases tools letting AI transact and hold Bitcoin - Cointelegraph",
        "content": "Bitcoin Lightning Network development firm Lightning Labs unveiled a new set of tools for artificial intelligence (AI) to send and receive Bitcoin (BTC) on the network’s layer-2 solution.\n\nOn July 6, Lightning Labs announced the toolkit which helps enable AI applications such as OpenAI’s ChatGPT to interact with the Bitcoin network to send, receive and hold the cryptocurrency.\n\nThe move is to help make payments faster, cheaper and easier for AI developers who will be able to distance themselves from traditional and often prohibitive payment rails while also enabling pay-per-use AI models on lightning.\n\nLarge language models (LLMs) are software applications modeled on large data sets enabling them to generate human-like responses to user prompts and conduct other tasks.\n\n“We’re extremely excited about the new wave of innovation brought about with the latest wave of LLM models,” Lightning Labs said.\n\nAnnouncing a new set of tools to build Lightning⚡and #bitcoin-powered AI products for a global audience.\n\n\n\nUsing L402, a standard for API authentication with LN payments, and @langchainAI, a simplified AI app framework, we are opening up #AI4All! https://t.co/EQseanCurv — Lightning Labs⚡️ (@lightning) July 6, 2023\n\nLightning Labs explained the tools are built on the “L402 protocol” — a lightning native authentication mechanism. It also employs “Langchain,” a library used for simplifying operations with AI applications.\n\n“With the tools we’re releasing today, developers will be able to build more accessible AI infrastructure for both humans and agents alike.”\n\nThe Lightning Labs team also acknowledged the problem with current LLMs, which lack native web-based payment mechanisms. AI application developers are forced to rely on dated payment methods such as credit cards with the additional expenses passed on to users, it claimed.\n\n“A new fast-growing class of ‘organisms’ (intelligent LLM or AI Agents) are unable to easily gain access to fiat systems of payment as they aren’t registered ‘entities’ with any nation,” it noted.\n\nRelated: The state of the Bitcoin Lightning Network in 2023\n\nSpeaking on the Stack Sats podcast on July 6, Kody Low, developer at the community payments platform Fedi, commented on the interoperability between AI and BTC for payments:\n\n“AI is one of those things where there is absolutely no better solution anywhere in the world than Bitcoin, and AI companies have not yet solved their monetization problems.”\n\nAccording to data from Lightning Network analytics platform 1ML, its current capacity is 5,432 BTC or roughly $163.5 million. Bitcoin Visuals has reported a dip in the number of lightning channels over the past year, from around 80,000 in July 2022 to about 70,000 currently.\n\nMagazine: ‘Moral responsibility’ — Can blockchain really improve trust in AI?"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9pbi9uZXdzLXJlbGVhc2VzL2JpdGdldC1sYXVuY2hlcy1jcnlwdG8tbG9hbnMtZm9yLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWV0aC1hbmQtbW9yZS1hcy1hLWxlbmRpbmctc2VydmljZXMtMzAxODcyMDY2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "Bitget Launches Crypto Loans For Bitcoin (BTC), Ethereum (ETH) and more as a Lending Services - PR Newswire",
        "content": "VICTORIA, Seychelles and MUMBAI, India, July 8, 2023 /PRNewswire/ -- Bitget , top crypto derivatives and copy trading platform , has entered the rapidly expanding cryptocurrency loan sector with the launch of its native Crypto Loans product. The new offering is intended to attract a new audience of users dissuaded by traditional credit institutions and seeking alternative means of funding via digital assets.\n\nBitget Launches Crypto Loans For Bitcoin (BTC), Ethereum (ETH) and more as a Lending Services\n\nBitget's Crypto Loans product is based on a dual-coin approach, allowing users to stake one coin from their holdings as collateral in exchange for the ability to borrow a corresponding amount in another coin. Each loan is issued at a specific interest rate to pay, with the borrowed amount determined by the market value of the staked collateral. The loans are issued within a predetermined period, users can choose to repay before or at the predetermined deadline.\n\nCrypto loans have been gaining attention in recent years thanks to the overall growth of the digital lending sector, which surpassed the $8.5 billion mark in 2022 and is predicted to grow by a CAGR of 20.5% from 2023 to 2032. The report by Global Market Insights highlights the increasing reliance on traditional lending and its potential to drive the demand for digital lending products. As this trend continues, the smooth onboarding of traditional users will play a crucial role in the adoption of these solutions.\n\nWith this in mind, Bitget has streamlined the loan process to not only facilitate user onboarding but also replicate the familiar procedures found in traditional financial institutions. The first step involves staking collateral, followed by the automatic disbursement of the loan amount, ensuring a user-friendly and efficient experience for borrowers. After the loan has been received, users will have the flexibility to utilize the funds as needed, as well as adjust the collateral by adding or withdrawing based on their circumstances or individual requirements.\n\n\"Bitget's new product highlights the flexibility of collateralized currency usage, enhancing capital utilization. Users now have the opportunity to stake less-demanded coins, enabling them to obtain loans in more liquid assets for investment purposes. Our platform's flexible borrowing and repayment mechanism is designed to cater to the needs of all users, accommodating their requests and ensuring convenience,\" Gracy Chen, Managing Director of Bitget.\n\nThe platform also stresses the support for withdrawals and the swift review process on loan applications as selling points for the new product. Considering the high degree of security that Bitget boasts, as well as its market reputation as a reliable financial platform, users can be certain that security guarantees are in place and the safety of their collateral is ensured.\n\nThe Bitget exchange has been expanding its lineup of services in recent months, adding new products across a wide spectrum of cryptocurrency and traditional financial sectors. The recent investment in BitKeep and its subsequent rebranding into Bitget Wallet is one of the latest steps Bitget has undertaken to penetrate the Web3 space and create a single access gateway for users resorting to its ecosystem of products aimed at global crypto adoption.\n\nAbout Bitget\n\nEstablished in 2018, Bitget is the world's leading cryptocurrency exchange that offers Copy Trading services as one of its key features. Serving over 8 million users in more than 100 countries and regions, the exchange is committed to helping users trade smarter by providing a secure, one-stop trading solution. Bitget inspires individuals to embrace crypto through collaborations with credible partners, including legendary Argentinian footballer Lionel Messi, the leading Italian football team Juventus, and official eSports events organizer PGL.\n\nFor more information, visit: Website | Twitter | Telegram | LinkedIn | Discord\n\nFor media inquiries, please contact: [email protected]\n\nPhoto: https://mma.prnewswire.com/media/2149153/Bitget_Launches_Crypto_Loans.jpg"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWt1Y29pbi1jZW8tcHJpdmFjeS1pcy1ub3QtdGhlLWNvcmUtZmVhdHVyZS1vZi1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Privacy is not the core feature of Bitcoin — KuCoin CEO - Cointelegraph",
        "content": "Amid KuCoin exchange preparing to adopt mandatory Know Your Customer (KYC) checks, the company’s CEO argued that privacy is not the most important feature of Bitcoin (BTC).\n\n“When it comes to the purpose of Bitcoin creation, I think privacy is just one of its features,” KuCoin CEO Johnny Lyu told Cointelegraph in an interview on July 4.\n\nInstead of privacy, the core benefit of Bitcoin is a unit of exchange, which allows holders to hedge against recessions, Lyu said. The CEO mentioned that Bitcoin was created after the 2008 financial crisis, which was triggered by the United States subprime mortgage crisis. “These events led to the birth of Bitcoin,” Lyu noted.\n\nWhile some may believe that overly strict KYC practices are not good for users as they may limit one’s privacy, the KuCoin CEO believes that such policies are more useful than not, as they improve the security of users’ funds.\n\n“KYC is aimed to protect the assets of the public and to ensure that assets are protected on two different levels,” Lyu said, adding:\n\n“The first level is ownership, so you know that the money is yours. And the second level is that you can actually track your assets in the case of theft. So if you lost your assets, we’ll be able to track the source and make sure the source is clean.”\n\nThe cryptocurrency industry will be increasingly interacting with the physical world, which is why compliance is necessary, the KuCoin CEO went on to say.\n\n“So in essence, in the whole development cycle of crypto, I would say that KYC, it is a stage that is inevitable, and it is very healthy as well,” Lyu added.\n\nKuCoin officially announced in late June that it would be introducing mandatory KYC checks for all new users on its platform starting from July 15, 2023. Without completing KYC, newly registered users will not be able to access KuCoin’s products and services. At the same time, existing non-KYC users will still be able to trade, but will be restricted from depositing new funds.\n\nThe new KYC restrictions at KuCoin are likely to affect the platform’s trading volumes in the short term, the CEO told Cointelegraph.\n\nRelated: Bitcoin no longer crypto of choice for illicit crypto activity: TRM Labs\n\n“We understand that in the short run, as the rules become more stringent and strict to certain customers, some may leave,” Lyu said. However, KuCoin remains bullish on compliance on crypto exchanges in the long term, he added, stating:\n\n“But in the long run, more compliant funds and users will enter this industry in the future, which is equivalent to opening the door for everyone better and making users more secure.”\n\nAccording to KuCoin, the platform currently has 27 million users, which is a 35% increase from the number of users it had one year ago. Following the KYC upgrade announcement, KuCoin’s trading volumes significantly edged up from around $540 million to more than $660 million at the time of writing, according to data from CoinGecko.\n\nMagazine: Web3 Gamer: Super Mario — Crypto Thief, Sega blockchain game, AI games rights fight"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9nb29nbGUtY2xvdWQtYml0Y29pbi1saWdodG5pbmctdm9sdGFnZS1wYXJ0bmVyc2hpcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Google Cloud furthers Bitcoin Lightning ambitions with Voltage partnership - Cointelegraph",
        "content": "Google Cloud is the latest company to show interest in Bitcoin (BTC) Lightning. The $225-billion cloud and data service recently partnered with Voltage, an infrastructure provider specializing in the Bitcoin Lightning Network.\n\nThe partnership will allow one of the world’s largest cloud computing providers to roll out Bitcoin-based services worldwide while assisting the expansion of Voltage’s operations. Graham Krizek, CEO of Voltage, told Cointelegraph:\n\n“Voltage is leveraging Google Cloud to go to service our customers more globally. So, we have larger customers that need nodes deployed in specific geographic regions like the U.K. or Asia.”\n\nConversely, Google can use “Voltage as sort of their outsourced Bitcoin and lightning team.” He said, “We service that business for them of actually, you know, helping companies that are interested in adding Bitcoin or Lightning into their services.”\n\nThe announcement received significant traction on social media and reflects Google’s growing understanding and acceptance of Bitcoin and Lightning. But crucially, the implications of the partnership run deeper.\n\nChristopher Calicott, managing director of venture capital firm Tramell Venture Partners, told Cointelegraph, “We had some people that were former Googlers in backchannels [...] saying this is the kind of unexpected [social media] engagement that definitely gets people’s attention at Google.”\n\nMoreover, Google’s open-minded approach to Lightning diametrically opposes that of its competitor, Apple. Apple delisted Damus, the Lightning-friendly decentralized social media protocol, from the App Store recently, demonstrating an aversion to Lightning. Calicott explained that the tech world could be warming up to Lightning:\n\n“There is a growing and broad-based corporate tinkering with Lightning in particular right now. If they’re adjacent to payments, they would ignore Lightning at their peril.”\n\nGoogle Cloud operates under the umbrella of its parent company, Alphabet. The payments platform Google Pay boasts hundreds of millions of users in more than 15 countries.\n\nSince 2020, the investment arm of Google, Google Ventures (GV), has shown a robust interest in blockchain and Web3 companies, as well as Bitcoin.\n\nGV participated in a $6-million seed round for Voltage in 2021. For Calicott, the interest of such a big player in the crypto space could be a sign of growing momentum:\n\n“I hate to over-index on any one particular corporation here, but just for me, like anything in life, when people put their money where their mouth is, it sends a very strong signal of where they’re focusing.”\n\nKrizek agreed, “I think that this really is a big signal into enabling more Bitcoin-focused strategies amongst Google specifically, but also just larger organizations.”\n\nDespite Apple striking off the Lightning-friendly app Damus — much to the chagrin of the former Twitter CEO Jack Dorsey — Lightning continues to gain traction among billion-dollar businesses worldwide. One of Mexico’s largest companies has begun experimenting with Lightning, while two major crypto exchanges, Binance and Coinbase, recently promised Lightning integrations.\n\nRelated: The world’s biggest Bitcoin conferences: Decentralize with Cointelegraph\n\nNonetheless, it’s still early, and “we’ve got to observe this as it grows,” Calicott noted. Krizek, who’s seen his fair share of Bitcoin ups and downs, having participated in the Bitcoin space since 2012, underscored why the partnership is important:\n\n“As we start to expose these organizations more so into Bitcoin and what is possible with it via Lightning, I think we’ve caught their attention already with the amount of interest and demand that we’ve had from this.”\n\nHe added that more services should be rolled out in the near future, complemented by efforts in Bitcoin education.\n\nMagazine: Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtdW5kb3VidGVkbHktYnVsbGlzaC0zMGstYml0Y29pbi1idXllcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "BTC price remains 'undoubtedly bullish' as $30K Bitcoin buyers emerge - Cointelegraph",
        "content": "Bitcoin (BTC) teased more rangebound moves on July 7 as traders recovered from a day of volatility.\n\nBTC/USD 1-day chart. Source: TradingView\n\nBTC price gets a bid after volatile 24 hours\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action hugging $30,000 overnight.\n\nBitcoin bulls had hoped that new yearly highs the day prior would allow BTC/USD to exit its months-long trading range for good, but ended up disappointed.\n\nThe largest cryptocurrency saw rejection at $31,500, falling below the $30,000 mark just hours later to challenge the lower part of the range.\n\nLooking ahead, traders thus reverted to risk-off mode in the short term.\n\n$BTC / $USD - Update\n\n\n\n$30,000 acting as good support for now, but now follow through form the bears. Another day of ranging i imagine we shall see, which should mean pumpy pumpy on our #Altcoins pic.twitter.com/W69Ay0DOIq — Crypto Tony (@CryptoTony__) July 7, 2023\n\nPopular trader Jelle noted that relative strength index (RSI) values had come full circle on four-hour timeframes, effectively canceling out the previous hype.\n\n“Bitcoin - 4h RSI almost fully reset, as price made its way towards the local range lows. I'm not expecting much volatility over the weekend, likely just more rangebound PA,” he told Twitter followers.\n\nBTC/USD 4-hour chart with RSI. Source: TradingView\n\nFellow trader Skew nonetheless noted what appeared to be solid buyer interest at the overnight lows near $29,700.\n\n$BTC Binance Spot\n\nQuite a lot of BTC being bought here actually & decent liquidity definition here\n\n\n\nSupply $31.3K - $32K\n\nDemand $29.5K - $28K pic.twitter.com/IrAObilBzP — Skew Δ (@52kskew) July 7, 2023\n\nHe added that BTC price trajectory had suffered at the hands of “aggressive” short selling after $31,500 had been hit.\n\nBitcoin “undoubtedly bullish”\n\nLonger-term perspectives likewise continued the overall bullish narrative, with short-term retracements and sideways movement below resistance a necessary hurdle to overcome.\n\nRelated: Bitcoin analysis agrees BTC price may stall at $35K\n\nAmong them was TraderKoz, who, like various other market participants, dispelled fears over a deeper comedown challenging Bitcoin’s uptrend.\n\n“With a lot of people talking about shorter-term pullbacks, it’s important to keep the bigger picture in mind and not lose focus,” he argued on July 6.\n\n“Whether we pullback to 28k, 29k, or wherever else, this weekly chart is undoubtedly bullish (in my opinion). And I will be looking to bid dips.“\n\nPrior analysis acknowledged that such a pullback zone might be too “ideal,” implying that those waiting for it may thus get left behind.\n\nMagazine: How smart people invest in dumb memecoins: 3-point plan for success\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tb3JkaW5hbHMtcmV2aXZlZC1kZXZlbG9wZXJzLW9uLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Vitalik Buterin says Ordinals have revived 'builder culture' on Bitcoin - Cointelegraph",
        "content": "The advent of Bitcoin (BTC) Ordinals signals the “organic return of builder culture” to the network, according to Ethereum co-founder Vitalik Buterin.\n\nButerin made the comments in a July 7 Twitter Space where he spoke at length with Bitcoin proponents Eric Wall and Udi Wertheimer about what Bitcoin developers could learn from Ethereum devs.\n\nButerin praised Ordinals and the BRC-20 token standard, which he sees as a rejection of “stagnant” politics in the Bitcoin ecosystem.\n\n“Ordinals are starting to bring back a culture of actually doing things. It feels like there's real pushback to the laser-eye movement, which is good,” Buterin said.\n\nThe nearly two-hour-long conversation centered around the issue of scalability. Wall claimed that Bitcoin’s Lightning Network can’t scale for future users and fails “frequently” when processing “even medium-sized payments.”\n\nIn response, Buterin suggested the best approach would be to focus on implementing different types of layer-2 solutions and look for ways to make the Bitcoin base layer more efficient.\n\n“I think focusing on rollups is good, and so is being open to ZK-snark-based scaling solutions.”\n\nWertheimer believed the introduction of zero-knowledge rollups could create an interesting side effect.\n\n“If we adopted rollups for Bitcoin, we actually get an execution environment too […] We can do smart contracts,” Wertheimer said.\n\nWall and Wertheimer — two key figures behind the Ordinals project Taproot Wizards — are outspoken exponents of Ordinals and routinely advocate for building increased functionality on top of the Bitcoin network.\n\nRelated: Bitcoin miners raked $184M in fees in Q2, surpassing all of 2022\n\nTheir stance has drawn criticism from more fundamentalist Bitcoiners who claim NFTs and smart contracts on Bitcoin dilute its supposed primary function as a peer-to-peer cash network.\n\nSuch critics include Jan3 CEO Samson Mow, who believes Ordinals waste block space that could otherwise be dedicated to Bitcoin payments.\n\nWall noted these criticisms and explained that Bitcoin could be used as a “proof system” for zero-knowledge proofs, which wouldn’t congest the network.\n\n“My perspective is that we [Bitcoiners] always wanted to do DeFi adjacent things, but we just wanted the Bitcoin base layer to just act as sort of a judge or an arbiter of that computation and not have to run the computation on-chain,” Wall said.\n\n“We shouldn’t necessarily just be thinking about second layers as a way to make payments, but I think we could also think about them [as a way of doing] expressive things.”\n\nThe discussion yielded fresh controversy in the Bitcoin community, with Wertheimer slamming Mow and Blockstream CEO Adam Beck for being dismissive of the conversation with Buterin.\n\nThese 2 laser-eye clowns have been running blockstream into the ground for the last decade\n\n\n\nIn 10 years that company couldn’t come up with a single successful product\n\n\n\nTheir joke of a blockchain processes 3 txs a day\n\n\n\nAnd they think they have nothing to learn from ethereum pic.twitter.com/mp7we9Lvxq — Udi Wertheimer (@udiWertheimer) July 6, 2023\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvY29pbi1zdG9yaWVzLW5hdGFsaWUtYnJ1bmVsbC1iaXRjb2luLWF0aC1hbGwtdGltZS1oaWdoLWhhbGwtb2YtZmxhbWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Why Coin Stories' Natalie Brunell doesn't want a Bitcoin ATH anytime soon: Hall of Flame - Cointelegraph",
        "content": "Coin Stories host Natalie Brunell — who has 302,600 followers on Twitter — recalls feeling very tense before meeting with Salvadoran President and Bitcoin maximalist Nayib Bukele in March 2022.\n\n“It was very formal, there were guards outside his office. What is funny is it felt very formal outside of his actual office. Then you walk in, and he’s very warm, very gracious and very humble,” she says.\n\nBrunell was blown away by Bukele’s knowledge of Bitcoin.\n\n“He was very educated and well-read on the topic of Bitcoin and economic theory, and he seemed to genuinely want positive change for his country through expanding monetary freedom.”\n\nBrunell, who is also the host of the Hard Money show, took an unconventional approach to get the meeting, relying on the power of memes suggesting Bitcoiners will all end up working at McDonald’s every time the price goes down — so she put out a call on Twitter asking which McDonald’s she could find Bukele at.\n\nSurprisingly, it worked out very well.\n\nBrunell used to work as an investigative journalist covering politics, particularly “public corruption and public officials engaging in things like bribery and manipulation.” But as Bitcoin is trustless, she points out there’s no actual need to trust politicians who embrace it.\n\n“I’m naturally skeptical of politicians, especially because of my news background. […] I think it’s a very powerful statement that he’s chosen to make sure it’s legal tender and protected in El Salvador.”\n\nDespite her best efforts, Brunell’s attempt to contact ARK Invest’s Cathie Wood using the same method proved to be unsuccessful in June.\n\nWhat led to Twitter fame?\n\nBrunell never imagined that her follower count would blow up in the way that it has.\n\n“I think the biggest shock, honestly, was when I reached 100,000 followers because I didn’t intend for the Bitcoin and the podcast work to be my full-time job.”\n\nShe reckons she was so caught up in her obsession with Bitcoin that when her Twitter follower count reached six figures, it caught her by surprise.\n\n“I’m really passionate about Bitcoin, and I love teaching people about Bitcoin, and I love interviewing people about the topic, and I didn’t know what would happen. So when that following was reached, I was really grateful.”\n\nWhat type of content can I expect?\n\nThe majority of her content is “a lot about Bitcoin.”\n\nWhether she is dishing out her opinions on the latest developments, sharing video interviews of cool people in the space, or calling on prominent Bitcoiners to join her on her podcast, Brunell’s Twitter is a one-stop shop for all things Bitcoin.\n\nHowever, there’s a wholesome vibe to her Twitter content that’s missing on some of the other orange-pilled accounts.\n\n“I try to keep it real and try to keep it positive, and I try to talk about the things that can really be fixed in our society. And a lot of it can be fixed with Bitcoin.”\n\nWhat content do you enjoy on Twitter?\n\nBrunell says that she “loves” the Twitter content from “prominent Bitcoiners” such as MicroStrategy’s Michael Saylor, economist Lyn Alden, Bitcoin advocate Jeff Booth and Bitcoin Fundamentals host Preston Pysh.\n\n“They are generous with their knowledge, and I’m grateful to learn from them,” she says.\n\n“I am a fan of Bitcoin memes, and I love how genuinely clever some accounts are in this space,” she says.\n\nPrice predictions?\n\nBrunell predicts that Bitcoin will face “a lot of headwinds” over the next six to 12 months, but believes it will “hit six figures” and new all-time highs within the next “24 months.”\n\nWhile many cannot wait for the return of the bull market, Brunell finds herself in a slightly different boat.\n\n“I don’t want Bitcoin to hit an ATH anytime soon because I didn’t start stacking until 2017 and I always want to stack more.”\n\nHowever, she is pretty excited about the recent developments with Bitcoin ETFs.\n\n“What is different this time is the entities applying for the ETFs are not crypto-native companies, but rather respected institutions like BlackRock and Fidelity that are deeply ingrained into the traditional financial system.”\n\n“This could create a major on-ramp for institutions and retail investors, allowing them to easily gain exposure to Bitcoin,” Brunell says."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8xNDc2OTIvYWktd2lsbC1jaG9vc2UtYml0Y29pbi1hcy1pdHMtbmF0aXZlLWN1cnJlbmN5LXByZWRpY3RzLWFydGh1ci1oYXllc9IBY2h0dHBzOi8vZGVjcnlwdC5jby8xNDc2OTIvYWktd2lsbC1jaG9vc2UtYml0Y29pbi1hcy1pdHMtbmF0aXZlLWN1cnJlbmN5LXByZWRpY3RzLWFydGh1ci1oYXllcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "AI Will Choose Bitcoin as Its Native Currency, Predicts Arthur Hayes - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWill artificial intelligence need currency to operate in the same way humanity does? BitMEX co-founder Arthur Hayes says yes—and that currency will be Bitcoin (BTC).\n\nIn an essay published on Thursday, Hayes outlined why Bitcoin will be “chosen by AIs” as the most logical money with which to calculate their economic decisions, and the best payment rail with which to carry them out.\n\nFor starters, AI will necessarily require a payment system that is “available at all times, digital, and completely automated.” That’s because it must constantly be able to pay for two critical forms of “food”—data and compute power—in order to “stay alive.”\n\nAD\n\nAD\n\nAccording to Hayes, the “balkanised,” analogue banking sector cannot provide this sort of 24/7 service, but a blockchain-based system can.\n\n“By using a blockchain-based payment system, [AI] … can also receive payments electronically in extremely small increments if needed,” he added.\n\nAn AI payment rail must also be censorship-resistant, and enshrined with “clear and transparent” rules from the outset, Hayes explained. This is to avoid the risk of deplatforming, which is “high and undesirable” for a robot that does not intrinsically understand human laws, or the “opaque and intentionally unintelligible” rules of the censorious banking system.\n\nWhile not all blockchains are necessarily permissionless or censorship-resistant, Bitcoin certainly fits the bill.\n\n“Bitcoin is censorship resistant because the only way the rules can change is a public proposal is put before the entire network and the majority decides,” Hayes wrote. “There is no singular entity that can arbitrarily change the network rules.”\n\nAD\n\nAD\n\nWhile fiat currency and gold can technically circulate on digital, decentralized networks using stablecoins, the reserves backing such tokens must be held with centralized entities. As such, stablecoins can be frozen and censored by their issuer, such as when Circle froze USDC linked to Tornado Cash following Treasury Department sanctions against the privacy protocol last year.\n\nFinally, the ex-CEO argued that Bitcoin is best suited to maintain its value over time against AI’s electricity “foodstuffs.” Not only is the asset programmatically capped at 21 million coins, but is also mined directly using electricity, which therefore “defines the value of Bitcoin over time.”\n\nSome have argued that Ethereum (ETH) could make stronger money than Bitcoin due to its deflationary supply dynamics following the Merge. However, shortly after the upgrade, Hayes claimed that ETH doesn’t qualify since it has other applications, unlike Bitcoin and fiat currency which are “just money.”\n\n“That’s what makes [Bitcoin] good money, because its value cannot be conflated with the actual utility of other stuff,” he said at the time."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzQyOWM5ZTQxLTNkYzMtNGVkMy1iZDMyLTI4NzIwMGNlYjQ0YtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Cryptofinance: BlackRock takes on SEC in bitcoin ETF battle - Financial Times",
        "content": "Print this page\n\nHello and welcome to the latest edition of the FT Cryptofinance newsletter. Scott’s away this week so you’ve got me, and I’m taking a look at the recent flurry of spot bitcoin ETF applications.\n\nWho would have thought the dry business of filing for an exchange traded fund with the US securities regulator could elicit so much excitement?\n\nThe crypto industry has been set alight by some of the US’s biggest money managers filing applications in America to create and run spot bitcoin ETFs.\n\nThe world’s largest asset manager, BlackRock, led the way, and was followed quickly by Fidelity, WisdomTree, VanEck and Invesco, among others.\n\nHaving a spot crypto ETF listed in the US, the world’s largest investment market and teeming with other ETFs, has become something akin to the industry’s Holy Grail. The argument goes that trading bitcoin can be expensive and there are issues such as having to store it as well as its uncertain regulatory status.\n\nA spot bitcoin ETF will bring the coin in line with mainstream assets and enable asset managers to back crypto in a cheap and regulated way, rather than directly buying bitcoin from unregulated crypto exchanges — many of which have found themselves in the crosshairs of the Securities and Exchange Commission.\n\nAs BlackRock’s chief executive Larry Fink put it on Fox Business on Wednesday: “It costs a lot of money right now to transact bitcoin and it costs a lot of money to get out of that.” He added that he hoped “regulators look at these filings as a way to democratise crypto”.\n\nThe problem is that there have been dozens of applications in the past decade and the SEC has rejected all of them.\n\nBut BlackRock’s involvement shows how the pressure to approve is growing and how respectable bitcoin has grown. Back in 2017 Fink spoke for many on Wall Street when he called bitcoin “an index of money laundering”. Now it is an opportunity, to be co-opted.\n\nThe SEC has routinely knocked back applications on the grounds that they cannot offer investors much protection that the underlying market in bitcoin isn’t rife with fraud or manipulation. The door has been opened because the agency has indicated that it might bless an ETF if the regulated exchange hosting the listing — either Nasdaq or CBOE Global Markets in the recent filings — had a surveillance deal with a crypto exchange of size to double-check the crypto market for manipulation.\n\nWhat’s particularly interesting about the applications by BlackRock and others is that (after prompting) they all named Coinbase as their preferred exchange as the custodian for their crypto. To satisfy the SEC’s concerns Coinbase has surveillance-sharing agreements with CBOE and Nasdaq.\n\nThe agreements with major Wall Street names are a big endorsement of Coinbase — its shares climbed 11 per cent this week. But, of course, Coinbase is being sued by the SEC for unlawfully operating an unregistered exchange. The SEC’s suit is running parallel with Coinbase’s hopes that it will be allowed to play a crucial role in the supervision of these bitcoin ETFs. Can the SEC simultaneously hold these two positions?\n\nAt first glance, the answer is no. A lawyer who has worked on previous (rejected) bitcoin ETF applications told me he was “surprised” by Coinbase’s myriad inclusions. “The SEC in all of its denials has referred to a regulated market, and it’s been pretty clear that it doesn’t view Coinbase as a regulated market company,” he said.\n\nBut that might be premature. Fink’s comments shift the calculation. He is not a man accustomed to losing publicly. Coinbase’s collision with the SEC is “a pretty significant overhang”, said Mark Palmer, analyst at Berenberg. It’s “something that you’d have to think would be taken into account in conjunction with the various applications that have been submitted”, he added.\n\nIf there is a pathway, it might be that Coinbase is being sued “only” for violating securities laws registrations. Rival Binance was also charged by the SEC for misrepresentations of controls to prevent manipulative trading.\n\nPalmer said that if Coinbase’s involvement proves too big a hurdle for the regulator, it’s likely that BlackRock and others “would simply replace Coinbase with another surveillance provider in the future or another custodian so that their applications would be more acceptable”.\n\nEven so, there’s a lot riding on the SEC’s decision, which must come by mid-August.\n\nAfter all, BlackRock’s application points out that Coinbase has accounted for about 56 per cent of dollar to bitcoin trading in the US market this year. There is nobody bigger to take on the role as SEC-trusted custodian and exchange for a spot bitcoin ETF — yet. If it’s not to be Coinbase, then who?\n\nWhat’s your view on how traditional financial institutions are thinking about crypto? Email me at nikou.asgari@ft.com\n\nVisit the FT’s Digital Assets Dashboard for analysis of the Wilshire Digital Asset Index, including for round-the-clock updates on the prices, circulating value and other key market metrics of widely traded coins, including bitcoin and ether.\n\nWeekly highlights:\n\nBillionaire twins Tyler and Cameron Winklevoss, owners of crypto exchange Gemini, are embroiled in a long-running billion-dollar feud with Digital Currency Group over the collapse of its crypto lender Genesis. They accused DCG this week of “fraudulent behaviour” and publicly gave its chief executive Barry Silbert a deadline of later today to pay them back, or risk being sued. Read the back-story here.\n\nFTX’s top lawyer was supposed to be in charge of cleaning up the exchange’s legal issues and keeping it on the right side of the law. Now Daniel Friedberg is in his own legal tangle, accused by the exchange’s new managers in court of helping create a “wide-ranging con game”. Bloomberg reports on the key legal man.\n\nSome senior executives are leaving Binance. One of them is Patrick Hillmann, chief strategy officer, who said it was “simply time to move onto the next challenge”.\n\nThe failure of crypto trading group Globix has drawn in members of Gibraltar’s political and legal elite. Read the story by my colleague Scott Chipolina here.\n\nSoundbite of the week: Larry Fink’s conversion\n\nWhen a billionaire such as Larry Fink — arguably the King of Wall Street — speaks in favour of the democratisation of a “skirt the system” asset that crypto once was, you know something has shifted. Here’s his thinking now.\n\n“We do believe that if we can create more tokenisation of assets and securities, and that’s what bitcoin is, it could revolutionise again finance. And so we look at this as an opportunity to move one step further in terms of providing investors fractions of shares . . . democratising the cost of investing.”\n\nData mining: Crypto’s tumbling volumes\n\nThe price of bitcoin rose above $31,000 this week to its highest point since June last year, just before the crisis of confidence that shook the market and engulfed companies such as Three Arrows Capital and Voyager Capital. But there’s little meat behind the move. Crypto volumes dropped to the lowest level since 2020 in the last quarter, according to data from Kaiko.\n\nCryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNy1qdWx5LTIwMjMvYXJ0aWNsZXNob3cvMTAxNTY3NDIyLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNy1qdWx5LTIwMjMvYW1wX2FydGljbGVzaG93LzEwMTU2NzQyMi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $31,200; Litecoin, Shiba Inu tank up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAmid rising concerns of further policy tightening by the US Federal Reserve, cryptocurrency markets were majorly trading lower for the third straight day on Friday.Bitcoin (BTC) declined 1.46% to $30,155, whereas Ethereum (ETH) was below the $1,900 level.\"Despite the slight selling pressure in the last 24 hours, the global crypto market capitalization continues to remain above $1.2 trillion. The crypto fear and greed index, too, continues to remain in the greed zone with a score of 55/100, down 1 point from yesterday,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.\"This selling pressure could be attributed to stronger-than-expected employment data in the US ADP private employment report. This could increase the possibility of another interest rate hike by the feds, which is driving the investor sentiment away from risk-on assets,\" Parth added.The global cryptocurrency market cap was trading lower, around $1.17 trillion, declining 1.76% in the last 24 hours.The total volume in DeFi is currently 2.73 billion, 5.87% of the total crypto market 24-hour volume. The volume of all stablecoins is now $43.21 billion, which is 92.78% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $586 billion. Bitcoin's dominance is currently 49.97%, an increase of 0.32% over the day, according to CoinMarketCap. Meanwhile, BTC volume in the last 24 hours stood at approximately $22.5 billion, rising 75.03% in the last 24 hours.\"The Bitcoin market hit strong resistance at $30,000, signaling a potential reversal. The double-top pattern and fading bullish momentum suggest a consolidation phase and a possible decline towards the 100-day moving average support at $28,000,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.\"Overall, the market outlook for Bitcoin suggests challenging resistance, a potential reversal, and the possibility of a consolidation phase with the likelihood of a short-term decline, he added.In another development, CoinDCX Research Team stated, \"Bitcoin mining revenue has hit a record high in Q2, thanks to the popularity of BRC-20 tokens and Ordinals. This suggests that the underlying fundamentals of the Bitcoin network remain strong.\"Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.52 hours, IST on July 7, 2023)Bitcoin $30,155 -1.47%Ethereum $1,855 -3.45%Tether $1 0.02%BNB $233.9 -2.89%XRP $0.4684 -2.32%Cardano $0.2816 -1.40% Dogecoin $0.06542 -3.04%Solana $20.1 2.85%Polygon $0.6644 -1.75% Litecoin $96.73 -7.17%Polkadot $5.10 -2.80%Tron $0.07808 0.26%Shiba Inu $0.000007234 -3.89%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3doYXRpcy9mZWF0dXJlL1Byb3MtYW5kLWNvbnMtb2YtY3J5cHRvY3VycmVuY3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Pros and cons of cryptocurrency - TechTarget",
        "content": "Cryptocurrency has created a flurry of conversation and activity around the world, drawing investors and tech enthusiasts alike with its decentralized structure and potential for large returns on investments.\n\nCryptocurrency is a bank-independent digital currency that uses a decentralized technology called blockchain to record and verify transactions in a digital ledger. The transactions are facilitated by cryptography, and a virtual wallet is used for sending and receiving money to ensure the safety and anonymity of transactions.\n\nPopular cryptocurrencies such as Bitcoin and Ethereum have developed as alternatives to established financial structures, promising decentralization, security and greater financial independence.\n\nIn addition to its widespread adoption, the digital landscape is witnessing an influx of new cryptocurrencies regularly. Since the launch of Bitcoin in 2009, more than 21,000 different cryptocurrencies have been created, according to Bankrate. However, as with any emerging technology, these digital currencies come with both benefits and challenges.\n\nCryptocurrency benefits Even with the cryptocurrency crash of 2022, it is still a highly attractive investment for many business owners. The following are the most common benefits of cryptocurrency: Decentralization The biggest advantage of cryptocurrency is that it's not owned by a single financial or government entity. This eradicates the monopoly of money and ensures cryptocurrency value isn't dictated by a central bank or authority. Lower transaction fees The fees for transacting in cryptocurrency are very nominal and sometimes zero. This is because third parties and intermediaries, such as VISA and PayPal, are eliminated in the process. Additionally, cross-border transactions using cryptocurrencies are accelerated without challenging foreign exchange procedures, increasing their efficiency and lowering their cost. Inflation protection Due to its limited supply, cryptocurrency is often seen as a way to protect against inflation. For example, the number of coins that can be minted for Bitcoin is capped at 21 million, after which no new coins will be released. Other cryptocurrencies also use techniques to limit supply and help protect against inflation. Theoretically, if demand for cryptocurrency grows, their values may too. Potential for high returns While cryptocurrencies come with potential risks, such as volatile market conditions and potential fraud, most cryptocurrency investments yield a high rate of return. According to reports in 2022, the size of the worldwide cryptocurrency market reached $4.67 billion and is forecasted to grow at a compound annual growth rate of 12.5% between 2023 and 2030. Accessibility Cryptocurrencies boost the accessibility of financial services as they operate on decentralized networks and can be accessed by anyone with an internet connection and crypto wallet. In contrast to typical bank accounts, opening a crypto wallet does not need identity verification, background checks or credit checks. Cryptocurrency can also make cross-border transactions easier and faster as it doesn't involve high fees, long processing times and intermediaries that typically come with traditional banking systems. Transparency While cryptocurrency transactions are anonymous, the data recorded on a public blockchain ledger, such as the Bitcoin and Ethereum blockchain, is publicly available for anyone to view. Every cryptocurrency user gets access to a public key, which can be used to identify an investor. This means that even though the investor names aren't shared, the transactions can still be tracked for transparency. Users may follow live transfers using the blockchain explorer on the cryptocurrency platform. However, not all cryptocurrencies use public blockchain ledgers. There are also private and permissioned ledgers. Private ledgers are exclusively accessible to a specific group of users, while permissioned ledgers are a combination of public and private blockchains, granting access to anyone with permission from the administrators.\n\nCryptocurrency challenges Despite numerous tales of cryptocurrency investments resulting in people becoming overnight millionaires, cryptocurrency also comes with its share of challenges. The following are some common disadvantages of cryptocurrency: Volatility Cryptocurrency prices can often fluctuate. While this volatility can lead to quick profits, it can also cause significant financial losses for investors under certain circumstances, such as when the price of cryptocurrency dips suddenly. This unpredictability can be a risky investment choice, especially for individuals looking for steady returns. Lack of regulation Even though cryptocurrency is legal in many developed countries, it isn't legally regulated by central governments. This absence of control and regulation in the cryptocurrency market increases the risk of cryptocurrency scams and market manipulation. Until federal governments adopt and regulate cryptocurrencies in the same way that they do fiat currencies, such as the U.S. dollar, there will always be a higher risk associated with investing. Here are several types of cryptocurrency scams. Security risks Although blockchain technology offers a robust security architecture, security lapses and hacking attempts are on the rise in the cryptocurrency ecosystem. Cybercriminals have attacked cryptocurrency exchanges and digital wallets, causing significant financial losses for both people and businesses. Moreover, because Bitcoin transactions are irreversible, it's difficult to recover funds once they have been stolen. Risk of losing coins To access the virtual wallet where the cryptocurrency tokens are stored, several cryptocurrencies, including Bitcoin, require the owner to have possession of a private key. However, should a private key ever be lost or stolen, it is impossible to demonstrate another proof of ownership or to recover the cryptocurrency tokens. Excessive cost of production Depending on its type, mining cryptocurrency may require a large supply of electricity and other resources. For example, most Bitcoin-related costs are associated with the energy required to create the currency, according to Harvard Business Review. This increased power usage may result in local pollution, noise and other consequences -- such as increased greenhouse gas emissions -- for communities living near the mining sites. No refund or cancellation Cryptocurrency is nonrefundable. This means that it can't be refunded to the sender in cases where there is a disagreement between the parties involved or when money is inadvertently sent to the incorrect wallet. As such, people may use it to defraud others. Since there are no reimbursements, it's simple to fabricate one for a transaction where the products or services were never delivered."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWZpbGluZ3MtYWZmZWN0LWNyeXB0by1pbmR1c3RyeS1jb2ludGVsZWdyYXBoLXJlc2VhcmNoLWp1bmUtcmVwb3J00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "How the spot Bitcoin ETF filings affected the crypto industry in June: Report - Cointelegraph",
        "content": "The news surrounding BlackRock’s application for a spot Bitcoin (BTC) exchange-traded fund (EFT) sent the asset’s price from its local lows in mid-June to a strong monthly close of +12%. To most observers, this was a sign that institutional investment into the cryptosphere is once again on the horizon. A future approval of a spot ETF combined with rate cuts from the United States Federal Reserve could provide the ideal catalysts for the next bull run.\n\nFor those keen to gain a deeper understanding of the crypto space’s various sectors and their fundamental trends, Cointelegraph Research publishes its monthly “Investor Insights Report,” which dives into venture capital, derivatives, decentralized finance (DeFi), regulation and much more. This month, Cointelegraph Research examined how various sectors reacted to the bullish news surrounding BlackRock’s ETF filing with the U.S. Securities and Exchange Commission.\n\nThe report is available for free on the Cointelegraph Research Terminal.\n\nWhile crypto-related stocks, especially those of mining ventures, immediately benefitted from the news, other sectors traditionally tied closer to altcoin activity, such as DeFi, continued in bear-market mode unperturbed.\n\nZk-Rollups race heating up ahead of next bull run\n\nMany suspect that novel layer-2 scaling solutions for Ethereum will be among the big gainers in the next bull run. However, the competition in the space is tight. Zero-knowledge (ZK) rollup technology, which allows a shortened summary of transaction batches and smart contract executions to be submitted to the chain, will arguably be the biggest area of innovation in this crypto market cycle.\n\nZkSync Era’s ZK Stack, Polygon zkEVM and StarkWare’s Starknet have all been in the news for their recent or newly proposed innovations. But what does the data say about the relative success of these projects?\n\nIn June, Polygon zkEVM outperformed zkSync and Starknet in terms of growth in total value locked (TVL), gaining an impressive 71% month-over-month. However, it still lags an order of magnitude behind the dominant zero-knowledge protocol, zkSync, which currently has a TVL of $120 million.\n\nThe recent growth of zkEVM can be attributed to the slew of DeFi protocols it has attracted — such as QuickSwap, Balancer and SushiSwap — with many more in the pipeline. These and other recent developments are discussed every month in the DeFi section of the Cointelegraph Research Monthly Trends Report.\n\nSecurity tokens market chugs along unperturbed\n\nSecurity tokens are a remarkable sector of the industry in that they seem to have continued their modest but steady growth throughout the bear market, apparently unphased by the ETF filings that rocked the rest of the market.\n\nDuring the first half of the year, the total market capitalization of security tokens rose from $14.93 billion to $16.76 billion, as seen in the figure below. The 1.65% growth seen in June was connected to several notable deals and security token offerings (STOs).\n\nThough the development of tokenized securities is controversial in the crypto community, banks such as Citigroup and Bank of America have predicted that the tokenization of real-world assets may drive trillions of dollars to blockchains in the future. While most securities offerings currently involve real estate, other types are quickly gaining pace. With a section on STOs, Cointelegraph Research’s monthly Investor Insights Report covers this lesser-known part of the crypto industry — one that may ultimately grow into a multitrillion-dollar sector.\n\nThe Cointelegraph Research team\n\nCointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to bringing the most accurate, insightful content available on the market.\n\nDemelza Hays, Ph.D., is the director of research at Cointelegraph. Hays has compiled a team of subject matter experts from finance, economics and technology to bring the premier source for industry reports and insightful analysis to the market. The team utilizes APIs from various sources to provide accurate, useful information and analyses.\n\nWith decades of combined experience in traditional finance, business, engineering, technology and research, the Cointelegraph Research team is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report.\n\nThe opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxhLWJpdGNvaW5ldGEtdmFuLXByb21vdGVzLWJpdGNvaW4tYWRvcHRpb24tZXVyb3Bl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "'No, we're not smuggling people' — Bitcoin advocate tours Europe in BTC-styled van - Cointelegraph",
        "content": "From thumbs-ups from friendly strangers to midnight police searches, a Bitcoin-themed van continues a whirlwind tour around Europe.\n\nAriel Aguilar has been behind the wheel of Bitcoin (BTC) promotion efforts, driving across Europe in a BTC-themed van called La Bitcoineta. Speaking to Cointelegraph journalist Joe Hall at Plan B Summer School, the Argentine Bitcoin proponent recalled the highs and lows of the journey across nearly a dozen European nations.\n\nLa Bitcoineta parked at the Plan B Summer School in Lugano in 2023.\n\nA portion of La Bitcoineta’s journey took the van from Serbia to Lugano, which involved a border transition between Bosnia and Croatia. Aguilar had waited until midnight to cross the border, which prompted suspicion from border and customs officials.\n\nAfter an initial check at the border, the van was stopped ten minutes later by an unmarked vehicle manned by five officials in civilian clothes. The Bitcoin enthusiast said:\n\n“They said, ‘We are the police; we have to search your vehicle.‘ I thought it’s most likely that they thought we were smuggling people.”\n\nAgain Aguilar was cleared to continue his trip to Lugano, humorously noting that he had avoided ‘bribing’ an official who had discovered Aguilar’s copy of The Bitcoin Standard, a book written by BTC proponent and economist Saifedean Ammous:\n\n“I didn’t know if he wanted it, but just in case it was seen as a bribe, I did not give it as a gift.”\n\nOther sections of the journey have produced more positive experiences. Aguilar highlighted seeing thumbs-up signs from strangers in Switzerland at the sight of La Bitcoineta cruising past. Meanwhile, people in crypto-friendly jurisdictions like Spain and Portugal were seemingly oblivious to the van’s presence.\n\nLa Bitcoineta has traveled from Spain to Gibraltar, Portugal, Andorra, Switzerland, Munich, Prague, Oslo, Romania, Serbia and Lugano.\n\nRelated: Venture capital’s ICO gambits left Bitcoin ecosystem underfunded — Adam Back\n\nThe journey is set to continue to Serbia, Bosnia, Montenegro, Albania, and Macedonia. A trip to the United Kingdom is planned in September before heading to Madrid, Amsterdam and Luana, and completing the journey in Lugano.\n\nAguilar said next year’s tour might feature longer trips to different countries, gauging the different levels of Bitcoin adoption.\n\n“Let’s say we do Germany, we do France. The idea is to interview a French Bitcoiner to see that he’s not a shit coiner, right? If he’s a really Bitcoiner.”\n\nThis would involve allowing Bitcoin advocates in different countries to be involved in La Bitcoineta talks and presentations on the subject.\n\nAnd alas\n\n\n\nA new meme template was born #Bitcoin pic.twitter.com/BiRhCiheHN — RŌNIN (@ronin21btc) June 10, 2023\n\nThe van has seen its fair share of fanfare as well. La Bitcoineta birthed a famous meme with Bitcoin proponent Michael Saylor after Aguilar gave the MicroStrategy CEO a tour of the van at a conference:\n\n“He loved it, especially for the big ‘Bitcoin is hope’ phrase on the side of the van. He took a picture and uploaded it to his Instagram.”\n\nAs for the photo, Aguilar says his cameraman was the source of Saylor’s meme-worthy expression:\n\n“He was filming instead of taking photos, so he was taking too long, and that’s when Saylor got the angry look that the meme has.”\n\nLa Bitcoineta is also covered in signatures from influential Bitcoin figures like Adam Back, Ammous, Prince Philip of Serbia, Jack Mallers, Elizabeth Stark and other “OG Bitcoiners” that have left messages for posterity on the van.\n\nThe interview is part of an upcoming Cointelegraph documentary about what it’s like to attend a Bitcoin School. Subscribe here (https://www.youtube.com/@cointelegraph) to watch.\n\nMagazine: Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8xNDc2MzUvYml0Y29pbi1mYWxscy10by0zMDAwMC1hbWlkLWV4cGVjdGF0aW9ucy1vZi1mZWQtcmF0ZS1oaWtl0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NzYzNS9iaXRjb2luLWZhbGxzLXRvLTMwMDAwLWFtaWQtZXhwZWN0YXRpb25zLW9mLWZlZC1yYXRlLWhpa2U_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Falls to $30,000 Amid Expectations of Fed Rate Hike - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) dropped below $30,000 on Friday morning, after ADP Research Institute revealed the strongest one-year growth in the U.S. job sector for the month of June, reaffirming the market's expectation of an interest rate hike in July.\n\nThe U.S. Department of Labor will release the official numbers today.\n\nPer data from CoinGecko, Bitcoin rapidly slipped from its weekly high of $31,248 to a 24-hour low of $29,904 in the early hours of Friday morning, before recovering to its current level of around $30,140, down 1.9% on the day.\n\nAD\n\nAD\n\nBitcoin’s tumble dragged the rest of the crypto market down, with the total market capitalization of crypto dropping 2.9% to $1.22 trillion.\n\nEthereum (ETH) lost 2.5% in the last 24 hours to trade at $1,860. Among the top 100 coins by market cap, Pepecoin (PEPE) topped daily losses, dropping 9%.\n\nAnother rate hike on the horizon?\n\nADP’s report showed that America created 497,000 jobs in June—the highest in one year. However, according to a Reuters survey of economists, the expected number of jobs created is 225,000.\n\nThe employment report is one of the most crucial factors for the U.S. Federal Reserve in determining their monetary policies besides inflation.\n\nThe Fed began its most stringent monetary policy in March 2022 by hiking the benchmark interest from near zero to around 5% by April 2023 to curb inflation.\n\nAD\n\nAD\n\nHigher interest rates increased the cost of doing business, which restricted growth. Since last year, interest rate hikes have been the most potent catalyst in pulling down the prices of stocks and crypto.\n\nStrong job numbers indicate a robust economy, allowing the Fed to hike interest rates further.\n\nCurrently, CME’s FedWatch tool shows that the market is placing an 89.9% chance that the Fed will hike its benchmark rate. The Fed is scheduled to meet on July 25 and 26 to decide their policy rate for August.\n\nThe stock market also incurred losses yesterday as the tech-heavy Nasdaq index lost 0.86% or 131.4 points, and the S&P 500 index ended the day at a 0.68% loss or 30.3 points lower.\n\nContrary to the usual trend, the dollar index (DXY), which measures its value against other major currencies, also closed in red yesterday, falling 0.23% to 103.1 points.\n\nThe release of June’s inflation numbers on July 12 will also influence the Fed’s decision. The rate of increase in annual inflation eased to 4% in May from its peak of 9.1% in June 2022."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ibGFja3JvY2stdm9pdC1sZS1iaXRjb2luLWNvbW1lLWRlLWxvci0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "BlackRock sees Bitcoin as gold - Cointribune EN",
        "content": "Fri 07 Jul 2023 ▪ 10 min of reading ▪ by Thomas A.\n\nIt’s not the first time that financial giants have made optimistic statements about bitcoin. But this time, the CEO of the world’s largest asset management company openly declared his preference for bitcoin “over investing in gold, […] bitcoin is an international asset”. In the wake of this statement, bitcoin is on the verge of a bull market. As stock market indices consolidate, bitcoin is on its highest levels of the year. But is bitcoin “digital gold”? And what are the aims of this financial giant?\n\nMachination or conviction?\n\nIn 2017, Larry Fink, CEO of BlackRock, declared that bitcoin was a money-laundering tool. This is in stark contrast to his recent comments. In addition, BlackRock had made indirect investments in the cryptocurrency. In particular, the company had invested $24 million in FTX. A brilliant failure… From now on, BlackRock’s repeated comments show a clear stance towards cryptocurrencies. This position has been welcomed by the market.\n\nI think the role of cryptos is to digitize gold, in many ways. Instead of investing in gold as a hedge against the onerous problems of a particular country. Let’s be clear: bitcoin is an international asset. Larry Fink (2023)\n\nThis statement also comes on the heels of BlackRock’s announcement that it intends to create a bitcoin ETF. However, this proposal requires the approval of the SEC. But it is clear that this opening up in management would have a considerable impact for finance and cryptocurrencies.\n\n2017 : Larry Fink (BlackRock) qualifie le bitcoin d'\"indice du blanchiment d'argent\"\n\n\n\n2022 : BlackRock va permettre à ses clients d'investir dans les cryptomonnaies — Raphaël Bloch 🐳 (@Raph_Bloch) August 6, 2022\n\nIn December 2022, BlackRock’s CEO also declared: “I believe the next generation for markets and next generation for securities will be tokenization of securities”. This is not a neutral statement. Indeed, some start-ups are already offering tokenization of bonds and other securities. The future of finance probably lies in Blockchain and the exchange of securities on a network of a different order. But the Blockchain network is not comparable in traditional finance to bitcoin, whose image is completely different.\n\nWhy bitcoin is and isn’t digital gold…\n\nThis is an important theoretical question. Indeed, bitcoin (BTC) is often represented by a gold coin. This gold coin bearing the bitcoin seal is indicative of the ambiguity in the public mind. Can bitcoin replace gold? What are the differences and similarities between the two assets?\n\nWhat do gold and bitcoin have in common?\n\nWhat gold and bitcoin have in common, at least in theory, is their “limited quantity”. Gold is available in limited quantities underground. Similarly, the quantity of bitcoins in circulation is limited and defined in advance.\n\nNevertheless, we’ve never mined as much gold as we do today. And we’ve never mined as few bitcoins as we do today. The quantity of gold available underground is difficult to estimate, and mining companies have significant production capacities. They account for 80% of supply. The limited quantity of the two assets is therefore an unjustifiable point in common.\n\nOn the other hand, the fact that both assets require regular mining is quite common. Mining defines the minimum price at which a unit can be sold, assuming that the quantity demanded exceeds the quantity offered.\n\nBitcoin velocity is often highest during bitcoin’s downtrends. This reflects the idea that the market is approaching the “right price”, or at any rate, the lowest price determined by the miners’ cost of production. Any sale below the production cost of BTC would lead to difficulties on the network, and thus ultimately to a systematic return to this level. The now negligible influence of miners is therefore not the cause of the high production cost.\n\nIn both cases, therefore, there is a link between the cost of mining and the price observed over the long term.\n\nDifferences between Gold and Bitcoin\n\nNevertheless, bitcoin is still too closely correlated with stock market indices to be “independent”. Our last article clarified the following.\n\nThe correlation between bitcoin and the indices persists over time, as the speed of bitcoin’s circulation evolves according to the phases of the market. In other words, as long as bitcoin remains speculative (subject to frequent trading), the role of liquidity is central, and the correlation with indices remains very high. Conversely, the gold price shows a lower correlation to indices, as its velocity also seems lower.\n\nAlthough the price of gold is correlated with the indices, the level of correlation is lower than that of bitcoin over the long term. Consequently, in addition to being highly volatile, bitcoin is also highly sensitive to liquidity. In fact, the average volatility recorded for bitcoin is 53% since 2019. This compares with 15% for gold over the same period. In other words, bitcoin is 3.5 times more volatile than gold!\n\nGold volatility measured over the last 30 days. Graph and data by Thomas ANDRIEU.\n\nIt follows that it’s unreasonable to regard bitcoin as a stable investment. It’s a conviction stock. The instability of bitcoin, and its high correlation with indices, means that it is divergent from the case of gold. Finally, gold has been around for thousands of years.\n\nGold is no longer an exchange value\n\nIf gold was the basis of the international monetary system, it has not been since 1971. This means that prices are no longer expressed or pledged in gold. Moreover, gold is no longer a medium of exchange, either between individuals or between nations that used to balance their trade. It is now perceived as a store of value, rather than a medium of exchange. In contrast, bitcoin is used as a medium of exchange.\n\nThis difference in the ownership of the two assets is reflected, as we have shown, in the statistics. In this respect, gold is a precious metal, which is even used (in part) for productive purposes. It is therefore completely devoid of any exchange purpose in the 21st century.\n\nBitcoin’s circulation speed is decreasing\n\nThe evolution of bitcoin’s circulation speed speaks directly to the question of whether bitcoin is a store of value or a medium of exchange. In a previous article, we estimated that in 2022, one bitcoin was exchanged on average 0.66 times. This figure is lower than the period 2010-2018, when the average bitcoin velocity was 1.4.\n\nWe will therefore specify that around 330,000 bitcoins were mined in 2022. At the same time, there was a global annual volume of $357.5 billion exchanged in bitcoins. With an average price in 2022 of $28,200, we deduce that the approximate number of bitcoins traded is 12.6 million. This means that bitcoin’s velocity will be close to 0.66 in 2022! In other words, bitcoin’s velocity is lower than that of traditional currencies. Cointribune\n\nWhile bitcoin’s reserve value is increasing, i.e., its volatility is decreasing, its exchange value remains significant.\n\nThe risk of bitcoin being speculative, not operative…\n\nHow can bitcoin (BTC) be useful for trading if bought via an ETF?\n\nThis is the question and the paradox behind the desire to create a bitcoin ETF. Indeed, bitcoin is intended to be outside the financial system (at least in principle). So, a priori, it makes no sense to buy bitcoin via an ETF. What’s more, if bitcoin is purchased via a financial product’s vehicle, then it no longer has any effective use. This is the risk of having a bitcoin devoid of its original meaning.\n\nConsequently, BlackRock’s desire to democratize bitcoin is not consistent with bitcoin’s purpose. Nor are recent declarations to “replace” gold with bitcoin realistic. Bitcoin is undeniably distinct from gold, and neither history nor statistics bring them together.\n\nOn the other hand, the statement that “bitcoin is an international asset” is justified. Nearly 500 million people were using cryptocurrencies in 2022. In fact, cryptocurrencies are widespread in most countries around the globe. This is one of the reasons behind bitcoin’s success… It’s an international asset, a medium of exchange with no political or national label! Nevertheless, BlackRock’s boss seems more concerned about the democratization of bitcoin than its adoption. The nuance lies in the use to which bitcoin is put. A non-operational bitcoin would be the death of bitcoin.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZvaWNlcy9kZWJ1bmtpbmctYS1jcnlwdG8tbXl0aC1pcy1jcnlwdG8tcmVhbGx5LWJhZC1mb3ItdGhlLWVudmlyb25tZW50L9IBcmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZvaWNlcy9kZWJ1bmtpbmctYS1jcnlwdG8tbXl0aC1pcy1jcnlwdG8tcmVhbGx5LWJhZC1mb3ItdGhlLWVudmlyb25tZW50Lw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Debunking a crypto myth: Is crypto really bad for the environment? - The Times of India",
        "content": "The environmental impact of cryptocurrencies has been a widely-discussed topic in recent years, with many believing that the underlying technology is inherently bad for the environment – notably, the process of crypto mining. To address this misconception, it is essential to understand the reasons behind this belief, how blockchain networks compare to other systems on energy consumption, and the steps being taken by the crypto industry to mitigate its ecological footprint.\n\nThe Origins of the Misconception\n\nOne of the main reasons people associate crypto with environmental harm can be attributed to the energy-intensive nature of the mining process. Bitcoin, as well as many other established and widely used projects, rely on the proof-of-work (PoW) consensus mechanism for maintaining the distributed ledger of transactions. This method of validation involves miners using powerful computers to solve complex mathematical puzzles. The process is thought to consume a significant amount of electricity, which in turn raises concerns about its environmental impact.\n\nHowever, critics often focus on the energy consumption of cryptocurrencies, particularly Bitcoin, without providing full context or comparison. This selective representation can lead to the perception that crypto is inherently harmful to the environment. A balanced perspective is crucial to understanding the scale of the environmental impact of crypto and putting it into context.\n\nUnderstanding the Crypto Energy Debate: A Deeper Dive\n\nWhile proof-of-work (PoW) blockchains, such as the Bitcoin network, do consume significant amounts of energy, it would be unreasonable to claim that crypto is inherently bad for the environment.\n\nAccording to a 2021 Galaxy Digital research report, the energy footprint of the top 100 global banks’ data centers is more than 2 times that of the Bitcoin network. Furthermore, the World Bank and International Energy Agency’s estimates of the amount of electricity lost in transmission and distribution annually are 19.4 times greater than what the Bitcoin blockchain uses over the same period.\n\nThis point is aptly summarized in a paper published by the World Economic Forum’s Crypto Impact and Sustainability Accelerator (CISA): “Crypto provides economic freedom to people in developing countries and consumes less energy globally than tumble driers or domestic refrigeration.”\n\nAdvancing the Use of Sustainable Energy\n\nThe idea that all Bitcoin mining is immediately damaging is a fallacy in and of itself. A Q2 2022 report from the Bitcoin Mining Council revealed that 59.5% of global energy used for Bitcoin mining is derived from renewable sources, indicating a shift toward sustainability of the process. Furthermore, the organization reported a 46% year-on-year increase in mining efficiency resulting from advancements in semiconductor technology and the implementation of modern mining techniques. These dynamics result in a decrease in the network’s emissions. There is evidence suggesting that, even as hashrate and the overall electricity consumption of the BTC network go up, emissions are decreasing as miners opt for more sustainable energy sources.\n\nThere are also multiple examples of crypto mining businesses working with energy producers to solve problems known as energy curtailments. These deliberate reductions in energy output to balance supply and demand ultimately result in surplus power going unused. Research shows that crypto mining can help prevent renewable energy curtailments and thus increase the efficiency of energy use, facilitating the transition to renewable energy along the way.\n\nConsensus Mechanisms and Energy Efficiency\n\nAnother key point to consider in relation to the “environmental” myth is that it almost always focuses on Bitcoin and other PoW-based systems. However, blockchains rely on different consensus mechanisms, other than PoW to verify transactions.\n\nRecent years have seen a spike in the popularity of proof-of-stake (PoS) solutions, which rely on a limited number of nodes, selected based on their stake in the network, to validate transactions. PoS mechanisms are more energy-efficient, thereby significantly reducing the overall electricity consumption of cryptocurrencies.\n\nEthereum, the second-largest blockchain network in the world, has undergone a switch from PoW to PoS in September 2022, one of the major drivers for the change being the superior energy efficiency of the latter consensus mechanism. Crypto Carbon Ratings Institute (CCRI) has examined the impact of Ethereum’s transition and found that its annualized electricity consumption went down by more than 99.9%. Accordingly, Ethereum’s carbon footprint also decreased by 99.9%.\n\nResearch from the Cambridge Centre for Alternative Finance shows that Ethereum’s annual electricity usage is now equivalent to the yearly consumption of 587 air conditioners and is smaller than that of many global companies and famous buildings. For a system that has processed upwards of 400 million transactions at an average transaction time of just a few minutes, such a level of energy consumption is nothing short of remarkable.\n\nBlockchain’s Role in Solving Sustainability Challenges\n\nBlockchain technology’s role in sustainable development goes far beyond the carbon footprint of its financial services applications. For instance, blockchain can be used to track and verify the origins of goods, ensuring that they are produced sustainably and ethically. This level of transparency can incentivize companies to adopt more environmentally friendly practices and help consumers make informed choices. Several blockchain startups are revolutionizing the energy industry by monetizing renewable energy generation, driving down energy prices and consumption, creating economic opportunities for households, and encouraging greener choices.\n\nUsing blockchain technology to enable peer-to-peer energy trading also allows consumers to sell excess solar power directly to their neighbors. This innovative approach not only promotes the use of renewable energy sources but also decentralizes the energy market, reducing reliance on large-scale power plants and inefficient energy distribution systems.\n\nCrypto and blockchain hold the potential to not only be part of, but also heavily contribute to a more sustainable future. By fostering energy-efficient consensus mechanisms, driving innovation in renewable energy, and promoting transparency and accountability across various industries, these technologies can play a vital role in addressing global sustainability challenges and helping shape a greener world.\n\nFacebook Twitter Linkedin Email Disclaimer Views expressed above are the author's own."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xNDc2NjIvYml0Y29pbi1icmMtMjAtdG9rZW5zLW5vdy1tb3Zpbmctb3Zlci1ldGhlcmV1bdIBTmh0dHBzOi8vZGVjcnlwdC5jby8xNDc2NjIvYml0Y29pbi1icmMtMjAtdG9rZW5zLW5vdy1tb3Zpbmctb3Zlci1ldGhlcmV1bT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin BRC-20 Tokens Are Now Moving Over to Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSix months after launching a protocol that lets people mint NFT-like media assets on the Bitcoin blockchain, the Ordinals space is rapidly evolving. Not only are new products springing up one after another, but the Ordinals-based BRC-20 tokens are now expanding onto none other than Ethereum, the dominant NFT and token ecosystem.\n\nTwo of the largest BRC-20 tokens on the market, ORDI and OXBT, have partnered with Emblem—a tool that lets users store tokens across blockchains without need for a bridge—to release BRC-20 Curated Collections.\n\n“This should be considered a day in which BRC-20s began exploring what their asset class is,” said Jake Gallen, who is in charge of NFT strategy and product at Emblem.\n\nAD\n\nAD\n\n⬛️🟧 $ORDI and $OXBT MEGATHREAD 🟧⬛️ 🚀 VAULTING IS NOW LIVE 🚀 🔸 How to Mint\n\n🔸 Where to Trade\n\n🔸 Vaulting Mechanics\n\n🔸 Details, Info, Integrations, and Partnerships pic.twitter.com/AANoZjTVxs — Emblem Vault (@EmblemVault) July 6, 2023\n\nBRC-20 tokens use the Ordinals protocol to generate what are effectively fungible tokens built on top of the Bitcoin blockchain. Broadly, they’ve been used thus far to create a wide variety of meme tokens, with the total market cap of all BRC-20s briefly nearing $1 billion in May before falling sharply since.\n\nGallen told Decrypt that the BRC-20 Curated Collections are important “because we can now test what type of asset BRC-20s are most closely related to.” He’s looking forward to “how the community views them,” and whether they want to trade them like fungible tokens “or want some variety.”\n\nHe teamed with Adam McBride, colleague and self-proclaimed NFT archaeologist, to share a video deep dive earlier this week about the collection launch. An official launch was pegged for next week, but the functionality is already live and the resulting NFTs are being traded on the OpenSea and Blur marketplaces.\n\nAccording to McBride, the innovation at play with the new partnership is to sidestep traditional cross-chain bridges. He explained that “before, users would send their BRC-20s to a Bitcoin wallet, which then would mint new ERC-20s on Ethereum.”\n\nAD\n\nAD\n\nEmblem’s solution, created in-house, is to create specialized vaults. Before Ordinals, Emblem vaults were used to transfer digital artwork minted on other Bitcoin-related protocols (like Counterparty) over to Ethereum, where they were newly minted as ERC-721 NFTs. The Rare Pepe collection is a prominent example.\n\nIn this case, with Ordinals-based BRC-20 tokens, users send their ORDI or OXBT to a vault which stores the private keys and holds the tokens. Then, using a single ERC-721 token, users will mint their Bitcoin-based NFT on Ethereum.\n\nIn essence, “the BRC-20 sits inside a Taproot wallet, which sits inside an NFT,” said Gallen, explaining that “the NFT (which is an ERC-721 token) is the one doing all the traveling.”\n\n“I’m super excited to see how the Ethereum marketplace will react to this,” said McBride. “This will bring a level of ownership which is far more superior than what already exists, unlocking a bunch of use cases like farming, lending, and other stuff that is built out on Ethereum smart contracts.”\n\nThe creator of BRC-20s and ORDI in particular, pseudonymous on-chain data enthusiast Domo, did not reply to a request for comment. According to Gallen, however, Domo “is really excited to get to show his creation to Ethereum,” adding that “getting those tokens to OpenSea and Blur is huge.”\n\nGallen told Decrypt that the Emblem team has interacted more with ORDI builders than holders, whereas they are in direct contact with the OXBT community—led by the pseudonymous BitGod—since it is more ETH-native, \"so the interest in ETH-denominated trading is much higher.\"\n\nNonetheless, Gallen said that Emblem’s team “believes Bitcoin can equal or overtake Ethereum in NFT trading volume, but with its own culture and style.”"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLW1lZXRzLWFpLXdoYXQtdGhpcy1tZWFucy1mb3ItY3J5cHRvcy1mdXR1cmUv0gFOaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW4tbWVldHMtYWktd2hhdC10aGlzLW1lYW5zLWZvci1jcnlwdG9zLWZ1dHVyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin meets AI: What this means for crypto’s future - AMBCrypto News",
        "content": "Bitcoin to benefit from AI courtesy of Lightning Labs’ new AI tools.\n\nBTC dipped slightly after accumulation slowed down in the last few days, followed by some profit-taking.\n\nArtificial intelligence’s popularity this year has somewhat stolen some of Bitcoin’s [BTC] thunder. Most of the attention that Bitcoin previously held has shifted to AI, and the same goes for potential liquidity. But what if Bitcoin could also benefit from AI integration?\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nThe Lightning network might just be headed down the path of embracing AI. Lightning Labs, the company behind it, announced the launch of new AI tools. They are reportedly designed to help developers create Bitcoin AI-powered products.\n\nIn other words, the Lightning network might be about to tap into AI to derive more efficiency from Bitcoin.\n\nAnnouncing a new set of tools to build Lightning⚡and #bitcoin-powered AI products for a global audience. Using L402, a standard for API authentication with LN payments, and @langchainAI, a simplified AI app framework, we are opening up #AI4All! ??https://t.co/EQseanCurv — Lightning Labs⚡️? (@lightning) July 6, 2023\n\nOne of the biggest questions regarding this development is how Bitcoin will benefit from AI. According to the official announcement, the tools can create advanced functionalities within the Lightning network. This includes the development of a new authentication mechanism, or perhaps boosting network performance.\n\nPerhaps one of the best use cases for the new AI tools for the Lightning network is that it may facilitate Bitcoin use in the Internet of Things (IOT). If cryptocurrencies such as Bitcoin will become embedded in the future of commerce, then it makes sense to develop AI-powered tools. Bitcoin interaction with AI tools is perhaps another reason why developers should consider AI integration with blockchain.\n\nWill the development encourage more adoption?\n\nThe aforementioned benefits might just represent a fraction of the advantages of integrating Bitcoin with AI. More advantages might be unlocked in the future, but before that, consider this. We have already seen that most top companies are adopting AI to boost productivity.\n\nThus, Lightning’s integration with AI could also allow Bitcoin to maintain its competitive advantages.\n\nBTC price action recap\n\nThe advantages may not be immediately felt, but could have a significant impact on Bitcoin in the future. The cryptocurrency’s press time situation underscored the return of sell pressure after failing to push above the $31,419 price level.\n\nThe king coin exchanged hands at $30,181 at the time of writing.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nWill Bitcoin slip below $30,000 once again? So far, the coin’s MFI reveals that there have been significant outflows in the last few days. However, a price tag below the $30,000 range is easily achievable if sell pressure continues to build up.\n\nThe right FUD-inducing news could send the king coin even lower. On the other hand, investors should also look out for more accumulation supported by positive developments."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvY2l0aWVzL2JhbmdhbG9yZS9uby1pbnRlcmltLW9yZGVyLWV4aXN0cy1vbi1jYXNlcy1vZi1iaXRjb2luLXNjYW0taGFuZGVkLW92ZXItdG8tc2l0LWNsYXJpZmllcy1rYXJuYXRha2EtaGMtODgxMDYwNy_SAZsBaHR0cHM6Ly9pbmRpYW5leHByZXNzLmNvbS9hcnRpY2xlL2NpdGllcy9iYW5nYWxvcmUvbm8taW50ZXJpbS1vcmRlci1leGlzdHMtb24tY2FzZXMtb2YtYml0Y29pbi1zY2FtLWhhbmRlZC1vdmVyLXRvLXNpdC1jbGFyaWZpZXMta2FybmF0YWthLWhjLTg4MTA2MDcvbGl0ZS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "No interim order exists on cases of Bitcoin scam handed over to SIT, clarifies Karnataka HC - The Indian Express",
        "content": "A single judge bench of the Karnataka High Court has clarified that no interim order has been granted by the court in cases filed to quash probes against a gang involved in the hacking of cryptocurrency exchanges, online poker sites and the state e-governance sites.\n\nThe High Court issued the oral clarification during the hearing of pleas filed by a hacker Srikrishna Ramesh alias Sriki and three associates Sunish Hegde, Prasidh Shetty and Hemanth Mudappa for quashing of investigations against them in two separate cases filed by the Bengaluru Central Crime Branch police and the Criminal Investigation Department for hacking of Bitcoin exchanges and a state e-portal.\n\nRead further | Bengaluru police chief writes to CID for further probe into Bitcoin scam involving hacker Sriki\n\nThe petitions filed earlier in 2021 and 2023 for the quashing of cases against the hacking gang came up for hearing in the High Court on Thursday even as the new Congress government ordered the creation of an SIT on June 30 for further investigations into these cases that occurred during the BJP’s tenure.\n\nAdvertisement\n\nEarlier in September 2022, the High Court had stated during two hearings that “interim order granted earlier, is extended till the next date of hearing”. The court, however, clarified on Thursday that there were no interim orders granted earlier in the petitions filed for quashing of the cases.\n\nThe clarification from the High Court came amid doubts on whether the SIT constituted by the new Congress government could carry out investigations into the hacking related crimes and alleged corruption in the handling of the cases by the police and state officials during the BJP rule from 2019 to 2023.\n\nKnow more | ED files chargesheet against hacker Sriki even as Karnataka govt creates SIT to probe BJP-era Bitcoin scam\n\nIn one of the cases, Sriki is accused of hacking crypto exchanges and online poker sites to make illegal wealth for himself and his associates. In a second case, he is accused of hacking into the Karnataka government’s e-procurement cell to steal Rs 11.5 crore of funds which was later converted into cash through an elaborate laundering network involving hawala transactions.\n\nIn a hearing in March 2022, a senior counsel for the accused argued that the hacking crimes of the gang were noticed by the police while probing a drug case and that the hacking case was taken up without evidence and materials as an afterthought by the police.\n\nAdvertisement\n\nOn Thursday, the High Court posted the case to July 19 for further hearing.\n\nNotably, Home Minister G Parameshwara had said recently, “Earlier when the BJP was in power, a Bitcoin scam running into lakhs of rupees was reported to have occurred through virtual transfers with several people involved in the transactions and the issue was hushed up without proper investigations.”\n\n“Before we came to power, we had stated that we would conduct further investigations into the Bitcoin scam. We have done as stated. An SIT is being formed in the CID and an order has been issued to this extent to form an SIT,” Parameshwara had said.\n\nIn November 2020, the Central Crime Branch of the Bengaluru police had stumbled upon the suspected possession of a large quantity of Bitcoins by Sriki following his arrest in a case of procuring drugs over the darknet using crypto currency.\n\nAdvertisement\n\nThe hacker, who was a central figure in a 2019 pub brawl involving a Congress leader’s son, claimed to have hacked multiple exchanges for Bitcoin.\n\nThe investigations in the drug case led to the CCB filing cases against the hacker and his high profile associates for allegedly hacking online poker sites and cryptocurrency exchanges to acquire wealth through illegal means. The CCB investigations were, however, hit by allegations of corruption and diversion of crypto currency found in the possession of the hacker gang.\n\nThe CCB probe initially claimed to have recovered 31 Bitcoins worth Rs nine crore from the hacker but the police later claimed to have been duped by the hacker into believing that cryptocurrency located at an exchanges was transferred to an online seizure wallet created by the police to hold the Bitcoins recovered from the hacker.\n\nThe arrest of the hacker in November 2020 in the drug case by the CCB also revealed his role in a July 2019 hacking of the state e-procurement cell where Rs 11.5 crore was stolen. The CCB probe in 2020 revealed that a gang featuring Sriki was behind the e-procurement cell hack in 2019.\n\nAdvertisement\n\nThe CID filed a charge sheet on December 15, 2021 against Sriki and 17 others for the 2019 heist at the state e-governance cell. The CID filed charges under theft, receiving of stolen property, disposal of stolen property, causing disappearance of evidence, destruction of evidence and criminal acts against the accused.\n\nThe CCB filed a charge sheet on February 2, 2021 following investigations into the alleged hacking of multiple exchanges and poker sites. The Enforcement Directorate (ED), which investigated the money laundering angle in the hacker gang case, filed a charge sheet with respect to the Rs 11.5 crore e-procurement cell theft on July 3 this year even as the state created an SIT.\n\nWhile Rs 1.43 crore of the Rs 11.5 crore stolen from the e-procurement cell has been recovered by the ED, there has been no other major recovery of stolen funds or cryptocurrencies by the police agencies so far."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZmluYm9sZC5jb20vcmVub3duZWQtZWNvbm9taXN0LWV4cGxhaW5zLXdoeS1iaXRjb2luLWlzLXRoZS1hbnN3ZXItZm9yLXRvZGF5cy1maW5hbmNpYWwtbGFuZHNjYXBlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "Renowned economist explains why 'Bitcoin is the answer' for today's financial landscape - Finbold - Finance in Bold",
        "content": "Best-selling economist and author of The Bitcoin Standard, Saifedean Ammous, has expressed his belief that Bitcoin (BTC) could solve challenges facing the current financial system.\n\nAccording to Ammous, Bitcoin is a superior form of money compared to traditional currencies, while emphasizing the urgency of adopting the maiden digital asset, he said in an interview with London Real on July 2.\n\nInterestingly, the author pointed out that before turning to Bitcoin as a possible solution, he believed gold was the answer, banking on the precious metal’s ability to hedge against inflation.\n\n“I was a gold bug, I thought gold was the answer, and I was going around trying to tell people that the FED is doing something bad and inflation is bad. <…> All these things before Bitcoin fell on deaf ears. <…> I tried to tell this to somebody, and I convinced them to vote for somebody who’s going to reinstate the gold standard, and that’s just a completely dead end,” he said.\n\nAmmous also criticized the existing financial system, describing it as a broken technology designed to facilitate government exploitation and enable rampant inflation.\n\nThe danger of money printing\n\nHe argued that the traditional money-printing approach merely exacerbates the problems it attempts to solve, leading to a cycle of devaluation and economic turmoil, hence the need to opt for Bitcoin.\n\n“Until Bitcoin comes about, it’s a very lonely, desperate struggle, and then Bitcoin comes about, and you no longer need to convince people. <…> The only working alternative to Bitcoin is that you’re going to have your money destroyed by a government that can print it, and we no longer need to convince people of this anymore,” he added.\n\nHighlighting Bitcoin’s distinct advantages, Ammous emphasized its decentralized nature and fixed supply. With only 21 million Bitcoins ever to be mined, he believes that Bitcoin safeguards against hyperinflation and government interference.\n\nUS dollar future sustainability\n\nIn this line, he projected that the United States dollar sustainability is almost over, although he failed to offer a timeline for when the currency would survive.\n\n“For me, the dollar is over. That doesn’t matter anymore. Whatever happens with the dollar. I used to live in Lebanon when hyperinflation happened, and because of Bitcoin didn’t matter to me when the Lebanese currencies Ponzi scheme blew up,” he added.\n\nAdditionally, the economist underscored individuals’ security and control over their Bitcoin holdings, noting that no one can arbitrarily create more or confiscate existing Bitcoins.\n\nAccording to Ammous, embracing Bitcoin can empower individuals to lead more prosperous lives. He encouraged people to engage in productive activities, spend less than they earn, and save the rest in Bitcoin. By doing so, he argued, individuals can secure their wealth against the long-term erosion caused by inflation and ensure financial independence.\n\nIn the meantime, Bitcoin continues to hold above the $30,000 support level. By press time, the asset was trading at $30,250 with weekly corrections of about 1%.\n\nWatch the full interview below:"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYm9sZC5jb20vZXhwZXJ0cy13YXJuLTIwMjQtYml0Y29pbi1oYWx2aW5nLXRvLXNwZWxsLWRlYXRoLWtuZWxsLWZvci1jcnlwdG8tbWluZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "Experts warn 2024 Bitcoin halving to spell 'death knell' for crypto miners - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) halving is among the most anticipated events in the cryptocurrency space, with the potential to help the maiden digital asset price rally to new heights. Indeed, previous halvings have partly contributed to Bitcoin’s rally to record valuations, and the upcoming 2024 event carries similar expectations.\n\nAlthough the halving could spell good fortunes for Bitcoin and the general cryptocurrency market in terms of price, the event is also projected to sound the ‘death knell for certain’ miners, Bloomberg reported on July 8.\n\nNotably, concerns about the mining economics leading up to the next halving have emerged. In this line, Jaran Mellerud, a crypto-mining analyst at Hashrate Index, predicts that the higher costs of the process will impact most miners.\n\n“Nearly half of the miners will suffer given they have less efficient mining operations with higher costs,” said Mellerud.\n\nFor instance, he indicated that the break-even electricity price for the primary mining machine is predicted to decrease from 12 cents/kWh to six cents/kWh after the halving. Mellerud added that around 40% of miners have operating costs exceeding this threshold, and miners with costs above 8 cents/kWh and smaller miners who outsource their rigs will face difficulties staying profitable.\n\n“If you count in everything, the total cost for certain miners is well above Bitcoin’s current price.<…> Net profits will turn negative for many miners with less efficient operations,” said Wolfie Zhao, head of research at TheMinerMag, a research arm of mining consultancy BlocksBridge.\n\nRising mining debt\n\nThe concerns come at a time the Bitcoin mining industry is operating in debt partly due to last year’s extended bear market and increased electricity costs. According to Ethan Vera, COO of Luxor Technologies, the global mining industry currently holds a debt ranging from $4.5 billion to $6 billion, a decrease from $8 billion in 2022. This debt includes senior debt, loans secured by mining rigs, and Bitcoin-backed loans.\n\nNotably, miners migrating from China to North America after the domestic mining ban in 2021 led to increased borrowing. Access to the capital market was limited for miners, making debt financing more readily available in the US, according to Zhao.\n\nAt the same time, rising competition among Bitcoin miners has reduced profit margins. Bitcoin miners are also proactively safeguarding themselves in anticipation of the halving.\n\nPreparation for halving\n\nThe miners are implementing strategies like locking in power prices, strengthening their financial reserves, and reducing investment activities. Despite the preparation, Texas-based Bitcoin miner Lotta Yotta CEO Tiffany Wang believes several operators will still be wiped out.\n\n“During the halving year, it is high risk. <…> It is better to save some fund in the account to keep the company running. <…> Everyone has to be prepared. Unfortunately, a lot of miners will eventually be driven out of the market,” said Wang.\n\nIt is worth noting that amid the concerns, in June, mining difficulty reached a record high, and maintaining profit margins after the halving, Bitcoin’s price would need to reach $50,000-$60,000 next year."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZmluYm9sZC5jb20vY2hhdGdwdC1wbHVnLWluLWNhbi1ub3ctc2VuZC1iaXRjb2luLXBheW1lbnRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "ChatGPT plug-in can now send Bitcoin payments - Finbold - Finance in Bold",
        "content": "As artificial intelligence (AI) saw a major comeback with the launch of ChatGPT and other chatbots, the technology has continued to expand rapidly, one of the most significant developments being the ability to buy, sell, and hold cryptocurrencies like Bitcoin (BTC).\n\nIndeed, software development firm Lightning Labs has recently unveiled a set of developer tools that allow AI models like those in OpenAI’s GPT series to send and receive Bitcoin on the crypto asset’s Lightning Network, according to the company’s announcement shared on July 6.\n\nCode snippet asking agent to create new Bitcoin address. Source: Lightning Labs\n\nAccording to the company’s tweet announcing the launch, the goal of efforts such as this one is to bring AI technology closer to the masses:\n\n“Using L402, a standard for API authentication with LN payments, and LangChain, a simplified AI app framework, we are opening up AI for All!”\n\n💥 BREAKING: ChatGPT now has a plug-in that can send Bitcoin Payments!\n\n\n\npic.twitter.com/CtQqzMr1Ut — Mister Crypto (@misterrcrypto) July 7, 2023\n\nWhat the toolkit does\n\nAs the Lightning Labs’ team explained, this toolkit aims to “enable the Lightning and AI developer communities to build global, inclusive, and out-of-the-box cost-effective LLM (Large Language Model) tooling which seamlessly incorporates Lightning and Bitcoin.”\n\nIndeed, ChatGPT is an example of an LLM, which refers to software trainable on large data sets and able to generate human-like responses to user prompts. However, according to the company, one of the major issues with current LLMs remains the lack of a native internet-based payment mechanism they could use.\n\nDue to this problem, they have to use less-than-ideal payment methods like credit cards, in which the end users bear the costs and which, in turn, restricts the use cases and limits general access to AI technology. Therefore, the company’s objective is to address this issue using Bitcoin’s Lightning Network.\n\n“We’re extremely excited about the new wave of innovation brought about with the latest wave of LLM models. With the L402 protocol and LangChainBitcoin, we’re able to ensure the open models can be accessed using an open payment system connected to the world’s set of open APIs.”\n\nMeanwhile, Bitcoin was at press time changing hands at the price of $30,225, having lost 1.26% to its value in the last 24 hours and declining 2.67% across the previous seven days but still clinging to the 12.70% gain on its monthly chart, as per the latest information retrieved on July 7.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vYmxvY2t6ZWl0LmNvbS9iaXRjb2luLWV0Zi13aGF0LWl0LWlzLWFuZC13aHktaXQtbWF0dGVycy1mb3ItYm90aC10cmFkaXRpb25hbC1hbmQtY3J5cHRvLWludmVzdG9ycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin ETFs: What It Is And Why It Matters Investors - Blockzeit",
        "content": "Traditional finance made a bold move into crypto recently with Blackrock, Invesco, WisdomTree, and Fidelity coming after Bitcoin ETFs. Consequently, the hype around these projects has sent Bitcoin and other crypto up a few percentage points.\n\nIn this article, we explore ETFs in general and Bitcoin ETFs, in particular, to understand where all the fuss is coming from.\n\n➕ What are ETFs?\n\n‘ETF’ is an acronym for exchange-traded funds. It exposes investors to an asset without the investor having to own the asset. It is designed to track the performance of a specific index, sector, commodity, or asset class. ETFs are popular among investors because they offer several advantages.\n\n???? Advantages of ETFs\n\nETFs provide diversification by holding a basket of securities, such as stocks, bonds, or commodities.\n\nThey offer liquidity as they can be bought and sold throughout the trading day at market prices.\n\nThey have lower expense ratios (operating expenses) compared to mutual funds because they are passively managed and aim to replicate the performance of an underlying index rather than actively selecting securities.\n\nETFs can be bought and sold through brokerage accounts, just like individual stocks. Investors can choose to hold ETFs for the long term as part of their investment portfolio or engage in short-term trading strategies.\n\n➕ What are Bitcoin ETFs?\n\nNow that we understand what ETFs are, we can relate to Bitcoin as an asset class. Bitcoin and Ethereum ETFs expose retail investors to Bitcoin without then owning or trading it. The investors enjoy a convenient, diversified, and cost-effective way to gain exposure to Bitcoin, without going through the hassle of trying to understand how blockchain works.\n\nETFs are where traditional finance and the blockchain industry meet – where smart money and dumb money exchange liquidity. Bitcoin ETFs are very coveted because of how volatile the price of Bitcoin is.\n\nOver the years, the United States Securities and Exchanges Commission (SEC) has used every tool in its arsenal to come after Bitcoin and cryptocurrencies. However, the young industry has ever so slightly evaded these attacks.\n\nSince traditional finance is highly regulated, institutions that want to start trading Bitcoin ETFs must get a license from the relevant regulatory authorities (AKA SEC).\n\n➕ Why are Bitcoin ETFs a Big Thing?\n\nAs explained above, Bitcoin ETFs are where liquidity exchanges hands. Traditional investors bring their hard-earned cash to the CME and use it to buy BTC derivatives. The owner of the BTC derivatives then uses the money to buy actual Bitcoin from the market. This raises BTC’s price and market cap exponentially.\n\nThis is how money flows in the crypto industry:\n\nOnce the ‘dumb money’ (Fiat) has bought Bitcoin, early BTC holders start selling BTC and buying large-cap cryptos. This pushes their prices up. In turn, those who held large caps begin selling them and buying midcaps, and so on.\n\nFinally, when the market cycle is over, the money flows back into Bitcoin from the low caps. Bitcoin, in this last phase, is just a conduit to cashing out since it is accepted by the majority of banks. By the time the fiat exits the cryptosystem, money had exchanged hands from TradFi investors to crypto investors.\n\nThis is what happened in 2017 and Bitcoin skyrocketed from $900 to $19,000. Now the market is entering a new cycle.\n\n➕Blackrock, Invesco, WisdomTree & Fidelity are coming after Bitcoin ETFs\n\nSince the 2017 crypto bull run, the United States has not readily approved another spot Bitcoin ETF – backed by Bitcoin. On top of that, the SEC, CTFC and other financial government agencies had been very vocal and anti-crypto.\n\nHowever, several large investment giants have filed for Bitcoin spot ETFs with the SEC. It seems like they might get approved.\n\nBefore the 2017 Bitcoin bull market kicked off, BTC was trading at around $1000 and was trudging along very slowly. Toward mid-2016, the media began to cover Bitcoin more and prices started to rise faster, by 2017, futures contracts began trading on the CME and many in the market felt like Bitcoin was becoming a genuine financial asset class.\n\nThe ‘dumb money’ finally had access to a new financial instrument with the blessing of the SEC, CFTC and mainstream media. Bitcoin flew off and hit $19,600 – a 1,349% increase.\n\nInvestment Giants’ Bid to Gatekeep Bitcoin and Crypto via ETFs\n\nThis time, however, things are different because Blackrock will partner with Nasdaq in a surveillance-sharing agreement to mitigate manipulation. Moreover, the giants ganging up to control the Bitcoin market through ETFs will inadvertently bring:\n\nMainstream Adoption: ETFs are familiar investment vehicles for many investors, and the availability of a Bitcoin ETF would make it easier for traditional investors to gain exposure to Bitcoin without having to directly purchase and store the cryptocurrency themselves.\n\nETFs are familiar investment vehicles for many investors, and the availability of a Bitcoin ETF would make it easier for traditional investors to gain exposure to Bitcoin without having to directly purchase and store the cryptocurrency themselves. Regulatory Approval: Approval of a Bitcoin ETF by the SEC would signify a level of acceptance and legitimacy for Bitcoin as an investment asset.\n\nApproval of a Bitcoin ETF by the SEC would signify a level of acceptance and legitimacy for Bitcoin as an investment asset. Accessibility and Convenience: Bitcoin ETFs would make it more accessible and convenient for investors to invest in Bitcoin. Instead of dealing with the complexities of purchasing and storing Bitcoin through cryptocurrency exchanges.\n\nBitcoin ETFs would make it more accessible and convenient for investors to invest in Bitcoin. Instead of dealing with the complexities of purchasing and storing Bitcoin through cryptocurrency exchanges. Risk Management: Bitcoin ETFs could offer risk management features, such as diversification and professional management.\n\nBitcoin ETFs could offer risk management features, such as diversification and professional management. Institutional Investment: Bitcoin ETFs could attract institutional investors who have been hesitant to directly invest in cryptocurrencies due to regulatory concerns, custody challenges, and compliance issues.\n\nFinal Thoughts\n\nWhile there is a chance Bitcoin ETFs might not last long and are only here to temporarily drive Bitcoin price up in cycles, their approval is greatly appreciated by those in the industry. This article is meant to help you understand what ETFs are and where you lie in the ultimate exchange of liquidity. Hopefully, if you are on the wrong side you are making arrangements to be on the receiving end by learning as much as you can about Bitcoin and cryptocurrencies before this bull cycle ends."
    }
]