[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdG9kYXkudGFtdS5lZHUvMjAyMy8wMS8yMC9uZXctY2xhc3MtZXhwbG9yZXMtdGVjaG5pY2FsLWFuZC1lY29ub21pYy1mb3VuZGF0aW9ucy1vZi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "New Class Explores Technical And Economic Foundations Of Bitcoin - Texas A&M University Today",
        "content": "A new course offered at Texas A&M University this semester is “The Bitcoin Protocol” in which students learn about the technical and economic foundation of the much-talked about cryptocurrency.\n\nThe first of its kind at Texas A&M, the class is open to accounting and computer science students and is being taught by Mays Business School Associate Professor of Accounting and Founder of the Mays Innovation Research Center Dr. Korok Ray.\n\n“Bitcoin is an interdisciplinary project, and I was pleased to see the Mays Business School and the College of Engineering adopt an interdisciplinary mindset in approving this class,” Ray said.\n\nBenefits To Students\n\nAlthough there are other blockchain classes offered at Texas A&M in computer science and computer engineering, Ray’s course is the first to focus specifically on Bitcoin.\n\nThe class will cover all aspects of Bitcoin, such as the underlying technology, the game theory, the macroeconomics, and the application of cryptography.\n\nRay — whose research interests are accounting, game theory and technology — said the class is primarily for undergraduates to provide hands-on experience with Bitcoin. “The students will learn to code portions of the Bitcoin protocol from scratch, which is in itself a great learning experience,” he said.\n\nLearning about this “emerging economy” will open opportunities for students, Ray said.\n\n“The Bitcoin economy is booming, especially in Texas,” he said. “This class can prepare students for the growing Bitcoin mining industry, much of it in Texas. On top of this, Austin is becoming a hub for Bitcoin developers.”\n\nFrom an academic standpoint as well, much can be gained, Ray said. “First, Bitcoin is a novel way of storing and transferring value that has vast implications for finance and economics,” he said. “Bitcoin builds on decades of science and is itself a comprehensive learning tool across multiple disciplines. And Bitcoin is a zero-to-one, radical innovation that emerged outside of the traditional corridors of power and influence, and is therefore a deeply inspiring story of human achievement.”\n\nCrypto Controversies\n\nCryptocurrencies like Bitcoin have both proponents and doubters, as any sweep of social media or cable news channels will reveal. One thing everyone seems to agree on is the current state of affairs — a so-called “crypto winter,” meaning the market is performing poorly. The highly publicized FTX fiasco arguably added flame to the fire.\n\n“The current crypto winter will prove the difference between a decentralized protocol like Bitcoin and a centralized company like FTX that is subject to fraud and abuse,” Ray predicts. “I am confident that Bitcoin will emerge out of these ashes, but don’t trust me on that — verify for yourself.”\n\nCross-discipline Collaboration\n\nRay said faculty in both Mays and Engineering are to be credited with the creation of the Bitcoin class, namely Scott Schaefer of the Department of Computer Science and Nate Sharp of the Department of Accounting.\n\n“Leadership like this is vital to exposing students to the frontiers of new innovation, which happens precisely in between existing academic disciplines,” Ray said."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMjAvYml0Y29pbi1oYXMtY2xpbWJlZC1tb3JlLXRoYW4tMTBwZXJjZW50LXRoaXMtd2Vlay1vdXRwZXJmb3JtaW5nLXN0b2Nrcy5odG1s0gFvaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDEvMjAvYml0Y29pbi1oYXMtY2xpbWJlZC1tb3JlLXRoYW4tMTBwZXJjZW50LXRoaXMtd2Vlay1vdXRwZXJmb3JtaW5nLXN0b2Nrcy5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin has climbed more than 10% this week, outperforming stocks - CNBC",
        "content": "Cryptocurrencies rose this week even as U.S. equities briefly retreated from their new year rally and a major crypto lender submitted a long awaited bankruptcy filing.\n\nBitcoin was last higher by about 12% for the week, according to Coin Metrics, while ether has risen 14%.\n\nBy comparison, two of the three major stock averages were on track to post a losing week, which has been shortened for the Martin Luther King holiday. The S&P 500 and Doe Jones Industrial Average were last down 0.9% and 2.9%, respectively, for the week. The Nasdaq Composite, however, has been the outperformer. It's up slightly for the week and has gained 5% for the year, leading the other big indexes.\n\nBitcoin and ether rose 2.73% and 2.15%, respectively, in the same four-day period.\n\n\"Bitcoin seems to be trading along with the Nasdaq and risk assets again, after the past months of decoupling,\" said Sylvia Jablonski, CEO and chief investment officer at Defiance ETFs. \"This is good news for crypto investors in that if inflation is falling, and the Fed is closer to the end than the beginning of economic tightening, risk assets will catch a breath of fresh air and perhaps lure investors back in.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDEvMTkvanBtb3JnYW4tY2VvLWphbWllLWRpbW9uLWJpdGNvaW4taHlwZWQtdXAtZnJhdWQtY3J5cHRvY3VycmVuY2llcy13YXN0ZS1vZi10aW1lLWJ1dC1ibG9ja2NoYWluLWRlcGxveWFibGUtdGVjaG5vbG9neS_SAZcBaHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzAxLzE5L2pwbW9yZ2FuLWNlby1qYW1pZS1kaW1vbi1iaXRjb2luLWh5cGVkLXVwLWZyYXVkLWNyeXB0b2N1cnJlbmNpZXMtd2FzdGUtb2YtdGltZS1idXQtYmxvY2tjaGFpbi1kZXBsb3lhYmxlLXRlY2hub2xvZ3kvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "JPMorgan CEO Jamie Dimon says Bitcoin is a ‘hyped-up fraud’ and cryptocurrencies are a ‘waste of time’—but blockchain is a ‘deployable’ technology - Fortune",
        "content": "Despite the ongoing Crypto Winter, Bitcoin supporters are certain that the future for the fledgling industry is bright. And so far this year, they’ve had reason to celebrate. Bitcoin’s price has jumped more than 25% in the past few weeks alone after a dismal 2022. But JPMorgan Chase CEO Jamie Dimon still isn’t a believer. At the World Economic Forum in Davos, Switzerland, on Thursday, Dimon bashed cryptocurrencies as a distraction.\n\n“I think all that’s been a waste of time and why you guys waste any breath on it is totally beyond me,” he told CNBC. “Bitcoin itself is a hyped up fraud. It’s a pet rock.”\n\nThis isn’t the first time Dimon has expressed his doubts about cryptocurrencies—or used a “pet rock” analogy to describe digital assets. The CEO has described Bitcoin a “fraud” since 2017; and after the blow-up of what was once the world’s second largest crypto exchange FTX late last year, he argued the entire industry was a “complete sideshow.”\n\nCNBC anchor Joe Kernen pushed back on Dimon’s claims that Bitcoin is a fraud on Thursday, arguing the cryptocurrency is a “store of value” that is “immutable” and “scarce,” noting its protocol indicates that there will only ever be 21 million coins.\n\n“Totally untrue. How do you know it’s gonna stop at 21 million? Maybe it’s going to get to 21 million and Satoshi’s picture is going to come up and laugh at you all,” Dimon quipped, referencing the pseudonym Satoshi Nakamoto that was used by Bitcoin’s anonymous creator, or creators.\n\nBut while Dimon doesn’t believe in cryptocurrencies, when it comes to the blockchain technology that they’re built on, he has a much more positive outlook.\n\n“That’s different,” he said on Thursday. “Blockchain is a technology ledger system that we use to move information. We’ve used it to do overnight repo, intraday repo, we’ve used it to move money, right? So that’s a technology ledger that we think will be deployable.”\n\nDimon and JPMorgan have leaned into blockchain technology since 2017, when the bank was one of 86 firms that helped create an open-source blockchain initiative called The Enterprise Ethereum Alliance. And as Dimon mentioned above, the company uses its own cryptocurrency, the JPM Coin, to carry out intraday repurchase agreements. But on Thursday, Dimon noted that the financial industry has been talking about using blockchain technology for 12 years and, to this point, he said “very little has been done.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTkvYml0Y29pbi1ob2xkcy1zdGVhZHktbmVhci0yMWstZXZlbi1hcy1lcXVpdGllcy1zbGlkZS_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzE5L2JpdGNvaW4taG9sZHMtc3RlYWR5LW5lYXItMjFrLWV2ZW4tYXMtZXF1aXRpZXMtc2xpZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Holds Steady Near $21K Even as Equities Slide - CoinDesk",
        "content": "“You very rarely see these V-shaped bottoms,” he told CoinDesk. “You see a rounding U-form, which just takes a little bit of time and there's a little bit of volatile in between. That's the best-case scenario. But I think you still need the right macro backdrop for risk assets in general to rise and the crypto can outperform.”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDEvMjAvb3Bpbmlvbi9iaXRjb2luLWdvbGQtaW5mbGF0aW9uLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Opinion | Is Bitcoin Replacing Gold? Maybe It’s Exactly the Opposite. - The New York Times",
        "content": "Jamie Dimon, the chief executive of JPMorgan Chase, recently had a few things to say about cryptocurrency. Bitcoin, he declared, is a “hyped-up fraud”; it’s a “pet rock.”\n\nTell us what you really think, Mr. Dimon.\n\nActually, Dimon seems to share the same view of Bitcoin that I and many other economists have had all along: The digital “currency” isn’t really a currency. That is, it can’t be used as a medium of exchange — there are very few things you can buy directly with Bitcoin — and it isn’t a stable store of value with reasonably predictable future purchasing power. So it’s basically useless — as Dimon says, it’s a pet rock.\n\nHowever, one concern that has long nagged at sophisticated crypto skeptics is that most of the negative things one could say about Bitcoin can also be said about gold. You can’t buy groceries, or even a house, with gold ingots. And historically the purchasing power of gold has been highly unstable. Here’s a chart from Macrotrends of the real price of gold — the price divided by the Consumer Price Index — since 1970:"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTkvYml0Y29pbi1icmlkZ2VkLXRvLWF2YWxhbmNoZS1zdXJwYXNzZXMtYnRjLWxvY2tlZC1pbi1saWdodG5pbmctbmV0d29yay_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzE5L2JpdGNvaW4tYnJpZGdlZC10by1hdmFsYW5jaGUtc3VycGFzc2VzLWJ0Yy1sb2NrZWQtaW4tbGlnaHRuaW5nLW5ldHdvcmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Bridged to Avalanche Surpasses BTC Locked in Lightning Network - CoinDesk",
        "content": "Once a BTC holder submits a request for WBTC, merchants perform verification procedures to confirm users’ identity and initiate the minting process by authorizing BitGo to mint WBTC. The merchant then transfers the user's BTC to BitGo in exchange for the newly minted wBTC, which the user can deploy in DeFi to generate additional yield. The user's underlying bitcoin is held in BitGo Trust in segregated cold storage accounts."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMTkvZGF2b3MtbXlzdGVyeS1vZi1vcmFuZ2UtYml0Y29pbi1jYXItcmV2ZWFsZWQtYW5kLW93bmVyLXNsYW1zLWNyaXRpY3MuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAxLzE5L2Rhdm9zLW15c3Rlcnktb2Ytb3JhbmdlLWJpdGNvaW4tY2FyLXJldmVhbGVkLWFuZC1vd25lci1zbGFtcy1jcml0aWNzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Orange bitcoin Mercedes owner at Davos hits back at critics, says not his car's fault people lost money - CNBC",
        "content": "The orange Mercedes was parked along the Promenade in Davos. Nobody in the vicinity saw who parked it there. The license plate says \"Kuna\" on it, which is the name of a Ukrainian cryptocurrency exchange. Michael Chobanian, the founder of Kuna, confirmed that the car belongs to him.\n\nDAVOS, Switzerland — The mystery of the orange bitcoin car, that was first spotted by CNBC on Monday at the Alpine resort of Davos, Switzerland, has been solved and the owner is not impressed with its critics.\n\nThe Mercedes, which sports a bitcoin logo in place of the car's iconic badge and the words \"in crypto we trust\" across the wheels, was parked outside the Blockchain Hub, a space run by Casper Labs along the Davos Promenade.\n\nThe Promenade is the main street in Davos where companies and governments have taken over shops and cafes for this week's World Economic Forum — an annual gathering of business leaders, celebs and global policymakers.\n\nLast year, crypto firms from all walks of life took over the place. But since the crypto market slide of 2022, there are far fewer crypto firms with flashy store fronts at Davos.\n\nCNBC asked people in the vicinity on Monday whose car it is but nobody saw who parked it. Two crypto executives who spoke to CNBC did not welcome the presence of the car, given the near $1.4 trillion wipeout of the market last year and the excesses of the industry are under scrutiny.\n\nOne exec said that the presence of such a car was not helpful for the industry's reputation which took a hit last year.\n\nThe license plate had \"Kuna\" printed on it, which is the name of a Ukrainian cryptocurrency exchange."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi10b3BzLTIxay1vdXRzaGluZXMtc3AtNTAwLWdvbGQv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8yMC9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLXRvcHMtMjFrLW91dHNoaW5lcy1zcC01MDAtZ29sZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin, Ether Rise Slightly After Genesis' Chapter 11 Filing - CoinDesk",
        "content": "Genesis Global Holdco LLC, the parent company of troubled cryptocurrency lender Genesis Global Capital, filed for Chapter 11 bankruptcy protection late Thursday after being pummeled by two of 2022's biggest industry collapses, those of hedge fund Three Arrows Capital and exchange FTX. In its filing, Genesis Global Capital, the partner firm of Gemini's defunct interest-bearing Earn program, estimated it has more than 100,000 creditors and between $1 billion and $10 billion in liabilities, as well as assets. Genesis owes over $3.5 billion to its top 50 creditors, including crypto exchange Gemini, trading giant Cumberland, investment firm Mirana, MoonAlpha Finance and VanEck’s New Finance Income Fund. Genesis and CoinDesk are both owned by Digital Currency Group, or DCG."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzIwL2JpdGNvaW4tbWluZXItMXRoYXNoLXNlbnQtYWxtb3N0LWFsbC1pdHMtYnRjLXRvLWJpbmFuY2Uv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDEvMjAvYml0Y29pbi1taW5lci0xdGhhc2gtc2VudC1hbG1vc3QtYWxsLWl0cy1idGMtdG8tYmluYW5jZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner 1Thash Sent Almost All Its BTC to Binance - CoinDesk",
        "content": "The conventional wisdom among crypto traders is that large BTC inflows from miners to exchanges like Binance is a bearish signal that miners may be preparing to sell BTC. The implication is that the recent crypto rally may have pushed prices to a level that’s too impossible to resist, especially with profit margins compressed in recent months by the crypto winter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvY3J5cHRvLW1hcmtldHMtdG9kYXktYml0Y29pbi1zdXJnZXMtYWJvdmUtMjJrLWdlbmVzaXMtaGFzLW92ZXItNWItaW4tbGlhYmlsaXRpZXMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvY3J5cHRvLW1hcmtldHMtdG9kYXktYml0Y29pbi1zdXJnZXMtYWJvdmUtMjJrLWdlbmVzaXMtaGFzLW92ZXItNWItaW4tbGlhYmlsaXRpZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Today: Bitcoin Surges Above $22K, Genesis Has Over $5B in Liabilities - CoinDesk",
        "content": ", which collapsed in the summer of 2022. That loss came out of the Genesis Asia Pacific unit (that also filed for bankruptcy), which managed Genesis’ lending relationship with 3AC. At the time of 3AC going under, Genesis had $2.4 billion in outstanding loans to the fund, of which Genesis was able to recover just half, according to the filing."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzIwL2NyeXB0by1tYXJrZXRzLWFuYWx5c2lzLWJpdGNvaW4tZXRoZXItdG9wLXdlZWtseS1sZWFkZXJib2FyZC1idXQtc29tZS1pbmRpY2F0b3JzLXN1Z2dlc3QtYS1tYXJrZXQtcmV0cmVhdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin, Ether Top Weekly Leaderboard, but Some Indicators Suggest a Market Retreat - CoinDesk",
        "content": "CNE’s decline departs from recent performance, and still remains the top performing sector for the month. The index itself is designed to capture price movements of assets within the virtual world, gaming, metaverse, art and social network universe. Notable assets include AXIE, APE and LPT."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjAvYml0Y29pbi1zb2Fycy1vdmVyLTIyay10by1yZWFjaC1mb3VyLW1vbnRoLWhpZ2gv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8yMC9iaXRjb2luLXNvYXJzLW92ZXItMjJrLXRvLXJlYWNoLWZvdXItbW9udGgtaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Soars Over $22K to Reach Four-Month High - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9hLWJ1bGxpc2gtY2FzZS1mb3ItYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "A Bullish Case for Bitcoin | Video - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMS8xOS9nZW1pbmlzLWJpdGNvaW4taW5mbG93cy1mcm9tLW90aGVyLWV4Y2hhbmdlcy1kcm9wcGVkLXRvLXJvdWdobHktc2l4LXllYXItbG93LWNyeXB0b3F1YW50LWRhdGEtc2hvd3Mv0gGVAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzE5L2dlbWluaXMtYml0Y29pbi1pbmZsb3dzLWZyb20tb3RoZXItZXhjaGFuZ2VzLWRyb3BwZWQtdG8tcm91Z2hseS1zaXgteWVhci1sb3ctY3J5cHRvcXVhbnQtZGF0YS1zaG93cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Gemini’s Bitcoin Inflows From Other Exchanges Dropped to Roughly Six-Year Low, CryptoQuant Data Shows - CoinDesk",
        "content": "“The $900 million hole exists because they trusted DCG to begin with, and I think the markets are sort of realizing that and reacting accordingly,” Teng said. “If customers previously lent to Gemini 10%, who then lent out to this lending desk conglomerate, who then lent out to degen trading firms, it’s just tough to be rest assured.”"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnNmZXhhbWluZXIuY29tL25ld3MvYml0Y29pbi1pcy1yYWxseWluZy1hZ2Fpbi1zZXJpb3VzbHkvYXJ0aWNsZV8zMjcwZjJkMC05ODNhLTExZWQtYWQzZS1mMzRmZjNkNjZhM2UuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin is rallying again. Seriously? | San Francisco News | sfexaminer.com - San Francisco Examiner",
        "content": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada\n\nZip Code"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL2phbWllLWRpbW9uLWVjb25vbWljLW91dGxvb2stcmVjZXNzaW9uLWJpdGNvaW4tZnJhdWQtcnVzc2lhLXVrcmFpbmUtd2FyLTIwMjMtMdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Jamie Dimon Says Bitcoin Is a Fraud, Warns of Russia-Ukraine War Fallout - Markets Insider",
        "content": "JPMorgan CEO Jamie Dimon slammed bitcoin as a \"hyped-up fraud\" speaking in an interview at Davos.\n\nDimon, a vocal crypto skeptic, has pointed to illegal activity in the industry to make his points in the past.\n\nHe also warned that war between Russia and Ukraine is the biggest threat to the global economy.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nJPMorgan CEO Jamie Dimon said bitcoin is a fraud, repeating his criticism of the world's largest cryptocurrency amid the market's struggles after the FTX collapse. The banking exec also delivered an ominous warning for the world economy as it nears the one-year mark since Russia's invasion of Ukraine.\n\nDimon has been a loud skeptic of crypto, blasting the industry as a \"complete sideshow\" after the collapse of FTX, Sam Bankman-Fried's failed crypto exchange. That's because crypto tokens are often tied to criminal activity, Dimon said, though his views of the underlying blockchain technology are more favorable.\n\n\"I think all that is a waste of time, and why you guys waste any breath on it is beyond me,\" Dimon said in an interview with CNBC on Thursday. \"Bitcoin itself is a hyped-up fraud. It's a pet rock,\" he said.\n\nDimon hit back at claims that tokens like bitcoin have built in scarcity that prevents it from being devalued, with just 21 million of the coins in existence. Those arguments are \"totally untrue,\" Dimon said.\n\nAdvertisement\n\n\"How do you know it's going to stop at 21 million? Everyone says that. Well maybe it's going to get to 21 million and Satoshi's picture is going to come up and laugh at you all,\" he added.\n\nDimon also gave a bearish prediction for the US economy this year, with inflation still well-above the Fed's 2% target and interest rates expected to rise past 5%, which market commentators have warned could spark a recession. He added that one of the biggest problems facing the global economy is the war between Russia and Ukraine, a conflict that's disrupted supply chains and spiked energy prices around the world.\n\n\"The real issue for the world is Russia, war, Ukraine, energy, trade, and that is serious. And that's still out there. Hopefully it will mitigate and go away, but it may not,\" he said. \"The only thing that matters for the future of the world is how this thing plays out.\"\n\nAs for signs of bullishness investors have been showing since the start of the year, Dimon isn't convinced a lasting rally is here. \"Markets have always been wrong,\" Dimon warned.\n\nAdvertisement\n\nDimon previously forecasted a mild recession to hit the US this year and stocks to drop 20%, though he said his team was preparing for a more severe downturn. He added that the Fed would likely need to continue its aggressive policy to sufficiently rein in inflation, predicting interest rates would push past 6%."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXVwLTIxLWJlc3Qtd2Vla2x5LXBlcmZvcm1hbmNlLWZlYi0yMDIxLWJ1bGwtcnVuLWJ1bGwtdHJhcC_SAW5odHRwczovL2Zvcmthc3QubmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi11cC0yMS1iZXN0LXdlZWtseS1wZXJmb3JtYW5jZS1mZWItMjAyMS1idWxsLXJ1bi1idWxsLXRyYXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin up over 21% in best weekly performance since Feb. 2021. Bull run or bull trap? - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, rose 21.7% from Jan. 11 to Jan. 18, trading at US$21,212 at 2 p.m. on Wednesday in Hong Kong. Ether gained 18% in the same timeframe, changing hands at US$1,576.\n\nWith Bitcoin above the US$21,000 mark, the world’s benchmark cryptocurrency has returned to its price level from before the Nov. 11 collapse of the FTX cryptocurrency exchange. BTC prices have since slipped, trading at US$20,935 at 4.30 p.m. on Friday in Hong Kong.\n\nKasper Vandeloock, the chief executive officer of quantitative trading firm Musca Capital, attributes the recovery to “slower inflation, interest from venture capitalists and the tech sector.”\n\nChris Bradbury, chief executive officer of DeFi capital management protocol Oasis, said inflation may have peaked in developed countries and this is the primary driver for crypto and traditional markets. “The feeling also seems to be that the expected recession this year won’t be as deep as initially thought,” he said in an email response to questions.\n\nBradbury said Bitcoin and Ether are rallying because of the bullish momentum in traditional markets. “Bitcoin, along with most crypto assets, are still heavily correlated and priced like tech stocks, and we have seen most of these also increase in the last few weeks too, but often crypto prices move at an exaggerated rate.”\n\nVandeloock said that the crypto market is seeing some relief after a difficult year: “Many traders got aggressively short after FTX’s insolvency and they are now looking to get out of their position,” wrote Vandeloock, adding that “Ether has been able to find a bottom sooner than BTC, because of the Merge and interest from DeFi. BTC is simply catching up to what ETH has already done.”\n\n“The impressive price action seen in Bitcoin is clear evidence that investors are now positively accumulating the coin,” Abraham Piha, chief executive officer of Tomi, an anonymous decentralized autonomous organization (DAO), wrote to Forkast. “With Bitcoin mining activity increasing, as evidenced by the recent all-time high in hashrate, it is clear that miners ran out of coins to sell, resulting in more coins for investors to buy.”\n\nSolana’s native token was the week’s biggest gainer among the 10 largest non-stablecoin cryptocurrencies, up 39.3% on the weekly chart, trading at US$22.\n\nThe global crypto market cap exceeded US$1 trillion on Jan. 15, for the first time since Nov. 8, according to CoinGecko data. Bitcoin’s US$409 billion market cap currently accounts for 39.86% while Ether makes up 18.5% of the total market cap.\n\nMetaverse tokens gain momentum\n\nDecentraland’s MANA rose 71.1% this past week to trade at US$0.69. This represented the biggest weekly gains in the entire crypto market, according to CoinGecko data. The Sandbox’s native token, SAND, also rallied 42.3%, to change hands at US$0.74.\n\n“The metaverse is the new buzzword in the broader digital and tech ecosystem, and related tokens are benefiting from it. Many investors believe that metaverse protocols will be a major entry point into Web3 for billions of people, so the underlying tokens’ appeal has grown even stronger this year,” wrote Piha.\n\nVandeloock attributes this surge to the low liquidity of metaverse coins: “People were looking to play altcoins since many were double-digit green over the last few weeks. These metaverse coins are illiquid and have low volume making them the perfect market to play at these times.”\n\n“The liquidity of metaverse tokens is incredibly low, and as always when there are fairly large market movements, you will see lower liquidity tokens have larger than average swings, however, it often isn’t sustainable,” wrote Bradbury.\n\n“If you look at Uniswap, SAND only has US$1.5 million of value locked, MANA even less at US$640,000 – so again, short-term views to try and find conclusions like this are very difficult. The real test will be if things like SAND and MANA can sustain the excess gains they achieved over the next 30-60 days against BTC and ETH,” added Bradbury.\n\n“As Bloomberg’s market strategist, Mike McGlone, correctly pointed out, the current massive Federal Reserve tightening is a significant selling point that has been driving the price of BTC and the market as a whole. With their positive fundamentals, many altcoins are also contributing to the underlying market push,” wrote Piha.\n\nWhat’s in store for next week?\n\n“Last week, the crypto market cap crossed US$1 trillion several times. We can expect the industry valuation to form support at US$1 trillion while pushing for new highs. However, investors should be wary of monetary tightening in the near term due to interest rate hikes around the world,” wrote Piha.\n\n“The biggest effects on the price of the markets last year came from highly unexpected events, such as 3AC, FTX and so on. It’s likely the recent gains that appeared over the last two weeks will pull back slightly though, this is often what we see during uncertain times – the main question will be if the markets can at least hold onto some of the gains made,” wrote Bradbury, adding that “there is still a lot of uncertainty in traditional markets,” and that the industry “has a lot of trust to get back from all of its issues last year involving centralized parties such as 3AC, FTX and Genesis.”\n\nDespite last year’s events rocking the trust in centralized crypto companies and the wider crypto industry, Bitcoin’s 23% rally in the week through Jan. 15 represents its best weekly performance since Feb. 2021. According to Bloomberg analysts, this usually signals the start of a bigger rally: “Weekly climbs of at least 20% occurred nine times in the past five years, after which the token added an average of 40% over three months.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZhY2VzLTE1ay1jcmFzaC1hcy11cy1zcGFya3MtZmluYW5jaWFsLW1lbHRkb3duLWFydGh1ci1oYXllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin faces $15K crash as US sparks 'financial meltdown' — Arthur Hayes - Cointelegraph",
        "content": "In his latest blog post released on Jan. 19, Arthur Hayes, the former CEO of the BitMEX exchange, predicted a “global financial meltdown” thanks to future United States economic woes.\n\nHayes: Crypto will “get smoked” in Fed pivot\n\nBitcoin’s current rally should likely not be taken as the start of a new bull run, Hayes says in the fresh treatise on U.S. macroeconomic policy, warning that crypto assets will “get smoked” when Federal Reserve policy flips from restrictive to liberal.\n\nWith U.S. inflation easing, the Fed is the focus of practically every crypto analyst this year as they estimate the likelihood of a policy “pivot” away from quantitative tightening (QT) and interest rate hikes to flat and then decreasing rates, and potentially even quantitative easing (QE).\n\nThis essentially involves a move away from draining the economy of liquidity to injecting it back in, and while that practice led to new all-time highs for Bitcoin beginning in 2020, the same phenomenon would not be plain sailing next time around, Hayes believes.\n\n“If a removal of half a trillion dollars in 2022 created the worst bond and stock performance in a few hundred years, imagine what will happen if double that amount is removed in 2023,” he wrote.\n\n“The reaction of the markets when money is injected vs. withdrawn is not symmetrical — and as such, I expect that the law of unintended consequences will bite the Fed in the ass as it continues to withdraw liquidity.”\n\nAs such, rather than a smooth transition away from QT, Hayes is betting on extreme circumstances forcing the Fed to act.\n\n“Some part of the US credit market breaks, which leads to a financial meltdown across a broad swath of financial assets,” he explained.\n\n“In a response similar to the action it took in March 2020, the Fed calls an emergency press conference and stops QT, cuts rates significantly and recommences Quantitative Easing (QE) by purchasing bonds once more.”\n\nThis in turn means “risky asset prices crater.”\n\n“Bonds, equities, and every crypto under the sun all get smoked as the glue that holds together the global USD-based financial system dissolves,” the blog post continues.\n\nCurrent estimates, as shown by CME Group’s FedWatch Tool, overwhelmingly favor the Fed lowering the pace of rate hikes at its next decision on Feb. 1.\n\nFed target rate probabilities chart. Source: CME Group\n\nPlanning a March 2020 rerun\n\nHayes is far from alone in being suspicious of Bitcoin (BTC) being a firm “buy” at present after two weeks of near-vertical price growth.\n\nRelated: Bitcoin sees new 4-month high as US PPI, retail data post ‘big misses’\n\nAs Cointelegraph reported, various commentators wager that new macro lows will still appear, with BTC/USD taking out its floor from the fourth quarter of 2022.\n\nThose taking a leap of faith and piling in now thus face serious risk before reward.\n\n“This scenario is less ideal because it would mean that everyone who is buying risky assets now would be in store for massive drawdowns in performance. 2023 could be just as bad as 2022 until the Fed pivots,” Hayes wrote, nonetheless calling that scenario his “base case.”\n\nIf that means a retest of the 2022 lows, the area between $15,000 and $16,000 will be a key zone of interest going forward.\n\n“I will know that the market has probably bottomed, because the crash that happens when the system temporarily breaks will either hold the previous $15,800 lows, or it won’t,” the blog post concludes.\n\n“It doesn’t really matter what level is ultimately reached on the down draft because I know the Fed will subsequently move to print money and avert another financial collapse, which will in turn mark the local bottom of all risky assets. And then I get another setup similar to March 2020, which requires me to back up the truck and purchase crypto with two hands and a shovel.”\n\nBitcoin faces a drop to $15,000 “or lower” as part of the mass risk asset capitulation, Hayes says.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC/USD was consolidating at $20,800 at the Jan. 19 Wall Street open, data from Cointelegraph Markets Pro and TradingView show.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzE5L2JpdGNvaW4tbWluZXItY2xlYW5zcGFyay1zdGFydHMtYnVpbGRpbmctaXRzLTUwbXctbWluaW5nLXNpdGUtaW4tZ2VvcmdpYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner CleanSpark Builds 50MW Additional Mining Capacity at Georgia Site - CoinDesk",
        "content": "Shares of CleanSpark have fallen almost 80% from its 2022 high of $12.53 to $2.53 at Wednesday's close, which is fairly in line with the performance of its peers."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAxLzIwL2NyYWlnLXdyaWdodHMtYmxhY2tsaXN0LXJlc2VtYmxlcy1iaXRjb2luLWtpbGwtc3dpdGNoLXNhdG9zaGktbmV2ZXItZm9sbG93ZWQtdGhyb3VnaC1vbi_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMS8yMC9jcmFpZy13cmlnaHRzLWJsYWNrbGlzdC1yZXNlbWJsZXMtYml0Y29pbi1raWxsLXN3aXRjaC1zYXRvc2hpLW5ldmVyLWZvbGxvd2VkLXRocm91Z2gtb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Craig Wright’s Blacklist Resembles Bitcoin ‘Kill Switch’ Satoshi Never Followed Through On - CoinDesk",
        "content": "“Imagine someone stole something from you. You can't get it back, but if you could, if it had a kill switch that could be remote[ly] triggered, would you do it?” Satoshi wrote in the Bitcoin Talk post. “Would it be a good thing for thieves to know that everything you own has a kill switch and if they steal it, it'll be useless to them, although you still lose it too? If they give it back, you can reactivate it.”"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1kaXBzLWJlbG93LXVzMjEwMDAv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvbWFya2V0cy1iaXRjb2luLWRpcHMtYmVsb3ctdXMyMTAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin dips below US$21,000 - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTkvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtYml0Y29pbnMtcmVsYXRpdmUtc3RyZW5ndGgtcmVhZGluZ3MtYXJlLWluLXJhcmUtdGVycml0b3J5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin's Relative Strength Readings Are in Rare Territory - CoinDesk",
        "content": "A 15,000 weekly decrease in the number of Americans filing for unemployment insurance points to a stubbornly tight labor market Fed officials want to see loosen. But signs of economic slowdown appeared in housing data, with building permits for December down 1.6% versus expectations for a 3.7% increase. Housing starts fell 1.4% to their lowest level in five months."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNvcnJlY3RlZC1idXQtYnVsbHMtYXJlLXBvc2l0aW9uZWQtdG8tcHJvZml0LWluLWZyaWRheS1zLTU4MG0tYnRjLW9wdGlvbnMtZXhwaXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price corrected, but bulls are positioned to profit in Friday's $580M BTC options expiry - Cointelegraph",
        "content": "Bitcoin (BTC) price has held above $20,700 for 4 days, fueling bulls’ hope for another leg up to $23,000 or even $25,000. Behind the optimistic move was a decline in inflationary pressure, confirmed by the December 2022 wholesale prices for goods on Jan. 18.\n\nThe United States producer price index, which measures final demand prices across hundreds of categories also declined 0.5% versus the previous month.\n\nEurozone inflation also came in at 9.2% year-on-year in December, marking the second consecutive decline from October's 10.7% record high. A milder-than-expected winter reduced the risk of a gas shortages and softened energy prices, boosting analysts’ hope of a \"soft landing.\" According to analysts, a soft landing would avoid a deep recession and possibly convince central banks to curb their interest rate hikes.\n\nThis week’s $580 million BTC options expiry on Jan. 20 looks like an easy win for bulls because the surprise seven-day, 23% rally above $21,000 caused most bearish bets to become worthless. The recent move has holders (or hodlers) calling a market bottom and the potential end to the bear market, but the options market might hold the answer.\n\nCan Bitcoin options help bulls secure the $20,000 floor?\n\nIt might seem like a distant reality right now, but Bitcoin was trading below $17,500 just seven days ago. As the weekly options expiry on Jan. 20 approaches, the bullish bets are about to pay off, while bears will see their options becoming worthless as the deadline looms over them.\n\nBears’ main hope is the possibility of the U.S. Federal Reserve raising interest rates by 50 basis points at the next meeting, but that won’t take place until Feb. 1. The latest data on U.S. retail sales have shown a 1.1% retreat in December, the second consecutive spending cut. The odds are increasingly favorable for a 25 basis point interest rate increase, signaling that the central bank's effort to curb inflation is achieving its expected results.\n\nIf bulls win on Jan. 20, they will likely add buying pressure and fuel the $20,000 support level.\n\nBitcoin bears were caught entirely off-guard\n\nThe open interest for the Jan. 20 options expiry is $580 million, but the actual figure will be lower since bears were decimated after Bitcoin breached $20,000. Bulls are in complete control, even though their payout becomes larger at $21,000 and higher.\n\nBitcoin options aggregate open interest for Jan. 20. Source: Coinglass\n\nThe 1.18 call-to-put ratio reflects the imbalance between the $150 million call (buy) open interest and the $125 million put (sell) options. If Bitcoin’s price remains above $17,000 at 8:00 am UTC on Jan. 13, less than $2 million worth of these put (sell) options will be available. This difference happens because the right to sell Bitcoin at $16,500 or $15,500 is useless if BTC trades above that level on expiry.\n\n$21,000 Bitcoin would give bulls a $220 million profit\n\nBelow are the three most likely scenarios based on the current price action. The number of options contracts available on Jan. 20 for call (bull) and put (bear) instruments varies, depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit:\n\nBetween $19,000 and $20,000: 7,500 calls vs. 1,700 puts. The net result favors the call (bull) instruments by $110 million.\n\n7,500 calls vs. 1,700 puts. The net result favors the call (bull) instruments by $110 million. Between $20,000 and $21,000: 800 calls vs. 8,100 puts. The net result favors the call (bull) instruments by $165 million.\n\n800 calls vs. 8,100 puts. The net result favors the call (bull) instruments by $165 million. Between $21,000 and $22,000: 10,600 calls vs. 200 puts. The net result favors bulls by $220 million.\n\nThis crude estimate considers the call options used in bullish bets and the put options exclusively in neutral-to-bearish trades. Even so, this oversimplification disregards more complex investment strategies.\n\nFor example, a trader could have sold a call option, effectively gaining negative exposure to Bitcoin above a specific price, but unfortunately, there’s no easy way to estimate this effect.\n\nRelated: Bitcoin sees new 4-month high as US PPI, retail data post 'big misses'\n\nBitcoin bears need to push the price below $20,000 on Friday to minimize the loss. On the other hand, the bulls can double their gains by pumping the price above $21,000 on Jan. 20 and profiting by $220 million.\n\nThe 7-day rally toward $21,300 liquidated $1.2 billion worth of leverage short (sell) futures contracts, so they might have less margin required to subdue Bitcoin's price.\n\nFor now, bulls are well positioned to profit from the BTC weekly options expiry and use the proceeds to defend the $20,000 support.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTIwL2NyeXB0by1sYXRlc3QtYml0Y29pbi1pbmNyZWFzZXMtdGhyZWUtYXJyb3dzLWZvdW5kZXJzLXdhbnQtc3RhcnR1cC1mdW5kaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Latest: Bitcoin Increases, Three Arrows Founders Want Startup Funding - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nIs crypto back? That’s one question Bloomberg editors and reporters discuss in another This Week in Crypto episode. Already, the year is packed with digital asset action. Bitcoin is up nearly 30% so far in 2023. Lots of smaller tokens have climbed even more than that. Suddenly, crypto enthusiasts are uttering words like FOMO — Fear of Missing Out — again.\n\n\n\nThen there are some crypto comebacks happening. Or, at least, attempted comebacks. The guys behind 3AC, Three Arrows Capital, the cryptocurrency hedge fund credited in some circles with launching the crypto winter, are seeking funding for a new startup. Crypto Twitter has not been kind."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1pcy1yZXNwb25kaW5nLXBvc2l0aXZlbHktdG8tbGF0ZXN0LW1hY3JvZWNvbm9taWMtZGF0YS_SAWtodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2JpdGNvaW4taXMtcmVzcG9uZGluZy1wb3NpdGl2ZWx5LXRvLWxhdGVzdC1tYWNyb2Vjb25vbWljLWRhdGEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Is Responding Positively to Latest Macroeconomic Data - ETF Trends",
        "content": "Bitcoin’s price saw a lot of flash rallies last year that only led to more downward price pressure. The new rally to start the new year, however, could actually have legs, as it responds positively to macroeconomic data.\n\nUp over 25% to start the new year, bitcoin’s recent price rally is following strength in traditional financial assets like stocks and bonds. This continues last year’s trend when bitcoin mirrored stocks and bonds on the way down amid rising inflation, but while the trend has reversed, bitcoin has followed.\n\n2022 ended with inflation showing a modest retreat, giving risk assets a boost as the expectation is that the U.S. Federal Reserve will start scaling back on interest rate hikes. That, in effect, is bringing the dollar down and potentially bringing more capital to riskier assets like bitcoin.\n\n“We are seeing the dollar put in a top, inflation easing, interest rate hikes slowing down – all pointing to markets getting more risk-on over the next few months,” said Vijay Ayyar, vice president of corporate development and international at crypto exchange Luno, in a CNBC report.\n\nThe ICE US Dollar Index and bitcoin’s latest price movements show restored confidence in risk assets again. The index is down 2% while bitcoin has risen close to 20% within the past month, highlighting the early strength in the new year.\n\nInvestors Leaving FTX Collapse in the Past\n\nLast year’s collapse of cryptocurrency exchange FTX certainly dashed any hopes of a holiday rally as 2022 was winding down. The collapse shook investors’ confidence and kept prospective market entrants at bay who were looking at potentially investing in bitcoin at the current low price.\n\nNonetheless, the early 2023 rally could be a sign that investors are ready to put the FTX collapse behind them. With dissipating inflation and less interest rate hikes, that could continue to fuel a risk-on rally that could feed into higher bitcoin prices.\n\n“Bitcoin looks to have recoupled with macro data as investors shrug off the FTX collapse,” James Butterfill, head of research at digital asset management firm CoinShares, told CNBC.\n\n“The most important macro data investors are focussing on is the weak services PMI and the trending down of employment and wage data,” Butterfill added. “This coupled with downwards trend in inflation has led to improving confidence, while it comes at a time when valuations for Bitcoin … are close to all time lows. The prospect of looser monetary policy off the back of weaker macro data and low valuations is what has led this rally.”\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NlbGxpbmctdGhlLXRvcC1wZXRlci10aGllbHMtdmMtZmlybS1tYWRlLTEtOGItZnJvbS1jcnlwdG_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Selling the Top: Peter Thiel's VC Firm Made $1.8B From Crypto - Blockworks",
        "content": "Billionaire Peter Thiel’s Founders Fund made a timely crypto trade last year.\n\nThe venture capital firm sold most of its cryptocurrency holdings before last year’s market crash, pulling in $1.8 billion from the trade, the Financial Times reported on Thursday.\n\nThe fund, known to invest in groundbreaking technologies, built a position in crypto over time. It made its first bitcoin investment in 2014, and a majority of its crypto holdings were made up of the original cryptocurrency, partners of the fund told TechCrunch in March last year.\n\nFounders Fund, which has $11 billion in assets under management, sold a big chunk of its crypto at the end of March 2022, a source told the FT. Bitcoin traded around $41,976 at the time, down around 40% from its all-time high.\n\nThat well-timed trade was made before the crash of algorithmic stablecoin TerraUSD (UST) in May, which marked the start of the crypto market carnage.\n\nA representative for Founders Fund didn’t return Blockworks’ request for comment by press time.\n\nNotably, Thiel made a pro-bitcoin speech just a month after his fund reportedly sold most of its crypto. He said the rise in bitcoin’s price was an implication that the “central banks are bankrupt” and that it signaled “the end of the fiat money regime.” He also spoke out against bitcoin’s critics, calling billionaire investor Warren Buffett “Enemy No.1” and a “sociopathic grandpa from Omaha.”\n\nWhen bitcoin was hovering near $60,000 in 2021, Thiel reportedly said that it was a sign the US political system was not stable. “I don’t know that you should put all your money into bitcoin at $60,000 a bitcoin right now,” he said. “But surely the fact that it is at $60,000 is an extremely hopeful sign.”\n\nSeparately, Thiel said at an event in Miami, in October 2021, that he felt he was “underinvested” in bitcoin. He also suggested he had some hesitation in investing in it because he thought “the secret was already known by everybody,” then added that “I think the answers are still to go long” on bitcoin.\n\nCrypto wasn’t the only investment Founders Fund offloaded. Between 2020 and 2022, the fund had eight other big exits including Airbnb and Palantir, a move that allowed it to return about $13 billion to investors, the FT reported.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhvbGRzLXN0ZWFkeS1uZWFyLTIxay0yMTUyNDg5NDguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Holds Steady Near $21K Even as Equities Slide - Yahoo Finance",
        "content": "Bitcoin held steady near its most recent $21,000 perch, and a leading crypto analyst said the market had already priced in the looming bankruptcy filing of crypto brokerage Genesis Global Capital and other recent industry debacles stemming from the collapse of disgraced crypto exchange FTX .\n\nThe largest cryptocurrency by market capitalization was recently trading at about $20,980, up 0.8% over the past 24 hours, even as investors mulled conflicting economic reports.\n\n“Most of the negative news should be priced in” because Genesis has been in trouble since the end of last year, Edward Moya, senior market analyst at foreign-exchange market maker Oanda, wrote in a Thursday note.\n\nOn Wednesday, Bloomberg reported that Genesis, a CoinDesk sister company, was in confidential negotiations with various creditor groups, with Genesis warning it could seek bankruptcy protection if it fails to raise capital. Bitcoin’s price tumbled as low as $20,370, a roughly 5% drop from the previous day, after the U.S. Department of Justice foreshadowed an announcement that it was charging Hong Kong-based crypto exchange Bitzlato with laundering $700 million.\n\nBut the announcement turned out to be “anticlimactic, at least in contrast to what the markets were guessing would happen,” said Michael Safai, managing partner of crypto trading firm Dexterity Capital. Safai told CoinDesk that the crypto market's recent positive sentiment could lift further if institutional traders maintain BTC’s trading range between $20,000 and $21,000 over the next couple of days.\n\nEther (ETH) was recently changing hands at around $1,550, up 1.1% from Wednesday, same time. The CoinDesk Market Index (CMI) recently climbed 1.8%.\n\nMeanwhile, traditional markets continued to stumble this week, with the S&P down 0.7% for the day. The S&P, which has a hefty technology component, is off 2.1% for the past five days, as investors remain fretful about the prospect of recession and big banks kicked off the earnings season with mixed results.\n\nStory continues\n\nCrypto-exposed stocks were also varied: Exchange Coinbase (COIN) was down 1.5% for the day, while bitcoin miner Marathon Digital Holdings (MARA) was up 6.2%.\n\nBitcoin’s strong 2023\n\nThe dip of the past two days has hardly dented bitcoin’s sterling performance so far this year. BTC has gained 26% since Jan. 1, rising from weeks-long doldrums around $17,000.\n\nMartin Leinweber, digital assets product specialist at MarketVector Indexes, attributed bitcoin's recent rally to the weakening U.S. dollar, slower inflation and a short squeeze.\n\nAccording to Coinglass data, traders liquidated some $492 million of short positions on Jan. 13, sending BTC above $20,000.\n\nHowever, Leinweber said that it's still hard to call a market bottom because \"normally in a bear market violent rallies tend to fool investors into believing that this is a sustainable one,\" considering liquidity isn't fully returned yet.\n\n“You very rarely see these V-shaped bottoms,” he told CoinDesk. “You see a rounding U-form, which just takes a little bit of time and there's a little bit of volatile in between. That's the best-case scenario. But I think you still need the right macro backdrop for risk assets in general to rise and the crypto can outperform.”"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNubi5jb20vMjAyMy8wMS8xOS91cy9ub3J0aC1jYXJvbGluYS1jcnlwdG8tbWluZS1ub2lzZS13ZWlyLXd4Yy9pbmRleC5odG1s0gFaaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAyMy8wMS8xOS91cy9ub3J0aC1jYXJvbGluYS1jcnlwdG8tbWluZS1ub2lzZS13ZWlyLXd4Yy9pbmRleC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "How the blare of a crypto mine woke up this Blue Ridge Mountain town - CNN",
        "content": "Murphy, North Carolina CNN —\n\nWhen Judy Stines first heard about cryptocurrency, “I always thought it was smoke and mirrors,” she said. “But if that’s what you want to invest in, you do you.”\n\nBut then she heard the sound of crypto, a noise that neighbor Mike Lugiewicz describes as “a small jet that never leaves” and her ambivalence turned into activism. The racket was coming from stacks and stacks of computer servers and cooling fans, mysteriously set up in a few acres of open farm field down on Harshaw Road.\n\nOnce they fired up and the noise started bouncing around their Blue Ridge Mountain homes, sound meters in the Lugiewicz yard showed readings from 55-85 decibels depending on the weather, but more disturbing than the volume is the fact that the noise never stopped.\n\nMike Lugiewicz describes the noise generated by the nearby crypto mine as \"a small jet that never leaves.\" Julian Quinones/CNN\n\n“There’s a racetrack three miles out right here,” Lugiewicz said, pointing away from the crypto mine next door. “You can hear the cars running. It’s cool!” “But at least they stop,” Stines chimed in, “And you can go to bed!”\n\nCrypto mining noise This is the sound in front of Mike Lugiewicz’s garage. Source: CNN\n\nThe word “mine” evokes pickaxes and coal dust in this region, so at first, the neighbors around Murphy, North Carolina, had no idea that mining a so-called “proof of work” crypto coin is more like playing a computer game with billion-sided dice. Instead of shovels, modern miners need enormous amounts of server power to roll the winning number faster than their competitors around the world.\n\nThis unrelenting demand for electricity was one reason China banned cryptocurrency, touching off a virtual gold rush from Appalachia to New York’s Finger Lakes. Crypto miners began putting down stakes in places where power is cheap and affordable, and if land use or noise regulations even exist, enforcement is weak. The mine in Murphy is just one of a dozen in Kentucky, Tennessee and North Carolina owned by a San Francisco-based company called PrimeBlock, which recently announced $300 million in equity financing and plans to scale up and go public.\n\nBut a year and a half after crypto came to this ruby red pocket of Republican retirees and Libertarian life-timers, anger over the mine helped flip the balance of local power and forced the Board of Commissioners to officially ask their state and federal officials to “introduce and champion legislation through the US Congress that would ban and/or regulate crypto mining operations in the United States of America.”\n\n“I personally think that if we can get a bill into the system, other (North Carolina) counties will join,” newly elected Chairman Cal Stiles said after the motion was read. When it passed 5-0, the crowd cheered.\n\n“Oh boy, they wanted us so bad a year ago,” PrimeBlock co-owner Chandler Song replied via LinkedIn DM when asked about the move to outlaw his crypto mine. “It is unconstitutional, to say the least.”\n\nIn 2019, Song and his co-founder Ryan Fang made the Forbes “Big Money” 30 under 30 list which features young entrepreneurs with over $10 million in funding. According to the profile, they founded their first blockchain company, ANKR Network, in 2017 when they were in their early 20s.\n\nANKR was eventually folded into the umbrella company PrimeBlock and in the final quarter of 2021, they claimed “$24.4 million of revenue, and over 110 megawatts of installed data center capacity.” This came as Song and Fang teamed up with former Goldman Sachs investment banker Gaurav Budhrani to create a company with an “estimated enterprise value of $1.25 billion” with the hopes of selling public stock on the Nasdaq.\n\nA crypto mine sits in a field along a rural road in Murphy, North Carolina. Mike Belleme/The Washington Post/Getty Images\n\nA few weeks after that announcement, residents packed the Cherokee County Board meeting where representatives from the company were scheduled to appear, but soon learned that management had changed their minds after a power outage at another crypto site nearby.\n\n“When (the outage) was investigated, it was found out that the power outage occurred because someone shot, with a gun, one of the (service lines),” County Commission Chair Dan Eichenbaum told the room to groans. “As a result of that, the crypto mining people decided they weren’t going to come.” “They could have joined over video!” one resident said to the board in frustration after the clerk read the company’s statement explaining they canceled “for employee safety.”\n\nMonths later, Song told The Washington Post that he had received no noise complaints from Cherokee County and said he would build noise insulation walls and install quieter water-based cooling systems. But after erecting walls on only two sides of the mine, construction stopped and the dashed hopes of the community only poured more fuel on local anger as they headed to the polls.\n\nAn aerial view of Murphy, North Carolina. Julian Quinones/CNN\n\n“I’m old. I’m a senior citizen. Social media is not really in my bailiwick,” Stines said as she explained how noise pollution transformed her into an activist. “I like to be behind the scenes and I like to stir the pot. But I knew that we needed to win an election.”\n\nChandler Song went silent when presented with follow-up questions on LinkedIn, but the mine on Hershaw Road roars on as the Cherokee County attorney searches for ways to put legal teeth into a newly passed law against continuous noise without rankling liberty-loving landowners.\n\n“The Tennessee Valley Authority does not pursue cryptocurrency mines and it is not one of our target markets,” Scott Fiedler, a spokesman for the TVA told CNN. But he acknowledged that the federally owned utility that serves millions in seven states does not keep track of the mines using TVA power, and it’s up to local utilities like the Murphy Electric Power Board to decide who gets service and who gets cut in a blackout.\n\nRon Wright said when his power was cut this winter, the crypto mine stayed online. Julian Quinones/CNN\n\nThat last contingency brought even more bad blood and lost trust during the brutal winter storm that gripped much of the South and forced some of the first rolling blackouts in TVA history. While residents were plunged into cold darkness, they say the power-hungry mine kept humming.\n\n“They shut us down on Christmas Eve and Christmas Day every hour for anywhere from 15 to 45 minutes to an hour,” resident Ron Wright told CNN. “Well, once your power goes down, your heat pumps go off and pipes freeze. But less than one mile away is crypto, allowed to run on the low end. As soon as the power came back, boom! They’re cranking before we are.” Requests for comment from the Murphy Electric Power Board were not returned.\n\nBack on Harshaw Road, Mike Lugiewicz pointed to the For Sale sign in front of his house. “September of 2021, I think, is when they turned this on and my wife and I just shook our heads, said, ‘No, we’re out of here.’” He hopes to stay in the area and keep fighting alongside neighbors like Judy Stines until the quiet comes back.\n\n“I don’t really care what folks invest in,” Stines said with a sigh. “I do care about this noise that affects us every day, all day, all night. It’s never-ending.”\n\nCorrection: This story has been updated to correct a quote from Judy Stines."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpbmFuY2UtYW1vbmctdG9wLXJlY2VpdmVycy1iaXR6bGF0by_SAT5odHRwczovL2Zvcmthc3QubmV3cy9iaW5hbmNlLWFtb25nLXRvcC1yZWNlaXZlcnMtYml0emxhdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Binance among top Bitcoin receivers of Bitzlato, FinCEN says - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9odXQtOC1taW5pbmctY2VvLW9uLWNyeXB0by13aW50ZXItYml0Y29pbnMtcHJlc2VuY2UtYXQtZGF2b3MtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Hut 8 Mining CEO on Crypto Winter, Bitcoin's Presence at Davos 2023 - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLWNsZWFuc3BhcmstZXhwYW5kcy1vcGVyYXRpb25zLWluLWdlb3JnaWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin miner CleanSpark expands operations in Georgia - Cointelegraph",
        "content": "Bitcoin (BTC) miner CleanSpark is expanding operations in the state of Georgia, adding to its mining capacity despite the ongoing bear market.\n\nGroundbreaking on a new 50-megawatt Bitcoin mining facility in the city of Washington, Georgia, is underway, with expected completion in late spring, CleanSpark disclosed on Jan. 19. The nearly $16 million expansion is expected to increase the company’s hash rate by 2.2 exahashes per second, with total hash rate reaching as high as 8.7 EH/s.\n\nThe expanded facility will host up to 16,000 miners, including newly added Antminer S19j Pro and Antminer S19 XP models.\n\nExpansion alert: $CLSK has broken ground on phase 2 of our #WashingtonGA #bitcoin mining site! It will hold up to 16,000 miners.\n\n\n\nWith projected completion of the 50 MW in late spring, we expect our #hashrate to reach as high as 8.7 EH/s.\n\n\n\nMore: https://t.co/q03mUT4S2n pic.twitter.com/sTAylY3SKN — CleanSpark Inc. (@CleanSpark_Inc) January 19, 2023\n\n“This second phase more than doubles the size of the existing operations,” said CEO Zach Bradford.\n\nCleanSpark purchased its Georgia site in August before acquiring local mining facility Mawson Infrastructure Group the following month for $33 million. At the time, the company said it planned to support a mining fleet of up to 70,000 units in 2023.\n\nCleanSpark received approval to trade publicly on the Nasdaq stock exchange in early 2020. The following year, the company raised $200 million in capital via an equity offering.\n\nLike other publicly traded Bitcoin miners, shares of CleanSpark (CLSK) have declined sharply over the past year. Source: TradingView\n\nWith the price of Bitcoin plunging more than 76% peak-to-trough, miners have been forced to rethink their business strategies to survive in the long term. One of the industry’s biggest players, Core Scientific, filed for Chapter 11 bankruptcy in December. Mining outfit Greenridge, meanwhile, received a $74 million lifeline just to stay afloat.\n\nRelated: Crypto miner explains how Bitcoin mining stabilizes grids\n\nSome miners have thrived during the bear market by reducing energy costs and avoiding excessive leverage. In October, CleanSpark executive chairman Matthew Shultz told Cointelegraph that “Bitcoin mining is a potential solution for creating more opportunities for energy development.”"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJhbGx5LXByb3ZpZGVzLW11Y2gtbmVlZGVkLXJlbGllZi1mb3ItYnRjLW1pbmVyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price rally provides much needed relief for BTC miners - Cointelegraph",
        "content": "Bitcoin mining powers network transactions and BTC price. During the 2021 bull run, some mining operations raised funds against their Bitcoin ASICs and BTC reserves.\n\nMiners also preordered ASICs at a hefty premium and some raised funds by conducting IPOs.\n\nAs the crypto market turned bearish and liquidity seized within the sector, miners found themselves in a bad situation and those who were unable to meet their debt obligations were forced to sell the BTC reserves near the market bottom or declare bankruptcy\n\nNotable Bitcoin mining bankruptcies in 2022 came from Core Scientific, filing for bankruptcy, but BTC’s early 2023 performance is beginning to suggest that the largest portion of capitulation has passed.\n\nDespite the strength of the current bear market, a few miners were able to increase production throughout 2022 and on-chain data shows Bitcoin miner accumulation began to increase in December 2022 and momentum appears to be continuing into 2023.\n\nBitcoin’s rally to $22,000 improves miner margins\n\nThe 2023 Bitcoin rally which saw BTC price hit a yearly high of $22,153 on Jan. 20, a 17% 7-day increase, has significantly helped BTC mining operations.\n\nAn increase in Bitcoin price and the network’s hashprice are helping BTC miners that kept net positive balances at the end of 2022 which is improving business stability. In addition, now Bitcoin miners are mostly back in profit.\n\nPublic miners Bitcoin sold vs mined. Source: Hashrate Index\n\nWhile more miners are turning back on Bitcoin mining rigs, the difficulty is increasing which may hinder future upside. With conditions improving will Bitcoin miners continue to accumulate or continue the trend of selling?\n\nRecapping 2022, Jaran Mellerud a Bitcoin mining analyst for Luxor Mining said:\n\n“Between January and November, the public miners offloaded 51,180 bitcoin, while producing 47,284 bitcoin.”\n\nBTC hashprice, a metric that measures the market value of mining or computing power, provides insight into Bitcoin mining operations’ profitability.\n\nSince Jan. 1, 2023, hashprice is up by over 20% and on Jan. 19. Bitcoin mining’s profitability grew from $0.06 per Terra Hash per day (TH/d) to $0.07874 TH/d and this has benefited from BTC’s price rally. Hashprice has not witnessed the recent levels since early October 2022.\n\nBitcoin hashprice. Source: Hashrate Index\n\nAlthough Bitcoin mining profitability has improved since the start of 2023, the industry is still facing rough waters ahead. According to Nico Smid, co-founder of Digital Mining Solutions:\n\n“The recent increase in hashprice is positive, but many miners are still operating on thin margins. A year ago, the hashprice was at $0.22/TH/day. While the market has reached its lowest point, the current economic conditions for mining remain challenging.”\n\nBitcoin miners are still selling the bulk of their mined BTC\n\nBitcoin miners are benefiting from the uptick in price and data shows many are continuing to sell their rewards.\n\nBitcoin miner positions and revenue. Source: CryptoQuant\n\nThe most robust mining operations actually limited debt and expansion or used a strategy of selling minded BTC while in profit. Using self-reported data, Anthony Power, Bitcoin mining analyst for Compass Mining, compiled a list of miners reserves at the start of the year versus the end of the year.\n\nA year that started with so much promise and optimism and ended with several high profile bankruptcies, with more likely more to follow.\n\n\n\nHere's part 1 of #BTC Mining's year in review for @compass_mining which looks at some of the biggest stories in 2022https://t.co/cbFm8gFmR4 pic.twitter.com/Uyz6iitZRU — Anthony P⭕️wer (@cazenove_uk) December 23, 2022\n\nMarathon Digital, the top holder out of the listed Bitcoin mining companies, held 8,133 BTC at the end of December 2022. The company is planning to increase production based on hashprice profitability to further their advantage.\n\nMining difficulty could hinder profits in the future\n\nWith more Bitcoin miners turning their BTC rigs back on, the mining difficulty metric adjusted upward by 10.26% on Jan. 16. Bitcoin difficulty indicates the time and cost to mine BTC in order to receive rewards. The adjustment was the largest since October 2022 and the increase in difficulty makes it more expensive for Bitcoin miners to earn rewards through the proof-of-work (PoW) consensus mechanism.\n\nBitcoin mining difficulty. Source: Hashrate Index\n\nWith the upcoming Bitcoin halving event due in 2024, mining BTC will become even more difficult and possibly more expensive for miners, providing more stress on already thin margins. On the upside, the last halving event in 2019 was followed by a 300% gain for BTC the year before.\n\nWhile miners are currently seeing some relief after a tough year, potentially rough roads lie ahead. The business operations are seemingly improving with Bitcoin miners selling for profits rather than taking on debt against Bitcoin holdings.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZGVjcnlwdC5jby8xMTk2MTIvYml0Y29pbi1zdXBwbHktMjEtbWlsbGlvbi1qYW1pZS1kaW1vbi1qcC1tb3JnYW7SAU9odHRwczovL2RlY3J5cHQuY28vMTE5NjEyL2JpdGNvaW4tc3VwcGx5LTIxLW1pbGxpb24tamFtaWUtZGltb24tanAtbW9yZ2FuP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Jamie Dimon Thinks Bitcoin Supply Won’t Really Be Capped at 21 Million - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJP Morgan CEO Jamie Dimon remains a skeptic of almost everything Bitcoin—including the idea that its total supply is limited to 21 million coins.\n\n“How do you know it's gonna stop at 21 million?” he asked while discussing crypto with CNBC’s Squawk Box on Thursday. “Maybe it's gonna get to 21 million and Satoshi’s picture is gonna come up and laugh at you all.”\n\nThis isn’t the first time he has questioned Bitcoin’s holy number—a defining feature frequently highlighted by the asset’s biggest boosters. Theoretically, an absolute supply cap would give Bitcoin greater scarcity than any government-issued currency on earth, empowering it as a store of value.\n\nAD\n\nAD\n\n“You all read the algorithms? You guys all believe that? I don't know, I've always been a skeptic of stuff like that,” he said at an Institute for International Finance event last October.\n\nMany have, in fact, read Bitcoin’s algorithms—which are open source and freely viewable by the entire world. As pointed out by Jameson Lopp, co-founder of the Bitcoin wallet company Casa, Bitcoin’s supply cap is implicitly enforced by just 5 lines of code.\n\nTo be precise, Bitcoin is programmed to cut its supply issuance rate in half every 210,000 blocks, which is roughly every four years. Whereas 50 new BTC were issued per block in 2009, only 6.25 BTC come attached to each block today.\n\nThese events, called “halvings,” are programmed to occur just 33 times, after which Bitcoin’s block reward will be cut to zero. This should occur by the year 2141, assuming nothing changes before that time, Bitcoin developer Luke DashJr told Decrypt.\n\n\n\n“After 10 halvings, rounding errors begin to truncate,” he specified, referring to the problem of block rewards being unable to divide past Satoshis by the year 2049. “So if more precision is hardforked in, ideally it should be by 2049.”\n\nAD\n\nAD\n\nThe math behind these halvings works out such that Bitcoin’s supply cannot touch or surpass 21 million.\n\nThat said, anything enforced by code can technically be changed, as long as users consent to it. Many argue that the Bitcoin community will be forced to upgrade its software to produce more than 21 million coins, in order to provide consistent funds to support the mining industry.\n\n2/ Bitcoin has never generated meaningful transaction revenue relative to its security budget, heavily subsidizing security with block rewards. The current model is unsustainable, weakening its likelihood of becoming the global reserve currency. — Dan Smith (@smyyguy) January 10, 2023\n\nWhile Bitcoin’s supply is limited, it is still infinitely divisible. Tiny units of the currency could still be used for small transactions, even if its price were to enter the seven-figure range."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1pbi1hLXVuaXZlcnNpdHktZG9ybS1hLWNvb2xlci1idGMtc3RvcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin mining in a university dorm: A cooler BTC story - Cointelegraph",
        "content": "The humble university dorm is a place for students taking their undergraduate degrees to study, rest, make new friends, host wild dorm parties and, of course, mine Bitcoin (BTC).\n\nA master’s student in market research and self-described “data guy,” Blake Kaufman, has hooked up an S9 Bitcoin miner to the Bitcoin network.\n\nHe won the S9 miner in a raffle at a mid-Michigan Bitcoin meetup and immediately set about learning how to use it.\n\nBlake has consistently shown up to every https://t.co/2Q6OuIwW4O event with at least one friend, a tremendous attitude, and unmatched enthusiasm.\n\n\n\nGlad you won the S9 raffle!\n\n\n\nHash away at those KYC free sats, and enjoy the heat this winter! https://t.co/AQNzDjnDGC — Mid-Michigan Bitcoin (@517Bitcoin) November 17, 2022\n\nDuring a video call with Cointelegraph, Blake joked that he knew next to nothing about mining prior to the raffle. The moment he won, he raced to the nearest place offering a power cable and an ethernet connection to try it out, his dad’s office.\n\n“We turned it on, never hearing one [an S9] before. And if you know, when they start, they immediately rev up to 100% and we’re all just in the room like — oh my gosh — this thing is loud! We ran it for probably two hours and we walked into that office and it was hot.”\n\nThe hot and noisy realization kicked his brain into gear. The Michigan winter was fast approaching and his university provides free electricity. Why not mine Bitcoin from a dorm and take advantage of the waste heat? There was one minor but audible hurdle to overcome. “How can we fix the noise,” he questioned.\n\n“I just looked up online, like, how to noise cancel S9, and this picture of a cooler on Pinterest popped up. Me and my Dad were like, ‘Let's build it. Why not?’ So we bought a $5 cooler on Facebook Marketplace and we had the tubes in our attic and we spent about two hours drilling holes and it ended up working.”\n\nThe pair constructed the Bitcoin mining cooler box, which now takes up residence in Blake’s dorm. The finished product would not look out of place in any dorm room and is “actually quieter than an air conditioning unit,” he explains.\n\nTwo angles of the cooler-encased Bitcoin miner.\n\nBut aren’t there rules against this sort of thing at university? Won’t the energy-hungry Bitcoin miner put a dent in the university’s electricity overhead?\n\n“So the miner is about 900 watts an hour, a mini fridge is about 60 to 100 watts a day. So it’s pulling a decent amount of electricity there. I looked up all the rules and it didn’t say anywhere you couldn’t mine a Bitcoin or use a Bitcoin miner. So if they say you can’t do this, I’d be like, okay, you didn’t say I couldn’t.”\n\nIn a nutshell, Blake’s not breaking any rules. What’s more, one miner in one dorm in a large university home to thousands of students is unlikely to raise suspicion. It’s an ode to the famous saying attributed to Rear Admiral Grace Hopper that sometimes, “It is better to ask for forgiveness than permission.”\n\nThe ASIC S9 now whirrs away, generating roughly 0.000001 BTC or 100 satoshis — the smallest amount of a Bitcoin — per Bitcoin block, which occurs on average every 10 minutes. It translates to “about a dollar a day” in fiat-money terms. It’s a paltry amount but not to be sniffed at as a student.\n\nBlake’s total outlay to start his Bitcoin mining venture was a coolbox and a few cables at less than $20 and he can probably reuse the cooler come summertime.\n\nThe mining cooler interior.\n\nIncidentally, Blake’s next challenge is to work out what to do when the weather improves and the mercury rises. Peak summer days in Michigan can hit 95 degrees Fahrenheit (35 Celsius). As a result, the outside air temperature will not cool the miner, a vital part of its operation:\n\n“So I'll have to figure out something, maybe put it in a box of ice cubes and then something like that. I don't know yet.”\n\nBlake has already considered using the Bitcoin miner to heat his family home after graduation. The idea, Blake explains, is to experiment with whether he can offset the gas cost at home and make it profitable. “It’s just unfortunate because, in Michigan, our electricity cost is $0.14 a kilowatt hour.”\n\nMichigan’s energy costs are relatively high in the United States, as shown by a darker purple color. Source: Chooseenergy.com\n\nElectricity and heating costs are higher in Michigan than in energy-producing states like Texas. Using the waste heat from Bitcoin mining could be a way of offsetting the energy costs.\n\nRelated: The Bitcoin shitcoin machine: Mining BTC with biogas\n\nIndeed, tapping into Bitcoin miner waste heat is a growing trend, particularly prevalent for at-home or “chicken shack miners,” as they’re known. BTC Gandalf from the Braiins marketing team told Cointelegraph:\n\n“Chicken shack” miners are the backbone of the Bitcoin network hash rate. It’s incredible to see all the different ways they come up with to mine. They provide an invaluable service in keeping hash rate decentralized.”\n\nArmed with oodles of Bitcoin knowledge, Blake has since tried to orange pill his classmates and even professors. Unfortunately, some of them hold the belief that “Bitcoin is a scam.” He has taken it upon himself to set the record straight:\n\n“I’m emailing those teachers being like, Hey, office hours, when are they? Let’s have a chat. You can’t just come out and say Bitcoin is a scam with a Bitcoiner in the room.”\n\nIn the meantime, the S9 is whirring away in his dorm room, contributing to a network Blake strongly supports and generating 100% “free money.“\n\nWell, “Other than the $30,000-a-year tuition I pay, but it’s 100% free electricity,” he joked."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXN1aXNzZS1leHBsYWlucy13aHktc3dpc3MtaXMtYS1jcnlwdG8tcGl2b3QtcG9pbnQtZGF2b3MtMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Suisse explains why Swiss is a crypto pivot point: Davos 2023 - Cointelegraph",
        "content": "Switzerland is a “pivot point” for crypto adoption in Europe and continues to be the “center point of the next stage of institutionalization,” said Dr. Dirk Klee, CEO of Bitcoin Suisse.\n\nKlee divulged why Switzerland is still the top spot for crypto in Europe and will continue to attract institutional investors in an exclusive Cointelegraph interview in Davos, Switzerland.\n\nWe have boots on the ground in Davos! Our reporter @gazza_jenks speaks to Dr. Dirk Klee, CEO of @BitcoinSuisseAG about Switzerland and the adoption of cryptocurrency at the @wef. #CTWEF23 pic.twitter.com/ka00dvWpVz — Cointelegraph (@Cointelegraph) January 18, 2023\n\nIn discussion with Cointelegraph reporter Gareth Jenkinson, Klee explained:\n\n“A lot of trust has been destroyed and eroded in the last year and we want to be kind of the center point of the next stage of institutionalization, making the place more accessible, easier to use, but also safer.”\n\nFounded in 2013, Bitcoin Suisse is one of the oldest Bitcoin (BTC) and crypto companies specializing in asset storage, including “custody solutions deep in the Swiss mountains,” stated Klee.\n\nSwitzerland is a well-known safe haven for crypto in Europe. The landlocked country is recognized for its role in the inception of Ethereum and is home to Crypto Valley — a favorable environment for blockchain and cryptocurrency companies.\n\nSwitzerland is known for “Crypto Valley,” in the canton of Zug.\n\nSwitzerland also boasts the Bitcoin and crypto-friendly city of Lugano, which hosts an annual Bitcoin conference and has even onboarded McDonald’s into accepting Bitcoin Lightning payments.\n\nRelated: Putting carbon credits on blockchain won’t solve the problem alone: Davos\n\nHowever, even in Switzerland, crypto confidence took a knock in 2022, particularly in light of the FTX debacle and its contagion effects across the industry: “It’s a setback for the industry. It has destroyed a lot of trust and has also left a lot of investors harmed,” Klee explained.\n\nIn such an environment, it’s helpful to hark back to historic Swiss values. Switzerland is still a “safe safe place to do business.\"\n\n“The Swiss finish, the Swiss quality is a narrative and is a quality sign that this industry needs because you need to have a trusted place.”\n\nThousands of crypto enthusiasts have flocked to the crypto and blockchain events at the World Economic Forum. Hosted at the seat of the Alps, in the Davos ski resort, it appears the overarching bear market has not disturbed the Swiss charm."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jLWMtYy1jb21iby1icmVha2VyLWJpdGNvaW4tZW5kcy1yaWRpY3Vsb3VzLTE0LWRheS13aW5uaW5nLXN0cmVha9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "C-C-C-Combo breaker: Bitcoin ends 'ridiculous' 14-day winning streak - Cointelegraph",
        "content": "The two-week-long Bitcoin (BTC) winning streak has finally come to an end, after the cryptocurrency formed its first red candle on Jan. 18.\n\nThe day prior, BTC was shaping up to match or even beat its November 2013 record of 15 consecutive days of positive price movement, the longest of such streaks in its history.\n\nWhile the record wasn’t beaten, Bitcoin did post the longest win streak since the 2013 record in a “ridiculous” run-up, according to some commentators on Twitter.\n\n#Bitcoin - One red daily candle doesn't erase 2 weeks of bullish green candles. We needed one already, that up only run was ridiculous. It's as bad as celebrating a bounce after missing a whole move down (I've done it). I expect you give the bears the same treatment. pic.twitter.com/LJIbBKbE8c — IncomeSharks (@IncomeSharks) January 18, 2023\n\nCointelegraph data shows Bitcoin neared a 2.4% loss over the day and was back under $21,000, a value it hadn’t reached since the bankruptcy of crypto exchange FTX in early November last year.\n\nRelated: Tucker Carlson outlines wild theory to explain Bitcoin price rise: ‘Maximum tin foil’\n\nThe primary cause for the negative price action appeared to be an ominous announcement by the United States Department of Justice (DOJ) earlier on Jan. 18, saying it would “announce an international cryptocurrency enforcement action.”\n\nMany speculated it could be against a major exchange or crypto company, but it turned out the action was against a little-known exchange called Bitzlato based in Hong Kong with ties to Russia. The exchange’s founder, Anatoly Legkodymov, was also arrested."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvY3J5cHRvLWRvai1uZXdzLWJpdGNvaW4tcHJpY2UtYjIyNjQ2MzkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin price plummets amid major DOJ crypto announcement - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThe price of bitcoin fell suddenly by 5 per cent in the space of an hour after the US Department of Justice revealed plans to make a major cryptocurrency-related announcement on Wednesday.\n\nThe world’s leading crypto dropped from $21,500 to around $20,500 ahead of the news, reversing an upward trend that had seen its price rise by nearly a third since the start of the year.\n\nThe price saw a slight recovery after the news was announced, which related to a crackdown on an illicit crypto exchange.\n\nDeputy Attorney General Lisa Monaco led the press conference announcing the action, describing it as a “significant blow” to the crypto crime landscape and for fraudsters and hackers operating within it.\n\nAnatoly Legkodymov, the alleged founder of the Bitzlato exchange, was arrested in Miami, Florida, on Tuesday and is scheduled to be arraigned in the US District Court for the Southern District of Florida later on Wednesday, the DOJ announced.\n\n“Institutions that trade in cryptocurrency are not above the law and their owners are not beyond our reach,” stated US Attorney Breon Peace.\n\n“As alleged, Bitzlato sold itself to criminals as a no-questions-asked cryptocurrency exchange, and reaped hundreds of millions of dollars’ worth of deposits as a result. The defendant is now paying the price for the malign role that his company played in the cryptocurrency ecosystem.”\n\nThe announcement comes at a time when Sam Bankman-Fried, the former boss of the collapsed crypto exchange FTX, faces charges of wire fraud, securities fraud and conspiracy."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNyb3dkLXNlbnRpbWVudC1oaXQtbXVsdGktbW9udGgtaGlnaC1hcy1idGMtcHJpY2UtdG91Y2hlcy0yMWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin crowd sentiment hit multi-month high as BTC price touches $21K - Cointelegraph",
        "content": "Bitcoin (BTC) climbed to a four-month high above $21,000 in the third week of January, embellishing trader’s hope. The market has seen the most substantial investor optimism since July due to the January BTC price rebound.\n\nAccording to data from crypto analytics firm Santiment, the trading crowd sentiment has touched its highest in six months and second highest bullish sentiment in the past 14 months. The data indicates that traders are treating Bitcoin’s price rebound as a signal of a possible bigger breakout in the near future.\n\nThe term “crowd/investor sentiment” describes how investors generally feel about a specific asset or financial market. It refers to the mood of a market, or the psychology of its participants, as expressed by activity and changes in the price of the asset exchanged in that market.\n\nBitcoin weighted social sentiment Source: Santiment\n\nThe chart above shows three major spikes in investor sentiment since 2021. The first major spike in sentiment came in November 2021, followed by the BTC price surge to a new all-time high of $68,789. The second major spike came in July 2022 amid hints from the United States Federal Reserve about possible inflation ease, followed by a minor price surge. While the price rise post-spike in crowd sentiments in July 2022 wasn’t very significant due to marketwide bearish sentiment, traders did buy the dip at $19,000.\n\nRelated: Bitcoin price rally over $21K prompts analysts to explore where BTC price might go next\n\nThe latest spike in crowd sentiment came after a prolonged winter in 2022. Market analysts believe the BTC price rebound could signify a market bottom. According to independent market analyst HornHairs, the time from bottom to top and top to bottom has remained constant since 2015 at 152 weeks and 52 weeks, respectively.\n\n$BTC #Bitcoin\n\n2015-2017 bull market: 1064 days\n\n2017-2018 bear market: 364 days\n\n\n\n2018-2021 bull market: 1064 days\n\n2021-*current* market low: 364 days\n\n\n\nDays left until the top if we just carbon copy the cycle timeframe again: 1001 days pic.twitter.com/KoNZxJRuy5 — HornHairs (@CryptoHornHairs) January 12, 2023\n\nThe run-up to the top and bottom of the prior cycles look surprisingly similar when examining the long-term price behavior of Bitcoin. What’s more intriguing is that the 2020 to 2021 cycle appears to follow a similar trend."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV5ZXMtMjEtNGstem9uZS1hcy1hbmFseXN0LXByZWRpY3RzLWJ0Yy1wcmljZS13aWxsLWNoYXNlLWdvbGTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin eyes $21.4K zone as analyst predicts BTC price will chase gold - Cointelegraph",
        "content": "Bitcoin (BTC) rose toward new multi-month highs on Jan. 20 as analysis predicted a new trading range above $18,000.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBitcoin price range \"well defined\"\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD testing but preserving support at $21,000.\n\nThe pair edged higher at the Wall Street open, in line with United States equities as the third trading week of an explosive January drew to an end.\n\nDespite misgivings over the rally’s fundamental strength, Bitcoin continued to avoid significant corrections, with exchange order book analysis revealing $23,000 as the next big resistance zone to crack.\n\n“I view the lack of BTC liquidity below $18k and above $23k as a lack of sentiment for those levels at this time,” on-chain monitoring resource Material Indicators wrote in part of commentary about the Binance order book setup.\n\n“Nothing changes sentiment like price moving through support or resistance, but for now, the trading range is well defined.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nAn accompanying chart also revealed significant bid support in place at just above the psychologically significant $20,000 mark.\n\nIn terms of short-term targets, popular trader and analyst Crypto Ed hoped for a trip to $21,500 before a turnaround with a downside target of $19,800.\n\n“I still believe that we will get there, and maybe we are already on our way over there,” he said in a YouTube update on the day.\n\nThe area around $21,400 was equally important for fellow trader CJ, who told Twitter followers that this would be a suitable place to “tag longs.”\n\nAnalyst: Bitcoin should \"close gap\" with gold\n\nZooming out, others focused on continued impressive moves by safe haven gold, which had hit a new nine-month high on Jan. 19.\n\nRelated: Bitcoin can pass $30K before setting new bear market low — forecast\n\nIn a Twitter debate, analysts eyed a potential continued game of catch-up between gold and Bitcoin, which researcher and data analyst James V. Straten argued had been a “mirror image” of each other in 2022.\n\n“My bet BTC closes that gap soon,” he said while discussing the market implications of Federal Reserve policy.\n\nStraten added that BTC/USD had already “retraced the entire FTX collapse and approaching the end of the narrative for DCG,” referring to ongoing problems for crypto finance conglomerate, Digital Currency Group.\n\nBTC/USD vs. XAU/USD 1-day line chart. Source: TradingView\n\nAs Cointelegraph reported, expectations previously called for a copycat move on Bitcoin after gold took an early lead in recovering from lows.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1wcmljZS1jcnlwdG8td2ludGVyLTIwMjMtcHJlZGljdGlvbi1iMjI2NTUwOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin is on the rise again as 'crypto winter' shows signs of thawing - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThe price of bitcoin is up by almost a third since the start of the year, leading to speculation that the prolonged ‘crypto winter’ is finally beginning to thaw.\n\nThe world’s leading cryptocurrency was trading above $21,000 on Thursday, pushing its market cap higher than $400 billion for the first time since November.\n\nThe latest gains come amid easing inflation and signs that the US Federal Reserves will slow interest rate rises over the coming months, leading to improved sentiment and an increased appetite for riskier assets like cryptocurrencies.\n\nEthereum (ETH), Ripple (XRP), Cardano (ADA) and Solana (SOL) have also seen significant gains in recent weeks, pushing the overall crypto market cap back towards $1 trillion.\n\nDespite the turnaround in fortunes, the global crypto currency market remains a long way off its peak of close to $3 trillion in November 2021.\n\nThe upward momentum saw short sellers lose hundreds of millions of dollars in the space of just a few days, according to a report from crypto investment service BitStacker.\n\nThose betting against bitcoin lost $386.74 million in liquidations between 10 to 16 January, the analysis found, with more than $140m lost on just a single day.\n\n“While it’s always sad to see traders losing money on their investments, the study does show that cryptocurrencies might finally be bouncing back,” said BitStacker analyst Kris Lucas.\n\n“2022 was a very tough year for cryptocurrencies with the collapse of several major exchanges, as well as the Terra stablecoin. However, the fact that bitcoin is starting to regain its value could suggest that the so-called crypto winter could soon be over.”\n\nView more\n\nA mini flash crash on Wednesday, which saw BTC drop by $1,000 in the space of an hour, demonstrated that the recovery is still in the fragile early stages, and could easily be shaken by some negative news.\n\nThe price dip came after the US government announced a press conference for some major crypto-related news, leading to fears that it could be damaging for the crypto space. The news turned out to be the dismantling of a crime network, and the price returned to a positive trajectory.\n\nThe stalled rally showed that it is too soon to know whether or not bitcoin has reached its lowest price point this cycle, though it is the most positive move for the crypto market in nearly a year.\n\nFavourable market conditions could see bitcoin begin to recapture some of its losses in 2023, according to Nigel Green, CEO of financial advisory firm deVere Group, who cites US inflation data in his forecast for the year ahead.\n\n“We are technically still in a bear market, but the signs are the bulls are beginning to take back control,” Mr Green told The Independent.\n\n“As the central banks begin to stop tightening the screws, and the cyclical upturn gets underway, cryptocurrencies such as bitcoin could outperform other asset classes. Knowing they are likely to be rewarded for doing so, many crypto investors are positioning themselves now for the pivot.\n\n“The ‘crypto winter’ is thawing amid growing signs that inflation is beginning to cool. Of course, the crypto market will not go in a straight line – no market ever does – but we expect the bears to go into hibernation and bulls are ready to run.”"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vcHJvcHJpdmFjeS5jb20vdnBuL2NvbXBhcmlzb24vYmVzdC12cG4tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "5 Best VPNs for Bitcoin Payments in 2024 - ProPrivacy",
        "content": "Paying for your VPN subscription with Bitcoin instead of a credit card is a good way to bolster your privacy at the time of purchase. However, not every VPN service accepts bitcoin and other cryptocurrencies (either directly or through an intermediary). In this guide, we have rounded up five of the industry's best services that also accept payment via cryptocurrency for anyone that wants to take an extra step to improve their online privacy.\n\nWhat are the best VPNs that accept Bitcoin?\n\nYou'll find our top VPN picks below – these services all accept Bitcoin payments, have been carefully vetted by our team of researchers, and come packed with privacy-enhancing features. Keep scrolling to check out our detailed reviews of each provider.\n\nExpressVPN - The best VPN for bitcoin payments. You get access to fast servers all over the globe with excellent encryption. TIP In our testing we checked that all ExpressVPN plans work for Netflix. The one year plan is the best value: three months free and a 30 day risk-free trial. NordVPN - The best value VPN for bitcoin payments, with a huge network of servers, superb encryption, and apps for all devices. Private Internet Access - The best secure VPN for bitcoin payments. Includes a proven no-logs policy and a full suite of customizable features. PrivateVPN - The cheapest VPN for bitcoin payments. Incredibly private and with zero-logs, lots of features, and strong encryption. Surfshark - The best multi-device VPN for bitcoin payments. Offers unlimited simultaneous connections and apps for all your devices.\n\n5 Best Bitcoin VPNs | In-depth analysis\n\nBelow we have listed the best VPN services that accept payment via Bitcoin, If you'd like any more information about these services, take a look at our in-depth review pages.\n\n1. ExpressVPN Editor's Choice | March 2024 www.expressvpn.com ExpressVPN is the best VPN for Bitcoin payments. Consistently quick and works with most major streaming services, and even offers a 30-day money-back guarantee. Pricing 12 months + 3 months FREE + Backblaze backup: $6.67/mth 49% OFF 6 months: $9.99/mth 1 month: $12.95/mth\n\nPros Accepts Bitcoin payments via BitPay Compatible with all devices – even routers! Superb OpenVPN encryption Works with in-demand streaming services Lots of advanced security features\n\nCons Subscriptions are comparatively expensive Only 5 simultaneous connections No free trial\n\nServer locations 160\n\nSpeeds 100.00 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.expressvpn.com\n\nExpressVPN Demo\n\nExpressVPN gives its customers the option to pay for a subscription with Bitcoin via BitPay, which is ideal if you're looking to stay as anonymous as possible! In addition, the service comes stuffed with security features that'll ensure that your personal details stay private. So, whilst an ExpressVPN isn't exactly a budget VPN, you're getting a quality service that consistently sets the bar for its industry peers – and you can try it without risking a single cent, thanks to a 30-day money-back guarantee.\n\nBrowsing with confidence, confidentially\n\nDigital security is going to be a priority for most folks interested in paying for their VPN subscription with Bitcoin – and ExpressVPN doesn't disappoint when it comes to safeguarding privacy. Strong OpenVPN encryption ensures that no third-parties (including your ISP, government, and network administrator) can take a peek at what you're doing online, and I'm glad to see that the ExpressVPN kill-switch, called Network Lock, is automatically activated when you boot up the VPN.\n\n\n\nExpressVPN customers paying with Bitcoin won't even need to reveal their real name\n\n\n\nAs you'd expect from a provider of ExpressVPN's caliber, it abides by a no-logs policy that has been independently audited, and should reassure Bitcoin investors that their connection logs, IP addresses, and browsing history are never stored, and can never be passed on to any nosey authorities. Furthermore, being based in the British Virgin Islands keeps ExpressVPN out of the reach of US and EU jurisdictions.\n\nA free web\n\nExpressVPN boasts an impressive server network with coverage across the globe in 104 countries . This is hugely important if you're going to be accessing streaming services that enforce geo-restrictions! Connecting to an ExpressVPN server is as easy as selecting the location from a list, and once you have, you'll likely be impressed by just how speedy the service is. Whenever I put ExpressVPN to the test, I find that pages load quickly and videos play smoothly, in HD, without any annoying buffering circles.\n\nCustomers will be able to browse the international catalogs of several in-demand streaming services; Netflix, BBC iPlayer, Amazon Prime, and Hulu included. ExpressVPN is also adept at unblocking any social media platforms that might be restricted or banned in your location (or workplace), so you can stay up to date with recent events and all your loved ones. The service's split tunneling feature comes in handy, too, if you'd like to stream geo-restricted content (or scroll endlessly through Twitter) whilst accessing local sites at the same time!\n\nQuality for a price\n\nFew VPN apps look as stylish as ExpressVPN's, frankly. They download in a flash and can be installed on pretty much any device you can imagine – and that includes smart TVs and consoles, as well as compatible VPN routers. ExpressVPN currently only allows 8 simultaneous connections, however, and other services are beginning to offer more for cheaper.\n\nExpressVPN is a premium provider with a premium price tag, and there's no getting around the fact – but you get what you pay for. ExpressVPN's security offering is stellar, and customers paying with Bitcoin won't even need to reveal their real name, seeing as a valid email address is all that's required. If you've got any burning questions or need help picking out which server suits your needs best, be sure to reach out to the ExpressVPN customer service team, available 24/7 via live chat and email. 2. NordVPN www.nordvpn.com NordVPN is the best value VPN for bitcoin payments. It provides watertight privacy, works with streaming services around the globe, and has a 30-day money-back guarantee. Pricing 24 months + 3 months FREE: $3.69/mth 70% OFF 12 months: $4.99/mth 59% OFF 1 month: $11.99/mth\n\nPros An audited no-logs policy and superb encryption Accepts Bitcoin, Ethereum, and Ripple payments Server coverage across the globe Superb 24/7 customer support\n\nCons Only 6 simultaneous connections Client UI sometimes has issues Torrenting servers could be easier to find\n\nAccepts Bitcoin? Yes\n\nServer locations 84\n\nSpeeds 58.69 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.nordvpn.com\n\nNord Demo\n\nNordVPN accepts payments via Bitcoin, Ethereum, or Ripple – so prospective customers have some real choice when it comes to paying for a subscription! Total online anonymity is an elusive content, but NordVPN can certainly shore up your security, with well-implemented encryption and a number of must-have features.\n\nAnd remember, you can take NordVPN for a test drive with its 30-day money-back guarantee.\n\nCustomize your privacy\n\nAs mentioned earlier, NordVPN gives cryptocurrency investors three ways to purchase their subscriptions with Bitcoin, and real privacy fanatics can even opt to pay for their plan with cash in a retail store! These options prove NordVPN's commitment to security and cement the provider as a top-notch choice, and its AES 256-bit encryption is practically uncrackable, too. In addition, NordVPN users get to choose from a number of protocols, though OpenVPN is the best pick for anyone who wants to keep a low digital profile. To that end, obfuscated (stealth) servers are available, and defeat deep packet inspection by making your VPN traffic look like regular HTTPS.\n\nNordVPN also has its very own customizable kill-switch and offers multi-factor authentication, which I very much recommend using, seeing as it'll make your account way harder for hackers to hijack. When it comes to logs, NordVPN's no-logs claim has been thoroughly audited, so you can rest assured that your identifiable details aren't being squirreled away somewhere. Plus, the service is based in Panama, where there are no mandatory data retention laws!\n\nBeat those restrictions\n\nAny VPN worth its salt will be able to unblock geo-restricted sites and services, and NordVPN is certainly one of the best in the business! Streaming fans will be able to enjoy international content from all the most popular services, like Netflix, BBC iPlayer, and Amazon Prime. In my experience, NordVPN has always been more than capable of handling HD streams – thanks to its unlimited bandwidth and servers in 61 countries . NordVPN's encryption also puts an end to ISP throttling, which can occur if your ISP figures out you're engaging in data-intensive tasks (like streaming or gaming) and decides to limit your bandwidth.\n\n\n\nNordVPN gives cryptocurrency investors three ways to purchase their subscriptions with Bitcoin\n\n\n\nIf you're more into torrenting, you'll be glad to learn that NordVPN supports P2P activity and port forwarding, so your downloads will be ready in a flash and won't land you in trouble.\n\nFeatures on features\n\nA single NordVPN subscription comes with a whole heap of features – double VPN is a particularly nice extra, and routes your traffic through two servers to double up your encryption. Similarly, NordVPN's ad-blocking CyberSec features remove annoying ads and malicious websites from your browsing sessions, so you won't have to worry about any accidental mis-clicks or lapses in judgement. Best of all, NordVPN subscriptions are pretty budget-friendly, especially if you invest in one of the long-term plans.\n\nThe service is fully compatible with most platforms, including Windows, Mac, Android, iOS, and Linux, and users get up to 6 simultaneous connections to play with. Similar to ExpressVPN, this isn't a wholly generous amount, but it's certainly enough to cover all of your most important devices. If you run into any trouble during the setup process, the NordVPN customer service team is on standby, 24/7, to help however they can! 3. Private Internet Access www.privateinternetaccess.com Private Internet Access is the most secure VPNs for Bitcoin. It is famously privacy focused, proving its no-logs claims in court, and offers a 30-day money-back guarantee. Pricing 24 months + 2 months FREE: $2.19/mth 82% OFF 6 months: $7.5/mth 38% OFF 1 month: $11.95/mth\n\nPros Accepts various crypto payments! OpenVPN and WireGuard protocols are available 10 simultaneous connections\n\nCons VPN newcomers might be overwhelmed by advanced options Based in the US No-logs policy has not been audited\n\nAccepts Bitcoin? Yes\n\nServer locations 84\n\nSpeeds 23.93 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.privateinternetaccess.com\n\nPIA Demo\n\nPrivate Internet Access (PIA) customers are spoiled for choice when it comes to Bitcoin payments! PIA subscriptions can be purchased via Bitcoin and Bitpay, Bitcoin Cash, and Ethereum and Litecoin – and to top it all off, PIA plans are modestly priced, especially if you opt for a long-term subscription.\n\nAs with all good VPNs, you'll be able to try PIA before you buy, with a 30-day money-back guarantee.\n\nIt's all in the name\n\nPIA has been a favorite of Reddit users for a long time, and has 10 years of experience in the VPN industry – and that's impressive longevity that's backed up by must-have security features. First and foremost, PIA's AES 256-bit encryption keeps all your browsing sessions secure, regardless of whether you're at home or on the go. OpenVPN and WireGuard protocols are available, and advanced users will even be able to dig in to some seriously customizable security options to tailor the service to their needs! However, even novice users will be able to make good use of the PIA kill-switch, which keeps your original IP address from leaking in the event of a VPN dropout.\n\n\n\nPIA accepts Bitcoin, Ethereum, and Litecoin payments\n\n\n\nI'm also glad to see that PIA is a no-logs provider that simply isn't interested in keeping hold of, or recording, user data. Less encouraging is the fact that this no-logs policy has not yet been audited – and the provider's US headquarters will surely make some users wary, too.\n\nSpeedy streaming\n\nPIA has a massive network of servers in 84 countries across the globe – though the service claims that it also has a \"domestic focus\" in the United States. This makes PIA a particularly good choice for anyone looking to unblock Netflix US, as well as other US-based streaming services, although PIA is more than capable of accessing all the most sought after streaming platforms! And, thanks to optimized servers and unlimited bandwidth, HD streaming is a breeze, online gaming goes smoothly, and P2P downloads finish in a flash (and torrenters should note that the provider also offers port forwarding).\n\nProtect your network\n\nCurrently, PIA is compatible with all devices; Windows, Mac, Android, iOS, and Linux included. The service also supports up to Unlimited simultaneous connections – which is double what you'd get with ExpressVPN or NordVPN! In the unlikely event that you have trouble getting PIA setup, you can call on the 24/7 customer service team to lend a hand.\n\nEarlier, I mentioned that cryptocurrency investors have a number of ways to pay for a PIA plan, and that's entirely true! The provider accepts Bitcoin, Ethereum, and Litecoin payments, and doubles down on its commitment to user privacy by allowing customers to purchase or renew subscriptions with gift cards. So, if you have a spare Starbucks, Walmart, or Best Buy gift card lying around, you might want to consider putting it towards a PIA plan! 4. PrivateVPN www.privatevpn.com PrivateVPN is the cheapest VPN for bitcoin payments. With exceptional security features and easy-to-use apps, as well as a 30-day money-back guarantee. Pricing 36 months: $2/mth 84% OFF 3 months: $6/mth 50% OFF 1 month: $9.99/mth 17% OFF\n\nPros Accepts Bitcoin payments Excellent OpenVPN encryption safeguards browsing sessions Supports P2P activity and even has port forwarding\n\nCons No-logs policy has not been audited A smaller pool of servers compared to industry peers No WireGuard support\n\nAccepts Bitcoin? Yes\n\nServer locations 200\n\nSpeeds 23.64 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.privatevpn.com\n\nPrivateVPN Demo\n\nPrivateVPN more than lives up to its name, and gives customers the option to purchase their plans with Bitcoins. A PrivateVPN subscription comes with some important security features and serious unblocking power, and we've always been impressed by how reliable this young service is, even when compared against long-standing industry titans.\n\nIf you'd prefer to try PrivateVPN for yourself, on your own devices, you can do so by making good use of the 30-day money-back guarantee. A 7-day free trial is also available, and won't require you to fork over any money at all!\n\nFeature rich\n\nThe last thing any cryptocurrency investor wants is their ISP monitoring every digital move they make. Luckily, PrivateVPN's AES 256-bit encryption can put a stop to this – and it's fantastic to see that the service also offers OpenVPN and IKEv2 protocols, which are widely considered to be secure, if somewhat resource-intensive. PrivateVPN's kill-switch works nicely with an auto-connect feature, meaning that if your VPN connection drops, you won't need to worry about your original IP leaking, and you'll be able to reconnect to the VPN in a blink.\n\n\n\nNetflix, BBC iPlayer, Amazon Prime, Hulu – you name it, and PrivateVPN can probably access it\n\n\n\nTorrenters will certainly appreciate that PrivateVPN offers port forwarding and dedicated stealth servers – and these come in handy for people living in restrictive regimes with limited access to the web. Likewise, IPv6 and DNS leak protection is a huge plus for the provider, just like its no-logs policy, although I'd like to see the service invest in a third-party audit to allay any lingering concerns.\n\nStream on\n\nIt'd be all too easy to dismiss PrivateVPN as a non-contender, given that it has a smaller pool of servers than its industry peers, but don't count the service out! All of its servers are incredibly quick, and I've always been able to stream smooth, HD content when connected to the service. On that note, PrivateVPN is adept at unblocking all the hottest services from across the globe. Netflix, BBC iPlayer, Amazon Prime, Hulu – you name it, and PrivateVPN can probably access it. I find PrivateVPN to be particularly good at unblocking restricted YouTube videos, that may not be available in your location or the victims of a network administrator's ban.\n\nCross-platform compatibility\n\nYou'll be able to download PrivateVPN apps for all Windows, Mac, Android, iOS, and Linux devices, and the VPN is also compatible with selected routers. Users get 10 simultaneous connections to use as they see fit, too. Again, I personally don't think that this is a lot, considering how many internet-enabled devices we tend to have in our homes, but it's a good start – and a good basis for improvement.\n\nGetting PrivateVPN setup is a breeze, although the VPN's customer service team is on standby during European business hours if you need help at any point during the process. I've reached out to the team on multiple occasions now, and always found their advice to be timely and well-researched – which is probably because the team is made up of in-house developers! So, remember that 7-day free trial, and put PrivateVPN through its paces without risking a single cent. 5. Surfshark www.surfshark.com Surfshark is the best multi-device VPN for bitcoin payments. Unlimited simultaneous connections, tons of features, and a 30-day money-back guarantee. Pricing 24 months + 2 months FREE: $2.3/mth 83% OFF 12 months: $3.99/mth 70% OFF 1 month: $12.95/mth\n\nPros Unlimited simultaneous connections Unblocks multiple Netflix libraries (and other streaming services) Bitcoin, Ethereum, and Ripple payments accepted\n\nCons Speeds are decent, but not chart-topping Free trial unavailable to Windows users No port forwarding – a big issue for torrenters\n\nAccepts Bitcoin? Yes\n\nServer locations 140\n\nSpeeds 56.10 Mbps\n\nUnblocks Netflix iPlayer Amazon Prime Hulu\n\nWebsite www.surfshark.com\n\nSurfshark Demo\n\nNo longer the new-kid-on-the-block, Surfshark continues to impress us with top-notch security measures, including OpenVPN encryption and an audited no-logs policy. Bitcoin investors have several options when it comes to purchasing a subscription – and Surfshark's prices won't break the bank, either!\n\nThis low-cost VPN is well worth a try, and you can do so without risking your hard earned cash (or coins) by taking advantage of the 30-day money-back guarantee, or the 7-day free trial available to Android, iOS, and Mac users.\n\nPay your own way\n\nAs befits a good no-logs VPN service, you can pay for Surfshark using Bitcoin (plus Ripple and Ethereum) using either the Coingate or CoinPayments processors. For such a young service, this is an impressive amount of options, and should highlight Surfshark's intent to prove itself as an industry leader.\n\n\n\nAs befits a good no-logs VPN service, you can pay for Surfshark using Bitcoin (plus Ripple and Ethereum)\n\n\n\nWith Surfshark, you'll also benefit from strong OpenVPN encryption, which prevents any prying eyes from taking a look at your traffic or identifiable details. Whilst I'd always recommend the OpenVPN protocol to the security conscious, WireGuard is a superb alternative, and might be a better pick for folks who want a lightweight solution that balances speed and security. It's also great to see that Surfshark has its own kill-switch – you'll just need to enable it via the settings menu, first.\n\nCheck out international content\n\nIf you're an avid streamer, you're in luck. Surfshark has no trouble unblocking a long list of in-demand streaming platforms – including the likes of BBC iPlayer, Prime Video, and a whopping 15 international Netflix libraries. Users get to browse content from overseas in a click, too, and even access social media platforms that have been restricted or otherwise banned in their country, workplace, or school. Surshark is like a digital skeleton key – it'll unblock and unblock pretty much anything you can think of!\n\nBest of all, actually accessing these streaming platforms with Surfshark is a breeze thanks to a clean and intuitive user interface. Selecting a server is just as easy, too, and there are thousands to choose from! In fact, the VPN boasts coverage across an impressive 100 countries . I really like that Surfshark has a selection of stealth servers. These are invaluable for folks who need to mask their VPN usage, who are living with restrictive internet laws, or who need an additional layer of privacy.\n\nSay goodbye to limits\n\nSurfshark offers its users unlimited simultaneous connections – and that's serious value for money! It also means that you'll be able to secure all of the internet-enabled devices in your home, or even share the love with friends and family if you're feeling generous. Surfshark apps are also available for just about every platform, are compatible with smart TVs and games consoles, and can travel with you on your mobile phone. So, you've got round-the-clock protection no matter where you are or what device you're using.\n\nBe sure to take advantage of that 7-day free trial (though Winders users will have to miss out), and don't hesitate to contact the Surfshark customer service team with any questions or concerns – they're around 24/7, after all!\n\nWhat do we mean by a Bitcoin VPN?\n\nMost VPNs these days allow customers to pay for their subscriptions by using a credit or debit card – and the vast majority accept PayPal, too. Some VPNs may also accept online gift cards and even cash payments. However, very few VPNs are set up to accept Bitcoin payments.\n\nAll the providers in this guide allow subscribers to pay anonymously via Bitcoin – it's why we chose them in the first place. If done correctly, Bitcoin holders can purchase a VPN subscription without ever having to hand over their real payment details, bank info, or any other personally identifiable information. This adds a crucial extra layer of confidentiality for anyone looking to retain optimum levels of privacy when signing up for a VPN.\n\nHow to pay for a VPN with Bitcoin\n\nAs long as your VPN accepts Bitcoin, you'll be able to make your purchase by following the instructions provided at the checkout.\n\nBear in mind that these instructions may vary from VPN to VPN because different VPNs use different services to receive crypto payments. Speaking generally, however, the steps will be roughly along the lines of those listed below:\n\nPick a VPN provider – and we'd recommend sticking to one of our hand-picked services that definitely accepts Bitcoin payments. Navigate to the VPN website, select your subscription plan from the options provided, and choose Bitcoin as the payment option when asked. Follow the instructions for BitPay (or whichever third-party payment system the VPN uses). You can usually either login or checkout as a guest. If prompted, enter the appropriate details, such as your email address. You will now receive a Bitcoin address for making a payment and a QR code. You can either scan the QR code with your wallet, or use the wallet address to make the payment manually. Check the amount and confirm the transaction details in your wallet to send the payment to the third-party payment provider. As soon as the payment is confirmed, you'll get an email confirming receipt of the payment, and you can continue signing up for the VPN on its website (this can take up to 24 hours).\n\nHow can I make my Bitcoin wallet anonymous?\n\nIt's entirely possible to make a Bitcoin wallet anonymous. The majority of wallets are stand-alone programs that you run on your own PC and do not require you to supply any form of identification. This means that you can create a wallet address and begin receiving Bitcoin payments in a completely anonymous manner.\n\nThe first thing you'll need to do is to set up the wallet using a pseudonym (username) that's not tied to your real identity in any way. Next, you'll need to set up an email account for the wallet – and make sure that this isn't connected to your real-life identity either.\n\nIt's vital that you never access the wallet (or the email account) using your actual IP address, as this could allow you to be tracked. Instead, use a VPN to conceal your location (and therefore your identity). Any time that you intend to send funds from your wallet, you'll need to use a VPN to conceal the IP address the funds are being sent from during the transaction. This way, you can maintain your privacy and avoid exposing your identity.\n\nOne thing worth bearing in mind is that a VPN provider could, potentially, be leveraged to trace Bitcoin payments back to your real IP address. For this reason, it is vital to stick to a no-logs/zero-logs VPN that stores no records of what you do while connected to its servers. This will ensure that even if the VPN is served with a warrant, the authorities won't be able to track your online identity, as there'll be nothing to hand over to them!\n\nThe VPN services we've recommended in this article are all zero-logs providers that are well suited for anybody who wants to use their VPN for managing Bitcoins privately and anonymously.\n\nAre cryptocurrency payments anonymous?\n\nCrypto-currencies are not necessarily designed to provide anonymity by default. However, if the proper precautions are taken, cryptocurrency can be used to make anonymous purchases.\n\nDon't fret! Some crypto-currencies are designed with privacy and anonymity in mind – like Monero and Zcash. Bitcoin isn't actually one of these crypto-currencies, however, but there are ways of acquiring and holding Bitcoin so that they can be spent anonymously.\n\nWhat it is important to remember, is that depending on how you acquire your Bitcoin and store it, the history of those coins and who they belong to may be easy to trace. Thus, in order to purchase a VPN with Bitcoin for added privacy, it is essential to ensure that those coins are not connected to you via an exchange, and have been washed properly with a Bitcoin mixer if necessary.\n\nDo I need to buy my VPN with Bitcoin?\n\nNo, most people don't need to go to these lengths. The vast majority of folks want a VPN to conceal their browsing habits from their Internet Service Provider (ISP) or to ensure that the websites they visit cannot track their real IP address.\n\nIf you feel strongly about purchasing your VPN anonymously; paying with Bitcoin can give you added privacy.\n\nFor those people, a paper trail that reveals that they purchased a VPN subscription at some point is not going to be a massive cause for concern. Thus, they'll be absolutely fine paying with a debit card or PayPal account. However, whether you want to reveal your identity at the time of purchase is largely down to you, and your personal threat model.\n\nCan a VPN help to protect my Bitcoin?\n\nWhenever you use peer-to-peer (P2P) services, you run the risk of revealing your IP address – be it to cybercriminals, your ISP, the government, or other snooping third parties. As a result, hackers and cybercriminals may use that opportunity to target you with malware and steal your access details for your crypto wallet(s).\n\nUsing a VPN with robust encryption is an excellent way to prevent this from happening. A VPN will conceal your original IP address and encrypt your internet traffic so it can't be intercepted. This puts a barrier between you and anyone wanting to steal your cryptocurrency, as well as giving you greater security and privacy online overall.\n\nCan a VPN allow me to unblock Bitcoin trading sites?\n\nSome countries have cracked down on crypto-currencies like Bitcoin. This can make it hard to access crypto services, exchanges, wallets, and apps. If you want to access a Bitcoin trading site/exchanges like Binance, a VPN is the best solution.\n\nWith a VPN, you can bypass local censorship imposed by the government. Simply connect to a VPN server in a country where purchasing and trading crypto is permitted, and you can access Binance, Coinbase, Cash App, Bisq, or any other cryptocurrency exchange or website service that is currently blocked in your country.\n\nCan I use a free VPN?\n\nIf you're looking to protect your cryptocurrency, then we strongly advise against using a free VPN service. That's not to say there aren't some good ones, but they seldom provide robust enough encryption and security features to justify their use. On top of this, free VPN services will regularly monitor users and sell on their information and usage (pretty much defeating the purpose of a VPN). A good VPN doesn't have to be expensive either. If cost is an issue, check out our top picks for cheap VPNs.\n\nHow does ProPrivacy review VPNs?\n\nThere are a lot of VPNs available on the market in 2024. That kind of choice sounds great, but sifting through hundreds of search results and comparing VPNs that all claim to be the best can quickly become overwhelming – especially if you're new to the tech. Luckily, that's what we're here for! The ProPrivacy team has been reviewing VPNs since 2013, and we're active contributors to the field of cybersecurity, as well as individuals who all use these services in our day-to-day lives.\n\nAs a result, all of the recommendations on this page are grounded in first-hand experience. I even made sure that these hand-picked Bitcoin VPNs met the following criteria before claiming a spot in the shortlist:\n\nPayment - This one's a no-brainer; if the VPN doesn't accept Bitcoin payments, it doesn't get a mention in our top five.\n\n- This one's a no-brainer; if the VPN doesn't accept Bitcoin payments, it doesn't get a mention in our top five. Security - VPNs should have your digital privacy in mind at all times. I always check out a VPN's encryption and test for data leaks.\n\n- VPNs should have your digital privacy in mind at all times. I always check out a VPN's encryption and test for data leaks. Ease-of-use - A VPN that's too difficult (or downright unpleasant) to use isn't worth paying a subscription for, and that's why I vet the services' apps.\n\n- A VPN that's too difficult (or downright unpleasant) to use isn't worth paying a subscription for, and that's why I vet the services' apps. Speed - Another vital consideration, seeing as nobody wants to endure slow-loading pages or low-quality streams.\n\n- Another vital consideration, seeing as nobody wants to endure slow-loading pages or low-quality streams. Customer support - If you have questions about your Bitcoin payment, or any concerns, you'll want them addressed quickly and comprehensively.\n\nInterested in learning more? For a more in-depth explanation about how we put VPNs to the test, head on over to our VPN review process page.\n\nConclusion\n\nUsing a VPN is a surefire way to keep yourself protected online when making Bitcoin payments. Plus, they come stuffed with features that can keep your identifiable data, and internet activity, hidden from prying eyes. If you're looking to increase your privacy with cryptocurrency, then here's a reminder of our top picks for VPNs for Bitcoin payments:\n\nFrom $6.67/month The best VPN for bitcoin payments. You get access to fast servers all over the globe with excellent encryption. ProPrivacy TrustScore: 10 out of 10 Simultaneous connections 8 Server locations 160 Free trial No Visit provider Read Review\n\nFrom $3.69/month The best value VPN for bitcoin payments, with a huge network of servers, superb encryption, and apps for all devices. ProPrivacy TrustScore: 9.9 out of 10 Simultaneous connections 6 Server locations 84 Free trial No Visit provider Read Review\n\nFrom $2.19/month The best secure VPN for bitcoin payments. Includes a proven no-logs policy and a full suite of customizable features. ProPrivacy TrustScore: 9.8 out of 10 Simultaneous connections Unlimited Server locations 84 Free trial No Visit provider Read Review\n\nFrom $2.00/month The cheapest VPN for bitcoin payments. Incredibly private and with zero-logs, lots of features, and strong encryption. ProPrivacy TrustScore: 9.7 out of 10 Simultaneous connections 10 Server locations 200 Free trial No Visit provider Read Review\n\nFrom $2.30/month The best multi-device VPN for bitcoin payments. Offers unlimited simultaneous connections and apps for all your devices. ProPrivacy TrustScore: 9.6 out of 10 Simultaneous connections Unlimited Server locations 140 Free trial Yes Visit provider Read Review\n\nBest VPNs for Bitcoin payments – FAQs\n\nCan I switch to another payment method after I paid for a VPN with a cryptocurrency? Yes, most VPNs that allow crypto payments use advanced payment systems, allowing you to switch from one payment method to another when renewing your subscription. To change your payment method with ExpressVPN, go to Subscription>Change plan>Select a different plan or payment method. The procedure should be similar with other VPNs on this list too.\n\nWhy do some VPNs not accept Bitcoin payments? As a relatively new payment method, Bitcoin payment is still not fully accepted and implemented across all companies and industries. Some innovation-driven VPNs, however (like those in this article), do accept Bitcoin and other cryptocurrencies to help you stay more anonymous online."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdGhldHllZS5jYS9OZXdzLzIwMjMvMDEvMTkvV2h5LUJDLVB1dHRpbmctQnJha2VzLUJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Gold Rush 2.0? Why BC Is Putting the Brakes on Bitcoin - TheTyee.ca",
        "content": "When most people think about bitcoin, they likely think of a shiny new tech industry that operates somewhere in “the cloud.”\n\nAnnouncements, Events & more from Tyee and select partners CONTEST: Win Two Tickets to Handel One lucky Tyee reader will win a pair of seats to see the famous composer’s music brought to life in Vancouver this March.\n\nMost aren’t imagining an old mill site in the village of Canal Flats, B.C., population 668.\n\nBut over the past five years, cryptocurrency operators have increasingly been setting up shop in the sawdust left by B.C.’s declining forest industry. Inside warehouses that house the operations, the steady hum of computers and a web of wires log thousands of transactions that ping around the globe daily. Their polished stainless-steel interiors reflect a glimmer of hope for communities in decline.\n\nBut the crypto industry has also seen peaks and valleys in recent years — and not just those of rural B.C.\n\nBitcoin, which makes up almost 40 per cent of all cryptocurrencies, has become increasingly known for its heavy environmental footprint, with the massive computers required to run the industry drawing more power than countries such as Finland and Chile.\n\nThat has brought bitcoin miners to B.C. in search of greener energy. They require three things: sufficient space, a renewable power source and an internet connection. They’ve found it in the old mill sites and industrial infrastructure of forestry towns — places like Houston, Ocean Falls and, of course, Canal Flats.\n\nBut the jobs provided by the industry — a few hundred provincewide, by one estimate — haven’t come close to replacing the void left by forestry. The province’s biggest bitcoin miner, Australia-based Iris Energy, provides about 60 jobs. The company has also been hit by bitcoin’s recent downturn, which has led to a drop in production and fear of layoffs. It now faces a class-action lawsuit in the U.S.\n\nB.C.’s Ministry of Energy, Mines and Low Carbon Innovation says its announcement last month that it would pause new power requests from cryptocurrency operations has nothing to do with the industry’s volatility and everything to do with preserving B.C.’s power supply.\n\n“Cryptocurrency mining consumes massive amounts of electricity to run and cool banks of high-powered computers 24/7/365, while creating very few jobs in the local economy,” B.C.’s mines minister, Josie Osborne, said in a news release. Yet unlike mineral mining, which undertakes an approval process under B.C.’s Mines Act, crypto miners only need to request power from BC Hydro.\n\nSeven existing cryptocurrency mining operations and six in the advanced stages of development will be allowed to proceed under the new rules. The province says it is pausing 21 additional projects that are requesting a total of 1,403 megawatts — more than 10 per cent of the province’s power supply, equivalent to approximately 570,000 homes or 2.1 million electric vehicles.\n\nThe ministry declined to provide details on operations in the province, calling the information “commercially sensitive.”\n\nIt says the 18-month suspension will provide time to create a “permanent framework” for the industry — and to preserve its electricity supply for things like electric vehicles and greening B.C.’s existing economy.\n\n‘It’s like gold 2.0’\n\nDaniel Roberts visibly stiffens at the mention that bitcoin may be a volatile asset.\n\nThe co-founder and co-CEO of Iris Energy, a company he started with his brother, Will, got his first taste of bitcoin in 2013. Roberts invested just as the digital currency, which had been in existence for about five years at that time, approached $1,000 a coin. Months later, following a high-profile internet security breach, bitcoin plummeted and Roberts’ investment lost nearly half its value.\n\n“I thought, ‘This is nonsense’ and sold it all,” the Australian entrepreneur says over a Zoom call from his home in Sydney, jokingly referring to the currency as “silly, magic internet money.”\n\n“How wrong I was,” he says.\n\nAs Roberts points out, despite bitcoin’s undulating value, the digital currency has trended upward over the past decade. Today, a single coin is worth about C$28,000 — well above what Roberts paid a decade ago but a far cry from its peak of C$80,000 in 2021.\n\n“It’s like gold 2.0,” Roberts says. “What gives gold value? Transferability, scarcity, divisibility, durability — it’s objectively better at being gold than gold is.”\n\nBut some economists disagree.\n\nWerner Antweiler, an associate professor at the University of British Columbia’s Sauder School of Business, has been studying bitcoin since its early days. In a 2011 blog post, he called the currency a terrible idea.\n\nA decade later, his opinion hasn’t changed.\n\n“It looks a lot like a Ponzi scheme,” he says. “A lot of people, economists like myself, have looked at it and said, ‘Wait a minute. This is not a sound business model.’”\n\nFor many, bitcoin’s appeal is that it operates outside traditional markets. It’s not controlled by governments or other regulatory bodies, and its distributed ledgers mean that each transaction is duplicated multiple times around the world. Those ledgers create a blockchain, a history of each transaction meant to provide duplicity and security, and its decentralized nature is appealing to those who distrust central banks.\n\nThe product has no intrinsic value — or even physical presence. Its value relies solely on the worth assigned by markets. As a result, it leans heavily on hype.\n\n“In that sense, it’s like buying a piece of art or gold or something, that is essentially just an asset we hold and sell,” Antweiler says. “Whether or not it’s good and holding value, that is completely driven by the market.”\n\nHere in B.C., Antweiler estimates the industry may provide “a few hundred jobs.” But what makes it so egregious, he says, is its wastefulness.\n\n“When you look at how much electricity is now being used for bitcoin mining around the world, it’s absolutely shocking,” he says. “I have not yet found anyone who can point me to any significant economic value that could come from using any of these crypto tools or crypto assets and that is, unfortunately, the bottom line.”\n\n‘Mopping up’ surplus energy in mill towns?\n\nCryptocurrency operations first began plugging into the B.C. power grid in 2018.\n\nChina had recently shifted from being the global epicenter of cryptocurrency mining to banning the operations in 2017. As some operators sought to green the industry’s image, they looked to B.C., which appeared to have an abundance of renewable power.\n\nThe province’s total generating capacity is more than 12,000 megawatts. An additional 1,100 megawatts are projected to come online once the Site C hydroelectric project is completed in 2024. BC Hydro says its power is 98 per cent renewable, most of it from the province’s many dammed waterways.\n\nAt the start, B.C. cryptocurrency operations drew just a handful of megawatts from the grid. The province appeared keen to attract new business, initially considering a “load-attraction” rate for new cryptocurrency operations.\n\nBut it quickly changed course.\n\nBC Hydro commissioned a load forecast study in 2018 reporting that, by September of that year, formal service requests had grown to 87 megawatts. But the province faced inquiries totalling nearly 2,000 megawatts — roughly a sixth of its total power supply.\n\nThe report described cryptocurrency as an “emerging” industry, alongside cannabis, that was expected to accelerate demand for power, albeit with a significant amount of uncertainty. “This is acutely the case for cryptocurrency,” the report added. “The business viability is ultimately dependent on cryptocurrency prices which are extremely volatile.”\n\nDespite early indications that BC Hydro might offer incentives to cryptocurrency operations, when it announced its Clean Industry and Innovation Rate in 2021, which aimed to attract clean tech industries, it explicitly excluded cryptocurrency.\n\nThat’s “due to the number of crypto requests to connect,” which showed unprecedented interest from the industry without any incentives, the provincial power regulator explained in an email to The Tyee.\n\nIt was into this shifting landscape that Iris Energy stepped in 2019.\n\nAccording to Roberts, B.C. was facing the combined effects of a declining forest industry coupled with expanded hydroelectric infrastructure. He says the province had a surplus of renewable energy, something that was actually costing ratepayers money.\n\n“When you had the pulp and paper industry shut down and the province continued to build out Site C, you end up with this enormous oversupply of energy that someone still has to pay for,” he says. “So, we thought, let’s come in, let’s go into these regional towns where they’ve been decimated economically by the closure of these mills, leverage a lot of the existing electrical infrastructure, rehire a number of the local workers, retrain them in what we do.”\n\nThe company was “mopping up some of that surplus power” and providing BC Hydro with an alternative revenue line, relieving the burden on residents, Roberts says.\n\nAt the same time, it was greening the bitcoin industry, he adds.\n\nAntweiler calls the claims “complete greenwashing.” He says the idea that B.C.-based operations are reducing bitcoin’s environmental footprint goes against the very nature of the industry.\n\n“You can’t do bitcoin mining only in B.C. That is impossible by the nature of the transaction. The moment bitcoins are mined, they’re mined everywhere,” he says. “It’s the global footprint that matters.”\n\nIn an email, BC Hydro says that it sells any surplus energy to Powerex, its energy trading branch, which sells clean energy in the western U.S. and Mexico at average wholesale market prices, providing revenue to the Crown corporation.\n\n‘The big economic driver is still the forest industry’\n\nIris Energy currently operates three of B.C.’s seven operating cryptocurrency facilities — in Canal Flats, Mackenzie and Prince George. Combined, they draw 160 megawatts, about 60 per cent of the power dedicated to 13 operations that have been allowed to move forward since the province announcement it would hit pause on new connection requests.\n\nIt was a connection with Vanderhoof businessman Brian Fehr that originally brought the company to B.C., Roberts says.\n\nFehr, an Order of BC recipient, had been buying up old mill sites across the province — in places like Vavenby, Cranbrook, Isle Pierre and Fort Nelson. Among them was a shuttered Canfor sawmill in Canal Flats, which he retooled as the Columbia Lake Technology Center in 2018, with then-premier John Horgan in attendance at the launch.\n\nThe following year, Iris Energy bought into the venture, establishing its first Canadian operation, which officially launched in 2021.\n\nAt the time, Fehr spoke enthusiastically about more bitcoin operations on the horizon: “We’re already building in Mackenzie, we’re already working in Chetwynd, we’ve got many sites going now,” he said. “We went after sites where BC Hydro has a surplus of power.”\n\nBut while Fehr remains an investor in Iris Energy, he is not directly involved in the company’s two recent operations, which opened last year in Mackenzie and Prince George. No operations have yet materialized in Chetwynd, although Fehr bought the town’s sawmill site in March.\n\nRoberts says he can’t talk about the company’s future plans in B.C. but indicates that more mining facilities — and partnerships with the Brian Fehr Group — could be in the works.\n\n“We’ve got a number of other development projects that we’re working on with Brian,” he says.\n\nFehr did not respond to The Tyee’s requests for an interview.\n\nBrian Fehr’s sister, Lorri Fehr, is CEO at the Columbia Lake Technology Center and works with her brother on his various business ventures across the province. She says bitcoin was “not our first strategy.” The family comes from a forestry background and their interests focus on providing economic development opportunities in rural communities.\n\nBut when the siblings met the Roberts brothers, something clicked.\n\n“What mattered there was the shared values,” she says. “We had decided very clearly at the beginning of the Columbia Lake Tech Center that we were only going to offer clean, green, sustainable, First Nations-friendly, community-friendly — that’s what we want our site to be. These guys from Australia came and they really clicked with those values.”\n\nIn addition to providing about 20 full-time jobs, she says Iris Energy has offered locals in Canal Flats the opportunity to learn entry-level tech skills. Canal Flats Mayor Mark Doherty adds that infrastructure upgrades have also attracted the interest of other technology companies.\n\n“It does help out the economy here. We would like to see more of that stuff coming here,” Doherty says. “They employ a lot of people and they’ve been a good steward of the community.”\n\nIronically, while the tech industry has supplied some new employment, it has also taken it away — the Canal Flats mill had 120 workers when it closed, Doherty says. If it were to start up again today, it would employ fewer than 70 people, a result of technological efficiencies in the forest industry — but still three times the number of jobs offered on the site as a crypto operation.\n\nMackenzie Mayor Joan Atkinson is also quick to acknowledge that bitcoin isn’t about to replace what was lost with a decline in the forest industry.\n\nAtkinson moved to the community more than 25 years ago for her husband’s work in forestry. Her two sons, now grown but still living in the region, also went on to work in the industry.\n\nThe community of roughly 3,200 residents was founded on forestry. Located two hours north of Prince George, it was one of B.C.’s instant towns, created to service logging operations after the Williston Reservoir opened up new timber to the north. When Atkinson arrived in the late 1990s, there were three sawmills, a large pulp and paper mill and a pulp mill, she says.\n\nThat all changed with an uplift in timber harvest during the mountain pine beetle epidemic and subsequent hauling of timber to mills farther afield. Canfor’s Mackenzie mill closed in 2019, eliminating more than 400 local jobs.\n\n“But the big economic driver is still the forest industry,” she adds.\n\nToday, the community has a lot going for it, Atkinson says. Real estate prices are among the lowest in the province and it has enough family doctors for everyone. In addition, the town offers easy access to outdoor adventure, with new bike trails, paddling and its own one-lift ski hill.\n\nIris Energy employs about 15 people full time in Mackenzie. They’re jobs Atkinson says the community is happy to take. The company has also purchased industrial land from the district, provided $100,000 in annual community grants and contributes to the tax base — even if it’s not on the same scale as heavy industry.\n\nShe describes the company as “good corporate citizens.”\n\n“It certainly doesn’t fill the void of a shutdown sawmill,” she adds. “We’re used to the old sawmill days when 40 people showed up for a shift.”\n\nIndustry instability — and lawsuits\n\nProvincewide, Roberts says Iris Energy employs about 60 people — 10 in Vancouver and the rest spread over its three operations.\n\n“We’ve hired locally, we’ve sourced all our trades and equipment where we can locally and, again, we’d like to think that we’ve contributed to keeping power prices low,” he says. “We don’t employ as many people as the pulp and paper industry. But at least we’re coming into these regional communities, adding economic activity and a new level of employment.”\n\nBut last year’s downturn in bitcoin underscored the industry’s instability.\n\nOn Nov. 2, Iris Energy announced that as a result of the drop in bitcoin prices, some equipment was not producing enough revenue to cover more than $100 million in debt on the machines. The loans, which were arranged through “special purpose vehicles,” or subsidiaries that provide financing protection to the parent company, were called in by the lenders.\n\nRoberts says that the company is currently “replacing some of the computers” in Canal Flats as a result.\n\nIt means output is down. The company’s hashrate, or computing power, dropped by more than half from October to November 2022.\n\nDespite rumours that the Canal Flats operation could see layoffs, that hasn’t happened, he says.\n\n“It’s given the guys on site a bit of a breather and an opportunity to catch up on broader things,” Roberts says. “It means we’re making less cash today than we would have been three months ago, but it’s very much a short-term thing.”\n\nFollowing the November announcement, Iris Energy stocks tumbled to an all-time low. By late December, they bottomed out at US$1.06 — losing more than 90 percent of their value over November 2021, when the shares entered the market at US$28.\n\nLast month, the class-action lawsuit filed in the U.S. claimed Iris Energy “failed to disclose material adverse facts” about its business, thereby harming investors. The claims have yet to be proven before the court.\n\nWhen asked about the lawsuit, Roberts demurs.\n\n“I would have to check. I know for a fact that one was lodged and withdrawn very quickly late last year,” he says, blaming market fluctuations and investor anxiety. “Whether there’s another one afoot today, I’d need to go and check. It’s not something that we’re overly concerned with at the moment,” he adds.\n\nRobert Willoughby, investor relations manager with Pomerantz LLP, one of the law firms pursuing the court action against Iris Energy, confirmed that a class-action against Iris Energy is moving ahead.\n\nBC Hydro expresses caution\n\nBoth bitcoin and Iris Energy appear to be rebounding with the new year. Bitcoin’s price has climbed from $22,000 a month ago to $28,000 this week. Iris Energy shares closed at US$1.92 on Wednesday, up from a low point of US$1.06 in December.\n\nRoberts is optimistic. “I think bitcoin is here to stay,” he says, but adds that the infrastructure being built could be used for all types of data.\n\nAlthough the Mines Ministry says bitcoin’s recent downturn had no bearing on its decision to halt new operations, BC Hydro expressed caution about dedicating too much of its power supply to the industry. Moving ahead with the spike in requests would have meant “significant upgrades” to the province’s energy delivery systems, at a cost to consumers, senior media relations advisor Kyle Donaldson adds.\n\n“We are committed to keeping rates affordable for our customers and protecting them against a volatile industry that could potentially reduce electricity supply,” he says. “We have heard from communities and individuals about recent concerns over the state of the cryptocurrency industry and the risks of allocating electricity that puts significant risk on other industries they are looking to attract to their region.”\n\nRoberts says that BC Hydro’s announcement — which came as the province broke records for residential power use during December’s cold snap — didn’t come as a surprise.\n\n“We get it. We welcome it,” he says. “At the end of the day, we want to be solving problems in markets that we go into, we want to be using surplus energy.”\n\nManitoba also suspended new cryptocurrency connections in November and Hydro-Québec previously undertook a similar process that resulted in higher rates and a cap on electricity for cryptocurrency mining.\n\nAs for what B.C.’s current pause could bring, the Mines Ministry says it’s too soon to say. Antweiler notes that financial regulation ultimately comes from the federal government.\n\nHe adds that now is not the time to be expending energy on a product with questionable value.\n\n“Anyone who’s concerned about climate change can only look at crypto technologies and say, ‘Do we really need this at a time when we’re trying to reduce our environmental footprint and are concerned about climate change?’” he says."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvY3J5cHRvY3VycmVuY3ktd29tZW4taW52ZXN0aW5nLWFzc2V0LWhvbGRpbmdzLWNhc2gtbWFya2V0cy1iaXRjb2luLWV0b3JvLXN1cnZleS0yMDIzLTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Cryptocurrency Is 2nd Most Widely Held Asset Among Women, Says Survey - Markets Insider",
        "content": "Crypto ownership rose among women during 2022, making it the second most widely held asset class held by that group, eToro said.\n\nIn its fourth-quarter survey, 34% of women said they owned crypto, up from 29% in the prior quarter.\n\nThe ownership rate among men edged up just by 1 percentage point during that period to 43% from 42%.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nCryptocurrencies have driven up in the ranks of financial assets held by women, an eToro survey shows, with a jump in ownership in 2022 taking place despite a sharp downturn in the market.\n\nCrypto has become the second most widely owned asset class for women, running just behind cash, the trading platform said this week in its Retail Investor Beat survey.\n\nIn the fourth quarter, 34% of women owned crypto, up from 29% in the third quarter. The increase in the pace of ownership was faster than that of men, as their rate edged up to 43% from 42%.\n\nCrypto appears to be \"succeeding where traditional financial markets have sometimes failed in bringing more women to the table,\" Ben Laidler, global market strategist at eToro, said in the report.\n\nAdvertisement\n\nWomen ramped up their holdings of digital assets during a so-called crypto winter that saw prices sinking for bitcoin, ether, and other digital coins. Bitcoin's valuation dropped by more than 60% last year, and the market's overall market capitalization fell below its high point of $3 trillion in November 2021 to below $1 trillion now.\n\nThe market ran into macroeconomic turbulence and a number of blow-ups in the crypto world, including the implosion of FTX.\n\nStill, women were part of a broader increase in the proportion of retail investors owning crypto. Overall, crypto was held by 39% of retail investors in the final quarter of 2022, up from 36% in the third quarter, even as it was last year's worst-performing asset class, eToro said.\n\n\"It's important to emphasise that retail investors are overwhelmingly long-term, with 63% holding onto investments for years or decades and just 4% holding them for days,\" said Laidler. \"Time is on their side in most cases and for many, the brutal tech valuation and expectations reset may set up for better returns ahead.\"\n\nAdvertisement\n\nEToro said 10,000 retail investors were surveyed across 13 countries between December 14 and 24."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXJpc2UtYWdhaW4tY3J5cHRvLXdpbnRlci0yMTA4NDQxNjkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin is on the rise again as 'crypto winter' shows signs of thawing - Yahoo Finance",
        "content": "Bitcoin fell from an all-time price high of close to $69,000 in November 2021 to below $16,000 in November 2022 (Getty Images/ iStock)\n\nThe price of bitcoin is up by almost a third since the start of the year, leading to speculation that the prolonged ‘crypto winter’ is finally beginning to thaw.\n\nThe world’s leading cryptocurrency was trading above $21,000 on Thursday, pushing its market cap higher than $400 billion for the first time since November.\n\nThe latest gains come amid easing inflation and signs that the US Federal Reserves will slow interest rate rises over the coming months, leading to improved sentiment and an increased appetite for riskier assets like cryptocurrencies.\n\nEthereum (ETH), Ripple (XRP), Cardano (ADA) and Solana (SOL) have also seen significant gains in recent weeks, pushing the overall crypto market cap back towards $1 trillion.\n\nDespite the turnaround in fortunes, the global crypto currency market remains a long way off its peak of close to $3 trillion in November 2021.\n\nThe upward momentum saw short sellers lose hundreds of millions of dollars in the space of just a few days, according to a report from crypto investment service BitStacker.\n\nThose betting against bitcoin lost $386.74 million in liquidations between 10 to 16 January, the analysis found, with more than $140m lost on just a single day.\n\n“While it’s always sad to see traders losing money on their investments, the study does show that cryptocurrencies might finally be bouncing back,” said BitStacker analyst Kris Lucas.\n\n“2022 was a very tough year for cryptocurrencies with the collapse of several major exchanges, as well as the Terra stablecoin. However, the fact that bitcoin is starting to regain its value could suggest that the so-called crypto winter could soon be over.”\n\nA mini flash crash on Wednesday, which saw BTC drop by $1,000 in the space of an hour, demonstrated that the recovery is still in the fragile early stages, and could easily be shaken by some negative news.\n\nThe price dip came after the US government announced a press conference for some major crypto-related news, leading to fears that it could be damaging for the crypto space. The news turned out to be the dismantling of a crime network, and the price returned to a positive trajectory.\n\nStory continues\n\nThe stalled rally showed that it is too soon to know whether or not bitcoin has reached its lowest price point this cycle, though it is the most positive move for the crypto market in nearly a year.\n\nFavourable market conditions could see bitcoin begin to recapture some of its losses in 2023, according to Nigel Green, CEO of financial advisory firm deVere Group, who cites US inflation data in his forecast for the year ahead.\n\n“We are technically still in a bear market, but the signs are the bulls are beginning to take back control,” Mr Green told The Independent.\n\n“As the central banks begin to stop tightening the screws, and the cyclical upturn gets underway, cryptocurrencies such as bitcoin could outperform other asset classes. Knowing they are likely to be rewarded for doing so, many crypto investors are positioning themselves now for the pivot.\n\n“The ‘crypto winter’ is thawing amid growing signs that inflation is beginning to cool. Of course, the crypto market will not go in a straight line – no market ever does – but we expect the bears to go into hibernation and bulls are ready to run.”"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xMTk2NDQvYml0Y29pbi1ldGhlcmV1bS1lbmpveS1idWxsaXNoLXdlZWstY3J5cHRvLW1hcmtldNIBUWh0dHBzOi8vZGVjcnlwdC5jby8xMTk2NDQvYml0Y29pbi1ldGhlcmV1bS1lbmpveS1idWxsaXNoLXdlZWstY3J5cHRvLW1hcmtldD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Enjoy Bullish Week as Crypto Market Adds $77B - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) and Ethereum (ETH) are leading the weekly gains among the ten largest cryptocurrencies by market cap as their prices soared 11.2% and 9.7%, respectively.\n\nAt the time of writing, Bitcoin was changing hands at $20,981, up 1% over the day, with Ethereum trading at $1,551, up 2% in the past 24 hours, data from CoinGecko shows.\n\nThese are by far the best results among the market’s largest crypto assets, with the sixth-placed XRP gaining 5% over the past week, followed by Polygon (MATIC), which is up 4.3% over the same span.\n\nAD\n\nAD\n\nThe solid performance shown by the two leading cryptocurrencies comes despite the Wednesday correction that occurred in anticipation of a major announcement from U.S. federal prosecutors that many thought would target a major player in the sector.\n\nThough markets indeed felt the pinch, with both BTC and ETH plunging about 5% immediately after the announcement of the announcement, the correction turned out to be largely short-lived as the criminal charges were filed against a little-known Hong Kong-based cryptocurrency exchange Bitzlato, which the Feds called of a key member of a so-called “crypto crime axis.”\n\nThe latest move has also been seen in the hefty rise in the entire market's capitalization. This time last week, the crypto market hovered around a $943 billion capitalization; today, that figure is over $1 trillion.\n\nHas Bitcoin bottomed yet?\n\nWith Bitcoin eyeing the key $21,000 level, the total market capitalization of all cryptocurrencies has once again surpassed the $1 trillion mark, something experts see as a sign of the market’s potential recovery after the painful crypto winter of 2022.\n\nAccording to CoinGecko’s recent annual crypto industry report, last year, which saw the demise of several high-profile players, ended with a total crypto market capitalization of $829 billion, which is 64.1% lower than the $2.3 trillion in January 2022.\n\nAD\n\nAD\n\nDaily trading volumes have steadily trended downwards over 2022 as well, averaging at $86.0 billion, said the report.\n\nSource: CoinGecko.\n\n“2022 marked a turning point for the crypto industry—one that flushed out unsustainable excesses from the bull run,” CoinGecko co-founder Bobby Ong said in a statement shared with Decrypt. “In this new year, we hope to see crypto slowly make a recovery, with more efforts going towards rebuilding trust and credibility.”\n\nAs for last week’s performance beyond the top ten, the three top gainers performers are Solana (SOL), which is up 28.5% over the past week, the Ethereum-based meme coin Shiba Inu (SHIB), whose price rallied 20.7% over the span, and Polkadot (DOT) with a 10.9% surge."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzIwL2NyeXB0by1pcy1hLXBldC1yb2NrLWFuZC1iaXRjb2luLWEtaHlwZWQtdXAtZnJhdWQtc2F5cy1qcG1vcmdhbi1jZW8tamFtaWUtZGltb24v0gF1aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMjAvY3J5cHRvLWlzLWEtcGV0LXJvY2stYW5kLWJpdGNvaW4tYS1oeXBlZC11cC1mcmF1ZC1zYXlzLWpwbW9yZ2FuLWNlby1qYW1pZS1kaW1vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Crypto Is a ‘Pet Rock’ and Bitcoin a ‘Hyped-Up Fraud,’ Says JPMorgan CEO Jamie Dimon - The Daily Hodl",
        "content": "Longtime crypto skeptic JPMorgan chief executive Jamie Dimon thinks Bitcoin (BTC) is a ‘hyped-up fraud,’ comparing crypto to pet rocks.\n\nIn a new interview with CNBC, Dimon says Bitcoin and other digital assets “don’t do anything.”\n\nDimon, however, views the merits of blockchain technology differently than crypto assets.\n\n“That’s different. Blockchain is a technology ledger system that we use to move information. We’ve used it to do overnight repo, intraday repo. We’ve used it to move money. So that is a ledger, that’s a technology ledger type of thing that we think will be deployable. Remember, we’ve been talking about that for 12 years too, and very little’s been done.”\n\nJPMorgan employs a platform called Liink, which is a blockchain developed by Onyx, an arm of the banking giant. According to Onyx, Liink is focused on providing seamless data-sharing abilities between institutions.\n\nDuring the CNBC interview, Dimon also questions whether Bitcoin is truly scarce and will stop at 21 million tokens.\n\n“How do you know it’s going to stop at 21 million? I’ve mentioned this to people – everyone says that. Well, maybe it’s going to get to 21 million and Satoshi’s picture’s going to come up and laugh at you at all and say, ‘Na Na.'”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/Konstantin Faraktinov"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tLzUtb24tY2hhaW4taW5kaWNhdG9ycy1zaWduYWxzLWJpdGNvaW4tZW50ZXJpbmctYnVsbC1tYXJrZXQtY3ljbGUv0gFaaHR0cHM6Ly9jb2luZ2FwZS5jb20vNS1vbi1jaGFpbi1pbmRpY2F0b3JzLXNpZ25hbHMtYml0Y29pbi1lbnRlcmluZy1idWxsLW1hcmtldC1jeWNsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "5 On-Chain Indicators Signals Bitcoin Entering Bull Market Cycle - CoinGape",
        "content": "Bitcoin price trades strongly above the $20,000 psychological level and shows signs of another upside move above $21K. Five on-chain indicators also signal that Bitcoin has entered an early bull market cycle.\n\nThe crypto market recovered slightly after the U.S. DOJ enforcement action against Russian crypto exchange Bitzlato. Crypto Twitter blames DOJ for creating much hype surrounding small news that caused panic selling across the crypto market.\n\nadvertisement\n\nFive On-Chain Indicators Indicate More Upside in Bitcoin Price\n\nAccording to on-chain data by CryptoQuant, Bitcoin price has entered the early bull market cycle and is likely to move higher with promising momentum in the next few days.\n\nBitcoin movements from spot to derivative exchanges have increased as investors started taking risks. Traders generally transfer their coins to derivative exchanges to increase their market upside exposure. It helps them make more profits during a market recovery.\n\nThe MVRV Ratio indicates if the Bitcoin price is undervalued or overvalued. It is derived from Bitcoin’s market capitalization (market price) divided by its actual market capitalization. Currently, MVRV is 1.07 and moving near the 365-day moving average (orange line). Thus, it indicates Bitcoin is about to start a new uptrend.\n\nThird indicator, the Net Unrealized Profit/Loss shows the average profit margin of Bitcoin holders. It is also near the 365-day moving average and indicates an early bull market cycle.\n\nPuell Multiple is the ratio of the daily dollar worth of newly issued bitcoins to their one-year moving average. At present, the indicator shows a shift to a positive trend as Bitcoin price holds strongly above its 365-day moving average.\n\nCryptoQuant’s P&L Index indicator combines the MVRV ratio, Net Unrealized Profit/Loss, and LTH/STH SOPR into a single Bitcoin value indicator. The P&L Index points to an early Bitcoin bull market cycle as the index (dark purple line) looks to cross the 365-day moving average (light purple line)\n\nAlso Read: Bitcoin Price Really Bottomed? Use These To Confirm Market Bottom\n\nBTC Price Await Upside Momentum\n\nBitcoin (BTC) price fell nearly 2% in the last 24 hours, with the price currently trading at $20,774. The 24-hour low and high are $20,541 and $21,564, respectively. Furthermore, the trading volume has increased by 21% in the last 24 hours, indicating an increase in interest.\n\nTraders should keep an eye on the US dollar index (DXY). A fall in the DXY below 102 at current market conditions will confirm a rally in Bitcoin price.\n\nAlso Read: Binance Linked With Exchange Accused Of Money Laundering"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9idXNpbmVzcy8yMDIzLzAxLzE5L2JpdGNvaW4taHlwZWQtdXAtZnJhdWQtc2F5cy1qcC1tb3JnYW4tY2hpZWYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin is a 'hyped-up fraud', says JP Morgan chief - The Telegraph",
        "content": "The billionaire chairman of JP Morgan, Jamie Dimon, has called Bitcoin a “hyped-up fraud” and the financial equivalent of a “pet rock” as financial chiefs turn against digital currencies.\n\nMr Dimon called cryptocurrencies a “waste of time” in comments at the World Economic Forum in Davos.\n\nHowever, he said the technology behind Bitcoin, known as a blockchain, could have uses. This kind of digital ledger is designed to be difficult to alter or hack and enables the creation of a public record of transactions.\n\nHe said: “Blockchain is a ledger system that we use to move information... to move money. It's a technology we think will be deployable.”\n\nSpeaking to CNBC, Mr Dimon added he could envisage the US Federal Reserve raising interest rates above 5pc as central bankers grappled to get a hold of raging inflation.\n\nMr Dimon said: “I actually think rates are probably going to go higher than 5pc. There's a lot of underlying inflation, which won't go away so quick.”\n\nThe US Federal Reserve has predicted rates will rise from around 4.5pc to about 5pc by the end of the year, and remain there.\n\nMr Dimon's comments on Bitcoin come as financial institutions emerge red faced from the failure of FTX, the world's second largest cryptocurrency exchange, which collapsed amid allegations of fraud.\n\nFinancial giants including Blackrock and venture capital fund Sequoia had invested in the digital currency exchange, founded by Sam Bankman-Fried.\n\nMr Bankman-Fried has been arrested and accused of “massive” fraud by US authorities. He is alleged to have siphoned customer money to pay for luxury properties and to prop up losses at a crypto hedge fund. He has pleaded not guilty.\n\nLast year, the price of Bitcoin plunged by more than 60pc amid a sell-off of cryptocurrencies accelerated by a series of scandals and collapses throughout the digital asset industry.\n\nHowever, so far in 2023 the price of the digital currency has recovered. One Bitcoin is now worth £16,880, up 23pc since the start of January."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMTkvY29zbW9zLWRleC1vc21vc2lzLXRvLW1ha2UtY3Jvc3MtY2hhaW4tdHJhZGVzLW1vcmUtZWZmaWNpZW50LXdpdGgtbmVvbi11cGdyYWRlL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMTkvY29zbW9zLWRleC1vc21vc2lzLXRvLW1ha2UtY3Jvc3MtY2hhaW4tdHJhZGVzLW1vcmUtZWZmaWNpZW50LXdpdGgtbmVvbi11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Cosmos DEX Osmosis to Make Cross-Chain Trades More Efficient With Neon Upgrade - CoinDesk",
        "content": "One of the key features of the upgrade is the implementation of geometric TWAP (Time Weighted Average Pricing) in Osmosis liquidity pools. In finance, a TWAP is the average price of an asset over a specified time. A TWAP strategy is often used to minimize a large order’s impact on the market by dispersing the large order into smaller quantities and executing them at regular intervals over time, as per Binance."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0xOS1qYW4tYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1wb2x5Z29uLXNoaWJhLWludS1zb2xhbmEtZmFsbC0xNTcxMDY2MS5odG3SAZEBaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL3Bob3Rvcy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktMTktamFuLWJpdGNvaW4tZXRoZXJldW0tZG9nZWNvaW4tcG9seWdvbi1zaGliYS1pbnUtc29sYW5hLWZhbGwtMTU3MTA2NjEuaHRtL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin slides below 21,000, Ethereum and other tokens fall - CNBCTV18",
        "content": "1 / 8\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, fell 2.3 percent to $20,742.1. Its market value stood at $399.9 billion. The trade volume was at nearly $30.1 billion.\n\n2 / 8\n\n\"Bitcoin briefly rose above its resistance at $21,480 but could not maintain the gains, potentially attracting profit-taking by short-term traders. However, if BTC can make it above the $21,400 level, it might attract buyers and push the price above the next level,\" said Edul Patel, CEO and Co-Founder of Mudrex.\n\n3 / 8\n\nEthereum | The second largest virtual currency, Ethererum or Ether, fell 3.5 percent to $1,523.9 with a market capitalisation of $186.2 billion. The trade volume of Ethereum was $10.4 billion in the last 24 hours.\n\n4 / 8\n\nOn Ethereum, Patel said, \"Ethereum managed to break above its resistance at $1,600 but could not achieve a close above it. The immediate support of ETH now lies at $1,490, while the resistance would lie at $1,550.\"\n\n5 / 8\n\nDogecoin | Meme-based virtual currency, Dogecoin, slumped seven percent on Thursday. Its market value stood at $10.7 billion. The trade volume was at $1.1 billion.\n\n6 / 8\n\nShiba Inu | Shiba Inu slipped 7.8 percent with a market capitalisation of $6.1 billion. The trade volume was $1.2 million in the last 24 hours.\n\n7 / 8\n\nSolana | Solana fell 7.7 percent to $21.2 with a market capitalisation of $7.8 billion. The trade volume of Solana was $1.4 billion in the last 24 hours.\n\n8 / 8"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmFmci5jb20vbWFya2V0cy9jdXJyZW5jaWVzL3BldGVyLXRoaWVsLXMtZnVuZC13b3VuZC1kb3duLWJpdGNvaW4tYmV0LWJlZm9yZS1tYXJrZXQtY3Jhc2gtMjAyMzAxMTktcDVjZTFq0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Peter Thiel's fund wound down bitcoin bet before market crash - The Australian Financial Review",
        "content": "In April 2022, about the same time that Founders Fund sold out of most of its cryptocurrency holdings, Mr Thiel said he was optimistic about the future of bitcoin. He told a cryptocurrency conference in Miami that “we’re at the end of the fiat money regime” and suggested its price – which was then trading at about $US44,000 – could increase by a factor of 100.\n\nMr Thiel said JPMorgan chief executive Jamie Dimon and BlackRock boss Larry Fink “need to be allocating some of their money to bitcoin”, adding: “We need to push back on them.”\n\nThe price of bitcoin, which was launched in 2009, surged dramatically from roughly $US750 in 2014 to an all-time high of more than $US65,000 by November 2021. However, its price has been volatile in recent years, with several big collapses in value, including a drop to about $US15,500 in November last year, a two-year low.\n\nThe digital assets market has been rocked by a crisis since May last year, forcing high-profile crypto companies such as Terraform Labs, Celsius, Voyager and Three Arrows Capital into bankruptcy.\n\nMarket sentiment towards crypto was damaged further in November when FTX, the second-largest cryptocurrency exchange, shut down owing creditors more than $US3 billion, and its co-founder Sam Bankman-Fried faced multiple fraud charges.\n\nBy December, bitcoin had lost about three-quarters of its value from its peak and more than $US2 trillion had been wiped off the value of the global crypto market.\n\nAdvertisement\n\nSeveral blue-chip Silicon Valley investors have piled into digital currencies in recent years, although most have focused their investments on equity stakes in crypto businesses rather than buying cryptocurrencies directly.\n\nSome exceptions to this include A16z crypto – the crypto arm of venture firm Andreessen Horowitz – which raised a $US4.5 billion fund last year and also invests directly in crypto coins and tokens.\n\nSimilarly, Paradigm, a crypto venture firm founded in 2018 by Coinbase co-founder Fred Ehrsam and former Sequoia Capital partner Matt Huang, raised a $US2.5 billion fund in late 2021.\n\nBut many large financial institutions stayed away from cryptocurrencies over fears about cybersecurity and their links to money laundering and drug trafficking. In 2017, JPMorgan’s Dimon called bitcoin a “fraud”.\n\nFounders Fund’s shift on crypto, which had been one of its core positions, was one of about nine big exits the venture fund made between 2020 and the end of last year that allowed it to return roughly $US13 billion to investors.\n\nOther exits also included the initial public offerings of companies it had backed since their early fundraisings, such as Airbnb and Palantir, the data analytics group that Mr Thiel co-founded.\n\nAdvertisement\n\nMr Thiel co-founded PayPal in 1998 and went on to become one of Silicon Valley’s most successful investors, including being the first venture capitalist to back Facebook.\n\nFounders Fund has more than $US11 billion under management, including $US5 billion of capital raised across two funds last year, and has taken stakes in more than 100 companies, such as Elon Musk’s SpaceX, ride-hailing app Lyft and defence tech group Anduril.\n\nThe fund is in talks to take an equity stake in OpenAI, the developer behind chatbot ChatGPT, at a valuation of $US29 billion.\n\nFinancial Times"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL2Rhdm9zLWJpdGNvaW4tbWVyY2VkZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Owner of Infamous Davos Bitcoin Car Gets Sensitive Over Crypto Criticism - Futurism",
        "content": "\"If someone made bad decisions and lost money, it's their fault and not my car's.\"\n\nMercedes-Bitcoin\n\nEarlier this week, attendees at the World Economic Forum spotted a mysterious Bitcoin-branded Mercedes sports car parked near the event in Davos, Switzerland, which immediately drew criticism for its flashy display of opulence in the wake of last year's devastating crypto crash.\n\nNow, the owner of the vehicle has come forward — and he has a lot to say to his haters, CNBC reports.\n\nAs it turns out, the coupe's proud owner is Michael Chobanian, the founder of the Ukraine-based crypto exchange Kuna.\n\n\"How is the crash related to my property?\" he told the outlet. \"I am [in the] crypto and finance industry for ten years. I am not selling anything, nor promoting.\"\n\n\"If someone made bad decisions and lost money,\" Chobanian added, \"it's their fault and not my car's.\"\n\nIn other words, neither the Davos Bitcoin-mobile nor its testy owner are responsible for the 2022 crypto crashes. You heard it here first, folks.\n\n6/ \"What you also see in @Davos Switzerland is something like this vehicle, this beautiful #Mercedes Sports car and I wanna point out something that's extremely special about it...There is a #Bitcoin logo in the hood ornament right there on this car\" $HBARhttps://t.co/2K9WC3d4P9 pic.twitter.com/XZ4biPlxZ7 — Dany Eid (@DanyEid_) January 18, 2023\n\nCrypto Row\n\nThe Bitcoin-orange Mercedes, emblazoned with the currency's logo in the place of its German manufacturer's, has drawn both accolades from crypto industry types and jeers from critics.\n\nCritics were quick to point out that the car was one of the only remaining callbacks to the golden days of crypto at the gathering following a devastating year for the industry — and that it was ironically stationed near the so-called \"Blockchain Hub,\" which had become to be known as Davos' \"Crypto Row\" over the years.\n\nPlacing Blame\n\nWhile Chobanian's choice of parking location was interpreted as a symbol for the seeming death of the crypto industry, he said he parked there for a much more mundane reason, suggesting it was all one big coincidence.\n\n\"The car is there because this is the closest parking spot that I found,\" he told CNBC.\n\nMore on crypto: Harvard Finance Professor: Crypto Is \"Magical Thinking\" That \"Infected Capitalism\""
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZ2xvYmV0cmVuZGVyLmNvbS8yMDIzLzAxLzE5L3Jldm9sdXQtZW5hYmxlcy1jcnlwdG8tcGF5bWVudHMtZm9yLWV2ZXJ5ZGF5LXNwZW5kaW5nL9IBXmh0dHBzOi8vZ2xvYmV0cmVuZGVyLmNvbS8yMDIzLzAxLzE5L3Jldm9sdXQtZW5hYmxlcy1jcnlwdG8tcGF5bWVudHMtZm9yLWV2ZXJ5ZGF5LXNwZW5kaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Revolut enables crypto payments for everyday spending - Globetrender",
        "content": "Revolut is enabling users to buy products, book flights and pay for vacations with crypto – just like any other global currency – all via its mobile finance app. Rose Dykins reports\n\nUsers of finance app Revolut are now able to make purchases and pay their bills with certain cryptocurrencie via a new “spend from crypto” feature.\n\nWhat’s more, first-time investors in the cryptocurrency realm will be able to use Revolut to explore this as an opportunity and invest in the digital currency for as little as US$1, and monitor the changing value of their investment via the app.\n\nRevolut’s new service helps users invest in Bitcoin, Ether and more than 90 other tokens from more than 30 cryptocurrency service. The app can be used to buy, sell or trade crypto with friends.\n\nOnce the app has been synced with a designated payment card, it’s possible to make payments with your preferred cryptocurrency for everyday transactions (exchange fees will apply). Payments can also be rounded up with the spare change invested back into crypto investment.\n\nThe app will also help users monitor the fluctuations of the crypto trading market through notifications and news updates, and set target prices for crypto investments – receiving an in-app notification when an investment has matured to reach a set target price.\n\nIn other news, finance app Moneygram has also launched a cryptocurrency service. Users can trade and store Bitcoin, Ethereum and Litecoin via the app. The company expects to increase its future selection of crypto coins as it explores expansion to other markets in 2023.\n\nMoneygram’s cryptocurrency service is made possible through the company’s existing partnership with Coinme, a licensed crypto exchange and crypto-as-a-service provider.\n\nSince 2021, MoneyGram and Coinme have worked in partnership to expand access to crypto by creating thousands of new locations in the US for consumers to buy and sell Bitcoin with cash.\n\nAlex Holmes, chairman and CEO of MoneyGram, says: “Cryptocurrencies are additive to everything we’re doing at MoneyGram. MoneyGram enables instant access to over 120 currencies around the globe, and we see crypto and digital currencies as another input and output option.\n\n“As a next step in the evolution of MoneyGram, we’re thrilled to provide our customers with access to a trusted and easy-to-use platform to securely buy, sell and hold select cryptocurrencies.\n\nHe adds: “As consumer interest in digital currencies continues to accelerate, we are uniquely positioned to meet that demand and bridge the gap between blockchain and traditional financial services thanks to our global network, leading compliance solutions and strong culture of fintech innovation. We are excited for this next chapter in our journey.”\n\nGerman digital bank N26 is also expanding its crypto trading offering from Austria to five new markets – Germany, Switzerland, Belgium, Portugal and Ireland."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL25ld3MvanBtb3JnYW4tY2VvLWNhbGxzLWJpdGNvaW4tYS1oeXBlZC11cC1mcmF1ZC1hbmQtY3J5cHRvLWEtd2FzdGUtb2YtdGltZS01OTA4MDUuaHRtbNIBfGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL2FtcC93b3J0aC9uZXdzL2pwbW9yZ2FuLWNlby1jYWxscy1iaXRjb2luLWEtaHlwZWQtdXAtZnJhdWQtYW5kLWNyeXB0by1hLXdhc3RlLW9mLXRpbWUtNTkwODA1Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "CEO Of US' Biggest Bank JPMorgan Calls Bitcoin A ‘Hyped-Up Fraud’ & Crypto A ‘Waste Of Time’ - Indiatimes.com",
        "content": "At a time when a strong start to 2023 has upped crypto investors' hopes for the industry’s bounce back this year, the CEO of the US’ biggest bank, JPMorgan Chase, Jamie Dimon, has bashed cryptocurrencies.\n\n\n\n\"Bitcoin Is Itself A Hyped-Up Fraud\"\n\nunsplash\n\nOn being asked about bitcoin at the World Economic Forum in Davos, Switzerland, JP Morgan's CEO told CNBC at the event “Why they waste any breath discussing the cryptocurrency. Bitcoin itself is a hyped-up fraud, a pet rock.”\n\n\n\nA few months ago, the US banking giant's CEO also warned about a recession hitting the US as well as the global economy in the middle of 2023.\n\n\n\nAlso Read: Why JPMorgan Was Fined $200mn For Using Whatsapp\n\n\"Not Surprised With FTX Failure\"\n\nThe JPMorgan CEO also weighed in on the ongoing saga with bankrupt crypto exchange FTX.\n\nReuters\n\nCEO Dimon stated that he was not surprised to see FTX fail and declare bankruptcy, and referred to it as a Ponzi scheme.\n\nWhen asked if he thought the cryptocurrency sector as a whole was a Ponzi scheme, he said, \"You guys have all seen the analysis of Tether and all these things, the lack of disclosures, it's outrageous. Regulators should have stopped this a long time ago. People have lost billions of dollars if you look at its lower-income people, in some cases retirees.\"\n\n\n\nThis isn't the first time JPMorgan's CEO has bashed cryptocurrencies. Jamie Dimon has been a vocal opponent of Bitcoin for a long time. Last year, he compared Bitcoin to a Ponzi scheme, like the infamous, decades-long scam run by Wall Street titan Bernie Madoff, as per a Forbes report.\n\nAlso Read: RBI Governor Says Next Financial Crisis Will Come From Private Crypto\n\nJPMorgan’s Crypto & Blockchain Projects\n\nreuters\n\nWhile JPMorgan’s CEO does seem to be totally against Bitcoin and crypto in general, it’s clear that as the biggest bank in the US, the company understands the need to hedge their bets.\n\n\n\nThe company is actively involved in the development of blockchain implementations into their services, and they’ve even created their own proprietary token, JPM Coin. This token has a specific use case within their system, being used for intraday repurchase agreements, as the report mentioned.\n\nAlso known as repos or RP, intraday repurchase agreements are short-term loans involving financial institutions. They’re used by big banks to help manage their short-term cash flow or to meet regulatory capital adequacy requirements.\n\nAnd that’s not all. Last year, in November, JPMorgan Chase also registered a trademark for a new cryptocurrency wallet. The United States Patent and Trademark Office (USPTO) granted JPMorgan Chase Bank’s trademark registration for “J.P. Morgan Wallet” for use in a wide range of financial services, including virtual currency transfers and exchanges as well as crypto payment services. It had applied for it in 2020.\n\nAlso Read: Crypto Will Collapse One Day, Says Rakesh Jhunjhunwala\n\nFor the latest and interesting financial news, keep reading Indiatimes Worth. Click here."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMjAvZmFudG9tLWJsb2NrY2hhaW4tdG8tZnVuZC1lY29zeXN0ZW0tcHJvamVjdHMtdXNpbmctcG9ydGlvbi1vZi1idXJudC1mdG0tZmVlcy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAxLzIwL2ZhbnRvbS1ibG9ja2NoYWluLXRvLWZ1bmQtZWNvc3lzdGVtLXByb2plY3RzLXVzaW5nLXBvcnRpb24tb2YtYnVybnQtZnRtLWZlZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Fantom Blockchain to Fund Ecosystem Projects Using Portion of Burnt FTM Fees - CoinDesk",
        "content": "Risks outlined by the now-passed proposal include malicious approvals of projects requesting funds from the Ecosystem Vault, influential entities or groups funding themselves or promoting projects they control and a project that overpromises and cannot deliver with the received funds."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmlzbGFuZGVjaG8uY28udWsvY2FuLWJpdGNvaW4tdGFrZS10aGUtcGxhY2Utb2YtdGhlLWRvbGxhci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "CAN BITCOIN TAKE THE PLACE OF THE DOLLAR? - Island Echo",
        "content": "We have seen how Bitcoin has reached unexpected and astronomical values, where nobody imagined it could touch $60,000 per unit, completely changing the history of the most used cryptocurrency in the world. Bitcoin mining is best started using the bitqt platform.\n\nThe behavior of Bitcoin in the digital financial market makes the other digital currencies follow in its footsteps, assuming if it all rises and if the opposite is the case, they all move after the first in cryptographic market capitalization.\n\nThe collapse of prices during 2022 has been abrupt, leading Bitcoin to a price that decreased more than 60% from its last historical maximum registered in 2021, which has undoubtedly reduced the other digital instruments, even leading them to disappear.\n\nArticle continues below this advertisement\n\nBitcoin characteristic volatility\n\nBefore the latest bitcoin and cryptocurrency price surge, in a survey of mostly bank executives, Forbes found that most thought bitcoin and digital assets could replace fiat currencies like the US dollar in the next five or ten years.\n\nOn the other hand, other financial analysts warn that there is still a long way to go before cryptocurrencies have a massive adoption that makes them huge as a unit of account and currency of exchange, as well as a store of value.\n\nThis process began to accelerate, mainly after the decision of the payment company PayPal to incorporate Bitcoin as a means of payment. Later, several firms, including Tesla, began to flirt with Bitcoin as a payment currency.\n\nAt the same time, we must not fail to highlight the environmental challenges, considering the high energy consumption required by mining currencies such as Bitcoin.\n\nArticle continues below this advertisement\n\nIt should be remembered that the price of the leading crypto assets tends to experience high volatility despite showing a long-term upward trend.\n\nBlockchain and central banks\n\nThe modernization of traditional banking is under pressure due to the versatility and security offered by the blockchain in terms of recording and monitoring of operations, where no one can alter them, which has led these institutions to consider the creation of digital currencies to diversify their service portfolio and streamline international processes to compete with the cryptocurrency model.\n\nWe could be facing a scenario of updating traditional banking, where the processes could be more transparent, less cumbersome, and without so much bureaucracy involved, as well as the opportunity is given to users to be the owners of their capital without the possibility of executing a transaction is in the hands of third parties.\n\nArticle continues below this advertisement\n\nIt is projected that the euro and the digital dollar will not replace each other’s fiat currency; they will only complement the need to make electronic payments.\n\nBitcoin is a market capitalization that came out of nowhere\n\nWhile cryptocurrencies have the potential to become an alternative asset class, their prices are likely to remain highly volatile and attract more speculative investors, the Swiss Financial Services Company (UBS) noted.\n\nMassive dollar liquidity and network effects are the most substantial headwinds against Bitcoin’s rise, Voorhees told Decrypt, noting that Bitcoin has gone from nothing to a trillion-dollar market cap for a decade. . “Bitcoin is gaining its network effect over time,” he said.\n\nThere are still many people who do not know what cryptocurrencies are, and even more who have heard of them but do not understand them; only when this happens Bitcoin or another cryptocurrency will have taken over.\n\nBitcoin is here to stay, leading the digital cryptocurrency market, demonstrating year after year how its volatility has shown it to have incredible value and still without knowing how much it will be worth in a few years.\n\nConclusions\n\nAll this has created significant uncertainty, and for this reason, it has come to be thought that it can replace one of the most important currencies in the world, but to achieve this goal, a massive adaptation to a new digital world must occur market for many, uncertain for others.\n\nIt is not as easy as it is said, but every day we are more on the path to transcending a digital world controlled by this crypto-asset market.\n\nAt the moment, it is hard to assume that cryptocurrencies can replace the dollar or any other strong currency on the market; however, it does not have any support; It is the currency that countries recognize as par excellence.\n\nOver the years, electronic transactions will continue to replace the use of physical money, where cryptocurrencies will act to position themselves as the digital currency par excellence."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZmluYm9sZC5jb20vbWlhbWktbWF5b3Itc2F5cy1zYWxhcnktaW5jcmVhc2VkLXNpbmNlLWhlLWJlZ2FuLWVhcm5pbmctYml0Y29pbi1kZXNwaXRlLWJlYXItbWFya2V0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Miami mayor says salary increased since he began earning Bitcoin despite bear market - Finbold - Finance in Bold",
        "content": "Miami Mayor Francis Suarez has revealed that he still receives his salary in Bitcoin (BTC), despite the extended bear market, noting that the decision has been ‘a good investment.’\n\nAccording to Suarez, his salary has increased since making the shift while stating the rise has emerged from taking advantage of price fluctuations, considering he earns after every two weeks, he said during an interview on CNBC’s Squawk Box show on January 19.\n\n“Sometimes people misunderstand that you’re buying it every two weeks, you’re buying it in the fluctuations. Since I bought it or since I started taking my salary in Bitcoin, my salary is up; it’s been a good investment. I think that’s part of the problem with this conversation about Bitcoin,” Suarez said.\n\nHowever, he clarified that the salary increment is not a result of trading. Suarez also pointed out there is a need for patience when dealing with Bitcoin and blockchain technology due to the early stages of development.\n\nGrowing confidence in Bitcoin\n\nAlthough Suarez’s decision was initially viewed as unusual, it is a testament to the growing acceptance of cryptocurrencies and their potential as an investment. In this line, a Finbold report indicated that crypto adoption accelerated in 2022 despite the prevailing bear market.\n\nSuarez’s decision to receive a portion of his salary in Bitcoin is a notable move, as it highlights public officials’ and institutions’ growing acceptance of cryptocurrencies.\n\nFor instance, New York City’s mayor Eric Adams also announced that he would receive his first three paychecks in Bitcoin as a vote of confidence in the maiden cryptocurrency.\n\nMiami’s crypto city initiative\n\nIt is worth noting that the mayor of Miami has been advocating for crypto businesses to set up bases in the city, aiming to make it a digital asset capital of the United States.\n\nAs reported by Finbold, Suarez was at some point influential in attempting to lure Chinese Bitcoin miners into setting up shop in the city after the activity was banned in the Asian country.\n\nThe official indicated he would spur conversations with power distributors to lower energy prices, considering miners prefer operating in regions with cheaper electricity.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYm9sZC5jb20vanBtb3JnYW4tY2VvLXNsYW1zLWJpdGNvaW4tYXMtYS1oeXBlZC11cC1mcmF1ZC1hbmQtcGV0LXJvY2sv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "JPMorgan CEO slams Bitcoin as 'a hyped-up fraud' and 'pet rock' - Finbold - Finance in Bold",
        "content": "JPMorgan Chase (NYSE: JPM) CEO Jamie Dimon has continued to express his disapproval of Bitcoin (BTC) and other cryptocurrencies after he last year compared Bitcoin to a “Ponzi scheme.”\n\nDuring an appearance on CNBC’s Squawk Box on January 19, Dimon was questioned about his most recent stance on cryptocurrencies. In response, he asked the panel why they “waste any breath” discussing the subject before taking a dig at the flagship digital asset, “Bitcoin itself is a hyped-up fraud, a pet rock.”\n\nAlthough talking about the qualities of blockchain and ledger technology that JPMorgan thinks can be deployable as money, he questioned whether Bitcoin really is a store of value or as scarce as it’s supposed to be.\n\n“How do you know it [Bitcoin] is going to stop at 21 million? Maybe it’s going to get to 21 million, and Satoshi’s picture is going to come up and laugh at you all.”\n\nDimon’s reaction to FTX collapse\n\nThe JPMorgan CEO also admittedly revealed he was ‘not surprised at all’ by the failure and subsequent bankruptcy of FTX, once one of the leading crypto exchanges in the world, ‘I called it a decentralized Ponzi scheme.’\n\nDebated about saying whether cryptocurrency technology itself is a decentralized Ponzi scheme and what happened to FTX are two different things to which he replied.\n\n“You guys have all seen the analysis of Tether and all these things, the lack of disclosures, its outrages. Regulators should have stopped this a long time ago. People have lost billions of dollars if you look at its lower-income people, in some cases retirees.”\n\nHe added:\n\n“Crypto itself doesn’t do anything. It’s a pet rock, and you can own it all you want. I don’t care about Bitcoin, so we should drop the subject.”\n\nDimon is known to be a major skeptic of cryptocurrencies, having previously called Bitcoin a ‘fraud.’ Despite Dimon’s criticism of Bitcoin, JPMorgan allows transfers to buy crypto and is actively involved with incorporating blockchain into its services. For instance, the lender has its token dubbed JPM Coin for intraday repurchase agreements. While in December, the bank officially registered a cryptocurrency wallet trademark.\n\nFeatured image via NBC News YouTube."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS13aXRoLTcwLWhpc3RvcmljYWwtYWNjdXJhY3ktc2V0cy1iaXRjb2luLXByaWNlLWZvci1qYW51YXJ5LTMxLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Crypto community with 70% historical accuracy sets Bitcoin price for January 31, 2023 - Finbold - Finance in Bold",
        "content": "After a brief bullish rally, the general cryptocurrency market has again woken up in a sea of red, and Bitcoin (BTC) is down more than 2%, leading to less optimistic expectations of the crypto community about the future price of the maiden digital asset.\n\nIndeed, the votes cast by the members of the crypto tracking platform CoinMarketCap project that Bitcoin will be changing hands at the average price of $19.368 on January 31, 2023, according to the data retrieved by Finbold on January 19.\n\nShould the estimations of 19,438 member votes prove true, it would mean that the price of Bitcoin by the end of January will decline further by -6.64% or -$1,377 compared to its current value, which at press time stood at $20,745.\n\nBitcoin social average price prediction. Source: CoinMarketCap\n\nTaking into consideration the performance of the crypto community’s projections for the six previous months, it has historically set the price of the flagship decentralized finance (DeFi) token with an accuracy rate of 71.75%.\n\nBitcoin social estimation accuracy. Source: CoinMarketCap\n\nMeanwhile, the machine learning algorithms at PricePredictions have earlier projected that Bitcoin would likely climb to trade at $21,382 on February 1, 2023. Unlike the crypto community, the machine algorithm continues to be bullish, more recently setting the price at $21,239.\n\nBitcoin 30-day price forecast chart. Source: PricePredictions\n\nFurthermore, Bitcoin’s technical analysis (TA) on TradingView’s 1-day gauges remains positive, its summary aligning with the ‘buy’ sentiment at 14, which is the result of oscillators pointing at ‘buy’ at 2, and moving averages (MA) indicating a ‘strong buy’ at 12.\n\nBitcoin 1-day technical analysis. Source: TradingView\n\nBitcoin price analysis\n\nWith the announced bankruptcy of crypto lender Genesis likely at fault for interrupting Bitcoin’s 2023 winning streak, the asset has now dropped 2.19% in the past 24 hours, although it is still recording an increase of 14.10% across the previous week and 23.33% on its monthly chart, as per the data retrieved by Finbold on January 19.\n\nBitcoin 24-hour price chart. Source: Finbold\n\nNotably, Bitcoin’s 24-hour trading volume has increased from $24.27 billion on January 12 to $29.68 billion at the time of publication, which means it has grown 21.79% in seven days, during which time its market capitalization received an influx of nearly $50 billion.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYm9sZC5jb20vd2FudC10by1taW5lLWJpdGNvaW4tdXNpbmctc29sYXItcGFuZWxzLWhlcmVzLWhvdy1tYW55LXlvdWxsLW5lZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Want to mine Bitcoin using solar panels? Here's how many you'll need - Finbold - Finance in Bold",
        "content": "Mining is one of the most popular ways for individuals and organizations to earn cryptocurrencies such as Bitcoin (BTC) through passive income, but critics have often drawn attention to the energy used up in the process of transaction verification using the Proof-of-Work (PoW) algorithm.\n\nWith this in mind, crypto YouTuber Drew Vosk has looked into a more ecologically acceptable way to produce electricity for Bitcoin mining – solar panels – and has analyzed the numbers in a video published on his channel on January 18.\n\nCrunching the numbers\n\nThe basic formula to calculate how many solar panels are needed for a mining rig includes taking one’s monthly electric usage, dividing it by monthly peak sun hours, and multiplying the result by 1,000. Then, the resulting number is divided by the power rating of the solar panel.\n\nFormula to calculate how many solar panels are needed to mine BTC. Source: VoskCoin\n\nPutting this in practice, an Antminer S19 uses 72 kWh per day, which multiplied by 30 days equals 2,160 kWh per month. This number is then divided by the number of monthly peak sun hours, say 156, which gives 13,84. Multiplying this by 1,000 results in 13,846 watts.\n\nThen, taking a standard 400-watt solar panel, this number is divided by 400, which gives 34.6. Rounded off, this means 35 solar panels are needed to run one mining rig. In other words, you would need a 14kWh solar system to mine Bitcoin using solar power.\n\nVosk also advises keeping in mind that how much energy one can earn from the sun varies with their location on Earth. For example, this would never be feasible in London, United Kingdom, as nearly twice as many solar panels would be needed due to its weather.\n\nCostly endeavor\n\nIn the United States, 15kWh of solar panels costs $31,191 thanks to the tax breaks on buying them (without tax breaks, this number would be $42,150). In terms of return on investment, $31,000 to power one Bitcoin miner 24/7 would be a rather expensive endeavor.\n\nTo put this into perspective:\n\n“At 10 cents per kWh, you could pay your electric company 10 years at current rates to operate this miner instead of setting up the solar panels. When you deal with solar energy, we’re talking years – not months, not weeks, definitely not days – as far as ROI, break-even,” Vosk said.\n\nHowever, the crypto YouTuber also believes that “nothing is cooler than generating your own electricity” and “when you throw the electric waste argument out the window when it comes to crypto and especially mining, well, then it’s truly a beautiful and powerful, indisputable thing.”\n\nBut is it profitable?\n\nThat said, setting up a solar power system for a farm of 10 mining units would cost about $258,000. Right now, the break-even period would be projected to be about 10 years. Running 25 units would require about $645,000 in the solar setup, and an investment of $1,790,000 would be needed to deploy 50 mining units. However, the monthly mining income from this would be about $29,730.\n\nFor instance, an innovative and eco-friendly Bitcoin mining pool, PEGA Pool, offers miners that use renewable energy only 1% mining fees, which is half of the industry standard of 2%, thus increasing mining profitability.\n\nAlthough Vosk admits that solar-powered Bitcoin mining would take a long time to break even, he stresses to “keep in mind Bitcoin’s low – all you need to do is ‘hodl‘ some coin, things go decently, and that number will dramatically decrease,” as well as that “all Bitcoin all-time highs have been preceded by a new Bitcoin halving.”\n\nInterestingly, the first solar-power Bitcoin mining plant in South Australia has recently opened, providing about five mW of electricity in an effort to curb the carbon footprint of mining the flagship decentralized finance (DeFi) asset.\n\nIn March 2022, Finbold reported on Peter Egyed, also known as AZ Hodl, installing an off-grid solar array to power his Bitcoin mining operation and shared the results of his findings, according to which he expected to make an ROI within 36 months.\n\nWatch the entire video below:"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy50aGVjb2lucmVwdWJsaWMuY29tLzIwMjMvMDEvMTkvYml0Y29pbi1wcmljZS1wcmVkaWN0aW9uLXdpbGwtYnRjLXByaWNlLXJlYWNoLTI1MDAwLW1hcmstYmVmb3JlLXRoZS1maXJzdC1xdWFydGVyLW9mLTIwMjMtZW5kcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Price Prediction : Will BTC Price reach $25,000 mark, Before the first quarter of 2023 ends ? - The Coin Republic",
        "content": "BTC price formed a double bottom pattern and have succeeded to breakout of neckline resistance at $18,385\n\nBitcoin crypto price had sustained above 50 day EMA but it is struggling to breakout of the 200 day EMA hurdle\n\nBTC price is showing signs of long term base formation near $20,000\n\nBitcoin price is trading with mild bullish cues and bulls are attempting to break out of the 200 day EMA. According to Coingalss, $21,000 strike price holds a Call open interest at 15.27K BTC and Put at 3.97K BTC which clearly indicates the strength of buyers. Currently, The pair of BTC/USD is trading at $20,821.76 with an intraday gains of 0.71% and the 24-hour volume to market cap ratio at 0.0745\n\nBTC price turned bullish and formed three white shoulder pattern\n\nSource : BTC/USD daily chart by Tradingview\n\nOn a daily time frame, BTC price had shown a surprising rally of 3000 points in a short span of time and formed a double bottom bullish reversal pattern. From the past couple of months BTC price got stuck in the narrow range between $15,500 to $18,000 and experts have turned highly bearish and are expecting more downside in the BTC prices but market chooses the opposite direction and shot up 32% approx from the lows.\n\nBTC price had succeeded to reclaim the 50 day EMA (yellow)which had reversed the short term trend in the favor of bulls but unfortunately the positional trend is still in the bear grip as prices struggled at the 200 day EMA(green). However, In the coming weeks, If BTC bulls will be able to break out of the 200 day EMA and $21,500 hurdle level we may see the next phase of rally in the short span of time which can take BTC to the $25,000 level\n\nAccording to technical analysis, BTC prices are expected to consolidate in the range between $18,500 to $25,000 in the coming months and if any minor correction triggers from the higher level, it will provide an opportunity for investors and traders to build fresh long positions. On the lower side $18,000 and $16,000 will act as a demand zone for investors. The MACD had generated positive crossover but the curve is sloping sideways denotes prices are lacking the momentum near the supply zone and the RSI at 78 denotes the overbought level.\n\nSummary\n\nBitcoin prices had shot up 30% from the lows and formed a three white shoulder bullish pattern which indicates the buyers dominance on the lower levels. The technical analysis suggests that BTC price may enter into the short term consolidation but eventually it will break out of upside. Therefore, traders may look for buying opportunities for the target of $25,000 and above by keeping $18,500 as SL. However if prices slipped below $18,500 bears may try to test $16,000 again.\n\nTechnical levels\n\nResistance levels : $21,500 and $25,100\n\nSupport levels : $18,000 and $16,000\n\nDisclaimer\n\nThe views and opinions stated by the author, or any people named in this article, are for informational purposes only, and they do not establish financial, investment, or other advice. Investing in or trading crypto assets comes with a risk of financial loss."
    }
]