[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI5L2JpdGNvaW4tYnV5ZXItcXVpZXRseS1hY2N1bXVsYXRlcy00MjRtLW9mLWJ0Yy1pbi10aHJlZS13ZWVrcy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yOS9iaXRjb2luLWJ1eWVyLXF1aWV0bHktYWNjdW11bGF0ZXMtNDI0bS1vZi1idGMtaW4tdGhyZWUtd2Vla3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Buyer Quietly Accumulates $424M of BTC in 3 Weeks - CoinDesk",
        "content": "There's been some online speculation that the wallet could be tied to one of a number of U.S. asset management giants hoping to soon be granted regulatory permission to launch a spot bitcoin ETF, though it's not clear if such \"frontrunning\" is even allowed."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5ldXJvbmV3cy5jb20vbmV4dC8yMDIzLzExLzI5L2p1c3Qtb25lLWJpdGNvaW4tdHJhbnNhY3Rpb24tY29uc3VtZXMtdGhlLXNhbWUtYW1vdW50LW9mLXdhdGVyLXVzZWQtdG8tZmlsbC1hLXN3aW1taW5nLXBvb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "A Bitcoin transaction uses the same amount of water as a swimming pool - Euronews",
        "content": "Bitcoin could make a change to make the cryptocurrency more environmentally friendly.\n\nADVERTISEMENT\n\nA single Bitcoin transaction could use the same amount of water needed to fill a garden swimming pool, according to a new study on the world’s most popular cryptocurrency.\n\nIt estimates that in 2021 Bitcoin mining, used in part to create new Bitcoins, consumed over 1,600 gigalitres of water worldwide with each Bitcoin transaction using 16,000 litres of water on average.\n\nThe sheer scale of Bitcoin mining’s water consumption could impact drinking water if it continues to operate without regulation, especially in countries that are already battling water scarcity, including the United States, the study published in the journal Cell Reports Sustainability on Wednesday argued.\n\nMining Bitcoin requires huge computing power to solve mathematical equations on the Internet. Correct answers are then rewarded with a share of Bitcoin’s value.\n\nWater, which is evaporated, is used to cool the computers at large data centres and also to lower the temperature of coal-and-gas-fired power plants that also power Bitcoin mining computers.\n\n“It's just one backyard swimming pool going, going up in the air, literally evaporating on average per Bitcoin transaction,” said Alex de Vries, the study’s author and Ph.D. student at Vrije Universiteit Amsterdam.\n\nThe environmental impact of mining Bitcoin has been widely documented, with the latest data from the United Nations University, showing that the crypto’s energy consumption for the year 2020 was more than the total energy consumption of a country like Pakistan for the same period.\n\nHowever, how much water a Bitcoin transaction uses has been scarcely reported and is likely to increase.\n\nWith the rise in Bitcoin’s price to over $38,000 (€34,600), up almost five per cent in a week, de Vries said he expected Bitcoin’s water consumption to also increase to 2,300 gigalitres, up more than 40 per cent compared to 2021.\n\nThe report argues this will be a problem for countries in Central Asia, such as Bitcoin mining hub Kazakhstan, where the dry climate is putting pressure on freshwater supplies.\n\nThe US also uses a lot of water for Bitcoin mining, which is responsible for consuming as much water as 300,000 US households or a city like Washington, DC, the study estimated.\n\nThe real solution and the losing game\n\nDe Vries argues that using renewable energy instead of electricity would not be a solution to reducing Bitcoin’s carbon footprint.\n\n“Do you really want to spend wind and solar power for crypto? In many countries, including the US, the amount of renewable energy is limited. Surely you can move some of these renewable energy sources to crypto, but that means something else will be powered with fossil fuels,” he said.\n\nBy the year 2040, the last Bitcoin will be mined and then there's not going to be any money going to these miners. Alex de Vries Author of the study\n\nBut he argues if Bitcoin changed its technology to be more environmentally friendly, the crypto’s environmental damage would reverse overnight.\n\nBitcoin uses the Proof of Work model, which works like a competitive numeric guessing game and the first person to solve the puzzle is awarded a fixed amount of cryptocurrency.\n\nIt requires a global network of computers to run at the same time when a transaction takes place and therefore a lot of energy.\n\nBut in the Proof of Stake system, you do not need the energy-consuming hardware as you acquire coins, which are put up as collateral in the staking process and there is then a random selection through the software.\n\nHow powerful your machine is does not increase your chance of winning and being able to create the next block for the blockchain. The only thing that increases your chance of winning is just getting more coins.\n\nADVERTISEMENT\n\nThe second-largest crypto Ethereum made the change to Proof of Stake in 2022 and remains just as popular today.\n\nBitcoin could make the same change but de Vries argues Bitcoin miners are more traditional and do not want to rock the boat to keep their investment.\n\n“Not changing stuff is what gives Bitcoin value, even though actually not changing stuff is probably the riskiest thing they can do,” he said.\n\n“The amount of coins being mined just keeps decreasing. And by the year 2040, the last Bitcoin will be mined and then there's not going to be any money going to these miners.\n\n“So in the long run, they're kind of playing this losing game”."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9iaXRjb2luLWV0Zi1jcnlwdG8taW52ZXN0bWVudHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Fresh Bitcoin Hype Shows Crypto Just Can't Help Itself - WIRED",
        "content": "The prospect that US residents may soon be able to invest in bitcoin through their brokerage, as if it were a regular stock, has prompted a fresh round of hype in crypto circles—and a surge in crypto prices.\n\nSeveral investment firms, including heavy-hitters like BlackRock and Fidelity, are queuing up to launch a spot bitcoin exchange-traded fund (ETF) in the US. These funds would track the price of bitcoin, making them the closest thing to investing in the crypto token directly without dealing with a crypto exchange or storing crypto manually, a process fraught with risk.\n\nAfter a bruising 18 months in which crypto prices buckled, high-profile businesses collapsed, and two crypto figureheads were convicted of crimes in the US, the crypto industry is supposed to be cleaning up its act. That the US Securities and Exchange Commission (SEC) appears to be entertaining a spot bitcoin ETF after years of resistance is seen by some as a signal that crypto is moving beyond its free-wheeling years.\n\nThe arrival of such a fund in the US—by far the world’s largest ETF market—“is a significant milestone,” says Samson Mow, a prominent bitcoin evangelist and CEO of bitcoin-centric technology firm JAN3, as it will allow investors to hold bitcoin through a conventional financial product for the first time.\n\nWhile there is broad consensus around the likelihood of an ETF approval among analysts, the idea that it would be symbolic of the industry’s coming of age is contradicted by the frenzy of speculation around what will happen to the price of bitcoin.\n\nOn X, crypto influencers with hundreds of thousands of followers are predicting an ETF will send the price of bitcoin soaring, in posts peppered with the rocket ship emoji. The arrival of a spot bitcoin ETF, claims Mow, will unlock a wave of pent-up demand and lead a “torrent of capital” to “pour into bitcoin.” Institutions and other investors that either cannot or choose not to invest in unregulated financial products will seize the opportunity to invest, he says, driving the price far beyond its previous heights."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5ld3NjaWVudGlzdC5jb20vYXJ0aWNsZS8yNDA0MjE5LWEtc2luZ2xlLWJpdGNvaW4tdHJhbnNhY3Rpb24tdXNlcy1lbm91Z2gtd2F0ZXItdG8tZmlsbC1hLXN3aW1taW5nLXBvb2wv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "A single bitcoin transaction uses enough water to fill a swimming pool - New Scientist",
        "content": "The environmental impact of bitcoin and other cryptocurrencies is increasingly being scrutinised, due to the vast amounts of electricity they consume. Now it seems that water use is also a big problem\n\nThe water consumed by a single bitcoin transaction could fill a small swimming pool Radharc Images / Alamy\n\nBuying or selling bitcoin uses 16,000 litres of clean water for every single transaction, which could exacerbate existing droughts around the world. While the energy consumption and carbon emissions produced by bitcoin and other cryptocurrencies have been well studied, this is the first assessment of its water use and wider environmental impact.\n\nAlex de Vries at the VU Amsterdam School of Business and Economics in the Netherlands has calculated that mining – the computational process that secures the bitcoin network – uses between 8.6 and 35.1 billion litres of water per year in the US alone. He says that bitcoin used 1.6 trillion litres of water globally in 2021, and expects this to rise to 2.3 trillion litres this year. Broken down per transaction, that means a single bitcoin trade consumes 16,000 litres of water – enough to fill a small swimming pool. This is “increasingly hard to defend”, says de Vries.\n\nAdvertisement\n\nThe majority of the water consumption comes from electricity production, such as in coal and gas plants, or throughput in hydroelectric power stations, says de Vries. He used data on the electricity mix at locations where bitcoin mining occurs to calculate the totals, but also factored in that water is also used directly in data centres to cool the powerful hardware used by miners.\n\nWhile bitcoin’s water consumption is a huge environmental problem, it pales in comparison with its energy demands, says de Vries. “The mining devices are effectively just generating random numbers all day long, and they just throw them all away and nothing – nothing – useful comes out,” he says.\n\nAnd while competing cryptocurrency Ethereum has introduced changes which slashed its energy use by 99.99 per cent, which would also reduce water consumption, bitcoin has been reluctant to follow suit – which is partly due to a lack of centralised control to push such decisions through.\n\nSign up to our The Daily newsletter The latest science news delivered to your inbox, every day. Sign up to newsletter\n\n“The software solution is available. It’s just that you are dealing with a community that is fundamentally against any type of changes to their software,” says de Vries. “If you make the change you cut the majority of everything: the carbon emissions, water footprint, electronic waste, it all goes out the window overnight. Literally, the moment you make the software change, it’s all gone. Bitcoin is responsible for half a per cent of global electricity consumption, [and] we could cut this by tomorrow.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzExLzI5LzIzOTc5ODU4L2JpdGNvaW4tbWluZS1jcnlwdG9jdXJyZW5jeS13YXRlci11c2UtYW5hbHlzaXMtZW5lcmd50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "It's not just electricity — Bitcoin mines burn through a lot of water, too - The Verge",
        "content": "Bitcoin mines aren’t just energy-hungry, it turns out they’re thirsty, too. The water consumption tied to a single Bitcoin transaction, on average, could be enough to fill a small backyard pool, according to a new analysis. Bitcoin mines are essentially big data centers, which have become notorious for how much electricity and water they use.\n\nBitcoin’s water footprint is growing, according to the analysis published today in a commentary in the journal Cell Reports Sustainability. That’s an issue to watch as the price of Bitcoin recovers from a spiraling crypto winter.\n\nBitcoin mines are essentially big data centers, which have become notorious for how much electricity and water they use.\n\nThe study was conducted by Alex de Vries, a PhD candidate at Vrije Universiteit Amsterdam whose previous research has tracked cryptocurrencies’ electricity consumption and greenhouse gas emissions. Those issues have moved legislators to push for more oversight of crypto mines’ environmental impact. But until recently, most of that attention has been on whether energy-intensive cryptocurrencies like Bitcoin might throw off countries’ climate goals.\n\nBitcoin mining also has the potential to stress water resources in drought-prone areas. Miners use specialized computers to solve puzzles around the clock to validate transactions and earn Bitcoin in return. All that computing power burns through a lot of energy. And like other data centers, many crypto mines also end up using a good deal of water in their cooling systems to keep machines from overheating.\n\n“It’s sort of hard to surprise me, given how I’ve already worked on this topic I’m kind of used to big numbers popping up. But then again, the numbers are still mind blowing even to me every time I look at it,” de Vries told The Verge.\n\nTo conduct his analysis, de Vries estimated the direct water use from Bitcoin mines’ cooling systems. He also added their indirect water consumption associated with electricity generation, since power plants also use water in cooling systems. All in all, he found that cryptocurrency mining used about 1,600 gigaliters of water in 2021 when the price of Bitcoin peaked at over $65,000. That comes out to a small swimming pool’s worth of water (16,000 liters), on average, for each transaction. It’s about 6.2 million times more water than a credit card swipe, according to de Vries.\n\nOf course, everything dipped in 2022 as the price of Bitcoin plunged and mining slowed. But the price has climbed back up since last year, rising from less than $20,000 to around $38,000 today. The higher the price, the more incentive there is to ramp up mining. That’s why de Vries expects the cryptocurrency’s water consumption to rise to a new high of 2,300 gigaliters worldwide this year. In the US, the biggest hub for Bitcoin mining in the world, Bitcoin mining uses about as much annually as a city the size of Washington, DC.\n\nThese numbers are estimates based on the assumption that the Bitcoin mines run on water-dependent cooling systems typical in large data centers. However, some data centers and crypto mines use a different system that keeps computers cool and cuts down water consumption by immersing them in a non-conductive liquid.\n\nThere’s another way to get the cryptocurrency to use a fraction of the water and electricity it eats up now and slash greenhouse gas emissions: get rid of the mining process altogether and find a new way to validate transactions. That’s what the next biggest cryptocurrency network, Ethereum, accomplished last year."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91bmNoYWluZWQtc3R1ZHktcmV2ZWFscy1vbmUtZm91ci0yMDI4MDAzNzQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Unchained Study Reveals One in Four Americans Own Bitcoin - Yahoo Finance",
        "content": "Unchained study estimates that 86M Americans own bitcoin, 26% of the total population\n\n55% of US investors surveyed by Unchained report owning bitcoin\n\nNew regulation, bitcoin spot ETF approval, and a US recession are the factors most likely to make US investors buy BTC next year\n\nOne-third of US investors expect bitcoin to outperform gold, cash, and the S&P 500 in 2024\n\nAUSTIN, Texas, November 29, 2023--(BUSINESS WIRE)--Unchained, the leading bitcoin financial services provider, today published a report with findings from a survey of US investors on bitcoin (BTC) sentiment and outlook for 2024. Chief among the findings is that one in four Americans and 55% of investors surveyed by unchained — defined by Unchained as having at least one investment account — report owning bitcoin, and 95% of this group say they would buy or strongly consider buying more of it in 2024. Of the 45% of respondents who do not own bitcoin, nearly half say they would strongly consider buying it in 2024.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20231129165815/en/\n\n55% of US investors surveyed by Unchained report owning bitcoin. Nearly all (95%) of this group say they'd consider buying more BTC in 2024. (Graphic: Business Wire)\n\nRegulation is poised to be the top catalyst for both bitcoin owners and non-owners in the year ahead. When asked which factor is most likely to make them buy or strongly consider buying bitcoin in 2024, 42% of BTC owners and 35% of non-owners said increased US regulatory clarity around digital assets. Other popular factors include:\n\nSEC approval of a bitcoin spot ETF — 29% of BTC owners; 13% of non-owners\n\nUS economic recession — 18% of BTC owners; 12% of non-owners\n\nGuidance from a financial advisor — 6% of BTC owners; 26% of non-owners\n\nNotably, US investors are largely optimistic about bitcoin’s future performance, regardless of whether they own the asset. Most (79%) expect BTC to eventually pass its all-time high of $69,000, despite the asset’s price being down over 50%1 from this during the survey. Over half (55%) of investors predict BTC will reach a new all-time high in 2024, with 28% believing it will be H1 and 26% saying H2 2024. Further, one-third of investors (34%) think BTC will outperform cash, gold, and the S&P 500 in 2024.\n\nStory continues\n\nThe next year is likely to see a rise of bitcoin allocation in retirement portfolios, according to Unchained’s survey results. While nearly half of US bitcoin owners report already having BTC in their retirement account, an additional third (35%) say they would consider adding it to their 401(k), IRA, or other plan in 2024. Among non-bitcoin owners who are open to investing in the asset, 23% say they would consider adding BTC to their retirement account next year.\n\n\"At Unchained, we are seeing an influx of bitcoin newcomers who now understand that the asset has longevity,\" said Joe Kelly, co-founder and CEO of Unchained. \"As reflected in both Unchained’s survey results and the activity of our clients, US investors are eager to gain or expand bitcoin exposure — especially through tax-advantaged vehicles like Unchained’s bitcoin IRA. As more investors look to open or grow their bitcoin positions, Unchained looks forward to serving them whether it be through collaborative custody, the Unchained IRA, our trading desk, or our inheritance solutions.\"\n\nWith an estimated 158 million Americans owning some type of investment account2, Unchained’s \"US Investor Outlook for BTC in 2024\" survey sample size of 402 individuals is representative of the US investor population with a 5% margin of error at a 95% confidence level. To qualify for this survey, respondents were required to be permanent residents of the US between the ages of 18 and 78 and self-report as having one or more current financial investment(s). The survey was conducted digitally from October 26 to 28, 2023, during which time the price of bitcoin ranged from $33,610 to $34,9771.\n\nRead the full report on Unchained’s survey of US investor bitcoin sentiment and outlook for 2024 here.\n\nFor more information on Unchained, please visit www.unchained.com.\n\nAbout Unchained\n\nFounded in 2016, Unchained is a top 10 bitcoin platform by assets secured and has helped thousands of individuals and businesses truly own their wealth by holding bitcoin keys. Unchained's collaborative custody model allows clients to access financial services while continuing to have the benefits of self-custody, the ultimate consumer protection in these uncertain times. For more information on Unchained, please visit www.unchained.com.\n\nThese survey results do not represent the opinions or advice of Unchained Capital, Inc. or its affiliates (collectively \"Unchained\"), any employees of Unchained, or of any qualified investment advisor. Survey respondents were not qualified investment advisors. No representations are made that any survey methods are accurate or correspond with relevant industry practice. Do not make financial decisions based upon the results of this survey, and instead consult with a qualified investment advisor of your choice.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20231129165815/en/\n\nContacts\n\nLarissa Bundziak\n\nlarissa@unchained.com"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTI5L2dhbGF4eS1zLW5vdm9ncmF0ei1zZWVzLWJpdGNvaW4tYnRjLXJlYWNoaW5nLW9sZC1oaWdocy13aXRoLWV0Zi1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Will Reach Its Old Highs With ETF Approval, Galaxy's Novogratz Predicts - Bloomberg",
        "content": "Michael Novogratz predicts that Bitcoin is poised to reach its former peak a year from now, as anticipation builds over the likelihood that the US Securities and Exchange Commission will approve the first American exchange-traded fund to directly hold Bitcoin.\n\n“Could we go to old highs by this time next year?” Novogratz, the founder and chief executive officer of Galaxy Digital Holdings Ltd., said during on interview on Bloomberg TV on Wednesday. “Of course.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvMS10b3AtY3J5cHRvLXN0b2NrLXRvLWJ1eS1mb3ItYml0Y29pbi1leHBvc3VyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "1 Top Crypto Stock to Buy for Bitcoin Exposure - Nasdaq",
        "content": "Investing in cryptocurrencies, such as Bitcoin (BTCUSD), has helped investors derive game-changing returns over the past decade. Bitcoin prices have surged 120x in the last eight years, 7x in the last five years, and more than doubled in 2023. Despite these market-thumping returns, Bitcoin is also down 40% from all-time highs, allowing investors to buy the dip.\n\nBitcoin is a decentralized cryptocurrency, which means it is not governed by any regulatory authority such as a central bank. It uses peer-to-peer technology and blockchain technology to record transactions - effectively, a distributed public ledger that can be verified or accessed by anyone. Miners verify and process these transactions and are rewarded with a set amount of BTC, as well as transaction fees.\n\nBitcoin was created 15 years ago, and the first block was mined in January 2009. The total supply of BTC is limited to 21 million, making it deflationary in nature. More than 19 million BTC have already been mined and are in circulation.\n\nInvestors can gain exposure to this alternate asset class by purchasing Bitcoin and other cryptocurrencies on exchanges such as Coinbase (COIN). Further, you can buy shares of Coinbase and other crypto-related stocks to gain exposure to digital assets by proxy.\n\nAnother way is to buy shares of MicroStrategy (MSTR), which acts as a Bitcoin holding company. Let’s see why.\n\nwww.barchart.com\n\nMicroStrategy Goes Big on Bitcoin\n\nValued at $7.34 billion by market cap, MicroStrategy provides enterprise-facing analytics software and services. In Q3 of 2023, MicroStrategy reported revenue of $129.5 million, an increase of 3.3% year over year.\n\nWhile it is involved in the enterprise software segment, the CEO of MicroStrategy, Michael Saylor, is quite bullish on Bitcoin, and has famously allocated significant company resources to purchase BTC over the years. While MSTR has $45 million in cash, it also holds 140,000 Bitcoin worth over $4.4 billion at current prices.\n\nMicroStrategy is among the largest institutional holders of Bitcoin, and first began purchasing the digital asset as a hedge against inflation back in August 2020. In fact, MicroStrategy has also raised debt to fund its BTC purchases, and now owns 0.75% of the total Bitcoin circulating supply.\n\nWill Bitcoin Prices Keep Rising In 2024?\n\nIt's evident that the price of MSTR stock will be tied to the performance of Bitcoin. For instance, BTC prices have risen 129% year-to-date, while MSTR is up 259% in 2023.\n\nThere are two key drivers for BTC in the near term. First is the possible launch of multiple spot Bitcoin ETFs by institutions such as BlackRock (BLK), Invesco (IVZ), and Ark Invest. With trillions of dollars in assets under management, there is a good chance for Bitcoin demand to move higher once the ETFs are approved, possibly within the next six months.\n\nAnother positive catalyst for BTC prices is the upcoming halving event. Every four years, the amount of BTC that can be mined is reduced by 50%, resulting in an extended bull run due to the supply-demand economics.\n\nHere's a look at how Bitcoin has performed over the last three halving cycles.\n\nBitcoin prices surged over 5,000% between November 2011 and November 2013\n\nBitcoin prices again surged by over 5,000% between November 2015 and December 2017\n\nBitcoin prices rose 600% between November 2019 and November 2021\n\nIf you're bullish on Bitcoin, it makes sense to buy MSTR right now. Each of the four analysts tracking MicroStrategy stock has a “strong buy” recommendation. The average price target for MSTR is $516, which is only about 1% higher than the current trading price. However, BTIG sees about 10% upside, and called MSTR the best vehicle for institutional investors to gain BTC exposure in a recent note.\n\nwww.barchart.com\n\nOn the date of publication, Aditya Raghunath did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vYml0Y29pbi1wcmljZS1mb3JlY2FzdC0xMDAwMDAtY3J5cHRvLXNwcmluZy1zcG90LWV0Zi1taW5pbmctaGFsdmluZy0yMDIzLTEx0gFvaHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS9iaXRjb2luLXByaWNlLWZvcmVjYXN0LTEwMDAwMC1jcnlwdG8tc3ByaW5nLXNwb3QtZXRmLW1pbmluZy1oYWx2aW5nLTIwMjMtMTE_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's on track to hit $100,000 by end-2024 amid 'crypto spring' - Business Insider",
        "content": "Bitcoin is well on its way to hitting $100,000 by the end of 2024, Standard Chartered said.\n\nThe token has increased its share of the digital asset space, while miners are selling less.\n\nMeanwhile, the increased likelihood of US spot ETFs has been a positive surprise.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin has more than doubled this year and is still set to more than double again to $100,000 by late next year, Standard Chartered said Tuesday.\n\nThe note declared that \"Crypto spring has sprung\" and reiterated a forecast first made in April, when analysts said the leading cryptocurrency would reach the six-figure level by the end of 2024.\n\nBitcoin has already soared 130% in 2023, and the bullish price outlook represents additional gains of more than 160%.\n\nContinued drivers included bitcoin's continued dominance of the crypto space and increased token hoarding by miners, Standard Chartered head of FX research Geoff Kendrick wrote.\n\nAdvertisement\n\nIn fact, bitcoin's share of digital asset market cap has jumped to around 50% from 45% in April, adding over $10,000 to its price, he said. The bounce has ignited broader interest in the crypto space sooner than anticipated.\n\nRelated stories\n\n\"Going forward, then, we expect digital assets' rising overall market cap to be a bigger driver of BTC price upside than a continued rise in BTC dominance within the space,\" Kendrick wrote.\n\nMeanwhile, sales of mined bitcoin have dropped to around 80% in the fourth quarter, as miners tend to hold larger quantities of the token as its price rises.\n\nNew supply will also be diminished by next April's bitcoin halving, a recurring event that reduces the amount of tokens awarded for mining. Typically, prices peak 12-18 months after it occurs, Kendrick said.\n\nAdvertisement\n\nBut a positive surprise is also emerging from the demand side, given the rising likelihood that bitcoin spot ETFs become approved for US markets, he added.\n\n\"We now expect more price upside to materialize before the halving than we previously did, specifically via the earlier-than-expected introduction of US spot ETFs. This suggests a risk that the USD 100,000 level could be reached before end-2024,\" Kendrick wrote.\n\nThat's as the SEC's attempts to block spot ETFs have suffered a number of court losses. The ETFs would bring fresh capital into bitcoin, as they would allow traditional brokerage accounts access to the cryptocurrency.\n\nFalling Treasury yields can further propel bitcoin, given that crypto tends to be a very long-term trade, Kendrick added. The 30-year yield has dropped to 4.60% from last month's high of 5.17%.\n\nAdvertisement\n\nStandard Chartered's bullishness was recently joined by analysts at Bernstein, who predicted that bitcoin could hit $150,000 by mid-2025 given similar supply reasons."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjgvYml0Y29pbi1yZW1haW5zLW9uLXRyYWNrLWZvci0xMDBrLWJ5LXllYXItZW5kLTIwMjQtc3RhbmRhcmQtY2hhcnRlcmVkL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjgvYml0Y29pbi1yZW1haW5zLW9uLXRyYWNrLWZvci0xMDBrLWJ5LXllYXItZW5kLTIwMjQtc3RhbmRhcmQtY2hhcnRlcmVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Remains on Track for $100K by Year-End 2024: Standard Chartered - CoinDesk",
        "content": "There is also a chance that the cryptocurrency will climb to the $100,000 mark before the end of the year, the bank said. “We now expect more price upside to materialize before the halving than we previously did, specifically via the earlier-than-expected introduction of U.S. spot ETFs. This suggests a risk that the USD 100,000 level could be reached before end-2024.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zdGFuZGFyZC1jaGFydGVyZWQtYml0Y29pbi10cmFjay1oaXQtMDUwMjI1NDI1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Standard Chartered: Bitcoin On Track To Hit $100K By End of Next Year - Yahoo Finance",
        "content": "Standard Chartered: Bitcoin On Track To Hit $100K By End of Next Year\n\nStandard Chartered Bank has restated its previous projection that Bitcoin (BTC) will achieve a value of $100,000 by the end of 2024. Geoff Kendrick and the team at the bank conveyed their confidence that the approval of various spot Bitcoin ETFs in the United States will serve as the next driving force behind the cryptocurrency's expansion, with these events expected to happen earlier than initially foreseen.\n\nThe bank anticipates that multiple spot ETFs for both BTC and ETH will likely be granted approval in the first quarter of 2024, thereby paving the way for heightened institutional investment. Furthermore, Standard Chartered emphasized the forthcoming Bitcoin \"halving,\" an event that restricts the currency's supply and is predicted to occur in late April 2024, as an additional factor that could contribute to potential price increases.\n\nStandard Chartered originally predicted BTC will hit $120,000 by end of next year, attributing Bitcoin's triumph to its status as a reputable safe haven asset. The bank maintains BTC's dominance, stating: “BTC’s dominance remains intact – its share of overall digital assets market cap has increased to 50% from 45% in April.\"\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvb25lLWluLWZvdXItYW1lcmljYW5zLW93bi1iaXRjb2luJTNBLXVuY2hhaW5lZC1zdHVkedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "One in Four Americans Own Bitcoin: Unchained Study - Nasdaq",
        "content": "Unchained, a prominent Bitcoin financial services provider, released a new report today showcasing an interesting surge in bitcoin ownership among Americans. According to their findings, a one in four Americans and 55% of surveyed investors, defined by Unchained as those with at least one investment account between the ages of 18 and 78, own bitcoin.\n\nThe study, which surveyed 402 US investors, revealed that 95% of current BTC owners are considering increasing their holdings in 2024. Remarkably, almost half of non-BTC owners expressed a strong inclination towards purchasing bitcoin within the upcoming year.\n\nKey drivers influencing potential BTC purchases in 2024 include increased regulatory clarity around digital assets, with 42% of current BTC owners and 35% of non-owners highlighting this factor. Other influential elements identified were the potential approval of a bitcoin spot Exchange-Traded Fund (ETF) by the Securities and Exchange Commission (SEC) and the anticipation of a US economic recession.\n\nDespite BTC's price being down over 50% from its peak, 79% of investors foresee BTC surpassing its all-time high of $69,000. More optimistically, over half of the surveyed investors (55%) predict a new all-time high for BTC in 2024, with a third believing BTC will outperform cash, gold, and the S&P 500.\n\nUnchained's survey also foresees a significant rise in bitcoin allocation within retirement portfolios. Nearly half of current BTC owners have BTC in their retirement accounts, and an additional 35% are considering adding it in 2024. Among non-BTC owners open to investing in the asset, 23% expressed interest in including BTC in their retirement accounts.\n\n“At Unchained, we are seeing an influx of bitcoin newcomers who now understand that the asset has longevity,” stated Joe Kelly, co-founder and CEO of Unchained. “As reflected in both Unchained’s survey results and the activity of our clients, US investors are eager to gain or expand bitcoin exposure — especially through tax-advantaged vehicles like Unchained’s bitcoin IRA. As more investors look to open or grow their bitcoin positions, Unchained looks forward to serving them whether it be through collaborative custody, the Unchained IRA, our trading desk, or our inheritance solutions.”\n\nWith an estimated 158 million Americans owning investment accounts, Unchained's survey provides valuable insights, representing the US investor population with a 5% margin of error at a 95% confidence level. The survey, conducted digitally from October 26 to 28, 2023, during a period when the price of bitcoin ranged from $33,610 to $34,977, offers a compelling outlook on BTC sentiment and expectations for 2024.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTI4L2JpdGNvaW4tcmV0YWtlcy0zOC0wMDAtd2hpbGUtcmF0ZS1jdXQtZXhwZWN0YXRpb25zLWluY3JlYXNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Retakes $38000 While Rate Cut Expectations Increase - Bloomberg",
        "content": "Bitcoin climbed back above $38,000 on Tuesday amid optimism the US central bank may be closer to lowering borrowing costs if inflation continues to decline.\n\nThe largest cryptocurrency by market value gained as much as 3.3% to $38,264 before trimming the increase. Bitcoin reached an 18-month high of $38,422 on Friday. Lower rates generally increase investors’ appetite for riskier assets such as digital tokens."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMS8yOC9jb3AyOC1hbmQtYml0Y29pbi10aGUtYmVnaW5uaW5nLW9mLWEtYmVhdXRpZnVsLWZyaWVuZHNoaXAv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzExLzI4L2NvcDI4LWFuZC1iaXRjb2luLXRoZS1iZWdpbm5pbmctb2YtYS1iZWF1dGlmdWwtZnJpZW5kc2hpcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "COP28 and Bitcoin: The Beginning of a Beautiful Friendship? - CoinDesk",
        "content": "The chair of the event is Sultan Ahmed Al-Jaber. He is also CEO of the state oil company ADNOC, which is expected to boost its oil production next year after the recent upward revision of the UAE OPEC+ quota. ADNOC has also been aggressively expanding its international fossil fuel interests. I do believe that an oil executive is better placed to get other oil executives to listen, and ADNOC is working on diversifying its revenue streams. But it’s a stretch to ask us to believe there is no conflict of interest here. Indeed, leaked documents have revealed that the UAE was planning to use its position as host country to discuss oil and gas deals with more than a dozen countries."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvYi9ibG9jay10aW1lLWNyeXB0b2N1cnJlbmN5LmFzcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "What Is Block Time? What It Measures, Verification, and Example - Investopedia",
        "content": "What Is Block Time?\n\nBlock time measures the time it takes the miners or validators within a network to verify transactions within one block and produce a new block in that blockchain.\n\nBlockchains were first popularized by Bitcoin when it was introduced in 2009. The technology has grown as more cryptocurrencies are created, each of which can use a different or identical blockchain, validation methods, and techniques for creating new blocks.\n\nKey Takeaways Block time is the time it takes to process a block in a cryptocurrency blockchain.\n\nOn the Bitcoin blockchain, a block is verified by miners, who compete against each other to verify the transactions and solve the hash, which creates another block.\n\nOn the Ethereum blockchain, a block is validated by randomly selected nodes, which is must faster because there is no competition.\n\nOther chains might use different mechanisms, which would affect their block times.\n\nUnderstanding Block Time\n\nA blockchain is a distributed database that records all transactions within a cryptocurrency network. You can think of a block within the database as a cell in a spreadsheet where transaction information is stored. Bitcoin miners verify the transactions, which takes time because finding the solution to the encryption problem requires the computers to make a vast number of trial-and-error attempts.\n\nOn the Bitcoin blockchain, this is called hashing—generating random hexadecimal numbers to try and find one that is less than or equal to one set by the network. When the block solution is found or otherwise validated, a new block is opened. The amount of time it takes to find the solution and create a new block is the block time.\n\n\n\nHere are a few key points to remember if you're trying to understand block time:\n\nA block is a record of the most recent cryptocurrency transactions, similar to a cell in a table of columns and rows.\n\nEach block contains the information from the block that preceded it in hashed form (that's why it is theoretically impossible to alter cryptocurrency).\n\nOn the Bitcoin blockchain, cryptocurrency \"miners\" race against each other to generate a random hash plus the nonce that is less than or equal to the target hash. The winner receives a reward.\n\nEthereum validators use a different consensus mechanism, which makes the block times shorter.\n\nBlockchains that use other mechanisms may have shorter or longer block times.\n\nWhy Block Times Differ\n\nConsensus mechanisms are what allow a network of participants to agree that a transaction is valid. Cryptocurrencies can use different consensus mechanisms, which, among other factors, affect the time it takes to verify transactions and create new blocks.\n\nProof-of-work and proof-of-stake are two types of consensus mechanisms that use different transaction verification methods. Each blockchain has a different block time because of the way their mechanisms work—Bitcoin averages about 10 minutes, while Ethereum only takes around 12 seconds.\n\nThe exact amount of time it takes for block generation on the Bitcoin proof-of-work blockchain is governed by the difficulty level, which changes with network traffic and the number of miners on the network to keep block times at 10 minutes.\n\nEthereum uses proof-of-stake, which is much faster because there is no competition for a reward—participants with staked ether are randomly selected to validate the transactions and receive network fees.\n\nBlock Time vs. Confirmation Time\n\nSometimes confused with each other, block times and confirmation times are two different measurements on a blockchain. Confirmation time is the amount of time it takes a blockchain to confirm a transaction.\n\nIt's often thought that a transaction needs six confirmations before it goes through; however, this is a misunderstanding. When a transaction makes it into a block, and the block is closed, the transaction has one confirmation and concludes. The number six comes from the belief that a transaction that was confirmed six times (included in six closed blocks) is secure from any network attacks.\n\nA block may be opened every 10 minutes on the Bitcoin blockchain, but not all transactions that occur within that period can be sent to the current block to be mined and confirmed. Confirmation can take up to several hours on the Bitcoin blockchain because transactions are sent to a mempool, where they are queued in order of the amount of fees paid.\n\nUsers who want their transactions placed in front of others pay more than the average, while those who pay average or below-average fees must wait their turn to be sent to a block, verified, and confirmed at least once.\n\n\n\nHow Many Bitcoins Will Ever Be Created? Bitcoin has a limit of 21 million. There are over 19 million Bitcoins in circulation, and the number of Bitcoins created yearly halves every four years. This slows down Bitcoin creation over time.\n\nHow Many Ethereum Will Ever Be Created? Ethereum, unlike Bitcoin, doesn't have an upper limit on the number of coins that will be created.\n\nHow Do I Get a Bitcoin Block? You never actually receive a Bitcoin block since it is part of Bitcoin's framework. Instead, you receive a reward of bitcoin when your miner solves the hash and creates another block.\n\nThe Bottom Line\n\nBlocks are one of the structures used in a blockchain that store information. The time it takes to open a new block on a chain is that chain's block time. Block times differ from confirmation times, which can take several hours or days to complete.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjgvYml0Y29pbi1wdXNoZXMtYWJvdmUtMzc3ay1vbi1kb3Zpc2gtY29tbWVudHMtZnJvbS1mZWRzLXdhbGxlci_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzI4L2JpdGNvaW4tcHVzaGVzLWFib3ZlLTM3N2stb24tZG92aXNoLWNvbW1lbnRzLWZyb20tZmVkcy13YWxsZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Pushes Above $37.7K on Dovish Comments From Fed's Waller - CoinDesk",
        "content": "Already higher on the session, the price of bitcoin (BTC) rallied more than another 1% on the heels of Waller's comments, even as his colleague Michelle Bowman – speaking at another event – said she believes rates will have to move higher to bring inflation to heel. At press time, bitcoin was changing hands at $37,700."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1idGMtY2FuLWhlYWQtaGlnaGVyLWluLTIwMjQuLWhlcmVzLXdoedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Can Head Higher in 2024. Here's Why - Nasdaq",
        "content": "What a difference a year can make. Last year, Bitcoin (BTC-USD) lost nearly two-thirds of its value, and skeptics were ready to leave it for dead. This year, Bitcoin has come roaring back with a torrid gain of 128% in 2023. While 2023 has been a momentous year for the largest cryptocurrency by market cap, it can head even higher next year based on two potential catalysts that could both occur in early 2024: its upcoming halving and the potential for the approval of a spot Bitcoin ETF. I'm bullish on BTC.\n\nGet Ready for The Halving\n\nBitcoin’s next halving event is expected to occur in April 2024. What does the halving entail?\n\nHalvings are scheduled events that take place every four years, in which the reward for mining a new block of Bitcoin is cut in half. Right now, Bitcoin miners receive a reward of 6.25 new Bitcoins for each block that they mine. After the halving, this reward will be reduced to 3.125 BTC.\n\nThere are only 21 million Bitcoins that will ever exist, and this fixed supply is one of Bitcoin's primary selling points. Unlike fiat currencies, which governments and central banks can always print more of, Bitcoin is a finite resource. The halving helps to curb Bitcoin’s inflation rate and ensures that Bitcoin becomes increasingly scarce over time, which should theoretically increase its value over time.\n\nTo be clear, nothing is guaranteed, but past halvings have typically ushered in significant bull markets for Bitcoin. During the first Bitcoin halving in 2012, the block reward decreased from 50 BTC to 25 BTC, and the price of Bitcoin increased from about $12 before the halving to over $960 one year later.\n\nDuring the second Bitcoin halving in 2016, the reward decreased from 25 BTC to 12.5 BTC, and the price of Bitcoin nearly quadrupled one year later, from $663 to about $2,500.\n\nLastly, during the most recent halving, which occurred in 2020, the block reward decreased from 12.5 BTC to 6.25 BTC, and the price of Bitcoin went parabolic, rising from about $8,500 before the halving to an all-time high of around $69,000 in November of 2021.\n\nThe price of Bitcoin came down considerably from this all-time high, and past results are no guarantee of future results. However, this illustrates the effect that past halvings have had on the price of Bitcoin. Based on these results, it’s easy to see why crypto market participants are enthusiastic about the next halving.\n\nImpact of a Potential Spot Bitcoin ETF Approval\n\nIt’s not just the halving that could serve as a catalyst for Bitcoin in 2024. Some market observers believe that the approval of a spot Bitcoin ETF by the SEC is becoming increasingly likely and that it will come in early 2024.\n\nBlackRock (NYSE:BLK) kicked off the excitement this summer with its spot Bitcoin ETF filing and was soon followed by a mix of traditional finance giants like Fidelity and Invesco (NYSE:IVZ), tech-centric ARK Invest, and Grayscale Bitcoin Trust (OTC:GBTC), which is seeking to convert its trust into an ETF. Bloomberg ETF analysts Eric Balchunas and James Seyffart have forecasted a 90% likelihood that a spot Bitcoin ETF will be approved for trading by January 2024.\n\nBalchunas has noted that ARK Invest, BlackRock, and others are updating their S1 filings, which could be a good sign, as it means that these issuers are getting their applications in shape for approval. Balchunas and other observers have also noted that BlackRock and others have been meeting with the SEC to hash out details and that this dialogue is another good sign.\n\nIt should be pointed out that this is all speculation at this point, but the developments do seem encouraging.\n\nTo be clear, speculation and excitement about the possibility of such an ETF has already driven the price of Bitcoin higher in 2024. The current Bitcoin rally really kicked into overdrive this summer after news of BlackRock's filing broke.\n\nWhile this could potentially make an approval a \"buy the rumor, sell the news\" event in the short term, over the long term, a spot Bitcoin ETF would usher in a new era for Bitcoin.\n\nMillions of U.S. investors would be able to gain direct exposure to Bitcoin through their brokerage or retirement accounts for the first time, making the process of gaining Bitcoin exposure as simple as buying a stock or an ETF.\n\nThis would open up access to Bitcoin to investors who are interested in it or bullish on its long-term potential but who don’t want to manage their own Bitcoin wallet or open up a dedicated crypto brokerage account with Coinbase (NASDAQ:COIN) or another provider. These ETFs could also bring more institutional investors into Bitcoin.\n\nFurthermore, ETFs from recognizable and trusted blue-chip names in the traditional finance world, like BlackRock, Fidelity, and others who have filed, would make many investors feel more comfortable with Bitcoin and boost its credibility with mainstream, non-crypto investors.\n\nLooking Ahead to 2024\n\nBitcoin has had an epic run in 2023, but 2024 could see it add to these gains based on two major potential catalysts: the Bitcoin halving, which has historically led to bullish price action for Bitcoin, and the possibility of the launch of a spot Bitcoin ETF, which would potentially open Bitcoin up to a whole new pool of investors and bring it even further into the mainstream.\n\nBitcoin and other cryptocurrencies can be risky and volatile investments, so they are not for the faint of heart. I own Bitcoin and am bullish on it. For long-term, risk-tolerant investors, I like the idea of adding some diversification to portfolios by adding some Bitcoin ahead of these events.\n\nDisclosure\n\n\n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMjgvZ3JheXNjYWxlLXVwbGlzdC1wbGFuLWJpdGNvaW4tZXRmL9IBTGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMjgvZ3JheXNjYWxlLXVwbGlzdC1wbGFuLWJpdGNvaW4tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Grayscale’s ‘uplist’ plan adds to intrigue over Bitcoin ETF - Fortune",
        "content": "Finance spawns a lot of weird and wonky words, and while I’ve at least heard of most of them, “uplist” is a new one for me. I encountered it while poking into crypto giant Grayscale’s bid to be first out of the gate with a Bitcoin ETF—an achievement that would likely help the crypto giant nab the lion’s share of a new market expected to be worth hundreds of billions of dollars.\n\nWhile other firms, notably BlackRock and Fidelity, are seeking a similar prize, Grayscale is the only one in a position to do it by means of an uplist. The term refers to moving a securities listing from an off-brand stock exchange onto a mainstream one. In Grayscale’s case, this would mean moving its GBTC shares from something called OTCQX to the familiar confines of the NYSE, while at the same time converting its jerry-rigged trust product to a regular old ETF.\n\nA source at Grayscale tells me that launching via an uplist means the firm could bring its ETF to market slightly quicker than its competitors—a critical advantage since, historically, the first ETF in a given field sucks up most of the liquidity. I have no idea if this will happen (and would point any diehards to the X feeds of Bloomberg ETF guys Eric Balchunas and James Seyffart or lawyer Scott Johnsson). But it does underscore how much is at stake with the long-awaited arrival of Bitcoin ETFs, which are widely expected to drop in early January based on the whims of the SEC.\n\nMeanwhile, there are other wild cards surrounding Grayscale’s ETF bid, including what the company plans to charge. It’s a safe bet the fee will be lower than the 2% it’s long charged for GBTC, especially as one of its competitors in the ETF race, ARK Invest, says it will charge 0.8%. Competitive dynamics suggest Grayscale would have to match that rate, but the reality is the firm is likely to charge more since most customers tempted to exchange Grayscale’s Bitcoin ETF for a competitor’s would set off a tax trip wire—meaning many will choose to grit their teeth and hold instead.\n\nThe final wild card in all this is how many of those currently holding GBTC shares will simply dump them once the ETF drops, and ditch the Bitcoin game altogether. Recall that a sizable group of investors bought Grayscale shares as an arbitrage when they were trading far below the price of Bitcoin in hopes the gap would close. That has happened—the so-called discount has closed from over 40% to 8% and is likely to disappear altogether—meaning some investors are going to take their crypto profits and go take a flier on AI or something else totally unrelated. JPMorgan recently predicted outflows will amount to around $2.7 billion.\n\nAll of this is just conjecture for now. But January, and some real answers, are only weeks away.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nA U.S. judge has for now refused to let Binance’s former CEO return to the United Arab Emirates ahead of his sentencing date in February, and will likely make a decision in the coming days. (Bloomberg)\n\nThe price of several large altcoins, including SUI and Optimism, tumbled ahead of impending “unlock” events that will see a glut of new tokens enter the market. (CoinDesk)\n\nTom Emmer (R-Minn.), an influential GOP congressman, said the recent DOJ charges against Binance prove the U.S. doesn’t need new crypto laws—a stance that could bode ill for pending stablecoin bills. (Fortune)\n\nStar author and Sam Bankman-Fried acolyte Michael Lewis is under fire for comparing reporters covering the trial of the convicted fraudster to those attending a lynching party. (Puck)\n\nCoinbase shares have soared 18% following criminal charges against Binance, which led CEO Brian Armstrong to take a victory lap in the media. (Fortune)\n\nMEME O’ THE MOMENT\n\nWhat happened to you, Michael Lewis?"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjkvc29sYW5hLWxlYWRzLWxheWVyLTEtdG9rZW4tZ2FpbnMtYXMtYml0Y29pbi1jcm9zc2VzLTM4ay_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzI5L3NvbGFuYS1sZWFkcy1sYXllci0xLXRva2VuLWdhaW5zLWFzLWJpdGNvaW4tY3Jvc3Nlcy0zOGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Solana Leads Layer-1 Token Gains as Bitcoin Crosses $38K - CoinDesk",
        "content": "Elsewhere, global bank Standard Chartered double-downed on its April forecast that bitcoin (BTC) would reach $100,000 by the end of 2024. Analysts reasoned the expected approvals of several spot bitcoin ETFs “are likely to come sooner than expected,” which could act as catalysts for an uptrend."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzExLzI5L2JpdGNvaW4tYnJpZWZseS1jcm9zc2VzLTM4MDAwLW1hcmstZGVzcGl0ZS1tb3JlLWZhbGxvdXQtZnJvbS1iaW5hbmNlLWNoYXJnZXMtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin briefly crosses $38,000 mark despite more fallout from Binance charges - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin briefly crosses $38,000 mark despite more fallout from Binance charges: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Professor Yesha Yadav of Vanderbilt University Law School discusses crypto regulation and what's next for the industry following Binance's historic settlement with U.S. government officials."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1MTg3L2JpdGNvaW4tcHJpY2Utc3Bpa2VzLWNhdXNlLTI5LW1pbGxpb24taW4tc2hvcnQtbGlxdWlkYXRpb25z0gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1MTg3L2JpdGNvaW4tcHJpY2Utc3Bpa2VzLWNhdXNlLTI5LW1pbGxpb24taW4tc2hvcnQtbGlxdWlkYXRpb25z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price spikes cause $29 million in short liquidations - The Block",
        "content": "Bitcoin BTC -3.21% 's sudden upward price trajectory in the past 24 hours has caused almost $30 million in bitcoin short liquidations.\n\nOver the past 24 hours there were over $119 million liquidations in the cryptocurrency market. Of these liquidations, the vast majority, $73 million, were short positions. Bitcoin short positions took the largest share of the damage, with over $29 million in short liquidations in the past 24 hours, according to Coinglass data.\n\nThe wipe out of short position came as bitcoin broke through the $38,000 mark earlier today before retracing its steps. The largest digital asset by market capitalization reached a high of $38,246 in the past 24 hours. It is now changing hands for $37,690, at 11:50 p.m. ET, according to The Block's Price Page.\n\nA battle of bulls and bears\n\nRELATED INDICES See crypto indices\n\nBitfinex analysts said that one of the fundamental factors behind the recent price appreciation for the world's largest digital asset by market cap, \"includes the anticipation of a pause in the Fed's interest rate hikes.\"\n\n\"Such a pause is expected to maintain or lower the benchmark overnight interest rate, which is one of the highest in US history. This situation could make risk assets like bitcoin more attractive to investors seeking higher returns in a lower interest rate environment,\" Bitfinex analysts told The Block.\n\nHowever, the analysts added that other narratives are at play. \"Long-term bitcoin supply has continued to remain dormant while the lower timeframes currently show aggressive market participants chasing price, market buying, above the crucial $37,500 level. This resilience might also be reflecting in ether's performance, along with bitcoin steadily trading above $37,500.\" the analysts said."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NlYy1mcmFuay10ZW1wbGV0b24tYml0Y29pbi1ldGbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "SEC kicks off comment period for planned Franklin Templeton bitcoin ETF - Blockworks",
        "content": "The US Securities and Exchange Commission has initiated the comment period for Franklin Templeton’s spot bitcoin ETF proposal.\n\nThis move was initiated earlier than some expected, with the SEC now actively seeking public feedback.\n\nNew SEC filings could signal its willingness to close out the comment period on such funds ahead of a potential January ruling on bitcoin ETFs, some segment observers said.\n\nA Tuesday disclosure indicates the regulator has chosen to “institute proceedings” to determine whether to approve or deny the Franklin Bitcoin ETF.\n\n“The commission seeks and encourages interested persons to provide comments on the proposed rule change,” the filing states.\n\nRead more: Bitcoin ETF saga reaches ‘pattern break’ as amendments pile up\n\nThe SEC has a 240-day window to consider each of the spot bitcoin ETF proposals from the day it is published in the federal register. During this timeframe, specific deadlines occur at intervals of 45 days, 45 days, 90 days, and 60 days. At each of these milestones, the SEC must file a response either approving, denying, or postponing a decision on the proposal.\n\nFranklin Templeton, a traditional finance giant with roughly $1.5 trillion assets under management, jumped into the bitcoin ETF race in September.\n\nThe Franklin Bitcoin ETF proposal was published in the federal register on Oct. 3, and the SEC delayed its decision on the product in a Nov. 15 order.\n\nWhile another filing related to this proposal wasn’t due until Jan. 1, the Tuesday order signals the SEC might be looking to fast-track the process in preparation for a potential mass ruling on spot bitcoin ETFs.\n\n“They might have chosen to do this early so they could have the comment period end before Jan 10, in order to approve everyone at the same time,” Van Buren Capital general partner Scott Johnsson said in an X post.\n\nLoading Tweet..\n\nJan. 10 is the date by which the SEC is set to rule on a spot bitcoin ETF proposed by Ark Invest and 21Shares. Industry watchers have pointed to this date, noting the securities regulator could approve all spot bitcoin ETFs at this time to avoid giving any one product a first-mover advantage.\n\nThe SEC could also choose to deny such proposals — a move that would be consistent with previous rulings over the last decade.\n\nAlong with the order related to Franklin Templeton’s proposal, the SEC filed a separate order seeking comments on the proposed bitcoin ETF from Brazil-based asset manager Hashdex.\n\n“This delay on [Hashdex] all but confirms for me that this was likely a move to line every applicant up for potential approval by the Jan 10, 2024 deadline,” Bloomberg Intelligence analyst James Seyffart said in a Tuesday X post.\n\nA spokesperson for the SEC did not immediately return a request for comment.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjgvZmlyc3QtbW92ZXItYW1lcmljYXMtc3BvdC1iaXRjb2luLWV0ZnMtaW4tYnJhemlsLWZpbmQtaGVmdHktZGVtYW5kL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjgvZmlyc3QtbW92ZXItYW1lcmljYXMtc3BvdC1iaXRjb2luLWV0ZnMtaW4tYnJhemlsLWZpbmQtaGVmdHktZGVtYW5kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "First Mover Americas: Spot Bitcoin ETFs in Brazil Find Hefty Demand - CoinDesk",
        "content": "Binance founder Changpeng \"CZ\" Zhao must remain in the U.S., at least for the moment, as a federal judge considers a U.S. Department of Justice motion that would require him to remain in the country until he is sentenced early next year. Zhao pleaded guilty to violating the Bank Secrecy Act last week and resigned as CEO of the world's largest crypto exchange by volume. The exchange itself pleaded guilty to charges of violating sanctions and money-transmission laws, agreeing to pay $4.3 billion in fines and embed compliance monitors who can report back to the U.S. government. After Zhao pleaded guilty, a magistrate judge granted his release on a $175 million personal recognizance bond. Zhao put $15 million in a trust account and had three guarantors put up over $5 million in collateral to secure the bond. Under the terms of the bond release, he was free to return to the UAE, where his wife and children also reside. District Judge Richard Jones stayed this part of the ruling on Monday."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjgvY21lLWxpc3RlZC1iaXRjb2luLWV0aGVyLWZ1dHVyZXMtZmxhc2gtYS1yYXJlLWJ1bGxpc2gtc2lnbmFsL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjgvY21lLWxpc3RlZC1iaXRjb2luLWV0aGVyLWZ1dHVyZXMtZmxhc2gtYS1yYXJlLWJ1bGxpc2gtc2lnbmFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "CME-Listed Bitcoin, Ether Futures Flash a Rare Bullish Signal - CoinDesk",
        "content": "Huf added that elevated futures premiums could see renewed interest in basis trades or cash and carry arbitrage. The strategy involves buying the cryptocurrency in the spot market and simultaneously selling futures. The strategy, one of the most preferred during the 2020-2021 bull run, allows traders to pocket the premium while bypassing price volatility."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1yYWxseS1jaGFydHMtc2hvdy0xNTQyNDE2NzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin rally: What the charts show - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) is up more than 40% over the last three months. Investors are waiting to hear if the Securities and Exchange Commission will approve a spot bitcoin ETF, with inflows into the cryptocurrency surging the last five weeks. Yahoo Finance Reporter Jared Blikre joins the Live show to break down the numbers and give insight into whether or not this bitcoin rally can continue into next year.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\nSEANA SMITH: All right. Let's take a look at the crypto market because Bitcoin bulls are ready to charge. Bitcoin looking for direction this morning as investors' anticipation over an eventual US spot Bitcoin ETF, has pushed the cryptocurrency higher in the last three months. The question now, though, is whether this rally has staying power into the new year. Jared Blikre joining us with maybe a closer look at some of those technicals and the momentum that we've seen. Jared, what do you think?\n\nJARED BLIKRE: Well, I'm looking at inflows into Bitcoin and this chart goes back to the beginning of the year. And we are on the ninth straight week of inflows into Bitcoin, approaching about $300 million. This is the highest week of the year. And just looking, we can see a lot of activity over the last five weeks. Why? Whatever happened five weeks ago? We got a huge breakout in price.\n\nAnd let's go to the Bitcoin chart. And let's do a year to date. And we can plot this, you can see we really got going in about mid-October here. And you can even see that better with the candlesticks. We got that huge break above 30,000 and then 35,000. Huge, huge sticking points. And the reason those were sticking points is because there is a lot of price memory.\n\nLet me change this back to a line chart. And you can see we are now firmly in the bottom area of all this price history that we had in 2021. Lots of things sorted out in there. Suffice to say, it's going to take a lot to get through there.\n\nStory continues\n\nIs it going to happen slowly, quickly? Depends on the catalyst. But the regulatory environment finally seems to be getting a little bit more habitable for crypto players. It looks like Binance is probably going to skate with a $4 billion fine. But the industry itself is going to survive. And they've taken their lumps over the last couple of years. For the industry to bounce back now, I'd say yes, the bad, the worst is definitely in the past. And there's a lot of smooth sailing ahead. But exactly how that plays out, it's hard to see.\n\nI think the spot Bitcoin ETF, that's probably priced in. But you never know. There could be another burst of enthusiasm around that. Anecdotally, I will say the only time I get recognized in the streets of New York is when crypto prices are popping, and I'm not getting recognized. So I know we haven't gotten that level-- gotten to that level in this cycle yet.\n\nSEANA SMITH: It's weird. I didn't know you were so tied to the crypto. I never would have guessed that.\n\nJARED BLIKRE: Apparently, I am personally levered to Bitcoin prices. I don't know what's in that, but that's the way it happens. So I started getting recognized, yeah, I'll be really bullish, but we're just in the beginning stages right now, guys.\n\nDIANE KING HALL: All right, Jared Blikre. We will have to put a pin in that one and come back to you. We'll watch out for you for your man on the street Bitcoin quote.\n\nJARED BLIKRE: That's a great idea, Diane. Man on the street, person on the street Bitcoin. We're going to do that.\n\nDIANE KING HALL: Exactly. All right, thank you, Jared."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2UtbWlycm9ycy0yMDEyLWhhbHZpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin flirts with breakout, price mirrors lead-up to 2012 halving - Blockworks",
        "content": "Bitcoin is eyeing a price breakout after clearing $38,200 earlier today, reaching its highest point in 17 months.\n\nThat puts bitcoin up 130% this year, far more than almost all other top-25 cryptocurrencies.\n\nBTC only trails bitcoin cash (BCH), chainlink (LINK) and solana (SOL), which were up 133%, 163% and 508%, respectively, as of 5am ET.\n\nFor scale, bitcoin’s year-to-date gains are in line with Tesla stock and double Intel and Microsoft.\n\nChipmaker Nvidia is meanwhile up more than 230% on the back of artificial intelligence hype, which made it the ninth company in history to reach trillion-dollar market value. Crypto’s overall market cap is now close to $1.5 trillion, with bitcoin making up more than half of that total.\n\nNailing down the exact catalyst for bitcoin’s recent growth is difficult, however.\n\nClick the swatches to toggle lines on the chart\n\nThe pending suite of applications for spot bitcoin ETFs from Wall Street mega giant BlackRock and nearly a dozen other firms is one theory. “Spot bitcoin” means they’ll have to actually buy bitcoin when they issue new shares to meet investor demand, which may or may not pick up, depending on which analyst you ask.\n\nBitcoin indeed jumped by nearly a quarter — from $25,500 to $31,500 — days after BlackRock filed in June. Low liquidity led BTC to quickly drop, and by the middle of August had practically given up all those gains.\n\nBTC has popped by half since then. Almost all of that came directly after a fake news headline suggested that BlackRock’s application had been approved (it hasn’t).\n\nOne month later, a phony story about an XRP ETF briefly pumped the fifth-largest crypto by 10%. XRP immediately corrected once the news was debunked.\n\nBitcoin price is correlating with 2012 halving\n\nMarkets are clearly ready to bounce on any good news — like the upcoming halving.\n\nSometime around April 19, 2024, Bitcoin miners will suddenly earn 50% fewer coins for each block they find, dropping from 6.25 BTC ($238,000) to 3,125 BTC ($119,000).\n\nBitcoin’s next halving will be its fourth ever. To some, halvings are magic: Previous events — in 2012, 2016 and 2020 — all preceded monumental bull markets.\n\nHit the log button for a clearer view\n\nAt one year after each halving, Bitcoin had rallied:\n\n8,900% after its first halving ($12 to $1,100).\n\n285% after its second ($670 to $2,500).\n\n540% after its third ($8,700 to $55,900).\n\nBitcoin even went up in the 200 days leading up to all three occasions — so no matter how you cut it, BTC’s price has gone up around halvings.\n\nThis time around is even somewhat unique: demand could go up due to a spot ETF just as supply is slashed in half.\n\nStill, buying bitcoin around the halvings is much like buying the rumor with no intention to sell the news. The sample size is incredibly small, leaving little room for reliable analysis of how the halving in April might impact bitcoin’s price.\n\nBitcoin’s performance is so far in line with what happened before the 2012 event\n\nBitcoin miners, no doubt, hope the next halving mirrors the others. Axing issuance is expected to crush their profit margins, especially those without extremely cheap access to power (or even their own power stations).\n\nRecent estimates suggest the most efficient bitcoin miners pay $15,100 to mine each coin. That number doubles after the halving, “which would likely put the majority of the mining market into severe income stress,” according to data unit Glassnode.\n\nAll this means bitcoin had better stay above $30,000 after the next halving, which is 141 days away. So far, so good.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZWFsbHktc3BvdC1iaXRjb2luLWV0Zi0xNDAwMDAyMTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Do We Really Need a Spot Bitcoin ETF? - Yahoo Finance",
        "content": "The potential approval of a spot bitcoin ETF by the Securities and Exchange Commission has been one of the most talked about investing topics in 2023. Will they approve? If so, when? Will the approval be for one issuer at first, or several at once? And is the recent rise in bitcoin’s price due in large part to anticipation of a spot bitcoin exchange-traded fund approval?\n\nThese questions have many corners of the financial markets buzzing. But here’s another take on it: While the ETF industry would benefit from having a spot bitcoin ETF, and investors would finally be able to buy the cryptocurrency at nearly the spot price, are the current products so bad?\n\nThe push for ETFs to track the spot price of bitcoin, as well as other cryptocurrencies, has led the crypto industry to the brink of victory, with many expecting an approval by early next year. But when we look at the return history of existing bitcoin-related ETFs, it does make a case for leaving well enough alone.\n\nThe Case for Grayscale Bitcoin Trust\n\nThe Grayscale Bitcoin Trust (GBTC), a closed-end unit trust, is the first exchange-traded product that attempted to track the price of bitcoin. It debuted back in 2014, well ahead of most others. That early adopter move has helped it reach $23 billion in assets and trade at a daily average volume of $135 million.\n\nBut GBTC has trailed the spot price of bitcoin badly. The margin over the past 36 months has been 120% to 50%. That does not qualify as a tracking ETF to many. Yet the assets have ballooned. That one case argues for a spot bitcoin ETF to be available immediately. But wait, there’s more to the story.\n\nThe Case for Futures-Based Bitcoin ETFs\n\nA trio of lesser-known ETFs, the Proshares Bitcoin Strategy ETF (BITO), the VanEck Bitcoin Strategy ETF (XBTF) and the Valkyrie Bitcoin and Ether Strategy ETF (BTF), use futures to track the price of bitcoin. BITO has $1.4 billion in assets, but the other two combined have only about $100 million. All three have been around since at least November 16, 2021, long enough to assess how closely they correlate to spot bitcoin itself. It also includes a series of rallies and drops for bitcoin, which helps make this a stronger stress test.\n\nStory continues\n\nThe results are compelling. In that period of just over two years, BTC is down 41%. All three of the ETFs mentioned are down 39%-40%. There have been short periods of time where the ETFs have outperformed the spot price of BTC and vice versa. But all things considered, if an investor wants to own something that correlates with bitcoin’s spot price, these three have done a very good job.\n\nSpot Bitcoin ETF vs. GBTC\n\nOne of the main reasons ETFs have grown in popularity over the years is that investors know what they are getting. If an ETF aims to track an index, it tracks that index closely. So, until there is a spot bitcoin ETF, there’s no direct tracking of bitcoin. But we do currently have some ways for investors to track the intermediate term path of bitcoin closely, albeit with some tracking error along the way.\n\nInvestors have flocked to the GBTC, the bitcoin-tracking ETF that correlates to the spot price of BTC at a rate of more than 25-1 in terms of assets. GBTC has had a monster run in 2023, up about twice what spot bitcoin is, helping it make up its previous lagging performance. But no doubt there are bitcoin ETFs for investors to choose from if the goal is to get a piece of the cryptocurrency’s potential upside, whether we have a spot ETF or not.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTI5L2dyYXlzY2FsZS10cnVzdC1iZWNvbWVzLWxpdmUtYmV0dGluZy1saW5lLWZvci1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Grayscale Trust Becomes 'Live Betting Line' for Spot Bitcoin ETF - Bloomberg",
        "content": "Traders betting that regulators will approve a US spot Bitcoin exchange-traded fund sooner rather than later have all but evaporated a once-gargantuan discount on the world’s biggest crypto fund.\n\nThe $24 billion Grayscale Bitcoin Trust (ticker GBTC) is currently trading at a roughly 8% discount to its underlying Bitcoin holdings, the narrowest dislocation in over two years, data compiled by Bloomberg show. GBTC entered 2023 with a record discount of nearly 50%."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9idXNpbmVzcy8yMDIzL25vdi8yOS9jaGFybGllLW11bmdlci1hcGhvcmlzbS1iaXRjb2luLXNhZ2Utd2FycmVuLWJ1ZmZldHTSAWRodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vYnVzaW5lc3MvMjAyMy9ub3YvMjkvY2hhcmxpZS1tdW5nZXItYXBob3Jpc20tYml0Y29pbi1zYWdlLXdhcnJlbi1idWZmZXR0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Charlie Munger: the aphorism-loving, bitcoin-hating sage behind Warren Buffett - The Guardian",
        "content": "“If people weren’t so often wrong, we wouldn’t be so rich,” Charlie Munger, the right-hand man of the billionaire stock picker Warren Buffett, once said of rival investors.\n\nIt was that humour, paired with decades of investment successes, that endeared Munger to a global business community now in mourning after news of his death at the age of 99 on Tuesday night.\n\nBest known for serving as vice-chair of the textile manufacturer turned $785bn (£619bn) investment conglomerate Berkshire Hathaway, Munger was credited with shifting Buffett’s strategy from buying up cheap, undervalued assets, towards selecting quality stocks such as Apple. The change made multibillionaires of both men.\n\nBut in his 50 years working alongside his business partner, Munger also garnered fans for his quick wit and no-holds-barred comments that led Buffett to write in 2000: “Miss Manners clearly would need to do a lot of work on Charlie.”\n\nMunger’s comedic targets were wide-ranging, spanning graduate schools that he claimed taught poor investment strategies to the US government for failing to crack down on cryptocurrencies, and bankers whom, after the 2008 financial crisis, he likened to “heroin addicts” struggling to control their habit.\n\nMunger, who married twice and had seven children, refused to entertain new accounting methods such as Ebitda, which, rather than presenting bottom-line profits, shows a business’s earnings before a series of costs: interest, taxes, depreciation, and amortisation. “I think you would understand any presentation using the word Ebitda if every time you saw that word you just substituted the phrase ‘bullshit earnings’,” he once said.\n\nHe similarly hit out at the valuation of investment products such as derivatives, which are contracts linked to the expected future price of assets like gold, oil or company stocks. “To say that derivative accounting in America is sewage is an insult to sewage,” the billionaire once quipped.\n\nBorn on New Year’s Day in 1924 to Florence and Alfred Munger, he grew up a few blocks down from Buffett in Omaha, Nebraska, but he would only meet his future business partner decades later, in 1959.\n\nMunger studied mathematics before dropping out of the University of Michigan and later joining the US army air corps. While in the military he was sent to study meteorology at the California Institute of Technology, and he later attended Harvard law school in 1948. He would go on to form the law firm Munger, Tolles & Olson in 1962, the same year he launched the hedge fund Wheeler, Munger & Co.\n\nThree years earlier, Munger, then 35, had met Buffett, then 29. The two Omahans hit it off and stayed in touch for more than two decades before finally formalising their business relationship when Munger joined Berkshire Hathaway’s board in 1978.\n\nBuffett, known as the Sage of Omaha, spoke warmly of his longtime colleague, saying in 2018 that the two “never had an argument in the entire time we’ve known each other”.\n\nHe said: “Charlie has given me the ultimate gift that a person can give to somebody else. He’s made me a better person than I would have otherwise been … He’s given me a lot of good advice over time ... I’ve lived a better life because of Charlie.”\n\nThe duo’s comedic chemistry was palpable, often drawing laughs and applause from investors who regularly made the pilgrimage to Berkshire Hathaway’s annual meeting held in the pair’s home town each May.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nMunger did not pull punches, most recently airing open disdain for artificial intelligence and cryptocurrencies. “I am personally sceptical of some of the hype that has gone into artificial intelligence. I think old-fashioned intelligence works pretty well,” he told investors at this year’s meeting.\n\nHowever, he reserved more cutting comments for traders taking a punt on crypto assets such as bitcoin, saying: “It’s like somebody else trading turds and you decide I can’t be left out.”\n\nIn 2021, he added: “I hate the bitcoin success and I don’t welcome a currency that’s useful to kidnappers and extortionists and so forth.”\n\nMunger, whom Forbes estimated to be worth $2.6bn, regularly doled out aphorisms that would be collected for books and video compilations by adoring fans. They included: “Capitalism without failure is like religion without hell”; “Without the method of learning, you’re like a one-legged man in an ass-kicking contest”; and “The best armour of old age is a well-spent life preceding it”.\n\nOf late, the billionaire was realistic about the prospects for the next generation of investors, saying: “There is so much money now in the hands of so many smart people all trying to outsmart one another. It’s a radically different world from the world we started in.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzI5L2Nhbi1iaXRjb2luLXJlYWNoLTEwMDAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Can Bitcoin Reach $100,000? - The Motley Fool",
        "content": "Cryptocurrency is an exciting frontier that's still new. Bitcoin (BTC -3.38%) has only been around since 2009, and crypto as a whole has been relevant for just the past decade or so.\n\nSometimes, timing is everything. Two years ago, Bitcoin traded at more than $60,000. Had I asked whether the coin could climb to $100,000, you might have said it was going to the moon. Today, you might answer differently. Bitcoin has since plummeted, falling as much as 75% from its peak.\n\nNow, trading at just under $40,000... can Bitcoin reach $100,000? Here is why you should be optimistic.\n\nBitcoin's volatility is normal\n\nBitcoin has proven volatile over the years. It's suffered several drops from its high of more than 60%. Why? Bitcoin and crypto as a whole is a unique asset. Stocks represent underlying businesses, and governments assign value to fiat money. All these assets trade on markets, but Bitcoin depends solely on what buyers and sellers are willing to pay.\n\nGiven its decentralized nature, it makes sense that Bitcoin could see higher prices when markets are feeling good and lower prices when markets are afraid. In other words, the volatility is normal.\n\nThe key, of course, is where prices go over time. Bitcoin is also a unique asset because there is a finite supply. If more people use and want Bitcoin in the future, higher demand should create higher prices. This is the central investment thesis for holding Bitcoin.\n\nShedding crypto's bad actors\n\nThere are both pros and cons to a decentralized asset like cryptocurrency. Unfortunately, the lack of guardrails in the industry attracted bad actors, scammers, and criminals. This goes far beyond the occasional sketchy crypto project where the developers abandon the investors (a rug pull).\n\nThe world's top two largest cryptocurrency exchanges have been mired in controversy. Sam Bankman-Fried was recently found guilty of fraud and conspiracy. He founded and grew his cryptocurrency exchange, FTX, which collapsed during a liquidity crisis after he misappropriated customer and investor money.\n\nMeanwhile, Binance, the world's largest crypto exchange, recently settled with the U.S. government on money laundering charges. Its founder and CEO, Changpeng Zhao, has stepped down.\n\nThese are tremendous, ground-shaking events for the industry. Could one imagine what would happen if it turned out Bank of America was running a fraud and collapsed? On the other hand, this could be healthy for the crypto space in the long run. Getting the bad apples out of the basket could build trust in crypto, ultimately advancing it.\n\nCan Bitcoin reach $100,000?\n\nThere's no doubt that Bitcoin can reach $100,000, but the real question is... will it? Personally, I think it will eventually. The collapse of these huge, fraudulent crypto exchanges may seem damaging, but cleaning it up could create a healthier crypto industry.\n\nA healthier industry could help Bitcoin go to new levels because the central thesis of Bitcoin remains intact. It's an asset with a limited supply, so increased adoption of and demand for Bitcoin will naturally increase what the market is willing to pay.\n\nOf course, investors should keep their portfolios diversified across asset classes, including crypto, stocks, and bonds. If you're holding Bitcoin, don't make it a higher percentage of your total portfolio than you would any other stock. Bitcoin isn't a get-rich-quick scheme, but an emerging asset that must prove itself over the coming years."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhpdHMtMTgtbW9udGgtaGlnaC0xNDQwMTU5OTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin hits 18-month high as traders bet on improving macro picture and bullish forecasts push crypto higher - Yahoo Finance",
        "content": "Bitcoin. Getty Images\n\nBitcoin climbed above $38,161 on Wednesday, its highest mark in 18 months.\n\nIn a bullish signal for investors, market expectations have ramped up for Federal Reserve interest rate cuts in 2024.\n\nStandard Chartered forecasted bitcoin could reach $100,000 by the end of next year.\n\nBitcoin rose 1% on Wednesday to reach $38,168, its highest level since April and May 2022, when prices were collapsing amid a brutal bear market.\n\nThe world's largest cryptocurrency by market capitalization has climbed more than 10% in November, supported by market expectations for the Federal Reserve to begin cutting rates in 2024.\n\nEasing monetary policy should be more a bullish tailwind for digital assets, as investors typically pull back from riskier investments when interest rates climb.\n\nIn 2023 so far, bitcoin is up about 130%, and Wall Street is bullish that more big gains are on the way.\n\nStandard Chartered said Tuesday that bitcoin is on track to hit $100,000 by the end of 2024, reiterating an earlier forecast. Meanwhile, technical analyst Katie Stockton said bitcoin could be poised for another surge in the coming weeks.\n\n\"Bitcoin would resolve its consolidation phase higher with a move above $38,000, which would act as a catalyst for a test of $42,200 resistance,\" Stockton told clients earlier this week.\n\nCrypto traders are also still hoping to see the Securities and Exchange Commission approve a spot bitcoin exchange-traded fund. Institutional players including Fidelity and BlackRock have lined up for the regulatory greenlight, while Grayscale earlier this year won a key legal battle against the SEC.\n\nAnother bullish event on the horizon is the April 2024 halving, which is when the amount of bitcoin produced via mining is cut in half.\n\nIn the 12 months following the prior three halvings in 2012, 2016, and 2020, bitcoin skyrocketed 8,069%, 284%, and 559%, respectively.\n\nRead the original article on Business Insider"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yOS9ncmF5c2NhbGUtZ2VhcnMtdXAtZm9yLWV0Zi11cGRhdGluZy10cnVzdC1hZ3JlZW1lbnQtZm9yLXNha2Utb2Ytb3BlcmF0aW9uYWwtZWZmaWNpZW5jaWVzL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yOS9ncmF5c2NhbGUtZ2VhcnMtdXAtZm9yLWV0Zi11cGRhdGluZy10cnVzdC1hZ3JlZW1lbnQtZm9yLXNha2Utb2Ytb3BlcmF0aW9uYWwtZWZmaWNpZW5jaWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Grayscale Gears Up for Spot Bitcoin ETF, Updating Trust Agreement for Sake of ‘Operational Efficiencies’ - CoinDesk",
        "content": "The first allows fees – which had been collected by Grayscale on a monthly basis – to be payable daily. This is a structural tweak and not part of any type of fee reduction – something Grayscale has committed to, but which has not been finalized as of yet, a company spokeswoman said."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0yOC9iaXRjb2luLXJhbGx5LWNvbnRpbnVlcy1jcm9zc2luZy0zOC0wMDAtdmlkZW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Watch Bitcoin Rally Continues Crossing $38,000 - Bloomberg",
        "content": "00:00\n\nAnd what you will find is it is broadly an update for digital assets really rallying across the board. Bitcoin, one of the ones leading the charge here, up 3.3%. We are now north of $38,000. This is the highest level we have seen for Bitcoin going back to May of 2022. So it's been about a year and a half ether, Of course, taking part in this rally, though it has been lagging behind the recent rally we have seen in Bitcoin in Bitcoin to a large degree, it's up by about 2.9% on the day in that action. And really across the digital asset space, you're seeing tokens moving higher is feeding back into crypto related equities, one of them being Marathon digital. It's higher by about seven and a half percent on the day. And Coinbase generally one I know you're paying a lot of attention to, it's up by about 6% at this point in the session. Coinbase has really been lighting up the internet as well. A lot of people talking about it on the platform now known as X. And remember, it has not only been up every day since we've seen struggles that big multibillion dollar settlement over at big rival Binance, it's actually been on quite a tear, Kelly, since it's hit its October lows again, Of course, some of that some of that is helped by that love in Bitcoin and other cryptocurrencies. But really, it's almost an 80% rise since it retested its lows in October. And if you pull out the chart even more, you would see that it's nearly quadrupled since its December lows that it hit last year. It's too soon to see just how much those troubles over Binance have meant over at Coinbase, what it's meant in terms of flows and customers moving over. But soon enough, time will tell."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9zdGFuZGFyZC1jaGFydGVyZWQtcmVpdGVyYXRlcy1pdHMtcHJlZGljdGlvbi1vbi1iaXRjb2lucy1wcm9qZWN0ZWQtc3VyZ2UtdG8tMTAwMDAwLWJ5LTIwMjQvOTAwNjMvMdIBmQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYW1wL2FydGljbGUvY3J5cHRvY3VycmVuY3kvc3RhbmRhcmQtY2hhcnRlcmVkLXJlaXRlcmF0ZXMtaXRzLXByZWRpY3Rpb24tb24tYml0Y29pbnMtcHJvamVjdGVkLXN1cmdlLXRvLTEwMDAwMC1ieS0yMDI0LzkwMDYzLzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Standard Chartered reiterates its prediction on Bitcoin's projected surge to $100,000 by 2024 - Forbes India",
        "content": "\n\n\n\nThe British multinational bank Standard Chartered has predicted that Bitcoin will reach a value of $100,000 by the end of 2024. The bank noted that Bitcoin has seen a massive resurgence this year, and the ‘crypto spring’ has already begun.\n\n\n\nThe prediction is a reiteration of the bank’s forecast in April of this year. The April report noted that the crypto winter is finally over, and several factors that could drive Bicoin’s climb to $100,000 are already at play. One such factor the report highlighted was the turmoil in the banking sector in March this year that helped to “re-establish Bitcoin’s use as a decentralised scarce digital asset.”\n\nAccording to the latest statements by the bank, the new catalyst to support the Bitcoin price rise would be the approval of spot Bitcoin exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC).\n\n\n\n\n\nThe Standard Chartered team and the head of crypto strategy and emerging markets FX at Standard Chartered, Geoff Kendrick, believe the ETF approvals “are likely to come sooner than expected.” “We think a number of spot ETFs will now be approved in Q1 2024 for both BTC and ETH, paving the way for institutional investment,” they said.\n\n\n\n\n\nThe team also claimed that the upcoming Bitcoin halving event in 2024 will be another source for the price surge. They believe so because past Bitcoin halving events were almost always followed by a crypto bull run.\n\n\n\n\n\nBitcoin halving is an event where rewards for mining new bitcoins are cut in half roughly every four years. This event is designed to reduce the rate at which new bitcoins are created through mining. With a finite supply of only 21 million coins, Bitcoin halvings help control the supply of Bitcoin.\n\n\n\n\n\nStandard Chartered’s Bitcoin price surge prediction has already been reinforced, with Bitcoin soaring 130 percent in 2023. “Put simply, everything is working as expected,” the bank said. “BTC’s dominance remains intact – its share of overall digital assets market cap has increased to 50 percent from 45 percent in April.”\n\n\n\n\n\nThe bank also suggested that there is a chance for Bitcoin to climb the $100,000 mark before the end of the year. They said, “We now expect more price upside to materialise before the halving than we previously did, specifically via the earlier-than-expected introduction of the US spot ETFs. This suggests a risk that the USD 100,000 level could be reached before the end of 2024.”\n\n\n\n\n\nThe bank’s prediction has already been reinforced by Bitcoin’s strong performance this year. Whether the prediction will genuinely be realised can only be seen when the time comes.\n\n\n\n\n\nThe writer is the founder at yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTI4L3Nob3J0aW5nLXZvbGF0aWxpdHktYnV5aW5nLWJpdGNvaW4tYXJlLTIwMjMtcy1zdXJwcmlzZS13aW5uZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Shorting Volatility, Buying Bitcoin Are 2023's Surprise Winners - Bloomberg",
        "content": "The ‘almost-everything rally’ of 2023 is drawing to a close, and the picture is a world apart from what market mavens predicted at this time last year.\n\nThe consensus view back then was that a tough year lay ahead for high-risk assets, as interest rates rose, recession loomed and inflation stayed high. Instead, returns have been skewed almost overwhelmingly toward the riskiest parts of the market."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qYWNrLWRvcnNleS1yYWlzZS1kZWNlbnRyYWxpemXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Jack Dorsey wants to decentralize Bitcoin mining with new investment - Cointelegraph",
        "content": "Twitter (now X) co-founder and Bitcoin (BTC) advocate Jack Dorsey is backing a new BTC mining pool to help miners regain control of block rewards and transaction fees.\n\nDorsey has led a $6.2 million seed round for Mummolin, the parent company of the new decentralization Bitcoin mining pool called Ocean, according to an announcement on Nov. 29.\n\nThe seed funding will support the launch of Ocean, which is designed to decentralize and reshape the process of Bitcoin mining. The mining pool specifically aims to provide more mining process transparency and enable miners to receive block rewards directly from Bitcoin rather than from BTC mining pools.\n\nIan Northon, co-founder and chief legal officer at Mummolin, told Cointelegraph that the raised money will be used for general corporate purposes. “Our cap table is private, but we are proud to have several OG Bitcoiners and other Bitcoin thought leaders back the project,” Northon said, adding:\n\n“Our payout system TIDES is an abbreviation for Transparent Index of Distinct Extended Shares, which we believe is an upgrade and improvement on PPLNS and vastly better than FPPS, especially over miner's transaction fee revenue.”\n\nLuke Dashjr, Mummolin co-founder and long-time Bitcoin Core developer, believes that the role of mining pools must change for Bitcoin to exist as a truly decentralized currency.\n\n“Ocean is a new type of pool that enables miners to be truly miners again. We are launching as the most transparent pool and also the only noncustodial pool where miners are the recipients of new block rewards directly from Bitcoin,” Dashjr stated.\n\nRelated: Bitcoin user pays $3.1M transaction fee for 139 BTC transfer\n\nMummolin co-founder and president Mark Artymko stressed that traditional BTC mining pools take exclusive custody of block rewards and transaction fees before distributing them among miners. “This gives them the ability to withhold payment from individual miners, whether by their own choice or by legal requirement,” Artymko said, adding:\n\n“OCEAN’s non-custodial payouts directly to miners from the block reward remove this risk and the pool’s undue influence over miners.”\n\nCommitted Ocean supporter Dorsey is confident that the platform will solve the problem of further centralization of pools and mining pools that could plague Bitcoin. He noted:\n\n“When I see a project that is good for Bitcoin broadly, and that’s also good for me and my companies personally, it becomes a simple decision for me and I’m happy to be a part of it.”\n\nThe launch of Ocean was announced at the Future of Bitcoin Mining Conference in the shadows of Barefoot Mining’s 150-year-old hydroelectric dam in rural South Carolina. Barefoot Mining, the first client of Ocean, has fully repurposed the dam, converting excess energy to Bitcoin mining at scale.\n\nOcean’s launch is 139 days before Bitcoin’s fourth halving event, which is expected on April 17, 2024. After the halving, the current 6.25 BTC mining reward per block will drop to 3.125 BTC, significantly decreasing incentives for Bitcoin miners.\n\nMagazine: Real AI use cases in crypto, No. 2: AIs can run DAOs"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZpcnN0LWhhbHZpbmctMTF0aC1hbm5pdmVyc2FyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "11th anniversary of Bitcoin's first halving: From $12 to $37,000 - Cointelegraph",
        "content": "Bitcoin (BTC), the largest cryptocurrency by market value, experienced its first-ever halving 11 years ago today. As the community celebrates the anniversary of the first Bitcoin halving, it’s timely to revisit some of Bitcoin’s historical milestones ahead of the next halving expected in April 2024.\n\nThe first Bitcoin transaction occurred nearly 15 years ago on Jan. 3, 2009, a few months after the pseudonymous creator of Bitcoin, Satoshi Nakamoto, published the Bitcoin white paper in October 2008.\n\nOn Nov. 28, 2012 — three years and 10 months after Bitcoin’s first block was mined — the first-ever halving event took place. At the time, BTC traded at around $12, according to data from StatMuse, or 308,200% below Bitcoin’s current price, according to data from CoinGecko.\n\nThough Bitcoin’s halving and the digital currency’s 21 million supply cap are not directly described in Nakamoto’s white paper, the document still hints at certain mechanisms to control the creation of new BTC. The white paper reads:\n\n“To compensate for increasing hardware speed and varying interest in running nodes over time, the proof-of-work difficulty is determined by a moving average targeting an average number of blocks per hour. If they’re generated too fast, the difficulty increases.”\n\nUnlike some basic information in the Bitcoin white paper, the halving aspect is mentioned in the Bitcoin source code. The halving is specifically available on the Bitcoin Core GitHub repository on the validation.cpp file and indicates the miner’s block subsidy is “cut in half every 210,000 blocks, which will occur every four years.”\n\nA Bitcoin halving-related snippet from the Bitcoin Core repository. Source: GitHub\n\nThe Bitcoin halving mechanism had been programmed into the BTC mining algorithm to counteract inflation by maintaining scarcity.\n\nBefore the first halving occurred, miners were compensated with as much as 50 BTC per block. After the first halving event in 2012, the subsidy was slashed to 25 BTC, followed by the second halving in 2016, which reduced the subsidy to 12.5 BTC. The most recent Bitcoin halving occurred in 2020, cutting the block subsidy from 12.5 BTC to 6.25 BTC.\n\nAs Bitcoin halvings significantly increase the cryptocurrency’s scarcity, the Bitcoin price cycle has been historically impacted by halvings. Just a year after its first-ever halving, Bitcoin had risen to nearly $1,000, while the second halving triggered a 350% surge during the year after the event, with BTC subsequently rallying to then all-time highs of nearly $20,000 in December 2017.\n\nRelated: Crypto community begins Bitcoin halving countdown as milestone date nears\n\nIn the aftermath of the third Bitcoin halving, BTC surged to its all-time high of almost $69,000 in November 2021.\n\nThe anniversary of the first Bitcoin halving comes as the cryptocurrency community awaits the fourth Bitcoin halving, which is now expected to occur on April 17, 2024. Many Bitcoin advocates are especially bullish on the Bitcoin price in 2024 amid growing expectations that United States securities regulators could finally approve a spot Bitcoin exchange-traded fund.\n\nThe 2024 halving won’t be the last one, though. Bitcoin miner reward is expected to be halved 34 times until it reaches 0 BTC after all 21 million Bitcoin are mined. Based on the current schedule, the maximum supply of 21 million Bitcoin will be reached around 2140.\n\nMagazine: 5,050 Bitcoin for $5 in 2009: Helsinki’s claim to crypto fame"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMjgvYnV5LWEtYml0Y29pbi1wdWxsYmFjay1iZWZvcmUtaXQtZ2V0cy10by00MDAwMC1zYXlzLXdvbGZlLXJlc2VhcmNoLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Buy a bitcoin pullback before it gets to $40,000, says Wolfe Research - CNBC",
        "content": "Bitcoin's price may be due for one more pullback in the coming weeks and that could be a good opportunity to buy more of the cryptocurrency before its next leg up, according to Wolfe Research. The flagship cryptocurrency has been riding a wave of positive momentum driven primarily by enthusiasm surrounding the prospects for regulatory approval of a spot bitcoin ETF in the U.S. After stagnating around $30,000 for much of the year, bitcoin has steadily climbed to new 2023 highs in recent weeks – breaking past $38,000 on Friday, after reaching $37,000 just a couple weeks prior. The next stop could be as high as $40,000, according to Wolfe's Rob Ginsberg. \"[Bitcoin] now sits within reach of having retraced 50% of the decline off its highs,\" Ginsberg wrote in a note last week. \"With ETF excitement growing and money continuing to pour into the space, we feel there's plenty of upside left to be had. However … near term price action may provide for one more buying opportunity before continuing higher.\" BTC.CM= 1Y mountain Bitcoin (BTC) now has retraced nearly 50% of the decline off its 2021 all-time high. \"As MACD [moving average convergence/divergence] rolls over and overbought conditions come in, all signs point toward a near-term pullback,\" he added. \"We would use it as a buying opportunity as the next move higher likely takes price above $40,000.\" Ginsberg pointed to bitcoin's \"wildly impressive\" year in total, with a year-to-date gain of 120% – despite months of lethargy in the spring and summer. Although on Tuesday bitcoin was back down to about $37,200, according to Coin Metrics, it has still retraced nearly 50% of its decline from roughly $69,300 in November 2021 to about $15,200 at the end of 2022. Meanwhile, ether is retesting and consolidating at the $2,000 level, which it hit earlier this month for the first time since April and which has proven a ceiling for the second largest crypto coin for more than a year. Ginsberg said ether is \"right on the cusp\" of a breakout. —CNBC's Michael Bloom contributed reporting."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWphbnVhcnktYXBwcm92YWxzLXBvc3NpYmxlLWFuYWx5c3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "'Clear runway' opens for all Bitcoin ETF approvals in Jan — Analysts - Cointelegraph",
        "content": "Bitcoin (BTC) spot exchange-traded funds (ETFs) in the United States now have a “clear runway” to potential simultaneous approvals after an advanced decision to delay the bids of Franklin Templeton and Hashdex ETFs, according to analysts.\n\nIn a Nov. 28 X (formerly Twitter) post, Bloomberg ETF analyst James Seyffart said the United States Securities and Exchange Commission (SEC) delayed its decision on the applications 34 days earlier than the Jan. 1, 2024, decision deadline.\n\nThe SEC requested comments on forms by Franklin Templeton and Hashdex that are necessary for the ETFs to eventually be listed and start trading. The comment and rebuttal period will last 35 days.\n\nSeyffart and his colleague Eric Balchunas had placed 90% odds on spot Bitcoin ETF approvals by Jan. 10, 2024, and the twin delays “all but confirms for me that this was likely a move to line every applicant up for potential approval by the Jan 10, 2024 deadline,” Seyffart said.\n\nBalchunas agreed, posting to X that the SEC was “prob looking to get them out of the way, clear runway.”\n\nProb looking to get them out of the way, clear runway — Eric Balchunas (@EricBalchunas) November 28, 2023\n\nCommercial litigator Joe Carlasare thinks the delays increase the probability of a March 2024 approval, as the comment period for Franklin’s ETF bid was extended until Jan. 3, 2024, and the SEC typically takes a maximum of three weeks to review comments.\n\nThe Franklin BItcoin spot ETF comment period now extends until January 3rd.\n\n\n\nThe SEC typically reviews comments for at least 2-3 weeks. Therefore, although it’s not guaranteed, this increases the probability of a March approval.\n\n\n\nJanuary is still likely the favorite though. — Joe Carlasare (@JoeCarlasare) November 28, 2023\n\n“January is still likely the favorite though,” he added, later estimating it to happen on Jan. 5 or Jan. 8.\n\nRelated: Futures will be the best crypto game in town even after a Bitcoin spot ETF\n\nOn Nov. 28, Franklin also submitted an updated Form S-1 for its ETF — a document registering securities with the SEC — after Seyffart had earlier highlighted that it was the only bidder yet to submit an updated prospectus.\n\nReacting to the filing, Balchunas said while he’s in favor of letting all ETFs launch simultaneously, it “seems kinda unfair” that Franklin might be allowed to launch its ETF the same day as other providers despite submitting the form months later.\n\nWhile I'm generally in favor in letting them launch at same time, Franklin jumped in sooo late vs others, like 5mo after ARK filed and yet they may be able to launch the same day.. seems kinda unfair... but i suppose SEC can't really draw any lines here — Eric Balchunas (@EricBalchunas) November 28, 2023\n\nThere are currently 12 spot Bitcoin ETFs before the SEC, including bids from Grayscale and BlackRock. Most have final decision dates in March, besides ARK Invest’s bid, which the SEC must approve or deny by Jan. 10, 2024.\n\nMagazine: Beyond crypto — Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI5L2phY2stZG9yc2V5LWFpbXMtdG8tY3JlYXRlLWFudGktY2Vuc29yc2hpcC1iaXRjb2luLW1pbmluZy1wb29sLXdpdGgtbmV3LXN0YXJ0dXAv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI5L2phY2stZG9yc2V5LWFpbXMtdG8tY3JlYXRlLWFudGktY2Vuc29yc2hpcC1iaXRjb2luLW1pbmluZy1wb29sLXdpdGgtbmV3LXN0YXJ0dXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Jack Dorsey Aims to Create Anti-Censorship Bitcoin Mining Pool With New Startup - CoinDesk",
        "content": "The capital will support the start of a decentralized mining pool - OCEAN. The new non-custodial pool will be the first of its kind as it will pay the miners their block rewards directly, without meddling by a centralized entity, unlike some of the existing pools, according to a statement."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1ldHJpYy1mdXR1cmUtNDhrLWJ0Yy1wcmljZS1ldGbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin metric that 'looks into future' eyes $48K BTC price around ETF - Cointelegraph",
        "content": "Bitcoin (BTC) may cruise to nearly $50,000 as the United States okays the first spot BTC exchange-traded fund (ETF).\n\nAs flagged by popular analyst CryptoCon, the Ichimoku Cloud indicator is counting down to upside BTC price continuation.\n\nAnalysis: $43,000 BTC price is “most conservative level”\n\nBitcoin is in a rare position on weekly timeframes when it comes to Ichimoku Cloud signals.\n\nAs Cointelegraph reported, the indicator, combining past, present, and future trading cues, suggests that BTC price gains have only begun.\n\nIn a post on X (formerly Twitter) on Nov. 27, CryptoCon delivered a specific target for what could happen next.\n\nIchimoku’s leading spans have crossed, leading to the formation of a new upside cloud. With the lagging span, Chikou, breaking out of resistance, price should now logically head higher.\n\n“The Weekly Ichimoku cloud called our last Bitcoin rise to 38k two months in advance with the cross projected in the future,” he wrote.\n\n“Now we wait for it to fill its next calls, the completion of our rise and the first target of 43k. This has taken anywhere from 7 to 11 weeks from the cross, an average of 10 weeks means our move completes in early January.”\n\nBitcoin Ichimoku Cloud annotated chart. Source: CryptoCon/X\n\nCryptoCon added that $43,200 was, in fact, the “most conservative level” and that $48,000 was a suitable ceiling.\n\nHe concluded:\n\n“Even with some pause in between, the indicator that looks into the future says we are not done!”\n\nBTC/USD 1-week chart with Ichimoku Cloud features highlighted. Source: TradingView\n\nBitcoin traded at $37,000 at the time of writing on Nov. 28, per data from Cointelegraph Markets Pro and TradingView.\n\nA match made in heaven?\n\nIchimoku’s timing is arguably as interesting as its targets.\n\nRelated: $48K is now ‘reasonable’ BTC price target — DecenTrader’s Filbfilb\n\nShould traditional timing play out, based on previous bull markets, the $48,000 move should come in early January — coinciding with the expected ETF approval date.\n\nLittle is known about what U.S. regulators have in store or which specific ETF products, if any, will get the green light first.\n\nIn the meantime, the U.S. Securities and Exchange Commission, which determines what ETFs come to market, continues to pressure crypto sentiment with enforcement actions against Binance, the world’s largest exchange.\n\nA $4.3 billion fine and the removal of Changpeng Zhao as CEO have meanwhile benefited the shares of rival exchange Coinbase, which are up over 250% year-to-date.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9jYXJkYW5vcy1ob3NraW5zb24tYmxhc3RzLWJpdGNvaW5zLWRlY2VudHJhbGl6YXRpb24tc2VjLXRyZWF0bWVudC1idGMtcGF0aGV0aWMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Cardano's Hoskinson Blasts Bitcoin's Decentralization -- Calls SEC Treatment of BTC \"A Pathetic F*****g Joke - CCN.com",
        "content": "Key Takeaways\n\nCharles Hoskinson of Cardano conducted another AMA livestream.\n\nHoskinson took aim at the SEC for its alleged Bitcoin favoritism.\n\nHe also pushed back on the accusation that ADA had an Initial Coin Offering (ICO).\n\nCardano founder Charles Hoskinson recently criticized the SEC’s approach to regulating cryptocurrencies, accusing the agency of giving Bitcoin a “complete pass” while subjecting other crypto assets like Cardano’s ADA token to much harsher scrutiny.\n\nSEC Treatment of ADA a “Pathetic Joke”\n\nIn a fiery livestream , Hoskinson called the differential treatment an “absolutely pathetic joke,” demanding the SEC explain why Bitcoin is viewed as sufficiently decentralized while cryptos like ADA are labeled securities. “Explain it to me [the difference between Bitcoin and other cryptocurrencies] like I am five years old. Run the Howey test!”\n\n“If you subpoena and attack about three different entities, you could perform a 51% attack on Bitcoin because that’s the way the hash power works,” Hoskinson said. “But it’s decentralized, apparently.”\n\nThe Cardano founder argued Bitcoin is not as decentralized as commonly believed since controlling over half the network’s hash rate would only require coercion of a few large mining pools.\n\nCharles Hoskinson GOES OFF on SEC & Bitcoin getting a pass while Cardano $ADA & crypto has to suffer. 👇 pic.twitter.com/Vm1u9jGrIr — Altcoin Daily (@AltcoinDailyio) November 27, 2023\n\nHoskinson also rebutted claims that Cardano had an ICO (Initial Coin Offering) token sale, which could justify stricter regulatory oversight.\n\n“There was an airdrop onto a distribution, and then thousands of people who never met each other traded Ada on exchanges and used Cardano for their projects,” he stated.\n\n“A voucher sale of a different asset outside of the United States, priced in Yen, settled in Bitcoin, explained in Japanese to Japanese citizens, and without a single US participant does not constitute an ICO of Ada.”\n\nICOs are controversial in the context of whether or not cryptocurrencies like ADA and Bitcoin are securities. Regulators are more likely to view a cryptocurrency that had an ICO as a security due to their shared characteristics, including the expectation of profit and the fact that an ICO could be construed as an investment contract.\n\nThe debate about which cryptocurrency is a security is a live one for Hoskinson and Cardano. ADA has repeatedly been mentioned as a “crypto asset security” in SEC documents. Most recently in a case involving the cryptocurrency exchange, Kraken.\n\nCharles Hoskinson Also Praised Javier Milei\n\nIn the end, Hoskinson attributed the SEC’s uneven treatment to pure favoritism, sarcastically praising Bitcoin’s “orange pill moonboys” for receiving preferential treatment from regulators.\n\n“It would be funny if not for the fact that hundreds of millions of dollars of legal fees have been exhausted in this pyrrhic war that’s being fought on the industry,” he said.\n\nHe also predicted the SEC would lose case after case while the industry continued growing before the regulator’s attack finally ended – without apology or recompense.\n\nHe vowed that the industry would continue fighting unwinnable court battles until the SEC’s overreach was finally reined in.\n\nHoskinson went on to argue that the entire reason cryptocurrencies were created was to “reestablish the social contract” in the face of a “horrifically broken” system where regulators like the SEC waste hundreds of millions harassing the industry while remaining “unaccountable” themselves.\n\nThe Cardano founder praised libertarian lawmakers as the only people improving the situation by “unraveling the government” through cryptos that provide an alternative to legacy finance.\n\nHe also had kind words for Argentina’s new anarcho-capitalist President, Javier Milei. “Somebody who says the government is the problem and not the solution to the problem… I like that guy.”\n\nHoskinson also spoke enthusiastically about bringing Milei into the pro-blockchain movement, seeing the fiery politician as somewhat of a kindred spirit. “We’re going to get there, and I think Argentina has a chance to lead the world.”"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1taW5pbmctc29sYXItd2luZC1yZW5ld2FibGUtZW5lcmd5LWIyNDU0NjY2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin mining could supercharge transition to renewables, study claims - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nSolar and wind energy installations could earn hundreds of millions of dollars by mining bitcoin during periods of excess electricity generation, according to a new study.\n\nScientists from Cornell University in the US, who conducted the research, said setting up mining operations could reduce the environmental impact of cryptocurrency, while also providing revenue that could be reinvested in future renewable energy projects.\n\n“Profitability of a mining system hinges on periods of steady energy availability since renewable energy sources can vary significantly,” said Fengqi You, a professor of energy systems at Cornell University.\n\n“Therefore, it is important to site the mining farm strategically to maximise productivity.”\n\nThe state with the most potential for setting up profitable crypto mining operations is Texas, according to the study, with 32 planned renewable projects capable of generating combined profits of $47 million.\n\nView more\n\nCalifornia, Colorado, Illinois, Iowa, Nevada and Virginia all showed potential, though setting up mining rigs presents a large initial cost.\n\nOne way of incentivising such projects, Cornell doctoral student Apoorv Lal suggested, could be the introduction of new policies that provide economic rewards for mining bitcoin and other cryptocurrencies with clean energy\n\n”These rewards can act as an incentive for miners to adopt clean energy sources, which can lead to combined positive effects on climate change mitigation, improved renewable power capacity, and additional profits during pre-commercial operation of wind and solar farms,” Mr Lal said.\n\n“We also recommend policies that encourage cryptocurrency-mining operations to return some of their profits back into infrastructure development. This would help create a self-sustaining cycle for renewable energy expansion.”\n\nBitcoin has drawn criticism from environmentalists for the vast amounts of electricity required to support its network and mint new units of the cryptocurrency, with recent analysis from the University of Cambridge estimating that it uses roughly the same amount of electricity as Poland.\n\nThe plummeting costs of renewable energy mean bitcoin miners are increasingly turning to solar, wind and hydro sources to power their operations.\n\n“In its current status, the infrastructure that supports the Bitcoin protocol cannot be sustained, but the beauty of the protocol is that the incentive structure will force miners to adopt the cheapest form of electricity, which in the near future will be renewable energy,” Don Wyper, COO of DigitalMint, told The Independent last year.\n\nThe latest study, titled ‘From mining to mitigation: how bitcoin can support renewable energy development and climate action’, was published in the journal ACS Sustainable Chemistry & Engineering."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1MTIwL2phY2stZG9yc2V5LXNlZWQtcm91bmQtZGVjZW50cmFsaXplZC1iaXRjb2luLW1pbmluZy1wb29sLW9jZWFu0gFmaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1MTIwL2phY2stZG9yc2V5LXNlZWQtcm91bmQtZGVjZW50cmFsaXplZC1iaXRjb2luLW1pbmluZy1wb29sLW9jZWFu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Jack Dorsey leads $6.2 million seed round for Bitcoin mining pool OCEAN - The Block",
        "content": "Mummolin, Inc. has raised a $6.2 million seed funding round led by Block CEO Jack Dorsey to support the launch of OCEAN — a decentralized Bitcoin mining pool — and other mining decentralization projects.\n\nAccomplice, Barefoot Bitcoin Fund, MoonKite, NewLayer Capital and the Bitcoin Opportunity Fund also participated in the round, according to a statement.\n\nOCEAN announced the raise at the Future of Bitcoin Mining Conference yesterday, set against the backdrop of a 150-year-old repurposed hydroelectric dam in rural South Carolina, which utilizes excess energy for Bitcoin mining.\n\nOCEAN aims to help miners regain autonomy and decision-making power over more complex processes in mining operations, and is designed to be non-custodial, transparent and permissionless.\n\n\"The intention is to disintermediate to the greatest extent possible. Pools have become trusted third parties whose permission we have required for activating soft forks and deciding what gets into the blockchain in addition to taking custody of all newly generated coins,\" OCEAN's Global Head of Sales, pseudonymous Bitcoin Mechanic, said. \"By offering transparency and a mechanism for miners to be paid directly by Bitcoin itself, we make the network radically more robust.\"\n\nSolving Bitcoin mining pool centralization\n\nMummolin was co-founded by long-time Bitcoin Core developer Luke Dashjr. The Wyoming-based company is the successor to the Eligius Bitcoin mining pool Dashjr founded — a popular zero-fee mining pool that operated from 2010-2017.\n\n\"The role of mining pools must change for Bitcoin to exist as a truly decentralized currency,\" Dashjr said in the statement. \"OCEAN is a new type of pool that enables miners to be truly miners again. We are launching as the most transparent pool and also the only non-custodial pool where miners are the recipients of new block rewards directly from Bitcoin.\"\n\n\"OCEAN is solving a problem for Bitcoiners that I think all of us feel — further centralization of mining pools that could plague Bitcoin, and how that risks a bunch of Bitcoin attributes that we hold dear,” Dorsey added.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\n\"When I see a project that is good for Bitcoin broadly, and that's also good for me and my companies personally, it becomes a simple decision for me and I'm happy to be a part of it,\" Dorsey said.\n\nBarefoot Mining, OCEAN's first customer, said the new pool would bring some badly needed diversity to Bitcoin mining. \"In my opinion, this is the most significant new company announcement in the Bitcoin world over the past few years,” Barefoot Mining CEO Bob Burnett said. “The new pool will bring new features and some badly needed diversity to the mining world.\"\n\nAntPool and Foundry USA dominance\n\nTwo centralized Bitcoin mining pools, AntPool and Foundry USA, currently dominate hashrate distribution, with an estimated combined market share of over 55% of the total Bitcoin hashrate, according to Blockchain.com.\n\nHowever, it is important to note that these pools are made up of numerous geographically dispersed Bitcoin miners with the flexibility to redirect their mining power to different pools at any time.\n\nOn Monday, Bitcoin mining firm DEMAND launched the first Bitcoin mining pool that operates on Stratum v2 — another initiative designed to bolster the decentralization of the Bitcoin mining ecosystem.\n\nOCEAN said it plans to introduce additional Bitcoin mining decentralization improvements in 2024."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tc3Rvcmllcy1jaGFybGllLXNocmVtLXRlbGxzLWhvdy1iZWNhbWUtYml0Y29pbi1taWxsaW9uYWlyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Crypto Stories: Charlie Shrem tells how he became a Bitcoin millionaire - Cointelegraph",
        "content": "Charlie Shrem went from running a small online business to becoming a Bitcoin (BTC) millionaire and making the cover of Forbes magazine. And then he went to prison.\n\nIn the latest episode of Cointelegraph’s Crypto Stories, Shrem tells the story of how he founded BitInstant, grew it into a multimillion-dollar Bitcoin empire, and then was arrested for his role in it.\n\nShrem’s first business was an e-commerce site that only charged $5 shipping per item. The idea was his cousin’s, but Shrem used his coding skills to create the actual site. The business sold lights, toothbrushes, razors and other assorted items.\n\nIn his free time, Shrem hung out on online message boards. That’s where he found out about Bitcoin. At the time, the only way to buy Bitcoin was to wire transfer large amounts of funds to Mt. Gox, and it took a week for the deposit to clear within the banking system. A customer who wanted to buy smaller amounts or wanted to buy instantly had no way of doing so.\n\nShrem met up with a person in one of these forums named “Gareth,” and the two started a business that would allow people to buy or sell Bitcoin instantly. Their company was called BitInstant. To allow for instant purchases, the company deposited money into Mt. Gox and purchased Bitcoin with it. They then sold this Bitcoin off in smaller amounts to various customers.\n\nBut Shrem and his partner ran into a problem. As their transaction volume grew, they needed more and more cash to deposit into Mt. Gox, and their capital was running out quickly, as Shrem explained:\n\n“It always needed more money because we were growing in transaction size. So, in a way that an ATM needs money to sit in the machine all day, we needed money to sit in the exchanges for a week, [be]cause it would take up to a week to top up again. It was a cycle, so we always needed seven to eight times our transaction volume.”\n\nThe two entrepreneurs met Roger Ver, who helped them with a $100,000 capital injection to continue scaling the business. Ver also suggested the team hire Erik Voorhees. Later, Voorhees and Shrem ran across David Azar at a tech convention, who invested more. Finally, during his honeymoon, Azar met Cameron and Tyler Winklevoss on a beach and convinced them to invest in the company, which provided enough cash to allow the company to overcome its scaling difficulties.\n\nRelated: Erik Voorhees lashes ‘disgusting’ behavior of Bitcoin maxis\n\nBitInstant grew so fast that it eventually became responsible for 30% of all transactions on the Bitcoin blockchain. Meanwhile, Shrem was struggling in his relationships with his family and the Jewish community he belonged to. Shrem began to feel that his religious community was stifling, especially after he fell in love with a person who was not Jewish. This frustration eventually reached a peak, and Shrem decided to leave the Jewish community.\n\nThen, while attempting to disembark from a plane in New York, Shrem was arrested and charged with money laundering for his role in BitInstant. Authorities claimed that some BitInstant customers had used the Bitcoin they purchased from the company for illicit purposes, including criminal transactions on the Silk Road dark web marketplace.\n\nWhen released on bail, Shrem was placed under house arrest and forced to live with his strict Jewish parents, who believed that his arrest was a punishment from God in response to him leaving the community. “They thought I deserved what was coming to me,” Shrem said. “They were excited to see me go to jail because they felt that I hurt them so hard.”\n\nThat’s all for Part 1 of Charlie Shrem’s crypto story. There is more to come in Part 2.\n\nFollow the full story: The Untold Story of Charlie Shrem."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy50aGVibG9jay5jby9wb3N0LzI2NTA1MS9iaXRjb2luLXZlbG9jaXR5LWhpdHMtaGlzdG9yaWNhbGx5LWxvdy1sZXZlbC1hcy1zdGFuZGFyZC1jaGFydGVyZWQtcmVuZXdzLWxhc2VyLWV5ZWQtZm9yZWNhc3TSAYUBaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1MDUxL2JpdGNvaW4tdmVsb2NpdHktaGl0cy1oaXN0b3JpY2FsbHktbG93LWxldmVsLWFzLXN0YW5kYXJkLWNoYXJ0ZXJlZC1yZW5ld3MtbGFzZXItZXllZC1mb3JlY2FzdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin velocity hits historically low level as Standard Chartered renews laser-eyed forecast - The Block",
        "content": "Bitcoin BTC -3.21% velocity, a measure of how frequently the digital asset is traded or used for transactions, stands at a historically low level, according to analysts.\n\nBitfinex analysts observed a contrast between the current bitcoin velocity and the average recorded in the last cryptocurrency bear market in 2018-2019.\n\n\"Historically low bitcoin velocity indicates a significant change in sentiment compared to the last bear market cycle,\" the analysts said in a note.\n\nAccording to Bitfinex, the low-velocity level suggests holders of the digital asset have become reluctant to sell and that buyers are seeking out new supply.\n\n\"It is not surprising therefore that bitcoin reached a new year-to-date high of $38,410 on November 24, as holders become reluctant to sell and buyers seek out supply,\" the analysts added.\n\nBitcoin on track for $100,000, according to StanChart\n\nOn Tuesday, Standard Chartered Bank said its April forecast that bitcoin would reach $100,000 by the end of 2024 still stands.\n\nRELATED INDICES See crypto indices\n\nAccording to Standard Chartered Bank Head of FX Research Geoff Kendrick, the main catalyst for upward price trajectory will be the approvals of several U.S.-based spot bitcoin ETFs.\n\nKendrick and his team expect these approvals \"are likely to come sooner than expected.\"\n\n\"We think a number of spot ETFs will now be approved in Q1-2024 for both BTC and ETH, paving the way for institutional investment,\" they said.\n\n\"Put simply, everything is working as expected,\" they continued. \"BTC's dominance remains intact, its share of overall digital assets market cap has increased to 50% from 45% in April.\"\n\nThe world's largest cryptocurrency by market capitalization increased 3.2% over the past 24 hours to $38,141 at 2:40 p.m. ET, according to CoinGecko."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zYW50YW5kZXItYXBwb2ludHMtY3J5cHRvLWN1c3RvZGlhbi10YXVydXMtc2FmZWd1YXJkLWJpdGNvaW4tZXRoZXItcmVwb3J00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Santander appoints crypto custodian Taurus to safeguard Bitcoin, Ether: Report - Cointelegraph",
        "content": "Spanish financial services giant Banco Santander has reportedly selected digital asset management firm Taurus to safeguard its Swiss clients’ Bitcoin (BTC) and Ether (ETH).\n\nOn Nov. 20, Santander Private Banking International’s Swiss private banking unit rolled out a new Bitcoin and Ether trading service for clients with Swiss accounts. According to an internal announcement seen by Cointelegraph, Santander clients will get access to crypto investment services only after requesting it through relationship managers.\n\nA CoinDesk report citing “a person familiar with the arrangement” stated that the bank had appointed crypto custody firm Taurus to implement a self-custody model for digital assets. Cointelegraph reached out for confirmation from Santander, which declined to comment, saying:\n\n“Unfortunately, it’s a no comment. We don’t comment on providers or possible providers.”\n\nOn Sept. 14, Taurus partnered with German banking giant Deutsche Bank to provide cryptocurrency custody options to its customers.\n\nTaurus did not immediately respond to Cointelegraph’s request for comment.\n\nRelated: JPMorgan, Apollo plan for enterprise mainnet, execs reveal\n\nWhile some banks tap into existing players for custodial needs, DZ Bank — the third largest bank in Germany by asset size — launched its own digital assets custody platform built on blockchain.\n\nHolger Meffert, head of securities services and digital custody at DZ, expressed the bank’s interest in distributed ledger technology. The bank also hopes to offer institutional investors and private customers the facility to buy cryptocurrencies, “such as Bitcoin,” in the future.\n\nMagazine: Real AI use cases in crypto, No. 2: AIs can run DAOs"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZWxmYXJvLm5ldC9lbi8yMDIzMTEvZWxfc2FsdmFkb3IvMjcxNjQvQ3J5cHRvLVR1cm1vaWwtUHVzaGVzLUJ1a2VsZS1CYWNrLVRvd2FyZC1UcmFkaXRpb25hbC1GaW5hbmNpYWwtSW5zdGl0dXRpb25zLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Crypto Turmoil Pushes Bukele Back Toward Traditional Financial Institutions - El Faro",
        "content": "El Faro is a Central American investigative newsroom. Subscribe to our newsletter.\n\n\n\nLast week, the world’s largest crypto exchange, Binance, made the kind of admission that could have spelt ruin for most companies seeking new markets. But not in San Salvador.\n\nCEO Changpeng Zhao pled guilty to violating U.S. anti-money laundering laws, stepped down, and agreed to pay $4.3 billion in fines to the U.S. government stemming from charges including operating an under-the-table crypto exchange in the country.\n\n“The company caused illegal transactions… in sanctioned jurisdictions such as Iran, Cuba, Syria, and Russian-occupied regions of Ukraine — transactions for which Binance profited with significant fees,” said a U.S. Attorney.\n\nIt strains credulity that the Bukele administration could have been unaware of Binance’s legal troubles in August, when it granted them a local license to issue digital assets like bitcoin: The SEC had publicly accused the firm, in a separate investigation, two months earlier.\n\nIn March 2022, Bukele hosted Zhao, according to state media, to explore “joining the projects being started in Salvadoran territory.” Ambassador to the U.S. Milena Mayorga announced the following June that Binance had hired 50 “executives” in the country.\n\nSince its inception, Bukele’s bitcoin project has stoked worries of money laundering, but the administration has not appeared overly troubled. In its haste to roll out the cryptocurrency wallet Chivo, the government removed Know-Your-Client controls, leading to theft of between $12 to $24 million in public funds, per U.S. court documents.\n\nAt the conclusion of Bitcoin Week in November 2021, bitcoin enthusiasts ended the day at El Zonte Beach, the cradle of cryptocurrency in El Salvador. Photo Carlos Barrera\n\nBinance isn’t the first company under scrutiny to receive a license in El Salvador: Bitfinex, the popular company behind the U.S. dollar-pegged stablecoin Tether, announced its own license in April. The company was barred from New York State in 2021 for allegedly deceiving users about the volume of reserve dollars backing its Tether tokens.\n\nThe same day that Binance pled guilty, Bitfinex announced it had granted access to its Tether platform to the U.S. Secret Service and plans to do the same with the FBI, in a show of its “unwavering commitment to combat illicit activities.”\n\nMeanwhile, smaller players are emerging in the Salvadoran ecosystem. According to Forbes Centroamérica, at least seven companies have registered to operate exchanges under the Digital Assets Issuance Law approved in January by the Salvadoran legislature.\n\nEvicted from Bitcoin Beach\n\nFrom the beginning, regulation of the crypto-space in El Salvador has been marred by conflict of interest: Bitfinex was one of the companies who helped write the digital securities law that authorities have used to issue its license.\n\n“The way bitcoin was implemented posed risks of converting the country into a fiscal paradise and facilitating money laundering,” Lourdes Molina, of the Central American Institute for Fiscal Studies (ICEFI), told El Faro English. “Those risks are still present.”\n\nGiancarlo Devasini (back right), who opened Bitfinex Securities El Salvador SA de CV in February, appears behind ruling party deputies and Samson Mow (far left) on Feb. 8, 2022. Photo posted to social media by ruling party legislator William Soriano.\n\nThe IMF has been highly critical of the bitcoin implementation, which remains a primary obstacle in granting a debt restructuring agreement with the Salvadoran government.\n\nThe bitcoin experiment also faces low popularity and usage in El Salvador. The government declared related state spending a secret, and the Treasury Ministry claims to not know the amount invested in buying bitcoin, but estimates reach at least $121 million.\n\nAt the same time, key promises made to the public have not come to fruition, like financial inclusion, a rise in employment, or attraction of foreign investment, according to Molina.\n\n“The adoption of bitcoin was clearly not a public policy designed to improve the wellbeing of the population,” she said. “If we add to this the legal problems facing these digital assets businesses with licenses to operate here, the question becomes even more relevant: Why does the Bukele administration insist on keeping this project?”\n\nPlans have also disappeared for the much-hyped ‘volcano’ or ‘bitcoin bonds’ to be issued by the government — and originally thought to be brokered by Bitfinex.\n\nBut the government continues to present bitcoin as key to its brand and model of modernization. According to Mala Yerba, 25 families are set to be evicted from the El Zonte beachfront, in order to make room for Bitcoin Beach Club de Playa, a tourism project. Reneging on an original pledge, the government is looking to relocate the decadeslong residents to near a sewage treatment plant.\n\nBitcoin regulation?\n\nThe Salvadoran digital environment remains a chief concern of U.S. policymakers. As the Biden administration finds less and less to say about Bukele’s unconstitutional bid for reelection and repeated reports of mass human rights violations under the 20 months-long state of exception, both governments made a joint statement on November 10 on “shared digital policy priorities.”\n\n“The United States and El Salvador seek to collaborate to realize El Salvador’s aspirations to become a regional technology hub through pursuing a sound digital regulatory environment,” wrote the U.S. Undersecretary of Commerce Marisa Lago and Salvadoran Economy Minister María Luisa Hayem.\n\n“It is very evident that there has been a rapprochement between El Salvador and the United States, particularly in the economic realm,” said Molina.\n\nChivo, a publicly funded private business, began installing bitcoin ATMs in El Salvador in August 2021. The government dispatched the military and police throughout the country to stand guard over the new machines, like this one in the municipal market in Santa Tecla, La Libertad. Photo Víctor Peña\n\n“Washington looks at El Salvador as a piece of its regional agenda for two main reasons: immigration and the construction of a digital wall against the influence of China and Russia,” concludes Ricardo Valencia, professor at California State, Fullerton, in an op-ed for El Faro English.\n\nTelecoms appear to be a growing front of great power conflict in Central America. This month, Nicaragua granted rights to operate 5G to the US-sanctioned Chinese company Huawei. Costa Rica recently drew the ire of the Chinese Embassy in excluding Huawei from competing for a telecoms project worth over $1.5 billion.\n\nIn her joint statement with El Salvador, Undersecretary Lago also highlighted “bilateral cybersecurity cooperation” and strengthening of the “security and resilience of our telecommunications networks,” expressly mentioning 6G technology.\n\nValencia argues the Bukele administration sees in Washington a means to reset its fraught debt relief negotiations with the IMF: “The president’s openness to regulate the Salvadoran digital environment —this seemed profane in his crypto creed— appears to indicate he will seek a more conventional path to pay the growing foreign debt.”\n\nThe Fund’s former Latin America director, Alejandro Werner, hired by the Bukele administration in April to “collaborate” by spurring talks with the IMF, admitted last week in an interview that El Salvador is, together with Argentina and Ecuador, one of the few countries in Latin America that does not have under control its debt problem.\n\nWhile the Bukele administration has received significant financial support from the Central American Bank for Economic Integration, the election of Costa Rican Guisela Sánchez to head the bank could more sternly condition access to finance for San Salvador. And with the crypto-bond path apparently shuttered, the IMF route is now back to center stage.\n\nSources in Washington confirm that Bukele’s new finance minister, Jerson Posada, visited D.C. in September. Kamala Harris’ top security advisor, Phil Gordon, will be in San Salvador today. The new Salvadoran honeymoon with the U.S. government makes an IMF agreement very likely.\n\n\n\n*Correction on Nov. 28 at 12:05 ET: An earlier version of this article misstated that Binance and Zhao pled guilty to 13 charges in a U.S. federal court. While they pled guilty to charges filed by the DOJ, “13” referenced the number of charges presented by the SEC in a separate complaint, which is still ongoing."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tZnVuZHMtc2VlLW92ZXItMzExLW1pbGxpb24td2Vla2x5LWluZmxvd3MtaW4tYW50aWNpcGF0aW9uLW9mLXNwb3QtYnRjLWV0Zi1hcHByb3ZhbC0yMDIzMTEyODA2MDDSAZoBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvYml0Y29pbi1mdW5kcy1zZWUtb3Zlci0zMTEtbWlsbGlvbi13ZWVrbHktaW5mbG93cy1pbi1hbnRpY2lwYXRpb24tb2Ytc3BvdC1idGMtZXRmLWFwcHJvdmFsLTIwMjMxMTI4MDYwMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin sees flat performance as correlation with equities is on the rise - FXStreet",
        "content": "Funding fees bridge the difference between spot prices and prices of futures contracts of an asset by increasing liquidation risks faced by traders. A consistently high and positive funding rate implies there is a bullish sentiment among market participants and there is an expectation of a price hike. A consistently negative funding rate for an asset implies a bearish sentiment, indicating that traders expect the cryptocurrency’s price to fall and a bearish trend reversal is likely to occur.\n\nHigher Open Interest is associated with higher liquidity and new capital inflow to the market. This is considered the equivalent of increase in efficiency and the ongoing trend continues. When Open Interest decreases, it is considered a sign of liquidation in the market, investors are leaving and the overall demand for an asset is on a decline, fueling a bearish sentiment among investors.\n\nAccording to crypto analyst Adrian Zduńczyk, Bitcoin’s breakout target is the range between $39,000 and $40,000. The analyst has identified the range between $25,000 and $32,000, as the trading range for Bitcoin.\n\nBitcoin price performance has flattened over the past two weeks after the BTC run up to $38,400 on November 24. The largest asset by market capitalization observed an increase in capital inflow from institutional investors last week, according to a CoinShares report.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idXktdGhlLXJ1bW9yLXNlbGwtdGhlLW5ld3MtYml0Y29pbi1ldGYtdHJhZGZpLXNlbGwtb2Zm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "'Buy the rumor, sell the news' — Bitcoin ETF may spark TradFi sell-off - Cointelegraph",
        "content": "Bitcoin (BTC) may suffer when the United States approves the first spot exchange-traded fund (ETF), a new warning says.\n\nIn a thread on X (formerly Twitter) on Nov. 28, Joshua Lim, head of derivatives at capital market firm Genesis Trading, predicted a volatile start to 2024 for BTC price action.\n\nBitcoin ETF approval: Retail may be left holding the buck\n\nLim said that Bitcoin is already a target for traditional finance, or “TradFi,” which is betting on winning big out of the spot ETF approval.\n\n“We know tradfi guys / macro tourists are already long crypto ahead of ETF news. They’ve built the position over the last few months and are now paying handsomely to roll it,” the thread explained alongside data covering open interest on CME Group’s Bitcoin futures.\n\n“Commitment of traders data showing asset managers increased length by about $1bn since end of Sep.”\n\nCME Group Bitcoin futures open interest. Source: Joshua Lim/X\n\nThe signs are there in the performance of the first Bitcoin futures ETF (BITO), as well as stocks of crypto firms such as U.S. exchange Coinbase (COIN), the latter up 250% year-to-date.\n\nWhile generating buzz and emboldening the institutional adoption narrative behind Bitcoin, the party could quickly fizzle once the spot ETF is given the green light. This, Lim and others suggest, would be a classic “buy the rumor, sell the news” event.\n\n“What does it all mean?” he queried.\n\n“Tradfi is already long and probably thinking about when to exit this trade around etf announcement expect retail to pile in.. and expect tradfi guys to exit (2021 tops in basis were prior to COIN and BITO listings).”\n\nCoinbase (COIN) vs. ProShares Bitcoin Strategy ETF (BITO) chart. Source: TradingView\n\nA gold ETF rerun?\n\nLim is not alone in wondering if ETF approval day will ultimately leave lay investors disadvantaged.\n\nRelated: Bitcoin metric that ‘looks into future’ eyes $48K BTC price around ETF\n\nResponding, James Straten, research and data analyst at crypto insights firm CryptoSlate, channeled history to support the concerns.\n\n“When the Gold ETF (GLD) was introduced in November 2004, it opened around $45 and dropped to approximately $41 by May 2005. However, it saw an impressive 268% increase over the subsequent seven years,” he added in a CryptoSlate analysis on Nov. 28.\n\nOn a more optimistic interim note, popular trader Jelle remarked that institutional interest had not been dented by the week’s news stories, including the $4.3-billion settlement between the U.S. government and the largest global crypto exchange, Binance.\n\nCME futures, he stressed, continue to trade at a premium over the Bitcoin spot price.\n\nInteresting to note that throughout all of the courtroom drama, institutions are accumulating #Bitcoin.\n\n\n\nThe CME currently has a >$350 premium to the Bitfinex spot price -- and it has consistently traded at a premium for well over a month https://t.co/3SAXRnMMRq pic.twitter.com/TAZDm6IABd — Jelle (@CryptoJelleNL) November 28, 2023\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mdXR1cmVzLWJlc3QtY3J5cHRvLWdhbWUtZXZlbi1hZnRlci1iaXRjb2luLXNwb3QtZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Futures will be the best crypto game in town even after a Bitcoin spot ETF - Cointelegraph",
        "content": "The Chicago Mercantile Exchange (CME) has long been the home of crypto for traditional finance investors, and this is unlikely to change — even with the approval of a Bitcoin spot ETF.\n\nActivity on the CME has expanded significantly over the past 12 months. The CME now sees more Bitcoin (BTC) futures trading than the world’s biggest crypto exchange, Binance. Open BTC interest on the CME now makes up 24.7% of the entire market, making it the top Bitcoin futures trading venue in the world\n\nWhile some of this activity is almost certainly linked to anticipation of approval for a spot ETF, the launch of one or more will not lead to a reduction of activity in the futures market. In fact, futures trading is likely to expand rather than contract when the SEC finally gives BlackRock et. al. the green light.\n\nRelated: History tells us we’re in for a strong bull market with a hard landing\n\nThere is no doubt that a spot ETF will bring large flows of institutional money into the sector. However, it will not change the basic fundamentals of Bitcoin liquidity. As we know, the supply of Bitcoin is capped at 21 million. That means the futures market is the only place where real trade action can happen.\n\nThe CME has been successfully used by Goldman Sachs, Morgan Stanley, JP Morgan and others to trade cryptocurrency instruments for years, and they have been using futures to do so. Futures remain the instrument of choice because liquidity is the main issue in the spot market. These huge institutional investors could buy bitcoin at any time, but liquidity remains the chief drawback - not the lack of a spot ETF.\n\nBitcoin options open interest, June 2020-November 2023. Source: CoinGlass\n\nInstitutional investors that use the CME are also highly sophisticated. As such, any fund manager that takes a position in BlackRock’s spot ETF, for example, will want to hedge that position using futures on the CME. Accordingly, we can expect activity on the CME to grow almost in lockstep with the growth in spot ETFs.\n\nFutures are also — as we know — a speculative instrument, and there is perhaps no market that is more speculative than cryptocurrency. As the asset class gains more legitimacy and credibility with the approval of a spot ETF, we will see more investors interested in all corners of digital asset trading.\n\nRelated: Bitcoin ETFs: A $600B tipping point for crypto\n\nAdventurous day traders who may have stuck to the foreign-exchange market in the past will likely start to venture into Bitcoin and other crypto instruments. And they will exercise this interest through the CME. Indeed, I suspect we will see increasing interest in perpetual swaps and other types of derivative instruments in the sector next year.\n\nCrypto futures also benefit from clearer and more consistent regulation, which is another major factor here. While the Commodity Futures Trading Commission (CFTC) looks after futures, nobody has yet fully decided who looks after the crypto spot market from a regulatory perspective, and this remains a problem. Applications for these Bitcoin spot ETFs are currently sitting on the Securities and Exchange Commission’s desk, but as has become abundantly clear, Chairman Gary Gensler is a big fan of ambiguity.\n\nClear regulation is leading to obvious success in cryptocurrency futures, while the spot market is being hindered by regulatory opacity. And so, while the approval of an ETF is just a matter of time at this stage, we still don’t know how much time. While we are waiting, the futures market remains an extremely enticing trading ground for institutional investors.\n\nLucas Kiely is the chief investment officer for Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW5mdC1tYXJrZXRwbGFjZS1iaW9uaXEtY29uZ2VzdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin NFT marketplace Bioniq eyes lofty goal of alleviating network congestion - Cointelegraph",
        "content": "A new Bitcoin nonfungible token (NFT) marketplace aims to reduce network fees associated with the advent of Bitcoin Ordinals inscriptions by tapping into the Internet Computer Protocol (ICP).\n\nDeveloped off the back of the creation of Bitcoin Ordinals in early 2023, Bioniq operates on the ICP and taps into its native Bitcoin integration to power the trade of Bitcoin-based Ordinals inscriptions.\n\nSpeaking to Cointelegraph on the eve of the platform’s launch, Bioniq CEO and co-founder Bob Bodily said the project has been in development since February 2023. The team has built a marketplace featuring Ordinals smart contracts auctions on the ICP, a complete cross-chain wallet between Bitcoin and the ICP, as well as an inscription tool.\n\n“It had only been two weeks after Casey Rodarmor released Ord 0.4.0, and I knew Ordinals were going to be absolutely massive.”\n\nThe Bioniq team highlighted the growth in the market capitalization of BRC-20 tokens since their inception in Jan. 2023. The market cap now exceeds $3 billion, with over 42.6 million Ordinals minted to date. This has directly affected Bitcoin network congestion, leading to a spike in Bitcoin (BTC) transaction fees last seen since 2021.\n\nBitcoin transaction fees showed significant spikes in 2023 following the advent of Bitcoin Ordinals and BRC-20 tokens. Source: Blockchain.com\n\nBioniq’s platform features a smart wallet for users to manage private keys using Web3Auth. This allows users to log into the platform using conventional Web2 Google accounts while maintaining noncustodial control of their wallets and assets.\n\nThe platform also uses partially signed Bitcoin transactions (PSBTs) through the ICP’s Bitcoin network integration. This unlocks smart contract capabilities for Bitcoin, removing the need for users to use centralized cross-chain bridges.\n\nICP is a “fantastic Bitcoin sidechain”\n\nBuilding on ICP also allows Bioniq to claim transaction finality times below two seconds, as well as zero gas or network fees. Its architecture provides optimized storage costs, averaging around $5 per gigabyte of data stored annually.\n\nBodily added that Toniq, the studio behind Bioniq, has been developing on the ICP since May 2021 and has extensive experience building smart contract wallets, marketplaces, NFT launchpads and collateralized NFT lending protocols:\n\n“ICP is a fantastic Bitcoin sidechain right now because it has wonderful Bitcoin primitives at the protocol layer.”\n\nBodily explains that ICP operates a Bitcoin light node running fully on-chain, which facilitates reading the Bitcoin blockchain via native smart contract calls. The ICP also has a threshold digital signature algorithm, known as an Elliptic Curve Digital Signature Algorithm. The implementation allows ICP smart contracts to sign layer-1 Bitcoin transactions and broadcast them to the mempool.\n\n“These protocol primitives also enabled us to build an Ordinals wrapper entirely at the application layer; we didn’t have to touch the consensus layer of the protocol at all. So it is very fast to build Bitcoin tech on ICP right now,” Bodily added.\n\nBitcoin users and trust assumptions\n\nCointelegraph also inquired whether Bioniq’s wrapping process could be a potential barrier to entry for users. Bodily admits that while the process is largely automated by the Bioniq wallet and only requires BTC, there are two considerations that are pertinent for more discerning users.\n\n“Wrapping requires a Bitcoin transaction. This means you have to pay in order to wrap. This is a significant barrier. One way we are addressing the problem is by integrating open Nostr PSBT listings into Bioniq,” Bodily explained.\n\nThis integration means that PSBT listings stored on Nostr through decentralized Ordinals marketplaces OpenOrdex or Deezy Place will be accessible on Bioniq. He added that it removes the need to wrap Bitcoin transactions, as users could list directly on Bioniq using open PSBTs.\n\nPerhaps more importantly, Bodily explained that the wrapping process requires “trust assumptions” on both protocols:\n\n“Wrapping over to ICP means in addition to trusting Bitcoin, you are now trusting the Internet Computer Protocol. Some Bitcoin users won’t want the counterparty risk of bridging assets to another chain.”\n\nBodily adds that Bioniq is focusing on developing user experience ahead of inheriting Bitcoin’s security, which is ensured by the finality of layer-1 transactions. However, he envisions a “nice decentralization path” for applications like Bioniq.\n\nThis would involve the evolution from being built on a sidechain with additional trust assumptions to “becoming a Bitcoin sovereign rollup on ICP that is trust minimized.” The final step would see Bioniq becoming a Bitcoin zero-knowledge rollup (ZK-rollup) on the ICP with no additional trust assumptions, inheriting the full security and decentralization of Bitcoin.\n\n“ICP fits perfectly into this plan as well because ICP can provide a replicated execution environment (decentralized sequencer) or validium (extra off-Bitcoin storage for rollups).”\n\nBanking on Bitcoin’s value proposition\n\nA number of NFT marketplaces already offer Bitcoin Ordinals auctions and trading, which begs the question of what an exclusively Ordinals platform will bring to the ecosystem.\n\nBodily believes that existing offerings that featured “softer pivots” to Ordinals on their platforms were hamstrung by confusing user experiences. Developing a “dedicated Bitcoin Ordinals marketplace, built for Bitcoin users natively” hinges on developing a native cross-chain, BTC-ICP wallet.\n\nIn addition, Bitcoin’s unchallenged position as the preeminent and largest cryptocurrency by market cap remains another drawcard for the continued interest in Bitcoin NFTs into the future.\n\n“If you look at the numbers, 89% of people in the world have heard about Bitcoin, Bitcoin accounts for around 50% of the total crypto market cap, and Ordinals have done over $500 million in volume this year — so there is massive demand.”\n\nBioniq joins the likes of Ordinals Market as a Bitcoin-only Ordinals marketplace. Gamma is another Ordinals marketplace that directly mints to Bitcoin’s layer-1 chain. Ordswap was an early Ordinals marketplace that has since closed down after losing control of its website to hackers. Meanwhile, multichain platforms like Magic Eden prominently list Bitcoin Ordinals NFTs.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjktbm92ZW1iZXItMjAyMy9hcnRpY2xlc2hvdy8xMDU1ODUzMTcuY21z0gHCAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0yOS1ub3ZlbWJlci0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDU1ODUzMTcuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin crosses $38,000; Solana, Dogecoin rise up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nSnapping a two-day losing streak, major cryptocurrencies traded higher on Wednesday, led by gains in Bitcoin, Ethereum and Solana.Meanwhile, the global cryptocurrency market cap surged 2.2% to around $1.43 trillion in the last 24 hours.At 11.56 a.m., BTC was trading 2.85% higher at $38,031, while the second most popular token, Ethereum, was up 2.4% at $2,051. Solana also surged over 7% to $58.32.Positive sentiments prevailed in the market as Bitcoin breached the $37,800 threshold. This price movement could reflect that market participants have now absorbed the news about the recent leadership change at Binance, restoring bullish confidence in their investments, said Edul Patel, CEO of Mudrex.Other popular altcoins, such as Dogecoin , Chainlink, and Avalanche, surged 4-5%. Also, BNB XRP , Cardano, Tron, Polygon, Litecoin , and Shiba Inu rose 2-3%.The total volume in DeFi is currently $4.74 billion, 9.19% of the total crypto market 24-hour volume. The volume of all stablecoins is now $46.95 billion, which is 90.96% of the total crypto market 24-hour volume.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, fell to $743 billion. Bitcoin's dominance is currently 51.99%, according to CoinMarketCap. BTC volume in the last 24 hours surged 18.3% to $22.4 billion.Bitcoin, in the last 24 hours, has showcased a bullish momentum again and went on to surpass the $38k psychological resistance. While the path to $41k may not have a lot of resistance now, traders may begin to undergo bearish sentiments. However, from a historical lens, the last bull run also started during November-December after showing a negligible pullback for 6 months in a row, said CoinSwitch Markets Desk.The 4-hour chart reflects a delicate balance between bullish and bearish sentiment, with the $36,950 pivot point that Bitcoin has tentatively breached, indicating a potential market move.Immediate resistance levels lie at $37,986, $38,429 and the more ambitious $39,066, while support is at $36,399 and $35,722. The chart shows an ascending channel formation, indicating a steady uptrend along the lower support trendline. Given the RSI and EMA, there is cautious optimism for continued upward momentum.Overall, the trend is bullish and short-term forecasts call for a resistance test at $37,986. Holding support above the pivot and 50 EMA could pave the way for a challenge of higher resistance zones, especially the $38,000 level, which will attract further buying interest towards $39,000.(You can now subscribe to our ETMarkets WhatsApp channel (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times)"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdoYWxlLWdhbWVzLXdhcm5pbmctYnRjLXByaWNlLTQway11cy1kYXRh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin gets 'whale games' warning as BTC price eyes $40K into US data - Cointelegraph",
        "content": "Bitcoin (BTC) held momentum at $38,000 on Nov. 29 as analysis warned over market corrections.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin meets macro data, Fed’s Powell at key price point\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price trajectory continuing to aim for new 18-month highs.\n\nAfter matching current highs the day prior, the largest cryptocurrency surprised by keeping a grip on higher levels as futures markets hit $39,000.\n\nAlready a topic of debate, the excitement on derivatives led some to caution that large-volume traders could still leave late long positions stranded at the top.\n\nIn commentary overnight, Keith Alan, co-founder of monitoring resource Material Indicators, told traders to be wary of these “whale games.”\n\n“Earlier today, some ask liquidity at $38k was pulled to open the door to $38.5k. Don’t allow yourself to think that was a friendly whale giving you boost. That was a Killer Whale trying to FOMO you in,” he wrote about the initial trip past $38,000.\n\nAlan continued that words due Dec. 1 from Jerome Powell, chair of the United States Federal Reserve, may provide an external BTC price catalyst that could even bring $40,000 into play.\n\nWhales, however, would be spying on a key level at which to sell off.\n\n“My assumption is that they will continue to do so until there is enough to dump into,” he forecast.\n\n“That doesn’t mean that # JPow’s speech can’t be the catalyst that sends price past $40k, especially as we see bid liquidity coming in above $37.5k, but if you aren’t prepared to sweep the local lows between now and then you haven’t been paying attention to how these Whale Games tend to play out.”\n\nBTC/USDT order book liquidity. Source: Keith Alan/X\n\nAn accompanying chart showed order book sell-side liquidity concentrated at $38,500 — a level yet to be challenged at the time of writing.\n\nOthers remained confident that further short-term upside was possible and even likely.\n\nAnalyzing current market composition, popular trader Skew concluded that volume was all that was missing for a breakout toward the $40,000 watershed.\n\n$BTC 4H Update\n\nTrend still respected & clean HL exactly where I expected it to occur ($36.7K)\n\n\n\nJust need the HH now & volume supported break of $38K - $40K resistance https://t.co/iPPGzVIbFF pic.twitter.com/SQtKwvBdz0 — Skew Δ (@52kskew) November 29, 2023\n\nAckman bets on Q1 Fed rate cut\n\nAs Cointelegraph reported, prior to Powell’s speech, key U.S. macro data will lend extra weight to Fed policy.\n\nRelated: Bitcoin metric that ‘looks into future’ eyes $48K BTC price around ETF\n\nThis comes in the form of Q3 GDP and the October print of the Personal Consumption Expenditures Index on Nov. 29 and Nov. 30, respectively.\n\nPreviously, inflation abating faster than expectations led markets to assume that no further interest rate hikes would occur at the December meeting of the Federal Open Market Committee.\n\nSpeaking to Bloomberg on Nov. 28, Bill Ackman, CEO and founder of hedge fund Pershing Square Capital Management, stated that the Fed might have no choice but to pivot on rates at the start of 2024.\n\n“I think they’re going to cut rates; I think they’re going to cut rates sooner than people expect,” he said.\n\nAckman continued that not cutting rates “pretty soon” would increase the risk of a so-called hard landing for the U.S. economy as inflation tails off.\n\n“I think the market expects sometime in the middle of next year; I think it’s more likely, probably, as early as Q1,” he predicted.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtcHVibGljLWNvbW1lbnRzLXJlcXVlc3QtZnJhbmtsaW4tdGVtcGxldG9uLWhhc2hkZXgtYml0Y29pbi1idGMtZXRmc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "SEC seeks public input on Franklin Templeton, Hashdex Bitcoin ETFs - Cointelegraph",
        "content": "The United States Securities and Exchange Commission has announced the next steps in its consideration of the proposed Franklin Templeton and Hashdex spot Bitcoin (BTC) exchange-traded fund (ETF) bids.\n\nThe agency has requested written comments on both proposals to approve or deny the applicants’ Forms 19b-4.\n\nSEC Form 19b-4 is a public disclosure approved by the SEC Trading and Markets Division separately from Form S-1, the offering prospectus subject to Corporate Finance Division approval. The SEC’s requests have an open period of 35 days from their publication in the Federal Register for both comments and responses to comments.\n\nThe SEC release on the Franklin Templeton Bitcoin ETF. Source: SEC\n\nThe proposed rule changes — effectively applications — that would allow the trading of the ETFs were filed in late September. The Hashdex ETF would be traded on the New York Stock Exchange Arca and Franklin Templeton’s on Cboe BZX. On Nov. 15, the SEC extended its deadline for deciding on the applications.\n\nRelated: Binance, CZ settlement with US DOJ ‘bullish for Bitcoin ETF,’ crypto community says\n\nThe questions address issues related to potential ETF approval. Commenters are invited to assess the funds’ susceptibility to manipulation and whether or not the exchanges that will host them are of significant size.\n\nFranklin Templeton commenters are further asked to consider price manipulation on the BTC market, the company’s surveillance sharing agreement with Coinbase, which would aid in price discovery and supplement efforts to detect manipulation and fraud, and correlation between BTC spot and futures prices.\n\nSEC extends comment window for Franklin Templeton and Hashdex #Bitcoin ETFs pic.twitter.com/aEYTa5Yg1n — Daniela (@DeFinanzasYT) November 28, 2023\n\nHashdex’s proposed fund structure is more complex than Franklin Templeton’s. Its proposed Hashdex Bitcoin ETF would be structured as a futures ETF that holds spot BTC. Rather than depending on a Coinbase surveillance sharing agreement, Hashdex would acquire BTC from other exchanges on the CME and rely solely on that mechanism for pricing.\n\nThe SEC asked whether the CME has significant size in light of the fund structure and whether sufficient liquidity will be available. Finally, commenters are asked about sponsor Toroso Investments’ calculations to determine the relationship between the BTC price on the CME and on unregulated exchanges. The sponsor manages and controls the fund.\n\nMagazine: Bitcoin ETF optimist and Worldcoin skeptic Gracy Chen: Hall of Flame"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYm90YW5peC1sYWJzLWxhdW5jaGVzLWZpcnN0LWV2bS1lcXVpdmFsZW50LWxheWVyLTItdGVzdG5ldC1vbi1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Botanix Labs Launches First EVM-Equivalent Layer 2 Testnet on Bitcoin - Nasdaq",
        "content": "Botanix Labs has officially launched the first-ever fully decentralized Ethereum Virtual Machine (EVM) equivalent Layer 2 on Bitcoin, according to a press release sent to Bitcoin Magazine. This represents over a year of dedicated research and development by the team, with a focus on enhancing user experience.\n\n\"We want to make it as easy as possible to start building on Bitcoin,\" said Willem Schroe, the Founder and CEO of Botanix. The initiative stems from the team's ambition to propel Bitcoin beyond its status as the pinnacle of digital currency and position it as the cornerstone of a novel decentralized financial ecosystem.\n\nAt the core of this initiative is Spiderchain, a decentralized network of multisigs empowering anyone to operate a full Botanix node and participate in the network. Introducing forward security, a concept derived from encryption systems, Spiderchain facilitates low-cost, swift transactions for Bitcoin deployments.\n\nThe innovative aspect of Botanix's Spiderchain is its seamless compatibility with Ethereum's EVM smart contracts. This compatibility enables developers to effortlessly replicate and deploy any EVM smart contract onto the Botanix testnet using Bitcoin.\n\nCasa's co-founder & CTO Jameson Lopp, in his analysis of the Spiderchain's whitepaper, highlighted its implementation on Bitcoin without necessitating any protocol alterations at the base layer. “While there are a variety of proposals being discussed for enhancing Bitcoin's Layer 2 capabilities…one distinction with spiderchains is that they can be implemented on Bitcoin today without any protocol changes to the base layer,” he said.\n\nBotanix Labs is now forging ahead to incubate the first-ever Bitcoin-enabled DeFi and NFT ecosystem. The testnet encompasses a Signet Bitcoin faucet, a bridge, and AvocadoSwap, akin to PancakeSwap, facilitating token swaps.\n\nMoreover, Botanix is launching the \"Botanix Testnet Accelerator,\" inviting 10 startups for enhanced BD support, co-marketing, and development resources ahead of the mainnet launch slated for early next year. Selection criteria encompass the product's development, transaction activity, and business potential.\n\nThe Botanix testnet is available for trial, inviting feedback from users at here.\n\nDisclaimer: UTXO Management is an investor in Botanix. UTXO's parent company, BTC Inc., is also the parent company of Bitcoin Magazine.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZGVjcnlwdC5jby8yMDc3MzAvYml0Y29pbi1wcmljZS1idWxsaXNoLWFnYWluLWZlZC1kb3Zpc2jSAUZodHRwczovL2RlY3J5cHQuY28vMjA3NzMwL2JpdGNvaW4tcHJpY2UtYnVsbGlzaC1hZ2Fpbi1mZWQtZG92aXNoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Turns Bullish Again Amid Dovish Fed Forecast - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin has continued its bullish trajectory and is now trading above $38,000 per coin—for the second time in one week—following dovish comments from the Federal Reserve.\n\nThe biggest digital asset by market cap today hit a high of $38,223, according to CoinGecko. That's a 3.5% 24-hour rise. Over seven days, it's up nearly 3%.\n\nBitcoin last week blew past $38,000 per coin for the first time in 18 months. Before then, the cryptocurrency had generally traded below the $38,000 level ever since crypto mega project Terra collapsed in May 2022.\n\nAD\n\nAD\n\nNow, a combination of optimism surrounding the approval of a Bitcoin exchange-traded fund (ETF) and comments today from Federal Reserve governor Christopher J. Waller are leading to bullish price action.\n\nOn Tuesday, Waller said that while \"inflation is still too high,\" he was \"increasingly confident that policy is currently well positioned to slow the economy and get inflation back to 2 percent.\"\n\nThis is having a positive impact on Bitcoin as investors feel more confident to put their money into an asset which has typically struggled—along with other \"risk assets\"—with high interest rates.\n\nJames Butterfill, head of research at the European digital asset manager CoinShares, told Decrypt that \"it appears that Waller's remarks have favorably influenced Bitcoin prices,\" adding that it indicate \"a shift from the possibility of rate hikes, which were under consideration just two months ago.\"\n\nBitcoin and the crypto market was hit hard after Terra collapsed last May. The blockchain project collapsed when its algorithmic stablecoin stopped working, which in turn led to widespread crypto contagion: a fall in the price of every coin and token and the bankruptcy of major digital asset companies that had exposure to the failed crypto venture.\n\nAD\n\nAD\n\nBut investors now appear to be feeling confident in investing in the digital asset industry—at least with Bitcoin. Most cash entering the space is focused on the biggest and oldest virtual coin and is coming from institutional investors, a CoinShares report yesterday showed.\n\nSuch investors are confident that the U.S. Securities and Exchange Commission will finally approve a Bitcoin ETF after a decade of waiting. Such a product would give traditional investors exposure to crypto and, according to some experts, lead to a flood of capital into the space."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLXBob2VuaXgtaXBvLWxhdW5jaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin mining firm Phoenix Group delays share listing - Cointelegraph",
        "content": "Cryptocurrency mining firm Phoenix Group is preparing for its public trading launch after seeing a significant oversubscription during the pre-market sale on Nov. 21.\n\nPhoenix’s public trading launch will be delayed as the firm has revised the date for its forthcoming initial public offering (IPO) on the Abu Dhabi Securities Exchange (ADX).\n\nAccording to an announcement on Nov. 28, the crypto mining firm expects to list its shares on Dec. 5 instead of Dec. 4, 2023, due to public holidays declared for the United Arab Emirates National Day.\n\nCelebrated on Dec. 2, the UAE National Day commemorates the formation of the UAE. The Ministry of Human Resources and Emiratization marks Dec. 2, 3 and 4 as public holidays for the private sector.\n\n“To honor this occasion and ensure comprehensive participation in the IPO, Phoenix Group has rescheduled its listing date to December 5th, 2023,” the announcement states.\n\nAs previously announced, Phoenix Group successfully closed its IPO with an oversubscription of 33 times on Nov. 18, reporting that its offer of 907,323,529 shares saw “overwhelming demand.” Phoenix said retail investors oversubscribed the offering 180 times, while professional investors contributed to a 22-fold oversubscription.\n\nPhoenix is a UAE-based mining operator that is developing one of the largest mining facilities in the Middle East. The company has reportedly been discussing the IPO launch in the UAE since at least July 2023.\n\nRelated: Bithumb plans to be first crypto exchange listed on Korea stock market: Report\n\nThe UAE has emerged as one of the most crypto-friendly jurisdictions in the world, launching various initiatives, including multiple Web3-focused economic free zones to support crypto development.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8yMDc3ODMvcmF0LXBvaXNvbi1jYW50YW5rZXJvdXMtYml0Y29pbi1jcml0aWMtY2hhcmxpZS1tdW5nZXItZGllcy1hdC05OdIBYGh0dHBzOi8vZGVjcnlwdC5jby8yMDc3ODMvcmF0LXBvaXNvbi1jYW50YW5rZXJvdXMtYml0Y29pbi1jcml0aWMtY2hhcmxpZS1tdW5nZXItZGllcy1hdC05OT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "‘Rat Poison’: Cantankerous Bitcoin Critic Charlie Munger Dies at 99 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCharlie Munger, longtime business partner of Warren Buffett and vice chairman of multinational holding company Berkshire Hathaway, has died at the age of 99, the company announced today. Munger's proclamations, much like Buffett's, were often eminently quotable takedowns of bad investments—and few assets raised his ire like Bitcoin.\n\n\"I think it's rat poison,\" he famously said in 2013, when Bitcoin was worth $150. When asked to revisit his comments five years later, when the world's largest cryptocurrency was trading at $9,000, he said, \"So it's more expensive rat poison.\"\n\nWhen pressed on the returns some Bitcoin investors were able to make, he called them \"idiot booms\" that harm the U.S.\n\nAD\n\nAD\n\nBerkshire Hathaway annual meetings were often called \"Woodstock for Capitalists,\" and putting Munger and Buffett on stage was a top draw. Asking about cryptocurrency was a reliable way to get them to use colorful language.\n\n\"In my life, I try and avoid things that are stupid, and evil, and maybe look bad in comparison with somebody else,\" he said in 2018. \"Bitcoin does all three.\"\n\n\"It's stupid because it's very likely to go to zero; it's evil because it undermines the Federal Reserve system... and third, it makes us look foolish compared to the communist leader in China,\" he explained. \"[Xi Jinping] was smart enough to ban Bitcoin in China... we are a lot dumber.\"\n\nThree years later, and Munger was still fuming.\n\nAD\n\nAD\n\n\"I just think the whole damn development is disgusting and contrary to the interests of civilization,\" he said in early 2022, comparing crypto to a venereal disease, deeming it \"beneath contempt.\"\n\nEven at 99 years old, he mustered more fiery condemnation at the Daily Journal Corporation annual meeting earlier this year.\n\n\"Sometimes I call it crypto crapple and sometimes I call it, well, crypto shit,\" he said, going on to use the term half a dozen times during the course of the conversation. \"It's ridiculous that anybody would buy this stuff.\"\n\n\"It's asinine, it's not slightly stupid it's massively stupid, and it's very dangerous,\" he continued. \"The governments were totally wrong to permit it. I'm not proud of my country for allowing this crypto shit, it's worthless, it's no good, it's crazy, it'll do nothing but harm.\"\n\nWhile Munger's attacks ruffled cryptocurrency backers, his candor was long part of Berkshire's folksy public image. He worked alongside Buffett for decades, offering investment wisdom almost as quotable as the \"Oracle of Omaha\" himself.\n\nBerkshire Hathaway said Munger died peacefully in a California hospital. Buffett paid tribute to Munger's \"inspiration, wisdom and participation\" in building Berkshire into the conglomerate it is today."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhaWxzLTM4LTUtay1icmVha291dC11cy1nZHAtZmVkLWhhcmQtbGFuZGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price fails $38.5K breakout as US GDP fuels Fed hard-landing woes - Cointelegraph",
        "content": "Bitcoin (BTC) shrank back from resistance after the Nov. 29 Wall Street open as United States gross domestic product (GDP) figures beat expectations.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nGDP sets tone for macro-sensitive crypto\n\nData from Cointelegraph Markets Pro and TradingView followed a familiar BTC price retracement on short timeframes.\n\nBitcoin bulls had managed to propel the market above $38,000 the day prior, only to flip-flop around that level before ultimately dropping as U.S. macro data hit.\n\nThis showed Q3 GDP accelerating beyond anticipated levels, coming in at 5.2% versus 4.9%.\n\nThis renewed concerns over how the United States Federal Reserve might handle policy ahead of an interest rates decision in mid-December.\n\n“5.2% is the final reading, it will mark the highest GDP growth since Q4 2022,” financial commentary resource The Kobeissi Letter wrote in part of a reaction on X (formerly Twitter.)\n\n“Can the Fed achieve a soft landing?”\n\nU.S. GDP percentage change chart (screenshot). Source: U.S. Bureau of Economic Analysis\n\nKobeissi referenced words from Bill Ackman, founder and CEO and founder of hedge fund Pershing Square Capital Management, who the day prior had gone on record to predict a Fed rate pivot as soon as Q1, 2024.\n\n“Yesterday, Bill Ackman bet on a hard landing with rate cuts beginning in Q1. Currently, futures don’t see rate cuts beginning until June 2024,” it continued.\n\nData from CME Group’s FedWatch Tool showed marginally increasing bets on a further hike in December following the GDP release, with further key data due on Nov. 30. The odds of a hike stood at 4.2% at the time of writing versus 0.5% previously.\n\nFed target rate probabilities chart. Source: CME Group\n\nAnalyst: Bitcoin is a buy below $35,000\n\nBitcoin, meanwhile, continued acting in a familiar style from recent days.\n\nRelated: ‘Buy the rumor, sell the news’ — Bitcoin ETF may spark TradFi sell-off\n\nBulls still failed to crack a key resistance zone beginning at $38,500, despite some being confident that an assault on $40,000 would ultimately result.\n\n“No HH or breakout confirmation yet, eyeing a sweep of $37.3K area & HL setup for the HH,” popular trader Skew told X followers, referring to a “higher high” being required.\n\n$BTC 4H\n\nNo HH or breakout confirmation yet, eyeing a sweep of $37.3K area & HL setup for the HH https://t.co/VDSl43g7Hh pic.twitter.com/wwGTTegxlM — Skew Δ (@52kskew) November 29, 2023\n\nFellow trader Daan Crypto Trades suggested that a period of flatter BTC price performance could now enter before a fresh bout of upside volatility.\n\n“Price took out some liquidity above and below,” he commented about the day’s events.\n\n“Would not surprise me to see some more sideways chop for both sides to build up more positions before the next bigger move.”\n\nBTC/USDT liquidity map for Binance. Source: Daan Crypto Trades/X\n\nAn accompanying chart showed liquidity for the BTC/USDT pair on Binance, the largest global exchange.\n\nEyeing potential downside opportunities, Michaël van de Poppe, founder and CEO of trading firm MN Trading, flagged a range between $33,000 and $35,000 — already a popular zone based on liquidity.\n\n“Markets are consolidating. Giving opportunities, still no breakout of Bitcoin above $38K,” his latest X analysis read.\n\n“If we continue to make higher lows, higher highs, a breakout seems to be happening soon. Structure lost? Buying at $33-35K.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1MDQ3L3NlYy1hc2tzLXB1YmxpYy1mb3ItZmVlZGJhY2stb24tZnJhbmtsaW4tdGVtcGxldG9ucy1wcm9wb3NlZC1zcG90LWJpdGNvaW4tZXRm0gF1aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1MDQ3L3NlYy1hc2tzLXB1YmxpYy1mb3ItZmVlZGJhY2stb24tZnJhbmtsaW4tdGVtcGxldG9ucy1wcm9wb3NlZC1zcG90LWJpdGNvaW4tZXRm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "SEC asks public for feedback on proposed spot bitcoin ETFs from Franklin Templeton, Hashdex - The Block",
        "content": "The Securities and Exchange Commission said Tuesday that it wants fresh feedback from the public on whether it should approve or disapprove a spot bitcoin ETF solicited by asset manager Franklin Templeton, just weeks after first delaying a decision on the proposed fund. The move prompted some analysts to note that the regulator appeared to be moving quickly.\n\nThe SEC said it wants more analysis and is \"instituting proceedings\" to do so. The regulator asked commenters on Tuesday about concerns regarding manipulation and fraud, as well as the fund's relationship to Coinbase, which would be the custodian if the ETF garners approval.\n\n\"The Commission is providing notice of the grounds for disapproval under consideration,\" it wrote, saying it wanted to analyze whether the application is consistent with the requirement that \"the rules of a national securities exchange be 'designed to prevent fraudulent and manipulative acts and practices' and 'to protect investors and the public interest,'\" the agency said in the filing.\n\n\"Institution of proceedings does not indicate that the Commission has reached any conclusions with respect to any of the issues involved. Rather, as described below, the Commission seeks and encourages interested persons to provide comments on the proposed rule change,\" it continued.\n\nThe asset manager first filed for the Franklin Bitcoin BTC -3.23% ETF in September, and, if approved, would have shares listed and traded on the Cboe BZX Exchange. Multiple applications for spot bitcoin ETFs have been filed from other asset managers including BlackRock and Fidelity.\n\nHashdex application\n\nThe regulator also said it would institute proceedings and solicit public feedback on an application for the Hashdex Bitcoin Futures ETF application, which proposed converting its exchange-traded fund listed on the New York Stock Exchange into a partial spot product.\n\nComments on both funds are due in 21 days, with a rebuttal period continuing for two weeks after that. The SEC has yet to approve a spot bitcoin fund and has so far delayed all applications it's received for the product.\n\nSpeculation swirls\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nSome analysts noted on X that the SEC seemed to be moving quickly with the latest action on the Franklin Bitcoin ETF.\n\n\n\n\"Wow. SEC went super early on Franklin. They weren't due for another decision until Jan 1,\" James Seyffart, an ETF Analyst at Bloomberg Intelligence, wrote on X. \"Going super early on Franklin today (and potentially @hashdex coming too?) would set things up for a full wave of approvals in early January. Might be the reasoning?\"\n\nVan Buren Capital's Scott Johnsson said the move could be an effort to get all the spot bitcoin ETFs on the same timeline.\n\n\"They might have chosen to do this early so they could have the comment period end before Jan 10, in order to approve everyone at the same time,\" Johnsson posted on X.\n\nFresh Franklin Templeton filing\n\nFranklin Templeton followed the SEC action on Tuesday by filing an amended S-1 form.\n\n\"Notably, the language in this S-1 mimics a lot of others on the creation/redemption process. Leaves open the possibility for both In-kind and/or Cash,\" Seyffart wrote.\n\n(Updates with filing on Hashdex fund, fresh filing from Franklin Templeton.)"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8yMDc3NjcvYml0Y29pbi13aWxsLWhpdC0xMDBrLWluLTIwMjQtcHJlZGljdHMtc3RhbmRhcmQtY2hhcnRlcmVkLWFnYWlu0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNzc2Ny9iaXRjb2luLXdpbGwtaGl0LTEwMGstaW4tMjAyNC1wcmVkaWN0cy1zdGFuZGFyZC1jaGFydGVyZWQtYWdhaW4_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Will Hit $100K in 2024, Predicts Standard Chartered—Again - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin will hit $100,000 by next year, British multinational bank Standard Chartered has said.\n\nThe bank made its first bullish predictions back in April, predicting that the largest digital coin would hit $100,000 by the end of 2024.\n\nIn July, its team of analysts projected that Bitcoin could hit $120,000 in the same timeframe.\n\nAD\n\nAD\n\nWhile the protracted bear market that dominated 2023 is only recently showing signs of thawing, the bank is again saying Bitcoin could hit $100,000—and that a Bitcoin exchange-traded fund (ETF) will be the catalyst.\n\n“We now expect more price upside to materialize before the halving than we previously did, specifically via the earlier-than-expected introduction of U.S. spot ETFs,” a report by the bank said. “This suggests a risk that the $100,000 level could be reached before end-2024.”\n\nThe “halving” the bank is referring to is an event where the amount of Bitcoin awarded to miners—those who process transactions and mint new coins—is cut in half.\n\nStandard Charter did not respond to a request for comment from Decrypt.\n\nIt’s viewed as a bullish indicator for the asset because it reduces the supply of Bitcoin that miners are able to unload onto the market, in turn pushing up the demand—and price—for the existing coins in circulation.\n\nAD\n\nAD\n\nStandard Chartered previously said this would lead to an increase in price of the biggest digital asset.\n\nBut in its latest report, the approval of a spot Bitcoin ETF could lead to quicker appreciation to a higher price. A number of major Wall Street investment firms—including BlackRock—have applied to the U.S. Securities and Exchange Commission for their own Bitcoin ETF.\n\nSuch a product would allow traditional investors to get exposure to Bitcoin without worrying about storing or buying the cryptocurrency on an exchange.\n\nAnd if lots of institutional interest floods the space, the price of the asset will go up, according to some analysts.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NoYXJsZXMtaG9za2luc29uLXNheXMtdGhlcmUtd2FzLW5vLWNhcmRhbm8taWNvLWFyZ3Vlcy1iaXRjb2luLWlzLW5vdC1kZWNlbnRyYWxpemVkLTIwMjMxMTI4MDMwM9IBkwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9jaGFybGVzLWhvc2tpbnNvbi1zYXlzLXRoZXJlLXdhcy1uby1jYXJkYW5vLWljby1hcmd1ZXMtYml0Y29pbi1pcy1ub3QtZGVjZW50cmFsaXplZC0yMDIzMTEyODAzMDM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Charles Hoskinson says, There was no Cardano ICO; argues Bitcoin is not decentralized - FXStreet",
        "content": "Charles Hoskinson criticized the SEC for giving Bitcoin a “free pass” while other crypto assets are treated as securities.\n\nThe Cardano founder noted that BTC is not decentralized, as it would take merely three subpoenas to perform a 51% attack on the network.\n\nUpon being highlighted that the ADA’s ICO is the reason Cardano is treated as a security, Hoskinson stated that it did not have an ICO.\n\nCardano is known as the third-generation cryptocurrency and, at times, even the \"Ethereum killer\" but never as “not a security”. For that matter, the Securities and Exchange Commission (SEC), to date, has only named Bitcoin as \"not a security,\" and XRP partially won that label following its lawsuit win. This seemingly did not sit well with Cardano founder, Charles Hoskinson.\n\nCharles Hoskinson criticizes the SEC\n\nCardano founder Charles Hoskinson, during a recent stream, took on the SEC for giving Bitcoin essentially a free pass by not scrutinizing it as security the same way it does with other crypto assets. Hoskinson stated,\n\n\"Explain it to me [the difference between Bitcoin and other cryptocurrencies] like I am a five years old. Run the Howey test.\n\nHe went on to add that Bitcoin is not as decentralized as the SEC believes it to be. The reason is that over 51% of the hash rate can be controlled merely by subpoenaing the top three hash pools.\n\nIn response, crypto influencer Adam Black stated that the reason behind Bitcoin not being secure is that it did not do an ICO (Initial Coin Offering). He added,\n\n\"Bitcoin did not do an ICO, most people thought it had no value, it was mined from zero, it is decentralised, there is no CEO, ICO warchested \"foundation\", incorporation etc. so cardano, eth etc clearly pas howey, Bitcoin is a commodity and does not.\n\nICOs are a form of crowdfunding where cryptocurrencies are sold to investors in the form of tokens. The ICO boom of 2018 was one of the biggest driving factors of the bull run noted back then.\n\nHoskinson replied to Adam's statement by saying that Cardano did not do an ICO. He noted,\n\n\"There was an airdrop onto a distribution, and then thousands of people who never met each other traded Ada on exchanges and used Cardano for their projects. A voucher sale of a different asset outside of the United States, priced in Yen, settled in Bitcoin, explained in Japanese to Japanese citizens, and without a single US participant does not constitute an ICO of Ada.\n\nTechnically, Cardano did conduct an ICO by utilizing a novel variation. As stated on Cardano's official website discussing the genesis of the chain, the ADA vouchers were sold by a Japanese corporation and its sales force in Japan with total gross sales of 108,844.5 BTC. The public sales distribution accounts for 25,927,070,538 ADA, of which 2.4 billion were distributed to IOHK, the developer of Cardano.\n\nThus, as long as the United States does not establish clear guidelines and regulations for the crypto industry, Charles Hoskinson and others will continue to criticize the SEC for its seemingly partial approach toward crypto assets."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8yMDc4MjMvYml0Y29pbi1vcmRpbmFscy1tYXJrZXRwbGFjZS1iaW9uaXEtbGF1bmNoZXMtaW50ZXJuZXQtY29tcHV0ZXLSAV5odHRwczovL2RlY3J5cHQuY28vMjA3ODIzL2JpdGNvaW4tb3JkaW5hbHMtbWFya2V0cGxhY2UtYmlvbmlxLWxhdW5jaGVzLWludGVybmV0LWNvbXB1dGVyP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals Marketplace Bioniq Launches—On Internet Computer - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ordinals protocol—which enables the inscription of NFT-like assets on the Bitcoin blockchain—commanded the attention of the crypto world at the start of the year, and the space has continued to grow and evolve since. And here’s a new twist: The latest Bitcoin Ordinals marketplace isn’t even built on Bitcoin.\n\nBioniq, which is backed by Polychain Capital and officially opens Wednesday, is instead built on Internet Computer (ICP), the layer-1 blockchain developed by Dfinity that offers integrations with Bitcoin. In this case, Bioniq treats Internet Computer like a layer-2 scaling network of sorts, claiming that it offers various benefits over other Ordinals marketplaces.\n\nIt’s billed as the “world’s fastest” Ordinals marketplace, offers a built-in wallet with optional Google login via Web3Auth, and doesn’t charge network transaction or gas fees to traders.\n\nAD\n\nAD\n\nIt works via a token wrapping process on Internet Computer. Bitcoiners who want to use Bioniq can transfer their Bitcoin and Ordinals assets into the marketplace’s wallet. They can then choose to wrap the Ordinals asset by sending it to a specified Bitcoin wallet address for safekeeping, and then an identical NFT is generated on the Internet Computer network.\n\nFrom there, assets can be traded on the speedier ICP network without gas or transaction fees. While there are extra steps involved to do so, Bioniq believes that this process is ultimately preferable to what most Ordinals marketplaces do, which is utilize partially signed Bitcoin transactions” (PSBTs) to handle transactions on the slower Bitcoin network.\n\n“Even in high Bitcoin fee environments, everything that is wrapped can be transacted at the speed and cost of ICP rather than the speed and cost of Bitcoin, giving users a more reliable (faster and smoother) experience regardless of the fee spikes on Bitcoin,” Bioniq CEO and co-founder Bob Bodily told Decrypt.\n\nBioniq also offers functionality that it claims other Ordinals marketplaces lack, such as allowing for “easily adjustable” offers and enabling English auctions with a set reserve price.\n\nBodily and team also have big plans ahead for the marketplace, with ambitions to build a launchpad for newly minted collections, add a way for users to borrow crypto with their Ordinals assets held as collateral, and enable collection offers made with the intent of buying any asset in a particular desired project.\n\nAD\n\nAD"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8yMDc3MDIvY2FyZGFuby1mb3VuZGVyLWNoYXJsZXMtaG9za2luc29uLWJpdGNvaW4tZ2V0cy1jb21wbGV0ZS1wYXNzLWZyb20tc2Vj0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNzcwMi9jYXJkYW5vLWZvdW5kZXItY2hhcmxlcy1ob3NraW5zb24tYml0Y29pbi1nZXRzLWNvbXBsZXRlLXBhc3MtZnJvbS1zZWM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Cardano Founder Charles Hoskinson: Bitcoin Gets ‘Complete Pass’ From SEC - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCardano founder Charles Hoskinson launched a blistering attack on the U.S. Securities and Exchange Commission (SEC) in a recent livestream, accusing it of giving Bitcoin a “complete pass” over the question of whether it’s sufficiently decentralized to not be considered a security.\n\n“If you subpoena and attack about three different entities, you could perform a 51% attack on Bitcoin because that's the way the hash power works,” Hoskinson said. “But it's decentralized, apparently. And Team Orange gets a complete pass.”\n\nDescribing the SEC’s treatment of Bitcoin as an “absolutely pathetic joke,” Hoskinson queried the difference between Bitcoin, Ethereum and Cardano. “Explain it to me like I'm five years old, run the goddamn Howey Test on it and show me the difference between the two,” he said, arguing that Bitcoin’s “orange pill moonboys” have an expectation of returns.\n\nAD\n\nAD\n\nAccusing the SEC of wasting hundreds of millions of dollars in a “Pyrrhic war that's being fought on the industry,” the Cardano founder said that eventually, “they’ll lose court case after court case, as they already have. And we'll continue. And then at some point, it'll stop. There will not be an apology. There's not going to be any money that comes back.”\n\nCharles Hoskinson GOES OFF on SEC & Bitcoin getting a pass while Cardano $ADA & crypto has to suffer. 👇 pic.twitter.com/Vm1u9jGrIr — Altcoin Daily (@AltcoinDailyio) November 27, 2023\n\nRailing against “unaccountable” government and regulators, Hoskinson praised libertarian lawmakers, saying that “the only people that seem to improve the situation are the people that are unraveling the government.”\n\n“The entire reason cryptocurrencies exist is that we're trying collectively to reestablish the social contract, because the social contract is horrifically broken,” he added.\n\nThe SEC has repeatedly asserted that Cardano (ADA) is a security in lawsuits directed at Binance and other crypto exchanges. The blockchain research and engineering firm behind Cardano, Input Output Global (IOG) has refuted the SEC’s claims, arguing that its complaints against Binance and Coinbase contain “numerous factual inaccuracies,” and that “under no circumstances is ADA a security under U.S. securities laws.”\n\nAD\n\nAD\n\nUndeterred, the SEC has repeated its claim that Cardano is a security, most recently in a new round of charges filed against crypto exchange Kraken.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vaW50ZXJlc3RpbmdlbmdpbmVlcmluZy5jb20vc2NpZW5jZS9iaXRjb2lucy13YXRlci1mb290cHJpbnQtc3VzdGFpbmFiaWxpdHktY2hhbGxlbmdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin mining could dry up the world of its water bodies - Interesting Engineering",
        "content": "Bitcoin, the most popular cryptocurrency, consumes not only a huge amount of electricity but also a lot of water, according to a new study. The study, published in the journal Cell Reports Sustainability, estimates that Bitcoin mining uses over 1,600 gigaliters (GL) of water per year globally, enough to fill 640,000 Olympic-sized swimming pools. This water is used primarily to cool down the computers that run the complex calculations to generate new Bitcoins."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8yMDc4OTUvY2hhcmxpZS1tdW5nZXItbWVtZS1jb2luLXB1bXBzLTMxMDAwLWJpdGNvaW4taGF0ZXJzLWRlYXRo0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNzg5NS9jaGFybGllLW11bmdlci1tZW1lLWNvaW4tcHVtcHMtMzEwMDAtYml0Y29pbi1oYXRlcnMtZGVhdGg_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Charlie Munger Meme Coin Pumps 31,000% After Bitcoin Hater's Death - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt didn’t take long for degens to dance on the grave of longtime crypto hater and Warren Buffett consigliere Charlie Munger, who died yesterday at the age of 99.\n\nIn fact, It took less than 15 minutes after Berkshire Hathaway announced its vice chairman’s passing for a Munger memecoin (MUNGER) to debut on decentralized exchange Uniswap. Those intrepid degen reflexes appear to have paid off: The Ethereum-based token is up 409% in the last 24 hours, according to GeckoTerminal. Shortly after its launch, the token was up over 31,500%.\n\n\n\nTo be clear, MUNGER is still six decimal spots shy of being worth more than a penny—it’s sitting at just $0.00000001884 as of this writing. It’s also highly volatile, and is already down 34% in the last hour. But that hasn’t stopped irony-poisoned meme coin traders from pumping the token with $3.57 million in trading volume since yesterday. The coin currently sits at a market capitalization just north of $132,000—though that figure, too, is already falling.\n\nAD\n\nAD\n\nHow would the late Munger take the news that his passing lined the pockets of at least a few “shitcoin” aficionados? Probably not very kindly.\n\nCharlie Munger meme coin up 31,500% in the last hour God would he hate this pic.twitter.com/9sU5BCSZB2 — Michael McQuaid (@michaelgmcquaid) November 28, 2023\n\n\"I'm not proud of my country for allowing this crypto shit,\" Munger said earlier this year. \"It's worthless, it's no good.\"\n\nThe year prior Munger compared crypto to a venereal disease, skewering the entire industry as \"beneath contempt.\"\n\n\"I just think the whole damn development is disgusting and contrary to the interests of civilization,\" he said at the time.\n\nAD\n\nAD\n\nAnd that’s not even to get into Bitcoin specifically, which he routinely referred to as “rat poison.”\n\nMeme coins have a rich and storied history of capitalizing on breaking news to pump highly speculative tokens of questionable origin. Just last week, a freshly-minted CZ token, created in the immediate aftermath of Changpeng Zhao’s shocking resignation as Binance’s CEO, pumped 18,000%.\n\nThat price movement comes with a hefty price tag, however: Meme coins like MUNGER are routinely “rug-pulled” by their anonymous creators, who withdraw liquidity and leave investors holding the bag.\n\nSuch moves could be condemned as “massively stupid,” “evil,” “no good,” or “very dangerous.” But that’s nothing Munger hasn’t said already.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMirQFodHRwczovL3d3dy50aGVoaW5kdS5jb20vbmV3cy9jaXRpZXMvYmFuZ2Fsb3JlL2JpdGNvaW4tc2NhbS1zaXQtc2Vla3MtZGV0YWlscy1vZi1oYWNrZXItc3Jpa2lzLXN0YXktaW4tYmVuZ2FsdXJ1LWNlbnRyYWwtcHJpc29uLW9mZmljZXJzLXdoby13ZXJlLW9uLWR1dHkvYXJ0aWNsZTY3NTg2Njk3LmVjZdIBsgFodHRwczovL3d3dy50aGVoaW5kdS5jb20vbmV3cy9jaXRpZXMvYmFuZ2Fsb3JlL2JpdGNvaW4tc2NhbS1zaXQtc2Vla3MtZGV0YWlscy1vZi1oYWNrZXItc3Jpa2lzLXN0YXktaW4tYmVuZ2FsdXJ1LWNlbnRyYWwtcHJpc29uLW9mZmljZXJzLXdoby13ZXJlLW9uLWR1dHkvYXJ0aWNsZTY3NTg2Njk3LmVjZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin scam: SIT seeks details of hacker Sriki’s stay in Bengaluru Central Prison, officers who were on duty - The Hindu",
        "content": "November 29, 2023 09:14 pm | Updated 09:14 pm IST - Bengaluru\n\nThe Special Investigation Team (SIT) of the Criminal Investigation Department (CID) probing the bitcoin scam has issued a notice to the Prison and Correctional Services Department seeking multiple details.\n\nAccording to sources, in a letter sent to the department, the SIT has sought details about hacker Srikrishna Ramesh alias Sriki’s stay in the Bengaluru Central Prison. The notice was sent by the head of the SIT, Additional Director-General of Police (ADGP) Manish Karbikar.\n\nSriki was arrested in 2020 in a drug case after he was suspected of being involved in purchasing narcotic substances through the Dark Net. Later, in the course of the investigation, it was found that he had allegedly hacked Bitfinex, a cryptocurrency trading website, and government websites. In a volunteer statement given to the police, Sriki admitted to hacking. He was in prison between 2020 and 2021.\n\nIn the notice issued to the Director-General (DG), Prisons, the SIT, according to sources, has sought details about the timeline of Sriki’s stay in the prison and in which cell he was kept. The SIT has also asked the department to share details of visitors who met him while he was in the prison at Parappana Agrahara.\n\nThe source said that through the notice, the investigation team wants to know the names or details of the prison officers who were on duty during Sriki’s stay. The team has also sought details about Sriki’s movement between the court and the prison when he was under judicial custody. The source said initially it was suspected that three senior officers and a constable may have been involved in the scam and instrumental in making Sriki move bitcoins from inside the quarantine cell. “But now it is suspected that more officials may be involved in the scandal,” the source added.\n\nWhen contacted, Mr. Karbikar said this was part of the investigation and refused to comment further."
    }
]