[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTEzL2JsYWNrcm9jay1maWRlbGl0eS1hbmQtaW52ZXNjby1yYWNlLXRvLWJlY29tZS1maXJzdC1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Blackrock, Fidelity and Invesco Race to Become First Spot Bitcoin ETF - Bloomberg",
        "content": "It’s been a brutal stretch for crypto. Almost $2 trillion of market value in cryptocurrencies has been wiped away since the market peak in late 2021. Major digital asset companies have collapsed amid allegations of fraud and market manipulation. US regulators are cracking down on many of the businesses still standing. But one corner of the market is suddenly garnering enthusiasm: Bitcoin exchange-traded funds.\n\nSome of the biggest and most established names on Wall Street are filing or refiling applications with the US Securities and Exchange Commission in an attempt to be the first to release such a product. A Bitcoin ETF would invest in the cryptocurrency on behalf of its shareholders. In other words, investors could easily get direct exposure to crypto by going to their brokerage and buying shares the way they would a stock."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzE0L2JpdGNvaW4tY2FzaHMtcmVtYXJrYWJsZS0xNjUtcmlzZS1jYW4tdGhlLWdyb3d0aC1jL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Cash's Remarkable 195% Rise: Can the Growth Continue? - The Motley Fool",
        "content": "In the last month, few other cryptocurrencies have surged as much as Bitcoin Cash (BCH 1.91%). After a lackluster start to 2023, things changed in June and so far this year it's up more than 195%.\n\nHowever, despite the short-term gains, Bitcoin Cash investors should exercise extreme caution and keep their hopes for a continued run in check. By taking a closer look at the reasons behind Bitcoin Cash's recent momentum and its position relative to its predecessor, Bitcoin (BTC 0.04%), it becomes clear that there are better options for your portfolio.\n\nThe big news\n\nOn June 15, a new crypto exchange called EDX made its debut, setting itself apart from popular exchanges like Coinbase Global and Binance due to its non-custodial services. Adding to the uniqueness of EDX is the backing it received from notable names on Wall Street, including Charles Schwab and Fidelity, among others.\n\nOut of the four cryptocurrencies permitted for trading on EDX, Bitcoin Cash is one of them, alongside Bitcoin, Ethereum, and Litecoin. The selection of these cryptocurrencies was a deliberate move by EDX to avoid regulatory scrutiny, as these cryptos are considered among the most decentralized and, therefore, not classified as securities under Securities and Exchange Commission (SEC) regulations.\n\nConsequently, when this news broke, Bitcoin Cash surged as traders perceived it to have gained an endorsement from Wall Street and recognized it as a truly decentralized asset. While this may seem like bullish news, it fails to capture the full picture of Bitcoin Cash's bleak future.\n\nA little context\n\nIn 2017, a group of miners and developers proposed changing the Bitcoin code to allow for larger blocks, with the aim of facilitating faster transactions. However, this proposal faced resistance from the broader Bitcoin community. As a result, developers decided to hard fork the Bitcoin blockchain, thereby creating a separate cryptocurrency known as Bitcoin Cash that included larger block sizes.\n\nAt its inception, Bitcoin Cash gained traction and reached the top 10 cryptocurrencies by market value. However, as time went on, the novelty of Bitcoin Cash wore off, and it began to lose its market appeal as the realization that Bitcoin could meet the needs of users in its original form solidified.\n\nThe clear leader\n\nSome of the key reasons Bitcoin remains a superior investment compared to Bitcoin Cash lie in the current developments within the Bitcoin ecosystem and its unparalleled levels of decentralization and security.\n\nWhile Bitcoin Cash emphasizes larger block sizes and faster transaction speeds, Bitcoin continues to make significant strides in addressing scalability issues. Layered solutions like the Lightning Network, for example, are helping Bitcoin to become more efficient by enabling instant transactions through off-chain payment channels, all while maintaining the security and decentralization of the Bitcoin main chain. Furthermore, Bitcoin remains orders of magnitude more decentralized and secure, as its slower block times and smaller block sizes keep the costs to run a node and participate in the network to a minimum.\n\nWhen it comes down to comparing price appreciation between the two, it becomes evident that Bitcoin has consistently outperformed Bitcoin Cash over time. The value of Bitcoin Cash relative to Bitcoin has shown a downward trend, indicating a lack of long-term growth and inability to keep pace with its predecessor.\n\nWhile Bitcoin Cash may have experienced a temporary surge due to its listing on the EDX crypto exchange and the perceived endorsement from Wall Street, it is important to approach such developments with caution. The fundamental strengths of Bitcoin, including its robust infrastructure, widespread adoption, and established reputation, make it the more reliable and secure investment option.\n\nEventually momentum behind Bitcoin Cash will likely fade, just as it has before. In preparation for this reality, investors are better off prioritizing the original and proven cryptocurrency for a more secure and rewarding investment strategy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzE0L2JsYWNrcm9jay1jZW8tbGFycnktZmluay10YWxrcy11cC1jcnlwdG8tZGVtYW5kLWZyb20tZ29sZC1pbnZlc3RvcnMv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDcvMTQvYmxhY2tyb2NrLWNlby1sYXJyeS1maW5rLXRhbGtzLXVwLWNyeXB0by1kZW1hbmQtZnJvbS1nb2xkLWludmVzdG9ycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "BlackRock CEO Larry Fink Talks Up Crypto Demand From Gold Investors - CoinDesk",
        "content": "\"If you look at the value of our dollar, how it depreciated in the last two months and how much it appreciated over the last five years ... an international crypto product can really transcend that,\" he said. \"That's why we believe there's great opportunities and that's why we're seeing more and more interest. And the interest is broad-based [and] worldwide.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjM5NTgxL2pwbW9yZ2FuLWJpdGNvaW4taGFsdmluZy1zdHJlc3MtdGVzdC1taW5lcnPSAVNodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMzk1ODEvanBtb3JnYW4tYml0Y29pbi1oYWx2aW5nLXN0cmVzcy10ZXN0LW1pbmVycw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "JPMorgan says upcoming Bitcoin halving could be a stress test for miners - The Block",
        "content": "The upcoming Bitcoin halving event will form a crucial test for miners as they navigate reduced rewards and increased production costs, according to JPMorgan.\n\n\"Miners with lower electricity costs would find it easier to cope after the halving event, while miners with higher electricity costs could struggle post halving event,\" JPMorgan strategists led by Nikolaos Panigirtzoglou wrote in a report on Thursday. Put simply, the halving event will determine miners' ability to adapt and remain profitable in a changing environment.\n\nThe Bitcoin halving is an event that occurs approximately every four years, reducing the reward for mining new Bitcoin blocks by half, effectively decreasing the rate at which new bitcoins are created, in order to control inflation and maintain the scarcity of bitcoin over time. The upcoming Bitcoin halving will see the block reward halve from 6.25 bitcoin to 3.125 bitcoin.\n\nWhile Bitcoin's halving is generally seen as having a positive impact on the price of Bitcoin, it poses challenges for Bitcoin miners, because the cost of production has historically acted as a floor price, according to JPMorgan analysts. \"According to our current bitcoin production cost model, one cent per kWh [kilowatt-hour] change in the electricity cost induce a $4,300 change in the bitcoin production cost. Post halving this sensitivity would double to $8,600 thus increasing the vulnerability of higher cost producers,\" the analysts said.\n\nRELATED INDICES See crypto indices\n\nCompetition among Bitcoin miners is also intensifying ahead of the halving event as the Bitcoin hash rate, or the total computational power to mine the cryptocurrency, is increasing, according to the analysts. Post the halving event, however, the Bitcoin hash rate may not continue to rise at the same pace without any sustained rise in the Bitcoin price above its production cost or a large increase in transaction fees that could offset the reduction in issuance rewards, the analysts said.\n\n\"And at the moment the decline in the hype around ordinals poses an additional challenge for bitcoin miners' revenues,\" the analysts concluded."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3VyZ2UtcmlwcGxlLXdpbi1zZWMteHJwLWxlYWRzLXJhbGx5L9IBRmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3VyZ2UtcmlwcGxlLXdpbi1zZWMteHJwLWxlYWRzLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether surge after Ripple notched partial win against SEC; Ripple’s XRP leads crypto rally - Forkast News",
        "content": "Bitcoin surged on Friday morning in Asia to breach the US$31,000 resistance level, after Ripple Labs achieved a partial victory in its three-year lawsuit against the U.S. Securities and Exchange Commission (SEC). The regulator accused Ripple of offering XRP as an unregistered security. Along with Bitcoin, Ether and all other top 10 non-stablecoin cryptocurrencies logged considerable gains, with XRP spearheading the rally with a rise of over 70%. U.S. equity futures traded flat in the Asia time zone on Friday as investors await earnings reports from major U.S. banks. Thursday’s U.S. producer price index (PPI) has added to a sense that inflation is slowing in the country.\n\nXRP ruling provides crypto market boost\n\nBitcoin climbed 3.45% over the last 24 hours to US$31,463 as of 07:50 a.m. in Hong Kong for a weekly gain of 4.93%, according to data from CoinMarketCap. The world’s largest cryptocurrency reached a high of US$31,814 early Friday morning, the highest price since June 2022.\n\nIn a summary judgement on Thursday, New York Southern District Court Judge Analisa Torres ruled that Ripple’s programmatic sales of the XRP token on public exchanges do not constitute securities, marking a partial victory for Ripple with the SEC. The regulator first sued the San Francisco-based financial technology firm on the grounds that XRP constitutes a security in 2020.\n\nThe verdict came with a critical caveat, however. The court ruled that Ripple’s XRP sales to institutional investors did violate securities laws.\n\nNonetheless, Ripple’s Chief Executive Officer Stuart Alderoty called the judgement “a huge win” in a Friday tweet.\n\nA huge win today – as a matter of law – XRP is not a security. Also a matter of law – sales on exchanges are not securities. Sales by executives are not securities. Other XRP distributions – to developers, to charities, to employees are not securities. — Stuart Alderoty (@s_alderoty) July 13, 2023\n\nAlderoty said that “the only thing the Court found constitutes an investment contract is past direct XRP sales to institutional clients.” Those transactions will now be subject to further court proceedings.\n\nDespite the overall optimism in the crypto community evidenced by the upswing in the market, there are also a number of industry voices sounding a note of caution.\n\nIn an emailed comment, CoinShares’ Head of Product Townsend Lansing said that the aspect of the ruling that identifies Ripple’s sales to institutional customers as a violation of securities law marks “a considerable victory for the SEC.”\n\nThe ruling will now set a precedent for legal action against other cryptocurrencies by regulators, he said.\n\n“It is important to note that institutional investors who purchased directly from Ripple may find themselves subject to class-action litigation as potential underwriters,” Lansing added. “This is an area to watch closely, especially if big-name venture capitalists were involved.”\n\nBut, while some sense of jeopardy remained for those involved, Justin d’Anethan, head of APAC business development at Belgium-based crypto market maker Keyrock, believes that the ruling had at least “shook investors in the best of ways.”\n\nElsewhere, Europe’s first Bitcoin exchange-traded fund (ETF) is set for a public listing this month. That follows a 12-month delay from the initially planned date, the Financial Times reported on Thursday.\n\nExperts have identified the listing as another potential catalyst for the crypto market.\n\n“With the talks of ETFs in the background, the idea that we could see products tracking many cryptocurrencies is not implausible and traders are naturally positioning themselves accordingly,” said Keyrock’s d’Anethan.\n\nLike Bitcoin, Ether surged 6.99% to US$2,004, moving up 7.69% for the week. The token is trading above US$2,000 for the first time since April.\n\nBoosted by the ruling on the SEC-Ripple case, all other top 10 non-stablecoin cryptocurrencies rose in the past 24 hours. Cardano’s ADA, Solana’s SOL and Polygon’s MATIC each logged two-digit gains.\n\nXRP, subject of the SEC’s lawsuit against issuer Ripple, jumped 72.75% to US$0.8142 and added 74.89% for the week. In doing so, it replaced Binance’s BNB as the third largest non-stablecoin cryptocurrency by market cap.\n\nThe total crypto market capitalization rose 6.19% in the past 24 hours to US$1.26 trillion, while trading volume jumped 95.72% to US$60.3 billion.\n\nForkast 500 up, Dapper Labs announces layoffs\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index edged up 0.14% in the past 24 hours to 2,699.39 as of 09:55 a.m. in Hong Kong. Forkast’s Solana and Cardano NFT market indices also moved higher, while the Etheum and Polygon indices dropped.\n\nDespite the overnight rise in cryptocurrency prices associated with the Ripple ruling, total NFT sales volume dipped 1.72% in the past 24 hours to US$24.45 million, according to data from CryptoSlam.\n\nAmong all NFT collections, Bitcoin-based $FRAM BRC-20 NFTs topped the 24-hour sales volume, edging up 0.31% to US$2.14 million. In doing so, it recorded over two thirds of the total volume on the Bitcoin network. Ethereum-based collections Bored Ape Yacht Club (BAYC) and the Captainz ranked second and third respectively.\n\nBAYC #1734, part of the BAYC collection, topped collectible sales in the past 24 hours. It was sold at 600 Ether (US$1.2 million) early Friday. As exciting as this big sale is, BAYC #1734 was previously sold at 800 Ether in January 2022.\n\n“This grail Bored Ape was sold at a huge loss, but the takeaway is that there is still a market for very high-priced NFTs, even in a bear market,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nAs the bear market continues, Dapper Labs, the developer of hit NFT collections such as CryptoKitties and NBA Top Shot, announced the layoff of 51 staff on Thursday — roughly 12% of its workforce.\n\n“The decision was incredibly difficult” but necessary to “ensure a lean and efficient” company, said Dapper Labs Chief Executive Officer Roham Gharegozlou in a letter to employees. It is the third round of layoffs at the company in the past 12 months. Those layoffs saw its workforce cut by 22% in November 2022 and by a further 20% in February this year.\n\nCool Cats Group, the Web3 company behind NFT collection Cool Cats, announced a partnership with game developer nWayPlay, a subsidiary of Hong Kong-based software and investment giant Animoca Brands. Together, the two companies will develop a Web3 game set to be released between late 2023 and early 2024.\n\nUS equities flat amid data releases\n\nImage: Envato Elements\n\nU.S. stock futures traded flat as of 11:50 a.m. in Hong Kong. All three major U.S. indexes closed higher in regular Thursday trading, with the Nasdaq leading the gains with a 1.58% rise.\n\nThe U.S. producer price index (PPI) released Thursday recorded a 0.1% year-on-year rise for the month of June, down from 0.9% in May. The June figure is the smallest increase since August 2020.\n\nThe data is also well below analyst expectations of a 0.4% annual increase in PPI. Combined with weak consumer price index data released on Wednesday, the data points to a slowdown in U.S. inflation.\n\n“The better-than-expected inflation figures for June 2023 would suggest that policy is working to ease price pressures as higher interest rates reduce demand. Key payroll figures announced in early July also came in below expectations with the economy generating less jobs than expected in June,” said Keith Wade, chief economist & strategist at asset management Schroders.\n\nHowever, given lingering inflation worries, Wade still expects the Federal Reserve to make another interest rate hike in July. The tight labor market and the potential for a reversal in the Fed’s monetary policy could, Wade said, trigger a rally in the bond market that would “loosen financial conditions.”\n\n“Given the efforts the Fed has made to convince markets they were serious about inflation and not about to pivot, this would seem to be too early,” said Wade.\n\nFederal Reserve Governor Christopher Waller said in a Thursday speech that the Fed would need to “keep policy restrictive for some time” in order to reduce inflation below its 2% target. He said that he anticipates two more rate hikes by the end of the year.\n\n“I am more confident that the banking turmoil is not going to result in a significant problem for the economy, and I see no reason why the first of those two hikes should not occur at our meeting later this month,” said Waller.\n\nMeanwhile, a Wednesday report by financial comparison service company Bankrate showed that economists believe there is a 59% chance the U.S. economy will enter a recession inside the next twelve months. The report cited concern about the long-term economic impact of this year’s extended series of rate hikes.\n\nThe 59% figure is, however, a decrease on the 64% chance given in April, and the lowest level in the past 12 months.\n\nThe Federal Reserve meets on July 26 to discuss its next move on rates, which now sit between 5% and 5.25%. The CME FedWatch Tool predicts a 92.4% chance the Fed will enact a 25-basis-point rate increase this month, and a 7.6% chance it will leave the rate unchanged.\n\nInvestors are now awaiting the release of second-quarter earnings reports from major financial institutions on Friday. The releases will include reports from JPMorgan Chase, Wells Fargo, Citigroup, BlackRock and more.\n\nElsewhere, main stock indexes across Asia traded higher on Friday morning. China’s Shanghai Composite, Hong Kong’s Hang Seng, Japan’s Nikkei and South Korea’s Kospi all posted rises as of 12:30 p.m. in Hong Kong.\n\n(Updates with equity section.)"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTEzL2NhdXRpb24tYWJvdXQtYml0Y29pbi1ncm93cy1hcy1hLWp1bXAtaW4tZ2xvYmFsLW1hcmtldHMtYnlwYXNzZXMtY3J5cHRv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Caution About Bitcoin Grows as a Jump in Global Markets Bypasses Crypto - Bloomberg",
        "content": "Bitcoin missed out on a rally in global markets sparked by cooling US inflation, triggering some caution about the token’s outlook.\n\nThe largest digital asset on Thursday mostly held losses of 0.7% from a day earlier, while stocks and bonds extended gains on bets that an end to Federal Reserve monetary tightening is getting closer."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzE0L3Nob3VsZC15b3UtYnV5LWJpdGNvaW4td2hpbGUtaXRzLXN0aWxsLWJlbG93LTQwMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Should You Buy Bitcoin While It's Still Below $40,000? - The Motley Fool",
        "content": "Bitcoin (BTC 0.04%) has had a fantastic start to the year, up almost 90% as of July 13. The bulls are certainly happy with this trend, especially after this digital asset tumbled 65% in 2022. As the overall crypto market bounces back, it seems investors are now more optimistic.\n\nBitcoin's price now is about $31,400, so it remains well off its peak price of nearly $69,000 in late 2021.\n\nDoes that mean it's smart to buy this top cryptocurrency while it's still below $40,000? Let's take a closer look at why I think it just might be.\n\nThe 2024 halving\n\nBitcoin runs a proof-of-work consensus mechanism, requiring Bitcoin miners to solve complex computational problems to win the right to process new transactions on the blockchain. The reward for all this effort is newly created Bitcoin. Right now, the block reward is 6.25 coins. Some time probably in April 2024, the reward gets cut in half to 3.125 coins. This event, which occurs roughly every four years, is what's known as a halving.\n\nAlthough the past is no indication of what the future may hold, the price of Bitcoin has generally gone up starting several months before a halving occurs. And this upward trend continues even 12 to 18 months after a halving. This means that now could be a great time to be a buyer.\n\nThis makes sense because a halving essentially cuts the supply growth rate of Bitcoin. A reduced inflow of new supply, coupled with rising demand, should lead to a higher price, according to basic economic theory. Plus, there's the fact that there will only be 21 million coins in circulation. A hard-coded supply cap like this can drive more interest.\n\nTo say that Bitcoin's price history is like a roller coaster would be accurate. Throughout its 14-year history, Bitcoin has seen declines of more than 50% numerous times. While the volatility has undoubtedly declined as the asset grows in popularity and its market cap increases, Bitcoin still trades like a speculative growth tech stock.\n\nBut one thing is absolutely certain. Bitcoin has always found a way to reach higher highs and higher lows over time, albeit not in a perfectly straight line. Following the next halving event in 2024, I think it's likely that Bitcoin will eclipse its previous all-time high.\n\nExpect greater adoption\n\nIt's hard to forecast with any level of precision when, if ever, Bitcoin will become a prominent medium of exchange that's used globally for everyday transactions. There is just a lot of uncertainty around this outcome.\n\nTherefore, I think Bitcoin's best investment case rests on its increasing adoption as a store of value. This means that Bitcoin won't be used for its utility, but instead because it can maintain, or hopefully significantly increase, someone's savings.\n\nIts volatility is gut-wrenching, no doubt, but it's hard to deny Bitcoin's long-term track record. Since April 2011 (the earliest data available on CoinMarketCap), Bitcoin's price has skyrocketed almost 50,000,000%. That absolutely crushes the performance of the S&P 500 and the Nasdaq Composite index by huge margins.\n\nAnd during this same time period, the price of a single ounce of gold has increased just 29%. Using this data, it's obvious that Bitcoin has done a much better job at building wealth.\n\nAs more market participants, especially institutions, start to feel comfortable owning Bitcoin in their portfolios, its price can soar even higher over the next five to 10 years. Large asset managers, like BlackRock and Fidelity, are trying to launch a spot Bitcoin exchange-traded fund.\n\nInterest like this bodes well for Bitcoin's future, making it a good idea to buy Bitcoin while it's still below $40,000."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTMvYml0Y29pbi1hbmQtY3J5cHRvLXN0b2Nrcy1saWtlLWNvaW5iYXNlLXNvYXItYXMteHJwLXJ1bGluZy1ib2xzdGVycy1vcHRpbWlzbS_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzEzL2JpdGNvaW4tYW5kLWNyeXB0by1zdG9ja3MtbGlrZS1jb2luYmFzZS1zb2FyLWFzLXhycC1ydWxpbmctYm9sc3RlcnMtb3B0aW1pc20vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin and Crypto Stocks Like Coinbase Soar as XRP Ruling Bolsters Optimism - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA3LTE0L2luZmxhdGlvbi1ncm93cy1sZXNzLXNjYXJ5LWFuZC1iaXRjb2luLWxlc3MtZXhjaXRpbmctY29taW5nLXVwLWVhcm5pbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Inflation Grows Less Scary, and Bitcoin Less Exciting. Coming Up, Earnings - Bloomberg",
        "content": "To get John Authers' newsletter delivered directly to your inbox, sign up here.\n\nMore great news for those who hate inflation. The day after the US Consumer Price Index came in below expectations, producer prices performed the same trick. Indeed, if measured by the traditional method of tracking finished goods, PPI in the US has gone negative:"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTMvZXRoZXJldW0tdG9wcy1uZXctY3J5cHRvLWVzZy1yYW5raW5nLWJpdGNvaW4tc2xhbW1lZC1mb3ItaGVhdnktZW5lcmd5LXVzYWdlL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTMvZXRoZXJldW0tdG9wcy1uZXctY3J5cHRvLWVzZy1yYW5raW5nLWJpdGNvaW4tc2xhbW1lZC1mb3ItaGVhdnktZW5lcmd5LXVzYWdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Tops New Crypto ESG Ranking, Bitcoin Slammed for Heavy Energy Usage - CoinDesk",
        "content": "Attendees at CoinDesk’s Consensus conference said that if crypto wants to capture new institutional money, it should also embrace ESG instead of hiding from it, the Consensus @ Consensus report found. Notably, asset management giant BlackRock, which is at the forefront of the push to register a spot bitcoin ETF, is a large proponent of ESG-focused investments."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTQvYml0Y29pbi1jcnlwdG8tcHJpY2VzLWJ1Y2tsZS1hZnRlci1hbHRjb2luLWZyZW56eS1vbi14cnAtcnVsaW5nL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTQvYml0Y29pbi1jcnlwdG8tcHJpY2VzLWJ1Y2tsZS1hZnRlci1hbHRjb2luLWZyZW56eS1vbi14cnAtcnVsaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Tumbles Below $30K, Crypto Prices Buckle After Altcoin Frenzy on XRP Ruling - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1wcmljZXMtYWJvdmUtMzBrLXNwb3QtMTYwMDMzOTMxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin prices above $30K as spot bitcoin ETF approval dependent on courts - Yahoo Finance",
        "content": "Approval for spot bitcoin ETFs hinges on a court battle between crypto firm Grayscale and the SEC. Yahoo Finance Markets Reporter Jared Blikre checks out bitcoin's price action amid regulatory pressures.\n\nVideo Transcript\n\n- Well, amid the surge in tech stocks, small caps, and government bonds, one asset class isn't participating in the latest run up. Bitcoin has held a tight trading range over the last three weeks as the industry braces for a critical decision in federal court, where Grayscale Investments, the manager of the world's largest publicly traded crypto fund is suing the SEC to allow a spot Bitcoin ETF to operate in the US market.\n\nYahoo Finance's Jared Blikre is here with those details. Hey, Jared.\n\nJARED BLIKRE: Hey, there. And I thought before I got into the court case, I just begin with a year to date look at what's happening in cryptocurrency land. Bitcoin, up 85%. But as you said, Rachelle, we haven't seen a lot of that price action made recently. This is a-- let's see, let's get a year to date chart on there. And you can see over the last three weeks, basically treading water going sideways.\n\nHowever, given the fact that we are in the upper right hand side of this chart, this consolidation is actually bullish. And when you see what's overhead, let me put a three-year chart, the most price action in Bitcoin is lying directly ahead. And that's basically 30,000 to 40,000, goes up to maybe 50,000. But a ton of price memory in there. So not surprising to see Bitcoin at least taking a pause, and it could still reverse.\n\nBut back to the main point. This court case that we were talking about, Grayscale versus the SEC, they want to sue the SEC in order to allow them to convert into an ETF. They are currently an ETN, it gets into the weeds there. But they want to be able to be based their reference price on spot Bitcoin.\n\nAnd we saw in anticipation of a decision of that in this case, we saw BlackRock file for a Bitcoin ETF, a spot Bitcoin ETF only a few weeks ago. Then a bunch of other issuers piled on. Fidelity did as well, and they just issued a note, they just filed an amendment only today or yesterday with regard to their previous amendments. So things are moving along there. But is it going to be approved? Is the spot Bitcoin ETF going to be approved on its own merits or is it going to be forced and shoehorned in because of this court case? We don't know.\n\nBut nevertheless, Bitcoin poised-- poised, I should, say to break higher. But as we know in crypto, anything can happen.\n\n- It's true, we're always waiting for that breakout moment here, still waiting for it. But thank you for getting us up to speed, our very own Jared Blikre there."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtZWNvbm9taWNzLW9mLWJpdGNvaW4taGFsdmluZy11bmRlcnN0YW5kaW5nLXRoZS1lZmZlY3RzLW9uLXByaWNlLWFuZC1tYXJrZXQtc2VudGltZW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "The economics of Bitcoin halving: Understanding the effects on price and market sentiment - Cointelegraph",
        "content": "Bitcoin (BTC), the pioneering cryptocurrency that sparked a global revolution in digital assets, operates on a unique monetary policy. One of the defining features of Bitcoin is its halving event, which occurs approximately every four years.\n\nThis article will explore the economics behind Bitcoin’s halving, examining its effects on price movements and market sentiment. By understanding these factors, investors and enthusiasts can gain valuable insights into the cryptocurrency’s market behavior.\n\nRelated: How does the monetary supply affect cryptocurrencies?\n\nWhat is a Bitcoin halving?\n\nA Bitcoin halving, also known as a “halvening,” refers to the predetermined reduction in the rate at which new BTC are created. It is programmed into the Bitcoin protocol and occurs every 210,000 blocks, which is roughly every four years. The halving event halves the block reward, reducing the number of newly minted Bitcoin awarded to miners.\n\nSupply and demand dynamics\n\nA Bitcoin halving directly impacts the supply and demand dynamics of the cryptocurrency. By reducing the rate at which new BTC enters the market, halving effectively reduces the available supply. As the supply decreases, assuming demand remains constant or increases, basic economic principles suggest that the price of Bitcoin should rise.\n\nSupply and demand is the basic economic principle supporting a price increase in response to Bitcoin’s halving. The law of supply and demand states that prices tend to increase when a commodity’s supply declines, and demand either stays the same or rises. The Bitcoin halving slows the rate of new Bitcoin creation and market release.\n\nAs a result, there are fewer newly created BTC available for purchase. The diminished supply produces a scarcity effect, which might push the price upward if demand for Bitcoin stays the same or rises.\n\nBitcoin’s controlled supply is a key factor contributing to its value proposition. The total supply of Bitcoin is limited to 21 million coins, and the halving mechanism gradually reduces the rate at which new BTC are produced until the maximum supply is reached. This scarcity aspect, coupled with the increasing recognition and adoption of Bitcoin, can create a perception of limited availability and drive up demand, thereby impacting the price.\n\nHistorical price movements\n\nHalving events have frequently been associated with increases in the price of Bitcoin, with significant upward momentum both before and after previous halvings. For example, during the 2012 halving, Bitcoin’s price soared from about $12 to over $200 in just one year. Similarly, Bitcoin experienced a stunning recovery after its 2016 price halving, reaching a high of about $19,700 in December 2017.\n\nFollowing the most recent halving event in May 2020, Bitcoin’s price surged. Starting at $8,787 during the halving, the cryptocurrency experienced a remarkable rally, eventually reaching its all-time high of nearly $69,000 in November 2021.\n\nMarket attitude and investor perception\n\nBitcoin halving events often generate increased market attention and hype. Expectations of lower supply and likely price increases may fuel positive feelings among investors and traders. This optimism could result in higher demand for Bitcoin as traders try to profit from the expected price gain. As a result, a Bitcoin halving can result in the self-fulfilling prophecy of rising market sentiment and demand.\n\nIt is crucial to remember that during halving occurrences, market sentiment isn’t always favorable. Market participants may also experience FUD around the potential effects of a price halving. Short-term price swings and heightened volatility may result from this conflicting sentiment.\n\nImpact on mining economics\n\nThe Bitcoin halving event may also impact mining economics. Block rewards and transaction fees are the primary sources of income for miners, which are essential to confirming transactions and safeguarding the Bitcoin network.\n\nThe decrease in block rewards caused by a halving event directly affects miner profitability. After a halving event, miners operating with increased expenses might find it less profitable to mine Bitcoin, which could result in a drop in mining activity.\n\nRelated: ‘Don’t short when it’s dark green’: How to trade the 2024 Bitcoin halving\n\nNetwork security and long-term outlook\n\nBitcoin’s halving may initially impact mining economics, but it also plays a critical role in preserving the network’s long-term security and stability. Miners are encouraged to continue their activities and secure the network through transaction validation due to the carefully managed decline in block rewards.\n\nThe network becomes more robust and less dependent on freshly created currencies for security as the mining industry adapts to the decreased block rewards.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3RhbmRhcmQtY2hhcnRlcmVkLWV4cGVjdGF0aW9ucy1uZnQtc2VnYS_SAUpodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLXN0YW5kYXJkLWNoYXJ0ZXJlZC1leHBlY3RhdGlvbnMtbmZ0LXNlZ2EvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Standard Chartered’s great expectations for Bitcoin in 2024 - Forkast News",
        "content": "In this issue\n\nBitcoin at US$120,000: Standard Chartered’s high hopes Forkast 500 NFT Index: Another week, another low Sega partners Line: From game to blockchain\n\nFrom the Editor’s Desk Dear Reader, Remember the “laser eyes” trend that many Bitcoiners enthusiastically bought into back in 2021? Yes? Well, we’ve been trying to forget it, too. But this week’s news that Standard Chartered sees BTC potentially soaring to US$120,000 next year brings those memories flooding back. Given the relatively short time the crypto industry has been in full bloom, banks have managed to chalk up an impressive track record of making dramatic predictions and pronouncements on the price of the original crypto token. In early 2021, for instance, JPMorgan – despite being headed by noted fixture of the crypto-skeptic punditocracy Jamie Dimon – outdid even the believers, predicting a rise to US$146,000. In late 2020, a leaked report by Citibank predicted an even more extravagant valuation of US$300,000 by December the following year, a figure that would have required BTC’s price to skyrocket 1,775%, or more than 18-fold. Standard Chartered’s latest call on BTC rests on a logic of supply and demand, one of the bedrocks of established economics. As such, it has a certain degree of merit. However, while that bullish prediction may set hearts racing among long-suffering speculators in the crypto community, it relates only to one token in the space, and is predicated on only a limited number of factors. Admittedly, BTC’s movements exercise a practically gravitational pull on the rest of the market. Yet even broad shifts in crypto prices are but a single dimension of the increasingly sophisticated digital asset ecosystem that has emerged in the past few years. BTC may bounce back, and even outperform to live up to the lofty expectations of the latest crop of analysts bold enough to be so bullish. But the damage wrought by the fevered speculation, hype and all-too-foreseeable misery that followed the headiness of 2021 have made the industry grow up quickly, moving its focus to the source of the more demonstrable and enduring value it can create: the spirit of pioneering innovation that animated it in the first place. It goes without saying that we want to see the crypto market back in the black, but it’s what comes next in the expanding digital asset universe that excites us most. Until the next time, Angie Lau,\n\nFounder and Editor-in-Chief\n\nForkast.News\n\n1. Great expectations\n\nHigher miner profitability per Bitcoin is a major factor for Standard Chartered’s projection. Image: Standard Chartered/Canva\n\nBitcoin prices could rise to US$50,000 by the end of 2023 and US$120,000 in 2024, U.K. bank Standard Chartered predicted in a Monday research report, an increase from its projection of US$100,000 in April.\n\nHigher miner profitability per Bitcoin is one of the major factors fueling Standard Chartered’s projection, allowing miners to “sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,” Geoff Kendrick, head of foreign exchange and digital assets research at Standard Chartered, wrote in the report.\n\nKendrick noted that the 12 largest listed miners — which account for 20% of all global Bitcoin mining — sold 106% of mined Bitcoins in the first quarter of 2023, and estimated the proportion dropped to 100% in the second quarter, thanks to lower mining cost and higher Bitcoin prices that have gained over 85% since the start of the year.\n\n“If the BTC price rises to around US$50,000, which we expect by end-2023, the share of newly mined being sold should fall to 20-30%. That is a net annual reduction in selling of BTC 250,000 — a large number relative to Bitcoin market turnover,” wrote Kendrick.\n\n“While predicting the timing of market moves is always tricky, the case for a significant increase in the price of Bitcoin in the foreseeable future is clear,” said Bradley Duke, founder and chief strategy officer of crypto ETP provider ETC Group.\n\n“With Blackrock filing for a spot Bitcoin ETF in the US, given their past success rate, the belief is that this application is likely to be approved. This will enable massive pent-up demand for Bitcoin in the US and elsewhere to finally be able to flow into the market, and it’s logical that the price of Bitcoin responds in a proportionate manner,” said Duke.\n\nBitcoin supply inflow will also be further reduced by the token’s fourth halving event, expected to occur in April or May 2024, which would cut miners’ reward for mining new blocks and verifying transactions by 50%.\n\n“Prior halving cycles have resulted in significant industry consolidation. This drives down the average cost of production further, increasing average miner profitability,” the report said.\n\nForkast.Insights | What does it mean? Standard Chartered’s prediction is contingent on the premise that Bitcoin miners will be able to reduce the amount of freshly mined Bitcoin they put up for sale. The rationale for this thesis hinges on Bitcoin halving, an in-built feature of the Bitcoin network which cuts the reward miners receive for verifying transactions on the blockchain by 50% approximately every four years. Consequently, this event reduces the inflow of new Bitcoins into the economy. The latest halving event in May 2020 cut miner compensation to 6.25 Bitcoins per block. The next anticipated halving in April or May 2024 will further decrease miners’ earnings to 3.125 Bitcoins per block. Historically, each four-year halving cycle has ushered in a new record high for Bitcoin, often succeeded by a downturn. The inaugural halving in November 2012 paved the way for Bitcoin to rise past US$1,200 in 2013. But this was short-lived due to a hack in Mt. Gox hack, the largest cryptocurrency exchange at the time. In the subsequent years before the next halving, Bitcoin price fluctuated between US$200-700, according to CoinMarketCap data. The second halving cycle, initiated in July 2016, saw Bitcoin set a new peak over US$19,000, a growth of around 1,500% compared to the prior record, propelled by the “initial coin offering boom,” a period from when the popularity and usage of ICOs as a fundraising mechanism in the cryptocurrency space significantly increased. However, within a year of this meteoric rise, Bitcoin retraced to around US$3,200. The most recent halving cycle that started in May 2020 saw institutional entities such as Tesla and MicroStrategy bolster their Bitcoin holdings, powering the cryptocurrency to over US$69,000, roughly 250% more than its previous record. Bitcoin then declined to under US$16,000, following a series of negative incidents in the Web3 industry, notably the failure of the Terra-Luna stablecoin and the controversy surrounding FTX. The cryptocurrency traded at US$30,404 at press time. In light of this, Standard Chartered’s price prediction of US$120,000 for Bitcoin would see a rise of about 74% from the previous peak. While it’s observed that Bitcoin’s volatility decreases with each halving cycle, this also impacts Bitcoin’s profitability. As a result, investors remain on the lookout for the next big innovation in the blockchain space, akin to the surge of interest in decentralized finance and non-fungible tokens in recent years.\n\n2. Refreshing new lows\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast Labs umbrella.\n\nAfter another week of declines, the NFT market has found a new low of 2,703.44. The Forkast 500 NFT Index lost 2.33%, while the ETH Composite declined 1.75%, Solana slipped 0.54%, Polygon inched down 0.37% and Cardano gained 0.86%.\n\nBlockchain sales volume shows Ethereum losing 13% to US$88,912,031 in sales, Bitcoin rising 13%, Solana declining 75.5%, Binance gaining 55.8%, and Polygon falling 29.75%.\n\nNoteworthy seven-day floor price changes include Moonbirds, Yuga Labs’ HV-MTL, BAYC and CryptoPunks that all posted double-digit gains, while The Captainz and Nakamigos posted double-digit declines.\n\nAverage global sales prices across blockchains declined 32% to US$68.52 from US$99.42 in the previous week.\n\nSeven-day global sales volumes decreased 20%, with US$163 million in sales this week compared to US$196 million last week.\n\nTrade profits in the previous two weeks stood at a low for 2023, with traders losing US$28.4 million.\n\nJuly 9 had 254,031 transactions, the lowest daily total since 239,742 on May 21.\n\nForkast.Insights | What does it mean? The NFT market had brief periods in the green over the past week, but the broader NFT ecosystem, after partial recoveries in specific projects’s floor prices, remains on the downtrend since the market’s peak on Jan. 17. This is a perfect way to highlight why floor prices are a poor measure of the value of the market. As the index reflects floor prices, the market’s decline continues at the same rate prior to the Elementals mint. The decline in prices, global sales, trade profits, and individual daily transactions indicate that the NFT market still requires a catalyst to turn the ship around. That catalyst will need to be pretty monumental to turn around a market that has lost 46% of its value from its peak in January. While the established projects continue their declines, recent new mints found some success this week. Projects like a new Azuki derivative called Fatzuki, SMB Gen3 and Barrels, and Parallel Avatars each traded noteworthy volumes with US$1 million, US$2.9 million, and US$1.7 million, respectively.\n\n\n\nCollectors continue to demonstrate that they do not value established projects at the prices they currently command. However, collections priced closer to 0.1 ETH are another story. Affordable enough to engage in the hyped communities and still having potential financial upside, these newer collections are in a sweet spot that offers enough value for traders. Now we await established collections to fall to these prices so that these very same traders, and ideally brand new collectors, can return. This week, we also have a perfect example of why collections like Fatzuki, SMB, and Parallel Avatars are not included in the Forkast 500 NFT Index.\n\n\n\nLast month, a new collection called Ethscriptions emerged, allowing collectors to tokenize data for a fraction of the cost that you would pay to mint as a traditional NFT. Since early June, the collection of Ethscriptions has traded over US$1 million on secondary, largely from collectors trading the first 10,000 Ethscription collectibles, a collection that uses the CryptoPunks image, named Ethereum Punks.\n\n\n\nThis week Yuga Labs, who owns the CryptoPunks IP, requested that the Ethscription team remove Ethereum Punks from their website, and scrub any mention of them from Twitter. Prices are now decimated, with the rarest NFTs in the collection being listed on the floor, and leaving the collection essentially worthless. Consider the Ethereum Punks now dead and possibly Ethscriptions with it, but because the index only includes collections that are established for longer than six months, wild potential price swings will not impact the measurement of projects with more tangible value. On the horizon for the NFT ecosystem are some major projects’ mints, Yuga Lab’s Ape Fest 2023 announcement, and the end of Blur’s season 2 of rewards farming.\n\n3. Buddy up\n\nContradicting recent reports, Sega revs up its blockchain engine through its partnership with Line. Image: Sega/Line\n\nSega Corp., the Japanese gaming giant behind hit IPs including Sonic the Hedgehog, will partner social media platform Line Corp. to bring one of its top game IPs onto the blockchain. The news on Monday came days after Sega was reported to be winding down its blockchain-based gaming business.\n\nSega signed a memorandum of understanding with Line Next Inc., an NFT branch of Line, to license the latter to make one of Sega’s classic IPs into a Web3 game on Line’s Game Dosi platform. The IP in question has not been confirmed for the time being.\n\nGame Dosi is Line’s Web3 gaming platform launched on May 18. Line Next will support the NFT production, digital payments, and marketing activities of the Sega title when it launches on Game Dosi, according to the announcement.\n\nDays before the announcement, Bloomberg reported Sega would withhold its classic franchises from third-party blockchain-based gaming projects and pause its own plans for similar projects, citing an interview with Sega co-Chief Operating Officer Shuji Utsumi.\n\nHowever, Utsumi later said in an email response to Forkast that the company’s strategy around blockchain had been misconstrued, and the plans to invest in Web3 projects, which includes licensing the company’s certain game titles to blockchain-based developers that it trusts to maintain its quality standards and meet the expectations of fans.\n\n“We are not trying to be a Web3 company,” said Utsumi. Instead, Web3 technologies such as the blockchain and NFTs are “functions” that the company will continue to explore as a way to grow its business and expand the potential of its IPs, he said.\n\nThe partnership with Line is not Sega’s first Web3 initiative. In September 2022, the firm announced a partnership with blockchain game developer Double Jump Tokyo and decentralized blockchain gaming platform Oasys to bring its digital card game IP Sangokushi Taisen onto the blockchain. Meanwhile, other Japanese gaming companies, including Square Enix and Konami are also expanding in the Web3 space."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2JpdGNvaW4taGFsdmluZy1leHBsYWluZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Halving, Explained - CCN.com",
        "content": "Key Takeaways\n\nBitcoin halving reduces supply, increases scarcity, and potentially leads to price appreciation. Mining rewards decrease, impacting profitability and requiring miners to find more efficient mining methods. Approximately 1.3 million Bitcoins left to be mined after the Bitcoin halving in 2024. HODLing, dollar-cost averaging, research, risk management, and seeking professional advice for guidance are good avenues to speculate on Bitcoin.\n\nWhat Is Bitcoin Halving?\n\nThe Bitcoin network operates through a decentralized system where network participants, known as miners, validate transactions and secure the network by solving complex mathematical problems. In return for their efforts, miners are rewarded with newly minted Bitcoins (BTC).\n\nThe Bitcoin halving cycle is an event in the Bitcoin blockchain that occurs approximately every four years or 210,000 blocks. During a halving event, the reward for mining Bitcoin transactions is reduced by half. This reduction affects the rate at which new Bitcoins are created and ultimately lowers the available supply of new coins.\n\nThe total supply of Bitcoin is limited to 21 million coins. The final halving event is projected to happen in the year 2140, when the maximum supply of 21 million Bitcoins will be reached and the mining reward reduced to zero after that date.\n\nHow Bitcoin halving impacts the supply and mining rewards?\n\nDuring the halving event, the number of new Bitcoins created and rewarded to miners for validating transactions is reduced by half. This reduction is programmed into the Bitcoin protocol and is designed to control the inflation rate and ensure a finite supply of Bitcoins.\n\nWhen a halving occurs, the supply of new Bitcoins entering the market decreases. The Bitcoin halving schedule has moved as follows over its lifespan:\n\n2012: The block reward was reduced from 50 to 25 Bitcoins per block.\n\n2016: Reduced from 25 to 12.5 Bitcoins.\n\n2020: The last Bitcoin halving reduced the reward from 12.5 to 6.25 Bitcoins.\n\n2024: Currently at 6.25 to be reduced to 3.13 Bitcoins approximately in the next Bitcoin halving date scheduled for April 2024.\n\n2140: The final halving year that will result in the 21 million Bitcoin cap being reached. No more Bitcoin will be mined after this date.\n\nAs the supply decreases, this increased scarcity historically results in upward pressure on the price of Bitcoin, as the shock in supply boosts demand. Miners, on the other hand, experience a direct impact on their profitability. Since the block reward is halved, miners receive fewer Bitcoins for their mining efforts. This puts pressure on mining operations, particularly those with higher operational costs, as they need to find more efficient ways to mine or adjust their strategies to maintain profitability.\n\nOverall, Bitcoin halving events play a crucial role in regulating the supply and mining rewards of Bitcoin, with implications for both the market price and the economics of mining.\n\nThe Bitcoin Halving Performance\n\nThe following section will focus on price appreciation of the Bitcoin halving dates history 150 days post halving:\n\n2012\n\nThe first Bitcoin halving took place on November 28th, 2012, reducing the block reward from 50 BTC to 25 BTC. The price of Bitcoin was $12.35 on that day. 150 days later, the price had increased to $127.00.\n\n2016\n\nThe second halving occurred in 2016 on July 9th. Before the halving, the block reward was 25 BTC, which was reduced to 12.5 BTC. The price of Bitcoin on the halving day was $650.63, and it rose to $758.81 150 days later.\n\n2020\n\nThe third halving occurred on May 11, 2020. Before the halving, the block reward was 12.5 BTC, and it was reduced to 6.25 BTC. On the halving day, the price of Bitcoin was $8821.42, and it increased to $10,943.00 150 days later.\n\n2024\n\nAfter the next Bitcoin halving in 2024, the mining reward will be further reduced from the current 6.25 Bitcoins per block to 3.125 Bitcoins per block. This reduction will continue the trend of diminishing the rate at which new Bitcoins are created and introduced into circulation.\n\nIn terms of the total number of Bitcoins left to be mined, it’s important to note that Bitcoin has a finite supply of 21 million coins. Approximately 19.7 million Bitcoins would have been mined by 2024 halving. After the 2024 halving, there will be approximately 1.3 million Bitcoins left to be mined until the maximum supply is reached. To date the impact of the Bitcoin halving on the Bitcoin price has been positive resulting in higher prices. It’s worth noting that the rate of mining will continue to decrease over time, making the remaining Bitcoins progressively harder to mine.\n\nThe Effects Of Bitcoin Halving\n\nThe Bitcoin halving countdown effects can be observed in several aspects of the cryptocurrency ecosystem.\n\nImpact On Bitcoin’s Price And Market Dynamics\n\nBitcoin halving has historically been associated with a bullish trend in the price of Bitcoin. The reduction in the rate of new Bitcoin creation and the sense of scarcity created by halving events can drive up demand and increase Bitcoin’s value over time. However, the market dynamics surrounding Bitcoin are influenced by various factors, including speculation and market sentiment, which can contribute to price volatility.\n\nInfluence On Mining Profitability And Network Security\n\nBitcoin halving affects mining profitability by doubling the costs of mining, forcing less efficient miners to shut down their operations. The reduction in block rewards decreases miners’ revenues, leading to lower energy consumption as miners tighten their belts where necessary. This shift towards more efficient mining operations contributes to network security as only the most cost-efficient miners sustain their operations.\n\nRole Of Bitcoin Halving In Controlling Inflation And Scarcity\n\nBitcoin halving events are designed to control inflation by reducing the rate at which new Bitcoins are created, preserving the purchasing power of the cryptocurrency. Additionally, halving events create a sense of scarcity, which can drive up demand for Bitcoin over time.\n\nMarket Expectations And Speculation\n\nMarket expectations and speculation surrounding Bitcoin halving have been a topic of interest among analysts and experts. Here is some analysis of market sentiments concerning Bitcoin halving:\n\nMarket Expectations And Sentiment\n\nSome crypto analysts, like myself, who have been watching the price of Bitcoin for just under a decade, believe Bitcoin could experience a significant rally leading up to the next halving event, in April 2024, which could propel its price as high as $35,000 – $50,000.\n\nPredictions And Projections\n\nVarious predictions have been made regarding Bitcoin’s price performance before and after halving. According to time analysis data, Bitcoin’s price could reach as high as $98,000 or even $260,000 by October 2025. However, there is also less agreement on the duration and extent of the rally, as well as the potential volatility in the crypto market leading up to halving.\n\nComparison Of Past Halving Events\n\nPrevious halving events have been associated with significant price surges for Bitcoin. Each halving has been followed by a bullish trend in the price of Bitcoin, generating substantial returns for investors. While past performance is not indicative of future results, these historical patterns have contributed to the anticipation and speculation surrounding the next halving event.\n\nStrategies For Navigating The Halving Cycle\n\nStrategies may vary depending on individual risk tolerance and investment goals, here are some general approaches to consider:\n\nLong-term HODLing: One strategy is to “HODL” Bitcoin, which means holding onto it for the long term. This approach aims to capture price appreciation over time, capitalizing on historical patterns of post-halving price rallies. Dollar-cost averaging: Where investors allocate a fixed amount of funds to buy Bitcoin at regular intervals, regardless of price. This approach mitigates short-term price fluctuations and allows for gradual accumulation of Bitcoin over time. Research and analysis: Staying informed and conducting research is crucial during the halving cycle. This involves keeping up with expert opinions, market trends, and historical data for informed decision-making. Analyzing indicators, sentiment, and news can help identify buying or selling opportunities. Risk management and diversification: Setting investment goals, defining risk tolerance, and establishing stop-loss or profit-taking levels contribute to effective risk management. A strategy may be to use the volatility that comes with the halving to find entry and exit points. Active trading and technical analysis: For individuals with the time, expertise, and risk appetite, active trading and technical analysis can be employed during the halving cycle. This strategy involves closely monitoring price charts, identifying patterns, and executing trades based on market movements. It requires a deeper understanding of technical analysis indicators and trading strategies. Utilizing professional advice: Engaging with professional financial advisors or experienced cryptocurrency traders who can provide valuable insights and guidance tailored to individual circumstances. Their expertise and experience can assist in formulating effective strategies and navigating the halving cycle with a personalized approach.\n\nConclusion\n\nTo navigate the future halving events successfully, staying informed and conducting thorough research remains key. Analyzing expert opinions, market trends, historical data, and indicators can help make informed investment decisions. Essentially, it is important to just remain informed at a pace that matches the level of investment made in this space. Additionally, implementing risk management strategies, such as diversification and setting clear goals, is essential for mitigating potential risks and optimizing investment outcomes.\n\nFAQs\n\nWhat is Bitcoin halving?\n\nBitcoin halving is an event that occurs approximately every four years, reducing the mining reward by half and impacting the rate at which new Bitcoins are created.\n\nHow does Bitcoin halving impact supply and mining rewards?\n\nBitcoin halving reduces the supply of new Bitcoins and affects mining rewards, potentially leading to increased scarcity and upward price pressure. Miners receive fewer Bitcoins for their efforts, impacting their profitability.\n\nHow many Bitcoins are left to be mined after the 2024 halving?\n\nAfter the 2024 halving, there will be approximately 1.3 million Bitcoins left to be mined until the maximum supply of 21 million is reached.\n\nWhat are some strategies for navigating the halving cycle?\n\nStrategies for navigating the halving cycle include long-term HODLing, dollar-cost averaging, research and analysis, risk management and diversification, and seeking professional advice for personalized guidance"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTQvbXV0aW55cy1uZXctYnJvd3Nlci1iYXNlZC1iaXRjb2luLXdhbGxldC1vbi1saWdodG5pbmctYXZvaWRzLWFwcC1zdG9yZS1yZXN0cmljdGlvbnMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTQvbXV0aW55cy1uZXctYnJvd3Nlci1iYXNlZC1iaXRjb2luLXdhbGxldC1vbi1saWdodG5pbmctYXZvaWRzLWFwcC1zdG9yZS1yZXN0cmljdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Mutiny’s New Browser-Based Bitcoin Wallet on Lightning Avoids App Store Restrictions - CoinDesk",
        "content": "“Some lesser-known bugs exist, but we generally want to exercise caution when using this wallet for now,” the company states on its blog. “Test the wallet, let us know how it is, and I promise we will surprise you with how fast we fix your bugs and ship new features.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2F1c3RyYWxpYW4tc3BvdC1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "First spot bitcoin ETF application filed under new Australian regulations - Blockworks",
        "content": "An application for Australia’s first fully-licensed spot bitcoin ETF under new regulatory guidelines has been filed with the Australian Securities Exchange (ASX).\n\nBitcoin-focused asset management firm Monochrome, in partnership with Vasco Trustees, announced Friday the lodgement of an updated application for the Monochrome Bitcoin ETF (IBTC) – intended to provide regulated exposure for retail investors.\n\nThe move marks the first instance of a filing for a spot bitcoin ETF on the ASX under a licensing regime featuring crypto provisions, established almost two years ago.\n\nIt also follows a year after Monochrome’s partner Vasco received a financial license to operate crypto spot ETFs in the country.\n\nASIC, the country’s securities regulator, revised its rules for the Australian financial services (AFS) license in October 2021. ASIC sought to promote market transparency amongst crypto firms while enhancing investor protections.\n\nThe rules dictate that institutional support and acceptance of the underlying crypto should exist for a spot ETF to go through. “Reputable” and “experienced” service providers must be willing to support those products.\n\nAs it stands, there are only currently two AFS licensees, including the issuer behind Monochrome’s ETF, with any retail crypto-asset license authorization. Others are listed as wholesale, meaning they are not yet green-lit to offer such products to mom-and-pop investors.\n\nOther Australian attempts at bitcoin ETFs\n\nAnother bitcoin ETF from Cosmos Asset Management’s bitcoin ETF attempted to take the crown as the country’s first last year, spot or otherwise.\n\nThat ETF, however, was established as a fund of funds, offering exposure to one of Canada’s spot bitcoin ETFs managed by Purpose. Global X and 21Shares’ Bitcoin ETF ended up being the first to list in Australia, while Cosmos delisted its offering in November due to lack of interest.\n\nGlobal X 21Shares’s Bitcoin ETF, still trading today, operates using a wholesale-retail feeder fund structure. In this setup, a retail fund invests in a wholesale fund that directly holds bitcoin.\n\nThough the wholesale fund is not subject to the newly instituted regulations specifically aimed at retail funds dealing with digital assets, Blockworks was told.\n\n“What sets us apart from other fund structures is that the Monochrome Bitcoin ETF is authorized under the ‘crypto-asset’ licensing category, which allows the fund to hold bitcoin directly on the fund level,” Jeff Yew, Monochrome CEO, said.\n\nThe executive added he was confident that a positive outcome would be reached.\n\nWhen asked about the poor performance of Australia’s spot bitcoin ETFs, the executive reasoned that Cosmos’ delisting was driven by unfavorable market timing, confusion about the fund’s licensing and operational issues leading to discrepancies between the unit price and bitcoin.\n\nThe current climate presents a “different circumstances and product structure/licensing,” Yew said.\n\nRenewed interest in spot bitcoin ETFs has also hit the US, with major institutions such as BlackRock, Invesco and WisdomTree all filing over the past month.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21lcmdlLW1pbmVkLWxheWVyLTItY3J5cHRvY3VycmVuY3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "L2s rooted in Bitcoin's PoW could bring global scalability to blockchain's core values - Blockworks",
        "content": "Blockchain technology has the potential to revolutionize many industries, but scalability remains a major challenge that must be addressed. The growth of user count and transaction volume continues to demand increased capacity from networks, leading to congestion and high fees on many popular blockchains, rendering them impractical for mass adoption in their current form.\n\nOne now-emerging solution to the scalability problem is being pioneered by Syscoin, an OG crypto project that has been around since 2013 quietly building for the endgame of crypto. The Syscoin team holds the original core values of blockchain—first established by Satoshi Nakamoto—near and dear to their hearts, and they aim to scale them to meet the demands of a global population.\n\nSyscoin is an open-source public project, protocol, and network that combines the best of both worlds from Bitcoin and Ethereum. It was the first blockchain to implement a proof of data availability (PoDA) solution on mainnet, making it a leading contender for the future of blockchain scalability. This approach involves using two separate blockchains in harmony, each with its own strengths and weaknesses. One chain can be optimized for security and decentralization, while the other can be optimized for speed and scalability.\n\nThe Syscoin network also features a number of other innovations that make it well-suited for mass adoption. These include:\n\nMerged mining with Bitcoin: Syscoin is merge-mined with Bitcoin, which means that it shares Bitcoin’s security without requiring any additional energy expenditure.\n\nRollux: Rollux is a layer-2 scaling solution that uses the industry’s only layer-1 proof-of-data availability solution to achieve incredible speeds without sacrificing security and decentralization.\n\nCost-savings: Syscoin has achieved greater efficiency within its ecosystem because it has all been tailor-made by the same team, allowing them to offer more competitive, highly affordable cost-savings for users.\n\nOn June 28, Sycoin formally announced the launch of Rollux on mainnet, a major milestone in the project’s history that delivers on its “promise of speed, decentralization, security, affordability, and scalability,” according to CEO Jagdeep Sidhu.\n\nLoading Tweet..\n\nSyscoin provides the foundation for Rollux to shine\n\nSyscoin is a modular, dual-chain layer-1 that has been designed with security, decentralization, scalability, and interoperability in mind — doing so has resulted in the creation of a blockchain that could bring forth the metaverse, smart cities, and other core pillars of the future of technology.\n\nThe dual-chain layer-1 architecture of Syscoin provides incredible benefits that have built a strong foundation for developments like Rollux to be constructed upon, while also providing users with leading-edge tools of both primary blockchain paradigms (UTXO and EVM).\n\nSyscoin prioritizes developer flexibility while solving for security, network bloat, and speed | Source: Syscoin\n\nSyscoin solves the blockchain trilemma using the “most efficient negotiation” with the least trade-offs, as outlined below:\n\nSecurity\n\nBy merge-mining, Syscoin lends greater utility to the Bitcoin network and further incentivizes miners while adding Bitcoin’s leading security to the Syscoin network. The network is further safeguarded against attacks such as selfish mining through multi-quorum chainlocks. Miners and masternode operators are incentivized to contribute to the network by receiving rewards for providing valuable real-world services. Notably, merge-mining Syscoin with Bitcoin does not incur any additional energy costs.\n\nNetwork bloat\n\nSyscoin’s modular architecture ensures scalability to cater to the needs of global mass adoption. It is specifically designed to optimize blockchain activity, resulting in ultra-efficiency and minimal data footprint. This design leads to increased capacity, higher throughput, and reduced costs across the board, especially with Layer 1 data availability.\n\nSpeed\n\nSyscoin offers a range of tools that ensure speedy asset and smart contract functioning at a minimal cost. These tools are compatible with both blockchain paradigms – Rollux for EVM-based assets or contracts, and Z-DAG for UTXO-based assets. This compatibility enhances the versatility of the system, as users can choose the best blockchain paradigm for their specific needs.\n\nRollux brings the vision of Syscoin to life\n\nRollux is the culmination of years of R&D, providing unprecedented scalability that sets the stage for mass adoption and the future of the Syscoin ecosystem. It uses layer-2 rollups and the industry’s only layer-1 proof-of-data availability solution to achieve incredible speeds without sacrificing security and decentralization. Each transaction costs a small fraction of a cent, so any developer can cheaply scale their dapp.\n\nLoading Tweet..\n\nRollux ensures high levels of security and decentralization through merged mining with Bitcoin, making it the only major rollup to follow this strategy. Its arrival is a monumental event for the blockchain industry, as it effectively tackles the persistent blockchain trilemma, paving the way for future growth and mass adoption while retaining the core principles that underpin the value of blockchain.\n\nPrior to the mainnet launch of Rollux, and supplementing a wide selection of third-party dapps by partners, a cohort of incredible first-party projects from SYS Labs, the company behind Rollux, were already developing on it in order to provide a welcoming ecosystem for new users. Here are a few examples.\n\nLuxy\n\nLuxy is a Multichain NFT marketplace that allows users full functionality with NFTs (create, buy, sell, etc.), and also enables collection owners to set up automatic royalty distribution across stakeholders in the project. The platform is the first multichain NFT marketplace that is green, scalable, cheap, and fast, all while moving forward with a focus on 3D assets to power Web3 video games and the metaverse.\n\nPegasys\n\nPegasys is a DeFi protocol that enables users to earn interest on their crypto assets. It offers a variety of features that make it an attractive platform, including:\n\nHigh yields: Pegasys offers high yields on crypto assets, up to 20% APY.\n\nPegasys offers high yields on crypto assets, up to 20% APY. Low fees: Pegasys charges low fees for transactions, making it a cost-effective way to earn interest on crypto assets.\n\nPegasys charges low fees for transactions, making it a cost-effective way to earn interest on crypto assets. Yield Farming: Pegasys offers a variety of yield farming strategies, including single-asset staking, liquidity mining, and yield farming pools.\n\nPegasys offers a variety of yield farming strategies, including single-asset staking, liquidity mining, and yield farming pools. Liquidity: Pegasys is a liquid platform, meaning that users can easily buy and sell their assets.\n\nPegasys is a liquid platform, meaning that users can easily buy and sell their assets. Staking: Pegasys allows users to stake their SYS tokens to earn rewards.\n\nPali Wallet\n\nPali Wallet launched V2 in early June | Source: Pali Wallet official Twitter\n\nPali Wallet is a web and mobile (iOS & Android), non-custodial wallet similar to MetaMask, but custom-built to make the most of the Syscoin ecosystem, whether NFTs or its utility token, SYS, on any of the three blockchains (UTXO, NEVM, or Rollux).\n\nAdditionally, SYS Labs has a number of products in the works set to make the most of Rollux. So far they have announced:\n\nSuperDapp is an AI-enhanced social dapp akin to Telegram or WeChat with built-in non-custodial wallet, crypto on-ramps and off-ramps, and online retailers like Tryvium Travels. Powered by GPT 4, its AI personal assistant aims to make everyone’s life simpler whether you’re planning a vacation, shopping, or sending crypto to a friend.\n\nan AI-enhanced social dapp akin to Telegram or WeChat with built-in non-custodial wallet, crypto on-ramps and off-ramps, and online retailers like Tryvium Travels. Powered by GPT 4, its AI personal assistant aims to make everyone’s life simpler whether you’re planning a vacation, shopping, or sending crypto to a friend. DAOSYS is SYS Labs’ solution for enterprise. Automate the hyper-efficient allocation of capital to streamline your organization to compete at any scale, from sole proprietor to international conglomerate.\n\nSYS Labs’ solution for enterprise. Automate the hyper-efficient allocation of capital to streamline your organization to compete at any scale, from sole proprietor to international conglomerate. Camada is a regulatory-compliant trading solution for individuals and institutions. Enjoy the promise of Web3 decentralization and self-custody within evolving legal frameworks automatically.\n\nRollux is set to drive the future of Syscoin\n\nWith the mainnet arrival of Rollux now completed, a new benchmark for EVM-rollup solutions has been established, one that surpasses all industry standards in terms of speed, scalability, and affordability. With unmatched throughput capacity and the fastest processing speeds, Rollux offers the most economical user experience, allowing for the lowest transaction fees.\n\nLoading Tweet..\n\nClick HERE to get started using Rollux, and be sure to join the Rollux Discord to connect with other ecosystem builders and participants.\n\nThis content is sponsored by Syscoin.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kZW1hbmQtZHJpdmluZy1iaXRjb2luLXByaWNlLXRvLTEzMGvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Demand is driving the price of Bitcoin to $130K - Cointelegraph",
        "content": "In any market, whether it is fruit and vegetables or financial assets, prices are determined by the intersection of supply and demand.\n\nIf tomatoes are scarce due to a flood, with the same demand, the price in the supermarket will inevitably be higher — just as it will be higher if, with the same supply, twice as many people want to buy tomatoes.\n\nIn the financial market, if supply is unlimited, the price is not changed by demand, as in the case, for example, of a mutual fund.\n\nRelated: Don’t be naive — BlackRock’s ETF won’t be bullish for Bitcoin\n\nIf more subscribers want to buy this fund, more shares are simply issued at something called net asset value (NAV) — that is, the correct value of the fund’s assets.\n\nFor example, let’s suppose a fund has a capitalization of $100 million, made up of 10 million units at a value of $10. If an investor wants to invest $10 million, 1 million units are issued at a value of $10, and the capitalization of the fund becomes $110 million.\n\nIt would be a different story if the shares available were limited to 10 million, so anyone who wanted to buy the shares would have to find someone willing to sell them. In that case, the price might no longer be $10, but it would depend on how much the buyer was willing to pay and how much the seller wanted to earn. It would create a situation in which the price fluctuated according to uneven supply and demand. If an asset was in high demand, obviously, the price could go much higher than the correct price.\n\nBut how can you estimate the correct price?\n\nIn 2021, I published data that attempted to estimate the fair value price of Bitcoin, illustrated in the graph below. It suggested that in June of that year, we had reached a relative maximum for Bitcoin (BTC). (I hoped at the time it would not prove true, but it did.) How had I estimated this value?\n\nThe previous fund example helps us understand the logic behind this estimation.\n\nIf the capitalization of a fund is given by the number of units outstanding multiplied by the NAV, or the price, it is also true that it could also be estimated as the number of investors in the fund per average amount held by each investor.\n\nSo, in the case of Bitcoin, if I would be able to estimate the average amount held in each wallet by\n\nthe number of wallets in circulation, I can also estimate the capitalization of the Bitcoin and, consequently, by dividing by the number of Bitcoin in circulation, derive its price.\n\nLuckily for us, the transparency offered by the blockchain allows us to collect much of this information with a high degree of reliability. For example, the number of Bitcoin addresses with a balance different than zero can be easily tracked just by running a network node.\n\nAs can be seen from the graph, the average amount (United States dollars) in wallets fluctuates due to supply and demand (many wallets hold Bitcoin without ever moving it), so if we take the 90th percentile and the 10th percentile, we can find a range that can lead us to subsequently estimate the price of Bitcoin.\n\nNow, once the growth curve (on a logarithmic scale) of the wallets in circulation has been estimated, it is possible to estimate a range within which the price of Bitcoin should move.\n\nThis model is simple, but the simplicity is its strength: we do not know if a user owns different addresses or if a single address is “owned” by multiple users — as in the case of the cold wallet of an exchange — but we can rely on these relationships especially when compared in terms of large numbers and on a time horizon of a complete price cycle.\n\nRelated: Bitcoin ETFs: Even worse for crypto than central exchanges\n\nFor example, in the last days of a crypto winter — like in recent months — typically, we can detect an increase in withdrawals from crypto exchanges and a reduction in balances held in these centralized platforms. Since keeping crypto assets in third-party custody is usually considered more dangerous, this signal is considered bullish since it shows the preference for investors to hold a long Bitcoin position in the long term rather than holding it in a trading account to take advantage of short-term speculative opportunities.\n\nThis phenomenon is therefore accompanied by an increase of addresses (withdrawal from a few cumulative cold wallets to fill many single addresses controlled by individual persons) and lays the foundations for a cyclical price appreciation also based on the model described in this article.\n\nData from this graph and this model indicate the price of Bitcoin could reach its next ceiling in autumn 2025 at $130,000 — and possibly higher.\n\nAs always, it is important to note that this forecast is not financial advice. It can only be taken as an expected value based on some assumption with a certain degree of confidence. But similar price growth estimates also emerge from other predictive models. The recent surge of interest in this asset class among institutional players like BlackRock — the largest asset manager in the world, which is seeking approval for a spot Bitcoin exchange-traded fund — may indicate that they place some faith in these models.\n\nDaniele Bernardi is the founder of Diaman, a group dedicated to the development of profitable investment strategies. He is also the chairman of Investors’ Magazine Italia SRL and Diaman Tech SRL, and is the CEO of asset management firm Diaman Partners. In addition, he is the manager of a crypto hedge fund. He is the author of The Genesis of Crypto Assets, a book about crypto assets. He was recognized as an “inventor” by the European Patent Office for his European and Russian patents related to the mobile payments field.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzEzL2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1zb2Fycy10by1vbmUteWVhci1oaWdoLWF0LTMxN2stYXMtY3J5cHRvLWludmVzdG9ycy1zYXZvci1wYXJ0aWFsLXJpcHBsZS12aWN0b3J5L9IBmQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzEzL2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1zb2Fycy10by1vbmUteWVhci1oaWdoLWF0LTMxN2stYXMtY3J5cHRvLWludmVzdG9ycy1zYXZvci1wYXJ0aWFsLXJpcHBsZS12aWN0b3J5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Soars to One-Year High at $31.7K as Crypto Investors Savor Partial Ripple Victory - CoinDesk",
        "content": "The agency has accused the two exchange giants of violating securities law and mentioned more than a dozen of the largest tokens in value, including those of smart contracts platforms Cardano (ADA) and Solana (SOL). Those native cryptos dipped sharply in the immediate aftermath, but on Thursday they were skyrocketing with ADA and SOL recently up more than 20% and 17%, respectively. And MATIC, the token of layer 2 blockchain Polygon, which the SEC also flagged, rose more than 16%."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXR1bWJsZXMtYmVsb3ctMzBrLWNyeXB0by0xODU2MjM1OTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Tumbles Below $30K, Crypto Prices Buckle After Altcoin Frenzy on XRP Ruling - Yahoo Finance",
        "content": "Cryptocurrency prices cooled off Friday afternoon after Thursday's major rally on the apparent court victory for Ripple Labs and its XRP token.\n\nBitcoin (BTC), the largest cryptocurrency by market capitalization, fell below $30,000, down more than 5% from a high of about $31,800 at one point on Thursday.\n\nEther (ETH) also sagged from its rousing Thursday to change hands at $1,900, a 4% decline. The second largest crypto in market value had previously soared past $2,000 to hit a three-month high.\n\nXRP was trading at about $0.69, or down 25% from a peak of $0.93 hit yesterday. The token briefly toppled Binance’s BNB as the fourth largest cryptocurrency by market cap, but slipped back to fifth in the ranking after today's price drop.\n\nOther major altcoins were mostly lower, including ADA and MATIC – the tokens of smart contracts platforms Cardano and Polygon, respectively – each off more than 5% Friday afternoon, though still higher over the last two days. The CoinDesk Market Index, a measure of crypto markets performance, was down about 4% over the past 24 hours.\n\n“[Bitcoin is] still trading like an instrument in consolidation,” wrote Craig Erlam, senior market analyst for foreign exchange market maker Oanda, in an email to CoinDesk. The break above $31,000, he said, doesn't seem \"particularly convincing at this stage.\"\n\nThe sudden drop in prices caught traders who bet on higher prices off-guard, with $155 million of long positions liquidated, according to CoinGlass data. This was the largest long liquidation in a month.\n\nUPDATE (Jul. 14, 19:20 UTC): Updated prices through the story. Added liquidation data."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnJpc2submV0L2luc2lnaHQvY3J5cHRvY3VycmVuY3kvNzk1NzIyNC9hLWV1cm9wZWFuLWxpcXVpZGl0eS1wb29sLWZvci1iaXRjb2luLWZ1dHVyZXMtaGFzLWFycml2ZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "A European liquidity pool for bitcoin futures has arrived - Risk.net",
        "content": "Eurex’s new FTSE Bitcoin Index Futures contracts can help investors remove regulatory uncertainty from their crypto investments\n\nEurex’s new FTSE Bitcoin Index Futures contracts can help investors remove regulatory uncertainty from their crypto investments\n\nAs jurisdictions worldwide continue to grapple with how best to provide regulatory clarity for trading digital assets, traditional exchanges are stepping up to provide investors with ways to gain bitcoin exposure, without being left vulnerable.\n\nEvents of the past year – which resulted in losses across crypto and traditional finance – highlighted that where you trade is just as important as what you trade.\n\nOne year ago, it wouldn’t have been unusual for crypto investors to trade on an unregulated platform – based in an offshore jurisdiction – offering integrated market‑making, clearing, custody and even borrowing/lending services. Now, however, investors have become more cautious.\n\nAgainst this backdrop, Eurex, Europe’s leading derivatives exchange, partnered with leading global index provider FTSE Russell and institutional-grade crypto market data provider Digital Asset Research (DAR) to launch futures on the FTSE Bitcoin Index in EUR and USD. The new futures contracts provide investors with a solution to gain cryptocurrency exposure through a safe and trusted framework.\n\n“The high-profile bankruptcies of 2022 prompted market participants to re-evaluate how they’re approaching crypto markets, who they want to interact with and the level of transparency they want over trading operations,” says Rafael Zanatta, crypto and equity index sales, Europe, the Middle East and Africa, at Eurex. “Many firms within the ecosystem were not focused on counterparty risk, as the market operates without the same amount of regulation and risk management controls currently present in traditional finance markets.”\n\n“Having a centrally cleared product in a familiar jurisdiction is an increasingly attractive proposition to the institutions we spoke to, so we created a product to meet that demand,” adds Nicolae Raulet, crypto derivatives product manager at Eurex. “It was for the same reason we opted for a cash‑settled contract with an established benchmark regulation [BMR]-compliant index.”\n\n“Our aim in launching FTSE Bitcoin Index Futures at Eurex was to give investors the option to trade through a regulated venue in a trusted jurisdiction with the same risk management systems that operate in asset classes such as equities and fixed income” Rafael Zanatta, Eurex\n\n\n\nSeamless access to crypto\n\nAs investors well know, the crypto product landscape is diverse and dynamic. Products come and go at a fast pace, which requires a lot of diligence on the part of the investor – legal advice to understand the prospectus where available, alongside technical advice around replication, collateral, risk and insurance, to name a few. However, listed derivatives products, such as Eurex’s FTSE Bitcoin Index Futures, operate under the same umbrella as equity index futures at the exchange, which means investors have clarity and certainty on how these contracts behave under various circumstances.\n\nThe underlying FTSE Bitcoin Index reflects the settlement price of bitcoin as determined by the FTSE DAR Reference Price. Liquidity is supported by order book and over-the-counter (OTC) liquidity providers. The contracts, launched on April 17, represent a major milestone in the exchange’s ambitions to offer safe and trusted access to cryptocurrencies in a regulated market environment.\n\nThe contracts were designed to cater to a wide range of global investors, offering a one‑bitcoin multiplier. Initial margins are around 25%. The cash‑settled contracts trade 21 hours a day, Monday to Friday and settle at 17:00 CET on the last Friday of the month. AA rated central counterparty Eurex Clearing manages all trades, thereby minimising counterparty risk and adding an additional layer of security.\n\nEurex’s FTSE Bitcoin Index Futures adhere to Europe’s BMR and have regulatory approval from Germany’s Federal Financial Supervisory Authority.\n\nGiven the strong regulatory framework under which futures exchanges operate, many investors view listed derivatives as the safest way to add bitcoin to a portfolio.\n\n“Market participants that directly invest into cryptocurrencies have to hold the assets in cold or hot wallets, via custody providers or self‑custody – but holding the assets comes with risks: risk of hacks, risk of losing or forgetting your private key and the risk of counterparty default – basically, the investor holds the entire risk,” says Zanatta.\n\nWith an index futures product such as Eurex’s, these risks are eliminated: investors buy exposure to bitcoin – not bitcoin itself – and that exposure is guaranteed through a central clearing mechanism. “By design, crypto-listed index futures follow the exact same setup as any other index-based futures contract. The investor can take a view on where bitcoin will go, but then leaves the complexities of trading and the underlying hedging with the specialist firms that will make that bridge between the two worlds and offer you the price for such exposure,” explains Raulet. “Moreover, through Eurex, investors can gain exposure via existing trading accounts without the need for costly additional infrastructure setup.”\n\n“The clearing house backs our index futures contract, and you receive your cash settlement on expiry. You don’t need to worry about who the asset’s custodian is or about anyone lending your collateral, and there is no management fee either,” adds Zanatta. “Institutional investors already know how such contracts look and work, so it’s a simple option for those looking to diversify their portfolios.”\n\n“By design, crypto-listed index futures follow the exact same setup as any other index-based futures contract” Nicolae Raulet, Eurex\n\nGrowth opportunities\n\nAs the first European exchange to offer bitcoin index futures, Eurex understands that bitcoin liquidity is currently concentrated outside of the European time zones. The exchange sees this as an opportunity to develop a European liquidity pool for bitcoin futures. “Although our futures contracts are available worldwide, our customers have lamented they have had difficulty getting significant trades done during European hours. We want to change that,” says Zanatta.\n\nRecently, the Eurex FTSE Bitcoin Index Futures also received approval from the US Commodity Futures Trading Commission. Trading for US‑based investors began on May 29, 2023. US investors can now trade these contracts directly on Eurex and benefit from trading and hedging opportunities.\n\nEurex has a growing number of liquidity providers streaming prices on-screen, as well as committed participants for block trade liquidity. “What has been interesting about the types of providers we have is that they are traditional exchange members, rather than crypto natives. They’re active in the various asset classes we offer, but also have specialised crypto desks connected to crypto spot markets,” says Zanatta.\n\n“We also have interest from crypto-native firms that understand how several investors prefer to trade with the safeguards and guarantees of a regulated exchange, rather than OTC,” he adds.\n\n“The plan for the next few months is to build average daily volume for both the EUR- and USD-denominated contracts, and to introduce options on the same indexes. These too will comprise all the benefits available with the futures contracts – namely, a way to gain exposure to bitcoin through a safe and trusted framework,” says Raulet.\n\nThe index rule book has strict vetting criteria that FTSE Russell and DAR apply to determine the list of participating exchanges. It also has clear rules on eligibility, or loss thereof, from exchanges contributing to the price. “We are in close dialogue with our partners at FTSE on the constantly evolving landscape of crypto spot markets, and trust their strong governance and reputation to apply their rule books, and observe all appropriate restrictions that may impact particular crypto exchanges,” adds Raulet."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXRha2VzLWFpbS1hdC1hLW5ldy0yMDIzLWhpZ2gtYnV0LWRlcml2YXRpdmVzLWhpZ2hsaWdodHMtYmVhcnMtYWR2YW50YWdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin price rallies to $31.8K, but derivatives data highlights BTC bears' advantage - Cointelegraph",
        "content": "This July 14 Bitcoin weekly options expiry holds the potential to be a significant turning point for market sentiment, potentially leading to a breach below the crucial $30,000 support level.\n\nDespite the initial bullish surge triggered by the spot Bitcoin exchange-traded fund (ETF) requests, the recent macroeconomic data has not been favorable for risk-on assets.\n\nAnalyzing market sentiment is crucial in assessing the chances of Bitcoin (BTC) holding above $30,000 by July 14. This level acts as a threshold that could provide bears with a perfect opportunity to profit up to $120 million through the weekly option expiry.\n\nFalling U.S. inflation is detrimental to Bitcoin in the short term\n\nIn June, the Consumer Price Index in the United States registered at 3.0%, the lowest level since March 2021. This was primarily due to a 16.7% decline in the energy index. While this indicates a slowdown in inflation, it remains above the Federal Reserve’s target of 2%, which is detrimental to Bitcoin, as higher interest rates incentivize investors to pivot into fixed-income investments.\n\nOne could argue that, in the short term, the lowering of inflation reflects a successful intervention by the Fed and could be viewed as a positive factor for Bitcoin’s bullish momentum. However, on July 12, the U.S. Dollar Index, which measures the dollar’s strength against major foreign currencies, reached its lowest level in 14 months.\n\nIn essence, investors’ confidence in the Fed’s ability to prevent a recession seems to be waning. Wharton professor Jeremy Siegel suggested that the U.S. economy is “progressing smoothly,” with consumers seemingly unaffected by higher borrowing costs. However, Siegel believes that consumers are currently utilizing the last of their cash reserves for travel and enjoying the summer.\n\nETF approval odds decreased after remarks from the SEC\n\nThe most compelling argument for the bulls to support further gains and sustain Bitcoin's trading price above $31,000 on July 14 lies in the potential approval of the spot ETF. However, recent statements by Gary Gensler, chair of the U.S. Securities and Exchange Commission (SEC), have been unfavorable.\n\nGensler noted on July 12 that crypto exchanges often offer conflicting services, including trading directly against their own clients. Furthermore, he cautioned about the limited risk monitoring practices employed by crypto platforms, leaving them vulnerable to market manipulation, such as wash trading.\n\nOver the years, the SEC has rejected multiple requests for spot Bitcoin ETFs, citing significant pricing occurring on unregulated trading platforms. The regulator has also expressed concerns about the ability of ETF providers to protect investors from fraudulent and manipulative acts.\n\nBearish instruments were outnumbered but better positioned\n\nBitcoin’s price traded above $31,000 on July 4, fueling bullish bets by traders using options contracts. Another failed attempt to break the resistance on July 6 explains why bulls have concentrated their bets on Bitcoin prices trading above $31,000.\n\nDeribit Bitcoin options aggregate open interest for July 14. Source: Deribit\n\nThe 0.53 put-to-call ratio reflects the difference in open interest between the $470 million call (buy) options and the $250 million put (sell) options. However, the outcome will be lower than the $720 million total open interest since the bulls were overconfident.\n\nFor example, if Bitcoin’s price trades at $30,500 at 8:00 am UTC on July 14, only $30 million worth of call options will be accounted for. This distinction arises from the fact that the right to purchase Bitcoin at $31,000 or $32,000 becomes invalid if BTC trades below those levels upon expiration.\n\nRelated: First Bitcoin futures contract debuts in Argentina\n\nBitcoin bears can flip the tables and bag a $120 million profit\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on July 14 for call (buy) and put (sell) instruments varies depending on the expiration price. The imbalance favoring each side constitutes the theoretical profit:\n\nBetween $28,000 and $30,000: 200 calls vs. 4,100 puts. The net result favors the put (sell) instruments by $120 million.\n\n200 calls vs. 4,100 puts. The net result favors the put (sell) instruments by $120 million. Between $30,000 and $31,000: 1,000 calls vs. 1,100 puts. The net result is balanced between the call and put instruments.\n\n1,000 calls vs. 1,100 puts. The net result is balanced between the call and put instruments. Between $31,000 and $32,000: 4,200 calls vs. 200 puts. The net result favors the call (buy) instruments by $125 million.\n\n4,200 calls vs. 200 puts. The net result favors the call (buy) instruments by $125 million. Between $32,000 and $33,000: 6,400 calls vs. 0 puts. The net result favors the call (buy) instruments by $210 million.\n\nTaking into account the latest macroeconomic data that supports more interest rate hikes and Gensler’s negative comments about exchanges’ ability to provide the basis for a spot Bitcoin ETF approval, bears have an opportunity to break below the $30,000 price support and secure a $120 million profit during the upcoming weekly options expiry.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNwZW5kaW5nLW1ldHJpYy1idGMtcHJpY2UtYnVsbC1tYXJrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin spending copies history as metric flags '1st stage bull market' - Cointelegraph",
        "content": "Bitcoin (BTC) long-term holders are coming back to life as BTC price increases, the latest analysis confirms.\n\nIn a tweet on July 13, Philip Swift, creator of on-chain data resource LookIntoBitcoin, revealed classic bull market behavior among “older” BTC investors.\n\nValue Days Destroyed Multiple prints BTC price bull signal\n\nBitcoin’s current price cycle may be dividing opinions when it comes to how high BTC’s price could go, but one thing is for sure: Hodler behavior is the same.\n\nThanks to BTC/USD more than doubling in 2023, on-chain spending velocity is up, indicative of profit-taking activity.\n\nUploading a chart of the Value Days Destroyed (VDD) Multiple, Swift suggested that the current cycle barely differs from all previous ones in this regard.\n\n“Increased onchain spending volume showing where we are in the cycle right now,” part of an accompanying Twitter commentary stated.\n\n“History doesn’t repeat but it often rhymes.”\n\nVDD is based on the extant Coin Days Destroyed (CDD) metric, which measures periods of inactivity each time an amount of BTC moves on-chain. It takes CDD data and factors in the current BTC price, and its multiple then compares the 30-day result with the 365-day average.\n\n“It is able to highlight when older coins begin to rapidly enter the market to be sold,” Swift explains in an instructional guide on LookIntoBitcoin.\n\n“This typically happens when longer-term participants look to take profits as price accelerates up in major bull market cycles.”\n\nThe VDD Multiple currently measures 1.32, narrowly behind its 2023 peak of 1.37 seen in April. For Swift, this is a telltale sign of a “1st stage bull market.”\n\nBitcoin VDD Multiple annotated chart. Source: Philip Swift/Twitter\n\nReacting, Checkmate, lead on-chain analyst at data firm Glassnode, called the findings “remarkable.”\n\n“It is remarkable how consistent the cycles are. Humans reacting the same, given similar stimulus,” he responded.\n\n“This time is indeed, not different.”\n\nNot just Bitcoin diamond hands\n\nGlassnode data, meanwhile, underscores how tempting it might be for various hodler classes to cash out at current prices.\n\nRelated: Bitcoin bulls ‘have work to do’ after XRP price spikes 104%\n\nBitcoin’s market-value-to-realized-value (MVRV) ratio for long-term and short-term holders (LTHs and STHs, respectively) shows both types of investors considerably in the black.\n\nLTH coins — defined as coins dormant for at least 155 days — are on aggregate worth 1.52 times more than when they last moved. For the STH equivalent, the number is 1.12.\n\nPreviously, Cointelegraph reported on the increasing sway that STHs have over BTC price action.\n\nBitcoin LTH, STH MVRV vs. BTC/USD chart. Source: Glassnode\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi1ldXJvcGUtcy1maXJzdC1zcG90LWJpdGNvaW4tZXRmLWV5ZXMtMjAyMy1kZWJ1dC1hZnRlci1hLXllYXItbG9uZy1kZWxhedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Europe's first spot Bitcoin ETF eyes 2023 debut after year-long delay - Cointelegraph",
        "content": "Europe’s first spot Bitcoin (BTC) exchange-traded fund (ETF) is set to debut later this year after a long delay. The Bitcoin ETF by Jacobi Asset Management — a London-based multi-asset investment platform — was set to debut on the Euronext Amsterdam exchange in July 2022.\n\nHowever, unprecedented market conditions caused by the collapse of the Terra ecosystem in May 2022, as well as the FTX collapse in November, forced the asset manager to postpone the listing. The Jacobi Bitcoin ETF received approval from the Guernsey Financial Services Commission (GFSC) to launch its Bitcoin ETF in October 2021.\n\nThe asset manager told the Financial Times that it has decided to launch the ETF now because it has seen a gradual shift in demand compared with 2022. The asset manager told Cointelegraph that it is still assessing the launch and will share a date soon.\n\nThe Jacobi Bitcoin ETF is a centrally cleared crypto-backed financial instrument with custody supported by Fidelity Digital Assets, a major shift from the usual exchange-traded notes (ETNs). In Europe, all crypto-backed traditional financial instruments were structured as ETNs, rather than funds.\n\nThe major difference between an ETN and an ETF is that the ETF shareholder owns a portion of the fund’s underlying assets, while ETN investors own debt security. ETFs, unlike ETNs, cannot be leveraged or use derivatives, which could otherwise lead to market manipulation risks.\n\nRelated: Grayscale resolves lawsuit with Fir Tree over proposed changes to Bitcoin Trust\n\nWhile Europe approved its first spot Bitcoin ETF in October 2021, the United States Securities and Exchange Commission (SEC) has rejected all spot Bitcoin ETFs to date. However, in 2023 alone, nearly half a dozen institutional giants, including the likes of BlackRock and Fidelity, have filed fresh spot Bitcoin ETF applications in hopes of becoming the first U.S approved spot BTC ETF. The SEC had already approved a couple of futures Bitcoin ETFs in 2021.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzEzL3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1kb2dlY29pbi1hbGwtcG9wcGVkLW9uLXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin All Popped on the Ripple Ruling - The Motley Fool",
        "content": "What happened\n\nThe crypto market was on fire on Thursday afternoon after a judge ruled that Ripple (XRP 0.07%) is not a security (in most cases).\n\nThe U.S. Securities and Exchange Commission (SEC) has been in a battle against cryptocurrencies this year, but the first case to actually make it to court and nearly to trial is the SEC's suit against Ripple, which was filed in December 2020. There are still questions about how this applies to other tokens and whether the ruling will hold up, but for now, it's a huge win for the industry.\n\nAltcoins are popping the most today, but the big tokens are making nice gains as well. Bitcoin (BTC 0.05%) is up 4.7% in the last 24 hours as of 4 p.m. ET, Ethereum (ETH -1.55%) has risen 7.1%, and Dogecoin (DOGE 9.09%) is up 7%.\n\nSo what\n\nThe judge's ruling concluded that Ripple was a security when it was sold to institutional investors, who they said were speculating on an asset that they would then sell. But it was not a security on the secondary market because a buyer or seller on the secondary market had no way of knowing who was getting their money.\n\nIt's hard to say that this fully clarifies what is and isn't a security in the crypto industry, and it's likely the ruling will be appealed, but for now, the secondary sale of cryptocurrencies appears to be legal. This should help the ongoing trading of existing tokens, and Bitcoin, Ethereum, and Dogecoin are clear leaders from a market capitalization standpoint.\n\nWhile the secondary trading of cryptocurrencies is legal -- according to this ruling -- the initial sales to institutional investors may not be. That question will go to trial, but that will include hedge funds and venture funds that bought these assets. And it's not even clear how that trial will turn out.\n\nNow what\n\nCrypto investors have been looking for some kind of clarity in the U.S. and clearly jumped on it today. However, this is only a district court ruling, and it's the first of many potential rulings. The SEC continues to go after Coinbase (COIN -1.72%), in particular, and dozens of tokens are involved in that case.\n\nI do think this will push both the courts and lawmakers to act to bring even more clarity to the market. Taking loss after loss in court isn't a good look, and almost everyone in the industry is pushing for clarity about what is and isn't a security in the digital world.\n\nThis clarity could be good for the value of Bitcoin and Dogecoin, which right now are viewed largely as stores of value or speculative assets, which seem to pass regulatory muster, at least in the secondary market. Ethereum may benefit both from secondary trading and clarity over what can be built with NFTs or other blockchain tools.\n\nAt least for today, the crypto market is cheering a judge's ruling, but with the ups and downs we have seen the last few years, the cheering might not last for very long."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LndlYXJlaW93YS5jb20vYXJ0aWNsZS9tb25leS9iaXRjb2luLWF0bS1zY2FtLWNsaXZlLXBvbGljZS1pb3dhLXdvbWFuLzUyNC05NzM4MzVmMS0wZDE3LTRlY2ItYTAzOS1kZTUwODM0ODliMTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Clive woman scammed out of nearly $7000 in bitcoin ATM scam | weareiowa.com - Local 5 - weareiowa.com",
        "content": "The Clive Police Department says because the money was sent overseas, recovering it is very unlikely.\n\nCLIVE, Iowa — Clive resident Naomi Bloom was awoken last Friday by a phone call from an unknown number.\n\n\n\nBloom was told she had been subpoenaed to be an expert witness in a federal case, and was threatened with criminal action for not showing up.\n\n\n\n“That felt ostensibly possible to me because I’ve been called as an expert witness before,” said Bloom, a clinical social worker and therapist.\n\n\n\nTwo men were on the other line, claiming to be detectives with the Polk County Sheriff’s Office. They knew everything about Bloom, from her profession to the number of children she had.\n\n\n\nDemanding thousands of dollars of so-called bond money, Bloom frantically got out of bed and obeyed the demands of the callers.\n\n\n\nBut it was all a lie.\n\nBloom was the target of a careful, thought-out AI scam designed cheat her out of her own money.\n\n\n\n“The call came from the Polk County Sheriff’s Office,” Bloom said.\n\n\n\nScammers, however, are able to spoof phone numbers to appear as legitimate contacts when calling someone.\n\n\n\nThe call was found to be an imposter scam, the most reported fraud category in Iowa, according to the FTC. These scams are now using AI software to mimic the voices of others and push victims into a panic.\n\n\n\n“You have these scammers that want to keep you off-guard, unbalanced, scared,” said Clive PD Detective Maurio Coleman, who has been investigating the case alongside Polk County sheriffs.\n\n\n\n\n\nBloom was told by the scammers to go to her bank and withdraw cash - $5,100, to be exact.\n\n\n\nWith the scammers still on the phone, she went to a Bitcoin Depot ATM machine in Des Moines and began feeding in the cash.\n\n\n\nWhen Bloom pushed back, she was met with threats.\n\n\n\n“They started to threaten my children. And as a single mother, that’s really scary,” she said.\n\n\n\nMoney from her daughter’s college savings was down the drain."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy94cnAtbGVhZHMtZ2FpbnMtdG9wLTEwLTEwMTQ1MDMyMi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "XRP leads gains as Bitcoin, top 10 cryptos rally after Ripple's win against U.S. SEC - Yahoo Finance",
        "content": "Bitcoin and all other top 10 non-stablecoin cryptocurrencies gained in Friday afternoon trading in Asia. The gains come after Ripple Labs achieved a partial victory on Thursday when a U.S. court ruled that Ripple Labs’ programmatic sales of the XRP cryptocurrency did not qualify as the offer and sale of investment contracts. The U.S. Securities and Exchange Commission (SEC) in 2020 accused Ripple of offering XRP as an unregistered security. The judgment marks a significant milestone in the three-year legal tussle between the San Francisco-based payments firm and the U.S. regulator. XRP rallied over 62% in the past 24 hours.\n\nSee related article: What is XRP and what is Ripple?\n\nXRP leads crypto market rally\n\nBitcoin, the world’s largest cryptocurrency by market capitalization, gained 2.46% to US$31,115 in 24 hours to 4 p.m. in Hong Kong, and increased 3.69% on the week, according to CoinMarketCap data. Ether strengthened 6.46% to US$1,991 and rose 7.26% in the last seven days.\n\nBoosted by the ruling on the SEC-Ripple case, XRP led a rally in the crypto market on Friday, rising 62.71% to US$0.7674 and bringing its weekly gains to 65.47%.\n\nIn a summary judgment on Thursday, New York Southern District Court Judge Analisa Torres ruled that Ripple’s programmatic sales of the XRP token on public exchanges do not constitute securities, but the verdict also said that Ripple’s XRP sales to institutional investors violated securities laws.\n\nThe SEC first sued the San Francisco-based financial technology firm in 2020 on the grounds that XRP constituted a security.\n\nRipple’s chief legal officer Stuart Alderoty called the judgment “a huge win” in a tweet on Friday. “The only thing the Court found constitutes an investment contract is past direct XRP sales to institutional clients. There will be further court proceedings only on these institutional sales per the Court’s order,” Alderoty said.\n\nMaybe we can now start a rational conversation about crypto regulation in this country. — Stuart Alderoty (@s_alderoty) July 13, 2023\n\nCoinbase, the largest crypto exchange in the U.S., said in a tweet that it is reopening trading of XRP. Other crypto exchanges like Crypto.com also tweeted that it is enabling XRP trading, while Kraken Pro said on Twitter that XRP is “back in full-trading mode” on its platform.\n\nStory continues\n\n“This can be considered a win because XRP is one of the more centralized foundations, with a prominent figurehead who offered standard sales via exchanges, and formal distribution programs. If XRP is not considered a security, nearly nothing sold via exchanges is,” Vincent Chok, CEO of Hong Kong-based consultancy First Digital, told Forkast in an emailed response.\n\n“If the court states that XRP is not a security, it strengthens the case for many other tokens that the SEC considers a security. The SEC has tried the regulation by enforcement tactic, but this ruling might make it think twice about its past approach,” Chok added.\n\nHowever, according to Ben Caselin, vice president and chief strategy officer at Dubai-based crypto trading platform MaskEX, the court’s ruling might be cause for some relief among investors, but this tug-of-war is far from over.\n\n“Due to their peer-to-peer and digital native nature, cryptocurrencies do not easily allow for regulation in the traditional sense, but, going forward, if projects and companies who issue tokens want to deal with the general public and institutional investors, they might want to practice more caution compared to a few years ago,” Caselin told Forkast in an emailed response.\n\nXRP’s 24-hour trading volume soared 1,743.38% to US$13.27 billion, while its market capitalization strengthened 64.52% to US$40.85 billion.\n\nThe verdict on the Ripple vs. SEC lawsuit also boosted prices of all top 10 non-stablecoin cryptocurrencies.\n\nCardano’s ADA token gained 22.88% to US$0.3526, bringing its weekly gains to 25.91%. Solana increased 31.98% to US$28.75 and is up 47.96% on the week. Polygon’s Matic token strengthened 17.96% to US$0.8555 in 24 hours and 29.4% on the week.\n\nThe three cryptocurrencies saw double-digit losses in early June when the SEC labeled the tokens as financial securities in its lawsuits against crypto exchanges Coinbase and Binance.US.\n\n“The resolution of the lawsuit could lead to increased investor and market confidence in XRP [which] could attract new investors and drive greater liquidity and trading volume for XRP,” Minal Thukral, executive vice-president of growth and strategy at CoinDCX, India’s first crypto unicorn, said in an emailed statement on Friday.\n\nThe total crypto market capitalization rose 5.59% to US$1.25 trillion, while market volume increased 131.39% to US$70.53 billion in the past 24 hours.\n\nForkast 500 NFT index gains\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the main Forkast 500 NFT index edged up 0.27% to 2,706.85 in 24 hours to 6.45 p.m. in Hong Kong.\n\nForkast’s Ethereum and Solana indices also gained in the same period.\n\nTotal NFT sales volume on Ethereum blockchain gained 8.95% in the past 24 hours to US$17.07 million, according to data from CryptoSlam.\n\nBy collections, Ethereum-based Bored Ape Yacht Club recorded the highest 24-hour sales volume, rising 2.76% to US$2.09 million.\n\nNFT sales volume on the Bitcoin network declined 22.49% in 24 hours to US$2.68 million. Bitcoin’s $FRAM BRC-20 NFTs ranked the second-highest among collections.\n\n“CryptoPunks are gaining traction after Twitter users started speculating that a new cryptocurrency would be launched by an influencer named Pauly, who has been active in the Phunks community,” according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nI AM creating a token.\n\n\n\nThere is no next $pepe.\n\n\n\nBe early. You will thank me later. pic.twitter.com/bCUE7Sh6bJ — PAULY (@Pauly0x) July 9, 2023\n\n“Pauly is known as a co-defendant in the Yuga Labs vs Ryder Rips BAYC collection lawsuit, and also as potentially a co-creator of Yuga Labs’ $APE Coin,” Petscher added.\n\nEthereum-based CryptoPunks gained 9.01% in sales volume to US$927,929 in the past 24 hours, ranking it the fourth biggest collection.\n\nAsian equities, U.S. futures gain; European bourses mixed\n\nImage: Envato Elements\n\nAsian stock markets mostly rose on Friday after the People’s Bank of China deputy governor Liu Guoqiang said that China’s central bank will step up “countercyclical adjustments” to aid recovery of the world’s second-largest economy. The central bank would use monetary policy tools such as the reserve requirement ratio, medium-term lending facility, and open market operations to boost economic growth.\n\nChina’s Shanghai Composite, Hong Kong’s Hang Seng, South Korea’s Kospi strengthened while Japan’s Nikkei dropped.\n\nIndia’s annual wholesale price index-based inflation declined for the third straight month to 4.12% in June compared to 3.48% in May. The decline was mainly due to lower prices of food products, mineral oils, crude petroleum and natural gas.\n\nIndia’s Sensex index at the Bombay Stock Exchange gained 0.77% at the close of trading hours on Friday.\n\nEarlier this month, Goldman Sachs said the world’s most populous country would become the world’s second largest economy by 2075, surpassing not only Japan and Germany but also the U.S.\n\nAs India’s population of 1.4 billion people becomes the world’s largest, its GDP is forecast to expand dramatically. Goldman Sachs Research projects India will have the world’s second-largest economy by 2075. https://t.co/CFFM0JsmEL pic.twitter.com/xHruyuSFex — Goldman Sachs (@GoldmanSachs) July 6, 2023\n\nU.S. stock futures strengthened as of 8 p.m. in Hong Kong, with the Dow Jones Industrial Average futures, the S&P 500 futures, and the Nasdaq 100 Futures all in the green.\n\nThe U.S. producer price index (PPI) released Thursday recorded a 0.1% year-on-year rise for June, down from 0.9% in May. The June figure is the smallest increase since August 2020. The data is also well below analyst expectations of a 0.4% annual increase.\n\nThe latest U.S. consumer price index, a key inflation indicator, slowed to 3% in June, beating market expectations of 3.1%. It was also the smallest annual increase since March 2021, and brought inflation rates closer to the Federal Reserve’s target of 2%.\n\nJeff Feng, co-founder of Sei Labs – a contributor to the Sei blockchain focused on trading – and a former Goldman Sachs analyst said that cooling inflation will be a boost to crypto markets.\n\n“This economic thaw doesn’t merely spell relief from the spiraling prices but is also poised to breed bullish sentiment across markets, especially for risk-on assets like cryptocurrencies. As the fear of inflation recedes, investors, buoyed by the healthier economic outlook, may be more inclined to channel their resources toward such assets,” Feng wrote.\n\nThe Federal Reserve meets on July 26 to discuss its next move on interest rates which are currently between 5% and 5.25%.\n\n“We will still see a rate hike in July. The debate will intensify though, and we do not expect a move in September,” Keith Wade, chief economist and strategist at Schroders, said in an emailed statement on Friday.\n\n“The next move should prove to be the last hike in this cycle with cuts following thereafter,” Wade added.\n\nEuropean bourses traded mixed on Friday as the benchmark STOXX 600 gained while Germany’s DAX 40 dropped during Friday afternoon trading hours in Europe.\n\n(updates with equities section.)"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZWxlZ3JhbS13YWxsZXQtYm90LWVuYWJsZXMtaW4tYXBwLXBheW1lbnRzLWluLWJpdGNvaW4tdXNkdC1hbmQtdG9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Telegram Wallet bot enables in-app payments in Bitcoin, USDT and TON - Cointelegraph",
        "content": "The cryptocurrency payment industry continues to evolve with a new cryptocurrency payment option coming to crypto-friendly Telegram messenger.\n\nWallet, a Telegram bot allowing users to buy and sell cryptocurrencies like Bitcoin (BTC), has launched a crypto payment solution based on The Open Network (TON) blockchain.\n\nThe new Wallet Pay service provides crypto payment transactions between users and retail businesses, enabling direct payments within the Telegram interface.\n\nAnnouncing the news on July 13, Wallet told Cointelegraph that the new payment feature is immediately available within all jurisdictions supported by the wallet service.\n\nAt the moment, this list of supported jurisdictions supported by Wallet Pay includes most countries except for the United States and those blacklisted by the Financial Action Task Force, a spokesperson for Wallet said. For example, Wallet Pay doesn’t serve countries like Iran, Myanmar and North Korea.\n\nAs some countries of Wallet bot’s operation do not allow residents to pay using cryptocurrency, the wallet service puts compliance responsibility on local businesses. The Wallet representative stated:\n\n“Businesses should decide if they are allowed to do business within their jurisdiction before applying to make use of Wallet Pay.”\n\nThe list of jurisdictions that do not allow their residents to pay for products and services with crypto includes countries like Russia, Indonesia, Vietnam, Iran, Egypt and others. Russia, which officially banned domestic crypto payments in 2020, is the second-biggest country in terms of Telegram downloads after India, according to data from Statista. Indonesia, Egypt and Vietnam are also among the top 10 countries of Telegram app downloads.\n\nTop 10 countries by Telegram app downloads. Source: Statista\n\nWallet Pay’s representative noted that the platform isn’t aware of what merchants would be first to test out its payment feature because the firm hasn’t launched the Know Your Business (KYB) procedure yet. The spokesperson said:\n\n“We have had a few hundred requests collected by our support team, but we did not start the KYB procedure with these requests prior to launch, so we don’t yet know who will be the first to implement the feature.”\n\nThe representative also stressed that the firm runs its operations independently from Telegram. The Wallet bot and application are based on the Telegram Web Apps open protocol, which allows developers to create their own apps and services on Telegram.\n\nThe payment service is available through a dedicated Telegram bot or the official Wallet Pay website. Users should be careful to ensure they validate the source of the bot if they consider trying it.\n\nRelated: Tourists are unhappy with crypto payments ban in Bali\n\nWallet’s new payment feature supports three cryptocurrencies that are currently featured on its wallet service. These cryptocurrencies include Bitcoin, Tether (USDT) and Toncoin (TON).\n\nUnlike self-custodial or noncustodial wallets like MetaMask, the Telegram Wallet bot operates a custodial wallet with its own fee structure.\n\n“As of today, Wallet is a custodial solution,” the spokesperson told Cointelegraph. The representative added that fees for crypto payments will “range from 1% to 3% during the beta period.”\n\nAccording to the Wallet Support data, the Telegram Wallet bot also currently takes a 0.0004 BTC ($12) commission for withdrawing the cryptocurrency from its custodial wallet. USDT and TON’s withdrawal fees amount to 2 USDT and 0.05 TON, respectively.\n\nMagazine: Asia Express: China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTQtanVseS0yMDIzL2FydGljbGVzaG93LzEwMTc1NjEwNC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE0LWp1bHktMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAxNzU2MTA0LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin surges above $31,000; XRP skyrockets over 68% on court ruling - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi1zZWFsLW9mLWFwcHJvdmFsLXNlYy1nYWxheHktbm92b2dyYXR60gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin ETF is the needed 'seal of approval' for BTC — Mike Novogratz - Cointelegraph",
        "content": "The approval of a spot Bitcoin (BTC) exchange-traded fund (ETF) would equate to a “seal of approval” for Bitcoin from the United States government and its securities regulator, says Mike Novogratz.\n\nIn a July 12 interview with Bloomberg TV, the founder of crypto investment firm Galaxy Digital spoke about the multiple spot Bitcoin ETF filings before the U.S. Securities and Exchange Commission (SEC), including one from the $10 trillion asset manager BlackRock.\n\n“What I do think is BlackRock, Invesco [and] the group of ETF providers is a real signal that adoption is coming,” Novogratz said.\n\nHe added many are “nervous” about investing in crypto, and the approval of a spot Bitcoin ETF would be an “easy first step” for most to start investing in the asset.\n\n“I just think if it happens, it’s the seal of approval from the SEC and the U.S. government.”\n\nNovogratz explained there is a “giant infrastructure” in place for the ETFs. Along with BlackRock, proposed ETFs from Valkyrie, Invesco, VanEck, WisdomTree, Fidelity, and a joint fund by ARK Invest and 21Shares are also lined up for approval. Novogratz believes that many of these will likely end up being approved.\n\n“The SEC is not going to approve one, so you’re going to have these giant sales forces out there giving access to people that didn’t have access before.”\n\nSEC Chair Gary Gensler has previously claimed that “everything other than Bitcoin” falls under his agency’s purview, and other crypto projects “are securities,” as there are typically known developers and profits are anticipated based on their work.\n\nRelated: Don’t be naive — BlackRock’s ETF won’t be bullish for Bitcoin\n\nNovogratz was evasive when asked his thoughts on if Galaxy and Invesco’s spot Bitcoin ETF would be able to list before the end of the year.\n\n“This SEC has been really stubborn and really tough on crypto,” he said.\n\n“No one of significance has gotten through the listing process. We are in that process, and it has been a long and frustrating path. I’ll leave it at that,” he added.\n\n“I think we’re probably going to need either a change of heart at the SEC or a change of administration to see real progress in crypto regulation here in the U.S.”\n\nNovogratz predicted the price of Bitcoin will end the year at a high. “If you take out the top we’ll have a nice leg up,” he said.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: How smart people invest in dumb memecoins — 3-point plan for success"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZm9ya2FzdC5uZXdzL2V1cm9wZXMtZmlyc3Qtc3BvdC1iaXRjb2luLWV0Zi1zZXQtbGF1bmNoLWp1bHktZnQv0gFLaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvZXVyb3Blcy1maXJzdC1zcG90LWJpdGNvaW4tZXRmLXNldC1sYXVuY2gtanVseS1mdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Europe’s first spot Bitcoin ETF set to launch in July: FT - Forkast News",
        "content": "Author profile\n\nZoltan is a writer at Forkast with a deep passion for storytelling and blockchain. Prior to joining the team, he worked as a marketing and content writer, focused on software and technology. Zoltan holds a master’s degree from the Ludwig Maximilian University of Munich and is interested in the future of global financial decentralization.\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9maXJzdC1iaXRjb2luLWZ1dHVyZXMtY29udHJhY3QtZGVidXRzLWFyZ2VudGluYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "First Bitcoin futures contract debuts in Argentina - Cointelegraph",
        "content": "Argentina welcomed its first Bitcoin futures contract on July 13, just three months after the country’s securities watchdog approved the underlying index as part of a strategic innovation agenda.\n\nAccording to Matba Rofex, the trading platform behind the investment vehicle, it is the first Bitcoin (BTC) futures contract in Latin America. In a futures contract, buyers bet on the future price of a commodity or other asset, such as Bitcoin. Under the contract, buyers and sellers are obligated to purchase and sell the asset at a predetermined future date.\n\nArgentina’s securities regulator, the Comisión Nacional de Valores, approved the Bitcoin futures index in April as part of an innovative agenda to encourage public-private collaboration for new financial products.\n\nThe Bitcoin futures contract will be based on the price of BTC quoted by several market participants providing BTC/ARS trading pairs. All trades will be settled with Argentine pesos, and traders are required to make deposits through bank transfers.\n\nAccording to local media reports, the product will initially be available only to institutional investors. There’s no clear timeline for when retail investors can trade Bitcoin futures contracts in the country. With the futures index, qualified investors can gain BTC exposure in a transparent, regulated environment.\n\nArgentinians have turned to Bitcoin to keep pace with hyperinflation in the country. Argentina’s annual inflation rate soared 114% in May from a 108% jump in April 2023, hitting the highest level since 1991, according to Trading Economics.\n\nArgentina annual inflation rate. Source: Trading Economics\n\nAnother Bitcoin futures contract should be soon available in the region, as regulators in Brazil are evaluating a similar investment vehicle backed by the local stock exchange B3. Initially scheduled to debut on June 30, the crypto futures contract is now expected to go live on Sept. 30. This is the second time the product release has been delayed.\n\nBitcoin futures premiums reached their highest level in 18 months on July 4, jumping 3.2% from the previous week. With the surge in BTC derivatives demand, traders question whether the market is experiencing “excessive excitement” or is returning to normal after a prolonged bear market, Cointelegraph reported.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1wcmljZS00MGstZG9sbGFyLWR4eS1sYXN0LXRpbWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Will Bitcoin catch up? BTC price was $40K when the dollar was previously this weak - Cointelegraph",
        "content": "Bitcoin (BTC) may see a “parabolic curve” begin thanks to United States dollar weakness as the greenback falls to three-month lows.\n\nIn a tweet on July 11, popular trader Moustache suggested that the time is right for BTC price history to repeat itself.\n\nDXY “most important chart” for Bitcoin this year\n\nBitcoin’s formerly strong inverse correlation to dollar strength has waned this year, but its latest movements are a talking point among traders.\n\nData from Cointelegraph Markets Pro and TradingView shows the U.S. Dollar Index (DXY) on the way to testing support at 100 for the first time in months.\n\nPreviously above 105, the greenback has faced stiff resistance after 2022s 20-year highs.\n\nAs a result of its newfound bearish behavior — which would cement itself further should the 100 mark be lost — Bitcoin stands to win, Moustache believes.\n\n“Calm before the storm. Big Move is still loading,” he summarized alongside a chart showing DXY challenging the bottom of a Gaussian channel on weekly timeframes.\n\n“First candle of the DXY (Dollar) now falls OUT of the channel. This is the point where you want to be positioned. In 2016-2017 and 2020-2021 this led to the parabolic curve in $BTC.”\n\nDXY annotated chart. Source: Moustache/Twitter\n\nThe dollar’s cause has not been helped by markets keen to tap a potential reversal in U.S. interest rate hikes. With inflation abating, this looks ever more likely despite a hawkish Federal Reserve.\n\nThe July 12 release of the Consumer Price Index (CPI) for the month prior came in below expectations, providing further fuel for risk assets.\n\nFellow trader Mikybull Crypto predicted that the downward DXY trend would continue, with BTC/USD hitting $35,000 as a result.\n\nBears in disbelief\n\n\n\n90 next on DXY#Bitcoin to 35k$ pic.twitter.com/TczJMGKh5I — Mikybull Crypto (@MikybullCrypto) July 12, 2023\n\nContinuing the historical comparison, meanwhile, popular trader Josh Olszewicz called DXY the “single most important chart” for Bitcoin into 2024.\n\n“DXY showing technical weakness coupled with a programmatic supply reduction of Bitcoin issuance may lead to an outsized price reaction for Bitcoin post-halving. Similar DXY moves from 100 to 90 after the previous two halvings provided a tailwind for significant multi-month bullish rallies,” he wrote in a TradingView update.\n\n“DXY is currently forming a high timeframe descending triangle, which holds a bearish bias. This chart pattern becomes invalidated with any higher high in the DXY at 103.50 but does not necessarily invalidate the possibility of a move to the historic range low of 90.”\n\nDXY annotated chart. Source: Josh Olszewicz/TradingView\n\nApril levels return\n\nAdding a broader perspective, William Clemente, co-founder of crypto analysis firm Reflexivity Research, presented the year-on-year change in DXY against how BTC/USD behaved through the years.\n\nRelated: Bitcoin exchanges now hold the same BTC supply share as in late 2017\n\nSince everyone wants to talk about DXY (US dollar) weakness, here's Bitcoin's price plotted against the YoY change in the DXY: pic.twitter.com/voJAfeF1ok — Will Clemente (@WClementeIII) July 12, 2023\n\nLooking back, the last time that DXY traded at 100 was in mid-April 2022. At the time, Bitcoin hovered at around $40,000.\n\nBTC/USD vs. DXY chart. Source: TradingView\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbm8tYml0Y29pbi1vcmRpbmFscy1kby1ub3QtaW5zY3JpYmUtZGF0YS1vbnRvLXNhdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "No, Bitcoin Ordinals Do Not Inscribe Data Onto Sats - Nasdaq",
        "content": "This is an opinion editorial by Bitcoms, a Bitcoin writer.\n\n“So quick bright things come to confusion” –William Shakespeare, “A Midsummer Night's Dream”\n\n“Inscriptions” are a way of writing pieces of arbitrary information onto the Bitcoin blockchain. “Ordinals” are a convention used for tracking individual sats and linking them to inscriptions. This article does not attempt to argue for or against Bitcoin Ordinal inscriptions. Rather, it argues against the confusing, inaccurate and sometimes dubious ways they can be presented, marketed and sold.\n\nIt deals with a widespread fallacy which insinuates that ownership of Ordinal inscriptions is enforced and protected by the rules of the Bitcoin protocol itself (I maintain that it is not). And while this fallacy may be asserted duplicitously or innocently, it is always pernicious because it can make Ordinal inscriptions more attractive to prospective buyers.\n\nHere is a typical example:\n\n“Ordinals allow a variety of data, including text, images, and video to be inscribed on a single Satoshi (the smallest denomination of a Bitcoin) and permanently stored on the Bitcoin blockchain.” –Introduction documentation for Ordinals Market\n\nThis suggests that ownership of an inscription will be protected by the permanence and immutability of the Bitcoin timechain itself. But Bitcoin does not enforce ownership of inscriptions, because an inscription is not “inscribed on a single satoshi” on the blockchain at all.\n\nAs the “Ordinal Theory Handbook,” the guide to Ordinal theory compiled by its developers, points out:\n\n“Satoshis live in outputs” while “inscription content is included in transaction witnesses.”\n\nWhile both output data and witness data are stored on the Bitcoin blockchain following the SegWit upgrade, claiming that inscription data is inextricably linked to an \"inscribed\" satoshi creates a misleading notion that any such link is recognized by Bitcoin itself.\n\nIn reality, the link between an inscription and a specific satoshi is manufactured off chain by a purpose-built external indexer. This pulls data from the Bitcoin blockchain and presents it according to an elegant but ultimately centralized and arbitrary system of rules called “Ordinal theory.” These rules are entirely extraneous to the Bitcoin protocol itself, and have been described by their originator as akin to astrology.\n\nSpread Of The Inscription Fallacy\n\nBut in my view, statements in many of the places where Ordinal inscriptions can be created, viewed, bought and sold, as well in media coverage, do not explain the role of the Ordinal indexer clearly enough. Thus, the idea that inscriptions are embedded “onto” or directly “into” satoshis, and that the inscription data and a corresponding sat are inextricably linked within the Bitcoin protocol without the need for an external indexer, has created a dangerous fallacy for potential investors.\n\nHere are just a few examples of such statements:\n\n“Ordinal Inscriptions, similar to NFTs, are digital assets inscribed on a satoshi, the lowest denomination of a Bitcoin.” –Ordinals.hiro.so\n\n“...Ordinals are ‘inscribed’ onto a single satoshi… Inscribing is the process of putting a piece of data onto the blockchain, where it will remain forever accessible and unchangeable.” –“Coinbase Bytes” newsletter\n\n“Each sat can be inscribed with data, such as JPGs, GIFs, PDFs and more, creating a Bitcoin Ordinal which is then held in a wallet.” –Gamma FAQ\n\n“What are Bitcoin Ordinals? Launched in Jan 2023, they allow the creation of NFTs on the Bitcoin blockchain by attaching data to individual satoshis using a process called inscription.” –Binance NFT Twitter account\n\n“For the uninitiated, Ordinal Inscriptions, akin to NFTs, are digital assets inscribed on satoshis (the smallest currency unit of bitcoin).” –CoinDesk\n\n“Ordinals inscribe a serial number onto a satoshi, the smallest currency unit of bitcoin.” –CoinDesk\n\n“Ordinals are inscribed directly onto individual Satoshi’s, which are then included in blocks on the Bitcoin blockchain.” –Nairametrics\n\n“…bitcoin network upgrades … enabled each satoshi … to store a few megabytes of data, from text and images to audio and video.” –Reuters\n\n“Token functions … are all achieved by inscribing data into satoshis, the smallest divisible unit of a bitcoin.” –NYDIG newsletter\n\nAs stated at the outset, this article does not seek to show that Ordinal inscriptions are good or bad. It simply spotlights the misleading, sometimes sloppy, and perhaps at times scammy, ways they are being presented, which wrongly implies that Bitcoin itself will enforce inscription ownership without the use of an external tool.\n\nSo, what can be done to make sure potential buyers of Ordinal inscriptions do not fall victim to this fallacy? We can keep clearing up confusion by pointing it out.\n\nThis is a guest post by Bitcoms. Opinions expressed are entirely their own and do not necessarily reflect those of BTC Inc or Bitcoin Magazine.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL3N0b2Nrcy9iaXRjb2luLWRvbWluYW5jZS1pcy1vdmVyLTUwLSVFMiU4MCU5NC1mb3VyLXRoaW5ncy10aGF0LWZ1ZWxlZC1jb25maWRlbmNlLWluLWJ0Yy0xMDMyNDQ1OTMy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Dominance is Over 50% — Four Things That Fueled Confidence in BTC - Markets Insider",
        "content": "Initiating the era of digital assets comes with a few perks that Bitcoin (BTC-USD), the original cryptocurrency, enjoyed for quite a while. Market dominance was one of them, and, seen as a safe haven on multiple market cycles, BTC enjoyed the lion’s share of above 50% of the market until the competition -the rest of the crypto ecosystem- picked up.\n\nBitcoin dominance is often associated with stability across the crypto market, where investments are directed toward the original cryptocurrency and investors’ trust in BTC is high. So, it’s no coincidence that BTC slipped below 50% dominance mere weeks before the Terra ecosystem meltdown in April 2021 and stayed between 40%-50% levels while the crypto market endured the Celsius, 3AC, and FTX collapses.\n\nNow, after two years of tumultuous market activity, Bitcoin has steadily increased its market share since the start of 2023 and crossed 50% dominance in June, bringing BTC’s market cap above all the rest of the cryptocurrency industry combined. Here’s why.\n\n#1. No BTC Mention in SEC vs. Binance and Coinbase Lawsuits\n\nThe Securities Exchange Commission (SEC) filed lawsuits against leading cryptocurrency exchanges Binance (BNB-USD) and Coinbase (NASDAQ:COIN) last month. The allegations revolved around the accusation that these crypto exchanges offered various altcoins as unregistered securities. Should the SEC’s lawsuit prove successful, altcoins may face increased regulation and shift towards offshore and decentralized trading.\n\nThe lawsuit didn’t mention the two largest cryptocurrencies, BTC and Ethereum (ETH-USD). As a result, Bitcoin dominance has seen a surge as the case caused investors to relocate their investments from altcoins to Bitcoin, turning it into a safe haven once again.\n\n#2. Blackrock’s Bitcoin ETF\n\nThe world’s-biggest asset manager with $9 trillion under management, BlackRock (NYSE:BLK), recently filed for a Bitcoin exchange-traded fund (ETF), an investment vehicle that tracks the value of an underlying asset. The SEC has previously rejected several spot ETF applications, stating concerns about Bitcoin price manipulation as the reason. Nevertheless, the approval doesn’t seem far away, as BlackRock has an ETF approval rating of 99.83%, and the application includes a surveillance-sharing agreement that could eliminate the risk of market manipulation.\n\nEric Balchunas, the senior ETF analyst at Bloomberg, called the prospective BlackRock Bitcoin ETF “the real deal,” stating it isn’t much different from GLD, the ​​SPDR Gold Shares ETF (NYSEARCA:GLD), which tracks the price of gold by holding physical gold bullion in its portfolio. Reflexivity Research co-founder Will Clemente exemplified GLD’s huge bull run, which started with its launch, as a potential price action for BlackRock’s Bitcoin ETF.\n\n#3: Buy the Rumor: Fidelity’s Crypto Action\n\nMining Bitcoin since 2014, Fidelity, the world’s third-largest asset manager, with $4.24 trillion under management, is also rumored to be planning an impactful move in the cryptocurrency markets. It is suggested that the firm is expected to make a buyout bid for Grayscale, the fund manager controlling the Grayscale Bitcoin Trust (OTC:GBTC), and/or launch its own spot Bitcoin ETF.\n\nFor years, Grayscale has been trying to convert the GBTC to a spot Bitcoin ETF. The conversion request has been denied by the Securities Exchange Commission (SEC), which led to Grayscale suing the agency in June 2022, claiming the regulator was acting arbitrarily in rejection of spot Bitcoin ETFs, despite having previously approved Bitcoin Futures ETFs.\n\n#4: Bitcoin Innovation Ramps Up\n\nWhile Bitcoin’s price action was the highlight for some time, developers never really stopped exploring the infrastructure of the original blockchain. After a privacy update in 2021 enabled data storage on the Bitcoin network, Ordinal inscriptions resembling NFTs started showing up on the same infrastructure.\n\nAlbeit controversial, Bitcoin Ordinals showed clearly that there’s still much left to discover in Bitcoin in terms of innovation and pushing for new horizons.\n\nAnother front for Bitcoin-driven innovation was discovered when Stanford University professor David Tsè and his team’s research revealed a “natural synergy” between Bitcoin and Proof-of-Stake (PoS), the mechanic that’s mainly used by the Ethereum-based DeFi ecosystem, emphasizing that developers can focus on building applications using Bitcoin’s unmatched liquidity pool.\n\nInstead of the vast network of miners maintaining the Bitcoin blockchain, PoS-based blockchains are driven by the staking mechanism. Cosmos-based blockchain Babylon (where professor Tsè serves as CTO) aims to find an ideal middle ground between Bitcoin and the DeFi world by utilizing the former as a timestamping service to provide better security for important transactions and censorship resistance.\n\nBitcoin’s recent resurgence to over 50% market dominance bolstered investor confidence in the asset as a safe haven. While it can be tied to multiple factors, what’s more important is what lies ahead. The ETF filings by the world’s largest wealth managers indicate retail investors are not alone in trusting Bitcoin. Coupled with the expanding innovation, Bitcoin has the potential to welcome a new massive wave of adoption.\n\nDisclosure"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2hvdy1kb2VzLWJpdGNvaW4tbWFrZS1tb25leS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "How Does Bitcoin Make Money? | Learn More - Investment U",
        "content": "Bitcoin is a decentralized digital currency that was created in 2009. No government or central bank is in charge of issuing it. It is also not a business, so it doesn’t have any revenue or a balance sheet. Due to this, the price of Bitcoin can seem a little arbitrary. At a moment’s notice, the price of Bitcoin can spike or slump. So, who determines how much one Bitcoin is worth? And how does Bitcoin make money for investors? Let’s take a look at the answers to these questions and more.\n\nHow Does Bitcoin Make Money and What Makes it Go Up and Down?\n\nThe short answer is supply and demand. If more people are buying Bitcoin instead of selling then the price will trend upward. But if more people are selling instead of buying then the price will trend down. The stronger the buying pressure is, the faster the price will climb. Adversely, the stronger the selling pressure is, the faster the price will drop.\n\nSupply: One of the most important factors of Bitcoin is that its supply is fixed. Bitcoin has a maximum supply of 21 million coins. Once this number is reached, no new coins will be created. This limited supply makes the existing Bitcoins more valuable. It’s a big difference from our existing financial system, which creates new money all the time.\n\nBitcoin’s limited supply is what gives it value as an investment. If an unlimited number of Bitcoins could be created then it would erode the value of each coin.\n\nDemand: Bitcoin is an asset just like a stock, bond, or gold. As such, investor behavior can influence its price. For example, in 2020, China’s citizens may have used Bitcoin to dodge regulations from the government. Since it’s untraceable, Bitcoin gave Chinese investors a way to move money out of the country. This surge in buying led to a runup in Bitcoin’s price at the end of 2021.\n\nOn the other hand, let’s say that the U.S. was to enter into a war. Lots of investors would panic and rush to sell their investments. This surge of selling would likely hurt Bitcoin and cause it to fall in price.\n\nAt first glance, Bitcoin’s price may seem to move randomly. However, if you take a look at the global picture, it can be fairly simple to guess why Bitcoin is trending up or down.\n\nOther Factors Behind Bitcoin’s Price\n\nSupply and demand are the two biggest drivers of Bitcoin’s price. But there are a few other factors that also play a role:\n\nThe cost to mine a Bitcoin. This determines the number of people mining new Bitcoins, which impacts supply.\n\nThis determines the number of people mining new Bitcoins, which impacts supply. The rewards issued to miners for verifying transactions on the blockchain. This also impacts supply.\n\nThis also impacts supply. The number of competing cryptocurrencies. Increased competition can give investors other places to store money.\n\nIncreased competition can give investors other places to store money. The state of the economy.\n\nPotential regulations on the cryptocurrency industry.\n\nIn general, cryptocurrencies have volatile prices. This means that their prices can rise and fall very quickly. But that doesn’t mean that you can’t still earn money. So, how does Bitcoin actually make money for investors?\n\nHow Can You Profit From Bitcoin?\n\nThere are two main ways that investors profit from Bitcoin. The first is to try and trade around the price swings. The second is to buy and hold for the long term.\n\nTrading: Trading Bitcoin is a strategy where investors try to anticipate price movements. They constantly buy and sell Bitcoin in anticipation of where they think the price will move. For example, let’s say a trader buys one Bitcoin at $30,000. The price then surges 10% to $33,000. The investor might sell their Bitcoin and profit $3000. Then, they’ll wait for the price to dip again before buying more.\n\nThis strategy can be risky since the investor has no way of knowing which way the price will move. It requires a high-risk tolerance and good anticipation skills.\n\nBuy and hold: Another way to profit from Bitcoin is simply to buy and hold. This strategy is much simpler. You simply buy Bitcoin and wait for its price to increase over time. The biggest difference is that you are probably comfortable holding Bitcoin for months, if not years.\n\nYou will still experience volatility in the short term. But Bitcoin has a great track record over the long term. Over the past five years, Bitcoin is up almost 4,000%.\n\nBut what about investors who want to use Bitcoin to create income? How does Bitcoin make money for these investors? Let’s take a look.\n\nHow Else Can Investors Make Money?\n\nBitcoin Mining\n\nMining is the process of approving transactions on the blockchain. Since Bitcoin is decentralized, it does not have a main regulating body. Instead, it requires workers to make sure each transaction is legitimate. These workers are called Bitcoin miners. For their efforts, they are rewarded in Bitcoin.\n\nThe mining process requires completing a complex math problem. If you are the first to solve the problem then you win the right to approve a transaction and get rewarded.\n\nGetting started mining will give you a steady stream of Bitcoin. You can then sell this Bitcoin and convert it to dollars. Keep in mind that this process requires a mining rig and tons of computing power.\n\nStaking\n\nCrypto staking is the process of “locking up” your coins for a period of time. Doing this helps contribute to the security of the respective blockchain network. As a reward for staking your coins, you will receive an annual percentage yield. In this sense, it’s similar to keeping your money in a savings account.\n\nStaking is generally only available for many newer coins. It’s usually not available for Bitcoin, since Bitcoin uses a proof-of-work system, not a proof-of-stake one. However, Crypto.com lets you stake Bitcoin. You can expect to earn at least 4-5% APY when you stake your coins. In some cases, you can earn as high as 15%. It all depends on the coin you want to stake and the length of time that it’s staked for.\n\nThose are the two main strategies that answer the question: how does Bitcoin make money? But if you are to expand beyond Bitcoin then there are dozens of ways to make money using cryptocurrency in general.\n\nEntrepreneurship\n\nThere are tons of ways that you can earn money within the world of cryptocurrency. Most of them include starting a business of some sort. Here are just a few new industries that you can explore:\n\nAll of these ventures have the potential to be very lucrative. However, they are also very different from each other. The path that’s best for you will depend on your skillset and financial goals.\n\nI hope that you’ve found this article valuable for learning how does Bitcoin make money? Please remember that I’m not a financial advisor and am just offering my own research and commentary. As usual, please base all investment decisions on your own due diligence."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL3N0b2Nrcy9nYWxheHktZGlnaXRhbC1jZW8tbWlrZS1ub3ZvZ3JhdHotZm9yZXNlZXMtYml0Y29pbi1leHBsb3Npb24tc2VjLWFwcHJvdmFsLW9mLWV0ZnMtMTAzMjQ0NTQxMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Galaxy Digital CEO Mike Novogratz Foresees Bitcoin Explosion, SEC Approval of ETFs - Markets Insider",
        "content": "Galaxy Digital Holdings Ltd. (OTC:BRPHF) founder and CEO Mike Novogratz is optimistic about Bitcoin's (CRYPTO: BTC) future, predicting a rise in its value by the end of the year.\n\nThe investor also anticipates the approval of Bitcoin exchange-traded funds (ETFs) in the U.S.\n\n“I think it ends the year higher,” Novogratz told Bloomberg News.\n\nAlso Read: Metaverse Could Be Used To Brainwash Youth And Train Recruits For Terrorism, Says India's Home Minister\n\nBitcoin is currently consolidating between $28,000 and $32,000. The cryptocurrency's value could increase further once the Federal Reserve concludes its interest-rate hikes.\n\nBitcoin has seen an 18% surge in the past month and an 84% increase this year.\n\nThis growth is largely attributed to the anticipation of a potential US approval of a Bitcoin ETF.\n\n“People have made a lot of money, so there’s some supply pressure today,\" Novogratz said.\n\nThe approval of a Bitcoin ETF will lead to widespread adoption of Bitcoin by investors who previously couldn't access this asset class, through firms like BlackRock Inc. (NYSE:BLK) and Invesco, Novogratz says. Cathie Wood's Ark Invest is also applying for a spot bitcoin ETF.\n\nNovogratz views the potential approval as a \"seal of approval\" from the Securities and Exchange Commission and the U.S. government, affirming Bitcoin as an asset.\n\nWhen questioned about Galaxy's potential listing in the U.S., Novogratz revealed that the firm is \"in the process,\" but admitted that it's been a \"long and frustrating path.\"\n\nGalaxy, currently listed in Toronto, has been working towards becoming a Delaware-incorporated company and plans to list on the Nasdaq, pending an ongoing review by the SEC.\n\nRead Next: Celsius CEO Arrested In Wake Of Crypto Lender's Collapse, SEC Files Securities Fraud Lawsuit\n\nJoin Benzinga's Future of Crypto in NYC on Nov. 14, 2023 to stay updated on trends like AI, regulations, SEC actions & institutional adoption in the crypto space. Secure early bird discounted tickets now!"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZGVjcnlwdC5jby8xNDg2MjEva2ltLWRvdGNvbS10ZWFzZXMtYml0Y29pbi1jYXNoLWtpbGxlci1hcHAtYXMtYml0Y2FjaGUtaGVhZHMtZm9yLWxpcXVpZGF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Kim Dotcom Teases Bitcoin Cash 'Killer App’ as Bitcache Heads for Liquidation - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcache, a crypto project founded by political activist and founder of the now-defunct file hosting service Megaupload, Kim Dotcom, has begun a liquidation process in New Zealand due to unpaid legal fees by the company.\n\n“The business formerly known as Bitcache has been liquidated because a law firm that offered to work for shares in the company decided years later to invoice the company for past legal fees,” tweeted Kim late Thursday. He pointed out that he “was the evangelist for the business and supports the liquidation of the company.”\n\nThe controversial tech entrepreneur has been fighting extradition to the U.S. to face copyright infringement charges for years. In 2012, the FBI alleged that his now defunct service, Megaupload, earned millions by helping people illegally share files.\n\nAD\n\nAD\n\nDespite news of the liquidation, Kim Dotcom tweeted on Thursday that the project will continue under a new name, Fileshop. He added that it’s “been developed from scratch with a completely new code base and without any of the Bitcache IP.” He said he’s also working with some “friendly previous investors and partners.”\n\nThe good news is that the project is now called FileShop, has been developed from scratch with a completely new code base and without any of the Bitcache IP. Very happy to announce that friendly previous investors and partners have not been forgotten and that this app is coming. — Kim Dotcom (@KimDotcom) July 13, 2023\n\nThe new project, says Dotcom, aims to become a “Bitcoin Cash killer app.”\n\nThe Bitcache blockchain, was touted by Kim as a disruption in how online content creators will be able to monetize their content. It was built as a subscription-as-a-service that would allow for Bitcoin to be used for micro-payments–receiving substantial funding through the well known investment firm, BnkToTheFuture.\n\nAccording to a report from Newsroom, a New Zealand media outlet, the platform failed to launch in early 2017, due to “unexpected hiccups” Kim Dotcom said at the time. Dotcom, says Newsroom, was named as an evangelist due to his ongoing disputes with the US government over the now-defunct website MegaUpload.\n\nAlthough Kim Dotcom took heavily to Twitter throughout 2017-2018–claiming his company would introduce millions of new users to Bitcoin–the project never came to fruition. In late 2022, after years of silence, Dotcom announced the project “never got the software right.”\n\nAD\n\nAD\n\nNewsroom reported that Auckland lawyer and former Bitcache director Phil Creagh applied for liquidation last month.\n\n“It’s pretty straightforward, there are fees owed and not paid. The company has not taken any steps so far to avoid being placed in liquidation,” Creagh told the news outlet. “We’ll put it in liquidation and see what, if anything, can be recovered.”"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb25vY2hyb21lLWZpbGluZy1zcG90LWJpdGNvaW4tZXRmLWFzeC1hdXN0cmFsaWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Monochrome Bitcoin ETF gets filed to Australian securities exchange - Cointelegraph",
        "content": "Australian-based crypto investment firm Monochrome Asset Management has updated its application to offer a spot Bitcoin (BTC) exchange-traded fund (ETF) on the Australian Securities Exchange (ASX) through its partner Vasco Trustees.\n\nThe ETF — Monochrome Bitcoin ETF — will be able to offer retail Australian investors direct exposure to Bitcoin, according to the firm’s July 14 announcement.\n\nSpeaking to Cointelegraph, Monochrome CEO Jeff Yew explained that by obtaining a license, Australian retail investors would be exposed to Bitcoin within a formidable regulatory landscape:\n\n“Through a Bitcoin ETF, it makes it possible for them to buy and use the asset class in however they see fit with the investment choices [and] in a regulated manner, and also operating within the regular regulatory perimeter.”\n\n“So that is the benefit, I guess, compared to, say, unregulated exchanges where there’s no investor protection,” he added.\n\nYew believes that if a Bitcoin ETF goes live on ASX, it will send a “clear signal” to traditional investors that the “unregulated Wild West is coming to an end” because their investments will be backed by a “familiar,” “structured” and “protected environment.”\n\nVasco, its “Responsible Entity Partner,” is authorized under an Australian Financial Services Licence to offer retail investors regulated exposure to the cryptocurrency market, the firm stated.\n\nRelated: Bitcoin ETF is the needed ‘seal of approval’ for BTC — Mike Novogratz\n\nSpot Bitcoin ETF applications have been a focus point for the industry lately, particularly in the United States. In recent weeks, the industry has seen spot Bitcoin ETF filings from major financial firms, including Fidelity, Invesco, Wisdom Tree, Valkyrie and the $10 trillion asset management firm BlackRock.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nUpdate (July 14 at 15:00 UTC): This article has been updated to reflect that Monochrome's Bitcoin ETF provides exposure only to Bitcoin and not Ether."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLWFmdGVyLXhycC1wcmljZS1zcGlrZXMtMTA00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin bulls 'have work to do' after XRP price spikes 104% - Cointelegraph",
        "content": "Bitcoin (BTC) consolidated near $31,000 on July 14 after a classic short squeeze sparked new yearly highs.\n\nBTC/USD 1-day chart. Source: TradingView\n\nBTC liquidates $50 million shorts in new squeeze\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price movements returning to cement support after rapid gains the day prior.\n\nAlready tipped for a trip higher, Bitcoin reacted instantly to news that a United States judge had supported the idea that altcoin XRP (XRP) was not a security.\n\nThis was taken by markets as a blow to regulator the Securities and Exchange Commission (SEC), which in recent months had sought to label altcoins as securities en masse.\n\nXRP/USD immediately spiked by over 100%, almost touching the $1 mark before returning to trade near $0.80 at the time of writing. The last time that such levels formed part of the chart was in April 2022.\n\nXRP/USD 1-week chart. Source: TradingView\n\nBitcoin, while considerably more muted, still managed to liquidate $50 million of shorts, according to data from monitoring resource CoinGlass.\n\nBTC/USD liquidations chart (screenshot). Source: CoinGlass\n\nWhile Cointelegraph reported that bears may still be able to get the upper hand around the weekly options expiry, on the day, traders were cautiously optimistic.\n\n$BTC Aggregate CVDs & Delta\n\nConfluence with market data ~ aggressive short squeeze & covering\n\n\n\nStrong spot bid as well, want to see LTF dips bought by spot pic.twitter.com/XrwJpM6XOV — Skew Δ (@52kskew) July 14, 2023\n\n“Bitcoin failed to breakout overnight and could be falling back into the range here,” popular trader Jelle wrote in his latest social media update.\n\n“Waiting to see how this 4h candle turns out, but bulls have some work to do. A bit of a push, and we can have a lot of fun this weekend.”\n\nFellow trader Crypto Tony voiced frustration at the lack of a clear breakout from Bitcoin’s long-established trading range.\n\n“Rejecting from the range high so no entry for us to just yet on Bitcoin .. Waiting for a solid flip before we get into this,” he told Twitter followers, adding that he “would be disappointed if BTC doesn't flip.”\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nAltcoins now due “mega-run”\n\nMeanwhile, XRP staging a comeback formed the background to a snap drop in Bitcoin market cap dominance.\n\nBitcoin market cap dominance chart. Source: TradingView\n\nRelated: Will Bitcoin catch up? BTC price was $40K when the dollar was previously this weak\n\nThe largest cryptocurrency previously constituted almost 52% of the total, dropping below 50% overnight to near one-month lows.\n\nThat did not take long.\n\n\n\nLet's see how $ALTS do once everything settles down a bit. https://t.co/ABBGid4MWL pic.twitter.com/VhRUHqgL9O — Daan Crypto Trades (@DaanCrypto) July 13, 2023\n\nTraders had already hoped that Bitcoin would cool its increasing dominance presence to allow altcoin markets to make gains of their own as part of a broader crypto bull market.\n\n“Good things come to those who wait,” trader Moustache summarized on the day, predicting that the altcoin boom would still go ahead.\n\n#Altcoins\n\n\n\nAltcoins are preparing for a mega-run imo.\n\n\n\nI've been sharing this chart for a few months now and everything is going according to plan.\n\n\n\nIt's just a waiting game.\n\n\n\nGood things come to those who wait. https://t.co/OM2dKtbENW pic.twitter.com/DkasZSkE3t — ⓗ (@el_crypto_prof) July 14, 2023\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNDg0NDEvdGVsZWdyYW0tbm93LWxldHMtdXNlcnMtcGF5LW1lcmNoYW50cy1iaXRjb2luLWhlcmVzLWhvdy13b3Jrc9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNDg0NDEvdGVsZWdyYW0tbm93LWxldHMtdXNlcnMtcGF5LW1lcmNoYW50cy1iaXRjb2luLWhlcmVzLWhvdy13b3Jrcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "You Can Now Pay Merchants on Telegram in Bitcoin—Here’s How it Works - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUsers can now directly pay merchants in crypto on Telegram via an independent chatbot called Wallet.\n\nBuilt on TON blockchain and Telegram, the Wallet chatbot provides a way to store, trade, and transfer three cryptocurrencies: Toncoin (TON), Tether’s USDT on Tron, and Bitcoin (BTC).\n\nThe Wallet chatbot's team launched a new feature today with Wallet Pay API, which allows merchants to receive crypto payments directly on Telegram.\n\nAD\n\nAD\n\nIt’s an unofficial integration of crypto tech that isn’t developed by Telegram developers Telegram FZ LLC and Telegram Messenger Inc.\n\nTON, which stands for The Open Network, is a layer-1 blockchain network based on the proof-of-stake consensus mechanism, originally developed by the Telegram team. Toncoin (TON) is the native gas-paying token of The Open Network.\n\nIn May 2020, Telegram abandoned the project after litigation with the U.S. Securities and Exchange Commission.\n\nHow to receive crypto on Telegram?\n\nMerchants must first apply on the Wallet Pay website to start receiving crypto payments via Telegram.\n\nA spokesperson for the chatbot’s team told Decrypt that “there are about 200 companies already in the queue to implement the product,” adding that they “expect thousands of small businesses to apply to make use of Wallet Pay.”\n\nAD\n\nAD\n\nUsers need to add @wallet on Telegram as a new contact and create a new crypto wallet instantly linked to their Telegram account. There’s no need for saving seed phrases or private keys.\n\n“A Telegram account is required for any user to make use of Wallet and access simple transfers of USDT–this can be created using a regular phone number, or an anonymous tokenized phone number built by Telegram on the TON blockchain,” the spokesperson told Decrypt.\n\nThe team added a demo merchant for a fake demo merchant called Pineapple Store. Its user experience was relatively seamless, where users can view the store’s items and make payments within Telegram chat itself.\n\nDemo payment using TON on Telegram. Image: Telegram.\n\nOn adding new coins in the future, the spokesperson replied saying, “We are considering adding a few more essential coins in the future, however, our focus will be on TON.”\n\nDespite this focus, Decrypt’s transaction logs don’t show any gas fees paid in the network’s native TON token in the test payment.\n\nTelegram had previously auctioned usernames as NFTs on the TON blockchain."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy1jcnlwdG8tbWFya2V0LWRvbWluYW5jZS1zbGlkZXMtMTA0ODE5NTM2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin's Crypto Market Dominance Slides by Most in 13 Months as XRP Court Ruling Spurs 'Alt Season' Talk - Yahoo Finance",
        "content": "Bitcoin's (BTC) share of the total crypto market, known as its dominance, tanked Thursday after a U.S. court complicated the Securities and Exchange Commission's (SEC) plan to regulate digital assets and spurred hopes for a sustained outperformance of alternative cryptocurrencies, often called the \"alt season.\"\n\nIn a highly anticipated ruling in the SEC's case against Ripple Labs for violating securities law through XRP sales, the District Court for the Southern District of New York ruled that XRP is not a security when offered to individuals through centralized exchanges, but is one when sold directly to institutions.\n\nThe distinction in the ruling essentially threw a spanner in SEC's plan to paint all altcoins with the same brush and subject them to stringent oversight by categorizing them as securities.\n\nBitcoin's dominance rate fell 2.6% to 50.14% after the court ruling, the biggest one-day decline since June 13, 2022, according to data from charting platform TradingView. Altcoins like XRP, SOL, MATIC and ADA chalked out double-digit gains, outshining bitcoin by a big margin.\n\nSome observers foresee potential for a continue outperformance of altcoins over the near term.\n\n\"Alt season may be upon us following the Ripple news as indicators collectively suggest risk appetite is funneling down the risk continuum,\" Decentral Park Capital said in a market update published Thursday. \"With the U.S. dollar breaking down and the inflation battle nearing the end, it appears to be game on for investors.\"\n\nIn contrast, Noelle Acheson, author of the Crypto Is Macro Now newsletter, said the ruling could help Coinbase in its legal tussle with the SEC, but cautioned against predicting an outsized altcoin rally.\n\nEarly last month, the SEC charged cryptocurrency exchange Coinbase and its offshore rival Binance for offering unregistered securities, a move that injected uncertainty into the market.\n\n\"The ruling should be enough to reawaken greater interest in the shifting market narrative, which itself could be enough to bring in new flows,\" Acheson told CoinDesk.\n\nStory continues\n\n\"However, it's premature to assume that a 'win' is in the bag – the SEC will likely appeal the decision, and given some of the inconsistencies, it might win. At best, the uncertainty will drag on for longer. So, it feels too soon for alt season; that will probably wait until we get greater clarity on the Coinbase case,\" Acheson said.\n\nIn a note to clients on Friday, analysts at K33 Research voiced a similar opinion, saying, \"the ruling will be appealed and might even be reversed, so we expect the ongoing battle to continue.\"\n\nThe court also found Ripple violated securities law when selling XRP directly to institutions. So institutions that bought XRP can come under the regulatory scanner, injecting further uncertainty into the market.\n\n\"It is important to note that institutional investors who purchased directly from Ripple may find themselves subject to class-action litigation as potential underwriters. This is an area to watch closely, especially if big-name venture capitalists were involved,\" CoinShares’ head of product, Townsend Lansing, said. \"The legal landscape continues to change, and we urge all parties to stay informed of these important developments.\""
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbmVhci0xMy1tb250aC1oaWdoLWFzLWludmVzdG9ycy13ZWxjb21lLXJpcHBsZS1ydWxpbmcvYXJ0aWNsZXNob3cvMTAxNzYzNTk0LmNtc9IBhwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbmVhci0xMy1tb250aC1oaWdoLWFzLWludmVzdG9ycy13ZWxjb21lLXJpcHBsZS1ydWxpbmcvYW1wX2FydGljbGVzaG93LzEwMTc2MzU5NC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin near 13-month high as investors welcome Ripple ruling - The Economic Times",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLWxvc3Nlcy0zMGsv0gFCaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvYnRjL2JpdGNvaW4tcHJpY2UtbG9zc2VzLTMway9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Price Fails To Follow Gold After US CPI, More Losses Ahead? - NewsBTC",
        "content": "Bitcoin price failed to gain bullish momentum after the US CPI release. BTC is trading below $30,500 and there is a risk of a drop toward $29,850.\n\nBitcoin failed to clear the $30,850 resistance and reacted to the downside.\n\nThe price is trading below $30,500 and the 100 hourly Simple moving average.\n\nThere was a break below a connecting bullish trend line with support near $30,620 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could continue to move down if it fails to stay above the $30,200 support.\n\nBitcoin Price Faces Another Rejection\n\nBitcoin price attempted a fresh increase above the $30,500 resistance zone. BTC climbed above the $30,750 level but the bears were active near the $30,850 resistance zone.\n\nA high was formed near $30,850 and the price reacted to the downside. There was a break below a connecting bullish trend line with support near $30,620 on the hourly chart of the BTC/USD pair. The pair even declined below the $30,500 support.\n\nA low is formed near $30,230 and the price is now consolidating losses. Bitcoin is now trading below $30,500 and the 100 hourly Simple moving average.\n\nIt is stuck near the 23.6% Fib retracement level of the recent decline from the $30,850 swing high to the $30,230 low. Immediate resistance is near the $30,400 level and the 100 hourly Simple moving average. The next resistance is near the $30,550 zone.\n\nSource: BTCUSD on TradingView.com\n\nThe 50% Fib retracement level of the recent decline from the $30,850 swing high to the $30,230 low is also near $30,550, above which the price could gain bullish momentum. In the stated case, BTC might rise toward the $30,850 resistance. The next major resistance is near the $31,000 level. Any more gains could open the doors for a move toward the $31,400 resistance zone.\n\nMore Losses in BTC?\n\nIf Bitcoin’s price fails to clear the $30,500 resistance, it could start another decline. Immediate support on the downside is near the $30,230 level.\n\nThe next major support is near the $30,000 level, below which there could be a drop toward the $29,850 support zone. Any more losses might send the price toward the $29,400 level in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level.\n\nMajor Support Levels – $30,230, followed by $30,000.\n\nMajor Resistance Levels – $30,400, $30,550, and $31,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10b3BzLTMxNTAwLWV0aGVyZXVtLWFib3ZlLTIwMDAteHJwLXJhbGxpZXMtNjQtYWZ0ZXItY291cnQtcnVsaW5nLTM4OTY3Mi0yMDIzLTA3LTE00gGhAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10b3BzLTMxNTAwLWV0aGVyZXVtLWFib3ZlLTIwMDAteHJwLXJhbGxpZXMtNjQtYWZ0ZXItY291cnQtcnVsaW5nLTM4OTY3Mi0yMDIzLTA3LTE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tops $31,500; Ethereum above $2,000; XRP rallies 64% after court ruling - Business Today",
        "content": "Bitcoin and other crypto tokens were going gaga during the trading session on Friday after Ripple's victory with the US SEC in court. Additionally, the upbeat US inflation data stirred the optimism for the global digital assets, which pushed the token to the massive gains.\n\nBitcoin was back in green, posting some big gains. The largest crypto token jumped as much as 4 per cent to hover around $31,500-mark. Its largest peer, Ethereum, outperformed and rose about 8 per cent to top $2,000-levels. However, other altcoins posted robust gains in the last 24 hours.\n\nBitcoin surged to a one-year high above the $31,700 level following a favorable federal court decision for Ripple. BTC has since consolidated and is now trading at the $30,400 level. The month-to-date performance shows a 3 per cent gain, while the year-to-date increase stands at an impressive 89 per cent, said Edul Patel, co-founder and CEO at Mudrex.\n\n\"Soon after this news, XRP reached its highest point in a year within the last 24 hours outperforming the BTC by surging by over 61 per cent. Ethereum, the second-largest cryptocurrency, has also reached a new high by surpassing the $2,000 mark. The current market sentiment appears to be bullish,\" he added.\n\nMajority of the top crypto tokens were trading with masculine gains on Friday with a number of tokens posting double digit gains. XRP rallied 64 per cent, while Solana surged 31 per cent. Cardano gained more than 25 per cent and Polygon advanced 18 per cent. Avalanche and Polkadot added 13 per cent and 10 per cent, respectively.\n\nThe global cryptocurrency market cap was trading sharply higher, surging to $1.26 trillion-mark, as it jumped almost 7 per cent in the last 24 hours. However, the total trading volumes zoomed about 121 per cent to $67.66 billion.\n\nThe crypto market has registered massive gains in the last 24 hours. The crypto fear and greed index has jumped 3 points to remain in the greed zone with a score of 60/100. These market gains have been triggered by a US court ruling which is partially in favour of Ripple, said said Parth Chaturvedi, Investments Lead, CoinSwitch Ventures\n\n\"The court has stated that the trading of XRP amongst retail investors can't be dubbed as a 'securities' sale. The SEC continues to hold its stance against the ruling and will likely re-appeal, but overall this has set a strong precedent for the sector and has resulted in a massive rally in prices,\" he added.\n\nTech View by Giottus Crypto Platform\n\nRipple is currently experiencing a major rally following the victory from SEC v Ripple case, as the Judge ruled Ripple as not a security for retail investors. The asset almost doubled following the news, soaring to as much as $0.94 and is currently trading in the $0.75 range.\n\nFollowing this bullish breakout, after registering short candles for six consecutive days, a pullback can be expected in coming days. The upward shift has propelled the RSI index to the overbought territory and is currently sitting at 78.3.The notable divergence between the 20-day moving average and 100-day moving average suggests bullish momentum over the near term. If the price manages to successfully surpass the $0.85 mark, this could lead to further increase towards the resistance levels of$1.0.\n\nMajor Levels:\n\nSupport: $0.50, $0.68\n\nResistance: $0.85, $1.0\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLXByZWRpY3Rpb24tYXMtYnRjLWRpcHMtYmFjay1iZWxvdy0zMWstYXMtYmluYW5jZS1sYXlzLW9mZi0xMDAwLXdvcmtlcnMuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Price Prediction as BTC Dips Back Below $31K as Binance Lays Off 1000 Workers - Cryptonews",
        "content": "Bitcoin Price Prediction as BTC Dips Back Below $31K as Binance Lays Off 1000 Workers\n\nBTC/USD Chart / Source: Adobe\n\nA hint of caution has returned to the cryptocurrency market on Friday in wake of the emergence of reports that Binance has laid off roughly 1,000 workers in recent weeks, and that layoffs could continue.\n\nBitcoin (BTC) slipped back under $31,000 per token on the news, which was first reported by the Wall Street Journal, and was last trading with losses of around 2.5% on the day in the $30,700 area.\n\nAs per the WSJ’s report, Binance could eventually let go of up to one-third of its workforce, which had numbered around 8,000 prior to the start of layoffs.\n\nBitcoin’s reversal back under $31,000 comes after the cryptocurrency hit fresh highs for the year on Thursday in the $31,800s.\n\nCrypto markets were buoyed on Thursday by the news that a US judge had ruled that Ripple’s sales of XRP tokens via public exchanges did not constitute a security offering, and that the token was not a security.\n\nBitcoin has also benefitted from macro tailwinds this week in the form of falling US yields, a weakening US dollar and an impressive US stock market rally, all of which was triggered by lower-than-expected US Consumer Price Inflation data released on Wednesday.\n\nThis data led to markets pulling back on Fed tightening bets for the remainder of 2023, with markets now expecting just one more hike, not two (as guided by the Fed), as per the CME Fed Watch Tool.\n\nBitcoin is also likely still benefitting from tailwinds relating to the bombardment of new spot exchange-traded fund (ETF) filings made by numerous Wall Street giants like BlackRock and Fidelity last month.\n\nAnd BlackRock’s CEO Larry Fink continues to jawbone regarding the pros of crypto and bitcoin.\n\nHe was quoted on Friday as saying the cost of transacting physical gold is “absurd”, something that bitcoin, which he calls digital gold, solves.\n\nAnd he also noted that crypto interest is “broad-based” and “worldwide”.\n\nPrice Prediction – Where Next for Bitcoin (BTC)?\n\nBitcoin’s about-turn on Friday, which likely is also a result of heavy profit-taking in light of this year’s impressive rally, confirms that the cryptocurrency isn’t quite yet ready to break out of its recent multi-week range.\n\nHowever, the cryptocurrency is still trading above its all of its major moving averages and the 2023 uptrend remains strongly intact.\n\nWith macro conditions improving and institutional interest on the rise, bulls will remain confident.\n\nBTC will probably soon test major long-term resistance in the $32,500, $33,000 and $34,500 areas.\n\nHigh-Risk Bitcoin Alternative to Consider – Mr Hankey Coin (HANKEY)\n\nBitcoin is widely viewed as digital gold.\n\nThe cryptocurrency that powers the most reliable, secure and decentralized crypto network in the world.\n\nThe complete opposite of a new shitcoin that exploded onto the scene on Friday called Mr Hankey Coin.\n\nMr Hankey Coin, which is based on the famous South Park character of the same name and proudly markets itself as the meme coin world’s top shitcoin, is currently up around 200% since its launch on Uniswap earlier in the day.\n\nWhile it certainly isn’t the next bitcoin, Mr Hankey Coin certainly has all the makings of the next 10 or even 100x meme coin.\n\nThat’s thanks to its massive liquidity lock, still super low market cap, fast-growing social media community and already trending status on DEXTools.com, which is every meme coin degens favorite shitcoin trading tool.\n\nWhile Mr Hankey Coin is far from a sure bet, its potential to pump is high.\n\nMr Hankey Coin can be purchased on Uniswap Here.\n\nVisit Mr Hankey Coin Here\n\nDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvbGl0ZWNvaW4tc2lsdmVyLXRvLWJpdGNvaW5zLWdvbGQtMjAyMzA3MTQxMTAx0gFgaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvbGl0ZWNvaW4tc2lsdmVyLXRvLWJpdGNvaW5zLWdvbGQtMjAyMzA3MTQxMTAx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Litecoin Silver to Bitcoin's Gold - FXStreet",
        "content": "Share:\n\nLitecoin is considered one of the earliest alternative cryptocurrencies to Bitcoin and is sometimes referred to as \"silver to Bitcoin's gold.\" Litecoin is a peer-to-peer cryptocurrency created in October 2011 by Charlie Lee, a former Google engineer, and designed to improve upon some of the limitations of Bitcoin, providing a faster and more efficient cryptocurrency.\n\nLitecoin has consistently been one of the top cryptocurrencies by market capitalization. While it has faced competition from numerous other cryptocurrencies over the years, it has maintained its position as one of the prominent altcoins.\n\nFaster block generation\n\nLitecoin is based on the open-source Bitcoin protocol but has several technical differences. One notable difference is the hashing algorithm used for mining. While Bitcoin uses SHA-256, Litecoin uses a different algorithm called Scrypt, allowing faster block generation.\n\nThus, it has a faster block generation time compared to Bitcoin. While Bitcoin's average block time is around 10 minutes, Litecoin has a target block time of 2.5 minutes. This faster block time enables quicker transaction confirmations. The total supply of Litecoin is capped at 84 million coins, four times the supply of Bitcoin, which, as is known, has a maximum limit of 21 million. Why 84 and not 21 million? Because in 10 minutes, four blocks of Litecoin come out instead of one of Bitcoin.\n\nMining\n\nThe mining process in Litecoin, as in other cryptocurrencies, is crucial in maintaining network security and achieving consensus. Miners compete to find valid hashes, and once a block is mined and added to the blockchain, it becomes part of the immutable ledger. Mining in Litecoin follows a similar concept to Bitcoin mining but as already mentioned, uses a different hashing algorithm called Scrypt, which is more memory-intensive than Bitcoin's SHA-256 algorithm.\n\nThe Litecoin network adjusts the mining difficulty level every 2016 blocks (approximately every 3.5 days) to maintain an average block generation time of around 2.5 minutes. If blocks are being mined too quickly, the difficulty increases, making it harder to find a valid hash. Conversely, the difficulty decreases if blocks are mined too slowly, making it easier to find a valid hash.\n\nWhen miners successfully mine a new block, they are rewarded with a certain number of Litecoins as a block reward. Initially, the block reward was 50 Litecoins, but it reduces by half through a process called halving. As of the most recent halving in August 2019, the block reward stands at 12.5 Litecoins per block. This reward serves as an incentive for miners to contribute their computational power to secure the network.\n\nHalving in Litecoin\n\nHalving in Litecoin occurs every 840,000 blocks, which is roughly equivalent to four years based on the target block time of 2.5 minutes. The first Litecoin halving took place on August 25, 2015, and subsequent halving occurred on August 5, 2019, while in a few weeks, on August 04, 2023, we will once again have the halving phenomenon.\n\nThe primary purpose of halving is to control the issuance rate of new Litecoins and manage inflation. By reducing the block reward, halving gradually decreases the rate at which new Litecoins are introduced into circulation, ultimately leading to a maximum supply of 84 million Litecoins.\n\nExpectations for Litecoin\n\nHalving events often generate interest and anticipation in the cryptocurrency community, as they are seen as significant milestones. The reduction in the rate of new Litecoin issuance, coupled with the increasing demand, can potentially lead to scarcity, which, in turn, may positively impact Litecoin's price.\n\nThis, coupled with data from on-chain analytics company Santiment, which shows that the total number of large Litecoin wallets, i.e. Litecoin addresses with at least 10,000 coins, has increased in recent months, is likely to attest to Litecoin's upward trend. It is also noteworthy that 64% of Litecoin holders are profitable, as on-chain data shows.\n\nAll of the above may suggest that the upward slope of the past few months may develop into a strong uptrend that is likely just around the corner."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vaW52ZXN0bWVudHUuY29tL3dpbGwtYml0Y29pbi1nby1iYWNrLXVwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Will Bitcoin Go Back Up? And if So, When? - Investment U",
        "content": "Will Bitcoin go back up in price? Absolutely. And how about other cryptocurrencies? Some will and others won’t survive a prolonged crypto winter. You see, the crypto markets are the very definition of a news-driven market. A little bit of good news, and markets go up. But a little bit of bad news, and prices can tank quickly.\n\nIf you’ve been following the crypto markets lately, you know there’s a whole lot more bad news than good news going around. Terraform’s LUNA project crumbled. Celsius Network paused all withdrawals, swaps and transfers between accounts. And that’s not the only exchange with questions of solvency looming around it. Coinbase recently let go of 18% of its workforce. Gemini has made similar moves. And there are rumors that plenty of other exchanges could be even worse off.\n\nSo yea, there’s not a lot to be positive about when it comes to crypto right now. That’s why we’ve taken a long view on crypto for the time being. We’re not holding out hope for any major short-term upward movement in price. But in the next couple years, it’s quite possible Bitcoin will not only go back up, but will exceed its former highs.\n\nThat being said, crypto investors recently got a little much-needed good news… In a roundabout sort of way. Talking head Jim Cramer was recently on CNBC’s Squawk Box, where he said:\n\nCrypto really does seem to be imploding. Went from $3 trillion to $1 trillion. Why should it stop at $1 trillion? There’s no real value there.\n\nThis might sound like bad news. But those that have been following Cramer’s crypto advice think otherwise…\n\nWill Bitcoin Go Back Up? Maybe Sooner Than We Thought\n\nSay what you will about the host of Mad Money and his investment advice. We’re sure he’s offered some good information over the past 17 years. But crypto hasn’t proven to be Cramer’s forte. In fact, he’s garnered some notoriety for his coverage of crypto markets.\n\nHe recommended investors take up a sizable stake in Coinbase (Nasdaq: COIN) stock when it was trading around $250 a share. Shares of the popular exchange haven’t fared so well since then. They’ve fallen to below $75 a share.\n\nOn top of this, Cramer first noted he took a stake in Bitcoin in December 2020. He then mentioned he sold most of his stake in Bitcoin in June 2021. His reasoning was that the price wasn’t going up due to structural reasons, regulations and cyberattacks. Whoops. A handful of months later, Bitcoin hit its all-time high of $69,000.\n\nMore recently, back in April, he forecasted that Ethereum was likely to see a 40% short-term gain. Since then, Ethereum has fallen roughly 60%. So again, Cramer doesn’t exactly have a marvelous track record when it comes to crypto. So will Bitcoin go back up in the coming weeks? Maybe months? That’s a hard… maybe. But we’ll certainly be rooting for the “Cramer Effect” to take hold of the crypto markets again.\n\nBut while it would be funny – if not hilarious – if ol’ Jimmy Cramer completely missed the mark yet again, it’s the opposite of a sure thing. More realistically, we’re anticipating Bitcoin (and the crypto markets as a whole) to be pretty quiet for the next couple of years.\n\nThis, of course, offers an interesting long-term investment opportunity. Should folks be investing in crypto right now? Well, that depends…\n\nSome Tokens May Work Out Better Than Others\n\nOf late, we have seen a number of random tokens outperforming the crypto markets at large. That’s not terribly difficult right now, but still…\n\nFor instance, Numeraire (NMR) has been on a solid run of late. And before that, Chainlink, XCAD and MoveZ all went on impressive short-term runs. Some of these tokens jumped up as much as 50% in value. But those gains were short lived for the most part. But this serves as a reminder that even in a sideways market, there’s money to be made. Even for short-term traders.\n\nQuick moves like these are best capitalized on by crypto day traders. They can also be tracked using crypto trading bots. These programs can help take some of the guesswork and chart analysis out of the equation. That being said, there’s less certainty that microcap tokens like these will survive a prolonged downturn in the market. So they may be good for some possible short-term gains, but they offer a bit less assurance for the long haul.\n\nThese price movements also help remind us that there’s still some life in the crypto markets. Even right now. So will Bitcoin go back up? There’s plenty of reason to believe it’ll have its turn again… Just like the smaller tokens mentioned above.\n\nHowever, we’re not suggesting an inevitable demise of any token. For all we know, they could outlive your grandkids. But, if we were to put a sizable investment into any token right now, it would have to be one with some specific characteristics.\n\nFour Elements of a Long-Term Crypto Token\n\nLook for a strong use case. Any crypto worth its salt should have a good reason to exist – beyond simply helping investors head “to the moon.” Reading a token’s whitepaper usually offers the best explanation of its use case (if it has one).\n\nLook for community engagement. A token’s team might have a strong presence on Telegram, Discord or even Twitter where it interacts with folks. That can be a good sign that there is interest from developers, miners, stakers and other folks who have a long-term interest in the project.\n\nLook for longevity. While this isn’t the most important factor. A token that’s been around the block a few times has a better chance at surviving a long bear market than a new one does. Will Bitcoin ever go back up you, you ask. This point is a key reason we think it will. It’s done so time and time again. It’s been down before. And it’s bounced back every other time. Why would this time be any different?\n\nDo all the research above and then some. Any investment worth making is worth some extra time investigating. Look into the management team behind the project. (Although this obviously doesn’t apply to the mystery team behind Bitcoin.) Check to make sure a token’s liquidity pool is solvent.\n\nWill Bitcoin Go Back Up: The Bottom Line\n\nThere’s ample reason to believe Bitcoin and the crypto markets in general will eventually bounce back. Whether that comes from the next Bitcoin halving in 2024 or the “Cramer Effect,” we’re not sure. But in the meantime, the down markets have given folks a whole lot more buying opportunities than they had a few months ago.\n\nWill Bitcoin go back up? Almost assuredly. However, it’s likely to see a whole lot of volatility in the meantime. So the key here is to only invest what you can live without for the next couple years. Don’t dip into the rainy day fund to invest in crypto. It might rain. We highly recommend only investing what you could reasonably consider lost money in the short term."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1idGMtYml0Y29pbi1ldGhlcmV1bS1zaGliYS1pbnUtc29sYW5hLXBvbHlnb24tZG9nZWNvaW4tMTcyMjE5NzEuaHRt0gGJAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9waG90b3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJ0Yy1iaXRjb2luLWV0aGVyZXVtLXNoaWJhLWludS1zb2xhbmEtcG9seWdvbi1kb2dlY29pbi0xNzIyMTk3MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum and other tokens gain, Solana surges 33% - CNBCTV18",
        "content": "1 / 7\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, gained 2.68 percent to $31.236. Its market value stood at $606.96 billion. The trade volume was at $26.33 billion.\n\n2 / 7\n\nEthereum | The second largest virtual currency, Ethererum or Ether, gained 6.78 percent to $2,000.43 with a market capitalisation of $240.33 billion. The trade volume of Ethereum was $12.94 billion in the last 24 hours.\n\n3 / 7\n\nDogecoin | Meme-based virtual currency, Dogecoin, was up 8.49 percent. Its market value stood at $9.87 billion. The trade volume was at $774.62 million.\n\n4 / 7\n\nShiba Inu | Shiba Inu gained 6.55 percent with a market capitalisation of $4.69 billion. The trade volume was $225.89 million in the last 24 hours.\n\n5 / 7\n\nSolana | Solana gained 33.30 percent to $29.142 with a market capitalisation of $11.58 billion. The trade volume of Solana was $2.54 billion in the last 24 hours.\n\n6 / 7\n\nPolygon | Polygon gained 18.73 percent with a market capitalisation of $7.99 billion. The trade volume was $1.07 billion in the last 24 hours.\n\n7 / 7"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjM5MTMxL3dhbGxldC1wYXktYml0Y29pbi10ZXRoZXItdG9uY29pbi10ZWxlZ3JhbdIBUmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzIzOTEzMS93YWxsZXQtcGF5LWJpdGNvaW4tdGV0aGVyLXRvbmNvaW4tdGVsZWdyYW0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Wallet Pay enables Bitcoin, Tether and Toncoin payments on Telegram - The Block",
        "content": "Wallet, the crypto and payment solution based on The Open Network (TON) and integrated into Telegram, is launching Wallet Pay, enabling Bitcoin, Tether and Toncoin merchant payments on the popular messaging app.\n\nVendors and Wallet Pay users can use the crypto assets to make instant and secure payments for goods and services. “The smooth and simple payment process requires just a few taps within either the merchant’s bot or web application on Telegram,” a statement provided by the TON Foundation said.\n\nTON Foundation is a non-commercial group of supporters and contributors behind TON blockchain.\n\nTelegram's 700 million users\n\nWallet Pay users don’t have to hold the cryptocurrencies beforehand and can top up their Wallet account using a bank card during the payment process. While Wallet Pay is for transactions between consumers and merchants, peer-to-peer crypto transfers between users are also available in Telegram via the @wallet bot.\n\nThe TON Foundation said the integration would enable merchants to tap into Telegram's vast user community of over 700 million individuals.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\n\"Various businesses can leverage the Telegram and TON ecosystems by utilizing Wallet Pay's seamless payment solution,” TON Foundation founding member Andrew Rogozov said in the statement. “By developing and promoting such a frequently demanded functionality, we are taking another step towards the mass adoption of cryptocurrency, which is the core mission of TON.\"\n\nUsers can trial Wallet Pay's public beta via the Wallet Pay bot or apply as a merchant via its website, with further updates on scaling and availability of the technology expected soon.\n\nThe Open Network was originally designed in 2018 by the founders of Telegram Messenger and later handed over to the TON community to continue its development.\n\nLast month, TON Foundation proposed a burn mechanism for TON network, suggesting a 50% transaction fee burn."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xNDg2MTIvYmxhY2tyb2NrLWNlby1sYXJyeS1maW5rLWNyeXB0by10cmFuc2NlbmQtY3VycmVuY3nSAVJodHRwczovL2RlY3J5cHQuY28vMTQ4NjEyL2JsYWNrcm9jay1jZW8tbGFycnktZmluay1jcnlwdG8tdHJhbnNjZW5kLWN1cnJlbmN5P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "BlackRock CEO Larry Fink: Crypto Will 'Transcend Any One Currency' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlackRock boss Larry Fink has upped his bullish stance on cryptocurrency as an investment, today saying that “it’s going to transcend any one currency.”\n\nThe CEO of the world’s largest asset manager said in a Friday interview with CNBC that although he couldn’t talk about Bitcoin specifically as BlackRock had filed an application with the U.S. Securities and Exchange Commission for a spot market Bitcoin ETF, crypto “has a differentiating value versus other asset classes.”\n\nBlackRock—which manages $9.5 trillion in assets—last month applied to the SEC for a spot Bitcoin exchange-traded fund, leading institutional investors to pour money into the space and in turn causing the asset to jump to a 12-month high.\n\nAD\n\nAD\n\n“We believe we have a responsibility to democratize investing,” he said regarding ETFs. “Over the last five years, more and more global investors are asking us about the role of crypto—and like I said, I do think a lot of crypto is an international asset.”\n\n“More importantly, because it’s so international, it’s going to transcend any one currency in currency valuation,” he continued, adding that an “international crypto product” can “transcend” the problem of dollar devaluation.\n\nA spot market Bitcoin ETF would give institutional investors access to Bitcoin without having to deal with complex storage issues, which could mean more money flowing into the market should an ETF ever be approved.\n\nETFs are popular investment vehicles that allow people to buy shares that track the value of an underlying asset like gold, foreign currencies, or cryptocurrency.\n\nA spot Bitcoin ETF does not yet exist in the U.S., but a number of high-profile investment firms have applied to the SEC for one. The SEC has been reluctant to approve such a product, though, citing market manipulation as one of the concerns.\n\nAD\n\nAD\n\nJust last week, billionaire Fink said the role of crypto is “digitizing gold” and that Bitcoin was “an international asset.”\n\nBut back in 2017, he said that “Bitcoin just shows you how much demand for money laundering there is in the world.” He changed his stance over the years, later claiming that it was a “great asset.”"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi93aHktaXMtYml0Y29pbi1wcmljZS11cC10b2RheS0yL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi93aHktaXMtYml0Y29pbi1wcmljZS11cC10b2RheS0yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Why Is Bitcoin Price Up Today? - NewsBTC",
        "content": "The Bitcoin price tagged a new yearly high yesterday at $31,840, leaving market participants wondering about the driving forces behind this bullish momentum.\n\nThe Power of Economic Indicators\n\nOne of the crucial factors contributing to Bitcoin’s upward trajectory was the release of the United States Producer Price Index (PPI) data. The latest figures revealed a significant slowdown in inflation, with PPI YoY dropping to 0.1% in June, surpassing expectations and marking the smallest pace since August 2020. Notably, the Core PPI YoY came in at 2.4%, slightly below the estimated 2.6%, reinforcing the notion of a diminishing inflationary environment.\n\nThis decrease in PPI is seen as a positive sign for the Consumer Price Index (CPI), providing hope for a more stable economic landscape. Macro researcher Mortensen Bach emphasized the significance of the PPI’s impact, stating, “PPI always leads CPI. Inflation is no longer a thing and input prices clearly indicate that! Deflation remains the primary risk going forward. This is what happens when you have a Federal Reserve who is blindly focused on backward-looking data!”\n\nEchoing these sentiments, macro analyst Ted added, “PPI inflation leads CPI by a few months… and today’s PPI numbers have YoY running at +0.24%. Almost in deflation! Fed pivot anyone?”\n\nAlso worth noting is that, May PPI inflation was revised lower from 1.1% to 0.9%. May Core PPI inflation was revised lower from 2.8% to 2.6%. The drop and revision lower in Core PPI is what the US Federal Reserve wants to see.\n\nInverse Correlation With The DXY\n\nAnother pivotal factor driving Bitcoin’s surge is the recent drop in the US Dollar Index (DXY) below 100.00, a level not seen in 15 months. This development has sparked renewed interest in risk assets like Bitcoin as a hedge against a weakening dollar.\n\nThe inverse correlation between the DXY and Bitcoin has historically played a significant role in the cryptocurrency’s price movements, and this recent drop in the DXY has acted as yet another bullish catalyst.\n\nRipple’s Partial Victory\n\nThe ongoing legal battle between Ripple Labs and the US Securities and Exchange Commission (SEC) has probably provided another boost to Bitcoin’s price. Ripple’s partial victory in the case has generated optimism in the crypto community and can be seen as a net positive event for Coinbase, which is embroiled in its own legal dispute with the SEC.\n\nInterestingly, Coinbase serves as the exchange partner for all U.S. Bitcoin spot Exchange-Traded Funds (ETFs) currently filed with the SEC. Recently, chair Gary Gensler’s comments on Coinbase’s involvement in ETF filings have raised concerns about the suitability of the exchange as a market surveillance sharing partner, as Bitcoinist reported.\n\nEric Balchunas, a Senior ETF analyst for Bloomberg, expressed his apprehension, suggesting that “SSA could be pointless if this is a problem for him.” With this in mind, the Ripple victory can also be seen as extremely positive news for the approval of a Bitcoin spot ETF, as Coinbase could benefit from the ruling in its case against the SEC.\n\nAt press time, the BTC price retraced to $31,250, up 2.6% in the last 24 hours.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3Lm91dGxvb2tpbmRpYS5jb20vY3J5cHRvL2NyeXB0by1wcmljZS11cGRhdGUtZ2xvYmFsLW1hcmtldC1yYWxsaWVzLTYtNS1hcy1iaXRjb2luLWV0aGVyZXVtLXNlZS1iaWctZ2FpbnMtbmV3cy0zMDI3NjTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Update: Global Market Rallies 6.5% As Bitcoin, Ethereum See Big Gains - Outlook India",
        "content": "XRP (XRP) was the most trending and the top gainer cryptocurrency, up 66.47 per cent to $0.7873. Its 24-hour trading volume was $12.7 billion. ECash (XEC) was the top loser, down 4.40 per cent to $0.00003134. Its 24-hour trading volume was $72 million."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXNpbGVudGx5LWJyZWFjaGVzLXJlc2lzdGFuY2Utc3B1cnJlZC1ieS1hbHRjb2luLXJhbGx5L9IBWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXNpbGVudGx5LWJyZWFjaGVzLXJlc2lzdGFuY2Utc3B1cnJlZC1ieS1hbHRjb2luLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin silently breaches resistance, spurred by altcoin rally - AMBCrypto News",
        "content": "CryptoQuant revealed that Bitcoin miners increased their accumulation over the last few weeks.\n\nHowever, the latest data suggested that selling sentiment was dominant.\n\nThe crypto market was witnessing a bull rally as most altcoins’ charts were painted green. While several of the cryptos’ registered double digit growth, Bitcoin [BTC] seemed to have taken a back seat.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nHowever, the surface-level observation was not true, as the king of cryptos broke out of its $31k resistance.\n\nBitcoin is the silent achiever\n\nThe altcoin market is booming as crypto prices have skyrocketed since XRP’s court ruling. XRP, in particular, registered a 24-hour uptick of over 71%. BTC, on the other hand, was relatively slow to move.\n\nAccording to the CoinMarketCap, BTC’s price had increased by nearly 4% and 4.5% in the past day and week, respectively. At the time of writing, BTC was trading at $31,392.93 with a market capitalization of over $609 billion.\n\nBut as per Santiment’s 14 July tweet, BTC was also to cross a key resistance level of $31,500 for the first time since June 2022. However, at press time, it again fell under that bar.\n\nIt was interesting to note that sharks and fish were the key contributors to this achievement. The tweet pointed out that while whales were shedding their holdings, sharks and fish, on the other hand, were accumulating more Bitcoin.\n\n? While eyes are on $XRP‘s huge run, #Bitcoin quietly broke out of its resistance and has breached $31.5k for the first time since June 1st, 2022. Other assets may have bigger returns, but don’t overlook $BTC‘s significance & how its addresses fluctuate. https://t.co/rujTjKsVi8 pic.twitter.com/jKhK9V6opm — Santiment (@santimentfeed) July 14, 2023\n\nAdditionally, the latest CryptoQuant analysis revealed that apart from investors, miners also played their part in pushing up BTC’s price. Takeronchain, an analyst and author at CryptoQuant, used the Exchange to Miners Indicator to reveal an interesting update.\n\nAs per the analysis, the miners-to-exchange indicator has experienced a moderate increase, lower than the exchange-to-miners indicator. This suggested that the miners had a stronger inclination to retain their Bitcoin holdings.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nNot everything is picture perfect\n\nWhile the aforementioned metrics looked ambitious, the ground reality was different. For instance, miners’ sentiment changed, as evident from the red Miners’ Position Index (MPI). Bitcoin’s aSORP was also red, meaning that miners were selling their assets at a profit.\n\nA similar selling sentiment was also revealed by Bitcoin’s increase in exchange reserves, which could halt BTC’s gains. Additionally, BTC’s taker buy/sell ratio revealed that selling sentiment was dominant in the derivatives market, which was concerning."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmVxdWl0aS5jb20vdWFlLWVuL25ld3MvdHJhZGluZy1pZGVhcy9iaXRjb2luLWhhbHZpbmdzLWEtbG9vay1pbnRvLXRoZS1wYXN0LWFuZC1mdXR1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "A comprehensive analysis of Bitcoin halvings and their implications, along with predictions for the next expected event - Equiti Global",
        "content": "The previous halvings have caused significant market movements by increasing both the value of the cryptocurrency and the interest from investors\n\nThere has been three Bitcoin halvings so far and the next halving is expected to happen in April 2024\n\nBitcoin halvings refer to the reduction of the block reward that cryptominers receive for adding blocks to the blockchain\n\nWhat is a Bitcoin halving?\n\nWhen cryptominers add new blocks to the Bitcoin blockchain, they are rewarded with a portion of the currency. This is called the block reward. Bitcoin halvings are an integral part of the Bitcoin protocol as they reduce the block reward by half every 210,000 blocks. However, due to the dynamic nature of the Bitcoin blockchain it’s hard to accurately predict the precise timing of future halvings.\n\nThe time it takes to add a new block to the Bitcoin blockchain can vary, although the protocol aims for a block time of 10 minutes. To maintain this target, the mining difficulty automatically adjusts in response to the rate of block additions. If blocks are mined too quickly, the difficulty increases, and if they are mined too slowly, the difficulty decreases. These adjustments take place approximately every 2016 blocks, or roughly every two weeks.\n\nIn the world of Bitcoin, the halving events have become highly anticipated moments that often spark significant market movements. There has already been three halvings of bitcoin, and as the next one is on the horizon, it's worth examining the history of these events and exploring their potential impact on the future of the world's most popular cryptocurrency.\n\nThe first Bitcoin halving occurred in November 2012, followed by the second in July 2016, and the third in May 2020. While it is impossible to forecast the exact duration for adding blocks to the Bitcoin blockchain, most estimates suggest that the next Bitcoin halving will occur in early April 2024. As the halving approaches, the accuracy of these estimates tends to improve.\n\nThe future of Bitcoin halving is of great interest to investors, traders, and enthusiasts alike. While past performance does not guarantee future results, the historical patterns surrounding halvings have instilled optimism within the Bitcoin community. The reduced block rewards resulting from halvings contribute to the scarcity narrative of Bitcoin, fuelling expectations of increased demand and, consequently, a potential surge in its price.\n\nHistory of Bitcoin halvings\n\nThe path of Bitcoin's halvings has been characterized by significant milestones, price volatility, and a growing interest from various investors.\n\nTo gain a better understanding of the significance of Bitcoin halvings, let's have a look at the previous halvings. It becomes evident that each halving event has been accompanied by a substantial surge in the price of Bitcoin. In other words, the price at each subsequent halving has exceeded the price observed during the previous event.\n\nThe pre-halving period\n\nBefore Bitcoin's historic first halving event in 2012, a period known as the pre-halving era shaped the early days of the cryptocurrency. This phase, which spanned from Bitcoin's launch on January 3, 2009, to November 28, 2012, witnessed significant developments and laid the groundwork for the digital asset's future.\n\nDuring this period, the Bitcoin protocol awarded cryptominers with a generous block reward of 50 BTC. Notably, the enigmatic figure known as Satoshi Nakamoto, Bitcoin's pseudonymous creator, played an active role in mining Bitcoin and amassed a substantial amount of the digital currency. Estimates suggest that Nakamoto potentially mined between 750,000 and 1.1 million BTC, rendering them one of the wealthiest individuals on the planet if they are still alive.\n\nKey figures from the pre-halving period:\n\nBlock reward: 50 BTC\n\nBitcoins mined: 10.5 million\n\nHighest price: $29.6\n\nLowest price: $0.06\n\nThe first halving\n\nOn November 28, 2012, the Bitcoin network witnessed its inaugural halving event, effectively reducing the block reward to 25 BTC. This marked the beginning of the first halving cycle, coinciding with Bitcoin's rise to prominence in mainstream circles. Notably, Bitcoin gained attention for its utilization on dark web marketplaces such as Silk Road during this period. Additionally, the collapse of the Mt. Gox cryptocurrency exchange garnered significant media coverage.\n\nKey details of the first halving:\n\nHalving date: November 28, 2012\n\nBlock reward: 25 BTC\n\nBitcoins mined: 5.25 million\n\nHighest price: $1,170\n\nLowest price: $12.4\n\nThe second halving\n\nThe second Bitcoin halving occurred on July 9, 2016, ushering in a new era with a block reward of 12.5 BTC. This phase witnessed heightened competition for Bitcoin in the cryptocurrency market as Ethereum emerged as an attractive competitor. The popularity of Initial Coin Offerings (ICOs) also contributed to a crypto market bubble that reached its peak in late 2017 and early 2018.\n\nDespite the growing competition, Bitcoin investors still had the opportunity to reap substantial gains, with the price surging to nearly $20,000 during this cycle.\n\nKey details of the second halving:\n\nHalving date: July 9, 2016\n\nBlock reward: 12.5 BTC\n\nBitcoins mined: 2.625 million\n\nHighest price: $19,400\n\nLowest price: $8,590\n\nThe third halving\n\nOn May 11, 2020, the highly anticipated third Bitcoin halving took place, reducing the block reward to 6.25 BTC. This event pushed Bitcoin into uncharted territory, with its market capitalisation surpassing $1 trillion for the first time ever. Bitcoin's value skyrocketed to an all-time high of $67,450, attracting attention from both sophisticated investors and a broader mainstream audience.\n\nAs the current halving cycle unfolds, the Bitcoin community eagerly awaits the upcoming fourth halving.\n\nKey details of the third halving:\n\nHalving date: May 11, 2020\n\nBlock reward: 6.25 BTC\n\nBitcoins mined: 1.3125 million\n\nHighest price: $67,400\n\nLowest price: $535\n\nHow many Bitcoin halvings will there be?\n\nBitcoin, with a maximum supply of 21 million BTC, has seen 19.22 million BTC mined to date. As the mining process progresses, the remaining Bitcoin becomes scarcer, intensifying the competition among cryptominers. Once the full 21 million BTC are mined, Bitcoin miners will no longer receive block rewards, relying solely on transaction fees paid by users.\n\nThe future holds numerous Bitcoin halvings, as these events will continue until the very last Bitcoin is mined. In total, there will be 32 Bitcoin halvings, meaning that there are still 29 halvings yet to occur.\n\nAs we anticipate the upcoming Bitcoin halving in 2024, it's worth noting that by that time, approximately 93.7% of the total Bitcoin supply will have been mined, leaving a diminishing number of new coins entering circulation.\n\nMarket impact of Bitcoin halvings\n\nBitcoin halvings have captivated the cryptocurrency industry, marking pivotal moments that shape the Bitcoin mining economy and instigate cyclical price movements within the market.\n\nThe scarcity of Bitcoin resulting from these halvings is a driving force behind its value proposition. With a limited supply and increasing demand, Bitcoin has garnered attention from institutional investors and mainstream audiences alike. This unique economic model contributes to the narrative of Bitcoin as a store of value and a potential hedge against inflation.\n\nWhile the specific impact of future halvings on the Bitcoin market remains uncertain, historical patterns suggest that halvings often coincide with increased market activity and upward price trends. Market participants closely monitor these events, seeking potential opportunities for investment and speculation.\n\nAs the cryptocurrency landscape continues to evolve, Bitcoin halvings remain a focal point for market participants. They represent a crucial mechanism designed to regulate the issuance of new Bitcoins, exerting influence on the supply and demand dynamics of the digital asset. Whether the trend of price appreciation at each halving will persist is uncertain, but the anticipation and speculation surrounding these events continue to capture the attention of the crypto community.\n\nIn summary, Bitcoin halvings hold tremendous significance for the crypto industry, regulating the mining economy and fostering market dynamics. With 29 more halvings on the horizon, Bitcoin's limited supply and the potential for increased scarcity continue to capture the attention of market participants. As we journey towards the last Bitcoin being mined, the crypto community eagerly awaits the future halvings and their impact on the ever-evolving Bitcoin ecosystem."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvZmFzdGVzdC13YXktdG8tYnV5LWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Fastest Way to Buy Bitcoin [2024] | Step-by-Step - Finbold - Finance in Bold",
        "content": "Summary: If you are looking for the fastest way to buy Bitcoin, consider acquiring BTC through a regulated third-party cryptocurrency trading platform, such as BYDFi.\n\nAll-in-One Crypto Exchange - Get Your First Coins in 2 Minutes Multiple Licenses - Reliable and Regulated\n\nService Diversification - One-Stop Trading Platform\n\nCopy Trading - Get Copied, Get Paid\n\nEasy Deposit & Withdrawal - From Fiat to Crypto, Fast and Easy 500,000+ Users Get Started\n\nAbout Bitcoin\n\nWhat is Bitcoin (BTC)? Bitcoin ( BTC ) is a decentralized cryptocurrency known for being the first successful electronic money based on peer-to-peer technology that you can use for transactions without any intermediary service, such as banks . Created by an anonymous person or collective with the pseudonym Satoshi Nakamoto , Bitcoin is fully decentralized, with a public ledger that lists every transaction made with the cryptocurrency.\n\nBitcoin’s blockchain, or digital body of interlinked transaction data, can be accessed and edited by anyone. Although this sounds risky, this is the blockchain’s core perk: the majority of stakeholders must verify each transaction, making fraud extremely difficult to pull off.\n\nAfter Bitcoin, many other altcoins came forth, such as Ethereum (ETH), XRP, and Dogecoin (DOGE). The estimated number of cryptocurrencies in circulation as of December 2023 is over 8,850.\n\nWhere to buy Bitcoin?\n\nBitcoin is the most popular cryptocurrency, so investors regularly buy and use it to diversify their portfolios. As BTC remains the most popular crypto investment asset, virtually all cryptocurrency exchanges trade it as part of their service.\n\nYou can buy Bitcoin as part of active day trading efforts to profit from price changes or to hold on to it in anticipation of its value rising. Regardless of which, the best way to buy BTC is via BYDFi, a regulated and competitive crypto investing service that provides investors with the following:\n\nOver 400 different crypto assets;\n\nCopy trading;\n\nAdvanced features such as pot, leveraged pairs, and perpetual with up to 150x leverage;\n\nA significant degree of regulation (such as MSB and FINTRAC registration for the US and Canada);\n\nUser-friendly interface.\n\nAdditionally, BYDFi maintains tight security measures and implements the ‘Know Your Customer’ policy, making it a safe platform to trade cryptocurrencies.\n\nHow to buy Bitcoin fast: step-by-step\n\nBuying Bitcoin with BYDFi can be done in two minutes with a straightforward and quick procedure.\n\nStep 1: Create a free account on BYDFi website or app\n\nVisit the BYDFi website and click the [Get Started] button in the top right corner of the screen.\n\nAlternatively, initiate the process using an email sign-up prompt in the center of the page. Type in your email address and press the [Get Started] button.\n\nOnce you do this, the platform will give you two account registration options: via an email address and through a phone number.\n\nEmail registration:\n\nIf you decide to register using an email, type in your address and press [Send] to start the verification process. Once done, BYDFi will send you an email with a six-digit verification code, which you should copy and paste into the field.\n\nMove on to create a login password. Click on the circle next to the terms and conditions to check them. Optionally, you can type in an invitation code in the respective field.\n\nAfter that, press the orange [Get Started] button.\n\nMobile registration:\n\nThe procedure is similar for registration via phone number. BYDFi will send the verification code by SMS; the rest of the steps should be followed as in the first method.\n\nYou are now an owner of a BYDFi account and one step closer to buying Bitcoin. The next step is to fund the newly-made account.\n\nStep 2: Decide on the amount and buy Bitcoin\n\nAfter creating an account and logging in, the next step is to transfer the funds and buy Bitcoin.\n\n1. Click the [Buy Crypto] button on the top left side of the main navigation bar.\n\n2. Find and select BTC as the receiving coin and choose the fiat currency you want to buy it with.\n\n3. Scroll down to see the payment channels and select your preferred method. Note that third-party services may charge a fee for fiat deposits. The BYDFi platform does not process fiat purchases directly.\n\n4. Depending on your preference, after you press [Buy Now], you will get several payment options:\n\nCredit card payment;\n\nApple Pay;\n\nGoogle Pay;\n\nCashApp;\n\nBank wire.\n\nConsider the amount of BTC you want to purchase. Transfer times will be different depending on the payment method you choose. As for BYDFi, the transaction is complete within 2-10 minutes.\n\nStep 3: Review the fees and confirm your order\n\nBYDFi will provide precise information on fees, costs, and the number of BTC tokens you receive once you confirm the order and make the transaction.\n\nThe platform’s fees are straightforward and competitive – crypto spot trading fees range between 0.1% and 0.3% of the transaction amount, depending on the cryptocurrency you invest in. BYDFi does not have deposit fees, only a flat fee per transaction to cover the maintenance costs. Third-party crypto exchanges and fiat transfer services may introduce their own rates if mandated by your trading method.\n\nStep 4: Set up storage\n\nWe are nearing the end of the process; you confirmed your order and received (or are about to receive) the tokens. You can hold the received sum of BTC in your BYDFi account or store it in a personal crypto wallet.\n\nWhen it comes to storage, BYDFi securely stashes your crypto investment in offline devices named cold wallets. Regardless, if you want to, you can manage security yourself and use a crypto wallet of your own. Either way, you should limit or completely deny potential access points to your digital portfolio.\n\nUltimately, even if the platform goes through a digital breach, hackers will not run away with your tokens, as BYDFi’s servers do not keep a record of private keys.\n\nTrading tips for the fastest buying of Bitcoin\n\nTrading Bitcoin, or any other cryptocurrency, requires meticulous planning and preparation. In order to be ready for the potential challenges of investing, you need to understand both the market and the asset.\n\nSo, to maximize your profit, make sure you do your research before you put your money into any speculative asset. Follow the golden rule: ‘Plan your trade and trade your plan.’ To manage the risks involved, diversify your portfolio. Finally, familiarize yourself with the following:\n\nNote If you want to learn more about crypto trading, check out our ‘How to Invest in Crypto’ guide to strengthen your trading position.\n\nBTC price today\n\nPros and cons of buying Bitcoin\n\nPros Store of value : Bitcoin carries the title of ‘digital gold’, as investors expect it to retain value over time;\n\n: Bitcoin carries the title of ‘digital gold’, as investors expect it to retain value over time; High liquidity : As BTC is accepted in many commercial activities, even becoming a legal tender in some countries, it is highly liquid, and you can change it to and from cash quickly;\n\n: As BTC is accepted in many commercial activities, even becoming a legal tender in some countries, it is highly liquid, and you can change it to and from cash quickly; Historically high returns : Quickly after it entered commercial use, Bitcoin became the best-performing asset in the past decade. Even small companies and individuals who invested in Bitcoin early on made colossal success stories;\n\n: Quickly after it entered commercial use, Bitcoin became the best-performing asset in the past decade. Even small companies and individuals who invested in Bitcoin early on made colossal success stories; Fixed supply: As Bitcoin has a set number of tokens, it has a deflationary aspect that is expected to boost each coin’s value. Cons Volatile : Cryptocurrencies are volatile assets that have to be regularly monitored: Bitcoin, although stabler than many, is not an exception;\n\n: Cryptocurrencies are volatile assets that have to be regularly monitored: Bitcoin, although stabler than many, is not an exception; Competition : Although it is still the best-performing token, BTC has gained thousands of rivals in past years, all vying for dominance. If any crypto coin provides a better transaction formula, Bitcoin will decrease in significance;\n\n: Although it is still the best-performing token, BTC has gained thousands of rivals in past years, all vying for dominance. If any crypto coin provides a better transaction formula, Bitcoin will decrease in significance; High energy consumption : Bitcoin functions on the proof-of-work consensus, incentivizing miners to run specialized computers that consume stunningly large amounts of energy;\n\n: Bitcoin functions on the proof-of-work consensus, incentivizing miners to run specialized computers that consume stunningly large amounts of energy; Low TPS: Bitcoin has significantly fewer transactions per second, unlike some of its peers like Solana.\n\nMistakes to avoid when investing in cryptocurrencies\n\nMistakes do hurt, but some are inevitable in this branch of commerce. However, you can easily prevent making some common investing mistakes that others have made if you follow specific guidelines. What you should avoid at all costs includes:\n\nNot doing research : Many decisive factors make the crypto market turn. Thoroughly researching them is necessary if you want to increase your investment’s success;\n\n: Many decisive factors make the crypto market turn. Thoroughly researching them is necessary if you want to increase your investment’s success; Not considering their budget : There are no guaranteed outcomes in investing. All crypto coins have volatile periods, even Bitcoin. Invest only what you can afford to lose ;\n\n: There are no guaranteed outcomes in investing. All crypto coins have volatile periods, even Bitcoin. Invest ; Falling for fraud : Rug pulls and pump and dump schemes occur frequently in the crypto market, most targeting novice traders. Trade crypto with caution and via regulated and authorized services only;\n\n: Rug pulls and pump and dump schemes occur frequently in the crypto market, most targeting novice traders. Trade crypto with caution and via regulated and authorized services only; Neglecting security : The security of your investments is just as important as earning money in the first place. Consider using a crypto wallet;\n\n: The security of your investments is just as important as earning money in the first place. Consider using a crypto wallet; Impulsive decision-making: Conclusions made and followed through under emotional stress can harm your investment goals. Keep your head cool and your hand steady.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk.\n\nFAQs about the fastest way to buy Bitcoin:\n\nHow to buy Bitcoin? The fastest way to buy BTC online is through a professional and competitive intermediary crypto exchange service, such as BYDFi.\n\nWhere to buy Bitcoin? Virtually all cryptocurrency exchanges offer Bitcoin, and you can get it with the help of a third-party cryptocurrency exchange. Consider BYDFi as a recommended candidate.\n\nHow to buy Bitcoin with a credit card? You can trade for Bitcoin using a credit card on BYDFi. It is a standard procedure and is available for every payment method on the platform.\n\nHow to buy Bitcoin in the US? Most US-based exchanges offer BTC, and you can purchase it through many international brokerages.\n\nHow to buy Bitcoin in the UK? You can buy BTC in the UK through every major cryptocurrency exchange. You will need to use the services of an online cryptocurrency brokerage like BYDFi."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2J0Yy1wcmljZS1wcmVkaWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "BTC Price Prediction: Bitcoin's Unbelievable Forecast for 2032 - Investment U",
        "content": "The BTC price prediction for the next decade is staggering. In fact, most analysts believe the poster child of the cryptocurrency market is set to take off even further. Bitcoin is down more than 50% in the past year due to the market downturn, regulations and crypto uncertainty. However, experts are still riding high on Bitcoin. Let’s take a further look at the BTC price prediction and what this could mean for investors.\n\nBTC Price Prediction 2022-2032\n\nBitcoin truly rose to prominence in 2020 before taking off in 2021. Specifically, it hit an all-time high of $68,990.90 in November of 2021. But it has come back down to Earth in 2022, much like the rest of the market. It’s trading around $20,000 at the moment and is facing extreme levels of volatility.\n\nBitcoin launched in 2009 and its price climbed more than 9,000,000% over the next 11 years! And this is despite the crypto winter in 2018 when the entire market took a major hit. It rose to historic levels soon after, but now it’s down again due to what experts believe to be the global climate. Recession fears are everywhere, inflation is soaring and spending is down. Moreover, this isn’t just affecting cryptocurrencies. The traditional stock market is in a downturn as well.\n\nYet, the BTC price prediction remains strong moving forward. And it really isn’t that hard to understand why. Bitcoin is a household name. It’s the largest cryptocurrency in the world by a huge margin. And it’s proven to recover better than any digital currency on the market.\n\nBitcoin has staying power and a lower barrier to entry right now. Furthermore, the crypto boom is still alive and well due to a surge of new, young and energetic investors. As a result, most analysts consider Bitcoin to be a home run investment over the next decade.\n\nThe current BTC price prediction has Bitcoin hovering around $200K by 2027. By 2030, the average projection is sitting at half a million dollars! And by 2032, it could hit $800K or more. These are lofty expectations, but major players such as Changelly are sticking to these forecasts.\n\nLong-Term Investing in Bitcoin\n\nBitcoin isn’t going anywhere. And its projections are better than almost any other investment in the world. However, you must take the BTC price prediction with a grain of salt, so to speak. It’s clear that Bitcoin has massive long-term value. But will it really hit $1 million in the next decade? I highly doubt it. And that’s not a bad thing.\n\nThe likelihood that Bitcoin hits $1 million by 2032 is quite low. But it’s looking like major growth is on the way nonetheless. Coming close to $500K would bring in massive, life-changing gains for current investors who hold on for the long-term. And while the price is down to $20,000, it may be worth making an investment. As you can see, the experts are very optimistic about Bitcoin’s future. And these are people who spend all day analyzing Bitcoin’s price fluctuations, history, news cycles and everything in-between.\n\nInvesting in Cryptocurrencies\n\nThe cryptocurrency market comes with higher risks than traditional stocks. Therefore, it’s important to do your due diligence before making any investment decisions. But this doesn’t mean you should cast aside cryptocurrencies altogether. With higher risks comes higher rewards. And many Americans have made millions of dollars investing in cryptocurrencies.\n\nTo learn more about the current market and potential investment opportunities, sign up for one of the best investment newsletters. There are various e-letters that provide expert analysis, trends and chart breakdowns for absolutely FREE. This research may help you enhance your portfolio when it needs it most. And you don’t want to miss out on the next big investment that takes off.\n\nIt’s clear the BTC price prediction has long-term investors licking their chops and dreaming of riches. Nevertheless, keep a close watch on Bitcoin and determine if it’s the right fit for your investment portfolio."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYm9sZC5jb20vdGhpcy1pbmRpY2F0b3Itc3VnZ2VzdHMtYml0Y29pbi1qdXN0LXN1cnZpdmVkLXRoZS13b3JzdC1iZWFyLW1hcmtldC1ldmVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "This indicator suggests Bitcoin just survived the 'worst bear market ever' - Finbold - Finance in Bold",
        "content": "Although Bitcoin (BTC) is still trading in a largely sideways trend, indicators suggest that the flagship decentralized finance (DeFi) asset has just got out of a lengthy bear market and has embarked on a bullish journey that might see it massively growing its price.\n\nIn fact, Bitcoin’s 200-week moving average (200WMA) suggests that the recent bear market was the worst in history for the maiden cryptocurrency, as observed in a chart pattern analysis by the crypto market expert PlanB also known as 100trillionUSD, and shared on July 12.\n\nBitcoin 200-week moving average. Source: PlanB\n\nAt the same time, Bitcoin’s relative strength indicator (RSI) has emerged from the zero line on the two-week chart, indicating the start of a bull market, as it imitated the trend from 2016, according to a tweet shared by pseudonymous crypto analyst Trader Tardigrade.\n\nOn top of that, trends indicate that Bitcoin is preparing for a possible all-time high (ATH), as it has historically demonstrated the start of a bull run in the 22 months before the United States presidential election and has recently entered the pre-run phase, the crypto trading expert explained.\n\nBitcoin price analysis\n\nMeanwhile, Bitcoin was at press time trading at the price of $30,594, indicating a loss of 0.24% in the last 24 hours and declining 1.77% across the previous seven days while still hanging onto the 16.98% gain from its monthly chart.\n\nBitcoin 30-day price chart. Source: Finbold\n\nNotably, in addition to the above trends, Bitcoin’s recovery and a potential new ATH could factor in the US Securities and Exchange Commission (SEC) possibly approving the first-ever spot Bitcoin exchange-traded fund (ETF) amid a surge of applications and re-applications pioneered by the world’s largest asset manager BlackRock (NYSE: BLK).\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDcvMTMvYml0Y29pbi1wbG90LXR3aXN0LXNhdG9zaGktbmFrYW1vdG8taWRlbnRpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin: Plot twist on Satoshi Nakamoto identity - The Cryptonomist",
        "content": "There has been a lot of talk in recent hours about Craig Wright, an Australian computer scientist who has repeatedly proclaimed himself as the creator of the Bitcoin protocol, under the pseudonym Satoshi Nakamoto.\n\nYesterday, an article was published by Forbes highlighting new evidence of a possible correlation between Wright and Nakamoto.\n\nHave we finally reached the discovery of the century?\n\nLet’s look at all the details together.\n\nThe story of Satoshi Nakamoto: the inventor of Bitcoin\n\nOn 31 October 2008, an anonymous individual with the nickname “Satoshi Nakamoto” published a very important document on the cryptographic mailing list “metzdowd.com.”\n\nIt is one of the most influential manifestos of cypherpunk culture, titled “Bitcoin: A Peer-to-Peer Electronic Cash System,” introducing to the world for the first time the primordial idea of a blockchain-based digital currency that does not rely on a central bank.\n\nThe philosophy of a decentralized protocol that would allow P2P virtual money exchanges was immediately endorsed by a number of engineers and computer nerds, who began work on what we now know as “Bitcoin.”\n\nThese include the names of Hal Finney, Mike Hearn, Gavin Andresen, and Jeff Garzik, who had the honor of conversing online with the still unknown Satoshi Nakamoto.\n\nOn 23 April 2011, Satoshi disappeared from the scene definitively, stating as his last correspondences to software developer Mike Hearn that he would “move on to other things” and that the project had been placed in “good hands“\n\nFrom then on, as the Bitcoin project continued to expand and become more important, no one heard from Satoshi.\n\nTo this day we still do not know whether a single person or a group of individuals is behind this pseudonym.\n\nThe only thing that is certain is that the address with which Satoshi generated the first block of the Bitcoin infrastructure, known as the “Genesis Block,” contains (along with other addresses) an amount exceeding 1 million BTC.\n\nNot one single satoshi (sat) has been spent from that wallet, which in the jargon indicates the smallest expendable part of the coin, or one hundred millionth of BTC.\n\nFor this reason many believe that Nakamoto is dead, or that he was captured (according to some conspiracy theories) by the CIA or some special force belonging to a supposed government.\n\nOver the years a number of speculations have come forward about the real identity of the computer genius, first the name of “Dorian Nakamoto,” a Japanese programmer, emerged, then that of Craig Wright, an Australian engineer who proclaimed himself “the creator of Bitcoin.”\n\nPrecisely in reference to the latter figure, Forbes released some details that would show an impeccable correlation between the two figures.\n\nIt may not matter if Craig Wright created Bitcoin. The real question is whether the nearly 4,000 patents he controls or has pending will force computer programmers around the world to stop using open-source software as they now do—or pay up. https://t.co/V13JfEaHLl pic.twitter.com/J3xyubWSAW — Forbes (@Forbes) July 12, 2023\n\nNew speculation on Satoshi Nakamoto’s identity: the famous Bitcoin creator could be Craig Wright\n\nSince the publication of the Forbes article, speculation has increased about a possible attribution of Bitcoin creator Satoshi Nakamoto’s identity to Craig Wright.\n\nThe individual has been claiming since 2016 to be the inventor of the cryptocurrency, having even won a lawsuit related to copyright ownership of Bitcoin’s Whitepaper.\n\nSome prominent members of the Bitcoin community, such as programmer Gavin Andresen, had confirmed in the past that Wright was Nakamoto, though later he withdrew his assumptions.\n\nHe was reportedly working with Dave Klaiman, a deceased 2013 cybersecurity expert, on the creation of the decentralized protocol, according to the direct reports.\n\nAs of today, speculations of a real correlation between the Australian engineer and the famous Satoshi Nakamoto are becoming more and more concrete.\n\nMost notably, it has emerged that Wright allegedly published a blog post on 10 January 2009 announcing the launch of Bitcoin, which would actually be launched a few hours later.\n\nThe post was reportedly deleted a day after its publication and rediscovered a few days ago from an online archive.\n\nIn any case, despite this “evidence,” no one in the Bitcoin community believes in the convergence of Craig Wright’s identity with Satoshi Nakamoto.\n\nPrimarily because Nakamoto himself reportedly stated in a 2015 hidden note marked with one of his addresses that:\n\n“Craig Steven Wright is a liar and a fraud. He doesn’t have the keys used to sign this message. The Lightning Network is a significant achievement. However, we need to continue work on improving on-chain capacity. Unfortunately, the solution is not to just change a constant in the code or to allow powerful participants to force out others.”\n\nHaving briefly reappeared on the scene with this message after the real creator of Bitcoins dropped out of the 2011 project developments, no one believed Wright’s claims anymore.\n\nAs for the latest blog post that would prove knowledge of the protocol even before it was published, some users on Twitter came to the rescue, pointing out that it is easily possible to create a URL that falsely claims a certain date reference.\n\nThe actual publication of the post would be dated between 2014 and 2015.\n\nComplete 🐂\n\n\n\nAnyone can create a URL stating a certain date. This was indexed between 2014 and 2018. So NO this is not proof pic.twitter.com/f2Utm8CrKX — John (@DeFiFrontiers) July 12, 2023\n\nWill Craig Wright ever be able to destroy the Bitcoin protocol?\n\nBeyond the real correspondence between the identity of Satoshi Nakamoto, originator of the Bitcoin philosophy, and Craig Wright, the latest Forbes article warned the crypto enthusiast community about a significant danger.\n\nThe Australian computer scientist, in fact, is in possession of as many as 800 patents related to the development of blockchain technologies and waiting to receive 3,000 more in 46 different jurisdictions.\n\nAccording to Forbes, the huge amount of patents could one day force all programmers around the world to stop approving transactions on the Bitcoin network, should Wright decide to make the coin’s code “closed-source.”\n\nThus, one of the most important open-source software in the history of the Internet is in danger of being attacked by a petty individual who, while having failed in his attempt to reclaim the figure of Satoshi Nakamoto, could ruin the work of the past 14 years.\n\nIt may not matter if Craig Wright created Bitcoin. The real question is whether the nearly 4,000 patents he controls or has pending will force computer programmers around the world to stop using open-source software as they now do—or pay up. https://t.co/V13JfEaHLl pic.twitter.com/J3xyubWSAW — Forbes (@Forbes) July 12, 2023\n\nEven though at the moment the danger still seems to be far away, there will be a struggle in the coming years to prevent the technological developments of the entire industry from being compressed by Craig Wright, who, to put it bluntly, would never have tried to centralize the system if he really were Satoshi Nakamoto.\n\nHowever things turn out, Bitcoin and its ecosystem have become so strong and compact that they can be considered resilient to any kind of censorship or privatization, whether by an institution or a private individual.\n\nBlockchain technology and cryptography allow anyone to collaborate anonymously with the Bitcoin network, enabling its perpetual survival.\n\nCraig Wright may be able to claim his position and name on a variety of blockchain-related activities, but he will never be able to stop a libertarian movement that is now established worldwide.\n\nCraig you will never own us.\n\nWe are all Satoshi."
    }
]