[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDkvdXMtZ292ZXJubWVudHMtMWItYml0Y29pbi10cmFuc2Zlci1zcG9va3MtaW52ZXN0b3JzLWJpdGNvaW4tZGlwcy_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzA5L3VzLWdvdmVybm1lbnRzLTFiLWJpdGNvaW4tdHJhbnNmZXItc3Bvb2tzLWludmVzdG9ycy1iaXRjb2luLWRpcHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "U.S. Government's $1B Bitcoin Transfer Spooks Investors; Bitcoin Dips - CoinDesk",
        "content": "The current composition of the bitcoin market may help bitcoin stand up to sell pressures better than it did in the wake of last spring's Terra crash, according to Connors. That's because the market has less leverage than it did last year. It's also because the market today is composed of more investors owning wallets holding more than $1,000 worth of tokens than it was last year, when the market was flooded with a large amount of crypto-curious investors who held much smaller amounts of bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTAzLTA3L2Z0eC13YW50cy1pdHMtYml0Y29pbnMtYmFjay1mcm9tLWdyYXlzY2FsZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "FTX Wants Its Bitcoins Back From Grayscale - Bloomberg",
        "content": "The Grayscale Bitcoin Trust is a pot that contains Bitcoins. Shares of the trust — each representing a share of ownership of the Bitcoins in the pot — trade publicly on OTC Markets like shares of stock. If you have some Bitcoins and want shares of the pot, you can go to Grayscale Investments LLC — which runs the trust — and give them your Bitcoins, and they will give you back shares in the pot. If you have shares of the pot and you want some Bitcoins, however, you can’t go to Grayscale and ask for the Bitcoins back. The pot is one-way. Bitcoins can come in, but they cannot leave.\n\nThis is suboptimal product design for customers, but it is very very good product design for Grayscale. As an asset manager, it is just good business to run a pot of money that can increase (when people put in Bitcoins) but not decrease (they can’t take them out). Grayscale has got all these Bitcoins in the pot — about $14 billion worth — and, as the manager of the pot, it gets to charge fees on the money in the pot. The fee is 2% per year, so Grayscale collects about $280 million a year for sitting on its giant pot of Bitcoin. Grayscale also has a Grayscale Ethereum Trust, the same idea but for Ether; that has $4.7 billion of Ether in the pot and a 2.5% annual fee."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tYm90dG9tLW5vdmVtYmVyLW9uLWNoYWluLW1ldHJpY3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Did Bitcoin Bottom in November? These Metrics Suggest So. - Blockworks",
        "content": "Hopeful signs are emerging for the crypto industry mid-term as on-chain metrics for bitcoin suggest the world’s largest digital asset by market value may have hit its bottom in late 2022.\n\nThose include the Market Value to Realized Value Ratio (MVRV) and the Net Unrealized Profit and Loss metric (NUPL), both of which flashed a trend reversal following FTX’s collapse in November.\n\nThe rally in digital assets, represented by the price increase in bitcoin (BTC), as well as ether (ETH) this year, is reinforcing that play. Both assets are up 35% and 30% on a year-to-date basis trading at $22,450 and $1,550 respectively, Blockworks Research data shows.\n\nData provided by CryptoQuant shows MVRV hit its lowest point on Nov. 9, right around the time revelations came to light that FTX had allegedly misappropriated user funds, at a reading of 0.75.\n\nThe MVRV ratio is a metric used to determine whether an asset, in this case, bitcoin, is undervalued or overvalued.\n\nWhen the ratio is above 3.7, bitcoin is said to be overvalued and may be at a market top. Conversely, when the reading is below 1, the asset is considered undervalued and may be at a market bottom.\n\nThe last time the MVRV ratio was around as its November print was way back on Dec. 15, 2018, when the price of one bitcoin traded at $3,200. Despite a relatively uneventful year for price action in 2019, bitcoin never dipped below its 2018 lows.\n\nNUPL, a metric used to measure the average profit margin of all bitcoin holders, began to flash similar signs around the same time.\n\nLike the MVRV ratio, the NUPL can indicate whether bitcoin is undervalued or overvalued. Historically, NUPL levels above 0.7 (70% average profit margin) have signaled market tops, while levels below -0.4 (-40% profit margin) have signaled market bottoms.\n\nThe NUPL reading for bitcoin reached a low of -0.3 in November at a price of $15,800 and has held a positive reading since the middle of January. The NUPL is currently trending at 0.1 after crossing a 365-day moving average threshold, signaling bitcoin may have commenced a new upward cycle.\n\nIt’s important to note that although there are indications of a potential “crypto spring,” analysts cautioned at the end of February that it is still premature to declare at this point.\n\nThey warned against the lingering presence of ongoing inflation, the possibility of future rate hikes and wider macroeconomic uncertainty which may cause further downward momentum.\n\nPrevious price history is also telling. While it’s entirely plausible a mean reversion following the November drawdown is well underway, a daily close below about $21,400 — the most recent nadir on Feb. 13, could hint at further pain.\n\nCryptoassets can fall considerably further and still maintain the current uptrend on macro timeframes, even if the late November low holds. But the total drawdown in the bitcoin price from its November 2021 peak to November 2022 trough, of about 77% is broadly similar to prior cycles in Bitcoin’s history.\n\nL2’s a better indicator than the majors?\n\nSome like Rich Falk-Wallace, CEO of crypto data analytics platform Arcana suggest that on-chain activity is a better indicator of price for less utilized blockchains than for those fully utilized like bitcoin and ether.\n\n“For alternative coins and layer-2s, we’ve seen 90%+ mid-term correlations between daily active users and prices,” he said. “But for bitcoin and ether, both chains hit full capacity around 2018, which means user numbers have essentially been static since that time.”\n\nHitting capacity for bitcoin and ether refers to the point where they reached their effective block capacity limits, beyond which the fees grow exponentially to restrict further demand for block space.\n\nThis results in a gradual increase in daily active addresses since there are restrictions on address growth. Falk-Wallace further explained that the incremental increase in value for these chains must come from a rise in value per active address instead of an increase in users.\n\nThat means there exists a “strong relationship” between daily active users and prices for alternative coins and layer-2s, where an increase in daily active users on those chains is highly correlated with an increase in bitcoin’s price, over a medium-term period.\n\n“If you look at dollar value transferred on-chain, the metric is well correlated to BTC’s price historically. And that bottomed — and has languished — since November,” Falk-Wallace said.\n\nThat means, even if the bottom is in, investors may be in for a period of relative boredom.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vc3BlY3RydW1uZXdzMS5jb20va3kvbG91aXN2aWxsZS9uZXdzLzIwMjMvMDMvMDgvZm9ydC10aG9tYXMtd2FybnMtb2YtYml0Y29pbi1zY2Ft0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Fort Thomas Police warn of Bitcoin scam - Spectrum News 1",
        "content": "FORT THOMAS, Ky. — The Fort Thomas Police Department is advising residents of a new scam it has been seeing over the last few weeks. The scam involves Bitcoin, which is a form of digital currency.\n\nWhat You Need To Know Police are seeing more Bitcoin scams\n\n\n\nThe latest has scam artists posing as law enforcement demanding money for dropped charges\n\n\n\nAttorneys say its hard to recover funds from crypto scams\n\n“Once the money is deposited inside a Bitcoin ATM, the money is gone, almost immediately. It is unlikely that the money will ever be located,” the department said in a public notice. “The scammers usually stay on the phone with you through the entire process until the money is deposited.”\n\nScammers have been telling people they are local police, U.S. Marshals, Border Patrol, and other law enforcement officers, according to the department. Scammers tell victims they need to pay a certain amount to get charges dropped.\n\nAttorney Brian Levin of Levin Law said his office receives hundreds of inquiries every month from people who’ve been ripped off in cryptocurrency scams.\n\n“We’ve seen people who have invested millions and millions of dollars on this representation. And then when the people go to take their money out, they are told, ‘well, you have to pay a tax of 20%,’” Levin said.\n\nHowever, he said there is little recourse for the scams happening in Fort Thomas.\n\n“Cryptocurrency transactions are not reversible, unlike certain cash transactions with banks, so once the money goes out, there’s essentially no getting it back,” Levin said. “Because even if you can identify where the cryptocurrency is on a blockchain, it’s nearly impossible for them to obtain that cryptocurrency and get it back. And a lot of times it’s in a private wallet, which makes it virtually impossible to get.”\n\nLevin said a lot of his firm’s current work focuses on suing large corporations for data privacy related issues, such as permitting unauthorized parties to get into people’s accounts. A lot of that is in the cryptocurrency space, he said.\n\nFort Thomas police said other scammers have been changing email domain names.\n\n“Once clicking on those domain names, they are able to take over your computer and then begin their demands,” the department said.\n\nAccording to the department, there are Bitcoin ATMs all over the northern Kentucky and Greater Cincinnati areas. They are typically in small gas stations, convenience stores, and liquor stores.\n\n“If you find yourself in a situation, in front of or inside one of these places while on the phone with these scammers, hang up the phone and contact your local police department immediately,” the department said. “Please remember that police departments will not ask you to give money to get out of warrants or trouble over the phone. Do not give any personal identifying information over the phone. If they ask you to deposit money into a Bitcoin ATM, it is a scam!”\n\nLevin said hacking scams happen all across the country, and anyone can be just a click away from falling victim.\n\n“Criminals see that a lot of people are investing in cryptocurrency. And criminals see that people are used to these massive returns,” Levin said. “It is far easier than people appreciate for criminals to install malware and spyware on your computer. So if you click on a link, you may instantly or almost instantly have malware or spyware installed on your computer. And that’s also true on your phone.”\n\nLevin said his firm has been successful in helping people retrieve their assets in these instances."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1taW5pbmctaGFzLXN1cnByaXNpbmctZW52aXJvbm1lbnRhbC1ncmlkLWJlbmVmaXRzL9IBZ2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1taW5pbmctaGFzLXN1cnByaXNpbmctZW52aXJvbm1lbnRhbC1ncmlkLWJlbmVmaXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Has Surprising Environmental, Grid Benefits - ETF Trends",
        "content": "Aside from the obvious high correlations to bitcoin prices, one of the most frequent criticism lobbed at the bitcoin mining industry is that the group isn’t environmentally astute and that its core activity is a drag on climate efforts.\n\nIn theory, that could be seen as a sign that exchange traded funds such as the Invesco Alerian Galaxy Crypto Economy ETF (SATO) aren’t credible avenues for investors looking to tap into industries embracing clean tech and renewable energy. Interestingly, some experts argue that the opposite is true.\n\nWhile there’s no denying that bitcoin mining is an energy-intensive endeavor, some market observers believe that related criticisms lack context and miss the mark when it comes to analyzing the industry’s potential to drive increased adoption of renewable energy sources.\n\n“Having governments clamp down on Bitcoin’s energy usage or attempting to switch how transactions are processed would not only undermine the Bitcoin network but also impede energy innovation, positive environmental outcomes and economic opportunity in America,” wrote Dennis Porter for CoinDesk.\n\nAs Porter noted, bitcoin can serve as a catalyst for expanding renewable energy because it solves two of the biggest issues associated with traditional renewables, such as wind and solar: costs and reliability.\n\n“Bitcoin miners stand ready to purchase excess energy from wind and solar farms, improving the revenue for renewable generation and preventing taxpayers from subsidizing the generation of energy. A win-win,” he noted.\n\nThat’s pertinent to the SATO investment thesis because the ETF, which follows the Alerian Galaxy Global Cryptocurrency-Focused Blockchain Equity, Trusts and ETPs Index, features a slew of bitcoin miners among its 37 holdings.\n\nDue to the drubbings incurred by many of those firms during the 2022 crypto winter, market values across the industry are well off prior highs. As a result, more than 63% of SATO members are classified as small-cap fare.\n\nBitcoin miners serve other objectives, including the potential for sending excess power back to energy grids, allowing grid operators to improve reliability while reducing customer costs.\n\n“Miners aren’t just good for renewables. They can also make use of stranded methane, a potent greenhouse gas, that is often uneconomical to bring to market. Methane is frequently vented or flared from landfills, abandoned wells, and oil and gas operations,” concluded Porter.\n\nAdd it all up, and SATO could be more of a renewable energy play than meets the eye.\n\nVettaFi LLC (“VettaFi”) is the index provider for SATO, for which it receives an index licensing fee. However, SATO is not issued, sponsored, endorsed or sold by VettaFi, and VettaFi has no obligation or liability in connection with the issuance, administration, marketing or trading of SATO.\n\nFor more news, information, and analysis, visit the Crypto Channel .\n\nThe opinions and forecasts expressed herein are solely those of Tom Lydon, and may not actually come to pass. Information on this site should not be used or construed as an offer to sell, a solicitation of an offer to buy, or a recommendation for any product."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDMvMDcvZ3JheXNjYWxlLWdidGMtc2VjLWNvdXJ0LWJpdGNvaW4v0gFLaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wMy8wNy9ncmF5c2NhbGUtZ2J0Yy1zZWMtY291cnQtYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Grayscale’s GBTC shares soar more than 10% after judges show skepticism of SEC’s denial of Bitcoin ETF - Fortune",
        "content": "On Tuesday, a three-judge panel for the U.S. Court of Appeals for the D.C. Circuit raised doubts over a decision by the Securities and Exchange Commission to deny a Bitcoin spot exchange-traded fund, or ETF.\n\nShortly after the hearing, which turned on a complaint by the crypto company Grayscale, shares of the company’s GBTC shares—which are backed by Bitcoin—surged more than 10% on a day when the broader market is down. By midday ET, GBTC shares fell slightly from their earlier high, trading around $12.50.\n\nGrayscale, represented by former solicitor general Donald Verrilli Jr., argued that the SEC had been “arbitrary and capricious” in approving an ETF based on the futures market for Bitcoin, but then denying Grayscale’s ETF based on the spot market.\n\nThe SEC, represented by senior counsel Emily Parise, countered that the futures market was regulated by the Commodity Futures Trading Commission through a surveillance agreement with the Chicago Mercantile Exchange, while spot markets remain unregulated and are subject to fraud and manipulation.\n\nThe three judges for the court—Sri Srinivasan, Harry T. Edwards, and Neomi Rao—expressed skepticism toward the SEC position, seeming to side with Grayscale’s argument that the futures market relied on the spot market for its underlying pricing, and therefore fraud and manipulation would affect both. Even as Grayscale provided data that showed the two markets were 99.9% correlated, Parise said that it was not empirically sufficient.\n\n“It seems there’s quite a bit of information on how these markets work together,” Rao noted to Parise. “The SEC has not offered any explanation that the petitioners are wrong.”\n\nJames Angel, a faculty member at Georgetown’s Psaros Center for Financial Markets and Policy specializing in market structure and financial regulation, told Fortune the judges seemed to understand Grayscale’s economic argument that the SEC accepted one product and arbitrarily rejected another.\n\nEven so, the case will likely come down to the doctrine of Chevron deference, which entails courts giving agencies like the SEC latitude to interpret statutes related to their expertise. Even though the Supreme Court has recently reduced the amount of administrative deference, agencies such as the SEC generally have a wide remit to interpret statute—in this case, the Securities Exchange Act of 1934.\n\nEven as the judges appeared unconvinced of the SEC’s arguments, Angel said that the outcome is still uncertain. “My crystal ball is cloudy,” he told Fortune.\n\nThere is also the question of what would happen if the judges side with Grayscale. Rao asked Parise if the SEC would go back on its approval of the Bitcoin futures ETF. Parise said she could not speak for the commission, but that it would have to “think about the issue anew.”\n\nGrayscale, a subsidiary of crypto empire Digital Currency Group, currently operates the Grayscale Bitcoin Trust, a fund holding nearly $15 billion in assets. When it launched in 2013, it represented one of the first financial instruments for investors to get access to Bitcoin without buying it directly.\n\nAlthough investors can buy shares of the trust, they cannot redeem them back into Bitcoin—a limitation that has caused the fund to trade at a significant discount to the price of its underlying Bitcoin. Verrilli argued that converting the trust to a spot-based ETF would unlock $4 billion in value.\n\n“The court asked thoughtful, pointed questions about the inextricable link between Bitcoin spot markets and Bitcoin futures markets—the exact points that are the bedrock of the case to convert GBTC to an ETF,” a Grayscale spokesperson told Fortune. “We look forward to the court’s final decision, and strongly believe that American investors deserve to have equal access to the Bitcoin ETF product that best suits their needs.”\n\nGiven the recent torrent of enforcement actions by the SEC, a Grayscale win would set back Chair Gary Gensler’s crackdown against the crypto industry, although, as Parise alluded, it could also cause the agency to revisit its approval of a Bitcoin futures ETF. The approval of a Bitcoin spot ETF would open the market to new investors, likely causing the price of Bitcoin to rise.\n\nEven with an uncertain outcome, the surge in GBTC’s share price indicated investors are optimistic that judges would side with Grayscale. A decision is expected by the end of the summer."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc3dpc3MtYml0Y29pbi1hcHAtcmVsYWktcmFpc2VzLSUyNDQuNS1taWxsaW9uLWxlZC1ieS1qZWZmLWJvb3Rocy1lZ28tZGVhdGgtY2FwaXRhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Swiss Bitcoin App Relai Raises $4.5 Million Led By Jeff Booth's Ego Death Capital - Nasdaq",
        "content": "The funding will be used to expand the platform's retail Bitcoin on-ramp in Europe, add zero-fee trading, support for Lightning and more.\n\nRelai, a Swiss non-custodial bitcoin platform, has announced a $4.5 million funding round led by Ego Death Capital.\n\nNew investors include Timechain, Cabrit Capital and Lightning Ventures, while participating firms Redalpine and Fulgur Ventures are both previous investors.\n\nIn addition to this news, the company announced that Ego Death Capital general partner Andi Pitt will be joining Relai’s board.\n\n“The current bear market is the perfect time to focus on what’s most important: building a top-notch product, delivering a seamless user experience, and educating people about Bitcoin as the best savings technology ever invented,” said Relai CEO and co-founder Julian Liniger. “Our team is hungry for what’s ahead, and we have a crystal clear plan that we will execute in the coming months. With ego death capital and the great network around Jeff Booth, Andi Pitt, and Nico Lechuga, we are ready to bring bitcoin to everyone in Europe!“\n\nThe funding will go towards further expansion as a retail Bitcoin on-ramp in Europe. Relai currently has plans to add zero-fee trading, implement support for the Lightning Network and introduce a white-label product that will allow for other firms to offer fiat-to-bitcoin trading. Also in focus is the recently launched Relai Business platform.\n\n“We’ve been really impressed by Julian and the Relai team and their ability to deliver long term value to users,” commented Jeff Booth, general partner at ego death capital. “We believe they will be a key player for European Bitcoin adoption and are excited to work with them.”\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDMvMDgvZ3JheXNjYWxlLWNoaWVmLWxlZ2FsLW9mZmljZXItYS1zcG90LWJpdGNvaW4tZXRmLXdpbGwtcHJvdGVjdC11cy1pbnZlc3RvcnMtY29uc3VtZXJzL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDMvMDgvZ3JheXNjYWxlLWNoaWVmLWxlZ2FsLW9mZmljZXItYS1zcG90LWJpdGNvaW4tZXRmLXdpbGwtcHJvdGVjdC11cy1pbnZlc3RvcnMtY29uc3VtZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Grayscale Chief Legal Officer: A Spot Bitcoin ETF Will Protect U.S. Investors, Consumers - CoinDesk",
        "content": "\"We're all for more legislative actions that will bring more clarity to the asset class. Giving the SEC jurisdiction over spot bitcoin trading is not necessary to have a spot bitcoin ETF,\" he said. \"Bitcoin is one of the cryptocurrencies that very clearly is not a security, it's a commodity and that's been stated by SEC and CFTC officials over many years."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTA3L3Jpc2tzLW9mLWJpdGNvaW4tZm9yLWFueWJvZHktYXQtaGVhcnQtb2YtZ3JheXNjYWxlLXNlYy1maWdodNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Risk of Widespread Bitcoin (BTC) Investing at Heart of Grayscale-SEC Legal Fight - Bloomberg",
        "content": "Federal appeals court judges in Washington grilled the US Securities and Exchange Commission on its decision to reject a proposed Bitcoin exchange-traded fund when it had earlier approved a similar product based on Bitcoin futures.\n\nGrayscale Investments LLC wants to convert its $14 billion Bitcoin trust, the largest investment vehicle tied to the No. 1 cryptocurrency, into an ETF. But the SEC rejected the plan in June, saying crypto markets are too ripe for fraud and manipulation. Grayscale sued, asking the DC Circuit Court to overturn a decision the company called arbitrary and discriminatory because the SEC had already approved ETFs that track Bitcoin futures."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2dyYXlzY2FsZS1hcHBlYXJzLXRvLXdpbi1vcGVuaW5nLXNlY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Grayscale Appears To Win Opening Salvo in Bitcoin ETF Case vs SEC - Blockworks",
        "content": "DC Circuit Court of Appeals judges grilled the SEC on why the regulator approved bitcoin futures exchange-traded products (ETPs) and not Grayscale Investments’ proposed spot offering Tuesday — a line of questioning one analyst said could signal a ruling in favor of the crypto-focused asset manager.\n\nThe comments came in oral arguments in front of judges Sri Srinivasan, Neomi Rao and Harry Edwards Tuesday. The proceeding came after Grayscale and the SEC exchanged written briefs in recent months.\n\nGrayscale sued the SEC last June after the agency did not allow the firm to convert its flagship Bitcoin Trust (GBTC) to an ETF.\n\nGBTC launched in 2013 and holds $14 billion in assets. The trust has traded at a discount of more than 40% in recent weeks. Grayscale has said its preferred solution is converting the trust to an ETF.\n\nDonald Verrilli Jr., a former US solicitor general who Grayscale hired last year as a legal strategist, kicked off the hearing. Verrilli reiterated that the SEC’s approval of ETFs investing in CME-traded bitcoin futures, but not for proposed ETPs that invest in bitcoin directly — such as what GBTC would convert to — is discriminatory.\n\nEmily Parise, an attorney representing the SEC, contended that bitcoin futures ETPs are different from the proposed spot bitcoin products the agency has denied. Bitcoin spot markets are “fragmented and unregulated,” Parise said.\n\nUnderlying products for the approved bitcoin futures ETFs instead trade only on CME, which is CFTC-regulated, she added, where the “exchange has a surveillance sharing agreement that gives it access to information like market trading activity, customer identification — the tools to investigate fraud and manipulation if it were to occur.”\n\nJudges grill the SEC\n\nRao, during the hearing Tuesday, interrupted Parise on that point, saying the SEC needs to explain how it views the relationship between bitcoin futures and the spot price of bitcoin.\n\n“It seems to me…one is essentially a derivative of the other,” the judge said. “They move together 99.9% of the time, so where’s the gap in the commission’s view?”\n\nParise said the correlation between once-a-day futures prices and spot prices doesn’t signal the “causal relationship” between the two.\n\nBut Rao added the SEC has not offered an explanation why Grayscale is wrong as it relates to the relationship between the bitcoin spot and futures markets. The judge said the SEC’s ruling on a bitcoin futures ETF by fund group Teucrium recognizes the futures prices are influenced by the spot prices.\n\n“In approving the futures ETPs, it seems to be that the commission has to have necessarily drawn the conclusion that this arrangement would prevent fraud and manipulation on the underlying spot market,” Rao said.\n\nAn SEC spokesperson declined to comment about the oral arguments.\n\n“The court asked thoughtful, pointed questions about the inextricable link between bitcoin spot markets and bitcoin futures markets — the exact points that are the bedrock of the case to convert GBTC to an ETF,” a Grayscale spokesperson told Blockworks in an email.\n\nQuestions signal a potential ruling?\n\nBloomberg Intelligence ETF Analyst James Seyffart told Blockworks Monday he expected the judges’ questions Tuesday could signal how they might rule on the case.\n\n“Rao is definitely team Grayscale,” he tweeted during the hearing. “Grayscale needs to get Judge Srinivasan or Judge Edwards on their side as well and they can win.”\n\n“Srinivasan seems to be leaning Grayscale as well based on this line of questioning,” Seyffart added. “WOW. The SEC lawyer seems to keep saying the futures aren’t and I quote “manipulated in the *same way*” and I don’t even understand what she’s trying to say.”\n\nLoading Tweet..\n\nSeyffart told Blockworks that he believes it’s possible for all three judges to side with Grayscale — a “sharp reversal” of what he thought before the oral arguments began. He quantified Grayscale’s chance to win as 70% likely, noting that a decision could come as early as the second quarter.\n\n“It’s possible the ruling tells the SEC to go back to the drawing board, where the SEC can put us back on the spot Bitcoin ETF denial merry-go-round by issuing another denial with different language and/or reasoning,” Seyffart said in an email. “So this could still be far from over.”\n\nGBTC was up about 8% on the day, as of about 1:00 pm ET.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDMvMDcvYS1kb3plbi1yZWFzb25zLXdoeS10aGUtc2VjLXNob3VsZC1oYXZlLWFwcHJvdmVkLWdyYXlzY2FsZXMtc3BvdC1iaXRjb2luLWV0Zi_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAzLzA3L2EtZG96ZW4tcmVhc29ucy13aHktdGhlLXNlYy1zaG91bGQtaGF2ZS1hcHByb3ZlZC1ncmF5c2NhbGVzLXNwb3QtYml0Y29pbi1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "A Dozen Reasons Why the SEC Should Have Approved Grayscale's Spot Bitcoin ETF - CoinDesk",
        "content": "The core argument in favor of approving a spot bitcoin ETF, at least at this time, is that the SEC’s concerns about manipulation are literally inconsistent – and possibly in violation of the Administrative Procedure Act, as Ribbit Capital’s Sigal Mandelker and Jessi Brooks wrote. The agency has already approved exchange-traded products that use bitcoin futures contracts, particularly NYSE Arca’s proposal to list and trade shares of the Teucrium Bitcoin Futures Fund and Nasdaq’s proposal to list and trade shares of the Valkyrie XBTO Bitcoin Futures Fund. Both of the funds provide “surveillance-sharing agreements” designed to prevent manipulation, which the SEC says every spot BTC application has lacked."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDgvYml0Y29pbi13aGFsZXMtaGF2ZS1iZWVuLXN3aW1taW5nLWluLWRpZmZlcmVudC1kaXJlY3Rpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Whales Have Been Swimming in Different Directions - CoinDesk",
        "content": "Whale behavior generally offers substantial clues about the crypto market’s direction. Whales tend to buy bitcoin when they believe prices are at low points and that conditions are ripe for an upturn. Their acquisitions tend to spur spikes in bitcoin’s price and overall valuation. As bitcoin’s price has tumbled more than 70% from its all-time high near $70,000 in late 2021, the number of whale addresses holding at least 10,000 BTC has risen 7%."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzA4L2NyeXB0by1sb25nLXNob3J0LXdoeS1sYXllci0yLXByb3RvY29scy1tYXR0ZXIv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDMvMDgvY3J5cHRvLWxvbmctc2hvcnQtd2h5LWxheWVyLTItcHJvdG9jb2xzLW1hdHRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Let’s Talk About Crypto Protocol Layers and Why Investors Must Examine Them - CoinDesk",
        "content": "New week, new source of trouble. Crypto bank Silvergate said it’s on shaky financial footing by giving the dreaded “going concern” warning . But something else it did might matter more to the institutional community: It closed the Silvergate Exchange Network (SEN), a platform that helped traditional finance (TradFi) players tie into crypto exchanges. It was a “24/7 instant settlement service the bank's clients could use to conduct transactions between each other at any time, including nights and weekends,” according to a recent CoinDesk story . It was an important service given so much of TradFi is not 24/7; this was a vital bridge. Signature Bank's Signet is an alternative, though, and BCB Group is rushing to add features to help fill the gap."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8wNy95ZXMtY3J5cHRvLWlzLXN0aWxsLWVhcmx5L9IBVWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8wNy95ZXMtY3J5cHRvLWlzLXN0aWxsLWVhcmx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Yes, Crypto Is Still Early - CoinDesk",
        "content": "In turn, however, we can call out those who stand on the outside looking in while criticizing us for not doing more, for not trying harder and for not succeeding despite the audacity of the change we want to see, and the colossal obstacles that have been in our way from the beginning. We can call out vested interests, those that put the static before the dynamic, and those more interested in the convenient than the meaningful."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8wNy9qdWRnZXMtZXhwcmVzcy1za2VwdGljaXNtLW9mLXNlYy1hcmd1bWVudHMtaW4tZ3JheXNjYWxlLWJpdGNvaW4tZXRmLWhlYXJpbmcv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAzLzA3L2p1ZGdlcy1leHByZXNzLXNrZXB0aWNpc20tb2Ytc2VjLWFyZ3VtZW50cy1pbi1ncmF5c2NhbGUtYml0Y29pbi1ldGYtaGVhcmluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Judges Express Skepticism of SEC Arguments in Grayscale Bitcoin ETF Hearing - CoinDesk",
        "content": "In the SEC's view, said Parise, the 99% correlation does not equate to causation, saying that figure only refers to once-a-day prices rather than intraday prices. She had earlier already mentioned that in the SEC's opinion, \"it is undisputed\" that spot markets for bitcoin are fragmented, in contrast with bitcoin futures, which trade solely on CME."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDkvcG9seWdvbi1zb2xhbmEtbGVhZC1tYWpvcnMtc2xpZGUtYW1pZC1iaXRjb2luLXdlYWtuZXNzL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDkvcG9seWdvbi1zb2xhbmEtbGVhZC1tYWpvcnMtc2xpZGUtYW1pZC1iaXRjb2luLXdlYWtuZXNzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Polygon, Solana Tokens Lead Majors Slide Amid Bitcoin Weakness - CoinDesk",
        "content": "Meanwhile, the drop in prices caused over $100 million in liquidations in the past 24 hours, data from analytics tool Coinglass shows. Slightly over 85% of these liquidations were on short positions, or from traders betting on falling prices."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzAzLzA4L2JpdGNvaW4tcmVib3VuZHMtYmFua3J1cHRjeS1qdWRnZS1hcHByb3Zlcy12b3lhZ2Vycy1yZXN0cnVjdHVyaW5nLXBsYW4tY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin rebounds, and bankruptcy judge approves Voyager's restructuring plan - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin rebounds, and bankruptcy judge approves Voyager's restructuring plan: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, John Wu, president of Ava Labs, weighs in on Silvergate's warning it might not be able to stay in business. He also discusses the future of web3 and a new partnership geared toward revolutionizing the gaming industry."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8wNy93aHkteXVnYS1sYWJzLWVtYnJhY2Utb2YtYml0Y29pbi1uZnRzLWlzLWEtYmlnLWRlYWwv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAzLzA3L3doeS15dWdhLWxhYnMtZW1icmFjZS1vZi1iaXRjb2luLW5mdHMtaXMtYS1iaWctZGVhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Why Yuga Labs' Embrace of Bitcoin NFTs Is a Big Deal - CoinDesk",
        "content": "Now, the online Bitcoin community is at a metaphorical fork in the road, because Ordinals is not going away any time soon. People want to build on Bitcoin, and because it is open source they can. This brings us to perhaps the most important element here, the on-chain evidence. One statistic you cannot deny is that the Ordinals project tipped the number of non-zero Bitcoin addresses to a new all-time high of 44 million, according to Glassnode."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zaWxrLXJvYWQtYml0Y29pbi1mb3Itc2FsZS11cy1nb3Zlcm5tZW50LWxpbmtlZC1hZGRyZXNzZXMtdHJhbnNmZXItMWItaW4tYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Silk Road Bitcoin for sale? US government-linked addresses transfer $1B in BTC - Cointelegraph",
        "content": "Over 50,000 Bitcoin (BTC), worth $1 billion, were moved from multiple wallets connected to United States Government law enforcement seizures and transferred to new addresses, with some moved to Coinbase on March 8.\n\nAccording to data shared by on-chain analytics firm PeckShield, three transfers were made from U.S. law enforcement agency’s wallets. These wallets held nearly 51,000 BTC seized by U.S. agencies from the Silk Road marketplace in November 2021. The confiscated BTC was consolidated into two wallet addresses.\n\nSilk Road Bitcoin moved to three different addresses. Source: Twitter\n\nOut of these three transfers, the majority appear to be internal transfers. However, approximately 9,861 BTC was sent to Coinbase. The other two include a 30,000 BTC transfer and a 9,000 BTC transfer.\n\nSilk Road BTC sent to Coinbase. Source: Glassnode\n\nThe Silk Road was an online black market and the first modern darknet market. It was launched in 2011 by its American founder Ross Ulbricht under the pseudonym “Dread Pirate Roberts.“ The marketplace was one of the first to accept Bitcoin payments, helping to popularize crypto use. U.S. law enforcement agencies confiscated multiple items from its founder, including hoards of BTC, which have been auctioned from time to time.\n\nRelated: Key Bitcoin price metrics point to BTC downside below $22.5K\n\nPopular Bitcoin proponent Tim Draper bought nearly 30,000 BTC in 2014 in one of these auctions. Another auction for 50,000 BTC was held in October 2015, where the U.S. Marshals Service auctioned 21 blocks of 2,000 BTC and one block of 2,341 in an online auction.\n\nWhile only a small portion of the 50,000 BTC was sent to Coinbase, the movement of billions worth of BTC from U.S enforcement agency-linked wallets evoked wild reactions and even wilder theories from Twitter users. One pointed out that if U.S. agencies decided to sell their Silk Road Bitcoin, it would put significant selling pressure on the market. At the same time, a few others questioned the timing of the sale."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDcvY3J5cHRvLW9ic2VydmVycy1sb29rLXRvLXRyZWFzdXJ5LXlpZWxkcy1mb3ItY3Vlcy1hcy1iaXRjb2luLXJlbWFpbnMtY29tYXRvc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Crypto Observers Look to Treasury Yields for Cues as Bitcoin Remains Comatose - CoinDesk",
        "content": "\"According to CFTC data, spec positioning in U.S. Treasurys is now at a record short, surpassing levels last seen in October 2018. U.S. yields topped out shortly after that and is an important consideration here given the negative impact rising yields exerts on risk and crypto,\" Brickell noted, referring to the Commodity Futures Trading Commission."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMy8wOC9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLWRpZ2l0YWwtdGVybWluYXRlcy1jcmVkaXQtZmFjaWxpdHktd2l0aC1jcnlwdG8tYmFuay1zaWx2ZXJnYXRlL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMy8wOC9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLWRpZ2l0YWwtdGVybWluYXRlcy1jcmVkaXQtZmFjaWxpdHktd2l0aC1jcnlwdG8tYmFuay1zaWx2ZXJnYXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Marathon Digital Terminates Credit Facility With Crypto Bank Silvergate - CoinDesk",
        "content": "The company has been taking steps to shore up its balance sheet by paying off some of its debts and freeing up its restricted bitcoin that were being used as collateral. In January, Marathon said that it fully paid off $30 million in revolver loans with Silvergate in December, freeing up 3,615 bitcoin (BTC) that had been pledged as collateral."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vYWxhc2thYmVhY29uLmNvbS8yMDIzLzAzLzA3L3Utcy1zZW5hdGUtcGFuZWwtcHJvYmVzLWhvdy1jcnlwdG8tbWluaW5nLWluY3JlYXNlcy1lbmVyZ3ktY29uc3VtcHRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "U.S. Senate panel probes how crypto mining increases energy consumption • Alaska Beacon - Alaska Beacon",
        "content": "WASHINGTON — The so-called mining for digital assets, or cryptocurrency, consumes as much electricity as some entire nations, and U.S. senators explored the issue Tuesday in what they said was their first-ever hearing focused on the energy implications of digital currency.\n\nCrypto mining in both Nebraska and Pennsylvania was discussed in particular by the members of the panel of the Senate Committee on Environment and Public Works.\n\nTouting his legislative proposal to improve transparency of crypto mining, Democratic Sen. Ed Markey, of Massachusetts, likened it to being “more like digital coal than digital gold” and implored the industry — Bitcoin being the most popular currency — to “work smarter, not harder” by improving energy efficiency as the world faces the effects of climate change.\n\n“Bitcoin mining in the United States uses as much power as we need to light every single home in our country, and that demand on our grid is only going to grow,” Markey said in opening remarks.\n\nMarkey’s bill, introduced Monday, would require cryptocurrency asset operators to report emissions to the Environmental Protection Agency, and would mandate the agency to conduct a study of energy usage required by thousands of robust, special-use computers to add new transactions to the decentralized digital accounting ledger, he said. The text of the bill was not yet published.\n\nThe hearing before the Senate Subcommittee on Clean Air, Climate and Nuclear Safety featured testimony from Rob Altenburg, of PennFuture, a Pennsylvania-based clean energy advocacy organization; Courtney Dentlinger, an executive with the Nebraska Public Power District, a publicly owned utility; and Anna R. Kelles, a member of the New York State Assembly.\n\nThe subcommittee’s top Republican, Sen. Pete Ricketts, of Nebraska, pushed back on environmental concerns.\n\nReminding fellow members that CNBC ranked his state No. 1 last year for cultivating a crypto economy, Ricketts said he’s “particularly interested in this topic as to whether this industry could result in more economic development.”\n\n“Crypto asset mining is hardly alone in being an industry reliant on large data server banks,” Ricketts later continued. “Finance, technology, government, academia and many others use significant amounts of electricity to power their computing needs. We should be providing the tools for open competition in a free market and not allowing politicians or bureaucrats in Washington D.C. to pick winners and losers.”\n\nCheap electricity in Nebraska\n\nBoth Nebraska and Pennsylvania are home to crypto mining operations.\n\nCheap electricity in Nebraska — 100% powered by publicly owned utilities — makes the state an attractive option for the crypto data centers, where acres of extremely fast computers encased in what look like metal shipping containers attempt to guess long combinations of numbers to verify a new transaction, some at speeds of up to trillions of guesses per second.\n\nOne 11-acre crypto mining site in Kearney, Nebraska, consumes as much electricity as the city itself, which has a population of 33,790, according to a local news analysis published in January.\n\nHowever, the industry has had “significant benefits” for the state, Nebraska Public Power District’s Dentlinger told lawmakers, giving the example that just one of Nebraska’s crypto mining facilities generated $1.8 million in state sales taxes and $3.8 million in local taxes over a 12-month period.\n\nDentlinger also argued that consistent electricity demand from a customer benefits the wider customer base.\n\n“In our predominantly non-metro and rural service area, diversification of businesses and economic growth is critical as these areas continue to see population declines,” she told lawmakers. “In fact, local leaders have been very receptive to crypto mining facilities as they’ve seen the potential for significant economic development benefits for their communities.”\n\nCrypto operations pop up in Pennsylvania\n\nPennFuture’s Altenburg argued there’s a different story in Pennsylvania, one where regulators can’t keep tabs on crypto operations popping up across the state.\n\nLast year, a site inspection by the Pennsylvania Department of Environmental Protection found that a company in Clearfield County had plugged into a natural gas well site without seeking a permit. The company, Big Dog Energy, was running 30 natural gas generators to power its crypto operation. The EPA took the lead on investigating.\n\nAltenburg told lawmakers it’s “impossible to know which or how many of Pennsylvania’s thousands of fracked gas wells are being used in this way.”\n\nAnother company, Stronghold Digital Mining, burns waste coal to power crypto operations. The company — which argues it is an “environmentally beneficial” Bitcoin miner for finding a use for an environmental hazard — sources from the ubiquitous piles of waste coal around the state and converts it into for electricity at two sites, one in Venango County between Pittsburgh and Erie, and the other in Carbon County northwest of Allentown, according to the company’s website.\n\n“Waste coal is a problematic fuel to say the least. As the name implies, it has low energy value compared to ordinary coal, so plants need to burn even more to generate the same amount of electricity. In the process, they emit more ozone precursors, fine particulates, acid gases, heavy metals, and it’s the second-most carbon intensive generation, next to residual fuel oil,” Altenburg said.\n\nWhy crypto mining requires energy\n\nCryptocurrency mining involves the use of robust computing power to add to digital ledger technology, such as “blockchain.”\n\nThe decentralized digital financial record of transactions is a ledger or database where users, or “miners,” on a common network can agree on entries, sometimes called “blocks,” through a “consent mechanism.”\n\nEnergy usage varies depending on which consent mechanism is used. For example, Bitcoin is based on a “proof of work” mechanism, which in part ensures security of the ledger by requiring miners to have access to special computers and considerable amounts of energy.\n\nAnother popular cryptocurrency, Ethereum, recently switched to a “proof of stake” mechanism, which consumes a fraction of the energy — as of 2021 it accounted for 0.001% of global energy usage — because it relies on miners to risk a stake of their crypto assets as a way to enforce the integrity of the accounting ledger.\n\nU.S. power usage for crypto\n\nA September 2022 report from the White House Office of Science and Technology Policy warned that cryptocurrency mining uses a significant amount of energy that has only increased over the past five years.\n\nCrypto assets worldwide use 120 to 140 billion kilowatt-hours per year — or roughly exceeding the total energy usage of countries like Argentina or Australia, the report found.\n\nThe U.S. accounts for one-third of the world’s crypto asset operations, consuming about 0.9% to 1.7% of the nation’s electricity usage, which is about equal to the energy used to power all home computers or all residential lighting in the U.S., according to the OSTP.\n\nPresident Joe Biden ordered the interagency report in a March 2022 wide-ranging executive order on “Ensuring Responsible Development of Digital Assets,” which included exploring energy implications and possible impediments to reaching the administration’s climate goals.\n\nThose goals include reducing greenhouse gas emissions by 50% by 2030, achieving a carbon-free electricity grid by 2035 and reaching net-zero emissions by mid-century.\n\nMarkey’s bill has been referred to the Senate Committee on Environment and Public Works.\n\nSens. Jeff Merkley, a Democrat from Oregon, and Bernie Sanders, an independent from Vermont, have signed on as co-sponsors.\n\nMarkey compared reducing the energy usage of cryptocurrency mining to updating energy standards for appliances or fuel economy for vehicles.\n\n“We’re not looking to end refrigeration or automotive technology. What we’re saying is that we should be more efficient, we should be more aware of the emissions into our atmosphere that are avoidable,” Markey said. “So on the one hand, this (cryptocurrency) is a very innovative sector, economically, and they count themselves as innovators. But all we’re asking for them to do is look across the board at innovation.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLWR1bXAtaW5jb21pbmctdS1zLWdvdmVybm1lbnQtbW92ZXMtMWItb2Ytc2VpemVkLWJ0Yy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Dump Incoming? U.S. Government Moves $1B of Seized BTC - DailyCoin",
        "content": "The U.S. government moved a good chunk of its seized BTC to Coinbase.\n\nMarket participants think a BTC dump is incoming.\n\nBTC is currently trading down 1.4% on the day.\n\nThe crypto markets have enjoyed a great start to the year, with most coins and tokens going up significantly since January.\n\nHowever, the past few weeks have been increasingly challenging for digital assets. Cryptobank Silvergate is teetering on the brink of bankruptcy, and the U.S. Federal Reserve has again turned hawkish and anticipates larger rate increases.\n\nFor Bitcoin (BTC), there’s another threat in the short term. That threat is the U.S. government.\n\nThe Bitcoin community has been anxiously looking at the BTC chart since early Wednesday morning after reports indicated that the U.S. government has started moving their BTC holdings.\n\nAccording to Glassnode, a blockchain intelligence and data platform, U.S. government-related wallets moved around 40,000 seized BTC, or about $1 billion, in the early morning of Wednesday.\n\nMore importantly, 9,861 of the total BTC seized from the Silk Road hacker have been sent to Coinbase, fueling speculation that BTC will soon experience a surprise dump.\n\nApproximately 40k $BTC from wallets associated with US Government law enforcement seizures are on the move.\n\n\n\nOf these, the majority appear to be internal transfers (so far), however approximately 9,861 $BTC seized from the Silk Road hacker have been sent to our Coinbase cluster. pic.twitter.com/afuEYcV18L — glassnode (@glassnode) March 7, 2023\n\nIf that were to happen, industry observers believe BTC could retest the $20,000 resistance zone, especially with the U.S. Federal Reserve turning hawkish on Tuesday and indicating further rate increases.\n\nU.S. Fed Indicates Rate Increases\n\nLast week, the news of Silvergate being on the brink of bankruptcy shocked the crypto markets, which saw billions of dollars vanish in 30 minutes. Bitcoin dropped around 5%, with ETH and other altcoins also dumping.\n\nOn top of that, the U.S. Federal Reserve chairman Jerome Powell indicated in his testimony on Tuesday that the Fed might need to introduce further rate increases to curb inflation. The current Federal Funds Rate is 4.57%, but market participants predict it will reach around 6% by the end of the year.\n\nBREAKING: Futures now see a 53% chance of a 50 bps rate hike in March.\n\n\n\nWe now have a near 35% chance that rates go to 6.00%+ this summer!\n\n\n\nJust a month ago, odds of a 50 bps rate hike were 1% and peak rates were expected at 5.25%.\n\n\n\nThe Fed pivoted, from hawkish to more hawkish. pic.twitter.com/ah4HRPVLpi — The Kobeissi Letter (@KobeissiLetter) March 7, 2023\n\nFor risk assets like BTC, higher-than-expected rates in the U.S. and worldwide would mean significant sell pressure in the coming months.\n\nBTC currently trades at around $22,000, down 1.4% on the day, according to data from CoinGecko.\n\nOn the Flipside\n\nThe U.S. government could have other plans related to their seized BTC.\n\nWhy You Should Care\n\nInvestors will potentially suffer short-term losses if the U.S. government sells its BTC. Investors should consider hedging against such an event.\n\nRead more about BTC technical analysis:\n\nIs Bitcoin in Trouble? Understanding the Weekly Death Cross Pattern\n\nRead more about the SEC’s recent crypto move:\n\nGensler’s Crusade Continues: SEC Shuts Down ‘$100M Crypto Fraud Scheme’"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL25ld3MvYml0Y29pbi1idWxscy1kZXNpcmUtZm9yLWEtdHJlbmQtcmV2ZXJzYWwtY291bGQtYmUtb2JsaXRlcmF0ZWQtYnktdGhpcy13ZWVrLXMtNTY1bS1vcHRpb25zLWV4cGlyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin bulls' desire for a trend reversal could be obliterated by this week's $565M options expiry - Cointelegraph",
        "content": "Bitcoin (BTC) fell below a four-day narrow trading range near $22,400 on March 7 following comments by United States Federal Reserve Chair Jerome Powell before the Senate Banking Committee. During the congressional appearance, the Fed chairman warned that he bank is prepared to tame inflation by pushing for more significant interest rate increases.\n\nPowell added that “the ultimate level of interest rates is likely to be higher than previously anticipated” and that recent economic data was “stronger than expected.” These remarks significantly increased investors’ expectations of a 50 basis point interest rate hike on March 22, putting pressure on risk assets such as stocks, commodities and Bitcoin.\n\nThat movement could explain why the $565 million Bitcoin weekly options expiry on March 10 will almost certainly favor bears. Nonetheless, additional negative crypto market events might have also played a significant role.\n\nBitcoin from the Silk Road and Mt. Gox are on the move\n\nThe movement of multiple wallets linked to U.S. law enforcement seizures on March 8 added to the price pressure on Bitcoin investors. Over 50,000 Bitcoin worth $1.1 billion were transferred, according to data shared by on-chain analytics firm PeckShield.\n\nFurthermore, 9,860 BTC were sent to Coinbase, raising concerns about the coins being sold on the open market. These wallets are directly linked to the former Silk Road darknet marketplace and were seized by law enforcement in November 2021.\n\nMt. Gox creditors have until March 10 to register and choose a method of compensation repayment. The movement is part of the 2018 rehabilitation plan, and creditors must choose between “early lump sum payment” and “final payment.”\n\nIt is unclear when creditors can expect to be paid in cryptocurrency or fiat currency, but estimates indicate that the final settlement could take several years.\n\nAs a result, Bitcoin’s price drop to $22,000 on March 8 effectively confirmed bears’ advantage on the March 10 options expiry.\n\nBulls placed far more bets, but most will be worthless\n\nThe March 10 options expiry has $565 million in open interest, but the actual figure will be lower because bulls have concentrated their bets on Bitcoin trading above $23,000.\n\nBitcoin options aggregate open interest for March 10. Source: CoinGlass\n\nThe 1.63 call-to-put ratio reflects the disparity in open interest between the $350 million call (buy) options and the $215 million put (sell) options. However, the expected outcome is likely to be much lower, as bulls were caught off guard when Bitcoin fell below $23,000 on March 3.\n\nFor example, if the price of Bitcoin remains near $22,100 at 8:00 am UTC on March 10, only $6 million in call (buy) options will be available. This difference occurs because the right to purchase Bitcoin at $22,500 or $24,000 is rendered null if BTC trades below that level on expiry.\n\nRelated: Bitcoin clings to $22K as US dollar strength rises to December levels — What's next?\n\nThe most likely outcomes favor bears by a wide margin\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on March 10 for call (bull) and put (bear) instruments varies depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit:\n\nBetween $20,000 and $21,000: 0 calls vs. 7,200 puts. The net result favors the put (bear) instruments by $150 million.\n\n0 calls vs. 7,200 puts. The net result favors the put (bear) instruments by $150 million. Between $21,000 and $22,000: 100 calls vs. 5,000 puts. The net result favors the put (bear) instruments by $105 million.\n\n100 calls vs. 5,000 puts. The net result favors the put (bear) instruments by $105 million. Between $22,000 and $23,000: 1,400 calls vs. 1,900 puts. Bears have a modest advantage, profiting some $55 million.\n\n1,400 calls vs. 1,900 puts. Bears have a modest advantage, profiting some $55 million. Between $23,000 and $24,000: 4,600 calls vs. 600 puts. The net result favors the call (bull) instruments by $95 million.\n\nThis rough estimate takes into account only call options in bullish bets and put options in neutral-to-bearish trades. Nonetheless, this oversimplification excludes more complex investment strategies.\n\nA trader, for example, could have sold a call option, effectively gaining negative exposure to Bitcoin above a certain price, but there is no easy way to estimate this effect.\n\nTo turn the tables and secure a potential $95 million profit, Bitcoin bulls must push the price above $23,000 on March 10. However, given the negative macroeconomic pressure and the FUD emanating from Mt. Gox and Silk Road, the odds favor bears in this week’s options expiry.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NpbGstcm9hZC1iaXRjb2lucy13b3J0aC0xLWJpbGxpb24tbW92ZS10by1jb2luYmFzZS1hbm90aGVyLXNlbGwtb2ZmLW9uLXRoZS1ob3Jpem9uLTIwMjMwMzA4MDYxNNIBkwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9zaWxrLXJvYWQtYml0Y29pbnMtd29ydGgtMS1iaWxsaW9uLW1vdmUtdG8tY29pbmJhc2UtYW5vdGhlci1zZWxsLW9mZi1vbi10aGUtaG9yaXpvbi0yMDIzMDMwODA2MTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Silk Road Bitcoins worth $1 billion move to Coinbase, another sell-off on the horizon? - FXStreet",
        "content": "Share:\n\nUS Government law enforcement transferred 49,000 Bitcoin seized from the Silk Road crime proceeds to Coinbase.\n\nBlockchain security firm PeckShield identified that the Bitcoin was seized by the US government in November 2021 and March 2022.\n\nBitcoin price nosedived from $22,469 to $22,000 since the Coinbase transfer of seized BTC.\n\nThe US Government’s law enforcement moved $1 billion worth of BTC seized from the Silk Road to Coinbase, one of the largest cryptocurrency exchanges. A blockchain security firm identified the transfer of the BTC that was seized in November 2021 and March 2022.\n\nAlso read: Will crypto catch up with the rising S&P 500 after record levels of FUD?\n\nSilk Road Bitcoin moves to Coinbase, here’s what to expect\n\nThe US Government law enforcement moved 49,000 Bitcoin worth $1 billion, from its two wallet addresses to Coinbase. This BTC was seized by the regulator in November 2021 and March 2022.\n\nPeckShield, a blockchain security firm, tracked the move on-chain and identified it as proceeds from the Silk Road crimes.\n\nUS Government law enforcement seizes BTC from the Silk Road crimes\n\nThe two wallet addresses, bc1qf2…fsv moved 30,000 BTC and bc1qe7…rdg moved 9,000 BTC seized from Silk Road crimes to Coinbase.\n\nMovement of seized BTC to Coinbase\n\nA total of 51,351 BTC was seized from crime proceeds by the US Government.\n\nWhat were the Silk Road crimes?\n\nSilk Road was a digital black market platform popular for hosting money laundering activities and illegal drug transactions using Bitcoin. Regarded as the first darknet market, Silk Road was launched in 2011 and the Federal Bureau of Investigation (FBI) shut it down in 2013.\n\nThe seized Bitcoin was held by law enforcement in two different wallet addresses identified by PeckShield.\n\nWill the movement of Bitcoin to Coinbase trigger a BTC sell-off?\n\nBitcoin price nosedived since the announcement of the US Government’s move of seized BTC to a cryptocurrency exchange platform. Typically, a rise in BTC inflow to exchange’s wallet addresses increases the selling pressure on the asset and triggers a decline in the asset’s price.\n\nBitcoin exchange inflow (total)\n\nAs seen in the above chart from CryptoQuant, a spike in BTC exchange inflow is followed by a decline in Bitcoin price, historically. As of now, the data for March 8 is incomplete, it cannot be said with certainty that the spike in inflow is driving a sell-off in Bitcoin.\n\nThe largest asset by market capitalization declined from $22,469 to the $22,000 level within the past 24 hours. It remains to be seen whether the rising selling pressure drives the asset lower, or Bitcoin sustains above $22,000."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2YxZWM5ZGYwLTA5MWYtNGUxMy1iN2I3LWNiNTNkZjNjOTQ3ONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Can bitcoin hedge inflation, and other questions to which the answer is no - Financial Times",
        "content": "Print this page\n\n“Confidence must be earned” is the current ad slogan of Amundi, Europe’s biggest asset manager. Keep it in mind while reading its latest thematic paper on what might follow crypto winter.\n\nParis-based Amundi can appear a bit bipolar about crypto. Last February it was reportedly investigating how to sell NFTs to clients while warning them about the “potentially destabilising systemic risk” of stablecoins. Former chief investment officer Pascal Blanqué called bitcoin a “farce”; his successor Vincent Mortier is more amenable:\n\n“If inflation remains above central banks’ targets, bitcoin’s limited supply may start to attract more attention,” write Mortier and strategist Tristan Perrier:\n\nWhile bitcoin spectacularly failed to protect investors against galloping inflation in 2021-22, this was a period of dramatic rises in policy and market interest rates that pressured all asset classes. If inflation is high, but not rising, nominal interest rates will also likely stop climbing and may even fall a little. This is a much more favourable environment for an asset whose supply is finite and that has a long duration in essence, as its main attraction is its future potential rather than its current status.\n\nAnd sure, maybe? The evidence we have suggests that as an inflation hedge bitcoin is useless (Smales, 2021), mostly useless (Conlon et al, 2021), randomly worse than useless (Matkovskyy and Jalan, 2020), or consistently worse than useless (Pinchuk, 2021). The inflation discussion also invites broader questions around whether finite supply is a precondition of all forms of existence (Aristotle, 350BC), and whether “future potential” can matter when applied to something that has unquantifiable exogenous risks but no intrinsic value (Amundi, 2021). But then, a firm doesn’t collect more than almost €2tn in assets by seeding FUD.\n\nAmundi’s “five reasons why recent setbacks may not mean the end of cryptocurrencies” will be familiar to anyone who’s been to Davos or Reddit. There’s the shakeout, where a dotcom-style crash leaves behind a leaner group of eventual winners. There’s proof-of-stake mining as a route out of the energy boondoggle. There’s regulation, which “is more likely than not to be a positive in the end”. And there are signs that the financial mainstream hasn’t abandoned all hope in crypto, Amundi says, somewhat self-referentially.\n\nWhat’s important, Mortier and Perrier suggest, is to separate practice from theory. The experienced reality of crypto (fraud, hubris, incompetence, or some yet-to-be-determined combination of all three) might look unappealing but it’s mostly just TradFi doing TradFi things, so the theory (code-is-law decentralisation) has emerged “mostly unscathed”.\n\nAnd sure? Mayyyyy-be?\n\nA person might argue that the dotcom bust wasn’t defined primarily by bankruptcies and fraud — or had more promoter fraud and less alleged theft — which allowed for a period of industry consolidation and retrenchment. That’s unlikely to happen to crypto. They might argue that in its current form, proof-of-stake mining invites concentration of control so is in direct opposition to Amundi’s core argument. They might see recent crypto press releases from mainstream companies less as a sign of a healthy ecosystem than as the light only just reaching us from a long-dead star.\n\nAs for the positive tailwind of legitimacy through regulation, programmer Stephen Diehl posed the key question on these pixels earlier this month: without a point, what’s the point?\n\nAmundi says that for investors to remain interested in crypto, someone’s going to have to find something productive to do with a blockchain. Financial asset tokenisation is interesting in theory, but applying the concept comes with big hurdles around legality, delivery and adoption.\n\nThese are fair points but again are perhaps not up with recent developments, such as China’s use of blockchain for some ABS contracts. While the experiment might be lowering costs by a few basis points, research so far hasn’t been entirely convincing.\n\nMortier and Perrier conclude:\n\nBlockchains, cryptocurrencies and tokenisation do have a lot of potential, be it in powering new types of decentralised organisations that can offer serious economic and social advantages, or in enabling new ways of trading and managing assets. The most likely outcome is that they will simply need more time to mature before becoming mainstream, as was the case for other technologies in the past. However, they could still turn out to be a dead-end (which could allow time for another cryptocurrencies bull market to last a few years but not much more). At this stage, nothing is proven either way and the jury is still very much out.\n\nIsn’t it normal to give evidence to a jury before expecting its verdict?"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy95dWdhLWxhYnMtZmlyc3QtYml0Y29pbi1uZnQtYXVjdGlvbi1uZXRzLTE2LTVtLWluLTI0LWhvdXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Yuga Labs' first Bitcoin NFT auction nets $16.5M in 24 hours - Cointelegraph",
        "content": "The auction for Yuga Labs’ inaugural Bitcoin Ordinal nonfungible token collection has ended, netting the firm $16.5 million in just 24 hours.\n\nA total of 288 bidders won one of the Bitcoin NFTs from the “TwelveFold” collection. Yuga said the winners will receive their inscription within one week, while the unsuccessful bids will have their bid amount returned within 24 hours.\n\nThe TwelveFold auction has ended. Congratulations to the top 288 bidders - you will receive your inscription within one week. Valid bids that did not rank in the top 288 will have their bid amount returned to their receiving address within 24 hours. — Yuga Labs (@yugalabs) March 6, 2023\n\nThe auction yielded 735 Bitcoin (BTC) worth an estimated $16.5 million at current prices. The highest of the 288 bidders paid just over 7 BTC or $161,000 for one of the pieces.\n\nTop 10 bids leaderboard. Source: TwelveFold\n\nBottom ten bids, the lowest won #288. Source: TwelveFold\n\nYuga announced the collection in late February, describing it as a “base 12 art system localized around a 12×12 grid, a visual allegory for the cartography of data on the Bitcoin blockchain.”\n\nTwelveFold #1 won by the highest bidder. Source: Yuga Labs\n\nIt comprises a limited edition collection of 300 generative pieces inscribed on Satoshis on the BTC network. The lucky winners were eager to share their new NFTs online:\n\nI was lucky enough to place a winning bid for a @yugalabs #Twelvefold #BTC ordinal. Can’t wait to see how this ages in the decades to come. Won’t ever catch me fading #yuga. Also… Massive props to @nftsupply for the help setting up a wallet etc. He’s a huge resource for us all. pic.twitter.com/g8fSDIfhzX — Carsonturner.eth ATL (@carsonturner) March 6, 2023\n\nRelated: Nifty News: Yuga Labs jumps on Ordinals hype\n\nAs reported by Cointelegraph, Yuga Labs received backlash over the weekend from the crypto community, which identified flaws in how Yuga conducted the auction for the Ordinals collection."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9icmFjZS1mb3ItYnRjLXByaWNlLXZvbGF0aWxpdHktYml0Y29pbi1jb2luLWRheXMtZGVzdHJveWVkLW1ldHJpYy1qdW1wcy10by0yLW1vbnRoLWhpZ2hz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Brace for BTC price volatility? Bitcoin 'coin days destroyed' metric jumps to 2-month highs - Cointelegraph",
        "content": "On March 8, addresses linked to the United States government moved 49,000 Bitcoin seized from the Silk Road, worth $1 billion. The transfer was accompanied by Bitcoin’s (BTC) price slipping below $22,000 and a noticeable spike in a key holder metric.\n\nBut does this mean that traders should brace for potential BTC price volatility ahead?\n\nBitcoin’s CDD metric suddenly spikes\n\nThe BTC transfer likely caused a significant spike in Glassnode’s coin days destroyed (CDD) metric. It measures the weighted movement of Bitcoin based on the time it was last moved from an address.\n\nThe CDD is calculated by multiplying the amount of Bitcoin transferred by the number of days since BTC was last added to an address.\n\nA spike in the CDD indicator usually precedes price volatility, with the bears typically having a slight advantage. Some long-term investors, however, may also move Bitcoin to leverage it for more upside gains on the futures market.\n\nBitcoin coin days destroyed. Source: Glassnode\n\nBitcoin on-chain data shows no major sell-off signs\n\nBut the current CDD spike to a two-month high does not necessarily suggest that a $1,000 to $1,500 price move is brewing.\n\nFor instance, the exchange inflow data shows no significant spikes yet. Instead, around 5,000 BTC (worth around $100 million) was moved out of exchanges in the last 24 hours.\n\nThe netflow volume of BTC to/from exchanges. Source: Glassnode\n\nTherefore, the $215 million transfer to Coinbase has had little price impact so far. However, with only around 20% moving to an exchange out of 49,000 BTC, the risk of increased selling pressure remains.\n\nBTC/USD daily price chart. Source: TradingView\n\nCurrently, the BTC/USD pair is trading above support between $21,500 and $21,950, which is encouraging for buyers despite a slew of negative news this week. Further confirmation will arrive with consecutive daily closes above this support area.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9rZXktYml0Y29pbi1wcmljZS1tZXRyaWNzLXBvaW50LXRvLWJ0Yy1kb3duc2lkZS1iZWxvdy0yMi01a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Key Bitcoin price metrics point to BTC downside below $22.5K - Cointelegraph",
        "content": "Bitcoin (BTC) faced a one-hour $1,420 pullback on March 3 following Silvergate Bank’s 57.7% stock crash, which was due to significant losses and “suboptimal capitalization.” The U.S. fintech-friendly bank was a key financial infrastructure provider for exchanges, institutional investors and mining companies, and some investors are worried that its potential demise could have wide-ranging negative impacts on the crypto sector.\n\nThe crypto-friendly bank discontinued its digital asset payment railway — Silvergate Exchange Network — citing excessive risks. Silvergate also reportedly borrowed $3.6 billion from the U.S. Federal Home Loan Banks System, a consortium of regional banks and lenders, to mitigate the effects of a surge in withdrawals.\n\nAmong the impacted exchanges was Dubai-based Bybit, which announced the suspension of U.S. dollar transfers after March 10. The move follows Binance’s international platform, which suspends U.S. dollar fiat withdrawals and deposits on Feb. 6.\n\nFiat on- and off-ramps have always been troublesome areas due to the lack of a clear regulatory environment, especially in the United States. Additional uncertainty came from The Wall Street Journal’s March 3 report on iFinex, the holding company behind Tether and Bitfinex. Leaked documents and emails revealed the group reportedly relied on fake sales invoices and hid behind third parties to open bank accounts.\n\nDespite a Wall Street Journal report alleging that Tether is being investigated by the Department of Justice, USDT (USDT) is still the absolute leading stablecoin, with a $71.4 billion market capitalization. The issue has spread across the industry as Paxos, the issuer of the third-largest stablecoin, was ordered by the New York Department of Financial Services on Feb. 13 to stop issuing Binance USD (BUSD).\n\nLet’s look at Bitcoin derivatives metrics to better understand how professional traders are positioned in the current market conditions.\n\nDerivatives metrics show buyers' shrinking appetite\n\nTraders should refer to the USD Coin (USDC) premium to measure the demand for cryptocurrency in Asia. The index measures the difference between China-based peer-to-peer stablecoin trades and the U.S. dollar.\n\nExcessive cryptocurrency buying demand can pressure the indicator above fair value at 104%. On the other hand, the stablecoin’s market offer is flooded during bearish markets, causing a 4% or higher discount.\n\nUSDC peer-to-peer vs. USD/CNY. Source: OKX\n\nThe USDC premium indicator in Asian markets has been slightly positive for the past three weeks, but it is nowhere near the substantial 4% premium from early January. In addition, the metric shows weakening demand for stablecoins in Asia, down from 2.5% in the previous week.\n\nStill, the present 1.5% premium should be interpreted as positive considering the bearish newsflow regarding crypto-fiat payment railways.\n\nBitcoin's quarterly futures are the preferred instruments of whales and arbitrage desks. These fixed-month contracts usually trade at a slight premium to spot markets, indicating that sellers are requesting more money to withhold settlement longer.\n\nConsequently, futures contracts should trade at a 5%–10% annualized premium in healthy markets. This situation is known as “contango” and is not exclusive to crypto markets.\n\nBitcoin 3-month futures annualized premium. Source: Laevitas\n\nThe chart shows that traders abandoned any prospects of exiting the neutral-to-bearish area on March 3 as the basis indicator moved away from the 5% threshold. However, the current 3% premium is lower than last week’s 4.5%, reflecting fewer investors’ optimism.\n\nOn the bright side, the 6.2% drop in BTC price had a near uneventful impact on Bitcoin futures markets. Higher demand for bearish bets using leverage would have moved the basis indicator to the negative area, known as “backwardation.”\n\nAdditional volatility is expected on March 14\n\nIn the week following Feb. 27, Bitcoin’s price lost 4.5%, indicating that investors are effectively worried about contagion from Silvergate Bank. Even though crypto exchanges and stablecoin providers have denied exposure to the troubled fintech firm, the cut-off from its payment processing system has raised uncertainty.\n\nAnalysts are now focused on the announcement of the Consumer Price Index (CPI) inflation data on March 14. As Cointelegraph noted, CPI prints tend to spark short-term volatility across risk assets, although often short-lived in Bitcoin’s price movements.\n\nDerivatives metrics currently point to limited pressure from the Silvergate Bank saga, but the odds favor Bitcoin bears, considering the diminishing demand for stablecoins in Asia and the BTC futures premium.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby93aGF0LXBvd2VsbHMtbGF0ZXN0LXRlc3RpbW9ueS1tZWFucy1mb3ItYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "What Powell's Latest Testimony Means For Bitcoin - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5kdW1taWVzLmNvbS9hcnRpY2xlL2J1c2luZXNzLWNhcmVlcnMtbW9uZXkvcGVyc29uYWwtZmluYW5jZS9jcnlwdG9jdXJyZW5jeS9jcnlwdG9jdXJyZW5jeS1pbnZlc3RpbmctZm9yLWR1bW1pZXMtY2hlYXQtc2hlZXQtMjU5NDY3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Cryptocurrency Investing For Dummies Cheat Sheet - Dummies.com",
        "content": "{\"appState\":{\"pageLoadApiCallsStatus\":true},\"articleState\":{\"article\":{\"headers\":{\"creationTime\":\"2019-01-16T21:15:40+00:00\",\"modifiedTime\":\"2023-03-08T19:21:53+00:00\",\"timestamp\":\"2023-03-08T21:01:02+00:00\"},\"data\":{\"breadcrumbs\":[{\"name\":\"Business, Careers, & Money\",\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/categories/34224\"},\"slug\":\"business-careers-money\",\"categoryId\":34224},{\"name\":\"Personal Finance\",\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/categories/34273\"},\"slug\":\"personal-finance\",\"categoryId\":34273},{\"name\":\"Cryptocurrency\",\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/categories/34277\"},\"slug\":\"cryptocurrency\",\"categoryId\":34277}],\"title\":\"Cryptocurrency Investing For Dummies Cheat Sheet\",\"strippedTitle\":\"cryptocurrency investing for dummies cheat sheet\",\"slug\":\"cryptocurrency-investing-for-dummies-cheat-sheet\",\"canonicalUrl\":\"\",\"seo\":{\"metaDescription\":\"Educate yourself on the basics of cryptocurrencies, check out the team behind the crypto, and figure out what you need to get started.\",\"noIndex\":0,\"noFollow\":0},\"content\":\"So, you’ve heard about Bitcoin and other cryptocurrencies, and you’re ready to add these new kids on the block to your investment portfolio — that’s great!\\r\n\n\\r\n\nTo make the best decisions for your portfolio, educate yourself on the basics of cryptocurrencies and what you need to get started. Also, be sure to do your homework on a crypto’s fundamentals before adding any new assets to your portfolio.\",\"description\":\"So, you’ve heard about Bitcoin and other cryptocurrencies, and you’re ready to add these new kids on the block to your investment portfolio — that’s great!\\r\n\n\\r\n\nTo make the best decisions for your portfolio, educate yourself on the basics of cryptocurrencies and what you need to get started. Also, be sure to do your homework on a crypto’s fundamentals before adding any new assets to your portfolio.\",\"blurb\":\"\",\"authors\":[{\"authorId\":21503,\"name\":\"Kiana Danial\",\"slug\":\"kiana-danial\",\"description\":\"<strong><span class=\\\"a-text-bold\\\">Kiana Danial</span></strong> is an award-winning, internationally recognized, personal investing and wealth management expert. She is a highly sought-after professional speaker, author, and executive coach. She has been featured in <span class=\\\"a-text-italic\\\">The Wall Street Journal, TIME</span> magazine, CNN, <span class=\\\"a-text-italic\\\">Forbes,</span> TheStreet, and numerous other publications.\",\"hasArticle\":false,\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/authors/21503\"}}],\"primaryCategoryTaxonomy\":{\"categoryId\":34277,\"title\":\"Cryptocurrency\",\"slug\":\"cryptocurrency\",\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/categories/34277\"}},\"secondaryCategoryTaxonomy\":{\"categoryId\":0,\"title\":null,\"slug\":null,\"_links\":null},\"tertiaryCategoryTaxonomy\":{\"categoryId\":0,\"title\":null,\"slug\":null,\"_links\":null},\"trendingArticles\":null,\"inThisArticle\":[],\"relatedArticles\":{\"fromBook\":[{\"articleId\":262472,\"title\":\"Short-Term Analysis Methods for Cryptocurrency Investing\",\"slug\":\"short-term-analysis-methods-for-cryptocurrency-investing\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/262472\"}},{\"articleId\":262463,\"title\":\"3 Short-Term Cryptocurrency Investing Time Frames\",\"slug\":\"3-short-term-cryptocurrency-investing-time-frames\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/262463\"}},{\"articleId\":262455,\"title\":\"Cryptocurrencies in Long-Term Diversification\",\"slug\":\"cryptocurrencies-in-long-term-diversification\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/262455\"}},{\"articleId\":262448,\"title\":\"What You Need for Mining Cryptocurrency\",\"slug\":\"what-you-need-for-mining-cryptocurrency\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/262448\"}},{\"articleId\":262443,\"title\":\"How Mining Cryptocurrency Works\",\"slug\":\"how-mining-cryptocurrency-works\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/262443\"}}],\"fromCategory\":[{\"articleId\":296975,\"title\":\"The Different Tokens of Cryptocurrency\",\"slug\":\"the-different-tokens-of-cryptocurrency\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/296975\"}},{\"articleId\":296944,\"title\":\"How To Set Up a DeFi Wallet with MetaMask\",\"slug\":\"how-to-set-up-a-defi-wallet\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/296944\"}},{\"articleId\":296935,\"title\":\"What Is Decentralized Finance (DeFi)?\",\"slug\":\"what-is-decentralized-finance-defi\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/296935\"}},{\"articleId\":289714,\"title\":\"Cryptocurrency All-in-One For Dummies Cheat Sheet\",\"slug\":\"cryptocurrency-all-in-one-for-dummies-cheat-sheet\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/289714\"}},{\"articleId\":289345,\"title\":\"NFTs For Dummies Cheat Sheet\",\"slug\":\"nfts-for-dummies-cheat-sheet\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/289345\"}}]},\"hasRelatedBookFromSearch\":false,\"relatedBook\":{\"bookId\":282129,\"slug\":\"cryptocurrency-investing-for-dummies\",\"isbn\":\"9781119533030\",\"categoryList\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"],\"amazon\":{\"default\":\"https://www.amazon.com/gp/product/1119533031/ref=as_li_tl?ie=UTF8&tag=wiley01-20\",\"ca\":\"https://www.amazon.ca/gp/product/1119533031/ref=as_li_tl?ie=UTF8&tag=wiley01-20\",\"indigo_ca\":\"http://www.tkqlhce.com/click-9208661-13710633?url=https://www.chapters.indigo.ca/en-ca/books/product/1119533031-item.html&cjsku=978111945484\",\"gb\":\"https://www.amazon.co.uk/gp/product/1119533031/ref=as_li_tl?ie=UTF8&tag=wiley01-20\",\"de\":\"https://www.amazon.de/gp/product/1119533031/ref=as_li_tl?ie=UTF8&tag=wiley01-20\"},\"image\":{\"src\":\"https://www.dummies.com/wp-content/uploads/cryptocurrency-investing-for-dummies-2nd-edition-cover-1119989124-203x255.jpg\",\"width\":203,\"height\":255},\"title\":\"Cryptocurrency Investing For Dummies, 2nd Edition\",\"testBankPinActivationLink\":\"\",\"bookOutOfPrint\":false,\"authorsInfo\":\"<p><b data-author-id=\\\"21503\\\">Kiana Danial</b> is the CEO of Invest Diva as well as an internationally recognized personal investing and wealth management expert. She delivers workshops and seminars to corporations, universities, and investment groups, and has been featured in <i>Forbes</i> and on CNN. She was named the 2018 Personal Investment Expert of the Year by Wealth & Finance International. </p>\",\"authors\":[{\"authorId\":21503,\"name\":\"Kiana Danial\",\"slug\":\"kiana-danial\",\"description\":\"<strong><span class=\\\"a-text-bold\\\">Kiana Danial</span></strong> is an award-winning, internationally recognized, personal investing and wealth management expert. She is a highly sought-after professional speaker, author, and executive coach. She has been featured in <span class=\\\"a-text-italic\\\">The Wall Street Journal, TIME</span> magazine, CNN, <span class=\\\"a-text-italic\\\">Forbes,</span> TheStreet, and numerous other publications.\",\"hasArticle\":false,\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/authors/21503\"}}],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/books/\"}},\"collections\":[],\"articleAds\":{\"footerAd\":\"<div class=\\\"du-ad-region row\\\" id=\\\"article_page_adhesion_ad\\\"><div class=\\\"du-ad-unit col-md-12\\\" data-slot-id=\\\"article_page_adhesion_ad\\\" data-refreshed=\\\"false\\\" \\r\n\ndata-target = \\\"[{\"key\":\"cat\",\"values\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"]},{\"key\":\"isbn\",\"values\":[\"9781119533030\"]}]\\\" id=\\\"du-slot-6408f78eb44d9\\\"></div></div>\",\"rightAd\":\"<div class=\\\"du-ad-region row\\\" id=\\\"article_page_right_ad\\\"><div class=\\\"du-ad-unit col-md-12\\\" data-slot-id=\\\"article_page_right_ad\\\" data-refreshed=\\\"false\\\" \\r\n\ndata-target = \\\"[{\"key\":\"cat\",\"values\":[\"business-careers-money\",\"personal-finance\",\"cryptocurrency\"]},{\"key\":\"isbn\",\"values\":[\"9781119533030\"]}]\\\" id=\\\"du-slot-6408f78eb4bcd\\\"></div></div>\"},\"articleType\":{\"articleType\":\"Cheat Sheet\",\"articleList\":[{\"articleId\":259464,\"title\":\"Things You Must Have Before Investing in Cryptocurrencies\",\"slug\":\"\",\"categoryList\":[],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/259464\"}},{\"articleId\":259461,\"title\":\"The Most Important Things to Know about Cryptocurrency Investing\",\"slug\":\"\",\"categoryList\":[],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/259461\"}},{\"articleId\":259458,\"title\":\"Checking Cryptocurrency Fundamentals Before Adding to Your Portfolio\",\"slug\":\"\",\"categoryList\":[],\"_links\":{\"self\":\"https://dummies-api.dummies.com/v2/articles/259458\"}}],\"content\":[{\"title\":\"Things you must have before investing in cryptocurrencies\",\"thumb\":null,\"image\":null,\"content\":\"<p>Investing and trading cryptocurrencies can be different than investing in other assets, but there are some similarities as well. Here are the most important things you must have before jumping into the cryptocurrency investing space:</p>\n\n<ul>\n\n<li>A cryptocurrency exchange or a broker where you can buy and sell cryptocurrencies</li>\n\n<li>A secure cryptocurrency wallet to store your cryptocurrencies</li>\n\n<li>Knowledge about the cryptocurrency’s fundamentals</li>\n\n<li>Money you can afford to lose</li>\n\n<li>An investment strategy that’s unique to your risk tolerance</li>\n\n</ul>\n\n\"},{\"title\":\"The most important things to know about cryptocurrency investing\",\"thumb\":null,\"image\":null,\"content\":\"<p>Cryptocurrency investing is one of the newest ways to earn profit. As market participants find out more about the industry, many misconceptions are resolved and more people can be a part of the marketplace:</p>\n\n<ul>\n\n<li>At the time of writing, over 21,000 cryptocurrencies other than Bitcoin are out there, and the number may change drastically in the future.</li>\n\n<li>A <em>cryptocurrency</em> is a cross between a currency and a digital asset. Like a currency, you can use it to pay for things. Like a digital asset, you can invest in it for long-term gains.</li>\n\n<li>You’re not buying a currency; you’re buying the idea behind the coin, which is supported by an underlying blockchain technology. <em>Blockchain technology</em> is a distributed ledger that records a growing list of data.</li>\n\n<li>Cryptocurrency investing is very new, so its investment resources are constantly evolving.</li>\n\n<li>Always read about the background of a cryptocurrency, its underlying technology, its management, and its community before investing. Ask yourself what problem a cryptocurrency is trying to solve and why that solution matters.</li>\n\n<li>If you’re buying a cryptocurrency to hold long term, you’re looking for <em>capital appreciation.</em> If you’re actively getting in and out of trades, you’re <em>speculating.</em></li>\n\n<li>The cryptocurrency market is extremely volatile. Make sure you’re investing money you can afford to lose and have enough understanding behind the potential future growth of your investment assets.</li>\n\n<li>Unlike the stock market, you can participate in the cryptocurrency market 24 hours a day, 7 days a week.</li>\n\n<li>Buy the freaking dip. What does that mean? It means that instead of panicking when the prices drop to a dip, it may be the best time for you to buy. Don’t buy when the prices have gone up so much in a short amount of time and the markets are hyped up. Of course, for all your investment decisions, you must analyze the market from different points than just the low price.</li>\n\n<li>Diversify your portfolio with at least five cryptocurrencies from different categories to manage your risk. Expand your horizons by investing in stocks with exposure to blockchain technology and the cryptocurrency market.</li>\n\n</ul>\n\n\"},{\"title\":\"Checking cryptocurrency fundamentals before adding to your portfolio\",\"thumb\":null,\"image\":null,\"content\":\"<p>Before you invest in a cryptocurrency, you must do a little research about it. Pay attention to the following key components when you do your crypto research:</p>\n\n<ul>\n\n<li><strong>The crypto’s white paper: </strong>A <em>white paper</em> is something like a business proposal for new cryptocurrencies. It includes everything potential investors need to know about the crypto, such as technology, purpose, financial details, and so on. Think of it as your crypto’s resume.</li>\n\n<li><strong>The team behind the crypto: </strong>No one really knows who created Bitcoin, but the rest of the cryptocurrencies out there normally have a team behind them who guide the company and its blockchain technology. Make sure to find out about team members’ experience in the field, their motivations, and their authority.</li>\n\n<li><strong>Partnerships: </strong>If you’re not willing to take a lot of risk, seeing who in the industry has put their trust in the hands of the cryptocurrency you’re considering buying is very important. Another good thing about having partners in the traditional world is that the cryptocurrency may have a higher chance of being accepted by the masses.</li>\n\n<li><strong>The crypto’s technology: </strong>Many cryptocurrencies are tokens from blockchain companies with multiple products. The more you get to know the products and the technology behind the cryptocurrency, the better.</li>\n\n<li><strong>The crypto’s contribution to society: </strong>What problem is this cryptocurrency trying to solve? Does it matter to you? Is the team behind the cryptocurrency just trying to get rich quick, or does it have a long-term plan for the betterment of society? Finding answers to these questions can help you decide whether you should consider buying this cryptocurrency.</li>\n\n<li><strong>The road map: </strong>Many companies behind cryptocurrencies have sections on their websites dedicated to their road maps: where they come from, what they’ve achieved, and what they’re planning to accomplish in the future. If available, road maps are a great way to discover a ton of fundamental information about the crypto in a few minutes.</li>\n\n</ul>\n\n\"}],\"videoInfo\":{\"videoId\":null,\"name\":null,\"accountId\":null,\"playerId\":null,\"thumbnailUrl\":null,\"description\":null,\"uploadDate\":null}},\"sponsorship\":{\"sponsorshipPage\":false,\"backgroundImage\":{\"src\":null,\"width\":0,\"height\":0},\"brandingLine\":\"\",\"brandingLink\":\"\",\"brandingLogo\":{\"src\":null,\"width\":0,\"height\":0},\"sponsorAd\":\"\",\"sponsorEbookTitle\":\"\",\"sponsorEbookLink\":\"\",\"sponsorEbookImage\":{\"src\":null,\"width\":0,\"height\":0}},\"primaryLearningPath\":\"Advance\",\"lifeExpectancy\":\"One year\",\"lifeExpectancySetFrom\":\"2023-03-08T00:00:00+00:00\",\"dummiesForKids\":\"no\",\"sponsoredContent\":\"no\",\"adInfo\":\"\",\"adPairKey\":[]},\"status\":\"publish\",\"visibility\":\"public\",\"articleId\":259467},\"articleLoadedStatus\":\"success\"},\"listState\":{\"list\":{},\"objectTitle\":\"\",\"status\":\"initial\",\"pageType\":null,\"objectId\":null,\"page\":1,\"sortField\":\"time\",\"sortOrder\":1,\"categoriesIds\":[],\"articleTypes\":[],\"filterData\":{},\"filterDataLoadedStatus\":\"initial\",\"pageSize\":10},\"adsState\":{\"pageScripts\":{\"headers\":{\"timestamp\":\"2024-03-04T05:50:01+00:00\"},\"adsId\":0,\"data\":{\"scripts\":[{\"pages\":[\"all\"],\"location\":\"header\",\"script\":\"<!--Optimizely Script-->\\r\n\n<script src=\\\"https://cdn.optimizely.com/js/10563184655.js\\\"></script>\",\"enabled\":false},{\"pages\":[\"all\"],\"location\":\"header\",\"script\":\"<!-- comScore Tag -->\\r\n\n<script>var _comscore = _comscore || [];_comscore.push({ c1: \\\"2\\\", c2: \\\"15097263\\\" });(function() {var s = document.createElement(\\\"script\\\"), el = document.getElementsByTagName(\\\"script\\\")[0]; s.async = true;s.src = (document.location.protocol == \\\"https:\\\" ? \\\"https://sb\\\" : \\\"http://b\\\") + \\\".scorecardresearch.com/beacon.js\\\";el.parentNode.insertBefore(s, el);})();</script><noscript><img src=\\\"https://sb.scorecardresearch.com/p?c1=2&c2=15097263&cv=2.0&cj=1\\\" /></noscript>\\r\n\n<!-- / comScore Tag -->\",\"enabled\":true},{\"pages\":[\"all\"],\"location\":\"footer\",\"script\":\"<!--BEGIN QUALTRICS WEBSITE FEEDBACK SNIPPET-->\\r\n\n<script type='text/javascript'>\\r\n\n(function(){var g=function(e,h,f,g){\\r\n\nthis.get=function(a){for(var a=a+\\\"=\\\",c=document.cookie.split(\\\";\\\"),b=0,e=c.length;b<e;b++){for(var d=c[b];\\\" \\\"==d.charAt(0);)d=d.substring(1,d.length);if(0==d.indexOf(a))return d.substring(a.length,d.length)}return null};\\r\n\nthis.set=function(a,c){var b=\\\"\\\",b=new Date;b.setTime(b.getTime()+6048E5);b=\\\"; expires=\\\"+b.toGMTString();document.cookie=a+\\\"=\\\"+c+b+\\\"; path=/; \\\"};\\r\n\nthis.check=function(){var a=this.get(f);if(a)a=a.split(\\\":\\\");else if(100!=e)\\\"v\\\"==h&&(e=Math.random()>=e/100?0:100),a=[h,e,0],this.set(f,a.join(\\\":\\\"));else return!0;var c=a[1];if(100==c)return!0;switch(a[0]){case \\\"v\\\":return!1;case \\\"r\\\":return c=a[2]%Math.floor(100/c),a[2]++,this.set(f,a.join(\\\":\\\")),!c}return!0};\\r\n\nthis.go=function(){if(this.check()){var a=document.createElement(\\\"script\\\");a.type=\\\"text/javascript\\\";a.src=g;document.body&&document.body.appendChild(a)}};\\r\n\nthis.start=function(){var t=this;\\\"complete\\\"!==document.readyState?window.addEventListener?window.addEventListener(\\\"load\\\",function(){t.go()},!1):window.attachEvent&&window.attachEvent(\\\"onload\\\",function(){t.go()}):t.go()};};\\r\n\ntry{(new g(100,\\\"r\\\",\\\"QSI_S_ZN_5o5yqpvMVjgDOuN\\\",\\\"https://zn5o5yqpvmvjgdoun-wiley.siteintercept.qualtrics.com/SIE/?Q_ZID=ZN_5o5yqpvMVjgDOuN\\\")).start()}catch(i){}})();\\r\n\n</script><div id='ZN_5o5yqpvMVjgDOuN'><!--DO NOT REMOVE-CONTENTS PLACED HERE--></div>\\r\n\n<!--END WEBSITE FEEDBACK SNIPPET-->\",\"enabled\":false},{\"pages\":[\"all\"],\"location\":\"header\",\"script\":\"<!-- Hotjar Tracking Code for http://www.dummies.com -->\\r\n\n<script>\\r\n\n(function(h,o,t,j,a,r){\\r\n\nh.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};\\r\n\nh._hjSettings={hjid:257151,hjsv:6};\\r\n\na=o.getElementsByTagName('head')[0];\\r\n\nr=o.createElement('script');r.async=1;\\r\n\nr.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;\\r\n\na.appendChild(r);\\r\n\n})(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');\\r\n\n</script>\",\"enabled\":false},{\"pages\":[\"article\"],\"location\":\"header\",\"script\":\"<!-- //Connect Container: dummies --> <script src=\\\"//get.s-onetag.com/bffe21a1-6bb8-4928-9449-7beadb468dae/tag.min.js\\\" async defer></script>\",\"enabled\":true},{\"pages\":[\"homepage\"],\"location\":\"header\",\"script\":\"<meta name=\\\"facebook-domain-verification\\\" content=\\\"irk8y0irxf718trg3uwwuexg6xpva0\\\" />\",\"enabled\":true},{\"pages\":[\"homepage\",\"article\",\"category\",\"search\"],\"location\":\"footer\",\"script\":\"<!-- Facebook Pixel Code -->\\r\n\n<noscript>\\r\n\n<img height=\\\"1\\\" width=\\\"1\\\" src=\\\"https://www.facebook.com/tr?id=256338321977984&ev=PageView&noscript=1\\\"/>\\r\n\n</noscript>\\r\n\n<!-- End Facebook Pixel Code -->\",\"enabled\":true}]}},\"pageScriptsLoadedStatus\":\"success\"},\"navigationState\":{\"navigationCollections\":[{\"collectionId\":287568,\"title\":\"BYOB (Be Your Own Boss)\",\"hasSubCategories\":false,\"url\":\"/collection/for-the-entry-level-entrepreneur-287568\"},{\"collectionId\":293237,\"title\":\"Be a Rad Dad\",\"hasSubCategories\":false,\"url\":\"/collection/be-the-best-dad-293237\"},{\"collectionId\":295890,\"title\":\"Career Shifting\",\"hasSubCategories\":false,\"url\":\"/collection/career-shifting-295890\"},{\"collectionId\":294090,\"title\":\"Contemplating the Cosmos\",\"hasSubCategories\":false,\"url\":\"/collection/theres-something-about-space-294090\"},{\"collectionId\":287563,\"title\":\"For Those Seeking Peace of Mind\",\"hasSubCategories\":false,\"url\":\"/collection/for-those-seeking-peace-of-mind-287563\"},{\"collectionId\":287570,\"title\":\"For the Aspiring Aficionado\",\"hasSubCategories\":false,\"url\":\"/collection/for-the-bougielicious-287570\"},{\"collectionId\":291903,\"title\":\"For the Budding Cannabis Enthusiast\",\"hasSubCategories\":false,\"url\":\"/collection/for-the-budding-cannabis-enthusiast-291903\"},{\"collectionId\":299891,\"title\":\"For the College Bound\",\"hasSubCategories\":false,\"url\":\"/collection/for-the-college-bound-299891\"},{\"collectionId\":291934,\"title\":\"For the Exam-Season Crammer\",\"hasSubCategories\":false,\"url\":\"/collection/for-the-exam-season-crammer-291934\"},{\"collectionId\":301547,\"title\":\"For the Game Day Prepper\",\"hasSubCategories\":false,\"url\":\"/collection/big-game-day-prep-made-easy-301547\"}],\"navigationCollectionsLoadedStatus\":\"success\",\"navigationCategories\":{\"books\":{\"0\":{\"data\":[{\"categoryId\":33512,\"title\":\"Technology\",\"hasSubCategories\":true,\"url\":\"/category/books/technology-33512\"},{\"categoryId\":33662,\"title\":\"Academics & The Arts\",\"hasSubCategories\":true,\"url\":\"/category/books/academics-the-arts-33662\"},{\"categoryId\":33809,\"title\":\"Home, Auto, & Hobbies\",\"hasSubCategories\":true,\"url\":\"/category/books/home-auto-hobbies-33809\"},{\"categoryId\":34038,\"title\":\"Body, Mind, & Spirit\",\"hasSubCategories\":true,\"url\":\"/category/books/body-mind-spirit-34038\"},{\"categoryId\":34224,\"title\":\"Business, Careers, & Money\",\"hasSubCategories\":true,\"url\":\"/category/books/business-careers-money-34224\"}],\"breadcrumbs\":[],\"categoryTitle\":\"Level 0 Category\",\"mainCategoryUrl\":\"/category/books/level-0-category-0\"}},\"articles\":{\"0\":{\"data\":[{\"categoryId\":33512,\"title\":\"Technology\",\"hasSubCategories\":true,\"url\":\"/category/articles/technology-33512\"},{\"categoryId\":33662,\"title\":\"Academics & The Arts\",\"hasSubCategories\":true,\"url\":\"/category/articles/academics-the-arts-33662\"},{\"categoryId\":33809,\"title\":\"Home, Auto, & Hobbies\",\"hasSubCategories\":true,\"url\":\"/category/articles/home-auto-hobbies-33809\"},{\"categoryId\":34038,\"title\":\"Body, Mind, & Spirit\",\"hasSubCategories\":true,\"url\":\"/category/articles/body-mind-spirit-34038\"},{\"categoryId\":34224,\"title\":\"Business, Careers, & Money\",\"hasSubCategories\":true,\"url\":\"/category/articles/business-careers-money-34224\"}],\"breadcrumbs\":[],\"categoryTitle\":\"Level 0 Category\",\"mainCategoryUrl\":\"/category/articles/level-0-category-0\"}}},\"navigationCategoriesLoadedStatus\":\"success\"},\"searchState\":{\"searchList\":[],\"searchStatus\":\"initial\",\"relatedArticlesList\":[],\"relatedArticlesStatus\":\"initial\"},\"routeState\":{\"name\":\"Article3\",\"path\":\"/article/business-careers-money/personal-finance/cryptocurrency/cryptocurrency-investing-for-dummies-cheat-sheet-259467/\",\"hash\":\"\",\"query\":{},\"params\":{\"category1\":\"business-careers-money\",\"category2\":\"personal-finance\",\"category3\":\"cryptocurrency\",\"article\":\"cryptocurrency-investing-for-dummies-cheat-sheet-259467\"},\"fullPath\":\"/article/business-careers-money/personal-finance/cryptocurrency/cryptocurrency-investing-for-dummies-cheat-sheet-259467/\",\"meta\":{\"routeType\":\"article\",\"breadcrumbInfo\":{\"suffix\":\"Articles\",\"baseRoute\":\"/category/articles\"},\"prerenderWithAsyncData\":true},\"from\":{\"name\":null,\"path\":\"/\",\"hash\":\"\",\"query\":{},\"params\":{},\"fullPath\":\"/\",\"meta\":{}}},\"dropsState\":{\"submitEmailResponse\":false,\"status\":\"initial\"},\"profileState\":{\"auth\":{},\"userOptions\":{},\"status\":\"success\"}}"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8xMjI5OTcvZmVkLWNoYWlyLWRpZ2l0YWwtZG9sbGFyLXNlbmQtYml0Y29pbi10by16ZXJv0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMjk5Ny9mZWQtY2hhaXItZGlnaXRhbC1kb2xsYXItc2VuZC1iaXRjb2luLXRvLXplcm8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Fed Chair Ponders Potential for Digital Dollar to Send Bitcoin to Zero - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nU.S. Congressman Stephen Lynch (D-MA) expressed concern Wednesday over the possible impact of a central bank digital currency (CBDC), asking Federal Reserve Chairman Jerome Powell to ponder the potential for a tokenized version of the U.S. dollar to wipe out other digital assets.\n\nLynch's comments came as Powell testified before the House Financial Services Committee, fielding a series of questions about digital assets.\n\n“I'm worried about a lot of these stablecoins and other cryptocurrencies,” Lynch said. “Do they go to zero when we come up with a CBDC that has the full faith and credit of the United States behind it?”\n\nAD\n\nAD\n\nThe Fed has explored the concept of issuing a digital dollar for years, publishing research as far back as 2016. CBDCs are similar to digital tokens in use today like stablecoins—which track the price of a fiat currency—but are managed by their respective governments instead of being issued by private firms on decentralized networks.\n\nPowell indicated it’s unclear to him why any cryptocurrency that isn’t “drawing on the credibility of the dollar” like Bitcoin or Ethereum has any value at all, regardless of a CBDC’s release. He refrained from commenting on how they could possibly be impacted by a CBDC as a result.\n\n“I’ve never understood the valuation of those,” Powell said regarding coins that “​​don't have any intrinsic value, but nonetheless, trade for a positive number.”\n\nHe also suggested it’s hard to judge how stablecoins would be impacted, citing a lack of regulation in the U.S. that renders the reserves of some stablecoins opaque.\n\nStablecoins like Tether have faced penalties in the past for making false statements about their token’s backing. And last month, Paxos said it was preparing for a potential lawsuit from the Securities and Exchange Commission over its Binance-branded stablecoin BUSD.\n\nAD\n\nAD\n\nLegislation that would provide a regulatory framework for stablecoins has been introduced on Capitol Hill several times, yet each bill so far has failed to gain momentum. Last summer's collapse of Terra’s UST, a so-called algorithmic stablecoin that maintained its value via code instead of being backed by assets, created renewed urgency among lawmakers to establish rules of the road.\n\nEleven countries have already launched a CBDC and nearly 90 countries are either piloting, developing, or researching a CBDC, according to the Atlantic Council’s CBDC tracker. Lynch asked Powell for an update on the Fed’s timeline for potentially releasing one too.\n\n“I can’t give you a date,” Powell responded. “We engage with the public on an ongoing basis. We’re also doing research on policy and also on technology.”\n\nPowell said that the Fed hasn’t yet determined whether a CBDC is an innovation that’s even needed in the U.S., adding the central bank is not at the “stage of making any real decisions.”\n\nHe described the development of a CBDC as being in an early, experimental phase, adding the technology will take years to evaluate. However, Powell indicated that a CBDC could be rapidly rolled out to the public if it’s decided upon by Congress, saying “I think we can get this into the hands of the public very quickly.”\n\nNew York’s Federal Reserve bank has previously engaged in an experiment that simulated how a tokenized dollar could work among financial institutions, launching a pilot program last November that included firms like BNY Mellon and Citi.\n\nOther lawmakers, including French Hill (R-AR), asked Powell questions related to CBDCs, such as whether the Fed chairman still holds the belief that a CBDC would need authorization from Congress.\n\nPowell responded that the U.S. central bank might not need written approval from Congress to establish a CBDC, at least for financial institutions, explaining a “wholesale” CBDC could be a valid for settling transfers between banks and other financial institutions.\n\nAD\n\nAD\n\nPowell had previously said that establishing a tokenized version of the U.S. dollar would need written approval from Congress, but he clarified in testimony before the House Financial Services Committee that the need applies to a CBDC for “retail” consumers.\n\n“We've always been talking about [a] retail CBDC, and that's something we would certainly need congressional approval for,” Powell said. “There are potential forms of a wholesale CBDC that we’d need to look at. It's less clear.”\n\nPowell added that it’s also a valid question to ask why a wholesale CBDC would be needed, alluding to the upcoming launch of FedNow, an instant payment service for Federal Reserve Banks that is set to launch later this year.\n\nSome Republican lawmakers like Tom Emmer have pushed for legislation that would ban the Fed from releasing a CBDC, saying it would erode Americans’ right to financial privacy. He reintroduced the legislation shortly after the Federal Reserve Bank of San Francisco started accepting job applications for CBDC developers and designers."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8wOC9wYXVsLWtydWdtYW4taXMtaGF2aW5nLWEtYml0Y29pbi1tb21lbnQv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAzLzA4L3BhdWwta3J1Z21hbi1pcy1oYXZpbmctYS1iaXRjb2luLW1vbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Paul Krugman Is Having a Bitcoin Moment - CoinDesk",
        "content": "Shortly after the initial tweet, Krugman followed up to announce that “tweeting got results” and his account “seem[s] to be up again.” This is hardly a vindication for Venmo – to the contrary, it’s a further demonstration of just how much Western elite privilege is baked into dismissals of uncensorable financial tools. It isn’t even clear whether Venmo reps were able to offer Krugman an explanation for his brief banning, highlighting the constant and opaque risk such services present."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNsaW5ncy10by0yMmstYXMtdXMtZG9sbGFyLXN0cmVuZ3RoLXJpc2VzLXRvLWRlY2VtYmVyLWxldmVscy13aGF0LXMtbmV4dNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin clings to $22K as US dollar strength rises to December levels — What's next? - Cointelegraph",
        "content": "Bitcoin (BTC) fell to three-week lows on March 8 as stronger-than-expected employment data from the United States dampened risk assets.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nEmployment stats boost Fed hawks, BTC price dips\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD dipping to $21,858 on Bitstamp.\n\nThe pair was attempting to preserve $22,000 as support at the time of writing, with traders’ downside targets still a way off at $21,300.\n\n“Bitcoin not showing the strength I initially wanted to see (slight bounce yesterday taking place),” Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, summarized.\n\n“In that case, looking for some more downwards momentum towards a sweep of the lows at $21.2K before a bounce takes place. If we want $30K, flip $23K is necessary.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/Twitter\n\nFellow trading account Daan Crypto Trades, meanwhile, argued that volatility was due thanks to movements in Bitcoin futures markets.\n\n“Massive bid depth on the Binance futures pair. Combined with quite the ramp up in Open Interest,” he revealed on the day.\n\n“Keep in mind that walls can be deceptive where they can be pulled at any moment. Feels like a bigger move is coming regardless of direction.”\n\nMacro events offered mixed results when it came to moving crypto markets.\n\nAn appearance by Jerome Powell, chair of the Federal Reserve, before the U.S. Congress the day prior failed to spark a reaction, but jobs data on the day sent the mood downhill.\n\n“The expectations were 197K in employed people. The actual number is 242K, which is more positive than expected,” van de Poppe wrote in part of comments on the day’s non-farm employment increases.\n\n“For risk-on investors, not great, as we’ve just heard that Powell wants to increase interest rates more in 2023.”\n\nSuch “hot” employment figures traditionally unsettle risk assets as they imply that the Fed has more leeway to keep financial conditions tighter for longer.\n\nDollar blasts two three-month highs\n\nEstimates on how far the Fed would hike at the next meeting of its Federal Open Market Committee (FOMC) on March 22 evidenced the increasing uncertainty over declining inflation.\n\nRelated: Cathie Wood’s ARK ignores Silvergate, buys Coinbase stock for 6th straight month\n\nInstead of 25 basis points as in February, the market now favored a larger 50-basis-point rate hike, according to data from CME Group’s FedWatch Tool.\n\nFed target rate probabilities chart. Source: CME Group\n\nThe U.S. Dollar Index (DXY) likewise held a potential unwelcome surprise in store for Bitcoin bulls.\n\nAfter a strong session on March 7, the Index consolidated on the day after hitting 105.88 — its highest level since Dec. 1, 2022.\n\n“Watch the DXY... there’s a near perfect set-up for a negatively divergent higher high above 106, then at least a big pullback, or the dump below 100 has begun,” investor David Brady reacted.\n\nU.S. Dollar Index (DXY) 1-day candle chart. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjI5NDcvamFjay1kb3JzZXktYmxvY2stYml0Y29pbi1taW5pbmctZGV2ZWxvcG1lbnQta2l00gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMjk0Ny9qYWNrLWRvcnNleS1ibG9jay1iaXRjb2luLW1pbmluZy1kZXZlbG9wbWVudC1raXQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Jack Dorsey's Block Reveals Plans for Bitcoin 'Mining Development Kit' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlock, Inc. thinks it and developers can build better Bitcoin mining rigs. That's why it's considering building a “Mining Development Kit,” or MDK, it said on Tuesday.\n\nThe company hopes its do-it-yourself kit will spur innovation in Bitcoin mining hardware, it said in an announcement, alluding to a statement from CEO Jack Dorsey on Twitter in 2021 that the company was “considering building a Bitcoin mining system based on custom silicon and open source.”\n\nBlock wrote it would share more details in the coming weeks and months but mused that the MDK would include basic Bitcoin mining rig components, like a hashboard and controller board, open source firmware, software, and lots of documentation.\n\nAD\n\nAD\n\n“We anticipate the MDK being useful for development projects focused on integrating Bitcoin mining into various novel use cases—such as heating solutions, off-grid mining, home mining or intermittent power applications—as well as optimization of Bitcoin mining hardware for traditional commercial mining operations,” Naoise Irwin, Block mining hardware senior product lead, wrote in a blog post.\n\nBlock didn't immediately respond to a request for comment from Decrypt.\n\nIrwin, who’s also the co-founder of solar heating company SolarFlux, joined Block last month after starting his career on Wall Street in 2000 and transitioning to tech and strategy a decade later.\n\nAround this time last year, Block, Inc. announced it had contributed $5 million to a partnership with Elon Musk’s Tesla and infrastructure company Blockstream to pilot an all-solar Bitcoin mining facility in Texas.\n\nSince then, Block has also started designing its own Bitcoin mining semiconductor chips—commonly referred to as ASICs, which stands for application specific integrated circuits.\n\nAD\n\nAD\n\nIt’s not totally out of place, although hardware accounted for less than 1% of a Block’s $17 billion total net revenue in 2022. The bulk of it was generated from transactions, services, and Bitcoin. Block generates Bitcoin revenue when it buys and then sells BTC to its customers, like through its Cash App.\n\nThe rest came from hardware, which accounted for $164 million of that total, according to SEC filings.\n\nBut the company said it’s set to make a big push into the “Bitcoin ecosystem” with Spiral, an independent team contributing to open source projects; TBD, an open decentralized finance developer platform; and hardware projects, like its mining rigs and a self-custody wallet.\n\n“We believe our bitcoin ecosystem can help address inefficiencies in the current financial system, especially with respect to identity and trust,” the company wrote in its annual report.\n\nStill, it had to disclose it’s taken the same kind of battering on its Bitcoin holdings as other publicly traded companies. By the end of 2022, Block has invested a cumulative $220 million in Bitcoin. After factoring in a $118 million impairment loss, the fair market value of Block’s BTC was $133 million.\n\nAlthough the company’s share price experienced a 21% boost since the start of the year, investors don’t yet seem swayed by Block’s Bitcoin aspirations. The company’s shares ended trading on Tuesday at $78.04, down 3% for the day."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTA4L2lycy13YW50cy10by10YXgtYW1lcmljYW5zLWZyb3plbi1jcnlwdG8tYml0Y29pbi1idGMtYXNzZXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "IRS Wants To Tax Americans' Frozen Crypto, Bitcoin (BTC) Assets - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nVoyager. Celsius. Genesis. And of course, FTX. All major crypto companies that went bankrupt last year. All names we’ve talked about a lot on this podcast. But did you know there’s a tax season quirk for US investors with digital tokens tied up in accounts on these platforms? In some cases, even investors who lost access to their funds may have to pay taxes on those assets."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRob3VnaHQtbGVhZGVycy13ZWlnaC10aGUtcHJvcy1hbmQtY29ucy1vZi1vcmRpbmFsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin thought leaders weigh the pros and cons of Ordinals - Cointelegraph",
        "content": "Ordinals are here to stay. Ordinals, or the ability to permanently ink the Bitcoin (BTC) blockchain with data, typically in the format of a picture or JPEG, are a controversial topic among some members of the Bitcoin and wider crypto community. Not so for the builders and the CEOs of Bitcoin-focused companies who were present at the Advancing Bitcoin conference in London.\n\nCointelegraph asked several CEOs, builders and key opinion leaders for their views on Ordinals throughout the conference. The overarching sentiment ranged from curiosity to indifference to deference.\n\nAlex Leishman, CEO of River, told Cointelegraph that he doesn’t have a stance on ordinals just yet, but has recently been gifted an Ordinal:\n\n\"In the abstract, the idea of having this sort of like meta-layer on top of Bitcoin that tracks Sats; that has a separate state or mapping onto the blockchain is really fascinating and could potentially be interesting for other things.\"\n\nFor example, Leishman said he recently played a clone of the classic computer game Doom (called Yet Another Doom Clone) on an Ordinal. “Someone had embedded Doom in JavaScript and in a small web page in an Ordinal,” which Leishman loaded up from the blockchain.\n\nReal gameplay of Yet Another Doom Clone loaded from an Ordinal. Source\n\nEric Sirion, co-founder of and advisor to Fedi, and maintainer of the open-source protocol Fedimint, told Cointelegraph that he’s also “pretty neutral” on Ordinals:\n\n“Essentially, we cannot do anything about it in a way that is morally consistent. Like if we try to fight it, what gives us the right to do that? And also, we cannot effectively fight it. […] So yeah, why get worked up about it?”\n\nSirion added that he’s not necessarily a fan of Ordinals as they might blow up the blockchain a bit, but said: “Who am I to tell other people what to do with the fees they pay like?”\n\nThe Bitcoin blockchain has since “bloated,” reaching an average block size all-time high, but fees have remained more or less consistent.\n\nAverage block size has soared higher since ordinals. Source: Blockchain.com\n\nBenoit Mazouk, CEO of U.K.-based Bitcoin exchange BitcoinPoint, shared Sirion’s concerns about blockchain congestion. Mazouk explained that while he understands key Bitcoin opinion leaders, such as Blockstream CEO Adam Back, who commented that ordinals are “useless,” he’s “more into Bitcoin as a currency.”\n\n\"you can't stop them\" well ofc! bitcoin is designed to be censor resistant. doesn't stop us mildly commenting on the sheer waste and stupidity of an encoding. at least do something efficient. otherwise it's another proof of consumption of block-space thingy. — Adam Back (@adam3us) January 29, 2023\n\nPerhaps a greater concern is that users can upload graphic images and offensive data onto the blockchain. Recently, shock porn was uploaded as an Ordinal.\n\nHowever, the permanence and censorship resistance works both ways: Leishman states that permanent records for potentially important or culturally significant events can be permanently etched into the blockchain. “Ordinals can eventually become composable and it's really truly censorship resistant content,” Leishman commented.\n\nRelated: Yuga Labs’ first Bitcoin NFT auction nets $16.5M in 24 hours\n\nChristian Keroles, managing director at Bitcoin Magazine, recently posted a culturally topical reference to the censuring of Roahl Dahl books, questioning whether the minting of banned books on the blockchain as a form of preservation would be worthwhile.\n\nMaybe banned books are worth inscribing to Bitcoin ‍♀️ https://t.co/WXpDYk4rzs — ck (going to Bitcoin 2023) (@ck_SNARKs) February 28, 2023\n\nIn all, Ordinals are beginning to change the way Bitcoin advocates use and approach Bitcoin. Ordinals offer another use case to the Bitcoin network over its first one: peer-to-peer cash. Leishman sums it up:\n\n“Maybe the Bitcoin database has value for other things, and they're willing to pay for it, which is good for miners and maybe is what actually.”\n\nMiners have earned more revenue per block since Ordinals’ introduction, while video game fans can rest assured that a recreation of Doom is playable, loaded from the Bitcoin blockchain."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vaGFja2Vybm9vbi5jb20vYS1sb29rLWF0LW1pbnRsYXllci1sYXllci0yLXNpZGVjaGFpbi1mb3ItdGhlLWJpdGNvaW4tbmV0d29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "A Look at Mintlayer: Layer 2 Sidechain for the Bitcoin Network - hackernoon.com",
        "content": "Too Long; Didn't Read\n\nPeople Mentioned\n\nMintlayer is a Layer 2 blockchain platform that aims to create a foundation for deploying smart contracts, NFTs, and decentralized applications on the Bitcoin network. The platform mainly focuses on building the infrastructure for decentralized finance on Bitcoin. Mintlayer uses WebAssembly, also known as Wasm, as a virtual machine to enable the development of smart contracts."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pdC1zLW5vdC10aGUtZW5kLW9mLWNyeXB0by1ldS1hc3NldC1tYW5hZ2VyLWdpdmVzLTUtcmVhc29ucy13aHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "It's not the end of crypto: EU asset manager gives 5 reasons why - Cointelegraph",
        "content": "The ongoing cryptocurrency winter and massive collapses in the industry do not mean that digital assets like Bitcoin (BTC) are doomed to fail, according to a major European asset manager.\n\nDespite BTC failing to protect investors against rising inflation in 2021 and 2022, Bitcoin’s limited supply may still attract more attention if inflation remains above central banks’ targets, according to investment executives at Paris-based investment manager Amundi.\n\nAmundi chief investment officer Vincent Mortier and macroeconomist Tristan Perrier on March 2 released a thematic paper analyzing the state and the perspectives of the crypto market. The executives argued that Bitcoin has failed to serve as an inflation hedge over the past two years due to “dramatic rises in policy and market interest rates” that pressured “all asset classes.”\n\nAccording to the paper’s authors, nominal interest rates are likely to stop surging or may even fall if inflation is high, but not rising. Such a situation would potentially lead to a bull market for Bitcoin, the Amundi investment execs said, stating:\n\n“This is a much more favorable environment for an asset whose supply is finite and that has a long duration in essence, as its main attraction is its future potential rather than its current status.”\n\nThe analysts also provided five reasons why the recent setbacks in the crypto industry — including collapses of firms such as FTX and Celsius — may not mean the end of cryptocurrencies.\n\nThe recent crisis is likely to bring more realistic expectations from the industry and “separate the wheat from the chaff,” the Amundi executives said. They compared crypto to blue-chip tech stocks, which also experienced wild price collapses before starting to thrive. The analysts also noted that the current market downturn still comes in line with Bitcoin’s historical price cycles.\n\nBitcoin’s price historical chart. Source: CoinGecko\n\nMortier and Perrier mentioned Ethereum’s successful shift to a proof-of-stake blockchain, highlighting the industry’s capabilities in reducing energy consumption. The executives also noted that the key value propositions of crypto, such as decentralization and immutability of transactions, have not been touched by the crisis.\n\nAnother reason is that prominent companies in finance and other industries have not stopped expressing their interest in crypto entirely, with heavyweights such as BlackRock acquiring a stake in Circle in 2022.\n\nRelated: France on the verge of passing stringent crypto firm licensing laws\n\nFinally, regulation will likely bring a more positive impact on the industry despite certainly causing temporary price setbacks, the analysts argued. They stressed that many regulators have eventually preferred not to put a blanket ban on crypto after several attempts and that advanced economies now see it as a possibility.\n\nDespite expressing some level of bullishness toward the future of crypto, Amundi’s investment executives still noted that the real economic utility of crypto “still needs to be fully confirmed.” That would need widespread use of public blockchains in the real economy and the associated non-speculative demand, the experts noted."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjI5MTAvanVkZ2VzLXNjcnV0aW5pemUtc2VjLWRlbmlhbC1ncmF5c2NhbGUtYml0Y29pbi1ldGbSAVJodHRwczovL2RlY3J5cHQuY28vMTIyOTEwL2p1ZGdlcy1zY3J1dGluaXplLXNlYy1kZW5pYWwtZ3JheXNjYWxlLWJpdGNvaW4tZXRmP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Judges Scrutinize SEC Over Denial of Grayscale Bitcoin ETF - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJudges overseeing Grayscale’s lawsuit against the Securities and Exchange Commission (SEC) questioned the financial watchdog Tuesday, digging into the agency’s basis for denying Grayscale’s application to establish a Bitcoin ETF.\n\nThe questions came during oral arguments in the U.S. Court of Appeals for the D.C. Circuit, overseen by Judges Sri Srinivasan, Neomi Rao, and Harry Edwards. Grayscale initiated legal action against the SEC in June of last year, after an application to convert its Grayscale Bitcoin Trust (GBTC) into a spot market Bitcoin ETF was rejected.\n\nA core element of the SEC’s argument, delivered by SEC Senior Counsel Emily Parise, is that Grayscale’s application lacked data necessary to confidentially determine “whether fraud and manipulation in the spot market impacts futures [markets] in the same way.”\n\nAD\n\nAD\n\nBut Judge Neomi Rao said it seems the futures price of Bitcoin is a derivative of the asset’s spot price which move together 99.9% of the time. She said the SEC has not provided evidence that Grayscale’s claims are wrong.\n\n“It seems like there’s quite a bit of information on how these markets work together,\" Rao said, adding that the SEC \"really needs to explain... how it understands the relationship between Bitcoin futures and the spot price of Bitcoin.”\n\nOn behalf of Grayscale, former U.S. Solicitor General Don Verrilli argued that the SEC’s denial of Grayscale’s application to convert GBTC into a spot market Bitcoin ETF contradicted previous decisions “giving the green light” for futures-based ETFs to trade in the U.S.\n\nHe described the SEC’s denial as “the definition of arbitrary decision-making,” arguing that Grayscale’s spot market ETF would pose the “same risk of fraud and manipulation” that currently approved Bitcoin products that trade on the Chicago Mercantile Exchange (CME).\n\nGrayscale first submitted an application to convert GBTC into an ETF in 2016. According to the company’s website, it holds more than $14 billion worth of assets in the product.\n\nAD\n\nAD\n\nCurrently, shares of GBTC trade at significantly less than the underlying value of the Bitcoin held by Grayscale in its trust partly due to the product’s structure, which prevents shares from being redeemed for Bitcoin. If it were converted into a spot market ETF, shares of BTC would likely track the price of Bitcoin more closely as arbitragers trade the difference away.\n\nAs of Tuesday, shares of GBTC traded at a 42% discount relative to the assets under management by Grayscale in the trust, a gap that’s reached nearly 49% at its widest, according to Ycharts. However, shares climbed upwards of 7.6% to $12.68 amid Tuesday’s oral arguments.\n\nAs of now, no spot-based Bitcoin ETF has been approved in the U.S. by the SEC, which has rejected numerous applications since the Winklevoss twins filed for a Bitcoin ETF-like trust in 2013. But Bitcoin ETFs based on futures contracts have traded in the U.S. since ProShares' Bitcoin futures ETF launched on the New York Stock Exchange in October 2021.\n\nThe SEC has repeatedly cited its mandate to protect investors in the U.S. while rejecting spot-based Bitcoin ETF applications. When Grayscale’s application to convert GBTC into a spot market Bitcoin ETF was rejected last year, the financial watchdog said that Grayscale's application did not do enough to provide protection from “fraudulent and manipulative acts and practices.\""
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vbmZ0cGxhemFzLmNvbS9iaXRjb2luLW9yZGluYWxzLW5mdC_SAS9odHRwczovL25mdHBsYXphcy5jb20vYml0Y29pbi1vcmRpbmFscy1uZnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "An Adventurers Guide to the Bitcoin-Based Ordinals NFT - NFT Plazas",
        "content": "An Adventurers Guide to the Bitcoin-Based Ordinals NFT\n\nOrdinals are inscriptions of content onto individual satoshis that can be tracked and held by users. The data is purely on chain, doesn’t rely on other protocols, and will therefore survive as long as the bitcoin blockchain is up and running. Many new services have emerged that allow users to inscribe, hold, and sell inscriptions. Everyone is doing it. It’s all the rage.\n\nINTRODUCTION\n\nAt the beginning of this year, a bitcoin developer named Casey Rodarmor released a bitcoin native protocol called ordinals, that allows individual satoshis to be “inscribed” with arbitrary data, enabling them to host images directly on the bitcoin network… no third party image hosting services, no links required, all directly on chain. This is a significant contribution to the bitcoin network that opens up a world of possibilities for the blockchain that most regard simply as a monetary instrument. This innovation has been met with strong opinions from both sides of the emotional spectrum. Bitcoin maxis regard it as graffiti on the blockchain that threatens to clog up the mempool, raise mining fees to untenable levels, and possible introduce exploits. Others see this as a breakthrough innovation that allows bitcoin to be a platform for free expression. Since its launch just weeks ago, almost 300,000 “inscriptions” (the Ordinal term for NFTs) have been created, and that number is quickly growing. Even projects like Yuga labs, famous for their Bored Ape Yacht Club collection, has decided to jump in with a new project.\n\nHOW IT WORKS\n\nOrdinals are called ordinals because in number theory it denotes that numbers signify an order. Ordinal numbers are integers (natural numbers like 1, 2, 3…) and can be used to identify an objects place in a list. Satoshis, the fundamental unit of bitcoin where each Satoshi is worth 1 / 100,000,000) of a bitcoin are not naturally ordered and do not have unique identifiers. When people transfer Satoshis between each other, as Casey Rodarmor puts it, they are held in a Satoshi goo superposition, indistinguishable from one another. This was the first basic innovation of Ordinals, creating a protocol that identifies and tracks individual satoshis. The details are somewhat complex, so feel free to read more about ordinal theory on the Ordinals website.\n\nNow that individual satoshis have unique identifiers and can be tracked across the blockchain, they can be inscribed with content. The details of this are also complex, but essentially they are inscribed through an envelope serializing procedure that recognizes the ordinal protocol, denotes the inscription content type, and then includes the actual data in the OP_FALSE and OP_PUSH sections of a bitcoin transaction. Altogether, “the inscription content is contained within the input of a reveal transaction, and the inscription is made on the first sat of its first output.”\n\nOne very important thing to note about inscriptions is that they are inherently limited by the megabyte contents of a bitcoin block. This means that currently 4MB is a hard cap on the size of the data one can inscribe. However, in reality the current practical limit is considerably smaller than that, around 400kb. The reason for this lower limit is because larger data will not be relayed by the Bitcoin Core. The only exception to this is bitcoin miners who have the ability to accept and transmit larger transactions. So yeah, 400kb for the average user. That’s pretty small, which is an interesting constraint on the type of content that can be hosted there. Its also important to mention that the cost of an inscription is directly related primarily to the size of the inscription, as well as how in demand blockspace is at the time of inscription.\n\nNow that we have some of the basics and mechanics down, lets dive into how you can start inscribing, browsing inscriptions, finding a marketplace where these are bought and sold, and holding your inscription (heads up: it will need an ordinal compliant bitcoin taproot wallet). At first, inscribing and holding inscriptions required a lot from its users. You had to be running a full bitcoin node using Bitcoin Core 24 or newer. Even getting to this stage is a task beyond the reach of most. Syncing a full node – meaning the entire history of the blockchain – requires several days or weeks of downloading time, and a large disk on which to store the almost 500GB. Once the full node is synced, a few configurations need to be implemented using the command line in the bitcoin node. Additionally, the Ordinal client needs to be installed, and can only be interacted with on a command line basis. A taproot bitcoin wallet is needed otherwise inscribed sats could be accidentally lost and transferred. It’s a lot, and not for beginners.\n\nWallets\n\nLuckily, with the enthusiasm for Ordinals, several companies have developed tools that accomplish all this for you… and they are growing and developing at a blistering pace. Lets start with wallets. As mentioned, you need a bitcoin Taproot wallet that plays nicely with the ordinal client to ensure you can hold your inscriptions without accidentally transferring them. Several wallets have stepped up to the plate. Two of the best available are Sparrow Wallet and Hiro Wallet. These are both fairly wysiwyg, and there are good guides on how to use them for managing inscriptions. Additional available ordinals wallets include ordinalswallet.com and xverse.app.\n\nInscription Services\n\nNow that you have a wallet that can hold and manage inscriptions, lets talk about resources that allow you to make your own inscriptions. There are two that have really risen to prominence in these early days. The first one is gamma.io. Gamma was one of the first out of the gate offering ordinal minting services, and they have been rapidly developing new tools. Their basic service is an incredibly simple 5 step process that involves choosing the type of data (single image, or text), drag and dropping data to be uploaded and inscribed, fee estimation for the inscription, giving your ordinal compliant wallet address, and finally payment for the inscription. Its really simple once you have the wallet figured out. In their recent tweet, they described some new functionality including minting in bulk (multiple inscriptions at the same time), linking inscriptions to higher resolution assets that are hosted off chain, and generating a dedicated collection page for users. All very cool stuff! Additional minting services that are worth mentioning include inscribenow.io, ordinalsbot.com, ordswap.io, ordimint.com, and generative.xyz.\n\nToday, we’re announcing one of our biggest releases yet — one we know will change the game for #Bitcoin Ordinals: Ordinal Collection Mints 💎 In our typical fashion, this isn’t just a bulk mint option. It’s so much more. Buckle up… 🧵 — Gamma.io (@trygamma) February 28, 2023\n\nMARKETPLACES\n\nWith all the sustained hype around Ordinals, its no surprise a multitude of marketplaces have come into being that allow users to buy and sell inscriptions. In general, there is significant overlap between inscription services, wallets, and marketplaces. Nevertheless, to date, there are a few key players in the space. Marketplaces are either trusted or trustless, meaning that you either rely on the marketplace to act as an intermediary between buyer and seller (trusted) or not (trustless). Trustless marketplaces typically use a PBST mechanism which stands for “partially signed bitcoin transaction,” which allows buyer and seller to put funds and inscriptions in a conditional contract that only executes when all conditions are met. Trustless intermediaries are more in line with the ethos of decentralization, but both have been working seamlessly for all parties. Additionally, these marketplaces are their own islands: there is currently not a general marketplace where all ordinals that are for sale are listed. Each of the following marketplaces have a unique set of ordinals for sale. The most used frequently used sites are ordinals.market, ordswap.io, ordina.ls, and scarce.city. Of these, Scarce.City is worth distinguishing based on the fact that they are an auction house that has been in the space since the beginning of #rarepepe, which makes their prestige, longevity, and mechanism of sale orthogonal to the other marketplaces mentioned. Another class of buying and selling avenues worth mentioning are the various telegram and discord communities that have sprung up like wildflowers around this space. There are innumerable ordinal projects / collections that have bespoke chat spaces devoted to them, where buyers and sellers often meet.\n\nRESOURCES\n\nThe last class of repositories worth sharing are general informational sites. We are still very much in the early days of ordinals, but as a type of digital asset, they seem to have the hallmarks of one that will stand the test of time. Data inscribed on the most trusted, longest running, and widely adopted blockchain is a recipe for longevity. This innovation has actually caused me to reconceptualized the purpose and significance of bitcoin: I see it now as not just the most innovative monetary instrument in the history of humanity, but now it’s a time capsule that preserve information longer and further into the future than any other that I am aware of. This is historic. Coming to this realization and understanding has required uncountable hours scouring the web for small scraps of information. The best way for you to begin that knowledge journey is by first reading ALL of the information contained on ordinals.com. Next, I recommend searching for any and all podcasts that Casey Rodarmor has done (which are many), and listening to all the nuance of his technical explanations and plans for the future. We are currently in V1, so to speak. After that, getting involved in the various chat rooms and visiting all the resources mentioned here will help crystallize your understanding of the mechanics. Here are a few podcasts and videos you might invest some time listening to: resource1, resource2, resource3, resource4.\n\nI hope you have enjoyed this explainer. I know it’s a lot. All new technologies are, even though most of them will fail. For my money, I strongly recommend investing the time to learn about Ordinals. They are not going anywhere, and understanding them with a level of nuance is an easily claimed feather in the cap that even many seasoned crypto enthusiasts have yet to claim. Bitcoin native NFTs are a significant advancement of human ingenuity and the possibilities portended by the bitcoin network.\n\nFollow me @DANCETURN to receive regular updates about ordinals, what they mean, how they are changing the game, and the latest Ordinal tech. You wont be sorry – unless you fade this novel class of digital goods.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vcHJlc3MtcmVsZWFzZXMvbm9ydGhlcm4tbGlnaHRuaW5nLTIwMjMtbm9yd2F5LW1heS1vZmZlci10aGUtd2lsZGVzdC1iaXRjb2luLWV4cGVyaWVuY2UteWV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Northern Lightning 2023 — Norway may offer the wildest Bitcoin experience yet - Cointelegraph",
        "content": "Description: Norway is putting on a major Bitcoin conference with high-signal speakers, topped off with an otherworldly rave running on Lightning.\n\nBy Erik Dale\n\nThis is an opinion editorial by Erik Dale, an organizer of the upcoming Northern Lightning Conference and host of a Scandinavian Bitcoin podcast.\n\nScandinavia may not be the first region that comes to mind when you think of Bitcoin (BTC), but Norway has become the “biggest Bitcoin mining hub in Europe.” With less than 0.07% of the world population, the Norwegians churn out nearly 3% of Bitcoin’s global hash rate, mostly thanks to cheap, stranded and renewable hydropower in the north. And now, Norway is hosting the world’s “most Bitcoin experience” — Northern Lightning 2023.\n\nA pure-signal conference\n\nNorthern Lightning 2023 will take place in Bergen, Norway, from March 17–19, and the Norwegians are going all out.\n\nEverything has been designed for and by Bitcoiners: from the keynotes to the food, the parties and the merch. Merch will be limited to 21 numbered copies. Our vision is to create an annual, intimate experience bringing Bitcoin to a new Nordic city each year until “hyperbitcoinization” is achieved and beyond.\n\nThis first edition will be a three-day Bitcoin conference in a historical setting among Bergen’s dramatic scenery and wooden harbors, headlined by the greatest minds in Bitcoin, with the opportunity to orange pill hundreds of no-coiners at a massive party running on the Lightning Network.\n\nHodlonaut, Knut Svanholm and Peter Todd are just some of the great Bitcoiners who will be joining, covering topics like monetary liberation, Bitcoin adoption and lightning innovation.\n\nFocused on bringing Bitcoiners together and creating deep connections with minimal stage staring, Northern Lightning also wants to provide the purest signal anywhere. Even the DJs are Bitcoiners.\n\nA rave running on Lightning?\n\nEven the DJs? Yes.\n\nThe highlight of Northern Lightning will be one of the world's largest AFK Bitcoin onboarding events — an all-night rave with hundreds of no-coiners set to use Lightning. Headlined by Norway’s leading electronic artists, including Karolinski, Matiago, Klysterik, Antibakke and Trym Søvdsnes, it is set to be a unique orange-pilling opportunity. A lineup this good would fill any venue. So, what happens when 400 thirsty no-coiners meet 200 Bitcoiners, and they all need to use Lightning to buy a beer?\n\nWith the goal of creating an unforgettable, real-world experience of Bitcoin for everyone every year, a rave running on Lightning is a perfect start. Partygoers can use Lightning when buying drinks, renting towels or buying merch, and even buying Bitcoin for cash peer-to-peer when onboarding.\n\nIt’s all designed to offer a little less conversation and more Bitcoin action.\n\nAnd as for the venue, Smien Laksevåg Verft is Bergen’s oldest ship wharf, recently converted into a nightclub opening directly onto the fjord, which will offer free welcome drinks, as well as sauna use and an all-night barbecue.\n\nNot only for adults\n\nTalk of raves may not appeal to the more family-oriented, but Northern Lightning 2023 has got you and your little ones covered, too.\n\nMy own daughter, Lykushka (who is nine), is organizing the kids’ corner and workshop, a space to educate young minds about Bitcoin while having lots of fun. I love when my kids make friends with other Bitcoiners’ kids; they’re usually brilliant too.\n\nKIDS' CORNER & WORKSHOP ⚡#NorthernLightning 2023 is proud to present our new project lead for the #Bitcoin kids experience.\n\n\n\nLykushka (9) will ensure it's safe and fun to bring your family:https://t.co/EPM8MpfQGn pic.twitter.com/Tez9kKlW0J — Erik Dale ⚡ (@EuroDale) February 24, 2023\n\nWhether the event will make them think mommy and daddy are more or less nuts remains to be seen, but they will be welcomed every day until 10 pm Central European Time at Northern Lightning.\n\nAlmost sold out\n\nNorthern Lightning is less than two weeks away, and passes are selling out fast.\n\nThe main conference pass, including access to keynotes, workshops, dinners, meetups and parties, will sell out this weekend. After that, only limited passes will be available, but the limited passes are pretty awesome, and you won’t want to miss out.\n\nCointelegraph is sending a crew to cover Northern Lightning 2023. Join us in Bergen."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZWxmYXJvLm5ldC9lbi8yMDIzMDMvb3Bpbmlvbi8yNjc2MS9jcnlwdG8tYmFyb25zLWdldC1hLWRpcGxvbWF0aWMtZmFjYWRlLWluLWVsLXNhbHZhZG9y0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Crypto Barons Get a Diplomatic Façade in El Salvador - El Faro",
        "content": "Leer en español\n\nEl Salvador’s crypto barons went from eccentric social media personalities to private economic and diplomatic operators. The U.S.-born Max Keiser and Stacy Herbert are investors in the crypto company Bitfinex, directly linked to the stablecoin Tether. Raucous supporters of the adoption of Bitcoin as legal tender, they have become bureaucrats at the service of President Nayib Bukele. In two years, Keiser and Herbert —who used to be propagandists for the Russian government— found in El Salvador an ideal entity to parasitize and put at the service of their agenda.\n\nBukele has given the couple the authority to design public policy that Salvadorans will eventually fund. On November 17, Bukele created the National Bitcoin Office by executive decree, requiring all executive branch offices to collaborate with the Bitcoin Office helmed by Keiser and Herbert. As part of their newfound posts in the Salvadoran government, the two were granted the ability to open “Bitcoin embassies” in Europe and the United States.\n\nThe Bitcoin Office has recruited Salvadoran-American Bitcoin enthusiast Gerson Martínez as one of its spokespersons. Martínez says the office reports directly to Bukele. Its function, he clarifies, is to control the entry of crypto investors to the country. In other words, Keiser, Herbert, and Martínez are gatekeepers of crypto investment in El Salvador.\n\nIt is not clear how Bukele funds the office, who works there, or whether the three are compensated with taxpayer money. Martínez has denied receiving any compensation. However, for Bitfinex and Tether, the strategic value of the office goes beyond money. The state office is a hub for propaganda and corporate diplomacy for the crypto corporations. Bukele has given Bitfinex a diplomatic façade providing an aura of respectability. It is not new for crypto barons to use fronts to gain legitimacy and access new markets at a moment of low public trust in their organizations. On March 3, The Wall Street Journal revealed how Bitfinex and Tether allegedly used fake documents and shell companies to open bank accounts and evade international financial controls.\n\nIn events organized by the Bukele administration, it is common to see Bitcoin gurus Max Keiser and Stacy Herbert attend as special guests. Photo: Carlos Barrera/El Faro\n\nThe executive order that birthed the Bitcoin Office suggests that the entity displaces and replaces Salvadoran diplomacy itself and, therefore, weakens the official role of Foreign Minister Alexandra Hill. Bukele has thus legalized an apocryphal diplomacy of crypto evangelists. When Salvadoran Ambassador Milena Mayorga met in Texas with Assistant Secretary of State Joe Esparza in February, within her “delegation” was Keiser, identified as an “advisor” to Bukele.\n\nWith Mayorga's support, Keiser and Herbert have begun to weave a parallel network to that of El Salvador's embassies and consulates. At a conference in Switzerland, Mayorga “appointed” Josué López, a young Salvadoran residing in Switzerland, as Bitcoin “consul” —as he calls himself— in the European country. López thanked Mayorga, Keiser, Herbert, Bukele, and even Michele Foletti, a member of the Lugano municipal council, for his appointment. He never mentioned Hill. Apparently, López answers to Keiser and Herbert, and not to the Foreign Ministry, which has not included him in its list of ambassadors and consuls.\n\nThe Bitcoin Office appears to be Bitfinex’s puppet embedded in the Salvadoran state. Among its responsibilities will be to design, dictate, and execute public policy projects, and to deploy a network of apocryphal diplomats serving as an echo chamber for official and corporate propaganda, merging both into the same choir. The office helps Bitfinex to navigate the troubled sea of cryptocurrency and the regulatory onslaught of these assets in the United States.\n\nBitfinex's appetite is not waning; the next domino is the release of the volcano bonds. These will be public debt issued by El Salvador, partly in exchange for funds to build Bitcoin City in La Unión. Bitfinex CTO Paolo Ardoino has said that his company wants to commercialize the bonds.\n\nKeiser and Herbert are crypto maximalists who have learned to love financial and political centralization as long as it serves their interests. Rather than importing a new way of doing business, Bitfinex and Bukele replicate the old script that has plagued Salvadoran history: using the Executive branch as a Trojan horse for the personal and corporate interests of a few at the expense of the majority. Let’s see what Bukele gets from this deal in return.\n\nRicardo Valencia is an assistant professor of communications at California State University, Fullerton. Twitter: @ricardovalp"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vZGVjcnlwdC5jby8xMjMwMzIvY2Z0Yy1jaGFpci1zYXlzLWV0aGVyZXVtLWlzLWEtY29tbW9kaXR5LWRlc3BpdGUtZ2Vuc2xlcnMtYml0Y29pbi1vbmx5LXBvc2l0aW9u0gFuaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMzAzMi9jZnRjLWNoYWlyLXNheXMtZXRoZXJldW0taXMtYS1jb21tb2RpdHktZGVzcGl0ZS1nZW5zbGVycy1iaXRjb2luLW9ubHktcG9zaXRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "CFTC Chair Says Ethereum Is a Commodity—Despite Gensler’s ‘Bitcoin Only’ Position - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe chairman of the Commodities and Futures Trading Commission (CFTC) has taken a firm stance against the Security and Exchange Commission (SEC)’s subtle power creep over the digital asset market.\n\nRostin Behnam told the Senate Agriculture Committee on Wednesday that Ethereum, the second-largest cryptocurrency next to Bitcoin, is a commodity.\n\n“It’s been listed on CFTC exchanges for quite some time, and for that reason,” said Behnam, who argued that it creates a “direct jurisdictional hook” for the agency to police both ETH’s derivatives market and underlying market.\n\nAD\n\nAD\n\nHis opinion appears to directly contradict that of SEC chairman Gary Gensler, who argued last month that “everything other than Bitcoin” falls under securities laws. While not naming any names, the chairman has hinted many times that this would include Ethereum—especially after the network transitioned to a proof of stake consensus mechanism.\n\nUnder the Howey Test, a security counts as an asset sold to raise money from the public, from which they expect profits based on the efforts of others. Gensler’s own words reinforced this in January 2022. However, under the securities act, the definition can be much broader.\n\nComments in late November suggested that Behnam had come to agree with the SEC chief that Ethereum fell under this umbrella, but his argument Wednesday shows that he is standing by his long-held position that there’s room for more than one crypto commodity.\n\n“We would not have allowed the Ether futures product to be listed on a CFTC exchange if we did not feel strongly that it was a commodity asset,” he elaborated, stating that his agency has “serious legal defences” to support their case.\n\nThe regulatory chiefs also disagree on stablecoins. While the SEC recently threatened to sue Paxos for issuing BUSD as an unregistered security, Behnam believes stablecoins should be considered commodities—absent any legislation to claim otherwise.\n\nAD\n\nAD\n\nBehnam cited an investigation into Tether during a 2021 lawsuit, after which Tether agreed to pay over $40 million to settle charges that it had lied about its dollar reserves.\n\n“Examining the circumstances around the Tether case, it was clear to our enforcement team and the commission that the Tether stablecoin was a commodity, and that we needed to move forward, and swiftly, to police that market,” he said."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWJ0Yy1pbmRpY2F0b3JzLXBvaW50LWF0LWEtYnVsbC1jeWNsZS1hbmQtb24tY2hhaW4tZGF0YS1yZXZlYWxzL9IBYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWJ0Yy1pbmRpY2F0b3JzLXBvaW50LWF0LWEtYnVsbC1jeWNsZS1hbmQtb24tY2hhaW4tZGF0YS1yZXZlYWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin [BTC]: Indicators point at a bull cycle, and on-chain data reveals… - AMBCrypto News",
        "content": "BTC’s NUPL suggests that the coin has commenced a new bull cycle.\n\nHowever, increasing coin dump indicates a lack of investors’ confidence.\n\nIn a new report, CryptoQuant analyst Sachi found that the assessment of Bitcoin’s [BTC] Net Unrealized Profit/Loss (NUPL) revealed that the leading coin has commenced a new bull cycle.\n\nThe NUPL is a metric used to evaluate the profit margin of the BTC market in relation to its market capitalization. A value below zero indicates an accumulation phase, while values above 0.5 suggest a distribution phase.\n\nAccording to Sachi, “the crucial threshold to monitor is 0.2.” In the current market, BTC’s NUPL has reached this “crucial” position.\n\nThe review conducted by the analyst on BTC’s historical performance found that a golden cross, which typically occurs between the 128 and 200-day moving averages, signals the end of the accumulation phase when the NUPL metric reaches or surpasses 0.2. This signifies the commencement of a bull market.\n\nSachi concluded that a bull cycle was underway as all three critical factors were present once again in the current cycle.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nAccumulation has slowed, but only because…\n\nFor the first time since the unexpected fallout of cryptocurrency exchange FTX, BTC traded momentarily above the $25,000 price mark on 16 February.\n\nAlthough the king coin’s price later went on to trade below $25,000, for a few weeks, investors anticipated that BTC would reclaim the price position, leading them to open several long positions.\n\nHowever, things failed to go as expected, leading to dwindling conviction in any further price rally. Investor’s confidence plummeted further on 3 March when BTC’s price suddenly fell by 5%, dropping from $23,500 to $22,240 due to a sense of insecurity and doubt surrounding Silvergate Capital.\n\nThis led to the liquidation of the long positions earlier opened.\n\nWhile Sachi opined that the decline in accumulation and other factors ushered in a new bull cycle, a look at on-chain data and price chart revealed otherwise.\n\nFirst, BTC’s Open Interest has been in a downtrend since 21 February. The fall in Open Interest coincides with a 10% fall in the asset’s value.\n\nWhen the Open Interest of a crypto asset falls, it means that the number of outstanding contracts or positions in the market has decreased.\n\nIt is often accompanied by a decline in market sentiment or a decrease in the number of traders willing to take positions in the market. As expected, this drives down the value of an asset.\n\nRead Bitcoin [BTC] Price Prediction 2023-24\n\nFurther, on a daily chart, increased coin distribution has put the buyers at the sellers’ mercy. Key momentum indicators such as the RSI and MFI were positioned in downward trends and rested below their respective neutral regions.\n\nLikewise, the coin’s Chaikin Money Flow (CMF) returned a negative -0.09 at press time, indicating the severity of coin distribution. Without a change in conviction, this usually precedes a further price drawdown.\n\nLastly, a look at BTC’s funding rates across exchanges confirmed the lack of confidence that permeated the market at press time. Per data from CryptoQuant, as of this writing, short positions exceeded long positions. It was the highest negative funding rate year-to-date."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbmV1dHJvbnBheS1hbmQtYml0Y29pbnZuLXRvLWhvc3QtbGlnaHRuaW5nY29uLXZpZXRuYW0tYXNpYXMtZmlyc3QtYml0Y29pbi1hbmQtbGlnaHRuaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Neutronpay And BitcoinVN To Host Lightningcon Vietnam, Asia's First Bitcoin And Lightning Conference - Nasdaq",
        "content": "In March, Bitcoin and Lightning builders and developers will congregate at a beachside resort in Da Nang, Vietnam.\n\nAsia’s first Bitcoin and Lightning Network conference will take place in Da Nang, Vietnam, March 22-24, 2023 at the beachside Furama Resort, according to a press release sent to Bitcoin Magazine.\n\n\n\nHosts Neutronpay and BitcoinVN will organize the event in the town which some have dubbed “Bitcoin Beach Vietnam.” The two companies, along with Nunchuk, are all Vietnam-based Bitcoin-only companies, and are excited to share what is happening in Asia as it relates to Bitcoin projects, Bitcoin communities and Lightning adoption across the region.\n\nFounder and CEO of Neutronpay Albert Buu, said of the decision that “When we looked around, we noticed that other parts of the world were being represented with Bitcoin and Lightning events, but Asia and more specifically emerging markets in Asia had none and were being completely overlooked considering high bitcoin usage in the region. We’re proud to say that since we announced the event it has been highly talked about and is now on many people's yearly must-hit conference calendars.”\n\n“We’re extremely excited to be putting on the world's first bitcoin & lightning event in Asia,” Malcolm Weed, COO of Neutronpay said, echoing Buu. “Bitcoin adoption is very strong across the region with countries like Vietnam (1), Philippines (2), India (4), Pakistan (6), Thailand (8), and China (10) all being in the top 10 global rankings for bitcoin adoption, making it the world's bitcoin epicenter. With over 4B people in Asia, representing half the world's population, 70% of which are unbanked, it is no wonder bitcoin adoption is so strong.”\n\nStarting on March 22, the event will commence with a beach meet and greet, followed by two days of speakers who will share the latest advancements in the Bitcoin ecosystem. These presentations will cover both the technological and economic aspects of Bitcoin. Companies building on the Lightning Network are also expected to be well-represented and provide updates on the current state of affairs and exciting ongoing projects.\n\nDue to the limited availability of tickets, only 500 attendees will be able to participate. General admission two-day passes are currently priced at $500, but prices will rise again on March 22. Local Vietnamese attendees can access the non-profit event at a discounted rate of $40. The press release strongly encourages local participants to attend and learn about the technology, as well as meet Vietnamese companies that are building on Bitcoin and Lightning.\n\nSoftware developers from Vietnam that are interested in working with the Lightning Network, are encouraged to contact the organizers at info@neutronpay.com, and those interested in speaking, moderating, volunteering or sponsoring are encouraged to reach out to malcolm@neutronpay.com.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLW1pbmVycy1zaWducy1kdW1waW5nLWJhZC1yYWxseS_SAVBodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vYml0Y29pbi1taW5lcnMtc2lnbnMtZHVtcGluZy1iYWQtcmFsbHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Miners Show Signs Of Dumping, Bad For Rally? - NewsBTC",
        "content": "On-chain data shows Bitcoin miners could be dumping right now, a sign that could provide an impedance to the rally.\n\nBitcoin Miners’ Position Index Has Shot Up Recently\n\nAs pointed out by an analyst in a CryptoQuant post, miners may be putting selling pressure on the market currently. The relevant indicator here is the “Miners’ Position Index” (MPI), which measures the ratio between the miner outflows and the 365-day moving average of the same.\n\nThe “miner outflows” refer to the total amount of Bitcoin that all these chain validators are transferring out of their wallets at the moment. Usually, miners withdraw coins from their reserves with the main purpose of selling them. Thus, a high value of the outflows can suggest that this cohort is dumping large amounts right now.\n\nAs the MPI compares these outflows with their yearly average, the metric’s value can tell us how the current miner selling is compared with the mean for the last 365 days.\n\nWhen this indicator has a high value, it means miners are selling at a higher degree than usual currently, while the metric having a low value could suggest there is lesser selling pressure coming from these chain validators than the average for the past year.\n\nNow, here is a chart that shows the trend in the Bitcoin MPI over the past year and a half:\n\nThe value of the metric seems to have been quite high in recent days | Source: CryptoQuant\n\nAs shown in the above graph, the Bitcoin MPI has spiked up recently and has hit a value of about 4, the highest level that the indicator has observed since April of last year. The metric having such a large value would suggest miners are taking out way more coins than usual, and are therefore potentially putting extraordinary selling pressure on the market currently.\n\nFrom the chart, it’s apparent that spikes in the metric have usually been followed by declines in the price of the crypto. The most extreme example was back in April 2022, when the price saw a very sharp drawdown not too long after the metric recorded even higher values than now.\n\nThe last time the indicator observed high values were back during the collapse of the crypto exchange FTX when the price once again saw a rapid downward move.\n\nBitcoin has been busy rallying during the past week or so, touching as high as $21,000 so far, so these increased withdrawals right now would suggest miners want to take advantage of this profit-taking opportunity while they still can, and dump their coins.\n\nIf this cohort indeed intends to sell with these transfers, then the crypto’s rally could possibly find some impedance and temporarily halt here, if not outright reverse its direction.\n\nBTC Price\n\nAt the time of writing, Bitcoin is trading around $20,800, up 20% in the last week.\n\nThe value of the asset seems to be finding it hard to make a significant break above $21,000 | Source: BTCUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi91cy1nb3Zlcm5tZW50LXRyYW5zZmVycy00MDAwMC1iaXRjb2luL9IBT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi91cy1nb3Zlcm5tZW50LXRyYW5zZmVycy00MDAwMC1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "US Government Transfers 40,000 Bitcoin, Will It Affect The Price? - NewsBTC",
        "content": "The Bitcoin price is under heavy pressure due to fears of “sticky” inflation and yesterday’s ultra-hawkish comments from U.S. Federal Reserve (Fed) chairman Jerome Powell. At press time, BTC was trading just above $22,000 and continued to show no strength yet.\n\nAt this time comes news that the US government is in the process of selling off some of its seized Bitcoin. Blockchain security firm PeckShield first reported that addresses associated with the US government transferred 49,000 BTC worth $1.08 billion today, which were seized from the Silk Road hacker.\n\nOf that total, 9,826 BTC worth $217 million were transferred to Coinbase and 39,175 BTC worth $867 million were transferred to two new addresses. On-chain data provider Glassnode confirmed this, adding that most (so far) appear to be internal transfers, but approximately 9,861 BTC were sent to a Coinbase cluster.\n\nGlassnode also shared the chart below, displaying the estimated Bitcoin balance of the US government.\n\nPeckShield also stated that about 51,351.9 BTC of Silk Road Crime Proceeds were seized by the US government in November 2021 and March 2022 and clustered into 2 addresses.\n\nThe seized Bitcoin from founder Ross Ulbricht’s legendary darknet platform “Silk Road” make up a large portion of the US government’s holdings. While Ulbricht was sentenced to life in prison without parole in 2015, he was ordered to pay $183 million in restitution related to Silk Road’s total sales.\n\nBefore the marketplace was shut down, Silk Road experienced a hack in which 69,370 BTC were stolen. The government seized these Bitcoins in November 2020, and Ulbricht relinquished all rights to the Bitcoin and used them to pay the restitution.\n\nWill The US Government Impact The Bitcoin Price?\n\nA Bitcoin dump by the US government does not seem very likely according to current information. The 9,826 BTC presumably sent to Coinbase is too little to affect the price. The other funds moved appear to be internal transfers only.\n\nTherefore, a warning of a dump is by no means appropriate. Moreover, it should be emphasized that the U.S. government usually chooses a different way to sell seized Bitcoin. Usually, the sale is done through General Services Administration (GSA) auctions, where confiscated Bitcoins are auctioned off in lots to willing buyers without affecting the price.\n\nAt press time, the BTC price had to fight off the macro economic headwinds and was trading at $22,025. The $21,900 price level continues to serve as the key support for BTC.\n\nShould the level be breached to the south, a new lower low would be in play. Of particular importance then becomes the price level around $21,600 to write a higher low and maintain the uptrend in the 1-day chart.\n\nFeatured image from Medium, Chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9jcnlwdG9xdWFudC1iaXRjb2luLXBubC1idWxsaXNoLWNyb3Nzb3Zlci_SAVNodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vY3J5cHRvcXVhbnQtYml0Y29pbi1wbmwtYnVsbGlzaC1jcm9zc292ZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "CryptoQuant’s Bitcoin PnL Index Forms Bullish Crossover - NewsBTC",
        "content": "CryptoQuant’s Bitcoin on-chain PnL index has surged above its 365-day MA recently, a crossover that has historically signaled early bull markets.\n\nBitcoin On-Chain PnL Index Has Formed A Bullish Crossover\n\nAs per data from the on-chain analytics firm CryptoQuant, the index is indicating a buy signal for BTC right now. The “CryptoQuant on-chain PnL index” is a metric that combines three different indicators into one to point out tops, bottoms, and cyclical shifts in the price of Bitcoin.\n\nThe first of the metrics that the PnL index uses is the “MVRV ratio,” which is a model that checks whether BTC is currently overvalued or undervalued by comparing the crypto’s market cap with a fair value model called the “realized cap.”\n\nThe second relevant indicator here is the “NUPL,” which tells us whether the Bitcoin market as a whole is currently carrying an unrealized profit or an unrealized loss. This metric can provide hints about whether there is a buying or selling motive among investors right now.\n\nFinally, there is the Spent Output Profit Ratio (SOPR), which tracks whether the average holder is selling at a loss or a profit at the moment. The SOPR shouldn’t be confused with the NUPL, as the quantity being measured by the NUPL is the “unrealized” profit/loss, which is the profit or loss that investors have accumulated but are yet to harvest (or “realize”) as they are still to sell their coins.\n\nThere are actually two SOPR metrics of interest here; the version specifically for the short-term holders (STHs) and that for the long-term holders (LTHs). The entire Bitcoin market can be divided into these two groups, with the criteria being that holders who bought within the last 155 days fall into the former cohort, while those who bought before that fall into the latter.\n\nNow, here is the data for the CryptoQuant on-chain PnL index, which takes all these different Bitcoin indicators and combines them into one model for the crypto:\n\nLooks like the value of the metric has shot up | Source: CryptoQuant\n\nAs displayed in the above graph, the CryptoQuant on-chain PnL index has sharply risen out of the historical bottom zone recently. The chart also includes the curve for the 365-day moving average (MA) of the metric, and it’s clear that the index has crossed above this MA with the latest surge.\n\nHistorically, such a crossover during bearish periods has signaled a transition toward an early bull market. If this pattern holds true this time as well, then the current breakout could be good news for the ongoing rally.\n\nHowever, back in 2015, an initial breakout like the current one did end up failing, and it was only later that a successful transition took place. Nonetheless, CryptoQuant notes “although it is still possible for the index to fall back below, the CryptoQuant PnL Index has issued a definitive buy signal for BTC.”\n\nBTC Price\n\nAt the time of writing, Bitcoin is trading around $22,900, up 11% in the last week.\n\nBTC seems to be showing stale price action | Source: BTCUSD on TradingView\n\nFeatured image from Hans Eiskonen on Unsplash.com, charts from TradingView.com, CryptoQuant.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9taWNyb3N0cmF0ZWd5LWJvdWdodC1iaXRjb2luL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9taWNyb3N0cmF0ZWd5LWJvdWdodC1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "MicroStrategy Bought Bitcoin To Avoid Liquidation, Peter Schiff Reveals - NewsBTC",
        "content": "Bitcoin detractor and economist Peter Schiff has taken another swipe at the digital asset and MicroStrategy, a public company that is heavily invested in the digital asset. Schiff has always been vocal about his disdain for bitcoin and has now turned his attention to MicroStrategy and its former CEO, Michael Saylor.\n\nWhy MicroStrategy Bought Bitcoin\n\nIn a tweet, Peter Schiff revealed to his more than 890,000 Twitter followers what he says was the real reason behind Michael Saylor and MicroStrategy’s move to begin investing in bitcoin. According to Schiff, former CEO Michael Saylor had admitted that buying BTC was actually a last-ditch effort to save the company from being liquidated. He further dissed the company saying that it has nothing going for it other than a leveraged speculative position on the digital asset.\n\nFor the first time I heard @saylor admit that adding #Bitcoin to the @MicroStrategy balance sheet was basically a Hail Mary to avoid liquidating the company. If the only thing $MSTR has going for it is a leveraged speculative position in Bitcoin, than it has nothing going for it. — Peter Schiff (@PeterSchiff) December 20, 2022\n\nAs expected, Schiff’s strikes toward bitcoin were met with pushback from supporters. One user took to the comment section to defend MicroStrategy’s decision as one that was taken so it could acquire the “scarcest and most desirable asset the world has ever seen.” However, Schiff would denounce this saying that bitcoin was in no way scarce nor was it desirable. He also added that bitcoin was a way to lose money.\n\nSchiff continues to advocate for gold as a better option for investors. Bitcoin maximalist Dan Held hit back at the economist saying, “[Gold] is hardly scare and in no way desirable. If you want to lose your money there are plenty of ways to do it. You don’t need to buy [Gold].”\n\nBTC touches above $16,800 | Source: BTCUSD on TradingView.com\n\nSo Why Did Saylor Buy BTC?\n\nMichael Saylor is arguably one of the most vocal bitcoin bulls. The ex-CEO of MicroStrategy has previously stated that his decision to purchase bitcoin was that he believed that the digital asset is the future of finance. Additionally, Saylor previously revealed that he had personally owned BTC before MicroStrategy had begun purchasing the cryptocurrency, his own personal holdings serving as evidence for the profitability of the asset.\n\nAs the company expects the price of bitcoin to appreciate over time, it believes that it will serve as an effective inflation hedge over the long term. Saylor himself has referred to BTC as “digital gold, saying “We find the global acceptance, brand recognition, ecosystem vitality, network dominance, architectural resilience, technical utility, and community ethos of Bitcoin to be persuasive evidence of its superiority as an asset class for those seeking a long-term store of value.”\n\nMicroStrategy’s decision to invest in bitcoin also helped boost the popularity of the company, going from a company operating in the background to one of the most popular names among cryptocurrency enthusiasts.\n\nMicroStrategy is currently the public company with the largest BTC holdings in the world. The company held 130,000 BTC as of Sep. 30, 2022, worth over $2.1 billion at current market prices. At a cumulative entry value of almost $4 billion, the company is recording more than $1.7 billion in unrealized losses following the market downturn.\n\nFeatured image from Blockchain Reporter, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLWV4Y2hhbmdlLWluZmxvdy0yMDIwLWFjdGl2aXR5LWxvdy_SAVNodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vYml0Y29pbi1leGNoYW5nZS1pbmZsb3ctMjAyMC1hY3Rpdml0eS1sb3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Exchange Inflows Fall To 2020 Levels As Activity Remains Low - NewsBTC",
        "content": "Data shows the Bitcoin exchange inflows and outflows have both shrunk recently as market activity has remained low.\n\nBitcoin Exchange Inflows & Outflows Continue To Decline\n\nAs per the latest weekly report from Glassnode, the BTC inflow volumes are now only around $350-$400 million per day. The “exchange inflow” is an indicator that measures the total amount of Bitcoin currently being deposited to centralized exchanges by holders. Its counterpart metric is the “exchange outflow,” and it naturally tracks the volume leaving exchange wallets.\n\nGenerally, during periods of high activity in the market, both these indicators rise to high values as a large number of investors make their respective moves. However, the price may react in particular directions depending on which of these metrics is higher at the moment.\n\nSince one of the main reasons why investors use exchanges is for selling purposes, inflows outweighing outflows could be bearish for Bitcoin. On the other hand, outflows being more dominant can suggest there may instead be buying pressure in the market as investors are withdrawing their coins for accumulation.\n\nNow, here is a chart that shows the trend in the Bitcoin exchange inflows and outflows over the last few years:\n\nlooks like both these metrics have declined in recent weeks | Source: Glassnode's The Week Onchain - Week 2, 2023\n\nAs shown in the above graph, the Bitcoin exchange inflows and outflows were both at high levels during the past couple of years, with their volumes remaining in the range of multi-billion dollars throughout. At the peak of inflows back in May 2021, between $2.8 billion to $3.5 billion per day was entering exchange wallets.\n\nRecently, however, both the inflows and the outflows have significantly declined. Currently, the inflow volumes are between $350 million to $400 million per day, which are lows not seen since 2020. The outflows haven’t quite shrunk to these levels yet, possibly because of the fact that the collapse of FTX lead to renewed interest in self-custody among investors, which made them withdraw large amounts from centralized platforms.\n\nIn the chart, data for the Ethereum exchange flows are also displayed. It seems like before May 2021, the Bitcoin exchange flow dominance was about 70%, which means the combined volumes of Ethereum inflows and outflows made up for 30% of the total between ETH and BTC during the period.\n\nBut since May 2021, the share of the Ethereum flows has significantly increased as ETH inflows and outflows dominance is now 42%. This trend suggests that the relative trading interest in ETH has gone up in the last one and a half years, while BTC has lost some mindshare.\n\nThough, in pure numbers, both cryptocurrencies have seen very little market activity recently as both their exchange inflows and outflows are at pretty low values.\n\nBTC Price\n\nAt the time of writing, Bitcoin is trading around $17,200, up 3% in the last week.\n\nThe value of the asset seems to have surged in the last couple of days | Source: BTCUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by1wcmVkaWN0aW9ucy1mb3ItMjAyMy1ldGhlcmV1bS1hbmQtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Crypto Predictions for 2023: Ethereum and Bitcoin - Analytics Insight",
        "content": "As digital assets continue to grow in popularity worldwide, many investors are looking for ways to stay ahead of the game. If Cryptocurrencies can continue to build on their already strong foundation, there’s no telling how much their prices could go up. For that reason, it’s essential to stay well informed and learn all about the predictions of these two cryptocurrencies for the year that has just commenced.\n\nFor those who are looking to get in on the action early, there are a few things to do. The first is to learn about the predictions of these two currencies and then read about what steps to take to start investing in Crypto. You can do that by checking out this article with predictions for Ethereum and Bitcoin prices in 2023 and a guide on how to invest in them.\n\nOur predictions for Bitcoin\n\nCryptocurrencies have doubtlessly been on the rise for years now. Bitcoin, in particular, has seen tremendous growth, with its value increasing tenfold since 2017. This trend is expected to continue in the coming years, and many experts have made bitcoin price predictions 2023 that are staggering.\n\nSome believe that bitcoin could reach as high as $1 million per coin by the end of 2023, while others believe it will settle around $100,000. Those who get in early stand to make the most profit, so it’s important to do your research and make an informed decision about whether or not to invest.\n\nOur predictions for Ethereum\n\nThe year 2023 might see Ethereum prices reach new highs. ETH could be worth $10,000 by the end of this year. While this may seem like a stretch, it’s important to remember that the price of Bitcoin reached nearly $20,000 very fast.\n\nThe growth of the DeFi sector, increasing institutional adoption, and the launch of ETH 2.0 could all contribute to pushing Ethereum prices higher in 2023, which is why the Ethereum price prediction is high.\n\nIf you’re looking to get involved and want to invest in Ethereum, there are a few actions you can take. Naturally, you should first make sure you carry out your research before investing in it. After that, look into buying ETH on a reputable exchange like Coinbase or Kraken. And for your final step, consider storing your ETH in a secure wallet like Ledger or Trezor. By keeping an eye on Ethereum price predictions for 2023, you could make more informed decisions for investing in ETH.\n\nSteps to take for your first Crypto investment\n\nAs you could have concluded by now, Bitcoin and Ethereum are two of the most popular cryptocurrencies, and their prices have certainly caught plenty of attention. If you’re thinking about investing in crypto, here are some factors to consider.\n\nThe basics\n\nIt’s important to understand how cryptocurrency works. Cryptocurrency is a digital currency that uses cryptography to secure its transactions. Bitcoin, for example, is based on a decentralized network of computers that keep track of all bitcoin transactions. Ethereum is similar but also allows users to create contracts and programs within the Ethereum network.\n\nResearch\n\nYou need to decide which currency you want to invest in. There are numerous different cryptocurrencies available, each with its own set of advantages and disadvantages. Make sure to research each one to find the one that suits your needs best.\n\nAccount setting\n\nYou need to open an account with a reputable exchange where you can buy and sell cryptocurrency. Coinbase is a popular option for those looking to invest in Bitcoin or Ethereum. Once you’ve set up your account, you’ll be able to buy and sell currency pairs like BTC/USD or ETH/USD.\n\nCaution\n\nLast but not least, it’s vital to remember that cryptocurrency prices are highly volatile. This means that they can fluctuate rapidly in value, so it’s important to monitor the market closely before making any trades. You should also have a clear exit strategy planned out before buying or selling any Crypto.\n\nThere are plenty of expectations in the crypto market in store for 2023 and the future of Ethereum and Bitcoin looks very bright. However, you will need to carry out your research and be cautious, while continually reading news about the price changes of Cryptocurrencies you want to invest in.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXBvaXNlZC10by1vdXRwZXJmb3JtLWFuYWx5c3Qv0gFOaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9iaXRjb2luL2JpdGNvaW4tcG9pc2VkLXRvLW91dHBlcmZvcm0tYW5hbHlzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Poised To Resume Its Inclination To Outperform, Says Bloomberg Senior Analyst - NewsBTC",
        "content": "After the Bank of Japan (BOJ) announced a surprising turnaround in its monetary policy today, the Bitcoin price managed to rise near the important resistance level of $16,900. The BOJ announced that it will drastically widen its yield curve control band to 0.50%. At the same time, it announced that it will significantly increase the number of government bonds it will buy each month.\n\nAccording to Bloomberg senior commodities analyst Mike McGlone, this trend could continue. McGlone shared his insights via Twitter and said that a “warm spell” is ahead for Bitcoin.\n\nAs the analyst notes, BTC has taken a beating as a risk asset in 2022 with most other cryptocurrencies, but “appears poised to resume its inclination to outperform.” This will happen when the U.S. Federal Reserve eases monetary policy and completes its pivot.\n\nBitcoin Is Set To Outperform When…\n\nAccording to the chart from a Bloomberg Intelligence report, the levels that BTC and the Nasdaq 100 stock index have been resisting have now turned into support.\n\nAccording to the analysis, the BTC price soared in 2020 and 2021 due to unprecedented fiscal and monetary stimulus, allowing it to outperform the stock index. McGlone further elaborated:\n\nAt a Bitcoin/ Nasdaq ratio of 1.5x on Dec. 16, what’s been consistent for most of the benchmark crypto’s history is its declining relative risk vs. the stock index. At 2x, Bitcoin’s annual volatility at the end of 2022 compares with 4x at the end of 2021.\n\nIn the coming year of 2023, McGlone expects that it will be a matter of how much lower global economies fall. Investors should by no means underestimate BTC then, as the risk/reward ratio is in favor of the leading cryptocurrency.\n\n“Risk vs. reward appears to argue against under-allocating or estimating the propensity for Bitcoin to continue its trajectory toward becoming digital collateral,” McGlone claimed.\n\nIn other words, the Bloomberg analyst predicts that as soon as the U.S. Federal Reserve fires up its money printer again, cuts interest rates and returns to monetary easing, Bitcoin will “outperform” the rest of the market again.\n\nIn another tweet, McGlone predicted that the leading cryptocurrency will outperform the Tesla stock. “The near-certain decline in Bitcoin supply compared to the rising number of Tesla shares outstanding favors cryptocurrency outperformance when the rules of economics apply,” McGlone said.\n\nBTC Price At Crucial Level\n\nMeanwhile, the BTC price needs to crack the extremely crucial $16,900 level in the short term and could then have a strong continuation. If so, investors should then keep an eye on the next vital resistance in the $17,350 area.\n\nFeatured image from Kanchanara on Unsplash, Chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXByaWNlLWNhdGNoLXVwLTI4MDAwLWlzLWtleS1sZXZlbC_SAVNodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vYml0Y29pbi1wcmljZS1jYXRjaC11cC0yODAwMC1pcy1rZXktbGV2ZWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Price Plays Catch-Up With Altcoins, Why $28,000 Is A Key Level - NewsBTC",
        "content": "The Bitcoin price is finally seeing some profits, but it seems weak compared to other crypto assets. The macroeconomic environment is waking up, shaking things across all asset classes.\n\nAs of this writing, the Bitcoin price trades at $16,800 with sideways movement in the last 24 hours. In the crypto top 10, BTC is lagging behind Ethereum, Binance Coin, and Cardano. These cryptocurrencies are positively reacting to the start of 2023.\n\nBitcoin Price Aims For Higher Levels\n\nPer a recent report from the trading desk QCP Capital, institutions are returning to action and allocating capital in Gold and other assets. The precious metal has seen a 15% rally in the past 60 days and keeps trending upwards.\n\nThe trading desk believes institutions are allocating into “alternative assets” or stores of value. The Bitcoin price is yet to benefit from this trend, but the crypto market is recording some profits. In particular, the non-fungible token space.\n\nThis sector is coming back to life after months of declining activity. Popular NFT collections experienced 2 to 3x profits in late 2022 and are likely to maintain the trend. QCP Capital noted Bitcoin and Ethereum’s price action:\n\n(…) in line with Gold and NFTs, BTC and ETH are playing catch up to some extent at the start of the year. Despite the mini rally, BTC is still trading in an extremely tight falling wedge – with 18k the key breakout level to the topside.\n\nIf the Bitcoin price can flip $18,000 and trend higher on the back of institutional allocation to alternative assets, the cryptocurrency could reclaim higher levels. The trading desk points to $28,000 as a critical level to watch.\n\nThis level is the neckline of the “Head and Shoulders” pattern formed by BTC in the past two years. In addition, $28,000 has confluence with the 61.8% Fibonacci Retracement level, meaning many players will keep an eye on it.\n\nWhat Could Operate As An Obstacle For Bitcoin\n\nIn the short term, the Bitcoin price is seeing resistance at its current levels. Analyst Caleb Franzen claims that BTC is likely to continue seeing resistance around these prices and higher.\n\nIn 2022, the levels at $17,000 operated as critical support. Once lost, these levels turned into significant resistance, likely creating friction for the cryptocurrency. As the analyst pointed out, Bitcoin was already rejected from these levels in an attempt to rally beyond the $18,000 mark. Franzen said:\n\nBitcoin is decisively within a potential resistance range. Even if price manages to break above this diagonal resistance channel, we can’t ignore overhead resistance from the former 2022 support range. We’ve already been rejected there once…\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXBhcmFib2xpYy1zYXItYnRjdXNkdC_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vYml0Y29pbi1wYXJhYm9saWMtc2FyLWJ0Y3VzZHQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "“Parabolic” Signal That Triggered Past Bitcoin Bull Runs Reappears - NewsBTC",
        "content": "Bitcoin price made a 5% move today, poking above $19,000 momentarily. It is currently the largest daily climb of 2023 and since the FTX collapse.\n\nMore significantly, the sharp rally tagged a level that triggered a possible trend change according to the weekly Parabolic SAR. In the past, the technical indicator has lived up to its name. What could it mean this time?\n\nBitcoin Makes Biggest Move Of 2023\n\nThe start of 2023 has been positive for altcoins. But up until today, Bitcoin has been mild by comparison.\n\nFollowing today’s CPI data release coming in at 6.5% and Biden’s victory lap on inflation, Bitcoin price soared by $1,000, taking the top cryptocurrency above $19,000 briefly.\n\nMore importantly than what happened today, was what occurred on the weekly timeframe. BTCUSDT (Binance) weekly tagged the Parabolic SAR for the first time since May 2022. The LUNA collapse pulled Bitcoin and other cryptocurrencies lower, beginning the second, more aggressive phase of the recent downtrend.\n\nThe same Parabolic SAR signal was also triggered prior to the 2019 crypto rally, and the 2020 to 2021 bull run (pictured below). Both rallies also blossomed from the same exact trend line previously.\n\nThe Parabolic SAR has produced profitable results | BTCUSDT on TradingView.com\n\nBTCUSDT Weekly Triggers Parabolic SAR Buy Signal\n\nThe Parabolic SAR is a technical indicator designed by J. Wells Wilder, Jr. and is used to detect changes in trend direction. The tool consists of a visual overlay of SAR dots that hover above or below price action, determining the direction of the trend.\n\nWhen the SAR dots are tagged, it suggests that a trend might “stop and reverse” — which is precisely what SAR stands for. Therefore, it’s especially effective in timing entire and exits. Because the SAR dots travel higher or lower alongside the trend, they can be used reliably to set trailing stop losses.\n\nOn weekly timeframes, BTCUSDT (Binance) touched the Parabolic SAR, essentially telling short traders to get out of the position. If bears had used the PSAR for trailing stop losses, they’ve now been stopped out — purposely — in profit.\n\nWhile the signal isn’t a guarantee of continued upside, considering that the possible signal of a trend change has appeared alongside the coincidental timing of a long-term trend line touch, the recovery from this level could be more sustainable than many are ready for.\n\nFollow @TonySpilotroBTC on Twitter or join the TonyTradesBTC Telegram for exclusive daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LXNlZXMtMy01OS1kcm9wL9IBUmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LXNlZXMtMy01OS1kcm9wL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Difficulty Sees Sharp 3.59% Drop - NewsBTC",
        "content": "The bitcoin mining difficulty had adjusted upward for the majority of 2022, recording its highest correction in the same year. However, 2023 kicked off with a downtrend as the mining difficulty has begun to drop. A sharp drop in this metric recorded in the early hours of Tuesday could be the start of a trend reversal in this regard.\n\nBitcoin Mining Difficulty Plunges\n\nThe bitcoin mining difficulty declined suddenly on Tuesday morning during Asia hours. Data from CoinWarz shows that it had fallen almost 3.6% in a sharp downward correction. This took the mining difficulty from the 35.36T that it was trending at to 34.09T following the adjustment.\n\nThe bitcoin mining difficulty is important in the fact that it actually measures how much power is needed to verify transaction blocks on the network. The higher this figure is, the more demand it shows for the bitcoin network. And the lower it becomes, it means there are fewer miners on the network.\n\nOne factor that has had a profound effect on the mining difficulty in the last month was the blizzard that blew through the United States. As temperatures dropped dangerously low in some places, miners had to disconnect their machines to free up the energy grid. This was in a bid to leave enough energy for citizens to power their homes.\n\nBTC price at $16,700 | Source: BTCUSD on TradingView.com\n\nImpact Of This On BTC\n\nThe bitcoin price is still stalling despite the sharp downward correction in the mining difficulty. The digital asset is still trending in the mid-$16,000s and has refused to budge. Even the return of some momentum with the new year has not been enough to trigger a movement beyond this point.\n\nSo when looking at the broader picture with the difficulty adjustment and price, it does not look like there would be any profound effect on price. Also, miners are still seeing similar profitability in their mining operations, so there is no tipping of the scale toward sell-offs or holding.\n\nAs long as the price continues to hold up above the $16,600 level, there should be no downtrend in price. Although if it does break below this support, then $16,000 is more likely than $17,000 in the short term. Also, add in the fact that there are multiple events such as the DCG and Gemini debacle unfolding over the next month, and it becomes imperative for the cryptocurrency to hold support.\n\nBitcoin was changing hands at a price of $16,700 at the time of this writing. It remains the largest cryptocurrency in the sector with a market cap of $322 billion.\n\nFeatured image from CoinDesk, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS9pbnZlc3RpbmcvY3J5cHRvL2J1eS1iaXRjb2luLWNhc2gv0gFFaHR0cHM6Ly93d3cuZ29iYW5raW5ncmF0ZXMuY29tL2ludmVzdGluZy9jcnlwdG8vYnV5LWJpdGNvaW4tY2FzaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "How To Buy Bitcoin Cash: A Complete Guide - GOBankingRates",
        "content": "Alihan Usullu / iStock.com\n\nMost people are familiar with bitcoin, but fewer people have heard of bitcoin cash, which was created as an alternative to bitcoin.\n\nWhile it may share part of the same name as bitcoin, these two crypto assets are very different. Bitcoin cash operates on a separate blockchain and aims to be a faster and more efficient digital cash system than bitcoin.\n\nWhat Is Bitcoin Cash?\n\nIn 2017, some of the original bitcoin developers believed that the Bitcoin blockchain was too slow and inefficient. They wanted to build a more scalable alternative.\n\nAs a result, they modified the code and the original Bitcoin blockchain was split into two separate blockchains — Bitcoin and Bitcoin Cash. This event is referred to as a “hard fork” and resulted in the creation of a new cryptocurrency, bitcoin cash (BCH).\n\nBCH operates on a decentralized network and can be used to make peer-to-peer transactions without the need for intermediaries like banks.\n\nAccording to its developers, the Bitcoin Cash blockchain offers several benefits to users, including:\n\nUltra-low fees : The network fee for a typical BCH transaction is less than $0.01.\n\n: The network fee for a typical BCH transaction is less than $0.01. Speed and reliability : BCH transactions are smooth and take just seconds.\n\n: BCH transactions are smooth and take just seconds. Security : BCH operates on a proof-of-work blockchain, which is considered one of the safest blockchain protocols in the world.\n\n: BCH operates on a proof-of-work blockchain, which is considered one of the safest blockchain protocols in the world. Fixed supply : BCH has a cap of 21 million tokens, which ensures that the supply is limited and therefore more resistant to inflation.\n\n: BCH has a cap of 21 million tokens, which ensures that the supply is limited and therefore more resistant to inflation. Privacy: Using BCH can offer more privacy than traditional banking methods, as blockchain transfers are conducted anonymously.\n\nInvesting for Everyone\n\nHow Can I Buy Bitcoin Cash?\n\nLike other cryptocurrencies, there are multiple ways to buy bitcoin cash such as using cryptocurrency exchanges, peer-to-peer networks or crypto ATMs.\n\nCryptocurrency Exchanges\n\nA cryptocurrency exchange is an online platform where users can buy, sell and trade cryptocurrencies like bitcoin cash. These exchanges act as intermediaries between buyers and sellers, and they make money by charging fees on transactions.\n\nA good crypto exchange has a good reputation, high security, features an intuitive user interface, offers low fees and has high liquidity for your preferred crypto assets.\n\nFor example, Coinbase is a popular cryptocurrency exchange that supports bitcoin cash. You can buy, sell and store bitcoin cash on Coinbase, along with many other cryptocurrencies. Other reputable cryptocurrency exchanges include Binance, Kraken and OKX.\n\nTo buy bitcoin cash on a crypto exchange, you’ll have to create an account, verify your identity and deposit funds. Once you have funds in your account, you can place an order to buy BCH.\n\nP2P Networks\n\nIt’s also possible to buy cryptocurrency directly from other people on peer-to-peer exchanges. Some benefits of P2P networks include multiple payment options, no trading fees and greater flexibility in terms of legal restrictions.\n\nHowever, P2P trading can also be risky. There are plenty of scammers on these networks who take advantage of the lack of a central authority to govern transactions. In addition, there is often lower liquidity on P2P marketplaces so trades may take longer to complete.\n\nInvesting for Everyone\n\nCrypto ATMs\n\nCrypto ATMs are convenient options if you happen to have one in your area. They allow you to purchase bitcoin cash and other cryptocurrencies with cash, debit cards or credit cards.\n\nOne benefit to crypto ATMs is that they offer a high degree of anonymity, especially for users who buy with cash. However, they typically have much higher fees than online exchanges. In addition, they may not offer access to as many cryptocurrencies as online exchanges.\n\nIs Bitcoin Cash Safe To Buy?\n\nAs with any investment, buying bitcoin cash involves risk. As shown by BCH’s price history, it’s a highly volatile asset that has experienced many sudden increases and decreases in price. BCH’s value may follow events in the cryptocurrency market and the economy as a whole or be directly related to its own development as a digital asset.\n\nBefore deciding whether to buy bitcoin cash, it’s essential that you do your research and fully understand the potential risks.\n\nIf you’re comfortable with the risks involved and have done your due diligence, there are steps to ensure the safety of your investment. For example, purchasing bitcoin cash on a reputable cryptocurrency exchange or P2P network with strong security measures in place helps mitigate the risk of fraud or hacking.\n\nIt’s also important to store your bitcoin cash in a secure wallet, such as a custodial wallet offered by a reliable crypto exchange or an offline hardware wallet. Research different options to protect yourself against potential theft.\n\nIs It Better To Buy Bitcoin or Bitcoin Cash?\n\nWhen it comes to deciding whether to buy bitcoin or bitcoin cash, there’s no right answer as it ultimately will depend on your investment strategy and financial goals.\n\nInvesting for Everyone\n\nBoth bitcoin and BCH have advantages and disadvantages, so you should do your research and consider factors such as transaction speed, fees and overall market performance before making a decision.\n\nOn one hand, bitcoin is the more widely recognized cryptocurrency and has a much larger market capitalization and mainstream adoption than bitcoin cash. With a current market cap of over $400 billion, it’s the world’s most valuable cryptocurrency and may have greater potential for preserving its long-term value.\n\nOn the other hand, bitcoin cash has some technical advantages over bitcoin, such as faster transaction times and lower fees. So if your goal is to use cryptocurrency as a secure digital payment method rather than a long-term investment, bitcoin cash may be a better option.\n\nKey Takeaways\n\nBitcoin cash is an established cryptocurrency that shares many of the same characteristics as bitcoin, with some notable improvements to its technical capabilities. If you’re interested in buying bitcoin cash for the first time, make sure you know how to securely conduct transactions and store your crypto assets.\n\nBy taking these precautions and staying informed about the cryptocurrency market, you can make an informed decision about whether buying bitcoin cash is a safe investment for you.\n\nInformation is accurate as of March 7, 2023."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V4cGxvcmluZy10aGUtcmVsYXRpb25zaGlwLWJldHdlZW4tbmZ0cy1hbmQtYml0Y29pbi12YWx1YXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Exploring the Relationship Between NFTs and Bitcoin Valuation - Analytics Insight",
        "content": "The relationship between NFTs and Bitcoin is explained in detail. Bitcoin NFTs future depends on how the NFT market as a whole.\n\nThe growth of an NFT-like initiative on the Bitcoin blockchain during the past month suggests that the largest cryptocurrency may be about to enter a new phase. However, according to analysts, it needs to increase its accessibility and security to be the biggest. More than 260,000 of them have been developed so far. The latest non-fungible tokens (NFTs) from Bitcoin, known as Ordinals, continue to stir up a lot of excitement, hype, and speculative activity. How much of an effect will they have on the price of Bitcoin though? Let see explore the relationship between NFT and Bitcoin\n\nAccording to one viewpoint, Ordinals might be the key to revealing hidden Bitcoin valuation. Nevertheless, from another viewpoint, Ordinals might significantly detract from Bitcoin’s primary goal of developing into a new type of digital currency. In the worst case, Ordinals might deter institutional investors from investing in Bitcoin and entice unwanted regulatory inspection. In other words, there could be money to be earned here, which will encourage more businesspeople and inventors to grow the market for Bitcoin NFTs. Some estimates place the current year value of the NFT market at close to $20 billion, with Ethereum now accounting for the lion’s share of that sum.\n\nIn comparison to other markets where Bitcoin is making an impact, the NFT market’s current size is tiny. The worldwide remittances business, where Bitcoin is becoming more and more significant, is still one-sixth the size of the NFT market, even if you take the optimistic view of things and estimate the NFT sector is worth $20 billion.\n\nIt is assessed in trillions of dollars, not billions, how valuable other markets are than those where Bitcoin is gaining market share. For instance, some investors consider Bitcoin to be a type of “store of wealth.” Also, the physical gold reserves around the world are worth about $12 trillion.\n\nHow would NFT and Crypto Integrate?\n\nThe planned Web3 would include both NFTs and cryptocurrencies, which are important components of the metaverse. Users cannot trade one NFT for another, unlike bitcoin. However, consumers who interact with one might also utilize the other.\n\nA user needs a cryptocurrency wallet that is typically used for cryptocurrencies to buy non-fungible tokens. Platforms also save NFT keys here as evidence that they are the rightful proprietors of an NFT collection. Users keep their cryptocurrency wallets secure and secret, just like an offline wallet. Even though many NFTs can only be bought using cryptocurrencies, there are frequently possibilities for people who want to use their local money and credit cards.\n\nThe Risk Associated Association of NFT and Crypto\n\nWorking with NFTs and cryptocurrencies carries some risks, much like trading stocks or making investments.\n\nDue to various sponsorships, influencers may recommend non-fungible tokens, alternative coins, or other cryptocurrencies to their followers. As a result, young people may lose their own money if they don’t understand the source of the influencer’s income.\n\nIndividuals might encounter information from influencers pushing cryptocurrency or selling NFTs on social media that highlights the potential for investments to rise, but they might not comprehend the reasons for this. For instance, the influencer can be promoting a course which is how they primarily generate income. Or perhaps they have a sponsorship and a platform to advertise. In that regard, they don’t profit significantly from NFTs or cryptocurrencies.\n\nHigh-risk investments include NFTs and, particularly, cryptocurrencies. The purchase and sell rates change often, just like the stock market. This implies that a young person who invests a lot of money in cryptocurrency risks losing all or the majority of it.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tcHJpY2UtdG9kYXktdXNkLTIyNDU2LWV0aGVyLXZhbHVlLWxvc3Nlcy1zdGFibGVjb2lucy1yZWNvcmQtZ2FpbnMtY3J5cHRvY3VycmVuY3ktMzg0MDc1NNIBkwFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tcHJpY2UtdG9kYXktdXNkLTIyNDU2LWV0aGVyLXZhbHVlLWxvc3Nlcy1zdGFibGVjb2lucy1yZWNvcmQtZ2FpbnMtY3J5cHRvY3VycmVuY3ktMzg0MDc1NC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether Record Marginal Profits as Stablecoins See Small Gains Amid Market Uncertainty - Gadgets 360",
        "content": "Bitcoin on Tuesday opened with a minor profit of 0.35 percent on national as well as international exchanges. The oldest cryptocurrency is trading at the price point of $22,456 (roughly Rs. 18.3 lakh). In the last 24 hours, the value of BTC spiked by a small amount — $81 (roughly Rs. 6,625). The asset was trading close to $25,000 (roughly Rs. 20 lakh) up until February, has dropped down to a two-week low since the beginning of March. The crypto price chart has been reflecting at the market volatility ever since the crypto-friendly bank Silvergate reported financial instability issues earlier this month.\n\nEther conventionally followed Bitcoin and managed to mint small profits. The value of ETH, at the time of writing, stood at $1,574 (roughly Rs. 1.28 lakh) with a minor gain of 0.82 percent as per Gadgets 360's crypto price tracker.\n\nStablecoins pegged against the US dollar managed to retain greens against the market turbulence. These include Tether, USD Coin, and Binance USD.\n\nPolygon, Avalanche, Uniswap, Leo, and Monero emerged among profit-making cryptocurrencies.\n\nMeanwhile, EOS Coin, Decentraland, Elrond, and Aave also reeled-in profits.\n\nThe global crypto market rose by 0.75 percent to touch the valuation of $1.03 trillion (roughly Rs. 84,06,471 crore) in the last 24 hours, the data by CoinMarketCap said. On the other hand, Binance Coin, Cardano, Solana, Polkadot, and Litecoin settled with losses.\n\nBoth memecoins Dogecoin and Shiba Inu also saw dips in value, alongside Tron, Chainlink, Cosmos, and Wrapped Bitcoin.\n\nIn the days to come, the ongoing volatility in the market is expected to continue to affect cryptocurrencues, especially in the backdrop of the Silvergate chaos. The crypto-friendly bank has reported a $1 billion (roughly Rs. 8,21,300 crore) loss for the fourth quarter of 2022, pushing investors to rapidly withdraw their deposits with the bank. Wayne Huang, co-founder and CEO of XREX, a global USD-crypto exchange headquartered in Taipei, said the issues highlighted how interconnected and vulnerable crypto banking had become, in the aftermath of the Silvergate crisis.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nFrom smartphones with rollable displays or liquid cooling, to compact AR glasses and handsets that can be repaired easily by their owners, we discuss the best devices we've seen at MWC 2023 on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tcHJpY2UtdG9kYXktdXNkLTIyMTU1LWV0aGVyZXVtLWxvc3Nlcy1jcnlwdG9jdXJyZW5jeS12YWx1ZXMtbWFyY2gtOC1tYXJrZXQtdHVybW9pbC0zODQzNDIy0gGVAWh0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi1wcmljZS10b2RheS11c2QtMjIxNTUtZXRoZXJldW0tbG9zc2VzLWNyeXB0b2N1cnJlbmN5LXZhbHVlcy1tYXJjaC04LW1hcmtldC10dXJtb2lsLTM4NDM0MjIvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Price Remains Above $22,000 as Ethereum, Most Altcoins Record Losses: All Details - Gadgets 360",
        "content": "The price of Bitcoin stood at $22,155 (roughly Rs. 18.2 lakh) on Wednesday on both national as well as international exchanges. The oldest cryptocurrency has been trading around $22,000 (roughly Rs. 18 lakh) for a few days. On Wednesday, Bitcoin recorded an 0.88 percent drop in its value. In terms of numbers, the price of the oldest and most widely used cryptocurrency fell by $301 (roughly Rs. 24,738) over the last 24 hours. BTC's market movement often sets the course for the performance of other cryptocurrencies.\n\nEther, for instance, joined BTC as its value fell by 0.43 percent on Wednesday. ETH is trading at $1,560 (roughly Rs. 1.28 lakh), according to Gadgets 360's crypto price tracker.\n\nA group of popular cryptocurrencies has been seeing more losses than gains in recent days. These include Cardano, Polygon, Solana, Polkadot, and Litecoin.\n\nBoth memecoins Dogecoin and Shiba Inu saw their values fall further on Wednesday, alongside Avalanche, Chainlink, and Cosmos.\n\n“Most cryptocurrencies dipped in the past 24 hours following the hawkish comments of Fed Chair Jerome Powell on the interest rate hikes. Neither BTC nor ETH is ready to make a sharp move. Traders and investors might take some time to understand and digest the hawkish comments and uncertainties associated with Silvergate Bank,” Edul Patel, the CEO and Co-Founder of crypto investment form Mudrex told Gadgets 360.\n\nThe overall crypto market valuation dropped by 1.20 percent in the last 24 hours to $1.02 trillion (roughly Rs. 83,42,190 crore), data from CoinMarketCap showed.\n\nOnly a small number of cryptocurrencies managed to reel in gains on Wednesday. These include stablecoins such as Tether, USD Coin, Ripple, and Binance USD.\n\nUniswap, Leo, Monero, Dash, Qtum — these cryptocurrencies also settled with gains.\n\nDespite the ongoing market slump, industry experts believe that better days are not too far for cryptocurrencies, currently dealing in losses. “Binance USD's Market Cap fell below $10 billion (roughly Rs. 82,133 crore) after Coinbase delisted it. Crypto investors have redeemed some $7 billion (roughly Rs. 57,493 crore) of tokens from issuer Paxos since regulators ramped up pressure on the stablecoin. Meanwhile, industry giant ConsenSys announced that it is rolling out a zero-knowledge Ethereum Virtual Machine (zkEVM) public testnet on March 28, intensifying the race among top crypto firms to go fully live with the fast-emerging technology. Polygon is also planning a launch in March,” Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch told Gadgets 360.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nFrom smartphones with rollable displays or liquid cooling, to compact AR glasses and handsets that can be repaired easily by their owners, we discuss the best devices we've seen at MWC 2023 on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RpZmZlcmVuY2UtYmV0d2Vlbi1ibG9ja2NoYWluLWFuZC1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Difference between Blockchain and Bitcoin - Analytics Insight",
        "content": "Plenty of people think that Blockchain and Bitcoin are the same things as they are closely related.\n\nDid you even know that Bitcoin and blockchain are two different concepts? You’re not alone if you’ve been using the phrases interchangeably; many others do the same thing, possibly as a result of the strong connection between blockchain and bitcoin.\n\nThis article is for you if you’ve ever scratched your head trying to figure out what on earth the difference between the two is:\n\nBlockchain\n\nEvery block in Blockchain includes transaction data, a timestamp, and a cryptographic hash of the block before it. In other words, bitcoin is constrained by blockchain, a distributed database technology, and any digital asset. It makes it possible for several parties to do business, exchange important data, and combine their resources in a safe yet impenetrable way. The blockchain’s data is decentralized since it is spread across several computers. Blockchains are very safe since there is no single point of attack due to their decentralized structure.\n\nBitcoin\n\nThe network of computers joined together to handle Bitcoin payment transactions between Bitcoin accounts is known as the Bitcoin Network. These computers, known as miners, are owned by individuals and businesses all around the world.\n\nBitcoin Network security is top-notch. The system has been expressly created and built to make it impossible to create counterfeit Bitcoin or fraudulent transactions, therefore “Double Spending” is not a possibility.\n\nOne of the first cryptocurrencies to leverage blockchain technology to enable peer-to-peer transactions is Bitcoin. Bitcoin provides a comparably cheap transaction charge compared to well-known payment gateways thanks to its decentralized network.\n\nKey Difference Between Blockchain and Bitcoin\n\nThe key differences between a Bitcoin and a Blockchain are studied and summarised below:\n\nThe main difference between Bitcoin and Blockchain is in how each technology is flexible or broad in application. The Blockchain’s scope is significantly wider than that of Bitcoin, which is only concerned with enabling international monetary transactions. Money, property rights, and other kinds of assets can all be transferred via it.\n\nCryptocurrency is another name for digital money, like bitcoin. It was established in 2009 to circumvent governmental control of any nation’s currency and simplify online transactions for users by getting rid of third-party middlemen used for payment processing.\n\nOn the other side, Blockchain technology is used to maintain the transaction record for Bitcoin. Via a peer-to-peer network, this method transmits and stores Bitcoin transaction data using a distributed ledger. The information in the ledger is open to everybody.\n\nBitcoin is a type of digital currency or crypto-currency used to send money across international borders. By eliminating intermediaries and the role of the governments of the sending and receiving nations in managing currencies, it offers the benefit of simplifying transactions. The technology behind bitcoins is called a blockchain. The ledger that records each Bitcoin transaction is kept up to date using Blockchain technology. Yet, nothing saved in the Blockchain can be changed or modified in the future by either a person or a piece of technology. Blockchain is one of the most open, usable, and secure technologies as a result.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbnMtaGlzdG9yaWNhbC1wYXR0ZXJuLWluZGljYXRlcy1ub3ctaXMtdGhlLXRpbWUtdG8tYnV5LWJ0Yy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin's historical pattern indicates now is the time to buy BTC - Finbold - Finance in Bold",
        "content": "The cryptocurrency market is still in the grips of bearish headwinds that have seen it struggle to retain the $1 trillion threshold, and its representative digital asset, Bitcoin (BTC), is no exception. However, its historical movements have suggested this could be an opportunity to buy BTC before the price increases.\n\nTaking into consideration the previous significant ups and downs for Bitcoin, as well as the activities in between, the flagship digital asset has been demonstrating a steady pattern of ideal times for decision-making in crypto trading strategies – buy, hodl, and sell – as observed by the pseudonymous crypto analyst Stockmoney Lizards on March 7.\n\nIn line with these observations, the current bearish moment seems to be a good time to buy Bitcoin before its price begins another bullish movement upwards, at which point the better strategy would be to hodl and then sell when the price peaks, as indicated on the chart which ranges back to 2013.\n\nBitcoin historical patterns. Source: Stockmoney Lizards\n\nBitcoin price analysis\n\nAs noted by crypto expert Ali Martinez, Bitcoin’s current price was below a critical area of support between $23,050 and $23,730, where 1.63 million addresses purchased more than 910,000 BTC. According to him, if Bitcoin failed to regain this zone as support, it could trigger a sell-off that could push BTC down to $20,700 or even as low as $19,300.\n\nBitcoin in/out of money around price. Source: Ali Martinez\n\nAt press time, Bitcoin was changing hands at $22,406, representing a marginal decline of 0.05% over the last 24 hours, in addition to the flagship decentralized finance (DeFi) asset losing 4.73% across the week and 4% over the previous 30 days, as the charts indicate.\n\nBitcoin 7-day price chart. Source: Finbold\n\nThat said, Bitcoin’s further movements will depend on a range of factors, including directly related events such as the announced release of a Bitcoin debit card by Mastercard (NYSE: MA) and crypto exchange Bybit, as well as the sentiment in the wider crypto and macroeconomic landscape, which continues to await for the next major development that will influence the market’s direction.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDMvMDcvdmFsdWUtdHJlbmQtYml0Y29pbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Mar 2023 08:00:00 GMT",
        "title": "The value trend of Bitcoin and Ethereum - The Cryptonomist",
        "content": "For some time now, the value trend of Bitcoin (BTC) and Ethereum (ETH) has been very similar.\n\nFocus on the value trend of Bitcoin and Ethereum\n\nSince November last year, the two trends have been proceeding almost in unison.\n\nAnalysis of Bitcoin (BTC)\n\nThe market value trend of Bitcoin (BTC) in recent days is rather flat and monotonous.\n\nIn fact, it has been doing nothing but lateralizing within a very compressed range between $22,200 and $22,500 now since Friday 3 March, with only a few brief excursions just above or just below.\n\nIt is as if after the sudden drop from $23,400 to $22,400 last Friday the price has stabilized.\n\nIn fact, that drop was only the latest in a series that began on 21 February, after failing for the fourth time to break the $25,000 mark.\n\nSomething similar had already happened in early February to Bitcoin, after it failed its fourth attempt to break above $24,000 on Thursday 2 March.\n\nThen between late January and early February it tried four times to move steadily above $24,000 without succeeding, at which point it began to fall, stopping eight days later around $21,600.\n\nThereafter, it later lateralized around that figure for four days, only to suddenly break down that wall and head straight for $25,000 on 15 February.\n\nAt that point, it seems to have begun a phase similar to the one that just ended, but at levels $1,000 higher.\n\nIn fact, it tried four times to break above $25,000, only to start falling on 21 February.\n\nThe descent lasted ten days, instead of the eight days of the previous medium-short-term cycle, and it has now been sideways in the very narrow range of $22,200 to $22,500 for four days.\n\nShould it manage to return above $24,000 within a couple of days, or even break through the $25,000 wall, the medium-short-term cycle would have replicated itself in almost the same way.\n\nIt is worth noting that $25,000 seems a much more difficult resistance to break through than $24,000.\n\nAnalysis of Ethereum (ETH)\n\nThe trend in the market value of Ethereum (ETH) has been very similar, although at different levels.\n\nIt was again on Friday 3 March that the price of ETH fell to $1,560, and since then it has continued to lateralize within a very compressed range between $1,560 and $1,580.\n\nThis trend seems identical to that of Bitcoin’s price.\n\nPreviously, while Bitcoin tried unsuccessfully four times to move steadily above $25,000, Ethereum tried unsuccessfully to move above $1,700, although for three days, from 17 to 19 February included, it seemed to have succeeded.\n\nThe decline began on 21 February, at the same time as Bitcoin’s.\n\nIn contrast, between late January and early February, when Bitcoin was trying four times to exceed $24,000, Ethereum’s price had remained almost consistently above $1,600.\n\nFrom this difference it seems to emerge that at this stage Ethereum’s price trend is influenced by Bitcoin’s, and not vice versa.\n\nIt is worth noting that another difference concerns percentage movements.\n\nFor example, after the four failed attempts to get back above $24,000, BTC then lost 11% in eight days, while ETH lost 13% in five days.\n\nAnd after the failure of the fourth attempt to get above $25,000, BTC lost 11% again, while ETH lost 9%, this time both in ten days.\n\nThe comparison between Bitcoin and Ethereum: value trend, regulation and market\n\nThus what seems to be dragging the trend of Ethereum’s market value during this period is the trend of Bitcoin’s market value, with small differences that make it clear how the two trends actually move independently, but with the latter heavily influencing the former.\n\nExtending the comparison to the whole of 2023 shows that Bitcoin since late 2022 has gained 34%, while ETH has gained 30%. And extending it to November 2021, when all-time highs were touched, BTC loses 67% while ETH 68%.\n\nThus, there are more differences in this early 2023 in favor of Bitcoin than there have been since the highs were touched.\n\nSpecifically, in the past 30 days, Bitcoin’s price has lost 3.5% while Ethereum’s has lost 5%.\n\nIt is possible that this difference is affected by the words of SEC Chairman Gary Gensler recently, whereby he suggests that only Bitcoin is a commodity, while Ethereum, like other cryptocurrencies, should actually be considered securities."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vY2FwdGFpbmFsdGNvaW4uY29tL2Jlc3QtdGltZS1vZi1kYXktdG8tYnV5LWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Is There a Best Time Of Day (or Week) To Buy Cryptocurrency? - Captain Altcoin",
        "content": "Home » Bitcoin Best time of day to buy bitcoin? Is That Even A Thing? BitcoinJournal Best time of day to buy bitcoin? Is That Even A Thing? Felix Küster\n\nSomeone told you there is one specific time of day when you should buy bitcoin, and it triggered your interest, but you are not sure if that is even a thing? Read on, and we will explain what the theory behind such claims is.\n\nBitcoin and any cryptocurrency, in general, are known to be very volatile. That has its pros and cons. It has seen some people become millionaires while others burn down to the ground. You may be wondering: What’s the secret? Well, it’s not a secret anymore. The trick is to know the right time to buy Bitcoin.\n\nBest Day To Buy Crypto – TL;DR Buying Bitcoin on Sundays and Mondays could be advantageous as the crypto price of Bitcoin is usually at its lowest on those days due to lower trading volumes over the weekend.\n\nResearch suggests that Bitcoin is most volatile at around 1 am UTC, likely because Western and Asian traders are actively trading simultaneously at that time.\n\nThe best time to buy crypto is when the buyer is feeling confident in their strategy and financially ready to make a move, according to experts.\n\nCryptocurrencies are most active during the workweek, with prices starting low on Monday morning and steadily rising until they drop over the weekend.\n\nPaying attention to stock market trading hours can also have an effect on cryptocurrency trading, even though you can buy and sell cryptocurrencies 24/7.\n\nIt is important to be aware of your risk tolerance by forecasting your cash flow and watching cryptocurrency market trends before making a purchase.\n\nUsing dollar-cost averaging, or buying a little bit at a time over an extended period, is a useful strategy to control the volatility of your investment.\n\nMultiple analysts have suggested that Monday is the best day to buy cryptocurrencies, as Bitcoin’s price is consistently lower on Sundays and Mondays based on daily averages over week-long periods.\n\nTiming a cryptocurrency buy is never cut and dried as the market is traded 24 hours a day by investors around the world, so using dollar-cost averaging can help to even out any volatility.\n\nLet’s face it; most people do not have all the knowledge required to deal with Bitcoin. Many Bitcoin active traders are self-taught, and this eventually works as long as the need is met. Several economists have researched the best time to buy Bitcoin is providing their observations based on several factors and analyses.\n\nFirst, they took note that the factors determining price swings in cryptocurrency are very different from those that affect traditional assets. Bitcoin prices rise rapidly and fall just as fast. It is therefore advisable to only invest in Bitcoin when its value increases by 20% in the previous week.\n\nBefore we tackle the best time of the day, let’s begin by, first of all, deciphering what day is best if one is planning on buying Bitcoin.\n\nThe best day of the week to buy Bitcoin\n\nIt is crucial to take into account that, unlike traditional stock markets, the cryptocurrency market is open 24/7. You can buy Bitcoin at any time of the day from anywhere as long as you have an internet connection.\n\nAccording to an analysis carried out, the best days to buy Bitcoin are Sundays and Mondays, for the sole reason that on these days, the crypto price of Bitcoin is at its lowest.\n\nThe reason to explain why Sunday evenings are the best time to buy BTC is that trading volumes on every crypto exchange usually drop during the weekend. US derivatives giant CME Group, which also contributes significantly to bitcoin’s global volume (over $500 million daily) traded by institutional investors, go on a break during the weekend.\n\nTheories behind the specific days\n\nMultiple theories explain how to determine the best timing to buy Bitcoin. We are going to look into three.\n\nThe first theory suggests that the demand for Bitcoin slows down during the weekends pushing its price to lower on Monday and higher on Fridays .\n\nsuggests that the demand for slows down during the weekends pushing . A second theory suggests that most people tend to buy Bitcoin during the weekends and begin trading during the week, meaning that the trading volume is high on Mondays .\n\nsuggests that most people tend to buy during the weekends and . A third theory suggests that it is best to avoid buying Bitcoin during periods when 9-5 workers get paid. The more the money, the more the demand for Bitcoin.\n\nBest time of day to buy Bitcoin\n\nWe have narrowed it down to the best days to buy Bitcoin and even further looked into several theories that can help you better ascertain your decision. Now let’s take a deep dive and take a look at the best time of the day to buy Bitcoin.\n\nTake note of the fact that the BTC is highly volatile, and its price changes within a short period. Searching for the best time to buy Bitcoin, however, depicts a focus on the short-term focus on the price of the Bitcoin, which is not advised.\n\nThe best thing you can do is to adopt the following practices that are sure to keep the risk of losing all your money at bay.\n\n✅ Educate yourself\n\nDo not begin trading in cryptocurrency if you do not know anything about it. Cryptocurrency is not a platform to chase quick profits. There are numerous risks involved with it.\n\nGet on the internet and research. You can get material from the Nakamoto institute and even get a lot of information on Youtube. It may be time-consuming, but that is the right way to go about it\n\n✅ Don’t panic sell\n\nI know what you’re thinking. What if the Bitcoin market price is high? Isn’t it advisable to sell and gain profit? Yes, it is good to do so if you plan to sell when BTC reaches a certain price height. However, if you got into panic mode by reading or listening to stuff online and think you need to sell before it all crashes – then, NO – don’t do that.\n\nTake note of the fact that holding Bitcoin long-term is the best strategy. Bitcoin is in the process of slowly monetizing. Wouldn’t it be useless to sell and accumulate fiat money which would eventually prove to be worthless?\n\n✅ Buy on the dip\n\nCryptocurrency being highly volatile, it comes without question that at some point, the market price of Bitcoin will fall. The best time to invest in Bitcoin is at this time. If you are new to cryptocurrency, this may sound counterintuitive to you. However, take note of the fact that Bitcoin is very volatile. Prices could go down right now and appreciate within the next hour.\n\n✅ Understand current markets and trends\n\nIt is advised to make sure that you know how to study market trends and decide the best time to invest in cryptocurrency. You should be able to make decisions based on market trends and not based on what every trader is doing.\n\nRead also:\n\nHow to keep track of Bitcoin prices\n\nHaving concluded that there is not exactly the best time to buy cryptocurrency due to its volatility, let us look into a concept that will prove to be even more useful.\n\nKeeping track of Bitcoin prices will notify you when its price has gone down for you to buy it is essential. You can keep track of Bitcoin prices using several apps, including Binance, TradingView, Plus500, Coinbase, Delta App, and Blockfolio, to name a few.\n\nYou can set alerts on whichever application you get so you will be notified when the Bitcoin either goes up or down.\n\nAt what time of the day is Bitcoin most volatile?\n\nWe have concluded that due to volatility, it gets challenging to decide on the best time of the day to buy Bitcoin.\n\nHowever, knowing the hour of the day when Bitcoin is most volatile can prove to be very vital. Research and analysis of the crypto market trends have shown that Bitcoin is most volatile at around 1 am UTC. That could be because this hour is the beginning of the evening in North America. In contrast, it is the beginning of the workday in Asia. At this time of the day, Western traders and Asian traders are most likely to be actively trading simultaneously.\n\nSo, the best time of day to buy cryptocurrency is around 1 AM UTC.\n\nBybit – best place to buy crypto Visit Now Anonymous trading: Bybit is a fully anonymous exchange, with no KYC verification required.\n\nImpressive trading tools: Bybit offers top-notch security, no downtime commitment, and charting tools with advanced functionality and extra features.\n\nHigh leverage: Bybit offers high leverage of up to 100x on Bitcoin and up to 50x on other currencies.\n\nPerpetual swaps: Bybit specializes in perpetual swaps, a unique form of futures contract called an “inverse futures contract.”\n\nIn conclusion – Best day of the week to buy crypto\n\nIs there a thing as the best time of day to buy cryptocurrency? From all the theories, research and analysis, it is clear that there is no such thing as a perfect market when it comes to cryptocurrency. Unlike other traditional assets, cryptocurrency is very volatile. You could make some quick only today and lose it all tomorrow. That is not a matter of sheer luck. It’s about doing as much research as possible and making sure that as a crypto investor you are investing what you can afford to lose."
    }
]