[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LnNhdmV0aGVjaGlsZHJlbi5vcmcvdXMvd2F5cy10by1oZWxwL3dheXMtdG8tZ2l2ZS93YXlzLXRvLWhlbHAvY3J5cHRvY3VycmVuY3ktZG9uYXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Donate Bitcoin and other Cryptocurrencies - Save the Children",
        "content": "Charity donations: How much cryptocurrency have we raised so far?\n\nHelp us reach our donation goal this holiday season and join our donation leaderboard for Save the Children's HODL Hope Campaign.\n\nSave the Children’s crypto philanthropy journey\n\nSave the Children was the first iNGO (international Non-Governmental Organization) to accept a bitcoin donation in 2013 in response to Typhoon Haiyan which struck Southeast Asia and devastated the Philippines.\n\nAround the world children are being robbed of their futures by a global economy built on inequality and greed. With your continued support, Save the Children believes that blockchain technology and cryptocurrencies can be a force for good and a force for financial inclusion.\n\n\n\nWhich cryptocurrencies do Save the Children accept?\n\nSave the Children’s crypto fundraising is powered by The Giving Block and our crypto wallet custodian, Gemini*. We can accept any cryptocurrency currently available on the Gemini Exchange.\n\nWe accept multiple cryptocurrencies, including but not limited to: Bitcoin (BTC), Ethereum (ETH) and USDC. For the latest list of cryptocurrencies, we accept*, please visit our crypto donation page.\n\n*Gemini regularly adds new cryptocurrencies to their platform for trading.\n\nYour crypto donation could be matched!\n\nThere are various automatic crypto matches running for donations to Save the Children. Please visit The Giving Block for the latest information. Please note that Save the Children receives matches only for donations made directly to us.\n\nDonating a cryptocurrency that is not available on our wallet?\n\nYou can also donate Cardano (ADA), Algorand (ALGO), Cosmos (ATOMA), Polkadot (DOT), Flow (FLOW), Solana (SOL), Tether (USDT), and or Stella (XLM) to Save the Children.\n\nDonating NFTs?\n\nWe accept the proceeds from an NFT sale once converted to a cryptocurrency such as ETH.\n\nFor an NFT or other smart contract, you can dynamically generate a unique, static, reusable wallet address for Save the Children with these simple steps:\n\nStep 1: Input a comment in the “Donation notes” field (optional)\n\nStep 2: Select the crypto type\n\nStep 3: Click the CONTINUE button\n\nStep 4: Add your email and/or contact information (optional if you would like an email confirmation)\n\nStep 5: Click the CONTINUE button\n\nStep 6: Copy and paste the dynamic address or QR code that is generated.\n\nWhat is #CryptoGivingTuesday?\n\n#CryptoGivingTuesday is the unofficial start of #BagSeason, the holiday giving season for the crypto community. It takes place annually on the Tuesday after the Thanksgiving holiday.\n\nWhat is #NFTuesday?\n\n#NFTuesday brings together NFT marketplaces, artists, galleries and projects to bring visibility and raise funds for important causes.\n\nIs my cryptocurrency charitable donation tax deductible?\n\nYes, your cryptocurrency donation is tax deductible*. Save the Children offers supporters who want to donate cryptocurrency to charity the ability to donate in a tax-efficient way. The IRS classifies cryptocurrency donations as property, meaning they are not subject to capital gains tax and are tax-deductible. Your contribution is tax-deductible to the fullest extent permitted by law.\n\nFor example, for donors in the United States, the IRS has classified bitcoin as property for tax purposes. This means that when someone donates bitcoin and other cryptocurrencies to a 501(c)(3) nonprofit such as Save the Children, donors do not have to pay capital gains tax and it is tax-deductible if you provide your email address.\n\n*Subject to change. Please consult your tax advisor.\n\nCan I donate anonymously?\n\nYes, you can donate anonymously. However, you will not receive a tax receipt unless you provide your email address."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzE3L3NlYy1kZWxheXMtZGVjaXNpb24tb24tZ2xvYmFsLXgtc3BvdC1iaXRjb2luLWV0Zi_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8xNy9zZWMtZGVsYXlzLWRlY2lzaW9uLW9uLWdsb2JhbC14LXNwb3QtYml0Y29pbi1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "SEC Delays Decisions on Franklin Templeton and Global X Spot Bitcoin ETFs - CoinDesk",
        "content": "Few had expected any spot bitcoin ETF approvals this week, so the SEC's action comes as little surprise. Bitcoin (BTC) is trading at $36,450, up modestly for the day."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9pbnZlc3RpbmcvbmV3cy9iaXRjb2luLWRlcml2YXRpdmVzLW1hcmtldC1ldm9rZXMtbWVtb3JpZXMtb2YtMjAyMS1zdXJnZS0yNDU4NTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin derivatives market evokes memories of 2021 surge - InvestmentNews",
        "content": "A burst of activity in Bitcoin derivatives has evoked memories of the period in late 2021 when the token surged to an all-time high.\n\nVariables such as the cost of perpetual futures trades and options open interest point to a revival in speculative gusto for Bitcoin, which has more than doubled in price this year in a partial rebound from a 2022 rout.\n\nThe increased attention stems partly from expectations that the first US spot Bitcoin exchange-traded funds may soon get regulatory assent, opening up the asset to more investors. The likely level of ETF inflows is an open question but the possibility of greater demand is enough to spur chancy trades.\n\nA spokesperson for Deribit, the largest crypto options exchange, said the notional value of Bitcoin options open interest on the platform reached a record of roughly $14.9 billion earlier this week. That topped the $14.4 billion achieved in October 2021 just before Bitcoin hit its high of almost $69,000. Open interest refers to outstanding contracts that have yet to be settled.\n\n“Crypto call options were in strong demand for the past few weeks,” said Caroline Mauron, co-founder of digital-asset derivatives liquidity provider Orbit Markets. While some traders placed leveraged bets on a “large breakout” to $100,000 or beyond, the more immediate test is the $38,000 level, she said.\n\nBitcoin neared $38,000 on Thursday before falling back and was trading at $36,264 as of 3:33 p.m. in Singapore on Friday. Three charts below highlight key trends from the futures and options market for the largest digital token.\n\nFOREVER FUTURES\n\nPerpetual futures are among the most popular Bitcoin derivatives as they have no set expiry date. Exchanges use the so-called funding rate to align the contracts to the underlying spot price. In bullish periods the rate tends to be positive, indicating traders betting on gains are prepared to pay funds to speculators who are short, as a cost of maintaining their positions.\n\nThe rolling, seven-day average funding rate for Bitcoin perpetual futures through Nov. 15 was around levels last seen in the final quarter of 2021, a period when Bitcoin was rallying toward its zenith, according to CryptoQuant data spanning a range of digital-asset exchanges.\n\nCURVE SHIFT\n\nTraders analyze Bitcoin futures curves for clues about the price outlook. The entire curve based on CME Group Inc. contracts has shifted upward compared with the pattern seen a month ago. Whereas the curve back than sloped up to almost $32,000 for the farthest contract, it now rises to nearly $40,000.\n\nThe notional value of Bitcoin futures open interest on the CME, the world’s leading derivatives exchange, recently surpassed the equivalent figure for Binance. Binance is the largest crypto exchange but faces a web of regulatory probes in key jurisdictions, including the US.\n\nCME open interest for Bitcoin futures reached $4 billion on Friday versus $3.8 billion on Binance, Coinglass figures show.\n\nThe growth in CME open interest relative to Binance “suggests a more substantial institutional participation in using futures to obtain long exposure to Bitcoin,” said Le Shi, head of trading at market making and algorithmic trading firm Auros.\n\nOPTIONS INSIGHT\n\nFigures from Deribit show a preponderance of bullish options bets on Bitcoin hitting $40,000 and even $45,000 by the end of December. Given that the traders selling the call options are willing to take the other side of the wager, that suggests $40,000 could become a key test area for Bitcoin’s rally."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRyb3BwZWQtY2xvc2UtNDAtc2luY2UtMTIwMDAwODI3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin has dropped more than 30% from when Warren Buffett described it as 'rat poison squared': Here are 3 stocks ... - Yahoo Finance",
        "content": "Bitcoin has dropped more than 30% from when Warren Buffett described it as 'rat poison squared': Here are 3 stocks he's invested in that outperformed crypto\n\nBillionaire Warren Buffett memorably described Bitcoin as “rat poison squared” during a shareholder meeting in April 2022. Bitcoin was trading near $40,000 at the time. It’s now trading at around $36,288.\n\nMeanwhile, Berkshire Hathaway’s Class A stock has outperformed the cryptocurrency and recently reached an all-time high, surpassing $560,000. Presently, the Class A stock sits above $545,000.\n\nDon't miss\n\nCommercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord\n\nRising prices are throwing off Americans' retirement plans — here's how to get your savings back on track\n\n'A natural way to diversify': Janet Yellen now says Americans should expect a decline in the USD as the world's reserve currency — 3 ways you can prepare\n\nUnsurprisingly, Buffett hasn’t changed his mind about the world’s most persistent digital obsession. “I’ve seen people do stupid things all my life,” Buffett said in an interview with CNBC earlier this year, comparing betting on Bitcoin to playing the slots in Las Vegas.\n\n“We’ve had an explosion of gambling, essentially. And I like to bet on a football game — if I’m sitting and watching, it makes it more interesting. But I don’t think I want to make a living trying to bet against the house.”\n\nInstead of crypto, Buffett has been laser-focused on his preferred asset class: equities. Here are the top three stocks he’s invested in over the past year that have outperformed Bitcoin by a wide margin.\n\nLennar Corp.\n\nBuffett seems to be focused on American homebuilders right now. He added a stake in Lennar Corporation (LEN) sometime in the second quarter of 2023, according to recent regulatory filings.\n\nThe Florida-based company is one of the largest home builders in the country. That puts it in a favorable position given the shortage of homes across America. Between 2012 and 2022, there were 6.5 million more households formed than homes constructed. If this gap continues to widen, demand for homebuilding could skyrocket.\n\nStory continues\n\nBuffett seems to be betting on this trend, adding two other homebuilders, NVR (NVR) and DR Horton (DHI), to his portfolio during the second quarter.\n\nRead more: Rich young Americans have lost confidence in the stock market — and are betting on these 3 assets instead. Get in now for strong long-term tailwinds\n\nDiageo\n\nIn the first quarter of the year, Buffett added a stake in British alcoholic beverage giant Diageo (DEO). But the Oracle of Omaha is no stranger to sin stocks, having acquired a sizable stake in Guinness, the beer brand that would eventually be combined with other brands to form Diageo, back in the 1990s.\n\nAt the time, Buffett even compared the investment to his most famous bet. “In the sense of where they earn their profits — continent-by-continent — Coca-Cola and Guinness display strong similarities,\" he wrote in a letter to investors that year.\n\nNow, Diageo is back in the Berkshire portfolio, and that’s probably a sign that the company is undervalued. The stock trades at just under 19 times earnings per share and offers a 2.57% dividend yield. Meanwhile, Bitcoin's dividend yield is 0% and has a non-existent price-to-earnings ratio.\n\nOccidental Petroleum\n\nWarren Buffett is clearly bullish on energy, at least in the medium term. That’s why he started accumulating a stake in Occidental Petroleum Corp (OXY) last year and now controls over 25% of the company’s outstanding shares.\n\nThe price of crude oil has rebounded in recent months. In fact, it hit a 10-month high recently and experts expect demand to keep a price floor on the commodity for the year ahead. That’s a major tailwind for oil producers like Occidental.\n\nBuffett’s bet on energy giants is now a key part of his portfolio. Considering how cheap these companies are (Occidental stock trades at 11 times earnings), retail investors should consider taking a closer look too.\n\nWhat to read next\n\nThis article provides information only and should not be construed as advice. It is provided without warranty of any kind."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE3L3Nob3VsZC15b3UtYnV5LWJpdGNvaW4td2hpbGUtaXRzLWJlbG93LTQwMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Should You Buy Bitcoin While It's Below $40,000? - The Motley Fool",
        "content": "Bitcoin's (BTC -3.22%) history is characterized by a boom-and-bust cycle. Investor enthusiasm and risk-seeking behavior create the necessary conditions for a raging bull market. But then, as pessimism takes hold of the market, this cryptocurrency seems to go into free fall. It seems like this situation always repeats itself.\n\nRight now, Bitcoin is 47% below its peak price, which was set about two years ago. However, it's had a wonderful run so far this year. Some investors might be considering adding this asset to their portfolios in the hopes of riding the bullish momentum.\n\nShould investors buy Bitcoin while it's still below $40,000? Here's why that looks like a smart decision.\n\nA safe-haven asset?\n\nCryptocurrencies in general are viewed as an extremely risky asset class. And it makes sense. Not only is the volatility something that most investors simply can't handle, but the opaqueness, complexity, and major failures of some high-profile industry names add to the worries. It's no wonder many choose to avoid this asset class altogether.\n\nBut this year, the price action of different assets has been very interesting and tells us an insightful story. The S&P U.S. Treasury Bond Index, which measures the performance of the Treasury bond market, is up 0.70% this year (as of Nov. 15). Treasuries are viewed as the ultimate safe haven asset, especially in times of economic or geopolitical uncertainty, both factors that seem to be at elevated levels right now.\n\nGold, another asset that market participants turn to for safety, is up just 7% this year. When inflation is still above average, coupled with everything else going on in the world like war and political turmoil, you'd expect more capital to flock to the precious metal.\n\nBitcoin's price, on the other hand, has skyrocketed 114% in 2023. Is this top cryptocurrency now becoming a safe asset in the minds of the investment community? While it's hard to point to exact reasons why an asset goes up or down, Bitcoin's price movement in recent times is certainly telling. Perhaps it's not so risky after all.\n\nUpcoming catalysts\n\nWhile Bitcoin's big-picture aspects are certainly compelling enough reasons to own it, some catalysts in the near term could continue propelling the price higher. The most important news related to Bitcoin in recent months is the potential approval of spot exchange-traded funds. Major asset managers, like BlackRock and Fidelity, among many others, have filed applications with the Securities and Exchange Commission. A hard deadline for a decision comes in January. An approval could introduce large pools of capital to Bitcoin, which could drive the price up.\n\nThen there's the upcoming halving, set to take place in April 2024. This event, which cuts the rate of Bitcoin's new supply in half, happens roughly every four years. Historically, Bitcoin's price has experienced a bullish trend in the several months leading up to a halving, as well as in the months following. Now might be one of the best times to buy this digital asset.\n\nInvestors also can't ignore the overall macroeconomic backdrop. The latest inflation data, as measured by the Consumer Price Index, showed a step in the right direction. And this could mean that the Federal Reserve pauses rate hikes, and maybe even starts to reduce rates sometime next year. This could be a boon for risky assets like Bitcoin.\n\nBuying Bitcoin below $40,000 might look like one of the smartest investing decisions in hindsight."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMTcvZWFybHktYml0Y29pbi13YWxsZXRzLWZsYXctaGFja2VyLXZ1bG5lcmFiaWxpdHktZXhwb3NlZC_SAWJodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzE3L2Vhcmx5LWJpdGNvaW4td2FsbGV0cy1mbGF3LWhhY2tlci12dWxuZXJhYmlsaXR5LWV4cG9zZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Flaw in early Bitcoin wallets shows how much crypto depends on secure code - Fortune",
        "content": "One of the best articles I read this week was a Washington Post report that revealed how some Bitcoin wallets from the pre-2016 era have a major vulnerability that could let hackers guess their private key, which is the password that controls the wallet.\n\nAs the Post explains, the problem “stems from wallet programs that created cryptographic keys that weren’t random enough. Instead of crafting electronic keys that were one in a trillion and therefore very hard for an outsider to forge, they made keys that were one in some number of thousands—a randomness factor easily hacked.”\n\nIn other words, hackers could use trial and error to guess the private key of these wallets and steal the contents. For now, the details of the vulnerability are only known by the security firm that discovered it, and they are not disclosing them for obvious reasons—but the firm made clear it’s a matter of time till bad guys find it too.\n\nWhile this sounds like a potential catastrophe, the fallout is likely to be relatively minor since the wallet flaw affects only certain pre-2016 wallets created by the firm Blockchain and a few others. Blockchain has been warning its customers so those affected have time to patch their wallet or move their Bitcoin somewhere else.\n\nThe most interesting question for me is what will become of the vulnerable wallets whose owners have long ago forgotten about them. There are likely more of these than we might imagine. I recall, for instance, a friend who briefly dated a guy who sent her a small amount of Bitcoin to try and get her interested in crypto—but who, understandably, promptly forgot about it soon after. No doubt there are many others in her situation since there are reportedly at least 4 million Bitcoins lost forever.\n\nThe irony is that the price of Bitcoin in 2015 was as low as $300 and is up 100-fold since then, which means even small amounts from that era are worth a healthy sum. The upshot is that news of the vulnerability will set off a race to recover all that forgotten Bitcoin—a race not unlike those expeditions that seek to find and recover sunken vessels that contain gold bars.\n\nUnfortunately, those likely to win that race are nasty characters like the North Korean military hackers, who already spend their time trying to steal crypto. The Post reports there have been proposals for white hat hackers to steal the Bitcoin first and figure out a way to safeguard and distribute it. Alas, for now, the plan is not going forward due to fear of legal liability.\n\nAll of this a fine reminder of just how much the integrity of crypto depends on secure code. After 15 years without a hack, the code that runs Bitcoin itself can be considered all but bulletproof but, as ever, third parties who build around it can make mistakes. This is a lesson newer blockchain projects should take to heart.\n\nFinally, speaking of hacking, FBI and Justice Department agents will be on hand at the Blockchain Association’s Policy Summit in Washington, D.C. on Nov. 29–30. My colleague Leo Schwartz will be there too along with some big names from the world of politics—you can check out the details here.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nTether is moving into Bitcoin mining with plans to spend $500 million on its own facilities and on stakes in other mining firms. (Bloomberg)\n\nThe secure email service Proton Mail is deploying blockchain technology as a means of verifying email addresses. (Fortune)\n\nAs the world moves on from Sam Bankman-Fried, The Bahamas is struggling to shake off the taint from his association. (CoinDesk)\n\nFunding levels of Bitcoin perpetual futures are at 2021 levels prior to it reaching $69,000, which points to bullish sentiment even as spot price sagged back to $36,000. (Bloomberg)\n\nNBA star Shai Gilgeous-Alexander is suing to reverse his purchase of a giant home in Toronto because it keeps being visited by menacing figures seeking the crypto crook who used to own it. (NYT)\n\nMEME O’ THE MOMENT\n\nOops. Fox uses CZ's photo in place of Citadel CEO:"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMTEvMTYvdGVjaG5vbG9neS9jcnlwdG9jdXJyZW5jeS1iaXRjb2luLWV0Zi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrency Prices Surge, Driven by a Potential Bitcoin Fund - The New York Times",
        "content": "In a Manhattan courtroom this month, the cryptocurrency industry faced a reckoning as its onetime star, Sam Bankman-Fried, was convicted of fraud in a trial that put the industry’s excesses on vivid display.\n\nBut the ever-volatile crypto markets were already moving on.\n\nShortly before Mr. Bankman-Fried’s verdict landed on Nov. 2, the price of Bitcoin surpassed $35,000, its highest level since an industry meltdown in 2022. Last week, Ether, the second-most-popular digital currency, surged 10 percent to around $2,100, its best performance in months. Some investors rushed to declare the end of the so-called crypto winter of falling prices and financial scandals that have plagued the industry for the last 18 months.\n\nDriving the renewed euphoria? A potential new fund.\n\nCrypto investors are growing optimistic that the Securities and Exchange Commission will approve an exchange-traded fund, or E.T.F., that tracks the price of Bitcoin, analysts said. The fund would trade on traditional stock exchanges and offer an easy way for people to invest in cryptocurrencies, potentially bringing a wave of money into the industry.\n\nSome proponents have hailed the possibility of this new investment vehicle, known as a spot Bitcoin E.T.F., as crypto’s “salvation.” In August, Grayscale Investments, a crypto asset manager, scored a legal victory over the S.E.C. that seemed to pave the way for it to offer the Bitcoin product. And last week, BlackRock, a giant money manager, filed paperwork to establish a similar E.T.F. to track the price of Ether."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzNDYwL2V0aGVyLXVuZGVydmFsdWVkLWJpdGNvaW4tdGFyZ2V0aW5nLTQ1MDAw0gFRaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYzNDYwL2V0aGVyLXVuZGVydmFsdWVkLWJpdGNvaW4tdGFyZ2V0aW5nLTQ1MDAw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin averts sell-off after stopgap bill avoids government shutdown, analyst says - The Block",
        "content": "Continued near-term sell-off risk was averted in the crypto market after U.S. President Joe Biden signed a stopgap spending bill to avoid a potential government shutdown yesterday, according to investment firm Matrixport's Head of Crypto Research and Strategy Markus Thielen.\n\nIf a shutdown had gone ahead, non-essential government work would have halted, including the Securities and Exchange Commission’s progress on potential bitcoin spot ETF approvals, even by January 2024, resulting in more profit-taking and bitcoin potentially dropping 10%, Thielen argued.\n\nA narrow window to approve all current bitcoin spot ETF applications at the same time ends today, Nov. 17. Once the window passes, all current filings can no longer be accepted simultaneously this year — as it's unlikely a filing would be accepted during its comment window — shifting emphasis to the next deadline on Jan. 10, K33 Research analysts said earlier this week.\n\nWith the bill approved, momentum for a potential bitcoin spot ETF approval is maintained, keeping alive Matrixport’s year-end price target of $45,000, Thielen added. This was initially set in February when bitcoin was trading at $22,500.\n\nWith the latest inflation data on Nov. 14 revealing a fall in the U.S. CPI from 3.7% to 3.2%, lower than expected, Matrixport forecasts a further decline to 1.6% in 2024. Such a drop could lead to significant interest rate cuts by the U.S. Federal Reserve (150-200 basis points), fueling a continued rally in risk-on assets like tech stocks and cryptocurrencies, Thielen said.\n\nThielen also reiterated expectations that this “fifth bitcoin bull market” would last until December 2024, roughly six months after Bitcoin BTC -2.62% ’s next expected halving event in April — when the block reward gets cut in half — with a price target of $125,000.\n\nEther, altcoins and bitcoin mining stocks could be set to outperform\n\nRELATED INDICES See crypto indices\n\nMatrixport projects Ethereum's revenues to reach $171 million this month — the highest since May — hinting at a period of potential outperformance relative to bitcoin. The boost is a positive sign not just for ether but for the broader altcoin market, with fees and revenue on the rise across various chains and bitcoin’s market dominance peaking, Thielen wrote.\n\nU.S. trading hours continue to be the most important, especially following BlackRock's Ethereum Trust registration in Delaware last week, Nasdaq’s subsequent 19b-4 filing for BlackRock's proposed iShares Ethereum Trust ETF and BlackRock’s S-1 filing for an ether spot ETF with the SEC yesterday, Thielen added.\n\nBitcoin mining stocks, including Hive Blockchain, Marathon Digital and Iris Energy, could also be set for a period of outperformance against bitcoin, according to Matrixport."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZlZXMtc2t5cm9ja2V0LWV0Zi1oeXBl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin fees skyrocket on spot BTC ETF hype - Cointelegraph",
        "content": "The prospect of a spot Bitcoin (BTC) exchange-traded fund (ETF) being approved soon in the United States has increased demand for the major cryptocurrency, leading to a surge in transaction fees.\n\nThe Bitcoin blockchain reached $11.6 million in fees paid on Nov. 16, according to statistics from CryptoFees. At the time of writing, YCharts data shows that the average transaction fee is $18.69, up 113% from the previous day and 746% from a year ago.\n\nBitcoin transaction fees between January 2023 and November 2023. Source: CryptoFees\n\nAccording to Cointelegraph’s market analysis, Bitcoin remains near 18-month highs and beyond its bear market trading range. At the time of writing, the cryptocurrency is trading at $36,407, a 0.58% gain over the past 24 hours.\n\nBitcoin’s price has been rising since Wall Street investment manager BlackRock filed for a spot BTC ETF with the Securities and Exchange Commission in June. After BlackRock's application, several other major asset managers in the United States submitted similar proposals, including Fidelity, ARK Invest, and WisdomTree, among others.\n\n#Bitcoin has officially flippened ETH in daily fees for the first time in 3 years. pic.twitter.com/2G3t6j64TP — ₿ Isaiah⚡️ (@BitcoinIsaiah) November 17, 2023\n\nWhile the SEC appears to be engaging with the firms on proposal adjustments, it has yet to make a decision, moving final deadlines to January 2024. On Nov. 16, WisdomTree amended its Form S-1 with the regulator, followed by similar amendments from ARK and 21Shares, Valkyrie, Bitwise and VanEck.\n\nAccording to Bloomberg senior ETF analyst Eric Balchunas, the amended versions may be a response to concerns the SEC has raised. “It means ARK got the SEC’s comments and has dealt with them all, and now put [the] ball back in [the] SEC’s court,” Balchunas said. “[In my opinion] good sign, solid progress.”\n\nA spot Bitcoin ETF is an investment fund that mirrors the price of Bitcoin. The “spot” aspect means the fund directs the purchase of Bitcoin as the underlying asset. It enables investors to participate in Bitcoin’s market through their regular brokerage accounts. It’s a way to get exposure to BTC price fluctuations without the need to purchase it on a crypto exchange, for example.\n\nAs a result, a spot Bitcoin ETF is expected to draw institutional investors’ capital, which may potentially result in the price of Bitcoin reaching new highs in the coming months. According to Bloomberg analysts, there is a 90% likelihood of approval of all proposals in the same batch in January.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzE3L21vcmUtYml0Y29pbi1ldGYtcmVqZWN0aW9ucy1xdWl0ZS1saWtlbHktYml0Z29zLWJlbHNoZS1zYXlzL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzE3L21vcmUtYml0Y29pbi1ldGYtcmVqZWN0aW9ucy1xdWl0ZS1saWtlbHktYml0Z29zLWJlbHNoZS1zYXlzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "More Bitcoin ETF Rejections 'Quite Likely,' BitGo's Belshe Says - CoinDesk",
        "content": "\"There are a lot of risks in that entity [Coinbase] that are not understood,\" Belshe said. \"I think that the SEC could quite likely come back and say: 'Nope, you've got to separate out those things fully before we move forward.'\""
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZXBvcnQtc2NhbW1lZC1iaXRjb2luLWV4cGFuZHMtc2VydmljZXMtMTEzNDQzNjA0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Report Scammed Bitcoin Expands Services to Aid Crypto Trading Victims in Recovering Lost Assets - Yahoo Finance",
        "content": "New York, NY, United States --News Direct-- King Newswire\n\nReport Scammed Bitcoin, a crypto recovery services provider, has announced the extension of its services by assisting individuals who have fallen victim to unethical practices in crypto trading. Report Scammed Bitcoin (RSB) has offered costless consultations, guidance, and support and connects affected parties with reputable third-party crypto recovery companies that may charge a fee for their services.\n\nWith the recent updates, RSB has empowered cryptocurrency enthusiasts to make informed decisions and hold unethical brokers accountable. The company bolsters to build a community of informed investors who can protect themselves from hidden fees and market manipulation by sharing experiences, knowledge, and insights.\n\nRSB has the ability to create customized recovery plans tailored to individual cases. Whether serving as an advisor to management or offering hands-on coaching, RSB's team of experts can adapt strategies to address specific complaints and unique circumstances.\n\nRSB has emphasized taking the initial step by filing a complaint on the RSB website and their customer service representatives are available 24 hours a day to provide clients with the assistance and support they need.\n\nTo learn more about Report Scammed Bitcoin's expanded services and how they can assist users in recovering lost digital assets, please visit their website.\n\nAbout Report Scammed Bitcoin:\n\nReport Scammed Bitcoin (RSB) is a crypto recovery services provider with over two decades of experience in the industry. RSB is committed to helping individuals recover their lost digital assets and empowering cryptocurrency enthusiasts to make informed decisions. Their team of experts offers customized recovery plans and free consultations, and they connect affected parties with reputable third-party crypto recovery companies.\n\nContact Details\n\nReport Scammed Bitcoin (RSB)\n\nZella\n\nsupport@reportscammedbitcoin.com\n\nStory continues\n\nCompany Website\n\nhttps://reportscammedbitcoin.com\n\nView source version on newsdirect.com: https://newsdirect.com/news/report-scammed-bitcoin-expands-services-to-aid-crypto-trading-victims-in-recovering-lost-assets-724794097"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzNTAwL2JpdGNvaW4tb3B0aW9ucy1vcGVuLWludGVyZXN0LXJlYWNoZXMtYWxsLXRpbWUtaGlnaC1vZi0xNS1iaWxsaW9uLW9uLWRlcmliaXTSAXRodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjM1MDAvYml0Y29pbi1vcHRpb25zLW9wZW4taW50ZXJlc3QtcmVhY2hlcy1hbGwtdGltZS1oaWdoLW9mLTE1LWJpbGxpb24tb24tZGVyaWJpdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin options open interest reaches all-time high of $15 billion on Deribit - The Block",
        "content": "In the last 24 hours, open interest for bitcoin options on the Deribit crypto options and futures exchange reached an all-time high, surpassing $15 billion.\n\n\"Total open interest in bitcoin options surpassed that of BTC -2.62% futures for the first time. This shift signifies the market's maturation and growing sophistication,\" noted Deribit Chief Commercial Officer Luuk Strijers.\n\nHe added that on Deribit, which holds an 85% market share in bitcoin options, \"there is currently a record-breaking $15 billion in notional open interest in BTC options.\"\n\nThe data from Deribit corresponds with that from The Block's data dashboard. The total bitcoin options open interest across cryptocurrency exchanges has reached an all-time high of $16.49 billion, it shows.\n\n\n\nIncrease in crypto derivatives trading\n\nRELATED INDICES See crypto indices\n\nStrijers added that the increase in open interest to a new all-time high is evidence of the cryptocurrency market's evolving complexity. \"This development underscores the increasing preference for options as a strategic tool among traders, whether for positioning, hedging, or leveraging the recent surge in implied volatility. It's clear evidence of the market's evolving complexity,\" he said.\n\nAn increase in open interest signals a highly liquid market with many participants. Open interest refers to the total number of outstanding options contracts that have not been exercised. When there is an increase in open interest, it suggests an increase in sophisticated trader activity, with new contracts being created and added to the existing ones.\n\nWhile higher open interest can suggest greater interest in a specific asset and increased market activity, it doesn't provide information about the direction of the market or whether the prevailing sentiment is bullish or bearish."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9icmVha2luZy1kb3duLWJpdGNvaW5zLXJvbGxlci1jb2FzdGVyLXdlZWsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Breaking Down Bitcoin's Roller Coaster Week | Video - CoinDesk",
        "content": "It's been a wild week for Bitcoin. The world's largest Cryptocurrency by Market cap was close to 38,000 on Wednesday, guess where it is now, it's like 36,000. So those balloons popped. Uh Joining us now to discuss the crypto markets is head of tasty crypto. Ryan Grace. Welcome Ryan. Welcome back. Actually, thank you, Lawrence. Janice. Nice to see you both. Happy Friday. See you. So, um next six months, do you think that uh we're gonna continue to see some sort of uh bullishness? Can you explain why? Yeah, I think so. I think when you look out over the next six months, I mean, we're clearly in a bullish trend. We were training sideways really since March and now we've broken above some of those key levels. And I think you look for that trend to continue though. I would caution maybe in the, the very short term. Um I would caution around, you know, the idea that, hey, look, we're gonna see the fed on pause here. We're gonna see interest rate cuts and I would caution that being a good thing. You know, I do think that you see this trend continue. But if we start to see the economy slow down, which would cause the fed to ultimately pause and, and ultimately start to cut into next year. You know, I think it's because bad things are happening. But beyond that, when you look out at kind of this confluence of, of factors, it could all come into play really around the same time, you have the ETF approvals, which I know we've seen that kind of kicked down the road here by the SEC. But I don't think that that's unexpected. You have the having you have possibly um that accommodative monitor policy, we see a little bit more stimulus and you also have when you look on chain really ill liquid supply right now, we're about 75% or so of of long term supply is just kind of frozen. So I think the conditions are right for this bullish trend to continue. But again, I would caution in the short term, you know, you could still see a lot of volatility, but take advantage of that volatility would be my view. Speaking of the spot, Bitcoin ETF earlier this week, the SEC delayed a decision about hashtags spot Bitcoin ETF, I believe another application is, is coming up uh today. What do you think of these delays? Is it slowing momentum? What do you make of this? You know, I think you're gonna see a little bit of selling pressure when those, those headlines hit. Um but I don't think it changes anything. I think there's still a very high probability that we see these ETF S approved. Um I'm not surprised that the, the SEC is again kicking the can and delaying some of this. Uh I think that was to be expected, but as we get into um early next year into the 1st and 2nd quarter, I think that we will see these approved and, you know, I, I think generally that's gonna again continue to support this bullish narrative. Iiii I noticed you use the, the phrase uh e expect and probability and things like that. It's not guaranteed. And, and this is kind of a discussion I had with people the other day, uh that this is not something that's in the bag and that's across the board. Correct. There are ways for the sec to say, look, we're not approving this at all until we get control over the spot crypto markets or whatever it is. Um Do you think that that's a probability of happening as well if you had to assign, you said there's a probability if you had to assign a probability on ETF S spot, ETF s getting approved uh in the next six months, let's say, what would you assign that probability to be? Yeah, I think it's, it's above 50%. Right. I, I agree with you, Lawrence. I mean, there's certainly a chance that, um, we don't see this happen and that would definitely be a disappointment. And I think you would see, you know, certainly see some selling pressure as a result. But I think, uh just given how long this has taken where you've come from. Um I do think that there's a lot of momentum behind the industry right now. I mean, you have some of the biggest players in the space, obviously with Blackrock. Um people can speak to, to Larry Fink's connections. I think there's, you know, a greater than 50. I got to interrupt here because this is something that we do hear a lot that Blackrock is so sophisticated. Their attorneys are smarter than the S CCS attorneys. Every, but at the same time, Blackrock has to come up against not just the S ECs attorneys, they also have to come up against a guy who taught the class about crypto at MIT who now runs the SEC and it, it's just the SEC and the thing about regulators are that they don't have to worry about market pressures sometimes in regulating because if they say, look, we don't like something, we're not gonna approve it no matter what. Like, we don't care that trillion dollar asset managers want it. We don't like it and they can do that because they're the sec at the end of the day, they have an army and a bunch of guns backing them. So why would they care about how and whether or not Blackrock wants something and, and this, you know, they're not, they're, they don't care about market pressure sometimes. Yeah. Absolutely. I mean, I, I don't disagree with that. I think in that case then, you know, maybe we just have to wait this out. Uh, I do think there is a higher probability that we see this approved but if not, you know, maybe this ultimately does become an election issue when we think about crypto and maybe you do see some single issue voters come out in response to that. I mean, really, uh, a lot of time until then but, um, you know, I guess that's what you'd have to bet on then next is that you have to wait this out and you see some kind of shift in terms of the SCC, how many, how many single issue voters do we see? And still states. I, I don't know. Well, I, I don't, I don't mind inflation but this is, this is what matters to me. Yeah, absolutely. I mean, I think that, that there's, you know, a, a slim number but I guess that would just be the next step. Um, but for now I'm, I'm hopeful, I suppose one convention you put them all together, Lawrence. I spoke over you. We didn't hear you. Is it, you could put all the people who are crypto single issue voters in 11 conventional in Miami, in the entire country from the entire country. Ok, Lauren, we're gonna leave that there. I want to turn it down. So alt coins, are there any alt coins you're watching? We kind of monopolize this segment talking about Bitcoin and, and the spot Bitcoin ETF. But the alt have been doing some interesting stuff lately, especially Solana, which tumbled a bit this morning. What are you watching? Yeah, when I look across the space at all coins, you know, I think there might be a short term trading opportunity here where you see some of these uh play catch up certainly to Solana's performance. Um You know, when you look at the Solana BT C ratio, the spread there, um that's really just ripped higher versus something like E priced in Bitcoin, which is trading, you know, closer to those one year, those one year lows. So there might be an opportunity there where you see uh just in the short term, you know, a little bit of catch up when we look at E versus BT C, certainly E versus Solana. Um I also am looking at layer twos. So we've seen, you know, generally as, as they're all correlated just having various volatilities. We've seen everything perform relatively well here over the last couple of weeks. But if you're looking for a trading opportunity, there's possibly a chance for some catch up in some of the L two s against Ethereum. So when you look at arbitra, you look at optimism, um even polygon, you know, maybe there's an opportunity for a trade there as uh arbitra specifically has really underperformed on a relative basis versus what we've seen across the board. And what, what do you think ultimately led to today's sell off? You know, I just think it's a little bit of profit taking. I mean, I think in the short term, we've seen uh a pretty strong correlation between risk assets, uh generally speaking and crypto. So we saw a huge rip in crypto. We saw, you know, a massive move um in the S and P as well. And we're kind of seeing that run out of a little bit of steam. So I think that this is just kind of the, the natural course of trading, you're gonna get a little bit of chop. I still would look for opportunities to take advantage of those dips. Uh I think again, we're in a bullish trend, you know, your new range is maybe in terms of just where our volatility is, let's say it's, it's 35 to 40. Um I would look to, to buy those dips and I think we're just seeing a little bit of selling pressure after what's been, I mean, a massive rally over the last month when you look at a lot of these tokens. All right, Ryan, it's, it's that time of the segment for predictions. Where do you see Bitcoin headed towards the end of the year? I think into the end of the year, you know, if we continue to see, uh, again, risk assets trade. Well, here which a lot of people are betting on that kind of Santa Claus rally. Uh, we do know that from a seasonal perspective, November tends to be a great month for Bitcoin. Um, see if that continues into December, but let's say we're north of 40,000 going into the end of the year. I'm looking for this rally to continue."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGwtbWFya2V0LWZvbW8tYnRjLXByaWNlLTM5ay1wcm9maXQtem9uZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin bull market FOMO absent as BTC price nears key $39K profit zone - Cointelegraph",
        "content": "Bitcoin (BTC) bull market “FOMO” has yet to appear despite BTC price being up 120% this year.\n\nData from the statistics platform Look Into Bitcoin shows that on-chain transactions are only starting to involve “younger” Bitcoin.\n\nBitcoin bull market analysis: “We’re still early”\n\nBitcoin remains near 18-month highs and well beyond its bear market trading range and several key resistance levels.\n\nWhile the number of smaller wallets is increasing, there has not been a major return to the network from speculators — those holding BTC for short periods of time.\n\nIn an X (formerly Twitter) post on Nov. 16, Look Into Bitcoin creator Philip Swift flagged the realized cap HODL waves metric, also known as RHODL waves, as proof.\n\nRHODL splits the existing HODL waves metric, which divides BTC by age group of the supply and compares it to the price at which it last moved on-chain.\n\nThe result is a spike in coins, which frequently move during bull market phases, and the opposite in bear markets, where investors are afraid to sell or are in the red on their holdings.\n\n“Warmer colour low timeframe waves are only just starting to increase as coins are transferred on-chain,” Swift commented on the current state of RHODL.\n\n“No FOMO yet. We’re still early.”\n\nBitcoin RHODL waves chart. Source: Look Into Bitcoin\n\nBitcoin profitability nears “potential breakeven point”\n\nContinuing the examination of Bitcoin supply “age bands,” Onchained, a contributor to on-chain analytics platform CryptoQuant, stressed that those who increased BTC exposure in the run-up to the 2021 all-time highs remain underwater.\n\nRelated: Bitcoin institutional inflows top $1B in 2023 amid BTC supply squeeze\n\nHe did so using the net unrealized profit/loss (NUPL) indicator, which offers profitability ratios for cohorts of stored coins.\n\nComing soon, however, is a key line in the sand for bull market hodlers.\n\n“Considering NUPL across different age bands provides insights into profitability dynamics. Notably, the depicted graph reveals all UTXO age bands currently in a profitable state, except for holders with bitcoins held for 18 months to 3 years,” Onchained wrote in one of CryptoQuant’s Quicktake market updates on Nov. 16.\n\n“This aligns with their entry during the Bitcoin price rally to $67,000. Their NUPL nearing the profitability benchmark of 0 suggests a potential break-even point if Bitcoin continues its rally beyond $39,000.”\n\nBitcoin UTXOs in loss % chart. Source: CryptoQuant\n\nCryptoQuant data shows that the overall proportion of unspent transaction outputs, or UTXOs, currently at a loss is just 11.6%.\n\nAs Cointelegraph reported, whale entities have been increasing BTC selling at current prices.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1kb2VzLTE1NDkyODUwNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "What is Bitcoin mining and how does it work? - Yahoo Finance",
        "content": "Bitcoin mining is the process of creating new bitcoins by solving extremely complicated math problems that verify transactions in the currency. When a bitcoin is successfully mined, the miner receives a predetermined amount of bitcoin.\n\nBitcoin is a cryptocurrency that’s gained a wide following due to its wild price swings and surging value since it was first created in 2009.\n\nAs prices of cryptocurrencies and Bitcoin in particular have skyrocketed in recent years, it’s understandable that interest in mining has picked up as well. But for most people, the prospects for Bitcoin mining are not good due to its complex nature and high costs. Here are the basics on how Bitcoin mining works and some key risks to be aware of.\n\nBitcoin mining statistics\n\nDollar Coin\n\nA miner currently earns 6.25 Bitcoin (about $227,500 as of November 2023) for successfully validating a new block on the Bitcoin blockchain.\n\nCreating Bitcoin consumes 147 terawatt-hours of electricity each year, more than is used by the Netherlands or the Philippines, according to the Cambridge Bitcoin Electricity Consumption Index.\n\nIt would take nine years of household-equivalent electricity to mine a single bitcoin as of August 2021.\n\nThe price of Bitcoin has been extremely volatile over time. In 2020, it traded as low as $4,107 and reached an all-time high of $68,790 in November 2021. As of November 2023, it traded for about $36,400.\n\nWhile it depends on your computing power and that of other miners, the odds of a modestly powered solo miner solving a Bitcoin hash were about 1 in 26.9 million in January 2023.\n\nThe United States (37.4 percent), Mainland China (18.1 percent) and Kazakhstan (14.0 percent) were the largest bitcoin miners as of January 2022, according to the Cambridge Electricity Consumption Index.\n\nUnderstanding Bitcoin\n\nBitcoin is one of the most popular types of cryptocurrencies, which are digital mediums of exchange that exist solely online. Bitcoin runs on a decentralized computer network or distributed ledger that tracks transactions in the cryptocurrency. When computers on the network verify and process transactions, new bitcoins are created, or mined. These networked computers, or miners, process the transaction in exchange for a payment in Bitcoin.\n\nStory continues\n\nBitcoin is powered by blockchain, which is the technology that powers many cryptocurrencies. A blockchain is a decentralized ledger of all the transactions across a network. Groups of approved transactions together form a block and are joined to create a chain. Think of it as a long public record that functions almost like a long running receipt. Bitcoin mining is the process of adding a block to the chain.\n\nHow Bitcoin mining works\n\nIn order to successfully add a block, Bitcoin miners compete to solve extremely complex math problems that require the use of expensive computers and enormous amounts of electricity. To complete the mining process, miners must be first to arrive at the correct or closest answer to the question. The process of guessing the correct number (hash) is known as proof of work. Miners guess the target hash by randomly making as many guesses as quickly as they can, which requires major computing power. The difficulty only increases as more miners join the network.\n\nThe computer hardware required is known as application-specific integrated circuits, or ASICs, and can cost up to $10,000. ASICs consume huge amounts of electricity, which has drawn criticism from environmental groups and limits the profitability of miners.\n\nIf a miner is able to successfully add a block to the blockchain, they will receive 6.25 bitcoins as a reward. The reward amount is cut in half roughly every four years, or every 210,000 blocks. As of November 2023, Bitcoin traded at around $36,400, making 6.25 bitcoins worth $227,500.\n\nIs Bitcoin mining profitable?\n\nIt depends. Even if Bitcoin miners are successful, it’s not clear that their efforts will end up being profitable due to the high upfront costs of equipment and the ongoing electricity costs. The electricity for one ASIC can use the same amount of electricity as half a million PlayStation 3 devices, according to a 2019 report from the Congressional Research Service.\n\nAs the difficulty and complexity of Bitcoin mining has increased, the computing power required has also gone up. Bitcoin mining consumes about 147 terawatt-hours of electricity each year, more than most countries, according to the Cambridge Bitcoin Electricity Consumption Index. You’d need 9 years’ worth of the typical U.S. household’s electricity to mine just one bitcoin as of August 2021.\n\nSource: Cambridge Bitcoin Electricity Consumption Index\n\nOne way to share some of the high costs of mining is by joining a mining pool. Pools allow miners to share resources and add more capability, but shared resources mean shared rewards, so the potential payout is less when working through a pool. The volatility of Bitcoin’s price also makes it difficult to know exactly how much you’re working for.\n\nHow do you start Bitcoin mining?\n\nHere are the basics you’ll need to start mining Bitcoin:\n\nWallet. This is where any Bitcoin you earn as a result of your mining efforts will be stored. A wallet is an encrypted online account that allows you to store, transfer and accept Bitcoin or other cryptocurrencies. Companies such as Coinbase, Trezor and Exodus all offer wallet options for cryptocurrency.\n\nMining software. There are a number of different providers of mining software, many of which are free to download and can run on Windows and Mac computers. Once the software is connected to the necessary hardware, you’ll be able to mine Bitcoin.\n\nComputer equipment. The most cost-prohibitive aspect of Bitcoin mining involves the hardware. You’ll need a powerful computer that uses an enormous amount of electricity in order to successfully mine Bitcoin. It’s not uncommon for the hardware costs to run around $10,000 or more.\n\nRisks of Bitcoin mining\n\nPrice volatility. Bitcoin’s price has varied widely since it was introduced in 2009. Since just November 2021, Bitcoin has traded for less than $20,000 and nearly as high as $69,000. This kind of volatility makes it difficult for miners to know if their reward will outweigh the high costs of mining.\n\nRegulation. Very few governments have embraced cryptocurrencies such as Bitcoin, and many are more likely to view them skeptically because the currencies operate outside government control. There is always the risk that governments could outlaw the mining of Bitcoin or cryptocurrencies altogether as China did in 2021, citing financial risks and increased speculative trading.\n\nTaxes on Bitcoin mining\n\nIt’s important to remember the impact that taxes can have on Bitcoin mining. The IRS has been looking to crack down on owners and traders of cryptocurrencies as the asset prices have ballooned in recent years. Here are the key tax considerations to keep in mind for Bitcoin mining.\n\nAre you a business? If Bitcoin mining is your business, you may be able to deduct expenses you incur for tax purposes. Revenue would be the value of the bitcoins you earn. But if mining is a hobby for you, it’s not likely you’ll be able to deduct expenses.\n\nMined bitcoin is income. If you’re successfully able to mine Bitcoin or other cryptocurrencies, the fair market value of the currencies at the time of receipt will be taxed at ordinary income rates.\n\nCapital gains. If you sell bitcoins at a price above where you received them, that qualifies as a capital gain, which would be taxed the same way it would for traditional assets such as stocks or bonds.\n\nCheck out Bankrate’s cryptocurrency tax guide to learn about basic tax rules for Bitcoin, Ethereum and more.\n\nBottom line\n\nWhile Bitcoin mining sounds appealing, the reality is that it’s difficult and expensive to actually do profitably. The extreme volatility of Bitcoin’s price adds more uncertainty to the equation.\n\nKeep in mind that Bitcoin itself is a speculative asset with no intrinsic value, which means it won’t produce anything for its owner and isn’t pegged to something like gold. Your return is based on selling it to someone else for a higher price, and that price may not be high enough for you to turn a profit."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdXNoaS10YXBzLWludG8temV0YWNoYWluLXRvLXRlc3QtbmF0aXZlLWJpdGNvaW4tZGVmaS1zd2Fwc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Sushi taps into ZetaChain to begin testing native Bitcoin DeFi swaps - Cointelegraph",
        "content": "DeFi platform Sushi has partnered with interoperability platform ZetaChain to explore the possibility of native Bitcoin (BTC) swaps for its users across 30 different blockchain networks.\n\nSushi’s deployment of its decentralized exchange (DEX) on ZetaChain is touted to enable trading of BTC without wrapping across several blockchains in what the team describes as a “native, decentralized and permissionless manner.”\n\nThe integration is set to include Sushi’s v2 and v3 automated market makers and Sushi’s cross-chain swap, SushiXSwap.\n\nZetaChain core contributor Ankur Nandwani told Cointelegraph that the partnership can bring Bitcoin’s vast user base to the decentralized finance (DeFi) sector in a native manner. He also countered arguments suggesting that bridging BTC without wrapping the assets on another chain is not possible.\n\n“There have already been early examples like THORChain who are trading Bitcoin natively with other chain assets. Other approaches, like Bitcoin side chains, also offer a flavor,” Nandwani said.\n\nHe added that ZetaChain’s approach effectively allows anyone to build Bitcoin-interoperable decentralized applications (DApps) that can settle contracts and transactions natively.\n\n“Of course, there are trust assumptions, namely trusting the decentralization of the network that is doing this cross-chain transaction.”\n\nZetaChain has reportedly proven the technology at a testnet level and will look to prove the utility when it launches its mainnet through partnerships with SushiSwap and other DeFi protocols.\n\nSushi head chef Jared Grey hailed the integration as a significant advancement for DeFi and described the capability to swap Bitcoin natively as a “game-changer” for the industry.\n\n“It’s not only about the increased liquidity from Bitcoin; it’s about beginning a new chapter in DeFi, where we see more practical use cases of interoperability and enhanced connectivity.”\n\nSushi’s integration with ZetaChain is set to take place in two phases. The first will see Sushi introduce a DEX on ZetaChain’s testnet to support basic asset swaps and liquidity provision. This phase is also set to include beta testing and incentives for application testing.\n\nSushi will become one of ZetaChain’s launch partners when it deploys its mainnet. The launch is expected to be followed by full functionality for Bitcoin interoperability. Nandwani outlined the technical details behind the functionality that allows for native BTC cross-chain swaps.\n\nA cross-chain swap contract is deployed on ZetaChain’s Ethereum Virtual Machine. The contract is omnichain, which means that while it’s deployed on ZetaChain, it can be called, and the value can be passed to it from any connected chain, including Bitcoin.\n\nCalling a cross-chain swap contract involves a user sending a regular native token transfer transaction on Bitcoin with a special memo to a TSS address. The memo contains the omnichain contract address on ZetaChain and a value that is passed to the contract. For a cross-chain swap, the value would be the destination token, for example, Ether (ETH) or USD Coin (USDC) on Ethereum, as well as the recipient address on the destination chain.\n\nRelated: Bitcoin could become the foundation of DeFi with more single-sided liquidity pools\n\nThe TSS address is owned by ZetaChain signer validators. BTC transferred to the TSS address is locked, and validators observe this transfer and cast a vote about this event on ZetaChain. If enough votes are cast, the event is considered observed, and an inbound cross-chain transaction (CCTX, from Bitcoin to ZetaChain) is created.\n\nOnce a CCTX is processed, a ZetaChain omnichain contract is called, and the amount of BTC transferred to the TSS address is minted as ZRC-20 BTC. During the cross-chain swap contract execution, a ZRC-20 BTC is swapped for the ZRC-20 of another token, for example, ZRC-20 ETH.\n\nZRC-20 ETH is then finally withdrawn to the destination chain. During the withdrawal process, ZRC-20 ETH is burned, and an outbound CCTX is created from ZetaChain to Ethereum. Observer validators vote on this CCTX on ZetaChain. Once the outbound CCTX is processed, native ETH is transferred from the TSS address on Ethereum to the recipient on Ethereum.\n\nNandwani provided this example to outline how native BTC is swapped for native ETH in a decentralized manner, facilitated by ZetaChain’s network validators across connected chains.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aXNkb210cmVlLWFtZW5kcy1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "WisdomTree amends S-1 form spot Bitcoin ETF filing as crypto awaits SEC decisions - Cointelegraph",
        "content": "The global exchange-traded fund (ETF) provider WisdomTree filed an amended Form S-1 spot Bitcoin (BTC) ETF prospectus with the United States Securities and Exchange Commission (SEC) on Nov. 16.\n\nThe update comes a few months after WisdomTree refiled its spot Bitcoin ETF application in June 2023, proposing a rule change to list and trade shares of the WisdomTree Bitcoin Trust on the BZX Exchange by the Chicago Board Options Exchange (CBOE).\n\nThe amended prospectus mentions that the WisdomTree Bitcoin Trust ETF will trade under a ticker symbol BTCW, with Coinbase Custody Trust serving as the custodian holding all of the trust’s Bitcoin on its behalf.\n\nAccording to Bloomberg ETF analyst James Seyffart, the updated Form S-1 spot Bitcoin ETF filing by WisdomTree means that the firm is still planning to launch an ETF and is discussing the opportunity with the SEC.\n\n“All issuers were expected to have to file one of these to potentially launch their ETF at some point. Just a step in the process. Nothing critical,” Seyffart wrote on X (formerly Twitter).\n\nAnother Bloomberg ETF expert, Eric Balchunas, noticed that WisdomTree took “long enough” to amend its Form S-1 Bitcoin ETF filing. “Please tell me the SEC isn’t waiting till all S-1s are updated before issuing a second round of comments,” he added.\n\nRelated: First deadline window looms for SEC to approve Bitcoin ETFs: Law Decoded\n\nAccording to Seyffart’s data, only two spot Bitcoin ETF filers out of 12 firms in the U.S. have yet to amend their S-1 filings with the SEC: Franklin Templeton and Global X.\n\nOkay, we're nearing in on deadline dates for 3 spot #Bitcoin ETF applications. I want to get ahead of it because there's a pretty good chance we'll see delay orders from the SEC. Delays WOULD NOT change anything about our views & 90% odds for 19b-4 approval by Jan 10, 2024 pic.twitter.com/LE7sOlHAHM — James Seyffart (@JSeyff) November 14, 2023\n\nFranklin Templeton was awaiting its first spot Bitcoin ETF deadline on Nov. 17, but the SEC delayed it to Jan. 1, 2024. Hashdex, whose deadline was previously also set for Nov. 17, saw its deadline moved by the SEC to Jan. 1, 2024, on Nov. 15 as well.\n\nGlobal X, another firm that hasn’t amended its S-1 filing yet, is also awaiting its second spot Bitcoin ETF deadline on Nov. 21.\n\nBloomberg ETF analysts like Seyffart expect the SEC to do another round of delays on decisions regarding the upcoming deadlines in the near future. However, Seyffart still believes the delays would not alter his perspective of the 90% likelihood of the SEC approving a spot Bitcoin ETF before the end of January 2024.\n\nDisclaimer: The article has been updated to reflect that the SEC delayed decisions regarding spot Bitcoin ETFs by both Franklin Templeton and Hashdex on Nov. 15.\n\nMagazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzNTk4L3NlYy1kZWxheXMtZGVjaXNpb24tb24tZ2xvYmFsLXgtc3BvdC1iaXRjb2luLWV0ZtIBWGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2MzU5OC9zZWMtZGVsYXlzLWRlY2lzaW9uLW9uLWdsb2JhbC14LXNwb3QtYml0Y29pbi1ldGY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "SEC delays decision on Global X spot bitcoin ETF as expected - The Block",
        "content": "The U.S. Securities and Exchange Commission set up a comment period for the Global X Bitcoin BTC -2.62% Trust, which was filed in partnership with Cboe BZX exchange, until late December.\n\nAccording to the press release the SEC published Friday afternoon, it expects public comments on the proposal in the next 35 days, making the new deadline as Dec. 22.\n\nThe delay was expected, as Bloomberg ETF analyst James Seyffert posted on X today, although the decision on the Global X proposal was not due until Nov. 21.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe SEC also delayed a decision on whether to approve or disapprove of the Franklin Bitcoin ETF on Friday to until the beginning of 2024."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMTcveW91LWNvdWxkLW93ZS0wcGVyY2VudC1jYXBpdGFsLWdhaW5zLXRheC1mb3ItY3J5cHRvY3VycmVuY3ktaW4tMjAyMy5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMTEvMTcveW91LWNvdWxkLW93ZS0wcGVyY2VudC1jYXBpdGFsLWdhaW5zLXRheC1mb3ItY3J5cHRvY3VycmVuY3ktaW4tMjAyMy5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "You could owe 0% capital gains tax for cryptocurrency in 2023. Here's what crypto investors need to know - CNBC",
        "content": "After a more than 80% jump in bitcoin's price in the first half of 2023, crypto market watchers gave CNBC their expectations for how the cryptocurrency will perform in the latter half of the year. STR | NurPhoto via Getty Images\n\nAs investors weigh year-end tax moves, there may be a lesser-known savings opportunity for certain cryptocurrency investors, experts say. After the crypto industry lost nearly $1.4 trillion in 2022, many investors leveraged tax loss harvesting, which uses losses to offset profits. But after a rally in 2023, you may consider strategically selling profitable crypto held in brokerage accounts, known as \"tax gain harvesting.\" The strategy works for investors in the 0% long-term capital gains bracket who have owned digital assets for more than one year, according to certified public accountant Tom Wheelwright, CEO of WealthAbility.\n\nLoading chart...\n\nAs of November 17, the price of bitcoin has more than doubled since the beginning of 2023, and some investors now have \"built-in gains,\" Wheelwright said. Those in the 0% long-term capital gains bracket can \"sell it, recognize the gain and buy it back immediately\" because there's no so-called wash sale rule for gains, he said. You calculate gains by subtracting the asset's sales price from the \"basis\" or original cost. But when you repurchase the currency, the basis adjusts to the new purchase price, known as a \"step-up in basis.\" If prices continue to climb and you sell the asset again later, the higher basis means future profits will be smaller. Investors \"really ought to be paying attention\" to tax-free opportunities to harvest crypto gains, according to Wheelwright. Of course, the decision to repurchase crypto depends on your risk tolerance and goals.\n\nWhy it's a 'wiser strategy' to harvest gains\n\nIf you fall into the 0% bracket, crypto tax-gain harvesting is a \"wiser strategy\" than harvesting losses, especially when immediately buying back the asset, explained Andrew Gordon, tax attorney, CPA and president of Gordon Law Group. Tax-loss harvesting has been popular among crypto investors because of a wash sale loophole. The IRS disallows a loss for other assets if investors buy a \"substantially identical\" asset within the 30-day window before or after the sale. The wash sale rule doesn't apply to crypto losses or gains for any asset. Still, the tax gain strategy allows you to sell at a gain and pay no tax, whereas \"tax loss harvesting defers future tax,\" Gordon said.\n\nwatch now\n\nHow to know your capital gains bracket\n\nFor 2023, you may fall into the 0% long-term capital gains rate with taxable income of $44,625 or less for single filers and $89,250 or less for married couples filing jointly. That's based on \"taxable income,\" which is significantly lower than gross earnings. You calculate taxable income by subtracting the greater of the standard or itemized deductions from your adjusted gross income."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc29yYS1zdW1taXQtMjAyMyUzQS11bnZlaWxpbmctdGhlLWZ1dHVyZS1vZi1iaXRjb2luLWluLXRhaXBladIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Sora Summit 2023: Unveiling the Future of Bitcoin in Taipei - Nasdaq",
        "content": "In a dynamic intersection of technology, finance, and innovation, Sora Summit 2023 is set to unfold on December 16 at the Songshan Cultural and Creative Park in Taipei. This eagerly anticipated event, organized by Sora Ventures, a digital asset venture capital firm, promises to be the pinnacle of Taipei Blockchain Week.\n\nA Legacy of Collaboration and Excellence\n\nSora Summit made its debut in 2018 in Macau, attracting over 1,000 participants and featuring more than 100 speakers from globally recognized entities such as Pantera Capital and Binance Labs. The summit has since evolved into a benchmark for quality information, distinguished speakers, and high-profile attendees, setting the stage for collaborative efforts within the Bitcoin community.\n\n“The development of bitcoin utility will be far more relevant tobitcoin pricethan anyone can imagine. Historically, utility has been the core factor to price increase on any blockchain,” said Jason Fang, Managing Partner and Co-Founder at Sora Ventures. “Sora’s investment team feels very strongly about this trend and we are eager to share our knowledge and resources through Sora Summit.”\n\nFour Pillars of Focus\n\nThis year, Sora Summit returns with a renewed commitment to fostering collaboration and exploring the latest trends in the Bitcoin space. The event will revolve around four key sectors, each crucial to the evolution of Bitcoin and digital assets:\n\nBitcoin Ecosystem: Delving into the recent surge in Bitcoin's utility and value, the summit aims to unravel the intricacies of the Bitcoin ecosystem with insights from industry leaders.\n\nDecentralized Science: As the future of open-sourced scientific research takes center stage, the summit will facilitate discussions on the transformative potential of decentralized science.\n\nCryptography & Encryption: Tackling the pressing challenges of data privacy, experts will converge to propose innovative solutions within the realm of cryptography and encryption.\n\nOrdinals: Exploring the next phase for greater adoption, Sora Summit will shed light on the evolving landscape of Ordinals, Inscriptions and their expanding utilities and use cases.\n\nDistinguished Speakers Shaping the Dialogue\n\nThis year's summit boasts an impressive lineup of speakers representing prominent organizations within the Bitcoin ecosystem. Notable figures include Casey Rodarmor, the Creator of the Ordinals Protocol, Danny Yang, CEO at Metagood and OnChainMonkey, David Bailey, CEO at Bitcoin Magazine, and Domo, the Creator of BRC-20 standard and the token ORDI. These speakers bring a wealth of experience and expertise, ensuring diverse perspectives on the critical issues facing the Bitcoin industry today.\n\nTaipei: A Pivotal Hub for Blockchain Innovation\n\nFang highlighted the significance of choosing Taipei as the host city. He emphasized Taipei's unique position in bridging the East and West in the Bitcoin landscape, citing the city's immense potential to contribute to the industry ecosystem. “A lot of people in our industry have heard about Ordinals and decentralized science, but not many people actually understand what the technology does,” explained Fang. “This is why we’re hosting Sora Summit, so we can fill the knowledge gap for those who are keen to hear about the future narratives in Bitcoin.” By partnering with Taipei Blockchain Week, Sora Summit aims to underscore Taipei's importance within the global blockchain community, providing an unparalleled platform for participants to learn, network, and collaborate.\n\nA Confluence of Minds and Technologies\n\nAs Sora Summit 2023 prepares to unfold in Taipei, the anticipation is palpable. With a focus on the Bitcoin ecosystem and a diverse array of sectors critical to the future of digital commerce, the summit promises to be a melting pot of ideas, collaboration, and innovation. The distinguished speakers will undoubtedly play a pivotal role in shaping the discourse and steering the Bitcoin industry toward new horizons. As the world eagerly awaits the insights and collaborations that will emerge, Sora Summit 2023 stands as a testament to the continued evolution and maturation of the Bitcoin ecosystem.\n\nFor more information and to register for Sora Summit 2023, click here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9haS1lbmVyZ3ktY29uc3VtcHRpb24tZWNoby1iaXRjb2luLW1pbmluZy1jcml0aWNpc21zLXNheXMtaGVhdGJpdC1mb3VuZGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "AI's energy consumption concerns echo Bitcoin mining criticisms, says Heatbit founder - Cointelegraph",
        "content": "Artificial intelligence (AI) and machine learning (ML) are demanding huge amounts of computing resources as interest in the space grows, but conventional Bitcoin (BTC) miners are not jumping on the bandwagon just yet.\n\nSpeaking to Cointelegraph journalist Joe Hall at Web Summit 2023 in Lisbon, Portugal, Heatbit founder Alex Busarov believes that mining farms, data centers and small-scale computing power providers are far more clued up on Bitcoin mining than the nascent AI and ML infrastructure space.\n\nAlex Busarov at Web Summit 2023, with a Heatbit Bitcoin-mining heater strapped to his back. Source: Joe Hall/Cointelegraph\n\n“The reason for that is when people talk about AI, that’s normally the actual application side of AI; it can speak for you, or it can create your voice or whatnot, but people don’t really think of the compute side of AI as much,” Busarov explains.\n\nBusarov’s Heatbit company has pioneered heating hardware devices that simultaneously mine Bitcoin and generate heat to warm homes. The Bitcoin-mining heaters feature a circuit board that is capable of mining BTC as well as being used for AI training and computing resources.\n\nRelated: ‘107,000 GPUs on the waitlist’ — Io.net beta launch attracts data centers, GPU clusters\n\nWeb Summit, which has attracted more than 70,000 people to Lisbon annually in recent years, provided an opportunity for Busarov to expand Heatbit’s original BTC-centric focus to its ability to be used as an AI training resource.\n\nPart of the company’s marketing strategy is focused on the negative perception of Bitcoin mining’s energy usage.\n\nWhile conceding that the BTC-heaters are playing their part in innovating Bitcoin mining by allowing it to be a secondary heating source in colder climates, Busarov believes AI computing may soon garner a similar negative perception as the industry continues to demand hardware resources.\n\n“I think AI is going to overtake Bitcoin mining with all the headlines like, “AI training is using more energy than this in this country” quite soon. They’re going to need devices like ours, just with AI training chips.”\n\nHeatbit’s hardware already caters to providing AI and ML resources. Still, Busarov also believes that the wider GPU and ASIC infrastructure ecosystem might not necessarily shift away from Bitcoin and cryptocurrency mining endeavors just yet.\n\n“I think what sticks with people is actually Bitcoin mining. I think they actually understand Bitcoin mining computing a lot better than AI training computing.”\n\nThe Heatbit founder also believes that home mining might become more viable again in the future, given that the level of hardware precision involved in large-scale mining means that competition comes down to the cost of energy:\n\n“Who’s got the cheapest cost of energy? Well, the one who doesn’t have to pay for the cost of energy.”\n\nBusarov says combining mining with additional functions like heating and cooling leads to zero energy costs for the mining itself.\n\n“That’s why I think it’s going to go back to home mining, for economic reasons, through applications like ours.”\n\nAs Cointelegraph recently reported, demand for AI computing resources is rising. Innovative startups like io.net are leveraging blockchain solutions to power networks that source GPU computing power from geographically diverse data centers, cryptocurrency miners and decentralized storage providers to power machine learning and AI computing.\n\nMagazine: The truth behind Cuba’s Bitcoin revolution: An on-the-ground report"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90b3AtMTAtY3J5cHRvLXByaWNlcy1mb3Itbm92ZW1iZXItMTctMjAyMy1iaXRjb2luLWZhbGxzLWJlbG93LXVzMzcwMDAtZHJhZ2dpbmctZG93bi1vdGhlci1jcnlwdG9jdXJyZW5jaWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Top 10 Crypto Prices for November 17, 2023: Bitcoin Falls Below US$37,000, Dragging Down Other Cryptocurrencies - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    }
]