[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjcvYml0Y29pbi1zdXJnZXMtdG8tYWxsLXRpbWUtaGlnaHMtaW4tdHVya2V5LWFuZC1uaWdlcmlhL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjcvYml0Y29pbi1zdXJnZXMtdG8tYWxsLXRpbWUtaGlnaHMtaW4tdHVya2V5LWFuZC1uaWdlcmlhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Surges to All-Time Highs in Turkey and Nigeria - CoinDesk",
        "content": "Price volatility, which was absent in the past several months, seemed to return as bitcoin spiked to $35,000 within hours early this week as the discovery of a ticker tied to BlackRock’s proposed bitcoin ETF led to irrational exuberance – who may have believed it to be a sign of approval."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmdyZWVucGVhY2Uub3JnL3VzYS9uZXdzL3RleGFuLWFjdGl2aXN0cy10by1iaXRjb2luLW1pbmVycy1kb250LW1lc3Mtd2l0aC10ZXhhcy13YXRlci1hbmQtZWxlY3RyaWNpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Texan Activists To Bitcoin Miners: Don’t Mess with Texas’ Water and Electricity - greenpeace.org",
        "content": "Texan Activists To Bitcoin Miners: Don’t Mess with Texas’ Water and Electricity\n\nIn a resounding call to action, activists, environmentalists, and concerned Texans have come together for a week-long campaign aimed at challenging the environmental repercussions of the world's largest Bitcoin mining operation. This unified effort seeks to address the consequences of Bitcoin mining in the Lone Star State while advocating for transparency and accountability in the industry and by local politicians.\n\nCorsicana, TX (October 27, 2023) — In a dynamic week of action, Greenpeace USA, the Texas Coalition Against Cryptomining, and Navarro County residents confronted Riot Platforms Bitcoin mining operations in Texas. The week of action shed light on Riot Platform’s impending launch of the world’s largest Bitcoin mining operation in Corsicana, Texas. This development threatens to exacerbate Texas’ already burdened energy grid and poses substantial environmental risks.\n\nJackie Sawicky, Founder of the Texas Coalition Against Cryptomining, said: “Bitcoin proof-of-waste ‘miners’ are wasting water, driving up our electricity bills, getting tax breaks, abatements, and deeply discounted energy. They get paid to shut down once the grid has destabilized, then they resell that cheap energy at a premium. Why on earth should every Texan pick up the tab for a digital casino that hardly any of us gamble in?”\n\nRiot Platforms’ choice of Corsicana, Texas, as the site for their colossal Bitcoin mine is driven by several factors, including proximity to the Navarro switch, privileged access to already strained water sources, lenient regulations, cost-effective electricity, and enticing incentives offered by the Electric Reliability Council of Texas (ERCOT) through its Demand and Reserve Response programs. Through its participation in Demand Response, Riot is able to sell its deeply discounted energy back to Texans at a premium in times when electricity demand is high. This offers Riot substantial financial rewards at the expense of Texas ratepayers. The program has helped turn Texas into a hub for energy-intensive Bitcoin mining operations while Texans are urged to conserve energy and must contend with sky-high electricity bills.\n\nJoshua Archer, Greenpeace USA Bitcoin Campaign Lead said: “We stand in solidarity with the Texans who are bravely raising their voices against Riot Platforms’ exploitation of their communities. This week of action embodies our collective determination to combat Bitcoin’s destructive impact on electricity grids, water resources, and the global climate.”\n\nThe protest on Wednesday lasted two hours in front of what will be the world’s largest Bitcoin mine owned by Riot Platforms. Multiple residents who were driving by engaged with protesters and supported the cause. Photos of the week available here.\n\nKimberlee Walter, Founder of Stand Up for Change: Navarro County said: “This week of action has provided a crucial platform for raising awareness and informing my fellow Navarro County residents about the absolute devastation the presence of Riot Platforms’ Bitcoin mining operation will have on all of us.”\n\nLocal politicians in Navarro County have been less than transparent about the Bitcoin mining activities in their community, rejecting requests for an official Town Hall meeting to address concerns raised by activists.\n\nThese concerns include:\n\nExcessive electricity consumption on an already stressed and unstable grid;\n\nHigher electricity bills for Texas ratepayers;\n\nExcessive water usage, in drought-prone Texas;\n\nNoise pollution; and\n\nAdditional fossil fuel use at a time when we need rapid progress on emissions reduction.\n\nThe week of action included an unofficial Town Hall meeting on Tuesday hosted by the Texas Coalition Against Cryptomining (TCAC). Speakers included Ed Hirs, an energy fellow at the University of Houston; Adrian Shelley, the Texas office director of Public Citizen; and Jackie Sawicky from TCAC. It was moderated by Kimberlee Walter. Community members, officials from nearby districts, and journalists attended. For a recording of the Town Hall meeting please click here.\n\nFor a more in-depth look into Riot Platforms, the company behind the world’s largest Bitcoin mine, you can read a recent report put out by Greenpeace USA here.\n\n###\n\nContact: Gujari Singh, Greenpeace USA Senior Communications Specialist, [email protected], 631-404-9977\n\nGreenpeace USA is part of a global network of independent campaigning organizations that use peaceful protest and creative communication to expose global environmental problems and promote solutions that are essential to a green and peaceful future. Greenpeace USA is committed to transforming the country’s unjust social, environmental, and economic systems from the ground up to address the climate crisis, advance racial justice, and build an economy that puts people first. Learn more at www.greenpeace.org/usa."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaXMtdGhlLWJpdGNvaW4tZXRmLW92ZXJoeXBlZC1uby1idXQtY3J5cHRvLXdpbnRlci1pc250LW92ZXIteWV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Is the Bitcoin ETF Overhyped? No – but Crypto Winter Isn't Over Yet - Nasdaq",
        "content": "By James Edwards\n\nThe industry still has some major hurdles to clear before Bitcoin can reach a new all-time-high\n\nThis week Bitcoin rallied to a 17-month high of $35,000 off the back of speculation that a Bitcoin spot ETF is imminent.\n\nInterest in crypto has seemingly done a 180, with institutional investors and retail traders returning to the fold.\n\nBut this euphoria could be short lived, as the industry still has quite a few hurdles to clear before another bull run can take off in earnest.\n\nHere's what you need to know before you jump back into the market.\n\nBinance is on thin ice\n\nSpeak to anyone with their ear to the ground in crypto, and they'll tell you the elephant in the room isn't the Sam Bankman-Fired trial or the SEC, but Binance.\n\nThe world's largest exchange by trade volume is currently facing a crisis on several fronts.\n\nOn October 17, Binance US disabled US dollar withdrawals after the SEC asked a court to freeze the companies assets.\n\nThis action is part of an on-going lawsuit which alleges Binance violated a number of securities laws.\n\nAmong the charges are illegal securities offerings of BNB and BUSD, the comingling of users funds, failure to register as an exchange, and falsifying trading volumes.\n\nThis isn't Binance's only battle in the U.S. either. An earlier lawsuit from the CTFC in March that alleges the company \"willfully evaded\" securities laws and by targeting and onboarding US to its derivatives platform.\n\nBoth lawsuits target not just Binance, but also accuse its CEO, Changpeng Zhao (CZ), of breaking the law.\n\nThe pausing of US dollar withdrawals follows similar actions in Europe and Australia, where EUR and AUD payment partners have abandoned the firm, with no replacements to be found.\n\nJust months before AUD withdrawals were frozen, its Australian CEO Leigh Travers quit the firm as the Australian Securities and Investments Commission investigated Binance and closed its derivatives business by revoking its license.\n\nThings aren't much better across the pond either, with Binance losing its head of UK operations, ​​Jonathan Farnell, earlier this week.\n\nOn October 16, Binance restricted services for customers in the UK as a result of new Financial Conduct Authority (FCA) rules.\n\nThis is the latest in a series of departures, which saw Binance's Chief Strategy Officer, Senior Director of Investigations, and SVP for Compliance all depart in July.\n\nElsewhere, Binance is facing heat from regulators in Germany for violating securities laws and in both Japan and Singapore for operating without a license.\n\nFor their part, Binance continue to largely dismiss the claims against them, and have filed a request in court to have the SEC lawsuit thrown out.\n\nThe concern now is that Binance could face a liquidity crisis, similar to that of FTX and other defunct exchanges before it.\n\nIf users are forced to withdraw funds en masse, or simply panic, then it's unclear whether Binance would be able to meet demand.\n\nIt's no secret that Binance has built a sprawling web of financial services, which include all sorts of lending facilities, staking, funding deals, and trading activities.\n\nAny sudden capital flight could easily shock the system, and have flow-on effects throughout the industry.\n\nNo one quite knows if Binance is operating with integrity, but the concern is very real.\n\nThe Sam Bankman-Fried trial and FTX bankruptcy are still unresolved\n\nThe criminal trial against Sam Bankman-Fried (SBF) is now in its 4th week, and won't conclude until November 9th at the earliest.\n\nA core line of inquiry has been FTX's sprawling empire and business dealings. These include hundreds of investments in crypto projects, its hedge fund Alameda and even millions of dollars of political donations.\n\nAs further evidence of illegal conduct is revealed, there's concern around what impact this will have on the wider industry – which is only just recovering.\n\nFor instance, FTX and its sister firm, Alameda, invested $5.3 billion in 473 companies via their venture capital efforts.\n\nOf this, approximately $3.2 billion was invested across 250 different crypto projects in return for tokens, or token IOUs.\n\nThe list includes major names like Polygon (MATIC), Near (NEAR) and Lido (LDO), as well as 200 or so lesser known projects.\n\nAs FTX administrators look to recoup customer assets, it’s possible that these tokens will be sold off in order to reimburse creditors.\n\nThe latest proposal from FTX's administrators looks to settle bankruptcy proceedings and return funds to creditors by July 2023.\n\nSo any major sell-offs should be expected before this date, and could potentially dampen any fuel added to Bitcoin's rocket by an ETF approval.\n\nThis wouldn't just dampen token prices either.\n\nMost projects rely on the value of their token to fund their on-going development. A sudden devaluation of their treasury would place the future of many projects in peril.\n\nA new lawsuit: Gemini, Genesis and Digital Currency Group sued by New York AG\n\nOn October 19, the New York Attorney General, Letita James, filed a lawsuit against Gemini Trust, Genesis Global Capital and Digital Currency Group (DCG).\n\nThe lawsuit revolves around Gemini's Earn programme, with the three companies accused of defrauding more than 230,000 customers of $1.1 billion.\n\nGemini loaned user funds to Genesis, which is owned by DCG. Genesis then lent these to firms such as Alameda (of FTX fame) and Three Arrows Capital, which later collapsed, leaving $1.1 billion of bad debt that Gemini has been blaming Gensis for ever since.\n\nThe suit alleges that all parties \"falsely claimed\" they had the necessary licenses to operate in New York.\n\nGemini has worked hard to position itself as the victim in this case, with its owners, the Winklevoss Twins, accusing DCG owner Barry Silbert publicly via forums like X (twitter).\n\nThe New York AG is seeking to have Gemini, Genesis and DCG banned from operating in New York and is seeking compensation for the 29,000 New Yorkers affected – approximately 12.5% of the total users.\n\nIf forced to repay this portion of the $1.1 billion owed, DCG may be forced to sell off part of its portfolio of companies.\n\nThese include wholly owned entities like Grayscale Investments, CoinDesk and the Luno exchange. Then there is equity in another 200+ crypto related companies of all shapes and sizes, many of which play critical roles in the wider crypto economy.\n\nIn February this year, there were reports that DCG was forced to sell parts of its portfolio at a steep discount, in order to help fund the hole left by Genesis.\n\nWhile DCG has since sought bankruptcy for Gensis to try and stem the bleeding, the new suite by the NY AG may force DCG to sell off even more of its portfolio and disrupt markets further.\n\nStill a while to go\n\nDespite the excitement around a spot crypto ETF potentially being approved soon in the U.S., cryptocurrency markets still have a lot of skeletons in the closet and hurdles that need to be cleared before the next bull market can take off.\n\nInvestors will want to be wary of unbridled euphoria this time around, and make sure to analyze the bigger picture before going all in on one of the most volatile asset classes in history.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzI4L2JpdGNvaW4tYnV5LXRoZS1kaXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin: Buy the Dip? - The Motley Fool",
        "content": "In the first half of 2023, the surprising turnaround for Bitcoin (BTC -3.18%) was the talk of the crypto industry. Bitcoin skyrocketed right out of the gate, and by mid-July, had nearly doubled in price to $32,000. However, since then, Bitcoin's fortunes have cooled considerably. Bitcoin is trading around $28,000 as of this writing, a nearly 15% haircut from its intra-year high.\n\nSo is now the time to buy the dip on Bitcoin? After all, according to the Bitcoin bulls, the world's most popular cryptocurrency is simply taking a breather before once again marching higher. Are they right or wrong?\n\nChanging investor perceptions\n\nIf you are a long-term crypto investor, the good news is that the long-term outlook for Bitcoin remains largely unchanged. Bitcoin adoption rates worldwide continue to grow, Bitcoin still accounts for nearly 50% of the market cap of the entire crypto industry, and Bitcoin is still the crypto of choice for institutional and retail investors.\n\nThe bad news, though, is that investor perceptions about Bitcoin have changed. For institutional investors, the macroeconomic outlook for the U.S. economy has been front and center, and with so much uncertainty surrounding monetary policy and the future path of interest rates, it's perhaps only natural that Bitcoin has stalled out around the $30,000 level. The conventional wisdom on Wall Street is that risk assets (such as cryptocurrencies) do not perform well in high-interest-rate environments, so the Federal Reserve has emerged as a crucial factor in how investors view Bitcoin.\n\nAt one time, Bitcoin was largely uncorrelated with broader U.S. financial markets, and investors viewed Bitcoin as providing similar hedging benefits as gold. But that viewpoint has been steadily changing. Based on changing correlations between different asset classes, it now appears that Bitcoin is trading much more like a big tech stock. The important point here is that Bitcoin's correlation with other asset classes changes over time, and that influences how investors view Bitcoin.\n\nInstitutional money and Bitcoin\n\nIf there's one factor that can decisively move Bitcoin higher in the near and medium terms, it's the flow of new institutional money into Bitcoin. At one time, institutional investors wouldn't touch Bitcoin with a 10-foot pole. But, oh, how times have changed. The first big break came in August 2022, when BlackRock entered into a partnership with cryptocurrency exchange Coinbase Global to enable institutional access to crypto assets.\n\nSince then, the floodgates have opened. One development that has captured the attention of investors this year is the upcoming introduction of the first-ever spot Bitcoin ETF for the U.S. market. The process started this summer, when BlackRock announced plans for a spot Bitcoin ETF. After that, other high-profile institutional investors -- including Cathie Wood of Ark Invest -- jumped in with spot Bitcoin ETF applications of their own. Once one of these applications is approved, it could lead to a huge new inflow of institutional money into Bitcoin.\n\nBitcoin halving\n\nIn April, Bitcoin will experience another \"halving\" event, in which the reward paid out to cryptocurrency miners for mining a new block of Bitcoin is cut by one-half. In three previous halving cycles (2012, 2016, and 2020), the price of Bitcoin has soared, and many Bitcoin analysts are expecting the same to happen in 2024. While past performance is no guarantee of future performance, it certainly hints at Bitcoin's long-term price potential.\n\nStandard Chartered Bank, for example, is predicting a price of $100,000 for Bitcoin by the end of 2024. And Pantera Capital, a crypto hedge fund, has set a price target of $149,000 for Bitcoin.\n\nThe theory is that the halving, by reducing the rate at which new Bitcoins are created in the future, will introduce a scarcity effect. As long as demand remains constant or increases, the price of Bitcoin should increase.\n\nDollar-cost averaging into Bitcoin\n\nBased on the above, I'm bullish on Bitcoin's future prospects. From my perspective, the only thing that has changed is investor perceptions about Bitcoin. As a result, now could be the perfect time to start dollar-cost averaging into Bitcoin. By buying the same amount of Bitcoin at regular intervals (e.g., once per month), you would limit (but not eliminate) downside risk while also getting access to Bitcoin's enormous upside potential.\n\nIf you are expecting Bitcoin to regain its momentum heading into 2024, then dollar-cost averaging could be an effective strategy to accumulate Bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLW9wdGlvbnMtd29ydGgtNC0xMzMzNTQxNzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Options Worth $4.5 Billion Set To Expire Today - Yahoo Finance",
        "content": "Bitcoin and Ethereum Options Worth $4.5 Billion Set To Expire Today\n\nThe crypto options market is facing a major event today that could lead to increased volatility and shifting prices for major cryptocurrencies like Bitcoin and Ethereum.\n\nAccording to data from Deribit, over $4.5 billion worth of options contracts in Bitcoin and Ethereum are set to expire at 8:00 UTC on Friday, October 27.\n\nOptions give buyers the right but not the obligation to buy or sell an asset at a predetermined price on or before a specific expiration date. As these options reach their expiration date, holders will have to decide whether to exercise their contracts or let them expire worthless.\n\nThis could lead to a spike in trading volume and volatility around the expiration time as market participants react to whether large options positions are exercised or not. CoinDesk reported the current open interest in contract terms has increased to $20.64, significantly higher than in November 2021 when BTC was around $66,000.\n\nThe impending options expiration comes after a period of positive price movement for top cryptocurrencies. Bitcoin rose from around $26,000 to over $34,000 in recent weeks. This market activity led to increased options trading.\n\nTraders and investors will be closely watching the impact of this historic options expiration as it unfolds today. The $4.5 billion in contracts set to expire represents the scale of the crypto options market today, and how it can drive price action and volatility in underlying assets."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vbW9uZXktZmluYW5jZS9iaXRjb2luLWhhbHZpbmctaXMtc29vbi1pcy1ub3ctdGhlLWJlc3QtdGltZS10by1pbnZlc3QvNDYzOTQw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Halving is Soon — Is Now the Best Time to Invest? - Entrepreneur",
        "content": "Opinions expressed by Entrepreneur contributors are their own.\n\nLess than a year is left before the Bitcoin halving — an event when the reward for mining a Bitcoin block will be cut in half. Historically, the halving has been followed by a major bull run in the crypto market. Should we expect the crypto summer soon — and what other factors may push the Bitcoin price up?\n\nRelated: Bitcoin Is Back, Apparently. Here's What's Fueling the Surge.\n\nWhat is Bitcoin halving?\n\nBitcoin supply is limited. No more than 21 million coins will ever exist, and the new ones are only issued to reward miners for running the network. Currently, the size of this reward is 6.25 coins per block — and every four years, it is reduced by half. The 2024 halving, expected in April, will lower the reward to 3.125 BTC.\n\nBitcoin was designed to be scarce: its limited supply protects it from inflation. With the growing demand for the asset, its price must steadily grow — which is exactly what's happening with Bitcoin over the years.\n\nRelated: Why the Next Crypto Bull Run Will Be Like Nothing We've Ever Experienced\n\nThree halvings, three rallies\n\nHistorically, the halving has been followed by a bull run, and Bitcoin has reached new all-time highs within 1–1.5 years after the event. Bitcoin gained 30X following its 2016 halving and 6.5X after the one in 2020. More importantly, the Bitcoin halving makes the entire market soar: in 2020–2021, hundreds of altcoins surged by 1,000%+.\n\nShould we expect the same from the next halving?\n\nWill Bitcoin halving trigger a new rally?\n\nPantera Capital, the world's largest crypto hedge fund, argues that Bitcoin will grow to $148,000 in the new market cycle. The firm emphasizes: \"Bitcoin has historically bottomed 477 days prior to the halving, climbed leading into it, and then exploded to the upside afterward.\" This means that the latest bottom should have been hit in late 2022. If we look at the BTC price chart, we do see the local minimum of $15,490 in November. Bitcoin has historically reached the new ATH within 480 days after the halving.\n\nOther analysts agree that we've already passed the lows of the current cycle. By December 2022, 65% of the pre-halving period was over — the mark usually followed by a few months of a sideways price movement, which eventually ended up in growth.\n\nBitcoin did recover from the local minimum – but failed to keep above $30K this August.\n\nSome forecasts are, however, more restrained. For instance, MacroMicro, an analytical platform that consolidates global economic data, emphasizes the role of macroeconomic factors that may impact the prospective Bitcoin rally.\n\nThree latest post-halving bull runs coincided with a substantial increase in money supply by the USA, EU, China and Japan central banks. In contrast, these financial authorities have been doing the opposite during the last year — rising rates to tackle inflation. The chances that they'll ease the liquidity in the following months seem low.\n\nThe more the money supply grows, the greater BTC price increases.\n\nRelated: Tesla Reports $170 Million Loss in Failed Bitcoin Investment\n\nWhat else can pump Bitcoin?\n\nOne more factor favoring the Bitcoin price might be the approval of Bitcoin ETFs (exchange-traded funds).\n\nAn ETF is a fund that holds a portfolio of certain assets, and its shares are traded on an exchange. The owner of an ETF invests in the fund's portfolio by purchasing a share of it rather than buying the assets themselves.\n\nIn the case of a Bitcoin ETF, the fund owns Bitcoin, and investors can purchase the shares of this fund on an exchange. The value of these shares is tied to the Bitcoin price. For institutional investors, it is easy to embrace the first cryptocurrency — ETFs don't require buying and trading Bitcoin itself, which lets them avoid legal risks. For retail investors, ETFs are an opportunity to quickly diversify their portfolio with cryptocurrency without buying it directly.\n\nBitcoin ETFs are currently allowed in Canada and some other countries. While the USA is considered potentially the largest market for this kind of asset, the SEC has not approved any Bitcoin ETFs in America yet. But if it does, the first cryptocurrency may experience a large spike in trading volume — and, consequently, price.\n\nRelated: 5 Ways to Maintain and Expand Your Wealth During the Cryptocurrency Dip\n\nHow should I prepare for the bull run?\n\nSooner or later, the market will enter the growth phase of the cycle. Led by Bitcoin, it will also make other coins grow by 100%, 500%, and even 1,000% or more.\n\nThis is where picking the right coins to invest in is key. A sure way is doing your research and building up a balanced portfolio — when the market skyrockets, the chance of making gains is high, irrespective of what particular assets are included.\n\nAnother way is to leverage the portfolio composed by professional cryptocurrency researchers using AI tools trained to find the most promising coins. Those portfolios are publicly available as index tokens representing the combined value of multiple coins from different domains of the crypto market.\n\nSome of the index tokens are focused on halving — their purpose is to identify the coins that may demonstrate the most impressive growth in the next bull run. For instance, Bitdriven is an index token representing the value of Bitcoin, Top-10 crypto coins by market cap and many other altcoins from Web3, DeFi and other segments that promise to make gains from 10X to 15X after April 2024.\n\nThe data from different years demonstrates that Bitcoin gains less and less value in terms of Xs after each bull run. Whether you leverage index tokens or not, picking the right altcoins will be the key to making your best returns in 2024."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnVzZnVuZHMuY29tL3Jlc291cmNlL3RoZS1yYWNlLWZvci10aGUtZmlyc3QtdS1zLXNwb3QtYml0Y29pbi1ldGYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "The Race for the First U.S. Spot Bitcoin ETF - U.S. Global Investors",
        "content": "It’s not a matter of if, but when.\n\nI’m talking, of course, about the long-awaited approval of a U.S.-based spot Bitcoin exchange-traded fund (ETF). Analysts at Bloomberg Intelligence now estimate there’s a 90% chance that the Securities and Exchange Commission (SEC) will give the go-ahead to such an investment product by January 10, 2024.\n\nMany presenters at this week’s European Blockchain Convention (EBC) were even more optimistic, saying they believe a Bitcoin ETF will appear on the market by the end of this year.\n\nMr. Market appears to agree. Responding to strong speculation that BlackRock, the world’s largest investment management firm, is preparing to “seed” its iShares Bitcoin ETF this month with an unknown amount of capital in anticipation of its imminent approval, investors bid up the price of the digital asset this week to more than $35,000, a price we haven’t seen in nearly a year and a half. That’s roughly double what Bitcoin started the year at. For comparison’s sake, Ether, the second largest digital token by market cap, is up around 50% year-to-date.\n\nInvestors Seeking Direct Access to Bitcoin\n\nSpot Bitcoin ETFs are already available to certain investors. Canada has had them for years. Europe launched its first one in August. But even when combined, Canada and Europe are dwarfed by the size of the U.S. stock market, which accounts for close to 60% of the total global equity market value. Of the top 10 largest investment management firms, only two—France’s Credit Agricole and Germany’s Allianz—are non-American.\n\nTo date, the only way for U.S. investors to get exposure to Bitcoin—besides buying the asset outright—is through futures, options and other derivatives. The largest of these products, the Grayscale Bitcoin Trust (GBTC), has been trading publicly since 2015 and currently has over $21 billion in assets under management (AUM).\n\nBut trusts are unwieldy products compared to ETFs, which are traded on exchanges throughout the day and can be highly liquid.\n\nPlus, investors want access to spot Bitcoin prices, just as they have access to spot gold prices with physical gold-backed ETFs.\n\nGrayscale knows all of this, of course, which is why it’s filed to convert GBTC to an ETF. And now, like BlackRock and a number of other firms that have also submitted applications for a Bitcoin ETF—they include Fidelity, Invesco, Franklin Templeton, VanEck and WisdomTree—Grayscale must play the waiting game at a time when many market experts are concerned that the U.S. could be falling behind other jurisdictions when it comes to Bitcoin investment, not to mention regulation.\n\nSome firms are choosing to act now. Cathie Wood’s ARK Invest, which also has a Bitcoin ETF in the pipeline, has begun selling shares of GBTC in anticipation of its successful conversion into an ETF.\n\nUnderstanding the Impact of a U.S. Spot ETF\n\nSo what are the implications?\n\nAssuming for the moment that the SEC is in fact ready to give its blessing to a BlackRock-issued Bitcoin ETF, it’s possible we may never see the token below $30,000 again. In such a scenario, the New York-based investment firm would likely become the world’s largest institutional holder of Bitcoin, creating a potential supply crunch. Remember, Bitcoin production is capped at 21 million, and the “halving”—when the reward for mining Bitcoin is cut in half—is coming up in around six months.\n\nThe availability of a Bitcoin ETF would also finally herald the arrival of institutional investors. For many financial advisors, fiduciaries and others, Bitcoin is not an approved wealth management strategy. A spot ETF, on the other hand, would be.\n\nAccording to estimates made by blockchain and digital asset company Galaxy, a U.S.-based spot Bitcoin ETF would attract $14 billion in investor inflows in the first year alone. This would accelerate to $27 billion in the second year and, at the end of the third year following its launch, nearly $40 billion.\n\nThis is only an estimate, and no one can predict the future with absolute certainty. But for speculators, accumulating Bitcoin now—before an ETF hits the U.S. market—may end up being a very profitable decision.\n\nCertainty in an Uncertain World\n\nI’m pleased to report that enthusiasm was very high at the ECB, held in beautiful Barcelona. It was the most well-attended event in the conference’s history, with some 5,000 people in attendance—double the turnout from earlier this year.\n\nDespite it being a blockchain/Web3/DeFi conference, Bitcoin was the $35,000 gorilla in the room. As a number of presenters said, the asset offers certainty in a highly uncertain world. This tracks with my recent comments that Bitcoin represents private property rights and, more broader, human rights.\n\nWith a spot ETF looking more and more likely, now could be an unprecedented opportunity to get exposure. Remember, however, to do your own due diligence and keep in mind that volatility is much greater than what you find in traditional investment instruments. For that reason, I recommend a weighting of no more than 2% of your total portfolio.\n\nIndex Summary\n\nThe major market indices finished down this week. The Dow Jones Industrial Average lost 2.14%. The S&P 500 Stock Index fell 2.67%, while the Nasdaq Composite fell 2.62%. The Russell 2000 small capitalization index lost2.76% this week.\n\nThe Hang Seng Composite gained 1.49% this week; while Taiwan was down 1.86% and the KOSPI fell 3.04%.\n\nThe 10-year Treasury bond yield fell 7 basis points to 4.837%.\n\nAirlines and Shipping\n\nStrengths\n\nThe best performing airline stock for the week was SkyWest, up 13.1%. SkyWest reported earnings per share (EPS) of $0.55, better than Visible Alpha’s consensus of $0.39. The beat versus consensus was driven by better-than-expected revenue. The company introduced fourth quarter block hour production guidance of flat-to-down slightly sequentially or up 2% year-over-year. This implies fiscal year 2023 block hours down 9% year-over-year, ahead of prior expectations of down 11%.\n\nAccording to Bank of America, air cargo freight rates bottomed in early September and have sequentially moved higher, sustaining at 30%-35% above 2019 levels in the past month. The bank attributes the uptick to demand seasonality around the end-of-year peak as well as the imposition of fuel surcharges given rapid moves higher in jet fuel in the third quarter.\n\nIAG reported third quarter operating profit before the exceptional items of €1,745 million, 12% ahead of company consensus, which had been revised up following first half of the year results. The beat relative to consensus was driven by lower non-fuel unit costs (-3.5%) and better yields (up 2% year-over-year).\n\nWeaknesses\n\nThe worst performing airline stock for the week was Frontier, down 10.5%. Hawaiian Air reported an adjusted loss per share of ($1.06), worse than FactSet’s consensus of ($0.94). The miss versus consensus was driven by worse revenue and non-operating costs. Near-term revenue trends are being pressured by the negative impact of the Maui wildfires and accelerating industry capacity growth to Japan where demand is still recovering, while near-term unit cost growth is higher-than-expected due to an elevated number of aircraft on the ground.\n\nAccording to Morgan Stanley, weekly container spot rates confirm a downtrend while quarterly results from overseas firms also reveal guidance cuts and anticipated container losses. Consensus forecasts have not sufficiently factored in prospects of a net loss at Ocean Network Express (ONE), but expectations are falling.\n\nVolaris reported another challenging quarter, missing Bloomberg consensus estimates on the operating and bottom-line levels. The top line was at $848 million (up 10% year-over-year), nearly in line with consensus. Net income came in at -$39 million, below the Street at $2 million.\n\nOpportunities\n\nAccording to UBS, the latest UBS Evidence Lab Global Travel Manager Survey sheds light on expected business behavior in 2024 and beyond and still suggests business traffic recovery. Most travel managers see budget increases next year with on-average travel budgets expected to increase by 10% year-over-year and most expect a full recovery of travel budgets back to 2019 in the next two years.\n\nAccording to Stifel, over the course of the past 30 years, after adjusting for inflation and operating costs, the cash-on-cash return of a one-year time charter contract relative to the price of a new ship was 10% for a VLCC and 11% for a Capesize vessel. Currently, newbuild prices are 23% higher than the 20-year average for VLCCs and 26% higher for Capesize vessels. For a scrubber fitted VLCC and Newcastlemax (slightly larger modern version of a Capesize) the adjusted returns are 11.5% and 6.5%. This implies fewer ships will be added in the future.\n\nMedia is reporting that in response to increased fuel prices, Qantas is increasing fares by an average of 3.5%. Qantas Group had absorbed recent fuel hikes but according to a company spokesman, the current tensions in the Middle East, broader economic factors and a weaker Australian dollar means that fuel prices are expected to stay elevated for some time. Even after the adjustment, the fares are expected to remain below the peaks of last year.\n\nThreats\n\nMorgan Stanley believes there is a mounting risk of weakening pricing in long haul markets such as the Atlantic and Europe-Middle East Africa next year, with capacity scheduled to accelerate materially in these markets through winter.\n\nAccording to Bank of America, air cargo supply continues to grow around 10% year-over-year with surging belly capacity on international flight restoration and limited supply discipline from freighters for now. The bank sees more pressure ahead from further restoration of passenger flights in the upcoming winter 2023-2024 season, while freighter supply discipline could remain elusive until rates turn loss-making, particularly with new freighters getting delivered.\n\nAccording to Morgan Stanley, Spirit Airlines had the highest percentage of cancelations occurring over the past week at 4.5% of scheduled flights (compared to 0.1% the prior week). Spirit saw a jump in cancelations due to “a necessary inspection of a small section of 25 of our aircraft,” which will be out of service for several days. The airline noted the inspection was due to an abundance of caution and expects the network will take several days to recover.\n\nLuxury Goods and International Markets\n\nStrengths\n\nHermes reported a revenue increase of 16% in the third quarter. Sales in the United States and Europe were strong due to high demand for the costly Birkin and Kelly handbags. Growth in America topped estimates, while the performance in Asia Pacific, excluding Japan, was in line, reports Bloomberg.\n\nThe U.S. continues to report solid economic data. The Manufacturing PMI and Service PMI came in stronger than expected. The Preliminary Manufacturing PMI for October was reported at 50 versus the expected 49.5. The Service PMI climbed to 50.9, above the expected 49.9. Annualized GDP for the third quarter was released at 4.9%, above the expected 4.5%.\n\nDeckers, a footwear designer and distributor, was the best performing S&P Global Luxury stock, gaining 15.7% in the past five days. Shares gained almost 20% on Friday after the company reported strong quarterly sales. Deckers reported $6.82 earnings per share in the quarter, compared with $3.80 a share, in the same period a year ago.\n\nWeaknesses\n\nAll Kering brands reported a revenue drop in the third quarter except eyewear. The company’s biggest brand, Gucci, reported a 7% decline in revenue, below the expected drop of 6.21%. Sales at Yves Saint Laurent slid 12% last quarter and sales at Balenciaga fell 15%, both missing estimates. The group sales declined 9%, missing estimates.\n\nThe preliminary Eurozone Manufacturing PMI for October was reported at 43.0, below the expected reading of 43.7, and September’s 43.4. In the past 20 years, Manufacturing PMI dipped to the low 30 level twice: in 2020 due to the COVID-19 pandemic and in 2008 due to the global recession.\n\nSleep Number, a U.S. mattress maker and wellness technology leader, was the worst performing S&P Global Luxury stock, losing 17.5% in the past five days. On Friday, shares closed at a 52-week low on a light news flow. The prior week, Sleep Number was the best performing name among the luxury index members.\n\nOpportunities\n\nBank of America’s luxury research team recommends selecting names within luxury sectors that are exposed to more affluent customer bases like Louis Vuitton, Hermes, Cucinelli, and Zegna. The super-rich are less affected by the economic downturn and will most likely continue to spend their wealth on luxury goods and services.\n\nChina announced measures to support its economy this week. The government approved CNY 1 trillion ($139.3 billion) in additional government bond issuance for disaster relief and reparations. Proceeds are to be transferred to local governments with half to be used this year. In addition, China lifted its 2023 budget deficit to around 3.8% of gross domestic product from an originally set 3%. Economists expect rate cuts to follow.\n\nAccording to a report released by global consultancy firm Kearny and beauty e-commerce platform Luxasia, South Asia and India are poised to be the next “gold rush” markets for luxury beauty. The report estimated that the two regions together will increase in size from $4.5 billion in 2021 to $12.7 billion in 2031, growing at a CAGR (cumulative annual growth rate) of 11%, compared to the estimated global luxury beauty industry growth rate of 4-6%.\n\nThreats\n\nAccording to Bank of America, in the United States, luxury spending relative to 2019 has peaked in the first quarter of 2022. The chart below shows seven quarters of acceleration in card spending, and so far, six quarters of corrections. BofA predicts luxury revenue growth to trough in the first quarter of 2024.\n\nThe European Central Bank is determined to bring inflation lower to its target of 2%, but this week the bank has decided to keep rates on hold after 10 consecutive hikes. The pause follows a slowdown in euro-are prices, but concerns are mounting that a recession could be coming to the region. If the Israel-Hams conflict worsens, this could result in higher energy prices.\n\nChris Watling, chief executive of financial advisory firm Longview Economics, warned that consumers are quickly running out of excess cash, while household savings are coming under pressure. Many strategists, asset managers, and CEOs remain concerned about the longer-term economic outlook, worrying about the United States falling into recession.\n\nEnergy and Natural Resources\n\nStrengths\n\nThe best performing commodity for the week was natural gas, rising 9.14%, partly on short covering prior to contract expiring at the end of the week and a slightly colder weather forecast. Chevron Corp. said it will no longer use put options to hedge the crude oil production it is acquiring from Hess Corp. once the deal is complete. Hess is one of a handful of major U.S. oil players that still participates in the options market to guarantee a minimum price for its barrels. In its most recent earnings report, published in July, the company had contracts in place that locked in $70 a barrel for about 80,000 barrels a day of WTI production, and $75 for about 50,000 barrels of Brent production for the rest of this year.\n\nAccording to RBC, uranium spot prices rebounded back near recent highs as activity picked up during the week, with a pick-up in financial/company buying and utility interest. On the news front, Euratom released its 2022 Annual Supply report which highlighted a projected moderate increase in uranium requirements and a decrease in inventories, while uranium requirements in the EU are generally covered by contracts through 2025.\n\nAccording to Bank of America, the Department of the Treasury’s Office of Foreign Assets Control (OFAC) authorized transactions in Venezuela’s oil and gas sector including production, lifting, sale and exportation of oil and gas (including provision of related services and payment of invoices). The licenses authorizing such transactions are valid through April 2024. The authorizations follow agreements between the government and the opposition to hold free elections on the second half of 2024. The licenses will be renewed only if Venezuela meets its commitments under the electoral roadmap as well as other commitments with respect to those who are wrongfully detained.\n\nWeaknesses\n\nThe worst performing commodity for the week was crude oil, dropping 3.33%, likely in response to dropping oil sanctions on Venezuela. Oil also fell amid signs Israel is rethinking the scope of a potential invasion of Gaza, at least temporarily containing the conflict in the Middle East. West Texas Intermediate fell below $86 a barrel in a volatile session that saw prices swing in a more than $2 range. Israel appeared to hold off on its widely expected ground offensive into the Gaza Strip to buy time for the release of hostages held by Hamas.\n\nA federal judge has rejected an argument by 34 coal-fired power plant owners and operators that they were not aware of five patents for a mercury-removal process before Midwest Energy Emissions Corp. sued alleging infringement. Midwest says the defendants are liable for induced and contributory infringement of certain method claims of the asserted patents by manufacturing and selling refined coal to non-party power plants.\n\nAccording to UBS, steel prices in Europe have continued to fall in October, with steel prices down €15/ton to €645/ton in Germany (the lowest level since 2020). Confidence in EU demand strength remains low and ordering activity at domestic mills subdued, in part due to the arrival of large volumes of imported steel.\n\nOpportunities\n\nChina is planning to boost its strategic stockpiles of cobalt, according to people familiar with the matter, just three months after the government last bought the metal used in everything from electric-vehicle batteries to aerospace alloys. The National Food and Strategic Reserves Administration, which manages the state’s commodity stockpiles, has agreed to buy about 3,000 tons of cobalt, said the people, who are not authorized to speak publicly.\n\nChina is planning to boost its strategic stockpiles of cobalt, according to people familiar with the matter, just three months after the government last bought the metal used in everything from electric-vehicle batteries to aerospace alloys. The National Food and Strategic Reserves Administration, which manages the state’s commodity stockpiles, has agreed to buy about 3,000 tons of cobalt, said the people, who are not authorized to speak publicly.\n\nSQM increased its bid for Azure Minerals to $3.52, ~A$1.6Bn, up 46% from its previous bid of $2.41. Azure stock was ~$1.70 prior to the original SQM bid in July. The current bid = +100% premium, where Azure was trading prior to the original approach. However, that bid may face some headwinds as Gina Rinehart’s Hancock Prospecting has acquired 18% of Azure. SQM can pull out of the proposed transaction if another shareholder acquires more than 19%. Albermale Corp. was trying to buy Liontown Resources Ltd. but Rinehart blocked that transaction too.\n\nThreats\n\nCopper has gone from jump to slump this year as enthusiasm about China’s reopening gave way to concerns over demand, ballooning stockpiles, and pricing patterns that speak to abundant, near-term supply. Benchmark three-month futures on the LME just sank to the lowest since last November and, absent a run of micro-evidence suggesting conditions are bottoming out, the bias will remain for further weakness into the year-end. At present, cash metal trades well below futures, known as contango.\n\nAccording to Morgan Stanley, steel global output came in below its five-year average as production declined in China (-6% year-over-year), while it rose sequentially on day-adjusted basis due to Europe and Iran. Morgan Stanley sees further downside to production run-rates, largely driven by China’s seasonal slowdown and Europe’s accelerating capacity cuts.\n\nRussia’s oil flows are climbing steadily as Moscow’s adherence to a pact with Saudi Arabia to keep barrels off the global market shows signs of waning. About 3.53 million barrels a day of crude was shipped from Russian ports in the week to October 22, an increase of 20,000 barrels a day from the previous seven days, tanker-tracking data monitored by Bloomberg show. That lifted the less volatile four-week average to 3.5 million barrels a day, the highest since June, and up by about 610,000 barrels a day in the past two months.\n\nBitcoin and Digital Assets\n\nStrengths\n\nOf the cryptocurrencies tracked by CoinMarketCap, the best performer for the week was FLOKI, rising 84.97%.\n\nBitcoin surged above $31,000 for the first time since July as a U.S. federal appeals court made final a ruling that effectively clears the way for the issuance of an exchange traded fund (ETF) that invests directly in the cryptocurrency, writes Bloomberg.\n\nDeclining national fiat currencies and a generally unstable economy have helped propel Bitcoin to all-time high prices in Turkey and Nigeria, despite the asset trading 50% below its peak in U.S. dollar terms. Recent price surges have caused Bitcoin to cross price peaks against the Turkish lira and Nigerian naira, according to Bloomberg.\n\nWeaknesses\n\nOf the cryptocurrencies tracked by CoinMarketCap, the worst performer for the week was Bitcoin SV, down 13.40%.\n\nBitcoin faces a reality check if ETFs spark a ‘sell-the-new’ pivot. Chart patterns hint that the Bitcoin rally has become stretched, and the founder of Venn Link Partners expects short-term selling if U.S. spot Bitcoin ETFs are approved, writes Bloomberg.\n\nBitcoiners might be excited, but Grayscale’s proposal to turn its Bitcoin trust into an ETF still needs a green light from the SEC, and that is not a sure thing. SEC Chair Gary Gensler could still find a second reason to deny the proposal after choosing not to appeal a court ruling striking down his first one, writes Bloomberg.\n\nOpportunities\n\nJPMorgan Chase’s digital token, JPM Coin, now handles $1 billion worth of transactions daily and the bank plans to continue widening its usage. JPM Coin enables wholesale clients to make dollar and euro-denominated payments through a private blockchain network, according to Bloomberg.\n\nShares of Coinbase may move 9% higher after the company reports earnings, according to options data compiled by Bloomberg.\n\nTaiwan has officially proposed a draft crypto act for the first reading. The proposal to regulate crypto assets passed the first reading at the Legislative Yuan. It would require all crypto platforms operating in Taiwan to apply for a permit, writes Bloomberg.\n\nThreats\n\nSam Bankman-Fried will take the stand to defend his actions in the lead-up to the collapse of his digital asset empire. This comes after taking a beating from former colleagues who described him as the mastermind of a years long scheme to defraud FTX customers and investors, writes Bloomberg.\n\nBinance is experiencing technical issues with crypto withdrawals, it said in a post on X and withdrawals will be temporarily unavailable, writes Bloomberg.\n\nCrypto platform Gemini Trust is suing bankrupt crypto lender Genesis Global Holdco LLC in an attempt to determine who rightfully owns a slug of shares in the Grayscale Bitcoin Trust, now worth nearly $1.6 billion, writes Bloomberg.\n\nGold Market\n\nThis week gold futures closed at $2,016.20, up $21.80 per ounce, or 1.09%. Gold stocks, as measured by the NYSE Arca Gold Miners Index, ended the week lower by 1.27%. The S&P/TSX Venture Index came in off just 0.04%. The U.S. Trade-Weighted Dollar rose 0.37%.\n\nStrengths\n\nThe best performing precious metal for the week was palladium, up 1.78%. U.S. stocks are in their third monthly decline while underwhelming corporate earnings and yields climbing above 5% have investors pondering their choices. When other assets don’t look so safe, gold may find a more welcome buyer. As of Friday afternoon, gold is up more than 10% year-to-date and the S&P 500 is now up only 7%. Russia saw gold production drop 9.2% year-on-year and 4.1% month-on-month in September 2023, the Federal State Statistics Service (Rosstat) said in a statement. Despite the declining monthly data, the overall volume of domestic gold production rose 1.7% for the first nine months of this year.\n\nEldorado Gold reported earnings per share (EPS) of $0.17, well above consensus of $0.04, partially driven by better-than-expected costs across the portfolio. Third quarter production of 121,000 ounces gold was pre-released, with higher quarter-over-quarter production, while consolidated AISC of $1,177 per ounce was 21% below consensus AISC of $1,486 per ounce.\n\nAlamos reported third quarter adjusted EPS of $0.14, above the consensus of $0.12. Production of 135,400 ounces at total cash costs of $835 per ounce and AISC (all-in sustaining costs) of $1,121 per ounce beat consensus by 12%, 4%, and 7% respectively, driven by continued outperformance at Mulatos. The company has increased its fiscal year 2023 production guidance from 480-520,000 ounces gold to 515-530,000 ounces gold and reiterated its cost guidance with AISC of $1,125-$1,175 per ounce.\n\nWeaknesses\n\nThe worst performing precious metal for the week was silver, down 1.34%. According to Morgan Stanley, gold ETF holdings are now at the lowest level since early 2020 with nearly continuous outflows since April 2022. This shows the challenge of gold as an investment when bond yields are rising, as it struggles to compete in portfolios as a non-yielding asset.\n\nGold edged lower as benchmark Treasury yields hit the highest since 2007 while fears of a spiraling conflict in the Middle East receded. The yield on 10-year U.S. bonds topped 5% on Monday for the first time in 16 years, driven by expectations the Federal Reserve will keep monetary policy tight for a long period. That is typically negative for bullion, which bears no interest.\n\nOceanaGold reported third quarter production of 99.0 k ounces gold, below the 104.1 k ounce consensus and AISC of $1,911 per ounce gold above the $1,757 per ounce consensus. Adjusted EPS for the quarter was $0.00, missing the consensus estimate of $0.03. Concurrently, OceanaGold updated its fiscal year 2023 cost guidance, increasing forecasted cash cost by $50 per ounce to a range of $850 – $950 per ounce, while AISC by $125 per ounce to a range of $1,550 – $1,650 per ounce, reflecting the impact of lower production from Haile.\n\nOpportunities\n\nGold priced in Swiss francs shows that the precious metal could sustain its upward momentum should geopolitical tensions persist. The Swiss franc and gold have seen a surge in demand as haven assets amid the turmoil in the Middle East. Gold has gained more than 8% against the dollar so far in 2023, while the Swiss franc has appreciated by more than 3%, solidifying its position as the leading performer among G-10 currencies.\n\nAccording to recent data from the U.S. Treasury, Chinese investors sold $21.2 billion of U.S. assets in the month of August. Chinese investors may be among the first to direct their funds to gold markets. There are two main theories about the reasons of China’s rapid selling of U.S. assets. First, the Asian nation needs to support the local currency. The second potential reason for China’s activity lies in the realm of geopolitics.\n\nWheaton Precious Metals has entered into a definitive Precious Metal Purchase Agreement with Waterton Copper Corp. on its 100% owned Mineral Park Mine located in Arizona, USA. Wheaton will pay Waterton total upfront cash consideration of $115M in four payments during construction (three installments of $25M and a final installment of $40M) with construction to be completed by the end of the first quarter of 2025. Under the stream, Wheaton will purchase 100% of the payable silver from the project for the life of the mine.\n\nThreats\n\nBitcoin continues to gain ground, taking bullish cues from traditional rate-sensitive assets like gold. Prices are up 14% for the month, with gold registering a much lesser 6.7% gain. Gold, however, picked up a bid a week before Bitcoin, as the outbreak of tensions between Israel and Hamas, alongside continued speculation about the end of the Fed tightening cycle, signaled an inflationary regime ahead.\n\nPanama’s labor unrest surrounding First Quantum’s new contract to operate its copper and gold mine is still facing challenges. Protests have broken out and now Panama’s Supreme Court noted it will consider a lawsuit which alleges the nation’s contract violates their constitution. Frano-Nevada Corp. has the most exposure to First Quantum through its royalty on the gold production. Regardless of the outcome, Panama makes itself look unsuitable for new mining investment currently.\n\nSibanye Stillwater Ltd. said it will enter talks with labor unions over the possible restructuring at some of its South African platinum group mines that could affect more than 4,000 workers. The consultations will concern four shafts – two of which have reached the end of their producing lives – at the company’s Rustenburg, Marikana and Kroondal projects, the Johannesburg- based firm said in a statement.\n\nU.S. Global Investors, Inc. is an investment adviser registered with the Securities and Exchange Commission (“SEC”). This does not mean that we are sponsored, recommended, or approved by the SEC, or that our abilities or qualifications in any respect have been passed upon by the SEC or any officer of the SEC.\n\nThis commentary should not be considered a solicitation or offering of any investment product. Certain materials in this commentary may contain dated information. The information provided was current at the time of publication. Some links above may be directed to third-party websites. U.S. Global Investors does not endorse all information supplied by these websites and is not responsible for their content. All opinions expressed and data provided are subject to change without notice. Some of these opinions may not be appropriate to every investor.\n\nHoldings may change daily. Holdings are reported as of the most recent quarter-end. The following securities mentioned in the article were held by one or more accounts managed by U.S. Global Investors as of (09/30/2023):\n\nHawaiian Holdings\n\nQantas Airways\n\nHermes\n\nKering\n\nEldorado Gold\n\nAlamos Gold\n\nWheaton Precious Metals\n\nOceanaGold\n\nFranco-Nevada Corp.\n\nSibanye Stillwater\n\n*The above-mentioned indices are not total returns. These returns reflect simple appreciation only and do not reflect dividend reinvestment.\n\nThe Dow Jones Industrial Average is a price-weighted average of 30 blue chip stocks that are generally leaders in their industry. The S&P 500 Stock Index is a widely recognized capitalization-weighted index of 500 common stock prices in U.S. companies. The Nasdaq Composite Index is a capitalization-weighted index of all Nasdaq National Market and SmallCap stocks. The Russell 2000 Index® is a U.S. equity index measuring the performance of the 2,000 smallest companies in the Russell 3000®, a widely recognized small-cap index.\n\nThe Hang Seng Composite Index is a market capitalization-weighted index that comprises the top 200 companies listed on Stock Exchange of Hong Kong, based on average market cap for the 12 months. The Taiwan Stock Exchange Index is a capitalization-weighted index of all listed common shares traded on the Taiwan Stock Exchange. The Korea Stock Price Index is a capitalization-weighted index of all common shares and preferred shares on the Korean Stock Exchanges.\n\nThe Philadelphia Stock Exchange Gold and Silver Index (XAU) is a capitalization-weighted index that includes the leading companies involved in the mining of gold and silver. The U.S. Trade Weighted Dollar Index provides a general indication of the international value of the U.S. dollar. The S&P/TSX Canadian Gold Capped Sector Index is a modified capitalization-weighted index, whose equity weights are capped 25 percent and index constituents are derived from a subset stock pool of S&P/TSX Composite Index stocks. The NYSE Arca Gold Miners Index is a modified market capitalization weighted index comprised of publicly traded companies involved primarily in the mining for gold and silver. The S&P/TSX Venture Composite Index is a broad market indicator for the Canadian venture capital market. The index is market capitalization weighted and, at its inception, included 531 companies. A quarterly revision process is used to remove companies that comprise less than 0.05% of the weight of the index, and add companies whose weight, when included, will be greater than 0.05% of the index.\n\nThe S&P 500 Energy Index is a capitalization-weighted index that tracks the companies in the energy sector as a subset of the S&P 500. The S&P 500 Materials Index is a capitalization-weighted index that tracks the companies in the material sector as a subset of the S&P 500. The S&P 500 Financials Index is a capitalization-weighted index. The index was developed with a base level of 10 for the 1941-43 base period. The S&P 500 Industrials Index is a Materials Index is a capitalization-weighted index that tracks the companies in the industrial sector as a subset of the S&P 500. The S&P 500 Consumer Discretionary Index is a capitalization-weighted index that tracks the companies in the consumer discretionary sector as a subset of the S&P 500. The S&P 500 Information Technology Index is a capitalization-weighted index that tracks the companies in the information technology sector as a subset of the S&P 500. The S&P 500 Consumer Staples Index is a Materials Index is a capitalization-weighted index that tracks the companies in the consumer staples sector as a subset of the S&P 500. The S&P 500 Utilities Index is a capitalization-weighted index that tracks the companies in the utilities sector as a subset of the S&P 500. The S&P 500 Healthcare Index is a capitalization-weighted index that tracks the companies in the healthcare sector as a subset of the S&P 500. The S&P 500 Telecom Index is a Materials Index is a capitalization-weighted index that tracks the companies in the telecom sector as a subset of the S&P 500.\n\nThe Consumer Price Index (CPI) is one of the most widely recognized price measures for tracking the price of a market basket of goods and services purchased by individuals. The weights of components are based on consumer spending patterns. The Purchasing Manager’s Index is an indicator of the economic health of the manufacturing sector. The PMI index is based on five major indicators: new orders, inventory levels, production, supplier deliveries and the employment environment. Gross domestic product (GDP) is the monetary value of all the finished goods and services produced within a country’s borders in a specific time period, though GDP is usually calculated on an annual basis. It includes all private and public consumption, government outlays, investments and exports less imports that occur within a defined territory.\n\nThe S&P Global Luxury Index is comprised of 80 of the largest publicly traded companies engaged in the production or distribution of luxury goods or the provision of luxury services that meet specific investibility requirements.\n\n\n\n"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWFsbC10aW1lLWhpZ2hzLWFjcm9zcy1hcmdlbnRpbmEtbmlnZXJpYS10dXJrZXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price hits all-time highs across Argentina, Nigeria and Turkey - Cointelegraph",
        "content": "The price of Bitcoin (BTC) has notched new all-time highs against some of the world’s most inflationary fiat currencies.\n\nAcross 30 hours over Oct. 23 to 24, the cost of buying one Bitcoin has reached all time-highs when using the Argentine peso, Nigerian naira, Turkish lira, Laotian kip and the Egyptian pound.\n\n#Bitcoin just hit an all-time high in Argentina, Turkey and Nigeria. pic.twitter.com/sKRNUaBMX8 — Miles Deutscher (@milesdeutscher) October 26, 2023\n\nHowever, it should be noted that the result is due to the ongoing devaluation of the currencies, exacerbated by Bitcoin’s recent 16% price increase.\n\nThe naira and lira fell to their lowest points against the United States dollar on Oct. 24 and Oct. 25, while the peso is only 0.85% off its all-time low (against the U.S. dollar).\n\nAccording to the International Monetary Fund (IMF), the Venezuelan bolivar currently has the highest annual inflation rate at 360%, followed by the Zimbabwean dollar (314%), Sudanese pound (256%) and the Argentine oesi (122%).\n\nThe Turkish lira and Nigerian naira came in sixth and 15th with annual inflation rates of 51% and 25%, respectively, IMF’s data shows.\n\nHeat map of countries in the world with corresponding annual inflation rates. Source: IMF\n\nCrypto observers have long seen digital assets, such as Bitcoin and stablecoins, as a hedge against rocketing inflation — and recent figures could bolster that narrative.\n\nNigeria, Turkey and Argentina boast the second, 12th and 15th highest rates of cryptocurrency adoption worldwide, according to a Sept. 12 report by Chainalysis.\n\nWith inflation at 99% in #Argentina, it’s 99% likely that the citizens of that beautiful country would benefit from #Bitcoin. — Michael Saylor⚡️ (@saylor) February 15, 2023\n\nHowever, the governments of these countries haven’t always seen eye-to-eye with the cryptocurrency industry.\n\nNigeria is finally becoming more welcoming to cryptocurrencies after its central bank banned local banks from providing services to cryptocurrency exchanges in February 2021.\n\nProgress was made in December 2022 when Nigeria announced its intention to pass a bill recognizing cryptocurrencies as “capital for investment,” citing the need to keep up with “global practices” as one of the main reasons behind its change in stance.\n\nAnd while Turkey is home to some of the most crypto-curious people, its central bank banned cryptocurrency payments for goods and services in April 2021. It has also been working on a central bank digital currency (CBDC) to digitalize the Turkish lira in recent years.\n\n#Bitcoin fixes this\n\nI'm back in my beautiful country, Turkey, after 6 months. Shocked to witness the same goods costing 3–4 times more already. Rents, food, public transport, and more costs skyrocket regularly. High inflation's devastation is real and alarming. pic.twitter.com/X4N4Axuh1n — Gülben Gözü (@gulbengozu) August 28, 2023\n\nMeanwhile, Argentina’s inflation crisis could be influenced by the outcome of its presidential election in November, with presidential candidate Javier Milei set to face competitor Sergi Massa in a final run-off vote on Nov. 19.\n\nRelated: Turkey to use blockchain-based digital identity for online public services\n\nMassa, who currently serves as the country’s minister of economy, wants Argentina to launch a CBDC “as soon as possible” to “solve” the country’s long-lasting inflation crisis.\n\nArgentina's present provides a glimpse into America's future, where the central bank raised interest rates 15 percentage points to 133% on Oct. 12. But with #inflation running at 138% and budget deficits and debt rising, the rate hikes will have no effect on reducing inflation. — Peter Schiff (@PeterSchiff) October 26, 2023\n\nHe has also voiced an intention to keep the U.S. dollar away from Argentinians, explaining that Argentinians should instead be “patriots” and defend the Argentine peso.\n\nMilei, on the other hand, wants the U.S. dollar to be adopted in addition to abolishing Argentina’s central bank.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzcwNGZiMmE3LTAwZTktNDY5Yi04ODkyLTgxMTc1MzRjYjhmM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "CryptoFinance: Cultures clash as bitcoin ETF turns rebellion into money - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the latest edition of the FT’s Cryptofinance newsletter.\n\n“The Times 03/Jan/2009: Chancellor on brink of second bailout for banks.”\n\nIn the early days of 2009, bitcoin’s pseudonymous creator Satoshi Nakamoto etched that headline into the first batch of bitcoin transactions ever processed.\n\nThe message was a nod to bitcoin’s intended purpose, as laid down in the initial white paper: a form of electronic cash that offered people the chance to separate their financial lives from the control of powerful intermediaries such as banks, regulators or the government.\n\nCrypto’s confident, scornful and punky start came to mind this week for some when bitcoin surged to roughly $35,000. It was a small but meaningful moment: all those losses sustained after the Terra stablecoin collapsed and sent a whole heap of trouble pulsing through the market were erased.\n\nBut what triggered the gains was, well, nothing very much.\n\nThe market is on tenterhooks so much because BlackRock, the world’s largest asset manager, may soon receive regulatory approval in the US to launch a cash bitcoin exchange traded fund, something that invests directly in bitcoin and can be traded as easily on the New York Stock Exchange as Apple.\n\nBut this has been the case for months and the approvals may not come until next year. What seemed to have got bitcoin enthusiasts excited was BlackRock’s ETF added to a list of eligible assets that are held at the US securities clearing house.\n\nThis is the equivalent of a harried waiter in a crowded restaurant clearing a table, before ushering you over; a necessary step but it doesn’t mean you’re going to eat imminently.\n\nNor was the spike an isolated incident. Last week bitcoin leapt 8 per cent on a false rumour that BlackRock had indeed secured regulatory approval.\n\nThe assumption is that approval will inspire a new wave of inflows into a market that has long struggled with next to no liquidity.\n\nAs Jeremy Senderowicz of law firm Vedder Price told me: “To have an ETF launch necessarily represents the maturation of an asset class: it’s a sign that it has arrived in the format that anyone can access . . . you would think that could only be a good thing for crypto.”\n\nBut good news for Wall Street’s crypto-curious is not being welcomed everywhere. Crypto’s longtime believers, who have followed bitcoin’s development since the early days, tell me a financial revolution is being traded in for a spot on Wall Street.\n\n“It’s a maddening betrayal of crypto’s foundational principles, a sellout to traditional finance and a surrender of our ideals,” said Charles Storry, head of growth at crypto index platform Phuture.\n\n“Satoshi Nakamoto’s vision of a permissionless liberation from government now lies in the hands of the world’s largest establishment, asking America’s regulators to approve something that makes bitcoin just like any other asset class,” he added.\n\nSome still fight the good fight. Last month Erik Voorhees, founder of crypto platform ShapeShift and ardent crypto-libertarian, tried to rally the faithful:\n\n“Before crypto, all movement of funds required someone’s permission . . . try moving ten thousand dollars across a border and you’ll be swiftly reminded of the permissions that are imposed on you . . . so thank God a permissionless form of money was invented.”\n\nBut the excitement around BlackRock illustrates how the narrative on crypto has moved on as the reality of life intrudes. There is an argument that crypto should take what it can get: ETF approvals would be rare wins for a world whose former figurehead is on trial for fraud in New York, and whose biggest surviving companies are facing lawsuits for violating securities laws and illegally accessing US customers.\n\nIt’s also easy to imagine that a successful BlackRock application would send the price of bitcoin flying.\n\n“A BlackRock approval can open the tap for a lot of wealth managers and asset managers to take even a small position on bitcoin, it can potentially be a game-changer,” added Javier Rodriguez-Alarcon, chief commercial officer at XBTO, a digital assets platform.\n\nBut not even a potential bull run for bitcoin can shake off the sense of capitulation for the industry’s die-hards.\n\nOnly El Salvador and the Central African Republic adopted bitcoin as legal tender, nor did it really bank the unbanked, or seriously provide a financial lifeline to those living under an authoritarian regime.\n\nInstead Wall Street has executed its own takeover. Satoshi envisaged a unfluctuating world, where records are immutable and there are a finite number of bitcoins, 21mn. An ETF is a securitised version of bitcoin but it can be replicated, scaled and traded to match demand.\n\nAs Matthew Cloete, head of marketing at Ryze, a London crypto trading firm, notes:\n\n“Most people think that the ETF is going to be the catalyst for the next bull market, which just goes to show how far we have strayed from the original vision, almost as if we’re throwing in the towel.”\n\nWhat’s your take on crypto’s hopes for a BlackRock ETF? As always, email me at scott.chipolina@ft.com.\n\nFTX trial latest\n\nThe trial of Sam Bankman-Fried took another turn when the disgraced former FTX kingpin decided he would testify in his own defence.\n\nDefence lawyers don’t usually advise this course of action to clients but observers say the prosecution has put forward a powerful case. Plus, it’s no surprise to anyone who has followed Bankman-Fried closely that he would want to tell his version of events.\n\nBankman-Fried’s defence got off to an unusual start: the judge sent the jury home while he decided what evidence can be repeated in front of jurors when they return today.\n\nHis lawyers have already publicly laid out the plan: SBF was following legal advice in many of his actions and lawyers help draft many of the policies, such as data retention (or lack of it) and how customer money intended for FTX ended up in his Alameda Research trading arm.\n\nSoundbite of the week: Senator Lummis turns up the heat\n\nThe wind has changed direction on crypto in Washington after Hamas’s attack on Israel this month. Last week, I reported that Israeli law enforcement authorities ordered the closure of more than 100 Binance accounts, and Tether had frozen 32 addresses linked to “terrorism and warfare” in Israel and Ukraine.\n\n\n\nNow senator Cynthia Lummis and representative French Hill have urged the Department of Justice to speed up investigations into crypto’s two largest players: the Binance exchange and Tether, the stablecoin provider.\n\n“We urge the Department of Justice to carefully evaluate the extent to which Binance and Tether are providing material support and resources to support terrorism through violations of applicable sanctions laws and the Bank Secrecy Act. To that end, we strongly support swift action by the Department of Justice against Binance and Tether to choke off sources of funding to the terrorists currently targeting Israel.”\n\nData mining: A final word on BlackRock and bitcoin\n\nThe importance of the US regulator to a bitcoin ETF approval is underscored by location of bitcoin assets under management. The US is far ahead of the rest of the world, as figures from CCData show. Moreover the total value of bitcoin under management has increased by almost $3bn this month, to the highest point since June.\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjcvYml0Y29pbnMtMTQtd2Vla2x5LWdhaW4tc2lnbmFscy1lbmQtb2YtYW4tZXJhLWFzLWJpZy10ZWNoLWR1bXBzLWFuYWx5c3Qtc2F5cy_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzI3L2JpdGNvaW5zLTE0LXdlZWtseS1nYWluLXNpZ25hbHMtZW5kLW9mLWFuLWVyYS1hcy1iaWctdGVjaC1kdW1wcy1hbmFseXN0LXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's 14% Weekly Gain Signals 'End of an Era' as Big Tech Dumps, Analyst Says - CoinDesk",
        "content": "\"Big tech is expensive, and following underwhelming results this week, the sector no longer grows fast enough to justify premium prices,\" he said. \"Admittedly, they had plenty of room to reduce costs, but real growth comes from sales rather than costs.\""
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzI3L2JldHRlci1idXktYml0Y29pbi1vci1hLXNwb3QtYml0Y29pbi1ldGYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Better Buy: Bitcoin or a Spot Bitcoin ETF? - The Motley Fool",
        "content": "Buzz is continuing to grow over the imminent launch of the first spot Bitcoin (BTC -2.96%) exchange-traded fund (ETF) for the U.S. market. This investment product is widely perceived to be bullish not only for Bitcoin, but also for the entire crypto industry. As a result, just about any bit of ETF-related news can send the price of Bitcoin soaring. On Oct. 23, for example, Bitcoin soared by $4,000 in a span of just 24 hours after a positive update from BlackRock (BLK -1.99%) on its planned Bitcoin ETF.\n\nBut just because a spot Bitcoin ETF might be good for the overall crypto market doesn't mean that it's necessarily good for your portfolio. Here's a closer look at the pros and cons.\n\nPros\n\nFor individual investors, the biggest advantage of a spot Bitcoin ETF is the lack of many of the biggest barriers to entry for crypto. You don't have to worry about creating an account with a cryptocurrency exchange. You don't have to worry about creating a blockchain wallet to hold your crypto. And you don't have to worry about crypto taxes, which can be hard to figure out.\n\nMoreover, a spot Bitcoin ETF will help to remove much of the perceived \"sketchiness\" of the crypto industry. Any Bitcoin ETF product will have the full blessing of government regulators, including the Securities and Exchange Commission (SEC). And it will have the support of big institutional investors on Wall Street. Right now, a handful of different firms are rushing to create spot Bitcoin ETFs, and all of them are instantly recognizable brand names.\n\nAnd, most importantly, any spot Bitcoin ETF will be audited, monitored, tracked, and highly transparent. In short, you won't have to worry about a guy in the Bahamas walking away with all of your Bitcoin holdings, as we saw last year with the collapse of cryptocurrency exchange FTX.\n\nCons\n\nHowever, buying a Bitcoin ETF does come with a few downsides. For one, you are losing direct access to Bitcoin. When you hold Bitcoin in your own crypto wallet, you can do with it whatever you want. Now that Ferrari accepts Bitcoin, for example, you could use your Bitcoin stash to buy a new car. Or, if a lender allows you to use Bitcoin as collateral for a loan, you could use your Bitcoin holdings. When you buy an ETF, though, you are buying shares in a fund that holds Bitcoin, and not a direct stake in Bitcoin itself.\n\nMoreover, with a Bitcoin ETF, you are paying highly compensated professionals on Wall Street (via fund management fees and expenses) to do something that you can easily do yourself. I have no issue whatsoever paying 1% a year in expenses if these Wall Street professionals are putting together, say, a diversified basket of Brazilian stocks so I can gain access to the Brazilian market. This is something that I couldn't possibly do myself.\n\nHowever, when it comes to Bitcoin, doing it yourself is certainly feasible. And it doesn't require creating an account at a cryptocurrency exchange or dealing with crypto wallets. For example, you can buy and sell Bitcoin via PayPal and Robinhood these days, and all it takes is a few clicks.\n\nCan ETFs really track the performance of Bitcoin?\n\nThe question of whether to buy a spot Bitcoin ETF really comes down to how closely this product will actually track the price of Bitcoin. For example, if the price of Bitcoin goes up by 100% in one year, then you want to make sure that your Bitcoin ETF also goes up 100% in one year. Otherwise, you are potentially leaving money on the table. Over time, these differences could add up.\n\nThe good news is that there are spot Bitcoin ETFs in Canada already, and they seem to do a good job of tracking the price of Bitcoin. When Bitcoin zigs, the ETF zigs. When Bitcoin zags, the ETF zags. This is highly important because the Bitcoin ETFs available today in the U.S. market rely on derivatives (such as futures contracts) to mimic the price of Bitcoin, and this can lead to disparities between the performance of Bitcoin and the performance of the ETF.\n\nCertainly, I expect the introduction of spot Bitcoin ETF products to be a huge positive for Bitcoin. They will open the door even wider for experienced investors to get access to Bitcoin. And these ETFs should help to make Bitcoin go even more mainstream with crypto-curious investors who might be hesitant about getting direct access to Bitcoin these days. If you decide that the pros outweigh the cons, they could be a useful addition to your investment portfolio."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc3BvdC1iaXRjb2luLWV0Zi1jb3VsZC1zcGFyay10aGVzZS1jcnlwdG8tZXRmc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Could Spark these Crypto ETFs - Nasdaq",
        "content": "Bitcoin, the largest cryptocurrency by market value, is on a torrid pace of late, surging more than 16% over the past week amid speculation that the Securities and Exchange Commission (SEC) could finally sign off on a spot bitcoin exchange traded fund.\n\nSome experts believe such approval, which amounts to one of the most widely anticipated events in ETF industry is history, is just months away. It remains to be seen if this is a buy the rumor, sell the news type of event, but some things aren’t up for debate. First, a spot bitcoin ETF would clearly – it already is – benefit the digital currency’s price.\n\nSecond, such a product in the U.S. would likely bring a slew of new participants into the crypto market because some retail investors have been reluctant to embrace crypto due to technological concerns. Said another way, a spot bitcoin ETF could democratize the asset class and there’s precedent for happening – one set by god ETFs.\n\nWhile crypto enthusiasts and ordinary investors wait on word from the SEC, some of the following ETFs could be worth considering.\n\nBitwise Crypto Industry Innovators ETF (BITQ)\n\nThe Bitwise Crypto Industry Innovators ETF (BITQ) is an equity-based fund, but it’s chock full of stocks that fit the bill as “crypto-correlated.” BITQ, which follows the Bitwise Crypto Innovators 30 Index, is proving as much as highlighted by a gain of 9.28% over the past week.\n\nAs Bitwise itself notes, BITQ’s roster consists of “picks and shovels” players in the crypto space, including the likes of Microstrategy (MSTR) and crypto exchange operator Coinbase (COIN). Much of the rest of the ETF’s lineup consists of crypto miners – a group highly tethered to bitcoin’s price action. But there’s more to the story. A recent report by JPMorgan indicates some bitcoin miners are making strides in the artificial intelligence (AI) due to native supercomputing capabilities.\n\n“In these beta tests, miners are reporting high profitability per unit of power consumption, much above the profitability from bitcoin mining. With bitcoin miners having already secured more than 100MW of long-term contracts with their power grids, if the profitability reported in beta tests is able to be repeated in large scale it would overshadow in the future the revenues coming from bitcoin mining at the moment,” noted the bank.\n\nProShares Bitcoin Strategy ETF (BITO)\n\nOne of the original futures-backed bitcoin ETFs, the ProShares Bitcoin Strategy ETF (BITO) remains pertinent today because bitcoin futures are, of course, levered to the underlying asset’s price movements. To its credit, BITO, which turned two years old last week, has done a solid job of tracking spot bitcoin prices since inception.\n\nIt goes without saying that BITO would benefit (it already is) from approval of a spot bitcoin ETF, but there are more chapters in this book. Importantly, recent data indicate bitcoin’s correlation to stock is declining, but its correlation to gold is increasing. That fortifies the “digital gold” thesis.\n\n“We [view]bitcoin as an investment being a non-sovereign store of value which had potential exposure to economic and internet growth, whilst being largely uncorrelated to other asset classes,” according to CoinShares. “We also find that in the context of a portfolio, it behaves in a similar manner to other alternative assets in providing diversification, with the exception that its portfolio diversification benefits are far greater than its competitors.”\n\nVanEck Ethereum Strategy ETF (EFUT)\n\nAs its name implies, the newly minted VanEck Ethereum Strategy ETF (EFUT) isn’t a bitcoin ETF. Rather, it’s focused on ethereum, the second-largest cryptocurrency behind bitcoin. EFUT is one of several new futures-based ethereum ETFs that recently came to market, indicating regulators are warming to non-bitcoin crypto fare in the ETF wrapper.\n\nThat could be one sign that if a spot bitcoin ETF is approve, there could be trickle-down effects to fund such as EFUT. Even if that scenario doesn’t come to fruition, ethereum offers investors an attractive fundamental story unto itself.\n\n“Ethereum’s limited space is managed through fees charged to users for conducting business and value exchange,” according to VanEck research. “This software is globally hosted and utilizes a protocol to establish a unified understanding of ownership, commercial activity, and business logic. It enables users to conduct commerce without the need for trust in participants or counterparts. Essentially, Ethereum’s core business revolves around selling secure, immutable blockspace that powers internet commerce.”\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzI3L2JpdGNvaW4tY2F0Y2hlcy1tYXJrZXQtY2FwLW9mLWVsb24tbXVza3MtdGVzbGEtYW1pZC1ldGYtZnVlbGVkLXJhbGx5LWJ1dC10cmFkZXJzLWNhdXRpb3VzLWFoZWFkLW9mLWZlZC1tZWV0aW5nL9IBnwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzI3L2JpdGNvaW4tY2F0Y2hlcy1tYXJrZXQtY2FwLW9mLWVsb24tbXVza3MtdGVzbGEtYW1pZC1ldGYtZnVlbGVkLXJhbGx5LWJ1dC10cmFkZXJzLWNhdXRpb3VzLWFoZWFkLW9mLWZlZC1tZWV0aW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Catches Market Cap of Elon Musk's Tesla Amid ETF-Fueled Rally, but Traders Cautious Ahead of Fed Meeting - CoinDesk",
        "content": "“There is also possible speculation that market turbulence in the week leading up to the FOMC meeting will force the regulator to soften its tone significantly, which is positive for crypto unaffected by the falling revenues from Google's cloud business or similar stories,” he continued."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8yNy9jcnlwdG8tbWluZXJzLWxvYmJ5LXVzLWxhd21ha2Vycy10by1jb3VudGVyLWVudmlyb25tZW50YWwtbWlzdW5kZXJzdGFuZGluZy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTAvMjcvY3J5cHRvLW1pbmVycy1sb2JieS11cy1sYXdtYWtlcnMtdG8tY291bnRlci1lbnZpcm9ubWVudGFsLW1pc3VuZGVyc3RhbmRpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Crypto Miners Lobby U.S. Lawmakers to Counter Environmental 'Misunderstanding' - CoinDesk",
        "content": "Sanjay Gupta, head of strategy at Auradine, a Silicon Valley tech company, focused a lot of his discussions on restrictions and import tariffs on Chinese technologies in the space. He said the U.S. already limits \"access of sensitive high technology to Chinese companies,\" but his company's priority was \"to ensure that that's enforced.\" Reports of China-tied crypto facilities in the U.S. have raised some alarms."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8yNy9jcmFpZy13cmlnaHQtd2lucy11cy1hcHBlYWwtaW4tYmlsbGlvbi1kb2xsYXItYml0Y29pbi1kaXNwdXRlL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8yNy9jcmFpZy13cmlnaHQtd2lucy11cy1hcHBlYWwtaW4tYmlsbGlvbi1kb2xsYXItYml0Y29pbi1kaXNwdXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Craig Wright Wins U.S. Appeal in Billion-Dollar Bitcoin Dispute - CoinDesk",
        "content": "In a 2022 ruling, Norwegian judge Helen Engebrigtsen ruled it had been fair to describe Wright as a “fraud” and “scammer” for his claim to be Nakamoto, in a decision that has since been appealed."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvMy1idXktcmF0ZWQtY3J5cHRvLXN0b2Nrcy10by1jb25zaWRlci1hcy1iaXRjb2luLXByaWNlcy1icmVhay1vdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "3 Buy-Rated Crypto Stocks to Consider as Bitcoin Prices Break Out - Nasdaq",
        "content": "Bitcoin (BTCUSD) prices have been on a wild ride lately, with the digital currency surging to its highest levels since May 2022 on growing hopes that the U.S. Securities and Exchange Commission (SEC) might finally give the green light to a spot Bitcoin ETF. Bitcoin has now doubled in value on a year-to-date basis, and is hovering right around $34,000 at last check.\n\nCoinbase (COIN), which is a big player in the crypto world, seems pretty confident that this ETF is on the horizon - but shares of the online exchange have shed more than 21% in the last three months while BTC has broken out, and analysts have a tepid consensus rating of “hold” on COIN. However, with asset management heavyweights like BlackRock (BLK) getting ready to cash in on regulatory clearance for BTC-based ETFs, it's worth taking a look at some investing opportunities among cryptocurrency and blockchain stocks.\n\nHere, we'll highlight three top-rated crypto stocks, all priced under $10 per share, that have been moving higher with BTC as the market braces for a potentially massive new wave of institutional investing dollars.\n\nBITF: Riding the Bitcoin Wave\n\nBitfarms Ltd. (BITF) is a Canadian Bitcoin mining company offering analytics and engineering services. In August 2023, Bitfarms reported mining a cool 383 new bitcoins - down from August 2022, but up sequentially from July's numbers. Plus, BTC mined through the first eight months of 2023 were higher YOY.\n\nLike most other miners, BITF is in the Bitcoin business - so when BTC prices are up, so is BITF's stock. The stock is up 162.5% YTD to trade around $1.15, and has a market cap of $243 million.\n\nwww.barchart.com\n\nAll four analysts covering BITF are giving it the green light, with three shouting \"strong buy,\" and one rating the stock a \"moderate buy.\" The average target price for BITF is $3.19, hinting at potential 177% upside from current levels.\n\nwww.barchart.com\n\nCIFR: Mining for Profits in the Bitcoin Boom\n\nCipher Mining Inc. (CIFR), a New York-based Bitcoin miner, is outperforming broader BTC prices this year. The company has a market cap of $883 million, and CIFR currently trades right around $3.33 per share.\n\nSince the start of 2023, CIFR's stock has rocketed by 492%, leaving BTC's 105% gain in the dust.\n\nwww.barchart.com\n\nPlus, all seven analysts tracking CIFR rank it a strong buy overall. Five are shouting \"strong buy,\" one's going with a \"moderate buy,\" and one suggests a \"hold.\"\n\nThe mean target price for CIFR is $5.00 is also interesting, given the stock's major rally already this year. That target indicates an expected upside of more than 50% from current levels, suggesting plenty more gains ahead.\n\nwww.barchart.com\n\nRIOT: Capitalizing on the Crypto Craze\n\nColorado-based Riot Platforms Inc. (RIOT) might have renamed itself from Riot Blockchain, but the company's primary business is still focused on Bitcoin mining and infrastructure. So, when Bitcoin's up, RIOT's stock is on the rise too.\n\nRIOT's got a relatively hefty market cap of $1.945 billion, and trades just below $10 per share. On a year-to-date basis, RIOT has outpaced BTC prices by gaining 193% - and Wall Street sees more upside ahead.\n\nwww.barchart.com\n\nOut of the 8 analysts following the shares, 6 call RIOT a “strong buy,” 1 suggests a “moderate buy,” and only 1 is daring to go against the grain with a “strong sell.” The mean target price for RIOT is $16.67, which represents a healthy premium of 68.5% to current levels.\n\nwww.barchart.com\n\nThe Future of Crypto Stocks Amid Bitcoin's Breakout\n\nIn conclusion, as Bitcoin continues to flex its muscles and break out, these three buy-rated crypto stocks look intriguing. They've been riding the Bitcoin wave, and with favorable analyst ratings, they're catching the attention of investors.\n\nBut here's the kicker: the crypto market can be an extremely volatile space. CIFR has a beta of 2.50, BITF has a beta of 3.28, and RIOT's beta is 4.31 - indicating all three stocks are considerably more volatile than the S&P 500 Index ($SPX), and are best suited for those investors with a healthy risk appetite. So while the potential upside is appealing, the heightened volatility and continuing regulatory overhang are worth keeping in mind here.\n\nOn the date of publication, Ebube Jones did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzI3L2JldHRlci1iaXRjb2luLXN0b2NrLW1hcmF0aG9uLXZzLXJpb3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Better Bitcoin Stock: Marathon Digital vs. Riot Platforms - The Motley Fool",
        "content": "Bitcoin's (BTC -2.88%) price has surged more than 30% over the past month for two main reasons. First, BlackRock's (BLK -2.09%) proposed Bitcoin exchange-traded fund (ETF) briefly appeared on a clearing house eligibility list, which suggested it might be making gradual progress toward a regulatory approval. If approved, BlackRock's Bitcoin ETF would be the first ETF to be pinned to Bitcoin's spot price, which would set it apart other Bitcoin ETFs which are currently tethered to Bitcoin futures.\n\nSecond, the escalating Middle East conflict has been driving investors toward safe haven assets like gold again. Bitcoin is still more volatile than gold, but it could be lumped together with the precious metal as more investors pivot away from fiat currencies while inflation, high interest rates, and global turmoil rattle the global markets.\n\nTherefore, it wasn't surprising to see shares of Marathon Digital (MARA -9.90%) and Riot Platforms (RIOT -7.88%), the two biggest pure-play Bitcoin miners in the world, rally about 11% and 14%, respectively, over the last month. But should investors buy either of these stocks as a long-term play on Bitcoin's growth?\n\nThe differences between Marathon and Digital\n\nMarathon and Riot were both once tiny patent holding companies which abruptly reinvented themselves as Bitcoin miners. Riot, which was formerly known as Bioptix, made that leap in 2017, and Marathon followed that example in 2020. Both companies then ordered tens of thousands of top-tier Antminer mining systems from Bitmain.\n\nMany investors initially dismissed those rebrandings as cheap attempts to cash in on the market hype about Bitcoin. Yet both companies eventually grew their mining operations into sustainable businesses.\n\nRiot had deployed 98,694 miners by the end of September, which gave it a total hash rate capacity (the overall efficiency of its mining operations) of 10.9 EH/s (exahashes per second). It produced an average of 12.1 BTC daily during the month. Marathon has deployed 155,910 miners as of this writing, which gives it a much higher total hash rate capacity of 23.1 EH/s. It was producing an average of 41.1 BTC daily at the end of September.\n\nSimilar headwinds and tailwinds\n\nBoth companies faced tough headwinds over the summer as Bitcoin prices slumped while inflation and adverse weather conditions caused energy prices to soar. However, Riot and Marathon both started to grow their average daily BTC production again on a monthly basis in September as Bitcoin's price rose and energy prices stabilized.\n\nAvg. Daily BTC Production 5/2023 6/2023 7/2023 8/2023 9/2023 Riot Platforms 21.8 15.3 13.2 10.8 12.1 Marathon Digital 40.2 32.6 37.9 34.3 41.1\n\nBoth companies also liquidated some of their own BTC holdings to raise fresh cash over the past year. In September, Riot sold 340 of its mined BTC while Marathon sold 800 BTC. Those ongoing sales should provide both companies with a stable flow of cash to purchase even more miners and scale up their operations.\n\nAt the end of the third quarter of 2023, Riot held $289 million in cash and $221 million in BTC on its balance sheet. Marathon held $114 million in cash and $380 million in BTC.\n\nBoth companies should have enough capital to ride out their near-term losses. Analysts expect Riot's revenue to rise 22% to $318 million this year as it narrows its net loss from $510 million to $169 million. They expect Marathon's revenue to surge 210% to $366 million (mainly driven by the opening of two new plants and a new joint venture in Abu Dhabi) as it narrows it net loss from $687 million to $61 million.\n\nMarathon seems like the larger and stronger miner, but it has two notable weaknesses. First, it still faces an Securities and Exchange Commission (SEC) probe regarding its joint venture with Beowulf Energy to secure favorable energy rates. Second, its debt-to-equity ratio of 1.2 is much higher than Riot's ratio of 0.1.\n\nThe better buy: Marathon Digital\n\nBoth stocks have similar valuations: Riot trades at nearly seven times this year's sales, while Marathon trades at about six times this year's sales.\n\nI'm not bullish on either of these stocks right now, since I believe it makes more sense to simply buy Bitcoin instead of investing in these capital-intensive miners. But if I had to choose one over the other, I'd pick Marathon because it's bigger, produces more Bitcoins every day, and has a much shorter and clearer path toward profitability."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLXN1cHBseS1zaG9jay10b2tlbnMtc3BvdC1ldGYtY3J5cHRvLWV4Y2hhbmdlLXNlYy0yMDIzLTEw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin May See a 'Supply Shock' As Available Tokens Plummet: Analyst - Markets Insider",
        "content": "The supply of available bitcoin to trade on crypto exchanges is at its lowest level in five years.\n\nThat could set up a supply shock with potential approval of a spot bitcoin ETF looming, an analyst said.\n\nBitcoin hit $35,000 earlier this week, reaching the highest level in 17 months, amid ETF optimism.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe world's largest cryptocurrency by market capitalization might run into a shortage of liquid supply, especially with potential approval of a spot bitcoin ETF poised to boost demand.\n\nThe amount of available bitcoin tokens to buy and sell on crypto exchanges has dropped to 2.3 million, the lowest since April 2018, according to Glassnode data. That's down from 2.6 million a year ago.\n\n\"To me, that's suggestive of a potential supply shock,\" Matt Weller, global head of research at Forex.com, told CoinDesk TV on Thursday. \"Essentially, there's not too much bitcoin actively liquid in the market that's available for trade.\"\n\nBitcoin balance on exchanges and price of bitcoin CoinDesk, Glassnode\n\nThe supply crunch could set up bitcoin for another price spike. Earlier this week, bitcoin hit $35,000, the highest since May 2022, on hopes that a spot bitcoin ETF would get regulatory approval soon.\n\nAdvertisement\n\nSuch an ETF would boost demand for bitcoin, further squeezing the limited supply.\n\n\"With lower supply in the market, it only takes a small bump in demand — like what we've seen with speculation around the ETF — to really drive price higher at a rapid rate,\" Weller said.\n\nContributing to the constrained supply is that millions of bitcoin are being held by original \"die hard\" crypto investors. Weller estimated that about 3 million bitcoin tokens haven't been traded in 10 years.\n\nBut if the price of bitcoin soars, that could relieve supply by nudging some investors to sell.\n\nAdvertisement\n\nUnlike a regular currency, the supply of bitcoin was designed to be finite, capped at 21 million tokens. There are currently 19.5 million tokens in circulation."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9iaXRjb2luLW1vcmUtZXhwZW5zaXZlLWluLW5pZ2VyaWEtdG9kYXktdGhhbi10d28teWVhcnMtYWdvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price has climbed to an all-time high in Nigeria. Here's why - DLNews",
        "content": "Bitcoin is trading at an all-time high against Nigeria’s national currency, the naira.\n\nThis price climb is due to the decline of the naira. Nigeria’s currency has fallen 65% compared to the US dollar in the last four months.\n\nDespite the naira’s fall, crypto trading remains popular in Nigeria.\n\nBitcoin is more expensive for Nigerians today than it was two years ago, when it reached its highest price in US dollar terms.\n\nIn fact, Bitcoin is trading at a new all-time high in Africa’s most populous country despite still being only halfway to its peak US dollar price of $69,000 attained in November 2021.\n\nNigeria ranks high in global crypto adoption. However, Nigeria’s crypto fondness is not why bitcoin has grown so expensive in the country. Instead, the reason lies in the massive decline of the naira, or NGN, Nigeria’s national currency.\n\nThe Naira has fallen against the US dollar by 65% since June. This fall resulted from the country’s central bank’s decision in June to allow market forces to determine foreign exchange rates — a policy known as floating.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nCrypto trading in Nigeria is priced in US dollar terms, which is then converted to the naira value at the day’s exchange rate. The naira has lost so much ground to the dollar that the value of $1 has almost tripled in the country’s currency market since 2021.\n\nAs such, it costs more today in naira terms to become a wholecoiner, a colloquial term for an owner of at least 1 BTC, than it did back when bitcoin hit $69,000 in US dollar terms two years ago.\n\nBitcoin’s current US dollar price of about $34,000 is equivalent to 38 million Nigerian naira. BTC is even trading as high as 43 million NGN, according to the rates advertised by some sellers on the Binance peer-to-peer platform.\n\nBy comparison, it cost 29 million NGN in November 2021 to become a wholecoiner.\n\nJoin the community to get our latest stories and updates\n\nPresently, that amount — 29 million NGN — can only buy three-quarters of a bitcoin, showing the extent of the naira’s depreciation in the last two years.\n\nCrypto still popular\n\nThe falling naira has not, however, dampened enthusiasm for bitcoin and crypto assets. Crypto trading in Nigeria has grown 9% since 2021, according to the latest global cryptocurrency adoption report published by Chainalysis, a blockchain forensics company. Chainalysis ranked the country second in its global crypto adoption index released in September.\n\nMost of the growth since 2021 has been due to sustained interest in bitcoin and stablecoins, especially Tether’s USDT stablecoin, the report stated.\n\nStablecoin trading via crypto exchanges in Nigeria has crossed $60 billion over the last two years. Bitcoin volume in the country is nowhere near this mark but there has been a noticeable increase in BTC trading since Nigeria’s government decided to float the naira.\n\nThis flight of funds into bitcoin and stablecoins in Nigeria can be attributed to investors needing to protect the value of their capital, Kola Oyeneyin, CEO of private wealth fund Opportunik Global Fund told DL News.\n\n“Any asset that offers protection in the immediate term becomes the alternative,” Oyeneyin said. “That’s why the value of digital assets and hard commodities are on the rise in some markets, including Nigeria.”\n\nNigeria is not the only country where bitcoin is trading at a peak price in local currency terms. The same situation is happening in Turkey where the local currency, the Turkish lira, has slumped over 30% against the US dollar since April. As a result, Bitcoin is trading at 960,000 lira now in dollar terms, vs 800,000 lira back in November 2021.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTI3L2dlbWluaS1zdWVzLWdlbmVzaXMtb3Zlci0xLTYtYmlsbGlvbi1vZi1iaXRjb2luLXRydXN0LXNoYXJlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Gemini Sues Genesis Over $1.6 Billion of Bitcoin Trust Shares - Bloomberg",
        "content": "Crypto platform Gemini Trust Co. is suing bankrupt crypto lender Genesis Global Holdco LLC in an attempt to determine who rightfully owns a slug of shares in the Grayscale Bitcoin Trust now worth nearly $1.6 billion.\n\nIn a bankruptcy-court lawsuit filed Friday, Gemini asked a federal judge to find that Genesis has no right to more than 60 million GBTC shares promised as collateral to users of Gemini’s Earn product. The shares at issue — most of which are still held by Genesis or its affiliates — should not be used to repay other Genesis creditors, the company argues."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzI3L3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1kb2dlY29pbi1zdXJnZWQtaGlnaGVyLXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Surged Higher This Week - The Motley Fool",
        "content": "What a week it was for mega-cap cryptocurrencies. Three of the most popular digital assets out there, Bitcoin (BTC -2.83%), Ethereum (ETH -3.15%) and Dogecoin (DOGE 3.10%), each saw impressive gains. As of 12:45 p.m. ET on Friday, these three top-10 cryptocurrencies by market capitalization rose 14.7%, 10.4% and 15.4%, respectively, over the past seven days.\n\nIt shouldn't be surprising for many investors to see Bitcoin lead the market higher, as that's par for the course for this space. With roughly half the market cap of the entire crypto sector, the direction Bitcoin moves on a given week typically determines how other digital assets perform.\n\nAccordingly, one might view this week's news that a spot Bitcoin exchange-traded fund (ETF) could be hitting the market sooner than thought as the rising tide that's lifting all boats. I certainly think there's something to that.\n\nWith that said, let's dive into what specifically drove these three cryptos higher over the past week and where they may be headed from here.\n\nBitcoin ETF launch dominates the crypto news cycle\n\nIt's been a busy week in the world of crypto, with the Sam Bankman-Fried trial ongoing, various macro-data releases impacting monetary policy decisions released, and a flurry of token-specific news that's been enough to make the heads of many investors in the market spin. Of course, this week's Bitcoin news has dominated the headlines, and for good reason.\n\nEssentially, a number of hints that Blackrock's spot Bitcoin ETF will finally be pushed over the goal line have materialized this week, with this ETF reportedly being listed on the Depository Trust & Clearing Corporation database under the ticker IBTC.\n\nThis ticker appears to have been taken down and put back up again, but the fact that we're seeing this ticker listed is apparently enough of a catalyst for crypto bulls to point to. Many believe this could be the moment Bitcoin is officially viewed as 'open for investment' for institutional investors, much in the same way gold ETFs made investing in precious metals much simpler and more attractive for money managers.\n\nOn that note, I've been reading a number of interesting analyses on this topic, with many experts attempting to quantify what a spot Bitcoin ETF could mean for the digital currency in terms of capital inflows into Bitcoin and the broader sector as a whole. Right now, I think most of these reports require a great deal of guesswork, so I'm not sure how much credence to give these. However, I do think it's true that Bitcoin and Ethereum (assuming a spot Ethereum ETF is next, which would be 100% logical) will receive a big boost from a rush of capital into these alternative assets.\n\nOther, more speculative altcoins, such as Dogecoin, may be well positioned to ride a wave of momentum higher. Dogecoin's price action typically takes its cue from the directional forces created by Bitcoin and Ethereum in a given week.\n\nIndeed, the fact that Dogecoin has moved even higher than Bitcoin and Ethereum on broadly bullish market sentiment outlines the value this token provides traders as a higher-beta option in this space. A number of experts continue to point to \"irrational exuberance\" when discussing Dogecoin's price action over the past few days as the key driver of this token. I tend to agree.\n\nWhere are these three tokens headed from here?\n\nIt's clear that there's robust reason for Bitcoin and Ethereum to be up this week. As for the rest of the market, animal spirits appear to remain high, which is a great thing for crypto speculators banking on yet another catalyst-driven bull run over the near term.\n\nThat said, the extent to which this rally can be sustained beyond a few days remains to be seen. Once a spot Bitcoin ETF is launched (and maybe a similar Ethereum option), it's unclear whether the bullish momentum that's driven valuations higher can continue. Indeed, it could be the latest \"buy the rumor, sell the news\" event. We'll see.\n\nIt's my view that now may be a good time to take a cautious view of this space and wait for the dust to settle before stepping in. These three tokens have made nice moves over the past week, for sure. Let's just see whether these gains will be held before jumping in to ride this latest leg higher."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idXktYml0Y29pbi1nb29nbGUtc2VhcmNoLXF1ZXJpZXMtc3VyZ2UtdW5pdGVkLWtpbmdkb23SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "'Buy Bitcoin' search queries on Google surge 826% in the UK - Cointelegraph",
        "content": "Google searches for “buy Bitcoin” have surged worldwide amid a major crypto rally, with searches in the United Kingdom growing by more than 800% in the last week.\n\nAccording to research from Cryptogambling.tv, the search term “buy Bitcoin” spiked a staggering 826% in the U.K. over the course of seven days.\n\nGlobal search terms related to purchasing Bitcoin have surged worldwide. Source: Google Trends\n\n“The remarkable surge in ‘buy Bitcoin’ searches in the UK, combined with the cryptocurrency’s resurgence, underscores the growing interest and potential impact of traditional financial institutions’ involvement in the world of digital assets,” said a spokesperson from Cryptogambling.tv.\n\nWhile users in the U.K. led the pack, there was also a noticeable increase in searches relating to purchasing Bitcoin (BTC) from web users across the globe.\n\nAccording to data from Google Trends, searches from users in the United States for “should I buy Bitcoin now?” increased by more than 250%, while more niche searches, including “can I buy Bitcoin on Fidelity?” increased by over 3,100% in the last week.\n\nZooming out further, the search term “Is it a good time to buy Bitcoin?” saw a 110% gain worldwide over the last week. In comparison, searches for “BlackRock Bitcoin ETF” jumped 250%, demonstrating broader enthusiasm for information relating to BlackRock’s spot Bitcoin exchange-traded fund (ETF), which is currently pending approval.\n\nThe sudden uptick in interest comes amid a drastic increase in the price of Bitcoin over the past fortnight, with Bitcoin briefly surpassing a value of $35,000 on Oct. 24 — the first time since May 2022.\n\nRelated: Peter Brandt says Bitcoin bottom is in, but prepare for a ‘chopfest’\n\nThe excitement appears closely linked to the approval of a spot Bitcoin ETF, which many pundits believe will unleash a fresh wave of buying from institutions.\n\nSenior ETF analysts Eric Balchunas and James Seyffart have pinned the probability of an approval at 90% by Jan. 10, 2024.\n\nI've gotten a lot of questions regarding my current view on Spot #Bitcoin ETFs over the last couple weeks. This is the first section of the note I put out yesterday with @EricBalchunas.\n\n\n\nTLDR: Our view hasn't changed much https://t.co/dRAm5IsdQf pic.twitter.com/Htsi3n2XxV — James Seyffart (@JSeyff) October 13, 2023\n\nAt the time of publication, Bitcoin has gained more than 27% in the past two weeks, according to price data from TradingView.\n\nBitcoin has notched a powerful 27.9% gain in the past two weeks. Source: TradingView\n\nMagazine: The truth behind Cuba’s Bitcoin revolution — An on-the-ground report"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvc2JmLXRha2VzLXRoZS1zdGFuZC1idXktYml0Y29pbi1zZWFyY2hlcy1zb2FyLWFuZC1vdGhlci1uZXdzLWhvZGxlcnMtZGlnZXN0LW9jdC0yMi0yOC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Oct 2023 07:00:00 GMT",
        "title": "SBF takes the stand, 'buy Bitcoin' searches soar and other news: Hodler's Digest, Oct. 22-28 - Cointelegraph",
        "content": "Top Stories This Week\n\nSam Bankman-Fried takes the stand on FTX’s collapse\n\nSam “SBF” Bankman-Fried testified this week in his ongoing criminal trial in the Southern District of New York, denying any wrongdoing between FTX and Alameda Research while acknowledging making “big mistakes” during the companies’ explosive growth. Highlights of his testimony include denying directing his inner circle to make significant political donations in 2021, as well as claims that FTX’s terms of use covered transactions between Alameda and the crypto exchange. Additionally, Bankman-Fried testified that he requested additional hedging strategies for Alameda in 2021 and 2022, but they were never implemented. The trial is expected to conclude within the next few days.\n\n‘Buy Bitcoin’ search queries on Google surge 826% in the UK\n\nGoogle searches for “buy Bitcoin” have surged worldwide amid a major crypto rally, with searches in the United Kingdom growing by more than 800% in the last week. According to research from Cryptogambling.tv, the search term “buy Bitcoin” spiked a staggering 826% in the U.K. over the course of seven days. In the United States, data from Google Trends shows that searches for “should I buy Bitcoin now?” increased by more than 250%, while more niche searches, including “can I buy Bitcoin on Fidelity?” increased by over 3,100% in the last week. Zooming out further, the search term “is it a good time to buy Bitcoin?” saw a 110% gain worldwide over the last week.\n\nThe United States Court of Appeals has issued a mandate following a decision requiring Grayscale Investments’ application for a spot Bitcoin exchange-traded fund (ETF) to be reviewed by the Securities and Exchange Commission (SEC). In an Oct. 23 filing, the “formal mandate” of the court took effect, paving the way for the SEC to review its decision on Grayscale’s spot Bitcoin ETF. The mandate followed the court’s initial ruling on Aug. 29 and the SEC’s failure to present an appeal by Oct. 13. To date, the SEC has yet to approve a single spot crypto ETF for listing on U.S. exchanges but has given the green light to investment vehicles linked to Bitcoin and Ether futures.\n\nCoinbase disputes SEC’s crypto authority in final bid to toss regulator’s suit\n\nThe U.S. Securities and Exchange Commission overstepped its authority when it classified Coinbase-listed cryptocurrencies as securities, the exchange has argued in its final bid to dismiss a lawsuit by the securities regulator. In an Oct. 24 filing in a New York District Court, Coinbase chastised the SEC, claiming its definition for what qualifies as a security was too wide, and contested that the cryptocurrencies the exchange lists are not under the regulator’s purview. The SEC sued Coinbase on June 6, claiming the exchange violated U.S. securities laws by listing several tokens it considers securities and not registering with the regulator.\n\nGemini sues Genesis over GBTC shares used as Earn collateral, now worth $1.6B\n\nCryptocurrency exchange Gemini filed a lawsuit against bankrupt crypto lender Genesis on Oct. 27. At issue is the fate of 62,086,586 shares of Grayscale Bitcoin Trust. They were used as collateral to secure loans made by 232,000 Gemini users to Genesis through the Gemini Earn Program. That collateral is currently worth close to $1.6 billion. According to the suit, Gemini has received $284.3 million from foreclosing on the collateral for the benefit of Earn users, but Genesis has disputed the action, preventing Gemini from distributing the proceeds. Genesis filed for bankruptcy in January. It had suspended withdrawals in November 2022, which impacted the Gemini Earn program.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $34,143, Ether (ETH) at $1,789 and XRP at $0.54. The total market cap is at $1.26 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Pepe (PEPE) at 72.08%, Mina (MINA) at 55.47% and FLOKI (FLOKI) at 53.33%.\n\nThe top three altcoin losers of the week are Bitcoin SV (BSV) at -10.27%, Toncoin (TON) -3.14% and Trust Wallet Token (TWT) at -0.82%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“The witness [Sam Bankman-Fried] has an interesting way of responding to questions.”\n\nLewis Kaplan, senior judge of the U.S. District Court for the Southern District of New York\n\n“When it comes to illicit finance, crypto is not the enemy – bad actors are.”\n\nCynthia Lummis, U.S. senator\n\n“I should say, I am not a lawyer, I am just trying to answer based on my recollection. […] At the time [at] FTX, certain customers thought accounts would be sent to Alameda.”\n\nSam Bankman-Fried, former CEO of FTX\n\n“Without prejudging any one asset, the vast majority of crypto assets likely meet the investment contract test, making them subject to the securities laws.”\n\nGary Gensler, chair of U.S. Securities and Exchange Commission\n\n“I do not believe there has been a single serious conversation regarding a settlement between Ripple […] and the SEC. The SEC is pissed and embarrassed and wants $770M worth of flesh.”\n\nJohn Deaton, attorney\n\n“He [Sam Bankman-Fried] thought he was going to take that money, and […] he would out-trade the market and put the money back and end up as a half-a-trillionaire, but it never works like that.”\n\nAnthony Scaramucci, founder of SkyBridge Capital\n\nPrediction of the Week\n\nBitcoin beats S&P 500 in October as $40K BTC price predictions flow in\n\nBitcoin surfed $34,000 at the end of the week as attention turned to BTC price performance against macro assets. Data from Cointelegraph Markets Pro and TradingView showed BTC/USD holding steady, preserving its early-week gains.\n\nThe largest cryptocurrency avoided significant volatility as the weekly and monthly closes — a key moment for the October uptrend — drew ever nearer.\n\n“I think Bitcoin will hang around this range for some time,” popular pseudonymous trader Daan Crypto Trades told X subscribers in one of several posts on Oct. 27. “Roughly $33-35K is what I’m looking at as a range. Eyes on potential sweeps of any of these levels for a quick trade,” he wrote.\n\nFUD of the Week\n\nUK passes bill to enable authorities to seize Bitcoin used for crime\n\nLawmakers in the United Kingdom have passed legislation allowing authorities to seize and freeze cryptocurrencies like Bitcoin if used for illicit purposes. Introduced in September 2022, the passed legislation aims to expand authorities’ ability to crack down on the use of cryptocurrency in crimes like cybercrime, scams and drug trafficking. One of the provisions of the bill permits the recovery of crypto assets used in crimes without conviction, as some individuals may avoid conviction by remaining remote.\n\nScammers create Blockworks clone site to drain crypto wallets\n\nPhishing scammers have cloned the websites of crypto media outlet Blockworks and Ethereum blockchain scanner Etherscan to trick unsuspecting readers into connecting their wallets to a crypto drainer. A fake Blockworks site displayed a fake “BREAKING” news report of a supposed multimillion-dollar “approvals exploit” on the decentralized exchange Uniswap and encouraged users to visit a fake Etherscan website to rescind approvals. The fake Uniswap news article was posted on Reddit across several popular subreddits.\n\nKraken to suspend trading for USDT, DAI, WBTC, WETH and WAXL in Canada\n\nKraken will suspend all transactions related to Tether, Dai, Wrapped Bitcoin, Wrapped Ether and Wrapped Axelar in Canada in November and December. The suspensions may not surprise many Canadian cryptocurrency users, as they come on the heels of several other notable exchanges taking similar actions throughout 2023. OKX ceased operations in Canada in June after Binance announced its intention to do so in May.\n\n5,050 Bitcoin for $5 in 2009: Helsinki’s claim to crypto fame\n\nHelsinki has a long and fascinating history with cryptocurrency, including the first exchange of Bitcoin for United States dollars.\n\nAustralia’s $145M exchange scandal, Bitget claims 4th, China lifts NFT ban: Asia Express\n\nAustralian police bust $145 million money laundering scam, Bitget gains market share in Q3, China unblocks NFTs, and more.\n\nHow blockchain games fared in Q3, Upland token on ETH: Web 3 Gamer\n\n$2.3B tipped into Web3 games so far this year, ex-GTA devs’ studio teams up with Immutable, Brawlers to launch on Epic Games Store, and more."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMixQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2V0Zi9jYXRoaWUtd29vZC1kdW1wcy1vdmVyLTZtLWdyYXlzY2FsZS1iaXRjb2luLWZ1bmQtdGhpcy13ZWVrLWFzLWJpdGNvaW4tcmFsbGllcy1hYm91dC0xNC13aGlsZS1hbWFzc2luZy0xMi00bS13b3J0aC1vZi10aGlzLWNyeXB0by1saW5rZWQtc3RvY2stMTAzMjc1MDQ0M9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Oct 2023 07:00:00 GMT",
        "title": "Cathie Wood Dumps Over $6M Grayscale Bitcoin Fund This Week As Bitcoin Rallies About 14%, While Amassing ... - Markets Insider",
        "content": "Ark Invest sold more Grayscale Bitcoin Trust (OTC:GBTC) units on Friday, as the fund recovered this week amid a rally in its underlying asset Bitcoin (CRYPTO: BTC).\n\nWhat Happened: On Friday, the Cathie Wood-led firm’s Ark Next Generation Internet ETF (NYSE:ARKW) sold 66,342 units of GBTC, valued at $1.66 million based on its closing price of $25.07. The firm was a seller of GBTC in three sessions this week.\n\nThe cumulative value of GBTC units Ark sold this week amounted to about $6.05 million. Bitcoin was on a tear this week on hopes of regulatory approval of a spot Bitcoin ETF. The apex crypto has gained about 13.7% since last Saturday.\n\nSee Also: How To Buy Bitcoin (BTC)\n\nBulking Up On Block. Ark, meanwhile, added to its position in Block, Inc. (NYSE:SQ), a Jack Dorsey-company with exposure to Bitcoin. Users of Block’s Cash App can buy, sell, send and receive Bitcoin.\n\nArk through ARKW, Ark Innovation ETF (NYSE:ARKK) and Ark Fintech Innovation ETF (NYSE:ARKF) bought 310,100 shares of Block valued at $12.4 million.\n\nArk’s flagship ETF, ARKK, closed Friday’s session down 1.90% at $34.10, according to Benzinga Pro data.\n\nRead Next: Cathie Wood’s Ark Stays Bullish On Tesla Despite Short-Term ‘Growing Pains’ As EV Maker ‘Years Ahead’ Of Rivals\n\nPhoto: Shutterstock"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLTIwMjMtdXB0b2Jlci1idGMtcHJpY2UtcmVzZWFyY2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin restarting 2023 uptrend after 26% Uptober BTC price gains — Research - Cointelegraph",
        "content": "Bitcoin (BTC) is due to finish 2023 as it started, on-chain analytics firm Glassnode said, as October gains near 30%.\n\nIn the latest edition of its weekly newsletter, “The Week On-Chain,” released Oct. 24, researchers argued that the past week “sets the foundation” for a BTC price uptrend.\n\nBTC price “convincingly” beats out resistance levels\n\nAs it hit $35,200 this week, Bitcoin eclipsed various key trendlines, which had previously acted as support for months.\n\nThese included various moving averages (MA), among them the 200-week simple MA at $28,400 — the classic “bear market” support line.\n\n“A cluster of long-term simple moving averages of price are located around $28k, and have provided market resistance through September and October,” Glassnode noted.\n\n“After a month of the market grinding higher, the bulls found sufficient strength this week to convincingly break through the 111-day, 200-day, and 200-week averages.”\n\nBTC/USD annotated chart with moving average data (screenshot). Source: Glassnode\n\nIn so doing, the profitability of various investor cohorts improved considerably. The so-called cost basis of speculators and market newcomers also lies near $28,000.\n\n“The Short-Term Holder (STH) cost basis is also now in the rear view mirror at $28k, putting the average recent investor into an average profit of +20%,” “The Week On-Chain” continued.\n\nResearchers uploaded a chart of the short-term holder market-value-to-realized-value (STH-MVRV) ratio, which tracks the profitability of STH coins. They noted that even prior to the October upside, no major capitulatory behavior was visible.\n\n“We can see instances in 2021-22 where STH-MVRV reached relatively deep corrections of -20% or more,” they explained.\n\n“Whilst the August sell-off did reach a low of -10%, it is noteworthy how shallow this MVRV decline is by comparison, suggesting the recent correction found noteworthy support, being a precursor to this week’s rally.”\n\nBitcoin STH-MVRV annotated chart (screenshot). Source: Glassnode\n\nBitcoin “sets the foundation” for green year\n\nAs Cointelegraph reported, the presence of STH entities versus their seasoned counterparts, the long-term holders (LTHs), is now historically low.\n\nRelated: Bitcoin price model expects $45K ‘phase’ to hit in November\n\nDespite facing profitability issues of their own, LTHs now own more than three-quarters of the available BTC supply for the first time.\n\nTheir cost basis is lower, further toward $20,000 — and while some believe that Bitcoin could still return to that area, Glassnode is optimistic over how the year will end.\n\n“A meaningful proportion of supply and investors now find themselves above the average break-even price, located around $28k,” it concluded.\n\n“This sets the foundation for a resumption of the 2023 uptrend. At the very least, the market has crossed over several key levels where aggregate investor psychology is likely to be anchored, making the weeks that follow important to keep an eye on.”\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nPer data from on-chain monitoring resource CoinGlass, BTC/USD is currently up 26% this month — by October standards, still relatively modest.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tb3N0LXJlYWQtc3Rvcmllcy13ZWVrLWFydGh1ci0yMTE5MDQ4MjQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Oct 2023 07:00:00 GMT",
        "title": "Our Most Read Stories This Week: Arthur Hayes, Bitcoin ETF, New POL Token - Yahoo Finance",
        "content": "These are the top 10 most read stories on The Defiant during the week of Oct. 23:\n\nArthur Hayes Says BTC Is Rallying Over US Military Spending, Not ETF Hype Arthur Hayes, the co-founder of the BitMEX derivatives exchange, published an essay attributing the crypto market rally to the costs associated with hawkish U.S. foreign policy and not spot Bitcoin ETF anticipation.\n\nBlackRock Plans to Seed its Spot Bitcoin ETF in October Eric Balchunas, the Senior ETF Analyst for Bloomberg, pointed out on X an intriguing change in BlackRock's spot Bitcoin ETF amendment: The world's largest asset manager is planning to seed the fund this month.\n\nPolygon Deploys POL Token On Ethereum Polygon announced the news on Oct. 25, comprising a major milestone in the project’s ongoing “2.0” overhaul.\n\nBitcoin Surges To 17-Month High Amid Spot Bitcoin ETF Progress BTC is trading at its highest level since last May as researchers tip that the highly anticipated spot Bitcoin exchange-traded fund from the world’s largest asset manager, BlackRock, may be seeded this month.\n\nTeenage CEO Purchases ‘hello.app’ Web Domain for $115,000 Teenage founder & CEO Álvaro Pintado Santaularia has purchased the hello.app web domain for $115,000 – launching the world’s first decentralized storage network based on mobile devices, iPads and PCs.\n\nVodafone Partners With Chainlink To Demonstrate Blockchain’s Potential In Global Trade Telecom giant Vodafone’s Digital Asset Broker (DAB) revealed that it has conducted a proof of concept in collaboration with Chainlink Labs, Sumitomo Corporation, and InnoWave to alleviate issues pertaining to the global trade ecosystem.\n\nLayerZero Deploys stETH Bridge Without Approval From Lido Governance Lido, the top liquid staking provider, is fiercely debating whether to support cross-chain stETH transfers to Avalanche, BNB Chain, and Scroll via a new bridge deployed by LayerZero Labs.\n\nCelestia Prepares For Imminent Mainnet Launch Celestia, a project dedicated to building a modular blockchain ecosystem, is set to launch its Mainnet Beta in the coming days.\n\nFantom Launches Testnets For Sonic Upgrade, Estimates 6,700% Throughput Gain Fantom launched testnets for its upcoming revamped tech stack, Sonic, on Oct. 24, with the team claiming Sonic’s throughput will compete with major credit card companies and banks."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1wcmljZS1vdmVyaGVhdGVkLXBlcGUtbWVtZWNvaW4taW5kaWNhdG9yLWNyeXB0by10cmFkZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Is Bitcoin overheated? Some believe the answer is hiding in PEPE - Cointelegraph",
        "content": "Could Bitcoin (BTC) be headed for an imminent pullback? Some crypto market observers believe the answer could be hiding within the price action of a frog-themed memecoin.\n\nIn an Oct. 27 post on X (formerly Twitter), Onchain Capital co-founder and Crypto Banter host Ran Neuner suggested that memecoin Pepe (PEPE) is a strong indicator of overblown crypto market fever.\n\nIf you want to know when a pull back is coming, just watch $PEPE. It’s literally an index for when the market is getting overheated. When people are confident enough to go there and it pumps, that’s your sign to exit. Works every time. pic.twitter.com/vMcqiddHwp — Ran Neuner (@cryptomanran) October 26, 2023\n\n“If you want to know when a pull back is coming, just watch PEPE. It’s literally an index for when the market is getting overheated,” said Neuner.\n\n“When people are confident enough to go there and it pumps, that’s your sign to exit. Works every time.”\n\nPepe recently witnessed a more than 100% gain, growing from $0.00000064 on Oct. 20 to a peak of 0.00000134 on Oct. 27. Around the same time Pepe reached its peak, Bitcoin had already begun sliding downward from a recently attained yearly high.\n\nNeuner’s theory has been shared by other crypto traders in the past. On Sept. 23, trader Alex RTB told his 60,000 followers that he had begun using Pepe as a reliable metric for impending short-term declines.\n\nThis $PEPE pump is another indicator of upcoming #BTC dump.\n\n\n\nI am speaking with experience, you can check past price movements.\n\n\n\nPumping coins like $PEPE, $DOGE, $XRP, $IMX, $LINK always indicates the bloodbath, let's see how it goes this time. pic.twitter.com/piseCxRiqD — Alex RT₿ (@rutradebtc) September 22, 2023\n\nHowever, the theory also attracted its fair share of skeptics, who claim the data hasn’t always supported the theory.\n\nRelated: BTC price pullback after $35K? Bitcoin funding rates turn ‘grossly positive’\n\nDubai-based trader Reetika told Cointelegraph that Pepe’s recent uptick was largely driven by bullish news regarding changes in the team and the fact that it would be burning additional tokens and that it wasn’t necessarily a sign of broader overconfidence in the market.\n\n6.9T $PEPE Tokens worth ~$6,000,000 have been burned. https://t.co/aN5LRUFz8u\n\n\n\nA new team of advisors have been brought on to guide Pepe forward. Uses for the remaining 3.79T tokens attributed to the original team CEX multi-sig wallet for strategic partnerships and marketing… pic.twitter.com/JN3ssvH0XL — Pepe (@pepecoineth) October 24, 2023\n\nAs comparative data from TradingView shows, the price of Pepe is often tightly correlated with that of Bitcoin, which could make it challenging to use the memecoin as an indicator.\n\nComparative price action of PEPE vs. BTC since the inception of Pepe. Source: TradingView\n\nReetika, meanwhile, suggested looking at Solana’s SOL (SOL) as a potentially more reliable predictor.\n\n“SOL has been a very good leading indicator for the moves so far. It has broken out of resistances at least a day before BTC/ETH over this entire move. I’ve been using it actionably for estimating upside,” she said.\n\nReetika, however, clarified that SOL isn’t a perfect indicator either but had performed well on the most recent move.\n\nSimilarly, market commentator and avid crypto shitposter Poordart told Cointelegraph that Pepe probably isn’t the best metric from which to gauge the future price action of majors like Bitcoin.\n\nIn Poordarts’ view, Pepe is still far too new to the market to have any “real lasting value” as a reliable metric to gauge the price movements of Bitcoin with any significant accuracy.\n\nMagazine: Beyond crypto — Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJlYXRzLXNwNTAwLW9jdG9iZXItNDBrLWJ0Yy1wcmljZS1wcmVkaWN0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin beats S&P 500 in October as $40K BTC price predictions flow in - Cointelegraph",
        "content": "Bitcoin (BTC) surfed $34,000 at the Oct. 27 Wall Street open as attention turned to BTC price performance against macro assets.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin range faces weekly, monthly close\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD holding steady, preserving its early-week gains.\n\nThe largest cryptocurrency avoided significant volatility as the weekly and monthly closes — a key moment for the October uptrend — drew ever nearer.\n\n“I think Bitcoin will hang around this range for some time,” popular trader Daan Crypto Trades told X subscribers in one of several posts on Oct. 27.\n\n“Roughly $33-35K is what I’m looking at as a range. Eyes on potential sweeps of any of these levels for a quick trade.”\n\nBTC/USD annotated chart. Source: Daan Crypto Trades/X\n\nDaan nonetheless noted that open interest (OI) had recovered near levels last seen before the sudden uptick, which sent Bitcoin to 17-month highs. As Cointelegraph reported, open interest highs had formed a feature of BTC price “squeezes” during prior weeks.\n\n#Bitcoin Open Interest on Bybit has almost recovered to the level before the massive short squeeze this week.\n\n\n\nDuring that squeeze, we saw a 21% decrease in Open Interest on Bybit which was worth ~$450M pic.twitter.com/YbCM6XWZHW — Daan Crypto Trades (@DaanCrypto) October 27, 2023\n\nElsewhere, on-chain monitoring resource Material Indicators flagged a downside signal on one of its proprietary trading instruments.\n\nWith two such daily signals in place, Material Indicators said that only a move to $34,850 would “invalidate” the bearish implication.\n\n“That doesn’t mean we can’t go there before the Monthly candle close,” it reasoned in part of its X commentary.\n\nTrend Precognition continues to show the way.\n\n\n\nFor me, a move above $34,850 invalidates on the D chart. That doesn’t mean we can’t go there before the Monthly candle close.\n\n\n\nIf you want to get these #TradingSignals when they are actionable, subscribe.\n\n\n\nGet the tools. Gain the… pic.twitter.com/bpOomEv5Tq — Material Indicators (@MI_Algos) October 27, 2023\n\nAnalysis: “Plenty of fuel” to send BTC price to $40,000\n\nMore optimistic perspectives came from macroeconomic comparisons.\n\nRelated: Bitcoin restarting 2023 uptrend after 26% Uptober BTC price gains — Research\n\nPopular social media trader Kaleo noted that Bitcoin had outperformed the S&P 500 considerably since September, with the odds of continued BTC price upside still good as a result.\n\n“Over the course of the past month, we’ve finally seen ‘the bullish decoupling’ for BTC from equities that everyone was waiting for,” he wrote in part of Oct. 27’s commentary.\n\n“While BTC is up only 36% vs USD from the September lows, BTC is up 48% vs. SPX.”\n\nBTC/USD vs. S&P 500 annotated chart. Source: Kaleo/X\n\nAn accompanying chart showed BTC/USD versus the S&P 500, with key recent events in Bitcoin’s history marked. Kaleo argued that there was “plenty of fuel left in the tank for a move higher to $40K.”\n\nOthers focused on the significance of recent resistance levels being within days of flipping to weekly and monthly support.\n\n“Not sure how anyone could look at this Bitcoin chart objectively and conclude that breaking through $32k is no big deal,” crypto and macro analyst Matthew Hyland argued.\n\nHyland suggested that bears had few options left open.\n\n“The last line of hope for them is the weekly & monthly closing below,” he concluded.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLXByZWRpY3Rpb24tbmVhcmx5LTMtZHJvcC1yYWlzZXMtY29uY2VybnMtb2YtYWRkaXRpb25hbC1kb3dudHJlbmQuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price Prediction: Nearly 3% Drop Raises Concerns of Additional Downtrend - Cryptonews",
        "content": "Bitcoin Price Prediction: Nearly 3% Drop Raises Concerns of Additional Downtrend\n\nWith the recent dip in Bitcoin prices, there are concerns among investors about a further downtrend. The popular cryptocurrency saw a nearly 3% drop, leading some to believe that the market is entering a bearish phase.\n\nThis latest development has left many wondering about the future of Bitcoin and whether it can recover from this setback.\n\nIn this update, we’ll take a closer look at the recent dip in Bitcoin prices and provide insights into what it could mean for the cryptocurrency market as a whole.\n\nBinance Suspends Bitcoin Withdrawals for Second Time in 12 Hours\n\nBinance has once again temporarily stopped allowing BTC withdrawals, citing a significant backlog of outstanding withdrawal requests.\n\nEarlier on May 7, Binance had to briefly halt Bitcoin withdrawals due to an alleged overflow of transactions on the blockchain.\n\nOver half an hour later, withdrawals were once again permitted. However, on May 8, Binance reported again that it had temporarily closed BTC withdrawals due to the large volume of pending transactions.\n\nThere are 400,000 pending transactions on the bitcoin network and binance halted transactions due to the congestion and high fees\n\n\n\nI’ve been warning people of this for months and the righteous bitcoin maxis have kept their mouths shut because they can’t admit bitcoin has any… pic.twitter.com/jIopTRj7j8 — Crypto Tea (@CryptoTea_) May 7, 2023\n\nThere are reports of approximately 400,000 transactions waiting in the Bitcoin mempool for processing, and at the time of the second Binance withdrawal halt, the number of backlogged transactions in the mempool was around 485,000.\n\nBREAKING: #Binance outflow data confirms largest withdrawal in it's history, over 162,000 $BTC has left the exchange, valued at over $4.6 Billion.\n\n\n\nAre Whales/Insiders jumping ship? 👀 pic.twitter.com/QSXYAEvHkt — WhaleWire (@WhaleWire) May 7, 2023\n\nThe mempool serves as an area where transactions are kept at a “waiting” status before being verified by each blockchain node.\n\nThese transactions were worth more than $5 billion, and this caused Binance to halt BTC withdrawals for the second time in 12 hours.\n\n🚨 #BTC deposit and withdrawal services on #OKX are running fine. On chain transaction fee is currently high but our transactions are going through fine.\n\n\n\n💡Protip: If you want to save a few bucks, please use the lightning ⚡network. pic.twitter.com/VR2SUB6xXg — OKX (@okx) May 7, 2023\n\nOn the other hand, the cryptocurrency exchange OKX reported that despite the high transaction fees, its Bitcoin deposit and withdrawal services remained operational.\n\nHowever, the high volume of Bitcoin withdrawals added pressure on BTC/USD prices, causing them to fall below the $29,000 mark.\n\nLiechtenstein’s Prime Minister Advocates for Bitcoin as Payment Method for Government Services\n\nIn a recent interview, the Prime Minister of Liechtenstein, Daniel Risch, stated that he plans to introduce Bitcoin payments to its citizens, which could be implemented soon.\n\nHe went on to outline the European microstate’s plans to accept Bitcoin payments for government services.\n\nThe national currency of Switzerland, the Swiss franc, will then be promptly exchanged for Bitcoins.\n\nJUST IN: The Prime Minister of Liechtenstein has said he wants citizens to be able to pay for government services with Bitcoin.$BTC — Crypto Avanza (@AvanzaCrypto) May 7, 2023\n\nThe Swiss towns of Zug and Lugano have already adopted a similar strategy for Bitcoin payments. Local authorities there have taken steps to legalize Bitcoin payments for specific taxes and costs associated with providing public services.\n\nThis news helped to cap some of the losses in BTC/USD prices.\n\nMicroStrategy Continuously Increasing BTC Holdings for 11 Quarters\n\nThe publicly traded company, MicroStrategy, has benefited from the rise in Bitcoin’s value over the past few months, enabling it to report a net profit of $461 million in Q1.\n\nThe revenue from the software division was also higher than expected. Tax benefits from the company’s BTC holdings contributed to this growth.\n\nMicroStrategy’s share price has increased in the first few months of the year.\n\nOn January 1, MSTR stocks were valued at around $145; as of now, they are worth approximately $318, representing a 120% increase.\n\n🚨 MicroStrategy Increased its BTC Holdings for 11 Consecutive Quarters: MicroStrategy has purchased bitcoin each quarter ever since embracing the BTC strategy. ❤️＆🔁 #Bitcoin #Crypto #Nft https://t.co/agR4XalNod pic.twitter.com/KmYz6wkF3G — Realized_Gains (@REALIZEDGAIN5) May 7, 2023\n\nDespite the volatile nature of cryptocurrency and the bear market of last year, the business intelligence company has remained loyal to strengthening its BTC positions in recent years.\n\nThe quarterly report showed that the company has increased its BTC holdings for the 11th consecutive quarter.\n\nThis positive news also helped BTC/USD limit its losses for the day.\n\nRise in Popularity of Memecoin Leads to Multi-Year Highs in Bitcoin Transaction Costs\n\nBitcoin (BTC) transaction fees have reached a two-year high due to the increased trading activity of memecoins like Pepe.\n\nThis week, the total fees paid on the Bitcoin network increased by approximately 400% compared to late April, totaling about $3.5 million.\n\nMemecoin hype drives Bitcoin transaction fees to multi-year highs\n\n\n\nDespite the latest spike in Bitcoin transaction fees, the current BTC transaction cost is still far from all-time high levels.#Bitcoin #Altcoin pic.twitter.com/gy9MOwKhaq — Crypto Bernard Wong (@Wong_insight) May 5, 2023\n\nMemecoins have gained popularity in the cryptocurrency industry, and the BRC-20 token standard for Bitcoin has emerged as the latest development in response.\n\nThis standard has been used to create 8,500 distinct tokens.\n\nBitcoin Price\n\nBitcoin is currently experiencing a slightly bearish trend, trading at $28,978, which is mostly unchanged and has bounced off by 0.10%. The BTC/USD pair is building on its earlier daily gains and is moving towards the $30K mark.\n\nOn Monday, Bitcoin’s bearish trend pushed it below the $28,500 support level, and technical indicators like RSI and MACD signal a continued bearish bias.\n\nBitcoin Price Chart – Source: Tradingview\n\nBTC has failed to cross the 50-day exponential moving average, causing it to head toward the $28,000 support level. If it breaks below, it could target $27,700.\n\nDespite the oversold RSI, the breached trend line at $28,350 suggests that bearish momentum will likely continue.\n\nConsider a sell position below $28,500 with a target of $27,750. If Bitcoin crosses above $28,500, it could target $29,000 or $29,750.\n\nBuy BTC Now\n\nTop 15 Cryptocurrencies to Watch in 2023\n\nThe Cryptonews Industry Talk team has put together a list of the top 15 cryptocurrencies for 2023, each showcasing considerable growth potential in both the short and long term.\n\nDisclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.\n\nFind The Best Price to Buy/Sell Cryptocurrency"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXByaWNlLTQ1MDAwLXRhcmdldC_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vYml0Y29pbi1wcmljZS00NTAwMC10YXJnZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price Rally: Analyst Sets $45,000 Target And It’s Closer Than You Think - NewsBTC",
        "content": "Bitcoin rallied above $35,000 on the back of the euphoria of the possible approval of a Spot Bitcoin ETF. Although the rally seems to have cooled off, a particular crypto analyst’s prediction suggests that the bulls could enjoy total dominance soon enough in what will see the flagship cryptocurrency rise to $45,000.\n\nBitcoin’s Incoming Phase Could See It Hit $45,000\n\nIn a post shared on their X (formerly Twitter) platform, crypto analyst CryptoCon shared his prediction on Bitcoin’s future trajectory. The analyst mentioned that Bitcoin was currently at the “Mid-Cycle phase 4,” which happens to be the period where the crypto token is heading closer to the “Cycle Mid-Top,” which currently positions Bitcoin to rise above $45,000.\n\nCryptoCon’s prediction seems to be made based on the Fibonacci trading strategy, as evident in the accompanying chart, which he shared in his post. The chart breaks down Bitcoin’s historical price data into four cycles, namely: Cycle 1 (2010-2014), Cycle 2 (2015-2018), Cycle 3 (2019-2022), and Cycle 4 (2023-2026).\n\nSource: X\n\nThe Phases In These Cycles\n\nThese cycles are further divided into five phases, which CryptoCon seemed to focus more on. These phases include Phase 1 (Cycle Lows), Phase 2 (Transition from Cycle Lows), Phase 3 (First Move out of the Lows), Phase 4 (Transition to Cycle Mid-Top), and Phase 5 ( Cycle Mid-Top).\n\nCryptoCon noted that Bitcoin’s price usually hits phase 5 quickly once phase 2 is over (about two months after, according to the analyst), and if that is the case once again, then $45,000 could be soon. If that doesn’t happen, he foresees that Bitcoin could face resistance at the top of the transition, where it is currently priced at $36,368.\n\nAs to when all this could happen, he noted that October represents the first month after phase 2 ended. Therefore, the market could see the mid-top phase could happen as soon as November when Bitcoin will likely hit and rise above $45,000.\n\nInterestingly, CryptoCon’s prediction coincides with that of the crypto platform Matrixport, which estimates that Bitcoin could hit $45,000 between November this year and April 2024. In their report, Matrixport goes on to make a bolder claim that Bitcoin could hit $125,000 by December 2024.\n\nSource: Matrixport\n\nBitcoin Halving Or Institutional Adoption?\n\nDifferent crypto analysts have continued to make predictions about Bitcoin’s future trajectory even as the Bitcoin Halving draws nearer. Some of these analysts have credited the event as the catalyst that will spark the massive surge in Bitcoin’s price. Others believe that the launch of a Spot Bitcoin ETF alongside institutional adoption is what will make Bitcoin hit new highs.\n\nMeanwhile, some contemplate that the market may already be priced in as to any impending approval of a Spot Bitcoin ETF, as this is a classic case of “buy the rumor, sell the news.” If that is the case, many predict that we could see a decline when the ETFs launch due to massive sell-offs from traders and investors looking to realize their gains.\n\nBTC maintains above $34,000 | Source: BTCUSD on Tradingview.com\n\nFeatured image from Shutterstock, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vbmV3cy5ibG9vbWJlcmdsYXcuY29tL2xpdGlnYXRpb24vZ2VtaW5pLXN1ZXMtZ2VuZXNpcy1vdmVyLTEtNi1iaWxsaW9uLW9mLWJpdGNvaW4tdHJ1c3Qtc2hhcmVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Gemini Sues Genesis Over $1.6 Billion of Bitcoin Trust Shares - Bloomberg Law",
        "content": "Crypto platform <-bsp-bb-link state=\"{\"bbHref\":\"bbg://securities/1732972D%20US%20Equity\",\"_id\":\"0000018b-7198-db85-afab-7f984b7a0000\",\"_type\":\"0000016b-944a-dc2b-ab6b-d57ba1cc0000\"}\">Gemini Trust Co.-bsp-bb-link> is suing bankrupt crypto lender <-bsp-bb-link state=\"{\"bbHref\":\"bbg://securities/2221281D%20US%20Equity\",\"_id\":\"0000018b-7198-db85-afab-7f984b7a0001\",\"_type\":\"0000016b-944a-dc2b-ab6b-d57ba1cc0000\"}\">Genesis Global Holdco LLC-bsp-bb-link> in an attempt to determine who rightfully owns a slug of shares in the <-rte-company state=\"{\"_id\":\"0000018b-7198-db85-afab-7f984b7a0002\",\"_type\":\"00000160-4b23-d8bd-adfd-4b3348fd0000\"}\">Grayscale Bitcoin Trust-rte-company> now worth nearly $1.6 billion.\n\nIn a bankruptcy-court lawsuit filed Friday, Gemini asked a federal judge to find that Genesis has no right to more than 60 million GBTC shares promised as collateral to users of Gemini’s Earn product. The shares at issue — most of which are still held by Genesis or its affiliates — should not be used to repay other Genesis creditors, the company argues. ..."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8yMDM1MDYvZ2VtaW5pLWdlbmVzaXMtbGF3c3VpdC1ncmF5c2NhbGUtYml0Y29pbi1nYnRj0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzIwMzUwNi9nZW1pbmktZ2VuZXNpcy1sYXdzdWl0LWdyYXlzY2FsZS1iaXRjb2luLWdidGM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Gemini Sues Genesis for Control of $1.6 Billion in Grayscale Bitcoin Trust Shares - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGemini today sued digital asset lender Genesis over who rightfully owns $1.6 billion in Grayscale Bitcoin Trust shares.\n\nA Friday lawsuit filed in the U.S. Bankruptcy Court Southern District of New York shows that New York-based cryptocurrency exchange Gemini wants to regain control of the shares to pay back the clients of its Earn program.\n\nGemini and Genesis have been at war since last year because Genesis once served as a primary lending partner to the New York exchange for the Gemini Earn product. Gemini Earn allowed customers to get returns money on their crypto.\n\nAD\n\nAD\n\nBut following the collapse of mega crypto exchange FTX and the contagion that spread across the industry last year, Genesis suspended withdrawals, and Earn customers were left wondering what happened to their cash.\n\nGemini is trying to get the money back to satisfy its clients.\n\n\"Today, the Collateral is worth nearly $1.6 billion, an amount that would completely secure and satisfy the claims of every single Earn User,\" the Friday filing read.\n\n\"There is only one problem — Genesis,\" Gemini wrote in a blog post about the lawsuit. \"Genesis is the impediment to making the Earn Users whole. Genesis is seeking to take value away from Earn Users and funnel it to other creditor groups.\"\n\nGenesis is one of many companies run by crypto behemoth Digital Currency Group (DCG), which also controls the Grayscale Bitcoin Trust, the world's largest Bitcoin fund.\n\nAD\n\nAD\n\nGenesis Global went bankrupt in January, and last month announced it would cease all operations.\n\nEarlier this month, New York Attorney General’s office sued DCG, its subsidiary Genesis Global Capital, and crypto exchange Gemini Trust, alleging the companies defrauded customers of $1.1 billion.\n\nGemini Trust is a crypto company founded by crypto moguls Cameron and Tylyer Winklevoss.\n\nCameron Winklevoss has alleged that DCG boss Barry Silbert has engaged in \"bad faith stall tactics\" to delay a resolution.\n\nEditors note: This post was updated on Friday afternoon to add a statement from Gemini.\n\nEdited by Guillermo Jimenez."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0zNDAwMC1ldGhlcmV1bS1zbGlwcy1iZWxvdy0xODAwLW1vc3QtYWx0Y29pbnMtZG93bi00MDM1MDEtMjAyMy0xMC0yN9IBmQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vdG9rZW4vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4taG9sZHMtMzQwMDAtZXRoZXJldW0tc2xpcHMtYmVsb3ctMTgwMC1tb3N0LWFsdGNvaW5zLWRvd24tNDAzNTAxLTIwMjMtMTAtMjc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $34,000; Ethereum slips below $1,800; most altcoins down - Business Today",
        "content": "Bitcoin and other crypto took a breather on Friday ahead of the non-event weekend. However, the pause in the digital asset market was on the cards after a sizable rally in the last few days. However, analysts see the buying interest to remain in the digital asset market in the next few days.\n\n\n\nBitcoin saw some profit booking as the largest crypto token declined over a per cent but somehow managed to hold about 34,000-levels. However, its largest peer, Ethereum, was also seen in red, marginally lower, and remained below $1,800-level. Majority of the altcoins were trading with cuts.\n\n\n\nThe crypto market seems to be cooling off from its seven-day streak of rally. The crypto fear and greed index is also well within the greed zone with a score of 70/100, signalling bullish sentiments among crypto investors. The broader crypto market has reacted in sync and seems to be cooling off after the rally, said Parth Chaturvedi, Investments Lead at CoinSwitch Ventures.\n\n\n\n\"In other news, Deutsche Bank and Standard Chartered's SC Ventures are testing UDPN, a system that enables blockchain, stablecoins, and CBDCs to interact like SWIFT in traditional banking. UDPN bridges blockchains, incorporates digital identity standards and facilitates regulated transactions,\" he said.\n\n\n\nBarring a few exceptions, the majority of top crypto tokens were trading lower on Friday. Polkadot tumbled over 3 per cent, while Toncoin, Polygon, and Chainlink were down 2 per cent each. Among the gainers, Solana and BNB added about a per cent each, while Dogecoin was marginally up.\n\n\n\nThe global cryptocurrency market cap was trading significantly lower, falling down to $1.26 trillion-mark, as it declined more than a per cent in the last 24 hours. However, the total trading volumes dropped about 7 per cent to $46.88 billion.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by Giottus Crypto Platform\n\nEthereum (ETH) is currently attempting a rebound after failing to breach the $1,900 resistance yesterday. The asset is witnessing ascending momentum in mid-term due to positive sentiments across the wider market. It may continue to consolidate at $1,800 levels in the short term before testing the upper boundary.\n\n\n\nImage: Chart-ETH\n\n\n\nETH is currently trading well above its 100-day moving average of $1,700 which acts as an immediate support level. Its RSI reading is at 71, cruising in overbought territory. If ETH successfully breaks and holds through the $1,835 barrier, it may retest the $1,900 levels. This may depend on Bitcoin continuing to do well.\n\n\n\nMajor Levels:\n\nSupport: $1,700, $1,650\n\nResistance: $1,835, $1,900\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8td3JhcC1iaXRjb2luLXJhbGxpZXMtMTQtZXRoZXJldW0tdXAtMTEtYW1pZC1ldGYtb3B0aW1pc20tMTIzMTAyNzAwNjI2XzEuaHRtbNIBkAFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXdyYXAtYml0Y29pbi1yYWxsaWVzLTE0LWV0aGVyZXVtLXVwLTExLWFtaWQtZXRmLW9wdGltaXNtLTEyMzEwMjcwMDYyNl8xLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Crypto wrap: Bitcoin rallies 14%, Ethereum up 11% amid ETF optimism - Business Standard",
        "content": "Bitcoin has surged 14 per cent in the last seven days amid optimism around Bitcoin Exchange-Traded-Fund (ETF). On Tuesday, the largest cryptocurrency by market cap had touched its highest level since May 2022. On Friday, it was trading at $34,134, down from a peak of nearly $35,000, data from CoinMarketCap showed.\n\n\"The ETF anticipation is driving FOMO among investors who are flocking to Bitcoin as its market dominance grows to 2021 levels,\" said Rajagopal Menon, vice president at WazirX. Bitcoin's dominance was 53 per cent on Friday.\n\nSeveral investment firms, including BlackRock and Fidelity Investments, have pending applications for bitcoin ETFs in the US, and speculation on their likely approval was fuelled by BlacRock's iShares ETF listing on the website.\n\nA Bitcoin ETF is expected to make buying and selling Bitcoin easier through the stock market.\n\nA US federal appeals court on Monday also formalised a victory for Grayscale Investments LLC in its bid to create a spot Bitcoin ETF over objections from the US Securities and Exchange Commission. This led to market optimism.\n\n\"Remarkably, crypto as an asset class has been decoupling from other 'risk on' assets like equities, which corrected sharply due to the rising macro and geo-political instability,\" added Parth Chaturvedi, investments lead at CoinSwitch Venture.\n\nOn Friday, the market saw a sell-off but it was majorly due to profit booking. \"The crypto market is showing signs of cooling off after the mega rally in the past few days,\" said Shivam Thukral, chief executive officer (CEO) of BuyUcoin.\n\nWhat to expect?\n\n\"Bitcoin is moving up by taking support from the 20-day Simple Moving Average (SMA-D). However, it's still facing a challenge at the $35,000 level. If it successfully breaks through, it could reach the $39,000 to $40,000 range, with potential support around $31,000 to $32,000. For Ethereum, the $1,740 level may act as a support, and crossing $1,860 could push it toward $2,000,\" the crypto exchange CoinDCX research team said."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8yMDI4MDgvdHJlem9yLXNhZmUtMy1yZXZpZXctaGFyZHdhcmUtd2FsbGV0LWJpdGNvaW4tbmV3Y29tZXJz0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzIwMjgwOC90cmV6b3Itc2FmZS0zLXJldmlldy1oYXJkd2FyZS13YWxsZXQtYml0Y29pbi1uZXdjb21lcnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Trezor Safe 3 Review: A Hardware Wallet for Bitcoin Newcomers - Decrypt",
        "content": "In brief The Trezor Safe 3 is the latest hardware wallet from Trezor.\n\nIt's aimed at “new entrants” to the crypto space.\n\nIt's the first Trezor hardware wallet to feature a secure element.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA long-established name in the crypto space, Trezor's line of hardware wallets has provided users with a reliable, if unshowy, means of self-custodying their Bitcoin and other crypto assets.\n\nNow it's branching out, with the Trezor Safe 3—a hardware wallet that's explicitly courting newcomers with its slick design language and user-friendly UX.\n\nAD\n\nAD\n\nWill it be enough to win the wallet wars?\n\nWhat is the Trezor Safe 3?\n\nThe latest addition to the firm’s line of cryptocurrency hardware wallets, the Trezor Safe 3 is aimed at “new entrants” to the crypto space, according to its CEO Matěj Žák.\n\nThe idea is to provide a simple, secure solution for crypto holders to self-custody their assets—taking their crypto out of the hands of centralized exchanges, which have proved vulnerable to both hacks and alleged corporate malfeasance, putting user funds at risk.\n\nJust 2% of the world’s 420 million crypto users self-custody, Žák told Decrypt, so there’s definitely an opportunity—but is this latest iteration of Trezor’s hardware wallet enough to win them over?\n\nTrezor Safe 3: Design and Build\n\nThe Trezor Safe 3 comes in four colors. Image: Decrypt\n\nThe first wave of crypto hardware wallets were clunky, functional affairs, designed for die-hard early adopters who were prepared to overlook aesthetics and streamlined UX for the benefits of self-custody.\n\nTo broaden their appeal, wallet manufacturers like Trezor have taken design cues from mainstream consumer electronics (rival Ledger even enlisted the designer of Apple’s iPod for its forthcoming Stax device).\n\nAD\n\nAD\n\nWhile the Trezor Safe 3 follows the design cues of its stablemates, with a familiar shield-shaped design, screen, and button layout, the materials have had an upgrade.\n\nThe device sports a brushed aluminum back with the company's logo, in a variety of colorways that hark back to smartphones: silver, gold, rose gold, and “cosmos black.”\n\nThat aluminum finish isn’t quite as polished as the smartphones it mimics, though.\n\nThe review units sent to Decrypt were cut slightly roughly around the edges where they meet the plastic surround. The surround itself had a somewhat rough finish, too; all six of the supplied review units had what seemed to be flash marks or glue overspills that were noticeable when running a finger around the edge of the unit.\n\nIt’s a shame, as it lets down the premium consumer electronics feel that the company’s aiming for (Trezor has since clarified that the review units supplied to Decrypt were pre-production models, and that the finish on the final production models should be smoother).\n\nTrezor Safe 3 and Ledger Nano S Plus. Image: Decrypt\n\nAt 14g, it’s slightly less hefty in the hand than its nearest rival, the 21g Ledger Nano S Plus. The buttons have a satisfyingly clicky feel, too; more emphatic than those of the Ledger, while their placement next to each other means that you can depress both buttons with a single thumb click.\n\nThe Safe 3’s display is a simple monochrome affair, unlike the whizzy touchscreen on Trezor’s top-of-the-line Model T wallet. At 128 x 64 pixels, its screen resolution is identical to Ledger’s rival wallet—though slightly dimmer, when seen side by side.\n\nWithin Trezor Suite there’s an option to set a background wallpaper, though on the device’s tiny screen, the graphics aren’t much to look at.\n\nAD\n\nAD\n\nTrezor Safe 3: What’s in the box?\n\nBuilding on its consumer-friendly credentials, the Trezor Safe 3 comes packaged in a minimalist box in eco-friendly recycled packaging.\n\nTear off the shrink wrap and cardboard seal (the first line of crypto security) and a flap opens to reveal the contents: the Safe 3 itself, a USB-C cable, and a cardboard sleeve containing a quick start guide, two sheets for recording your recovery seed, and a collection of stickers if you want to advertise your crypto holdings to all and sundry.\n\nTrezor Safe 3 box contents. Image: Decrypt\n\nThe device itself sports a tamper-proof holographic security seal, to indicate that the device hasn’t been handled since it went into the box in the Trezor factory.\n\nThe overall impression is one of a quality mass-market consumer electronics device, akin to something from Samsung or Amazon.\n\nTrezor Safe 3: Getting started\n\nFirst things first, you’ll need to remove that holographic seal to reveal the Safe 3’s USB-C port. Next, you’ll need to plug it into your PC or Mac with the supplied USB-C cable (which, as ever, is too short—designed with laptop users in mind, rather than your reviewer’s desktop PC).\n\nTrezor Suite. Image: Trezor\n\nUpon plugging the Safe 3 in, you’re immediately greeted with an in-browser popup telling you to “go to trezor.io to connect”—a nice touch. Upon heading to https://trezor.io/start, you’re prompted to download the Trezor Suite management software to set up the device.\n\nUpon installing Trezor Suite, you’ll be invited to update the Safe 3’s firmware, before a check is performed to determine whether you have a legitimate Trezor device. A short tutorial follows to educate you on how the Trezor’s two-button user interface works.\n\nNext up, you’ll create a new wallet (or backup from a recovery seed)—you have the choice of a standard 12-word wallet or a more complex, but secure, Shamir backup, which creates several lists of words that have to be combined to recover the wallet.\n\nAD\n\nAD\n\nCuriously, upon creating a new wallet you’re given the option of skipping the backup phase entirely.\n\nWhile using your wallet without creating a backup will cause Trezor Suite to light up like a Christmas tree with warning messages, it’s curious that the option is even there; Ledger’s setup process forces you to check words from your seed phrase in order to proceed.\n\nTrezor Suite. Image: Trezor\n\nAssuming sense and reason haven’t deserted you, the next thing you’ll do is create your backup. This involves taking note of your 12-word seed phrase on your Safe 3, and then checking a selection of words off to ensure you’ve recorded it correctly. Trezor Suite helpfully warns you not to take a photo of your backup, create a digital copy of it, or share it with anyone.\n\nNext up, you’ll activate a selection of coins to show in Trezor Suite, before proceeding to the app proper.\n\nTrezor Safe 3: Trezor Suite\n\nTrezor Suite, a desktop app for Windows and Mac, is where the majority of the action happens; you’ll need to connect your Trezor with the supplied USB-C cable to access your holdings.\n\nTrezor Suite. Image: Trezor\n\nThe app is slickly designed, and intuitive. Once you’ve connected and unlocked your Safe 3, a dashboard shows your portfolio, supported assets, and a checklist of security features, including whether you’ve created a backup, PIN, and passphrase. A “Discreet mode” blurs balances and transactions from prying eyes, revealing them only on mouseover.\n\nYou can buy Bitcoin, Ethereum and other assets directly from the dashboard, with Trezor serving up a list of offers from different providers, listing fees, payment method and exactly how many sats you’ll be stacking with each option.\n\nAn accounts tab shows your crypto accounts in more detail; it’s here that you’ll send and receive crypto.\n\nAD\n\nAD\n\nClick “send” and a window pops up with address and amount details, which you’ll need to cross-reference on the Trezor device before signing the transaction. To receive crypto, you’ll reveal your wallet address and a QR code—which, again, you’ll check against that displayed on your Trezor device.\n\nTrezor Suite's \"discreet mode\" blurs balances and transactions. Image: Trezor\n\nA Trade button takes you to a screen where you can buy, sell, or swap your crypto—or even spend it using Bitrefill, which lets you purchase a selection of gift cards and phone refills.\n\nThere’s also an associated mobile app, Trezor Suite Lite, which lets you view account balances and receive crypto, after you’ve scanned your public key or received the address QR code in the main app.\n\nWallet features and assets\n\nOne of Trezor’s key USPs is the additional privacy features baked into Trezor Suite. The app includes native support for Tor, which relays your connection through a network of distributed servers for greater anonymity.\n\nTrezor Suite also supports Coinjoin for Bitcoin transactions. The privacy-enhancing technique enables multiple users to pool their Bitcoin inputs into a single transaction, and receive the same amount of Bitcoin output but with a different address.\n\nThe end result is that it’s more difficult to trace individual transactions back to their original sources, adding a much-needed layer of privacy to Bitcoin transactions.\n\nThe Trezor Safe 3 supports several hundred crypto assets, including Bitcoin, XRP, BNB, Litecoin, and Ethereum and ERC-20 tokens.\n\nThere are one or two omissions, though; if you want to interact with Cosmos tokens, for instance, you’ll have to look elsewhere.\n\nAD\n\nAD\n\nA limited-edition Bitcoin-only Trezor Safe 3 is available. Image: Decrypt\n\nA “Bitcoin-only” limited edition Trezor Safe 3 is also available, with variant packaging and a unique Bitcoin Orange finish (though technically speaking it’s possible to make any Safe 3 “Bitcoin-only” by changing the firmware in Trezor Suite).\n\nAs well as Trezor Suite, the Trezor Safe 3 can also be used with third-party software wallets including MetaMask, MyEtherWallet, MyCrypto, and Ronin.\n\nWallet security\n\nUnlike other Trezor hardware wallets, the Safe 3 includes a secure element, an isolated chip that stores a secret that can decrypt the device’s recovery seed. The Safe 3’s secure element is CC EAL 6+ certified, compared to the EAL 5+ certification found on its nearest rival, the Ledger Nano S Plus.\n\nIncorporating a secure element is a big change for Trezor, which has previously relied entirely on open-source hardware (unlike rival hardware wallet manufacturers), and the company is at pains to stress that the secure element doesn’t have access to your PIN or recovery seed itself.\n\nThe complete Trezor Safe 3 lineup. Image: Decrypt\n\nFurthermore, Trezor notes that its code remains open source, enabling the community of users to verify the integrity of its code and stress test it. And, it states, it has sourced its secure element chips from a producer that doesn’t prevent it from disclosing potential vulnerabilities.\n\nUpon first launching Trezor Suite, the software performs an integrity check on your Safe 3, to verify that it’s genuine Trezor hardware, while a “safety check” feature (which can be disabled) prevents the device from performing non-standard transactions, such as mismatching keys or enabling extreme fees.\n\nOne oddity, as mentioned above, is that the Trezor will let you set up and use the device without recording your backup recovery phrase. Although it flashes up warning messages until you record and verify your backup, in a device aimed at crypto newcomers it feels like this step should be mandatory, not an option.\n\nTrezor Safe 3: Verdict\n\nThe Trezor Safe 3 is a slick, well-designed piece of kit that almost (but not quite) matches the design and build standards of consumer electronics hardware like smartphones and tablets.\n\nAD\n\nAD\n\nWith an interface that’s about as user-friendly as hardware wallets can get, it’s a cost-effective way to self-custody for crypto newcomers and veterans alike—although it doesn’t offer access to quite as many tokens as its nearest rival, the Ledger Nano S Plus.\n\nCompared to the Ledger, the Safe 3’s higher level of security certification, as well as its additional privacy features, make for a compelling case—though security purists may prefer to eschew the single point of failure that a secure element represents, and take their chances with the Model T and Model One’s entirely open source hardware.\n\nEdited by Liam J. Kelly."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLWJ1bGwtcnVuLWNvbWluZy13aWxsLWJpdGNvaW5zLXByaWNlLWNvbnRpbnVlLXRvLWNsaW1iLWFuZC13aHktZGlkLWJpdGNvaW4tcHJpY2UtZ28tdXAtZGV0YWlsZWQtZ3VpZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Bull Run Coming? Will Bitcoin's price continue to climb and why did Bitcoin price go up - Detailed Guide - Analytics Insight",
        "content": "The cryptocurrency arena is abuzz with speculations, insights, and debates, particularly centering around Bitcoin and its potential price trajectory. As the crypto market sentiment leans towards a bullish tendency, the world is eager to discern if the leading cryptocurrency, Bitcoin, is poised for another bullish rally. In this comprehensive guide, we deep-dive into the intricacies surrounding Bitcoin’s recent price surge and examine what the future holds related to a possible Bitcoin Bull Run. Alongside Bitcoin, the nascent crypto token ApeMax, touted as the next game-changer, has been grabbing headlines. This article presents a panoramic view of the crypto landscape and crypto bull runs, making it a go-to resource for enthusiasts tracking Bitcoin, Ethereum, as well as popular altcoins and meme tokens prior to the next crypto bull market.\n\nTop Crypto Contenders As Potential Bull Run Approaches\n\nCrypto analysts and publications are meticulously monitoring the space to understand if a bull run is on the horizon. Below are several tokens that are gaining prominence amongst crypto fans before the next bull market:\n\nBitcoin: The pioneering crypto that epitomizes decentralized finance, Bitcoin remains a focal point in conversations, especially concerning possible future ETFs. ApeMax: A cutting-edge token with a distinct “Boost-to-Earn” protocol, ApeMax deftly integrates Web3 capabilities with a pioneering staking protocol. Ethereum: Renowned for its powerful blockchain capabilities for decentralized apps (DApps) and smart contracts use cases.. Shiba Inu: This meme coin, inspired by the Shiba Inu dog breed, has been a market sensation with an expanding ecosystem. Pepe Coin: This meme coin infuses the crypto world with its intriguing branding and has been the talk of the altcoin town. Solana: Recognized for its proficiency in hosting DApps and NFTs, its agility and efficiency are noteworthy.\n\nKey Predictors for an Impending Crypto Bull Run\n\nHovering over crypto analyst findings and opinions, it’s easy to notice some of the major discussion areas concerning a potential bullish market phase, which often include:\n\nBitcoin’s Anticipated Halving: Scheduled for April 2024, the next Bitcoin halving is eagerly awaited. Historically, such events have often preceded significant bull runs. In tandem with the buzz around Bitcoin ETFs, market conditions could potentially be set for a substantial upswing if the ideal circumstances come to pass.\n\nRise of New Crypto Tokens & DApps: New alternative cryptocurrencies or “altcoins” are emerging in 2023, including hot new presale Many altcoins are drawing attention from diverse crypto quarters.\n\nMeme Coin Momentum: 2023 has marked the ascent of meme coins, with Pepe Coin leading the charge, closely followed by exciting presale tokens like ApeMax. Onlookers are contemplating if we are on the brink of another meme coin era.\n\nShining a Light on ApeMax – Crypto’s Rising Star\n\nApeMax is creating waves in the crypto universe with its unparalleled “Boost-to-Earn” model, ushering in a decentralized staking protocol with a transparent rewards model. Seamlessly blending entertainment with functionality, ApeMax is innovating in the meme coin category.\n\n>> Dive Deeper on the ApeMax Official Website <<\n\nUnderstanding the Crypto Bull Market Phenomenon\n\nA crypto bull market symbolizes an interval when cryptocurrency valuations witness significant escalation, buoyed by heightened optimism. ApeMax, with its debut as the maiden boost-to-earn token, its accelerating presale, and its innovative boost-to-earn staking, is emerging as a focal point in this scenario.\n\nUnraveling the Nexus between Bitcoin Halving and Bull Markets\n\nAccording to some analysts, historical patterns illustrate a connection between Bitcoin halving episodes and ensuing bull markets. Occurring quadrennially, these halvings influence Bitcoin’s supply dynamics, in particular related to Bitcoin mining rewards. It’s vital to note that while past instances offer a reference point, they don’t assure future outcomes.\n\nInnovative Solutions Set to Catalyze the Next Bull Run\n\nTechnological breakthroughs, especially ZK rollups, might catalyze the forthcoming bull run by resolving scalability concerns. Enhancing transaction efficiency and optimizing networks, these solutions could make cryptocurrencies more apt for routine operations. Even meme tokens such as Shiba Inu have sought to reduce gas frictions by releasing their own scaling Layer 2 solutions, such as the new Shibarium.\n\nFinal Thoughts\n\nBefore venturing into the crypto world, meticulous independent research is imperative. This article doesn’t provide financial advice. Given the inherent volatility in the crypto sector, it’s essential to stay informed and to have a detailed understanding of the risks involved. To understand ApeMax better and to be apprised of any regional buying conditions, the official ApeMax website is the go-to resource.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    }
]